[
  {
    "url": "https://www.9news.com.au/national/student-loans-20-per-cent-cut-rolls-out/a2a81aa8-4a2e-4daf-9f1d-a06ddbaa9b1b",
    "title": "Billions of dollars of debt wiped from accounts of 100,000 Aussies",
    "publish_date": "Fri, 21 Nov 2025 22:38:32 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Billions of dollars of student debt have been wiped from the accounts of 100,000 Australians.\n\nThe Albanese government's pre-election promise to ease student loan debt passed ﻿parliament in August and has begun to roll out from today.\n\nAbout three million Australians will have ﻿a total of $16 billion of all student loans, including HELP, VET, apprenticeship support loans and student startup loans.\n\nEducation Minister Jason Clare said it was the \"biggest cut in student debt ever\". (Nine)\n\nThe first 100,000 people will see their debt slashed from today, with another three million to follow in the next fortnight. ﻿\n\nAustralians will receive a text message or email from the Australian Tax Office when the changes are automatically applied.\n\nEducation Minister Jason Clare said it was the \"biggest cut in student debt ever\".\n\n\"Today, 100,000 young Australians will get the best text message ever, telling them that their debts been cut by 20 per cent,\" he told Weekend Today .\n\n\"On average, that means about $5500 of debt wiped off their back.\n\n﻿\"That's a lot of help for young people, out of TAFE, just out of university, maybe they're just out of home. They're certainly just getting started in life.\"\n\nThe 20 per cent reduction will be calculated based on what the debt amount was on June 1, before indexation was applied.\n\n\"Sydney, Australia - August 17, 2012: Students and graduates converge on a lawn before the University of New South Wales (UNSW) library on a clear winter morning.\" (Getty)\n\nThe legislation also raised the minimum amount people have to make to start repaying their loans from $54,435 to $67,000 and reduced the minimum repayments.\n\nThese changes are in addition to the $3 billion cut from the indexation applied to student loans earlier this year after the government switched the index rate to be whichever is lower: the wage price index or the consumer price index. ﻿\n\nThe federal government earlier this month announced it will introduce a second round of 20 per cent cuts to student loan debt, totalling another $16 billion, by June 1 next year. ﻿\n\n\"I will always fight for every young Australian to have access to a good education,\" Prime Minister Anthony Albanese said in a statement at the time.\n\n﻿\"This will help everyone with student debt right now, whilst we work hard to deliver a better deal for every student in the years ahead.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/brisbane-somerville-house-education-minister-jason-clare-lashes-prestigious-school/060f3d04-02ec-43b9-8cc3-4741c064a108",
    "title": "Education minister calls out prestigious school over leaked document about students",
    "publish_date": "Sat, 22 Nov 2025 01:41:48 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "E﻿ducation Minister Jason Clare has criticised the failure of a prestigious girls school in Brisbane, after a leaked internal document showed teachers had commented on the appearance, behaviour and personalities of children.\n\nYear 11 students at ﻿Somerville House, a 126-year-old boarding and day school in South Brisbane, stumbled upon a spreadsheet and found teachers had made notes about them.\n\nParents were then asked to think of the teachers, with students blamed for sharing the document. ﻿\n\nSomerville House is a 126-year-old school in South Brisbane. (Jorge Branco)\n\nExams have been pushed back a day while the school investigates.\n\nClare said the school has failed in this instance. ﻿\n\n\"They've failed the students, and they've failed the parents of the kids who go to that school,\" he told Weekend Today.\n\n\"Schools have got to collect information, but they've got to do it in a secure way, and they've also got to do it in a professional way.\n\nEducation Minister Jason Clare said the school had failed. (Nine)\n\n\"And I don't those things has happened here.\"\n\n9news.com.au has contacted Somerville House for comment.﻿\n\nSomerville House was established in 1899 and is a prep to year 12 girls school taking day and boarding students.﻿\n\nFees start at $23,000 to more than $30,000 a year. ﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/one-nsw-council-wants-to-hike-rates-by-almost-40-percent-residents-say-it-will-break-them/7b22a7e7-eb25-4da6-8afd-15172229d2df",
    "title": "NSW council wants to hike rates by almost 40 percent",
    "publish_date": "Fri, 21 Nov 2025 23:44:24 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Some residents in the New South Wales Hunter Valley region could be paying up to thousands of dollars more for their council rates next year under a proposed hike.\n\nCessnock City Council said it plans to ask the Independent Pricing and Regulatory Tribunal (IPART) for permission to raise rates by 39.9 percent in the 2026-27 financial year.\n\nLocal councils need to be granted a \"special variation\" approval from IPART to increase rates above the yearly standard rate peg, the maximum percentage they can raise their general income. For Cessnock, the rate peg is 3.8 percent.\n\nCessnock City Council is proposing a rate rise of 39.9 percent for the next financial year. (iStock)\n\nThe permanent hike was necessary to maintain current council services and shore up the financial future of the council, which had a budget deficit of more than $8 million, the council wrote in a fact sheet distributed to residents.\n\n\"Quite simply, Council's required expenditure for staff, materials, and contracts exceeds its revenue,\" the council said, adding that the future financial viability of the council was at stake.\n\n\"If we don't get the SV (special variation) approved then to even attempt sustainability we would have to significantly reduce all maintenance expenditure and pause all new infrastructure work – even then, independent advice by several parties suggests that liquidity would not be assured.\"\n\nEarlier this year, Cessnock City Council engaged the University of Newcastle to conduct a review of its finances.\n\nThe resulting report found the council had been struggling financially for many years but had held off increasing rates above the standard rate peg. Delay was \"no longer an option\", the report said.\n\nResidents in the Cessnock shire say they won't be able to afford the proposed rate hike. (iStock)\n\nHowever, the proposed rate hike has angered many residents who say they will struggle to make ends meet if it goes ahead.\n\nAn online petition opposing the rate hike, started by Cessnock resident Mike Seale, has so far attracted 1500 signatures.\n\nSeale said he will be paying around $1040 more per year if the rate rise goes ahead.\n\n\"An extra $1000 will make a massive difference to me. I'm semi-retired, working three days a week,\" he said.\n\nSeale said some people would be hit even harder, as the rates are calculated according to property values and he only lived on a small block.\n\n\"Some people have told me they will be paying up to $4000 more per year because they have a bigger block, maybe an acreage,\" he said.\n\n\"There are a lot of families that have responded to me saying this is going to tip them over the edge. They don't know how they're going to make ends meet.\"\n\nStuart Battle is raising two foster kids on a rural property on the outskirts of Cessnock at Wollombi.\n\nHe said he simply wouldn't be able to afford the rate rise, which for him would amount to almost $2000.\n\n\"Money is tight as it is, let alone with a 39.9 percent increase. It's a struggle with groceries and everything like that. We're self-employed, so your wages don't go up that much,\" he said.\n\nAnother Cessnock resident, who wanted to remain anonymous, told 9news.com.au she feared she would end up homeless as a result of the rate rise.\n\n\"I am a single 62-year-old woman and I still have a very large mortgage,\" she said.\n\n\"I have had to take on a second job and at times I work over 50 hours a week.\n\n\"I have to work well past 70 to pay off my house and this proposed increase will break me.\n\n\"I don't want to sell my house and, as I can't afford anything else, I will end up homeless.\"\n\nThe council has calculated that the average residential household in Cessnock would pay about $600 extra in rates under the proposed hikes, while those living on farmland would pay an average of $1360 more and businesses $2070.\n\nIn its fact sheet sent to residents, council said it was very conscious of the hardship that the rate rise might cause and it would work to improve further on its current policy for those in financial distress.\n\nCessnock City Council will be conducting a survey and holding five community meetings over the next week to consult with residents about the proposed rate hike.\n\nAt a heated extraordinary council meeting last month, in which councillors voted to go ahead with community consultation about the council's application to IPART, independent councillor Jessica Jurd walked out after voicing her objection to the rate increase.\n\n\"I do not support this application due to the fact that I know residents are struggling at the moment,\" she said.\n\nThe council's independent Deputy Mayor Tracey Harrington said she was angry that previous councils had let the situation get so bad that they were now \"backed into a corner financially\".",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/ebike-australian-roads-kids-christmas-present-poll-exclusive/ef4bb595-8a6d-4d92-a3e2-12050895fdb2",
    "title": "Aussie kids expecting a free e-bike next month may be disappointed",
    "publish_date": "Fri, 21 Nov 2025 20:09:28 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: Most Australians are unwilling to buy an e-bike as a Christmas present for their children or young relatives, according to a nine.com.au reader poll.\n\nE-bikes have taken over Aussie streets this year, proving incredibly popular with school-aged kids and teenagers despite reports of injuries, deaths, and fires sparked by the ﻿lithium-ion batteries that power them.\n\nBut those hoping to unwrap a shining new e-bike on Christmas morning may be disappointed.﻿\n\nREAD MORE: Australia at risk of destructive weather not seen for a decade\n\nYoung Aussies are obsessed with e-bikes, but most adults are unwilling to give them as Christmas gifts. (Getty)\n\nOf the 476* readers﻿ surveyed, 86 per cent said they would not buy their own child or a child they knew an e-bike for Christmas.\n\nA further 11 per cent said their answer would depend on factors like the child's age.\n\n\"E-bikes are not for children they are too dangerous, there should be age restrictions on them,\" one told 9news.com.au.\n\nAnother called e-bikes ﻿dangerous \"missiles in the hands of immature and ill-equipped children\".\n\nOnly three per cent said they'd gift their child or a child they knew an e-bike.\n\nAnd most would be unwilling to spend more than $500 on it.\n\nOne in 10 ﻿said they would spend between $500 and $1000 on an e-bike, and just three per cent ﻿said they would spend more than $1000.\n\nBut even the cheapest e-bike models from popular brands like DiroDi ﻿and Fatboy Bikes cost more than $2000 and $3000 respectively.\n\nThe majority of nine.com.au readers confessed they were ﻿opposed to young Australians being able to own and ride e-bikes altogether.﻿\n\n\"I think the use of e-bikes should be restricted to those over the age of 16, fully regulated just like a motorbike, and only be allowed on the road,\" one said.\n\n\"Currently children are riding them at high speeds on shared footpaths with impunity and absolutely no regard for other pedestrians.\"\n\nREAD MORE: The troubling sunscreen data that will set off alarm bells\n\nAnother suggested children under the age of 16 should undergo a road rules test and e-bike handling course to ensure road safety before they're allowed to own an e-bike.\n\nSome voiced concerns about safety, reporting that they often see young riders on e-bikes without helmets, risking serious injuries.﻿\n\nMost nine.com.au readers said none of the children in their lives had asked for an e-bike for Christmas yet.﻿\n\nBut with the holidays weeks away, that could still change.\n\n*The nine.com.au poll, which runs once a fortnight, canvases the views of the Nine audience on 9Nation, which is an online community of our readers and viewers.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/bunnings-managing-director-michael-schneider-secrets-to-success/6d1e3cb9-0b2d-4c6d-a65d-2ca55cbf616d",
    "title": "Michael got a retail job when his career plans fizzled. Now he's Bunnings' top boss",
    "publish_date": "Fri, 21 Nov 2025 20:18:53 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\n﻿Bunnings managing director Michael Schneider originally wanted to be a marine biologist, but the university fees were too high and a scholarship was out of reach.\n\nThen he considered being a school teacher﻿ but that didn't suit him either, so he picked up a job in retail – and pretty much never looked back.\n\nNow he's the top boss at one of Australia's most popular brands, with Bunnings raking in $18.97 billion in revenue in 2024﻿ alone.\n\nThese are his secrets to success.﻿\n\nMichael Schneider originally wanted to be a marine biologist - now he's ﻿Bunnings' managing director. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nRetailers tend to be morning people - trading performance, inventory availability and the like tend to form our habits early.\n\nWhen I'm travelling, early starts are also good for exploring a city or taking in some exercise.\n\nAt home, it varies depending on the day.\n\nSometimes an early workout is great and occasionally a bit more sleep before coffee and a light breakfast can work a treat.\n\nWhat are three daily habits you always stick to?\n\nEvery day can look different for me, whether it's heading out to stores to hear from our team or looking at an exciting new product to roll out for our customers.\n\nNo matter what I'm doing, three daily habits I stick to are:\n\nKeep moving - avoid sitting, walking meetings are a great way to stay present and keep active. Get back to people quickly - it's polite, professional and keeps you engaged with team, customers and suppliers. Find time for a laugh - life is short, make every day count.\n\nREAD MORE: Influencer turned business owner reveals mistake jobseekers keep making\n\nBunnings raked in $18.97 billion in revenue in 2024﻿ alone. (Domain)\n\nLots of Aussies are looking for a career change. What small action can help them get ahead of other candidates?\n\nI'm someone who has made many pivots over the course of my career.\n\nFrom starting on the shop floor at Target, to studying teaching, working in financial services and then finding my way back to retail, each role has helped shape me as a teammate and leader.\n\nMy best career advice would be to take every opportunity to learn and grow, even if it means stepping outside of your comfort zone.\n\nBe proactive in asking questions, seeking feedback and don't be afraid to put your hand up for new roles or projects.\n\nSometimes just being curious and taking the smallest step can lead to the biggest change.\n\nWhat financial myth did you previously believe that you wish you never bought into?\n\nFor many of us starting out in our careers, there's the idea that financial success is about climbing the ladder quickly.\n\nOver time, I've learned that resilience and consistency matter more.\n\nDon't buy into the myth that there's a shortcut; steady progress and staying true to your values are what really counts.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat do you wish you could tell your 20-year-old self?\n\nI'd tell myself to not worry too much about the future as it will all work out.\n\nEvery experience, good and bad, shapes who you become as a leader.\n\nBe open to new opportunities and ideas, and build strong relationships and trust with others which will serve you well throughout your career.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/547m-sale-of-frida-kahlo-selfportrait-breaks-auction-record-for-female-artists-arts-world-news/302807e1-c297-4a05-9ae5-7638a88da7ed",
    "title": "$84.9 million sale of Frida Kahlo self-portrait breaks auction record for female artists",
    "publish_date": "Fri, 21 Nov 2025 05:55:12 +0000",
    "category": "entertainment",
    "authors": [
      "Nov"
    ],
    "text": "A haunting 1940 self-portrait by famed Mexican artist Frida Kahlo sold Thursday for USD $54.7 million (AUD $84.9 million) and became the top-selling work by any female artist at an auction.\n\nThe painting of Kahlo asleep in a bed - titled “El sueño (La cama)” or in English, “The Dream (The Bed)” - surpassed the record held by Georgia O’Keeffe’s “Jimson Weed/White Flower No. 1,\" which sold for USD $44.4 million (AUD $68.9 million) in 2014.\n\nThe sale at Sotheby's in New York also topped Kahlo's own auction record for a work by a Latin American artist.\n\nLIVE UPDATES: Tropical Cyclone Fina headed for NT coast\n\nA painting by Frida Kahlo titled \"El sueño (La cama)\" or (The Dream (The Bed), is displayed at Sotheby's auction rooms in London, Sept. 19, 2025. The painting, estimated at 40-60 million US dollars, is part of a collection of surrealist masterpieces unveiled ahead of its upcoming sale in New York. ((AP Photo/Kirsty Wigglesworth))\n\nThe 1949 painting “Diego and I,” depicting the artist and her husband, muralist Diego Rivera, went for USD $34.9 million (AUD 54.2 million) in 2021.\n\nHer paintings are reported to have sold privately for even more.\n\nThe self-portrait is among the few Kahlo pieces that have remained in private hands outside Mexico, where her body of work has been declared an artistic monument.\n\nHer works in both public and private collections within the country cannot be sold abroad or destroyed.\n\nThe painting comes from a private collection, whose owner has not been disclosed, and is legally eligible for international sale.\n\nSome art historians have scrutinised the sale for cultural reasons, while others have raised concern that the painting - last exhibited publicly in the late 1990s - could again disappear from public view after the auction.\n\nIt has already been requested for upcoming exhibitions in cities including New York, London and Brussels.\n\nThe buyer's identity was not disclosed.\n\nSelf portraits by artist Frida Kahlo, titled from left, \"Self Portrait with Braids\", 1941, \"Self Portrait with Monkeys\", 1943, and \"Self Portrait with Small Monkey\", 1945, are displayed as part of the exhibition \"Frida & Diego: Passion Politics and Painting\", at the High Museum in Atlanta, Feb. 8, 2013. (AP Photo/David Goldman, File) (AP)\n\nThe piece depicts Kahlo asleep in a wooden, colonial-style bed that floats in the clouds.\n\nShe is draped in a golden blanket and entangled in crawling vines and leaves.\n\nAbove the bed lies a skeleton figure wrapped in dynamite.\n\nKahlo vibrantly and unsparingly depicted herself and events from her life, which was upended by a bus accident at 18.\n\nShe started to paint while bedridden, underwent a series of painful surgeries on her damaged spine and pelvis, then wore casts until her death in 1954 at age 47.\n\nDuring the years Kahlo was confined to her bed, she came to view it as a bridge between worlds as she explored her mortality.\n\nBefore the auction, her great-niece, Mara Romeo Kahlo, celebrated the significance of the upcoming sale during a recent interview with The Associated Press in Mexico City.\n\n“I'm very proud that she's one of the most valued women, because really, what woman doesn't identify with Frida, or what person doesn't?\" she said.\n\n\"I think everyone carries a little piece of my aunt in their heart.”\n\nA portrait of Frida Kahlo by Mexican photographer Wallace Marly is displayed in the new museum Casa Kahlo in Mexico City, Sept. 10, 2025. (AP Photo/Eduardo Verdugo) (AP)\n\nThe painting was the star of a sale of more than 100 surrealist works by artists including Salvador Dalí, René Magritte, Max Ernst and Dorothea Tanning.\n\nKahlo resisted being labeled a surrealist, a style of art that's dreamlike and centres on a fascination with the unconscious mind.\n\n“I never painted dreams,” she once said. “I painted my own reality.”\n\nIn its catalog note, Sotheby’s said the painting “offers a spectral meditation on the porous boundary between sleep and death.”\n\n“The suspended skeleton is often interpreted as a visualization of her anxiety about dying in her sleep, a fear all too plausible for an artist whose daily existence was shaped by chronic pain and past trauma,” the catalog notes.\n\nEarlier this week, a Gustav Klimt painting that helped save the life of its Jewish subject during the Holocaust sold at Sotheby's for USD $236.4 million (AUD $366.9 million).\n\nKlimt’s “Portrait of Elisabeth Lederer” became one of the most expensive pieces of artwork ever sold at auction, second only to Leonardo da Vinci's “Salvator Mundi” at USD $450 million ($698.4 million) the record-holder over all and among male artists.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/older-mums-australia-two-women-who-had-children-into-their-40s-reveal-experience-exclusive/6d9f8647-df79-4c96-8bf6-5ea25e459350",
    "title": "Liz and Julie didn't plan on giving birth in their late 40s. They say it made them better mums",
    "publish_date": "Thu, 20 Nov 2025 18:47:33 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "T﻿he road to motherhood can be equally joyful and terrifying, and more often than not, entirely unpredictable.\n\nThe median age of a first-time mother﻿ has crept up to 32.1 years in Australia for 2024 – up from 29.8 in 2000.\n\nAustralian mums ﻿Liz Walton and Julie Sweet are outliers of this rising figure after giving birth to their first child in their late 40s.\n\nLiz Walton and her daughter. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nBecoming a mother while some women the same age entered menopause wasn't something they planned.\n\nBut both told nine.com.au an extra decade or so of life experience has only made them better parents.\n\nCanberra fertility coach Walton, 55, ﻿began trying for a baby 10 years before she fell pregnant after meeting her partner.\n\n\"Already being a little older, it was like 'We're gonna start trying to have a baby as soon as we can',\" Walton said.\n\n\"Basically, a lot of our trying was in vain.\n\n\"And that's when we started to realise there must be an issue.\"\n\nThe couple went through six traumatic rounds of IVF without any success.\n\nWalton said she \"gave up\" on her dream of motherhood at around age 43.\n\n﻿\"At that age, they say your egg quality goes down and then also your chances to get pregnant really plummet,\" she recalled.\n\n\"Then I sort of spent a good 18 months working on myself to find happiness and peace.\"\n\nTwo years later, Walton fell pregnant naturally at the age of 45.\n\nShe admitted it was difficult to feel elated﻿ at first.\n\nWalton said becoming an older mum has helped enrich her parenting. Pictured with her daughter and partner. (Supplied)\n\n\"I remember going back home and dropping to my knees thinking... how do I deal with this?\" Walton said.\n\nPregnancy and childbirth a few years shy of 50 had its setbacks.\n\nWalton said she feared losing her unborn child and knew there would be some difficult times that lay ahead.﻿\n\n\"Having a baby at 46... I understand why it is a younger person's game, because it's quite traumatic to the body giving birth,\" she explained.\n\n\"I wasn't allowed to do a home birth because of my age.\"\n\nThe medical anxiety was coupled with thoughts which made her question herself.\n\n\"Is this right? Am I being fair?﻿\" Walton said.\n\n\"Part of me was thinking, 'Oh, my goodness, when she's 10, I'll be 56. What will that be like?'\"\n\nNow at 55 with a nine-year-old daughter, Walton knows exactly what it is like.\n\nAnd she said her age ﻿has only enriched her parenting.\n\n\"﻿I became a happier, balanced, emotionally stable human being,\" Walton said.\n\n\"And that's why I say, when the student is ready, the teacher arrives.\"\n\nSeaway Counselling and Psychotherapy's Julie Sweet. (Supplied)\n\nSweet﻿ was nearly 48 when she welcomed her son after falling pregnant on her ninth round of IVF.\n\n\"It was surreal, overwhelming, and honestly quite shocking,\" she recalled.\n\nThe Bondi clinical psychotherapist told nine.com.au ﻿she endured some medical professionals who \"lacked compassion\" along the way.\n\nBut she described later motherhood﻿ as a gift.\n\n\"I've lived a life. I feel ready. I'm my most grounded, fulfilled, nourished, and happiest self (even if I'm turning 51 next year),\" Sweet said.\n\n\"I never experienced this in my 20s or 30s.\n\n\"Only with age – and the perspective that comes with lived experience, have I gained clarity about what truly matters, where my energy needs to go, and who deserves it.\n\n\"I trust myself more. My inner world feels more stable. My gratitude is deeper.\"\n\nSweet said she believes there is a cultural shift away from the nuclear version of motherhood.\n\nThrough her work, she﻿ is seeing more women choose to delay having children to their late 30s and 40s.\n\n\"Women are realising that traditional expectations – about age, career, and family - don't need to dictate their choices,\" Sweet added.\n\n\"From a therapeutic perspective, this shift is meaningful for mental health. Choosing to become a parent later often brings greater self-awareness, emotional resilience, and clarity of values, which can positively influence parenting and family dynamics.\n\n\"Of course, older parents may face unique anxieties – around energy, health, or longevity, yet these are often balanced by a profound sense of readiness and life experience.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/when-adam-applied-for-an-entrylevel-job-he-found-himself-competing-against-6500-others/9c98f007-c2e2-4894-94de-7e2412065151",
    "title": "When Adam applied for an entry-level job, he found himself up against 6600 others",
    "publish_date": "Thu, 20 Nov 2025 18:45:51 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Exclusive: To Queenslander Adam Kertesz, landing a job has started to feel like winning the lottery, especially when you're up against thousands of applicants for some positions.\n\nFor the past 18 months, Kertesz says he has applied for more than 300 jobs - many of them entry-level - without success.\n\nKertesz, 31, has experience in the hospitality industry, having worked in a five-star hotel in London and at the Gabba cricket ground in Brisbane.\n\nAdam Kertesz said all he wanted to do was work, but for 18 months he hasn't been able to get a job. (Supplied)\n\nHe holds a Bachelor of International Relations and Public Policy from the University of Queensland and a TAFE Diploma of Travel and Tourism Management.\n\nHe is also about to graduate with a TAFE Diploma in Travel and Tourism.\n\nYet even these qualifications have not been enough to secure him a job, Kertesz told 9news.com.au.\n\n\"It's absolutely ridiculous and it's scary,\" he said.\n\n\"I'm a week away from finishing a diploma of travel and tourism and I'm looking for any employment that is available.\"\n\nA casual job unloading containers at a Brisbane port last month received 6600 applications. (Supplied)\n\nKertesz said the hospitality jobs he was applying for regularly had hundreds of applicants, and entry-level jobs, which appealed to a broad range of people from different backgrounds, often got thousands of applications.\n\nLast month, Kertesz applied for a casual job with the Port of Brisbane, unloading containers at $38 per hour, with no experience necessary.\n\nHe said he was dismayed when he saw the number of people who had applied - 6600.\n\n\"When you don't have any money to your name, all you want to do is work,\" he said.\n\n\"But how are you going to get a job when there are thousands of people ahead of you?\"﻿\n\nHaving spent several years teaching English overseas, Kertesz returned to Australia in 2023 and said he had been applying steadily for jobs ever since.\n\nHowever, he never expected it to be so hard.\n\n\"The government say they've created jobs, and they probably have. But they don't understand how hard it is to obtain employment in Australia,\" he said.\n\n\"It's very, very difficult - it's become like winning the lottery.\"\n\nKertesz said he was often being told he did not have enough experience for a job, or he was too old.\n\n\"I've applied for well over 300 jobs (online). I've gone out and pounded the pavement, and I'm getting told you need experience, or they want younger people,\" he said.\n\nKertesz said he had also applied for jobs at Woolworths and Aldi supermarkets.\n\nHe recently had a job interview with Woolworths, which was conducted by an AI bot, a trend previously reported on by nine.com.au .\n\nHis application was unsuccessful.\n\n\"Some companies give you a first interview, but the interview is with a robot,\" he said.\n\n\"It's absolutely ridiculous. How can a robot determine if you'll be good at the job or not?\"\n\nAside from the Woolworths AI interview, he had only received one other offer of an interview during his current job search, Kertesz said.\n\n\"I dressed up and everything for the interview, and I got to the building about 20 minutes early, and then they called me, saying that they are sorry, they had changed their minds and already filled the position.\"\n\nUnemployed out of work for longer, report finds\n\nKertesz's experience comes as a new report was released from Anglicare yesterday, highlighting the grim reality jobseekers face while searching for entry-level positions which are disappearing.\n\nAnglicare Australia's Jobs Availability Snapshot 2025 found that the chances of job seekers finding entry-level work were so low that \"even the most determined will be left behind\".\n\nThe report compared the number of people receiving JobSeeker payments with the number of entry-level positions advertised in August this year.\n\nIt found that for every entry-level vacancy, there were 39 job seekers, up from last year's figure of 35.\n\nChambers said the findings show the need for urgent reform to the welfare system.\n\n\"All of this shows that people are being failed by a system that treats unemployment as a personal fault instead of a policy failure,\" she said.\n\n\"Taxpayers are spending billions of dollars on private employment providers whose business model depends on compliance and punishment.\n\n\"They profit whether or not people find work.\n\n\"Meanwhile, people are stuck in endless appointments and meaningless activities — all while competing for jobs that simply aren't there.\"\n\nThis month, Australia's unemployment rate was sitting at 4.3 per cent in October, according to the Australian Bureau of Statistics.\n\nThat figure is down from 4.5 per cent in September.\n\nAustralia's unemployment rate hit a record low of 3.2 per cent in October 2022 and has been slowly climbing since then.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/ashes-test-live-australia-england-perth-stadium/106040490",
    "title": "Live: One Australian wicket left as bowlers prepare to take the field again",
    "publish_date": "Sat, 22 Nov 2025 01:49:22 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva",
      "Jon Healy"
    ],
    "text": "(AP)\n\nWell, I didn't expect to be saying this before play on day two of the Ashes, but we're just about set for the third innings of this match.\n\nAfter a frankly ridiculous 19 wickets fell on day one, England needs just one more to put Australia back into the field and resume batting to try and post a hefty total for the hosts to chase.\n\nThe game has moved at an almighty pace thus far, so there's no rush, but I wouldn't expect the English batters to calm down too much. It's not really their go. So expect more fireworks today.\n\nMe, Simon Smale, Chris De Silva and Dean Bilton are all back in the saddle for today's action, so stick with us and send us all your takes.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/mexicos-bullied-pageant-contestant-wins-miss-universe/106040322",
    "title": "Mexico's bullied pageant contestant gets payback by being crowned Miss Universe",
    "publish_date": "Sat, 22 Nov 2025 01:14:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Fátima Bosch Fernández of Mexico has been crowned Miss Universe 2025, a dramatic victory for a 25-year-old at the centre of the turbulent 74th staging of the popular beauty pageant in Bangkok who stood up to public bullying from one of the hosts.\n\nThe issues at this year's event sprang from a sharp-tongued scolding of Ms Bosch, which sparked a controversy marked by a walkout, feminist solidarity and a teary, melodramatic apology from the local organiser who set it all off.\n\nWhen Ms Bosch was announced as the winner, cheers and screams erupted from the audience, with Mexican flags waved by elated supporters.\n\nFátima Bosch Fernández says she hopes to be remembered as someone who changed \"the prototype of what is a Miss Universe\". (Reuters: Chalinee Thirasupa)\n\nSpeaking to the media after her victory, Ms Bosch said she would like to be remembered as \"a person that changed a little bit the prototype of what is a Miss Universe and a real person that gives the heart\".\n\nShe also paid tribute to the pageant, describing it as \"a platform that is strong because they have the space that women are searching to have a voice\".\n\nThe first runner-up was 29-year old Praveenar Singh of Thailand and 25-year-old Stephany Adriana Abasali Nasser of Venezuela placed third.\n\nRounding up the finishers were Ahtisa Manalo, 28, of the Philippines, and 27-year-old Olivia Yacé of Ivory Coast who came fifth.\n\nMiss Venezuela and Miss Thailand rounded out the top three. (Reuters: Chalinee Thirasupa)\n\nAt the livestreamed sashing ceremony for the more than 100 contestants on November 4, Thai national director Nawat Itsaragrisil hectored Bosch for allegedly not following his guidelines for taking part in local promotional activities.\n\nHe called security when she spoke up to defend herself.\n\nMs Bosch walked out of the room, joined by several others in a show of solidarity, including Miss Universe 2024, Victoria Kjær Theilvig of Denmark.\n\n\"What your director did is not respectful: He called me dumb,\" an unbowed Ms Bosch told Thai reporters.\n\n\" If it takes away your dignity, you need to go. \"\n\nSeveral other contestants joined Fátima Bosch Fernández during her walkout in a show of solidarity. (Reuters: Chalinee Thirasupa)\n\nMr Nawat insisted that he did not call her \"dumb.\"\n\nThe Miss Universe Organisation president, Mexican businessman Raúl Rocha Cantú, released a statement condemning Mr Nawat's conduct as \"public aggression\" and \"serious abuse\".\n\nEven Mexico's first woman president, Claudia Sheinbaum, piled on, saying at a news conference that she wanted to give \"recognition\" to Miss Mexico for voicing her disagreement in a \"dignified\" way.\n\n\"It seems to me that it is an example of how women should raise our voices,\" Ms Sheinbaum said.\n\nMs Sheinbaum recalled being told in the past that \"women look more beautiful when they keep quiet\".\n\n\"We women look more beautiful when we raise our voice and participate, because that has to do with the recognition of our rights,\" she said.\n\nThe organiser that sparked the controversy later apologised to eventual winner Fátima Bosch Fernández. (Reuters: Chalinee Thirasupa)\n\nMr Nawat later apologised for his actions, appearing both tearful and defiant at the same time.\n\n\"If anyone [was] affected and not comfortable it happened, I am so sorry,\" he said in front of the contestants.\n\nHe then turned to them and said \"It's passed. OK? Are you happy?\"\n\nMs Bosch's official Miss Universe biography says she studied fashion in Mexico and Italy and has focused on creating sustainable designs and working with discarded materials.\n\nMiss Universe Fiji scandal erupts The Miss Universe Fiji voting drama has seen accusations of racism, vote-rigging, conflicts of interest and \"conspiracy theories\". But in Fiji, the saga is triggering a different kind of response.\n\nIt says she has volunteered with sick children, promoted environmental awareness and engaged in support for migrants and mental health issues.\n\nThis year's competition also saw a report that two judges had quit, with one of them suggesting that there was an element of rigging to the contest. The allegation was denied.\n\nSeparately, Thai police investigated the alleged illegal promotion of online casinos as part of the event's publicity.\n\nMishaps and controversies are not rare for the pageant.\n\nThe 2021 event attracted criticism because it was held in Israel, to the dismay of supporters of the Palestinian cause.\n\nAn example of a minor misstep — literally — occurred Wednesday when Miss Universe Jamaica, Gabrielle Henry, fell off the stage during the evening gown competition. She was not badly hurt.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/port-hedland-dust-buyback-scheme-to-close-in-weeks/106032006",
    "title": "Dust buyback scheme in mining town set to close as some residents refuse to leave",
    "publish_date": "Sat, 22 Nov 2025 00:00:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "The West Australian government has put a deadline on a voluntary buyback scheme for residents in a Pilbara suburb covered in iron ore dust.\n\nThe scheme was established in 2021 in response to a dust management report.\n\nDust levels have long been an issue in the town, which is the site of the world's largest bulk exports port.\n\nThe buyback scheme was only supposed to run for two years, but was extended in the hope more people would sell their homes.\n\nThe WA government expects 80 per cent of West End properties will be bought back by the scheme's closure. (ABC News: Jesmine Cheong)\n\nThe state government is hailing the scheme as a \"success\", with almost 80 per cent of the houses in the West End to be purchased or in progress by the end of 2025.\n\nBut for those who have called the West End home for decades, it is anything but.\n\nVacant houses in housing crisis\n\nThe state government said 299 properties had been bought back, with 105 properties remaining.\n\nTina Scott bought her home during the bust period and has decided not to sell.\n\n\"We don't want to be paying rent $1,000 a week in South Hedland, and leave Port Hedland.\"\n\nTina Scott says houses in good condition should be used for emergency services staff. (ABC Pilbara: Kelsey Reid)\n\nShe said many properties now sat vacant in the West End amid a housing crisis.\n\n\"We've got hundreds of essential services [staff] that can't get housing, but they've got hundreds of houses sitting there empty. I would hardly call that a success.\"\n\nThe scheme offers home owners a price based on 2019 property prices with indexation and a 35 per cent premium.\n\nBut Ms Scott said that was unaffordable for many who purchased during the boom.\n\nNo plans to leave\n\nReal estate agent Morag Lowe, a West End resident of 20 years, said no offer could convince her to move.\n\n\"It's not based on finance, it's based on suitability really,\" she said.\n\n\"I think the advantages [to staying], in honesty, outweigh the disadvantages.\"\n\nRegular dust maintenance on houses is required in the town. (ABC: Alex Hyman)\n\nMs Lowe said the dust was part of daily life, with regular de-clogging of windscreen wipers and home maintenance, but it was only an inconvenience.\n\nThe port that swallowed a town Profits from iron ore line the pockets of Australia's biggest miners and are vital to treasury coffers. The fallout from increased exports is a thick layer of dust that covers everything.\n\nThe Port of Port Hedland is the world's largest bulk export port, exporting more than 500 million tonnes of material every year, primarily iron ore.\n\nThe port and its supply chain employ nearly three quarters of Port Hedland's residents, according to a 2024 ACIL Allen report.\n\n\"If the dust wasn't here, we wouldn't be here,\" Ms Lowe said.\n\nHedland Maritime Initiative (HMI), a subsidiary company of Pilbara Ports, has been acquiring properties under the scheme and plans to create a maritime precinct.\n\nThe land in the West End has been rezoned so no new homes can be built.\n\n\"If they don't sell to the government by the end of the year, who are you going to sell to in the future?\" Ms Lowe said.\n\nShe said it would be hard to know the value of residential property in the West End in the future.\n\nA thick coat of dust is commonplace in Port Hedland. (ABC News: Mietta Adams)\n\nMeanwhile, Ms Scott said she would like to see clearer plans about the future redevelopment of the area.\n\n\"Nothing has really happened — they've bought all these properties, they've done a clean-up, but what's going to happen?\" she said.\n\nFinal push from government\n\nWA Minister for Regional Development Stephen Dawson said the scheme would have a settlement period until the end of March 2026.\n\nHe said the West End would then be redeveloped for non-residential activities under the Port Hedland West End Improvement Scheme.\n\nThe government says it will now redevelop the West End precinct for non-residential activites. (ABC: Chris Lewis)\n\n\"Longer term, we would still like to see everybody move out of the West End but people have made a decision to stay, they're not willing to sell their property, so they will remain as residents.\"\n\nHMI will continue to manage the final acquisitions and ongoing maintenance of the acquired properties.\n\n\n\nIn a later statement provided to the ABC, Mr Dawson said the majority of houses under the scheme were still occupied, with some approved as use for short-stay accommodation, while a \"small number\" were \"not suitable for occupancy\" and were vacant.\n\nBut, the government expects more housing to gradually come onto the market, which will see occupancy of houses covered by the scheme fall.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/sport-minjee-lee-in-contention-at-tour-championship/106040262",
    "title": "Three-time major winner Lee stays in contention at Tour Championship",
    "publish_date": "Fri, 21 Nov 2025 23:51:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "Minjee Lee has climbed the leaderboard to remain in the mix for the biggest cheque in women's golf's history.\n\nLee's 5-under-par 67 in the second round vaulted Australia's world number four into a tie for fifth at the halfway point of the $17 million Tour Championship in Naples, Florida.\n\nShe is five shots off the pace, with world number one and defending champion Jeeno Thitikul firing a dazzling 9-under 63 to seize a commanding three-shot lead over South Korean Sei Young Kim.\n\nThai Thitikul won last year's Tour Championship with a 22-under total and remains on track to eclipse that score.\n\nSurging to 14-under, Thitikul was bogey free on Saturday AEDT after being three shots behind Somi Lee following the first round.\n\nKim, the 2019 winner, is again in the hunt for a second season-ending championship after moving to 11-under with a second-round 66.\n\nSouth Korean's Lee (69) and Japan's Nasa Hataoka (67) share third place a further shot back at 10-under.\n\nOn a star-studded leaderboard, Australia's Lee is tied at 9-under with US world number two Nelly Korda (64), Canadian Brooke Henderson (67) and Thailand's Pajaree Anannarukarn (67).\n\nThree-time major winner Lee was only a shot back after negotiating the front nine in 4-under.\n\nBut she could only manage one more birdie on the back nine in an otherwise blemish-free round.\n\n\"I had a pretty nice start,\" Lee said.\n\n\"Four birdies on the front and then one birdie on the back. But I feel like I'm going pretty steady out there. For the most part it was pretty solid.\n\n\"Just going to try and clean up my shots a little bit and hope for a really great weekend.\"\n\nLee looks like Australia's only weekend contender after Grace Kim and Steph Kyriacou both fell off the pace with even-par rounds of 72.\n\nKim and Kyriacou both started round two tied with Lee in seventh spot at 4-under but have slumped to joint 27th place on the leaderboard.\n\nAt 3-over following a second-round 71, fellow Australian Hannah Green is last in the 60-player field.\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/deli-meats-recalled-over-listeria-cotamination-risk/106040268",
    "title": "Recall notice issued for deli meats over listeria contamination risk",
    "publish_date": "Fri, 21 Nov 2025 23:46:54 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Multiple deli meat products sold in two Australian states have been recalled over fears of possible listeria contamination.\n\nThe five recalled products from Götzinger Smallgoods, including sliced ham and roast beef, were possibly sold by retailers in Queensland and New South Wales.\n\nThe recalled products are:\n\nSliced Silverside 1kg — USE BY (All use by dates up to and including): 20/12/2025\n\n— USE BY (All use by dates up to and including): 20/12/2025 Sliced Roast Beef 1kg — USE BY (All use by dates up to and including): 13/12/2025\n\n— USE BY (All use by dates up to and including): 13/12/2025 4x4 Ham Sliced 1kg — USE BY (All use by dates up to and including): 13/12/2025\n\n— USE BY (All use by dates up to and including): 13/12/2025 Champagne Ham Sliced 1kg — USE BY (All use by dates up to and including): 17/12/2025\n\n— USE BY (All use by dates up to and including): 17/12/2025 Provincial Ham Sliced 1kg — USE BY (All use by dates up to and including): 5/12/2025\n\nFood Standards Australia and New Zealand say the products have been recalled for Microbial (Listeria monocytogenes) contamination.\n\nListeria is a type of bacteria that can cause an illness called listeriosis.\n\nIt is caused by eating foods contaminated with listeria, such as unpasteurised dairy products, soft cheeses, raw seafood, cold meats or chicken, and unwashed raw vegetables.\n\nListeria monocytogenes may cause severe illness in:\n\nPregnant women\n\nUnborn babies\n\nNewborns\n\nThe elderly\n\nImmunocompromised individuals.\n\nThe general population can also become ill from consuming food contaminated with Listeria monocytogenes.\n\nSymptoms of listeriosis include fever, nausea, headaches, tiredness and muscle aches and pains.\n\nCustomers are advised not to eat the product and instead return it to its place of purchase for a full refund.\n\nFood Standards says anyone concerned about their health should seek medical advice.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/davis-cup-italy-defeats-belgium-to-reach-final/106040142",
    "title": "Italy's Cobolli comforts crying Belgian opponent after Davis Cup semi win",
    "publish_date": "Fri, 21 Nov 2025 22:18:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Italy's Flavio Cobolli has shown class in consoling his Belgian opponent Zizou Bergs following a dramatic Davis Cup semifinal.\n\nCobolli beat Bergs, 6-3, 6-7 (5/7), 7-6 (17/15), after saving seven match points in Bologna, the result sending two-time defending champion Italy through to the final.\n\nAfter clinching victory, Cobolli ripped off his shirt and celebrated with his teammates.\n\nHe eventually went to comfort Bergs, who was consoled by his team as he cried on his chair.\n\nCobolli gave Italy an unassailable 2-0 lead without needing the doubles rubber to be contested.\n\nItaly is riding a 13-tie winning streak and meets the winner of the second semifinal between Germany and Spain, who is without injured world number one Carlos Alcaraz.\n\nFlavio Cobolli celebrates his win in the first Davis Cup semifinal. (Getty Images/Image Photo Agency)\n\nEarlier, Matteo Berrettini beat Raphaël Collignon, 6-3, 6-4, to help Italy on its way.\n\nNeither Belgian player has won a singles title on the ATP Tour.\n\nBut Bergs, ranked 43 in the world, played as if it was the biggest match of his life against number 22 Cobolli.\n\nFrom 3-3 in the second set tiebreaker Bergs found his range and levelled the match with a forehand to the back of the court, which Cobolli returned long.\n\nAlcaraz withdraws from Davis Cup Finals World number one Carlos Alcaraz is forced to pull out of Spain's Davis Cup campaign.\n\nThe players then swapped and missed match-point chances, with Cobolli eventually triumphing with a service winner that Bergs could only just get his racquet on.\n\nIt was a more comfortable match for the 56th-ranked Berrettini, a 2021 Wimbledon runner-up with 10 singles titles on the tour.\n\nHe clinched the first set on serve against number 86 Collignon.\n\nCollignon dropped his opening serve of the second set, but broke back for 2-2.\n\nBerrettini, who was ranked as high as six in the world in 2022, withstood his opponent's aggressive shot-making to break for 4-3 and won on his first match point with a love hold.\n\nAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/sydney-doctors-to-try-help-separate-png-conjoined-twins/106039510",
    "title": "Pilot flew ‘one body, two souls’ in extraordinary medical airlift",
    "publish_date": "Fri, 21 Nov 2025 21:52:40 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A team of specialised doctors from Sydney has flown to Papua New Guinea to determine whether a rare set of conjoined twins can be surgically separated.\n\nThe brothers, Tom and Sawong, were born six weeks ago in remote Papua New Guinea and are still alive despite fears they may not survive.\n\nJoined at the lower abdomen, the boys share a single liver and portions of their gastrointestinal tract. Tom, the smaller twin, also has a congenital heart defect and only one kidney.\n\nThis week, the ABC was granted exclusive access to visit the twins in a neonatal intensive unit at the private hospital in Port Moresby where they are currently receiving care.\n\nLying face-to-face in a plastic incubator surrounded by soft pillows and blankets, the boys sleep peacefully, legs tangled around one another.\n\nNow and then, they will stir: a clenching fist, a batting eyelid, the twitch of a mouth — signs of life that bring comfort to their parents and medical team.\n\nEvery hour, specialist nurses open the cot to reposition the twins and feed them.\n\nWhile Tom cannot receive nutrition orally and is fed through a nasogastric tube, Sawong drinks from a delicate syringe connected to his mouth.\n\nAs he suckles, Sawong's big eyes flick open, staring up at the Papua New Guinean nurse tending to him.\n\n'One body, two souls'\n\nThe boys were delivered at a small hospital in rural Papua New Guinea. (Supplied)\n\n\"One body, two souls,\" muses Jurgen Ruh, a pilot who has been supporting the family.\n\nIt's what he wrote on the flight plan he submitted before airlifting the twins from Lae to Port Moresby not long after their birth — the beginning of a long journey that he says still isn't over.\n\nMr Ruh owns an aviation company that provides medevacs for patients in remote Papua New Guinea.\n\nBut since meeting Tom and Sawong, he's spent much of his time fighting to have them sent overseas because the surgery needed to separate them cannot be performed in Papua New Guinea.\n\n\"If you leave the children here where they are totally unattended or without any options, it is certain one will die and take the other one with him,\" Mr Ruh said.\n\n\"It's an awful death for the twins … and all the parents want is that we try something.\"\n\nTwins kept in PNG\n\nThe Port Moresby General Hospital, where the twins were initially treated, made enquiries about sending them to Sydney, but later said the referral was too risky.\n\nCEO Dr Paki Molumi said the decision to keep them in Papua New Guinea was taken after consultation with Australian doctors, and the likelihood of both twins surviving separation was extremely low.\n\n\"Taking all these factors into account, our team collectively agreed that it is in the best interest of the twins and their family to continue care here at the Port Moresby General Hospital,\" he said at the time.\n\nThe twins have been moved out of Port Moresby General Hospital. (ABC News: Hugo Hodge)\n\nAustralia's Department of Foreign Affairs and Trade said funding was not a factor in the decision.\n\nBut the parents last week decided to move Tom and Sawong out of the public system and into a private facility where they have now been given their own ward and a dedicated team of nurses.\n\n\"It's the best environment we can provide for them in Papua New Guinea, taking into consideration possible cross-infections and catching of malaria,\" Mr Ruh said.\n\nJanet Sios, who co-owns Paradise Private Hospital with her husband Dr Robin Sios, said it was a privilege to help the boys.\n\n\"I feel as a mother, what can I do? What can I do? Is there anything else I could do?\" she tells the ABC.\n\n\" They can stay as long as they want in this unit. This is all for them with their parents. \"\n\nOpen to anyone helping\n\nOn Thursday, a team of doctors from the Sydney Children's Hospitals Network arrived in Port Moresby to assess the twins and provide advice on whether they can be separated.\n\nThey declined the ABC's interview requests, with a spokeswoman saying their priority was gathering information and meeting with the family, and a transfer to Australia was not guaranteed.\n\nJanet Sios said she hoped they could find a way forward.\n\n\"We are working with specialists from Australia. We are looking at every option for them,\" Ms Sios said.\n\nEarlier this month a spokesperson for Foreign Minister Penny Wong said the Australian government was \"working closely with our partners in Papua New Guinea to help ensure the twins receive the best medical care”.\n\n\"Our thoughts are with the family during this incredibly distressing time,\" the spokesperson said.\n\nThe brothers were born in remote Papua New Guinea in early October and airlifted to Port Moresby. (ABC News: Marian Faa)\n\nJurgen Ruh said the parents, who asked him to speak on their behalf, were emotionally drained but still clinging to hope.\n\n\"It's been a long journey and it's very emotional. Today I think was, for all of us, a rough ride,\" he said.\n\n\"We've been talking to three different countries to hopefully take on the twins and whoever is the first one with the solution we'll most likely go with it.\n\n\"We're open to anyone and everyone to help us.\"\n\nHe said he believed the brothers had a fighting spirit.\n\n\"They are survivors and they want to live.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-22/victorian-auction-reserve-price-underquoting-national-laws/106036770",
    "title": "Unexpected criticism for Victoria's reserve price real estate law",
    "publish_date": "Fri, 21 Nov 2025 21:14:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's announcement of a new law forcing property owners to declare a home's reserve price a week before an auction has attracted criticism from two unexpected industry insiders.\n\nThe state government on Thursday revealed an Australian-first law to be introduced next year requiring real estate agents to publish the minimum amount a seller will accept for a property being offered for auction or fixed-date sale.\n\nThose who failed to disclose the reserve price within the time frame would not be able to proceed with the auction or sale.\n\n\"I think it's appalling to be honest,\" said buyer's advocate Lauren Staley.\n\nNew underquoting laws in Victoria Real estate agents in Victoria will be required to publish a property's reserve price at least seven days before it goes to auction under new laws announced on Thursday.\n\nThe government said the law was designed to protect buyers from underquoting.\n\nBut Ms Staley said it would unfairly penalise vendors, who she said would be forced to lay all their cards on the table.\n\n\"There needs to be some work done on the system that we've got, but I think that we get a lot of buyers throwing their toys out of the cot because they miss out on a property.\n\n\"There's got to be some onus on the buyer to do their own due diligence when it comes to this.\"\n\nAuctions will not be allowed to proceed if real estate agents fail to disclose a property's reserve price within the seven-day time frame under the laws to be introduced in Victoria next year. (ABC News: Michael Coggan)\n\nMs Staley said she did not believe the policy would be effective at stamping out underquoting.\n\n\"Where you get two people who have got deep pockets and they're willing to spend whatever it takes to buy a home, that's something that an agent can't predict and a vendor can't predict,\" she said.\n\n\"Declaring a reserve or showing your hand seven days before an auction, I don't think it's going to have any impact on that outcome.\n\n\" The real issue is affordability and that's not being tackled whatsoever in this particular reform. \"\n\nBuyer's advocate Lauren Staley said the new law was unfair for vendors. (Supplied: Lauren Staley)\n\nCate Bakos is a fellow buyer's advocate.\n\nShe is also the chair of Property Investment Professional of Australia, which advocates to strengthen consumer protections for property investors.\n\nShe said locking vendors into setting a reserve before a crucial time in a sales campaign could also stop them from lowering their price.\n\n\"Those seven days are quite crucial for the agents and the vendors to understand where the buyers are at,\" Ms Bakos said.\n\n\"We're not giving conversation to what happens … if their circumstances or market conditions or a very recent comparable sale changes their feelings about their property's value.\"\n\nMs Bakos said underquoting was still a problem in the real estate industry but the Victorian government's attempted fix would fall short of improving things for buyers.\n\n\"If the buyers are only able to be confident in that final seven days that they've got a grip on the value [of a property], they will have a much shorter period of time to conduct their due diligence.\n\n\" It will be a challenge for buyers to get building inspections and contract reviews all coordinated within that final week. \"\n\nCate Bakos said she did not believe the law would fix underquoting. (Supplied: Cate Bakos)\n\nMs Bakos said it was also yet to be seen whether some vendors would set unrealistic reserves.\n\n\"The difference between reserve and likely selling price needs a little bit of attention,\" Ms Bakos said.\n\n\"If a vendor was very confident that they had really strong interest on their property, they could set their reserve at $1 and the property will sell under heavy competition and give them a great result.\"\n\nBut managing director of the Australian Housing and Urban Research Institute, Michael Fotheringham, believed the law was a good step forward for Victorian home buyers.\n\n\" I think it's reasonable for people wanting to buy a home to have an accurate sense of how much a property is likely to sell for. \"\n\nDr Michael Fotheringham has thrown his support behind mandatory reserve pricing. (ABC News: Billy Cooper)\n\nDr Fotheringham said vendors should have a reasonable sense of the market before the final week of a sale campaign and the new law would make the industry more transparent.\n\n\"That's the real estate agent's job to advise them on the market and what's realistic,\" he said.\n\n\"It feels disingenuous to have such wild divergences between the ranges being put up as likely prices week after week, and week after week seeing the prices going much, much higher.\"\n\nNo other state mandates advertising of reserve prices\n\nIf the laws pass in 2026, Victoria will be the only state in Australia that mandates the advertising of a reserve price for an auction.\n\nIn New South Wales and South Australia, vendors must advise their agent of their reserve price and it is kept confidential from the bidders.\n\nIn the ACT, vendors are not required to set a price.\n\nBut if they do, it must also be put in writing and given to the auctioneer who keeps it confidential until the property is declared on the market.\n\nIn Queensland, Tasmania and Northern Territory, vendors are not required to set a reserve, but that leaves them exposed to having to accept the highest bid made at the auction.\n\nMichael Fotheringham said other states would be watching to see if Victoria's law is effective in adressing underquoting. (AAP: Dan Himbrechts)\n\n\"In NSW at the moment, there have been a series of round tables looking at underquoting, looking at an approach to it,\" Dr Fotheringham said.\n\n\"I suspect other states and territories will watch [Victoria's new law] with great interest and may well follow suit.\"\n\nWhen it comes to advertising prices, Queensland has taken the opposite approach to Victoria.\n\nQueensland has banned vendors and real estate agents from providing price guides for properties being sold at auction.\n\nMs Bakos said she believed Queensland had the better approach to real estate auctions than Victoria.\n\n\"The onus is completely on the buyer to do their own homework and to work out where they think the value sits,\" she said.\n\n\"That's quite a dramatic stance as well.\n\n\"I would argue that it's a healthier stance than a misleading price quote.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/world/north-america/don-t-be-stupid-how-trump-is-losing-his-grip-on-maga-20251120-p5nh3z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Don’t be stupid’: How Trump is losing his grip on MAGA",
    "publish_date": "Sat, 22 Nov 2025 12:48:48 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This week, Donald Trump told MAGA supporters they were dumb. The US president was speaking at the US-Saudi Investment Forum before an audience that included Saudi Crown Prince Mohammed bin Salman, the world’s richest man Elon Musk and Nvidia chief executive Jensen Huang. Last month, chipmaker Nvidia became the world’s first $US5 trillion ($7.75 trillion) company by market capitalisation. Like its Silicon Valley brethren, it relies heavily on bringing skilled foreign workers into the US. In the MAGA universe of “America first”, that’s a thorny issue. American jobs are for Americans. But Trump knows better, and he made a point of it. If tech companies need to bring in foreigners to make chips and other advanced technologies, they should do so, he said – and the foreigners can teach Americans how to do it. Donald Trump is increasingly disagreeing with his MAGA base. Credit: Marija Ercegovac Those who railed against skilled migration were great patriots, Trump said, but they just didn’t understand the realities of the industry. “I’m sorry,” he said. “My poll numbers just went down – but with smart people, they’ve gone way up. “You can’t open up a massive computer chip factory for billions and billions of dollars ... and think you’re gonna hire people off an unemployment line to run it. They’re going to have to bring thousands of people with them, and I’m going to welcome those people.” Trump revelled in his defiance of MAGA orthodoxy. “I may take a little heat – I always take a little heat from my people,” he said. “I love my conservative friends, I love MAGA, but this is MAGA.”\n\nAdvertisement\n\nAlmost all political leaders disappoint their base. Labor lets down the true believers, the Liberals frustrate their right-wing flank. But the relationship between Trump and MAGA is altogether different. The president likes to say he created the movement, and MAGA is whatever he says it is. US President Donald Trump said “smart people” would appreciate his drive to bring in foreign workers to make chips. Credit: AP That symbiosis is being tested. At the pointy end is the Epstein files – now set to be released, to some extent at least, after Trump bowed to reality and signed a bill that will make them public. After resisting for months, the president has returned to the pre-election MAGA orthodoxy: that the Epstein files would primarily embarrass prominent Democrats and members of the so-called East Coast elite. But there are deeper reasons for the MAGA movement fissures. They span concerns about Trump spending too much time on foreign affairs, his position on China and Chinese students, and divisions over antisemitism, US support for Israel, the cost of living and artificial intelligence. Trump’s America is also not immune from the global ructions on immigration that are dividing Australia, Britain and Europe. Although the administration rapidly and successfully cracked down on unlawful immigration, it is legal migration – people coming on work visas from India, China, South Korea and elsewhere – that stirred the rift. It crystallised in a rare combative moment in an interview between Trump and Fox News host Laura Ingraham last week. Ingraham: “If you want to raise wages for American workers, you can’t flood the country with tens of thousands – or hundreds of thousands – of foreign workers.”\n\nTrump: “I agree, but you also do have to bring in talent.”\n\nIngraham: “We have plenty of talented people.”\n\nTrump: “No, you don’t. You don’t have certain talents, and people have to learn.”\n\nAdvertisement\n\nThe president was especially aggrieved by an immigration raid on a Hyundai factory in the state of Georgia in September, in which hundreds of skilled workers, mostly South Koreans, were arrested and accused of working unlawfully in the US. Lawyers said the employees had valid visas; some have since returned to the plant. “They were told to get out, and I said, ‘Stop it, don’t be stupid’, and we worked it out,” Trump told this week’s Saudi conference. Vice President JD Vance said divisions in the MAGA movement were fine as long as they did not detract from fighting “the enemy”. Credit: AP That’s all a markedly different message than the one delivered by Vice President JD Vance the next day at an event with right-wing news website Breitbart. In the grand Andrew W. Mellon auditorium on Washington’s Constitution Avenue, Vance departed from Trump’s usual claim that Americans’ present economic woes are entirely caused by his predecessor. “Let’s be honest, it’s not just Joe Biden ... we had a policy in this country for 40 years of shipping American jobs overseas and hiring foreign workers instead of American workers,” Vance said. “That has caused the economic stagnation of the American middle class.” While he was emphatic that the Trump administration is on the right path, Vance sounded a different tone to his boss’s regular insistence that prices are down and the economy is humming. “We get it, we hear you,” he told struggling Americans. “We understand that there’s a lot more work to do, and the thing that I’d ask for the American people is a little bit of patience.” Just as Trump was on stage with the Saudis, a panel on foreign work visas was under way at the Washington offices of the Heritage Foundation, a think tank that bills itself as the intellectual base of the America First movement.\n\nAdvertisement\n\nSimon Hankinson, the foundation’s senior fellow for immigration and border security, disputed that the US had a shortage of talent and skilled labour. If anything, he said, the skills shortfall was caused by “deep rot” in US educational institutions, where “meritocracy has been replaced with equity – everyone gets an A”. “The specialty workers that even big American companies really need – as opposed to want – should fit in a bus, and not a stadium,” Hankinson said. He was also at odds with Trump’s newfound enthusiasm for artificial intelligence, which the president proudly says America will dominate. Instead, Hankinson said AI was poised to take a wrecking ball to the job market. Loading “We all somehow think that it’s going to make us richer, it’s going to grow the economy, it’s going to make us more productive. But nobody has any clue what jobs are going to be left over. So, given this uncertainty, why would we put foreign workers’ needs ahead of those of our own graduates and our own workers?” Similar concerns have been raised by Republican congresswoman Marjorie Taylor Greene, the former MAGA diehard-turned-outspoken critic who has recently broken with the president on everything from Epstein to healthcare to foreign policy. “Promoting H1-B visas to replace American jobs, bringing in 600,000 Chinese students to replace American students … those are not ‘America first’ positions,” Greene told CNN last weekend.\n\nAdvertisement\n\nShe also scolded Trump for spending too much time overseas. “I said this to him: I would love to see Air Force One be parked and stay home, and there be nothing but a constant focus from the White House on a domestic agenda.” Marjorie Taylor Greene, right, attends a news conference on the Epstein files on Tuesday. Credit: AP Trump is publicly calling Greene – who on Saturday AEDT announced she would resign from Congress in January – a lunatic, a disgrace and a traitor. At a news conference with Epstein’s victims this week, she retorted: “Let me tell you what a traitor is. A traitor is an American that serves foreign countries and themselves.” Spending too much time overseas is a complaint that gets levelled at many world leaders, including Anthony Albanese and Britain’s Keir Starmer. Dennis Lennox, a Republican strategist, says it is usual for second-term presidents to elevate foreign affairs in importance as they look to secure their legacy on the world stage. Trump is proud of his efforts to end wars, and he has an eye on the Nobel Peace Prize. Loading But there is also friction in MAGA about foreign policy decisions. Plenty of “America first” subscribers question the US’s alliance with Israel and its funding of Israel’s defence. Others indulge antisemitic conspiracy theories about money and power. Republican senator Ted Cruz recently called out rising antisemitism on the right, and said it had to be reckoned with. That internal skirmish played out in dramatic fashion at the Heritage Foundation, when its president, Kevin Roberts, saw fit to defend commentator Tucker Carlson over his sympathetic interview with declared white supremacist and Holocaust denier Nick Fuentes.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/the-ashes-first-test-day-two-live-england-seek-last-wicket-of-shell-shocked-australians-20251122-p5nhkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes, first Test, day two live: England seek last wicket of shell-shocked Australians",
    "publish_date": "Sat, 22 Nov 2025 12:31:51 +1100",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Brendon McCullum’s Bazballers can smell the fear in Australia’s dressing room after their five-prong pace cartel inflicted physical and psychological trauma on the hosts on a frenetic first day of the Ashes.\n\nTwelve years after Mitchell Johnson terrorised an ageing England team, Australia’s band of veterans are facing a similarly frightful ordeal against one of the fastest pace battalions the old enemy has sent to these shores in decades.\n\nFormer England captain Michael Vaughan even called for Australia to send Mitchell Marsh an Ashes SOS after the home side crumbled under a fierce onslaught.\n\nBen Stokes bagged five wickets, capitalising on the brutality of Jofra Archer, who, along with Mark Wood, broke through the 150 km/h barrier. England’s average speed of 141 km/h is the highest they have managed in a Test since records began in 2006, according to data analysts CricViz. It is a speed rarely sighted among Sheffield Shield ranks.\n\nEngland’s Brydon Carse celebrates a key wicket with skipper Ben Stokes. Credit: AP\n\nSteve Smith’s men went from a position of control midway during the day, to being left shell-shocked and on their knees after a scarcely believable 19 wickets fell on a spicy Optus Stadium deck. Not since 1909 in Manchester has there been this many wickets tumble on the first day of an Ashes Test.\n\nLoading\n\nBrydon Carse, on Ashes debut, can sense the unease among the Australians.\n\n“I thought we were quite relentless as a group of seamers,” Carse said. “I think we bounce off each other. I think when you have Mark Wood and Jofra in your line-up, that’s always nice bowlers to have. There was pace and bounce throughout the wicket and the day.\n\n“I don’t think we really even realised it. It obviously was probably more unsettling for the Aussies.”\n\nRead more here.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/jake-paul-anthony-joshua-face-off-20251122-p5nhkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jake Paul, Anthony Joshua face off",
    "publish_date": "Sat, 22 Nov 2025 11:59:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jake Paul, Anthony Joshua face off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/world/north-america/zohran-mamdani-quizzed-on-calling-president-trump-a-fascist-20251122-p5nhko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Zohran Mamdani quizzed on calling President Trump a fascist",
    "publish_date": "Sat, 22 Nov 2025 11:36:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Zohran Mamdani quizzed on calling President Trump a fascist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/world/british-columbia-premier-speaks-out-about-bear-attack-on-teachers-children-20251122-p5nhkn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "British Columbia premier speaks out about bear attack on teachers, children",
    "publish_date": "Sat, 22 Nov 2025 11:25:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "British Columbia premier speaks out about bear attack on teachers, children\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/how-line-dancing-and-the-veronicas-have-helped-the-blues-to-a-preliminary-final-20251117-p5ng3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You babes are Untouchable’: Carlton embraced an anthem. The Veronicas replied",
    "publish_date": "Sat, 22 Nov 2025 11:12:57 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "On Saturday, Carlton posted a message on social media from The Veronicas – sisters Lisa and Jessica Origliasso – sending the Blues “the best energy”. “Hey babes, it’s The Veronicas, and we just wanted to wish you the best of luck for the game today. All of our love, all of our luck, we are sending you the best energy. You babes are Untouchable.” Cordner, who was named in this year’s All-Australian squad, said the team had perfected the balance between hard work while also leaning into the fun side of footy. “Over the years, I’ve probably swayed a little bit too far to the serious side, but this year I’ve really leaned into some of the young girls and the spirit they’ve brought and their ability to have fun,” she said.\n\n“So it’s helped me feel really free on the field and I think it also helps the young girls being able to play footy and not stress too much about the occasion or the outcome.” One of Carlton’s most exciting young players is 19-year-old Sophie McKay – daughter of Carlton great Andrew McKay and sibling to captain Abbie. McKay has kicked 15 goals in her debut season but her antics after she kicks a major have garnered her a legion of fans. Between her fake hammy injury turned “stanky leg” to her fake shoulder injury into the shimmy, McKay’s post-goal celebrations have garnered thousands of views across social media\n\n“She’s [Sophie] such a character, she’s always asking people for celebration ideas and I tried to tell her she should do the moon walk, but she couldn’t do it in her boots,” Cordner said. “She’s a really good example of someone who has come in willing and wanting to work and improve all the time. “But she’s also got a good balance of just enjoying the experience and her energy brings other people along, which is a really great quality to have in a person and also a player.” If you need any further indication of Carlton’s infectious energy, just take a look at the fans filling Ikon Park over the past few weeks. This year, an average 2563 have attended AFLW games. However, Carlton’s recent semi-final win over Hawthorn pulled 5645 fans. Little kids wait near the boundary lines to have guernseys signed by players such as Darcy Vescio or Scholz, while others hope to grab Mimi Hill’s prized boots or socks.\n\nCarlton’s cheer squad is even making the 17-hour drive to Brisbane this weekend to cheer on the Blues. Fun and games aren’t the only thing behind the Blues’ rise. Loading Cordner arrived at Princes Park in 2023 – the same year Carlton wrapped up their independent review into their AFLW program after a disappointing two seasons with minimal wins. The review led to high staff turnover including the departure of several players and coach Daniel Harford. For Cordner – who played at both Melbourne and Richmond – Carlton’s investment in the women’s program, including employing full-time high-performance staff and coaches, has been pivotal to their success.\n\n“I’ve obviously played at two other clubs, and every club does it really differently, but I think the way the whole club has backed the W program in since the review has been really evident to me,” she said. Loading “I think we’re reaping the rewards of that investment from two years ago and seeing it come to fruition.” The next hurdle ahead of the Blues is Brisbane, whom they beat in Queensland earlier this season. But the Lions are finals veterans – this will be their seventh straight preliminary final – and are backed by some of the most experienced players in the comp. While Cordner acknowledged Carlton’s lack of finals experience, she said the Blues were ready to take the fight to Brisbane.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "An ‘eternal showgirl’ puts a new spin on a grim classic about a woman cursed to dance forever",
    "publish_date": "Sat, 22 Nov 2025 11:05:00 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn",
      "Andrew Fuhrmann"
    ],
    "text": "Meow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/daly-cherry-evans-was-still-doing-his-bit-for-manly-just-a-few-weeks-ago-20251121-p5nhhi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daly Cherry-Evans was still doing his bit for Manly just a few weeks ago",
    "publish_date": "Sat, 22 Nov 2025 10:41:25 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "A few weeks ago, before he put pen to paper with the Sydney Roosters, Daly Cherry-Evans was still doing his bit for Manly.\n\nThe Manly champion was unveiled in Roosters colours for the first time on Thursday, but made a point of remaining in contact with his eventual No. 7 successor at the Sea Eagles, Joey Walsh.\n\nJoey Walsh at Manly training on Friday. Credit: Peter Rae/SMH\n\nThe pair even caught up a handful of times at the local park at Curl Curl, where both players reside, and kicked the ball around.\n\nAt 19, Walsh is likely to start next season in NSW Cup, or with a bit of luck on the NRL bench. Canberra recruit Jamal Fogarty and Luke Brooks will be the starting halves.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/tsarukyan-headbutts-hooker-20251122-p5nhki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tsarukyan headbutts Hooker",
    "publish_date": "Sat, 22 Nov 2025 10:29:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tsarukyan headbutts Hooker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/bunnings-gears-up-to-host-an-epic-live-music-gig-20251122-p5nhkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bunnings gears up to host an epic live music gig",
    "publish_date": "Sat, 22 Nov 2025 09:52:07 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Bunnings gears up to host an epic live music gig\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/gender-is-a-spectrum-sport-is-binary-why-an-ioc-decision-is-anything-but-straightforward-20251120-p5ngzn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gender is a spectrum; sport is binary. Why an IOC decision is anything but straightforward",
    "publish_date": "Sat, 22 Nov 2025 09:33:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "Major international federations, including World Athletics and World Aquatics, have in recent years adopted policies where the core ethos is to deem ineligible in female competition any female transgender athlete. The exception is where they either never experienced male puberty, or had their male puberty pharmacologically prevented before their 12th birthday and before any physical signs of male puberty were physically detectable. Which basically rules out 99 per cent of transgender athletes. Algerian boxer Imane Khelif was caught in a storm of controversy at the 2024 Paris Olympics. Credit: AP, Eddie Jim Some other sports have proceeded in the opposite direction. At least for a time. Up to now, the IOC’s position has remained uncertain, tepid and of little assistance. In late 2021, the IOC published its Framework on Fairness, Inclusion and Non-Discrimination on the Basis of Gender Identity and Sex Variations. Six pages or thereabouts of statements of principle, but wafer-thin on detail.\n\nIn 2021, the IOC stated the position that athletes should be permitted passage to compete in the gender competition that best aligns with their self-determined gender identity. The IOC also passed the buck onto the international federations, by legislating that they make their own rules to ensure no athletes are afforded unfair competitive advantages if permitted to compete in a gender category different to their biological gender. All of which stirred a quagmire. Those two competing principles are impossible to align. For example, factors of political skulduggery and corruption at the international federation level caused the IOC to have to run boxing at the 2024 Olympics in Paris. And look how that worked out. The IOC’s dithering did incredible harm. ‘An IOC blanket ban on transgender women will face serious legal obstacles. That much is certain.’ Designing, implementing and enforcing appropriate transgender policy in sport, at the grassroots level or in Olympic competition, can’t be about fear or creating division for the sake of doing so. It’s a devilishly complicated dance, weighing up the interests of transgender athletes against those of cisgender competitors. While simultaneously protecting the integrity of competition. It’s a zero-sum game – there has to be a loser in there somewhere.\n\nDesigning policy to integrate transgender athlete participation in elite sport, while shielding sports from rampant attacks on the integrity of competition itself, is more complex than solving a Rubik’s Cube with a blindfold on. Gender is a spectrum; sport is binary. Besides horse racing, darts, some classes of motor racing and mixed doubles tennis, men and women don’t compete directly against each other. I’d never try to tell someone what to think about matters so fundamental. But for what it’s worth, in my view, the IOC’s absolute imperative must be that transgender athletes be prohibited from competing in Olympic competition in the gender they identify with, if to instead allow those athletes the freedom of choice would by consequence give those athletes a material competitive advantage in terms of strength, stamina, size or endurance. Whatever leadership position the IOC must take to set such rules within that philosophy, it must do so.\n\nOtherwise, how might the core integrity of elite sport suffer? ‘It’s a devilishly complicated dance, weighing up the interests of transgender athletes against those of cisgender competitors.’ Straightforward? Yes, but at the same time, hardly. Harsh, definitely. Necessary, yes. If the IOC takes that same stance when its new policies are announced, there’ll be little scope for interpretation or manipulation through subjectiveness. No element of the application of those rules requires measurement or monitoring. Experts who know more than I do will tell you that the medical and scientific evidence isn’t absolute in demonstrating that transgender athletes, and male-to-female transgender athletes in particular, are benefited by everlasting physical and physiological advantages over their cisgender fellow competitors. But other subject-matter experts will tell you that if a person is born male, there are certain physiological and strength advantages that can’t be muted through pharmacological means. It’s impossible to conclude with certainty the position that’ll prevail three decades on. But that uncertainty alone can’t be the reason for the IOC and governing bodies to remain stationary until science and medicine arrives at a consensus beyond definitive. To do that would fail the current and next generation of Olympians.\n\nBack to the question however: will an IOC across-the-board ban on all transgender and DSD women, from competing in the female Olympic competitions categories, stand impervious to the inevitable legal challenges that will follow? Caster Semenya and her lawyer Gregory Nott arrive at a Court of Arbitration for Sport hearing. Credit: AP Last July, the Grand Chamber of the European Court of Human Rights delivered its final judgment in Caster Semenya’s legal challenge against Switzerland. The ECHR in its judgment found Switzerland violated article 6(1) of the European Convention on Human Rights because the Swiss Federal Tribunal failed to conduct a sufficiently rigorous examination of the Olympic champion’s earlier challenge to the Court of Arbitration for Sport concerning World Athletics’ rules relating to DSD athletes, of which Semenya is one. While the ECHR judgment focused primarily on procedural fairness rather than the substantive discrimination claims made by Semenya, the decision has profound implications for sports governance, and challenges that may be brought against any rules the IOC implements. The ECHR decided that the limited supervision exercised by the Swiss Federal Tribunal – Switzerland’s highest court – over CAS awards was insufficient to comply with Switzerland’s positive obligations under the European Convention on Human Rights, to ensure that no individual under its jurisdiction suffers discrimination.\n\nLoading Put differently, the decision strikes at the idea that the IOC, and IFs, have ultimate autonomy in regulating athlete eligibility. For the IOC’s rules to withstand legal attack, the IOC must lay out a robust and irresistible scientific case demonstrating consistent, unfair, and disproportionate advantages that cannot be addressed through less restrictive measures. The IOC will need to introduce a transparent and procedurally fair system to all athletes affected. The IOC will also be required to prove why a complete ban on all transgender athletes from the female category is the only available solution. That approach must also comply with all applicable human rights standards, and particularly so the same ones that were fallen foul of in the handling of Semenya’s matter.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/oceania/the-conundrum-facing-asia-s-richest-man-as-pressure-grows-over-russian-oil-20251118-p5ng8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The conundrum facing Asia’s richest man as pressure grows over Russian oil",
    "publish_date": "Sat, 22 Nov 2025 09:30:00 +1100",
    "category": "finance",
    "authors": [
      "Zach Hope"
    ],
    "text": "Advertisement\n\n“Australians do expect businesses to prevent their supply chains from inadvertently funding Russia’s conflict against Ukraine, and we have asked businesses to uphold that responsibility,” she said. This is all good from an Australian perspective, but the company does not appear to be halting the Russian flow to the other part of its Jamnagar operations, supplying the hungry and hungrier domestic market of 1.4 billion people. This could be a problem for US President Donald Trump. Ostensibly fed up with Putin and his illegal war in Ukraine, he stunned India in August by imposing tariffs of 50 per cent, citing half of that as punishment for the country’s large-scale importation of Russia’s war-funding oil. Reliance managing director and chairman Mukesh Ambani. Credit: Bloomberg The Indian government called it “unfair, unjustified and unreasonable”. After all, China takes more Russian crude than India. Turkey, Hungary and Slovakia are also importers. None of these nations copped Russia-related tariff punishments. Analysts have noted the hypocrisy. But the not-insignificant context is this: The US and India – the world’s biggest economy and the world’s most populous country – are in the midst of negotiating a globally consequential trade deal. Trump, as he says himself, likes to deal from positions of strength.\n\nAdvertisement\n\nThings get more serious from today. That is when US sanctions kick in on Russian crude oil producers Rosneft and Lukoil, following Australian sanctions on the same companies in 2023. Analysts told this masthead that the US cracking down meant it was unlikely for Indian refiners, except one facility already sanctioned by the European Union, to continue those particular lines of trade. Or at least openly. The Reliance refinery at Jamnagar is a money-making machine for Mukesh Ambani. Credit: Bloomberg Kpler, a global real-time data tracker and provider of analytics, has noted a shift in Russian crude trading behaviour, “marked by mid-voyage diversions between India and China and ship-to-ship transfers at unusual locations such as off Mumbai’s coast – far from the typical transfer zones near the Singapore Strait,” senior analyst Sumit Ritolia said. “These developments reflect evolving logistical tactics by Russian exporters navigating tightening Western sanctions.” Ritolia told this masthead he expected a noticeable drop in Russian crude flows to India in the near term, particularly through December and January. Refiners would likely then “proceed more cautiously, relying on unsanctioned traders, blended barrels, and more complex logistics to minimise OFAC [the US Office of Foreign Assets Control] exposure”.\n\nAdvertisement\n\nBut the elephant in the room is that only Rosneft and Lukoil have been sanctioned. Other Russian entities, such as Surgutneftegas and Gazprom Neft, have escaped the US glare and may be able to legally fill some of the Indian breach. Putin’s oil barons have found a strong mid-war market there because India produces hardly any of its own crude. And the nation of 1.4 billion people – hundreds of millions of whom remain below the poverty line or near its threshold – needs more and cheaper energy. According to the International Energy Agency, India will be the largest source of global oil demand growth between now and 2030. Russian President Vladimir Putin meets Indian Foreign Minister Subrahmanyam Jaishankar at the Kremlin on Tuesday. Credit: AP It helps the oil trade that India and Russia share strong ties. They are seeking to work even more closely on matters of space, technology, defence and trade. India’s Jaishankar is a regular visitor to Moscow. Putin welcomed him again just this week. Reliance is not the only Indian importer of Russian crude. But it is the biggest. Its next moves may play an outsized role in US-India trade negotiations and the health of Putin’s war chest. Australians not au fait with the oil trade might know the Ambani name from such 2024 headlines as “What we know about the Ambani wedding”, covered by Vogue, and which was estimated to have cost almost $1 billion.\n\nAdvertisement\n\nThe wedding was for one of Ambani’s sons, Anant, to Radhika Merchant, another child of extremely wealthy Indians. At the pre-parties and eventual celebration were guests including Mark Zuckerberg, Bill Gates, Kim Kardashian and Ivanka Trump. Popstar Rihanna was one of the performers. Not bad for a man born into modest beginnings in Mumbai. People walk past the Antilia mansion in Mumbai, house of billionaire Mukesh Ambani, lit up for the wedding of his son Anant Ambani and Radhika Merchant. Credit: AP Kim and Khloe Kardashian at the wedding last year. Credit: Kim Kardashian/Instagram Billionaire Mukesh Ambani, third left, stands with sons Akash and Anant, wife Neeta, daughter Isha and daughter-in-law Shloka at Anant’s wedding. Credit: AP It was the nous of Ambani’s father, Dhirubhai, though, that put the family on its eye-watering trajectory, turning a small yarn-trading business that he opened in 1957 into a publicly traded company by the late 1970s. This was about the time Ambani, now 68, went to the US to study for an MBA at Stanford University. He never finished it, according to a New York Times profile, because Dhirubhai called him back to work in the business.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/australia-has-an-8-billion-public-pool-problem-is-this-the-solution-20251119-p5ngs0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia has an $8 billion public pool problem. Is this the solution?",
    "publish_date": "Sat, 22 Nov 2025 09:30:00 +1100",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "About 40 per cent of Australia’s ageing public swimming pools will be obsolete by 2030; a looming crisis compounded by climate change, increased demand and a rising drowning rate.\n\nThe cost to replace them? Eight billion dollars, including $2.7 billion in NSW and $3 billion in Victoria – and that doesn’t include the cost of building entirely new pools as the population grows.\n\n“That’s scary,” Royal Life Saving NSW chief Michael Ilinsky told a meeting at NSW Parliament House on Friday, where he pitched modular prefabricated pools as a potential solution to cut costs.\n\nIt could cost as much as $8 billion to upgrade Australia’s ageing public pools. Credit: Janie Barrett\n\nInspired by the NSW government’s pattern book of designs to fast-track low to medium density housing, the 130-year-old organisation has worked with global architects Cox Architecture on a pattern book of modular designs called the Future of Swimming Pools.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/leadership-spills-and-policy-reversals-how-healthy-is-our-democracy/nj201gjdp",
    "title": "Leadership spills and policy reversals: How healthy is our democracy?",
    "publish_date": "Fri, 21 Nov 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"So, let’s be honest and up front about last month’s election. We didn’t just lose. We got smashed. Totally smashed. What we as the Liberal Party presented to the Australian people was comprehensively rejected.\"\n\n\n\n\n\nThat declaration of defeat was delivered by Liberal Party Leader Sussan Ley on June 25th, 2025.\n\n\n\n\n\nIn the months following the party's historic defeat, those words have echoed like an omen.\n\n\n\n\n\nSince then, the Liberal Party has undergone organisational movement and policy shifts at the federal and state levels.\n\n\n\n\n\nIn Victoria, Brad Battin was ousted to install Jess Wilson as the first female leader.\n\n\n\n\n\nIn New South Wales Kellie Sloane has been elected as the new leader following Mark Speakman's resignation.\n\n\n\n\n\nTurbulence is rife in the party - So what role does an opposition party play in a Westminster representative democracy?\n\n\n\n\n\nSkye Predevac from the Australia Institute tells us what a Westminster Democracy is.\n\n\n\n\n\n\"The Westminster system is basically a bunch of procedures and protocols and traditions that come from the United Kingdom. So it's, you know, these hundreds of years of built up British traditions when it comes to democracy. And it looks like many things that we have in Australia, things like even having a prime minister, having two Houses of Parliament, having executive the executive branch, having ministers being politicians in members of parliament, parliamentary privilege, the hands are all of these things are part of this. And in this context, it also means having an opposition leader, because traditionally in the United Kingdom, they've only had two big parties, and they alternate between government so it makes sense to have a single person who's in charge of the opposition in a lot of other democracies. It doesn't work that way because they don't have those kind of two major parties.\"\n\n\n\n\n\nDr Jill Sheppard, a politican scientist from the Australian National University says the the opposition party plays a pivotal role in this system.\n\n\n\n\n\n\"It matters for half of the population, for 66% of the population that didn't vote for Labor and want to feel represented by someone, and if they don't feel represented, especially in a compulsory voting system, that is miserable, you know, so if you voted Liberal, or if you just didn't vote Labor, but every day, all you see is Labor, or all you see is criticism of a Liberal party, you start to feel like this is a government that doesn't speak for you at all. And we're not a one party state, like we're meant to be a parliamentary democracy in which the parties work together to come up with consensus on a whole range of policies. And if that's not happening, because Liberal Party can't even agree, you know, can't even come up with a consensus internally, then that that's really bad for how we feel about democracy.\"\n\n\n\n\n\nDr Sheppard notes that despite the Labor government receiving only 34% of the primary vote, it controls the legislative agenda, even without control of the Senate.\n\n\n\n\n\nShe says this is not good for the state of democracy.\n\n\n\n\n\nProfessor Mark Kenny from the Australian National University offers a traditional view of the Opposition's role.\n\n\n\n\n\nHe says they should act as an \"alternative government in residence\" responsible for negotiating legislation, setting the political agenda, and raising issues for discussion among other representatives.\n\n\n\n\n\nConversely, Dr Sheppard says that if assessing the party purely on the act of setting the political agenda, some might argue the Coalition is doing an effective job.\n\n\n\n\n\n\"You know, if we're being generous, we might say the Libs are doing really well on that. Because we're talking about immigration, we're talking about Net Zero, things that Labor doesn't necessarily want us talking about, and that, for better or worse, we're having conversations about those policies.\"\n\n\n\n\n\nThe problem, according to Professor Kenny, is that the federal Opposition is out of touch with the reality of the Labor government's current stronghold.\n\n\n\n\n\nHe says the Coalition is more concerned with internal divisions than becoming electable.\n\n\n\n\n\n\"What does that mean for the quality of government in the longer run? It's an interesting question. In the UK, we see this with the Reform Party led by Nigel Farage, has five seats in a 650-member House of Commons, and yet it's getting more media, really, more media coverage, even from the BBC, than the Lib Dems who've got about 73 seats. And the Greens, who've got, you know, more seats than than Farage and, of course, the Conservatives, who have more seats than all of them. But the Conservatives are, the polls suggest, are no longer going to be the main party of opposition to Labour as that country goes to its next election, Australia could be headed for a similar kind of trajectory.\"\n\n\n\n\n\nSkye Predevac argues that a weak opposition is detrimental to the current system.\n\n\n\n\n\nShe says however that the fact that minority parties secured more seats than the Coalition in the last election suggests the two-party system is open to change.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/no-food-no-money-khoa-was-abandoned-and-owed-10-000-in-unpaid-wages-hes-not-alone/o9uj8zvmv",
    "title": "‘No food, no money’: Khoa was abandoned and owed $10,000 in unpaid wages. He’s not alone",
    "publish_date": "Fri, 21 Nov 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nKhoa Nguyenworks as a critical care nurse at a major Melbourne hospital. The 31-year-old is incredibly proud to help save lives on the medical frontline.\n\n\n\n\n\n“It is rewarding but challenging at the same time. I love the fast paced, rapid response that you could do to help the patient to be back on their feet.”\n\n\n\n\n\nBut his journey to the Victorian Heart Hospital was anything but smooth. During a gap year to earn money for university fees, Mr Nguyen took a labouring job on a farm in South Australia.\n\n\n\n\n\n“So we would get up at four, so getting ready and we'd be at the farms around 5, 5 30. Sometimes it's raining and it's hot as well. But yeah, I didn't want to take the break and I just had to keep going because otherwise I wouldn't get paid that day.”\n\n\n\n\n\nMr Nguyen shared a trailer with several others, working long hours for perhaps a few hundred dollars a day. Even then, he said his wages were docked -- allegedly to pay for upfront costs.\n\n\n\n\n\n“They already said we provided you with all the equipment all the safety gear, accommodation and then that's deducted from your salary. The accommodation and the equipment couldn't cost that much - but I didn't know where to seek help so I just agreed with that.”\n\n\n\n\n\nWhat’s worse, he says when the workers asked for their full wages the contractor paid only part of the money owing.\n\n\n\n\n\n“He said we'll keep it here just in case you break equipment and you do something to the accommodation, as well as the bond. And they said after the season then we'll pay you back. When the season finished and we asked for the money to come back and they said ‘okay, I'll give it to you next two days’. And he just took off.”\n\n\n\n\n\nMr Nguyen said the group had little money left for fares home or to buy food.\n\n\n\n\n\n“We drink plenty of water just to feel our stomach and survive because we got no contact, we didn't know where to seek help. I was stuck there two-and-a-half months. Two and a half months I had to stay in the trailer.”\n\n\n\n\n\nMr Nguyen reckons he was owed up to $10,000 in back pay. He doesn’t recall the name of the contractor nor has he tried to recover the funds.\n\n\n\n\n\n“During that period I thought of giving up, I thought ‘oh this is not for me. I don't want to continue anymore. This is so hard for me’.”\n\n\n\n\n\nIt’s an all-too-common problem, according to Associate Professor Bassina Farbenblum ((BASS-in-ah Fahr-ben-bloom)) from the faculty of law and justice at the University of New South Wales and also co-executive Director of the Migrant Justice Institute.\n\n\n\n\n\n“We have a pervasive problem with workplace exploitation for international students and people working on temporary visas in Australia. Migrants are especially vulnerable. So, for international students, they want to stay and finish their studies. And so employers know how desperately they need to protect that visa and how much they need their job.”\n\n\n\n\n\nIt’s not just international students who struggle.\n\n\n\n\n\nA University of Melbourne survey of 2,800 young workers released in July this year found that one third were likely underpaid, two thirds were forced to pay for work-related items such as uniforms or protective equipment, almost one-third were not paid compulsory super. Associate Professor Farbenblum says information is key.\n\n\n\n\n\n“Fair Work Ombudsman's website has some really good resources and that includes working out what your hourly rate is. If you are not getting leave, so if you're not getting sick leave and holiday leave, you're probably a casual worker, which means you're entitled to a 25 per cent loading. And then if you're working on nights and weekends, you might be entitled to penalty rates. Keep records of all the hours you're working. So, send a text message to your employer saying, confirming I'm working these hours on Sunday. If you're not getting payslips, which you should be, at least you've got a documented record of the hours that you're working. So, if you do want to try to claim the wages that you're owed later you've got a really good record of the hours you worked and ideally the amount that you were paid. So, the more you can document, the better.”\n\n\n\n\n\nFrom January this year, intentionally underpaying an employee’s wages or entitlements, including international students, became a criminal offence. Penalties include up to 10 years in prison and fines of more than one-and-a-half million dollars. Associate Professor Farbenblum welcomes the move.\n\n\n\n\n\n“There are also a number of new offenses in the Migration Act and these are particularly important for people on visas and they relate to employers using a person's migration status to coerce them into accepting certain conditions at work or even in the workplace. It might be accepting living arrangements related to the workplace. But we have to do much, much more to ensure that these protections are accessible to migrant workers who are exploited everywhere in Australia. And we have to make our court systems more accessible because right now we are making some dent in some of the worst cases, but we've got a really long way to go.”\n\n\n\n\n\nMr Nguyen finally escaped the farm and returned to Melbourne. His parents initially paid for his studies, later Mr Nguyen took multiple jobs to finish his degree.\n\n\n\n\n\n“It was pretty hard because I was struggling with the money at that time, I was still struggling financially. I couldn't have enough money to pay for my tuition fee. Of course my parents keep borrowing money from everywhere, but of course it wasn't enough.”\n\n\n\n\n\nIn fact, Mr Nguyen worked so hard to raise the $36,000 annual fees, he says he collapsed at university due to low blood sugar. Even so, he refused to quit.\n\n\n\n\n\n“I was scared of making my parents disappointed because they sacrifice their life. They worked tirelessly to get me and my siblings where we are today.”\n\n\n\n\n\nWith thousands of international students signing on for three months summer holiday work, Phil Honeywood, CEO of the International Education Association of Australia, expects more reports of exploitation.\n\n\n\n\n\n“Australia has put in place the regulatory frameworks and the appeal mechanisms to the best in class, world-class standard of employment undertaking. However, there'll always be unscrupulous players who will take advantage of young people's naivety. Really what we need young people to do is if they're signing on the dotted line to get independent advice about the contract they're signing. Ideally it would be from their education providers, job service or indeed their legal service. Make sure that if that first wage does not hit the bank account within the agreed time period, be that one week or maximum fortnight I would suggest, then clearly questions have to be asked. Make your family and your friendship group aware of where you are and how to communicate with you because often we've got mobile phone issues in rural communities. This summer is going to be really the time when the rubber's going to hit the road as to whether the architecture is correct, as to whether enough information is being provided.”\n\n\n\n\n\nDespite speaking only three words of English when he arrived in 2012, Mr Nguyen recently finished a second masters’ degree, in advanced nursing. He is married to his childhood sweetheart with a young daughter, and is proud to have finally achieved his goal.\n\n\n\n\n\n“This is like dream comes true. Like I've been, thanks to those hard times that I feel more mature, I feel that I can - doesn't matter what challenge, unexpected challenge or difficult times come to me, I am always ready to fight the battle.”\n\n\n\n\n\nAnd he has this advice for other international students working to pay their way.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-three-bedroom-properties-are-getting-harder-to-find/6h2g8zswv",
    "title": "'The odds are against us': Why some Australian homeowners may never upgrade",
    "publish_date": "Fri, 21 Nov 2025 19:36:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "On paper, Billy and his wife seem like the kind of couple who could afford to buy a house in Sydney: They earn a combined household income of $350,000 and own two apartments.\n\n\n\n\n\nThe North Shore residents are expecting a child and have been looking to buy a four-bedroom family house for up to $2 million, which is the upper range of what they can afford.\n\n\n\n\n\nBut after months of house-hunting, they are starting to lose hope.\n\n\n\n\n\n\"We were initially amazed that we could borrow this much and we thought we'd get something for it — but now we've started looking and it's kind of like 'what the?'\" Billy says.\n\n\n\nIt just feels like the goalposts keep moving.\n\nData shows Australians are finding it increasingly difficult to upgrade from starter units to family-sized houses, meaning their first step on the property ladder may actually be their final one.\n\n\n\n\n\nIt coincides with a drop in the proportion of three-bedroom properties available, which experts believe needs to be addressed.\n\n\n\n\n\nKPMG urban economist Terry Rawnsley says data shows that since the COVID-19 pandemic, it's become harder to upgrade from an apartment to a house.\n\n\n\nPrice gap is bigger\n\nIn 2019, the price gap between a median unit or townhouse and a median house was 28.3 per cent, but this climbed to 72.3 per cent in the latest figures for 2024/25, according to Rawnsley's analysis.\n\n\n\n\n\nThose who owned a median unit or townhouse in 2019 could have sold it for $700,000 and purchased a median house for around $900,000, which is not a massive gap, he says.\n\n\n\n\n\nThe median unit or townhouse is now worth about $800,000, while the median house costs around $1.4 million, which is a much bigger jump.\n\n\n\n\n\nThis is because house prices have grown much faster than unit prices.\n\n\n\nThe difference in price between the median unit/townhouse, and the median house, is growing in every capital city except Darwin. Source: SBS News In Sydney, the median house price is now $1.7 million, according to Domain.\n\n\n\n\n\nHenny Rahardja, principal buyer's agent at OH Property Group, says she has noticed buyers in Sydney are finding it difficult to upgrade.\n\n\n\n\n\n\"Buyers can't easily make the jump from $1.2 million apartments to $2.8 million houses, for example,\" she says.\n\n\n\n\n\nThis may be even more challenging in suburbs where land sizes are larger.\n\n\n\n\n\n\"Buyers may be okay to buy a house on 500 square metres of land, for example, but this is not helpful if the average land size in the suburb is 900 sq m.\n\n\n\n\n\n\"I think there is a lack of diversity in housing options available at the various price points.\"\n\n\n\n'Hoping for a Christmas miracle'\n\nBilly, 37, and his wife believe they've likely reached the peak of their earning potential and say it's been disappointing to see what they can actually afford to buy in the North Shore, where they would like to stay because it's close to their family.\n\n\n\nWe're getting priced out very easily, especially for things that fit our criteria, which is something that's livable [and] in a decent location.\n\nProperties they've found for around $1.8 million are either dilapidated, on busy roads or don't have much growth potential.\n\n\n\n\n\n\"The odds are against us,\" Billy acknowledges, saying they will keep trying but might have to compromise on liveability.\n\n\n\n\n\n\"We may have to live in something a bit more cramped and maybe save and try and do renovations in the future.\"\n\n\n\nBilly owns a two-bedroom unit in Baulkham Hills, and he and his wife currently live in a three-bedroom unit that she bought one and a half years ago.\n\n\n\n\n\nHis wife's parents helped her to buy the property and Billy says the pair don't feel like it's an option to ask their families for more assistance.\n\n\n\nOut of a matter of pride and self-respect, I guess, because we know we've already gotten help, it doesn't feel right to ask or continually ask for more help until we've given back a little bit.\n\nEven if they sold their properties, they would not have enough funds to substantially boost their borrowing capacity, as they also have to cover capital gains tax.\n\n\n\n\n\nIf they can't find something appropriate, they will probably stay where they are, and Billy says they may have to rethink their careers and pivot in order to gain more income.\n\n\n\n\n\n\"[But] I think that's difficult. The market's moving faster than our salaries are,\" he says.\n\n\n\n\n\n\"We're hoping for a Christmas miracle.\n\n\n\n\n\n\"If there's any time for a miracle to happen, it's normally around Christmas time because people go away on holiday [and] there's not a lot of interest then.\"\n\n\n\nSupply of three-bedroom properties is falling\n\nPart of the problem is that the proportion of three-bedroom properties in Australia has dropped in the past decade.\n\n\n\n\n\nThese properties appeal to both families and downsizers but they are becoming harder to find.\n\n\n\n\n\nRawnsley says three-bedroom properties made up almost half of those available in 2011 (45.7 per cent). But this had dropped to 39.9 per cent by 2021.\n\n\n\n\n\nThe proportion of one- and two-bedroom properties stayed roughly the same, while the proportion of properties with four or more bedrooms rose from 37.9 per cent to 43.6 per cent.\n\n\n\n\n\nThere are now more properties with four or more bedrooms (2.8 million homes) than with three bedrooms (2.6 million homes).\n\n\n\nThe proportion of three-bedroom dwellings declined in the 10 years between 2011 and 2021. Source: SBS News The emphasis on building higher-density apartment blocks with one or two-bedroom dwellings, as well as larger homes on the urban fringe, appears to be depleting the proportion of three-bedroom properties available.\n\n\n\n\n\nAustralian Housing and Urban Research Institute managing director Michael Fotheringham points out that Australia builds many more houses than apartments, and these are mostly concentrated on the urban fringes.\n\n\n\nFor each individual apartment, we build six houses and that continues.\n\n\"Seventy per cent of our housing stock is houses rather than apartments or townhouses. About 15 per cent is apartments and about 15 per cent is townhouses.\"\n\n\n\n\n\nBut the recent focus on building apartments could also be contributing to the scarcity of three-bedroom properties as family-friendly houses in desirable areas are knocked down to make way for apartments, and developers generally prefer to build one- or two-bedroom units.\n\n\n\n\n\nAny three-bedroom units included are often designed as luxury penthouses, making them unaffordable, or are designed to be rented, so they often don't have large living areas suitable for families .\n\n\n\n\n\nThe median price for a three-bedroom unit in Sydney is also higher than for a three-bedroom house, partly because units are often more centrally located .\n\n\n\nDevelopers shifting focus\n\nFlorian Caillon, head of acquisitions at property developer Third.i Group, says three-bedroom dwellings are generally more expensive and can take longer to sell, so some developers may not want stock sitting there for extended periods as they've got interest and other costs to consider.\n\n\n\n\n\nBut he says the group's research has found a spike in people saying they are interested in three-bedroom units in Sydney suburbs such as Gladesville and Crows Nest, and even Newcastle in NSW.\n\n\n\nWe've definitely seen that on the ground, that people are wanting larger units now because they're being priced out of the traditional home market.\n\nIn response, Third.i is changing its focus and the first stage of its new development in Crows Nest will have a greater emphasis on three-bedroom units.\n\n\n\n\n\nJames Alexander-Hatziplis, the chief executive officer of Sydney architecture firm Place Studio, says he has noticed a real shift in the market.\n\n\n\nThird.i's Crows Nest development Hume Place is expected to include more three-bedroom apartments suitable for family living. Source: Supplied \"Developers are starting to focus on apartments that work for a wider mix of people, not just first-home buyers or downsizers,\" he says.\n\n\n\n\n\n\"When you build slightly larger, more flexible apartments, especially with an extra bedroom, they simply last longer in terms of how people can use them.\n\n\n\n\n\n\"This is, at its core, a more sustainable outcome as it reduces the need to replace redundant housing that doesn't meet society's needs.\"\n\n\n\nPush for more family-sized homes\n\nProfessor of planning at Western Sydney University, Nicky Morrison, says previous policy settings haven't clearly signalled that three-bedroom homes are a priority and the market alone has not delivered family-sized apartments at scale.\n\n\n\n\n\n\"At present, we don't build enough well-located, family-sized homes,\" she says.\n\n\n\n\n\nShe stresses that governments should be encouraging developers to build more three-bedroom apartments because they give families and downsizers the ability to stay close to jobs, schools and transport, rather than pushing them to the fringe.\n\n\n\nBoth the Victorian and NSW governments have recently introduced new planning incentives to encourage more family-friendly housing.\n\n\n\n\n\nVictoria's townhouse and low-rise code enables homes of up to three storeys to be fast-tracked through the planning system. One in 10 homes will be required to have three or more bedrooms.\n\n\n\n\n\n\"The only way to make housing fairer for young Victorians is to build more homes faster — that's why we're delivering the biggest overhaul of Victoria's planning laws in decades, bringing Victoria's old-fashioned 'NIMBY' planning laws into the modern era,\" a Victorian government spokesperson says.\n\n\n\n\n\nAccording to a spokesperson for the NSW Department of Planning, Housing and Infrastructure, the state government is focused on increasing housing diversity through reforms such as the NSW Housing Pattern Book and its low and mid-rise housing policy.\n\n\n\n\n\n\"This will encourage development of a wider variety of homes suitable for families, including three-bedroom homes,\" the spokesperson says.\n\n\n\nOne of the designs from the NSW Housing Pattern Book that can be used to construct two side-by-side homes with two to four bedrooms each. Source: Supplied / Sibling Architecture The pattern book provides high-quality home designs for low and mid-rise housing that can be fast-tracked through planning processes. It includes terraces, row homes and mid-rise apartments.\n\n\n\n\n\nBut the spokesperson says councils are primarily responsible for establishing dwelling mix controls, including requirements for more three-bedroom homes, through their local environmental plans or development control plans.\n\n\n\n\n\nWhile Morrison agrees, she says state-level policy signals strongly shape what councils can mandate.\n\n\n\n\n\n\"That is why clearer guidance, incentives and design standards at the state level still matter.\"\n\n\n\nRelief could still be a few years away\n\nRawnsley says the impact of off-the-shelf plans for townhouses or medium-density development will take a few years to realise.\n\n\n\n\n\n\"We'll hopefully start seeing more of this missing middle townhouse coming into fruition over the next couple of years,\" he says.\n\n\n\n\n\n\"We've got lots of developers who build lots of Greenfield housing on the fringe, but we don't really have a very deep or established market of developers who really specialise in this townhouse market in large numbers.\"\n\n\n\n\n\nIt's hoped the supply of townhouses, terraces and other mid-rise apartments will provide another rung on the property ladder that’s more affordable than a standalone house.\n\n\n\nWhen asked whether he believes the concept of a property ladder still works, Rawnsley says the first step is getting much harder for first-home buyers to climb.\n\n\n\n\n\n\"But we know that apartments are more affordable, so apartments are still the first rung,\" he says.\n\n\n\n\n\n\"The next step up is going to be a more challenging one [than previously expected] — you have to build more equity, save more money to get to the house.\n\n\n\n\n\n\"Or you remain in that apartment for the long term. It becomes the final step on the property ladder, rather than the [first] one.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/darwin-braces-for-tropical-cyclone-finas-impact/rgz6zn0s2",
    "title": "Darwin braces for Tropical Cyclone Fina's impact",
    "publish_date": "Fri, 21 Nov 2025 08:18:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/us-rate-fears-trump-nvidias-better-than-expected-result/l3s5d95k7",
    "title": "US rate fears trump Nvidia's better than expected result",
    "publish_date": "Fri, 21 Nov 2025 06:56:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/its-happening-everywhere-advocate-says-mary-fowler-racism-incident-goes-deeper/kj0buoxg2",
    "title": "'That courageous girl': Matildas coach's support for Mary Fowler after alleged racism experience",
    "publish_date": "Fri, 21 Nov 2025 02:06:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "French football club Montpellier has issued a statement denying racism allegations made by Australian former player Mary Fowler, while the Matildas share their support alongside prominent sporting figures.\n\n\n\n\n\nIn her new book, Bloom, Fowler alleges she experienced racism from a teammate during her time with Montpellier.\n\n\n\n\n\nShe recalls there was a post-match presentation on the field for departing players, who were given flowers, but Fowler says she and a Dutch teammate, Ashleigh Weerden, were left out.\n\n\n\n\n\n\"Afterwards, when we got inside the changing room, some of our teammates questioned why we hadn't received any flowers,\" Fowler wrote.\n\n\n\n\n\n\"We shrugged our shoulders, just as clueless as they were.\n\n\n\n\n\n\"A few of the girls laughed about it and then one of the other players came over and handed my friend and me some bananas, saying, 'Here, have these.' That was the cherry on top.\"\n\n\n\nFowler said not receiving flowers was one thing, \"but as two of only six black girls in the squad, receiving bananas wasn't something I could laugh off and forget about it\".\n\n\n\n\n\nShe also shared other experiences at Montpellier, in a chapter titled Not So Great Days, admitting she considered quitting the sport during her time in France.\n\n\n\n\n\nMontpellier responded by saying there was no evidence to support Fowler's account and indicated it was considering legal action.\n\n\n\n\n\n\"Some of them are particularly serious, and the shortcut that results from them, portraying the club as a racist entity, is unacceptable,\" the club said in a statement.\n\n\n\n\n\nFowler joined Montpellier in 2020 at the age of 17 and spent nearly three seasons with the club before signing with Manchester City in 2022.\n\n\n\n'It's about time we call it out'\n\nIn an interview with SBS News, former AFL Women's player Akec Makur Chuot backed Fowler, saying she was proud of her for speaking out about her alleged experience.\n\n\n\n\n\n\"I think it's about time that we call it out and that our lived experiences are acknowledged and our dignity is respected as well because we're the victims,\" she said.\n\n\n\n\n\n\"It's not just only happening in France, it's happening everywhere. It's happening right here in Australia.\"\n\n\n\nFormer AFLW player Akec Makur Chuot said she's proud of Mary Fowler for speaking out about her alleged experience with racism. Source: AAP / Joel Carrett Chuot was drafted by Fremantle in the 2016 AFLW draft, making her debut in 2017. She later joined Carlton, Richmond and Hawthorn, playing 40 games across six seasons before announcing her retirement in 2023.\n\n\n\n\n\nShe said racism is an experience common for athletes.\n\n\n\n\n\n\"I know a lot of players that have just decided to walk away because of either racism or discrimination,\" she said.\n\n\n\n\n\n\"They've just decided it's better for their mental health and physical health.\"\n\n\n\nAbout Fowler's alleged experience, Chuot said by sharing such an incident, \"you're not just advocating for change for yourself, you're advocating for change for a lot of people\".\n\n\n\n\n\n\"In order for solutions to happen, it will take all of us, from people with really high profiles like Mary, to the people who are at the local clubs,\" she said.\n\n\n\n\n\nMatildas head coach Joe Montemurro has also come out in support of Fowler.\n\n\n\n\n\n\"The only reaction that I've got on that is 'that courageous girl',\" he told reporters in Sydney on Friday.\n\n\n\n\n\n\"It's a great example of what needs to be done. It's amazing to talk about these issues, which faces a lot of young sportspeople at the moment.\"\n\n\n\nLISTEN TO New study looks at racism in sport SBS News 00:53 English\n\nIn a social media post, former Socceroo captain Craig Foster also shared his support for Fowler, calling her \"brilliant and clearly very brave\".\n\n\n\n\n\n\"Racism is ever-present in society and, of course, sport all around the world, and athletes must be supported when exposing what they face daily,\" he wrote on X.\n\n\n\n\n\nA recent national survey by Sport Integrity Australia found nearly half of athletes and coaches who witnessed and experienced bullying, racism and body shaming choose not to report it formally.\n\n\n\n\n\nThe study surveying more than 1,200 community and professional athletes and coaches found 46 per cent of athletes would not report body shaming, 43 per cent racism, 40 per cent bullying, and 38 per cent inappropriate sexual behaviour.\n\n\n\n\n\nThe study noted the lack of formal reports was due to uncertainty about the seriousness of the issue or how to seek help.\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au . Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/power-banks-banned-planes-qantas-virgin-explainer/odb7ekq16",
    "title": "Potential 'severe' consequences: Why you won't be allowed to use these on some flights",
    "publish_date": "Fri, 21 Nov 2025 01:23:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Virgin Australia and Qantas are the latest airlines to restrict the use of power banks on planes after a spate of in-flight battery fires globally.\n\n\n\n\n\nVirgin Australia's new policy will come into effect on 1 December. Passengers will no longer be allowed to use power banks to charge other devices on board.\n\n\n\n\n\nPortable battery packs must also be kept within sight and easily accessible throughout the flight, meaning they should not be stored in overhead lockers.\n\n\n\n\n\nThere will be a limit of two power banks per person, with devices over 100 watt-hours requiring airline approval. Power banks exceeding 160 watt-hours will be prohibited.\n\n\n\n\n\nQantas and its subsidiary Jetstar will implement similar restrictions from 15 December.\n\n\n\nAt present, many airlines allow power banks in the cabin but not in checked bags due to the risk they could catch fire while unattended in the cargo hold.\n\n\n\n\n\nThis year, various carriers including Emirates, Cathay Pacific and Singapore Airlines have also moved to restrict the use of power banks in flight due to the risk of lithium batteries overheating and igniting.\n\n\n\n\n\nIt comes as passengers are increasingly travelling with power banks and other lithium-powered devices. An International Air Transport Association survey found that 44 per cent of passengers travel with a power bank, 83 per cent carry a phone and 60 per cent carry a laptop.\n\n\n\nPhones and laptops also use lithium batteries. Why are power banks the big concern?\n\nLithium-ion batteries can be highly flammable if manufactured incorrectly, stored inappropriately or damaged.\n\n\n\n\n\nAccording to Neeraj Sharma, a professor at the University of New South Wales' chemistry school, there's less quality control around power banks compared to phones and laptops, which typically come from more established brands.\n\n\n\n\n\nThere's been extensive testing of the batteries that go inside products from major tech companies such Apple and Samsung, he noted, but this may not be the case for products from some other brands.\n\n\n\nQantas and Virgin Australia join a host of other carriers blocking the use of power banks on board. Source: AAP / Paul Miller Wesley Dose, a battery researcher and senior lecturer in the School of Chemistry at the University of Sydney, said: \"Some lower quality, cheaper devices have fewer safeguards, which comes with an increased risk of an incident involving these products.\"\n\n\n\n\n\n\"Another reason behind some incidents involving batteries is improper handling and use, such as using the wrong charger or damaging the device.\"\n\n\n\n\n\nThe Australian Competition and Consumer Commission warned consumers in July there was a growing list of defective power banks that were at risk of overheating and catching fire.\n\n\n\nVirgin pledged to review its onboard battery policy after a fire, believed to have been caused by a power bank, broke out in an overhead locker on a flight from Sydney to Hobart in July. The plane landed safely and no injuries were reported.\n\n\n\n\n\nA faulty power bank was also the likely culprit of a fire in the overhead luggage compartment of an Air Busan plane in South Korea earlier this year, which severely damaged the aircraft and injured seven people.\n\n\n\n\n\nThe plane was preparing to take off from Busan's international airport for a flight to Hong Kong when the fire started.\n\n\n\nIs a power bank likely to catch fire on a plane?\n\nThe concern about power banks on flights is rooted largely in the fact that an aircraft is a far more dangerous environment for a potential fire.\n\n\n\n\n\nWhile battery fires are rare, the consequences can be quite severe, Dose explained, as they are difficult to put out and can release toxic gases.\n\n\n\n\n\n\"... the main challenge is that the potential consequences of an incident on a plane, especially while in flight, are more severe than other situations.\"\n\n\n\nREAD MORE Australians are obsessed with Japan, but a new travel hotspot is emerging\n\nWhy do lithium batteries catch fire?\n\nLithium-ion batteries are energy-dense; they store a lot of energy in a small space. If something goes wrong inside, that energy can be released suddenly as heat — in some cases, in the form of a fire or explosion.\n\n\n\n\n\n\"Batteries can sometimes catch on fire because they enter 'thermal runaway', where the temperature of the battery increases uncontrollably,\" Dose explained.\n\n\n\n\n\n\"This can happen for various reasons, including physical damage, exposure to heat, overcharging, and manufacturing defects.\"\n\n\n\n\n\nThe vast majority of lithium batteries, when manufactured appropriately, are safe, according to the experts.\n\n\n\nThe risk increases with manufacturing defects, damage from dropping or crushing, cheap or poorly made batteries, overcharging or incorrect storage.\n\n\n\nHow do I safely use power banks?\n\nCheaper power banks can often fail to include safeguards that prevent overcharging and overheating. Sharma recommends sticking with reputable suppliers.\n\n\n\n\n\nIt's also important to be wary that damage to a battery pack can significantly increase the risks.\n\n\n\n\n\nEven with a properly manufactured power bank, if you drop it and notice a dent, you should consider disposing of it, Sharma said.\n\n\n\n\n\n\"Taking responsibility of and looking after your batteries is important.\"\n\n\n\n\n\nThey should also be stored in a cool place, and you should unplug them once charged.\n\n\n\n\n\nIt's not advised to charge a power bank overnight.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/world/north-america/don-t-be-stupid-how-trump-is-losing-his-grip-on-maga-20251120-p5nh3z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Don’t be stupid’: How Trump is losing his grip on MAGA",
    "publish_date": "Sat, 22 Nov 2025 12:48:48 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This week, Donald Trump told MAGA supporters they were dumb. The US president was speaking at the US-Saudi Investment Forum before an audience that included Saudi Crown Prince Mohammed bin Salman, the world’s richest man Elon Musk and Nvidia chief executive Jensen Huang. Last month, chipmaker Nvidia became the world’s first $US5 trillion ($7.75 trillion) company by market capitalisation. Like its Silicon Valley brethren, it relies heavily on bringing skilled foreign workers into the US. In the MAGA universe of “America first”, that’s a thorny issue. American jobs are for Americans. But Trump knows better, and he made a point of it. If tech companies need to bring in foreigners to make chips and other advanced technologies, they should do so, he said – and the foreigners can teach Americans how to do it. Donald Trump is increasingly disagreeing with his MAGA base. Credit: Marija Ercegovac Those who railed against skilled migration were great patriots, Trump said, but they just didn’t understand the realities of the industry. “I’m sorry,” he said. “My poll numbers just went down – but with smart people, they’ve gone way up. “You can’t open up a massive computer chip factory for billions and billions of dollars ... and think you’re gonna hire people off an unemployment line to run it. They’re going to have to bring thousands of people with them, and I’m going to welcome those people.” Trump revelled in his defiance of MAGA orthodoxy. “I may take a little heat – I always take a little heat from my people,” he said. “I love my conservative friends, I love MAGA, but this is MAGA.”\n\nAdvertisement\n\nAlmost all political leaders disappoint their base. Labor lets down the true believers, the Liberals frustrate their right-wing flank. But the relationship between Trump and MAGA is altogether different. The president likes to say he created the movement, and MAGA is whatever he says it is. US President Donald Trump said “smart people” would appreciate his drive to bring in foreign workers to make chips. Credit: AP That symbiosis is being tested. At the pointy end is the Epstein files – now set to be released, to some extent at least, after Trump bowed to reality and signed a bill that will make them public. After resisting for months, the president has returned to the pre-election MAGA orthodoxy: that the Epstein files would primarily embarrass prominent Democrats and members of the so-called East Coast elite. But there are deeper reasons for the MAGA movement fissures. They span concerns about Trump spending too much time on foreign affairs, his position on China and Chinese students, and divisions over antisemitism, US support for Israel, the cost of living and artificial intelligence. Trump’s America is also not immune from the global ructions on immigration that are dividing Australia, Britain and Europe. Although the administration rapidly and successfully cracked down on unlawful immigration, it is legal migration – people coming on work visas from India, China, South Korea and elsewhere – that stirred the rift. It crystallised in a rare combative moment in an interview between Trump and Fox News host Laura Ingraham last week. Ingraham: “If you want to raise wages for American workers, you can’t flood the country with tens of thousands – or hundreds of thousands – of foreign workers.”\n\nTrump: “I agree, but you also do have to bring in talent.”\n\nIngraham: “We have plenty of talented people.”\n\nTrump: “No, you don’t. You don’t have certain talents, and people have to learn.”\n\nAdvertisement\n\nThe president was especially aggrieved by an immigration raid on a Hyundai factory in the state of Georgia in September, in which hundreds of skilled workers, mostly South Koreans, were arrested and accused of working unlawfully in the US. Lawyers said the employees had valid visas; some have since returned to the plant. “They were told to get out, and I said, ‘Stop it, don’t be stupid’, and we worked it out,” Trump told this week’s Saudi conference. Vice President JD Vance said divisions in the MAGA movement were fine as long as they did not detract from fighting “the enemy”. Credit: AP That’s all a markedly different message than the one delivered by Vice President JD Vance the next day at an event with right-wing news website Breitbart. In the grand Andrew W. Mellon auditorium on Washington’s Constitution Avenue, Vance departed from Trump’s usual claim that Americans’ present economic woes are entirely caused by his predecessor. “Let’s be honest, it’s not just Joe Biden ... we had a policy in this country for 40 years of shipping American jobs overseas and hiring foreign workers instead of American workers,” Vance said. “That has caused the economic stagnation of the American middle class.” While he was emphatic that the Trump administration is on the right path, Vance sounded a different tone to his boss’s regular insistence that prices are down and the economy is humming. “We get it, we hear you,” he told struggling Americans. “We understand that there’s a lot more work to do, and the thing that I’d ask for the American people is a little bit of patience.” Just as Trump was on stage with the Saudis, a panel on foreign work visas was under way at the Washington offices of the Heritage Foundation, a think tank that bills itself as the intellectual base of the America First movement.\n\nAdvertisement\n\nSimon Hankinson, the foundation’s senior fellow for immigration and border security, disputed that the US had a shortage of talent and skilled labour. If anything, he said, the skills shortfall was caused by “deep rot” in US educational institutions, where “meritocracy has been replaced with equity – everyone gets an A”. “The specialty workers that even big American companies really need – as opposed to want – should fit in a bus, and not a stadium,” Hankinson said. He was also at odds with Trump’s newfound enthusiasm for artificial intelligence, which the president proudly says America will dominate. Instead, Hankinson said AI was poised to take a wrecking ball to the job market. Loading “We all somehow think that it’s going to make us richer, it’s going to grow the economy, it’s going to make us more productive. But nobody has any clue what jobs are going to be left over. So, given this uncertainty, why would we put foreign workers’ needs ahead of those of our own graduates and our own workers?” Similar concerns have been raised by Republican congresswoman Marjorie Taylor Greene, the former MAGA diehard-turned-outspoken critic who has recently broken with the president on everything from Epstein to healthcare to foreign policy. “Promoting H1-B visas to replace American jobs, bringing in 600,000 Chinese students to replace American students … those are not ‘America first’ positions,” Greene told CNN last weekend.\n\nAdvertisement\n\nShe also scolded Trump for spending too much time overseas. “I said this to him: I would love to see Air Force One be parked and stay home, and there be nothing but a constant focus from the White House on a domestic agenda.” Marjorie Taylor Greene, right, attends a news conference on the Epstein files on Tuesday. Credit: AP Trump is publicly calling Greene – who on Saturday AEDT announced she would resign from Congress in January – a lunatic, a disgrace and a traitor. At a news conference with Epstein’s victims this week, she retorted: “Let me tell you what a traitor is. A traitor is an American that serves foreign countries and themselves.” Spending too much time overseas is a complaint that gets levelled at many world leaders, including Anthony Albanese and Britain’s Keir Starmer. Dennis Lennox, a Republican strategist, says it is usual for second-term presidents to elevate foreign affairs in importance as they look to secure their legacy on the world stage. Trump is proud of his efforts to end wars, and he has an eye on the Nobel Peace Prize. Loading But there is also friction in MAGA about foreign policy decisions. Plenty of “America first” subscribers question the US’s alliance with Israel and its funding of Israel’s defence. Others indulge antisemitic conspiracy theories about money and power. Republican senator Ted Cruz recently called out rising antisemitism on the right, and said it had to be reckoned with. That internal skirmish played out in dramatic fashion at the Heritage Foundation, when its president, Kevin Roberts, saw fit to defend commentator Tucker Carlson over his sympathetic interview with declared white supremacist and Holocaust denier Nick Fuentes.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/the-ashes-first-test-day-two-live-england-seek-last-wicket-of-shell-shocked-australians-20251122-p5nhkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes, first Test, day two live: England seek last wicket of shell-shocked Australians",
    "publish_date": "Sat, 22 Nov 2025 12:31:51 +1100",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Brendon McCullum’s Bazballers can smell the fear in Australia’s dressing room after their five-prong pace cartel inflicted physical and psychological trauma on the hosts on a frenetic first day of the Ashes.\n\nTwelve years after Mitchell Johnson terrorised an ageing England team, Australia’s band of veterans are facing a similarly frightful ordeal against one of the fastest pace battalions the old enemy has sent to these shores in decades.\n\nFormer England captain Michael Vaughan even called for Australia to send Mitchell Marsh an Ashes SOS after the home side crumbled under a fierce onslaught.\n\nBen Stokes bagged five wickets, capitalising on the brutality of Jofra Archer, who, along with Mark Wood, broke through the 150 km/h barrier. England’s average speed of 141 km/h is the highest they have managed in a Test since records began in 2006, according to data analysts CricViz. It is a speed rarely sighted among Sheffield Shield ranks.\n\nEngland’s Brydon Carse celebrates a key wicket with skipper Ben Stokes. Credit: AP\n\nSteve Smith’s men went from a position of control midway during the day, to being left shell-shocked and on their knees after a scarcely believable 19 wickets fell on a spicy Optus Stadium deck. Not since 1909 in Manchester has there been this many wickets tumble on the first day of an Ashes Test.\n\nLoading\n\nBrydon Carse, on Ashes debut, can sense the unease among the Australians.\n\n“I thought we were quite relentless as a group of seamers,” Carse said. “I think we bounce off each other. I think when you have Mark Wood and Jofra in your line-up, that’s always nice bowlers to have. There was pace and bounce throughout the wicket and the day.\n\n“I don’t think we really even realised it. It obviously was probably more unsettling for the Aussies.”\n\nRead more here.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/jake-paul-anthony-joshua-face-off-20251122-p5nhkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jake Paul, Anthony Joshua face off",
    "publish_date": "Sat, 22 Nov 2025 11:59:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jake Paul, Anthony Joshua face off\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/world/north-america/zohran-mamdani-quizzed-on-calling-president-trump-a-fascist-20251122-p5nhko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Zohran Mamdani quizzed on calling President Trump a fascist",
    "publish_date": "Sat, 22 Nov 2025 11:36:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Zohran Mamdani quizzed on calling President Trump a fascist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/world/british-columbia-premier-speaks-out-about-bear-attack-on-teachers-children-20251122-p5nhkn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "British Columbia premier speaks out about bear attack on teachers, children",
    "publish_date": "Sat, 22 Nov 2025 11:25:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "British Columbia premier speaks out about bear attack on teachers, children\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/how-line-dancing-and-the-veronicas-have-helped-the-blues-to-a-preliminary-final-20251117-p5ng3t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You babes are Untouchable’: Carlton embraced an anthem. The Veronicas replied",
    "publish_date": "Sat, 22 Nov 2025 11:12:57 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "On Saturday, Carlton posted a message on social media from The Veronicas – sisters Lisa and Jessica Origliasso – sending the Blues “the best energy”. “Hey babes, it’s The Veronicas, and we just wanted to wish you the best of luck for the game today. All of our love, all of our luck, we are sending you the best energy. You babes are Untouchable.” Cordner, who was named in this year’s All-Australian squad, said the team had perfected the balance between hard work while also leaning into the fun side of footy. “Over the years, I’ve probably swayed a little bit too far to the serious side, but this year I’ve really leaned into some of the young girls and the spirit they’ve brought and their ability to have fun,” she said.\n\n“So it’s helped me feel really free on the field and I think it also helps the young girls being able to play footy and not stress too much about the occasion or the outcome.” One of Carlton’s most exciting young players is 19-year-old Sophie McKay – daughter of Carlton great Andrew McKay and sibling to captain Abbie. McKay has kicked 15 goals in her debut season but her antics after she kicks a major have garnered her a legion of fans. Between her fake hammy injury turned “stanky leg” to her fake shoulder injury into the shimmy, McKay’s post-goal celebrations have garnered thousands of views across social media\n\n“She’s [Sophie] such a character, she’s always asking people for celebration ideas and I tried to tell her she should do the moon walk, but she couldn’t do it in her boots,” Cordner said. “She’s a really good example of someone who has come in willing and wanting to work and improve all the time. “But she’s also got a good balance of just enjoying the experience and her energy brings other people along, which is a really great quality to have in a person and also a player.” If you need any further indication of Carlton’s infectious energy, just take a look at the fans filling Ikon Park over the past few weeks. This year, an average 2563 have attended AFLW games. However, Carlton’s recent semi-final win over Hawthorn pulled 5645 fans. Little kids wait near the boundary lines to have guernseys signed by players such as Darcy Vescio or Scholz, while others hope to grab Mimi Hill’s prized boots or socks.\n\nCarlton’s cheer squad is even making the 17-hour drive to Brisbane this weekend to cheer on the Blues. Fun and games aren’t the only thing behind the Blues’ rise. Loading Cordner arrived at Princes Park in 2023 – the same year Carlton wrapped up their independent review into their AFLW program after a disappointing two seasons with minimal wins. The review led to high staff turnover including the departure of several players and coach Daniel Harford. For Cordner – who played at both Melbourne and Richmond – Carlton’s investment in the women’s program, including employing full-time high-performance staff and coaches, has been pivotal to their success.\n\n“I’ve obviously played at two other clubs, and every club does it really differently, but I think the way the whole club has backed the W program in since the review has been really evident to me,” she said. Loading “I think we’re reaping the rewards of that investment from two years ago and seeing it come to fruition.” The next hurdle ahead of the Blues is Brisbane, whom they beat in Queensland earlier this season. But the Lions are finals veterans – this will be their seventh straight preliminary final – and are backed by some of the most experienced players in the comp. While Cordner acknowledged Carlton’s lack of finals experience, she said the Blues were ready to take the fight to Brisbane.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "An ‘eternal showgirl’ puts a new spin on a grim classic about a woman cursed to dance forever",
    "publish_date": "Sat, 22 Nov 2025 11:05:00 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn",
      "Andrew Fuhrmann"
    ],
    "text": "Meow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/daly-cherry-evans-was-still-doing-his-bit-for-manly-just-a-few-weeks-ago-20251121-p5nhhi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daly Cherry-Evans was still doing his bit for Manly just a few weeks ago",
    "publish_date": "Sat, 22 Nov 2025 10:41:25 +1100",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "A few weeks ago, before he put pen to paper with the Sydney Roosters, Daly Cherry-Evans was still doing his bit for Manly.\n\nThe Manly champion was unveiled in Roosters colours for the first time on Thursday, but made a point of remaining in contact with his eventual No. 7 successor at the Sea Eagles, Joey Walsh.\n\nJoey Walsh at Manly training on Friday. Credit: Peter Rae/SMH\n\nThe pair even caught up a handful of times at the local park at Curl Curl, where both players reside, and kicked the ball around.\n\nAt 19, Walsh is likely to start next season in NSW Cup, or with a bit of luck on the NRL bench. Canberra recruit Jamal Fogarty and Luke Brooks will be the starting halves.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/tsarukyan-headbutts-hooker-20251122-p5nhki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tsarukyan headbutts Hooker",
    "publish_date": "Sat, 22 Nov 2025 10:29:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "Tsarukyan headbutts Hooker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/bunnings-gears-up-to-host-an-epic-live-music-gig-20251122-p5nhkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bunnings gears up to host an epic live music gig",
    "publish_date": "Sat, 22 Nov 2025 09:52:07 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Bunnings gears up to host an epic live music gig\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/gender-is-a-spectrum-sport-is-binary-why-an-ioc-decision-is-anything-but-straightforward-20251120-p5ngzn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gender is a spectrum; sport is binary. Why an IOC decision is anything but straightforward",
    "publish_date": "Sat, 22 Nov 2025 09:33:00 +1100",
    "category": "sports",
    "authors": [
      "Darren Kane"
    ],
    "text": "Major international federations, including World Athletics and World Aquatics, have in recent years adopted policies where the core ethos is to deem ineligible in female competition any female transgender athlete. The exception is where they either never experienced male puberty, or had their male puberty pharmacologically prevented before their 12th birthday and before any physical signs of male puberty were physically detectable. Which basically rules out 99 per cent of transgender athletes. Algerian boxer Imane Khelif was caught in a storm of controversy at the 2024 Paris Olympics. Credit: AP, Eddie Jim Some other sports have proceeded in the opposite direction. At least for a time. Up to now, the IOC’s position has remained uncertain, tepid and of little assistance. In late 2021, the IOC published its Framework on Fairness, Inclusion and Non-Discrimination on the Basis of Gender Identity and Sex Variations. Six pages or thereabouts of statements of principle, but wafer-thin on detail.\n\nIn 2021, the IOC stated the position that athletes should be permitted passage to compete in the gender competition that best aligns with their self-determined gender identity. The IOC also passed the buck onto the international federations, by legislating that they make their own rules to ensure no athletes are afforded unfair competitive advantages if permitted to compete in a gender category different to their biological gender. All of which stirred a quagmire. Those two competing principles are impossible to align. For example, factors of political skulduggery and corruption at the international federation level caused the IOC to have to run boxing at the 2024 Olympics in Paris. And look how that worked out. The IOC’s dithering did incredible harm. ‘An IOC blanket ban on transgender women will face serious legal obstacles. That much is certain.’ Designing, implementing and enforcing appropriate transgender policy in sport, at the grassroots level or in Olympic competition, can’t be about fear or creating division for the sake of doing so. It’s a devilishly complicated dance, weighing up the interests of transgender athletes against those of cisgender competitors. While simultaneously protecting the integrity of competition. It’s a zero-sum game – there has to be a loser in there somewhere.\n\nDesigning policy to integrate transgender athlete participation in elite sport, while shielding sports from rampant attacks on the integrity of competition itself, is more complex than solving a Rubik’s Cube with a blindfold on. Gender is a spectrum; sport is binary. Besides horse racing, darts, some classes of motor racing and mixed doubles tennis, men and women don’t compete directly against each other. I’d never try to tell someone what to think about matters so fundamental. But for what it’s worth, in my view, the IOC’s absolute imperative must be that transgender athletes be prohibited from competing in Olympic competition in the gender they identify with, if to instead allow those athletes the freedom of choice would by consequence give those athletes a material competitive advantage in terms of strength, stamina, size or endurance. Whatever leadership position the IOC must take to set such rules within that philosophy, it must do so.\n\nOtherwise, how might the core integrity of elite sport suffer? ‘It’s a devilishly complicated dance, weighing up the interests of transgender athletes against those of cisgender competitors.’ Straightforward? Yes, but at the same time, hardly. Harsh, definitely. Necessary, yes. If the IOC takes that same stance when its new policies are announced, there’ll be little scope for interpretation or manipulation through subjectiveness. No element of the application of those rules requires measurement or monitoring. Experts who know more than I do will tell you that the medical and scientific evidence isn’t absolute in demonstrating that transgender athletes, and male-to-female transgender athletes in particular, are benefited by everlasting physical and physiological advantages over their cisgender fellow competitors. But other subject-matter experts will tell you that if a person is born male, there are certain physiological and strength advantages that can’t be muted through pharmacological means. It’s impossible to conclude with certainty the position that’ll prevail three decades on. But that uncertainty alone can’t be the reason for the IOC and governing bodies to remain stationary until science and medicine arrives at a consensus beyond definitive. To do that would fail the current and next generation of Olympians.\n\nBack to the question however: will an IOC across-the-board ban on all transgender and DSD women, from competing in the female Olympic competitions categories, stand impervious to the inevitable legal challenges that will follow? Caster Semenya and her lawyer Gregory Nott arrive at a Court of Arbitration for Sport hearing. Credit: AP Last July, the Grand Chamber of the European Court of Human Rights delivered its final judgment in Caster Semenya’s legal challenge against Switzerland. The ECHR in its judgment found Switzerland violated article 6(1) of the European Convention on Human Rights because the Swiss Federal Tribunal failed to conduct a sufficiently rigorous examination of the Olympic champion’s earlier challenge to the Court of Arbitration for Sport concerning World Athletics’ rules relating to DSD athletes, of which Semenya is one. While the ECHR judgment focused primarily on procedural fairness rather than the substantive discrimination claims made by Semenya, the decision has profound implications for sports governance, and challenges that may be brought against any rules the IOC implements. The ECHR decided that the limited supervision exercised by the Swiss Federal Tribunal – Switzerland’s highest court – over CAS awards was insufficient to comply with Switzerland’s positive obligations under the European Convention on Human Rights, to ensure that no individual under its jurisdiction suffers discrimination.\n\nLoading Put differently, the decision strikes at the idea that the IOC, and IFs, have ultimate autonomy in regulating athlete eligibility. For the IOC’s rules to withstand legal attack, the IOC must lay out a robust and irresistible scientific case demonstrating consistent, unfair, and disproportionate advantages that cannot be addressed through less restrictive measures. The IOC will need to introduce a transparent and procedurally fair system to all athletes affected. The IOC will also be required to prove why a complete ban on all transgender athletes from the female category is the only available solution. That approach must also comply with all applicable human rights standards, and particularly so the same ones that were fallen foul of in the handling of Semenya’s matter.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/oceania/the-conundrum-facing-asia-s-richest-man-as-pressure-grows-over-russian-oil-20251118-p5ng8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The conundrum facing Asia’s richest man as pressure grows over Russian oil",
    "publish_date": "Sat, 22 Nov 2025 09:30:00 +1100",
    "category": "finance",
    "authors": [
      "Zach Hope"
    ],
    "text": "Advertisement\n\n“Australians do expect businesses to prevent their supply chains from inadvertently funding Russia’s conflict against Ukraine, and we have asked businesses to uphold that responsibility,” she said. This is all good from an Australian perspective, but the company does not appear to be halting the Russian flow to the other part of its Jamnagar operations, supplying the hungry and hungrier domestic market of 1.4 billion people. This could be a problem for US President Donald Trump. Ostensibly fed up with Putin and his illegal war in Ukraine, he stunned India in August by imposing tariffs of 50 per cent, citing half of that as punishment for the country’s large-scale importation of Russia’s war-funding oil. Reliance managing director and chairman Mukesh Ambani. Credit: Bloomberg The Indian government called it “unfair, unjustified and unreasonable”. After all, China takes more Russian crude than India. Turkey, Hungary and Slovakia are also importers. None of these nations copped Russia-related tariff punishments. Analysts have noted the hypocrisy. But the not-insignificant context is this: The US and India – the world’s biggest economy and the world’s most populous country – are in the midst of negotiating a globally consequential trade deal. Trump, as he says himself, likes to deal from positions of strength.\n\nAdvertisement\n\nThings get more serious from today. That is when US sanctions kick in on Russian crude oil producers Rosneft and Lukoil, following Australian sanctions on the same companies in 2023. Analysts told this masthead that the US cracking down meant it was unlikely for Indian refiners, except one facility already sanctioned by the European Union, to continue those particular lines of trade. Or at least openly. The Reliance refinery at Jamnagar is a money-making machine for Mukesh Ambani. Credit: Bloomberg Kpler, a global real-time data tracker and provider of analytics, has noted a shift in Russian crude trading behaviour, “marked by mid-voyage diversions between India and China and ship-to-ship transfers at unusual locations such as off Mumbai’s coast – far from the typical transfer zones near the Singapore Strait,” senior analyst Sumit Ritolia said. “These developments reflect evolving logistical tactics by Russian exporters navigating tightening Western sanctions.” Ritolia told this masthead he expected a noticeable drop in Russian crude flows to India in the near term, particularly through December and January. Refiners would likely then “proceed more cautiously, relying on unsanctioned traders, blended barrels, and more complex logistics to minimise OFAC [the US Office of Foreign Assets Control] exposure”.\n\nAdvertisement\n\nBut the elephant in the room is that only Rosneft and Lukoil have been sanctioned. Other Russian entities, such as Surgutneftegas and Gazprom Neft, have escaped the US glare and may be able to legally fill some of the Indian breach. Putin’s oil barons have found a strong mid-war market there because India produces hardly any of its own crude. And the nation of 1.4 billion people – hundreds of millions of whom remain below the poverty line or near its threshold – needs more and cheaper energy. According to the International Energy Agency, India will be the largest source of global oil demand growth between now and 2030. Russian President Vladimir Putin meets Indian Foreign Minister Subrahmanyam Jaishankar at the Kremlin on Tuesday. Credit: AP It helps the oil trade that India and Russia share strong ties. They are seeking to work even more closely on matters of space, technology, defence and trade. India’s Jaishankar is a regular visitor to Moscow. Putin welcomed him again just this week. Reliance is not the only Indian importer of Russian crude. But it is the biggest. Its next moves may play an outsized role in US-India trade negotiations and the health of Putin’s war chest. Australians not au fait with the oil trade might know the Ambani name from such 2024 headlines as “What we know about the Ambani wedding”, covered by Vogue, and which was estimated to have cost almost $1 billion.\n\nAdvertisement\n\nThe wedding was for one of Ambani’s sons, Anant, to Radhika Merchant, another child of extremely wealthy Indians. At the pre-parties and eventual celebration were guests including Mark Zuckerberg, Bill Gates, Kim Kardashian and Ivanka Trump. Popstar Rihanna was one of the performers. Not bad for a man born into modest beginnings in Mumbai. People walk past the Antilia mansion in Mumbai, house of billionaire Mukesh Ambani, lit up for the wedding of his son Anant Ambani and Radhika Merchant. Credit: AP Kim and Khloe Kardashian at the wedding last year. Credit: Kim Kardashian/Instagram Billionaire Mukesh Ambani, third left, stands with sons Akash and Anant, wife Neeta, daughter Isha and daughter-in-law Shloka at Anant’s wedding. Credit: AP It was the nous of Ambani’s father, Dhirubhai, though, that put the family on its eye-watering trajectory, turning a small yarn-trading business that he opened in 1957 into a publicly traded company by the late 1970s. This was about the time Ambani, now 68, went to the US to study for an MBA at Stanford University. He never finished it, according to a New York Times profile, because Dhirubhai called him back to work in the business.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/australia-has-an-8-billion-public-pool-problem-is-this-the-solution-20251119-p5ngs0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia has an $8 billion public pool problem. Is this the solution?",
    "publish_date": "Sat, 22 Nov 2025 09:30:00 +1100",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "About 40 per cent of Australia’s ageing public swimming pools will be obsolete by 2030; a looming crisis compounded by climate change, increased demand and a rising drowning rate.\n\nThe cost to replace them? Eight billion dollars, including $2.7 billion in NSW and $3 billion in Victoria – and that doesn’t include the cost of building entirely new pools as the population grows.\n\n“That’s scary,” Royal Life Saving NSW chief Michael Ilinsky told a meeting at NSW Parliament House on Friday, where he pitched modular prefabricated pools as a potential solution to cut costs.\n\nIt could cost as much as $8 billion to upgrade Australia’s ageing public pools. Credit: Janie Barrett\n\nInspired by the NSW government’s pattern book of designs to fast-track low to medium density housing, the 130-year-old organisation has worked with global architects Cox Architecture on a pattern book of modular designs called the Future of Swimming Pools.",
    "source": "TheAge",
    "cluster_id": 28
  }
]