[
  {
    "url": "https://www.9news.com.au/national/aukus-shipyard-gets-multibillion-government-investment/b4f145f1-e7f7-4732-bcc5-83d075e9ed37",
    "title": "PM makes 'downpayment' on $30 billion shipyard to build nuclear submarines",
    "publish_date": "Sun, 15 Feb 2026 02:28:00 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "P﻿rime Minister Anthony Albanese today announced a multi-billion dollar investment in an Adelaide shipyard to train workers in building AUKUS nuclear-powered submarines.\n\nHe said the $3.9 billion cash injection into the Osborne shipyard by the federal government was a \"downpayment\" for the facility, which will support the 10,000 skilled workers required to build the vessels.\n\nAlbanese confirmed today the total cost will be $30 billion, as forecast by the Australian Naval Infrastructure.\n\nPrime Minister Anthony Albanese today announced a $3.9 billion cash injection into an Adelaide shipyard building nuclear submarines. (Alex Ellinghausen)\n\nUnder the AUKUS agreement, the Australian navy will acquire eight nuclear-powered (but not nuclear armed) submarines over the next decade from the United States and Britain.\n\nThe federal government says 5500 jobs will be created at the shipyard, with thousands more ﻿indirect roles stemming from the shipyard's construction programs.\n\n\"This is a driver of not just of national security and how were going to defend our nation into the future,\" Albanese said.\n\n\"It's also a driver of our economic prosperity, as well as making such an enormous difference to some of the apprentices that we've met here today.\"\n\nSpeaking alongside the prime minister, Defence Industry Minister Pat Conroy said the Adelaide shipyard would be the only in the southern hemisphere capable of constructing nuclear-powered submarines﻿.\n\nAustralia will acquire US-built Virginia-class nuclear submarines under the first stage of the AUKUS agreement. (US Dept of Defence) (US Department of Defence)\n\n\"Importantly, this will modernise Aussie manufacturing as we go through it because it's not just the 10,000 jobs here,\" he said.\n\n\"We've got 70 companies already going through the qualification process to win work supplying not just Australian submarines but UK and US submarines.\"\n\nAUKUS was signed five years ago by the leaders of Australia, the US and UK in a move aimed at deterring China's assertiveness in the Pacific.\n\nDoubt over the future of AUKUS emerged last January when US President Donald Trump was sworn in.\n\nHe ordered a review of the defence pact by the Pentagon, concerned it did not meet his \"America first\" agenda.\n\nThe agreement hung in the balance for months until the US Defence Department gave the green light in September. ﻿\n\nLater, Trump warmly endorsed AUKUS when he hosted Albanese at the White House, saying it was \"full steam ahead\".",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/nsw-extra-public-holiday-anzac-day-2026-2027-chris-minns/492368d9-c4f6-4740-9e2b-0b2ff4a9beb8",
    "title": "NSW to get an extra public holiday for the next two years",
    "publish_date": "Sun, 15 Feb 2026 00:54:53 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "NSW will have an extra public holiday on Anzac Day weekend for the next two years, Premier Chris Minns has confirmed.\n\nPreviously in the state, if Anzac Day on April 25 fell on a weekend, there would not be an official public holiday.\n\nHowever, Minns announced this morning the government will implement a trial that will see the state gain a public holiday on April 27 this year and April 26 next year.\n\nThis is because Anzac Day falls on Saturday and Sunday for the next two years.\n\nThe premier insists Anzac Day itself will remain a solemn occasion. (Sam Mooy)\n\nThis is now in line with Western Australia and the ACT , which have already implemented an extra public holiday when Anzac Day falls on a weekend﻿\n\nMinns believes the holiday will allow people to spend more time with their friends and families, while not detracting from the importance of Anzac Day itself.\n\n\"We believe that this additional public holiday was the right thing to do,\" he said. \"This cannot detract from the overall importance of Anzac Day, I don't think it will.\n\nMinns conceded some business owners would not agree with the decision. (Nine)\n\n\"NSW residents can be trusted with this public holiday in the fact it won't detract from the solemnity.\"\n\nMinns had flagged a potential change late last month , ﻿claiming the state has less public holidays than the rest of Australia.\n\nHe conceded the decision may not be popular with business owners.\n\n\"We've also spoken with business, not all business groups are supportive of this change, and it's important that we recognise that,\" he said\n\n\"We know it's somewhat of an additional burden for small business in particular, but this is an important thing we need to do for the state.\n\n\"We are not dismissing that opposition but on balance we believe that this additional public holiday was the right thing to do.\"\n\nREAD MORE: Milo snack bars recalled over contamination alert ﻿\n\nVince Williams said the RSL NSW board ultimately decided to support the move, after a survey of members was split in support and opposition. (Nine)\n\nThe decision was made after discussions with RSL NSW, who ultimately endorsed the decision.\n\nActing President Vince Williams admitted a survey sent to members was evenly split in support and opposition for an additional public holiday, but said the RSL NSW board ultimately voted in favour of it.\n\n\"We have a very broad church, and like many volunteer organisations, we have members who are opposed to change, and it's a case of bringing them along,\" Williams said.\n\n\"The great concern was what if something happened to the 25th, nothing is going to happen to the 25th, the 25th will be the day where all the commemorations will take place.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/taking-on-the-family-business/106303408",
    "title": "'Don't be the generation to stuff it up': The reality of running the family business",
    "publish_date": "Sun, 15 Feb 2026 02:46:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sam Mackaway's future has been planned for as long as he can remember.\n\n\"I always wanted my family to grow up on a farm,\" he says.\n\nHe's a third-generation cattle farmer in Walcha, New South Wales, and now with a young family of his own, he's realising his dream.\n\n\"The property's been in our family for 27 years. It's 2,800-and-a-bit acres and a beautiful part of the world to raise my kids,\" he tells ABC iview's Muster Dogs.\n\nSam Mackaway wouldn't want to raise his kids anywhere else. (ABC/Ambience Entertainment: Brook Rushton)\n\nEventually, Mackaway will inherit the family business, but it comes with conversations about succession, debt and leaving his mark.\n\nAccording to the Australian Small Business and Family Enterprise Ombudsman, seven out of 10 businesses in Australia are family-owned.\n\nWhile family businesses are in every industry, 25 per cent of workers are in agriculture, forestry and fishing.\n\nCorrina Wright is the sixth generation to run her family's business, Oliver's Taranga Vineyards in McLaren Vale, South Australia, and says it's a privilege to continue the legacy.\n\n\"You're very lucky that you've landed in the spot where you are and being able to be part of such a long family lineage,\" she says.\n\n\"But then there's a little bit of pressure in that, because you don't want to be the generation to stuff it up.\"\n\nCorrina Wright works closely with her cousins on the family business. (Supplied: Gilbert Bages)\n\nEyes on the future\n\nWhile Mackaway always knew he wanted to settle on the farm, he had to work hard to earn his place.\n\n\"My brother and I got told when we were younger that we needed to go and do something before we came back to the farm, we needed to get a trade or go to uni or just do something, because anything that you come back with to the farm helps,\" he says.\n\n\"I was quite keen on becoming a sparky [electrician], so I moved away and did that. I don't use it every day, but I use it quite a lot on the farm, just being able to make stuff.\"\n\nDespite the generations of knowledge passed down, Mackaway knows he needs to look to the future if he wants the business to thrive for years to come.\n\nModernising the family business is one way Sam Mackaway is securing the farm's future. (ABC/Ambience Entertainment: Brook Rushton)\n\nIn doing so, he's introduced modern technology into his day-to-day work.\n\n\"I'm driving around in a tractor with a GPS and auto steer, whereas Dad's driving around in a tractor just using his eyes, trying to see the lines,\" he says.\n\nWhile his father is an expert in using machinery to move cattle, Mackaway has taken on the challenge of learning how to introduce working dogs onto the farm.\n\nHe's also introducing a data-tracking system to streamline his processes, which will enable him to track cattle weights and growth, as well as lineage and which bulls are working with which cows.\n\n\"I'm a few weeks away from releasing a farm management app. We do have a fair few headaches just tracking our cattle.\"\n\nIn Wright's family business, each generation has brought its own focus to the business. In her case, it was expanding from just selling grapes to starting their own brand.\n\nCorrina Wright's business has evolved in the hands of her generation. (Supplied: Gilbert Bages)\n\n\"You've gone from a business that didn't really care about what happened at the farm gate, your grapes were gone, and you didn't need to worry about marketing or any of that sort of stuff,\" she says.\n\n\"Now you're running a business that can employ a whole pile of different people, not just tractor drivers, and you've got customers coming to you, and you've got marketing to do, you've got design and social media and all those sorts of things — the generational difference is huge.\"\n\nThose changes took a little while to get used to.\n\n\"The pressure back in the early days was to not stuff that up and to respect the family name that was going on a wine label,\" Wright explains.\n\n\"Now I feel a bit more proud that our generation has been able to contribute significantly to assisting the business and strengthening it into the future as well.\"\n\nPlanning ahead\n\nEvery five years, Mackaway sits down with his family to discuss succession planning.\n\nHis father's own experience has influenced the handover process with his son.\n\n\"My grandfather decided that he wasn't ready to retire. He wanted to keep going for a bit longer, and Dad thought, 'I'm going to be 65 by the time you want to retire and not run [the] place how I want to run it'. So he's very aware of that in the discussion about succession planning.\"\n\nBut while family businesses can bring some challenges, Mackaway says having family support has offered vital help with the costs of expanding and setting up the property he owns with his wife, Laura.\n\n\"As long as we're happy to all work together, we can get that debt down a lot quicker than if Laura and I were to move away and do our own thing. That'd take us a long time.\"\n\nSam Mackaway plans to continue working with family. (ABC/Ambience Entertainment: Brook Rushton)\n\nFor Wright, she says it's been important to have advisers who are non-family members, to keep their vision on track — but she's looking forward to creating opportunities for more family members in the future.\n\nAnd while past generations were limited to farming work, roles could now be anything from a graphic designer to a lawyer.\n\n\"Legacy just means we've left it in a better spot than what we received it,\" Wright says.\n\nHer daughter is already working for the company one day a week.\n\nMeanwhile, for Mackaway and prospects of a fourth generation in the business, only time will tell.\n\nStream the new series of Muster Dogs free on ABC iview.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/queensland-marathon-swimmer-crosses-cook-strait/106335994",
    "title": "Treacherous strait swim the latest step to ocean challenge dream",
    "publish_date": "Sun, 15 Feb 2026 02:00:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Swimming in shark-infested waters across one of the most treacherous island crossings in the world is not high up on most people's holiday bucket lists.\n\nBut for Townsville woman Liz Denyer, conquering the 22-kilometre Cook Strait between New Zealand's North and South islands was a challenge worth travelling for.\n\n\"Every swim has a different story and something that you learn about yourself,\" she said.\n\nThe water was 14 degrees when Liz Denyer swam the Cook Strait. (Suppled: Liz Denyer)\n\nThe 51-year-old is among a small but growing number of marathon swimmers who take on open-water swims longer than 10 kilometres.\n\nMs Denyer said conditions for her Cook Strait crossing on February 9 were \"magnificent\", except for the masses of stingers.\n\n\"They got me everywhere. There was a bit of swearing going on,\" she said.\n\n\"I can't count, there were lots.\"\n\nIt took Ms Denyer eight hours and 20 minutes to swim the strait, covering 26.6 kilometres in total due to currents.\n\nThe Cook Strait is 22km at its narrowest but swimmers cover longer distances due to currents. (ABC News: Sharon Gordon)\n\nAbout 30 people complete the Cook Strait crossing each year. It is one of seven open-water swims that form a marathon swimming challenge known as the Ocean Seven.\n\nIn 2023, Perth swimmer Andy Donaldson set the record for the fastest crossing in four hours and 33 minutes.\n\nTesting her limits\n\nMs Denyer said the swim was about putting her body to the test, but she did not let the adrenaline stop her from appreciating her surroundings — despite the water being 14 degrees.\n\n\"I looked ahead and there was this beautiful sunrise … this is why I do marathon swimming,\" she said.\n\n\" The water was calm and glassy and beautiful. \"\n\nIt was those positive thoughts that helped her keep swimming in a straight line for the next eight hours, she said.\n\nLiz Denyer's father Tris and his wife Gail were part of the support crew. (Supplied: Liz Denyer)\n\nHer support team, including her former coach as well as family and friends, accompanied Ms Denyer by boat, throwing her food every 30 minutes and providing encouragement during the entire swim.\n\nBitten by the bug\n\nAlthough Ms Denyer lives and works as a radiation therapist in Townsville, her passion for marathon swimming was kindled far away from her tropical hometown when she joined a London swimming group in 2017.\n\nSoon after Liz Denyer began her Cook Strait swim she encountered many bluebottle jellyfish. (Supplied: Liz Denyer)\n\nOn her first day, another member told her he had recently swum 46 kilometres around Manhattan Island, to which Ms Denyer responded: \"Why would you ever want to do that?\"\n\nBut it was not long before she said she was \"bitten by the bug\" and decided to swim 14.4 kilometres across the Gibraltar Strait later that year.\n\nShe then ticked off the 33-kilometre English Channel in 2023 and the 32.3-kilometre Catalina Channel in 2024.\n\nAfter finishing the Cook Strait, Ms Denyer's eyes are set on the final three Ocean Seven swims — the North Channel between Ireland and Scotland, the Molokai'i Channel in Hawaii, and the Tsugaru Strait in Japan.\n\nLiz Denyer works as a radiation therapist and trains before her shifts. (Supplied: Townsville Hospital and Health Service)\n\nA growing sport\n\nMs Denyer is the typical demographic of a marathon swimmer, according to Marathon Swimming Australia president Christian Renford.\n\nHe said participation across Australia was growing and skewed towards people older than 35, as the sport had a low impact on the body.\n\nChristian Renford says marathon swimming is increasing in popularity. (Supplied: Christian Renford)\n\n\"We've got people as old as 65 floating around still doing some stunning and absolutely remarkable swims,\" he said.\n\n\"When people get a bit more mature in age, you like to set those goals that are very much aspirational.\"\n\nHe said marathon swimming appealed to people because completing the swim was more important than speed.\n\n\"It's not about the time, it's about the distance,\" he said.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/down-payment-for-30b-adelaide-submarine-shipyard/106346484",
    "title": "PM announces $3.9b 'down payment' towards $30b submarine shipyard",
    "publish_date": "Sun, 15 Feb 2026 01:59:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "The South Australian and federal governments have released plans worth $30 billion for a shipyard in Adelaide that will build at least eight nuclear-powered submarines under the AUKUS pact with the US and the UK.\n\nPrime Minister Anthony Albanese announced that the Commonwealth would make a $3.9 billion \"down payment\" towards the work at Osborne, with the rest of funding to \"flow continuously\" over the rest of the shipyard's construction, due to be complete in 2040.\n\nOn top of enabling works worth $2 billion, construction has already started on a fabrication area worth $5 billion and a Skills and Training Academy worth $500 million.\n\nThe new fabrication hall for submarines will be 420 metres long — more than twice this one at the Osborne South shipyard. (ABC News: Stephen Opie)\n\nThe shipyard's developer, Australian Naval Infrastructure (ANI), a company owned by the federal government, estimated the next stage, an outfitting area, would cost $8 billion to build, while an area for consolidation, testing, launching and commission would cost more than $15 billion.\n\nThe state government estimated at least 4,000 workers would design and build the submarine construction yard, while 5,500 workers would support nuclear-powered submarine production at its peak.\n\nThe SSN-AUKUS submarines are based on the design of the British Astute-class submarine. (Supplied: British High Commission)\n\nLong time frame for delivery\n\nThe submarines are being built as part of the $368-billion AUKUS submarine pact announced in 2021.\n\nIt replaced a deal to build French-designed submarines, also in Adelaide.\n\nThe first part of the plan is for Australia to buy between three and five nuclear-powered submarines from the US, beginning in the early 2030s, including at two second-hand Virginia-class submarines.\n\nFive of the eight SSN-AUKUS nuclear-powered submarines are due to be delivered by the middle of the 2050s, with the final three delivered in the 2060s.\n\nVice Admiral Jonathan Mead from the Australian Submarine Agency points out different parts of the new shipyard. (ABC News)\n\nVice Admiral Jonathan Mead, the director-general of the Australian Submarine Agency, said experts from the US and the UK had been in Adelaide advising the build.\n\nHe said the manufacturing process at Osborne would be \"identical\" to the shipyard building submarines in the UK.\n\n\"Their facilities are 120 years old; ours will be the most modern submarine yard in the world,\" Vice Admiral Mead said.\n\nAUKUS deal details The final details of Australia's first nuclear submarine fleet have been unveiled — along with the price tag.\n\nMr Albanese said the construction work and then the work building submarines would provide thousands of jobs into the future in Adelaide.\n\n\"If you're a 15 or 16 year old thinking about what am I going to do with my life, you can be assured that there will be well-paid, secure jobs here in Adelaide and you'll get … that satisfaction of seeing what you are creating as a product of your labour and knowing that it is very much your contribution as well to our national interest for decades ahead,\" Mr Albanese said.\n\n\"We do live in an uncertain world, but we can be certain of the economic benefit to the tune of $30 billion going forward here in South Australia.\"\n\nPremier Peter Malinauskas talks about the planned expansion of the Osborne shipyard. (ABC News: Stephen Opie)\n\nMuch larger than frigate work\n\nMr Albanese met with South Australian Premier Peter Malinauskas for a media conference at the Osborne South shipyard five weeks ahead of the state election.\n\nMr Malinauskas said the investment at Osborne South, where six Hunter class frigates are being built, was \"extraordinary\" but it \"pales into insignificance\" compared with the work for the AUKUS submarines.\n\n\"[We're] here to announce arguably the most structurally significant contribution to our economy that we will ever see,\" Mr Malinauskas said.\n\n\"What has been announced today completely dwarfs some of the investments that we've seen in South Australia's recent past — that boggles the mind.\"\n\nOpposition Leader Ashton Hurn pointed out the AUKUS deal was signed by the former Coalition federal government.\n\n\"I'm really hopeful that South Australian businesses can feel a part of this project,\" Ms Hurn said.\n\n\"It's really important that we don't just become a glorified IKEA where we're bringing in products from right across the world and just assembling them here in South Australia\n\n\"We need to be at the heart of this manufacturing opportunity, because that's what will set us up for generations to come.\"",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/jane-hume-nuclear-angus-taylor-capital-tax-childcare-migration/106346434",
    "title": "Taylor lays battle lines on capital gains tax as deputy defends nuclear policy",
    "publish_date": "Sun, 15 Feb 2026 01:49:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Deputy Liberal leader Jane Hume says Australia needs to be \"open minded\" on nuclear power if the country is to bring down emissions and make power cheaper.\n\nMs Hume, who was elected to her new position in Friday's Liberal leadership spill, wouldn't be drawn on policy specifics during an interview with the ABC's Insiders program but said nuclear power would help bring down prices over time.\n\n\"If people were open minded to the idea of lifting the moratorium on nuclear energy … well then that would add to that energy abundance that would bring prices down over time,\" she said.\n\nWhen asked if the party had any plans beyond nuclear energy to bring emissions down, Ms Hume would not say whether there were further policy plans in development.\n\n\"I'm not announcing policy 48 hours after having been elected deputy leader of the Liberal Party before our first shadow cabinet meeting,\" she said.\n\n\" But what I will say is it's absolutely crazy to have an ideological approach towards energy because it's energy that drives our economy. \"\n\nIn 2025, Ms Hume fought for the Liberal Party to retain a commitment to net zero emissions by 2050, which was subsequently dumped.\n\nShe would not say whether her personal view on net zero had changed since then.\n\n\"We won't be re-prosecuting that case in the party room, there is no reason why we cannot create more energy and increase supply of energy to bring those prices down.\"\n\nIn its latest report, the International Energy Agency found a net zero by 2050 framework was the best way to deliver cheaper household power.\n\nAustralia's national science organisation the CSIRO has also found that renewable energy supported by storage and gas was the cheapest form of new power.\n\nAngus Taylor and Jane Hume have outlined their key priorities but haven't gone into detail about their plans. (ABC News: Ian Cutmore)\n\nLabor's review of its 2025 election win, and the Coalition's worst-ever defeat, found the opposition's nuclear policy was a key part of its failure to win government.\n\n\"There was also strong opposition to the Coalition's nuclear energy policy with criticisms about the cost and the long delivery timelines,\" the review panel said.\n\n\"Voters felt that there was a lack of detail about nuclear energy, while the Coalition's flip-flop on working from home made voters question if the party was up to the job.\"\n\nThe Coalition is yet to release its election review, which former leader Peter Dutton has claimed is defamatory to him and his staff.\n\nCapital gains tax clash on the horizon\n\nSpeaking at a shopping centre in Western Sydney on Sunday morning, Opposition Leader Angus Taylor and Ms Hume said the Coalition would not be backing any changes to the capital gains tax (CGT) discount for owners of investment properties.\n\nWho is Jane Hume, the new Liberal deputy? The Victorian senator was unceremoniously turfed from Sussan Ley's ministry after being tarred personally with much of what went wrong in the Coalition's cataclysmic loss. On Friday, she ascended to the Liberal's second in command.\n\nThe federal government is considering a reduction in the tax discount ahead of the May federal budget.\n\nMr Taylor said the opposition would not back any changes to CGT.\n\n\"If you tax homes, you get less homes and right now we need more homes, not less,\" Ms Hume said.\n\nMs Hume told the ABC the matter had already been discussed in the party room.\n\n\"We've known this was coming from Labor, that they're reaching back into the grab bag of higher tax policies that Bill Shorten took to a previous election that he lost.\"\n\nChildcare and migration on agenda\n\nBoth Mr Taylor and Ms Hume have criticised the government's plans for a universal childcare system in their first 48 hours as the party's new leadership team.\n\nMs Hume said families needed more choice and flexibility in who cared for their children.\n\n\"We want to make sure that we have a system that not only makes sure that families that want to return to the workplace and have their children cared for have that opportunity to do so, but they should also have a choice as to how they go about doing that,\" she said.\n\nShe would not say if the Coalition was considering giving families a subsidy to pay for a nanny to care for their children.\n\nThe capital gains tax discount is shaping up as a key battle between the opposition and the federal government. (AAP Image/Lukas Coch)\n\n\"It's pretty obvious, isn't it, that childcare as it is isn't working for working Australians,\" she said.\n\n\"It isn't working because it's costing around $16 billion a year to taxpayers at the same time we're subsidising both the workers and users of childcare, no wonder it's becoming so out of reach for every Australian.\"\n\nThe pair have also been heavily critical of the federal government's approach to migration, with Ms Hume calling for a \"reset\" on how it is managed.\n\n\"We want to see a lower number of people come to our country, but we also want to raise the standards,\" she said.\n\n\"Living in Australia is one of the greatest gifts that could ever be given to anybody, which is why we want to make sure that the people that come here share our belief.\"\n\nShe would not say why the current citizenship test, which includes questions on values, is not sufficient, describing the matter as \"a policy decision for another day after I have met with the shadow cabinet\".\n\nMr Taylor said any changes proposed by the Coalition would not be about keeping any particular religious groups out of Australia.\n\n\"The door has been open to people who do not believe in our way of life,\" he said.\n\nMr Taylor would not say how the opposition would like to see that happen.\n\n\"We will announce more detailed initiatives over time.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/how-jakara-anthony-bounced-back-to-winter-olympic-gold/106346110",
    "title": "How 'mortified' Jakara Anthony went from a fall to a second gold medal",
    "publish_date": "Sun, 15 Feb 2026 00:35:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "How do you pick up an athlete who has had their world collapse in on itself, right in the middle of a Winter Olympic Games?\n\nThat was the dilemma facing Jakara Anthony's long-term coach Peter McNiel this week in Livigno.\n\nAnthony, a gold medal favourite in the single moguls midweek, crashed out in the super final when it appeared the gold medal was in her grasp.\n\nGet the latest: Winter Olympics day eight live updates: Anthony wins historic gold for Australia Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nThe 27-year-old was understandably crushed by her mistake.\n\n\"There's been a lot of tears, a lot of conversations had,\" Anthony said on Saturday afternoon, after earning her golden redemption in the dual moguls.\n\nBut there was little time for Anthony to wallow. The dual moguls competition was just three days away, meaning the path ahead for the now two-time Olympic champion was clear.\n\n\"We got back out on the course, had some training and we refocused,\" she said.\n\nHow she was able to compartmentalise her pain has a lot to do with her coach, McNiel.\n\nPete McNiel has been Jakara Anthony's coach since she was 12 years old. (Supplied: OWIA/Chris Hocking)\n\nMcNiel has been Anthony's coach since she was 12 years old, so he understood how awful she felt, even if she displayed a stoic mask in public.\n\n\"Singles day was absolutely devastating,\" McNiel said.\n\nJakara Anthony's response to defeat should make us all proud Disaster stared Jakara Anthony in the face and meted out the cruellest of injustices as she missed out on a moguls medal at the 2026 Winter Olympic Games. But her response showed us the character that should make Australia proud regardless.\n\n\"She was in unbelievable form. We had great training coming in. She'd done everything she needed to do to back up her gold medal [from Beijing] and just … in the blink of an eye, skis crossed and she had to pull out of the course.\n\n\"That night was sleepless. Jak was mortified.\n\n\"We, the coaching team, had to rally to come out for the boys the next day.\n\n\"So it was really, really challenging after such an emotional day.\"\n\nMcNiel said the incident that saw Anthony crash out was the same mechanism that saw her crash and break her collarbone in 2024.\n\nJakara Anthony's final mistake could have been a lot worse. (Reuters: Hannah McKay)\n\nAdding to the difficulty he and Anthony both faced was the fact that one of his other charges, Cooper Woods, claimed gold the day after Anthony suffered the biggest letdown of her sporting life.\n\nBalancing those emotions took its toll.\n\n\"It's a really weird situation,\" McNeil said.\n\n\"You've just missed the thing that you wanted most and then the team's winning … you're devastated and you're crying, you're so happy for the team.\n\n\"It's almost more tiring because it's like this up and down, up and down — you're happy, you're sad, you're happy, you're sad. It's like you can't catch your breath.\n\n\"She was absolutely ecstatic for Cooper. As a team we all were.\n\n\"But at a certain point in time she had to, she just had to try and get some rest so she could come back out today.\"\n\nThat must have been easier said than done.\n\nWoods's victory was an extraordinary high, the release of which is still being seen around Livigno as Australians bullishly celebrate their sporting triumphs in the local bars and clubs.\n\nBalancing the joy Anthony felt for Woods and the pain she felt was a brutal endeavour.\n\nBouncing back from disaster took a lot out of Anthony. (Reuters: Hannah McKay)\n\n\"The emotional toll of what happened is huge,\" McNiel said.\n\n\"And to be able to then, in just a day or two, be able to come back and perform at the highest level of the sport when she's been so drained.\n\n\"I think it is an absolute reflection of the work she's done to be able to have that kind of resolve.\n\n\"And I think as well, the people around her, our team, the Australian team, they just have so much support for her.\n\n\"The coaches and the athletes, you know, our team is really, really strong and we work hard together and we commiserate together and we celebrate together.\"\n\nJakara Anthony's supporters know the pain she went through this week. (AP: Abbie Parr)\n\nAnthony also credited her support network for helping her through the disappointment.\n\n\"I have so many people believing in me, helping me kind of get that belief in myself,\" Anthony said.\n\n\"Pete's great with that, I have my sports psychologist, Ben, and another mental kind of coach, David, who were really helpful getting through that and turning that disappointment around.\n\n\"I've got such a great support crew around me, even my family and friends, they're just proud no matter what, so that helps mentally as well.\n\n\"I'm so lucky to have so much support because that was really challenging to come back from that disappointment the other day.\"\n\nSo what was it McNeil did?\n\nHe just gave Anthony the tools to help herself.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"When you have a situation like that, the athletes need to believe, and they need to know that the people around them believe in them and that they feel supported,\" McNiel said.\n\n\"The main thing I did was just try and pour out love and support.\n\n\"I tried to show her that Australia was pouring out love and support and was just as devastated for her and that her result is not a reflection of who she is and all the work she puts in.\n\n\"It's just a moment on a day and that we could come back out and she can show the world that she can do it.\n\n\"Often I put my hand on her heart and say, 'It's all within you and one run isn't a reflection of your ability. You've absolutely trained for so many years at such a high level, it's all inside.'\n\n\"I just constantly reassure her that that's all inside. That it's all inside her.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/olivia-supports-and-connect-deaf-community/106230034",
    "title": "Supporting and connecting Deaf people, Olivia finds her calling more than just a job",
    "publish_date": "Sun, 15 Feb 2026 00:23:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Olivia Jackson felt invisible for over ten years working in a supermarket as a Deaf woman.\n\nBut she's finally found her true calling after swapping shelf stocking for a job as a support worker helping other Deaf people to achieve their goals.\n\nOlivia lost her hearing as a child and primarily communicates by sign language, or Auslan, which she said was not well supported in the supermarket.\n\nOlivia Jackson chats with her co-workers. (ABC News: Keana Naughton)\n\n\"Communication's difficult, and you've really got to monitor how and manage how you communicate with people,\" she said.\n\n\" It never [was] really a great experience, and so you're kind of isolated and a bit lonely. \"\n\nAdvocates say Deaf Australians remain under-represented in paid work, despite being well placed to help address workforce shortages in care and disability services.\n\nThe more time Olivia spends working to fix that, the less \"invisible\" she feels.\n\nFinding purpose\n\nLast year, Olivia joined the team at Deaf Connect, a national advocacy and care provider for people who are deaf, blind or hard of hearing.\n\nAs a support worker, Olivia's day is as varied as her clients' needs.\n\nSometimes she is assisting people with everyday skills like cooking and at other times she is helping people advocate for themselves at medical appointments.\n\nVinnies volunteer finds purpose after teaching Mike Trafalski has been volunteering with Vinnies Albany since he retired from teaching due to disability, finding purpose in meeting a lot of desperate people who need help.\n\nWhatever the situation, the communication between Olivia and her clients is vital and being Deaf gives her a unique connection to their experience.\n\n\"My favourite thing is working with so many different clients,\" Olivia said.\n\n\"Getting them to achieve and learn new skills, and to get out and get their social and community participation, ensuring that I'm empowering them to learn.\"\n\nDeaf Connect support worker manager Katrina Lancaster said having support workers with the shared experience of being deaf was valuable to their clients.\n\n\"Many of our participants have grown up with language deprivation … having no access to English or Auslan,\" she said.\n\n\"So having somebody to support them that can communicate in their first language and can understand their identity, really no words can describe what that brings.\n\n\"I also think that it's a role model for participants because as a Deaf person, people will say, oh, you're like me. If you can achieve your goals, I can achieve my goals as well.\"\n\nUntapped resource\n\nNevertheless, the national unemployment rate of people who are deaf or have disabilities is almost twice as high as able-bodied people, according to the Australian Human Rights Commission.\n\nEven in the carer space, it is an untapped resource.\n\nThe ABS reported in 2022 that nearly half of disability carers also lived with disability, but they usually fulfil an unpaid care role for family.\n\nOlivia Jackson works as a support worker to support Deaf and hard-of-hearing clients in their first language. (ABC News: Keana Naughton)\n\nAccording to Expressions Australia support worker coordinator Debbie Celenza, the value of Deaf employees is under-recognised in every sector.\n\n\"Hiring a Deaf person in any role is under-utilised,\" she said, \"[and] it is up to government and corporations to step and embrace the untapped resources.\n\n\"Most of our staff are deaf and support people almost daily. It's not asking for a handout or a quota, it's a benefit that should be trusted to continue.\"\n\nHow AI revolutionises my ability to work and study AI-powered voice recognition software is helping my career as a journalist and my studies.\n\nThe organisation's CEO, Rebecca Adam, who is also deaf, said that she wants more organisations to adopt the model for employing Deaf people across a range of areas.\n\n\"[The] benefits are huge because clients see themselves and the community feels like we are representing them.\n\n\"[We've] always hired Deaf people, probably 40 per cent of staff are deaf and I feel it is important that Deaf people are represented,\" Ms Adam said.\n\nA lifelong career\n\nWhile Olivia might represent the employment options for thousands of Deaf Australians, it's still not an opportunity a lot of people have.\n\nOlivia says she'll be doing the job she enjoys for a long time. (ABC News: Keana Naughton)\n\nBut to her it's more of a calling than a job.\n\n\"Don't get me wrong [I had] great experiences where I used to work, but it's the amazing experiences I have here [that] are second to none.\n\n\"I am absolutely in love with my job, and it's where I plan to stay for a very long time.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/nsw-minns-government-anzac-day-extra-public-holiday/106346332",
    "title": "Premier announces extra public holiday for NSW residents",
    "publish_date": "Sun, 15 Feb 2026 00:21:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Millions will be given an extra day off work this year with the NSW premier announcing another public holiday.\n\nChris Minns flagged last month that he was looking into giving the state another public holiday in April for Anzac Day.\n\nAnzac Day remembrance services will be held nationwide on Saturday, April 25, but only Western Australia and the ACT observe a public holiday on Monday, April 27.\n\nMr Minns announced on Sunday the government would be making the Monday after Anzac Day a public holiday in 2026 and 2027 for residents in New South Wales.\n\n\"We expect big participation, major crowds, full public, civic participation in Anzac Day on the 25th of April and then following that on the Monday, we'll have an additional public holiday,\" Mr Minns said.\n\nChris Minns flagged last month that he was looking into giving the state another public holiday in April for Anzac Day. (ABC News)\n\nMixed reaction from business\n\nMr Minns acknowledged not everybody was on board with the change.\n\n\"We've also spoken with business. Not all business groups are supportive of this change [and] I think it's important that we recognise that,\" he said.\n\n\"We know that it's somewhat of an additional burden for small businesses in particular, but this is, we believe, an important thing to do for the state. \"\n\nMr Minns said the trial would be implemented for the next two years and then reviewed by the government in 2032 - when Anzac Day next fell on a weekend.\n\nHe said no Anzac Day services would be impacted, although two-up would remain illegal on any other day except April 25 and Remembrance Day on November 11.\n\nActing President of RSL NSW, Vince Williams, said adding the public holiday did not aim to undermine the service and sacrifice of Anzacs.\n\n\"I've already had feedback, from some smaller RSL organisations that have said, that it may give them an opportunity to get together on the Monday,\" Mr Williams said.\n\n\"Whereas on Anzac Day, they get spread right across the state with all visiting their, association or their former unit, but not necessarily with their local colleagues or vice versa.\n\n\"They might be missing out on that because they haven't got time with their colleagues.\"\n\nDavid Harris was hopeful the day would give people extra time to reflect on the significance of Anzac Day. (ABC News)\n\nNSW Minister for Veterans David Harris told the ABC he hoped the move would give the community more time to reflect on the significance of the day.\n\n\"We know Anzac Day is still the most important day and we encourage people to get out to marches and events right across NSW by having the Monday as well,\" Mr Harris said.\n\n\"It particularly gives extra time for servicemen and women who work on Anzac Day to spend time with their families and join in their own, personal remembrance.\"\n\nNew South Wales has the fewest public holidays in Australia observing only 11, compared to South Australia, Western Australia, Queensland, Victoria and the ACT which have between 14 and 15.",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/perth-am-to-fm-switch-goes-ahead/106343336",
    "title": "ABC Radio move to FM signals the end of an era for Perth listeners",
    "publish_date": "Sun, 15 Feb 2026 00:01:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "With the ABC's three Perth radio stations switching from AM over to the FM band, it is the end of an era for the 94-year-old transmitter in Hamersley.\n\nWhile it is a well-known landmark in Perth's northern suburbs, Trevor Kelly has had a view of the Hamersley transmitter few others have.\n\nHe started working as a radio technician for the ABC in 1959, as a trainee with the Postmaster General (PMG), which then handled all the ABC's technical broadcasting requirements.\n\nTrevor Kelly, retired ABC radio technician. (ABC News: Pip Waller)\n\n\"We were taken out to 6WF, Hamersley — out in the sticks — and we were shown the transmitters,\" he said\n\n\"The ABC 6WF transmitter was one built in about 1932 by the PMG itself.\n\n\" Then we were taken out to this great big mast and asked, 'Would you like to climb it?' \"\n\nWhen Mr Kelly and the other trainees said yes, they were given permission but also instructions on how to do it without electrocuting themselves.\n\n\"They said, 'Just be very careful when you get on; you've got to jump on, not touch the ground and the mast at the same time, otherwise you'll be electrified,' that was the word that was used then,\" he said.\n\n\"So we all jumped on, and as you jumped on, there was a zip as you touched on there.\n\n\"Eleven of us managed to get up to the top, but you couldn't go right to the top because again, you got electrified there.\n\n\"Anyhow, we all got down and it was a memorable day.\"\n\nThe Hamersley transmitter is 94 years old. (ABC News: Pip Waller)\n\nIt has been many decades since ABC staff were allowed to risk electrocution at work, and now, the site's days providing AM broadcasting are drawing to a close.\n\nABC AM stations move to FM\n\nABC Radio Perth, NewsRadio and Radio National will all move to frequencies on the FM band on February 23.\n\nThe move will mean \"many more people can tune into the station\" as well as hear a clearer sound, radio futurologist James Cridland said.\n\nMr Cridland, who also edits a daily podcast newsletter, said he thought the switch for ABC Radio Perth from AM to FM would be really good for the ABC.\n\n\"It's really important to make sure that the primary emergency broadcaster is available in a way that people can actually pick it up, and that, for the most people, is FM radio,\" he said.\n\nPerth is the first capital city in Australia to move all stations to FM, a move that matches global trends.\n\nJames Cridland says moving to FM will boost listening in cars. (Supplied)\n\n\"If you look into Europe, most of the big broadcasters have now left the AM band,\" he said.\n\n\"Japan is just turning off AM for one of its national broadcasters. In much of the US, they are trying, as quickly as they can, to shift over to FM.\"\n\nCrucially, moving to FM will boost listening in cars, a key audience for all radio stations.\n\n\"New electric cars have no AM [receiver] in them. They're pulling AM out of some hybrid cars as well,\" Mr Cridland said.\n\n\"We here in Australia get the European version of cars in terms of the in-car entertainment, and AM is not a thing in most of Europe, in much of the UK, so car manufacturers have no reason really to put it into their cars anymore.\"\n\nSwitching towers\n\nFor BAI Communications area manager Tim Gray, who has been involved with ABC broadcasting for 40 years, it has meant preparing an FM mast at Bickley, in the Perth Hills, for the new services.\n\n\"The transmitters are all being installed, all ready to go, ready for switch on, and we've had a significant project to upgrade the antenna system and the combiner system to combine all the new frequencies into the system,\" Mr Gray said.\n\n\"It's quite exciting. The team have put in a lot of work.\"\n\nTim Gray says it is an exciting milestone. (ABC News: Pip Waller)\n\nAlthough he admits there is a small part of him that is sad to see the ABC depart the Hamersley site.\n\n\"This tower has been very significant in broadcasting ABC Radio Perth AM. It's part of the skyline, of Perth,\" he said\n\nDue to legislation that stipulates NewsRadio must broadcast parliament on AM radio, that station will be simulcast on both bands until the law can be amended.\n\nEquipment inside the plant room at Hamersley transmission tower. (ABC News: Pip Waller)\n\nMr Cridland said while AM still had a crucial place in regional Australia, where it can reach vast distances and is less susceptible to interference than it is in the city, FM made much more sense in the city.\n\nFAQs: Moving from AM to FM Will I need to buy a new radio?\n\n\"[In cities] we live in suburbs. We commute into the CBD. You don't need a large transmitter to do that,\" he said.\n\n\"What you need is a transmitter that people can actually pick up the signals from in their car and in their house. And more and more these days, that's FM and not AM.\n\n\"It's something that, frankly, the ABC should be doing in all of the capital cities.\"\n\nABC Radio Perth will be on 102.5 FM, Radio National to 103.3 FM and ABC NewsRadio to 104.1 FM from February 23.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/afl-state-of-origin-coaches-hail-success-of-concept/106346486",
    "title": "Origin coaches hail the successful return of interstate Aussie rules",
    "publish_date": "Sat, 14 Feb 2026 23:41:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Winning Victoria coach Chris Scott and his Western Australia counterpart Dean Cox have called for State of Origin to be played every year after the concept's stunning return in Perth.\n\nA sellout crowd of 58,141 fans turned up to Perth Stadium on Saturday night to watch Victoria hold on for a hard-fought 24-point win, 18.17 (125) to 15.11 (101).\n\nWA closed to within six points early in the final quarter following three quick goals to Jesse Hogan, but Victoria's star-studded squad was able to manage the heat and see out the win.\n\nCarlton star taken to hospital as Victoria wins Origin Victoria holds off a spirited WA side to win the first Aussie rules State of Origin clash for 27 years, though the game is marred by a serious injury to Carlton star Jacob Weitering.\n\nIt marked the first AFL Origin match since 1999, and the resounding success of its return has already sparked calls for the concept to continue.\n\n\"I would love nothing more than to see this grow,\" Scott said.\n\n\"I'm obviously a huge advocate. And I think this has got the potential to be something big.\n\n\"I don't see any reason why it shouldn't be every year.\n\n\"Maybe if the player interest does wane a little bit, maybe then you think about adjusting it, but I can't imagine that being the case.\n\n\"I think it will only grow legs. I mean, as a coach, I think it's the best time now in pre-season.\n\n\"For example, our players have a practice match against Hawthorn on Monday. I know where I'd rather my players be playing.\"\n\nImportantly, players from both sides went all-out in their attempt to win the game, and a number of the league's biggest stars have already signalled their desperation to represent their state next year.\n\nScott said WA had the \"front running\" to host Origin again, given the way fans in the state embraced it, but he knew there would be other states knocking down the door to take part.\n\n\"It really has got some potential,\" Scott said.\n\n\"If you were a South Australian-aligned player or an Allies-aligned player, you had to watch that game thinking, 'How can you leave us out of this contest?'\"\n\nCox is equally optimistic about Origin's future.\n\n\"I think State of Origin should be every year,\" Cox said.\n\n\"It's for the AFL to work out who plays in that, whether it's a carnival, whether it's a standalone game.\n\n\"The WA government, WA Tourism and the WA public showed that they'll support it no matter what time of the year it comes, and they probably deserve to hold it.\"\n\nNot one AFL star who was fit and eligible to play for either Victoria or Western Australia turned down the opportunity to take part.\n\nThe huge buy-in from players was arguably the biggest reason for the concept's success, and even the glut of injuries to come out of Saturday's game did not dampen the excitement.\n\nCarlton defender Jacob Weitering was taken to hospital with possible neck, rib and shoulder damage after being crunched in a marking contest.\n\nAdelaide recruit Callum Ah Chee, Port forward Mitch Georgiades and GWS defender Sam Taylor had their games cut short due to hamstring niggles, while Gold Coast's Brownlow medallist Matt Rowell injured a finger.\n\nNevertheless, Hogan said the players had embraced the concept.\n\n\"This year was a little bit of the unknown,\" Hogan said.\n\n\"I mean, all the players were excited for it, but we weren't really sure what to expect.\n\n\"As we were getting closer, as the teams getting announced, the excitement kind of grew.\n\n\"I think everyone that played under-age footy or wants to play for their state or watched tonight. I think this could blossom into something special.\n\n\"There's absolutely no reason why the players wouldn't want to buy into this every single year. Hopefully it's here to stay.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/fortescue-battery-electric-locomotives-pilbara/106022632",
    "title": "Forrest launches battery-powered trains as green deadline nears",
    "publish_date": "Sat, 14 Feb 2026 23:00:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "After years of delays, the rail routes of Western Australia's resource-rich Pilbara are starting to whirr with the sound of battery-electric power.\n\nFortescue launched two battery-electric locomotives this week, rounding out its fleet of 70 diesel-powered machines hauling precious iron-ore from pit to port.\n\nFortescue put its latest battery-electric locomotives on show in Port Hedland. (ABC Pilbara: Alistair Bates)\n\nBillionaire Andrew Forrest's mining giant is the second of the region's major companies, and among its largest carbon emitters, to test the technology.\n\nBHP began its own Pilbara trials of battery-electric trains in November.\n\n\"We'll test them with our conventional fleet and we want to understand exactly [their] performance … then we'll pull the trigger on a fully decarbonised solution for rail,\" said Fortescue chief executive Dino Otranto.\n\nRarely caught short on spectacle, the first of the blue-and-white locomotives pulled into Port Hedland's Thomas Rail Yard to rock band Wolfmother's 2005 hit, Joker & the Thief.\n\nThe locomotive's battery is the equivalent of \"200 to 300 average electric vehicles\" and capable of powering a refrigerator for 30 years, according to Mr Otranto. (ABC Pilbara: Alistair Bates)\n\nThe locomotives, purpose-built by Caterpillar subsidiary Progress Rail, boast what Fortescue has called the world's largest land-mobile battery, with a capacity of 14.5 megawatt-hours.\n\nThe pair will save the company 1 million litres of diesel each year, still just a fraction of the 80 million litres the company consumes annually.\n\n\"It is a large undertaking: these take probably a couple of years to manufacture, so once we pull an order, you can see it will take a couple of years to transition the entire fleet,\" Mr Otranto said.\n\nThe company hopes to complete the transition ahead of its \"real-zero\" deadline of 2030.\n\nFortescue back on track\n\nThe locomotives' massive battery will be charged in two ways.\n\nThe first is via Fortescue's growing renewable energy apparatus, which it says it is expanding aggressively at a rate of more than 3,000 solar panels a day.\n\nFortescue plans to totally electrify its transport network over the next \"couple of years\". (ABC Pilbara: Alistair Bates)\n\nThe second charging method is through regenerative braking, a mechanism drawing closely from the company's stalled \"Infinity Train\" concept.\n\nAndrew Forrest had previously touted an in-house electric rail model, developed with Australian engineering firm Downer Group, that generated all the power it needed using the uphill-downhill dynamics of the Pilbara ranges.\n\nThe project was canned, however, in September, axing more than 100 staff.\n\nThe significance was not lost on rail operations specialist Ryan Coy, who was among the locomotive's first drivers. (ABC Pilbara: Alistair Bates)\n\nRio Tinto mothballs electric rail\n\nLike its homegrown competitor, Rio Tinto has long emphasised the importance of rail to its decarbonisation efforts.\n\nThe British-Australian multinational ordered its first battery electric locomotives from American manufacturer Wabtec in 2022 and pledged to roll them out in the Pilbara in 2024.\n\nThe transport of Pilbara iron-ore spans more than 2,000 kilometres of privately owned rail. (Supplied: Rio Tinto)\n\nThe eventual replacement of more than 200 diesel locomotives was supposed to slash roughly three per cent of Rio Tinto's total emissions, although that milestone is far off.\n\nThe ABC understands Rio Tinto recently shelved its partnership with Wabtec.\n\n\"While battery locomotives represent an important area of technological development, our analysis indicates that current battery technology is not yet viable for our Pilbara rail operations,\" a spokesperson said in a statement.\n\nPeter Newman was critical of Rio Tinto's reluctance to pursue battery-electric rail. (ABC News: Benjamin Gubana)\n\nCurtin University professor of sustainability Peter Newman slammed the company's \"backwards step\".\n\n\"They will regret not going down this net-zero path quickly because it is going to be cheaper, better for their markets, better for their company in general,\" he said.\n\nRace to decarbonise\n\nThe Pilbara region produces about 40 per cent of WA's carbon emissions, despite being home to just 2 per cent of its population.\n\nIt is overwhelmingly produced by the iron-ore industry, from which a quarter of the state's annual revenue flows.\n\nFortescue has developed rows of BYD battery banks to store solar energy collected near its Iron Bridge mine. (ABC Pilbara: Alistair Bates)\n\nBHP vice-president of operational decarbonisation Daniel Heal said the company's own Wabtec locomotive prototypes were undergoing \"no-load commissioning\".\n\n\"The intent is that we'll have those pulling iron ore in the Pilbara in the coming months,\" he said.\n\n\" Diesel, for us, contributes about two-thirds of our emissions today. \"\n\nBHP said its Wabtec locomotives were still a long way from implementation at scale. (Supplied: BHP)\n\nMr Heal could not point to a fixed timeline for the trials and stood by the miner's decision to slash its decarbonisation budget.\n\n\"We've moved that funding to the 2030s … the engineering challenges mean it's going to take probably a bit longer than people anticipated.\"\n\nFortescue's solar farm near the Iron Bridge mine. (Supplied: Fortescue)\n\nDr Newman said Fortescue was not without criticism, accusing the company of neglecting \"straightforward, practical solutions\" for \"wasteful\" projects it had since abandoned.\n\nThe company has walked away from a host of green hydrogen projects in recent years, including a multi-billion-dollar hydrogen electrolyser plant once spruiked to be a global pioneer.\n\nMr Otranto defended Fortescue's record with the new locomotive looming behind him.\n\n\"We have not slowed down with hydrogen whatsoever. In fact, our green iron plant at Christmas Creek in the Pilbara will be using Australia's largest liquefied hydrogen plant to produce green metal,\" he said.\n\nFortescue is resolute that it will reach its goal of zero carbon emissions with zero offsets by the end of the decade.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/winter-olympics-2026-milano-cortina-quick-hits-condoms-curling/106345804",
    "title": "Quick hits: Olympic village out of condoms, cheat claims rock curling",
    "publish_date": "Sat, 14 Feb 2026 22:58:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Protective gear is in short supply in Italy as tensions boil over in the curling and a Norwegian-born Brazilian makes history.\n\nHere are the quick hits from the Winter Olympics.\n\n1. Olympic Village in crisis as condoms run out\n\nProtective gear is in short supply at the Winter Games. (Getty Images: Jared C. Tilton)\n\nBoth on and off the ice, protective gear is in hot demand at the Milano Cortina Winter Games.\n\nAnd some of it is in perilously short supply, according to Italian outlet La Stampa.\n\nThe newspaper has reported that the complimentary condom allowance at the Olympic Village has been exhausted in record time.\n\n\"The supplies ran out in just three days,\" an anonymous athlete said.\n\n\" They promised us more will arrive, but who knows when. \"\n\nReportedly, just 10,000 condoms were made available at the start of the Games, compared with the 300,000 that were provided at the Summer Games in 2024 (although there were over three times as many athletes in Paris as there are currently in Italy).\n\nBefore the supply ran dry, Spanish athlete Olivia Smart took to Instagram to provide proof of the Lombardy-branded prophylactics.\n\nThe video, as seen below, was also shared by President of Lombardy, Attilio Fontana.\n\nLoading Instagram content\n\n2. Norwegian-born Brazilian claims South America's first-ever medal\n\nAfter 102 years, South America finally has its first Winter Olympic medal.\n\nBrazilian skier Lucas Pinheiro Braathen was the athlete to break the continent's duck, emphatically claiming gold in the men's giant slalom, finishing almost a minute ahead of 2022 champion Marco Odermatt.\n\nBut Pinheiro Braathen wasn't always a Brazilian skier. Up until a shock retirement in 2023, he represented Norway, the country of his birth.\n\nHowever, five months after hanging up the skis, Pinheiro Braathen was back on the international circuit, but this time in the colours of Brazil, for whom he is eligible through his mother.\n\nTwo years later, Pinheiro Braathen is a history maker, and in no doubt about his decision.\n\nUpon winning gold, he collapsed onto the snow, overcome with the enormity of his achievement.\n\n\"I've tried over and over again to put words to what I'm feeling, but it's simply impossible,\" Pinhero Braathan said.\n\n\"If there is anything that I hope I can be as a source of inspiration today, it's that you dare to be who you are.\"\n\n3. Cheating curling chaos\n\nCurling's international governing body says it will have officials monitoring for rule violations during the rest of the competition after Sweden's men's team accused Canada of cheating in a tense round-robin game.\n\nTensions boiled over when Brad Jacobs's Canada beat Sweden 8-6, with Niklas Edin's rink alleging their opponents were double touching the stone during the contest.\n\nCanada was embroiled in curling controversy in Italy. (Getty Images: Andrew Milligan/PA Images)\n\nWorld Curling has introduced electronic handles on stones at the Games, which flash red if players are still making contact with the stone beyond the hog line — the point where curlers must let go during delivery.\n\nHowever, ‌the sensor for detecting violations is in the handle, with Sweden claiming Canada's players were touching the granite, where there are no sensors.\n\n\"It is not possible for World Curling to have game umpires positioned to observe all hog lines for every stone delivery,\" World Curling said in ‌a statement.\n\n\"However, beginning with the Saturday afternoon session, two officials will move between all four sheets and observe deliveries.\"\n\nGet the latest: Winter Olympics day eight live updates: Anthony wins historic gold for Australia Stay across the highs and lows of the Games with the ABC Sport Daily podcast and ABC Sport.\n\nAfter Sweden ‌and Canada asked officials to keep an eye on their opponents' deliveries early on, there was a heated exchange between the teams' thirds Marc Kennedy and Oskar Eriksson towards the end of the game.\n\nEriksson told Kennedy he would show him a video replay of him touching the stone repeatedly.\n\nThe Canadian responded with an expletive.\n\n4. Skier breaks ski, still claims silver\n\nEbba Andersson was forced to race with one ski for 30 frantic seconds. (Getty Images: Alex Slitz)\n\nSweden was favourite heading into the women's 4x7.5-kilometre team relay, but its hopes of finishing atop the podium were all but dashed in the second leg.\n\nEbba Andersson crashed forward dramatically, not only losing ground on her opponents but breaking a ski in the process.\n\nRising from the snow, she was forced to hobble along with just one blade for 30 bizarre, painstaking seconds.\n\nAnd the comedy of errors was only added to when a member of the support team, racing to restore Andersson's symmetry, slipped in their haste.\n\nHowever, Sweden wasn't done there, responding impressively to claim silver.\n\n5. More injury pain for Australia\n\nLaura Peel officially withdrew from the Games on day eight. (AAP Image: Dan Himbrechts)\n\nOn day eight, Milano Cortina officially became Australia's most successful Games in history.\n\nBut amid the ecstasy of Jakara Anthony's history-making dual moguls gold was another little bit of agony for an already injury-ravaged Australian team.\n\nAustralian aerial skier Laura Peel was the latest athlete to be forced to withdraw from the Games, following an injury sustained at a training camp in Switzerland earlier this month.\n\nNursing a torn ACL, the two-time world champion and genuine medal contender was always facing an uphill battle to prove her fitness, but she was understandably \"heartbroken\" nonetheless.\n\nPeel is the fourth Australian to have their Olympic dreams dashed by injury in recent days, with Cam Bolton fracturing his neck in training, Misaki Vaughan being concussed during her preparations and Daisy Thomas belatedly succumbing to a reinflammation of her ACL injury.\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-15/unscrupulous-ndis-providers-inducements-remote-nt-communities/106338736",
    "title": "'We see plans emptied in weeks': Alarm over remote NDIS recruitment tactics",
    "publish_date": "Sat, 14 Feb 2026 22:43:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "People with disabilities in remote Northern Territory communities are being targeted by unscrupulous NDIS providers using high-pressure sales tactics and inducements including cash, cigarettes and alcohol, an ABC investigation can reveal.\n\nDisability workers say they are witnessing aggressive recruitment of clients and the rapid draining of funds from plans, amid a rush of new providers into the outback NT market.\n\nThe ABC has obtained a dossier of complaints, compiled into a report, that has been sent to the NDIS Quality and Safeguards Commission, which is responsible for regulating providers.\n\nThe document paints a troubling picture of predatory behaviour by companies looking to exploit \"high value\" customers in remote Aboriginal communities in the NT, where plans can be larger to account for the expense of remote service delivery.\n\n\"People are being promised phones or KFC to change providers,\" one anonymous NT disability advocate said.\n\n\" It's happening every week. \"\n\nNow, some Territorians living with disability are speaking out about their experiences.\n\nDo you know more? Contact reporter James Elton on elton.james@abc.net.au, or, if you require more secure communication, on jameseltonabc@protonmail.com\n\n'I didn't know what it was for'\n\nJalkie Rickson said she was sitting in a front yard in her small Top End community of Wugularr, about 400 kilometres south-east of Darwin, last year, when she was approached by a woman she'd never met, who wanted her to sign an NDIS service agreement.\n\nJalkie Rickson says the unknown woman approached her and pushed her to sign an NDIS service agreement (ABC News: James Elton)\n\nMs Rickson, who has limited mobility and uses a walker, was already receiving NDIS support through other carers.\n\nShe said she did not understand the document being presented to her, and the woman did not explain it.\n\n\"She told me to sign up. But I didn't know what it was for,\" Ms Rickson said.\n\n\" She just told me to sign. She wasn't explaining why … she never said: 'This is what you're signing for'. \"\n\nDespite her reservations, Ms Rickson eventually signed the form.\n\nJalkie Rickson's disabilities mean she can't walk very far without help. (ABC News: James Elton)\n\nThe provider later returned, Ms Rickson said, and drove her in a car to another town about one hour away.\n\nMs Rickson can't recall exactly when, but at some stage she alleges the carer also gave her a pouch of tobacco.\n\nMs Rickson says she did not understand at the time that the carer was about to place her in a live-in home in the town.\n\n'In there, there's not any hope'\n\nOnce there, she quickly became concerned about the level of care in the home.\n\n\"[The carer] just left me — left us there and took off to go wherever she want, you know?,\" she said.\n\nMs Rickson's disabilities mean she cannot walk very far without support.\n\nShe said the carer did not facilitate any trips outside, making her feel like she was being treated like a \"slave\" or a \"hostage\".\n\n\"In there, there's not any hope. You cannot go out. Just gotta sit. Watch TV. Make tea,\" she said.\n\nJalkie Rickson says making tea was one of the few things she was able to do inside the live-in home. (ABC News: James Elton)\n\nAfter a short while living in the home — Ms Rickson estimates between four days and a week — she made a call and arranged for someone to come and pick her up.\n\nMs Rickson then phoned the carer to cancel her service agreement. The carer told Ms Rickson she would visit her again in Wugularr soon to collect $140 to pay her back \"for the smokes\".\n\n\"Some people, they get greedy,\" Ms Rickson said. \"They love the money, most.\"\n\nBernadette Wallace, an NDIS support coordinator who had been managing Ms Rickson's care up to that point, said the experience was a \"total rug pull\" for Ms Rickson's existing providers.\n\nBernadette Wallace found herself cut off from accessing Jalkie Rickson's online NDIS portal. (ABC News: James Elton)\n\nShe found herself cut off from accessing Ms Rickson's online NDIS portal.\n\n\"I didn't even know where to send anything, to be able to have a handover so then they could be aware of what's already in place,\" Ms Wallace said.\n\nAfter meetings with NDIS representatives, Ms Rickson was able to return to Ms Wallace and her other previous providers.\n\nAn associate of the carer who picked up Ms Rickson told the ABC the matter was under investigation by the NDIS regulator, so the company was unable to comment.\n\n\"We have fully cooperated with the Commission and provided all requested documentation,\" the associate said.\n\n\"We categorically deny the allegations of high-pressure sales tactics, inducements, or any breach of the NDIS Code of Conduct.\"\n\nAccess to alcohol\n\nIn the Northern Territory, most Indigenous communities are dry. Buying alcohol on behalf of others is a serious offence.\n\nBut there are reports that some NDIS providers are facilitating access to alcohol to win over and retain customers in the bush.\n\nFloyd Rose, a Warlpiri man from the dry community of Lajamanu on the northern edge of the desert, says last year he witnessed an NDIS provider for his late disabled mother providing alcohol to her and members of his extended family.\n\nFloyd Rose says he saw an NDIS provider facilitating access to alcohol for his mother and members of his family. (ABC News: Jayden O'Neill)\n\n\"His role [was] to look after her, bring her up, take some family out,\" Mr Rose said.\n\n\"Most of the time he [goes to] Lajamanu, go round there, take some people — but not safe I think, with grog.\"\n\n\"Why this fella buying grog every day for this mob?\"\n\nMr Rose said he felt the man did not appear to have the right motivations for an NDIS provider.\n\nFloyd Rose says the man providing alcohol to community members doesn't sit right with him. (ABC News: Jayden O'Neill)\n\nThe ABC has seen two invoices texted to Mr Rose's mother by two separate providers in February 2025.\n\nThe first was for $10,494 for five days of care from February 3 to February 7, while a second was for $5,659 for a single day of care on February 18.\n\nMultiple disability workers have told the ABC those amounts could only be justified by intensive, one-on-one care, and even then they would be a stretch.\n\nOne of the providers that billed Mr Rose's mother told the ABC while they would not comment on the individual case, they specialised in high-intensity respite care that could attract high rates.\n\nFloyd Rose is from the dry community of Lajamanu. (ABC News: Jayden O'Neill)\n\nGifts a widespread practice\n\nMs Wallace, who has worked as a support coordinator for clients in remote NT communities for the past nine years, said the use of gifts to recruit people to sign with NDIS providers was becoming a familiar story.\n\n\"The participants that I'm looking after, they've directly admitted to receiving tobacco, receiving free rides to places, receiving alcohol, [and being] induced by actual cash payments,\" she said.\n\n\"That's obviously to cajole them into having them as a provider.\"\n\nBernadette Wallace says NDIS providers targeting vulnerable remote participants with gifts is a growing problem. (ABC News: James Elton)\n\nA dossier of complaints, which does not include Ms Rickson or Mr Rose's experiences, has been compiled by disability advocates and the Darwin Community Legal Service (DCLS).\n\nThe report also draws on conversations with legitimate providers and disability advocates working across the territory.\n\n\"Participants are offered food, cash, phones, gaming consoles, furniture or vouchers to switch providers or sign up for the NDIS,\" the document reads.\n\n\" These inducements have high appeal to people living in poverty who may have low English language or literacy skills and can't understand the consequences of the 'deal'. \"\n\nThe report, compiled by disability advocates and the DCLS, outlines the widespread use of inducements and draining of NDIS plans in the remote NT. (ABC News: Marcus Kennedy)\n\nAs well as the Commission, the document has also been sent to federal NDIS Minister Jenny McAllister.\n\nA spokesperson for the minister said Ms McAllister was \"very aware\" of the issues with the NDIS in the territory and had asked for \"further advice from agencies\" on how to address them.\n\nCash for introductions\n\nIsaac Dai, a Torres Strait Islander man who married a desert woman from Lajamanu, says he and his brother were last year approached by a provider and offered $200 cash payments each in exchange for introductions to disabled people in the community.\n\nIsaac Dai (right) says he was offered cash for introductions to disabled people in the remote community of Lajamanu. (ABC News: James Elton)\n\nLajamanu is extremely remote, located more than 600 kilometres away from Katherine, the nearest regional centre.\n\nMr Dai said the pair agreed and introduced the woman to two disabled residents.\n\n\"She told us 'I'll come back and pay you $200 dollars each',\" Mr Dai said.\n\n\"But she didn't … we didn't see her from then.\"\n\n\"Didn't pay us. She just signed up the two person and gone.\"\n\nIsaac Dai (left) says he feels the provider was only really interested in getting signatures. (ABC News: James Elton)\n\nMr Dai said the woman made commitments to return and assist disabled residents with cleaning their houses. But he said he was sceptical that the work would actually be done.\n\n\"This is a robbery going on. This is playing games. She just wants people's signatures, that's all,\" Mr Dai said.\n\nPlans being 'drained'\n\nOnce an NDIS agreement is signed, it means companies can start invoicing for services and drawing down funds from a participant's plan.\n\nBut the report by the NT disability advocates found some providers operating in remote communities were signing up clients and then burning through funds much too quickly, by invoicing for far more care hours than their plans could support — a tactic known as \"overservicing\".\n\nIn some cases, the hours of care billed may not even have happened.\n\nThe NDIS is designed to give people living with disabilities access to choice and control, including by making it easy for them to change carers. (ABC News: James Elton)\n\n\"Once participants are signed up, their plans are drained of funds, the support they were promised never materialises, and they are left isolated and uncared for,\" the report reads.\n\nAn anonymous Tennant Creek service provider said they had seen plans that \"should last a year\" being \"drained in two months\".\n\n\"Then people have nothing left and no way to pay for help,\" the provider said.\n\nAn anonymous Darwin disability advocate told a similar story.\n\n\"We see plans emptied in weeks,\" they said.\n\nMs Bowker said there was a \"glut of service providers clamouring to get these clients\".\n\n\"I think these dodgy providers see these participants as cash cows,\" she said.\n\nAgainst the code\n\nThe use of gifts like cigarettes, alcohol and cash is against the NDIS Code of Conduct, but falls in a legal grey area.\n\nThe Code says these methods are unethical and dishonest, but \"not necessarily unlawful\".\n\nNew NDIS provider rules confirmed in major shake-up The government confirms two categories of NDIS providers will be subject to mandatory registration from July 2026.\n\nGareth Trew, a support coordinator for well-respected Katherine service provider Step Out, said there were \"absolutely no circumstances\" where it was okay to use inducements.\n\nMr Trew said many participants were already very vulnerable to being tricked into signing agreements they didn't understand, due to factors like poor literacy or intellectual disabilities.\n\n\"Predatory providers who spot that? Absolutely, there's huge scope for them to take people's money,\" Mr Trew said.\n\nRachael Bowker, the chief executive of DCLS, said providers were offering items that could be \"extremely expensive and hard to get hold of\" in remote communities.\n\n\"At that very moment, sure, why wouldn't you take a phone or alcohol or cigarettes?,\" she said.\n\nRachael Bowker is concerned vulnerable people in remote communities are being taken advantage of. (ABC News: Marcus Kennedy)\n\nClaims of ineffective complaints process\n\nAdvocates and providers across the NT said they were losing faith in the NDIS complaints process.\n\nThe NDIS Quality and Safeguards Commission \"rarely follows up on serious complaints\", according to the report.\n\n\"It's quite concerning that these providers, who are repeat offenders, continue to operate without any sanction at all,\" said Scott Richardson, a disability advocate based in Alice Springs.\n\nScott Richardson wants more to be done to deter providers from preying on vulnerable Territorians. (ABC News: Marcus Kennedy)\n\nLast year, the NDIS Quality and Safeguards Commission received 409 complaints in the Northern Territory. But it has confirmed roughly half of those have yet to be \"processed\".\n\nFamilies at breaking point ahead of defining year for NDIS Families frayed by NDIS cuts are bracing for even more change ahead of a year that's set to reshape the scheme into something more sustainable, write Nas Campanella and Evan Young.\n\nThe online register of banning orders shows there are only a handful of people who have been banned from operating under the scheme in the NT, in a market with more than 2,400 active providers.\n\nThe Commission told the ABC it could not comment on individual complaints, but said it was increasing its enforcement activities in the territory.\n\nA spokesperson said its investigators had been to Tennant Creek and Alice Springs in December, carrying out dozens of site visits and executing warrants in response to complaints about providers in the region.\n\nCalls for tougher enforcement, cooling off periods\n\nThe disability advocates said an independent investigative body for the territory should be set up if \"inaction\" by the regulator continued.\n\nThe report also argued tactics like inducements should be made \"reportable incidents\" under the NDIS Act, and for the introduction of a \"cooling off period\" for people switching providers.\n\nThe National Disability Insurance Agency, which is responsible for implementing the NDIS, said it had zero tolerance for providers offering incentives or referral payments.\n\nThe spokesperson said their own investigations had found a \"strong link\" between such practices and fraud.\n\nThey said the agency was aware of \"challenges in the NT market\" and was in the middle of a review of \"cross agency intelligence\" including tip-offs.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/butler-opens-scoring-for-maori-20260215-p5o2ft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Butler opens scoring for Maori",
    "publish_date": "Sun, 15 Feb 2026 13:54:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Butler opens scoring for Maori\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/a-board-game-classic-at-the-comedy-theatre-with-a-serving-of-slapstick-20260211-p5o1d0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This bold production is a bare-chested, knife-wielding, testosterone-drenched deconstruction of a classic",
    "publish_date": "Sun, 15 Feb 2026 13:54:41 +1100",
    "category": "entertainment",
    "authors": [
      "Cameron Woodhead",
      "Marcus Teague"
    ],
    "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews This bold production is a bare-chested, knife-wielding, testosterone-drenched deconstruction of a classic Cameron Woodhead and Marcus Teague Updated February 15, 2026 — 1:54pm ,first published February 11, 2026 — 1:35pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points THEATRE: Cyrano de Bergerac at fortyfivedownstairs offers a bold reimagining\n\nMUSIC: Remarkably, Geese live up to the hype at their Thornbury gig\n\nTHEATRE: Cluedo at the Comedy Theatre is a zany mystery with a dose of nostalgia\n\nTHEATRE\n\nCyrano de Bergerac ★★★★\n\nfortyfivedownstairs, until February 28 Edmond Rostand’s French tragicomedy Cyrano de Bergerac always seems ripe for reinvention. From Fred Schepisi’s 1987 romcom, Roxanne (starring Steve Martin and Daryl Hannah), to Virginia Gay’s cross-gendered queer Cyrano at the MTC in 2022, the story has a performance history as long as its hero’s nose. Mark Yeates (Cyrano) and Callum O’Malley (Christian) in a scene from Cyrano De Bergerac at fortyfivedownstairs. Matthew Chen This free adaptation from playwright Martin Crimp was staged on the West End and Broadway a few years back, with James McAvoy in the title role, and now comes to Melbourne in a bold indie production with a cast much larger than any of our main stages could afford to muster. Those who felt that Gay’s version for the MTC shortchanged Rostand’s poetry may take heart at the obsessive centrality it assumes in Crimp’s – the retention of rhyming couplets; the vision of Cyrano as spoken-word maestro, bounding across the stage versifying, mic in hand; even a poem composed (after Emily Dickinson’s Because I could not stop for Death) on the field of battle.\n\nAdvertisement\n\nThose who enjoyed the playfulness of a woman as Cyrano, on the other hand, and the undemanding romcom vibe Gay brought to the stage will be struck by the contrast here. The production has playful moments, but they’re locked within an epic dismantling of traditional masculine ideals. Mark Yeates leads a bare-chested, knife-wielding, testosterone-drenched deconstruction that hacks away at the very notion of the heroic and leaves an aftertaste more bitter than bittersweet.\n\nReviewed by Cameron Woodhead MUSIC\n\nGeese ★★★★★\n\nThe Croxton, February 12 An hour and a half before buzzy New York four-piece Geese are due on stage, there’s two lines of people on the footpath outside: one waiting to get in, the other sheepishly holding up signs for tickets: “Friend didn’t show up? I’ll buy your ticket,” reads one. Another: “This Goose has no tix”. Frontman Cameron Winter performs with Geese at The Croxton on Thursday, February 12. Martin Philbey Gooses they were. Ever since 23-year-old frontman Cameron Winter’s wonky, astonishing solo LP Heavy Metal grew from late-2024 curiosity into revered modern classic, the cult of Cameron has turbocharged Geese’s trajectory. When Winter’s Tuesday night solo piano show at The Forum went on sale in August 2025, it sold out instantly. In September, Geese released their third LP, the knotty Getting Killed, to rapturous reception. It means here now, on their debut Australian tour for Laneway Festival, both Winter and Geese could have played at venues three times the size, many times over. For one night only in High Street in Thornbury, it feels like being at the molten centre of the music universe.\n\nAdvertisement\n\nShockingly, Geese live up to the hype. Augmented by keyboard player Sam Revaz, Geese demonstrate they’re far more than their famous frontman’s backing band, with a dissonant clinic of sizzling indie rock, laced with prog, blues, punk, folk and anything else ever made with guitars. Somehow, nothing’s ornamental, no one slacks off. From the opening slow burn of Husbands, the rammed crowd yell every word of Winter’s knack for self-flagellation: “I’m falling apart”, “I’ve been hit by the bus of life”, “Baby, you can change and still choose me”. They blast through all of Getting Killed and a couple of songs from 3D Country (2023), including an unhinged 2122, inspiring the first circle pit of the night. Geese are the most exciting new band, and a damn marvel to see. Martin Philbey There’s a wild vibrancy to Geese live that just isn’t present on the airtight audio of their records. New chordal passages emerge as guitarist Emily Green and drummer Max Bassin lead odd, telekinetic choices – where Winter was his own wry agent of chaos at Tuesday’s intimate solo show, tonight he’s the steely, charismatic fulcrum around which Geese expands and contracts. Cobra, Au Pays du Cocaine and Taxes are gorgeous, given a spectral heft in this quasi-religious setting, while 100 Horses and the set-closing barnstormers, Long Island City Here I Come and Trinidad put the crowd on spin cycle.\n\nAdvertisement\n\nThe rumours are true: Geese are the most exciting new band, and a damn marvel to see. You’re a goose if you missed it.\n\nReviewed by Marcus Teague THEATRE\n\nCluedo ★★★\n\nComedy Theatre, until March 15 Every generation from the Boomers down knows Cluedo. Editions of the game have been around since 1949, and kids tend to learn what a murder mystery is by playing it – well before they’re introduced to Agatha Christie. The usual suspects ham it up in Cluedo. Eddie Jim Childhood nostalgia for the franchise undergirds this commercial comedy. It adapts Jonathan Lynn’s 1985 film Clue (a box office flop that developed a cult following) and a talented cast embraces the zaniness of a show that’s feather-light on suspense and plot but slathered with mildly diverting drollery.\n\nAdvertisement\n\nSix usual suspects are invited to an English country house under the assumed names of characters from the game – Professor Plum (David James), Miss Scarlett (Olivia Deeble), Mrs Peacock (Genevieve Lemon), Colonel Mustard (Adam Murphy), Mrs White (Rachael Beck) and Reverend Green (Laurence Boxhall). They’re greeted by the butler Wadsworth (Grant Piro), French maid Yvette (Lib Campbell) and a dour knife-wielding Cook (Octavia Barron-Martin). When their elusive host Mr Boddy (Joshua Monaghan) appears, it’s only for long enough to reveal sinister designs before adding to the body count. What follows is a chaotic hunt for the killer(s) that gets serially interrupted by yet more potential victims, and features a blend of ridiculous sight gags, exaggerated caricature, inane banter and comforting in-jokes, and tightly choreographed physical humour with strong elements of revolving-door farce. Cluedo is cosy, well-turned commercial entertainment. Eddie Jim Each actor confects moments in the spotlight. They all have fun playing with genre stereotype, though it’s Piro’s butler who acts as a kind of MC and gives the most versatile (and ludicrous) performance, with Boxhall’s neurotic, jelly-limbed slapstick not far behind.\n\nAdvertisement\n\nProduction values are high, the set and costume design on par with the style of murder mystery theatre – think The Mousetrap – that Cluedo merrily lampoons. Related Article Melbourne live reviews Tradition and modernity collide in this story of loneliness I’d like to see a push towards more diverse casting in shows of this ilk. The play’s nominal setting in 1940s England hardly calls for historical accuracy or naturalism when it’s based on a game played by everyone, and the familiarity Cluedo trades on might have even broader appeal if it better reflected contemporary Australian audiences. That said, Cluedo isn’t envelope-pushing stuff. Nor is it “a killer night out” as billboards claim. No, it’s undemanding comedy – a cosy, well-turned commercial entertainment that doesn’t outstay its welcome.\n\nReviewed by Cameron Woodhead The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "SMH",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/maori-stars-lead-powerful-pre-game-ceremony-20260215-p5o2fr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maori stars lead powerful pre-game ceremony",
    "publish_date": "Sun, 15 Feb 2026 13:50:39 +1100",
    "category": "sports",
    "authors": [],
    "text": "Maori stars lead powerful pre-game ceremony\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/multi-billion-dollar-funding-for-aukus-submarines-20260215-p5o2fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Multi-billion dollar funding for AUKUS submarines",
    "publish_date": "Sun, 15 Feb 2026 13:50:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/national/queensland/an-explosion-of-jazz-era-decadence-this-gatsby-is-one-wild-party-old-sport-20260206-p5o09i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "An explosion of jazz-era decadence, this Gatsby is one wild party, old sport",
    "publish_date": "Sun, 15 Feb 2026 13:34:28 +1100",
    "category": "entertainment",
    "authors": [
      "Nick Dent"
    ],
    "text": "Advertisement\n\n★★★★ NationalQueenslandEntertainment An explosion of jazz-era decadence, this Gatsby is one wild party, old sport Nick Dent February 15, 2026 — 1:34pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHE GREAT GATSBY ★★★★\n\nPlayhouse, QPAC, until March 8 The Great Gatsby turned 100 last year, and the novel’s vision of an apocalyptic void at the heart of the American Dream seems to be reaching an apotheosis in 2026. In the character of lovelorn bootlegger Gatsby squandering his wealth on debauched Long Island parties, it’s hard not to think of tech billionaires foisting their unhealthy products on a bewildered populace and using the proceeds to fund narcissistic schemes while the planet burns. Shiv Palekar as Jay Gatsby and Jess Vickers as Daisy Buchanan in a new stage adaptation of The Great Gatsby. Queensland Theatre Not that this new stage adaptation, a co-production of Queensland Theatre and local independents Shake & Stir, indulges in any tricksy updating, apart from a few techno dance sequences. It’s rather a faithful, fast-moving rendition that explodes with Jazz Age decadence and is fleshed out with witty dialogue courtesy of co-adaptors Daniel Evans and Nelle Lee.\n\nAdvertisement\n\nThe human drama hits harder here than in Baz Luhrmann’s 2013 version, but the film’s sensory overload is clearly a touchstone. Co-directors Evans and Nick Skubij offer enough sumptuous staging to equal the images that F. Scott Fitzgerald’s masterpiece conjures in the mind’s eye, from orgiastic New York speakeasies to desolate dump the Valley of the Ashes. It’s a showcase for designer Christina Smith, whose sets and costumes conjure the 1920s with hyper-real brilliance. Libby Munro as Jordan Baker and Ryan Hodson as Nick Carraway. Queensland Theatre Of particular note is the use of computer-controlled black screens that facilitate quick scene changes and concentrate the field of vision: at times the action seems to take place within a square silent-film ratio. The endearingly nervy Ryan Hodson (Shake & Stir’s Fourteen) has the arduous task of playing Fitzgerald’s narrator, Nick Carraway, and is barely off stage for over two hours. Carraway is the bonds salesman and would-be writer who moves to Long Island after serving in the war and stumbles into the love triangle between his waifish cousin, Daisy (Jess Vickers), her bigoted and abusive husband, Tom Buchanan (Jeremiah Wray), and the mysterious millionaire Gatsby (Shiv Palekar). Jeremiah Wray (Tom Buchanan) and Gatsby (Shiv Palekar) represent a clash of old and new money. Queensland Theatre\n\nAdvertisement\n\nNick’s PTSD is made palpable by the presence of a shadowy soldier in a doughboy helmet dogging his heels. In the title role, pink-suited Palekar gets a flamboyant entrance befitting his iconic status, but the character’s flimsy aspirations are soon apparent in Palekar’s aptly boyish and tentative performance. (You can read what you like into the casting of an Indian-born actor as the object of the racist villain’s scorn.) As his old-money nemesis Buchanan, the towering Wray is a proto-MAGA bully, but an equally lost soul: having played the creature in Shake & Stir’s Frankenstein, Wray has a way with piteous monsters. Related Article Review Brisbane Festival: These fairy tales are not for kids The production brings two of the female supporting roles to life impressively. As the pansexual lady golfer Jordan Baker, Libby Munro is the very image of a 1920s garconne, and her banter with the smitten Nick, daring him to take a “big swing”, is priceless. Nelle Lee plays Buchanan’s reckless mistress, Myrtle Wilson, and imbues her with Cyndi Lauper vibes. Musical theatre star Loren Hunter, meanwhile, augments Guy Webster’s excellent score with powerful renditions of period songs like I Get Along Without You Very Well (Except Sometimes). Evans’ emerging vision for Queensland Theatre seems to be as a timely interpreter of familiar IP. (His triumphant staging of Aaron Sorkin’s A Few Good Men last year sadly dovetailed with the death of the film version’s director, Rob Reiner.) This makes him a kindred spirit to Brisbane independent success story Shake & Stir, adaptors of everything from Dickens to Dahl, and future collaborations seem like a done deal. Can you repeat the past? Sure you can, old sport. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/world/asia/will-a-new-government-breathe-life-into-thailand-s-gasping-cannabis-industry-20260212-p5o1og.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will a new government breathe life into Thailand’s gasping cannabis industry?",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "finance",
    "authors": [
      "Zach Hope"
    ],
    "text": "Advertisement\n\nAnalysis WorldAsiaDrugs Will a new government breathe life into Thailand’s gasping cannabis industry? Zach Hope February 15, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhat in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox. Bangkok: If you’ve spent any time on the streets here in the last few years, you would have almost certainly caught the unmistakable waft of marijuana. Maybe you even indulged, and why not? It has been legal, after all. When Thailand removed cannabis from its narcotics list in 2022 – the first Asian country to do so – 18,000 or so marijuana parlours popped up around the country. Cannabis was decriminalised in Thailand in 2022, leading to a boom in dispensaries. Getty The shops were everywhere, like pubs in London. And if you didn’t smell them first, you couldn’t miss their flashing green neon signs in the shape of a marijuana leaf.\n\nAdvertisement\n\nThe idea behind decriminalisation was to boost Thailand’s brand as a wellness destination, give farmers a new cash crop and free up space in overcrowded prisons. Related Article Drug reform ‘As legal as garlic’: High times in Thailand as marijuana is decriminalised Coming out of the COVID-19 pandemic, it seemed just the trick. Tourism makes up roughly 15 per cent of Thailand’s GDP. Tycoon turned pro-business politician Anutin Charnvirakul was the champion behind decriminalisation. If that name sounds familiar, it’s because he has been Thailand’s prime minister since September, essentially in a caretaker role. On Sunday, his Bhumjaithai Party surpassed all expectations to win the most seats in the country’s snap elections, meaning he’s almost certain to stay in the job.\n\nAdvertisement\n\nOn the face of it, this would be a positive for the cannabis industry’s long-term health, no? Well, not necessarily. A blackboard illustrating cannabis strains for sale inside a dispensary in Bangkok. Bloomberg The cannabis trade has been a debacle of the former government’s own making. With few regulations in place, it boomed in 2022, becoming an out-of-control beast that ensnared previous non-users, including minors. Family holidaymakers, meanwhile, were turned off because who wants to be walking the kids through streets thick with the smell of drugs?\n\nAdvertisement\n\nA local backlash followed and, midway through last year, the ruling Pheu Thai party declared that cannabis could be sold only to someone with a doctor’s prescription. The burgeoning industry was decimated overnight. Shops were already struggling because there was too much low-priced cannabis, too many outlets and too few customers. Many closed. Some began looking the other way on prescriptions, spawning a black market that operates not just in plain sight, but under big glowing signs. In 2022, Thailand became the first country in Asia to decriminalise cannabis. Bloomberg Survival has meant new strategies. One shop in the Sukhumvit area, for example, redesigned its frontage to resemble a pharmacy. I ask the server, Ramil, 26, if Bhumjaithai romping home in the election (though the party still needs to cobble together a coalition) is good news for the industry.\n\nAdvertisement\n\n“Maybe?” he says, with an inflection of enthusiasm. “We’ll just have to see.” It has been a tough game for a long time now, he says. Cannabis flooded the market in 2022, cutting profit margins. “And then maybe it stabilised. But then with the prescriptions, that hurt.” Ramil, 26, behind the counter of a Bangkok marijuana parlour, which now looks more like a pharmacy. Zach Hope The most novel approach I’ve seen is at a shop called Cloud Nine, also in Sukhumvit. On the footpath outside, an A-frame sign declares “free prescription with every purchase”.\n\nAdvertisement\n\nWe asked the friendly, English-speaking server what it’s all about. (English speakers are vital because the customers are mostly foreigners, with Australians high on that list.) It’s all very simple, she says, asking not to be named or photographed. The cannabis trade has been a debacle of the former government’s own making. Bloomberg “If you purchase the flower, you’ll be consulting with a doctor. The doctor will diagnose you, asking ‘what do you need it for and how much do you need?’.” Then, hey presto, a prescription!\n\nAdvertisement\n\nThere’s no in-house doctor, she says. It’s a telehealth hook-up to a nearby clinic. Does the doctor ever say no? “Not really,” she says. There’s no need to book in advance and the whole process takes just a few minutes. “We won’t sell without [a] prescription. That’s the golden rule here,” she says. “Talking to my customers, a lot of them say, ‘Oh, why do we have to do it here? Other shops, they don’t do it’. But we’re doing it the right way.”\n\nAdvertisement\n\nShe says she has no idea whether Bhumjaithai will do away with the prescription law introduced by the previous government. It seems unlikely. Though we could not get a response from Bhumjaithai amid its post-election bargaining with other parties, Anutin has previously argued that the loosening of the laws was always focused on medicinal marijuana, rather than recreational, use. Anutin Charnvirakul speaks to media at Bhumjaithai Headquarters as results come in favouring Bhumjaithai on election night on Sunday. Getty Images No party wants to touch the law now. Surveys show the overwhelming majority of Thais don’t want recreational cannabis use legalised in their country. Meanwhile, even tourism bodies, concerned at losing high-value family holidaymakers, support reclassification. Visitor numbers in Thailand remain below pre-COVID levels.\n\nAdvertisement\n\nThousands of Thais invested their savings to open cannabis businesses that have already closed their doors. Others cling on precariously. The Thai government’s experiment with marijuana has not only been sloppy. For some people, it has been a disaster. Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/attacking-for-the-podium-why-bree-walker-can-win-another-gold-for-australia-20260213-p5o27r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Attacking for the podium’: why Bree Walker can win another gold for Australia",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Milan: Australia’s Winter Olympics has been marked by unexpected bounties, the golds taken by upstarts Cooper Woods and Josie Baff, who entered the Games without the weight of public adulation and the pressure that accompanies favourites.\n\nJakara Anthony, conversely, was the top weight in the freestyle moguls field and faltered on her last downhill run.\n\nAustralia’s gold medal chance in the monobob, Bree Walker. Credit: Getty Images\n\nAnthony’s stunning redemption in the dual moguls sets up the serious possibility of a fourth gold if Bree Walker fulfils her ambition in the monobob.\n\nWalker has been viewed as one of Australia’s best hopes for months, if not longer, having finished fifth in Beijing 2022 and improved markedly since under the tutelage of her coach, former Olympic champion Pierre Lueders, a bobsleigh whisperer she hired for the very purpose of getting on to the podium here.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/nsw/makes-our-city-less-liveable-residents-win-fight-against-24-7-barangaroo-venue-20260214-p5o2ap.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Makes our city less liveable’: Residents win fight against 24/7 Barangaroo venue",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "finance",
    "authors": [
      "David Barwell"
    ],
    "text": "Advertisement\n\nNationalNSWCity life ‘Makes our city less liveable’: Residents win fight against 24/7 Barangaroo venue David Barwell February 15, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA plan to boost Sydney’s 24-hour economy has hit a major obstacle, with the NSW government scaling back plans for around-the-clock trading at a new $100 million inner-city cultural venue after the proposal sparked a wave of community objections over late-night noise. The NSW government has walked back a contentious trading plan for The Cutaway cultural hub in Barangaroo after the site was earmarked for 24/7 operations as part of broader push by Premier Chris Minns to “bring Sydney back to life”. The Cutaway during construction works last year. James Brickwood When completed this year, The Cutaway will include multiple event spaces carved into the headland beneath Barangaroo Reserve, with room to host large art installations, performances, festivals, concerts, gala dinners, fashion shows and events including Vivid Sydney. But less than a year after the 24/7 operating hours were proposed, those plans have been scaled back, with most events to be capped at midnight, with limited exceptions for major occasions such as New Year’s Eve.\n\nAdvertisement\n\nOriginally, Placemaking NSW, the government agency overseeing the development, argued that 24-hour operations would advance the state’s vision to boost nightlife, tourism and Sydney’s global standing. The venue’s location next to Barangaroo Metro station was cited as a major advantage, allowing for extended trading supported by improved public transport access. A concept image of what the new venue will look like when completed. The proposal quickly drew objections from residents of high-rise towers and community groups in Barangaroo and Millers Point. Concern centred on the cumulative impacts of late-night events, particularly noise, crowd control and disruption to residential amenity. Anne Crabb, president of the Millers Point Community Resident Action Group, said the scale and design of the venue heightened those fears.\n\nAdvertisement\n\n“Unlike current 24/7 venues such as The Crown casino and The Star, this is a huge and open cavernous space located on the harbourfront,” she said. “Barangaroo can and should be a vibrant cultural precinct, but this must not come at the expense of our long-standing residential community who will have to deal with the late-night impacts.” The venue will have a capacity for almost 3000 patrons. James Brickwood Resident Rosalind Lehane said uninterrupted sleep would be jeopardised under a 24-hour trading model. “The proposed changes to The Cutaway of 24-hour noise and vibration are incompatible with this aim,” she said.\n\nAdvertisement\n\nRelated Article Exclusive\n\nCity life First look inside ‘tree’ sculptures to heal Barangaroo’s scar Strata representatives from neighbouring towers also raised concerns about the venue’s acoustic design. Strata managing agent Kate Maclachlan warned that the semi-enclosed structure could amplify sound and create “reverberation” impacts. In a submission to the NSW government, Robert Spears claimed noise levels could be comparable to a “Formula One grand prix race”. “If you wanted to devise a scheme to make our city less liveable than it already is, then you would come up with this new Cutaway proposal,” he wrote. In response to what planning documents described as “strong concerns”, Placemaking NSW has scaled back the operating hours to 8am to midnight. Some noise controls will be applied from 10pm.\n\nAdvertisement\n\nEvent patrons will be directed toward Barangaroo and Wynyard Walk, rather than through residential streets in Millers Point, and integrated ticketing will be encouraged to promote use of the metro. Business Sydney executive director Paul Nicolau described the decision to wind back the 24-hour operations as “disappointing”, arguing the city needed more late-night venues to counter the lingering effects of the pandemic and increased working from home. The 24/7 trading plan had sparked opposition from residents in the high-rise waterfront precinct. Sam Mooy “If you choose to live in Barangaroo – in the heart of a global city – a level of noise should be expected,” he said. “We desperately need to ensure there are enough venues and facilities that are open 24/7.\n\nAdvertisement\n\n“The venue could have hosted overnight concerts, creative events or live broadcasts of international sporting competitions. At the very least we should have given it a trial.” He said expanding public transport to 24-hour operations could have also supported the safe dispersal of late-night crowds. NSW 24-Hour Economy Commissioner Michael Rodrigues had supported the original operating hours, saying extended trading would facilitate a diverse range of events and encourage tourism. In revised plans, Placemaking NSW said the midnight finishing times would provide “a more clearly defined and constrained operating regime that balances the role of The Cutaway as a thriving, unique and industry-leading cultural venue with the need to protect the amenity of surrounding residential areas.” Business Sydney executive director Paul Nicolaou said the revised plans were disappointing. Brook Mitchell\n\nAdvertisement\n\nA spokeswoman said operations would begin with a three-month trial and that trading hours “may be further relaxed to support what Sydneysiders and visitors are seeking”. The changes remain subject to final approval from the NSW Department of Planning. The NSW government is taking steps to enhance the nighttime economy through reforms that have included simplified noise regulations, support for outdoor events and improvements to liquor licensing. Construction of The Cutaway is more than 85 per cent complete and the first events are expected to start by July. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/butters-won-t-be-rushed-on-future-after-fiery-origin-debut-weitering-cleared-according-to-dangerfield-20260215-p5o2eq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Butters ‘won’t be rushed’ on future after fiery Origin debut; Weitering cleared, according to Dangerfield",
    "publish_date": "Sun, 15 Feb 2026 13:02:55 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "“I’m looking forward to playing some footy this year, and obviously it started today (with Victoria), but looking forward to getting back to club land and playing with my teammates and hopefully getting a few wins.” Danger delivers Weitering news Patrick Dangerfield has good news for Carlton fans. The Cats superstar says Jacob Weitering has been cleared of any damage after he was taken to hospital following a heavy collision in Saturday night’s clash.\n\n“It’s good to see the big fella has been cleared,” Dangerfield said. Loading “That’s a part of footy, unfortunately, it is the combative nature that we love. But it’s great to see he’s been cleared of any damage.” Weitering was taken from the ground on a stretcher after Western Australian opponent Mitch Georgiades and teammate Sam Collins landed heavily on top of him during a marking contest.\n\nHe had scans on his chest and shoulder regions, but was cleared to fly back to Melbourne with the Victorian team on Sunday morning. “He was engaged with the WhatsApp group (last night), that’s for sure,” Dangerfield said. “That lit up last night.” Dangerfield said the way Western Australians embraced the State Of Origin return meant the concept “might be around for a while”, despite the prospect of injuries. “We’re going to see injuries next week, unfortunately, as well, especially in the early parts of match simulation and practice when you are really getting used to full-on contact,” he said.\n\n“You train it at this time of year, but you don’t fully engage with high-speed collisions. So it is one of those things that it is a difficult game to predict, and it’ll continue to be that way, I think, as long as we play it.” Toby and Zak make a pact Greater Western Sydney antagonist Toby Greene and Butters made a pre-game pact to set an aggressive tone during Saturday night’s clash against Western Australia at Perth Stadium in Perth. Which should come as a surprise to no one.\n\nThe feisty Butters found himself in a scrap with WA defender Tom Barrass when the home team were making a late charge to win back the lead. “I think he got Toby a bit late, and I was just backing him up,” Butters explained. “I think it’s in the Origin spirit. The game was pretty close at that point, so I really wanted to get the win. Zak Butters and Tom Barrass get up close and personal. Credit: Getty Images “We spoke about it a little bit pre-game. We’re both starting half-forward, so we said, we would try and set the tone in that area. I’ve looked up to him (Greene) for a while now, obviously growing up as a kid. I really admire the way he plays, so it’s good to do it with him.” Butters agreed that he and Greene liked to play on the edge.\n\n“I think I naturally do,” he said. “It comes down a little bit to it sometimes, but I feel like we’ve all created some good relations over the weekend. It helps me get involved in the game a little bit as well.” No wonder Port are so desperate to keep their heart-and-soul vice-captain. Max makes room for more trophies Decorated ruckman Max Gawn has formed a love affair with Perth Stadium. He lifted the premiership cup at the ground as Melbourne captain in 2021, during the COVID-19 years, and can now add a victorious Victorian debut at the venue to his glowing resume.\n\nMax Gawn (right) and his former Melbourne teammate Luke Jackson, now with Fremantle, after the game. Credit: AFL Photos via Getty Images After the game, the 34-year-old veteran made mention of two Melbourne greats connected to both historic wins – Victorian selector and chief motivator Garry Lyon, and the inspiration of Neale Daniher in the lead-up to the club’s drought-breaking premiership. “I’ve won silverware twice in this room,” he said. “I do like the Freo Dockers’ room. “I mean, any sort of emotional tie you can make in football, I think it is something that you can play on, you can use as a motivational tool. “And, yeah, we’ve used Neil Daniher at times. We’ve used lots of different things at times. And today, we used that Origin history.\n\nGawn said Lyon embraced the “Mr Origin” role. “He’s been good, Garry,” he said. “His job was to really fire us up. I mean, Chris Scott, what I’ve seen from Chris Scott, and the thing I’ve taken the most out of this, is seeing what people that you have a view on are actually like. Victorian coach Chris Scott with his Geelong/Victorian players, Patrick Dangerfield, Max Holmes, Tom Stewart and Bailey Smith. Credit: AFL Photos via Getty Images “And Chris Scott’s one of them, for mine. I think the balance of Chris Scott and Gary Lyon was unbelievable. Chris Scott was so method-based, and leaving the game up to some of the star players we had. And then Garry was like, nah boys, we got to put a hip and shoulder right into these [guys] in the first contest.\n\nWe asked Gawn about his preconceived view of Scott. Loading “I always thought he was cool, calm and collected. Sometimes I thought he was better than the game, but when you think about it, he’s actually just putting so much to his players. “He’s given his players a lot of flexibility in the way they want to play. And I really gelled with it, to be honest.” Gawn was mic’d up for the game and was looking forward to hearing his interaction with a star-studded midfield that included Marcus Bontempelli, Nick Daicos and Butters.\n\n“The young players kept coming up and saying, ’it’s a pleasure to play with you and Danger and Gunston and some of these guys, Bont, who have been around for a long time. But the pleasure is all ours,” Gawn said. “The fact that we can play with some of these Gen Z boys that are turning football into a new game … I mean, I didn’t have the normal input I normally have in games because the game was chaotic, the game was weird, the game was Origin, which was fun.” Suns pair reunited Gold Coast recruit Christian Petracca has well and truly embedded himself within the Suns playing group, according new teammate Sam Collins.\n\n“I actually went school with Trac,” Collins said after his State Of Origin debut for Victoria. “So, I knew the character that was coming across, and he’s been sensational for all the boys. “More, to say, his energy and connection that he brings to the group. You know, he’s opened his house up a number of times. “He’s always looking to do things and bring the energy … so he’s been sensational.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/technology/video-games/these-are-the-games-nintendo-hopes-will-help-make-switch-2-its-biggest-ever-hit-20260210-p5o123.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These are the games Nintendo hopes will help make Switch 2 its biggest ever hit",
    "publish_date": "Sun, 15 Feb 2026 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Advertisement\n\nAnalysis TechnologyVideo games These are the games Nintendo hopes will help make Switch 2 its biggest ever hit Tim Biggs February 15, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Switch is officially Nintendo’s best-selling game machine of all time, second only to Sony’s landmark PlayStation 2 for overall sales. And the follow-up Switch 2 is off to a good start, moving more than 17 million units in its first half-year to become the fastest-selling game system ever. But with global component shortages, rising prices and slow adoption of the Switch 2 from some major game-makers, Nintendo faces serious challenges in keeping the momentum up throughout 2026. Major big-budget releases like Resident Evil Requiem can run on Switch 2, but not all publishers are supporting the system yet. Announcing the latest sales figures recently, president Shuntaro Furukawa said the rising price of memory — driven by the AI boom — wouldn’timmediately affect the Switch 2 price, which is currently $700, but an increase may happen eventually. “We do not expect major impact during the fourth quarter of this year. However, from the next fiscal year onward, if this price hike lasts longer than anticipated, it could potentially put pressure on our profitability,” he said, according to Bloomberg.\n\nAdvertisement\n\nSo, what does the company have planned for 2026 to keep demand high enough to counter the headwinds? Mario Tennis Fever is Nintendo’s first big Switch 2 exclusive of the year. Nintendo’s own offerings With 155 million Switch consoles sold, Nintendo and other game publishers are keen to continue selling games on the eight-year-old device. Indie games and less graphically intensive games in particular continue to release for the original Switch, and also work on Switch 2. But slowly and surely, players will be encouraged to upgrade to the more expensive and much more powerful new machine. Nintendo’s approach with its own software is to introduce some games that are exclusively for Switch 2, and some that work on either console but are significantly better on the beefier hardware, while also issuing free and paid updates that bring new Switch 2 features to older games.\n\nAdvertisement\n\nAnimal Crossing: New Horizons, which was a huge driver of sales for Nintendo during the COVID lockdowns, received an update recently that bumps the game’s graphics up to 4K, makes use of the Switch 2’s mouse-style controls and microphone, and expands the multiplayer features. Next month, a Switch 2 update for Super Mario Bros. Wonder will add extra characters, modes, levels and minigames. The advantage here is that the upgrade to Switch 2 gets more appealing the more original Switch games a person has, especially in the case of games like Super Mario Odyssey where the improvements are free. But it also means some games getting more expensive; if you don’t already have Mario Bros. Wonder and want to buy it with the Switch 2 content included, it will cost $110. So far Nintendo has published five games exclusively for Switch 2 (pictured). But it has updated an equal number of original Switch games with exclusive new features, and launched Pokemon Legends Z-A and Metroid Prime 4 on both systems. At a recent event at Nintendo’s Melbourne headquarters I was able to play early versions of some new and upcoming games. Mario Tennis Fever is exclusive to Switch 2, and it turns tennis into a party game akin to Mario Kart or Super Smash Bros, with powerful racquet effects and weird optional rules on certain courts giving players heaps to keep track of. On the other hand, Pokémon Pokopia is clearly aiming for the broadest possible audience and is coming to both Switch and Switch 2. Co-developed by The Pokémon Company, Game Freak and Koei Tecmo, it blends the collecting of Pokémon and the social nature of Animal Crossing with the building recipes of Minecraft, but with the addition of some story elements to follow. Players take the role of a shape-shifting Ditto which has chosen the form of a human, and work to make a barren world habitable for a range of friendly creatures. It’s surprisingly engrossing, and could turn out to be one of the year’s sleeper hits.\n\nAdvertisement\n\nLater in the year Nintendo is planning to release all-ages platformer Yoshi and the Mysterious Book, anime tactics RPG Fire Emblem: Fortune’s Weave, and multiplayer action adventure The Duskbloods, from the developer of Dark Souls and Elden Ring From Software. The three are exclusive to Switch 2. The company often also announces new games before mid-year. The wider ecosystem As development of big-budget games has moved to more capable hardware, including the PlayStation 5 and Xbox Series X, fewer have been released on the low-powered original Switch. The extra grunt of the Switch 2 could potentially correct that, but many major studios are yet to announce their blockbuster games for the portable system. Some analysts point to reports that Nintendo was unable to furnish many studios with Switch 2 hardware ahead of its launch. Major third-party games planned for, or recently released on, Switch 2 Square Enix’s Final Fantasy VII Remake, with sequel Rebirth coming in June.\n\nUbisoft’s Assassin’s Creed: Shadows and Star Wars Outlaws.\n\nMicrosoft’s South of Midnight, Indiana Jones and the Great Circle, Fallout 4 Anniversary Edition and Oblivion Remastered, all due this year.\n\nAnticipated James Bond game 007 First Light, Sega’s Yakuza Kiwami 3, and Capcom’s Resident Evil Requiem will all launch on Switch 2 at the same time as other platforms in the coming months.\n\nResident Evil 7 and Village are arriving along with Requiem.\n\nEA and 2K’s licensed sports games are supported on the system.\n\nCyberpunk 2077 and Street Fighter 6 were included at the system’s launch.\n\nElden Ring is due to arrive this year.\n\nAdvertisement\n\nAt the event I was able to preview a pair of upcoming Capcom games; Resident Evil Requiem and Pragmata. These are games that would never have been able to run on the original Switch, but on Switch 2 they feel great and are visually impressive. If you had this version of Resident Evil side-by-side with a PlayStation 5 Pro running it at 4K and 60 frames per second with ray tracing, you’d immediately spot that the Switch 2 isn’t hitting the same resolution, performance or settings. But then a Switch 2 is almost half the price, and has the advantage of portable play. Both games looked awesome on the small handheld screen. So the issue currently isn’t that the console is underpowered, but keen gamers still can’t be assured the titles they’re excited for on PC and consoles will come to Switch 2, purely because it would be an extra lift for studios that plan their releases years in advance. It’s a catch-22, but more players may have to invest in Switch 2 before the studios consider it worth their while. The Virtual Boy is making a comeback on Switch and Switch 2. Meanwhile, Nintendo continues to expand its brand in all directions, outside new release games. A second Super Mario movie hits cinemas this year, with a live action Legend of Zelda currently filming. The Pikmin Bloom smartphone app, a take on Pokémon GO which encourages users to explore by walking, is going strong after five years. And the company runs a subscription on Switch and Switch 2 that gives families access to classic games originally published in the ’80s, ’90s and 2000s. The latest console added to this collection, the Virtual Boy, is notable because it was originally a financial disaster. The heavy and headache-inducing 1995 VR headset sold less than a million units, had 22 games published for it and was pulled from shelves within a year, with Nintendo all but refusing to acknowledge it until recently. Next week, subscribers will be able to play games from the worst-selling Nintendo system ever on the best-selling, with Virtual Boy on Switch and Switch 2.\n\nAdvertisement\n\nEditor's pick Exclusive\n\nVideo games 135 years of secrets: Nintendo is more than a video game company In my brief testing of the system, which requires a sold-separately viewer you slide your console into (Nintendo is selling both a $140 replica of the original headset and a $30 cardboard version), I was surprised to find the games still feel novel and interesting. They’re monochrome, but the 3D visuals work. Smart filters and display options make them comfortable to look at, and it’s all a reminder of what’s changed and what’s stayed the same in the past 30 years. If half a per cent of the Switch and Switch 2 audience get a new Virtual Boy, it will have reached more players than the original did back in the day. Get news and reviews on technology, gadgets and gaming in our Technology newsletter every Friday. Sign up here.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/federal/taylor-hume-vow-to-lowe-r-taxes-flag-budget-cuts-20260215-p5o2ef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Taylor, Hume vow to lower taxes, flag budget cuts",
    "publish_date": "Sun, 15 Feb 2026 12:53:01 +1100",
    "category": "finance",
    "authors": [
      "Brittany Busch"
    ],
    "text": "Advertisement\n\nPoliticsFederalPolitical leadership Taylor, Hume vow to lower taxes, flag budget cuts Brittany Busch Updated February 15, 2026 — 12:53pm ,first published 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Coalition’s new leadership will seek to win back a reputation of party of lower taxes and better economic managers after former leader Peter Dutton nixed their tax cut proposals before the last election. Opposition Leader Angus Taylor and deputy Jane Hume said on Sunday they wanted to return their party to its roots and reprioritise boosting productivity, leaving the door open to budget cuts. Taylor said he wanted the Coalition to be the party of lower taxes. Alex Ellinghausen The pair held the shadow treasury and finance portfolios at the last election, when the Coalition under Peter Dutton opposed Labor’s marginal tax cut and suggested the money be spent on defence instead. Taylor immediately conceded after ousting former leader Sussan Ley on Friday that policy had been a mistake and began pitching a directional change. “All Liberals know instinctively that the Liberal Party should always be, and must always be, a party of lower taxes because we know that when taxes are lower, Australians get a chance to get ahead,” Jane Hume told ABC’s Insiders on Sunday. “We know when taxes are lower, the economy grows without creating inflation.”\n\nAdvertisement\n\nTaylor identified the lack of tax cuts as a bad call in his first press conference as leader on Friday, and on Sunday said the best place to find money was through a non-inflationary, fast-growing economy. Asked about Dutton’s decision to oppose Labor’s tax cut, Taylor said: “I proposed a way forward with lower personal income taxes, and that is already something I’ve put on the record.” “We need to convince Australians that we will be the party of lower taxes, and we will take a strong, strong policy package to the next election,” Taylor said, speaking separately on Sky News. “Under Labor, we are seeing rising personal income taxes. I mean, they carry on about how they’re bringing down personal income taxes. Well, fine, we made a mistake in the election campaign. But let me tell you, when inflation rages – and it goes up as it is under this hopeless treasurer – people pay more taxes as a proportion of their income,” he said. Taylor said he had always advocated for lower taxes. Niki Savva, a columnist for this masthead, has reported Taylor and Hume had wanted to offer their own tax cut as a contrast to the surprise $5 a week tax cut Albanese revealed in the March budget last year. Dutton, according to Savva, was not interested in Taylor’s plan to offer a tax-back guarantee for those forced into a higher tax bracket by inflation.\n\nAdvertisement\n\nTaylor also denied he had worked to undermine Ley when he was on her frontbench. “I sought to be a supporter of her leadership every single day,” Taylor told Sky News. “We got to a point… where the view of the party room (was that) there needs to be a reset.” While Taylor and Hume were on Sunday reluctant to detail policy so soon after taking control of the party, Hume said they would oppose any plan to reducing the capital gains tax discount – something neither Treasurer Jim Chalmers and Prime Minister Anthony Albanese have denied. This masthead revealed the government was considering a cut in the CGT concession as part of a broader tax reform package aimed at helping younger Australians to buy their own home. Jane Hume said the party was always open to lowering taxes. Dominic Lorrimer\n\nAdvertisement\n\n“That discussion has been had in the party room for some months,” Hume said. “Whether it be changes to negative gearing, whether it be changes to capital gains tax… Liberals know instinctively, when we talk to each other, that we are a party of lower taxes, and that if you tax something, there is less of it.” Related Article Exclusive\n\nLiberal Party ‘We were like lemmings going over a cliff’: Inside Dutton’s $17 billion blunder “If you tax residential housing, there will be less of it. That would be a disaster. No one has yet come out and demonstrated that a wholesale change to capital gains tax on residential housing will create more houses or provide more rental opportunities for rental houses for those that are yet to purchase their first home.” Hume would not commit to any specific tax reforms but conceded “more of the same clearly isn’t good enough”. “I’m not making policy on the run on Sunday morning, 48 hours after I’ve become deputy leader,” she said. “Angus Taylor and I instinctively will always say lower taxes are better than higher taxes, and they’re better for all Australians.”\n\nAdvertisement\n\nHume, who will get to choose her portfolio, foreshadowed an economic role. “I am particularly interested in making sure I have an opportunity to talk about what’s important to me, which is making sure that we have a far more productive economy,” she said. Albanese attacked the new Coalition line-up on Sunday, saying his government would in July deliver the $5 a week tax cut they promised in the last election and one next year “after Angus Taylor led the charge to not only suppose but to say that he would legislate, if he hadn’t been elected treasurer in the election less than a year ago, that he would legislate to actually increase taxes for all 14 million Australians”.\n\n\n\nCut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/nba-dunk-contest-goes-badly-wrong-20260215-p5o2fh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NBA Dunk Contest goes badly wrong",
    "publish_date": "Sun, 15 Feb 2026 12:50:06 +1100",
    "category": "sports",
    "authors": [],
    "text": "NBA Dunk Contest goes badly wrong\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/nsw-to-get-additional-public-holiday-in-2026-2027-20260215-p5o2fc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW to get additional public holiday in 2026, 2027",
    "publish_date": "Sun, 15 Feb 2026 12:44:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 1
  },
  {
    "url": "https://www.smh.com.au/national/man-in-critical-condition-after-e-bike-crash-in-sydney-20260215-p5o2fe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Man in critical condition after e-bike crash in Sydney",
    "publish_date": "Sun, 15 Feb 2026 12:35:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/in-a-fast-paced-world-find-the-slow-lane-20260212-p5o1us.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "In a fast-paced world, find the slow lane",
    "publish_date": "Sun, 15 Feb 2026 12:32:07 +1100",
    "category": "finance",
    "authors": [],
    "text": "Advertisement\n\nSponsored InspirationHolland America Line In a fast-paced world, find the slow lane Sponsored by Holland America Line February 15, 2026 — 12:32pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhen did holidays become so hectic? In search of long-lasting memories, we try to pack a lot into every trip, but moving from one city to another, unpacking and repacking, can be a recipe for exhaustion. There is another way. Cruising is all about taking it slow, visiting several destinations while unpacking just once. But not all cruises are created equal. Holland America Line specialises in immersive itineraries designed for travellers who want to savour the journey rather than simply ticking places off their bucket list. This approach to relaxation also includes a variety of dining destinations, a ship size that gives you plenty of space to spread out, entertainment options stretching from live performances to family game rooms and a 1:2 crew-to-guest ratio that ensures you are always looked after. Start your voyage from the bustling waterfront of Seattle, the gateway to an immersive odyssey across the Pacific. Embrace the journey\n\nAdvertisement\n\nLonger itineraries are designed for travellers who love the idea of an old-school odyssey, traversing a region for weeks at a time. A voyage such as the 34-day Legendary South Pacific Crossing: Seattle to Sydney, is a leisurely experience and a rare opportunity to discover many of the far-flung archipelagos scattered across the Pacific Ocean. Sign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now. Guests will get to visit some of Hawaii’s loveliest islands, from the volcanic landscapes of the Big Island to the Jurassic Park jungles of Kauai, as well as exploring the many delights of Polynesia’s island groups. Highlights include snorkelling in turquoise lagoons, and visits to vanilla plantations and black-pearl farms. The ship also calls in at the Cook Islands and Tonga before cruising along the New Zealand coast, where memorable stops include the tranquil Bay of Islands, lively Auckland with its beautiful harbour and Wellington, also known as Windy Welly, the compact capital where you can visit the Lord of the Rings film locations as well as the workshop where many of the movies’ special effects were generated. Alaska invites you to slow down, with mirror-like waters and snow-capped peaks on a journey designed for deeper connection. Prefer to immerse yourself in a single destination? Few places are better suited to slow travel than Alaska. The largest state in the United States is also the wildest, and the more time you take to explore its crenellated coastline, the more you realise how spectacular it really is.\n\nAdvertisement\n\nThe Great Alaska Explorer itinerary, a 14-day round trip from Vancouver, gives you plenty of time to savour the region’s forest-covered bays and islands, salmon-filled streams and glaciers that glow blue in the sun. Longer days in port allow you to connect more deeply with each location, whether you join an expert-led excursion or simply wander through local streets and markets without having to rush. Alaska’s serene and icy wilderness is best captured through an immersive kayaking experience. Take a deeper dive Whether you choose to go kayaking in the turquoise Eklutna Lake, fed by molten glaciers, whitewater rafting down the Keystone Canyon or get up close to the mighty Hubbard Glacier, which regularly calves three-storey-high icebergs, it is hard not to be awed by Alaska’s untamed beauty. Beyond simply getting you up close to these amazing landscapes, these journeys also give you an intimate understanding of the destination. The Alaska Up Close program includes expert talks on everything from native cultures to the pioneer women who battled endless difficulties, while the Junior Rangers program is a fun way for kids to learn about the ecosystem, wildlife and culture.\n\nAdvertisement\n\nBreathtaking wildlife views like that of a breaching humpback, prove that Alaska’s grand scale and vivid sights elevate your slow travel journey. And because some of the best sightseeing is done from the water, expect to find several sea days on your itinerary. These will be among the most thrilling days of the trip, with National Park Service rangers and wildlife experts out on deck to help you spot bald eagles, sea otters, harbor seals, humpback whales and perhaps orcas. Alaska’s unique flavours are as unforgettable as its sights and sounds. Get ready to sink your teeth into local specialties from snow crab to wild berries, smoked seafood chowder to fresh-caught salmon. As the first and only cruise line to have every ship certified sustainable by Certified Seafood International, you can tuck in with a clean conscience. And if you feel like throwing a line in yourself, the Savour My Catch program offers the ultimate culinary thrill: the chance to reel in a fish and have it prepared for you for dinner that night. Holland America Line has been exploring the world for more than 150 years with expertly crafted itineraries, award-winning service and genuine connections to the destinations. Offering a perfectly sized ship experience, its fleet of 11 vessels visits nearly 400 ports in 114 countries around the world and has shared the thrill of Alaska for more than 75 years – longer than any other cruise line. Savour the Journey isn’t just a tagline, it’s a reinforcement that the cruise line provides experiences too good to hurry through, connecting travellers to the world and each other. Award-winning enrichment programming, entertainment and cuisine that brings each locale on board, including a revolutionary Global Fresh Fish Program. Find out more here.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Holland America Line\n\nTraveller Guides",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-outranks-sydney-melbourne-as-world-s-most-family-friendly-city-20260215-p5o2ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane outranks Sydney, Melbourne as world’s most family-friendly city",
    "publish_date": "Sun, 15 Feb 2026 12:27:50 +1100",
    "category": "finance",
    "authors": [
      "Brittney Deguara"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nBrisbane parents can sit at home with a smile on their face, knowing their kids are growing up in the world’s most family-friendly city.\n\nNew data from Compare the Market analysed green spaces per capita and safety to identify the top cities in the world to raise a family. Brisbane, which scored 6.4 out of 10, ranked the highest of 50 cities, with Sydney coming fifth and Melbourne seventh.\n\nBrisbane’s green spaces and parks, such as South Bank, have pushed the city into the top spot on a list of the best places to raise a family. Brittney Deguara/Brisbane Times\n\nFilling out the rest of the top five were London, Auckland and Helsinki.\n\nBrisbane had 84.89 parks and playgrounds per 100,000 people, compared to Sydney’s 7.62, Melbourne’s 2.73, and London’s 30.49.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/weet-bix-fermented-australian-kimchi-from-regional-tasmania/a2mc6iuwy",
    "title": "Weet-bix kimchi: Glynn's experiment with Australian and Korean favourites may be a hit",
    "publish_date": "Sun, 15 Feb 2026 00:18:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points A Korean Australian fermenter in regional Tasmania has created an \"Australian kimchi\" using Weet-Bix\n\nSue Glynn moved from Sydney to Tasmania a decade ago and went on to establish a kimchi business\n\nGlynn encourages migrants to look beyond big cities and consider regional Australia as a place of opportunity\n\nIn Korea, 2026 is the Year of the Red Horse, which has its origins in the traditional 60-year cycle combining Chinese zodiac animals with elements and colours.\n\nAs the Lunar New Year begins, red — a colour linked to energy, renewal and vitality — appears across many celebrations, decorations and food. Few dishes reflect that symbolism as vividly as kimchi, Korea's iconic fermented dish.\n\nIn a small town in regional Tasmania, Korean Australian fermenter Sue Glynn is redefining what \"local food\" can look like.\n\nGlynn runs a small-scale kimchi business and workshop program called KimchiMe, where she produces kimchi using organically grown cabbage and an unexpected Australian ingredient — Weet-Bix.\n\nThe result is what she calls an \"Australian kimchi\", designed to support slow, stable fermentation and gut health.\n\nGlynn runs kimchi-making workshops in Tasmania, where she discloses the Weet-Bix kimchi formula. Source: SBS News\n\nGlynn moved to Tasmania with her Australian husband more than a decade ago, after spending around 25 years living and working in Sydney. Seeking a different pace of life, she didn't want to repeat the same urban routine in a regional setting.\n\n\"I was interested in seeing people grow their own vegetables and make their own food,\" she said.\n\n\"Once, a local farmer who was very kind gave me a piece of land and said, ‘Why don't you try growing something here?' I really enjoyed planting seeds and watching something grow.\"\n\nHer first Tasmanian settlement was in Stanley, a small fishing town on the north-west coast with fewer than 600 residents. There, she began farming organically, growing up to 5,000 napa cabbages a year and supplying them to local markets.\n\nWhile she had established herself as an organic grower, a chance encounter with locally-made kimchi in Tasmania became a turning point.\n\nGlynn began making kimchi using the cabbage she grew herself. Source: SBS News / Leah Hyein Na\n\n\"That kimchi wasn't the kimchi I had grown up with,\" she said.\n\n\"I felt I wanted to make an authentic, genuine kimchi — something rooted in our culture — and my customers encouraged me by saying, 'Show us your culture.' That became my motivation.\"\n\nGlynn began making kimchi using the cabbage she grew herself. Her kimchi differs from many commercially available versions in Australia, with a lighter, cleaner flavour and less reliance on fish sauce. The style reflects family recipes passed down through generations.\n\n\"My parents came to South Korea from the North after the Korean War,\" she said.\n\n\"I grew up watching my grandmother and mother make kimchi, and those North Korean family recipes stayed with me.\"\n\nWhat is kimchi?\n\nKimchi is a fermented dish typically made from vegetables such as napa cabbage, radish, spring onion and cucumber, seasoned with chilli, garlic, ginger and salt.\n\nAccording to Korea's food and drug safety ministry, there are more than 2,000 varieties of kimchi.\n\nLISTEN TO Kimchi: A Story of Love and Memory SBS Korean 07:22 Korean\n\nIt's a cornerstone of Korean cuisine — more than just a side dish, but a soul food served with almost every meal, from simple home-cooked dinners to Korean barbecue and special celebrations.\n\nIn an era when kimchi is easily bought, making it by hand remains something special for many Koreans — a way of staying connected to culture, family and tradition.\n\nKimchi, a new taste for Tasmanians\n\nWhen Glynn first sold kimchi at Tasmanian markets, many locals were unfamiliar with it, and she often had to offer tastings to introduce people to the flavour.\n\nOver time, as global interest in Korean culture grew through films, television dramas and K-pop, kimchi became more widely recognised.\n\nGlynn said it has been particularly well received by people interested in health and wellbeing, drawn to its fermented nature and probiotic benefits.\n\n\"People in their 30s through to their 70s show strong interest,\" she said.\n\n\"Especially those who want to improve their gut health. It's not limited to one age group.\"\n\nHer produce and kimchi have been assessed by several Australian food awards programs, including the Royal Tasmanian Fine Food Awards, Royal Hobart, Melbourne Royal, and Australian Food Awards, where they received multiple acknowledgements for quality.\n\nIn 2022, Glynn was also named a finalist in the Australian Organic Industry Awards' farmer of the year category.\n\nGlynn grows up to 5,000 napa cabbages a year, and supplies them to local markets Source: SBS News / Leah Hyein Na\n\nTwo years ago, Glynn relocated to Evandale, around 10 minutes from Launceston airport.\n\nWhile she scaled back farming production, she shifted her focus toward people — creating more opportunities to connect, share and exchange culture through hands-on kimchi workshops.\n\nAt one workshop, local resident Clare tried kimchi for the first time. \"It's amazing — tasty, fresh, and beautifully balanced,\" she said.\n\n\"It's something completely different from anything I've had before. I really enjoyed it.\"\n\nAnother participant, Di, said the experience made fermentation feel accessible.\n\n\"I loved using natural ingredients and knowing exactly what goes into it,\" she said.\n\n\"The hands-on process was so much fun, and it was great doing it together. It makes you want to experiment more.\"\n\nA very Australian replacement\n\nThe most surprising element of the workshop was Glynn's Weet-Bix kimchi.\n\n\"When making kimchi, Koreans usually add starch, such as glutinous rice or wheat starch, to feed the microorganisms and support fermentation,\" Glynn explained.\n\n\"One morning after breakfast, I thought — Weet-Bix is also made from grain. Why not?\"\n\nBy blending Weet-Bix with garlic and ginger, then mixing it with Korean chilli powder, coconut soy sauce and white peach paste, she creates a rich wet mix that coats the salt-pickled cabbage and supports fermentation — without the need to cook a separate starch.\n\nGlynn uses Weet-Bix for the vital ingredient of starch. Source: SBS News / Leah Hyein Na\n\n\"Using Weet-Bix makes the process much simpler,\" she said.\n\n\"It stabilises fermentation and helps develop flavour beautifully.\"\n\nWorkshop participant Carol was intrigued by the idea.\n\n\"Using something as simple as Weet-Bix — something everyone has in their pantry — as a fermentation base is fascinating,\" she said.\n\n\"It makes fermentation feel uncomplicated and approachable.\"\n\nTassie's future for fermentation\n\nGlynn believes Tasmania's cooler climate — similar to Korea's winters — makes it particularly suitable for fermented foods like kimchi. She notes that this aligns with the Tasmanian government's broader push to increase value-adding in agriculture and food production through fermentation.\n\nThrough collaboration with local councils, the Tasmanian government has invested $1.7 million in a 1,800-square-metre fermentation hub near Launceston, designed to support small-scale fermenters. Glynn has also participated in the project.\n\nTasmania's population stands at around 570,000, with 15.3 per cent born overseas, according to the latest Census. By comparison, more than 40 per cent of Sydney's population was born overseas.\n\nDespite its smaller migrant population, Glynn believes regional areas like Tasmania offer genuine opportunities for migrants.\n\n\"Many migrants live within bubbles in big cities like Sydney and Melbourne,\" she said.\n\n\"But if you look at Australia more broadly, there are real opportunities in regional areas.\"\n\nShe points to demand in agriculture, dairy farming, beef farming and skilled trades, where labour shortages persist.\n\nGlynn holds kimchi making workshops to share and exchange culture.\n\n\"Cities may have more jobs, but competition is fierce,\" she said.\n\n\"Here, if you have skills, a strong work ethic and a positive mindset, it's much easier to build something sustainable.\"\n\nIn Evandale, Glynn's kimchi has already found a home. Richard, a local shop owner who stocks her products, said her presence has brought new energy to the town.\n\n\"Having Sue living here, and potentially running more workshops in the future, could really shape the town,\" he said.\n\n\"Who knows — Evandale could one day become the kimchi capital of Tasmania.\"\n\nIn Glynn's hands, kimchi becomes more than food — showing how migrant traditions can impact Australians all over the country.\n\nThis story was produced in collaboration with SBS Korean.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/anzac-day-public-holiday-which-states/0nax12a1k",
    "title": "Which states get an Anzac Day public holiday this year?",
    "publish_date": "Sat, 14 Feb 2026 23:09:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "People in Australia's most populous state have been granted an Anzac Day long weekend for the next two years and could be in line for more public holidays.\n\nPremier Chris Minns has announced NSW will have an extra public holiday in 2026 and 2027, when Anzac Day falls on a Saturday and Sunday.\n\nRemembrance services are held nationwide on 25 April but previously, only people in Western Australia and ACT had been granted an additional public holiday on the following Monday.\n\nThe ACT had announced it would transfer the public holiday to the Monday, and that all commemorative activities would take place on the Saturday as usual. In WA, the government has designated both the Saturday and the Monday as public holidays.\n\nUnlike New Year's Day, Christmas Day and Boxing Day, previously there were no additional public holidays declared in NSW when Anzac Day fell on a weekend.\n\nREAD MORE Minns to consider creating public holiday fix for 'underserved' state\n\nAdding a public holiday in these circumstances won't diminish the tradition, Minns insisted.\n\n\"If anything, it is a reminder of its importance and another reason for people to get up, attend a local service and ensure the spirit of remembrance continues to be passed on to the next generation,\" he said in a statement on Sunday.\n\nRestaurants and cafes encouraged not to open\n\nThe NSW Returned and Services League (RSL) said it did not oppose the introduction of an additional public holiday after consulting with members.\n\n\"I've already had feedback from some smaller RSL organisations that ... it may give them an opportunity to get together on the Monday,\" its acting president Vince Williams said.\n\n\"Additionally, a public holiday on Monday will also provide many serving Australian Defence Force personnel who are required to work on Anzac Day itself with an opportunity to spend quality time with their loved ones.\"\n\nBut the decision hasn't garnered universal backing, with Minns acknowledging not all business groups were on board.\n\n\"We know that it's somewhat of an additional burden for small businesses in particular,\" he said.\n\n\"But this is, we believe, an important thing to do for the state.\"\n\nThe decision will lift labour costs for hospitality venues to 75 and 100 per cent of sales, Australian Restaurant and Cafe Association chief executive Wes Lambert warned.\n\n\"So we'll be encouraging cafes and restaurants not to open,\" he told ABC TV.\n\n\"It won't just be a public holiday for office workers, it'll be a public holiday for everyone.\n\n\"Hospitality businesses are on some of the lowest profit margins in history, below three per cent, and they just cannot wear another public holiday in NSW.\"\n\nMajor lobby group Business NSW declined to comment on the decision.\n\nFewer public holidays in NSW\n\nNSW has fewer public holidays than all other mainland states and territories.\n\nAnzac Day is one of 10 public holidays recognised nationwide in 2026.\n\nMost Australians get another three or four, including those in Victoria, Queensland, ACT and South Australia.\n\nBut NSW enjoys just two extra: the King's Birthday in June and Labour Day in October.\n\nChristmas Island celebrates an extra six, including two for Lunar New Year in February.\n\nThe Minns government will consider making the Anzac Day change permanent and decide if the number of statewide public holidays is enough.\n\nIt will look at economic and social impacts of the extra public holiday in 2026 and 2027 and be subject to feedback from community, business and veteran groups.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/article/jakara-anthony-winter-olympics-gold-medal/dbfe6nwgy",
    "title": "'Unprecedented times': Jakara Anthony's Olympic gold secures record medal haul for Australia",
    "publish_date": "Sat, 14 Feb 2026 20:30:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Surpassing previous Olympic medal hauls by Australian teams with the Milano Cortina Winter Olympics only at the halfway mark, team chef de mission Alisa Camplin has hailed the performance as \"mind-blowing\".\n\nJakara Anthony overtook snowboarder Scotty James as the country's most decorated Winter Olympian when she clinched the first-ever dual moguls gold medal on Saturday.\n\nAfter starting as a hot favourite, the Beijing champion had been unable to defend her title in the individual event three days earlier after a slip-up in the medal round.\n\nAnthony's medal brought the tally to four with a week still to go — her gold adding to those won by her moguls teammate Cooper Woods and snowboard cross racer Josie Baff as well as the silver won by five-time Olympian James in the halfpipe.\n\nAustralia had secured four medals in Beijing, but only one gold.\n\nREAD MORE Tears of joy as snowboarder Josie Baff scores Australia's second Winter Olympics gold\n\n'We're in unprecedented times for winter sport'\n\n\"We had four medals in Beijing, and back in 2010 we had two golds and a silver, and we now have three golds and a silver, so we've certainly surpassed previous performances,\" said Camplin, herself a two-time aerials medallist.\n\n\"It was hard last night seeing Scotty James, he was gunning for gold and until today he was our most decorated Olympian with bronze and two silver and now Jakara winning two golds, we're in rarified air. It's unprecedented times for winter sport.\n\nThere are more medal chances to come with Woods and Matt Graham leading the charge in the men's dual moguls on Sunday, while Bree Walker is ranked world No. 2 in the monobob and teenage freeskier Indra Brown has won a World Cup in the halfpipe.\n\nWhile Laura Peel was forced out of the aerials after rupturing her ACL, fellow veteran Danielle Scott could also podium.\n\n\"Every team is unique and we've just grown over time. The inter-generational sharing of experience and culture and wisdom and ongoing funding from the government, it's enabled us to build and build and build,\" Camplin said.\n\n\"It's everything we could have dreamed of. We had a great team, highly-credentialed and we're only halfway through and we've had our most historic result so I'm pretty overwhelmed to be honest.\n\n\"When we looked at the schedule of the way the Games was set up, there was potential for it to happen.\n\n\"You're talking about serious competitors. None of these have been good luck — they've all been hard work and preparation.\n\n\"We've worked really hard as a winter sport community and industry to deliver those kinds of results.\n\n\"Across all clusters we're just in this amazing space of teamwork and culture of good people and excellence and I hope Australia can feel it and that we're inspiring everyone back home because what's happening is pretty special.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 5
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-needs-to-happen-to-bring-the-murray-darling-basin-back-to-health/flm7l3sho",
    "title": "INTERVIEW: What needs to happen to bring the Murray Darling Basin back to health?",
    "publish_date": "Sat, 14 Feb 2026 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/lunar-new-year-mental-health-expert-tips/45biogco0",
    "title": "Stressed about Lunar New Year? Here are tips to look after your mental health",
    "publish_date": "Sat, 14 Feb 2026 19:40:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "As Lunar New Year approaches, many Asian Australian families are planning an annual gathering to celebrate the festival — but not everyone feels happy about it.\n\nThe two-week cultural festival is often considered a time for family reunions, connections and new beginnings, but increased family time can also create pressure and reopen old wounds, according to Maria Cassaniti, manager of the NSW government's Transcultural Mental Health Centre in western Sydney.\n\n\"Lunar New Year, similar to other events for different communities … is a time of excitement and celebration for many, but we also know that these kinds of events … can come with [their] own stress,\" she tells SBS News.\n\nWhile some multicultural communities may still grapple with stigma about mental health, Cassaniti says many have become more aware of its importance in recent years, including during cultural events such as Lunar New Year.\n\nREAD MORE How to navigate family estrangement over Christmas\n\nSBS News has spoken with several psychologists and mental health experts ahead of the festival, which starts on 17 February, about how to look after your mental health during the Lunar New Year. Here are their tips.\n\nFrom dinner table arguments to inappropriate comments\n\nIn China and Vietnam, where people can enjoy a week-long holiday for Lunar New Year, local media have reported on youth disengagement with the traditional festival, citing stress from dealing with family expectations.\n\nIn Australia, young people from the Asian diaspora may also find themselves in similar shoes, as their values may differ from those held by older generations who grew up in Asia, says Christopher Tran, a Sydney-based psychologist dedicated to multicultural mental health.\n\nSydney-based psychologist Christopher Tran says generational disputes are common in many Asian Australian families. Source: Supplied / Christopher Tran\n\n\"There's a bunch of things in Asian cultures that don't necessarily make things difficult, but it's interesting when it interacts with the culture we have here [in Australia],\" he tells SBS News.\n\nTran says many of his clients have found it difficult to deal with \"personal questions\" and comments from family members — on subjects ranging from marriage to career progression — as well as managing family expectations.\n\nTip: Be prepared, and set a boundary for engagement\n\nIf you feel stressed about interacting with other family members, Cassaniti suggests it could be helpful to prepare for questions from senior relatives.\n\nVeronica Ing, a Sydney-based psychologist, also suggests people practise self-soothing exercises to ensure a calm state of mind and increase tolerance for potentially uncomfortable conversations before family dinners.\n\n\"Coming in with a higher tolerance means that you're more likely able to deal with any emotional triggers while you're in the presence of your family,\" she says.\n\nTran suggests setting a time limit for engagement and considering booking a follow-up event to give yourself an excuse to leave on time.\n\n\"The general thing is just remembering that: 'my parents or my uncles and aunties, they carry their own values, their own anxieties, I carry my stuff. I'm allowed to choose how much I let in of this,'\" he says.\n\nLISTEN TO Learning to understand your 'tiger' parents SBS Chinese 32:56 English\n\n\"And basically it's just about every time they try to shine that spotlight on you, just click it away.\"\n\nCassaniti, Ing and Tran say it's also important to keep in mind that people can choose whom they do and don't want to spend the Lunar New Year with.\n\nLoneliness and homesickness\n\nWhile some Asian Australians face stress from family estrangement, some international students and first-generation migrants living away from their loved ones might feel homesick and lonely during the festive period.\n\nLoneliness has been described as \"the silent epidemic\" by the Australian Psychological Society. University of Sydney research from 2025 found 43 per cent of Australians aged 15 to 25 feel lonely.\n\nDr Eric Fu, senior research fellow at the Youth Research Centre at the University of Melbourne, says many young people start university expecting a rich social life, only to find themselves isolated by their living arrangements, which can foster \"a heightened sense of loneliness\".\n\nHe's noticed loneliness has become a \"big issue\" among Chinese international students in particular, as many struggle to integrate and connect with local communities due to cultural and linguistic barriers.\n\n\"Because they are only here for a short period of time, and also they didn't really get the chance to really set their roots into the local community,\" he says.\n\nTip: Use social media well, and go for a walk\n\nFu, who has conducted research about the well-being of Chinese international students in Australia, found many turn to social media to seek interest groups and build connections with peers.\n\nHe says students also use social media to stay connected with families, friends and even strangers with similar cultural backgrounds.\n\n\"Sometimes even some unknown people clicked a like or collected their notes on Xiaohongshu or WeChat [Chinese social media apps], even that kind of recognition or identification can really play a role for them to really feel less lonely in Australia.\"\n\nBut while agreeing that social media can be a useful engagement tool for students, Fu also warns them to be cautious about online scams, especially if they have recently arrived in Australia.\n\nMore importantly, he encourages international students to \"leave their accommodation and just go out for a walk\" to explore their neighbourhoods and local communities.\n\n\"I think that will be a good way, you know, to really overcome that kind of sense of acute loneliness, you know, especially during this kind of traditional Chinese [festival] period.\"\n\nTran and Ing also point out that the Lunar New Year could be a good opportunity to build connections, as councils and local libraries often host community events.\n\nREAD MORE 2026 Lunar New Year: Celebrations Across Australia You Need to Know\n\nBesides staying connected with people in Australia, Ing and Cassaniti also encourage people to use video calls and online chats to stay connected with families living overseas as a way to counter loneliness.\n\n\"[Don't] be afraid to reach out and practice being vulnerable when you're initiating contact,\" Ing says, adding that in some Asian cultures, people may not be used to directly expressing their love and vulnerability.\n\nGambling\n\nHuangyuan Chen, a counsellor at the GambleAware Multicultural Service, tells SBS News that some members of Asian communities participate in gambling — such as playing mahjong with money — as a means of social connection during festive seasons.\n\nMajor casinos in Australia have also invested in Lunar New Year celebrations to try to attract overseas visitors.\n\nChen says it's key that people maintain control of their behaviours and take strategies to prevent themselves from engaging in problematic gambling.\n\nThis could include talking to casino staff to impose a ban on themselves from entering the venues, blocking gambling websites and talking to a gambling counsellor, Chen says.\n\nShe says people also need to be mindful of their motivations for gambling and the potential effect on others.\n\n\"Think about the people around you, because we know that people can be socially influenced [by] gambling,\" she says.\n\n\"Keep a distance from people influencing you to gamble, or keep away from the social influence, the online influence, and at the same time, spend more time with people with other interests, away from gambling, if possible.\"\n\nConsider taking leave\n\nExcept for Christmas Island, Lunar New Year isn't a public holiday in Australia. But with upcoming gatherings and other cultural practices, maintaining work-life balance can be challenging for those who celebrate amid competing priorities.\n\nTran suggests people start with the practical steps, such as speaking to their manager.\n\n\"That could feel scary, and we don't know exactly if that's going to be successful,\" he says.\"But it's worth a try, because there are some workplaces that will actually respect this [cultural festival].\"\n\nHe says people should weigh up their priorities and focus on what they think is most important.\n\n\"If you're leaning on work, then speak to your family and see if you can rearrange things; if you know family is more important, then you might just bite the bullet and just take some leave.\"\n\nPost-Lunar New Year care\n\nIf people find family gatherings during the Lunar New Year stressful, it may be worth considering seeking professional help in the future to unpack the source of pressure, Tran says.\n\nIn recent years, there have been practitioner-led initiatives and government-supported multicultural programs that encourage people with multicultural backgrounds to seek culturally inclusive mental health care, with interpreting services available.\n\nBut in the case of international students, previous research by Dr Michelle Peterie from the Sydney Centre for Healthy Societies at the University of Sydney shows that international students are less likely to access psychological support services than domestic students, as they may not know about services or worry about the costs.\n\n\"There is a real need for government-led, sector-wide action to both address some of the challenges international students face in Australia, and ensure appropriate help is available and accessible when required,\" she says.\n\nReaders seeking crisis support can contact Lifeline on 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25).\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au .\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\nCall GambleAware on 1800 858 858 and request to speak to someone in-language if you seek support related to gambling harm.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/injured-aussie-aerials-champion-ruled-out-of-olympics/w5why8969",
    "title": "Injured Aussie aerials champion ruled out of Olympics",
    "publish_date": "Sat, 14 Feb 2026 09:42:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's two-time aerials world champion Laura Peel, who was unable to recover from a serious knee injury, has withdrawn from the Olympics.\n\nPeel is the fourth Australian forced out of the Olympics through injury, joining snowboarders Cam Bolton and Misaki Vaughan, as well as teen freeskier Daisy Thomas.\n\nPeel ruptured her ACL at a pre-Games training camp in Airolo, Switzerland, in early February but refused to give up hope of winning her first medal at her fourth Olympics.\n\nBefore the injury Peel had struck some impressive form, winning a recent World Cup event in Canada, and was considered a strong medal chance in Italy.\n\nREAD MORE Tears of joy as snowboarder Josie Baff scores Australia's second Winter Olympics gold\n\nHowever, with official training on the competition jump site getting under way, she realised she wasn't up to competing and made the decision to withdraw.\n\n\"I'm heart-broken my Olympic dream has come to an end in this way,\" the 36-year-old said.\n\n\"I put everything into this campaign, and never imagined I wouldn't make it to the start gate.\n\n\"I'm grateful for all the support I have received from the medical and support teams, we have worked so hard to try and change this outcome, but unfortunately it's not meant to be.\"\n\nHer withdrawal is also a blow to Australia's hopes in the mixed team event, the first time they were set to field a three-skier team, with Peel competing alongside Danielle Scott and Reilly Flanagan.\n\nThe Australian team is looking to bring in a replacement athlete for the aerials competition.\n\nOn Friday, snowboarder Cam Bolton had to be medically transported back to Australia from Italy after fracturing his neck and back in a scary training accident before his race.\n\nYoung freeskier Daisy Thomas also suffered a knee injury in a fall while Misaki Vaughan was ruled out of making her debut, failing a head injury assessment (HIA) after hitting her head while training on Monday.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/anthony-albanese-angus-taylor-criticism/0nhyfq7cc",
    "title": "'Can a souffle rise once?': Albanese takes first swipe at new Opposition leaders",
    "publish_date": "Sat, 14 Feb 2026 04:05:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese has borrowed from a sharp-tongued predecessor to launch his first attack on new Opposition leader Angus Taylor, asking \"can a souffle rise once?\"\n\nAlbanese played on an infamous insult from former prime minister Paul Keating, who asked whether a souffle rises twice when Liberal Andrew Peacock mounted a challenge to regain the party leadership in 1989.\n\n\"Angus Taylor presents us with a new question: can a souffle rise once?\" Albanese said during a speech to the NSW Labor Country Conference in Orange on Saturday.\n\nIt was the prime minister's first public comment on Taylor's toppling of Sussan Ley in a long-anticipated Liberal leadership spill.\n\nTaylor's 34-to-17-vote win on Friday brought down the Liberals' first female leader just nine months after she took the top job.\n\nLabor reaction to leadership change\n\nAlbanese said Taylor and his new deputy Senator Jane Hume had both damaged their party with their various opposition to tax cuts, cost-of-living relief and renewable energy.\n\n\"It is extraordinary that they have had eight months of plotting in order to deliver the two people to the leadership positions who more than anyone else on their entire show were responsible for alienating the Liberals from the Australian voters,\" he said.\n\n\"But that is what they have done. Every single challenge that is before us, they have failed on.\"\n\nWithin minutes of the change of leadership, the federal government rolled out online attack ads criticising Taylor's record as a minister and shadow treasurer.\n\nFederal minister Murray Watt said the spill would do little for the Coalition.\n\n\"The Liberal Party has completely lost touch with the vast majority of Australians and what they care about,\" Senator Watt told reporters in Sydney on Friday.\n\n\"There is no evidence to date that Angus Taylor has any solutions for those challenges.\"\n\nTreasurer Jim Chalmers said Taylor's record was shambolic.\n\n\"Angus has zero credibility on the economy and neither does the bin fire that is the coalition,\" he said.\n\nTaylor pledges to prioritise 'standard of living'\n\nJust days after reuniting the Coalition with Ley at the helm, Nationals leader David Littleproud said Taylor would be the right person to lead the Opposition back into government.\n\n\"Angus is the leader Australia needs to take up the fight against Labor's reckless spending and ideology,\" he said.\n\n\"Angus can offer hope to aspirant Australians and those who are struggling to enter the housing market.\"\n\nREAD MORE Angus Taylor calls for lower migration in first speech as new Liberal leader — as it happened\n\nSpeaking after his win on Friday, Taylor said his first priority would be to restore Australia's standard of living, which he said \"has collapsed under a rotten Labor government\".\n\n\"They do not know how to manage this economy, [the] result is Australians are getting poorer, their standard of living [is] going backwards — not just in absolute terms, but relative to peer countries around the world,\" he told reporters.\n\nLey announced she would resign from parliament in the coming weeks after losing the leadership, triggering a by-election in her NSW seat of Farrer.\n\nOne Nation leader Pauline Hanson said her party would field a candidate in the upcoming by-election.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-introduction-of-decimal-currency-60-years-on/hvtgyzcll",
    "title": "The introduction of decimal currency, 60 years on",
    "publish_date": "Fri, 13 Feb 2026 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\n\"Australia changes her currency. Pounds and shillings are out, and dollars and cents are in.\"\n\nIt's the 14th of February, 1966 - and Australians have woken up to a new way of counting money.\n\n\"They're 40c a dozen what do I do? Oh gran, you can pay in shillings and pence, or dollars and cents - one kind of money is as good as the other.\"\n\nThe changeover - one of the largest financial transitions in the nation’s history.\n\nBut it took a massive effort to get there - Including the help of a certain jingle.\n\n\"In come the dollars, in come the cents to replace the pound, shillings and pence.\"\n\n\"The government embarked on a national public education campaign. They rolled out television ads, radio. There was education in schools, special education for banks and shops, and it was really successful.\"\n\nEmily Martin is the CEO of the Royal Australian Mint in Canberra – where the coins are made.\n\nShe says it wasn’t just a move that aligned us with much of the world, but also helped simplify trade and everyday transactions.\n\n\"There was a lot of calculations that people had to make to understand how many shillings were in a pound and pence in a shilling, and it was a very complex system.\"\n\nShe also says it’s an opportunity to help tell the nation’s story through metal.\n\nAnd six decades on, the Royal Australian Mint continues to preserve that history.\n\n\"We educate visitors, international tourists, school groups, this wonderful place that people can come and learn about our currency and the stories that we tell through our coins.\"\n\nIt’s also home to the National Coin Collection – which contains more than 15-thousand items – from early colonial currency and rare proof coins, to the very designs that marked Decimal Day.\n\nThose were the brainchild of artist and metalworker Stuart Devlin – who went on to become Queen Elizabeth the Second’s jeweller.\n\nMr Devlin had won a competition in 1964 – beating five other competitors – to develop the artworks for the new coins…. Which introduced a distinctly Australian look.\n\nThe now-defunct one and two cent pieces featured a feathertail glider and frill-necked lizard.\n\nEven the 12-sided 50 cent coin made a statement. Originally it was round, and made from silver in 1966 – before changing shape, to prevent confusion with the 20 cent piece.\n\nIt carries Australia’s coat of arms.\n\nThe Royal Australian Mint's Director Museum and Public Engagement Stuart Baines says the National Coin Collection also holds coins from over 100 countries.\n\n\"It's not just Australian coins and it's not just post decimal, the coins we have made. One of our prized pieces is the holey dollar, which was made from the Spanish. These coins were our first official currency and they really were a symbol that we wanted to grow as a nation. We didn't have a mint in this country at the time, so we of course employed a convict who had served his time in Australia for forgery and he actually was the one who struck our first coins. So there's lots of little stories that these coins can tell us about who we are and where we've come from and how we grow and change as a nation.\"\n\nThat includes stories about all segments of Australian society.\n\nWhich Mr Baines says the Mint has been committed to telling through special release coins in the decades since decimal currency was introduced.\n\n\"We do have a lot of different coins that celebrate all aspects of our life. We create coins around Paralympics and that celebrate different migrating groups to Australia and different cultures within Australia.\"\n\nWhile there’s been a sharp decline in the use of cash and coins over the years, Emily Martin says commemorative and collectible series are popular as ever.\n\nAnd says the future of coins remains bright.\n\n\"There has been a decline in the use of circulating coins but we have seen that desire for our collectible coins really grow and the average new generations of collectors so it is a way that people like to recognise special events and tell our history through our coins. We will continue to make coins as long as there is demand.\"",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/josie-baff-australian-gold-medal-winter-olympics/zn3rfx836",
    "title": "Tears of joy as snowboarder Josie Baff scores Australia's second Winter Olympics gold",
    "publish_date": "Fri, 13 Feb 2026 20:49:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Josie Baff has been left wiping away tears of joy after doubling Australia's gold medal haul by storming to victory in the women's snowboard cross event at Milano Cortina Winter Olympics.\n\nThe 23-year-old cried and jumped in delight on the podium after becoming the first Australian woman to medal in the event, with her triumph coming less than 24 hours after the shock win by Cooper Woods in the moguls.\n\nIt's the first time since 2010 in Vancouver that Australia have celebrated two golds in a Winter Games.\n\nBaff said she was inspired by Woods' triumph, with the pair having been former classmates in Jindabyne over the winter term and also crossing paths in junior surf lifesaving.\n\nBaff's boyfriend, Canadian Eliot Grondin, had also won silver in the men's snowboard cross a day earlier.\n\n\"I actually grew up doing surf lifesaving and Cooper was doing that as well so I saw him a lot down in Pambula and I know him and his family super well,\" Baff said.\n\n\"Seeing that yesterday definitely sparked a little fire in me and I thought if he can do it I can do it too.\"\n\n'I put in a lot of hard work'\n\nBaff was daring in both her semi-final and the four-racer medal race at Livigno Snow Park, as she slipped through on the inside with immaculate overtaking manoeuvres to win both races.\n\nBaff, the world championship runner-up in 2023, also revealed she had suffered from the flu earlier in the week.\n\nShe pipped both the racer who beat her for gold three years ago, Czech star Eva Adamczykova, and reigning world champ and 2018 Olympic gold medallist, Italian Michela Moioli, in a thrilling final.\n\nBaff was overcome with emotion after her victory. Source: AAP / Sergio Bisi/IPA Sport\n\nBaff said she felt she earned the win through her hard work since her Beijing disappointment, when she was left in tears after her campaign ended in the opening race.\n\n\"It's very amazing — I would like to say that I can't believe it but I kind of can,\" she said.\n\n\"I feel like I deserve it and I put in a lot of hard work so I knew I could do it but to actually have the medal around my neck is very, very cool.\n\n\"It's definitely something that I've been working towards for a very long time and my team has been helping me achieve that every step of the way.\"\n\nAustralia's second snowboard cross medal — ever\n\nIt was Australia's second ever snowboard cross medal. Jarryd Hughes took silver in the men's race in Pyeongchang in 2018, while Torah Bright is the only other woman to medal in snowboarding, winning two in the halfpipe.\n\nBaff's father Peter coached both Bright and his daughter as a junior.\n\nBaff had arrived in strong form, sitting in the world No. 2 ranking, but she had a slow start to the day and finished only 17th in the seedings.\n\nThat meant she raced against new mum Adamczykova, the top seed, all the way through.\n\nBaff was the second Australian ever to win a medal in the snowboard cross. Source: AAP / Zabulon Laurent/ABACA/PA\n\n\"I was definitely disappointed as I knew I was super fast on this track and it was annoying because I wanted to win the time trial but to win the gold medal is even better so I'm super happy,\" said Baff.\n\n\"When I saw I had Eva in a first round it's definitely a tough first heat ... but I knew that it could also wake me up and work in my favour.\n\n\"It meant that we were racing from the first round and we were able to lock into that mindset really early on.\n\nBaff showed her class to win her first race and move through to the quarter-finals, where she finished second in a four-race field in a heart-stopping photo finish.\n\nShe charged through her semi-final, making a move midway through the final with a superb overtake to nab the gold by 0.04 seconds.\n\nAussie star misses out on gold\n\nHours later, Australian snowboard great Scotty James fell short in his quest to complete his Olympic medal collection.\n\nCompeting at his fifth Olympics, James became Australia's most decorated winter athlete with three medals, winning another silver after Beijing as well as the bronze he won eight years ago in Pyeongchang.\n\nHe was also part of the country's most successful single day, his second place coming shortly after Baff's gold.\n\nBut it was mostly disappointment with James shedding tears and being comforted by Australia's canoe great Jessica Fox when she presented his medal.\n\nLeading into the Olympics he had openly declared gold was his \"north star\".\n\n\"It's a bit numb, like I don't really know how to feel,\" the 31-year-old said.\n\n\"The next 24 hours I'll probably have a bit of a cry, but I'll be happy as well because representing the country and winning a medal is unbelievable, and I'm really proud of that.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-lunar-new-year-diy-dumpling-event-putting-a-new-spin-on-a-centuries-old-tradition/9v84r6nfv",
    "title": "The Lunar New Year DIY dumpling event putting a new spin on a centuries-old tradition",
    "publish_date": "Fri, 13 Feb 2026 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT:\n\nDumpling-making is in full swing at a restaurant near Melbourne’s Chinatown.\n\nThe special Lunar New Year event has drawn 30 foodies from a range of backgrounds, including Gavin Rajahmoney.\n\n\"My family is originally from Sri Lanka and we've migrated to Australia. I'm born here in Australia. I've never made dumplings before. So, I currently study Chinese at school and my Chinese teacher actually invited me to this event. So, when I heard, I was really excited and I decided to join.\"\n\nHand-rolling dumplings is an age-old skill in Asia, dating back thousands of years to the Han dynasty in China.\n\nThe pockets of pastry symbolising wealth traditionally made with savoury meat or vegetable fillings.\n\nCustomer Paul Hordijenko explains.\n\n\"Normally we start off with the dumpling skin. Then we roll it out and then get some of the filling like this in here. And then make sure that it is squeezed nice and tight, like a seal.\"\n\nHowever, Hoppy Dumpling restaurant owner Gary Zhao, who grew up in China’s Guangdong Province, says the workshop goes way beyond traditional fillings.\n\n\"We have five options. The first one is the cheese, chicken corn and the second one is the celery pork. Third one is the Korean style kimchi spicy pork. And the fourth one is the French style chicken liver. And the last one is the curried beef, curry Wagyu beef.\"\n\nWhile new flavours are well received many still prefer traditional styles – with pork and celery crowned most popular.\n\nGARY: \"I'm a really big pork fan, so that's definitely my favourite flavour.\"\n\nHENRY: \"The pork dumpling, it’s been one of my favourites for a long time.\"\n\nThe choice of filling may be personal taste, there’s one thing everyone agrees on, says customer Paul Hordijenko.\n\n\"The one that you buy in a supermarket, it's just quick and convenient, pretty standard taste. But I think the ones that you make by hand, they taste a lot fresher.\"\n\nMr Zhao says this was the first make-your-own dumpling event but definitely won’t be the last.\n\n\"This shocked me, that many people from different culture, they all came and they all interesting about this. Many customers, they learn very fast and then really enjoy making these dumplings.\"\n\nRolling these tasty parcels is also a chance to learn about the history of Lunar New Year celebrations, says Paul Hordijenko.\n\n\"I actually heard it for the first time today that they'll put normally a coin inside the filling for good luck for Chinese New Year, for prosperity.\"\n\nAnd it seems to be working.\n\nOwner Gary Zhao says sales have soared since his first DIY dumpling event.\n\n\"The dumpling making event is good for the business. Before, we sold 1,000 dumplings a day. After this event, it reaches around 2,500 a day.\"\n\nFor many customers, sharing the dumplings is also a way to bring the family closer.\n\nLINISHA: \"This activity is really nice for family bonding when you're all making together traditional dumplings.\"\n\nPAUL: \"We're all busy with work and it's activity that you can do together and enjoy time as a family. So I think it's great.\"\n\nOwner Gary Zhao can only agree.\n\n\"Eating and making dumplings in China always meaning family and friends gathering together.\"",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/butler-opens-scoring-for-maori-20260215-p5o2ft.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Butler opens scoring for Maori",
    "publish_date": "Sun, 15 Feb 2026 13:54:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Butler opens scoring for Maori\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/a-board-game-classic-at-the-comedy-theatre-with-a-serving-of-slapstick-20260211-p5o1d0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This bold production is a bare-chested, knife-wielding, testosterone-drenched deconstruction of a classic",
    "publish_date": "Sun, 15 Feb 2026 13:54:41 +1100",
    "category": "entertainment",
    "authors": [
      "Cameron Woodhead",
      "Marcus Teague"
    ],
    "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews This bold production is a bare-chested, knife-wielding, testosterone-drenched deconstruction of a classic Cameron Woodhead and Marcus Teague Updated February 15, 2026 — 1:54pm ,first published February 11, 2026 — 1:35pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points THEATRE: Cyrano de Bergerac at fortyfivedownstairs offers a bold reimagining\n\nMUSIC: Remarkably, Geese live up to the hype at their Thornbury gig\n\nTHEATRE: Cluedo at the Comedy Theatre is a zany mystery with a dose of nostalgia\n\nTHEATRE\n\nCyrano de Bergerac ★★★★\n\nfortyfivedownstairs, until February 28 Edmond Rostand’s French tragicomedy Cyrano de Bergerac always seems ripe for reinvention. From Fred Schepisi’s 1987 romcom, Roxanne (starring Steve Martin and Daryl Hannah), to Virginia Gay’s cross-gendered queer Cyrano at the MTC in 2022, the story has a performance history as long as its hero’s nose. Mark Yeates (Cyrano) and Callum O’Malley (Christian) in a scene from Cyrano De Bergerac at fortyfivedownstairs. Matthew Chen This free adaptation from playwright Martin Crimp was staged on the West End and Broadway a few years back, with James McAvoy in the title role, and now comes to Melbourne in a bold indie production with a cast much larger than any of our main stages could afford to muster. Those who felt that Gay’s version for the MTC shortchanged Rostand’s poetry may take heart at the obsessive centrality it assumes in Crimp’s – the retention of rhyming couplets; the vision of Cyrano as spoken-word maestro, bounding across the stage versifying, mic in hand; even a poem composed (after Emily Dickinson’s Because I could not stop for Death) on the field of battle.\n\nAdvertisement\n\nThose who enjoyed the playfulness of a woman as Cyrano, on the other hand, and the undemanding romcom vibe Gay brought to the stage will be struck by the contrast here. The production has playful moments, but they’re locked within an epic dismantling of traditional masculine ideals. Mark Yeates leads a bare-chested, knife-wielding, testosterone-drenched deconstruction that hacks away at the very notion of the heroic and leaves an aftertaste more bitter than bittersweet.\n\nReviewed by Cameron Woodhead MUSIC\n\nGeese ★★★★★\n\nThe Croxton, February 12 An hour and a half before buzzy New York four-piece Geese are due on stage, there’s two lines of people on the footpath outside: one waiting to get in, the other sheepishly holding up signs for tickets: “Friend didn’t show up? I’ll buy your ticket,” reads one. Another: “This Goose has no tix”. Frontman Cameron Winter performs with Geese at The Croxton on Thursday, February 12. Martin Philbey Gooses they were. Ever since 23-year-old frontman Cameron Winter’s wonky, astonishing solo LP Heavy Metal grew from late-2024 curiosity into revered modern classic, the cult of Cameron has turbocharged Geese’s trajectory. When Winter’s Tuesday night solo piano show at The Forum went on sale in August 2025, it sold out instantly. In September, Geese released their third LP, the knotty Getting Killed, to rapturous reception. It means here now, on their debut Australian tour for Laneway Festival, both Winter and Geese could have played at venues three times the size, many times over. For one night only in High Street in Thornbury, it feels like being at the molten centre of the music universe.\n\nAdvertisement\n\nShockingly, Geese live up to the hype. Augmented by keyboard player Sam Revaz, Geese demonstrate they’re far more than their famous frontman’s backing band, with a dissonant clinic of sizzling indie rock, laced with prog, blues, punk, folk and anything else ever made with guitars. Somehow, nothing’s ornamental, no one slacks off. From the opening slow burn of Husbands, the rammed crowd yell every word of Winter’s knack for self-flagellation: “I’m falling apart”, “I’ve been hit by the bus of life”, “Baby, you can change and still choose me”. They blast through all of Getting Killed and a couple of songs from 3D Country (2023), including an unhinged 2122, inspiring the first circle pit of the night. Geese are the most exciting new band, and a damn marvel to see. Martin Philbey There’s a wild vibrancy to Geese live that just isn’t present on the airtight audio of their records. New chordal passages emerge as guitarist Emily Green and drummer Max Bassin lead odd, telekinetic choices – where Winter was his own wry agent of chaos at Tuesday’s intimate solo show, tonight he’s the steely, charismatic fulcrum around which Geese expands and contracts. Cobra, Au Pays du Cocaine and Taxes are gorgeous, given a spectral heft in this quasi-religious setting, while 100 Horses and the set-closing barnstormers, Long Island City Here I Come and Trinidad put the crowd on spin cycle.\n\nAdvertisement\n\nThe rumours are true: Geese are the most exciting new band, and a damn marvel to see. You’re a goose if you missed it.\n\nReviewed by Marcus Teague THEATRE\n\nCluedo ★★★\n\nComedy Theatre, until March 15 Every generation from the Boomers down knows Cluedo. Editions of the game have been around since 1949, and kids tend to learn what a murder mystery is by playing it – well before they’re introduced to Agatha Christie. The usual suspects ham it up in Cluedo. Eddie Jim Childhood nostalgia for the franchise undergirds this commercial comedy. It adapts Jonathan Lynn’s 1985 film Clue (a box office flop that developed a cult following) and a talented cast embraces the zaniness of a show that’s feather-light on suspense and plot but slathered with mildly diverting drollery.\n\nAdvertisement\n\nSix usual suspects are invited to an English country house under the assumed names of characters from the game – Professor Plum (David James), Miss Scarlett (Olivia Deeble), Mrs Peacock (Genevieve Lemon), Colonel Mustard (Adam Murphy), Mrs White (Rachael Beck) and Reverend Green (Laurence Boxhall). They’re greeted by the butler Wadsworth (Grant Piro), French maid Yvette (Lib Campbell) and a dour knife-wielding Cook (Octavia Barron-Martin). When their elusive host Mr Boddy (Joshua Monaghan) appears, it’s only for long enough to reveal sinister designs before adding to the body count. What follows is a chaotic hunt for the killer(s) that gets serially interrupted by yet more potential victims, and features a blend of ridiculous sight gags, exaggerated caricature, inane banter and comforting in-jokes, and tightly choreographed physical humour with strong elements of revolving-door farce. Cluedo is cosy, well-turned commercial entertainment. Eddie Jim Each actor confects moments in the spotlight. They all have fun playing with genre stereotype, though it’s Piro’s butler who acts as a kind of MC and gives the most versatile (and ludicrous) performance, with Boxhall’s neurotic, jelly-limbed slapstick not far behind.\n\nAdvertisement\n\nProduction values are high, the set and costume design on par with the style of murder mystery theatre – think The Mousetrap – that Cluedo merrily lampoons. Related Article Melbourne live reviews Tradition and modernity collide in this story of loneliness I’d like to see a push towards more diverse casting in shows of this ilk. The play’s nominal setting in 1940s England hardly calls for historical accuracy or naturalism when it’s based on a game played by everyone, and the familiarity Cluedo trades on might have even broader appeal if it better reflected contemporary Australian audiences. That said, Cluedo isn’t envelope-pushing stuff. Nor is it “a killer night out” as billboards claim. No, it’s undemanding comedy – a cosy, well-turned commercial entertainment that doesn’t outstay its welcome.\n\nReviewed by Cameron Woodhead The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 13
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/maori-stars-lead-powerful-pre-game-ceremony-20260215-p5o2fr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Maori stars lead powerful pre-game ceremony",
    "publish_date": "Sun, 15 Feb 2026 13:50:39 +1100",
    "category": "sports",
    "authors": [],
    "text": "Maori stars lead powerful pre-game ceremony\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/multi-billion-dollar-funding-for-aukus-submarines-20260215-p5o2fs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Multi-billion dollar funding for AUKUS submarines",
    "publish_date": "Sun, 15 Feb 2026 13:50:28 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/queensland/an-explosion-of-jazz-era-decadence-this-gatsby-is-one-wild-party-old-sport-20260206-p5o09i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "An explosion of jazz-era decadence, this Gatsby is one wild party, old sport",
    "publish_date": "Sun, 15 Feb 2026 13:34:28 +1100",
    "category": "entertainment",
    "authors": [
      "Nick Dent"
    ],
    "text": "Advertisement\n\n★★★★ NationalQueenslandEntertainment An explosion of jazz-era decadence, this Gatsby is one wild party, old sport Nick Dent February 15, 2026 — 1:34pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHE GREAT GATSBY ★★★★\n\nPlayhouse, QPAC, until March 8 The Great Gatsby turned 100 last year, and the novel’s vision of an apocalyptic void at the heart of the American Dream seems to be reaching an apotheosis in 2026. In the character of lovelorn bootlegger Gatsby squandering his wealth on debauched Long Island parties, it’s hard not to think of tech billionaires foisting their unhealthy products on a bewildered populace and using the proceeds to fund narcissistic schemes while the planet burns. Shiv Palekar as Jay Gatsby and Jess Vickers as Daisy Buchanan in a new stage adaptation of The Great Gatsby. Queensland Theatre Not that this new stage adaptation, a co-production of Queensland Theatre and local independents Shake & Stir, indulges in any tricksy updating, apart from a few techno dance sequences. It’s rather a faithful, fast-moving rendition that explodes with Jazz Age decadence and is fleshed out with witty dialogue courtesy of co-adaptors Daniel Evans and Nelle Lee.\n\nAdvertisement\n\nThe human drama hits harder here than in Baz Luhrmann’s 2013 version, but the film’s sensory overload is clearly a touchstone. Co-directors Evans and Nick Skubij offer enough sumptuous staging to equal the images that F. Scott Fitzgerald’s masterpiece conjures in the mind’s eye, from orgiastic New York speakeasies to desolate dump the Valley of the Ashes. It’s a showcase for designer Christina Smith, whose sets and costumes conjure the 1920s with hyper-real brilliance. Libby Munro as Jordan Baker and Ryan Hodson as Nick Carraway. Queensland Theatre Of particular note is the use of computer-controlled black screens that facilitate quick scene changes and concentrate the field of vision: at times the action seems to take place within a square silent-film ratio. The endearingly nervy Ryan Hodson (Shake & Stir’s Fourteen) has the arduous task of playing Fitzgerald’s narrator, Nick Carraway, and is barely off stage for over two hours. Carraway is the bonds salesman and would-be writer who moves to Long Island after serving in the war and stumbles into the love triangle between his waifish cousin, Daisy (Jess Vickers), her bigoted and abusive husband, Tom Buchanan (Jeremiah Wray), and the mysterious millionaire Gatsby (Shiv Palekar). Jeremiah Wray (Tom Buchanan) and Gatsby (Shiv Palekar) represent a clash of old and new money. Queensland Theatre\n\nAdvertisement\n\nNick’s PTSD is made palpable by the presence of a shadowy soldier in a doughboy helmet dogging his heels. In the title role, pink-suited Palekar gets a flamboyant entrance befitting his iconic status, but the character’s flimsy aspirations are soon apparent in Palekar’s aptly boyish and tentative performance. (You can read what you like into the casting of an Indian-born actor as the object of the racist villain’s scorn.) As his old-money nemesis Buchanan, the towering Wray is a proto-MAGA bully, but an equally lost soul: having played the creature in Shake & Stir’s Frankenstein, Wray has a way with piteous monsters. Related Article Review Brisbane Festival: These fairy tales are not for kids The production brings two of the female supporting roles to life impressively. As the pansexual lady golfer Jordan Baker, Libby Munro is the very image of a 1920s garconne, and her banter with the smitten Nick, daring him to take a “big swing”, is priceless. Nelle Lee plays Buchanan’s reckless mistress, Myrtle Wilson, and imbues her with Cyndi Lauper vibes. Musical theatre star Loren Hunter, meanwhile, augments Guy Webster’s excellent score with powerful renditions of period songs like I Get Along Without You Very Well (Except Sometimes). Evans’ emerging vision for Queensland Theatre seems to be as a timely interpreter of familiar IP. (His triumphant staging of Aaron Sorkin’s A Few Good Men last year sadly dovetailed with the death of the film version’s director, Rob Reiner.) This makes him a kindred spirit to Brisbane independent success story Shake & Stir, adaptors of everything from Dickens to Dahl, and future collaborations seem like a done deal. Can you repeat the past? Sure you can, old sport. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/world/asia/will-a-new-government-breathe-life-into-thailand-s-gasping-cannabis-industry-20260212-p5o1og.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Will a new government breathe life into Thailand’s gasping cannabis industry?",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "finance",
    "authors": [
      "Zach Hope"
    ],
    "text": "Advertisement\n\nAnalysis WorldAsiaDrugs Will a new government breathe life into Thailand’s gasping cannabis industry? Zach Hope February 15, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhat in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox. Bangkok: If you’ve spent any time on the streets here in the last few years, you would have almost certainly caught the unmistakable waft of marijuana. Maybe you even indulged, and why not? It has been legal, after all. When Thailand removed cannabis from its narcotics list in 2022 – the first Asian country to do so – 18,000 or so marijuana parlours popped up around the country. Cannabis was decriminalised in Thailand in 2022, leading to a boom in dispensaries. Getty The shops were everywhere, like pubs in London. And if you didn’t smell them first, you couldn’t miss their flashing green neon signs in the shape of a marijuana leaf.\n\nAdvertisement\n\nThe idea behind decriminalisation was to boost Thailand’s brand as a wellness destination, give farmers a new cash crop and free up space in overcrowded prisons. Related Article Drug reform ‘As legal as garlic’: High times in Thailand as marijuana is decriminalised Coming out of the COVID-19 pandemic, it seemed just the trick. Tourism makes up roughly 15 per cent of Thailand’s GDP. Tycoon turned pro-business politician Anutin Charnvirakul was the champion behind decriminalisation. If that name sounds familiar, it’s because he has been Thailand’s prime minister since September, essentially in a caretaker role. On Sunday, his Bhumjaithai Party surpassed all expectations to win the most seats in the country’s snap elections, meaning he’s almost certain to stay in the job.\n\nAdvertisement\n\nOn the face of it, this would be a positive for the cannabis industry’s long-term health, no? Well, not necessarily. A blackboard illustrating cannabis strains for sale inside a dispensary in Bangkok. Bloomberg The cannabis trade has been a debacle of the former government’s own making. With few regulations in place, it boomed in 2022, becoming an out-of-control beast that ensnared previous non-users, including minors. Family holidaymakers, meanwhile, were turned off because who wants to be walking the kids through streets thick with the smell of drugs?\n\nAdvertisement\n\nA local backlash followed and, midway through last year, the ruling Pheu Thai party declared that cannabis could be sold only to someone with a doctor’s prescription. The burgeoning industry was decimated overnight. Shops were already struggling because there was too much low-priced cannabis, too many outlets and too few customers. Many closed. Some began looking the other way on prescriptions, spawning a black market that operates not just in plain sight, but under big glowing signs. In 2022, Thailand became the first country in Asia to decriminalise cannabis. Bloomberg Survival has meant new strategies. One shop in the Sukhumvit area, for example, redesigned its frontage to resemble a pharmacy. I ask the server, Ramil, 26, if Bhumjaithai romping home in the election (though the party still needs to cobble together a coalition) is good news for the industry.\n\nAdvertisement\n\n“Maybe?” he says, with an inflection of enthusiasm. “We’ll just have to see.” It has been a tough game for a long time now, he says. Cannabis flooded the market in 2022, cutting profit margins. “And then maybe it stabilised. But then with the prescriptions, that hurt.” Ramil, 26, behind the counter of a Bangkok marijuana parlour, which now looks more like a pharmacy. Zach Hope The most novel approach I’ve seen is at a shop called Cloud Nine, also in Sukhumvit. On the footpath outside, an A-frame sign declares “free prescription with every purchase”.\n\nAdvertisement\n\nWe asked the friendly, English-speaking server what it’s all about. (English speakers are vital because the customers are mostly foreigners, with Australians high on that list.) It’s all very simple, she says, asking not to be named or photographed. The cannabis trade has been a debacle of the former government’s own making. Bloomberg “If you purchase the flower, you’ll be consulting with a doctor. The doctor will diagnose you, asking ‘what do you need it for and how much do you need?’.” Then, hey presto, a prescription!\n\nAdvertisement\n\nThere’s no in-house doctor, she says. It’s a telehealth hook-up to a nearby clinic. Does the doctor ever say no? “Not really,” she says. There’s no need to book in advance and the whole process takes just a few minutes. “We won’t sell without [a] prescription. That’s the golden rule here,” she says. “Talking to my customers, a lot of them say, ‘Oh, why do we have to do it here? Other shops, they don’t do it’. But we’re doing it the right way.”\n\nAdvertisement\n\nShe says she has no idea whether Bhumjaithai will do away with the prescription law introduced by the previous government. It seems unlikely. Though we could not get a response from Bhumjaithai amid its post-election bargaining with other parties, Anutin has previously argued that the loosening of the laws was always focused on medicinal marijuana, rather than recreational, use. Anutin Charnvirakul speaks to media at Bhumjaithai Headquarters as results come in favouring Bhumjaithai on election night on Sunday. Getty Images No party wants to touch the law now. Surveys show the overwhelming majority of Thais don’t want recreational cannabis use legalised in their country. Meanwhile, even tourism bodies, concerned at losing high-value family holidaymakers, support reclassification. Visitor numbers in Thailand remain below pre-COVID levels.\n\nAdvertisement\n\nThousands of Thais invested their savings to open cannabis businesses that have already closed their doors. Others cling on precariously. The Thai government’s experiment with marijuana has not only been sloppy. For some people, it has been a disaster. Get a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/attacking-for-the-podium-why-bree-walker-can-win-another-gold-for-australia-20260213-p5o27r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Attacking for the podium’: why Bree Walker can win another gold for Australia",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Milan: Australia’s Winter Olympics has been marked by unexpected bounties, the golds taken by upstarts Cooper Woods and Josie Baff, who entered the Games without the weight of public adulation and the pressure that accompanies favourites.\n\nJakara Anthony, conversely, was the top weight in the freestyle moguls field and faltered on her last downhill run.\n\nAustralia’s gold medal chance in the monobob, Bree Walker. Credit: Getty Images\n\nAnthony’s stunning redemption in the dual moguls sets up the serious possibility of a fourth gold if Bree Walker fulfils her ambition in the monobob.\n\nWalker has been viewed as one of Australia’s best hopes for months, if not longer, having finished fifth in Beijing 2022 and improved markedly since under the tutelage of her coach, former Olympic champion Pierre Lueders, a bobsleigh whisperer she hired for the very purpose of getting on to the podium here.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/nsw/makes-our-city-less-liveable-residents-win-fight-against-24-7-barangaroo-venue-20260214-p5o2ap.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Makes our city less liveable’: Residents win fight against 24/7 Barangaroo venue",
    "publish_date": "Sun, 15 Feb 2026 13:30:00 +1100",
    "category": "finance",
    "authors": [
      "David Barwell"
    ],
    "text": "Advertisement\n\nNationalNSWCity life ‘Makes our city less liveable’: Residents win fight against 24/7 Barangaroo venue David Barwell February 15, 2026 — 1:30pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA plan to boost Sydney’s 24-hour economy has hit a major obstacle, with the NSW government scaling back plans for around-the-clock trading at a new $100 million inner-city cultural venue after the proposal sparked a wave of community objections over late-night noise. The NSW government has walked back a contentious trading plan for The Cutaway cultural hub in Barangaroo after the site was earmarked for 24/7 operations as part of broader push by Premier Chris Minns to “bring Sydney back to life”. The Cutaway during construction works last year. James Brickwood When completed this year, The Cutaway will include multiple event spaces carved into the headland beneath Barangaroo Reserve, with room to host large art installations, performances, festivals, concerts, gala dinners, fashion shows and events including Vivid Sydney. But less than a year after the 24/7 operating hours were proposed, those plans have been scaled back, with most events to be capped at midnight, with limited exceptions for major occasions such as New Year’s Eve.\n\nAdvertisement\n\nOriginally, Placemaking NSW, the government agency overseeing the development, argued that 24-hour operations would advance the state’s vision to boost nightlife, tourism and Sydney’s global standing. The venue’s location next to Barangaroo Metro station was cited as a major advantage, allowing for extended trading supported by improved public transport access. A concept image of what the new venue will look like when completed. The proposal quickly drew objections from residents of high-rise towers and community groups in Barangaroo and Millers Point. Concern centred on the cumulative impacts of late-night events, particularly noise, crowd control and disruption to residential amenity. Anne Crabb, president of the Millers Point Community Resident Action Group, said the scale and design of the venue heightened those fears.\n\nAdvertisement\n\n“Unlike current 24/7 venues such as The Crown casino and The Star, this is a huge and open cavernous space located on the harbourfront,” she said. “Barangaroo can and should be a vibrant cultural precinct, but this must not come at the expense of our long-standing residential community who will have to deal with the late-night impacts.” The venue will have a capacity for almost 3000 patrons. James Brickwood Resident Rosalind Lehane said uninterrupted sleep would be jeopardised under a 24-hour trading model. “The proposed changes to The Cutaway of 24-hour noise and vibration are incompatible with this aim,” she said.\n\nAdvertisement\n\nRelated Article Exclusive\n\nCity life First look inside ‘tree’ sculptures to heal Barangaroo’s scar Strata representatives from neighbouring towers also raised concerns about the venue’s acoustic design. Strata managing agent Kate Maclachlan warned that the semi-enclosed structure could amplify sound and create “reverberation” impacts. In a submission to the NSW government, Robert Spears claimed noise levels could be comparable to a “Formula One grand prix race”. “If you wanted to devise a scheme to make our city less liveable than it already is, then you would come up with this new Cutaway proposal,” he wrote. In response to what planning documents described as “strong concerns”, Placemaking NSW has scaled back the operating hours to 8am to midnight. Some noise controls will be applied from 10pm.\n\nAdvertisement\n\nEvent patrons will be directed toward Barangaroo and Wynyard Walk, rather than through residential streets in Millers Point, and integrated ticketing will be encouraged to promote use of the metro. Business Sydney executive director Paul Nicolau described the decision to wind back the 24-hour operations as “disappointing”, arguing the city needed more late-night venues to counter the lingering effects of the pandemic and increased working from home. The 24/7 trading plan had sparked opposition from residents in the high-rise waterfront precinct. Sam Mooy “If you choose to live in Barangaroo – in the heart of a global city – a level of noise should be expected,” he said. “We desperately need to ensure there are enough venues and facilities that are open 24/7.\n\nAdvertisement\n\n“The venue could have hosted overnight concerts, creative events or live broadcasts of international sporting competitions. At the very least we should have given it a trial.” He said expanding public transport to 24-hour operations could have also supported the safe dispersal of late-night crowds. NSW 24-Hour Economy Commissioner Michael Rodrigues had supported the original operating hours, saying extended trading would facilitate a diverse range of events and encourage tourism. In revised plans, Placemaking NSW said the midnight finishing times would provide “a more clearly defined and constrained operating regime that balances the role of The Cutaway as a thriving, unique and industry-leading cultural venue with the need to protect the amenity of surrounding residential areas.” Business Sydney executive director Paul Nicolaou said the revised plans were disappointing. Brook Mitchell\n\nAdvertisement\n\nA spokeswoman said operations would begin with a three-month trial and that trading hours “may be further relaxed to support what Sydneysiders and visitors are seeking”. The changes remain subject to final approval from the NSW Department of Planning. The NSW government is taking steps to enhance the nighttime economy through reforms that have included simplified noise regulations, support for outdoor events and improvements to liquor licensing. Construction of The Cutaway is more than 85 per cent complete and the first events are expected to start by July. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/butters-won-t-be-rushed-on-future-after-fiery-origin-debut-weitering-cleared-according-to-dangerfield-20260215-p5o2eq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Butters ‘won’t be rushed’ on future after fiery Origin debut; Weitering cleared, according to Dangerfield",
    "publish_date": "Sun, 15 Feb 2026 13:02:55 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "“I’m looking forward to playing some footy this year, and obviously it started today (with Victoria), but looking forward to getting back to club land and playing with my teammates and hopefully getting a few wins.” Danger delivers Weitering news Patrick Dangerfield has good news for Carlton fans. The Cats superstar says Jacob Weitering has been cleared of any damage after he was taken to hospital following a heavy collision in Saturday night’s clash.\n\n“It’s good to see the big fella has been cleared,” Dangerfield said. Loading “That’s a part of footy, unfortunately, it is the combative nature that we love. But it’s great to see he’s been cleared of any damage.” Weitering was taken from the ground on a stretcher after Western Australian opponent Mitch Georgiades and teammate Sam Collins landed heavily on top of him during a marking contest.\n\nHe had scans on his chest and shoulder regions, but was cleared to fly back to Melbourne with the Victorian team on Sunday morning. “He was engaged with the WhatsApp group (last night), that’s for sure,” Dangerfield said. “That lit up last night.” Dangerfield said the way Western Australians embraced the State Of Origin return meant the concept “might be around for a while”, despite the prospect of injuries. “We’re going to see injuries next week, unfortunately, as well, especially in the early parts of match simulation and practice when you are really getting used to full-on contact,” he said.\n\n“You train it at this time of year, but you don’t fully engage with high-speed collisions. So it is one of those things that it is a difficult game to predict, and it’ll continue to be that way, I think, as long as we play it.” Toby and Zak make a pact Greater Western Sydney antagonist Toby Greene and Butters made a pre-game pact to set an aggressive tone during Saturday night’s clash against Western Australia at Perth Stadium in Perth. Which should come as a surprise to no one.\n\nThe feisty Butters found himself in a scrap with WA defender Tom Barrass when the home team were making a late charge to win back the lead. “I think he got Toby a bit late, and I was just backing him up,” Butters explained. “I think it’s in the Origin spirit. The game was pretty close at that point, so I really wanted to get the win. Zak Butters and Tom Barrass get up close and personal. Credit: Getty Images “We spoke about it a little bit pre-game. We’re both starting half-forward, so we said, we would try and set the tone in that area. I’ve looked up to him (Greene) for a while now, obviously growing up as a kid. I really admire the way he plays, so it’s good to do it with him.” Butters agreed that he and Greene liked to play on the edge.\n\n“I think I naturally do,” he said. “It comes down a little bit to it sometimes, but I feel like we’ve all created some good relations over the weekend. It helps me get involved in the game a little bit as well.” No wonder Port are so desperate to keep their heart-and-soul vice-captain. Max makes room for more trophies Decorated ruckman Max Gawn has formed a love affair with Perth Stadium. He lifted the premiership cup at the ground as Melbourne captain in 2021, during the COVID-19 years, and can now add a victorious Victorian debut at the venue to his glowing resume.\n\nMax Gawn (right) and his former Melbourne teammate Luke Jackson, now with Fremantle, after the game. Credit: AFL Photos via Getty Images After the game, the 34-year-old veteran made mention of two Melbourne greats connected to both historic wins – Victorian selector and chief motivator Garry Lyon, and the inspiration of Neale Daniher in the lead-up to the club’s drought-breaking premiership. “I’ve won silverware twice in this room,” he said. “I do like the Freo Dockers’ room. “I mean, any sort of emotional tie you can make in football, I think it is something that you can play on, you can use as a motivational tool. “And, yeah, we’ve used Neil Daniher at times. We’ve used lots of different things at times. And today, we used that Origin history.\n\nGawn said Lyon embraced the “Mr Origin” role. “He’s been good, Garry,” he said. “His job was to really fire us up. I mean, Chris Scott, what I’ve seen from Chris Scott, and the thing I’ve taken the most out of this, is seeing what people that you have a view on are actually like. Victorian coach Chris Scott with his Geelong/Victorian players, Patrick Dangerfield, Max Holmes, Tom Stewart and Bailey Smith. Credit: AFL Photos via Getty Images “And Chris Scott’s one of them, for mine. I think the balance of Chris Scott and Gary Lyon was unbelievable. Chris Scott was so method-based, and leaving the game up to some of the star players we had. And then Garry was like, nah boys, we got to put a hip and shoulder right into these [guys] in the first contest.\n\nWe asked Gawn about his preconceived view of Scott. Loading “I always thought he was cool, calm and collected. Sometimes I thought he was better than the game, but when you think about it, he’s actually just putting so much to his players. “He’s given his players a lot of flexibility in the way they want to play. And I really gelled with it, to be honest.” Gawn was mic’d up for the game and was looking forward to hearing his interaction with a star-studded midfield that included Marcus Bontempelli, Nick Daicos and Butters.\n\n“The young players kept coming up and saying, ’it’s a pleasure to play with you and Danger and Gunston and some of these guys, Bont, who have been around for a long time. But the pleasure is all ours,” Gawn said. “The fact that we can play with some of these Gen Z boys that are turning football into a new game … I mean, I didn’t have the normal input I normally have in games because the game was chaotic, the game was weird, the game was Origin, which was fun.” Suns pair reunited Gold Coast recruit Christian Petracca has well and truly embedded himself within the Suns playing group, according new teammate Sam Collins.\n\n“I actually went school with Trac,” Collins said after his State Of Origin debut for Victoria. “So, I knew the character that was coming across, and he’s been sensational for all the boys. “More, to say, his energy and connection that he brings to the group. You know, he’s opened his house up a number of times. “He’s always looking to do things and bring the energy … so he’s been sensational.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/technology/video-games/these-are-the-games-nintendo-hopes-will-help-make-switch-2-its-biggest-ever-hit-20260210-p5o123.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These are the games Nintendo hopes will help make Switch 2 its biggest ever hit",
    "publish_date": "Sun, 15 Feb 2026 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Advertisement\n\nAnalysis TechnologyVideo games These are the games Nintendo hopes will help make Switch 2 its biggest ever hit Tim Biggs February 15, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Switch is officially Nintendo’s best-selling game machine of all time, second only to Sony’s landmark PlayStation 2 for overall sales. And the follow-up Switch 2 is off to a good start, moving more than 17 million units in its first half-year to become the fastest-selling game system ever. But with global component shortages, rising prices and slow adoption of the Switch 2 from some major game-makers, Nintendo faces serious challenges in keeping the momentum up throughout 2026. Major big-budget releases like Resident Evil Requiem can run on Switch 2, but not all publishers are supporting the system yet. Announcing the latest sales figures recently, president Shuntaro Furukawa said the rising price of memory — driven by the AI boom — wouldn’timmediately affect the Switch 2 price, which is currently $700, but an increase may happen eventually. “We do not expect major impact during the fourth quarter of this year. However, from the next fiscal year onward, if this price hike lasts longer than anticipated, it could potentially put pressure on our profitability,” he said, according to Bloomberg.\n\nAdvertisement\n\nSo, what does the company have planned for 2026 to keep demand high enough to counter the headwinds? Mario Tennis Fever is Nintendo’s first big Switch 2 exclusive of the year. Nintendo’s own offerings With 155 million Switch consoles sold, Nintendo and other game publishers are keen to continue selling games on the eight-year-old device. Indie games and less graphically intensive games in particular continue to release for the original Switch, and also work on Switch 2. But slowly and surely, players will be encouraged to upgrade to the more expensive and much more powerful new machine. Nintendo’s approach with its own software is to introduce some games that are exclusively for Switch 2, and some that work on either console but are significantly better on the beefier hardware, while also issuing free and paid updates that bring new Switch 2 features to older games.\n\nAdvertisement\n\nAnimal Crossing: New Horizons, which was a huge driver of sales for Nintendo during the COVID lockdowns, received an update recently that bumps the game’s graphics up to 4K, makes use of the Switch 2’s mouse-style controls and microphone, and expands the multiplayer features. Next month, a Switch 2 update for Super Mario Bros. Wonder will add extra characters, modes, levels and minigames. The advantage here is that the upgrade to Switch 2 gets more appealing the more original Switch games a person has, especially in the case of games like Super Mario Odyssey where the improvements are free. But it also means some games getting more expensive; if you don’t already have Mario Bros. Wonder and want to buy it with the Switch 2 content included, it will cost $110. So far Nintendo has published five games exclusively for Switch 2 (pictured). But it has updated an equal number of original Switch games with exclusive new features, and launched Pokemon Legends Z-A and Metroid Prime 4 on both systems. At a recent event at Nintendo’s Melbourne headquarters I was able to play early versions of some new and upcoming games. Mario Tennis Fever is exclusive to Switch 2, and it turns tennis into a party game akin to Mario Kart or Super Smash Bros, with powerful racquet effects and weird optional rules on certain courts giving players heaps to keep track of. On the other hand, Pokémon Pokopia is clearly aiming for the broadest possible audience and is coming to both Switch and Switch 2. Co-developed by The Pokémon Company, Game Freak and Koei Tecmo, it blends the collecting of Pokémon and the social nature of Animal Crossing with the building recipes of Minecraft, but with the addition of some story elements to follow. Players take the role of a shape-shifting Ditto which has chosen the form of a human, and work to make a barren world habitable for a range of friendly creatures. It’s surprisingly engrossing, and could turn out to be one of the year’s sleeper hits.\n\nAdvertisement\n\nLater in the year Nintendo is planning to release all-ages platformer Yoshi and the Mysterious Book, anime tactics RPG Fire Emblem: Fortune’s Weave, and multiplayer action adventure The Duskbloods, from the developer of Dark Souls and Elden Ring From Software. The three are exclusive to Switch 2. The company often also announces new games before mid-year. The wider ecosystem As development of big-budget games has moved to more capable hardware, including the PlayStation 5 and Xbox Series X, fewer have been released on the low-powered original Switch. The extra grunt of the Switch 2 could potentially correct that, but many major studios are yet to announce their blockbuster games for the portable system. Some analysts point to reports that Nintendo was unable to furnish many studios with Switch 2 hardware ahead of its launch. Major third-party games planned for, or recently released on, Switch 2 Square Enix’s Final Fantasy VII Remake, with sequel Rebirth coming in June.\n\nUbisoft’s Assassin’s Creed: Shadows and Star Wars Outlaws.\n\nMicrosoft’s South of Midnight, Indiana Jones and the Great Circle, Fallout 4 Anniversary Edition and Oblivion Remastered, all due this year.\n\nAnticipated James Bond game 007 First Light, Sega’s Yakuza Kiwami 3, and Capcom’s Resident Evil Requiem will all launch on Switch 2 at the same time as other platforms in the coming months.\n\nResident Evil 7 and Village are arriving along with Requiem.\n\nEA and 2K’s licensed sports games are supported on the system.\n\nCyberpunk 2077 and Street Fighter 6 were included at the system’s launch.\n\nElden Ring is due to arrive this year.\n\nAdvertisement\n\nAt the event I was able to preview a pair of upcoming Capcom games; Resident Evil Requiem and Pragmata. These are games that would never have been able to run on the original Switch, but on Switch 2 they feel great and are visually impressive. If you had this version of Resident Evil side-by-side with a PlayStation 5 Pro running it at 4K and 60 frames per second with ray tracing, you’d immediately spot that the Switch 2 isn’t hitting the same resolution, performance or settings. But then a Switch 2 is almost half the price, and has the advantage of portable play. Both games looked awesome on the small handheld screen. So the issue currently isn’t that the console is underpowered, but keen gamers still can’t be assured the titles they’re excited for on PC and consoles will come to Switch 2, purely because it would be an extra lift for studios that plan their releases years in advance. It’s a catch-22, but more players may have to invest in Switch 2 before the studios consider it worth their while. The Virtual Boy is making a comeback on Switch and Switch 2. Meanwhile, Nintendo continues to expand its brand in all directions, outside new release games. A second Super Mario movie hits cinemas this year, with a live action Legend of Zelda currently filming. The Pikmin Bloom smartphone app, a take on Pokémon GO which encourages users to explore by walking, is going strong after five years. And the company runs a subscription on Switch and Switch 2 that gives families access to classic games originally published in the ’80s, ’90s and 2000s. The latest console added to this collection, the Virtual Boy, is notable because it was originally a financial disaster. The heavy and headache-inducing 1995 VR headset sold less than a million units, had 22 games published for it and was pulled from shelves within a year, with Nintendo all but refusing to acknowledge it until recently. Next week, subscribers will be able to play games from the worst-selling Nintendo system ever on the best-selling, with Virtual Boy on Switch and Switch 2.\n\nAdvertisement\n\nEditor's pick Exclusive\n\nVideo games 135 years of secrets: Nintendo is more than a video game company In my brief testing of the system, which requires a sold-separately viewer you slide your console into (Nintendo is selling both a $140 replica of the original headset and a $30 cardboard version), I was surprised to find the games still feel novel and interesting. They’re monochrome, but the 3D visuals work. Smart filters and display options make them comfortable to look at, and it’s all a reminder of what’s changed and what’s stayed the same in the past 30 years. If half a per cent of the Switch and Switch 2 audience get a new Virtual Boy, it will have reached more players than the original did back in the day. Get news and reviews on technology, gadgets and gaming in our Technology newsletter every Friday. Sign up here.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/federal/taylor-hume-vow-to-lowe-r-taxes-flag-budget-cuts-20260215-p5o2ef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Taylor, Hume vow to lower taxes, flag budget cuts",
    "publish_date": "Sun, 15 Feb 2026 12:53:01 +1100",
    "category": "finance",
    "authors": [
      "Brittany Busch"
    ],
    "text": "Advertisement\n\nPoliticsFederalPolitical leadership Taylor, Hume vow to lower taxes, flag budget cuts Brittany Busch Updated February 15, 2026 — 12:53pm ,first published 12:49pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Coalition’s new leadership will seek to win back a reputation of party of lower taxes and better economic managers after former leader Peter Dutton nixed their tax cut proposals before the last election. Opposition Leader Angus Taylor and deputy Jane Hume said on Sunday they wanted to return their party to its roots and reprioritise boosting productivity, leaving the door open to budget cuts. Taylor said he wanted the Coalition to be the party of lower taxes. Alex Ellinghausen The pair held the shadow treasury and finance portfolios at the last election, when the Coalition under Peter Dutton opposed Labor’s marginal tax cut and suggested the money be spent on defence instead. Taylor immediately conceded after ousting former leader Sussan Ley on Friday that policy had been a mistake and began pitching a directional change. “All Liberals know instinctively that the Liberal Party should always be, and must always be, a party of lower taxes because we know that when taxes are lower, Australians get a chance to get ahead,” Jane Hume told ABC’s Insiders on Sunday. “We know when taxes are lower, the economy grows without creating inflation.”\n\nAdvertisement\n\nTaylor identified the lack of tax cuts as a bad call in his first press conference as leader on Friday, and on Sunday said the best place to find money was through a non-inflationary, fast-growing economy. Asked about Dutton’s decision to oppose Labor’s tax cut, Taylor said: “I proposed a way forward with lower personal income taxes, and that is already something I’ve put on the record.” “We need to convince Australians that we will be the party of lower taxes, and we will take a strong, strong policy package to the next election,” Taylor said, speaking separately on Sky News. “Under Labor, we are seeing rising personal income taxes. I mean, they carry on about how they’re bringing down personal income taxes. Well, fine, we made a mistake in the election campaign. But let me tell you, when inflation rages – and it goes up as it is under this hopeless treasurer – people pay more taxes as a proportion of their income,” he said. Taylor said he had always advocated for lower taxes. Niki Savva, a columnist for this masthead, has reported Taylor and Hume had wanted to offer their own tax cut as a contrast to the surprise $5 a week tax cut Albanese revealed in the March budget last year. Dutton, according to Savva, was not interested in Taylor’s plan to offer a tax-back guarantee for those forced into a higher tax bracket by inflation.\n\nAdvertisement\n\nTaylor also denied he had worked to undermine Ley when he was on her frontbench. “I sought to be a supporter of her leadership every single day,” Taylor told Sky News. “We got to a point… where the view of the party room (was that) there needs to be a reset.” While Taylor and Hume were on Sunday reluctant to detail policy so soon after taking control of the party, Hume said they would oppose any plan to reducing the capital gains tax discount – something neither Treasurer Jim Chalmers and Prime Minister Anthony Albanese have denied. This masthead revealed the government was considering a cut in the CGT concession as part of a broader tax reform package aimed at helping younger Australians to buy their own home. Jane Hume said the party was always open to lowering taxes. Dominic Lorrimer\n\nAdvertisement\n\n“That discussion has been had in the party room for some months,” Hume said. “Whether it be changes to negative gearing, whether it be changes to capital gains tax… Liberals know instinctively, when we talk to each other, that we are a party of lower taxes, and that if you tax something, there is less of it.” Related Article Exclusive\n\nLiberal Party ‘We were like lemmings going over a cliff’: Inside Dutton’s $17 billion blunder “If you tax residential housing, there will be less of it. That would be a disaster. No one has yet come out and demonstrated that a wholesale change to capital gains tax on residential housing will create more houses or provide more rental opportunities for rental houses for those that are yet to purchase their first home.” Hume would not commit to any specific tax reforms but conceded “more of the same clearly isn’t good enough”. “I’m not making policy on the run on Sunday morning, 48 hours after I’ve become deputy leader,” she said. “Angus Taylor and I instinctively will always say lower taxes are better than higher taxes, and they’re better for all Australians.”\n\nAdvertisement\n\nHume, who will get to choose her portfolio, foreshadowed an economic role. “I am particularly interested in making sure I have an opportunity to talk about what’s important to me, which is making sure that we have a far more productive economy,” she said. Albanese attacked the new Coalition line-up on Sunday, saying his government would in July deliver the $5 a week tax cut they promised in the last election and one next year “after Angus Taylor led the charge to not only suppose but to say that he would legislate, if he hadn’t been elected treasurer in the election less than a year ago, that he would legislate to actually increase taxes for all 14 million Australians”.\n\n\n\nCut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/nba-dunk-contest-goes-badly-wrong-20260215-p5o2fh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NBA Dunk Contest goes badly wrong",
    "publish_date": "Sun, 15 Feb 2026 12:50:06 +1100",
    "category": "sports",
    "authors": [],
    "text": "NBA Dunk Contest goes badly wrong\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/nsw-to-get-additional-public-holiday-in-2026-2027-20260215-p5o2fc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW to get additional public holiday in 2026, 2027",
    "publish_date": "Sun, 15 Feb 2026 12:44:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 1
  },
  {
    "url": "https://www.theage.com.au/national/man-in-critical-condition-after-e-bike-crash-in-sydney-20260215-p5o2fe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Man in critical condition after e-bike crash in Sydney",
    "publish_date": "Sun, 15 Feb 2026 12:35:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-outranks-sydney-melbourne-as-world-s-most-family-friendly-city-20260215-p5o2ev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane outranks Sydney, Melbourne as world’s most family-friendly city",
    "publish_date": "Sun, 15 Feb 2026 12:27:50 +1100",
    "category": "finance",
    "authors": [
      "Brittney Deguara"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nBrisbane parents can sit at home with a smile on their face, knowing their kids are growing up in the world’s most family-friendly city.\n\nNew data from Compare the Market analysed green spaces per capita and safety to identify the top cities in the world to raise a family. Brisbane, which scored 6.4 out of 10, ranked the highest of 50 cities, with Sydney coming fifth and Melbourne seventh.\n\nBrisbane’s green spaces and parks, such as South Bank, have pushed the city into the top spot on a list of the best places to raise a family. Brittney Deguara/Brisbane Times\n\nFilling out the rest of the top five were London, Auckland and Helsinki.\n\nBrisbane had 84.89 parks and playgrounds per 100,000 people, compared to Sydney’s 7.62, Melbourne’s 2.73, and London’s 30.49.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/we-should-have-kept-level-headed-waratahs-brawler-opens-up-on-infamous-training-fight-20260215-p5o2e4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We should have kept level-headed’: Waratahs brawler opens up on infamous training fight",
    "publish_date": "Sun, 15 Feb 2026 12:09:51 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Waratahs lock Miles Amatosero says there is no bad blood lingering between him and Angus Scott-Young after their pre-season training fight, and while he’s working on finding the right balance, the enforcer won’t dial down the aggression in his game.\n\nAmatosero broke his silence about the summer training fracas with Scott-Young that saw him suspended, and left his teammate with a fractured eye-socket.\n\nThe skirmish unfolded at a Waratahs pre-season training session in early January, and footage later showed Amatosero had thrown five punches at his teammate, in two separate clashes. Following an investigation by RA and the Waratahs, the 23-year-old was suspended for two weeks, in which he missed two trials and was exiled from NSW Rugby headquarters.\n\nAmatosero returned to start for the Waratahs in their 36-12 win over Queensland on Friday night, and speaking after the game, the 125kg lock said he regretted the incident and had made peace with Scott-Young. The pair met up for the first time last week.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/strictly-complied-minister-defends-travel-024834368.html",
    "title": "‘Strictly complied’: Minister defends travel",
    "publish_date": "2026-02-15T02:48:34Z",
    "category": "finance",
    "authors": [],
    "text": "A senior Albanese government minister has defended his use of publicly-funded travel, particularly a work trip to Uluru which his wife tagged along on.\n\nFollowing the furore over Sport Minister Anika Wells flying her family to the AFL and NRL grand finals and a ski resort, the use of federal politicians’ use of family travel expenses came sharply under the microscope at the end of last year.\n\nSenator Farrell, the Trade and Tourism Minister, topped the list of family travel expense claims with $48,178 for the 2024-25 financial year.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThat included a trip to Uluru his wife Nimfa accompanied him on.\n\nOn Sunday, Senator Farrell reiterated that every bill he passed onto the taxpayer followed the rules.\n\n“I’ve complied strictly with every single rule in this area and to the best of my knowledge, nobody has said otherwise,” he told Sky News Sunday Agenda.\n\nNimfa Farrell accompanied her husband of 42 years, Don, on a taxpayer-funded trip to Uluru. Picture: Martin Ollman\n\nSenator Farrell argued his presence at the Uluru function and meetings had been misconstrued, but failed to explain why he needed a family member to join him.\n\n“My wife did accompany me to that event, as she does to so many … events,” he said.\n\n“I then met with 20 tourism operators in Uluru, in the Red Centre, who had been struggling because of some of the events that have occurred in Alice Springs in the lead up to that, and we worked out a program to support them in rebuilding tourism.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“There’s been misrepresentation about what happened on that occasion.\n\n“I’m the Tourism Minister of Australia. Like it or not, that means I have to travel around the country in order to promote Australian tourism.”\n\nDon Farrell says all his expense claims have complied with the rules. Picture: NewsWire / Martin Ollman\n\nThe meetings with 20 tourism operators resulted in an $8.5m package which was announced before the election, he said.\n\n“My job is to go around this country in my tourism capacity promoting Australia, going overseas to promote Australia,” he said.\n\n“Look, I could sit on my couch with a beer watching the TV but choose to go around the country and around the world to promote Australia.”\n\nLast financial year, MPs billed more than $700,000 of family travel expenses for trips to and from Canberra, just under $400,000 on other domestic flights, and $60,000 on chauffeurs and other car expenses.\n\nSport Minister Anika Wells did not travel to Italy for the Winter Olympics. Picture: NewsWire / Martin Ollman\n\nAnika Wells claimed $8500 worth of family flights to get to Melbourne for three consecutive AFL grand finals. Picture: Instagram\n\nBehind Senator Farrell, Australia’s Voice WA Senator Fatima Payman claimed the second-most family travel – $41,438 – and former Liberal leader Peter Dutton was third, billing the taxpayer $36,542\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEight of the 20 politicians to claim the most family travel are from WA\n\nThe Sport Minister, Ms Wells came under fire late last year when it was realised she used family reunion travel entitlements to fly family members to the AFL and NRL grand finals, the cricket, the Australian Open tennis, and to a ski resort at Thredbo.\n\nThe Prime Minister called for a review of the rules, and in January the independent Remuneration Tribunal changed the rules so family members can no longer fly business class on the public dime.\n\nFamily reunion travel outside of Canberra will also be capped at one trip per year, and MPs will need to ask the Independent Parliamentary Expenses Authority before booking flights.\n\nSpouses of senior politicians can still use taxpayer money to attend official portfolio-related events if they are invited, but this has been capped at three return-trip economy airfares a year.",
    "source": "Yahoo",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/gross-detail-in-photo-of-roadside-speed-camera-has-aussies-outraged-reeks-of-insensitivity-020226752.html",
    "title": "'Gross' detail in photo of roadside speed camera has Aussies outraged: 'Reeks of insensitivity'",
    "publish_date": "2026-02-15T02:02:26Z",
    "category": "finance",
    "authors": [],
    "text": "A mobile speed camera has sparked outrage after it was set up on the side of the road in a small Victorian town that was ravaged by bushfires. Among charred trees and burnt out homes, the white vehicle was parked on the roadside, ready to nab speeding drivers.\n\nAlexandra, 130km north-east of Melbourne, was devastated in the fires on January 9 as Victoria faced its most catastrophic bushfire conditions since Black Summer. Dozens of blazes were ignited across the state, with more than 1,000 structures damaged or destroyed.\n\nJake was travelling to Alexandra for work and was about three kilometres out of the town centre when he saw the mobile camera.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I just see this beautiful, shiny speed camera sitting on the side of the road, just trying to, you know, catch people as they're coming back to check on their properties or something,\" he told 3AW Drive host Jacqui Felgate.\n\nHost Jacqui Felgate was not impressed. Source: 3AW\n\nOne month on from the bushfires, Jake described the damage to the town as \"grim\" and \"eerie\".\n\n\"It was like driving through a post-apocalyptic world or something, and I got out of the van at one point and you can still smell the burn in the air,\" he said.\n\nHe admitted that when he first drove past the car, he didn't think much of it, but the closer he got to town, the more it bothered him.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"The more I thought about it, I was like, that's just pretty gross,\" he said.\n\n\"Once I got into Alexandra, the town's not the same, all the bakeries are closed, cafés are closed... it just reeks of insensitivity.\n\n\"And if it was scheduled to be put there, surely you can maybe have a thought and go, 'maybe let's not put it there at the moment'.\"\n\nCFA members in Alexandra work at sunset to extinguish a grass fire. Source: AAP (Jay Kogler / SOPA Images/Sipa US)\n\nRadio host unleashes on 'inappropriate' speed camera\n\nAfter looking at the photo of the camera parked among the burnt landscape, Felgate didn't hold back.\n\n\"Who are you booking in Alexandra at the moment? Is it just people who've lost their homes? Is it volunteers who are cleaning up?\" she said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"No one is going to that region right now for tourism, generally because of the state of the roads, people aren't really driving through. So what are you trying to do? Nab people who've just lost their homes or just lived through a bushfire? That does not sit well with me. Whack them on other roads. Why do you need to put them there?\"\n\nA spokesperson for the state's Department of Justice and Community Safety told Yahoo News it acknowledged the \"devastating impact\" the fires have had on Victorian communities.\n\n\"It is important for all drivers on the road to follow the laws of the road to help keep themselves and others safe,\" the spokesperson said.\n\n\"The Road Safety Camera program paused all mobile road safety camera operations in areas affected by bushfires during the State of Disaster.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe State of Disaster concluded on February 8, with mobile speed cameras resuming in affected areas two days later.\n\nCamera locations are based on the road's crash history, reports of excessive speeding or speed-related problems.\n\nApproved mobile road safety camera sites are published monthly on the Camera Saves Lives website.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 36
  },
  {
    "url": "https://au.news.yahoo.com/australia-post-driver-praised-for-heartwarming-daily-routine-on-aussie-street-020038495.html",
    "title": "Australia Post driver praised for heartwarming daily routine on Aussie street",
    "publish_date": "2026-02-15T02:00:38Z",
    "category": "finance",
    "authors": [],
    "text": "An Australia Post delivery driver in South Australia has been praised for his kindness in a sweet photo posted to social media. On his route, the postie — identified as Clint — stops to greet a friendly kelpie that waits by the footpath each day.\n\nThe pup's owner posted the image to Facebook, praising the delivery driver for his \"fantastic service\". It has since been liked more than 5,000 times.\n\n\"Nearly every day my postie stops and says hi, and has a Schmacko for our kelpie who greets him with such loud enthusiasm the neighbourhood hears,\" she wrote.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe post was met with hundreds of comments from other Aussies with similar tales.\n\nResidents of Caboolture in Queensland, Rowville in Victoria and Coledale in New South Wales all raved about their pup-loving posties, delivering free pats along with their mail.\n\nIt's a pleasant contrast to incidents relating to dog bites and dog attacks on delivery drivers. In the last six months of 2025, more than 1,190 dog-related incidents took place.\n\nDo you have a heartwarming story? Contact newsroomau@yahoonews.com\n\nResidents around the country have praised their local delivery drivers for their kindness towards their pets. Source: Getty\n\nAn Australia Post spokesperson told Yahoo News posties are \"a familiar and trusted presence in communities across Australia\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"While many of our team members develop positive relationships with animals along their route, all interactions are managed in line with strict safety protocols to protect our people, customers and their pets,\" they said.\n\nAnd while many commented that their local delivery drivers often greeted their pets with a treat, the spokesperson said that was actually against their protocols.\n\n\"Posties must follow clear safety guidelines when approaching properties with dogs and are not permitted to carry or give dog treats,\" they said.\n\nPostie applauded for going 'above and beyond'\n\nIt's not the first time a postman's kind gesture has made headlines.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn November, an Australia Post employee won widespread praise after going \"above and beyond\" to fetch a woman's parcel that had fallen into a suburban street drain.\n\nThe driver had accidentally dropped the package outside her home on the Sunshine Coast, and instead of driving off he knocked on her door to apologise and try to fix the mistake.\n\nUsing tongs while lying face-down in the gutter with his arm down the drain, the postie managed to retrieve the parcel and deliver it successfully.\n\nIn October, a postie in Melbourne found a tiny baby bat clinging to the back of its dead mother.\n\nInstead of trying to remove the distressed animal, the worker, Wayne, put a box over the pair and phoned wildlife rescuers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe tiny bat survived, and was named \"Little Wayne\" in honour of its rescuer.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 37
  }
]