[
  {
    "url": "https://www.9news.com.au/national/melbourne-man-charged-in-alleged-road-rage-incident/7f765c54-52b1-42e6-9d43-a534eaaf2632",
    "title": "Man charged after allegedly hitting another man with a hammer in road rage",
    "publish_date": "Sat, 27 Dec 2025 01:03:45 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "The 53-year-old victim got back into his vehicle and drove to Chapman Drive before later being taken to\n\nhospital\n\nwith serious injuries to his upper body.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/aussie-childcare-services-call-out-federal-governments-mandate/063c7fed-caa7-4848-bb37-65ea20a7440d",
    "title": "Aussie childcare providers call out federal government mandate",
    "publish_date": "Fri, 26 Dec 2025 10:52:11 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "They say there are issues with the way the\n\nmoney\n\nis calculated, and could be forced to increase their fees or close down altogether.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/iga-mitre-10-metcash-ceo-doug-jones-secrets-to-success/ec05b570-6130-4501-9e9c-ce64c4cce6cf",
    "title": "CEO of business that made $17.3b last year doesn't 'do much work'",
    "publish_date": "Fri, 26 Dec 2025 20:44:18 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nAs chief executive of wholesale retailer Metcash (the business behind IGA, Mitre 10, and many other independent Australian retailers), Doug Jones has a lot of responsibility.\n\nUnder him, Metcash hit $17.3 billion in sales revenue for the last financial year but he told 9news.com.au that﻿ he actually doesn't \"get to do much work\".\n\n\"All the teams around me, they do all the work,\" he said.\n\n﻿ These are his secrets to success.\n\nMetcash CEO Doug Jones is all about uplifting independent retailers like IGA, Mitre 10, and The Bottle-O. (Dominic Lorrimer)\n\nHow do you start the day to set yourself up for success?\n\nI like to go for a run or a ride or do some exercise, and then I get stuck into it.\n\nI'm of South African heritage, so I check my WhatsApp from family and friends because the time difference. And sometimes, if it's Monday, I catch up on a little bit of sports news.\n\nBut I'm not one for cold plunges and meditations. I like to just get into the day.\n\nWhat are three daily habits you always stick to?\n\nI write down what I need to do, what my priorities are for the day. That's the first thing I do so I'm very clear about what is it that I want to achieve today.\n\nI make sure that I check in with important people, starting with my wife and kids, and then when I get into the office. It's just making sure that the connection is there, whether it's a quick call on the way in or a visit to someone's office – I prefer face-to-face to email.\n\nAnd then I make sure that I leave my desk at the end of the day being clear with what I've achieved and what's coming up for the next day. It'll involve a quick scan of the diary to make sure that I don't have anything outstanding.\n\nJones said getting a promotion or a new job is about proving you'll do it well. (Bloomberg via Getty Images)\n\nLots of Aussies are looking for a career change – what small action can help them get ahead of other candidates?\n\nAt the end of the day, you need to do a good job.\n\nI tell my children this all the time; having a job is a privilege, not a right. And I think that delivering 10 times the value of your salary is where you should start.\n\nIt's probably boring and old-fashioned advice, but that's the first thing and frankly, that opens up opportunities. Whether you're looking for a career change or a promotion, people around you are looking to work with people that get stuff done, and that do it in a way that's collaborative and pleasant.\n\nSo yes, you should do stuff you're interested in, yes, you should do stuff you're good at, but at the end of the day, you should do things where you can add genuine value.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat financial myth do you wish you never bought into?\n\nI was brought up in a fairly strict environment, and my parents were always very smart about teaching me not to live beyond my means, so I think credit should be used appropriately.\n\nCredit is good at the right time, but only if you can pay back that credit.\n\nWhat do you wish you could tell your 20-year-old self?\n\nDon't be so serious.\n\nThe world is a wonderful place and if you approach it with curiosity, integrity, passion and humility, I think that you can have an amazing career and life.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/the-most-power-hungry-appliances-in-your-house/03d42a81-9b67-4948-b292-31fc50669055",
    "title": "The most power-hungry appliances in your house and how to make better use of them",
    "publish_date": "Fri, 26 Dec 2025 20:34:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "As the weather heats up, the temptation to switch on the air conditioner gets stronger.\n\nBut with the cool air comes the higher bills.\n\nAnd power bills remain one of the most unwelcome costs Australians are facing.\n\nThere are plenty of ways to save electricity, but some are better than others.\n\nSo what are the most power-hungry appliances in the average house?\n\nHeating\n\nChanging the temperature of a room is the most effective way of getting a higher electricity bill.\n\nIt's estimated 40 per cent of household electricity use goes towards heating and cooling - though some use far more or less than others.\n\nWhen you buy a space heater, you are usually paying for it later.\n\nThe cheap shelf price betrays how much power they use.\n\nAir conditioner is a major electricity user. (Getty)\n\nBut air conditioners aren't the best option either.\n\nIt's possible someone can pay hundreds of dollars more each year just from air conditioning alone.\n\nCeiling fans are a far more efficient option, even if they aren't as effective.\n\nBut if you have both, you should use the fan while you have the air-con on.\n\nHot water\n\nAn average of 23 per cent of household electricity goes towards hot water.\n\nThe solution is simple but not necessarily easy - shorter showers.\n\nWater-saving showerheads make a big difference, but there's a very easy hack to save power.\n\nWater loses heat as it moves, so by moving the showerhead closer to your body, the water will be warmer.\n\nOther tips include filling up the kettle with cold water or using the cold cycle on the washing machine.\n\nPerhaps the most efficient ways to conserve power is to take shorter showers. (Getty)\n\nFridges\n\nIt's the biggest appliance in the house and it's on all the time, so of course the fridge is a big culprit when it comes to high power bills.\n\nEnsuring the seals are in good condition can be a power-saver, as well as limiting the amount of times you open and close it.\n\nAnd you should try and avoid buying a bigger fridge than what you need.\n\nBut oddly enough, having more food in your fridge means it should use slightly less power than an empty fridge.\n\nThe other big power saver is the spare fridge in the garage.\n\nIf you're only using it for drinks at big parties, you should switch it off at other times.\n\nA crowded fridge uses less power than an empty fridge. (Supplied)\n\nWashers and dryers\n\nFront-loading washing machines are usually better for electricity than top-loaders, though they do cost more to buy.\n\nBut the best way to save power in the laundry is to use cold water in the washing machine rather than hot or warm.\n\nAnd hanging your clothes on the line uses no electricity, compared to putting them in the dryer.\n\nThe laundry is a major user of electricity in the household. (Getty)\n\nDishwashers\n\nYou may have seen ads on TV talking about how dishwashers use less water than washing your dishes in the sink.\n\nThat's not true for electricity.\n\nBut you can maximise your dishwasher efficiency by putting it on an eco wash.\n\nBetter yet, wait until the dishwasher is full until you turn it on.\n\nYou shouldn't put your dishwasher on until it is full. (Getty Images/iStockphoto)\n\nOvens\n\nThere's not much you can do to save power when it comes to ovens, save for the decision you make when you buy it.\n\nBut minimising your preheat time is a good way to save power.\n\nIt's also smart to be cooking more than one thing at a time in the oven if you can help it.\n\nYou shouldn't preheat your oven for longer than necessary. (Getty Images/iStockphoto)\n\nTVs\n\nThe bigger the TV, the more electricity it tends to use - but new LCD screens are more efficient than old plasmas.\n\nBut there's not much that you can do to save power with your existing TV - save for turning it off when you're not watching it.\n\nTVs, gaming consoles, DVD players and other devices tend to use low levels of power when in stand-by mode.\n\nSo switching them off at the power point when they aren't being used is a smart choice.\n\nAs obvious as it seems, you should turn your TV off when you're not watching it. (Getty)\n\nSmaller appliances\n\nUsing a smaller appliance instead of a bigger one is normally the savvier choice.\n\nA slow cooker, air fryer or microwave is better than an oven because they are heating less space or for a shorter time.\n\nAnd boiling water in an electric kettle is more energy efficient than a stovetop option.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/2025-christmas-celebrations-australia-world-pictures/6b69a6f9-36c7-4447-9b30-d007d51b5e5e",
    "title": "How the world is celebrating Christmas",
    "publish_date": "Fri, 26 Dec 2025 00:17:39 +0000",
    "category": "finance",
    "authors": [
      "December"
    ],
    "text": "1 of 40 Attribution: Supplied\n\nFrom the beaches of Australia to the squares of chilly Europe, the world is marking Christmas 2025.\n\nAs usual thousands in Australia flocked to the beach, but there were different was of celebrating around the globe.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/china-sanctions-us-defence-firms-over-arms-sales-taiwan/106181220",
    "title": "China sanctions US defence firms over arms sales to Taiwan",
    "publish_date": "Sat, 27 Dec 2025 00:24:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "China has announced sanctions targeting 10 individuals and 20 US defence firms, including Boeing's St Louis branch, over arms sales to Taiwan.\n\n\"China once again urges the US to abide by the one-China principle,\" a Ministry of Foreign Affairs spokesperson said on Friday.\n\n\"Stop the dangerous moves of arming Taiwan, stop undermining peace and stability in the Taiwan Strait, and stop sending wrong signals to 'Taiwan independence' separatist forces.\"\n\nChina would continue to defend its national sovereignty, security and territorial integrity, they said.\n\nA spokesperson for the US State Department said the United States strongly objected to the Chinese move, which freezes any assets the companies and individuals hold in China and bars domestic organisations and individuals from doing business with them.\n\nIndividuals on the Chinese list, including the founder of defence firm Anduril Industries and nine senior executives from the sanctioned firms, are also banned from entering China, it added.\n\nOther companies targeted include Northrop Grumman Systems Corporation and L3Harris Maritime Services, and Boeing's St Louis branch, which focuses on defence work.\n\nThe Chinese action appears largely symbolic, given China's lack of dealings with US defence firms, whereas it has been a major purchaser of Boeing civilian aircraft.\n\nThe move follows Washington's announcement last week of $11.1 billion (AU$16.5b) in arms sales to Taiwan, the largest ever US weapons package for the island, drawing Beijing's ire.\n\n\"The Taiwan issue is the core of China's core interests and the first red line that cannot be crossed in China-US relations,\" a Chinese foreign ministry spokesperson said in a statement on Friday.\n\n\"Any provocative actions that cross the line on the Taiwan issue will be met with a strong response from China,\" the statement said, urging the US to cease \"dangerous\" efforts to arm the island.\n\nChina views democratically-governed Taiwan as part of its own territory, a claim Taipei rejects.\n\nThe US is bound by law to provide Taiwan with the means to defend itself, though such arms sales are a persistent source of friction with China.\n\nThe State Department spokesperson said this policy had \"remained consistent across nine different US administrations and contributes to the maintenance of peace and stability across the Taiwan Strait\".\n\n\"We strongly object to Beijing's efforts to retaliate against US companies for their support of US arms sales that support Taiwan's self-defence capabilities,\" the spokesperson said, while urging Beijing to cease military, diplomatic, and economic pressure against Taiwan and instead engage in meaningful dialogue with Taipei.\n\nBoeing has been in talks to sell Chinese carriers up to 500 civilian jets, according to a report in September, which would represent a major breakthrough for the company in the world's second-largest aviation market, where orders have stalled amid US-China trade tensions.\n\nList of senior executives whose Chinese assets will be frozen:\n\nName Position Company 1 Palmer Luckey Founder Anduril Industries 2 John Cantillon Vice president; vice president and principal accounting officer L3Harris Technologies; L3Harris Maritime Services 3 Michael J Carnovale President and chief executive officer Advanced Acoustic Concepts 4 John A Cuomo President and chief executive officer VSE Corporation 5 Mitch McDonald President Teal Drones, Inc. 6 Anshuman Roy Founder and chief executive officer Rhombus Power Inc. 7 Dan Smoot President and chief executive officer Vantor 8 Aaditya Devarakonda Chief executive officer Dedrone Holdings Inc. 9 Ann Wood President High Point Aerotechnologies 10 Jay Hoflich Co-Founder and chief executive officer ReconCraft\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/volunteer-firefighters-risk-their-lives-to-keep-communities-safe/106139496",
    "title": "'My second family': The volunteers risking their lives to keep us safe",
    "publish_date": "Sat, 27 Dec 2025 00:06:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's an intense summer and an unrelenting fire has ignited, tearing through dense bush, threatening lives and homes on the fringes of an outback town.\n\nTowering gum trees become engulfed as fast-moving spinifex fires ignite new pockets of fuel.\n\nThe blaze inches closer to the mining camp two volunteer firefighters are tasked with defending, as the \"terrifying\" roar of the flames becomes deafening.\n\nKelvin Portland remembers the day clearly, one of the many daunting moments in his 37-year career as a volunteer firefighter.\n\nVolunteer firefighter Kelvin Portland has fought fires for almost four decades. (ABC News: Keana Naughton)\n\n\"I'm sitting there, I'm going, what the hell's that noise?\" he recalled.\n\n\" It was like a jet engine. It was that noisy, that loud. \"\n\nThe sky blackened as thick smoke smothered the last remaining pockets of light.\n\nTowering over the ridge as the wall of flames grew higher, the sheer ferocity and intense heat was distorting the air.\n\nVolunteers face scary situations. (Supplied: DFES)\n\n\"The fire was going up over the ridge and creating its own storm.\"\n\n\" You don't realise how ferocious a fire can be until you actually witness something like that. \"\n\nBattle scars\n\nYears of service have left scars, both physical and emotional.\n\nDespite heightened health risks, extreme environments and gruelling hours, fire and rescue volunteers put their lives on the line for their community.\n\nThe Mundaring Volunteer Fire and Rescue Service fleet. (ABC News: Keana Naughton)\n\nThey are often working in extreme environments such as unrelenting weather conditions, high heat or smoke, which can exacerbate negative impacts on their physical and mental health.\n\nThey do it all without expecting a cent in return. Why?\n\nAt the Mundaring Bushfire Brigade, Kelvin Portland and Luke McCall are at different ends of their volunteer firefighting careers, but they have a similar answer.\n\nFor many volunteers, decades-long motivation comes from the deep roots of knowing they've made a genuine impact on people's lives.\n\nBut duty comes with its fair share of sacrifices.\n\nVolunteers like Kelvin Portland face traumatic events. (ABC News: Keana Naughton)\n\nFire and rescue volunteers are subject to constant exposure to traumatic events such as large-scale incidents, road crashes and distressed members of the public who are often facing the worst day of their lives.\n\nThrough repeatedly witnessing and hearing about the experiences of others, they risk exposing themselves to further trauma, which can leave devastating impacts.\n\n'Just go through your steps'\n\nIn the darkest moments, Kelvin focuses on carrying out what he learnt in training to detach himself from what's unfolding in front of his eyes.\n\n\"Trying to get them out of a vehicle, or out of the house, or something like that. You've got to just go through your steps,\" he said.\n\nKelvin (left) undertaking training. (Supplied: DFES)\n\nLuke McCall said the resilience of his colleagues motivates him.\n\nIt's something he witnessed around the time of his cadetship, when a bushfire flattened the town of Yarloop.\n\nThe situation was volatile as a fierce and rapidly spreading fire raged from the hills down to the town, causing widespread destruction and leaving hundreds homeless.\n\nThe devastating Yarloop bushfire in 2016. (Supplied: DFES)\n\nIt completely drained and exhausted first responders.\n\n\"What have I got myself into?\" Luke asked himself.\n\nBut what he saw helped him find a sense of strength.\n\n\"They [my colleagues] just kept going and going and so I suppose if they can do it I could do it,\" he said.\n\nLuke McCall has formed a close bond with his fellow volunteers. (ABC News: Keana Naughton)\n\n\"[To] actually be involved and helping out is probably the most rewarding part.\"\n\n'My second family'\n\nOne of the continuous motivators for Luke is the camaraderie and bonds forged within the team.\n\n\"The way I look at it now is that they're my second family,\" he said.\n\nLuke McCall says his colleagues motivate him. (ABC News: Keana Naughton)\n\n\"You've got to always have someone to fall back on. It doesn't matter what kind of issue it is, whether it's personal or you just want to have a talk with someone.\"\n\nIt's that sense of community and duty that has helped volunteer bushfire brigades operate for decades — and there's always a need for new members.\n\n\"It's the survival of our brigade,\" Kelvin said.\n\n\"I can't remember the last new member we had, it was quite a while ago.\n\nKelvin can't remember the last time they had a new member at their brigade. (ABC News: Keana Naughton)\n\n\"A lot of people are interested in that and ask, but really don't take that next leap by actually coming down.\"\n\nCreating pathways\n\nDepartment of Fire and Emergency Services Deputy Commissioner Craig Waters says the agency is trying to make volunteering more accessible to people.\n\nMore people are needed on the frontline. (Supplied: DFES)\n\n\"This includes creating flexible roles to better fit in with people's busy lives, and a clear pathway for cadets and junior members to become active firefighters with their local brigade once they're old enough,\" he said.\n\nHow to defend your home Fire agencies recommend that you develop a bushfire survival plan. If you decide to stay and defend your home, there are some important things to consider.\n\nIt's a tough ask — acknowledging volunteers must put their own lives on hold to turn out to an unfolding disaster at a moment's notice.\n\n\"They show bravery and unwavering dedication to keeping communities safe without expecting acknowledgement or thanks,\" Commissioner Waters said.\n\nIn WA, 93 per cent of the state is highly bushfire prone, with dry terrain and native vegetation creating a highly susceptible environment, especially around the Darling Range, otherwise known as Katta Moorda, where the Mundaring brigade is based.\n\nLuke joined through the cadet program nine years ago and said it had helped him immensely with his communication skills.\n\nLuke addresses new cadets at the Mundaring Volunteer Fire Brigade. (Supplied: DFES)\n\n\"I feel like school's very lacking with that side of stuff, whereas cadets, you're forced to be talking to not just people your age, but older people with experience.\"\n\nWhen a bushfire reached Kay's suburban home, she wasn't ready After a fast-moving bushfire reached the front door of her home in 2023, Kay Douglas is now better prepared in case it happens again.\n\nKelvin remembers what it was like when Luke joined the brigade.\n\n\"So shy, so quiet and we can't have that on the fire ground, you need a loud voice so we sort of basically drummed that into him and we do it with all the other cadets too — and now boy, he's got a good voice now, it's pretty loud.\"\n\nDespite the increasing challenges, Kelvin has no plans to retire and is determined to continue helping others.\n\n\"You get that feeling that I have done something, I have achieved something in my life,\" he said.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/storm-warning-aussie-wants-to-regain-world-number-one-status/106181154",
    "title": "Storm warning: Aussie wants to regain world number one status",
    "publish_date": "Fri, 26 Dec 2025 23:20:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "With a devastating Achilles injury behind her, Storm Hunter is adamant she can recapture the swashbuckling form that made her the world's top-ranked doubles player.\n\nThe popular veteran was at the peak of her powers when her Achilles tendon snapped during Billie Jean King Cup training in April 2024, ruling her out of that year's Olympics.\n\nHunter was the 2023 year-end doubles world number one before going on an incredible run from qualifying to the Australian Open third round to surge to a career-high singles ranking of number 114.\n\n\"I have a lot of confidence in myself,\" Hunter told AAP.\n\n\"I know my level and I feel like I'm working to get back to that level.\"\n\nLoading Instagram content\n\nHunter had just started playing with now world number one Katerina Siniakova before her injury and, since returning in February, has rekindled that partnership along with testing out others, while also working on her game.\n\n\"I'm a little bit older too, so it actually keeps me more motivated to keep improving because I'm like, 'Oh, wow, there's so much more I can still learn and get better at,'\" the 31-year-old said.\n\n\"So that's been really fun too.\n\n\"Achieving number one in the world, I can't do anything more than that. So in a way, there's a lot of pressure on me because I've achieved something incredible.\n\n\"And now I'm just doing it for myself — just trying to enjoy being on tour, travelling with my husband, travelling with my team.\"\n\nHunter has slipped to world number 425 in singles.\n\nBut she has been awarded an Australian Open qualifying wildcard and now has a chance to battle through to the main draw and feature at Melbourne Park in that capacity.\n\n\"I've still got some protected rankings for singles as opposed to AO. So I definitely want to focus on my singles after the AO,\" she said.\n\n\"Whatever opportunities I get given will be amazing and I just can't wait to play in front of the crowds since I missed out on playing this year.\"\n\nIn doubles, Hunter will link up with 19-year-old breakout star Maya Joint, who is now ranked world number 32 in singles and number 54 in doubles.\n\n\"She [Joint] is younger and just had an amazing year,\" Hunter said.\n\n\"She's a great player, but just a really great person. Super energetic, excited.\n\n\"She wants to learn. She wants to get better on the doubles court, too.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHunter described Joint as \"a great doubles player\".\n\n\"She's almost top 50 in the world in doubles herself after being on tour like for one year — it took me like eight years to get to top 50 in doubles,\" she said.\n\n\"It's going to be really fun. Playing with an Aussie doesn't get any better.\n\n\"So hopefully the crowds come out and support us. We're going to have a lot of fun.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/dongara-roadside-relics-group-collecting-litter-wins-award/106154988",
    "title": "'Trashy' trio of retirees receive top community cleaning award",
    "publish_date": "Fri, 26 Dec 2025 23:16:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "A trio of rubbish removal enthusiasts in Western Australia's beachside town of Dongara have battled wild pigs, dodged road trains, and scorched under the hot sun in a quest to remove roadside litter.\n\nThe picturesque seaside town, about 350 kilometres north of Perth, is known for its beautiful beaches, rolling dunes and natural beauty.\n\nWhen Glenys Bellis saw yet another piece of rubbish on the side of the road 14 months ago, she decided enough was enough.\n\n\"I could see all the rubbish, and I thought something has got to be done about this,\" she said.\n\n\"It made me feel disgusting.\"\n\nRubbish collected from the side of the road is thrown out at the tip in Dongara. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nHer plan was simple — to spend her spare time picking up other people's trash from the side of the road.\n\nAnd an encounter with her friend Sherry Martin at the op shop turned into the perfect recruitment opportunity.\n\n\"She [Glenys] said something like 'Hey, you look kind of trashy, want to help pick up roadside rubbish?' And I said: 'Sure, why not?'\" Ms Martin said.\n\nAnother friend, Glenda Green, also joined the cause, and together they became an award-winning trash trio, known as the 'Roadside Rubbish Relics'.\n\n\"Sometimes the relics refer to us, and sometimes the relics are some of the stuff that we pick up,\" Ms Martin said.\n\nTonnes of hard work\n\nArmed with gloves, bags, buckets and tongs, the 'Relics' spend up to six hours a day, sometimes three days a week, bush bashing around regional roads.\n\nLoading...\n\nThat includes along the Brand Highway — the main road connecting Geraldton to Perth — which has a speed limit of 110 km/h and is used by thousands of road trains.\n\nMs Martin said the group had collected between eight and 10 tonnes of litter, including more than 13,000 drink containers.\n\nGlenda, Glenys and Sherry pick up rubbish just metres away from busy, high-speed roads and highways. (ABC Midwest & Wheatbelt: Chris Lewis)\n\n\"We find crocs and thongs, and we find things that are from bedside tables that probably should go in the rubbish bin and not on the roadside,\" she said.\n\n\" You name it, we find it. \"\n\nApproximately 100,000 tonnes of waste becomes litter in Australia each year, according to litter reduction organisation Keep Australia Beautiful.\n\nWhile some of the litter may be accidental, other trash is more intentional.\n\n\"Some of it really upsets us,\" Ms Martin said.\n\n\"Recently, we just picked up what a tradie had dumped in the bush, a whole trailer load of rubbish bits from remodelling a house.\n\n\"It's like, really? The tip is just around the corner, you couldn't do that at the tip?\"\n\nSherry Martin and Glenda Green say they have seen it all along the Brand Highway. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nAnd sometimes, rubbish isn't all the Relics find.\n\n\"I was on Brand Highway … I heard a noise, and I thought it was a roo that I'd spooked,\" Ms Martin said.\n\n\"I turned around it was this huge, giant pig chasing me down and the only thing I had was an orange bag in one hand and a pair of tongs in the other.\n\n\"I start screaming and yelling and flailing about, and then I end up inadvertently in the middle of Brand Highway before this pig finally turned around and ran off.\"\n\nPicking up top prize\n\nMs Bellis said she was \"gobsmacked\" when the Relics won the \"Litter Action\" category at this year's WA Tidy Towns Sustainable Communities Awards.\n\nThe Roadside Rubbish Relics' accomplishment at the Tidy Towns awards is already proudly on display in Dongara. (ABC Midwest & Wheatbelt: Chris Lewis)\n\n\"It was mind-blowing,\" she said.\n\nThe judges said their efforts led to \"a noticeable reduction in litter along the highway and have significantly improved the town's presentation\".\n\nThe local community has noticed their efforts too, with some drivers known to drop off bottles of water or deliver coffee.\n\nMs Bellis said it made them feel part of the community.\n\n\"We've got a bloke coming from Eneabba, and he donates every time he comes up,\" she said.\n\n\"He'll donate us money, he even stops and has a chat to us on the road.\n\n\"That really gives me a high, and I feel like he's family.\"\n\nSherry Martin and Glenda Green wave as cars drive past along the Brand Highway. (ABC Midwest & Wheatbelt: Chris Lewis)\n\nFor Ms Martin, the feeling of accomplishment after a hard day on the tongs was the best part.\n\n\"All that stuff that would have stayed in the environment, polluting the environment,\" she said.\n\nShe encouraged people to be more aware of the environment.\n\n\"If you're going to drink it, keep it in your car until you find a bin to put it in.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/cure-guitarist-perry-bamonte-dies-aged-65/106181152",
    "title": "The Cure guitarist and keyboard player Perry Bamonte dies aged 65",
    "publish_date": "Fri, 26 Dec 2025 23:01:13 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The Cure guitarist and keyboard player Perry Bamonte has died aged 65, the legendary British dark rock band announced on Friday.\n\nBamonte, who became a full member of The Cure in 1990, \"passed away after a short illness at home over Christmas\", according to a statement published on the band's website.\n\n\"It is with enormous sadness that we confirm the death of our great friend and bandmate Perry Bamonte,\" it said.\n\n\"Quiet, intensive, intuitive, constant and hugely creative, 'Teddy' was a warm-hearted and vital part of The Cure story.\n\n\"Our thoughts and condolences are with all his family, he will be very greatly missed.\"\n\nThe Cure pictured during their induction into the Rock Walk at the Guitar Center in Hollywood, California in 2004. (Getty Images via AFP: Vince Bucci)\n\nThe Cure — whose 66-year-old frontman Robert Smith is famous for his innovative approach to music as well as on-stage stamina — has transformed itself throughout its prolific decades-spanning existence.\n\nWhen The Cure formed in 1976, Bamonte was initially part of its road crew from 1984 before enjoying two stints as a musical member, playing guitar, six-string bass, and keyboard.\n\nThe first, from 1990, spanned 14 years; the second stint was from 2022 onwards.\n\nIn its statement, The Cure noted he had helped create numerous albums, including Wish, Wild Mood Swings, Bloodflowers, Acoustic Hits, and The Cure.\n\nHe performed in more than 400 shows during his first 14-year period in the band, and then played another 90 after rejoining three years ago, it added.\n\nThose later gigs were \"some of the best in the band's history\", the statement said.\n\nBassist Simon Gallop and Perry Bamonte during an appearance on The Tonight Show with Jay Leno in 2004. (Getty Images via AFP: Kevin Winter)\n\nLed by Smith's plaintive, wailing voice and rich guitar textures, The Cure helped shape Goth rock with albums including 1982's Pornography, which was full of suicidal imagery.\n\nThe band later had hits with much cheerier material, including Friday I'm in Love.\n\nIt had kept up touring, but before last year's release of Songs of a Lost World, it had not released a new studio album since 2008's 4:13 Dream.\n\nThe band's former drummer, Lol Tolhurst, said in a tribute posted on Instagram that he was \"so sad\" to learn of Bamonte's death, adding that he and his wife \"send our condolences to all that knew him\".\n\n\"Farewell Teddy,\" he added.\n\nBamonte was also the bass player in supergroup Love Amongst Ruin, which has released two studio albums.\n\nAFP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/ashes-boxing-day-test-live-australia-england-day-two/106181180",
    "title": "Live: 'This will be done today': Australia collapses as MCG Test set for day-two finale",
    "publish_date": "Fri, 26 Dec 2025 22:48:49 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Chris De Silva",
      "Simon Smale"
    ],
    "text": "Josh Tongue (right) continued his strong performance as England removed six wickets in the opening session. (Getty Images)\n\nAnother bizarre session in a bizarre Test match has seen Australia lose six wickets but still be ahead in the match.\n\nThere's going to have to be serious questions asked of this pitch after the completion of this match, despite that being a rarity after short matches in this part of the world.\n\nI'm all for bowlers getting a fair go, but you shouldn't see 26 wickets fall in the first five sessions of a Test, irregardless of the quality of strokeplay.\n\n\"I see Test cricket as a good novel that slowly unwinds and reveals itself. We're on a cartoon. I want a bit of War and Peace. This'll be done today either way,\" says former England spinner Phil Tufnell on ABC Radio.\n\nThe duration of this Test almost entirely rests on the bat of Steve Smith, who has awkwardly worked his way to 16.\n\nIt must be said, England is a bowler short as well after losing Gus Atkinson to a hamstring injury in the opening hour of the day.\n\nLet's all step away and decompress before we return to the madness in just under 40 minutes' time.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/nt-plans-for-darwin-landmark-state-square-building/106171494",
    "title": "NT government blocks release of gallery plan, tourism group bids for space",
    "publish_date": "Fri, 26 Dec 2025 22:47:07 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Plans for what would have been a major art gallery in Darwin's CBD remain uncertain, with a government decision about who will move into the $145 million building not expected until mid-2026.\n\nOriginally costed at $50 million, construction on the Northern Territory Art Gallery (NTAG) began in 2021 under the former Territory Labor government, but costs for the building have since blown out by nearly $100 million.\n\nThe building in Darwin's State Square was slated to be a new government-run gallery to showcase artworks from the Museum and Art Gallery of the NT's (MAGNT) collection — primarily pieces from the NT and Asia — which currently have nowhere to be displayed.\n\nEarlier this year, the Country Liberal Party (CLP) government unexpectedly announced that it would consider other proposals for use of the $145 million building, rebranding it as the State Square Building.\n\nThe Country Liberal Party scrapped the former Labor government's planned art gallery after sweeping to power at last year's election. (ABC News: Marcus Kennedy)\n\nWhile the government has left the door open for the building to fulfil its intended purpose as an art gallery, exactly what art it will exhibit remains uncertain.\n\nIn September, the government said it was considering splitting up the lease, but it also remains unclear what might inhabit the new build, due for completion next year.\n\nNorthern Territory Arts Minister Jinson Charls said the department was reviewing applications, with a decision expected mid-2026.\n\n\"There are a lot of people who are interested in what it's going to be — same as me — I am eagerly awaiting what's going to be the outcome for the State Square Building,\" Mr Charls said.\n\nJinson Charls says he is \"eagerly awaiting\" the outcome from the pending applications. (ABC News: Pete Garnish)\n\nIn April last year MAGNT presented its plans for the NTAG's opening exhibitions to a government steering committee, documents released under freedom of information (FOI) laws show.\n\nBut a representative of the Department of People, Sport and Culture said releasing the exhibition plans in full \"would be contrary to the public interest\".\n\n\"Disclosure of plans for a project that did not proceed could affect future planning for the State Square Building,\" department representative Deborah Butler said.\n\n\" I have determined that no overriding public interest justifies the release of the exempt information. \"\n\nMAGNT has declined to comment on its proposal, citing confidentiality requirements for interested parties.\n\nTourism association makes play for building\n\nThe Northern Territory government has said \"wasteful spending\" by the previous Labor government was behind the State Square Building needing to be put out to tender.\n\n\"NT Labor's State Square Art Gallery blew out by $100 million and was never funded for operational costs, which is why a tender is now out to secure a future use for this building that benefits Territorians, boosts the economy, and makes our city centre a destination,\" Treasurer Bill Yan said in a statement.\n\nPlans for the ATSIAGA in Alice Springs were scrapped in October after a stand off between the territory and federal governments. (Supplied)\n\nIndustry lobby group Tourism Top End said it has submitted an expression of interest (EOI) for use of part of the State Square Building.\n\n\"The EOI is in partnership with other Darwin businesses which would utilise the entire building,\" its general manager Samantha Bennett said in a statement.\n\nArt critic labels NT government gallery plan 'pure madness' A leading figure in Australia's art world has criticised the Northern Territory government for considering splitting up the lease for a building designed as a major new art gallery.\n\nFinancial figures released by the government show around $26.8 million was spent by the Labor government on the Aboriginal and Torres Strait Islander Art Gallery of Australia (ATSIAGA) in Alice Springs, and planning for the Myilly Point museum, abandoned in 2018.\n\nThe ATSIAGA was sensationally scrapped this year after a rift between the NT and federal governments.\n\nMr Yan, who is also the NT's infrastructure minister, gave his federal counterpart Catherine King an ultimatum to approve his government's downsized plans for the Alice Springs gallery or it wouldn't go ahead.\n\nMs King refused to be forced into a decision, prompting Mr Yan to scrap the plans.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/175-year-old-nor-west-bend-station-reopened-to-public/106028646",
    "title": "Historic riverside Nor' West Bend open to public after decades of restoration",
    "publish_date": "Fri, 26 Dec 2025 21:41:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "At a sweeping bend in the mighty River Murray, history is being brought back to life at a heritage-listed 175-year-old former sheep and cattle station.\n\nNor' West Bend Station marks the spot where the river runs south after flowing into South Australia from the east.\n\nThe barn at Nor' West Bend before and after its most recent renovations. (Supplied: Lisa Goodland)\n\nIt has now reopened to the public for the first time in more than a decade, after being lovingly restored by its previous owners, Kevin and Sue Pedder, who researched and recorded the history of the property.\n\nNor' West Bend station homestead has been a home to many families over the years. (ABC Open Riverland)\n\nNew co-owners Lisa and David Goodland have taken the Pedders' efforts to the next level, modernising and refurbishing it into a cafe and bar venue.\n\nMr and Mrs Pedder bought the station and an attached 260 hectares in 2002.\n\nThey were handed the keys and \"two books' worth of problems\", which held the site's dilapidation survey.\n\n\"It was like our Bible to restore the place because it gave us everything that was wrong with [it],\" Mr Pedder said.\n\nThe couple had always enjoyed holidaying by the river and, after retiring, decided to move there permanently, taking on the restoration project as a \"full-time job\".\n\n\"It took us eight years before we could actually shift into the main homestead and do all the outbuildings and get it all back to [being] liveable,\" Mr Pedder said.\n\nThe old roof on the Nor' West Bend homestead was falling down when Kevin and Sue Pedder bought the property in the early 2000s. (Supplied: Kevin Pedder)\n\nRestoration station\n\nNor' West Bend features a main homestead, a two-storey woolshed and wool store, shearing shed, and stables on the property.\n\nKevin and Sue Pedder owned Nor' West Bend for almost 20 years and enjoyed special moments at the station, like their daughter's wedding. (Supplied: Kevin Pedder)\n\n\"It was like a mini town because it was there about five years before [the town of] Morgan existed … which was called North West Bend at the time,\" Mr Pedder said.\n\nWhen the Pedders arrived, most of the roof on the main homestead had been destroyed by the weather and white ants.\n\nThe couple outsourced about half of the restoration work and did the rest themselves, staying on the property for almost 20 years.\n\nNor' West Bend Station was established in 1850. The original lease was for 43 square miles of land by the River Murray. (Supplied: Lisa Goodland)\n\n\"We tried to keep it as close to original as possible … right down to the original stove that we found in the dump and had restored and put back into the kitchen,\" he said.\n\nWith the property being heritage-listed and with previous links to the National Trust, Mr Pedder said every adjustment was run by the organisation to ensure renovations were historically accurate.\n\n\"We had the 150th anniversary [while we owned it] and thought if we can get this to last another 150 years, it would be fantastic,\" Mr Pedder said.\n\nStepping back in time\n\nNor' West Bend has seen droughts, floods, prosperous years, and everything in between since its establishment in 1850.\n\nIts early days as a cattle and then sheep station were tough for some and rewarding for others, with six different owners in the first 30 years of its establishment.\n\nA sketch of the main homestead at Nor' West Bend from 1909, by Mrs L Hines. (Supplied: State Library of South Australia B 9915)\n\n\"The station went from famine in the drought, where it got down to hardly any sheep left, to people who made absolute millions of dollars out of the place,\" Mr Pedder said.\n\n\" Some people had to walk off because there wasn't enough water to sustain the place. Others made huge fortunes. \"\n\nOne notable owner was Alexander Hay, a prominent South Australian merchant, pastoralist and politician, who purchased the station in 1876.\n\n\"He built the mansion down at Victor Harbor called Mount Breckan out of one year's wool clip from Nor' West Bend,\" Mr Pedder said.\n\nCharles Campbell, an early settler of Adelaide whom the suburb of Campbelltown is named after, also owned the station for the last years of his life in the late 1850s.\n\nHe died there in 1859 after an infection and complications from a minor cut on his hand.\n\nDavid and Lisa Goodland have built on Kevin and Sue Pedder's restoration work, making it into a cafe and bar venue. (Supplied: Lisa Goodland)\n\nNew beginnings\n\nNor' West Bend changed hands another 10 times before Mr and Ms Goodland bought the property, together with Ms Goodland's parents, in 2020.\n\nLisa and David Goodland's son, Harry, helping with renovations. (Supplied: Lisa Goodland)\n\n\"The original plan was to have it as a holiday house … [but] the barn is so unique … we wanted to fix it,\" Ms Goodland said.\n\n\"My husband and I quit our jobs, moved here full time about a year ago, and thought we'd be open by Easter.\n\n\"It's been a lot of work, but we tried to do as much as possible ourselves.\"\n\nShe said the station was special to many of its visitors.\n\n\"Lots of people have been here and told me their stories … or their grandparents' stories, so it's great they can come back now and see what we've done,\" Ms Goodland said.\n\nThe PS Canally and its crew are some of the many visitors to Nor' West Bend now it has reopened to the public. (Supplied: Gordon Johnston)\n\nNational Trust SA branch chief executive Nicolette Di Lernia said preserving historic sites like Nor' West Bend was vital to preserving history and allowing people to understand it.\n\n\"[Sites] that are used and loved tend to be the ones that are successful and which have a long and exciting future,\" she said.\n\n\"The way we have settled across SA is a pretty impressive story with a lot of good parts to it.\n\n\"It's also really important to balance that with the impact it's had on the traditional owners in those places, by changing the way in which the land is used and occupied and farmed.\"\n\nMany people have passed through the doors at Nor' West Bend Station, now known as \"NWB\", since it opened in November 2025. (Supplied: Lisa Goodland)\n\nMr Pedder said he was proud of his contributions to preserving a \"slice of history\" and applauded the new owners for inviting people back in.\n\n\"Once it's gone, you never get it back,\" he said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/harry-redknapps-horse-the-jukebox-man-wins-king-george-vi-chase/106181036",
    "title": "Ex-manager Redknapp's horse The Jukebox Man wins big race in thriller",
    "publish_date": "Fri, 26 Dec 2025 21:23:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Premier League manager Harry Redknapp was celebrating a special present on Boxing Day after his horse The Jukebox Man raced to victory in one of England's most-famous jumps races, the King George VI Chase at Kempton Park.\n\nThe race — a Group One run over three miles (4,800 metres) and 18 fences — produced one of the all-time great finishes, with four horses battling it out virtually neck-and-neck down the straight over the last two fences before a three-way photo finish.\n\nThe Jukebox Man, trained by Ben Pauling and ridden by Ben Jones, was called a nose in front of second-place finisher Banbridge, with Gaelic Warrior third.\n\n\"That's a dream, and to have a horse that good is unbelievable. I love the game, to come here on King George Day and just run made me so proud, but to have the winner is special,\" said Redknapp, a former FA Cup-winning manager.\n\n\"What a race he has run and he jumped unbelievable.\"\n\nThe Jukebox Man was behind pacesetter Il Est Francais for much of the race and took the lead before the final bend.\n\nFour horses had the chance to win at the final fence, including last year's winner Banbridge, Gaelic Warrior and Jango Baie.\n\nThe Kempton Park crowd roared them home, and connections of The Jukebox Man were elated after he made a late lunge for the line to get his nose in front.\n\nThere was nothing in it right to the line as The Jukebox Man (centre) beat Banbridge (right) and Gaelic Warrior (left). (Getty Images: Alan Crowhurst)\n\n\"It really is the moment where you score the winning goal in the cup final with a minute to go,\" Pauling said.\n\n\"It's as tight as it gets, and I had no idea how we got on. The cameras thought he won, but I didn't want to believe it until I heard that tannoy.\n\n\"It's something very special and Harry has been an exceptional owner for me and we've always had a huge amount of luck. I've always had huge faith in this horse and so has Harry as well.\"\n\nRedknapp, a big personality well known for his quips and one-liners, managed Premier League clubs including West Ham, Portsmouth and Tottenham during a long career. He won the FA Cup as manager of Portsmouth in 2008.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/long-reads-2025-virginia-trioli/106175224",
    "title": "Burnout, landlines and a lost trekker: 13 reads for a holiday weekend",
    "publish_date": "Fri, 26 Dec 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Despite our smartphone-addled brains and our fragmented attention spans, we can't stop giving each other books for Christmas.\n\nAs you unwrap another pile of books to gather dust on your bedside table read about Australians' increasingly complicated relationship with reading.\n\nHere we've gathered a bunch of other things to read while you're relaxing over summer.\n\nCurious about the Australians who head to work as many of us head to bed? Or the mammoth multi-level-marketing scheme cashing in on the manosphere? Or the parents who are reinstalling landlines, hoping an old-school corded phone can restore patience and connection? We've got you covered.\n\nIn 1999, an American trekked into the Australian desert alone, sparking an international rescue mission. Decades later, read about his return to meet the people who tried to save him from himself.\n\nWith burnout at unprecedented levels who doesn't dream of stepping away from it all and embracing a career break. But can it solve the problem? Read about the millennials changing course.\n\nWondering how people lived alongside enormous, now-extinct animals, migrated across the land and survived an ice age?\n\nTake the time to explore the ABC's Deep Time series — collection of about 150 cultural stories that bring Australia's First Peoples history to light.\n\nAnd for the true political nerds hanging out for Parliament to return, reminisce on the election that was with an autopsy of Peter Dutton's loss — yes, that does feel like an age ago.\n\nHave a wonderful summer break if you're stepping back from work and the everyday and I will see you in the new year. We have all shared too many years-end that are hard, tragic or sorrowful — no less Sydney's catastrophic end to 2025. So, it feels false to offer you the usual wishes for peace and happiness.\n\nBut I fervently wish you hope: the state of being that will always call to us with optimism and energy — the things we most need right now.\n\nGo well.\n\n(ABC News: Lindsay Dunbar)\n\nAs smartphones swallow childhood, a growing movement of parents is reinstalling landlines, hoping an old-school corded phone can restore patience and connection.\n\n(ABC News: Emma Machan)\n\n\n\nWith burnout at unprecedented levels who doesn't dream of stepping away from it all and embracing a career break. But can it solve the problem? With burnout at unprecedented levels who doesn't dream of stepping away from it all and embracing a career break. But can it solve the problem?\n\nMELBOURNE, AUSTRALIA - MARCH 2: Daisy Pearce of the Demons marks the ball during the 2018 AFLW Round 05 match between the Melbourne Demons and the Brisbane Lions at Casey Fields on March 2, 2018 in Melbourne, Australia. (Photo by Michael Willson/AFL Media/Getty Images)\n\nAFLW arrived like a freight train in 2017, changing Australian rules football forever. Photographs have told its story and challenged the status quo.\n\nAustralian costume designer Michael Wilkinson landed an Emmy this year for his work on Andor. (Pictured with Bronte Carmichael.) (Supplied: Disney+)\n\nMichael Wilkinson won an Emmy for his intricate costumes in the celebrated Star Wars series Andor. Now, he is recreating 1880s America for Death By Lightning.\n\nRobert Bogucki went into the Great Sandy Desert to find himself in 1999. More than 25 years later, he's back. (ABC News: Franque Batty/Andy Seabourne/archive)\n\nIn 1999 a young American dumped his bicycle and walked out into the Great Sandy Desert. Why was he willing to risk his life, and why do some people need to get lost in order to feel found?\n\nDutton and his team lacked the chops to take on Labor's ruthless election machinery. (ABC News: Matt Roberts)\n\nThe writing was on the wall for Peter Dutton long before Anthony Albanese fired the starter's gun on the election race that would see the Coalition decimated.\n\nThe ancient story of Australia is written in the stars and held in the memory of the land. (ABC News: Solua Middleton)\n\nWe've flipped the script to put Indigenous Australians back at the centre of telling their own stories.\n\nKevin Cobban is a 60-year-old care worker and grandfather who signed up to join the Enagic funnel called The Freedom Era. (ABC News: Abbey Haberecht)\n\nA global multi-level-marketing business that sells expensive water ionisers is shifting its target audience to Aussie tradies, but critics say some of their predatory sales tactics are tantamount to a pyramid scheme.\n\nDeanna Coates waits in traffic during an evening delivery. (ABC News: Patrick Rocca)\n\nWhile most of Australia is sleeping, more than 1 million workers are supporting the $174 billion night-time economy.\n\nTomaoki Hamatsu became a smash hit in the late 1990s when he stared on a controversial Japanese reality television show. (Supplied: YouTube)\n\nNasubi spent 18 months naked and alone in a room for a TV show. His story may seem extreme but it continues to serve as a cautionary tale about the pursuit of celebrity status, and the power of manipulation.\n\nEver imagine that your best life involves lots of reading, but you never have the time? (Getty Images: MoMo Productions)\n\nAs Christmas approaches, it's time to prepare for a great but undeclared festive tradition: Not reading the many books we'll be kindly given as presents. Why do we do this to each other?\n\n(ABC News: Kylie Silvester)\n\n\"Returning to the US for the first time in four years, I found a country that didn't want to talk about politics, despite being in the eye of the Trump storm.\"\n\n(Supplied: Alliyah)\n\nAlliyah is reckoning with a decade of grooming and abuse at the hands of a trusted teacher.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/townsville-broomball-club-sees-fewer-players/106158068",
    "title": "It's a scorcher outside in North Queensland — perfect for broomball",
    "publish_date": "Fri, 26 Dec 2025 20:26:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "When North Queenslander Steve Pilchowski tells people he has played for Australia, they never expect it was for an ice sport.\n\nYet he is among a handful of Townsville broomball players who have called the state's only dedicated ice rink north of Brisbane their training ground for decades.\n\nTo them, playing an ice sport in a tropical city made perfect sense.\n\n\"You get very hot, but it's cold … so it just makes sense to get hot and sweaty in the fridge,\" Mr Pilchowski said.\n\n\"It's 35 degrees outside, and I think it's 5 degrees in the rink.\"\n\nAustralian broomball player Mark McLennan competing at an international tournament. (Supplied: Mark McLennan)\n\nDespite offering relief from the sun, Queensland's only broomball club is facing an uncertain future due to a lack of regular players.\n\nAnd it was a trend the sport's national body said was mirrored across the country, with only four competitions active.\n\n\"It's a bit sad because it's an exciting game,\" North Queensland Broomball Association president Mark McLennan said.\n\n\" It's the perfect game for North Queensland; it ticks all the boxes. \"\n\nAn early club\n\nOriginating in Canada, broomball is played on an ice rink and is similar to ice hockey.\n\nInstead of skates, players wear special shoes and instead of using a hockey stick, they hit a ball with a modified broom.\n\nBroomball started in Townsville during the 1980s, when the sport gained popularity in Australia. (Supplied: Mark McLennan)\n\nIt gained popularity in Australia during the 1980s, with Townsville one of the first clubs established.\n\nWhen Pilchowski joined the club more than 30 years ago, there were 24 teams in the competition.\n\n\"I'd just finished uni, and one of my friends said you have to try this crazy sport where you run around on ice in shoes,\" he said.\n\n\"It was enormous.\"\n\nBroomball player Steve Pilchowski has played broomball in Townsville since the 1990s. (ABC News: Emily Anderson)\n\nLike many members of the club, Pilchowski went on to represent Queensland at several national championships and played for Australia at the 2008 world championships in Canada.\n\n\"The standard of play was just out of this world, it was so good,\" he said.\n\nParticipation across Australia peaked around 2015, according to Broomball Australia, a time when the North Queensland association had multiple divisions across age groups.\n\nBut the club has been struggling since the COVID-19 pandemic and now only has enough players to form two teams of five for a weekly game.\n\nHelmets are a required protective item for the ice-based sport. (ABC News: Emily Anderson)\n\n\"People found other things to do, moved on in life and just got old and chose not to play broomball again, and we've been really struggling since then,\" McLennan said.\n\nHe said low participation had made costs like insurance and rink hire unaffordable.\n\n\"If we don't get a big influx in the next six months, we're not going to have enough numbers to cover the costs,\" McLennan said.\n\nA national issue\n\nBroomball Australia president Jeff Ferrara said there were only 300 regular broomball players across the country.\n\nTownsville, Sydney, Canberra and Adelaide are the only four cities with regular broomball competitions.\n\nBroomball players competing in the Australian National Broomball Championships during the early 2000s. (Supplied: Mark McLennan)\n\nFerrara said a lack of ice rinks was a major reason people had left the sport.\n\nAfter the New South Wales association's home ice rink in Penrith permanently closed in 2022, the closest rink they could use was an hour and a half away on the Central Coast.\n\n\"Player count is down mainly because of a lack of ice time in general,\" Ferrara said.\n\n\"All the people we once had playing for us, it's so difficult for them to go and play.\"\n\nHe believed the solution was government funding for ice rinks to make venues financially viable and offer a venue for ice sports.\n\nWarrina Ice Rink in Townsville is the only ice rink north of Brisbane in Queensland. (ABC News: Emily Anderson)\n\n\"They almost need to be viewed in the same way an indoor stadium would be viewed, where it's owned by the local government or state government and funded like another facility would be,\" Ferrara said.\n\n\"Without these things, you don't have anywhere for the community to do their thing.\"\n\nBut Ferrara remained hopeful that love of the sport would keep it alive and said the national championships remained a popular event for players around the country.\n\nThe National Broomball Championships are scheduled for April 2026.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/anthony-nocera-log-boy-play/106095628",
    "title": "Rising SA playwright's late fiance 'lives on' in emotional theatre debut",
    "publish_date": "Fri, 26 Dec 2025 20:19:42 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Not many people who lose a partner can keep them alive, unless you're a writer.\n\nAnthony Nocera was at university and doing a subject on electronic writing in 2015 when he decided to combine that with his love life, by testing out dating apps.\n\nIt was there he met Jamie Anderson, a larger-than-life character who was 24 years older than him.\n\n\"He was like, 'Are you a good writer?' and I was like, yeah, and so we went on a date and I read him some of my writing and that became seven years of my life,\" he remembered.\n\nIt was during that time that his play Log Boy started to take shape.\n\nNocera's inspiration and writing were based on Jamie's Tuesday catch-ups with his close friend Justin, conversations that Nocera thought were so ridiculous and funny that he began surreptitiously recording them on his phone.\n\nAnthony Nocera spent seven memorable years with late partner Jamie Anderson (left). (Supplied)\n\n\"There was a quality to them in that they were haunted by a lot of the loss that they'd experienced by virtue of the fact they came to sexual prominence during the AIDS crisis,\" he explained.\n\n\"It was quite a chaotic time, they'd lost a lot of people and they'd lost a lot of time in their life.\"\n\nThus was born his manuscript, with the three main characters; Anthony, Jamie and Justin.\n\nHolding a full-time job in the arts as a publicist and marketer, Nocera would find any spare moment he could to work on it.\n\n\"Quite often he [Jamie] would fall asleep before me and I would sit in bed next to him writing it and then the next day I would give him scenes and he'd read it and be like, 'You've made me into a monster darl,'\" Nocera laughed.\n\n\" But he loved it, it was something we did together and something he was really excited by. \"\n\nIn the play, the character Anthony loses his fiance Michael.\n\nIt was based on the playwright's thought of one day potentially losing Jamie, given the big difference in their ages.\n\nAnthony Nocera's breakthrough play Log Boy holds a special place in his heart. (ABC News: Guido Salazar)\n\nThen the play came horribly to life in late 2022. Jamie had been diagnosed with chronic lymphocytic leukaemia and responded well to chemotherapy.\n\nBut he later picked up an infection and passed away from complications.\n\nWhile grieving, Nocera knew he could not put his project on hold.\n\n\"After he passed away I completely rewrote the play to reflect my own experience of loss,\" he said.\n\nIronically, Nocera had always had Jamie as the third character in Log Boy, because he could not bear the thought of killing him off.\n\n\"While the character of Jamie in Log Boy is very different to the real Jamie that lived, the idea that he can live on in a small way as a little testament to him and the immense impact he's had in my life is really special,\" he said.\n\nJamie still has a unique place in Nocera's everyday life.\n\n\"I also just feel him around, like I live in a house we built together, his ashes are in the house and I still keep some of his clothes, he's still the wallpaper on my phone and I hear him every day,\" he admitted.\n\nAnthony Nocera and Jamie Anderson living it up in New York. (Supplied)\n\nBut that connection has not stopped Nocera from finding a new partner.\n\n\"One of the strangest things about meeting someone new after you've lost someone, is the one thing I really want to do is tell Jamie about it,\" he said.\n\n\"About the fact that I've met a really great guy called Billy and I think they'd really get along which is kind of nice and very strange,\" he said.\n\nLog Boy will be part of State Theatre South Australia's 2026 season, with Nocera continue raising some of the funds to stage the production.\n\nThe playwright can see there being an extra audience member when the curtain goes up in early October.\n\n\"Jamie loved attention, so absolutely, I will feel his presence, he'll definitely be there to see that we've done him justice,\" Nocera said with a chuckle.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-27/tim-david-injures-hamstring-as-hurricanes-beat-scorchers/106181008",
    "title": "Tim David injures hamstring as Hurricanes beat Scorchers",
    "publish_date": "Fri, 26 Dec 2025 19:55:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tim David has produced a match-saving knock before injuring his hamstring in Hobart's four-wicket BBL victory over the Perth Scorchers at Perth Stadium.\n\nThe Scorchers wasted a solid start on the way to making 8-150 in Friday night's match, with Finn Allen (43 off 23 balls), Nick Hobson (29 off 23) and Laurie Evans (27 off 18) the main contributors.\n\nIn reply, the Hurricanes slumped to 3-39 following an early onslaught from Cooper Connolly (3-23) before David (42 off 28 balls) and Nikhil Chaudhary (34 off 30) put Hobart back in the box seat.\n\nBut in an unexpected twist, David pinged his hamstring while running for a single in the 15th over, forcing him to retire hurt with the scoreboard reading 4-103.\n\nMac Wright (22no off 13 balls) and Chris Jordan (15 off 11 balls) stepped up to the plate to help guide Hobart home with three balls to spare in front of 42,620 fans.\n\nHobart needed 14 runs for victory with eight balls remaining, before Wright — who was replacing the rested Matthew Wade — cracked Aaron Hardie for a six and a four off consecutive balls to ease the pressure.\n\n\"I'm very happy for Mac,\" Hobart captain Nathan Ellis said.\n\n\"He was sort of a bit of a last-minute call-up with Matthew Wade falling out of the squad.\n\n\"He would have been thinking about Christmas ham and chilling on the couch. To get a phone call and fly over to Perth, and find yourself in a tense game needing to get the boys over the line (is big).\n\n\"He's had some ups and downs in the last 18 months, coming back from an ACL reconstruction. I'm just really proud of him.\"\n\nHardie finished with figures of 0-42 off three overs in a tough night for the all-rounder.\n\n\"Look, it's T20 cricket, everyone can have an off day sometimes,\" Allen said.\n\n\"And you know, we back Hards, we know he's an incredible player.\"\n\nThe Hurricanes improved their record to 3-1, but David's injury is a huge blow to their hopes of defending their title.\n\nThe BBL final is held on January 25, meaning David faces a race against time to return this season.\n\nThe Scorchers entered the match looking to atone for their shock loss to Brisbane, when Perth failed to defend 6-257.\n\nAllen ensured they got off to a fast start, but when he was caught on the boundary to leave the Scorchers at 3-73 in the ninth over, it signalled the end of Perth's attacking potency.\n\nRiley Meredith (2-19 off four overs) was Hobart's most economical bowler, with his most important scalp being that of star opener Mitch Marsh (16 off 13).\n\nSpinner Rishad Hossain (3-33) was the most destructive, snaring a trio of danger men in the form of Connolly (6), Hardie (9) and Evans.\n\nThe Scorchers needed to make an early dent, and Connolly was called upon to open the bowling.\n\nConnolly's first delivery was whacked for six by Mitch Owen (6), but the danger man was out next ball when he cut an easy catch to point.\n\nJoel Paris sent Tim Ward packing for four, and when Connolly trapped Ben McDermott plumb LBW after a failed reverse sweep, Hobart were in all sorts of trouble, before David helped launch the rescue mission.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nIn the other game, the Melbourne Stars remained unbeaten on top of the table with a comfortable seven-wicket win over the Sydney Sixers at the SCG.\n\nThe Sixers made 144 from their 20 overs, led by 60 off 42 balls from opener Daniel Hughes, but the total was never enough.\n\nThe Stars looked in some trouble early thanks to some tight bowling, but once wicketkeeper-batsman Sam Harper got going, there was always going to be one result.\n\nHarper smashed 12 fours and six sixes in his first-ever BBL century, making an unbeaten 110 off 60 balls to get his side home with 15 balls to spare.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/ashes-boxing-day-test-live-australia-at-the-crease-again-after-hectic-20-wicket-opening-day-20251227-p5nq8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ashes Boxing Day Test LIVE: Two-day match ‘back on’ after Australia lose 3-6 amid Boxing Day carnage",
    "publish_date": "Sat, 27 Dec 2025 13:06:58 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "The two-day Test is back on. Australia have lost two wickets in four balls.\n\nUsman Khawaja has holed out second ball at fine leg to the sub fielder Ollie Pope, hooking Josh Tongue.\n\nKhawaja did not seem all that comfortable playing the shot. Tongue’s extra pace was a worry for the veteran.\n\nAustralia have lost five in the morning session, though one includes the No.11 Scott Boland. Cricket Australia chief Todd Greenberg will be uneasy. The prospect of a third day is getting slimmer and slimmer.\n\nMake that six wickets in the session. Alex Carey has nicked off to second slip, and Brydon Carse has wickets in consecutive overs. That’s three wickets in 12 balls.\n\nCarey is out for four – Australia are 6-92, a lead of 134 with Steve Smith and Cameron Green at the wicket.\n\nNormally, you’d say England are well on top, but WinViz still has Australia a 57 per cent chance of winning, and the hosts are still warm favourites with the bookies. Todd Greenberg will be sweating bullets now.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/it-was-a-tough-position-why-matildas-star-had-to-leave-german-juggernaut-20251204-p5nkxm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It was a tough position’: Why Matildas star had to leave German juggernaut",
    "publish_date": "Sat, 27 Dec 2025 13:00:00 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "“To be part of the Asia Cup, everyone wants to do that, but ... I just can’t really put the pressure on myself and see it from that angle,” Freier said. “The Tillies support my decision, but I think I knew it would always be a risk ... I’m trying to use this whole experience as a positive one. “Coming home and playing for the Roar, it’s putting me more in the right direction.” Juggling two lives\n\nAs Freier prepared to return home, her twin sister Laini made a shock decision of her own. Despite earning her maiden Matildas cap, she announced her retirement to focus on other career ambitions and family life. “Laini and I are super close so I know how she felt and was feeling for a while,” Sharn Freier said. Twin sisters Sharn and Laini Freier with their mother. “She had an unreal first professional football season, accomplished a lot in that short time, but I just knew it wasn’t really what she wanted.” “The pressure of needing to be not full-time, but at training for as long as we need to be, and working a full-time gig … she’s happy with what she’s doing now.”\n\nThe average A-League Women’s salary sits around $30,000, and many players essentially juggle two careers – one that can include disruptions from injury – to keep up with the cost of living. Loading Freier admits the stress can take a toll. “The pressure is already there in terms of working, then you go and add an injury or can’t perform in your workplace, and it definitely adds some pressure and takes a toll for most players,” she said. “I think playing in Australia, you really have to love the game. There are a lot of sacrifices.”\n\nHolistic player protection is a paramount focus of the A-League’s new chief medical officer, Dr Sharon Stay. She has sought to ensure every club has access to sideline video surveillance and daily data collection capabilities, to support the juggling act the game’s female athletes endure. “We want every training session, we want gym-based sessions, we want rest day numbers,” Stay said. “If someone’s got gastro on a Tuesday, the problem needs to go in our stats. “These are lives of players we’re managing for 10 to 11 months of the year. There needs to be a little bit more education and key spending on initiatives addressing what the players are exposed to.”\n\nNurturing the next generation Freier’s homecoming has come with a unique experience: being in the elder class of a Roar squad whose average age is 22. Teenage strikers Daisy Brown and Grace Kuilamu have caught Freier’s eye, while Isabela Hoyos (17) and Ruby Cuthbert (18) loom as the future of the club’s defence. With youth comes a challenge in player welfare, with Stay revealing A-League Women’s players experience approximately two to three times more ACL ruptures than men. Stay believes the growing base of teenage prospects has contributed to these figures, with the peak risk of knee ruptures occurring between ages 14 and 17 for women.\n\n“These girls often tend to be the really sporty girls at school, so they play multiple sports. It’s great for body and physical development and athleticism as a whole, but they are often pulled in many different directions,” she said. Matildas star Mary Fowler was among the several Australian women’s players who ruptured her ACL this year. Credit: Getty Images “These kids may not have had the specialised football development we sometimes see if you took a 20-year-old guy, who would have hundreds and thousands more hours of football-specific development.” In calling for careful management of the demands these players faced, Stay admits it is a battle when seasons and careers are on the line. “You can’t expect the same of a 15-year-old that you can from a 25-year-old,” she said.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/this-tech-could-solve-all-of-australia-s-energy-woes-there-s-just-one-teensy-problem-20251220-p5np6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This tech could solve all of Australia’s energy woes. There’s just one teensy problem",
    "publish_date": "Sat, 27 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Liam Mannix"
    ],
    "text": "A nuclear fusion company building a reactor in America says it could have a plant up and running in Australia by the middle of next decade – despite the fact there are no commercial fusion power plants running anywhere in the world.\n\nFusion reactors try to replicate the conditions inside the sun, using extreme heat and powerful magnetic fields to make atoms fuse together, releasing huge amounts of clean energy. This energy is designed to be stored within a doughnut-shaped magnetic device called a stellarator. In theory, they represent the ultimate source of cheap, clean energy. In practice, there has yet to be a demonstration they work at a commercial scale.\n\nType One Energy is building a stellarator testbed in Tennessee, where it has signed a letter of intent with the local energy authority to build a 350MW commercial fusion reactor. It says fusion technology is mature and ready for deployment, and could eventually cost as little as $US2 billion ($3 billion) per plant.\n\nType One Energy says its magnet stellarator will produce clean energy. Credit: Type One Energy\n\nAustralian fusion experts disagree. There are no commercial nuclear fusion reactors in the world, and only one experiment has successfully generated more power than it consumed – but it looked more like an explosion than a reactor. Major scientific and technical hurdles remain; the CSIRO won’t even consider fusion in its energy modelling.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/victoria/motorists-face-growing-delays-due-to-west-gate-bridge-works-20251227-p5nq8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Motorists face growing delays due to West Gate Bridge works",
    "publish_date": "Sat, 27 Dec 2025 12:51:38 +1100",
    "category": "finance",
    "authors": [
      "Angus Delaney"
    ],
    "text": "Melburnians driving over the West Gate Bridge are facing delays of more than an hour due to planned maintenance, and travellers have been urged to consider alternate routes.\n\nAbout 12.45pm on Saturday, delays exceeded 70 minutes for city-bound motorists on the West Gate Freeway and there were 20-minute delays for those heading outbound, as three of the five lanes in both directions were closed, a Transport Victoria spokesperson told 3AW.\n\n“Delays of up to 60 minutes are likely so consider avoiding travel over the bridge,” VicTraffic said in a post on X.\n\nOutbound lanes will reopen at 6pm on Monday, while city-bound lanes will remain closed until 6am on January 4.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/europe/the-cure-guitarist-and-keyboardist-dies-aged-65-20251227-p5nq98.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Cure guitarist and keyboardist dies, aged 65",
    "publish_date": "Sat, 27 Dec 2025 12:38:31 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Levenson"
    ],
    "text": "Perry Bamonte, a guitarist and keyboard player in The Cure, the seminal post-punk band that brought a dark, Gothic sensibility to sparkly, upbeat hits such as Friday I’m in Love, has died. He was 65.\n\nThe Cure announced Bamonte’s death in a statement on its website Friday that said he had died after “a short illness at home over Christmas”.\n\nPerry Bamonte of The Cure performs in 2023. Credit: Getty Images\n\nBamonte was a roadie and guitar tech for the Cure before he joined the band full-time in 1990. The Cure called him “quiet, intense, intuitive, constant and hugely creative,” and a “vital part of the Cure story”.\n\nHe played guitar, six-string bass and keyboards on the albums Wish (1992), Wild Mood Swings (1996), Bloodflowers (2000), Acoustic Hits (2001) and The Cure (2004). Wish included Friday I’m in Love, which spent 20 weeks on the Billboard Hot 100 in 1992 and peaked at No. 18 on August 8 of that year.",
    "source": "SMH",
    "cluster_id": 9
  },
  {
    "url": "https://www.smh.com.au/sport/sailing/sydney-to-hobart-yacht-race-2025-live-mild-conditions-set-for-the-race-as-master-lock-comanche-the-favourite-20251225-p5nq1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney to Hobart Yacht Race 2025 LIVE: Eight yachts retire as Comanche takes lead on day two",
    "publish_date": "Sat, 27 Dec 2025 12:34:10 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe",
      "Billie Eder"
    ],
    "text": "Robert Large has called it “all bad luck” that his yacht Inukshuk was forced to retire from the Sydney to Hobart after becoming entangled in a fishing net.\n\nThe South Australian double-hander was thriving in upwind conditions on Boxing Day when she ground to a halt around 10 nautical miles south-east of the Sydney Heads.\n\nIn the swell, Large and his co-skipper Andrew Ebbott had unknowingly sailed over a well-anchored net that had become caught on Inukshuk’s rudder.\n\nInukshuk caught in a fishing net. Credit: Sailing Inukshuk\n\n“We couldn’t move. It took us probably 45 minutes to clear the thing,” Large said.\n\nAfter finally pulling the net off, Large was concerned his boat may have sustained rudder damage, which would have made it risky to sail the remaining 610 nautical miles.\n\nLarge and Ebbott made the difficult decision to turn back to the Cruising Yacht Club of Australia in Darling Point and retire from the Hobart on the afternoon of Boxing Day.\n\n“I had to put safety ahead of the race,” Large said. “I felt it was more prudent to return rather than continue sailing, where if the rudder failed further down, we could be into some serious problems.”\n\nAn Australian resident for nearly 20 years, Canadian native Large has sailed in six previous Sydney to Hobarts and is experienced with preparing a boat for the race. But no amount of money, spare parts or physical training could have saved Inukshuk from the errant fishing net.\n\n“It’s all bad luck,” Large said. “You prepare for everything, you carry spares which you need to prepare the boat for the seas that you’re going to be getting, we prepare ourselves psychologically and physically to do the race.\n\n“It takes a lot of money and a lot of time, six or eight months of work to get a boat ready, to keep checking everything, re-checking it, training.\n\n“Three hours into the race and having to stop for a reason like that is pretty hard to take.”\n\nLarge and Ebbott are hopeful of sailing Inukshuk in a fifth Hobart next year and are planning to contest the trans-Tasman Yacht Race in late February. Before then, Large will fly down to Hobart, reunite with his wife and join in the post-race festivities.\n\n“We figure we’ve done enough Hobarts we can justify it, we’ve earned a place,” Large said.\n\nInukshuk previously withdrew from the 2021 Hobart after reporting auto-pilot issues.\n\nThe boat’s name is an Inuit word meaning “a structure of rough stones stacked in the form of a human figure”, with such figures traditionally used as a landmark or commemorative sign.\n\nAAP",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/the-drastic-change-cricket-australia-chief-todd-greenberg-is-flagging-on-pitch-preparation-20251227-p5nq8w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Short Tests are bad for business’: How MCG carnage could spark change on pitch preparation",
    "publish_date": "Sat, 27 Dec 2025 12:31:17 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Cricket Australia chief Todd Greenberg says the governing body will consider taking a more direct influence over pitch preparation after the Boxing Day blitz on batters left the sport in danger of another multimillion dollar shortfall.\n\nAs the prospect of a third day in cricket’s marquee match hangs in the balance, CA is becoming increasingly wary of the effect heavily truncated Tests are having on the bottom line and have not ruled out radical change in how pitches are produced.\n\nCA lost about $4 million in revenue from the two-day Test in Perth and, with 90,000 expected at the MCG on Sunday, will likely be hit even harder if the Boxing Day Test does not see a third day.\n\n“Simple phrase I’d use is ‘short Tests are bad for business’,” Greenberg said on SEN on Saturday morning. “I can’t be much more blunt than that.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/key-english-bowler-injured-as-aussie-batsman-bowled-20251227-p5nq94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Key English bowler injured as Aussie batsman bowled",
    "publish_date": "Sat, 27 Dec 2025 11:43:57 +1100",
    "category": "sports",
    "authors": [],
    "text": "Key English bowler injured as Aussie batsman bowled\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/companies/dollar-bill-the-santa-rally-real-or-imagined-20251227-p5nq8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dollar Bill: The Santa rally – real or imagined?",
    "publish_date": "Sat, 27 Dec 2025 09:36:22 +1100",
    "category": "finance",
    "authors": [
      "Bill Mcconnell"
    ],
    "text": "So here’s the uncomfortable truth: some of this nonsense appears to actually work. Not because Jupiter has anything to do with equities or any other market, but because human behaviour and history do. And ironically, charting human behaviour is also the basis of all technical analysis. Markets run on pattern-seeking and historically December is when those patterns hit overdrive.\n\nTraders see signs in charts where no real fundamental support exists. And then, like a self-fulfilling prophecy, markets tend to start behaving as though these signs matter.\n\nBehavioural-finance researchers like Terrance Odean, a professor of finance at UC Berkeley and Brad Barber, his longtime co-author, have produced some of the most seminal works on investor psychology. They have shown repeatedly that retail investors become more optimistic and more active in December and January, even when fundamentals look no different from November or any other month. Their studies link this to mood, new-year reset psychology and a widespread belief – alcohol infused or otherwise - that “things get better after Christmas”. If that’s not financial astrology or some other esoteric nonsense dressed in business attire, Dollar Bill doesn’t know what is.\n\nThe funny thing is, for all the scoffing at astrology and seasonal behaviour, markets have always been a magnet for people who swear they can decode the future from historical patterns with almost zero reference to underlying fundamentals. Entire careers have been built on drawing lines on charts with the kind of conviction usually reserved for religious scholars. Technical analysts insist the potential for every earnings downgrade, drilling miss, tariff shock or anything else that could impact a spreadsheet are already “priced in” by efficient markets providing a rationale for the belief that only the squiggles on charts can guide us. It’s a kind of financial hieroglyphics for the initiated.\n\nThe fundamental analysts that tend to congregate in the cigar bar at the Club, of course, dismiss all of this as not much more than witchcraft. These hardcore analysts prefer balance sheets, capex schedules and long-form reports written in fonts so small they require naval-grade optics. But even the most hardened fundamentalists tend to get a little twitchy in December. Again, it comes down to history, numbers and returns.\n\nThese are the same blokes by the way who spend eleven months of the year preaching discounted cashflows, but all of a sudden start muttering about seasonality, window-dressing and low-volume rallies as though reading tea leaves instead of term sheets now matters. And while these technocrats usually get mocked for their lack of focus on psychology and crowd behaviour, Dollar Bill knows they secretly all believe in it – particularly in December.\n\nTraders look for patterns because patterns make chaos explainable. Algorithms hunt for them because someone told them to. And it’s precisely around Christmas time, when almost everyone - the quant, the boomer, the TikTok disciple - all start behaving like a pattern-seeking market missiles.\n\nAnd curiously, these end-of-year rallies are most prominent when sentiment is at its gloomiest. Research from the American Association of Individual Investors points out that markets grind higher most often when bearish sentiment dominates. A Bank of America global fund-manager survey has produced similar results, showing cash allocations are generally well above long-term averages precisely when indices hit cyclical highs. And now this is repeating again, with global money-market funds swelling beyond US$6 trillion in cash - a record wall of funds demanding allocation in a rally nobody trusts but which keeps reaching higher.\n\nBehavioural economists call this a “disbelief rally”. It’s the markets climbing what the old hands call a wall of worry. Traders mutter darkly about a pending pullback, a correction, inflation prints, bond yields and central-bank missteps - even recessions - but all the while ploughing more money in.\n\nAll of which leaves us with a slightly embarrassing truth: the more we study markets, the more they resemble a vast behavioural experiment disguised as rational finance.\n\nAnd if all of this sounds like the exclusive domain of amateurs and eccentrics, again the history and the data both suggest otherwise. Some of Wall Street’s most decorated traders and analysts have openly flirted with ideas not far removed from what that chap at the club blurted out. W.D. Gann - a doyen of technical analysis and author of Gann Theory whose work is still gospel to modern technicians - actually built an empire using planetary cycles (I kid you not) and seasonal effects as reliable indicators for market trends.\n\nWhich raises the uncomfortable possibility that the line between a seasoned technician and your local clairvoyant is thinner than anyone wants to believe.\n\nIn the end, this may be the real lesson of the silly season. Markets are not driven by Jupiter, Mercury, tarot cards or moonlight. But they are driven by people who sometimes behave as though those things matter – and they almost always behave as they always have.\n\nSo as the year winds down and the screens glow a little greener, Dollar Bill will raise a glass to the technicians, the fundamentalists and even the would-be astrologers.\n\nTo the Santa rally, long may it live and here’s cheers to all, including the disbelievers.\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/man-united-strike-first-against-newcastle-20251227-p5nq8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Man United strike first against Newcastle",
    "publish_date": "Sat, 27 Dec 2025 09:27:18 +1100",
    "category": "sports",
    "authors": [],
    "text": "Man United strike first against Newcastle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/asia/ex-malaysian-prime-minister-guilty-of-money-laundering-abuse-of-power-20251226-p5nq7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ex-Malaysian PM jailed over corruption scandal that hit Hollywood, Wall Street",
    "publish_date": "Sat, 27 Dec 2025 08:31:39 +1100",
    "category": "finance",
    "authors": [
      "Eileen Ng"
    ],
    "text": "Putrajaya, Malaysia: Imprisoned former Malaysian prime minister Najib Razak was sentenced to 15 years in jail and penalised 13.5 billion ringgit ($5 billion) in fines and assets after being convicted in his biggest corruption trial tied to the multibillion-dollar looting of the 1MDB state investment fund.\n\nMalaysia’s High Court found Najib, 72, guilty on four counts of abuse of power and 21 charges of money laundering related to more than $US700 million ($1 billion) channelled into his personal bank accounts from the 1MDB fund.\n\nFormer Malaysian prime minister Najib Razak (centre, facing camera) in October. Credit: AP\n\nJustice Collin Lawrence Sequerah sentenced Najib to 15 years in prison for each charge of abuse of power, and five years for each of the money laundering charges. The sentences are to run concurrently which means the former leader will face another 15 years in prison. The new sentence will run after his current term for an earlier 1MDB case ends, the judge said.\n\nSequerah imposed a total fine of 11.4 billion ringgit for the abuse of power charges. In addition, he also ordered another 2.08 billion ringgit in assets to be recovered from Najib under money laundering laws. If Najib fails to pay, he faces more years in prison.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-december-27-2025-20251226-p5nq6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, December 27, 2025",
    "publish_date": "Sat, 27 Dec 2025 08:19:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "18/30\n\nJenny Dalgleish, a member of the Western Port Green Wedge Protection Group, who alongside other residents oppose a $250 million Hindu temple for up to 10,500 worshippers that has been proposed in Cranbourne South, triggering opposition from environmentalists who fear the Western Port green wedge is being eroded Credit:Simon Schluter",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/aussie-star-limps-off-injured-20251227-p5nq8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie star limps off injured",
    "publish_date": "Sat, 27 Dec 2025 08:13:43 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie star limps off injured\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-developments-and-old-battles-australias-health-year-in-2025/6tepe42lf",
    "title": "New developments and old battles: Australia's health year in 2025",
    "publish_date": "Fri, 26 Dec 2025 20:30:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nCasualty, Grey's Anatomy, New Amsterdam, E-R, House... we all love a medical drama.\n\n\n\n\n\nBut we're not so keen, as a rule, on medical dramas in our own lives.\n\n\n\n\n\nFor a nation still feeling a bit bruised by the aftermath of the COVID pandemic, the news in January that a person in the United States died from H5N1 Bird Flu wasn't exactly comforting.\n\n\n\n\n\nSBS spoke to Michelle Wille, a Senior Research Fellow at the Centre for Pathogen Genomics at the University of Melbourne, to find out whether Australian were in any actual danger.\n\n\n\n\n\nIt turns out Australia is one of the few places in the world where H5N1 is not endemic - but even so, it's wise to take precautions.\n\n\n\n\n\n\"The most recent assessment came out in December. Still suggests that the risk of avian influenza infection to the general public remains low, but it is higher for occupationally exposed workers. Okay, these are people who would infect or interact with infected animals. So for the average person, our risk is quite low. But if you have chickens and they are sick, it's important to get those animals tested and know your risks.\"\n\n\n\n\n\nBut while we seem to be off the hook for bird flu - at least for now - would we be ready for another pandemic, five years after COVID?\n\n\n\n\n\nProfessor Paul Kelly, the man who helped lead Australia's COVID-19 public health response, told SBS he's not so sure.\n\n\n\n\n\nHe worries people may not accept another vaccine program.\n\n\n\n\n\n\"Trust is hard to win and easy to lose. And I think that will be a major issue for us going to the next pandemic. The Australian public was enormously trusting of medical advice and the politicians that were in charge at the national and the state and territory level. I'm not sure that that's the case now.\"\n\n\n\n\n\nAlso in January, the Federal Government unveiled Australia’s first-ever National Autism Strategy—a $42 million plan to improve inclusion, access, and outcomes for Australians with autism.\n\n\n\n\n\nAdvocates are calling it a game-changer, offering hope and much-needed support to families across the country who face unique and daily challenges.\n\n\n\n\n\nMaking the announcement, Minister for Social Services, Amanda Rishworth said communities from migrant backgrounds were identified as a priority cohort, to address unique barriers they face.\n\n\n\n\n\n\"Whether that is through the peer support, whether it is through being very conscious of asking people how they would like to be communicated in different government systems, making sure that we have resources in language is some of the initiatives that we have committed to to make sure there is a priority for linguistically and culturally diverse people.\"\n\n\n\n\n\nWith more than 400,000 Australians identified by the Government as living with dementia, not surprisingly there was interest in a new blood test being trialled in the United Kingdom to detect the early signs of dementia.\n\n\n\n\n\nIn the study at the University of Oxford, blood samples are scanned for a series of proteins – biomarkers, associated with dementia - that can provide early diagnosis.\n\n\n\n\n\nProfessor Kaarin Jane Anstey, from the University of New South Wales, says while medications can assist people in the early stages of dementia, they are not a cure.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/najib-razak-convicted-1mdb/vwrsclib1",
    "title": "Former Malaysian PM Najib Razak jailed for 15 years over 1MDB scandal",
    "publish_date": "Fri, 26 Dec 2025 11:11:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Malaysian prime minister Najib Razak has been jailed for a further 15 years after he was found guilty of abusing his power to plunder millions from the 1MDB sovereign wealth fund and launder the proceeds.\n\n\n\n\n\nThe sentence is in addition to the six-year term he is already serving for a separate case related to the now-defunct state investment vehicle.\n\n\n\n\n\nPresiding Judge Collin Lawrence Sequerah convicted the 72-year-old former leader on all four counts of abuse of power, as well as all 21 counts of money laundering, involving around 2.28 billion ringgit (AU$840 million) from the fund.\n\n\n\n\n\nNajib, dressed in a navy blue suit and white shirt, was seen looking down, slumped in his seat as the judge read the verdict.\n\n\n\n\n\nSentences were handed down of 15 years for each count of power abuse and five years for each money laundering charge, to be served concurrently, after Najib's current jail term ends in 2028.\n\n\n\n\n\nNajib was ordered to pay fines of 11.39 billion ringgit (A$4.2 billion), and the court said 2.08 billion (A$762 million) ringgit in assets must be recovered from him. Failure to deliver on both would result in additional jail time, it said.\n\n\n\nREAD MORE Ex-Malaysian PM Najib Razak sentenced to 12 years in jail after first trial over 1MDB scandal\n\nNajib's lawyer Muhammad Shafee Abdullah said he would appeal the ruling on Monday.\n\n\n\n\n\nIn a statement read by his lawyer, Najib urged Malaysians to remain calm and rational and vowed to continue his fight.\n\n\n\n\n\n\"This struggle is not an effort to avoid responsibility,\" he said. \"It is an endeavour to uphold justice, to uphold the integrity of the constitution, and to defend the sovereignty of the rule of law without fear or favour.\"\n\n\n\n\n\nWhile Najib, the son of one of the country's founding fathers, was groomed for leadership from a young age, he experienced a spectacular fall from power as public anger mounted over the corruption scandal.\n\n\n\n\n\nSince his 2018 election loss, investigations under successive governments have ensnared him and his wife Rosmah Mansor in graft allegations.\n\n\n\n\n\nProsecutors say Najib abused his positions as prime minister, finance minister and 1MDB advisory board chairman to move vast sums from the fund into his personal accounts more than a decade ago.\n\n\n\n\n\nAccording to investigators, proceeds from the fund were used to bankroll high-end real estate, a luxury yacht and precious artworks.\n\n\n\n\n\nDelivering the verdict on Friday morning, Judge Sequerah dismissed several of the defence lawyers' arguments, including that Najib had been duped by his close associate, the shadowy businessman Low Taek Jho, better known as Jho Low. Low denies all wrongdoing and his whereabouts are unknown.\n\n\n\nNajib Razak has been in prison since August 2022. Source: AAP Najib has maintained he was misled by Low and other 1MDB officials into believing that funds deposited into his account were donations from the Saudi royal family.\n\n\n\n\n\nHe has apologised for allowing the 1MDB scandal to happen during his tenure, but has consistently denied wrongdoing, maintaining he knew nothing about illegal transfers from the fund.\n\n\n\n\n\nNajib could face maximum jail terms of between 15 and 20 years on each charge, as well as a fine of up to five times the value of the alleged misappropriations.\n\n\n\n\n\nNajib has been in prison since August 2022, when Malaysia's top court upheld a verdict convicting him of corruption for illegally receiving funds from a 1MDB unit.\n\n\n\n\n\nHis 12-year jail sentence in that case was halved last year by a pardons board.\n\n\n\n\n\nHis legal battle was dealt yet another blow on Monday after he lost a bid to serve the remainder of his current jail term at home rather than the Kajang Prison outside Kuala Lumpur.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/meet-the-canine-seagull-patrol-specialists-protecting-australias-restaurants/ifur69pax",
    "title": "Meet the canine 'seagull patrol' specialists protecting Australia's restaurants",
    "publish_date": "Fri, 26 Dec 2025 09:29:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Meet the canine 'seagull patrol' specialists protecting Australia's restaurants\n\nPublished 26 December 2025, 9:03 am\n\nA unique initiative which trains dogs to protect al-fresco diners from hungry seagulls is taking off. Active in multiple locations across the country, the furry Seagull Patrol is preparing to expand. Tasked with deterring swooping birds at the new Sydney Fish Markets, it is set to open next month. This story was produced in collaboration with SBS Chinese.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/australians-have-taken-advantage-of-this-years-boxing-day-sales-amidst-a-cost-of-living-crisis/bkrh918xd",
    "title": "Australians have taken advantage of this year's Boxing Day sales amidst a cost of living crisis",
    "publish_date": "Fri, 26 Dec 2025 09:16:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians have taken advantage of this year's Boxing Day sales amidst a cost of living crisis\n\nPublished 26 December 2025, 8:01 am\n\nBudget conscious shoppers and those who like a bargain have taken advantage of a Boxing Day tradition: the sales. Consumers are being warned to be on alert for shopping scams, with this year's Boxing Day sales forecast to rise by about 4 per cent.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/holiday-reminder-for-australians-to-check-their-super/yesmo31k7",
    "title": "Have an hour to spare these holidays? It could make a big difference to your retirement",
    "publish_date": "Fri, 26 Dec 2025 04:01:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Finalising your holiday to-do list? It could be worthwhile to spend an hour reviewing your super.\n\n\n\n\n\nThe Association of Superannuation Funds of Australia (ASFA) — the peak body for the superannuation industry — is encouraging Australians to spend an hour checking their super this holiday season, which could see them thousands of dollars better off in retirement.\n\n\n\n\n\n\"Jump online these holidays to check your super is working best for you and that your security settings are up to date,\" ASFA chief executive Mary Delahunty said.\n\n\n\n\n\n\"It takes less than an hour and could make a big difference to your retirement.\"\n\n\n\nHow knowledgeable are Australians about their super?\n\nResearch by the Commonwealth Bank in July highlighted widespread gaps in Australians’ understanding of their super.\n\n\n\nIt found 33 per cent of Australians don’t know their super balance, 11 per cent have never checked it, and 31 per cent don't know how their super is invested.\n\n\n\n\n\nThe report also highlights that women and gen Z are less likely to be aware of how their super is invested.\n\n\n\n\n\nA Finder survey in October revealed that 29 per cent of Australians don't know how their super fund performed over the past 12 months.\n\n\n\nWhat to check on your super account?\n\nASFA recommends Australians start with the basics by ensuring their contact details are up to date, so they don't miss important communications from their fund.\n\n\n\n\n\nIt also suggests reviewing investment and insurance settings, as you could be missing out on potential savings if you're not in the right investment for your age and risk appetite.\n\n\n\nAustralians are also encouraged to check how many super accounts they have through their myGov account and, if they have more than one, consider consolidating into their active fund.\n\n\n\n\n\nA 30-year-old could add as much as $20,000 to their retirement savings in 20 minutes by consolidating three superannuation accounts, including one with higher fees, into a single low-cost fund, according to Delahunty.\n\n\n\n\n\n\n\n\"That's one extra fabulous holiday when you stop working, for less time than it takes to hose the deck for Christmas day,\" she said.\n\n\n\n\n\n\n\nSome people may also be able to boost their retirement savings by maximising concessional contributions, with the cap set at $30,000, including employer contributions, this financial year.\n\n\n\nMost Australians happy with their fund's performance\n\nA recent ASFA survey found 79 per cent of super account holders have a positive or very positive level of satisfaction with their fund’s performance.\n\n\n\n\n\nThe survey of 1,500 Australians found 90 per cent believe super plays an important role in ensuring financial well-being in retirement, while nearly 80 per cent trust their fund to make sound financial decisions.\n\n\n\nREAD MORE How much super will you need? The new figure to retire comfortably\n\n\"These results show that Australians think super really is working for them, and also emphasise the benefits of choice in our super system,\" Delahunty said.\n\n\n\n\n\nHowever, satisfaction levels were lower among people from culturally and linguistically diverse backgrounds.\n\n\n\n\n\n\n\nThose who speak a language other than English at home recorded a 69 per cent satisfaction rate, compared with 81 per cent among people who speak only English.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-boxing-day-sales-increase-in-essential-shopping/ows0vow22",
    "title": "Boxing Day sales: How to get the best bang for your buck — and the scams to watch out for",
    "publish_date": "Fri, 26 Dec 2025 00:54:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians are expected to spend more than $3.1 billion on Boxing Day sales this year, with shoppers being urged to be on the lookout for genuine deals, and avoid scams.\n\n\n\n\n\nTwo in five Australians have made plans to shop during Friday's sales, including 48 per cent of gen Z and 46 per cent of millennials, according to data released by PayPal.\n\n\n\n\n\nBut people are turning away from impulse buying, with 31 per cent of Australians who were surveyed saying they are taking a \"buy better, not more\" approach this year, while 24 per cent say they are now more cautious with big sales events.\n\n\n\n\n\nThe research, conducted by YouGov, also suggested that around 30 per cent of Australians will use the annual sale event to stock up on everyday essentials and groceries with post-Christmas discount offers.\n\n\n\n\n\nDanielle Grant, PayPal's consumer spokesperson, said: \"Australians are becoming far more intentional about how and when they spend, particularly as cost-of-living pressures continue.\"\n\n\n\nREAD MORE The simple Christmas food swaps that'll cut your grocery bill\n\n\"Boxing Day is no longer just about impulse purchases for many households; it's a chance to plan ahead, prioritise essentials and make smarter decisions with their money as they close out the year,\" Grant said in a statement.\n\n\n\n\n\nThe majority of Australians (82 per cent) have also planned to do at least some of their discount shopping virtually, and 59 per cent say they'll do half or more of their Boxing Day shopping online — with most citing convenience as the reason.\n\n\n\nHow to get the most value for your money\n\nComparison site Finder's money expert Rebecca Pike said it's important to prepare before heading to the sales, such as tracking prices ahead of time to spot real discounts, and reading retailer policies to check whether tighter post-sale conditions apply during the festive season.\n\n\n\n\n\nShe said shoppers should also compare final prices across different stores before making the decision, and consider stacking discounts with cashback offers, loyalty points, coupons or other rewards to get the best deal.\n\n\n\nREAD MORE Which supermarket has the cheapest groceries? Choice reveals its latest price check\n\nWhile shopping, people need to avoid getting hooked on buying for eye-catching discounts, Pike warned.\n\n\n\n\n\n\"Stick to a list and have a strict budget in place,\" she said.\n\n\n\nWatch out for the bad actors\n\nAustralian Banking Association CEO Simon Birmingham said Boxing Day sales are \"prime time for shopping scams\".\n\n\n\n\n\n\"Scammers are constantly evolving their tactics, and AI is making it easier for them to mirror legitimate businesses and create fake online stores or advertisements,\" he said.\n\n\n\n\n\n\"Australians need to be doubly careful on social media, where far too many scams emanate from.\"\n\n\n\nBirmingham said banks have been investing in new safeguards to detect and stop dodgy payments, but taking a cautious moment to review purchases remains the \"best form of defence\" against being scammed.\n\n\n\n\n\n\"Double-check you're purchasing from a legitimate website and watch out for text messages about missed deliveries, as this is a common way for scammers to get you to hand over personal or financial details.\"\n\n\n\n\n\n— With additional reporting by Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/nbn-data-reveals-australian-internet-usage-patterns/v9y8vtuqa",
    "title": "Streaming surge reveals how Australia's internet usage is changing",
    "publish_date": "Thu, 25 Dec 2025 20:56:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Streaming video is taking up more of our screen time, working from home still commands the most uploads, and Australia is clawing up the worldwide broadband speed rankings.\n\n\n\n\n\nChildren may be leaving social media but broadband downloads are rising in Australia, and Queenslanders continue to use more data than users in any other state or territory.\n\n\n\n\n\nNBN Co released details about Australia's online behaviour on Friday, also revealing downloads were expected to dip at the end of 2025 but peak again in January.\n\n\n\n\n\nThe findings come after a year of change for internet connections in the nation, with thousands more households offered free speed upgrades and fibre to replace copper technology, as well as growing competition from satellite providers such as Starlink.\n\n\n\n\n\nThe reforms have encouraged more people to stream entertainment, NBN Co chief technology officer Guy Scott said, with the trend now using 48 per cent of all data downloaded from the National Broadband Network (NBN).\n\n\n\nBy 2035, the company predicts streaming video will account for 59 per cent of all NBN downloads.\n\n\n\n\n\nChildren were a major source of streaming demand as downloads were expected to peak during the school holidays, Scott said, even though adults streamed content consistently.\n\n\n\n\n\n\"When the kids are off school, the network tends to get busier — in April, July, September and January, they're all busy times for us,\" he said.\n\n\n\n\n\n\"What doesn't change is the busy hour — the busy hour stays consistently between 9pm and 10pm.\"\n\n\n\nBy contrast, the NBN expected to see a dip in downloads on New Year's Eve, he said, which is when its daily peak demand is lowest.\n\n\n\n\n\nMore than three in four Australian households (76 per cent) use streaming video services, according to Worldpanel ComTech, with Paramount+, Stan Sport and ad-supported subscriptions growing in 2025.\n\n\n\nCommunication platforms driving uploads\n\nIn the other direction, broadband uploads continued to be dominated by communications platforms such as Microsoft Teams and Zoom during 2025, NBN Co reported, accounting for 24 per cent of traffic.\n\n\n\n\n\nUploads over the NBN grew by 12 per cent during 2025, while downloads jumped by 10 per cent to reach an average of 508 gigabytes a month — twice the data downloaded in 2019.\n\n\n\nREAD MORE This is the habit Australians spend 44 hours a week on\n\nQueenslanders downloaded the most data on average for the third year in a row, followed by Western Australia and the ACT, while Tasmanians downloaded the least data.\n\n\n\n\n\nDownload speeds also increased across Australia during 2025, fuelled by the NBN's free speed tier upgrades for 2.7 million users in September and free fibre upgrades for eligible premises from January.\n\n\n\n\n\nAbout 12,000 households were moving to faster and more reliable fibre connections each week, Scott said.\n\n\n\n\n\n\"We absolutely expect to see traffic continuing to grow,\" he said.\n\n\n\n\n\n\"We've built out the fibre network now to 3.5 million premises and we've got another 622,000 premises to build between now and 2030.\"\n\n\n\n\n\nAustralia recently ranked 42nd in Ookla Research's global broadband speed tests — above the United Kingdom for the first time and up from 82nd place in February.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-hidden-workforce-behind-melbournes-tram-seats/68eg3tlqj",
    "title": "The hidden workforce behind Melbourne’s tram seats",
    "publish_date": "Thu, 25 Dec 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen Farah arrived in Australia as a single mother fleeing Iran, she had one certainty - she needed to become financially independent.\n\n\n\n\n\n\"I came to Australia for a better life for my daughter. And because Australia is very safe and very good country for me and daughter.\"\n\n\n\n\n\nMore than a decade later, the sewing skills she learned in Tehran as a teenager are helping her rebuild a life in Melbourne as a sewing instructor … and give the city’s iconic tram seats a second chance.\n\n\n\n\n\n\"The first time, I was scared. No family, no friends and I couldn’t speak English. For me, very difficult because I don’t know how to find the job. Money, very important for life. If you no money, no life.\"\n\n\n\n\n\nA social worker introduced Farah to SisterWorks — where, after completing various English, computer and social skills trainings, she now works alongside 15 other women.\n\n\n\n\n\n\"All Sisters are here, help together, talk together, and lunch together. SisterWorks is like family for me. Me, I'm happy here.\"\n\n\n\n\n\nSisterWorks is a Melbourne-based not-for-profit social enterprise that supports refugee, asylum-seeker or migrant women to achieve economic independence.\n\n\n\n\n\nSisterWorks CEO Ifrin Fittock says for most of these women, the job is a first step into Australia’s workforce.\n\n\n\n\n\n\"Women really are the big fabric of the CALD community here in Australia. They are untapped workforce. They're willing to put their best efforts and want to go into employment, want to grow themselves and want to participate economically and be like you and I, the taxpayers of this country. It’s almost their dream to be able to do so.\"\n\n\n\n\n\nNearly 80 per cent of Melbourne’s tram seats are now reupholstered by women from migrant, refugee and asylum-seeker backgrounds.\n\n\n\n\n\nThe Sisters currently refurbish around 70 seats a month, generating more than 1,500 hours of employment and diverting over 1,200 kgs of waste from landfill over the last financial year.\n\n\n\n\n\n\"A lot of our Sisters are crafty. They are really meticulous in their work. And that's precisely the skills that are needed to maintain, re upholster and refurbish the Yarra Trams seats.\"\n\n\n\n\n\n\n\n\"Little bit hard work but for me, I’m happy because I like sewing.\"\n\n\n\n\n\nYarra Trams Social Procurement Manager, Francesca MacLean, says this partnership is a small shift that speaks to a bigger idea — how public institutions can drive change beyond their core services.\n\n\n\n\n\n\"The rail industry has, historically, not been incredibly accessible to women, let alone migrant, refugee and asylum seeker women. So, we really love that we can use our social procurement approach to disrupt that.\"\n\n\n\n\n\nShe says it’s a way of recognising the skills already present in Melbourne’s multicultural communities, and giving them opportunities to thrive.\n\n\n\n\n\n\"The workforce that SisterWorks has is an incredibly untapped talent pool. They've got the entrepreneurial spirit, the women power. It's our way of demonstrating we can use the taxpayer funds to run the tram network, to deliver value above and beyond dollars. It enables them to be role models within their families and communities.\"\n\n\n\n\n\n\"It's also about self-agency, self-belief and confidence that they are an active participant in this country. They just want to do what you and I do - go to work, save some money, buy a house, buy cars and send the kids to school. And the community will thrive because they have this disposable income that they can spend, that’s how the economy grows.\"\n\n\n\n\n\nIn Melbourne, around three million people use trams every single week.\n\n\n\n\n\nWhen a seat is damaged, it’s removed and assessed, and the ones needing repair are sent to SisterWorks.\n\n\n\n\n\n\"If your child spilled some food on the seat because were getting a bit hangry mid-journey, or someone's water bottle or coffee has been built, this is what causes the wear and tear. Our people then determine whether the seat is up to scratch for our passengers. And when it's not, it gets sent off to Sister Works. They change the fabric or sometimes they change the foam as well.\"\n\n\n\n\n\nAnd the Sisters take comfortable seating seriously.\n\n\n\n\n\n\"The sisters even test if the foam is comfy enough for Yarra Trams passengers. They literally sit on it. I'm not sure if anyone gets a veto, but we have been told by Ifrin that they do sit on it and have a think, ‘Would I be happy to sit on this seat if I were catching a tram?’, which is great, right? It shows the care.\"\n\n\n\n\n\n\"Whenever Melbourne is busy with a lot of events New year, Christmas, school holidays …we tend to get more seats coming to us. It's a livelihood of some of the sisters. And I think the sisters are also very happy to be involved in this project. it's like whenever they're in the tram, they can see that this is actually my work, this is something that I fixed and put back into the tram.\"\n\n\n\n\n\nFor Farah, and the many women working beside her, each stitch is a step toward financial stability and a way to take part in the city they now call home.\n\n\n\n\n\n\"I feel very happy! All the time thinking ‘Oh I made that one, I made that one’.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/ashes-boxing-day-test-live-australia-at-the-crease-again-after-hectic-20-wicket-opening-day-20251227-p5nq8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ashes Boxing Day Test LIVE: Two-day match ‘back on’ after Australia lose 3-6 amid Boxing Day carnage",
    "publish_date": "Sat, 27 Dec 2025 13:06:58 +1100",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "The two-day Test is back on. Australia have lost two wickets in four balls.\n\nUsman Khawaja has holed out second ball at fine leg to the sub fielder Ollie Pope, hooking Josh Tongue.\n\nKhawaja did not seem all that comfortable playing the shot. Tongue’s extra pace was a worry for the veteran.\n\nAustralia have lost five in the morning session, though one includes the No.11 Scott Boland. Cricket Australia chief Todd Greenberg will be uneasy. The prospect of a third day is getting slimmer and slimmer.\n\nMake that six wickets in the session. Alex Carey has nicked off to second slip, and Brydon Carse has wickets in consecutive overs. That’s three wickets in 12 balls.\n\nCarey is out for four – Australia are 6-92, a lead of 134 with Steve Smith and Cameron Green at the wicket.\n\nNormally, you’d say England are well on top, but WinViz still has Australia a 57 per cent chance of winning, and the hosts are still warm favourites with the bookies. Todd Greenberg will be sweating bullets now.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/it-was-a-tough-position-why-matildas-star-had-to-leave-german-juggernaut-20251204-p5nkxm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It was a tough position’: Why Matildas star had to leave German juggernaut",
    "publish_date": "Sat, 27 Dec 2025 13:00:00 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "“To be part of the Asia Cup, everyone wants to do that, but ... I just can’t really put the pressure on myself and see it from that angle,” Freier said. “The Tillies support my decision, but I think I knew it would always be a risk ... I’m trying to use this whole experience as a positive one. “Coming home and playing for the Roar, it’s putting me more in the right direction.” Juggling two lives\n\nAs Freier prepared to return home, her twin sister Laini made a shock decision of her own. Despite earning her maiden Matildas cap, she announced her retirement to focus on other career ambitions and family life. “Laini and I are super close so I know how she felt and was feeling for a while,” Sharn Freier said. Twin sisters Sharn and Laini Freier with their mother. “She had an unreal first professional football season, accomplished a lot in that short time, but I just knew it wasn’t really what she wanted.” “The pressure of needing to be not full-time, but at training for as long as we need to be, and working a full-time gig … she’s happy with what she’s doing now.”\n\nThe average A-League Women’s salary sits around $30,000, and many players essentially juggle two careers – one that can include disruptions from injury – to keep up with the cost of living. Loading Freier admits the stress can take a toll. “The pressure is already there in terms of working, then you go and add an injury or can’t perform in your workplace, and it definitely adds some pressure and takes a toll for most players,” she said. “I think playing in Australia, you really have to love the game. There are a lot of sacrifices.”\n\nHolistic player protection is a paramount focus of the A-League’s new chief medical officer, Dr Sharon Stay. She has sought to ensure every club has access to sideline video surveillance and daily data collection capabilities, to support the juggling act the game’s female athletes endure. “We want every training session, we want gym-based sessions, we want rest day numbers,” Stay said. “If someone’s got gastro on a Tuesday, the problem needs to go in our stats. “These are lives of players we’re managing for 10 to 11 months of the year. There needs to be a little bit more education and key spending on initiatives addressing what the players are exposed to.”\n\nNurturing the next generation Freier’s homecoming has come with a unique experience: being in the elder class of a Roar squad whose average age is 22. Teenage strikers Daisy Brown and Grace Kuilamu have caught Freier’s eye, while Isabela Hoyos (17) and Ruby Cuthbert (18) loom as the future of the club’s defence. With youth comes a challenge in player welfare, with Stay revealing A-League Women’s players experience approximately two to three times more ACL ruptures than men. Stay believes the growing base of teenage prospects has contributed to these figures, with the peak risk of knee ruptures occurring between ages 14 and 17 for women.\n\n“These girls often tend to be the really sporty girls at school, so they play multiple sports. It’s great for body and physical development and athleticism as a whole, but they are often pulled in many different directions,” she said. Matildas star Mary Fowler was among the several Australian women’s players who ruptured her ACL this year. Credit: Getty Images “These kids may not have had the specialised football development we sometimes see if you took a 20-year-old guy, who would have hundreds and thousands more hours of football-specific development.” In calling for careful management of the demands these players faced, Stay admits it is a battle when seasons and careers are on the line. “You can’t expect the same of a 15-year-old that you can from a 25-year-old,” she said.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/this-tech-could-solve-all-of-australia-s-energy-woes-there-s-just-one-teensy-problem-20251220-p5np6z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This tech could solve all of Australia’s energy woes. There’s just one teensy problem",
    "publish_date": "Sat, 27 Dec 2025 13:00:00 +1100",
    "category": "finance",
    "authors": [
      "Liam Mannix"
    ],
    "text": "A nuclear fusion company building a reactor in America says it could have a plant up and running in Australia by the middle of next decade – despite the fact there are no commercial fusion power plants running anywhere in the world.\n\nFusion reactors try to replicate the conditions inside the sun, using extreme heat and powerful magnetic fields to make atoms fuse together, releasing huge amounts of clean energy. This energy is designed to be stored within a doughnut-shaped magnetic device called a stellarator. In theory, they represent the ultimate source of cheap, clean energy. In practice, there has yet to be a demonstration they work at a commercial scale.\n\nType One Energy is building a stellarator testbed in Tennessee, where it has signed a letter of intent with the local energy authority to build a 350MW commercial fusion reactor. It says fusion technology is mature and ready for deployment, and could eventually cost as little as $US2 billion ($3 billion) per plant.\n\nType One Energy says its magnet stellarator will produce clean energy. Credit: Type One Energy\n\nAustralian fusion experts disagree. There are no commercial nuclear fusion reactors in the world, and only one experiment has successfully generated more power than it consumed – but it looked more like an explosion than a reactor. Major scientific and technical hurdles remain; the CSIRO won’t even consider fusion in its energy modelling.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/victoria/motorists-face-growing-delays-due-to-west-gate-bridge-works-20251227-p5nq8y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Motorists face growing delays due to West Gate Bridge works",
    "publish_date": "Sat, 27 Dec 2025 12:51:38 +1100",
    "category": "finance",
    "authors": [
      "Angus Delaney"
    ],
    "text": "Melburnians driving over the West Gate Bridge are facing delays of more than an hour due to planned maintenance, and travellers have been urged to consider alternate routes.\n\nAbout 12.45pm on Saturday, delays exceeded 70 minutes for city-bound motorists on the West Gate Freeway and there were 20-minute delays for those heading outbound, as three of the five lanes in both directions were closed, a Transport Victoria spokesperson told 3AW.\n\n“Delays of up to 60 minutes are likely so consider avoiding travel over the bridge,” VicTraffic said in a post on X.\n\nOutbound lanes will reopen at 6pm on Monday, while city-bound lanes will remain closed until 6am on January 4.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/world/europe/the-cure-guitarist-and-keyboardist-dies-aged-65-20251227-p5nq98.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Cure guitarist and keyboardist dies, aged 65",
    "publish_date": "Sat, 27 Dec 2025 12:38:31 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Levenson"
    ],
    "text": "Perry Bamonte, a guitarist and keyboard player in The Cure, the seminal post-punk band that brought a dark, Gothic sensibility to sparkly, upbeat hits such as Friday I’m in Love, has died. He was 65.\n\nThe Cure announced Bamonte’s death in a statement on its website Friday that said he had died after “a short illness at home over Christmas”.\n\nPerry Bamonte of The Cure performs in 2023. Credit: Getty Images\n\nBamonte was a roadie and guitar tech for the Cure before he joined the band full-time in 1990. The Cure called him “quiet, intense, intuitive, constant and hugely creative,” and a “vital part of the Cure story”.\n\nHe played guitar, six-string bass and keyboards on the albums Wish (1992), Wild Mood Swings (1996), Bloodflowers (2000), Acoustic Hits (2001) and The Cure (2004). Wish included Friday I’m in Love, which spent 20 weeks on the Billboard Hot 100 in 1992 and peaked at No. 18 on August 8 of that year.",
    "source": "TheAge",
    "cluster_id": 9
  },
  {
    "url": "https://www.theage.com.au/sport/sailing/sydney-to-hobart-yacht-race-2025-live-mild-conditions-set-for-the-race-as-master-lock-comanche-the-favourite-20251225-p5nq1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney to Hobart Yacht Race 2025 LIVE: Eight yachts retire as Comanche takes lead on day two",
    "publish_date": "Sat, 27 Dec 2025 12:34:10 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe",
      "Billie Eder"
    ],
    "text": "Robert Large has called it “all bad luck” that his yacht Inukshuk was forced to retire from the Sydney to Hobart after becoming entangled in a fishing net.\n\nThe South Australian double-hander was thriving in upwind conditions on Boxing Day when she ground to a halt around 10 nautical miles south-east of the Sydney Heads.\n\nIn the swell, Large and his co-skipper Andrew Ebbott had unknowingly sailed over a well-anchored net that had become caught on Inukshuk’s rudder.\n\nInukshuk caught in a fishing net. Credit: Sailing Inukshuk\n\n“We couldn’t move. It took us probably 45 minutes to clear the thing,” Large said.\n\nAfter finally pulling the net off, Large was concerned his boat may have sustained rudder damage, which would have made it risky to sail the remaining 610 nautical miles.\n\nLarge and Ebbott made the difficult decision to turn back to the Cruising Yacht Club of Australia in Darling Point and retire from the Hobart on the afternoon of Boxing Day.\n\n“I had to put safety ahead of the race,” Large said. “I felt it was more prudent to return rather than continue sailing, where if the rudder failed further down, we could be into some serious problems.”\n\nAn Australian resident for nearly 20 years, Canadian native Large has sailed in six previous Sydney to Hobarts and is experienced with preparing a boat for the race. But no amount of money, spare parts or physical training could have saved Inukshuk from the errant fishing net.\n\n“It’s all bad luck,” Large said. “You prepare for everything, you carry spares which you need to prepare the boat for the seas that you’re going to be getting, we prepare ourselves psychologically and physically to do the race.\n\n“It takes a lot of money and a lot of time, six or eight months of work to get a boat ready, to keep checking everything, re-checking it, training.\n\n“Three hours into the race and having to stop for a reason like that is pretty hard to take.”\n\nLarge and Ebbott are hopeful of sailing Inukshuk in a fifth Hobart next year and are planning to contest the trans-Tasman Yacht Race in late February. Before then, Large will fly down to Hobart, reunite with his wife and join in the post-race festivities.\n\n“We figure we’ve done enough Hobarts we can justify it, we’ve earned a place,” Large said.\n\nInukshuk previously withdrew from the 2021 Hobart after reporting auto-pilot issues.\n\nThe boat’s name is an Inuit word meaning “a structure of rough stones stacked in the form of a human figure”, with such figures traditionally used as a landmark or commemorative sign.\n\nAAP",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/the-drastic-change-cricket-australia-chief-todd-greenberg-is-flagging-on-pitch-preparation-20251227-p5nq8w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Short Tests are bad for business’: How MCG carnage could spark change on pitch preparation",
    "publish_date": "Sat, 27 Dec 2025 12:31:17 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Cricket Australia chief Todd Greenberg says the governing body will consider taking a more direct influence over pitch preparation after the Boxing Day blitz on batters left the sport in danger of another multimillion dollar shortfall.\n\nAs the prospect of a third day in cricket’s marquee match hangs in the balance, CA is becoming increasingly wary of the effect heavily truncated Tests are having on the bottom line and have not ruled out radical change in how pitches are produced.\n\nCA lost about $4 million in revenue from the two-day Test in Perth and, with 90,000 expected at the MCG on Sunday, will likely be hit even harder if the Boxing Day Test does not see a third day.\n\n“Simple phrase I’d use is ‘short Tests are bad for business’,” Greenberg said on SEN on Saturday morning. “I can’t be much more blunt than that.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/key-english-bowler-injured-as-aussie-batsman-bowled-20251227-p5nq94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Key English bowler injured as Aussie batsman bowled",
    "publish_date": "Sat, 27 Dec 2025 11:43:57 +1100",
    "category": "sports",
    "authors": [],
    "text": "Key English bowler injured as Aussie batsman bowled\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/companies/dollar-bill-the-santa-rally-real-or-imagined-20251227-p5nq8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dollar Bill: The Santa rally – real or imagined?",
    "publish_date": "Sat, 27 Dec 2025 09:36:22 +1100",
    "category": "finance",
    "authors": [
      "Bill Mcconnell"
    ],
    "text": "So here’s the uncomfortable truth: some of this nonsense appears to actually work. Not because Jupiter has anything to do with equities or any other market, but because human behaviour and history do. And ironically, charting human behaviour is also the basis of all technical analysis. Markets run on pattern-seeking and historically December is when those patterns hit overdrive.\n\nTraders see signs in charts where no real fundamental support exists. And then, like a self-fulfilling prophecy, markets tend to start behaving as though these signs matter.\n\nBehavioural-finance researchers like Terrance Odean, a professor of finance at UC Berkeley and Brad Barber, his longtime co-author, have produced some of the most seminal works on investor psychology. They have shown repeatedly that retail investors become more optimistic and more active in December and January, even when fundamentals look no different from November or any other month. Their studies link this to mood, new-year reset psychology and a widespread belief – alcohol infused or otherwise - that “things get better after Christmas”. If that’s not financial astrology or some other esoteric nonsense dressed in business attire, Dollar Bill doesn’t know what is.\n\nThe funny thing is, for all the scoffing at astrology and seasonal behaviour, markets have always been a magnet for people who swear they can decode the future from historical patterns with almost zero reference to underlying fundamentals. Entire careers have been built on drawing lines on charts with the kind of conviction usually reserved for religious scholars. Technical analysts insist the potential for every earnings downgrade, drilling miss, tariff shock or anything else that could impact a spreadsheet are already “priced in” by efficient markets providing a rationale for the belief that only the squiggles on charts can guide us. It’s a kind of financial hieroglyphics for the initiated.\n\nThe fundamental analysts that tend to congregate in the cigar bar at the Club, of course, dismiss all of this as not much more than witchcraft. These hardcore analysts prefer balance sheets, capex schedules and long-form reports written in fonts so small they require naval-grade optics. But even the most hardened fundamentalists tend to get a little twitchy in December. Again, it comes down to history, numbers and returns.\n\nThese are the same blokes by the way who spend eleven months of the year preaching discounted cashflows, but all of a sudden start muttering about seasonality, window-dressing and low-volume rallies as though reading tea leaves instead of term sheets now matters. And while these technocrats usually get mocked for their lack of focus on psychology and crowd behaviour, Dollar Bill knows they secretly all believe in it – particularly in December.\n\nTraders look for patterns because patterns make chaos explainable. Algorithms hunt for them because someone told them to. And it’s precisely around Christmas time, when almost everyone - the quant, the boomer, the TikTok disciple - all start behaving like a pattern-seeking market missiles.\n\nAnd curiously, these end-of-year rallies are most prominent when sentiment is at its gloomiest. Research from the American Association of Individual Investors points out that markets grind higher most often when bearish sentiment dominates. A Bank of America global fund-manager survey has produced similar results, showing cash allocations are generally well above long-term averages precisely when indices hit cyclical highs. And now this is repeating again, with global money-market funds swelling beyond US$6 trillion in cash - a record wall of funds demanding allocation in a rally nobody trusts but which keeps reaching higher.\n\nBehavioural economists call this a “disbelief rally”. It’s the markets climbing what the old hands call a wall of worry. Traders mutter darkly about a pending pullback, a correction, inflation prints, bond yields and central-bank missteps - even recessions - but all the while ploughing more money in.\n\nAll of which leaves us with a slightly embarrassing truth: the more we study markets, the more they resemble a vast behavioural experiment disguised as rational finance.\n\nAnd if all of this sounds like the exclusive domain of amateurs and eccentrics, again the history and the data both suggest otherwise. Some of Wall Street’s most decorated traders and analysts have openly flirted with ideas not far removed from what that chap at the club blurted out. W.D. Gann - a doyen of technical analysis and author of Gann Theory whose work is still gospel to modern technicians - actually built an empire using planetary cycles (I kid you not) and seasonal effects as reliable indicators for market trends.\n\nWhich raises the uncomfortable possibility that the line between a seasoned technician and your local clairvoyant is thinner than anyone wants to believe.\n\nIn the end, this may be the real lesson of the silly season. Markets are not driven by Jupiter, Mercury, tarot cards or moonlight. But they are driven by people who sometimes behave as though those things matter – and they almost always behave as they always have.\n\nSo as the year winds down and the screens glow a little greener, Dollar Bill will raise a glass to the technicians, the fundamentalists and even the would-be astrologers.\n\nTo the Santa rally, long may it live and here’s cheers to all, including the disbelievers.\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/man-united-strike-first-against-newcastle-20251227-p5nq8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Man United strike first against Newcastle",
    "publish_date": "Sat, 27 Dec 2025 09:27:18 +1100",
    "category": "sports",
    "authors": [],
    "text": "Man United strike first against Newcastle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/asia/ex-malaysian-prime-minister-guilty-of-money-laundering-abuse-of-power-20251226-p5nq7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ex-Malaysian PM jailed over corruption scandal that hit Hollywood, Wall Street",
    "publish_date": "Sat, 27 Dec 2025 08:31:39 +1100",
    "category": "finance",
    "authors": [
      "Eileen Ng"
    ],
    "text": "Putrajaya, Malaysia: Imprisoned former Malaysian prime minister Najib Razak was sentenced to 15 years in jail and penalised 13.5 billion ringgit ($5 billion) in fines and assets after being convicted in his biggest corruption trial tied to the multibillion-dollar looting of the 1MDB state investment fund.\n\nMalaysia’s High Court found Najib, 72, guilty on four counts of abuse of power and 21 charges of money laundering related to more than $US700 million ($1 billion) channelled into his personal bank accounts from the 1MDB fund.\n\nFormer Malaysian prime minister Najib Razak (centre, facing camera) in October. Credit: AP\n\nJustice Collin Lawrence Sequerah sentenced Najib to 15 years in prison for each charge of abuse of power, and five years for each of the money laundering charges. The sentences are to run concurrently which means the former leader will face another 15 years in prison. The new sentence will run after his current term for an earlier 1MDB case ends, the judge said.\n\nSequerah imposed a total fine of 11.4 billion ringgit for the abuse of power charges. In addition, he also ordered another 2.08 billion ringgit in assets to be recovered from Najib under money laundering laws. If Najib fails to pay, he faces more years in prison.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-december-27-2025-20251226-p5nq6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, December 27, 2025",
    "publish_date": "Sat, 27 Dec 2025 08:19:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "18/30\n\nJenny Dalgleish, a member of the Western Port Green Wedge Protection Group, who alongside other residents oppose a $250 million Hindu temple for up to 10,500 worshippers that has been proposed in Cranbourne South, triggering opposition from environmentalists who fear the Western Port green wedge is being eroded Credit:Simon Schluter",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/aussie-star-limps-off-injured-20251227-p5nq8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie star limps off injured",
    "publish_date": "Sat, 27 Dec 2025 08:13:43 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie star limps off injured\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  }
]