[
    {
        "url": "https://www.9news.com.au/world/van-gogh-chair-idiot-tourists-sit-on-and-break-delicate-chair-in-italian-museum/3822b719-1eaa-4e76-bc3b-2a42cc28b4a1",
        "title": "Idiot tourists sit on and break 'delicate' Van Gogh chair in Italian museum",
        "publish_date": "Sat, 14 Jun 2025 01:39:05 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "Two tourists have been caught on CCTV sitting on and breaking a \"very delicate\" art piece at an Italian museum.\n\nThe \"Van Gogh\" chair covered in Swarovski crystals, made by artist Nicola Bolla, was displayed in Verona's Palazzo Maffei Museum.\n\nIt was destroyed when a male tourist tried to sit on the chair, breaking it immediately.\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Instagram)\n\nAnother female tourist, appearing to be his partner, stood by taking photos while ﻿the man broke the chair.\n\nThe museum released the video footage of the incident, condemning the actions of the pair.\n\n﻿\"Disrespectful behaviour has put the integrity of a work of art at risk: the 'Van Gogh' chair by the artist Nicola Bolla was damaged by some visitors,\" the museum said on Instagram.\n\n\"[They were] waiting for the security personnel to leave, chose to take a 'spectacular' photo, ignoring every rule of respect for art and cultural heritage.\"\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Nine)\n\nThe chair covered in Swarovski crystals, made by artist Nicola Bolla, was in Verona, Italy's Palazzo Maffei Museum. (Facebook: Palazzo Maffei Verona)\n\nIn another post to Facebook, the museum said they were able to fix the chair after ﻿days of not knowing whether the piece could be saved.\n\n\"We are sharing this episode not only for the record, but to start a real awareness campaign on the value of art and the respect it deserves,\" the post read.\n\n\"A heartfelt thanks goes to the police, our security department and the restorers, whose precious work allowed the work to be recovered.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/sole-survivor-air-india-plane-crash-vishwash-kumar-ramesh-speaks-of-his-survival/70d80693-dbc6-4736-b710-b8dd0862ca04",
        "title": "A miracle in seat 11A: Sole survivor of Air India crash speaks",
        "publish_date": "Sat, 14 Jun 2025 08:56:59 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "It seemed impossible, but shortly after news broke that an Air India flight had crashed in the city of Ahmedabad, video started circulating on social media showing a man walking from the scene in a bloodstained shirt.\n\nThen, it emerged there was one survivor: a British national of Indian origin, identified as Vishwash Kumar Ramesh by the Hindustan Times .\n\n\"Thirty seconds after takeoff, there was a loud noise and then the plane crashed. It all happened so quickly,\" it quoted him as saying in an interview at the hospital where he was being treated.\n\nREAD MORE: The girl who fell 3km from a plane explosion and survived\n\nParts of an Air India plane that crashed on Thursday are seen on top of a building in Ahmedabad, India, Friday, June 13, 2025 (AP Photo/Rafiq Maqbool)\n\nHe said he had been visiting family and was returning to the UK with his brother, who had been sitting in a different row. He didn't know if his brother had survived, he said.\n\nAir India later confirmed that of the 242 people on board the flight, 241 had died, making Ramesh the sole survivor.\n\nHis cousin Ajay Valgi told reporters in Leicester, England, that Ramesh had called his family to tell them he's \"fine,\" adding that they were upset about his brother and all of the others who died.\n\nA doctor told CNN that Ramesh's condition was \"not very critical\" and that he could be released in the next couple of days.\n\n\"He has some blood in the images, but he's not very badly injured. He is very comfortable and under strict observation, no issues,\" said Dr. Rajnish Patel, professor and head of surgery at Ahmedabad Civil Hospital.\n\nIndian news outlets have shared a photo of Ramesh's boarding pass, which indicates that he was in seat 11A of the flight, in the emergency exit row, just in front of the plane's left wing. CNN hasn't independently confirmed the veracity of the photo.\n\nREAD MORE: ﻿ Black box recovered as investigations continue into Air India crash\n\nA doctor said he had examined the sole survivor of the Air India crash, whom he identified as Vishwash Kumar Ramesh. (Supplied)\n\nCNN safety analyst and former US Federal Aviation Administration safety inspector David Soucie expressed surprise that someone seated at that part of the plane would survive such a crash.\n\nThat seat is \"right where the spar of the wing would go under and it would be a solid place for the aircraft to hit the ground, but as far as survivability above it, that is incredibly surprising,\" he told CNN.\n\nRamesh told Indian broadcaster Doordarshan that he escaped through a small space near the door by his seat. He said his hand was burned by the flames as he fled from the aircraft.\n\n\"I don't know how I managed to escape,\" Ramesh said, adding that he saw other passengers die in front of him.\n\n\"For some time, I thought I was also going to die. But when I opened my eyes, I realised I was alive and I tried to unbuckle myself from the seat and escape from where I could,\" he said.\n\nRamesh's survival was described as miraculous by a British member of parliament.\n\n\"It's nothing short of a miracle. I have reached out to the family and I'm choosing to respect their privacy at this trying time. But as you may have picked up … one of his brothers was also on that flight who sadly didn't survive,\" Shivani Raja, member of parliament for Leicester East, told CNN's Max Foster on Thursday.\n\nIndian Home Affairs Minister Amit Shah meeting British plane crash survivor Vishwash Kumar Ramesh. (Indian Ministry of Home Affairs)\n\nPeople inside the BJ Medical College and Hospital hostel were also killed when the plane crashed into it, a senior doctor at the Ahmedabad Civil Hospital, where a majority of the dead and injured people were taken, told CNN.\n\nThe doctor added that t﻿he death toll is likely to rise.\n\nEarlier Thursday, Swapnil Bhalodia of the Indian Medical Association Medical Students Network said at least three medical students had died in the crash and another 30 were injured.\n\nThe plane was headed for London's Gatwick airport and was carrying Indian, British, Canadian and Portuguese nationals.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australian-shoe-brand-wittner-thrown-possible-lifeline-by-the-shoe-group-after-voluntary-administration/953023b8-7396-4dc0-9798-cc511e39d545",
        "title": "Iconic Australian footwear brand thrown lifeline",
        "publish_date": "Fri, 13 Jun 2025 02:39:19 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Australian footwear brand Wittner could have a new owner, two months after the retail brand fell into administration .\n\nAustralian company The Shoe Group has expressed interest in a possible acquisition of Wittner and has entered into a period of exclusivity with the voluntary administrators.\n\nThe Shoe Group's chairman Ian Unwin said the business felt excited about the opportunity to bring Wittner into the group.﻿\n\nWomen's shoe brand Wittner has become the latest retail brand in Australia to collapse. (Supplied)\n\nAustralian company The Shoe Group has expressed interest in a possible acquisition of Wittner. (Facebook)\n\n\"It is a brand with a proud legacy and strong customer following, and we look forward to supporting its continued success,\" Unwin said.\n\nDeloitte Turnaround and Restructuring partner and transaction lead Daniel Demir said the proposed sale would support the continuation of an iconic and much-loved Australian business.\n\n\"The proposed sale represents a major milestone for a more than 100-year-old heritage brand, achieved under an accelerated timeline and in the context of a challenging retail environment,\" Demir said.\n\nThe companies that didn't survive Australia's cost of living crisis in 2024 View Gallery\n\n\"We have worked closely with the Wittner team to maintain trading stability throughout the administration process and are pleased to make today's announcement to secure the future of this iconic Australian brand.\"\n\nVoluntary ﻿administrator David Orr said the proposed sale would deliver a positive outcome for all stakeholders, including employees, creditors, landlords, and concession partners.\n\n\"We thank them for their ongoing support and collaboration during the administration process,\" Orr said.\n\n\"TSG brings deep sector expertise and integrated capabilities across manufacturing and retail, making it well placed to support Wittner's future.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bunnings-warehouse-rolling-out-ev-charges-at-select-stores-across-three-australian-states-and-in-new-zealand/85be9221-cb56-4557-bd6c-e1775a1fa74b",
        "title": "Bunnings Warehouse rolls out new feature in carparks at select stores",
        "publish_date": "Fri, 13 Jun 2025 03:52:12 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "﻿Bunnings Warehouse has rolled out a range of EV chargers in car parks at select stores across Australia.\n\nThe retailer has introduced the chargers to 14 of its stores in Victoria, New South Wales, Western Australia and New Zealand to give EV owners with the opportunity to charge their car while they shop.\n\nThe rollout includes a mix of 22kW, 50kW and 120kW chargers, depending on the site with signage and instructions available to help customers.\n\n﻿Bunnings Warehouse has installed a range of chargers for EV car owners.\n\nA further two EV charging stations will be installed in the coming weeks.\n\nBunnings Warehouse director of stores Rod Caust said the initiative reflected the changing needs of shoppers.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\n\"As electric vehicles become more common in Australia and New Zealand, we're installing EV charging stations in some of our store car parks so our customers with EVs can charge up while they shop,\" Caust said.\n\nEV owners can find stores with EV charging stations through their chosen EV charging station app.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/live-updates-boxing-richardson-hitchins-vs-george-kambosos/105388368",
        "title": "Live: Kambosos fights for world title after Teremoana KO win",
        "publish_date": "Sun, 15 Jun 2025 02:19:25 +0000",
        "category": "sports",
        "authors": [
            "Simon Smale"
        ],
        "text": "Before we talk about the main event, let's have a look at fellow Australian Teremoana Teremoana, who had some late disruption to his plans to fight on the undercard of Jai Opetaia last weekend and, instead flew out to the USA to meet Aleem Whitfield.\n\nHis US debut did not last long, stopping Whitfield in the first round by TKO.\n\nWelcome to the big time, Teremoana.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/archies-creek-hotel-flies-the-flag-for-live-music-and-the-arts/105408734",
        "title": "Country pub is a 'chameleon venue' championing live music and the arts",
        "publish_date": "Sun, 15 Jun 2025 01:48:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "In an unassuming rural hamlet, two hours' drive south-east of Melbourne, a little country pub is growing a big reputation as a popular live music venue in regional Victoria.\n\nNestled between the rustic cliffs of Bass Coast and South Gippsland's dairy farms and green, rolling hills, Archies Creek is a village of 16 houses, a pub, a hall, a telephone booth, a junkyard and an evangelical church.\n\nOutdoor lawn and seating areas around the music stage create a relaxed festival atmosphere. (ABC Gippsland: Rachael Lucas)\n\nHaving run venues for 20 years, most famously the Caravan Music Club in Melbourne, tree-changers Peter Foley, and his partner Mary Howlett moved to Archies Creek six years ago, buying the Archies Creek Hotel.\n\nRedecorating the venue with an intimate cabaret lounge, the once sleepy pub was re-imagined with an inner Melbourne rock'n'roll pub vibe and a touch of laid-back country bohemia.\n\nQuiz nights, poetry readings, life drawing classes and movie nights are held at the pub. (ABC Gippsland: Rachael Lucas)\n\nThe Archies Creek Hotel has since become a pivotal meeting place for locals, frequented by a largely mature crowd seeking nostalgic outings, new cultural experiences and community connections.\n\n\n\n\"It's a different kind of venue, there's just an energy about the place,\" publican Peter Foley said.\n\n\"It's an opportunity for people to gather and celebrate music and community.\"\n\nAn outdoor stage built during the COVID pandemic enabled the hotel to host large concerts during summer. (ABC Gippsland: Rachael Lucas)\n\n\" Everybody wants to play here, local and even international musicians love playing here because it's a little trip to somewhere else. \"\n\nWith a mailing list of 18,000, the Archies Creek Hotel runs movies every Thursday night, live music from Friday to Sunday as well as comedy and quiz nights, choral singing, life-drawing classes, spoken word and poetry readings.\n\n\"This venue can be anything — it's a chameleon venue, because it's outdoors, it's a bit rustic, it's a bit odd, and it works with any type of music and it's in the middle of nowhere, but it still works,\" Mr Foley said.\n\nGreg Walker of Machine Translations performing at Archies Creek. (ABC Gippsland: Rachael Lucas)\n\nA mix of old and new\n\nVeteran radio broadcaster, semi-professional musician and civil celebrant Jon Von Goes moved to Archies Creek as part of Peter and Mary's campaign to re-populate the town with \"music types\".\n\nJon Von Goes and partner Celia Church host quiz nights at the pub and perform as duo Jonnie goes to Church. (ABC Gippsland: Rachael Lucas)\n\nLiving within stumbling distance of the pub, he has since become the unofficial \"captain\" of the Archies Creek Arts Council that curates a calendar of music and arts events to keep the pub and district parishioners entertained.\n\n\n\nRecent set lists have included The Models, Weddings Parties Anything and You Am I.\n\nMr Von Goes says people are still buying merchandise at gigs such as vinyl records and tea towels. (ABC Gippsland: Rachael Lucas)\n\n\"The most popular gigs are the people who had hits in the 70s, Ross Wilson, Jo Camilleri and James Reyne,\" Mr Von Goes said.\n\n\"They're great gigs because they're established professionals who are great show people,\" he said, recalling a visit by some retired Phillip Island surfers who hugged and cried through a performance of Girls on the Avenue, when Richard Clapton recently played.\n\n\" People come to remember their golden years, when they were falling in love for the first time. \"\n\nNostalgia is a pull factor for music lovers. (ABC Gippsland: Rachael Lucas)\n\nKeeping the show going\n\nDespite the altruistic intentions of owner Peter Foley and the local community's strong appetite for music and arts, balancing the books remains an ongoing struggle with ever increasing costs, including an annual $45,000 insurance bill.\n\nWith the hotel almost hitting financial breaking point last year, Mr Foley turned to the public for help, calling out for subscribers to pay a $30 annual membership fee, in exchange for priority access to tickets and member discounts.\n\nArchies Creek Hotel held 60 events over the summer. (ABC Gippsland: Rachael Lucas )\n\n\"Rather than seeking government support, we've gone to the community, and we've had an incredible response because people love the place and they wanted to support it, because there's a bit of a cultural vacuum down here,\" Mr Foley said.\n\n\"As soon as we put it out there that we were seeking community support, it came in abundance — we've had 1,041 people join up so far.\"\n\nHe believes the community subscription model is a much more direct and efficient means of generating funds than applying for grants, and could be applied to venues facing similar challenges across Australia.\n\n\"I actually think it's a viable model for sustaining a venue, if younger people really took possession of it,\" Mr Foley said.\n\nCommunity subscribers pay an annual membership fee, keeping the venue's doors open. (ABC Gippsland: Rachael Lucas)\n\nWith three residences on the property, the venue also offers space for songwriter retreats and rehearsal camps.\n\n\"It's a business, but it's a community business, it's not like there is an emphasis on just being a pub — there has always been a vibe and a community — we're in the happiness business,\" Mr Foley said.\n\nThe Archies Creek Hotel is decorated with vintage album covers and bill posters. (ABC Gippsland: Rachael Lucas)\n\nNow in his mid-60s, and getting beyond the late nights of the \"hospo grind\", the relentless physical work of running a bar and the 7am trips to the tip to recycle countless empty bottles, Mr Foley is looking for someone to run the bar and kitchen or a new owner to take gradual possession of the venue over time.\n\n\"I still love the place and I want it to keep going and I'm happy to guide anybody who has got any energy to deal with the physical work,\" he said.\n\nMr Foley has transformed the Archies Creek Hotel into a thriving music venue in the space of six years. (ABC Gippsland: Rachael Lucas)\n\n\"It's not a business that you can make a lot of money out of, but you make enough to survive.\n\n\"We have a holiday every year and we have a lot of fun — it depends what you define as success really.\n\n\"It feels like you're doing something decent and worthwhile, but if it was just about the money, you wouldn't do it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/backyard-garden-cowaramup-becomes-unofficial-attraction/105400022",
        "title": "Gardener sees funny side of strangers walking through her property",
        "publish_date": "Sun, 15 Jun 2025 00:59:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "It isn't unusual for Helen Earl to find strangers wandering through her backyard and admiring her garden that is so well-stocked people can't believe it isn't community-run.\n\nHer little slice of heaven in WA's South West is bringing the community together and even attracting the occasional tourist who strays off the main street of Cowaramup.\n\nIt all began after Ms Earl planted the first seeds during the COVID-19 pandemic.\n\n\"I set it up four and a half years ago, when COVID first started, to grow our food because nobody knew what the times were going to be like,\" she said.\n\n\"Also our grandchildren were very little and it was a good way to show them where our food came from.\n\n\" [Now] it's taken over my life … if I can't sleep at night then I'm planning the next project. \"\n\nLoading...\n\nIt was a time when many Australians started gardening and the sale of herbs and vegetables shot up around the country.\n\nSeveral years on, Ms Earl's garden is in full-bloom.\n\nShe said it now contained everything from rhubarb to peanuts.\n\n\"I think the only thing that I haven't got is celeriac,\" she said.\n\n\"I have everything in there. I just like growing things.\"\n\nThere's always a vegetable or fruit ready to be picked. (ABC South West WA: Dominique Bayens)\n\n'As long as they enjoyed it'\n\nMs Earl's garden is so impressive, it often attracts the attention of passers-by including international tourists exploring WA's premier wine region.\n\nShe said sometimes she invited people in but other times strangers wandered through unaware they had stumbled onto private property.\n\n\"They … find me there and say, 'What a lovely community garden' and then I have to tell them it's actually my garden. Some people are quite surprised,\" she said.\n\nMs Earl says the garden produces enough food to keep her pantry full and her chickens fed. (ABC South West WA: Dominique Bayens)\n\n\"They pick and have a look and have their kids in there … it can be quite funny sometimes.\n\n\"When I'm not here and somebody is doing something in my garden they'll say, 'These people came through and these people came through'.\n\n\"I'll say, 'Oh well, I don't know who they are but as long as they enjoyed it.'\n\n\"I don't mind people having a look.\"\n\nAny leftover produce will be pickled or given away. (ABC South West WA: Dominique Bayens)\n\n'Superwoman' of the veggie patch\n\nTrevor Paddenburg, who runs an Edible Garden festival in the region, said he had knocked on Ms Earl's door after noticing her \"conspicuous\" garden.\n\n\"It's like having a verge garden but on steroids because it is so open and Helen is so welcoming,\" he said.\n\n\" I would call her a superwoman when it comes to growing food, she's got so much experience and so much wisdom. \"\n\nTrevor Paddenburg says Ms Earl's garden is a great example of how to grow food on a suburban block. (Supplied: Trevor Paddenburg)\n\nAfter inviting the keen green thumb to showcase her garden in the festival, he said it was \"a hit\" with punters.\n\n\"It's an incredible thing that people can just see what she is up to and that she is so willing to share,\" Mr Paddenburg said.\n\n\"The more we can inspire people to grow things and be more sustainable, the better.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/us-open-adam-scott-eyeing-second-major-after-big-move-day-three/105418500",
        "title": "Scott eyeing second major after big move on day three of US Open",
        "publish_date": "Sun, 15 Jun 2025 00:54:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Adam Scott is firmly in the mix to claim an elusive second major championship after finishing a brilliant US Open third round just one shot off the lead.\n\nA composed Scott rebounded from a first-hole bogey with four birdies, including three on the back nine, in a stylish Saturday 3-under-par 67 at the fearsome Oakmont Country Club.\n\nUS Open 54 hole scores (selected) 1: Sam Burns (USA) - 4-under\n\nT2: Adam Scott (AUS) - 3-under\n\nT2: JJ Spaun (USA) - 3-under\n\n4: Viktor Hovland (NOR) - 1-under\n\n5: Carlos Ortiz (MEX) - Level par\n\nT11: Marc Leishman (US) - 4-over\n\nT21: Jason Day (AUS) - 5-over\n\n67: Cam Davis (AUS) - 19-over\n\nAustralia's former world number one is only the third player in US Open history to start with three rounds of 70 or better at the tournament's most demanding layout.\n\nCurtis Strange achieved the feat in 1994 before Shane Lowry matched the record eight years ago.\n\nScott's 70-70-67 start leaves the 2013 Masters champion just one stroke behind American leader Sam Burns, who carded a 1-under 69.\n\nFellow American JJ Spaun bogeyed the last hole in a round of 70 to join Scott at 3-under.\n\nFor much of the day, Scott hovered at even par before exploding with three birdies in the last six holes on 13, 14 and 17.\n\nAt 44, Scott is bidding to become the second-oldest US Open winner of all time.\n\nVictory would also place the Australian in the history books for the longest wait by a player between their first and second major championship triumph, after his previous win at the 2013 Masters.\n\nAnd he has experience on his side, with Scott the only major winner sitting inside the top 10 entering Sunday's final round (Monday AEST).\n\nContesting an extraordinary 96th consecutive major, Scott three-putted the opening hole in a deflating start.\n\nBut the veteran put the hiccup behind him to collect his first birdie of the day at the par-5 fourth hole.\n\nThen he hit the go button down the stretch to be well-poised to break a five-year winless run since taking out a tournament in the Los Angeles Open in 2020.\n\nScott could have gone even better in round three, with a couple of birdie putts sliding just by.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNorwegian Victor Hovland is outright fourth at 1-under after also shooting 70.\n\nThe quartet are the only players in red numbers.\n\nPlaying his first major since 2022, Monday qualifier Marc Leishman rocketed up the leaderboard with a birdie-filled round of 68 to be tied for 11th.\n\nBut the revitalised Australian looks a little too far back at 4-over and eight shots adrift of Burns, as is world number one Scottie Scheffler who could only manage an even-par third round after a wretched day on the greens.\n\nJason Day (72) is one shot further back in equal 21st.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/a-small-team-from-perth-represents-aus-on-world-skiffie-stage/105357726",
        "title": "Meet the Perth rowers reviving a traditional sport, helped by John Longley",
        "publish_date": "Sun, 15 Jun 2025 00:22:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "As dawn breaks in Perth, a small group of rowers launch their boats into the Swan River at the Royal Freshwater Bay Yacht Club.\n\nThese aren't typical competitive rowing boats. They are 155 kilogram wooden, hand-built coastal rowing boats called St Ayle's skiffs, also known as skiffies.\n\nThey can be traced back to the 19th century mining communities of the famous Scottish town of Fife.\n\nAnd the rowers aren't your run-of-the-mill athletes — they are Australia's representatives at the World Championships taking part on Scotland's south-west coast in July.\n\nRowing brings a smile to Endersby's face. (ABC News: Tom Wildie)\n\n\"We're now taking 16 rowers over to to Scotland. We are all over 50 and the age range goes up to 79,\" said Mark Endersby, the club's skiff race director.\n\n\"This is male, female and mixed. So we've entered teams, crews, for the over 40s, over 50s, over 60s and the 280.\n\nThe atheltes will compete in several categories in July. (ABC News: Tom Wildie)\n\n\"280 is the age group. The combined age of the rowers, so an average age of 70.\"\n\nThe decision to compete at the World Championships happened over a cup of coffee after a row one morning, but if it weren't for a chance encounter a decade ago, and the influence of a famous figure in Australian sailing, the club may never have ventured into the sport.\n\nFrom Australia II to a rowing boat\n\nJohn Longley is a huge figure in the sailing world, courtesy of his crucial role in Australia II winning the 1983 America's Cup.\n\nHe was the campaign's project manager, a crew member, and was instrumental in developing the teams strategy that ultimately led to the famous victory.\n\nThe crew of America's Cup yacht Australia II cheer. (Larry Moran, Chicago)\n\nBut long after his success on the global stage, Longley can add the wide adoption of skiffs to his list of achievements.\n\n\"I'd gone to the Australian Wooden Boat Festival in Hobart in 2013 and while I was there, I literally stumbled across one of these boats that was partly under construction,\" he said.\n\n\"I was very taken with it and I realised that the way the whole thing worked was that these boats were built by community for community.\n\nLongley has spent much of his life on the water. (ABC News: Tom Wildie)\n\n\"I thought, you know what, this would be something that could really work at Royal Freshwater Bay Yacht Club.\"\n\nHis initial suggestion was met with resistance.\n\n\"There was a little bit of a 'well, you know, John, we're a sailing club',\" Longley recalled.\n\n\"I pointed out that in the early days of the club, there were more rowing races than there were yacht races and the the club very quickly I thought it was a good idea, and adopted it.\"\n\nThe adoption of skiffs — small boats typically propelled by oars — has grown across Western Australia, and boats are built across the South West.\n\nCommunity built and owned\n\nThe modern incarnation of skiff racing began in 2009, as a way of encouraging coastal Scottish communities to re-engage with the ocean.\n\nTo take part, clubs purchase a marine plywood kit to build the boats, which must be done by hand.\n\nSkiffies are keeping Scottish boat-making tradition alive. (ABC News: Tom Wildie)\n\nThe boats are more than six metres long, have fixed seats, and the oars must be wooden.\n\nThe Royal Freshwater club has three boats, but won't be taking them to Scotland. They'll be supplied boats for the event.\n\nWhile skiff racing has become a passion for the rowers, its impact goes beyond just getting on the water and keeping fit.\n\nCommunity is a huge focus for some of the rowers. (ABC News: Tom Wildie)\n\nEndersby arrived in Australia from England in 2023, and as a new migrant, knew just one person in Perth.\n\n\"I was suffering from some mental health issues,\" he said of his decision to move across the world following the COVID pandemic.\n\n\"It had been a really tough period for everybody, not just myself, and I had the opportunity with the kids going off to university and I thought I needed to look after myself.\n\n\"I go back to when I first arrived here, and you can be quite lonely in places and that's a common feature of mental health issues.\"\n\nThe boats weigh more than 100kg. (ABC News: Tom Wildie)\n\nThe person he knew invited him to the Royal Freshwater club to get out on the water.\n\nHe gave it a go, and was drawn to more than the physical aspect of rowing.\n\n\"If I hadn't have got involved with the skiffs, I'd be a loner in Perth,\" Endersby said.\n\n\"It's created the community for me, and that community has has grown and grown and grown.\"\n\nThe team is also using the World Championships to raise money for the mental health not-for-profit Youth Focus through its Row for Youth initiative.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/piastri-third-as-old-foes-russell-verstappen-front-row-canada/105418406",
        "title": "Piastri third, with old foes Russell and Verstappen on front row in Canada",
        "publish_date": "Sat, 14 Jun 2025 23:36:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "George Russell has put his Mercedes on pole position in Canada for the second year in a row, with Formula One champion Max Verstappen alongside for Red Bull two weeks after they clashed in Spain.\n\nMcLaren's Formula One championship leader Oscar Piastri qualified third, with Mercedes rookie Kimi Antonelli in fourth place.\n\nLando Norris, Piastri's British teammate and closest title rival only 10 points behind the Australian after nine of 24 rounds, qualified seventh at Montreal's Circuit Gilles Villeneuve.\n\nThe clash between Russell and Verstappen in Spain remained a talking point going into the weekend, with the Red Bull driver on the brink of a ban as he chases an unprecedented fourth successive Canadian victory.\n\nVerstappen, 0.160 slower than the pole time, is only a penalty point away from suspension and Russell will try to turn that to his advantage on the short run down to turn one from the start.\n\n\"Today was awesome. That last lap was probably one of the most exhilarating laps of my life,\" said the Briton, adding a cheeky comment on Verstappen's situation.\n\n\"I've got a few more points on my licence to play with. Let's see.\"\n\nVerstappen had no complaints about his grid position.\n\n\"I'm already very happy with what we achieved today, to be on the front row. Hopefully, tomorrow we can have a solid race,\" he said.\n\nFerrari's seven-times world champion Lewis Hamilton qualified fifth, at the circuit where he took his first win in 2007 with McLaren. Aston Martin's Fernando Alonso was sixth and Ferrari's Charles Leclerc eighth.\n\nRacing Bulls' Isack Hadjar starts ninth and Williams's Alex Albon 10th.\n\nVerstappen's teammate Yuki Tsunoda missed out on the final shootout in 11th place and will start last after collecting a 10-place grid drop for a red flag breach in Saturday's final practice.\n\nThat will lift Alpine's Argentine Franco Colapinto to 11th, with his teammate Pierre Gasly alongside Tsunoda on the back row.\n\nF1 ban hovers over Max as he loses grip of his world championship crown Photo shows Max Verstappen wiping his face with a towel after a qualifying session, facing another driver Formula 1 is back in North America for round 10 of the championship, with Oscar Piastri leading the standings and the defending world champion facing a suspension. Here is everything you need to know about the 2025 Formula 1 Canadian Grand Prix.\n\nNorris was fastest in the first phase, with Piastri second, after a brief red flag delay triggered by Albon's car shedding its engine cover and leaving debris on the track.\n\nWhile Albon progressed, teammate Carlos Sainz was left in 17th place — but will move up to 16th — and fuming at what he said was \"massive impeding\" by Hadjar.\n\nStewards said they would investigate.\n\n\"Hadjar I'm sure will receive a penalty,\" Williams team boss James Vowles told Sky Sports television, with a three-place drop looking likely.\n\nPiastri briefly led the way late in qualifying, but his time was 0.221 seconds behind Russell and 0.61 behind Verstappen.\n\nCanada's only active F1 driver Lance Stroll, who missed the previous race in Spain due to hand and wrist pain, also failed to get over the first hurdle at his home grand prix and will start 17th for Aston Martin.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/injury-points-finger-of-doubt-at-smiths-windies-tour/105418340",
        "title": "Finger injury leaves Smith in doubt for West Indies Test",
        "publish_date": "Sat, 14 Jun 2025 22:23:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Star batter Steve Smith has avoided surgery after suffering a \"gruesome\" compound dislocation but is almost certain to miss Australia's first Test against the West Indies.\n\nSmith's availability for the upcoming three-match series in the Caribbean, starting in Barbados on June 25, remains in major doubt.\n\n\"I'd say first Test maybe unlikely, and then go from there, but it's bit early just to tell,\" Australia captain Pat Cummins said after the shock World Test Championship final loss against South Africa on Saturday.\n\nIn a major blow for Australia, Smith hurt his right little finger in a crucial moment of the Lord's decider on Friday.\n\nWearing a helmet in the slip cordon, Smith was standing far closer to the stumps than normal when he dropped Proteas captain Temba Bavuma on just two.\n\nEdges regularly dropped short of fielders during the Test, but this one flew towards Smith and he was unable to hang on to it.\n\nHe immediately left the field in immense pain after spilling the catch that would have put Australia in the box seat to claim back-to-back WTC titles.\n\nSmith didn't field on Saturday as South Africa pulled off a landmark upset.\n\nProteas ditch chokers tag Photo shows South Africa captain Temba Bavuma holds the mace trophy aloft as he walks around Lord's after the World Test Championship final. Across four days at Lord's, Temba Bavuma's team shows history, both distant and recent, can be overcome by a group brimming with talent and resilience.\n\nThe 36-year-old left hospital to return to the team hotel on Friday night and was back at Lord's on Saturday watching on.\n\nHis finger was washed and disinfected at hospital, and later placed in a splint.\n\nThe wound should heal in two weeks, and he will be able to play if he can tolerate wearing a splint while batting.\n\nSmith will be required to keep his finger in a splint for up to eight weeks.\n\nA compound dislocation involves bone piercing the skin, which could mean Smith needs surgery and a long rehabilitation.\n\nOne of the greatest red-ball batters of all time, Smith's possible absence will be a major blow after he scored four centuries in his past six Tests in a stunning late-career resurgence.\n\nBut Smith's misfortune could give out-of-form teammate Marnus Labuschagne a reprieve.\n\nThe 30-year-old Labuschagne averaged less than 30 in this WTC cycle over the past two years, with his last century coming back in July 2023.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nA long-term number three, Labuschagne moved up to open for the first time in his Test career for this match.\n\nBut the promotion failed to snap him out of his lean spell, making 17 and 22.\n\nTeenage tyro Sam Konstas, who announced himself last Boxing Day, is set to be given an opportunity as opener for Australia's first tour of the Caribbean in 10 years.\n\nIf Smith can't play, Konstas could slot back in to open with Usman Khawaja, while Labuschagne would likely drop down to number three.\n\nBut even Khawaja, who turns 39 this year, is under pressure to keep his Test career going after scores of 0 and 7 in this Test.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/rodda-museum-specimens-investigation/105395816",
        "title": "Families' trauma over loved ones' remains being retained without consent",
        "publish_date": "Sat, 14 Jun 2025 22:18:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "It is a night Hobart father Alby* will never forget.\n\n\"My daughter passed away at the Royal Hobart Hospital on boxing day 40 years and five months ago at around 7.50pm.\"\n\nHe said he had been hit by a second wave of grief after finding out his daughter, who was two years old when she died, may have had specimens taken from her body during a coronial autopsy without the family's knowledge and stored in a pathology museum.\n\nAlby regularly visits his daughter's grave in southern Tasmania.\n\n\"I came down here [to the grave] through the week and apologised to my daughter for what's happened,\" he said.\n\nAlby's daughter was two years old when she died at the Royal Hobart Hospital 40 years ago. (ABC News: Luke Bowden)\n\nThe Tasmanian Coroner's Office announced in April last year that specimens had potentially been given to the R. A. Rodda Pathology Museum at the University of Tasmania without consent for 30 years.\n\nIf you or anyone you know needs help: Lifeline on 13 11 14\n\nAboriginal & Torres Strait Islander crisis support line 13YARN on 13 92 76\n\nBeyond Blue on 1300 224 636\n\nHeadspace on 1800 650 890\n\nReachOut at au.reachout.com\n\nThe museum first raised concerns with the Coroner's Office in 2016.\n\nThe Coroner's Office said initial records indicated the collection of specimens started in 1953, stopped in 1985, and related to 147 people.\n\nThe office was able to identify some next of kin, but in January published a list of 126 names in newspaper advertisements and asked anyone related to any of the people named to contact the Coroner's Office.\n\nThe advertisement did not include any information about how affected family members could access support.\n\nAt the time, independent MLC Meg Webb criticised the office for its \"blunt\" handling of sensitive information.\n\nAfter Ms Webb's concerns were raised, the webpage was updated to include the form families are asked to submit to provide information, details of support services, and information sheets to help people cope with grief and loss.\n\nThe R. A. Rodda Museum of Pathology is part of the University of Tasmania's medical school. (ABC News: Luke Bowden)\n\n'I'm going to go through it all again'\n\nAlby has been in contact with the Coroner's Office about his daughter, but is yet to find out what specimens may have been retained from her body.\n\nHe has been offered a phone call and has been advised to have a friend or family member with him when he receives that call.\n\n\"I've put it off … It's going to be more distressing to do that, to relive those memories from 40 years and five months ago,\" he said.\n\nAlby says he is yet to find out more information about his daughter's case. (ABC News: Luke Bowden)\n\n\"I'm going to go through it all again.\"\n\nAlby described the communication from the Coroner's Office to him as \"heartless\", and said a phone call was not enough.\n\n\"If they could just sit down and just feel the pain that we're feeling,\" he said.\n\n\"Then they'd probably understand what it's like, just to see the faces and see the health effects it's going to have on people for many years.\"\n\n'We need to have some questions answered'\n\nMs Webb said it had been sad to see how the situation had affected many Tasmanian families.\n\nTasmanian Coroner's Office criticised over name release Photo shows a young man with long hair in a washed out photo John's brother Tony died in a motorcycle accident in the 1970s. But he's just discovered that parts of his brother's body may have been collected and stored in a museum after his autopsy, without the consent of family.\n\n\"It's come as a real shock … and it's really brought up a lot of trauma for many families,\" she said.\n\n\"This is a highly unusual situation and it's come out of the blue.\n\n\"It really required incredibly sensitive communication with the families involved, and what we've seen is that some families have not felt that that communication has been as sensitive as it needed to be, and I think there's a lot to learn from this circumstance so we don't see this repeated.\"\n\nMeg Webb says there are many questions that need to be answered. (ABC News: Maren Preuss)\n\nMs Webb said while the Coroner's Office was investigating how the remains came to be in the R. A. Rodda Museum's collection, further questions needed to be answered.\n\nShe also said there should be some form of public reporting with clear recommendations.\n\n\"We need to have some questions answered about how this happened, who was responsible and who should have had oversight over these circumstances.\n\n\"We need to be really honest about whether any laws were broken or standards were breached in this, and we need people to understand how these lessons will be learned so that Tasmanian families aren't placed in those circumstances ever again,\" she said.\n\nThe Coroner's Office says it is continuing to manage \"a number of inquiries\" as the investigation continues. (ABC News: Luke Bowden)\n\nCoroner's finding 'anticipated' later this year\n\nInvestigating coroner, Simon Cooper, said there was no known precedent in Tasmania of a notification to the Coroner's Office of this size.\n\n\"It has been and remains a significant task for the Coronial Division, whose staff have worked diligently and efficiently to progress the matter,\" Mr Cooper said.\n\n\"I wish to emphasise that, until they were reported, the existence of the remains were not known by present or previous coroners or staff of the Coroner's Office.\n\nSimon Cooper says no coroner directed the remains be used as medical museum specimens. (ABC News: Luke Bowden)\n\nLoading...\n\n\"Their removal at autopsy to be used as medical museum specimens were not at any direction or order of a coroner.\"\n\nMr Cooper said he recognised \"that the discovery of these specimens has been a difficult and painful experience for many\".\n\n\"The coroners and the staff of the Coronial Division work extremely hard to ensure coronial processes are properly, patiently and sensitively applied to this historical situation, whilst performing the required functions under the Coroners Act 1995.\n\n\"I anticipate publishing further information, in the form of a finding under the Coroners Act 1995 within the next few months, when all investigations are complete.\"\n\nA spokesperson for the Coroner's Office said the office continued to manage \"a number of inquiries\" as the investigation continues, and that counselling support was being offered to family members who have come forward.\n\nSlices of body parts in R.A. Rodda Pathology Museum in the University of Tasmania School of Medicine clinical building in Collins Street, Hobart. Date unknown. (Supplied: UTAS)\n\nEvolution of ethical standards\n\nHealth ethics and professionalism professor at Deakin School of Medicine Dominique Martin said ethical principals, standards and expectations in clinical medical practice — including the importance of consent — had evolved over the past century.\n\n\"But that's taken us several decades to get to, and if we look then at the removal of body parts … during life or after death, I think that's probably been a few decades behind that,\" Dr Martin said.\n\nDominique Martin says consent and consultation is important. (Supplied)\n\nShe said that until \"very recently\", and not just in Australia, there had been examples of body parts either being removed with permission or knowledge but retained and used for purposes without there having been any consultation with the patient, or, in the case of a death, the patient's family.\n\n\"That's, I think, been for a very long time considered normal in medicine and in scientific research.\"\n\nDr Martin said while there had been a \"big change\", it had been relatively recent.\n\n\"I suspect we're not done with finding out things that have happened in the recent past that we nowadays would be quite concerned about,\" she said.\n\n\"What matters is that they [patients or their families] have a choice in it, that they have control over that, and usually they have some knowledge of how things will be treated.\n\n\" And I think it matters, particularly from an ethical perspective because it speaks to how we think about and how we treat living people. \"\n\n*Name has been changed",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/act-menslink-tribe-program-guiding-young-men-journey-manhood/105417002",
        "title": "Confidential sessions challenging 'toxic' masculinity in teen boys",
        "publish_date": "Sat, 14 Jun 2025 22:17:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a group of boys circle up in a Canberra schoolyard, nervous teachers have questioned if they are preparing for a fight.\n\nThat could not be further from reality.\n\nThe teenagers are doing a daily check-in, a ritual they have been taught by youth mental health charity Menslink.\n\nParticipants have daily check-ins with one another, a ritual they have been taught by the program. (ABC News: Luke Stephenson)\n\nAt schools across Canberra, groups of up to 12 boys are taking part in the organisation's eight-week TRIBE program, aimed at challenging the narrative around what it means to be a young man.\n\n\"It's just a time where I can come out of my shell,\" 14-year-old Jaedee Lopez said.\n\n\"[I can] take the mask off my face and just connect with some of the boys.\n\n\"It's felt very relieving talking to each other and getting stuff out of your gut.\"\n\nJaedee Lopez says the workshops are a time he can come out of his shell and connect with the other boys. (ABC News: Luke Stephenson)\n\n'Toxic stuff is all around them'\n\nAccording to program organiser Mark Wadie, the confidential workshops tackle harmful social expectations, loneliness and anger, along with sexism, racism and homophobia.\n\n\"Hurt people hurt people,\" Mr Wadie said.\n\n\"When boys are lost, when boys don't have guidance … in come the weeds.\n\n\" The weeds come from the likes of Andrew Tate and through the influence of social media. \"\n\nProgram organiser Mark Wadie says the workshops encourage participants to consider what sort of men they want to be. (ABC News: Luke Stephenson)\n\nHe said some boys are willing to do anything to feel significant and show that they are valued.\n\n\"That goes from stealing cars to being really disrespectful towards women,\" Mr Wadie said.\n\n\"The toxic stuff is all around them.\n\n\"We'll stir it up and go, 'What do you want to do about it? Are you OK being disrespectful? Are you OK being racist? Are you OK being misogynistic? Are you alright with that?' No, it feels horrible.\"\n\nThe TRIBE program works to guide young men on their journey to manhood. (ABC News: Luke Stephenson)\n\nDuring one of the sessions, the students are asked about someone in their life they owe an apology.\n\nOne of the boys started crying when he admitted he wanted to say sorry to his dad.\n\n\"I've put him through some stuff,\" he said, before being comforted by his peers.\n\nIn one of the TRIBE workshops the boys are asked to write an apology to someone they feel they owe it to. (ABC News: Luke Stephenson)\n\nFor Mr Wadie, that is what the program is all about.\n\n\"They start to make agreements about how they want to show up in the world, how they treat each other, how they treat women, how they treat their parents, and what sort of men they want to be,\" he said.\n\n\" They find their own way without someone telling them how to do it. \"\n\nUsing schoolyard influence to create cultural change\n\nThe boys have been handpicked to participate because of their influence in the schoolyard.\n\nMenslink runs about 60 TRIBE courses a year in Canberra schools, and in 2024 the charity delivered various programs to more than 13,000 boys.\n\nBoys with influence in the schoolyard are picked for the program in an effort to encourage wider cultural change. (ABC News: Luke Stephenson)\n\nMr Wadie said the intention was to influence the critical mass of a student cohort, creating a tipping point for cultural change.\n\n\"To the point where [one school] hasn't seen a punch up in 12 months,\" he said.\n\n\"I've heard from schools where the boys start talking about their girlfriends differently and are more respectful.\"\n\nParticipant Chace Valter (right) says the program has changed his mindset around judging people too quickly. (ABC News: Luke Stephenson)\n\nFor 15-year-old Chace Valter, the sessions have allowed him to open up more than he ever has around his mates.\n\n\"It's a little scary at first because you don't know what they're going to do, or you don't know how they're going to judge you,\" he said.\n\n\"But once you learn that we all have similarities and we're all opening up to each other, trusting each other, [it] starts to get better.\n\n\"My mindset has changed to not judge people so quickly because they might have a different life at home, they might get treated poorly at home, which could lead to the way they act at school or to friends.\"\n\nSchool youth worker Siave Tema said he had noticed a big shift on campus as a result of the TRIBE program.\n\n\"When I was at this age, I didn't have the support and opportunity to speak in front of my friends or share emotions like this,\" he said.\n\nSiave Tema says the boys in the program have made him proud with their efforts to shift campus culture. (ABC News: Luke Stephenson)\n\nMr Tema has spotted more teenagers checking in with each other and building rapport with previously disconnected students.\n\n\"It's a positive thing, and it's something that makes me real proud — that the boys starting this out there are the boys that are in our circle,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/orroroo-fuel-station-runs-on-empty-as-it-battles-drought/105413572",
        "title": "Orroroo's only fuel station runs dry in another blow for mid north town",
        "publish_date": "Sat, 14 Jun 2025 21:32:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Orroroo locals say the loss of fuel in town has been terrible timing, but the town is made of a \"resilient bunch\" of people.\n\nReported before the long weekend, and with no end in sight, customers of the town's only fuel station cannot top up.\n\nOrroroo is just over three hours north of Adelaide in the state's mid north.\n\nThe nearest fuel station is about 40 kilometres away at Peterborough.\n\nA spokesperson from the South Australian Environment Protection Authority (EPA) said it had been \"notified of a possible leak from a fuel storage tank at an Orroroo petrol station\".\n\nThe EPA said it was \"liaising with the licensee in relation to the situation\".\n\n\"The tank will remain empty until an environmental consultant can undertake further assessment of the situation, and the findings of the assessment are provided to the EPA,\" the spokesperson said.\n\nThe owner of the fuel station declined to comment.\n\nKate Pearce says Orroroo locals are a \"pretty resilient bunch\". (ABC North and West SA: Declan Durrant)\n\nKate Pearce from the not-for-profit gift shop 54/31 Collective said the town had a \"terrible\" last couple weeks with drought and dust storms so it would be bad timing to lose visitors in what was supposed to be peak tourist season.\n\n\"It's not ideal, and it's really disappointing for the owners of the fuel station. This is peak season for them, too,\" Ms Pearce said\n\n\"We've had a pretty crappy year drought-wise … so our town is really reliant on tourists coming in and stopping.\n\n\"The service station is a really positive, great thing that we have in our town [which is] the last … bigger centre before people are travelling up to the Flinders.\n\n\"We'd love them to be able to stop and look around our whole main street and utilise … all of our services, including fuel.\n\n\"Our town is rallying and we're a pretty resilient bunch.\"\n\n'Scary' thought of emergencies without fuel\n\nTwo Farmers Daughters cafe owner Joylene Tapscott is worried about re-fuelling in an emergency situation. (ABC North and West SA: Declan Durrant)\n\nTwo Farmers Daughters cafe owner Joylene Tapscott said the distance to the next fuel stop would not suit some of the town's older residents, nor locals in an emergency.\n\n\"Some may have restricted licences, some may not have family to rely on. So it's definitely an issue,\" she said.\n\n\"I have an elderly mum who, at any point, could need more care than what she already has.\n\n\" I have family interstate, and if there was an emergency situation and you needed to quickly get out of town it's not a nice feeling knowing that fuel may not be possible for the people that need it at that time. \"\n\nThe loss of fuel has come during Orroroo's peak tourist season and drought. (ABC North and West SA: Declan Durrant)\n\nHowever, Ms Tapsott said she was trying to stay positive.\n\n\"It's quite scary to think where it could take us, but Orroroo is a pretty resilient little town and we like to think that maybe with all the publicity we will be favoured,\" she said.\n\n\"We've certainly had our fair share of curveballs thrown at us in the last couple of weeks — the dust storms, the livestock on the roads — you know, it's endless, and everyone can have a pessimistic view.\n\n\"Hopefully we can support each other and hold each other together and get through it in the shortest time possible.\"\n\nJennie Hamilton said \"only time will tell\" if the lack of fuel will result in less tourists stopping in town. (ABC North and West SA: Declan Durrant)\n\nOrroroo Hotel licensee Jennie Hamilton said the lack of fuel in town might take tourists away, but \"only time will tell\".\n\n\"Once it gets out amongst the tourists and the grey nomads … they might just keep going through instead of stopping,\" Ms Hamilton said.\n\n\"Some will stop because they just do, and they love the town. There's a lot of tourists now that are repeat tourists.\n\n\"It's early days yet and we're all adjusting.\n\n\"We're pretty resilient and we'll adapt.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/wyndham-council-criticised-for-diverting-funds-from-point-cook/105414644",
        "title": "Backlash after Melbourne council redirects funding from growing suburb",
        "publish_date": "Sat, 14 Jun 2025 21:25:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tens of millions of dollars levied from developers in one of Melbourne's largest suburbs to be used for local infrastructure is set to be spent in other communities by the City of Wyndham, infuriating residents of Point Cook.\n\nThe decision by the council to allow $24 million in developer contributions to be spent elsewhere in the municipality has also prompted a state government MP to call for integrity agencies to probe decision making.\n\nWhen new housing estates are built, developers make contributions to council with the money to go towards infrastructure.\n\nLast year it was revealed council had $36 million in Point Cook developer contributions, raised two decades ago, sitting in council accounts.\n\nLocals seized on the news, demanding their suburb — home to 70,000 people — receive the money for infrastructure, such as basketball courts or an aquatic centre.\n\nCouncil used a third for a community centre in the suburb, but a majority of councillors then allocated $24.4 million for a community space somewhere in Wyndham.\n\n\"If we look at this ethically, it doesn't pass the pub test '' Point Cook resident Dwayne Kelly said.\n\nHe started an online petition to pressure the council to look after the suburb, which has fallen on deaf ears.\n\nPoint Cook resident Dwayne Kelly says he started a petition to pressure the council on its spending. (ABC News)\n\n\"This is really wrong. A lot of the community probably didn't know … so I wanted to create awareness, to say this is happening, this what our council are doing to us, and it's not right,'' he said.\n\nLocals say sports infrastructure is lacking\n\nBasketball is popular in the region but indoor courts for competition are scarce.\n\nFamilies have to travel across Melbourne's west to find a place to play. It's caused leagues to turn away players, shorten games to accommodate so many teams and create extra byes to fit everyone in.\n\n\"It's ridiculous,'' Kate Coffey of the Altona Basketball Association said.\n\n\" We just don't have the court space and there's lots of kids from Wyndham coming here. \"\n\nState Labor MP for Point Cook Mat Hilakari said council was aware of the need for sporting infrastructure in the suburb but had failed to fix the problem.\n\n\"Wyndham Council says that Point Cook requires the equivalent of 12 indoor basketball courts. We do not have a pool in Point Cook, and it is the largest and most multicultural suburb in the country,\" he told parliament last month.\n\n\"Wyndham Council has no plans to rectify these massive gaps.\"\n\nLocal MP Mat Hilakari says the City of Wyndham is aware of the need for sports infrastructure in Point Cook. (ABC News)\n\nHe's also called for a probe from oversight agencies into council decision-making.\n\n\"What is council doing behind closed doors in confidential meetings? Are these decisions being made formally or informally by a majority councillor-grouping to carve up these funds?\" Mr Hilakari said in parliament in April.\n\n\"We will not know, because we will not be told.\n\n\"There are agencies to look into this, and they should — the Local Government Inspectorate, council monitors, the Victorian Ombudsman and more.\"\n\nCouncil says accusations are 'false and misleading'\n\nCouncil has bristled at the suggestion of poor behaviour, writing to local government minister Nick Staikos saying it was concerning Mr Hilakari was using parliamentary privilege to \"pedal misinformation and lies for a political attack that seeks to undermine community trust in council\".\n\nWyndham City says it has no legal obligation to spend the money collected in Point Cook in the suburb and any suggestion to the contrary was \"false and misleading\".\n\nWyndham Mayor Mia Shaw said council was focused on exploring opportunities for a major regional community events space.\n\nCity of Wyndham mayor Mia Shaw says her council is focusing on a major regional community events space. (ABC News: Simon Tucci)\n\n\"The majority of councillors think this is the best way to spend the residual developer funds — so that all residents across Wyndham and elsewhere can benefit,'' Cr Shaw said in a statement.\n\n\"Our residents are telling us we don't have a venue for large events, that's why we're focusing on this new project.\n\n\"In line with the good governance principles outlined in the Local Government Act, council must govern in the best interests of the whole of the municipality.\"\n\nShe called on the state government to help fund projects such as a major basketball centre, which council could not afford to do on its own.\n\nCity of Wyndham says it has no legal obligation to spend money collected in Point Cook within the suburb. (ABC News)\n\nThe state opposition's special representative on the western suburbs Moira Deeming said it set a terrible precedent and eroded trust in governance.\n\n\"I don't think it passes the pub test. Point Cook is famous for poorly planned, overcrowded roads and facilities,\" she said.\n\n\"In principle, if people pay rates into a fund on the promise of that money being reinvested in their area, then that's what should happen.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-15/lani-pallister-smashes-commonwealth-record-swimming-trials/105418266",
        "title": "Lani Pallister smashes Commonwealth record on final night of swimming trials",
        "publish_date": "Sat, 14 Jun 2025 21:20:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lani Pallister has concluded her extraordinary meet on the final night of the Australian Swimming Trials, winning the 1500m freestyle setting a Commonwealth record time of 15:39.14.\n\nPallister will compete in four freestyle events at the world championships in Singapore next month, ranging from 200m to 1500m.\n\nThe 23-year-old has seen a huge jump in form since moving to new coach Dean Boxall after spending the first part of her career under the wing of her mother, former Olympic swimmer Janelle Pallister (nee Elford).\n\nHer time in the 1500m was a second under the previous Commonwealth record set in 2015 by New Zealander Lauren Boyle and a staggering 10 seconds below her personal best from three years ago.\n\nBut she said she had more to give ahead of the world championships in five weeks.\n\n\"Every time I finished a race, 200 to the 1500, there's always something that I looked to be like that can be so much better,\" Pallister said.\n\n\"I'm just so excited to build on it, I don't think that's my limit by any means.\"\n\nPallister heads a squad of 40 to contest the world championships.\n\nThe team contains 10 debutants and a further five who are going to their first long-course world championships.\n\nThe youngest competitor in the team is 16-year-old breaststroke sensation, Sienna Toohey.\n\nCameron McEvoy and Sienna Toohey are the oldest and youngest swimmers in the Australian team for next month's World Championships. (ABC News: David Mark)\n\nThe oldest is sprinter Cameron McEvoy (31), who is going to his seventh world championships.\n\nMcEvoy told Toohey she had a long career in front of her.\n\n\"You could be around for 20-plus years in the sport,\" he said.\n\n\"Just make the most of it, because I'm at the later end of that — it's an absolute roller-coaster of an experience.\"\n\nMcEvoy was disqualified from the 50m butterfly on the final night of competition for moving on the blocks in a race won by another veteran Kyle Chalmers.\n\nChalmers said he wanted to mentor the new Dolphins.\n\n\"When I first came on to the team it was very challenging as a 16-year-old,\" he said.\n\n\"I want to make sure that their first experience is probably a lot better than mine was.\n\nAustralia's swimmers facing doubts and moving forward Photo shows Female swimmer restingon lane ropes after winning a race, goggles on forehead, looking at timing screen Australia's top swimmers admit they have faced the \"Olympic Blues\" post-Paris, and are having to work out what they actually want from the sport.\n\nAsked what advice he'd give to the debutants, Chalmers said he would urge them to \"slow down and enjoy it\".\n\n\"You work so hard to be on that team and it's very easy to get caught up putting all that pressure and expectation on yourself.\n\n\"I don't feel that I enjoyed it as much as I should have on my first few teams.\n\n\"I got straight into that I want to win and do everything I possibly can do to win and beat myself up if I wasn't doing well in training and beat myself up if I wasn't doing well at training and burn myself out.\n\n\"Whereas I think it's really important for these young kids to enjoy the fruits of their labour, like they've all worked so hard to be on the Australian swimming team.\"\n\nChalmers said that although he had qualified for the 50m butterfly at the world championships, he would not swim the event.\n\n\"It's on the same day as the four-by-one freestyle and that's still my main priority is to play my part in that relay for the boys,\" Chalmers said.\n\nThe Singapore squad includes Paris and Tokyo Olympic champions, Kaylee McKeown and Mollie O'Callaghan, who expressed disappointment with their times at this meet.\n\nMcKeown has qualified for the 50m, 100m and 200m backstroke events, while O'Callaghan has qualified for the two shorter backstroke events and the 100m and 200m freestyle.\n\nNational head coach Rohan Taylor said the pair motivated themselves by setting such high expectations.\n\n\"They're pretty hard on themselves, I think they need to be a bit kinder to themselves,\" he said.\n\n\"We know that's the struggles they're going through, so we're supporting them.\n\n\"For them to be maybe behind on their preparations — even though they're still good enough to make the team — they're just a little bit short of the work, so they're really just trying to push themselves along.\n\n\"The plan is always LA [2028 Olympics], so this is part of the plan. It's just them expecting that that's what happens.\n\n\"We also know that what makes them world's best is that they just are never satisfied, they just keep driving themselves.\"\n\nIn other events on the final night of the trials, Paris silver medallist, Meg Harris won the women's 50m freestyle event in a time of 24.17 seconds.\n\n\"I surprised myself this week which I was definitely happy about,\" she said.\n\nIt's definitely been a different prep, and I think so many people have said that they've not got what they needed or didn't do some things.\n\n\"I did it completely different to what I've ever done before and I'm happy with that swim, it's faster than what I went at trials last year. So just excited for worlds,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHarris said it was difficult to find her motivation after the Paris Olympics.\n\n\"Coming off such a high, I didn't experience that much of a low after Tokyo — like just figuring out, 'wow I've done that, what's next?'\" Harris said.\n\nElla Ramsay and Jenna Forester battled all the way in the women's 400m individual medley with Ramsay winning by just .07 seconds.\n\nRamsay's time of 4:36.12 was more than 12 seconds slower than the time set by 18-year-old Canadian sensation Summer McIntosh when she broke the world record at the Canadian trials earlier in the week.\n\nDual Olympian Brendon Smith qualified for the men's 400m individual medley with William Petric in second also qualifying.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/an-undiminished-jimmy-barnes-had-fans-on-their-feet-for-this-classic-20250611-p5m6nn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An undiminished Jimmy Barnes had fans on their feet for this classic",
        "publish_date": "Sun, 15 Jun 2025 12:22:45 +1000",
        "category": "entertainment",
        "authors": [
            "Will Cox",
            "Jessica Nicholas"
        ],
        "text": "MUSIC\n\nJimmy Barnes ★★★\n\nPalais Theatre, June 13\n\nWhen I was a child, I got a Jimmy Barnes CD out of a packet of muesli bars. I didn’t have a CD player, so I just had to imagine what it might sound like.\n\nJimmy Barnes at The Palais, touring his 21st studio album, Defiant. Credit: Richard Clifford\n\nI already had enough Barnesy in my blood to have a good guess. His songs are part of the Australian collective unconscious. They play in our dreams. They give them away in muesli bar packets.\n\nBarnes is now touring his 21st studio album, Defiant. A few hours before he took to the stage, it went to No. 1 in the album charts. It’s his 15th No.1 album (19th if you count Cold Chisel). He plays virtually all of that record tonight. His gruff yarl is undiminished by age and recent heart surgery.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/conservation/forrest-calls-for-global-fishing-overhaul-as-australia-backs-major-treaties-at-un-summit-20250615-p5m7ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Forrest calls for global fishing overhaul as Australia backs major treaties at UN summit",
        "publish_date": "Sun, 15 Jun 2025 12:20:19 +1000",
        "category": "finance",
        "authors": [
            "Alex Condon"
        ],
        "text": "Australian mining billionaire Andrew Forrest has called for the United Nations to back a major overhaul of global fishing regulations and marine life protections following an international ocean summit last week.\n\nAustralia’s Environment Minister Murray Watt also attended the 2025 UN Ocean Conference (UNOC3) in Nice, France, and confirmed on Friday the federal government has joined 96 other nations in committing to end plastic pollution.\n\nDeclaring “the ocean is in freefall”, Forrest made the comments following the summit on Saturday, saying his Minderoo Foundation will commit an additional $25 million towards implementing new marine protected areas and real-time vessel monitoring.\n\nAndrew Forrest has called for major action to be taken on fishing and plastic waste. Credit: Bloomberg\n\n“We must lock in 30 per cent no-take marine protected areas by 2030 in every nation, in the high seas [international waters] and across at least 30 per cent of Antarctica – this must be the minimum, not the maximum – and it must be enforced, not just declared,” the WA-based magnate said in a statement.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/mt-coot-tha-to-get-a-major-makeover-under-ambitious-tourism-push-20250615-p5m7iw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mt Coot-tha to get a major makeover under ambitious tourism push",
        "publish_date": "Sun, 15 Jun 2025 12:14:10 +1000",
        "category": "sports",
        "authors": [
            "William Davis"
        ],
        "text": "A renovated lookout, new hiking and mountain bike trails, a “glamping” nature retreat, and upgrades to the planetarium and tropical dome are among the proposals set to be explored for Mount Coot-tha, Brisbane City Council announced on Sunday.\n\nNight-time light shows in the Brisbane Botanic Gardens, a summit tree-top walk, new picnic areas and pop-up cafes, transformation of the quarry, and the reconfiguration of Sir Samuel Griffith Drive are also under consideration.\n\n“We want the world to discover Brisbane and fall in love with its lifestyle and natural attractions,” Lord Mayor Adrian Schrinner said in a statement announcing the project.\n\nIn addition to the upgraded and expanded tropical dome, night-time light shows will illuminate the Botanic Gardens. Credit: Brisbane City Council\n\n“Brisbane is riding a wave of international popularity as a tourism destination, and with the 2032 Olympic and Paralympic Games coming, now is the time to start planning more to see and do in our city.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/middle-east/how-the-clocks-stopped-for-netanyahu-allowing-him-to-go-full-hezbollah-on-iran-20250615-p5m7hr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the clocks stopped for Netanyahu, allowing him to go ‘full Hezbollah’ on Iran",
        "publish_date": "Sun, 15 Jun 2025 11:43:46 +1000",
        "category": "finance",
        "authors": [
            "Paul Nuki"
        ],
        "text": "“I must govern the clock, not be governed by it.” So said Golda Meir, one of Israel’s founders and its first and only female prime minister.\n\nNow, some 50 years later, the Israel Defence Forces (IDF) may have realised her insight. Indeed, they have taken the clock and blown it to smithereens, neutralising its power to contain them once and for all.\n\nIsraeli Prime Minister Benjamin Netanyahu shows an illustration as he describes his concerns over Iran’s nuclear ambitions during an address to the United Nations General Assembly in 2012. Credit: AP\n\nFor the mullahs of Iran, this could spell curtains, or at least a long and painful “Hezbollah-isation” stretching over weeks and months.\n\nThe clock has always been central to Israeli military planning, with its strategists at the Kirya in central Tel Aviv long regarding it as important as guns and manpower.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/great-scott-aussie-poised-to-make-history-at-the-us-open-20250615-p5m7i7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Old man golf’: Aussie veteran poised to make history at the US Open",
        "publish_date": "Sun, 15 Jun 2025 11:05:47 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Veteran Australian golfer Adam Scott could make history on Monday after overcoming treacherous conditions at the US Open to put himself into contention to win a second of golf’s major tournaments.\n\nScott sits in equal second at three-under, after finishing the third round at Oakmont Country Club with a three-under par 67. The 44-year-old held a share of the lead toward the end of his round, but will go into the last day just one shot behind leader Sam Burns.\n\nIf Scott goes on to win the US Open, he will break a record for the longest wait between first and second major wins - after the Queenslander famously won his first in 2013 with a drought-breaking victory at the Masters. Scott would also become the second-oldest golfer to win a US Open.\n\nScott showed all his experience and guile on Sunday, coming home with three birdies in the final six holes",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/leicester-prop-binned-in-final-20250615-p5m7it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leicester prop binned in final",
        "publish_date": "Sun, 15 Jun 2025 11:02:57 +1000",
        "category": "sports",
        "authors": [],
        "text": "Leicester prop binned in final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/former-royal-insider-breaks-down-trooping-the-colour-20250615-p5m7is.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former royal insider breaks down Trooping the Colour",
        "publish_date": "Sun, 15 Jun 2025 11:02:20 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Former royal insider breaks down Trooping the Colour\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-mid-season-verdict-he-s-a-star-blue-but-at-the-moment-he-s-just-going-20250529-p5m3b5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mid-season verdict: From grand final one year to D+ the next",
        "publish_date": "Sun, 15 Jun 2025 10:33:27 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Andrew Wu"
        ],
        "text": "Who’s not: Noah Balta owes his club big time. Just two months after signing a mammoth seven-year contract extension, the key defender assaulted a man in a NSW car park. As a result of the club-imposed sanction and the curfew ordered by the magistrate, Balta has played just five out of 13 games in a season when the Tigers need his experience. It’s a big final three months of the season for Dion Prestia, who has managed only 15 of 36 games since the start of last year due to a series of injuries. The 32-year-old won’t be part of the Tigers’ next finals team but can play an important buffering role while prized picks Sam Lalor and Josh Smillie cut their teeth at the top level. The verdict: As tough as it may be for Tigers fans to watch their side lose most weeks, even the harshest judge would be encouraged by the progress made so early in their rebuild. While the exodus of mature-age talent was supposed to result in the reigning wooden-spooner plumbing deeper lows, the arrival of fresh blood who actually want to be there has seen the Tigers already improve on their two wins. With games to come against Essendon, West Coast (away), St Kilda and North Melbourne, they should be able to pick up another one or two wins to nourish the soul without much damage to their draft hand. Andrew Wu’s grade: C+ Gold Coast Suns (5th, 8 wins, 4 losses) Who’s hot: Well, it’s finally getting hot for the Suns where it really counts – on the ladder. They are primed to play finals for the first time in club history – but, yes, we have said that before, and a challenging run home to September awaits. This time, though, Damien Hardwick has his team playing a robust brand of football that should stand up when it counts. New skipper Noah Anderson is in All-Australian form, while Matt Rowell has added more run to his game. The Suns are giving Rowell time to sign a contract extension, but it’s a major worry the Victorian, with several suitors, has yet to do so. Perhaps that changes soon after the bye. Touk Miller is another midfielder pressing for All-Australian selection, while defender Sam Collins and mid-sized forward Ben Long would be locks for that team were it picked now. Key forward Ben King would also be close. Recruits Daniel Rioli and John Noble have done what was expected – provide dash and creativity from halfback.\n\nOn our way: Matt Rowell and Ben King have had strong starts to the season, helping the Suns eye a maiden finals berth. Credit: Getty Images Who’s not: Half-back flanker Connor Budarick has been in and out of the team and has not played at the senior level since the loss to the Lions. While Rioli and Noble enjoy the rebound accolades in defensive 50, a firing Budarick would also help. As Hardwick has noted, the Suns need to stop kicking to King when he is outnumbered. King had 23 goals in his first six games, the 24-year-old has 10 in his past six games. It’s over to Ethan Read, Jed Walter and Ned Moyle to get busy. The verdict: The Suns likely need only five more wins to book a September berth, but face a potentially tough month after the break – GWS [Engie Stadium], Melbourne [People First Stadium], Essendon [Marvel Stadium] and Collingwood [People First Stadium]. Richmond [in round 21] appears their only certain win in the run home, but if they are good enough, they will make the finals. Their game plan is strong – they are among the best teams for points from turnovers, intercepts and stoppages, and know how to lock the ball inside their forward-half. It’s about time the Suns broke their finals duck – we’re backing Hardwick in. Jon Pierik’s grade: B Sydney (13th, 5 wins, 8 losses)\n\nWho’s hot: Twelve months ago, the Swans were flag favourites and Isaac Heeney the top pick to win the Brownlow. That’s not the case now, but Heeney remains their best-performed player. The gun midfielder is on track for similar numbers to his career-best 2024 but is lacking the same impact. The same could be said of Chad Warner, whose form has improved since the distraction of being out of contract was removed. Tagger James Jordon can count midfield stars Sam Walsh and Zach Merrett among his scalps. Youngster Matt Roberts continues to grow as a running defender, backing up his rapid improvement from last year. Who’s not: An All Australian halfback last year, Nick Blakey is struggling with the extra attention on him. Injuries have forced the Swans to play him deeper, limiting his capacity to provide the springboard from defence that was a feature of their game last year. Ollie Florent paid the price for the Swans’ poor form, his recent omission ending a run of 130 consecutive games. Hayden McLean is another from their grand final team who has also been dropped this year as the Swans search for marking power in their weakened forward line. Now that he is fit after a wretched 18 months with injury, skipper Callum Mills has the chance in the second half of the season to remind his critics why the club made him captain. Verdict: Injuries have wreaked havoc with rookie coach Dean Cox’s first season at the helm. All Australians Errol Gulden, Tom Papley, Mills have all spent chunks of the season injured, as have reliable defender Harry Cunningham and young key forward Logan McDonald. Throw them all into the Swans’ 23, and it’s unlikely they would be in such a desperate position. The crowded casualty ward has exposed a lack of depth. That said, the Swans have been so poor in several games that it would not have mattered who they had on the park. A fitter list raises hope they can mount a charge for the finals, but they are coming from a long way back. Andrew Wu’s grade: D+ News, results and expert analysis from the weekend of sport are sent every Monday. Sign up for our Sport newsletter.\n\nTeams who had the bye in round 13 St Kilda (11th, five wins, seven losses) Who’s hot?\n\nJack Higgins has been a consistent force up forward, the small forward leading the Saints’ goal kicking – including four goals against Geelong – to be included in the All-Australian preliminary squad. Jack Sinclair (27 disposals per game) and Nasiah Wanganeen-Milera (28) have been two of the premier rebounding half-backs. The dashing Wanganeen-Milera, off-contract and weighing up offers to return home to South Australia, has become the Saints’ most important player, and the best player they have had in the past decade. That he has yet to agree to a contract extension by this point of the season is a major worry for the Saints. Former Western Bulldog Jack Macrae has been a strong leader through the midfield and found plenty of the ball (before a major lung injury), while intercept defender Callum Wilkie should be in All-Australian squad discussions. Youngster Hugo Garcia is making progress, despite a public spray from Ross Lyon during the loss to Brisbane and recent axing to the VFL. Marcus Windhager, one of several off-contract Saints, has, at times, been a stand-out, whether tagging or finding his own ball. Cookin’: Jack Higgins has had a strong season, and will be in All-Australian squad calculations. Credit: AFL Photos via Getty Images Who’s not?\n\nYoung midfielder Darcy Wilson has stagnated, while Mattaes Phillipou has endured an injury-hit start to the season, the latest a calf injury in the opening minutes against Melbourne. Wingman Brad Hill still provides dash, but there are times when he could rip a game open. Rowan Marshall has been steady, but is no longer among the conversation as one of the top three ruckmen in the league. Injuries to Max King and Zaine Cordy have hurt.\n\nVerdict: The Saints are 2-4 against top-eight teams, including their best win of the season, against Geelong. They are a system-based side, so, when the system wobbles, the whole team wobbles, which can lead to heavy defeats. The flip side is what we saw against Melbourne, when they dominated through scores from defence. That they are the only team to lose to the last-placed Eagles highlights the gulf between their worst and best. The Saints still remain a line-ball finals contender, as they were before this campaign began. Through that prism, they sit where many had expected. Jon Pierik’s grade: C+ Man on a mission: Caleb Serong has been influential for the Dockers this season. Credit: AFL Photos Fremantle (eighth, seven wins, five losses) Who’s hot?\n\nMidfield gun Caleb Serong (28 disposals per game) typically finds plenty of the ball, but has struggled, at times, when there has been an aggressive tag. Fellow star onballer Andrew Brayshaw (also 28 disposals per game) has been busy, and put his body on the line in the desperate final minutes against Gold Coast on Saturday, and is also firmly in contention for All-Australian selection. Jordan Clark has provided drive from half-back, Shai Bolton has added life inside attacking 50 and been arguably the second-best recruit of the season (behind Bailey Smith), while Luke Jackson has been at his best when used as a sole ruckman. The Dockers have been one of the more efficient teams, according to Champion Data, but need to find more marks inside 50 if they are to challenge for a top-four spot.\n\nLoading Who’s not?\n\nSean Darcy, tied to the club until the end of 2030, has largely been a shadow of his former self because of an off-season hampered by a knee issue but was strong in ruck contests in the wet against the Suns. Whether he and Jackson can thrive in the same team remains a burning question for coach Justin Longmuir. It also remains to be seen if talls Josh Treacy, Jye Amiss and Pat Voss can consistently also work alongside each other up forward, as the Dockers have struggled to turn inside-50 advantage into scores. That could also be because of a lack of speed with ball in hand, something the Dockers have looked to address. It was great to see Nat Fyfe back for his first senior game of the season last weekend. Hayden Young’s extended absence because of a serious hamstring injury which has required surgery has hurt. He shapes as an x-factor later in the season. Verdict: The Dockers remain an enigma. They have a list capable of finishing in the top four, reinforced by their win on the Gold Coast and their three wins in five games against top-eight teams, but have had head-shaking losses, including a 61-point defeat to St Kilda at Marvel Stadium, and a 14-point loss at home to a depleted Collingwood. The pressure remains on Longmuir to deliver a deep finals run. Jon Pierik’s grade: B- Teams who had the bye in round 12\n\nCarlton (12th, four wins, seven losses) Who’s hot?\n\nIn his 10th season, Jack Silvagni has been a revelation in his new role as a defender. Silvagni’s ability to stop high-quality forwards, from a key type like Aaron Naughton to the medium-sized threat like Patrick Dangerfield, intercept and launch counter-attacks is one of the reasons why the Blues, for all their problems, has been one of the more difficult sides to score against. A streamlined George Hewett is having a career-best season in the midfield at the age of 29, and Nick Haynes has overcome a horror start to life as a Blue by turning the clock back to the pre-pandemic years. Tom De Koning was the best ruck in the competition in the first month, but his form has tailed off. Jacob Weitering had been in All-Australian form before two below-par games coming into the bye. Jack Silvagni has been a revelation in defence for the Blues so far this season. Credit: AFL Photos Who’s not?\n\nThe Blues need more from their superstars. Patrick Cripps and Charlie Curnow are having reasonable years but are capable of finding another level. Harry McKay has struggled with consistency since returning from a mental health break, though his best has been the reason why the Blues have won. After another interrupted preseason, Sam Walsh has become just a player, unable to run opponents off their legs like he used to. The same can be said of Blake Acres, who is not having the same impact of his first two years at the club. Verdict: So much more was expected of the Blues, who have been one of the most disappointing clubs of the season. Despite having two Coleman medallists in their forward line the Blues are having enormous difficulties scoring. Their lack of class small forwards has hurt, but their ball movement is slow and imprecise. They are as tense as a patient visiting the dentist. Similar problems were overcome in 2023 when they mounted a stunning run to the preliminary final, but they do not have the same quality on their list. A friendly draw over the next month will give Blues fans hope but a finals berth is unlikely.\n\nAndrew Wu’s grade: D+ Tristan Xerri is mounting a case for All-Australian selection this year. Credit: Getty Images North Melbourne (17th, two wins, one draw, eight losses) Who’s hot?\n\nAfter a slow start to the season, Tristan Xerri is again mounting a strong claim for a maiden All-Australian blazer. The ruckman, with his attack on the ball and wholehearted manner in which he plays, has become the Kangaroos’ on-field spiritual leader. Small forward Paul Curtis has continued his improvement and, with 19 goals to the bye, is on track to pass his career-best haul of 30 last year. Cameron Zurhaar has rediscovered his bull-at-a-gate ways in attack to add much-needed bite to the forward line. Veteran Luke Parker has justified his acquisition on the field even if his greatest impact might be felt in the locker room. Who’s not?\n\nThis might be harsh on North’s leading possession-getter but Caleb Daniel is not having the impact he should. A damaging kick at his best, Daniel has often erred on the side of recklessness with his ball use by taking low-percentage options deep in defence. In his third year at Arden Street, Griffin Logue cannot get a clear run at it due to injury and now form. Dropped amid North’s horror run, Logue is yet to reclaim his position in the side. The Roos need more from experienced duo Aidan Corr and Zac Fisher, who have both had stints in the VFL.\n\nCaleb Daniel: Plenty of possessions but more impact needed. Credit: Getty Images Verdict: As painful as this season has been for their fans, North have actually improved. At this stage last year, they were winless with a percentage of 55.9 and uncompetitive. This year, they have been in contention at three-quarter-time in eight games. The question is whether North should be further advanced after five seasons in the bottom two. Given they have traded away their first pick, the Kangaroos would have expected to have picked up an extra win or two instead of being in the familiar position of 17th. Andrew Wu’s grade: D+ Port Adelaide (15th, four wins, seven losses)\n\nWho’s hot?\n\nPort’s best phase of the season came after Zak Butters returned from injury. Butters was instrumental in Port’s best win of the year, against Hawthorn, but needs more help in the guts. The Power cannot afford to lose him. Moved to half-back, Connor Rozee has maintained his high standards while others’ have fallen, though Port need him in the middle as well as providing run out of defence. Though not necessarily built for it, Mitch Georgiades has prospered being the main man in the forward 50. Miles Bergman’s star is on the rise though he, like Butters, may be on the move at season’s end. Who’s not?\n\nEsava Ratugolea, Ivan Soldo, and Jordon Sweet were recruited at the end of 2023 to help Port take the next step. Eighteen months on, those moves have not had the desired effect. Ratugolea is struggling in an overworked defence that does not get enough pressure on the ball from up the field. Sweet lost his spot after being monstered by Tim English, and his understudy Soldo is out of favour. The move of Jeremy Finlayson into defence lasted just one disastrous game against Collingwood. Ed Richards has been a midfield weapon for the Western Bulldogs. Credit: Getty Images Verdict: Ken Hinkley’s 13th and final season at the helm at Alberton is headed for an inglorious finish. Preliminary finalists last year, Port are headed for a bottom-six finish. The impending handover from Hinkley to Josh Carr is an easy target to explain Port’s poor season even though many had tipped them to be this season’s slider. The club would not have seen such a drop coming, given they traded out their first-round pick for Jack Lukosius, who has been injured. Most concerning is how quickly the Power have waved the white flag when things became difficult. Five of the heaviest losses of the Hinkley era have come in Port’s last 24 games.\n\nAndrew Wu’s grade: E Western Bulldogs (seventh, six wins, five losses) Who’s hot?\n\nEd Richards has morphed from a capable half-back into one of the game’s best midfielders in the past 12 months. Richards’ speed and penetrating left foot makes him a major weapon for the Dogs. Rebounding defender Bailey Dale, who had a career-best 49 possessions a fortnight ago, is on track for a second All-Australian blazer. Tom Liberatore is defying Father Time. Small forward Rhylee West is one of the most improved players in the league, thriving since taking over from the injured Cody Weightman. Matt Kennedy is close to the recruit of the year since his move from Carlton, revelling as a midfielder who can also be dangerous when moved forward. Who’s not?\n\nVeteran defender Liam Jones has struggled after having his pre-season severely disrupted by a serious hamstring injury. He lost his place to former cricketer James O’Donnell, who has performed admirably in the key defensive post alongside the rejuvenated Rory Lobb. Injuries threatened to derail the season. Marcus Bontempelli, Adam Treloar, Sam Darcy have all spent significant periods in a star-studded casualty ward at Whitten Oval, but all are either back or will return shortly after the bye for the Dogs’ run to September. Loading",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/piastri-hits-wall-of-champions-20250615-p5m7io.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri hits Wall of Champions",
        "publish_date": "Sun, 15 Jun 2025 10:32:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "Piastri hits Wall of Champions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/scott-moves-into-share-of-lead-20250615-p5m7ij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scott moves into share of lead",
        "publish_date": "Sun, 15 Jun 2025 10:20:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Scott moves into share of lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/crowd-roars-at-russells-verstappen-dig-20250615-p5m7i5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crowd roars at Russell's Verstappen dig",
        "publish_date": "Sun, 15 Jun 2025 09:47:37 +1000",
        "category": "finance",
        "authors": [],
        "text": "Crowd roars at Russell's Verstappen dig\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/tensions-boil-over-in-los-angeles-during-no-kings-protest-20250615-p5m7i3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tensions boil over in Los Angeles during 'No Kings' protest",
        "publish_date": "Sun, 15 Jun 2025 09:46:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tensions boil over in Los Angeles during 'No Kings' protest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/stunner-sets-scott-up-for-back-to-back-birdies-20250615-p5m7i2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stunner sets Scott up for back-to-back birdies",
        "publish_date": "Sun, 15 Jun 2025 09:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Stunner sets Scott up for back-to-back birdies\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/freo-survive-major-scare-as-roos-comeback-falls-short-20250615-p5m7hz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo survive major scare as Roos comeback falls short",
        "publish_date": "Sun, 15 Jun 2025 09:38:13 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle duo Luke Jackson and Josh Treacy have come to the rescue as the Dockers overcame a major late scare to secure a thrilling six-point win over North Melbourne at Optus Stadium.\n\nThe Dockers looked like they had Saturday night’s game in the bag after opening up a 28-point lead late in the third quarter.\n\nBut Jack Darling’s goal on the three-quarter time siren sparked a run of five straight goals for the Kangaroos, before a Paul Curtis behind with only seven minutes remaining levelled the scores.\n\nJosh Treacy of the Dockers takes a mark. Credit: AFL Photos via Getty Images\n\nJackson popped up for what proved to be the match-winning goal when he latched on to a desperate handball from Jye Amiss and snapped truly in traffic with three minutes to go en route to the 10.13 (73) to 10.7 (67) victory.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-william-and-kate-share-cute-family-portrait-20250615-p5m7hw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William and Kate share cute family portrait",
        "publish_date": "Sun, 15 Jun 2025 09:23:10 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William and Kate share cute family portrait\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-lauren-muratore-on-having-a-conversation-about-sex/nsv4xcb1v",
        "title": "INTERVIEW: Lauren Muratore on having a conversation about sex",
        "publish_date": "Sat, 14 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/changes-to-solar-feed-in-tariffs-and-batteries/eu3uc8lli",
        "title": "New discounts could reduce energy costs from 1 July but there are other options",
        "publish_date": "Sat, 14 Jun 2025 20:39:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Homeowners hoping to reduce their power bills by installing solar panels are now considering whether new discounts for solar batteries will be worth it.\n\n\n\n\n\nFrom 1 July, the federal government's Cheaper Home Batteries Program will provide a 30 per cent discount on the upfront cost of installing eligible small-scale battery systems.\n\n\n\n\n\nBut homeowners like Victorian resident Lee Bolger, who invested in solar panels a few years ago, are now experiencing dramatic drops in their feed-in tariffs and are sceptical about the added benefit of batteries.\n\n\n\n\n\nFeed-in tariffs — credits issued by energy retailers — allow solar owners to earn money for any unused electricity they generate, which is fed into the electricity grid.\n\n\n\n\n\nThe rates vary across different states and electricity providers.\n\n\n\nAdam Corrigan, an energy efficiency expert and founder of Your Energy Friend, says each household is different, and there are many other energy-saving options to consider before spending thousands on solar and batteries.\n\n\n\nSolar disappointment\n\nBolger, who lives in the Victorian town of Great Western, says he installed 30 panels on his eight-bedroom home in March 2023.\n\n\n\n\n\nHe rents out rooms in his house to boarders and says they use a lot of electricity as they often have the air-conditioning and heating on.\n\n\n\n\n\nHis 12-kilowatt system cost him $12,680 after rebates and other discounts, which he estimated he could recoup in around six years.\n\n\n\n\n\nBut the feed-in tariff at the time was around 12 cents per kilowatt-hour (kWh), and now he only gets around 6 cents.\n\n\n\n\n\nMore drops are expected, with comparison website Finder saying the minimum rate for tariffs in Victoria will drop to 0.04 cents from 1 July, although better rates are available depending on the provider.\n\n\n\n\n\nFifteen years ago, they were as high as 60 cents.\n\n\n\nFeed-in tariff rates for solar panel owners can vary widely across different states and territories. Source: SBS News Bolger estimates his original feed-in tariff of 12c per kWh would have saved him around $1,000 a year.\n\n\n\n\n\nWhen combined with the estimated $1,000 worth of electricity he saves relying on energy generated from his own system, he receives a total benefit of $2,000 per year from his solar panels.\n\n\n\n\n\nIf the feed-in tariff drops to practically zero, the benefit from his panels will reduce to around $1000 a year, meaning the time Bolger would need to pay off his panels would almost double.\n\n\n\n\n\nHe says the experience has made him \"indifferent\" about the economic benefits of solar and he won't be recommending it to others.\n\n\n\nLee Bolger says he's now \"indifferent\" to the benefits of solar after his feed-in tariffs were reduced. Source: Supplied Bolger doesn't believe installing a battery will make a difference, because his solar panels won't generate enough excess energy to store — especially in winter when it's often raining and dark — to make the purchase worthwhile.\n\n\n\n\n\n\"My summer bills were ridiculously low. In winter, you will not generally get enough charge into the battery to make a big difference,\" he says.\n\n\n\nBattery discounts attractive for some but not others\n\nCorrigan says other households might be in a different position to Bolger, as the average NSW home only uses about 20kWh of electricity per day.\n\n\n\n\n\nThe NSW-based energy expert, who has a 1.5 kilowatt solar system, says he uses less than 10 kilowatt-hours a day, although his cooktop is powered by gas.\n\n\n\n\n\n\"[For] most homes, a 10 kilowatt or 14 kilowatt battery will get you through the night easily,\" he says.\n\n\n\n\n\n\"However, if you are cranking your air conditioner and you've got ducted air conditioning, it's probably only going to last you two, three hours.\"\n\n\n\n\n\nCorrigan says batteries will work for some households and the new federal rebate does make the cost more affordable.\n\n\n\nA battery makes so much sense, because you can store that excess electricity you're generating in the middle of the day and then use it in the early evening.\n\nFinder has estimated the cost of a 10kWh battery could come down to between $6,713 – $8,904 due to the federal discount.\n\n\n\n\n\n\"In Australia, the average household uses about 15 to 20kWh of electricity per day,\" a Finder spokesperson says.\n\n\n\nEnergy Minister Chris Bowen looks at home battery systems during a visit to SolarHub in May. Source: AAP / Lukas Coch \"If most of your energy consumption is in the evening and you're paying a single electricity rate — let's use 32.34c per kWh as an average based on single-rate plans in our database — then with a 10kWh battery and using 80 per cent of its capacity, you could save about $850 a year,\" a Finder spokesperson says.\n\n\n\n\n\n\"However, the actual savings can vary depending on the type of electricity plan you have, the rates you pay, your solar panel setup, your energy consumption patterns, and how much electricity you export back to the grid.\"\n\n\n\n\n\nWhile the federal battery discount applies nationally, the states and territories also have programs that can be used to further reduce the cost.\n\n\n\nLook at other options first\n\nCorrigan recommends considering other options before investing in expensive solar panels and battery systems.\n\n\n\n\n\nHe suggests Bolger should review his insulation and energy efficiency measures to reduce his electricity consumption.\n\n\n\n\n\nThe first thing he recommends for households is to analyse their power bills and shop around to get the best deal.\n\n\n\n\n\nMaking your house more energy-efficient should be the next priority before considering solar panels and, finally, batteries.\n\n\n\nIf you want to make your home more comfortable, get your insulation sorted and do your draft proofing. That's your best return on investment. That's your best bang for buck.\n\nCorrigan says simple changes such as installing heavy-lined curtains and a box pelmet (which goes around the top of the curtain) can be very effective at keeping your home warm, and are much cheaper than double-glazed windows, for example.\n\n\n\nHeavy curtains with a pelmet can be very effective in keeping your home warm. Source: Getty / Penpak Ngamsathain Using a thermal camera around the home can also show gaps in roof insulation where batteries might have been moved.\n\n\n\n\n\n\"You only need a 5 per cent gap in that insulation blanket, and the effectiveness of that insulation — the whole blanket — diminishes by almost a half,\" Corrigan says.\n\n\n\n\n\n\"When you get into bed tonight and you pull the doona up, just cut some holes in it, see how well it works.\"\n\n\n\nCan you afford it?\n\nWhen considering whether to invest in a battery system, Corrigan says the first consideration is cost, as they are expensive and many people don't have the money sitting in the bank.\n\n\n\n\n\nThose who already have a solar system should check whether their inverter is battery-compatible, as this could also raise warranty issues if it needs to be replaced.\n\n\n\n\n\nAnother consideration is what your next car will be.\n\n\n\nREAD MORE Why Australians are buying EVs even if they can't charge the cars at home\n\nCorrigan says in one to two years, electric vehicles will be capable of vehicle-to-home and vehicle-to-grid functionality, allowing EV batteries to be used to power your home.\n\n\n\n\n\n\"Some people are already doing it,\" he says.\n\n\n\n\n\nThey are an attractive option because EV batteries generally have a huge capacity of around 50-70kWh.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-forever-chemical-blind-spots/ci1dqw9qz",
        "title": "Australia's 'forever chemical' blind spots — and what could reduce your levels",
        "publish_date": "Sat, 14 Jun 2025 05:00:54 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Many Australians have some level of PFAS — often dubbed forever chemicals — in their body, but understanding their impacts and strategies for reducing them is lacking.\n\n\n\n\n\nThis week, scientists and experts continued to give evidence to a federal inquiry investigating the regulation and management of per- and poly-fluoroalkyl substances, or PFAS.\n\n\n\n\n\nTheir remarks highlighted a series of knowledge gaps that make it difficult to ascertain the health impacts of these chemicals, which are present in our environment and bodies.\n\n\n\n\n\nIt also served as a reminder about one of the only known ways to reduce our levels.\n\n\n\nWhat are PFAS, and how common are they?\n\nPFAS are synthetic compounds found in a variety of industrial and consumer products, including makeup, non-stick cooking surfaces and food packaging, due to their heat, stain, grease and water-resistant properties.\n\n\n\n\n\nThey have even been found across water filtration plants, with high contamination levels in Warragamba, North Richmond and the Cascade Dam in the NSW Blue Mountains region.\n\n\n\n\n\nThey often don't degrade in the environment and build up in our bodies, earning them the title \"forever chemicals\".\n\n\n\n\n\nProfessor Peter Sly, deputy director of the Queensland Children's Medical Research Institute, said control groups with no level of PFAS simply \"don't exist anymore\".\n\n\n\n\n\n\"I'm afraid every person in Australia has PFAS levels in their body. It's a matter of how high they are,\" he told the PFAS committee hearing on Tuesday.\n\n\n\nPFAS are a group of chemicals that can be added to household products to make them heat, stain, grease or water resistant. Source: SBS News Last month, the Australian Bureau of Statistics (ABS) released data that tested for 11 different PFAS levels in the general population.\n\n\n\n\n\nIt detected three types of PFAS in the blood of over 85 per cent of the population.\n\n\n\n\n\nWhile research groups currently test for over 40 different types of PFAS, the ABS estimates there are more than 15,000 identified compounds belonging to the PFAS class of chemicals.\n\n\n\nHow to reduce your PFAS levels\n\nIn 2022, a world-first Australian study investigated whether blood and plasma donations could remediate elevated PFAS levels in 285 firefighters.\n\n\n\n\n\nHistorically, firefighters have been exposed to higher levels of PFAS through the frequent use of firefighting foams, although alternatives have since been developed that do not include these chemicals.\n\n\n\n\n\nFollowing 12 months of testing staff, the study found that those who donated blood every 12 weeks had a 10 per cent reduction in PFAS chemicals.\n\n\n\nREAD MORE The new guidelines designed to make your drinking water safer\n\nThe group that donated plasma every six weeks had their PFAS levels reduced by 30 per cent, with no significant change for the control group who did neither.\n\n\n\n\n\nMiri Forbes, one of the study authors and an associate professor at Sydney's Macquarie University, said understanding the impact of the reduced levels on the human body requires further study.\n\n\n\n\n\n\"We don't know yet. This is the first study that has found how we can reduce PFAS,\" she told SBS News.\n\n\n\n\n\n\"It was really exciting to know that it's possible to be able to reduce the levels of PFAS we can measure in the blood, but we need to understand, what are the health implications of that?\"\n\n\n\n\n\nOther observational studies have found women have reduced levels. PFAS leave the body during menstruation and the replenished blood supply doesn't have PFAS, lowering the overall levels.\n\n\n\nWhat don't we know about PFAS?\n\nMartyn Kirk, a professor of epidemiology at the Australian National University, told SBS News that there is still plenty we don't know about PFAS.\n\n\n\n\n\nThese blind spots include;\n\n\n\nThe long-term health impacts of low exposure\n\nThe health impacts on highly exposed individuals\n\nWhere exposure comes from in the household environment\n\nMethods of reducing PFAS\n\nWhile there have been studies that have linked higher levels of PFAS with health impacts, such as higher levels of cholesterol, many don't yield consistent results, making conclusions difficult.\n\n\n\n\n\nKirk said longitudinal studies, which can be reproduced and repeated, are needed to capture exposure levels across different areas and ages as well as demonstrate where levels decline over time.\n\n\n\n\n\nHe believes highly exposed people, such as firefighters, present an opportunity to understand the link to different health outcomes.\n\n\n\n\n\n\"You've got a much greater chance of being able to identify the potential relationship between exposure and disease, whereas in the community, the levels are often very low,\" he said.\n\n\n\nA barrier to obtaining datasets for scientific research is the cost of samples, which are complex to interpret and expensive as a result.\n\n\n\n\n\nSly suggested a biomonitoring program by collecting leftover blood from hospitals and pooling samples.\n\n\n\n\n\n\"By pooling samples, you protect individuals' identity, and secondly, you only have to measure one sample rather than ten or 100,\" he told the PFAS committee on Tuesday.\n\n\n\n\n\n\"And you can get levels across the population,\" he said, adding that a similar method was currently used to test wastewater for drugs.\n\n\n\nShould we be concerned?\n\nCompanies started phasing out PFAS in the late 1990s and early 2000s, leading to a drop in exposure and blood levels as a result, said Kirk.\n\n\n\n\n\n\"We've seen declines in the levels of PFAS in people's blood since 2000,\" he said.\n\n\n\n\n\n\"So we've had nearly a 10-fold decrease in the levels of PFAS in the blood of Australians, and that continues to decrease.\"\n\n\n\nHe said that unless you're working in one of the industries that are highly exposed, you probably don't have levels that are of concern.\n\n\n\n\n\nHowever, he noted anxiety in specific communities like at Wreck Bay on the NSW south coast, where an Aboriginal community believe a \"cancer cluster\" is due to PFAS contamination caused by the Department of Defence.\n\n\n\n\n\n\"I think we do need to understand better to assist those communities and also provide better information for the wider community and government to make good policy.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-deep-sea-cannot-become-the-wild-west/287okplhv",
        "title": "'The Deep Sea cannot become the Wild West'",
        "publish_date": "Sat, 14 Jun 2025 02:07:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe ocean floor is home to huge quantities of many of the world's most critical minerals.\n\n\n\n\n\nSo-called 'polymetallic nodules' - containing nickel, copper and cobalt - have taken thousands, even millions of years to develop.\n\n\n\n\n\nAnd the race to start mining them is underway.\n\n\n\n\n\nSome of these mineral-rich areas fall within countries’ exclusive economic zones.\n\n\n\n\n\nAnd while a state can mine its own water in international waters, the industry has until now been held up until a code is established by the U-N's International Seabed Authority, or the I-S-A.\n\n\n\n\n\nAline Jaeckel is an Associate Professor at the Australian National Centre for Ocean Resources and Security.\n\n\n\n\n\nShe tells S-B-S that some states are already exploring their options.\n\n\n\n\n\n\"It's important to note that we don't actually have any commercial scale mining at the moment, so neither in states own waters, nor on the international seabed. What we do have is mineral exploration, which is the sort of preliminary stage of studying a mineral deposit and the environment conditions at a potential mine site. And so there's a handful of states that are pursuing mineral exploration in their own waters and there has been exploration on the International Seabed for some time, but there is no commercial scale mining at the moment.\"\n\n\n\n\n\nBut U-S President Donald Trump, wanting the U-S to be a so-called \"global leader\" in seabed exploration, signed an executive order in April fast tracking the process.\n\n\n\n\n\nThe order will open up the U-S, as well as international waters, to deep-sea mining.\n\n\n\n\n\nOne company has already sought a permit from the Trump administration to begin commercial mining in the Clarion-Clipperton zone.\n\n\n\n\n\nA major area of interest in the Pacific Ocean, this vast stretch of ocean floor is abundant with critical minerals.\n\n\n\n\n\nAt the UN Ocean summit in France, world leaders are demanding strict rules around deep-sea mining.\n\n\n\n\n\nAmong those calling for the regulations was U-N Secretary General Antonio Guterres.\n\n\n\n\n\n\"Nations are now addressing navigating new waters and seabed mining. I support the ongoing work of the International Seabed Authority on this important issue. The deep sea cannot become the Wild West.\"\n\n\n\n\n\nProgress has been made on a landmark agreement, the High Seas Treaty, which seeks to protect marine life in international waters.\n\n\n\n\n\nMore countries are now joining the roughly three dozen that have already backed a moratorium on deep-sea mining.\n\n\n\n\n\nBut the uncertain rules and regulations around who has authority is causing alarm.\n\n\n\n\n\nThe U-S is not a party to the International Seabed Authority.\n\n\n\n\n\nGreenpeace Political Campaigner Megan Randles says there should be no deep sea mining at all.\n\n\n\n\n\n\"We think that deep sea mining should never be able to start. It's almost incredible that we're having this debate on opening up a new extractive industry at a time when the ocean is under so much pressure and we're trying to protect it. The science is very clear - deep sea mining will cause potentially irreversible damage to the ocean.\"\n\n\n\n\n\nNext month a crucial meeting on creating a rule book for ocean mining will take place in Jamaica.\n\n\n\n\n\nThe 'High Seas Treaty' seeks to preserve the seabed.\n\n\n\n\n\nAnd Aline Jaeckel says there will be a lot of scrutiny over the potential harms to marine life.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/when-a-good-deed-becomes-a-privacy-disaster-a-sperm-donor-speaks-out/e54xaajb4",
        "title": "When a good deed becomes a privacy disaster: a sperm donor speaks out",
        "publish_date": "Fri, 13 Jun 2025 21:30:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"You've created something beautiful, which was supposed to be a good deed. It's almost like you're being punished because your information was held on a computer system.\"\n\n\n\n\n\nThat’s a sperm donor whom we will call Isaac.\n\n\n\n\n\nSBS News has used an actor to record his comments, to obscure his identity and protect his sensitive personal information, which was part of a data breach earlier this year.\n\n\n\n\n\nIt all began when he agreed to be a sperm donor for some friends of his who couldn’t conceive themselves.\n\n\n\n\n\n\"Being a sperm donor is the epitome of awkward. You kind of feel like you're a bit of produce to some extent, which has been selected by your genetic characteristics. Personally, it's like why did they choose me? And that's an interesting thing, which makes you go to the depths of your own self-confidence. But the whole process is naturally incredibly awkward because effectively you've been chosen to jizz in a cup.\"\n\n\n\n\n\nBut Isaac wanted to help the couple and agreed to go ahead with being their sperm donor.\n\n\n\n\n\nI-V-F ((in vitro fertilisation)) treatment is becoming increasingly more common in Australia, with one in every 18 births now a product of the process.\n\n\n\n\n\nThe couple decided to go to Genea Fertility, one of Australia’s largest I-V-F clinics, where staff asked Isaac several probing questions about his medical history, and he underwent a series of psychological sessions.\n\n\n\n\n\n\"You go through the longest form I've ever been through in my life. Any diagnosis you've had, any medication you've had. The staff there were really, really lovely, and particularly given the awkwardness of a sperm donation, they're adept at handling that awkward situation.\"\n\n\n\n\n\nIsaac also spoke to staff about intimate personal circumstances, about himself and his family.\n\n\n\n\n\n\"People have mental health issues, and medication could be quite a lifesaver. I have a history of taking medication since I was 17 years old. It's still highly stigmatised. I also have a family history of autoimmune disease.\"\n\n\n\n\n\nWith his donation, the couple conceived their first child, but the joy Isaac feels for helping his dear friends start a family has been mixed with frustration and anger.\n\n\n\n\n\nIn February, Genea informed Isaac via email that his data was among a batch that had been breached by cybercriminals and posted to the Dark Web.\n\n\n\n\n\nThe exposed data includes people's medical history, diagnoses and treatments, medications and prescriptions, and pathology and diagnostic test results.\n\n\n\n\n\n\"You've created something beautiful, which was supposed to be a good deed. It's almost like you're being punished because your information was held on a computer system. I don't know what the next step is, but having some information about what the fuck's happening is probably a bloody good step.\"\n\n\n\n\n\nNot only could Isaac be at risk of fraud or blackmail, but so could any children conceived through the clinic, including his friend’s newborn.\n\n\n\n\n\nFour months later, he feels left in the dark about what Genea is doing to protect customers from hackers and scammers.\n\n\n\n\n\nGenea declined to be interviewed by SBS News, instead pointing to statements it has made on its website.\n\n\n\n\n\n\"Our teams and cybersecurity experts are working hard to urgently review the impacted data. This is a detailed and complex process which will take some time to complete to ensure we can clearly understand the nature and extent of the data that has been published and identify impacted individuals.\n\n\n\n\n\nSo what happens now?\n\n\n\n\n\nProfessor Dali Kaafar is the executive director of Macquarie University's cybersecurity hub.\n\n\n\n\n\nHe says investigating cybercrime can be a lengthy process and in the meantime, Isaac's personal data could be used against him.\n\n\n\n\n\n\"If they actually sense some form of vulnerability with their victim, for instance, the victim is trying to hide some sort of information from the employer or from their families, they'll probably try to leverage that in a form of blackmail.\"\n\n\n\n\n\nProfessor Kaafar predicts data breaches will only become more frequent, especially against companies like Genea.\n\n\n\n\n\n\"Health providers handle obviously vast amounts of highly sensitive personal information, not only the medical histories or the diagnosis, et cetera, but things like contact details of patients and so on. So it makes them immediately attractive targets for cybercriminals. And so I think the very first explanation or the very first view of why the health sector is consistently reported as the highest number of data breaches in Australia and globally as well, by the way, is largely due to that first piece, which is the volume and the sensitivity of the data is there. They're definitely by nature a very attractive target for cyber criminals.\"\n\n\n\n\n\nIt’s a scary thought for Isaac when he thinks about both his future and that of the donor-conceived child.\n\n\n\n\n\n\"What happens if I get a job which is relatively high profile or dealing with sensitive activity, could this open me up to not getting employed because an employer might've found my internet history, and maybe they have had ethical concerns or concerns with my health record? There are lots of bits and pieces which we all choose to disclose or not disclose as we go about our day. And if that information is out there, it's taken away my agency and my choice to disclose that information if I want to. That's only compounded further by the lack of information that I've been provided about this investigation and the data breach.\"\n\n\n\n\n\nHe wants to see consequences for the data breach and for Genea to be held accountable.\n\n\n\n\n\n\"Some things are more sensitive than others, and if you're at the more extreme end of sensitivity, you want the ramifications to be higher and you also want to make sure there's incentive to not have this happen again.\"\n\n\n\n\n\nUnlike financial fraud, where victims can demonstrate losses as a dollar figure, the value of a person's privacy is subjective.\n\n\n\n\n\nFaith Gordon, an associate professor in law at the Australian National University, says people affected by breaches can make legal claims for the breach itself as well as its impact, and there could be compensation for losses such as embarrassment, humiliation and anxiety.\n\n\n\n\n\n\"There's a lot of legal and ethical accountability for these clinics. They do have ethical and also legal duties. For example, under Australian law, Australia's Privacy Act, there is health data protection requirements and there's medical ethical guidelines as well about informed consent and data protection. So breaches can give rise to claims for this breach and for the impact of it.\"\n\n\n\n\n\nAssociate Professor Gordon says there's more that can be done to protect people, especially children conceived through these clinics\n\n\n\n\n\n\"A data breach could expose very, very personal information, including names and dates of birth and donor status and notes about embryos. So that can result in significant stigma and psychological harm and potentially future discrimination as well. Child ren have very specific rights and very specific vulnerabilities, and these need to be protected, and they also need to be empowered to actually access justice when something does go wrong in this space as well.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-australian-homes-are-so-cold-and-what-you-can-do-about-it/mm2mecuff",
        "title": "Why Australian homes are so cold — and what you can do about it",
        "publish_date": "Fri, 13 Jun 2025 20:36:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Winter has arrived in Australia, and you may have noticed it feels just as cold — or even colder —inside your home compared with outside.\n\n\n\n\n\nAustralia is typically considered a warm country, and winter temperatures do not reach the lows recorded in many other parts of the world.\n\n\n\n\n\nBut inside many homes, it's a different story.\n\n\n\n\n\nHere's why they feel so cold, and what you can do to keep warm.\n\n\n\nWhy are Australian houses so cold?\n\nIf you live in Australia and you're feeling the cold, you're not alone.\n\n\n\n\n\nContent creators from colder places, such as Canada, the United States, and the United Kingdom, have taken to social media to question why Australian houses are so cold compared to those overseas.\n\n\n\nThe World Health Organization (WHO) recommends houses should be kept at a minimum of 18 degrees to support general health and wellbeing.\n\n\n\n\n\nAccording to the WHO, colder temperatures can have negative impacts on respiratory, cardiovascular and mental health. Cold temperatures can also make mould in a house worse and weaken a person's immune system.\n\n\n\n\n\nBut according to a 2023 study published in the Energy Research and Social Science journal, across the sampled homes, 81 per cent were below 18 degrees from June to August, with an average temperature of 16.5C.\n\n\n\n\n\nAustralian homes were colder than Finland, which averaged temperatures of 20 to 24 degrees, and Greenland, which had an average indoor temperature of 21.8C.\n\n\n\n\n\nAustralian homes are often uninsulated, draughty, or fitted with inefficient heaters, meaning they are prone to letting in cold air and letting out warm air.\n\n\n\nAustralia's regulatory standards and building codes have also historically been less stringent than other countries, according to Professor Ralph Horne, associate deputy vice chancellor of research and innovation at RMIT.\n\n\n\n\n\n\"As far back as 2005, research comparing Australian cities to those overseas found housing in compatible climate zones in North America and Europe was 55 per cent more efficient for heating and cooling energy compared to minimum standard housing in Australia,\" he said.\n\n\n\n\n\n\"The average energy efficiency [NatHERS] rating of all the overseas comparison homes was over seven stars, and we have yet to implement seven stars here in Australia, almost 20 years later.\"\n\n\n\nWhat can you do to make your house warmer?\n\nFortunately, there are a few things you can do to enhance the warmth inside your home.\n\n\n\n\n\nIf you own your property, consider retrofitting and upgrading your heating and insulation systems.\n\n\n\n\n\nThis can include improving insulation in the floor, walls and ceilings, and sealing cracks in windows, door frames and floors.\n\n\n\nInstalling a split-system air conditioning and heating system, as well as floor heating, can also help make your house feel warmer.\n\n\n\n\n\nYou should also regularly maintain heating systems and clear out filters to ensure they are working efficiently.\n\n\n\n\n\nUpgrading heating systems can be costly, and energy efficiency expert Adam Corrigan, founder of Your Energy Friend, said each household is different and there are many energy-saving options to consider.\n\n\n\n\n\nThe first thing he recommends for households is to analyse their power bills and shop around to get the best deal, followed by making your house more energy-efficient.\n\n\n\n\n\n\"If you want to make your home more comfortable, get your insulation sorted and do your draft proofing. That's your best return on investment. That's your best bang for buck,\" he said.\n\n\n\nCorrigan said simple changes such as installing heavy-lined curtains and a box pelmet (which goes around the top of the curtain) can be very effective at keeping your home warm and are much cheaper than double-glazed windows, for example.\n\n\n\n\n\nWhile renters cannot make such changes to homes, there are some affordable options to stay warmer in winter.\n\n\n\n\n\nIf your house has draughts, you can apply weather strips, 'door snakes' or other barriers around windows or door frames to prevent cold air from entering the house, and to block warm air from escaping.\n\n\n\n\n\nIf you have hard floors, adding rugs can provide some insulation and add warmth underfoot, and if you have ceiling fans, using the reverse setting can distribute warm air from the ceiling.\n\n\n\nFor rental homes without heating systems, portable electric or oil heaters can be an effective option for heating up single rooms. To maintain the desired heating in a specific area, ensure doors and windows are closed to prevent heat from escaping.\n\n\n\n\n\nHorne said while Australia has had a longstanding awareness of drought and water efficiency, there has not been enough of a focus on energy efficiency in homes — meaning many residents are now left in cold houses, and unable to afford heating.\n\n\n\n\n\n“An implicit reliance on cheap energy has now become increasingly challenged by the need to respond to climate change, and the rise in energy poverty.\n\n\n\n\n\n\"For a variety of reasons, energy costs have risen across Australia and this has brought to light the inefficiency of Australian homes, as households struggle to keep the heating on and pay the bills.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/an-undiminished-jimmy-barnes-had-fans-on-their-feet-for-this-classic-20250611-p5m6nn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An undiminished Jimmy Barnes had fans on their feet for this classic",
        "publish_date": "Sun, 15 Jun 2025 12:22:45 +1000",
        "category": "entertainment",
        "authors": [
            "Will Cox",
            "Jessica Nicholas"
        ],
        "text": "MUSIC\n\nJimmy Barnes ★★★\n\nPalais Theatre, June 13\n\nWhen I was a child, I got a Jimmy Barnes CD out of a packet of muesli bars. I didn’t have a CD player, so I just had to imagine what it might sound like.\n\nJimmy Barnes at The Palais, touring his 21st studio album, Defiant. Credit: Richard Clifford\n\nI already had enough Barnesy in my blood to have a good guess. His songs are part of the Australian collective unconscious. They play in our dreams. They give them away in muesli bar packets.\n\nBarnes is now touring his 21st studio album, Defiant. A few hours before he took to the stage, it went to No. 1 in the album charts. It’s his 15th No.1 album (19th if you count Cold Chisel). He plays virtually all of that record tonight. His gruff yarl is undiminished by age and recent heart surgery.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/conservation/forrest-calls-for-global-fishing-overhaul-as-australia-backs-major-treaties-at-un-summit-20250615-p5m7ic.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Forrest calls for global fishing overhaul as Australia backs major treaties at UN summit",
        "publish_date": "Sun, 15 Jun 2025 12:20:19 +1000",
        "category": "finance",
        "authors": [
            "Alex Condon"
        ],
        "text": "Australian mining billionaire Andrew Forrest has called for the United Nations to back a major overhaul of global fishing regulations and marine life protections following an international ocean summit last week.\n\nAustralia’s Environment Minister Murray Watt also attended the 2025 UN Ocean Conference (UNOC3) in Nice, France, and confirmed on Friday the federal government has joined 96 other nations in committing to end plastic pollution.\n\nDeclaring “the ocean is in freefall”, Forrest made the comments following the summit on Saturday, saying his Minderoo Foundation will commit an additional $25 million towards implementing new marine protected areas and real-time vessel monitoring.\n\nAndrew Forrest has called for major action to be taken on fishing and plastic waste. Credit: Bloomberg\n\n“We must lock in 30 per cent no-take marine protected areas by 2030 in every nation, in the high seas [international waters] and across at least 30 per cent of Antarctica – this must be the minimum, not the maximum – and it must be enforced, not just declared,” the WA-based magnate said in a statement.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/mt-coot-tha-to-get-a-major-makeover-under-ambitious-tourism-push-20250615-p5m7iw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mt Coot-tha to get a major makeover under ambitious tourism push",
        "publish_date": "Sun, 15 Jun 2025 12:14:10 +1000",
        "category": "sports",
        "authors": [
            "William Davis"
        ],
        "text": "A renovated lookout, new hiking and mountain bike trails, a “glamping” nature retreat, and upgrades to the planetarium and tropical dome are among the proposals set to be explored for Mount Coot-tha, Brisbane City Council announced on Sunday.\n\nNight-time light shows in the Brisbane Botanic Gardens, a summit tree-top walk, new picnic areas and pop-up cafes, transformation of the quarry, and the reconfiguration of Sir Samuel Griffith Drive are also under consideration.\n\n“We want the world to discover Brisbane and fall in love with its lifestyle and natural attractions,” Lord Mayor Adrian Schrinner said in a statement announcing the project.\n\nIn addition to the upgraded and expanded tropical dome, night-time light shows will illuminate the Botanic Gardens. Credit: Brisbane City Council\n\n“Brisbane is riding a wave of international popularity as a tourism destination, and with the 2032 Olympic and Paralympic Games coming, now is the time to start planning more to see and do in our city.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/middle-east/how-the-clocks-stopped-for-netanyahu-allowing-him-to-go-full-hezbollah-on-iran-20250615-p5m7hr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the clocks stopped for Netanyahu, allowing him to go ‘full Hezbollah’ on Iran",
        "publish_date": "Sun, 15 Jun 2025 11:43:46 +1000",
        "category": "finance",
        "authors": [
            "Paul Nuki"
        ],
        "text": "“I must govern the clock, not be governed by it.” So said Golda Meir, one of Israel’s founders and its first and only female prime minister.\n\nNow, some 50 years later, the Israel Defence Forces (IDF) may have realised her insight. Indeed, they have taken the clock and blown it to smithereens, neutralising its power to contain them once and for all.\n\nIsraeli Prime Minister Benjamin Netanyahu shows an illustration as he describes his concerns over Iran’s nuclear ambitions during an address to the United Nations General Assembly in 2012. Credit: AP\n\nFor the mullahs of Iran, this could spell curtains, or at least a long and painful “Hezbollah-isation” stretching over weeks and months.\n\nThe clock has always been central to Israeli military planning, with its strategists at the Kirya in central Tel Aviv long regarding it as important as guns and manpower.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/great-scott-aussie-poised-to-make-history-at-the-us-open-20250615-p5m7i7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Old man golf’: Aussie veteran poised to make history at the US Open",
        "publish_date": "Sun, 15 Jun 2025 11:05:47 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Veteran Australian golfer Adam Scott could make history on Monday after overcoming treacherous conditions at the US Open to put himself into contention to win a second of golf’s major tournaments.\n\nScott sits in equal second at three-under, after finishing the third round at Oakmont Country Club with a three-under par 67. The 44-year-old held a share of the lead toward the end of his round, but will go into the last day just one shot behind leader Sam Burns.\n\nIf Scott goes on to win the US Open, he will break a record for the longest wait between first and second major wins - after the Queenslander famously won his first in 2013 with a drought-breaking victory at the Masters. Scott would also become the second-oldest golfer to win a US Open.\n\nScott showed all his experience and guile on Sunday, coming home with three birdies in the final six holes",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/leicester-prop-binned-in-final-20250615-p5m7it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leicester prop binned in final",
        "publish_date": "Sun, 15 Jun 2025 11:02:57 +1000",
        "category": "sports",
        "authors": [],
        "text": "Leicester prop binned in final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/former-royal-insider-breaks-down-trooping-the-colour-20250615-p5m7is.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former royal insider breaks down Trooping the Colour",
        "publish_date": "Sun, 15 Jun 2025 11:02:20 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Former royal insider breaks down Trooping the Colour\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-mid-season-verdict-he-s-a-star-blue-but-at-the-moment-he-s-just-going-20250529-p5m3b5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mid-season verdict: From grand final one year to D+ the next",
        "publish_date": "Sun, 15 Jun 2025 10:33:27 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Andrew Wu"
        ],
        "text": "Who’s not: Noah Balta owes his club big time. Just two months after signing a mammoth seven-year contract extension, the key defender assaulted a man in a NSW car park. As a result of the club-imposed sanction and the curfew ordered by the magistrate, Balta has played just five out of 13 games in a season when the Tigers need his experience. It’s a big final three months of the season for Dion Prestia, who has managed only 15 of 36 games since the start of last year due to a series of injuries. The 32-year-old won’t be part of the Tigers’ next finals team but can play an important buffering role while prized picks Sam Lalor and Josh Smillie cut their teeth at the top level. The verdict: As tough as it may be for Tigers fans to watch their side lose most weeks, even the harshest judge would be encouraged by the progress made so early in their rebuild. While the exodus of mature-age talent was supposed to result in the reigning wooden-spooner plumbing deeper lows, the arrival of fresh blood who actually want to be there has seen the Tigers already improve on their two wins. With games to come against Essendon, West Coast (away), St Kilda and North Melbourne, they should be able to pick up another one or two wins to nourish the soul without much damage to their draft hand. Andrew Wu’s grade: C+ Gold Coast Suns (5th, 8 wins, 4 losses) Who’s hot: Well, it’s finally getting hot for the Suns where it really counts – on the ladder. They are primed to play finals for the first time in club history – but, yes, we have said that before, and a challenging run home to September awaits. This time, though, Damien Hardwick has his team playing a robust brand of football that should stand up when it counts. New skipper Noah Anderson is in All-Australian form, while Matt Rowell has added more run to his game. The Suns are giving Rowell time to sign a contract extension, but it’s a major worry the Victorian, with several suitors, has yet to do so. Perhaps that changes soon after the bye. Touk Miller is another midfielder pressing for All-Australian selection, while defender Sam Collins and mid-sized forward Ben Long would be locks for that team were it picked now. Key forward Ben King would also be close. Recruits Daniel Rioli and John Noble have done what was expected – provide dash and creativity from halfback.\n\nOn our way: Matt Rowell and Ben King have had strong starts to the season, helping the Suns eye a maiden finals berth. Credit: Getty Images Who’s not: Half-back flanker Connor Budarick has been in and out of the team and has not played at the senior level since the loss to the Lions. While Rioli and Noble enjoy the rebound accolades in defensive 50, a firing Budarick would also help. As Hardwick has noted, the Suns need to stop kicking to King when he is outnumbered. King had 23 goals in his first six games, the 24-year-old has 10 in his past six games. It’s over to Ethan Read, Jed Walter and Ned Moyle to get busy. The verdict: The Suns likely need only five more wins to book a September berth, but face a potentially tough month after the break – GWS [Engie Stadium], Melbourne [People First Stadium], Essendon [Marvel Stadium] and Collingwood [People First Stadium]. Richmond [in round 21] appears their only certain win in the run home, but if they are good enough, they will make the finals. Their game plan is strong – they are among the best teams for points from turnovers, intercepts and stoppages, and know how to lock the ball inside their forward-half. It’s about time the Suns broke their finals duck – we’re backing Hardwick in. Jon Pierik’s grade: B Sydney (13th, 5 wins, 8 losses)\n\nWho’s hot: Twelve months ago, the Swans were flag favourites and Isaac Heeney the top pick to win the Brownlow. That’s not the case now, but Heeney remains their best-performed player. The gun midfielder is on track for similar numbers to his career-best 2024 but is lacking the same impact. The same could be said of Chad Warner, whose form has improved since the distraction of being out of contract was removed. Tagger James Jordon can count midfield stars Sam Walsh and Zach Merrett among his scalps. Youngster Matt Roberts continues to grow as a running defender, backing up his rapid improvement from last year. Who’s not: An All Australian halfback last year, Nick Blakey is struggling with the extra attention on him. Injuries have forced the Swans to play him deeper, limiting his capacity to provide the springboard from defence that was a feature of their game last year. Ollie Florent paid the price for the Swans’ poor form, his recent omission ending a run of 130 consecutive games. Hayden McLean is another from their grand final team who has also been dropped this year as the Swans search for marking power in their weakened forward line. Now that he is fit after a wretched 18 months with injury, skipper Callum Mills has the chance in the second half of the season to remind his critics why the club made him captain. Verdict: Injuries have wreaked havoc with rookie coach Dean Cox’s first season at the helm. All Australians Errol Gulden, Tom Papley, Mills have all spent chunks of the season injured, as have reliable defender Harry Cunningham and young key forward Logan McDonald. Throw them all into the Swans’ 23, and it’s unlikely they would be in such a desperate position. The crowded casualty ward has exposed a lack of depth. That said, the Swans have been so poor in several games that it would not have mattered who they had on the park. A fitter list raises hope they can mount a charge for the finals, but they are coming from a long way back. Andrew Wu’s grade: D+ News, results and expert analysis from the weekend of sport are sent every Monday. Sign up for our Sport newsletter.\n\nTeams who had the bye in round 13 St Kilda (11th, five wins, seven losses) Who’s hot?\n\nJack Higgins has been a consistent force up forward, the small forward leading the Saints’ goal kicking – including four goals against Geelong – to be included in the All-Australian preliminary squad. Jack Sinclair (27 disposals per game) and Nasiah Wanganeen-Milera (28) have been two of the premier rebounding half-backs. The dashing Wanganeen-Milera, off-contract and weighing up offers to return home to South Australia, has become the Saints’ most important player, and the best player they have had in the past decade. That he has yet to agree to a contract extension by this point of the season is a major worry for the Saints. Former Western Bulldog Jack Macrae has been a strong leader through the midfield and found plenty of the ball (before a major lung injury), while intercept defender Callum Wilkie should be in All-Australian squad discussions. Youngster Hugo Garcia is making progress, despite a public spray from Ross Lyon during the loss to Brisbane and recent axing to the VFL. Marcus Windhager, one of several off-contract Saints, has, at times, been a stand-out, whether tagging or finding his own ball. Cookin’: Jack Higgins has had a strong season, and will be in All-Australian squad calculations. Credit: AFL Photos via Getty Images Who’s not?\n\nYoung midfielder Darcy Wilson has stagnated, while Mattaes Phillipou has endured an injury-hit start to the season, the latest a calf injury in the opening minutes against Melbourne. Wingman Brad Hill still provides dash, but there are times when he could rip a game open. Rowan Marshall has been steady, but is no longer among the conversation as one of the top three ruckmen in the league. Injuries to Max King and Zaine Cordy have hurt.\n\nVerdict: The Saints are 2-4 against top-eight teams, including their best win of the season, against Geelong. They are a system-based side, so, when the system wobbles, the whole team wobbles, which can lead to heavy defeats. The flip side is what we saw against Melbourne, when they dominated through scores from defence. That they are the only team to lose to the last-placed Eagles highlights the gulf between their worst and best. The Saints still remain a line-ball finals contender, as they were before this campaign began. Through that prism, they sit where many had expected. Jon Pierik’s grade: C+ Man on a mission: Caleb Serong has been influential for the Dockers this season. Credit: AFL Photos Fremantle (eighth, seven wins, five losses) Who’s hot?\n\nMidfield gun Caleb Serong (28 disposals per game) typically finds plenty of the ball, but has struggled, at times, when there has been an aggressive tag. Fellow star onballer Andrew Brayshaw (also 28 disposals per game) has been busy, and put his body on the line in the desperate final minutes against Gold Coast on Saturday, and is also firmly in contention for All-Australian selection. Jordan Clark has provided drive from half-back, Shai Bolton has added life inside attacking 50 and been arguably the second-best recruit of the season (behind Bailey Smith), while Luke Jackson has been at his best when used as a sole ruckman. The Dockers have been one of the more efficient teams, according to Champion Data, but need to find more marks inside 50 if they are to challenge for a top-four spot.\n\nLoading Who’s not?\n\nSean Darcy, tied to the club until the end of 2030, has largely been a shadow of his former self because of an off-season hampered by a knee issue but was strong in ruck contests in the wet against the Suns. Whether he and Jackson can thrive in the same team remains a burning question for coach Justin Longmuir. It also remains to be seen if talls Josh Treacy, Jye Amiss and Pat Voss can consistently also work alongside each other up forward, as the Dockers have struggled to turn inside-50 advantage into scores. That could also be because of a lack of speed with ball in hand, something the Dockers have looked to address. It was great to see Nat Fyfe back for his first senior game of the season last weekend. Hayden Young’s extended absence because of a serious hamstring injury which has required surgery has hurt. He shapes as an x-factor later in the season. Verdict: The Dockers remain an enigma. They have a list capable of finishing in the top four, reinforced by their win on the Gold Coast and their three wins in five games against top-eight teams, but have had head-shaking losses, including a 61-point defeat to St Kilda at Marvel Stadium, and a 14-point loss at home to a depleted Collingwood. The pressure remains on Longmuir to deliver a deep finals run. Jon Pierik’s grade: B- Teams who had the bye in round 12\n\nCarlton (12th, four wins, seven losses) Who’s hot?\n\nIn his 10th season, Jack Silvagni has been a revelation in his new role as a defender. Silvagni’s ability to stop high-quality forwards, from a key type like Aaron Naughton to the medium-sized threat like Patrick Dangerfield, intercept and launch counter-attacks is one of the reasons why the Blues, for all their problems, has been one of the more difficult sides to score against. A streamlined George Hewett is having a career-best season in the midfield at the age of 29, and Nick Haynes has overcome a horror start to life as a Blue by turning the clock back to the pre-pandemic years. Tom De Koning was the best ruck in the competition in the first month, but his form has tailed off. Jacob Weitering had been in All-Australian form before two below-par games coming into the bye. Jack Silvagni has been a revelation in defence for the Blues so far this season. Credit: AFL Photos Who’s not?\n\nThe Blues need more from their superstars. Patrick Cripps and Charlie Curnow are having reasonable years but are capable of finding another level. Harry McKay has struggled with consistency since returning from a mental health break, though his best has been the reason why the Blues have won. After another interrupted preseason, Sam Walsh has become just a player, unable to run opponents off their legs like he used to. The same can be said of Blake Acres, who is not having the same impact of his first two years at the club. Verdict: So much more was expected of the Blues, who have been one of the most disappointing clubs of the season. Despite having two Coleman medallists in their forward line the Blues are having enormous difficulties scoring. Their lack of class small forwards has hurt, but their ball movement is slow and imprecise. They are as tense as a patient visiting the dentist. Similar problems were overcome in 2023 when they mounted a stunning run to the preliminary final, but they do not have the same quality on their list. A friendly draw over the next month will give Blues fans hope but a finals berth is unlikely.\n\nAndrew Wu’s grade: D+ Tristan Xerri is mounting a case for All-Australian selection this year. Credit: Getty Images North Melbourne (17th, two wins, one draw, eight losses) Who’s hot?\n\nAfter a slow start to the season, Tristan Xerri is again mounting a strong claim for a maiden All-Australian blazer. The ruckman, with his attack on the ball and wholehearted manner in which he plays, has become the Kangaroos’ on-field spiritual leader. Small forward Paul Curtis has continued his improvement and, with 19 goals to the bye, is on track to pass his career-best haul of 30 last year. Cameron Zurhaar has rediscovered his bull-at-a-gate ways in attack to add much-needed bite to the forward line. Veteran Luke Parker has justified his acquisition on the field even if his greatest impact might be felt in the locker room. Who’s not?\n\nThis might be harsh on North’s leading possession-getter but Caleb Daniel is not having the impact he should. A damaging kick at his best, Daniel has often erred on the side of recklessness with his ball use by taking low-percentage options deep in defence. In his third year at Arden Street, Griffin Logue cannot get a clear run at it due to injury and now form. Dropped amid North’s horror run, Logue is yet to reclaim his position in the side. The Roos need more from experienced duo Aidan Corr and Zac Fisher, who have both had stints in the VFL.\n\nCaleb Daniel: Plenty of possessions but more impact needed. Credit: Getty Images Verdict: As painful as this season has been for their fans, North have actually improved. At this stage last year, they were winless with a percentage of 55.9 and uncompetitive. This year, they have been in contention at three-quarter-time in eight games. The question is whether North should be further advanced after five seasons in the bottom two. Given they have traded away their first pick, the Kangaroos would have expected to have picked up an extra win or two instead of being in the familiar position of 17th. Andrew Wu’s grade: D+ Port Adelaide (15th, four wins, seven losses)\n\nWho’s hot?\n\nPort’s best phase of the season came after Zak Butters returned from injury. Butters was instrumental in Port’s best win of the year, against Hawthorn, but needs more help in the guts. The Power cannot afford to lose him. Moved to half-back, Connor Rozee has maintained his high standards while others’ have fallen, though Port need him in the middle as well as providing run out of defence. Though not necessarily built for it, Mitch Georgiades has prospered being the main man in the forward 50. Miles Bergman’s star is on the rise though he, like Butters, may be on the move at season’s end. Who’s not?\n\nEsava Ratugolea, Ivan Soldo, and Jordon Sweet were recruited at the end of 2023 to help Port take the next step. Eighteen months on, those moves have not had the desired effect. Ratugolea is struggling in an overworked defence that does not get enough pressure on the ball from up the field. Sweet lost his spot after being monstered by Tim English, and his understudy Soldo is out of favour. The move of Jeremy Finlayson into defence lasted just one disastrous game against Collingwood. Ed Richards has been a midfield weapon for the Western Bulldogs. Credit: Getty Images Verdict: Ken Hinkley’s 13th and final season at the helm at Alberton is headed for an inglorious finish. Preliminary finalists last year, Port are headed for a bottom-six finish. The impending handover from Hinkley to Josh Carr is an easy target to explain Port’s poor season even though many had tipped them to be this season’s slider. The club would not have seen such a drop coming, given they traded out their first-round pick for Jack Lukosius, who has been injured. Most concerning is how quickly the Power have waved the white flag when things became difficult. Five of the heaviest losses of the Hinkley era have come in Port’s last 24 games.\n\nAndrew Wu’s grade: E Western Bulldogs (seventh, six wins, five losses) Who’s hot?\n\nEd Richards has morphed from a capable half-back into one of the game’s best midfielders in the past 12 months. Richards’ speed and penetrating left foot makes him a major weapon for the Dogs. Rebounding defender Bailey Dale, who had a career-best 49 possessions a fortnight ago, is on track for a second All-Australian blazer. Tom Liberatore is defying Father Time. Small forward Rhylee West is one of the most improved players in the league, thriving since taking over from the injured Cody Weightman. Matt Kennedy is close to the recruit of the year since his move from Carlton, revelling as a midfielder who can also be dangerous when moved forward. Who’s not?\n\nVeteran defender Liam Jones has struggled after having his pre-season severely disrupted by a serious hamstring injury. He lost his place to former cricketer James O’Donnell, who has performed admirably in the key defensive post alongside the rejuvenated Rory Lobb. Injuries threatened to derail the season. Marcus Bontempelli, Adam Treloar, Sam Darcy have all spent significant periods in a star-studded casualty ward at Whitten Oval, but all are either back or will return shortly after the bye for the Dogs’ run to September. Loading",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/piastri-hits-wall-of-champions-20250615-p5m7io.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri hits Wall of Champions",
        "publish_date": "Sun, 15 Jun 2025 10:32:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "Piastri hits Wall of Champions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 15 Jun 2025 10:27:20 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "WHERE AM I?\n\nWhich theatre is this? Credit: Luis Ascui\n\nThis heritage-protected theatre was originally named after a British princess in 1886 but has undergone many identity changes since. It was once the largest theatre in the southern hemisphere and hosted Dame Nellie Melba’s Australian opera debut. What is the venue’s name, and where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The Fire Services Museum of Victoria is located in East Melbourne.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/scott-moves-into-share-of-lead-20250615-p5m7ij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Scott moves into share of lead",
        "publish_date": "Sun, 15 Jun 2025 10:20:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Scott moves into share of lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/crowd-roars-at-russells-verstappen-dig-20250615-p5m7i5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crowd roars at Russell's Verstappen dig",
        "publish_date": "Sun, 15 Jun 2025 09:47:37 +1000",
        "category": "finance",
        "authors": [],
        "text": "Crowd roars at Russell's Verstappen dig\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/tensions-boil-over-in-los-angeles-during-no-kings-protest-20250615-p5m7i3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tensions boil over in Los Angeles during 'No Kings' protest",
        "publish_date": "Sun, 15 Jun 2025 09:46:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tensions boil over in Los Angeles during 'No Kings' protest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/stunner-sets-scott-up-for-back-to-back-birdies-20250615-p5m7i2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stunner sets Scott up for back-to-back birdies",
        "publish_date": "Sun, 15 Jun 2025 09:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Stunner sets Scott up for back-to-back birdies\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/freo-survive-major-scare-as-roos-comeback-falls-short-20250615-p5m7hz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo survive major scare as Roos comeback falls short",
        "publish_date": "Sun, 15 Jun 2025 09:38:13 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle duo Luke Jackson and Josh Treacy have come to the rescue as the Dockers overcame a major late scare to secure a thrilling six-point win over North Melbourne at Optus Stadium.\n\nThe Dockers looked like they had Saturday night’s game in the bag after opening up a 28-point lead late in the third quarter.\n\nBut Jack Darling’s goal on the three-quarter time siren sparked a run of five straight goals for the Kangaroos, before a Paul Curtis behind with only seven minutes remaining levelled the scores.\n\nJosh Treacy of the Dockers takes a mark. Credit: AFL Photos via Getty Images\n\nJackson popped up for what proved to be the match-winning goal when he latched on to a desperate handball from Jye Amiss and snapped truly in traffic with three minutes to go en route to the 10.13 (73) to 10.7 (67) victory.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/listings-from-1972-show-unbelievable-house-prices-in-nations-most-expensive-city-041123018.html",
        "title": "Listings from 1972 show unbelievable house prices in nation's most expensive city",
        "publish_date": "2025-06-14T04:11:23Z",
        "category": "finance",
        "authors": [],
        "text": "Five decades ago, the housing market looked unrecognisable. Find out how much the average home was selling for in Sydney's northern suburbs.\n\nThe prices of property 50 years ago were a lot different to now. Source: Getty/Facebook\n\nA page of real estate listings from 1972 has left Aussies shocked at just how much house prices have increased in the last 50 years. In the nation’s most expensive city — where the median home value is now more than $1.2m — property prices have increased by an eye-watering 5000 per cent since the listings were published.\n\nThe 1972 edition of The Realtor shows a page of homes located across Frenchs Forest, Belrose, Beacon Hill and Allambie Heights on Sydney's Northern Beaches. One three-bedroom home was for sale for just $23,950, while the most expensive property on the page is a four-bedder with “room for a pool” listed at $44,950.\n\nOne of the homes in Beacon Hill, valued at the time for $27,500, sold in 2021 for $2.55m — a staggering increase of more than 9000 per cent, outpacing the growth in average wages which has been under 2500 per cent over the same 53-year-period.\n\nNorthern beaches realtor Mark Novak from Novak Properties told Yahoo News that even the smaller homes on the old listing page would be worth upwards of $2m now.\n\nADVERTISEMENT\n\n\"You can see in that photo, there's the little fellas that are just one level three-bedders, they're about that $2.2m mark. And then you can see the two storey examples, they're probably in the higher end of that $2.7m - $2.9m mark,\" he said. \"It's wild.\"\n\nThe listing from 1972 shows the homes priced between $20,000 and $45,000. Source: Paul Brennan/Facebook\n\nWeekly wage in 1972 was just $85\n\nWhile these days you’d be lucky to get a new car for those 1970s prices, back then it was still out of reach for some.\n\nThe average weekly wage in Australia in 1972 was $85.50, according to data from the Reserve Bank of Australia. This would put the average Australian’s annual salary at just under $4500 a year.\n\nTo purchase the cheaper three-bedroom home, a resident would be spending about five times their salary, though the interest rate was around 7 per cent.\n\nIn 2025, the typical Australian full-time worker earns just under $100,000. With the median house value in Frenchs Forest currently sitting at $2.2m, buyers would be forking out more that 22 times their salary to buy a home in the area.\n\nADVERTISEMENT\n\nWhile the increases feel ridiculously steep, Mark insists it's all part of the steady property trend that sees homes double in value every 10 years or so.\n\nHe described the area around Frenchs Forest as a \"lovely, honest, Australian\" neighbourhood, where the families work hard and care about their community. He said it's likely the people who bought their homes 50 years ago may not have been particularly wealthy, but are now sitting on a pot of gold.\n\nBut despite that, he made the interesting point that many of the homes on the listing remain relatively unchanged.\n\n\"The houses look the same. I think you'd find the kitchens and bathrooms have been changed, but structurally they're pretty similar from the outside.\n\n\"These are those guys where the furniture is the same. The cars are similar. They've kept everything. They bought once when they were real young and they never got in and out, or changed it. Whereas our generation and the newer generation, you're constantly evolving and changing, which costs money.\"\n\nADVERTISEMENT\n\nFor those first home buyers overwhelmed by today's prices who think they'll never be able to afford a home, Mark says it is absolutely possible and offered a tip.\n\n\"Use your super. First home buyers can use their super, but not many people know that. They can voluntarily contribute to their super above their normal repayments and then pull it out to buy a property so they can save faster,\" he said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]