[
    {
        "url": "https://www.9news.com.au/national/agent-buys-cutprice-home-of-retiree-with-alzheimers/418bb1f6-4dbf-4310-bc58-8d4c2ce0e190",
        "title": "Real estate agent buys cut-price home of retiree with Alzheimer's",
        "publish_date": "Fri, 26 Sep 2025 03:18:37 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A real estate agent who believed she was doing the \"right thing\" by buying a vulnerable retiree's property at $500,000 below market value has had her licence suspended.\n\nRachelle Carmen Nohra took advantage of the 82-year-old with alcohol problems and symptoms of Alzheimer's by purchasing his Sydney home for $600,000.\n\nShe offered this price despite knowing his property had a similar value to one sold next door for $1.1 million.\n\nNohra, who is the director of Eser Property in Greystanes, purchased the man's home at a \"significant undervalue\" in a personal capacity in April 2023, a tribunal decision published yesterday revealed.\n\nShe promised that the retiree - known for legal reasons as Mr A - could remain living at the property for the rest of his life.\n\nHowever, their subsequent tenancy agreement allowed him to be evicted with 90 days' notice, the NSW Civil and Administrative Tribunal found.\n\nNohra did not appear to understand there was a conflict between her own interests and the retiree's when she bought his property or that he was vulnerable to be taken advantage of, the tribunal said.\n\n\"(Her) lack of insight into such basic matters is of serious concern to the tribunal,\" senior member Lachlan Bryant wrote.\n\nNohra had approached the tribunal seeking to overturn a decision by the Commissioner for Fair Trading suspending her licence for a year, imposing a $11,000 fine and directing her to undertake further training.\n\nShe contended that she was still a \"fit and proper person\" to act as a real estate agent.\n\nInstead, Bryant found she had taken advantage of the 82-year-old by purchasing his property without giving him the chance to get financial or legal advice.\n\n\"Subject to the costs of the sale, the applicant stood to gain a windfall from the sale of around $500,000, on her own estimates, and upon its completion was enriched to (the retiree's) detriment,\" he wrote.\n\nHer actions were \"sufficiently closely connected to her profession\" to warrant reprimand and punishment, the tribunal found.\n\n\"(Nohra's) belief that purchasing (his) property in the circumstances was the right thing to do is of serious concern,\" Bryant said.\n\n\"(Her) conduct may put the real estate industry into disrepute and falls short of the community's expectations of a licence holder.\"\n\nShe had failed to repay further money to the retiree or take steps to ensure his tenancy at the property was secure over the long-term, Bryant noted.\n\nHowever, he declined to impose a higher penalty sought by Fair Trading - including cancelling her licence completely and banning her from acting as a real estate agent for three years.\n\nThat was \"too harsh\", he found.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/macquarie-repay-shield-investors-michael-donovan-relieved-to-be-refunded-after-collapse-exclusive/c2381615-6ff9-41fc-a773-322d9a1fdb25",
        "title": "Micki thought he'd lost $150k. Then an email arrived in his inbox",
        "publish_date": "Thu, 25 Sep 2025 19:44:30 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "E﻿xclusive: A NSW chef who lost his $150,000 retirement fund in the multibillion-dollar super collapse is \"hugely relieved\" he will have his nest egg returned next week.\n\nMichael \"Micki\" Donovan, 58, ﻿from Bermagui on the NSW South Coast was left without a cent in his super when Shield Master Fund collapsed and went into liquidation.\n\nMacquarie Investment Management Ltd (MIML), a subsidiary of the Macquarie investment bank, this week said 3000 investors like Donovan will have 100 per cent of their money reimbursed by September 30.\n\nMichael Donovan was worried he'd lost $150,000 of his retirement fund after Shield's collapse. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nDonovan told 9news.com.au ﻿he will need to delay his retirement after missing out on thousands of dollars in interest as he waited for his money to be returned.\n\n\"I've still got a mortgage... so it was all I had to retire on in another five or six years because I'm a chef and I can't keep working at this age,\" Donovan said.\n\n\"It's set me back three, four years at least.\"\n\nDonovan realised his $150,000 had been frozen when he went to transfer it back to his original fund ﻿to claim disability insurance after tearing his rotator cuff.\n\nHe said he called MIML on September 5 but was told he \"didn't have any super left\".\n\nIt triggered a weeks-long nightmare for Donovan.\n\nThe hard-working chef is still recovering from his injury and wondered if he'd ever be able to retire.\n\n\"I left Bermagui, I was that depressed... I came up to Mudgee to see my best friend,\" Donovan said.\n\n\"﻿I've got friends in Mudgee, I worked here years ago. I could get some work here, do a couple of jobs here and there until my shoulder heals.\n\n\"I just couldn't believe it. Without my friends around me here in Mudgee, I didn't see any future.\"\n\nHe added: \"It's been a hard slog and I haven't slept for weeks.\"﻿\n\nDonovan told 9news.com.au ﻿he will still need to delay his retirement. (Supplied)\n\nDonovan joined a Facebook group of over 1500 other Australians who have been impacted by the collapse of both Shield Master Fund and First Guardian Fund.\n\nAround 12,000 Australians have been caught up in the $1.2 billion collapse.\n\nHe said the support of friends, along with thousands of other empathetic group members in his exact position, saved his life.﻿\n\nDonovan is still heartbroken for the countless others who haven't been told their money will be returned yet – if ever.\n\n\"﻿We're working-class Australians, there's something wrong with the system,\" he said.\n\n\"I'm not rich. It's only $150,000 and without my interest, it would have been more.\n\n\"But there's people who have lost hundreds of thousands more and they're at retirement... these poor people.\"\n\nDonovan calculates he has lost between $20,000 and $30,000 in interest since Shield's collapse.\n\nMIML won't pay back any potentially earned interest and has emailed Donovan to say he will be handed back 100 per cent of the net capital he invested in Shield by Tuesday.\n\n\"I had no idea it was Shield at all,\" he added, explaining he didn't realise where his money had been invested.\n\n\"It's a huge relief. I was pretty down, man. I know it's not huge money, but it's all I had.\"\n\n﻿He wants the superannuation industry to undergo urgent reform so no other Australian becomes entangled in another collapse.\n\nAccording to ASIC, around 5800 people invested their superannuation retirement savings into Shield.\n\n\"In many cases, this happened after people were contacted by lead generators and referred to financial advisers,\" ASIC said\n\n\"These advisers often told investors to roll over their existing superannuation balances into a choice superannuation fund available on a platform or to set up a self-managed super fund to facilitate investment into Shield.\"\n\nAn email sent from MIML to Donovan. (Supplied)\n\nASIC investigation after Shield's collapse﻿\n\nASIC said MIML, as the superannuation trustee, oversaw about $321 million in super investments into Shield by about 3000 of its members between 2022 and 2023.\n\nASIC began proceedings in the Federal Court against MIML, a subsidiary of Macquarie, following admissions that it did not act efficiently, honestly and fairly by failing to place Shield on a watch list for heightened monitoring.\n\nThe corporate watchdog also accepted a court-enforceable undertaking from MIML to ensure Macquarie pays members 100 per cent of the amounts they invested in Shield, less any amounts withdrawn.﻿\n\nASIC's Sarah Court said yesterday she hoped other trustees would take similar action to Macquarie.\n\n\"I'd just encourage any of the other trustees to speak to us about how they can restore investors to where they were before they put investments in either the Shield Master Fund or the First Guardian Master Fund,\" Court said.﻿\n\n\"Superannuation trustees offering choice platforms are on notice.\n\n\"They are gatekeepers for retirement savings. ASIC expects them to take active steps to monitor the funds they make available to members through their platforms.\"\n\nIn February 2024, ASIC halted new offers of investments in Shield.\n\n\"ASIC is investigating the circumstances surrounding Shield,\" the financial watchdog said.\n\n\"ASIC is investigating Keystone Asset Management Ltd (in liquidation) (the responsible entity for Shield), its directors and officers, the role of the superannuation trustees, certain financial advisers who recommended investors invest in Shield, the lead generators, and the research house which rated Shield.\"\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/typhoon-ragasa-impacts-australians-in-hong-kong-after-killing-dozens-in-taiwan/8adc2416-0bca-425e-b9ea-25cc7ef5e501",
        "title": "'Scrambling': Australian tourist stranded as Typhoon Ragasa lashes Hong Kong",
        "publish_date": "Thu, 25 Sep 2025 22:51:43 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Typhoon Ragasa is barrelling through China, as the death toll in Taiwan reaches 14.\n\nAs a result of the storm - previously a super typhoon - a number of Australians find themselves stranded in Hong Kong, with thousands of flights cancelled and airports shut.\n\nThe extent of the destruction is starting to be realised as the system pushes west along the southern Chinese coast toward Vietnam.\n\nREAD MORE: Albanese splits from Trump on key issues hours after smiling selfie ﻿\n\nAn elderly woman shelters from the rain in the aftermath of Super Typhoon Ragasa in Shenzhen in southern China's Guangdong province on Wednesday, Sept. 24, 2025. (AP Photo/Ng Han Guan)\n\nIt was anything but happy hour at Melbourne man Viviano Romito's harbourside bistro, Frites.\n\n\"When mother nature calls, there's not much you can do,\" he told 9News.\n\n\"The pressure of the wave came right over the wall and directly into the restaurant.\n\n\"Completely gutted right throughout, the whole bottom floor.\"\n\nHurricane-force winds whipped up a storm surge that swamped multiple waterfront businesses.\n\nIt was anything but happy hour at Melbourne man Viviano Romito's harbourside bistro, Frites. (9News)\n\nThe restaurant's bottom floor was completely gutted by a storm surge that swamped multiple waterfront businesses. (9News)\n\n\"All the restaurants were affected exactly the same,\" Romito said.\n\nOver at the Fullerton Hotel, there was not just a leak but a wave, turning the lobby into the pool deck and washing staff off their feet.\n\nEven the high-rise rooms were copping it.\n\n\"Even though the windows were closed, because the wind was so strong, it was blowing the rain through it, so we had to put towels down,\" Barbara Leota told 9News via Zoom.\n\nBarbara Leota and family friend Grisellda Tautalafua from Sydney are stuck in Hong Kong due to Typhoon Ragasa (9News)\n\nLeota and family friend Grisellda Tautalafua from Sydney had their flights cancelled, as have thousands of others in Hong Kong.\n\n\"They actually shut the airport for 36 hours, so no flights coming in and out - apparently over 700 flights were cancelled, so they're just scrambling to try and get everyone sorted,\" Tautalafua said.\n\nThe couple are hoping to be on a flight back home tomorrow.\n\nFlights in Hong Kong resumed today after some 1000 had been disrupted, affecting about 140,000 passengers. Businesses also re-opened on Thursday.\n\nAn uprooted tree blocks a path in the Ho Man Tin area, as super typhoon Ragasa approaches in Hong Kong, Wednesday, Sept. 24, 2025. (AP Photo/Chan Long Hei)\n\nLike in Hong Kong, activities halted earlier in the week are gradually returning to normal in China's Guangzhou and Shenzhen.﻿\n\nRagasa peaked at super-typhoon strength on Monday, with maximum sustained winds of 265 km/h making it the world's strongest cyclone of the year.\n\nIn the Philippines, Ragasa left at least 11 dead, while in Taiwan, authorities revised the death toll from 17 to 14 on Thursday, citing double-counting.\n\nA man walks his dog near a uprooted tree in the aftermath of Super Typhoon Ragasa in Shenzhen in southern China's Guangdong province on Wednesday, Sept. 24, 2025. (AP Photo/Ng Han Guan)\n\nBy Thursday afternoon, its sustained winds had weakened to a maximum 55 km/h and Ragasa was downgraded to a tropical depression.\n\nIt's forecast to dissipate eventually while remaining a rain threat for Vietnam and other parts of South-East Asia.﻿\n\n- Reported with Associated Press.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/lifeline-for-queenslands-final-flying-fox-cash-dispenser/105789280",
        "title": "Country charity shop holds rare relic of 1940s retail experience",
        "publish_date": "Sat, 27 Sep 2025 01:34:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "As customers browse clothing racks, a reminder of yesteryear hangs above. The sound of it once whizzing overhead is now just a memory, replaced by the beeping of a touch-screen register.\n\nIt's a flying-fox change dispenser — the last in Queensland — and the relic is helping to keep history alive in a 103-year-old shop in Gayndah, four hours' drive north of Brisbane.\n\nThe building is home to Queensland's last flying-fox change dispenser. (ABC News: Grace Whiteside)\n\nAfter sitting empty for 18 months, the shop now has a new tenant — crisis support service Lifeline.\n\n\"The building is heritage-listed, and we've tried to keep true to that in our styling and changes that we've made to the store,\" Kylie Brogden, Lifeline's regional business manager, said.\n\nKylie Brogden and Wendy Canfyn from Lifeline opening the new shop in Gayndah. (Supplied: Lifeline)\n\nThe flying-fox device was typically found in department stores from the 1940s to send cash and receipts between the front counter and back office.\n\nIt ran on taut wires strung above the customers' heads.\n\nThe flying fox ran between the front counter and cashier's office. (ABC News: Grace Whiteside)\n\nWhen customers paid for their goods, a shop assistant packed their money and docket into a small wooden cup and attached it to the flying fox.\n\nThey then pulled back a spring-loaded handle, which propelled it up to the cash desk.\n\nStaff in the cashier's office then counted out the correct change and sent it back in the wooden cup along the wires.\n\nWhile it may have been superseded by EFTPOS machines and electronic registers, it represents a time when the retail space was a meeting ground for locals and bolstered the town's economy.\n\nAn old photo of the building and Gayndah's main street hangs in John Mellor's home. (ABC News: Grace Whiteside)\n\nThe site had operated as a drapery for more than a century and was a staple in the small community which lays claim to being the oldest town in Queensland.\n\nMany residents have fond memories of the building, none more than John Mellor.\n\nJohn Mellor says the shop was his life. (ABC News: Grace Whiteside)\n\nThe shop was in his family for 51 years, trading as Mellors Drapery and Haberdashery.\n\nLoading...\n\n\"It's been my life,\" he said.\n\nThe flying fox was added to the Queensland Heritage Register in 1994 and holds a special place in Mr Mellor's heart.\n\n\"When we had a new girl start, I'd always get a frog or a mouse and put it in the cup … that's one of my party tricks,\" Mr Mellor laughed.\n\nJohn Mellor applied for the flying fox and the shop's front windows to be heritage listed in the 1990s. (ABC News: Grace Whiteside)\n\nWhile it was not used for day-to-day trading, Mr Mellor operated the flying fox until his retirement in 2005.\n\n\"I continued to use it because it was a good tourist attraction and people would bring their kids or grandkids back to have a look at the flying fox at Mellors,\" he said.\n\n\"It's different. There's nothing like that around these days.\n\n\"I know it's old-fashioned, but that's what it was all about in those days.\"\n\nMs Brogden agreed.\n\n\"The town know it really well … it's a great attraction and something to add to our store for the tourists,\" she said.\n\nJohn Mellor says the shop's heritage features attract visitors and locals. (ABC News: Grace Whiteside)\n\nA nod to the past\n\nThe flying fox isn't the only homage to history in the new store.\n\n\"We wanted to bring the old and new together,\" Lifeline state visual merchandising manager Wendy Canfyn said.\n\nThe old register also features in the new shop. (ABC News: Grace Whiteside)\n\n\"The counter that's in there is a massive, long counter, obviously for when they measured the material, so we've kept that.\n\n\"All the fixtures around the walls are these beautiful timber handmade fixtures, so we've utilised those for our own stock.\"\n\nShelves from the original drapery are being used in the new Lifeline store. (ABC News: Grace Whiteside)\n\nBreathing life back into the town\n\nMr Mellor said it had been difficult to see the building sit empty in recent years.\n\n\"There's nothing worse in these little towns than to see four or five empty shops,\" he said.\n\n\"People say, 'This place is dying,' but I don't think it's dying.\"\n\nJohn Mellor and his wife, Francesca, with Lifeline staff Wendy Canfyn and Kylie Brogden. (Supplied: Lifeline)\n\nResidents and visitors are proving that.\n\nMs Brogden said business had been \"firing on all cylinders\" since the store opened in July.\n\n\"The Gayndah store's been really well received since the day it was opened … which is really good for our fundraising efforts,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/afl-grand-final-2025-geelong-vs-brisbane-live-blog/105822258",
        "title": "Live: AFL grand final day countdown begins as Lions take huge punt on skipper",
        "publish_date": "Sat, 27 Sep 2025 01:06:37 +0000",
        "category": "sports",
        "authors": [
            "Kyle Pollard"
        ],
        "text": "By Alistair Bates, ABC Pilbara\n\nThe red dirt surrounds of one Brisbane Lions' fortress could not be further from the manicured Melbourne Cricket Ground.\n\nSmack in the Gibson Desert near the border of Western Australia and the Northern Territory, Kiwirrkurra is often called the most remote community in the country.\n\nAccording to Pintupi man Matthew West, distance only makes a football fan's heart grow fonder.\n\n\"We are far away from the MCG, we're in the middle of the desert,\" he said.\n\n\"I know we're from Western Australia, but we're proud of the Brisbane Lions.\n\n\"We love this team and the colour ... Lions always, forever.\"\n\nThe remote community of about 200 traces its \"die-hard\" support for the Lions to the 1990s, when the club was still called the Brisbane Bears.\n\nResidents have spent weeks planning a special watch party and barbecue for this year's final.\n\nMaroon, blue, and gold decorations were flown in by bush plane from Alice Springs, the closest regional centre at 850kms.\n\n\"Everyone will be happy—kids, family, everyone come together,\" West said.\n\nFellow Kiwirrkurra resident Sylvester Olodoodi told the ABC he was especially keen to watch Brisbane midfielder Josh Dunkley.\n\n\"He gets a lot of tackles,\" he explained.\n\nThe loyalty runs so deep, the community has named their own football squad after their heroes.\n\nThe Kiwirrkurra Lions travel across the WA interior to face other remote communities.\n\n\"We're trying to make a plan next year, trying to go there to meet the Brisbane Lions at the Gabba,\" West said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/wa-teen-starts-petition-for-shearing-to-be-in-the-olympics/105721670",
        "title": "Country teen's long-shot bid to get shearing at the Olympics",
        "publish_date": "Sat, 27 Sep 2025 00:59:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Kaylee Sander was watching the Paris Olympics, she thought of one sport that was missing — shearing.\n\nThe 16-year-old is from Katanning in Western Australia, home of the largest undercover sheep saleyards in the Southern Hemisphere.\n\nIn the nearby town of Darkan earlier this year, Alexia Phillips broke the female world record for the most merino ewes shorn in eight hours, taking 80 seconds on average per animal to reach a total of 367 sheep.\n\nNational and world championships already exist for shearing. (ABC Great Southern: Rosemary Murphy)\n\nKaylee said she had always enjoyed spending time on the farm.\n\n\"Since I was a little girl I've always liked coming out to my grandparents' farm,\" she said.\n\n\"I loved helping out and making a nuisance of myself.\"\n\nKaylee Sander is studying at a local agriculture school. (ABC Great Southern: Rosemary Murphy)\n\nEvery time the Olympics rolls around, different sports get the chance to show off on the international stage.\n\nAfter seeing break dancing included in the Paris Games, Kaylee decided to start a campaign for shearing to be included.\n\n\"I saw some of the sports at the Olympics a year ago and I thought, you know, we can do better than this, especially with the break dancing,\" she said.\n\n\" Shearing is just a really hard sport as well. It's not recognised enough. \"\n\nDarren Spencer says the Olympics idea has merit. (ABC Great Southern: Rosemary Murphy)\n\nKaylee has started a petition that has received more than 500 signatures and has the backing of the industry, including from WA Shearing Industry Association president Darren Spencer.\n\n\"There's a lot of work and effort goes into shearing, and there's nationals and world championship shearing at the moment,\" he said.\n\n\"It's really interesting that the Australian and the New Zealand dominance of shearing competitions has been broken by the Scots and the Welsh and Irish over the last few years.\n\n\"There's quite a few countries that do shear.\"\n\nShearing on centre stage\n\nThere are multiple criteria sports need to meet to be included in the Olympics.\n\nThat includes having a world governing body and getting recognition as a sport from the International Olympic Committee.\n\nOlympic and Paralympic Research Centre co-director Richard Baka said it was unlikely shearing would be a medal sport, but it could feature in the Brisbane Games another way.\n\n\"They could set up a sheep shearing stage and showcase it as something in the cultural program [of the Olympics],\" he said.\n\nKaylee Sander is hoping to take shearing out of the shed and onto centre stage. (ABC Great Southern: Rosemary Murphy)\n\nKaylee is learning the skill while studying at the Western Australian College of Agriculture in the nearby town of Narrogin.\n\n\"I haven't shorn a whole sheep yet, but I'll learn how to do that next year hopefully,\" she said.\n\nA Brisbane 2032 spokesperson said the sports program was expected to be announced next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/postpartum-mum-walking-group-mental-health-benefits/105820070",
        "title": "How a short walk and a coffee transformed a new mum's world",
        "publish_date": "Sat, 27 Sep 2025 00:25:06 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Keely Curley was \"cracked wide open\" emotionally when she gave birth to her first baby.\n\nThe arrival of her child in 2022 brought a fresh wave of grief for her own mother, who died from brain cancer when Ms Curley was in her early 20s.\n\nHer labour was difficult and she lacked a strong support network.\n\n\"It was very traumatic,\" Ms Curley, 27, said.\n\n\"I didn't have a traditional village around me of family, so it was very isolating.\"\n\nAfter a challenging postpartum period, the Gladstone resident was desperate for a more positive experience after the birth of her second son last year.\n\nThe women gather on Mondays for a short walk. (ABC Capricornia: Jasmine Hines)\n\nThat desire led Ms Curley to create Gladstone Strollers, a free mums and babies walking group.\n\n\"We're failed by systems and we're failed by the lack of community … the villages aren't like they used to be,\" Ms Curley said.\n\n\" This time I've made the effort to be that person for other people and, in turn, they've become that person for me too. \"\n\nIrie Moetu, aged eight months, was all smiles attending a recent Gladstone Strollers meet-up. (ABC Capricornia: Jasmine Hines)\n\nWalking groups 'very effective'\n\nNicole Highet, the founder and executive director of the Centre of Perinatal Excellence (COPE), Australia's peak body for perinatal mental health, said exercise, getting outdoors and building a support network were all helpful to women who had recently given birth.\n\nNicole Highet says the benefits of support groups can be huge. (Supplied: Centre of Perinatal Excellence)\n\nDr Highet said mother's walking groups were \"very effective\".\n\n\"It's the social connection, particularly if those people are having honest conversations about their experiences and being able to support each other,\" she said.\n\n\" We also know that exercise itself can have a very preventative effect for anxiety and depression. \"\n\nDr Highet said one in five women experienced anxiety during pregnancy and postpartum, and that one in 10 experienced depression during pregnancy.\n\nShe said that figure jumped to one in seven after birth.\n\n\"When you think about the number of mums who might be in a mothers' group, that's going to be one, two or three people in that mother's' group [with a mental health condition] at any particular time,\" Dr Highet said.\n\nAbby Moetu and her baby Irie. (ABC Capricornia: Jasmine Hines)\n\n'Didn't have a village'\n\nThe walking group has already had a big impact on mums in Gladstone, including Abby Moetu, 28, who has three children aged six, three and eight months.\n\n\"I remember the first couple of times I came, there was a mama … [who] actually came and had a bit of a cry and you could just tell she didn't have a village,\" she said.\n\n\" Coming here was just her way of letting go of all the things she probably bottled up because she had no-one to speak to. \"\n\nShauna Manwaring's one-year-old girl enjoys spending time with the Gladstone Strollers. (ABC Capricornia: Jasmine Hines)\n\nShauna Manwaring, 39, said the group helped her move her body gently while recovering from birth.\n\n\"I had a nasty postpartum — it wasn't fun at all,\" she said.\n\n\"I'm a solo mum as well, so the isolation has been quite real and serious at times.\n\n\"Sometimes you feel like you don't want to get out of bed, but I know the days that I have felt like that, I've pushed through it and get here.\n\n\"I always feel better.\"\n\nBianca Castell with her baby girl, Zara. (ABC Capricornia: Jasmine Hines)\n\nThe group has helped Bianca Castell, 34, fill the void she felt from not working.\n\n\"The first week you're in this little newborn bubble and then reality sort of sets in and you're like, 'This is the rest of my life,'\" she said.\n\n\" It's just made my life so much easier, and getting out of the house is our favourite part of the day. \"\n\nMs Curley said she planned to keep Gladstone Strollers running for as long as possible.\n\n\"It's given me a purpose to get out of the house that's greater than just me,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/afl-grand-final-2025-lachie-neale-set-to-start-as-sub/105823894",
        "title": "Injured Lions skipper set to start as sub in AFL grand final",
        "publish_date": "Fri, 26 Sep 2025 23:27:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane skipper Lachie Neale is set to start as the sub for the Brisbane Lions in today's AFL grand final.\n\nNeale, who injured his calf against the Cats in the qualifying final, was long odds to get up for the clash against Geelong at the MCG, but was a shock addition to the squad when teams were announced on Thursday.\n\nBruce Reville, who was expected to be the sub, will now most likely start the game for the Lions.\n\nNeale has played just one game since early August after overcoming a quad strain to play in the qualifying final against the Cats three weeks ago, before injuring his calf.\n\nExperts predicted it would be a four-to-six-week injury, but Neale trained well this week and came into the team for the injured Jarrod Berry.\n\nNeale hurt his calf during the qualifying final against Geelong three weeks ago. (Getty Images via AFL Photos: Michael Willson)\n\n\"I look like a bit of a goose,\" Neale said on Friday.\n\n\"I put an Instagram post up saying my season was done, and poor me, and now it looks a bit silly.\n\n\"It's been a little bit of a roller-coaster, emotionally.\n\n\"The last couple of weeks, I've just tried to focus on my rehab and sort of home in on that and support the boys through a couple of really good finals where they've performed so well.\n\n\"Really proud of the guys to get in this position.\"\n\nConfirmation of Brisbane's sub will be made an hour before the game.\n\nCats sub ready to take his grand final chance\n\nTwice now, Jhye Clark has learned that luck can be that beautiful intersection where hard work meets opportunity.\n\nClark, who will likely be Geelong's sub today, had come up well through juniors as another solid prospect in the talent factory that is Geelong football.\n\nBut as he enjoyed grand final day at a friend's place, with the Cats demolishing Sydney for the 2022 AFL premiership, Clark had little chance of being drafted by his local team.\n\nJhye Clark impressed against Hawthorn and now gets his chance in the grand final. (Getty Images: Morgan Hancock)\n\nThen came Gold Coast's stunning salary dump trade deal that sent Jack Bowes and a top-10 draft pick to Geelong. And just like that, two months after the grand final, that high selection made Clark a Cat.\n\nSo to this season, Clark's third, where he struggled for consistency and had to overcome two concussions. He only managed seven senior home-and-away games.\n\nBut he was impressive in a big training session during the pre-finals bye, catching the eye of coaches.\n\nAfter only managing one or two minutes of game time as the sub in their qualifying final win over the Brisbane Lions, Clark was thrust into the opening quarter of last week's preliminary final when Tom Stewart was concussed.\n\nClark played well in the win over Hawthorn and suddenly, everyone will be watching him play in the grand final.\n\n\"If you'd told me six weeks ago that I'd be in this position, I would not have believed you, at all,\" said the 21-year-old, who played his junior footy for Queenscliff on the Bellarine Peninsula.\n\nLoading...\n\n\"There are so many players on the fringe who could come in as well and play a role.\"\n\nGeelong are renowned for recruiting well in their local area and it is crucial to their ongoing success. Growing up, Clark was acutely aware of what might be possible.\n\n\"You see Tom Stewart, Tom Atkins — they get picked up. You aspire to be them and it's very cool to watch them, then picture yourself hopefully in their position,\" he said.\n\n\"When the news came in that the trade might be happening, I was very happy. It's a huge privilege to play for your home town, I'm very lucky to stay with family and friends and now hopefully play in the grand final.\n\n\"I remember in '22 what the town was like, it was crazy.\n\n\"Hopefully, we can do the same this weekend.\"\n\nBut playing for the local team in the AFL grand final also creates a unique sort of buzz. All of his mum's side of the family, for example, follow Geelong.\n\n\"The messages in that group chat have been going off,\" he said.\n\n\"I'm trying to switch off the phone and social media. Just focus on training.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/australian-wool-price-three-year-high-as-china-demands-rises/105819768",
        "title": "Wool price soars as production crashes and Chinese demand lifts",
        "publish_date": "Fri, 26 Sep 2025 22:58:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian wool prices lifted sharply this week amid accelerating demand from China.\n\nThe industry's benchmark Eastern Market Indicator (EMI) climbed 109 cents a kilogram to 1,453 cents — its highest point since June 2022.\n\nThe EMI has now risen 10 weeks in a row, the longest run of price rises since 1987.\n\nSpeaking to ABC Landline after a trip to the Nanjing Wool Conference in China, Endeavour Wool Exports trading manager Josh Lamb said the Chinese government was looking to replace uniforms, which was creating demand, and there was new appetite for wool-based activewear.\n\n\"So when you get a rise in demand from China and lay that over a historically low wool clip [in Australia] then you get the type of market we've seen in the last few months,\" he said.\n\n\"Most customers in China have been quite positive over the last week, although were a bit taken-back by how quickly [the price] has risen in such a short space of time.\n\n\"But that pent-up demand has shown itself in one hit and that's why we've seen such severe rises.\"\n\nThe EMI had a rare jump of more than 100 cents this week. (ABC Landline)\n\nMr Lamb said China was Australia's largest customer for wool, buying about 85 per cent of production.\n\nHe said China was investing heavily in the sector and in it \"for the long haul\", but was well aware that Australia's wool production had fallen to its lowest level in more than 100 years.\n\nJust what the industry needed\n\nSteve Harrison, Victorian Merino breeder and Wool Producers Australia president, said the price rally was just what the industry needed.\n\n\"Four months ago, everyone was down in the dumps and people were starting to question if they continued in wool,\" he said.\n\nSteve Harrison and daughter Brooke run a Merino stud in Gippsland. (ABC Rural: Fiona Broom)\n\n\" Our ongoing message to our customers has been, 'Pay us more or growers will leave the industry', and all of a sudden the customers are realising the wool just isn't there. \"\n\nMr Harrison said it was concerning the rises appeared to be largely driven by lack of supply.\n\n\"The weekly offerings have been only around 30,000 bales, whereas 12 months ago it was more like 40,000, so that is a concern,\" he said.\n\nHe said the price needed to continue rising to ensure reasonable returns for wool producers.\n\n\"It's still got a long way to go, and I'm still hopeful it will reach $20 a kilo,\" he said.\n\nAustralia once 'rode on the sheep's back', but wool production has now fallen to its lowest level in more than 100 years. (ABC Rural: Angus Verley)\n\n'Nothing short of what wool growers deserve'\n\nThe head of domestic operations with Australian Wool Innovation, Scott Carmody, said the price rises were a relief for farmers who had persevered through low prices, high input costs and drought conditions.\n\n\"What's happened in the last 10 to 12 weeks has been a reward for growers who have shown faith,\" he said.\n\n\"I think it will give a boost in confidence that they are doing the right thing and I truly believe this is the evidence people need to stay in wool.\"\n\nMr Carmody said he believed marketing campaigns promoting wool's clean, green credentials were cutting through.\n\n\"People are considering the fibre when they go shopping now, and wool is not a microplastic, planet-polluting synthetic and we think that story is breaking through,\" he said.\n\nThe highs and lows of the Australian wool market over the past 15 years. (ABC Landline)\n\nFierce competition\n\nEamon Timms, brokerage manager with Fox and Lillie Rural, said competition for wool on the auction room floor had been \"intense\".\n\n\"Usually there's a lot of haggling but there's been very little haggling and the buyers have been paying what they've needed to pay,\" he said.\n\nEamon Timms says the rapid rise in wool prices has caught people off-guard. (Supplied: Fox and Lillie)\n\n\"The message has clearly got through that supply is short … but I think the extent of the rise has taken everyone by surprise.\"\n\nPeter Morris, owner of WA wool exporting company PJ Morris, said the softening of US trade tariffs had put some confidence back into wool markets.\n\n\"Overall, clients have been very cautious on purchasing wool, because they haven't really known what the impact of those tariffs would be,\" he said.\n\n\"I think it's settled down now and people have a little bit more confidence, so it's created a situation where people have to restock and put wool back into the pipeline.\"\n\nMr Morris said the market would fall at some stage, but he believed the long-term trend would be positive.\n\nAdditional reporting by Warwick Long and Belinda Varischetti.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/how-do-tassie-politicians-justify-a-22pc-pay-rise/105822174",
        "title": "When MPs are the lowest paid at the table, is it time to change?",
        "publish_date": "Fri, 26 Sep 2025 22:39:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Every year, Tasmanian government ministers and their top bureaucrats sit on one side of a long table to take questions from other MPs.\n\nBudget estimates week is a chance to get direct answers from departments.\n\nIt also provides an experiment in pay differences.\n\nIt's far from equal pay for those seated at a budget estimate committee hearings table. (ABC News)\n\nTake the attorney-general, for example, who until this week was on $238,314 a year.\n\nLoading...\n\nSitting either side of him is the Justice Department secretary on $383,000, and three deputy secretaries, all individually earning more than the minister.\n\nAnd behind them sits the minister's chief of staff, also on a higher salary.\n\nOn the other side of the table, the non-government MPs asking the questions were on $140,185.\n\nFor the vast majority of Tasmanians, the six-figure salaries represent an entirely different world, and are clearly enough to get by regardless of who earns more.\n\nBut this growing pay difference is unique in Tasmania, where MPs earn far less than interstate counterparts, a result of a seven-year pay freeze, while other wages continue to rise incrementally.\n\nBusiness groups say it could be stopping talented Tasmanians from considering a career in state politics.\n\nMinisters' department heads on higher salaries\n\nTasmanian Chamber of Commerce and Industry (TCCI) chief executive officer Michael Bailey said the pay situation has been \"out of whack\".\n\n\"I have no doubt the way politicians are paid is holding people back from standing [in elections],\" he said.\n\n\"There are some people that I wish would stand for parliament but don't because they simply can't afford to.\n\n\" It amazes me that ministers are dealing with departments where the department heads, and even those below them, are on far greater wages than those members of parliament. \"\n\nTasmanian MPs to receive $30,000 pay rise Photo shows Jeremy Rockliff in Parliament, in Hobart on 19 August, 2025. Tasmanian politicians will receive a 22 per cent pay rise despite the government's attempts to block it, after upper house MPs voted to accept a determination by Tasmania's Industrial Commission.\n\nNear the top end of corporate Tasmania, the chief executive officer of salmon farming company Tassal earned $1.5 million in 2022 including $688,00 in bonuses, while the chief executive at publicly listed Lark Distillery was on $1.6 million in 2023.\n\nThere are also the heads of Tasmania's government business enterprises (GBEs) that take home far more than the state's ministers and MPs.\n\nThe chief executive of TasWater was on $567,000 last year, rising to $602,620 with benefits; while the Hydro Tasmania chief executive was on $509,000.\n\nAt the same time, the state's lower house increased from 25 seats to 35 in an effort to attract more talent to government and opposition benches — but pay stayed the same.\n\n\"The elected officials carry the can,\" Mr Bailey said.\n\nMichael Bailey says low salaries for politicians is a hurdle for some wanting to enter public life. (ABC News: Luke Bowden)\n\nPay increase pegged to CPI\n\nLabor and all upper house independents voted to allow a 22 per cent pay increase this week after the seven-year freeze, but it was not the first time Tasmania's parliamentarians have had to contemplate their own pay.\n\nThere was the \"40 per cent never forget\" debate of 1996, the Giddings government's decision to freeze pay as the economy tanked after the global financial crisis, and again under treasurer Peter Gutwein in 2018.\n\nSince then, the Tasmanian Industrial Commission has been working to find a way to independently increase MP's pay in line with the rest of the community.\n\nGovernment minister pay will rise to $291,597, while backbenchers and most non-government MPs will increase to $171,527.\n\nIt was 2019 when Tasmania's parliamentarians last had a pay rise. (ABC News: Ebony ten Broeke)\n\nIts decision, in May, states that it is based on the consumer price index.\n\nBut the length of time for it to report resulted in the 22 per cent leap.\n\n\"The fact that a pay rise has not been forthcoming since 2019 clearly points to the need for an alternative system that removes the onus on parliamentarians to accept or reject a determination,\" government minister Kerry Vincent told parliament.\n\n\" I am advised that since 1973, at least eight different methodologies for parliamentarian salaries in Tasmania have been adopted and subsequently abandoned. \"\n\nPremier to limit his pay rise to 3pc\n\nAll parties and independents then found themselves wedged — either vote in favour of their own pay rise and support the independence of the Industrial Commission — or vote against in recognition of a budget crisis, but against the independent decision.\n\nPremier Jeremy Rockliff said he will write to the clerk of the house to limit his pay increase to 3 per cent as the higher increase was \"not in line with community expectations\".\n\nJeremy Rockliff wants to limit his pay increase to 3 per cent, in line with what's on offer to public servants. (ABC News: Maren Preuss)\n\nHe then went on the attack against Labor, when asked if other ministers would follow suit.\n\nPremier Jeremy Rockliff: My view is clear. And other MPs? That's for them. Reporter: But you've said it's 'not in line with community expectations', that's your view. Presumedly, you expect your fellow Liberal party members to follow suit and cap theirs at 3 per cent? Mr Rockliff: I'm not going to talk about other members of parliament except the Labor party blocked our attempts to stop the pay rise. Reporter: So if your colleagues don't cap theirs at 3 per cent, they'll be making a decision… Mr Rockliff: This is about the Labor party… Reporter: … a decision that's not in line… Mr Rockliff: This is about the Labor party… Reporter: … with community expectations? Mr Rockliff: This is about the Labor party blocking our attempt to block a 22 per cent pay rise.\n\nPublic sector in battle for pay increase\n\nIt comes at a time when the government is locked in negotiations with unions as public sector agreements expire one by one this year.\n\nUnions have already attacked the government's initial offer of a 3 per cent pay rise for a one-year agreement.\n\nCommunity and Public Sector Union Tasmania secretary Thirza White said Mr Rockliff's decision to forego the full pay rise should be seen in this context.\n\n\"This is so that the premier can get up and deny public sector workers a decent pay rise that helps them to deal with the cost of living,\" she said.\n\nMs White also supported the Industrial Commission.\n\n\"We think it's really important that if the Tasmanian Industrial Commission makes a decision, that that's respected,\" she said.\n\nThe government described the initial wage offer as \"fair, reasonable and affordable\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/afl-grand-final-2025-what-time-does-the-game-start/105823862",
        "title": "Everything you need to know ahead of the 2025 AFL grand final",
        "publish_date": "Fri, 26 Sep 2025 22:37:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "The biggest game of the AFL season is here, with nearly 100,000 fans expected to attend the grand final today.\n\nHere's a quick run-down of what you need to know before the game.\n\nWho is playing in the AFL grand final?\n\nThe Geelong Cats and Brisbane Lions.\n\nIt is the first time these two clubs have faced each other in a grand final in the history of the VFL/AFL.\n\nThe two sides clashed just three weeks ago when Geelong beat Brisbane in a qualifying final, then outclassed Hawthorn to book their grand final spot.\n\nGeelong won the qualifying final match against the Brisbane Lions at the MCG this year. (AAP: Joel Carrett)\n\nThe Lions had to take a longer route after their defeat in the first week of finals. But they found their form, beating Gold Coast and then Collingwood in the preliminary final.\n\nThe winner of today's game becomes the first team since 2000 to claim five flags.\n\nWhat time is the AFL grand final?\n\nHere are the times according to which state or territory you're in:\n\n2.30pm AEST: ACT, NSW, Queensland, Tasmania, Victoria\n\nACT, NSW, Queensland, Tasmania, Victoria 2pm ACST: Northern Territory, South Australia\n\nNorthern Territory, South Australia 12.30pm AWST: Western Australia\n\nWhere is the AFL grand final being played?\n\nMelbourne.\n\nSpecifically, the Melbourne Cricket Ground — better known as the MCG.\n\nAlmost 100,000 people are expected to fill the MCG for the grand final game. (Getty Images: Quinn Rooney)\n\nIf you're travelling into the CBD for the game, head to the MCG's website for all your transport options.\n\nWhere can I watch the AFL grand final?\n\nYou'll be able to watch the game free-to-air on Channel 7 and its streaming services.\n\nWe'll be live blogging the clash on ABC Sport.\n\nAnd you can listen to the match on ABC Sport via the website, local radio, and the Listen app.\n\nWhat time will Snoop Dogg perform?\n\nAmerican rapper Snoop Dogg will be headlining the pre-game entertainment, which will begin at 1.30pm AEST.\n\nHis hits include Drop It Like It's Hot, Gin and Juice and Young, Wild & Free.\n\nSnoop Dogg will provide the pre-show entertainment. (Reuters: Anne-Marie Sorvin)\n\nThe reaction to the choice of the rapper has been largely negative since it was announced, but AFL chief executive Andrew Dillion has since been adamant about the decision.\n\nThe international hip hop star will be joined on stage by a host of Australian artists, including six-time ARIA award winner Baker Boy, multi-instrumentalist Tash Sultana and First Nations artists Emma Donovan and Kee'ahn.\n\nAustralian singer-songwriter Vera Blue will perform the Australian national anthem, while Mike Brady will be on hand to perform 'Up There Cazaly' during the AFL retiree motorcade, as is tradition.\n\nAussie singer Vera Blue will join Snoop Dogg on stage and sing the national anthem. (Supplied: ARIA Official)\n\nWhere can I watch the AFL grand final in person?\n\nFor fans in Queensland and Geelong who can't make the trip to the MCG, live sites will be set up for the grand final.\n\nFooty fans in Geelong can attend the Eastern Beach Reserve from 12pm, ahead of the opening bounce at 2.30pm.\n\nBrisbane footy fans can head to a watch party at New Farm Park from 8.30am-6pm.\n\nFor fans in Melbourne who weren't able to snag a ticket, the grand final will be screened at Fed Square in the CBD from 12pm.\n\nWhat are the teams for the grand final?\n\nBrisbane Lions FB: D.Zorko, D.Gardiner, R.Lester HB: D.Wilmont, H.Andrews, B.Starcevich C: H.McCluggage, L.Neale, L.Ashcroft HF: C.Cameron, T.Gallop, Z.Bailey FF: C.Rayner, L.Morris, C.Ah Chee FOL: D.Fort, J.Dunkley, W.Ashcroft IC: K.Lohmann, J.Fletcher, S.Marshall, B.Reville, O.McInerney EMG: S.Day, J.Tunstill, D.Joyce\n\nBrisbane Lions co-captain Lachie Neale has made an extraordinary recovery to be selected for the AFL grand final against a Geelong side featuring Rhys Stanley.\n\nGeelong Cats FB: C.O'Sullivan, S.De Koning, J.Henry HB: M.O'Connor, Z.Guthrie, L.Humphries C: G.Miers, M.Holmes, O.Dempsey HF: B.Close, S.Mannagh, T.Stengle FF: S.Neale, J.Cameron, P.Dangerfield FOL: R.Stanley, B.Smith, T.Atkins IC: M.Blicavs, J.Martin, O.Mullin, J.Clark, J.Bowes EMG: J.Bews, M.Knevitt, O.Henry\n\nWhat is the weather like for the grand final?\n\nPartly cloudy conditions are forecast with a slight chance of a shower, according to the Bureau of Meteorology (BOM).\n\nTemperatures will reach a maximum of 18C.\n\nWhen did the Geelong Cats last win a grand final?\n\n2022.\n\nThey won against the Sydney Swans.\n\nGeelong Cats: 20.13 (133) Sydney Swans: 8.4 (52)\n\nThe Cats have made three previous grand finals under coach Chris Scott for two wins (2011 v Collingwood and 2022 v Sydney) and a loss (2020 v Richmond).\n\nThe Brisbane Lions will be looking to be back-to-back premiers. (AAP: Joel Carrett)\n\nWhen did the Brisbane Lions last win a grand final?\n\n2024.\n\nThey won against the Sydney Swans.\n\nBrisbane Lions: 18.12 (120) Sydney Swans: 9.6 (60)\n\nIf the Lions win this year, they will be the first back-to-back premiers since Richmond in 2019-20.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/dwer-issues-notice-over-alleged-native-tree-clearing-chittering/105807210",
        "title": "Environmental regulator probes alleged felling of native vegetation",
        "publish_date": "Fri, 26 Sep 2025 22:35:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia's environmental regulator is investigating the alleged illegal clearing of hundreds of hectares of native trees on a property north of Perth.\n\nThe Department of Water and Environmental Regulation (DWER) has issued a vegetation conservation notice to the owners of the site on Djarlma Road in Chittering, 60 kilometres north of the state capital.\n\nThe notice stated that illegal clearing was suspected on the property, owned by Bocalusa Properties Pty Ltd, after DWER inspected the area and reviewed satellite imagery.\n\nThe Shire of Chittering issued a stop-work order at the former pine tree plantation last week.\n\nIt came after claims bulldozers and drag chains were being used to clear part of the 485-hectare property.\n\nWhile the company had been granted approval to log the pine plantation, the shire said the approval did not include the right to clear native vegetation.\n\nThe company denied any wrongdoing and maintained it was acting within the scope of its current permits.\n\nThe lot of land is home to a freshwater stream and native fauna. (Supplied: Marilyn Don)\n\nShire of Chittering president Aaron King said the site was home to the only freshwater stream in the area.\n\n\"This is a very strategic and environmentally sensitive location,\" Cr King said.\n\n\" It hasn't been used as a pine plantation for more than 50 years, which has made way for all types of natural flora and fauna to establish itself, including habitats for Carnaby's cockatoos. \"\n\nAerial footage of the pine plantation in the Shire of Chittering shows the area that has been cleared. (Supplied: Marilyn Don)\n\nCr King said the scope of clearing uncovered by the shire was confronting.\n\n\"This type of clearing I haven't seen in my lifetime,\" he said.\n\n\"I've only seen it on TV, when you've seen what they used to do in the 1960s when they would clear big acreages.\"\n\nThe Shire of Chittering says native trees were destroyed at the Djarlma Road property. (Supplied: Marilyn Don)\n\n'No clearing permit is required'\n\nWhen contacted by the ABC after the shire's initial concerns, Bocalusa Properties Pty Ltd issued a statement via their lawyers rejecting any claims of unlawful clearing.\n\n\"Our client is currently carrying out harvesting operations within its plantation,\" a spokesperson said.\n\n\"No further approval from the shire is required for the harvesting operations.\n\n\"Further … no clearing permit is required under the Environmental Protection Act 1986 (WA) in respect of vegetation that is in a plantation.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/moving-tasmania-climate-positives-and-negatives/105815096",
        "title": "These families all moved to Tasmania for the climate, but was it worth it?",
        "publish_date": "Fri, 26 Sep 2025 22:23:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "For those frustrated by scorching heatwaves and stifling humidity, Tasmania has often been seen as a welcoming refuge.\n\nThe island state's maximum summer temperatures generally hover in the mid-20s, offering relief from the extremes found on the mainland.\n\nIts temperate forests, jagged shores and slower pace of life have also drawn families from across Australia.\n\n'Climate refugees' moving to Tasmania Photo shows A young man with shoulder-length red hair and a young woman with braided blonde hair. Jack and Anna swapped the humidity of Queensland for chilly days in Tasmania, but is Tasmania really a climate refuge?\n\nBut life in Tasmania is not free from challenges, with the state regularly among the country's worst performers in key metrics like education and health care.\n\nWhile the number of people moving to the state each year has risen to about 13,000, this has been outweighed by an annual exodus of about 15,000 people leaving for the mainland.\n\nLisa Denny, a demographer based in Tasmania, has found most people leave the state in search of better employment, education or a lower cost of living.\n\nShe said the large number of people moving away meant those who were moving to the state for climate-related reason were not necessarily reflected in the data.\n\n\"We're starting to see more anecdotal evidence of people moving to Tasmania for climate-related reasons … but it's not becoming prevalent in the data,\" Dr Denny said.\n\nEarlier this week, a young couple shared their story about moving to a small town near Hobart after experiencing extreme heat and humidity on the Sunshine Coast in Queensland.\n\nFollowing that article, the ABC spoke to eight different families who moved to Tasmania for climate-related reasons.\n\nWhile all of them still felt positive about the decision, they reported a mixture of frustrations with issues like public transport, health care and isolation.\n\nSo was it worth it to move to Tasmania for the cooler weather?\n\nSteven Dover, 70, moved from Melbourne, VIC\n\nSteven Dover and Janine Rodger were \"starting to get a little uncomfortable\" with Melbourne's heat when they decided to move. (Supplied: Steven Dover)\n\nWhy did you move to Tasmania?\n\nThe hunt for cooler weather and cheaper real estate brought Mr Dover and his wife to Tasmania in 2019.\n\n\"Our main consideration initially was the heat in Melbourne. We were starting to get a little uncomfortable,\" he said.\n\nWhat do you like about living in Tasmania?\n\nMr Dover said they really enjoyed the temperatures in Tasmania, as well as the scenery and the quality of groceries.\n\n\"Beautiful countryside. We've really enjoyed taking our friends who come and visit to Cradle Mountain,\" he said.\n\nWhat downsides have you experienced since the move?\n\nSome of the drawbacks listed by Mr Dover were lower-quality restaurants, the isolation, cold bathrooms, a worse recycling system and conservative politics.\n\nHe said the biggest concern was undoubtedly the state of the healthcare system.\n\n\"It's almost impossible sometimes to get a consultancy appointment. Getting into doctors is really hard and we do worry about the state of the Launceston Hospital,\" Mr Dover said.\n\nDarren Briggs, 53, moved from Adelaide, SA\n\nDarren Briggs says the island state is \"a bit of a refuge\" for him. (Supplied: Darren Briggs)\n\nWhy did you move to Tasmania?\n\nMr Briggs said he was mindful of his experiences with droughts and bushfires in South Australia when he decided to move to Tasmania in 2011, although his key aim was to further his education and career in medicine.\n\n\"Tassie is a bit of a refuge to me in many ways. I certainly looked at Tassie as a great place to be in a world currently experiencing climate change,\" he said.\n\nWhat do you like about living in Tasmania?\n\nAccess to nature, community opportunities, the milder climate and it being a \"great place\" for bringing up kids were the main positives listed by Mr Briggs.\n\n\"It's good for my mental health and good for my physical health. I love the climate here, especially in the north-west,\" he said.\n\nWhat downsides have you experienced since the move?\n\nMr Briggs said the main downside to life in Tasmania was the state's lack of appreciation and understanding for how the environment and climate change affected people's health.\n\n\"There's a lot of misinformation going around, especially in Tasmania, over what's important to our economy and our health,\" he said.\n\nTom Kingston, 79, moved from Ballarat, VIC\n\nTom and Jenny Kingston have been disappointed by the lack of public transport in Hobart. (Supplied: Tom Kingston)\n\nWhy did you move to Tasmania?\n\nAfter researching the impacts of climate change and experiencing warmer, drier summers in Ballarat, Mr Kingston moved to the north-west coast of Tasmania in 2013.\n\n\"[Climate change] was going to impact on Australia heavily and in terms of the best places to be, one of the best was Tasmania,\" he said.\n\nWhat do you like about living in Tasmania?\n\nMr Kingston said the climate had been exactly what he wanted and he had enjoyed the slower pace of life.\n\n\"Generally, it's lived up to expectations and we're not short on anything we need really, compared to living in Victoria,\" he said.\n\nWhat downsides have you experienced since the move?\n\nAfter relying on trains significantly while living in regional Victoria, Mr Kingston felt the lack of public transport in Tasmania was a significant drawback.\n\nHe also noted the conservative politics in the electorate of Braddon as a downside.\n\n\"So getting to Launceston for something, we have to drive generally, but living in Victoria we would be catching the train all the time,\" Mr Kingston said.\n\nJames Cheng, 49, moved from Sydney, NSW\n\nJames Cheng and Jo Lim came to Tasmania for the slower pace of life. (Supplied: James Cheng)\n\nWhy did you move to Tasmania?\n\nSearching for a slower pace of life brought Mr Cheng and his partner to Tasmania about six years ago.\n\nHe said they were also growing frustrated by the \"unbearably warm\" heatwaves in Sydney.\n\n\"I realised the summer in Tasmania is so mild and that's what got me thinking this would be a fabulous place to move in the long term,\" Mr Cheng said.\n\nWhat do you like about living in Tasmania?\n\nMr Cheng said some of the best parts of living in Tasmania were the moderate temperatures, the hikes and the fresh produce.\n\n\"I enjoy the hiking. You can do it any time of the year because the weather is just so conducive,\" he said.\n\nWhat downsides have you experienced since the move?\n\nMr Cheng said it would be great if Tasmania had direct access to international flights, instead of passengers having to first fly to Sydney or Melbourne.\n\n\"Other than that, I think Tasmania is perfect,\" he said.\n\nPaul McArthy, 73, moved from Sydney, NSW\n\nPaul McArthy says he's disappointed by some of the social inequalities in Tasmania. (ABC News: Maren Preuss)\n\nWhy did you move to Tasmania?\n\nAfter living for more than three decades in Sydney, Mr McArthy and his wife moved to Tasmania in 2010 to be somewhere less populated.\n\nThey originally considered moving to Townsville in Queensland, but decided the heat there might be a problem.\n\n\"Sydney was getting far too busy, far too noisy, far too many people,\" Mr McArthy said.\n\nWhat do you like about living in Tasmania?\n\nThe couple have enjoyed the slower pace of life in Tasmania and feel as though their quality of life has improved.\n\n\"It's the slowing down. The lack of hustle and bustle of big city life. Tasmania is lovely and Hobart is like a big country town,\" Mr McArthy said.\n\nWhat downsides have you experienced since the move?\n\nMr McArthy said his main frustration with life in Tasmania were the social inequalities, which he felt were caused by the state's Liberal government.\n\n\"All they care about is jobs and growth and that's not good enough,\" he said.\n\nJennifer Lavers, 46 moved from south-west WA\n\nJennifer Lavers and Andrew Fidler experienced significant eco-grief and anxiety living in south-west Western Australia. (Supplied: Jennifer Lavers)\n\nWhy did you move to Tasmania?\n\nExtreme temperatures, repeated bushfires and a mass die-off of plants in south-west Western Australia caused significant eco-grief and anxiety for Dr Lavers and her family, before they decided to move to Tasmania in 2025.\n\n\"We literally watched hundreds of trees on our doorstep die and I just couldn't deal with it anymore. It just seemed impossible to keep anything alive,\" Dr Lavers said.\n\nWhat do you like about living in Tasmania?\n\nDr Lavers said she feels more connected to nature in Tasmania and that it has been more \"soothing to the soul\".\n\n\"You can't put a price tag on being able to go about you life and not have to constantly check emergency apps,\" she said.\n\nWhat downsides have you experienced since the move?\n\n\"None at all. We were able to afford to purchase a very large, pristine bush block and we now find ourselves immersed in the beautiful forest that we always wished for,\" Dr Lavers said.\n\nLeigh McQueeney, 63, moved from Sunshine Coast, QLD\n\nKate and Leigh McQueeney found the island state's weather better for his wife Kate's multiple sclerosis. (Supplied: Leigh McQueeney)\n\nWhy did you move to Tasmania?\n\nMr McQueeney moved to Tasmania in 2025 after experiencing very hot summers and strong storms in Queensland.\n\nHis wife has multiple sclerosis, which makes her more sensitive to the weather, so finding somewhere with a stable temperature was key.\n\n\"Moving to Tasmania was the only sort of option for nine, 10 months of the year and we'll go overseas for the other months,\" he said.\n\nWhat do you like about living in Tasmania?\n\nMr McQueeney said the couple were very happy with the move, particularly due to people's friendliness, great food and the beautiful scenery.\n\nHe said Tasmania compared favourably to the locations they visited touring across North America and Europe.\n\n\" When you come home to here it's just amazing — why did I bother going to Ireland? \"\n\nWhat downsides have you experienced since the move?\n\nThe main negative of the move for McQueeney was sourcing good services and a lack of tradespeople.\n\n\"I had to try four or five different garages before someone would look after my Volvo. I thought 'It's only a Volvo, it's not a Lamborghini,'\" Mr McQueeney said.\n\nDan Owbridge, 53, moved from Vernor, QLD\n\nDan Owbridge and Sue Minto wanted to move somewhere you didn't have to always have the air conditioning on. (Supplied: Dan Owbridge)\n\nWhy did you move to Tasmania?\n\nThe search for lower property values and cooler weather saw Mr Owbridge and his wife Sue Minto move to Tasmania in 2025, after a couple of years travelling the country in a caravan.\n\n\"After experiencing the last three summers in Queensland … where it was just so uncomfortable to sleep at night and you had to spend all your time in air conditioning, Tasmania became pretty appealing,\" Mr Owbridge said.\n\nWhat do you like about living in Tasmania?\n\nHe has found the state \"very accommodating\" and \"fantastic\" to live in.\n\n\"We've had any issues we need addressed immediately,\" Mr Owbridge said.\n\nWhat downsides have you experienced since the move?\n\nThe couple have been frustrated by some camping grounds and attractions in the state's north being closed over winter.\n\nThey have also had difficulties purchasing certain items.\n\n\"You can't assume thing you want will be available here and may need to allow for stuff to be shipped from the mainland,\" Mr Owbridge said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/act-new-lyric-theatres-detailed-designs-revealed/105823106",
        "title": "'Scale and sophistication': New Canberra lyric theatre designs revealed",
        "publish_date": "Fri, 26 Sep 2025 22:05:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Detailed designs for Canberra's new lyric theatre — which will host major musicals, ballets and operas — have been released.\n\nThe design includes seating for up to 2,000 people and a modern orchestra pit that can adjust for different performance sizes.\n\nCanberra's new lyric theatre will include seating for up to 2,000 people, with accessible seating on every level. (Supplied: ACT government)\n\nThe building, which is inspired by Canberra's natural landmarks, also features accessible seating on every level, equitable building access and more bathrooms than required, including all-gender facilities.\n\nACT Chief Minister Andrew Barr said the lyric theatre will deliver the \"scale and sophistication\" needed to attract major productions.\n\n\"This will be a significant venue for Canberra — providing a theatre that enables world-class performances to be held in our city,\" Mr Barr said.\n\nACT Chief Minister Andrew Barr says the theatre's design was guided by extensive community consultation. (Supplied: ACT government)\n\n\"The design reflects our landscape and celebrates First Nations' culture with its use of natural forms and textures,\" Mr Barr said.\n\n\"Importantly, the detailed design also responds to the needs of the people who will watch performances, the performers who will take the stage, and the staff who will work in the venue, which has been guided by extensive community consultation throughout the planning and design process.\"\n\nChief Minister Andrew Bar says the new theatre will enable Canberra to hold world-class performances. (Supplied: ACT government)\n\nThe detailed designs have been released as part of the main Works Approval application for the project, which has been lodged with the National Capital Authority.\n\nThe theatre is set to be built in the area north-west of the current Canberra Theatre Centre bordering Northbourne Avenue and Vernon Circle.\n\nThe site is in the existing Theatre Lane car park which will close from next month to allow early works to begin, with main construction expected to start early next year.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/ai-revolution-classrooms/105756868",
        "title": "As AI takes over, I'm putting my faith in teachers",
        "publish_date": "Fri, 26 Sep 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Unless you're in the top 0.01 per cent, you're a peasant.\"\n\nThat's former Google executive Mo Gawdat on the latest and greatest human-created existential threat of our times — and yes, there are so many of them!\n\nHe was sharing realities with the Diary of a CEO podcast on what new generation AI meant for jobs and workers, and whether he believed predictions of intelligent tech destroying the jobs that kids of this generation might have their eyes on and, well … get out your rakes and hoes.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\n\"There is no middle class,\" said the self-styled \"happiness guru\" (after years spent directing the assembly line that's the built the tech of our self-destruction, Mo know says he knows now what really makes us happy).\n\n\"For the next 15 years we are going to hit a short-term dystopia — there is no escaping that,\" Gawdat says.\n\nBut this will ultimately be replaced by a new utopia, he says, once AI has its head and has replaced all the bad leaders and looks after us with free healthcare and other rainbow-coloured lollipops, unicorns and balloons.\n\nSchools are places where, we handed our kids over to Big Tech and trusted that the devices they insisted they needed would be helpful, not malign. (ABC News: Jason Om)\n\nThe dystopia could be here\n\nSorry, where was I? I got confused: suddenly that weirdo behind the curtain who made the wizard roar was here patting my hand and offering me red and blue pills about a yellow brick road tech future and now I don't know who to believe.\n\nAnd why should you? The federal government's recent economic roundtable was supposed to be the come-to-Jesus conversation admitting that future generations were going to be worse off than any before them if major economic reforms weren't enjoined. Yet, despite some nice sounds around productivity and speeding up approval-processes and broader reform ambitions, especially on taxation, research and development and AI regulation were pushed down the road.\n\nHow AI is reshaping careers Photo shows Laptop on desk with chatGPT displayed on screen Artificial intelligence is changing the workforce. Industry experts look at the careers most likely to be impacted and what the research reveals about graduate jobs and women.\n\nThat dystopia may well already be here. Goldman Sachs estimates up to 300 million jobs globally might be at risk by 2030, with 25-30 per cent of the workforce exposed to automation as AI expands into new sectors, and I can quote you any other number of authorities that believe the same. The direct threat to mainstream, middle class jobs is real: that job in the law that so many parents crave for their kids is already being eaten by AI and automation, and some experts estimate that AI could displace 50 per cent of all entry-level white-collar jobs by 2027.\n\nThese predictions have freaked out every parent I know with school-aged kids and almost every conversation about senior years starts with the anxious question of \"but what jobs are they going to get?\"\n\nLoading...\n\nWe tried that with coding\n\nMy husband is adamant, like many others, that schools get serious now about teaching our kids for the jobs of the future, bemoaning a curriculum that has made no allowance for the ravages of AI, that seems to have no eye to the world they hope to enter.\n\nBut here is where we diverge. Apart from my creeping scepticism about the most apocalyptic predictions of an AI-ruined workforce, history has taught me not to look to institutional education for the answers.\n\nAre we really going to hand over Australia's creative work to AI? Photo shows Inside the La Trobe Reading Room at the State Library Victoria. Are we really comfortable with trading away the few financial benefits Australian creatives have left?\n\nThose who are calling for curriculum changes would do well to remember the craze for teaching kids \"coding\" just a few years ago, with schools insisting that this was the language they needed now — not French, not Japanese — as coding would allow them to speak fluent computer with the machines they hoped to operate.\n\nHow dumb was that idea? Like teaching someone how to cut out widgets by hand when there was a human-designed machine all along to do it at 100 times the rate. In the meantime, facility with those other languages – French, Japanese, Swedish — would have created true and meaningful connection and understanding with other people and cultures, which is how innovation and prosperity begins.\n\nSchools are also the places where, for reasons I will never understand, we handed our kids over to Big Tech and trusted that the devices they insisted they needed would be helpful, not malign — and now we have an anxious generation of kids unable to control the flow of judgemental, unkind and sometimes dangerous content into their lives.\n\nLoading...\n\nAn iPad can't replace some things\n\nI watch actor Hugh Grant's UK crusade to get screens out of schools with admiration and envy. If he seems to you to be behaving like a Luddite Karen with Etonian floppy hair, then just listen to the teachers who have to deal with distracted, disconnected screen-addicted kids. I've sat in meetings with teachers as they admit defeat trying to prevent kids gaming while they are in class. If Big Tech's plan was to lull and dull our kids before feeding them into the AI fodder, their plan could not have gone better.\n\nWe have elevated tech's role and influence, given them every market advantage to thrive, refused to tax them adequately, and now startle at the logical reality that it's in its interests to eliminate its own, and any business's, biggest cost — its workers.\n\nAI's momentum in Australia Photo shows An AI logo is shown in a conference It's estimated 30,000 people are working in the AI industry in Australia, yet there are concerns about hype and a lack of regulation.\n\nI don't trust the claims. It's in the interests of the large AI developers, and even the smaller ones, that these overheated headlines stay big: you can't get the investment you want and need unless people believe that AI will actually become Skynet, and that Terminators are just around the corner. One hundred million jobs gone is what AI players need investors to believe in order to get the funds they need to play their endgame, for which is there is no guarantee. The circularity of this economy is a game of musical chairs that will end somehow.\n\nRight now, I'm not looking to schools to solve this for us. Instead, I'll put my faith, as I always do, in the realm of the imagination and the ability of the best teachers to fire that imagination in our children.\n\nInnovation, entrepreneurialism, invention and an understanding of what people want and need is not created by tech-linked subject units or trying to predict what jobs the Ponzi scheme of the international money markets will leave over for our kids. Just as it was for us, kids need to be taught how to communicate and connect, how to understand each other and go into the world seeing people for what they are and what they could be. We need to teach our kids to think, to think critically, to inquire, to imagine and to be enthused by ideas. They need to be physically fit and mentally flexible, and there's no iPad, of any version, that can do that.\n\nThis weekend you can read about Australia's roving backing singers, our brilliant DJs and top-end filmmakers … now this is the intelligence that I'm interested in.\n\nHave a safe and happy weekend and with the explosive happiness of the Australian music collective, The Cat Empire back on our stages this month, here's their recent exploration of flamenco, as they remain as musically curious as they've ever been. Stomp on. And go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/non-profit-buys-bullock-and-little-dog-islands-off-vic-coast/105666678",
        "title": "Not-for-profit buys islands off Victoria to save them from development",
        "publish_date": "Fri, 26 Sep 2025 21:46:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Owning your own private island sounds like the remit of the extremely rich, but one environmental group has flipped this narrative on its head.\n\nFor roughly the price of an inner-city apartment, not-for-profit group Nooramunga Land and Sea (NL&S) has purchased multiple small islands off the coast of Gippsland, with the sole aim of protecting the environments from development forever.\n\nNL&S said the cluster of saltmarsh islands in South Gippsland's Corner Inlet, with views of Wilsons Promontory National Park, could play a part in tackling carbon emissions, while providing habitat for endangered species of flora and fauna.\n\nAnd the team behind the acquisitions has plans to buy more land in the future.\n\nNever mind the bullocks\n\nBullock Island is a 72-hectare island listed as a wetland of international importance under the RAMSAR Convention, an international treaty for wetland conservation.\n\nDespite its ecological value, the land was zoned for farming, and there is evidence of previous attempts at farming on the island.\n\nWhen the island was listed for sale in early 2025, NL&S jumped on the opportunity and, with funding from the Upotipotpon Foundation, bought the island.\n\nBullock Island is off the south Gippsland coastline. (ABC News: Madeleine Stuchbery)\n\nNL&S director Steve Enticott was a key driver in the swift acquisition.\n\nHe said the islands were purchased as freehold, \"so any activity could have happened on these islands\".\n\n\"They were primary production, they could go back to farming land,\" Dr Enticott said.\n\n\"They really aren't highly productive farming land. And they are critical for birdlife, wildlife — habitat that is in really short supply on the Victorian coastline.\n\n\"Buying these islands and protecting them is really protecting only a small remnant of what was originally here. And it's very important for future generations to come and to enjoy what we're enjoying now.\"\n\nSteve Enticott is one of the directors at Nooramunga Land and Sea. (ABC: Madeleine Stuchbery)\n\nNL&S bought neighbouring Little Dog Island three years ago and used the success of the first acquisition to make a move on Bullock Island.\n\nDr Enticott said while NL&S was not the first to use the model of buying and protecting islands as a conservation method, he hoped it could be a model that spread.\n\n\"In the meantime, the important thing was to grab it, to protect it, and let's see what happens into the future,\" Dr Enticott said.\n\nTime and tides\n\nThe two islands are saltmarsh landscapes and are home to a variety of habitats, including seagrass and saline meadows, as well as mangrove wetlands.\n\nStudies show mangrove wetlands and coastal wetlands can capture carbon up to 50 times faster than trees on land and once sequestered in mud, can be stored for years.\n\nThe saltmarsh's capacity to become a blue carbon sink was another motivator for Dr Enticott's team to pounce on the island when it came up for sale.\n\nBiodiversity Legacy, an organisation that supports community-governed non-profit groups to protect land for future generations, supported the purchase.\n\nBiodiversity Legacy relationships manager Abbi Wills was part of the team behind establishing the legal framework for the project.\n\n\"We're just so excited to see Nooramunga Land and Sea pioneering this approach to protect these critical saltmarsh ecosystems that we're here on,\" she said.\n\n\"It's an excellent demonstration of how the approach can be applied at scale to secure ecosystems that are ecologically relevant and provide habitat connectivity within any particular region.\"\n\nAbi Wills from Biodiversity Legacy oversaw the purchase. (ABC News: Madeleine Stuchbery)\n\nMs Wills said Biodiversity Legacy worked to set up bespoke approaches to land acquisition, unique to each organisation's situation.\n\n\"It can be customised to support the needs of any landowner or committed community groups that come together to rally support behind protecting a particular property or ecosystem,\" she said.\n\n\"What that means is local landowners and community groups can form the directors and the membership base of a community-governed not-for-profit, and the not-for-profit has the mechanisms in place to make sure that the land can never be sold on to an entity or otherwise used.\"\n\nNature finds a way\n\nThe ABC is the only media outlet to have been granted access to Bullock Island.\n\nWhen driving across the tussocky grasses, evidence of past attempts at farming can be seen, including rusted cattle races and discarded fencing.\n\nThere is also evidence of introduced plant species beginning to die back after tidal storm surges across Gippsland earlier this year.\n\nDisused cattle yards on Bullock Island, on the South Gippsland coastline. (Supplied: Steve Enticott)\n\nFrom now on, both islands will be dedicated to conservation: no further development will take place, and the landscape will be left to regenerate and provide habitat for local flora and fauna.\n\n\"For years, man tried to farm it, and it probably never should have been farmed out here,\" Dr Enticott said.\n\n\"And now with time and tides, it's probably going back to what it should be.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/algae-bloom-political-headaches/105821302",
        "title": "As algal bloom recriminations grow, politicians point to the scientists",
        "publish_date": "Fri, 26 Sep 2025 21:20:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "For fish, an algal bloom can cause suffocation and death.\n\nFor humans, skin rashes and coughing.\n\nFor politicians, bad news cycles and irritating headlines.\n\nThe political headache for state and federal Labor over their response to South Australia's ecological disaster will not go away anytime soon, much like the bloom itself.\n\nThis week, the irritating headlines stemmed from revelations that federal Environment Minister Murray Watt wasn't formally briefed about the bloom until July 11 — well after dead marine life had begun washing up on Adelaide's coastline.\n\nTwo weeks earlier, it was criticism over the state government's communication — or lack thereof — to asthmatics about new health advice.\n\nSeven weeks ago, it was the federal environment minister apologising for the speed in which \"governments\" responded to the crisis, as his state Labor counterparts denied claims they had been \"buck passing\" concerns from constituents during the bloom's early months.\n\nMurray Watt made a brief visit to an Adelaide beach in July. (ABC News: Sophie Holder)\n\nIn July, it was a 10-minute beach \"inspection\" from Mr Watt that copped bad press, fresh off revelations that the federal government had knocked back a funding plea from marine scientists for more ocean monitoring.\n\nFor two Labor governments in such commanding electoral positions, it's perhaps surprising they've arguably lost control of the political narrative surrounding this ecological crisis.\n\nAs Mr Watt said on August 11, \"I accept that South Australians think that governments were too slow to respond to this event, and for that, I apologise\".\n\nHow did we get here?\n\nAn admission of sorts\n\nThe origins of Labor's political headache can be traced back to the early hours of Saturday, March 15, when a group of surfers started experiencing real headaches after visiting Waitpinga Beach, about 15 kilometres south-west of Victor Harbor.\n\nTwo days later, the ABC visited Waitpinga and found a mysterious, discoloured foam that had washed up on shore along with scores of dead fish. Authorities closed the beach that afternoon.\n\nHundreds of metres of foam was found along Waitpinga Beach in March. (ABC News: Caroline Horn)\n\nBy April, there were reports of dying fish across more beaches along the Fleurieu Peninsula, Kangaroo Island and Edithburgh on the Yorke Peninsula, as well as dead cockles washing up at Goolwa Beach.\n\nBy May 8, the state government said the bloom had grown to a size roughly equivalent to Kangaroo Island.\n\nPremier Peter Malinauskas now admits that during these three months, the state government underestimated how persistent the bloom would be in winter.\n\nLoading...\n\nBut he also argues that politicians were not the only ones guilty of this, pointing to the advice the government was receiving from its marine scientists at the time.\n\nIndeed, the ABC had also reported on May 30 that there were \"hopes the toxic algal bloom will soon end\" due to cooler ocean temperatures.\n\n\"Throughout March, April and May, all of the forecasts that we were getting from our marine scientists was that the algal bloom would dissipate during the course of winter months,\" he told the ABC's 7:30 program earlier this month.\n\n\"And it certainly became clear in July that those forecasts certainly weren't going to come to fruition, and that invited a different policy response.\"\n\nThe premier, pressed on whether he should apologise like Mr Watt, said the state government had \"acted in accordance with all of the advice that we've got\" and he was \"not too sure anyone would expect us to do anything different than that\".\n\nThe marine algal bloom was first detected off the Fleurieu Peninsula in March.\n\nA critical month\n\nThe state government pointing to the scientific advice it received has done little to stem the recriminations coming from the Greens and the Liberals who, naturally, want to get political mileage out of the crisis.\n\nBut the government's admission that it expected the bloom to disappear over winter might provide an insight into why some public servants in Canberra say they were not aware of the bloom's impact until two months after it started.\n\nIn the early days of the algal bloom, the scientific advice was that winter weather should have broken it up. (ABC News: Che Chorley)\n\nOn Wednesday, federal environment department officials told a senate inquiry that they had their \"first formal contact\" with the South Australian government about the algal bloom \"towards the end of May\".\n\nThe officials also revealed that they did not provide a formal briefing to Mr Watt about the bloom until July 11.\n\nAmid criticism of these timelines, a state government spokesperson told the media that state agencies have been \"working along with federal agencies\" since the bloom's detection in late March.\n\nThe spokesperson added that former SA environment minister Susan Close contacted her federal counterpart on May 12 to \"bring him up to date with issues in SA's environment, including the bloom\".\n\nEnvironment Minister Murray Watt was formally briefed on the algal bloom on July 11, but the SA government says then-state environment minister Susan Close spoke to him about the matter in May. (ABC News: Callum Flinn)\n\nBut was there enough urgency in these conversations?\n\nIf the state government's advice at the time was that the bloom was going to dissipate, and federal officials said they were not aware of the escalating situation until July, then likely not.\n\nTaking no chances\n\nOpposition leader Vincent Tarzia has attempted to use the communications between the state and federal governments as evidence Labor \"hasn't properly advocated for South Australia's interests\".\n\nBut Dr Close offered a different perspective last week.\n\n\"Did we realise how big it would be? No, we didn't, scientists didn't,\" she told ABC Radio Adelaide last Friday.\n\n\"This hasn't happened like this anywhere in Australia before and very rarely in the world — usually when they come, they go very quickly.\n\n\"So, look, wisdom of hindsight, fine, but I think people paid attention — I know I paid attention from March.\"\n\nSusan Close says she has been paying attention to the bloom since March, but scientists didn't realise how big it would get. (ABC News: Che Chorley)\n\nThe ABC reported last week that Labor insiders are conscious of the bloom hanging around in summer and the impact it could have on the March state election.\n\nThe premier has made clear the state government is preparing for the worst, hoping for the best.\n\n\"It's impossible to predict, and everybody that's tried to make predictions up and until this point has largely proven to be wrong,\" Mr Malinauskas said.\n\nForesight is difficult, hindsight is easy.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-27/retiring-paramedic-sounds-alarm-over-low-retention-rate/105805372",
        "title": "'Lifers' are a dying breed of paramedic as ambo retention plummets",
        "publish_date": "Fri, 26 Sep 2025 21:19:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Peter Maxwell never anticipated he would spend his entire professional working life as an ambo.\n\n\"When I left school I didn't have a clue what I wanted to do,\" Mr Maxwell said.\n\n\" But doing the science stuff and interacting with people turned out to be pretty cool for 44 years. \"\n\nThe intensive care paramedic based at Grafton on the NSW north coast has permanently clocked off after working for NSW Ambulance since 1981.\n\nIt's likely he is one of the last generation of \"lifers\" — paramedics who spend multiple decades in the job — with the number of paramedics dropping out of the profession steadily increasing over the past decade.\n\nBrett Simpson, the president of the NSW branch of the Australian Paramedics Association, says the state is losing roughly 200 to 250 paramedics every year.\n\n\"We're pretty happy now to see staff if they're still sticking around after 5 years. 10 years would be considered a veteran,\" Mr Simpson said.\n\n\"You just don't get the lifers anymore.\"\n\nYounger, busier paramedics\n\nAccording to the Productivity Commission's latest report on government services, one in 20 NSW paramedics are leaving the workforce every year, a 10-year high.\n\nMr Simpson said there were many factors why people were leaving the profession.\n\nAnd why those leaving are \"a mixture of senior experienced paramedics that have been around for decades and the younger staff that are just starting out\".\n\n\"Paramedics under 30 [years of age] make up just over a third of our workforce today and we know they expect to have multiple careers over their lifetime,\" he said.\n\nWhen Peter Maxwell started as a paramedic he was armed with a first aid kit and some bandages and splints. (Supplied: NSW Ambulance)\n\nAs the workforce has become younger, the workload and skills required to manage it have increased.\n\nBack in the 1980s when Mr Maxwell joined up as a 19-year-old in Sydney, paramedics were armed with little more than a first aid kit with some bandages and splints.\n\n\"Back when I started there was no uni, there were no degrees, it was more like a trade,\" he said.\n\n\"Now a lot of the things the emergency department does I can do on the side of the road.\n\n\"The skills I have now were unheard or unthought of when I started, let alone now doing them every second day of the week.\"\n\nAs the complexity of the job rose, para-medicine became more regulated as a profession — including requiring paramedics to be nationally registered health professionals since 2018.\n\nMr Simpson said this change has made it easier for paramedics to have their skills recognised or to transfer to other states.\n\nTrauma and triviality\n\nAccording to the latest data from the NSW Bureau of Health Information, ambulance call-outs have increased by 31 per cent over the past five years.\n\nMore people across the state are calling ambulances for help, with the majority being for fairly minor issues.\n\n\"The trivial stuff is a huge percentage of the job,\" Mr Maxwell said.\n\n\" I've been on a call-out and the only thing they called us for was to turn the TV off for them because they couldn't get out of bed. \"\n\nBut for all the small requests, the big traumatic responses are what haunt emergency responders.\n\nMr Maxwell was one of the first paramedics on the scene for the Cowan train crash in 1990 where six people died and 100 were injured.\n\n\"As soon as you get a fairly lengthy time working, everyone gets PTSD,\" he said.\n\n\" Even though you try you don't forget about it. You can't deny it. It's just how you deal with it. \"\n\nPeter Maxwell was one of the first paramedics on site at the Cowan railway crash in 1990. (ABC News)\n\nMr Maxwell said the mental health support from NSW Ambulance had improved since he first started.\n\n\"Back then it was harden up or get out,\" he said.\n\nHe'd seen co-workers burn out from the long intense shifts, and some who had been unable to shake the trauma of certain jobs.\n\n\"One I went to was particularly bad and the guy I was working with never came back,\" he said.\n\n\"He went home that day and I never saw him again.\"\n\nPeople first\n\nMr Maxwell said part of why he was able to stick in the job for so long was his wife Rachel, who he met when they were both stationed as paramedics in Newcastle.\n\nThe couple have notched a combined 77 years in total working for the ambulance service.\n\n\"We used to talk about a lot of stuff with each other. There's no problems about other people not understanding,\" Mr Maxwell said.\n\n\"I had a good group of friends. Resilience is there, and obviously what you do outside the job helps.\"\n\nPeter Maxwell and wife Rachel spent a combined 77 years working for NSW Ambulance. (Supplied: NSW Ambulance)\n\nMr Maxwell said for all the great saves he'd made and how hard the job is, what kept him coming back for so long was the people.\n\n\"Regardless of what sort of job you go, if you're nice the job is 10 times easier,\" he said.\n\n\"Some of the older people we go to they're a bit sick, but really only want to have a chat.\"\n\n\"I enjoy it. I sit and talk to them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/queensland/bungled-child-safety-program-set-for-audit-after-critical-it-failure-20250927-p5mybn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bungled child safety program set for audit after ‘critical IT failure’",
        "publish_date": "Sat, 27 Sep 2025 11:42:57 +1000",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Queensland Child Safety Minister Amanda Camm will launch an audit into what she described as a “critical IT failure” potentially affecting the ability of staff to act on time-sensitive risks to vulnerable children.\n\nAt a media conference in Brisbane on Saturday morning, Camm revealed issues with a long-awaited IT system upgrade, dubbed Unify, which her department transitioned to in April.\n\n“This bungled IT program has resulted in frontline staff not being able to access timely and accurate information,” she said, adding that this had affected information sharing with other agencies, as well as reporting functions.\n\nChild Safety Minister Amanda Camm has blamed the former Labor government for the “bungled” program. Credit: Matt Dennien\n\n“My major concern, as the minister for child safety, is a system failure of this type could result in the death of a child,” she said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/afl-grand-final-geelong-cats-v-brisbane-lions-at-mcg-20250927-p5myb9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final - Geelong Cats v Brisbane Lions at MCG",
        "publish_date": "Sat, 27 Sep 2025 11:16:49 +1000",
        "category": "sports",
        "authors": [],
        "text": "AFL grand final - Geelong Cats v Brisbane Lions at MCG\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/the-age-photos-of-the-week-september-27-2025-20250924-p5mxj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, September 27, 2025",
        "publish_date": "Sat, 27 Sep 2025 10:31:47 +1000",
        "category": "sports",
        "authors": [],
        "text": "6/26\n\nJanelle Lynch, who has been a Lions cheers squad member for 55 years, since she was five, met her husband, Ian, when he was a fellow cheer squad member when they were 15 years old. Credit:Jason South",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/i-disapprove-of-james-graham-s-attack-on-ashley-klein-but-i-ll-defend-his-right-to-spray-it-20250925-p5mxzb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I disapprove of James Graham’s attack on Ashley Klein. But I’ll defend his right to spray it",
        "publish_date": "Sat, 27 Sep 2025 09:45:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Perhaps freedom of speech is a more arcane concept than it first seems. Isn’t it an exercise in free speech for Penrith winger Brian To’o to go ballistic on his Instagram account at his club’s end-of-season presentation?\n\nIsn’t the father of Lleyton Hewitt railing against the sanctioning of his son for manhandling a doping control volunteer freedom of speech? Glynn Hewitt can say all he wants, and I’d defend his right to do so. But I would also suggest it wise for Hewitt Snr to consider the decision of the sanctioning panel, chaired by Michael Heron KC – who is a former Solicitor-General of New Zealand, not Dennis Denuto.\n\nAnyway, the much-vaunted “right to free speech” isn’t a Willy Wonka golden ticket that allows anyone to say anything, anywhere, with impunity. Instead, the “right” to say what you want is enshrined in the idea that government officials are legally barred from suppressing views the government itself doesn’t agree with.\n\nThe right to free speech does not confer upon Jimmy Kimmel the latitude to front his eponymous TV show and say whatever he wants about whomever he chooses. Defamation laws also operate as a curtailer.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/the-south-korean-market-where-you-can-still-buy-dog-meat-but-not-for-long-20250922-p5mx1f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The South Korean market where you can still buy dog meat, but not for long",
        "publish_date": "Sat, 27 Sep 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin",
            "Sean Na"
        ],
        "text": "At its peak, the market supplied one-third of the country’s canine meat, according to local media. Its closure in 2018 and a ban on selling live dogs were the first steps by authorities to end the trade completely, bringing it into line with other parts of Asia, including Hong Kong, Taiwan, Thailand and Singapore. Even Kim concedes the industry was already in decline with his customers, mostly older Koreans, but says the transition to goat meat has been difficult. “When business was good, we sold a lot of dog meat. Maybe about 100 kilograms a day. Now we sell 10 kilograms a day, or even less,” Kim says. Cha Hee-jung, 48, with her dog Dodam who she rescued from a dog meat farm eight years ago. Credit: Sean Na “After 2027, if anyone slaughters or eats dogs, they’ll be fined. Some people may still do it secretly, but it will mostly disappear.”\n\nRegular surveys show that eating dog meat is not popular, with one poll by Gallup Korea in 2022 finding just 8 per cent of Koreans had consumed it in the past year, down from 27 per cent in 2015, while 64 per cent opposed it. The ban was decreed under a national law passed in 2024, which gave dog farmers, butchers and restaurant owners three years to shut down their operations or switch jobs. It was accompanied by a package of financial support measures. Farmers who quickly shut up shop by early 2025 were compensated up to 600,000 won per dog they surrendered, with payments reducing to 225,000 won per dog as the 2027 deadline approaches. It also set government authorities on a mission to rehome up to half a million dogs in shelters or through adoption, but both farmers and animal rights activists agree there is little clarity about what happens to the dogs that can’t be rescued. “From an animal protection perspective, this is difficult and frustrating to discuss. We believe euthanasia is preferable to slaughter because the slaughter process violates animal welfare laws,” says Chae Il-taek, a senior director at the Korean Animal Welfare Association. The worst-case scenario, he says, is that dogs will be abandoned and left to reproduce in neglected conditions.\n\n“The government must act quickly to establish guidelines and budgets to ensure humane treatment during closures,” he says. On a Saturday morning in Seoul’s Olympic Park district, Cha Hee-jung, 48, is taking her dog Dodam for a walk. It has been eight years since she rescued Dodam, then a puppy, from a dog farm where he was being held in a small cage. His hind paw is wrapped in a bandage – an old injury he sustained from a fight with an older dog at the farm – and he is still a little skittish and doesn’t like people walking behind him. The Moran black goat street market in Seongnam, South Korea. Credit: Lisa Visentin “It’s a very, very dark business,” Cha says of the dog meat industry. When she found Dodam, she had been working with a volunteer animal rights group that tried to find rescue homes for farmed dogs, often by paying farmers to take the animals from squalid conditions.\n\n“But then, after this farmer got paid, he started having more dogs again and again,” she says of the farm where Dodam was found, adding they eventually abandoned rescue attempts there. But with the deadline for the ban now just 18 months away, Cha wants to see South Korean authorities provide financial assistance for those who rescue the remaining farm dogs, such as subsidised pet training. The South Korean government has said it will “strictly monitor the market” to ensure all dog farms close by 2027 or transition to new businesses. Any dogs left behind will be managed by local animal shelters or temporarily remain on the farms under government supervision. “We want support from the country’s dog meat business owners so that Korea can become an advanced nation with regard to animal welfare,” Park Jung-hoon, chief of the ministry’s Animal Welfare and Environment Policy Bureau said earlier this year. But the high costs of setting up new farming facilities for different livestock make transitioning impossible for most dog farmers, even with the compensation, says Ju Young-bong, president of the Korea Dog Meat Association.\n\n“Every dog facility must be demolished, and a new facility must be built for new species. That requires massive investment,” says Ju. Loading “Most dog farmers are over 60; I am over 60 as well. Even young farmers are finding it extremely difficult [to transition]. Almost no one can take on the challenge.” Still, more than 70 per cent of dog farms have already shut down, leaving about 500 running, according to the Ministry of Agriculture, Food and Rural Affairs. At Ju’s own farm, he now has just 300 dogs, down from 2000, but says many farmers are now facing their ageing years without an income stream, and compensation should be extended to cover this loss for at least two years.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/albanese-to-meet-with-king-charles-at-balmoral-20250927-p5mybi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese to meet with King Charles at Balmoral",
        "publish_date": "Sat, 27 Sep 2025 08:37:33 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Albanese to meet with King Charles at Balmoral\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-william-speaking-out-on-his-most-difficult-year-20250927-p5mybh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William speaking out on his most difficult year",
        "publish_date": "Sat, 27 Sep 2025 08:37:30 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William speaking out on his most difficult year\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-william-reveals-2024-was-hardest-year-of-his-life-20250927-p5mybf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William reveals 2024 was 'hardest year' of his life",
        "publish_date": "Sat, 27 Sep 2025 08:22:40 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William reveals 2024 was 'hardest year' of his life\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-william-opens-up-on-2024-in-eugene-levy-interview-20250927-p5mybc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William opens up on 2024 in Eugene Levy interview",
        "publish_date": "Sat, 27 Sep 2025 08:18:40 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William opens up on 2024 in Eugene Levy interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/anthony-albanese-sits-down-with-britain-s-pm-20250927-p5myb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese sits down with Britain’s PM",
        "publish_date": "Sat, 27 Sep 2025 07:27:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese sits down with Britain’s PM\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/benjamin-netanyahu-unleashes-on-world-leaders-who-recognise-palestine-20250927-p5myb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benjamin Netanyahu unleashes on world leaders who recognise Palestine",
        "publish_date": "Sat, 27 Sep 2025 07:23:54 +1000",
        "category": "finance",
        "authors": [],
        "text": "Benjamin Netanyahu unleashes on world leaders who recognise Palestine\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/sharks-coach-questions-penalty-count-20250927-p5myaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sharks coach questions penalty count",
        "publish_date": "Sat, 27 Sep 2025 06:17:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Sharks coach questions penalty count\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/could-18-penalties-cost-ashley-klein-the-nrl-grand-final-gig-20250926-p5my2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could 18 penalties cost referee Ashley Klein the NRL grand final gig?",
        "publish_date": "Sat, 27 Sep 2025 06:00:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Loading\n\nGrant Atkins could be just 80 minutes away from ousting Ashley Klein as next Sunday’s NRL Grand Final referee.\n\nKlein has been in charge of three deciders, including 2022 and 2024, but came under fire for blowing no fewer than 18 penalties during Friday night’s preliminary final between Melbourne and Cronulla.\n\nSharks coach Craig Fitzgibbon said the Storm deserved the win and were the better side, but the stop-start nature of the game would have made it difficult viewing for the fans – and hoped there would be no repeat next week.\n\nOne of the few times Klein should have blown the whistle was the 64th minute when Harry Grant appeared to execute a hip-drop tackle on Sharks flyer Ronnie Mulitalo.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/it-s-an-oasis-in-the-heart-of-suburbia-and-it-may-be-about-to-change-20250820-p5moej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s an oasis in the heart of suburbia. And it may be about to change",
        "publish_date": "Sat, 27 Sep 2025 05:30:00 +1000",
        "category": "finance",
        "authors": [
            "Carolyn Webb"
        ],
        "text": "“There’s a feeling of uncertainty,” said Weiss. “And some people are catastrophising, and saying the whole place is going to be destroyed.\n\nBut for how long? Change is looming now that the state government has pinpointed this relatively low-rise and low-key suburb in its citywide push for denser, higher-rise housing.\n\nLocals also praise the village feel of Blackburn’s main strip of mostly one- and two-storey shops in South Parade, opposite the station.\n\n“When you come home at night, it’s like walking into paradise. It’s fantastic.”\n\n“I love the area. It’s like the country, but you’re close to all the facilities,” said long-time resident Rob Weiss, who lives in the heavily treed, full-of-birdlife series of streets called the Bellbird area, which is less than one kilometre south of Blackburn railway station.\n\nEfforts since the 1960s to plant native trees and destroy weeds have paid off – in some corners, there’s a distinct feeling of being in the bush here, 17 kilometres east of Melbourne’s CBD.\n\nSome residents refer to Blackburn as a suburban oasis. A slice of paradise, where you wake up to the laugh of kookaburras and the smell of gum leaves.\n\nAdd articles to your saved list and come back to them any time.\n\nReferring to the Bellbird area, Weiss believes the new planning regime “if it allows higher-density developments here, will basically destroy the ambience of the whole place”.\n\nAnd townhouses and low-rise apartment blocks are permitted in a wider footprint around these hubs.\n\nWhile details for Blackburn’s activity centre aren’t out yet, indications – based on the recently announced 25 suburbs in the scheme – are that buildings of up to 16 storeys will be allowed in areas closest to trains.\n\nThe City of Whitehorse, which includes suburbs like Blackburn, Box Hill, Burwood and Mitcham, has been set a target of creating 76,500 new homes to help ease the housing crisis.\n\nThe state government has earmarked Blackburn to be among its next tranche of 25 suburbs that will have activity centres, aka “train and tram zones”.\n\n“I personally don’t think that. But it could still have some dramatic effects.”\n\nPayne and her husband, Ian, have volunteered for more than 50 years to preserve the sanctuary, a wildlife haven that was regenerated from farmland.\n\n“It’s really sad,” she said. “I guess we won’t be here to see it, but our children will.”\n\nAnne Payne, who since 1968 has lived in Central Road east of the station, opposite the 30-hectare Blackburn Lake Sanctuary bush park, reckons a house like hers – single-storey, 1940s weatherboard on a big block – could be demolished in the future and units built on the land under the new rules.\n\n“We recognise that there is need for new housing, but it shouldn’t be at the expense of the existing dense canopy cover, when the government is trying to increase canopy,” Weiss said.\n\nBuildings could now cover up to 25 per cent of a block, “which allows the rest for trees, but this could increase to buildings taking up most of the block”, he said.\n\nHe said the current height limit of houses in his area was two storeys, but he feared it could go to up to six storeys.\n\nPayne, a member of Whitehorse Historical Society, said that before European settlement, Indigenous people had moved through the area seasonally.\n\nPayne said “a lot of tree canopy” had already been lost “and the council’s and residents’ ability to change that, or have any say in that, is diminishing rapidly with the new housing policies”.\n\n“The housing around the area that should be the corridor for birdlife is becoming more and more concrete,” Payne said.\n\nThe sanctuary was protected, but the greenery amid housing around it was at risk, she said.\n\n“I see a beautiful bushland area that’s so precarious, in the middle of suburbia,” Payne said.\n\nPayne, who with Ian raised three daughters in Blackburn, loved how they could walk 400 metres from her house in Central Road to the South Parade shops.\n\nThe Blackburn and District Tree Preservation Society, which Payne joined in 1969, and of which she is now secretary, lobbied council to plant native trees along median strips, and members did their own planting.\n\nPayne said there was a surge in new housing after World War II. In the 1960s, “there was a big drive to have bushland settings and to try and grow indigenous plants” – not just in public parks but in the yards of houses.\n\nThe coming of the early coach route from Melbourne to Lilydale along Whitehorse Road then the railway line in 1882 led to shops and houses being built, and Blackburn Lake became a popular picnic destination.\n\nIn 1889, housing developers dammed Gardiners Creek to create Blackburn Lake to irrigate orchards and farms.\n\nIn the 1970s, there were two fruit shops, three butchers, three milk bars, a Supa Valu supermarket, a shoe shop, baby-wear shop, women’s clothing shop, the Blue Moon bakery, three banks and Raftis fuel merchants.\n\n“My girls would say, ‘Mum, when we go down to the shops, you’re not to talk to anyone’. Because everyone knew each other.”\n\nToday, there is one milk bar, no supermarket, no banks, lots of eateries, plus real estate agents, gift shops, a chemist, a newsagent and one chain store – a Subway.\n\nHowever, the strip has “always been referred to as Blackburn village” and Payne still runs into people she knows.\n\nLong-term business owner Cortney Wise, owner of Pride Lane hairdressing salon in South Parade, also has serious concerns about the government’s activity centre plans.\n\n“I feel like it’s going to completely change the landscape of Blackburn, in a negative way,” Wise said.\n\nWise’s shop has been a hairdresser for at least 60 years. Wise has owned the salon for 11 years, and her mother, Kerryn Pride, ran it for 11 years previously.\n\nHairdresser Cortney Wise, owner of Pride Lane salon, is concerned about future development of Blackburn. Credit: Eddie Jim\n\nWise said she, and many of her clients were “very scared, very worried” about the new plans.\n\nShe feared she would have to close the salon, and that outlets like the two-storey shop she rented would make way for 20-storey buildings. Taxes could soar due to re-zoning and redevelopment and current tenants would be priced out.\n\nWise said that while areas near Blackburn station needed an upgrade, the “activity centre” as she understood it was not the answer.\n\nRichard Welch, the Liberal member for the North-Eastern Metropolitan Region, has started a Save Blackburn campaign. Credit: Joe Armao\n\nWise feels that the state government has put an arbitrary “stamp” on locations around Melbourne such as this, “without consideration for Blackburn’s unique identity”.\n\nOn Wise’s salon wall, there is a poster saying Save Blackburn: No Activity Centre. It is authorised by Richard Welch, the Liberal upper house member for the North-Eastern Metropolitan Region.\n\nWelch, whose office is in Blackburn, believes there will be up to 20-storey towers built near Blackburn station, creating “canyon” and wind-tunnel effects, and that further from the station, six-storey apartment blocks will replace family homes.\n\nWelch’s campaign website, inviting comments he will pass on to parliament, has had 3000 responses.\n\nYoung nature lovers at Blackburn Lake Sanctuary. Credit: Joe Armao\n\nHe said “the overwhelming response” was that people didn’t want this level of high-rise or high-density housing, for reasons ranging from insufficient parking to mature trees being felled due to developers building-out to land boundaries.\n\nHe said “moderate and proportionate development” near the station would be more sensible, meaning three- to six-storey buildings, rather than “overwhelming” the area.\n\nWelch said businesses would be forced out, due to rezoning that raised building values, triggering windfall tax gainsfor the government. Landlords wouldl either have to sell to developers, or be forced to raise rents.\n\nWelch said Blackburn was known for its pleasant lifestyle. “People choose this area because the want to live in an environment like this. This will radically change the equilibrium.”\n\nBut the Labor state member for Box Hill, Paul Hamer said the Liberals were running a scare campaign.\n\n“Consultation will open soon for the Blackburn train and tram zone, and I encourage everyone in Blackburn to have their say,” Hamer said.\n\n“Planning Minister Sonya Kilkenny recently joined me for a local walk in Blackburn with a representative of the Blackburn Residents Action Group for the minister to see the qualities that make Blackburn unique.”\n\nReferring to the Bellbird area, which currently has council landscape protection controls, Hamer said: “Landscape overlays that apply south of the station will continue to apply under any possible planning changes that may be considered as part of the program.\n\n“Liberal scare campaigns are just that and are not based on fact,” Hamer said.\n\nAccording to the state government, the first round of consultation for the next 25 activity centres, including Blackburn, will open in the coming months.\n\nFeedback from this round would inform the development of draft maps, including draft heights and boundaries, which will go back to the community for further input.\n\nA government spokesperson said it would “work closely with the community on our plan to deliver more homes where we need them most”.\n\n“We are building more homes in Blackburn because it is well-connected to public transport – with the Lilydale Line level crossing-free, and Belgrave and Lilydale lines running services every five minutes during peak times.\n\n“Too many people are locked out of suburbs where they grew up or want to live, and we’re on their side – that’s why we’ve introduced bold reforms to boost housing supply in areas where Victorians have been locked out for far too long.”\n\nKieran Simpson, an independent City of Whitehorse councillor for Cootamundra ward, which covers Blackburn, and who is a Labor Party member, said: “My position is that we need to wait and see what the plans say.”\n\nSimpson acknowledged that some people were fearful, however, he said: “I believe that’s because there is a narrative being promulgated at the moment that’s designed to scare people.”\n\nCity of Whitehorse councillor Kieran Simpson says he doesn’t believe there will be 20-storey buildings in Blackburn. Credit: Joe Armao\n\nHe said Box Hill’s development “isn’t a comparison to what we’re going to get, due to different zoning” and he didn’t see Blackburn as having the same level of density as Box Hill in future.\n\n“Some residents are opposed to any densification, and I respect their point of view,” he said. “I cannot deny that there will be some increased densification in the area. But I do not believe that we’re going to see 20-storey towers.”\n\nOne new Blackburn resident, Angus McLay, moved with his partner days ago into a rented apartment on the sixth floor of a seven-floor block, built two years ago in Whitehorse Road. “We’d been looking for our first home for a while, it’s a nice area, there’s a train station nearby, lots of facilities around.”\n\nAngus McLay has just moved into an apartment in a seven-storey block, built a few years ago in Whitehorse Road, Blackburn. Credit: Joe Armao\n\nHis balcony has a view of Box Hill’s cluster of apartment towers, three kilometres away.\n\nMcLay, 25, a structural engineer, said he liked Blackburn’s leafiness but added: “I don’t mind the idea of more high-rises. I definitely understand it.\n\n“I don’t want it to get to the stage of Box Hill, though, when it’s almost that there’s too many.”\n\nTess de Vries, a doctor aged in her 30s who rents a house in southern Blackburn, said she was “torn” about the proposed planning rules.\n\nTess de Vries has lived in a house in the south of Blackburn for three years. Credit: Eddie Jim\n\nIncreased density of housing was needed to accommodate the growing population, but it shouldn’t compromise “the integrity of the suburb”.\n\nde Vries feels that allowing 16-storey high-rises “might be a little bit too much” in changing the feel of the suburb.\n\nHaving three or four-storey apartment blocks further out would “depend on how they plan it”.\n\nShe called for “smart planning” that would preserve gardens.\n\n“I’m torn because there is going to be development. We can’t stop it. I just want it to be done in a way that is sensible and preserves the character of our neighbourhoods around Melbourne,” de Vries said.\n\nThe Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/the-time-is-right-for-the-time-is-now-wrestling-s-most-maligned-anthem-20250918-p5mw5z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The time is right for The Time Is Now, wrestling’s most maligned anthem",
        "publish_date": "Sat, 27 Sep 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Scarlett Harris"
        ],
        "text": "“You don’t get new music because that is my voice on that song and your time is up, my time is now,” said John Cena about his iconic theme song, The Time Is Now, when he turned heel – wrestling speak for became the villain – earlier this year. Cena is inching towards the final leg of his wrestling retirement tour to focus on acting full-time after 23 years with World Wrestling Entertainment, including a date in Perth for WWE Crown Jewel next month.\n\nMost wrestlers undergo such transformations in their careers, oscillating between heel and babyface (hero). Cena debuted as a generic babyface before settling on his white rapper character, the Doctor of Thuganomics, a natural heel who freestyled on the mic as well as in the ring. But his popularity – at least among children and their merchandise-buying parents – soon forced him into the role of a babyface, one he’s inhabited for the better part of two decades.\n\nWith tears in your eyes, chant along with us: “John Cena suuuucks!” Credit: WWE via Getty Images\n\nWhile his wrestling promos are rarely lyrical any more, he has maintained his all-American look – baggy denim shorts, sneakers in lieu of traditional wrestling boots, bright matching t-shirt and baseball cap boasting aspirational catchphrases like “Hustle, loyalty, respect” and “You want some, come get some” – as well as his signature theme song, a rarity in wrestling except for the most untouchable stars.\n\nLike Cena himself, The Time Is Now has crossed over into the mainstream in a way not often seen in wrestling. The song has found its way to NFL team entrances to Carpool Karaoke to car ads and even Cena’s own Neutrogena commercial this year. In a time when monoculture is extinct, it’s no mean feat that it retains such relevance.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-autism-disinformation-misinformation-tylenol-vaccines/zvsep8k5i",
        "title": "Trump isn't the first to push an unproven claim about autism. Why are they so pervasive?",
        "publish_date": "Sat, 27 Sep 2025 01:01:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When United States President Donald Trump said there was an association between mothers taking Tylenol (paracetamol) and \"a very increased risk of autism\" in children, he added fuel to a fire of mis- and disinformation that has been raging for years.\n\n\n\n\n\nTrump, flanked by his health secretary Robert F Kennedy Jr and TV-physician-turned-healthcare-administrator Mehmet Oz, said taking paracetamol was \"not good\" and suggested without evidence that autism does not appear in communities where it was not widely used.\n\n\n\n\n\nTrump's comments came just a few months after Kennedy, who is widely considered a vaccine sceptic though has disputed he is \"anti-vaccine\", had vowed to find the \"cause\" of autism by September. That pledge took many by surprise, given that decades of research have not established a singular cause for the neurodevelopmental condition.\n\n\n\n\n\nUnsurprisingly, Trump's comments were met with strong pushback from doctors and other members of the medical community. The World Health Organization (WHO) said on Wednesday there was no conclusive scientific evidence that confirmed a possible link between autism and the use of paracetamol during pregnancy.\n\n\n\nThere is no evidence of a causal link between the use of paracetamol in pregnancy and the development of autism or ADHD in children. Source: AAP / AP / Jae C. Hong In Australia, the link was firmly rejected by the Therapeutic Goods Administration and chief medical officer Michael Kidd.\n\n\n\n\n\n\"Robust scientific evidence shows no causal link between the use of paracetamol in pregnancy and autism or ADHD, with several large and reliable studies directly contradicting these claims,\" the medicines regulator said in a statement on Tuesday.\n\n\n\n\n\nThe US Federal Drug Administration guidance that Trump was announcing was also more restrained in its language than that of the US president. It said it was alerting physicians about studies suggesting a correlation between acetaminophen use during pregnancy and subsequent diagnosis of conditions like autism and ADHD (attention deficit hyperactivity disorder).\n\n\n\n\n\nBut it noted that while an association between acetaminophen and neurological disorders had been described in studies, a causal relationship had not been established, and there were contrary studies.\n\n\n\n\n\nAndrew Whitehouse, the deputy director of research and a professor of autism research at The Kids Research Institute Australia, said Trump's claims were \"at best, a misreading of science\" and \"at worst, a total misuse of science\".\n\n\n\n\n\n\"There are absolutely studies out there that have shown that taking paracetamol during pregnancy is associated with an increased chance of the offspring of that pregnancy and being diagnosed with autism. But there are also studies that show no association, and even studies that show the opposite,\" he told SBS News.\n\n\n\n\n\n\"But what not a single one of those studies have shown is any kind of causal link in any way, shape or form.\"\n\n\n\nREAD MORE ADHD and autism: Experts urge caution as social media blurs diagnostic boundaries\n\nA major 2024 Swedish study, considered one of the most high-quality on the matter, found no association between use of paracetamol in pregnancy and risk of autism, ADHD or intellectual disability. The study looked at nearly 2.5 million children born in the country between 1995 and 2019, with nearly 186,000 children exposed to paracetamol during pregnancy.\n\n\n\nWhy are non-evidence-based claims about autism so common?\n\nTrump is far from the first person to push an unproven causal link for autism, a neurodevelopmental condition that affects how a person's brain develops and functions, and is often characterised by atypical patterns of activities and behaviours and differences in processing and communicating sensory information.\n\n\n\n\n\nAccording to the WHO, people with autism can experience some degree of difficulty with social interaction, and the abilities and needs of autistic people vary and can evolve over time. It said that while some people with autism live independently, others experience severe disability and require lifelong care and support.\n\n\n\n\n\nFor decades, there have been attempts to find a simplistic answer for why some people experience autism, despite the widespread acceptance in the scientific and medical community that a complex, multi-factoral combination of genetic and environmental factors contributes.\n\n\n\n\n\nThe 1950s gave rise to the since widely discredited 'refrigerator mother' theory: that a lack of warmth from one's parents — and in particular their mothers — could explain an autism diagnosis. Such a theory has been largely abandoned since the 1970s, with subsequent studies linking diagnosis to genetics.\n\n\n\nMore recently, anti-vaccine activists have spread disinformation falsely linking autism with vaccination in an attempt to discourage their use, or suggest without evidence that they have a nefarious use.\n\n\n\n\n\nBoth Trump and Kennedy are among the public figures who have promoted the theory — contrary to scientific evidence — that childhood vaccines are a cause of autism. That idea stems from a since-debunked study from British researcher Andrew Wakefield in the late 1990s that connected a rise in autism diagnoses with widespread use of the measles vaccine.\n\n\n\n\n\nNo rigorous studies have found links between autism and vaccines or medications, or their components such as thimerosal or formaldehyde.\n\n\n\n\n\nThe causes of autism are still relatively unclear, but there is widespread speculation among scientists that its neurological characteristics may develop in utero.\n\n\n\n\n\nResearch suggests genetic factors account for up to 80 per cent of the likelihood of developing autism, and a growing area of investigation focuses on epigenetics — the interactions between genetic and environmental factors.\n\n\n\n\n\nSo why does autism appear so susceptible — perhaps more than any other condition — to claims about its causes that are not grounded in concrete evidence? Why do some reach for easy answers about a condition that is, in many ways, still a mystery to us?\n\n\n\n\n\nWhitehouse says there are two reasons. First is the \"sheer high emotion\" surrounding autism, particularly when it comes to children.\n\n\n\n\n\n\"There's a much-wanted, much-loved, much-valued and cherished child. The parents watch that child develop differently, and there's no very simple reason to describe and explain why that has happened,\" he said.\n\n\n\nAndrew Whitehouse said an \"information void\" had allowed non-evidence-based claims and conspiracy theories around autism to flourish. Source: Supplied That provides ample room, Whitehouse said, for people to push misinformation that attributes a single cause for the development of autism — some well-meaning, others who are \"out-and-out charlatans\".\n\n\n\n\n\n\"The second reason is because we've allowed it to happen. There is no other area of health and medicine that would allow such low-standard claims to not just exist but flourish without a very strong push against it,\" he said.\n\n\n\n\n\n\"But in the area of autism, there historically have not been the high standards of evidence required to make such claims. It's only going to get better if we expect and not only accept higher levels of standard science in the area of autism.\"\n\n\n\n\n\nWhitehouse said a lack of proven, simplistic explanation, paired with a generally low standard for evidence, had created an \"information void\" that allowed non-evidence-based claims and conspiracy theories to flourish.\n\n\n\n\n\nStephen Robson, an honorary professor at the ANU School of Medicine and Psychology, similarly said autism is a condition we still \"don't completely understand\", leading people to try and fill in gaps.\n\n\n\n\n\n\"The conspiracy theorist looks at the gap and [sees] some mal-intent or something nasty going on,\" he said. \"The researcher sees the gap and says, can I find out what it is? I think that's the fundamental difference.\"\n\n\n\n'Nothing wrong' with being autistic\n\nAmong the rhetoric that surrounds autism and its causes, it's important to keep in mind that autism is not an abstract concept, but a condition that impacts the lives of tens of millions of people around the world, their families and supporters.\n\n\n\n\n\nTrump's latest remarks recall in some part the 'refrigerator mother' theories of decades ago — that autism is not a developmental condition but a parental, and specifically maternal, misstep.\n\n\n\n\n\nThat kind of framing is \"inherently sexist\", David Tonge, CEO of support organisation Amaze, told SBS News earlier this week, ahead of Trump's announcement. \"This is an insidious line of discussion that is hurtful to mums,\" he said.\n\n\n\nRobson said Trump's comments had \"amplified\" two layers of stigmatisation: first, the notion that parents of children who had been diagnosed with a neurodevelopmental condition like autism had \"done something wrong\" in their parenting.\n\n\n\n\n\nWhitehouse noted mothers in particular often had \"a whole layer of societal guilt placed around that early developmental phase\".\n\n\n\n\n\nAny attempts to validate that guilt without evidence were \"horrifying\", Whitehouse said, adding that in the days since Trump's comments, he had been contacted by multiple families who were very distressed by the remarks.\n\n\n\n\n\nThe other level of stigmatisation that comes with attempts to find a singular reasoning or \"cure\" for autism is the perception that there is anything inherently wrong with being autistic.\n\n\n\n\n\nThat notion is one many in the autism community reject: that it is not their condition that is disabling, but the neurotypical societal structures and harmful attitudes that surround them.\n\n\n\nLISTEN TO Donald Trump walks his own path on autism research. Health experts say claims don't stack up SBS News 05:17 English\n\n\"When you hear the president say, 'I'd fight like hell not to take [paracetamol]', it suggests that autism in itself is a bad thing, and that it's something you have to fight,\" Robson said.\n\n\n\n\n\n\"I think for the community of people affected by autism, for those who love them and care for them, this is yet another stigmatisation. You have one of the most powerful people in the world saying that what you have is something that should be fought against, and that is awful for people.\"\n\n\n\n\n\nAustralian activist Grace Tame, who is autistic, responded to Trump's comments in a video posted to Instagram shortly after they were made.\n\n\n\n\n\n\"[Autism] can't be prevented, augmented or cured, and it doesn't need to be. There's nothing inherently wrong with being autistic.\n\n\n\n\n\n\"It is a difference in receiving, processing and communicating sensory information that can be disabling depending on external factors.\n\n\n\n\n\n\"Whilst we can't change an autistic person, we can change their environment to better support their needs.\"\n\n\n\n\n\n— With additional reporting by Reuters.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/beer-diplomacy-and-warnings-about-far-right-populism-dominate-albanese-london-trip/v450k88es",
        "title": "Beer diplomacy and warnings about far-right populism dominate Albanese London trip",
        "publish_date": "Fri, 26 Sep 2025 22:19:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese has stepped into 10 Downing Street, the UK prime minister's official residence, carrying a six pack of Australian beer after a day of diplomatic talks spanning the rise of far-right populism and global steps towards peace in the Middle East.\n\n\n\n\n\nThe dinner was a group event, with Sir Keir Starmer hosting Albanese and his partner Jodie Haydon, along with Canadian leader Mark Carney and his wife Diana.\n\n\n\n\n\nEarlier in the day, the three leaders made a joint appearance at a left-wing political conference where they shared the stage, alongside Iceland's Prime Minister, Kristrún Frostadóttir.\n\n\n\n\n\nStarmer is under intense political pressure in the UK, flagging in the polls and facing the surging popularity of the far-right Reform UK party led by Nigel Farage.\n\n\n\nThe recent election victories by centre-left parties in Australia and Canada were held up as examples to emulate during the event.\n\n\n\n\n\nStarmer announced a digital identification card policy at the conference, under which all adults would be required to hold a digital ID should they wish to work in the UK.\n\n\n\n\n\nIt's a bid to address voter concerns about migration, one of Reform UK's major campaign platforms.\n\n\n\n\n\n\"I know working people are worried about the level of illegal migration into this country. A secure border and controlled migration are reasonable demands, and this government is listening and delivering,\" Starmer said.\n\n\n\n\n\nThe UK leader also called for progressive politicians to counter \"lies\" told by populists.\n\n\n\n\"Now is the time for social democrats to confront directly some of the challenges and some of the lies, frankly, that have taken root in our societies.\"\n\n\n\n\n\nAlbanese was asked at his press conference whether Australia's immigration and economic policies were keeping the far right at bay.\n\n\n\n\n\n\"What I'd say is that, in Australia, we have a strong position, and that's been important,\" Albanese said.\n\n\n\n\n\n\"People are concerned about elements of the far-right rising in various countries. What our job is to do is to make sure that people continue to have faith in the system. That's something that my government's very focused on.\"\n\n\n\n\"The last election campaign saw one side of politics speak about grievance without putting up any solutions over that period.\"\n\n\n\n\n\n\"I felt that there wasn't any alternative policy work or constructive discussion, and I think they paid a price for that on the third of May .\"\n\n\n\nAlbanese praises Tony Blair amid speculation over Gaza role\n\nAustralia, the UK and Canada are also among a group of Western countries that have recognised Palestinian Statehood during the United Nations leader's week in New York.\n\n\n\n\n\nFormer UK Labour leader Tony Blair has been floated as a potential leader of a transitional authority to run Gaza for a number of years.\n\n\n\n\n\nIt's a potential appointment backed by the White House, though yet to be confirmed. But it's drawn some criticism from Arab states because of Blair's history leading the UK into the 2003 Iraq War.\n\n\n\n\n\nThe prime minister met with Tony Blair in London this morning, where the conflict in the Middle East was raised.\n\n\n\n\"There was an opportunity to be briefed by Mr Blair on some of what he has undertaken and the discussions that he's had. I don't want to pre-empt those processes, but it was an important opportunity to be informed,\" Albanese said.\n\n\n\n\n\n\"Tony Blair is someone who's always played a constructive role. He's someone who does look for solutions. He's someone who has been involved in the Middle East issues for some period of time, and I'm sure that he will always play a constructive role, because that's the nature of Tony Blair.\"\n\n\n\n\n\nAlbanese also said he remained confident about the future of the AUKUS nuclear-powered submarine deal forged between Australia, the UK and the US.\n\n\n\nThe US Department of War is reviewing the agreement and during the US president's trip to London last week both Starmer and King Charles were publicly backing the agreement.\n\n\n\n\n\n\"There is no indication that I've seen of anything other than support for AUKUS going forward,\" the prime minister said.\n\n\n\n\n\n\"It is in the interests of all three nations.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/egg-donation-ivf-australia/kx9zbvh3u",
        "title": "'Everyone gets paid but the donor': Should Australia change its egg donation laws?",
        "publish_date": "Fri, 26 Sep 2025 20:34:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liz Buckley-Stokes had always wanted to be a mother, but she met her husband a little later than expected, so it wasn't until her late 40s that she decided to try to have children.\n\n\n\n\n\nAfter two failed rounds of in vitro fertilisation — or IVF — a doctor recommended that Buckley-Stokes starts looking for donated eggs.\n\n\n\n\n\nShe and her husband signed up with Egg Donation Australia, a support group that connects potential donors with people looking to become parents through an online forum.\n\n\n\n\n\nIt was an odd environment that felt almost like a dating site, she says, and the process of trying to find a donor was upsetting.\n\n\n\n\n\n\"It's really hard because you're putting yourself out there and you get nothing in return,\" she says.\n\n\n\n\"It is actually really soul-destroying,\" Buckley-Stokes says.\n\n\n\n\n\nShe says the exhaustion of putting personal information online for others to assess was compounded by the anxiety that she may never become a mother.\n\n\n\n\n\n\"You're thinking that you're never going to be a mum and you're never going to have that chance because no-one is responding to your advert,\" she says.\n\n\n\n\n\nAfter around six months, Buckley-Stokes and her husband managed to meet a donor through the forum and underwent one round of IVF treatment using her donated egg, which was unsuccessful.\n\n\n\n\n\nHowever, the donor introduced them to another woman, Jess, who ultimately donated eggs that led to three successful pregnancies.\n\n\n\nLISTEN TO I feel like privacy is dead: IVF data breach triggers interest in class action lawsuit SBS News 07:56 English\n\nJess had undergone IVF herself and, Buckley-Stokes explains, she wanted to donate eggs because she \"understood the process and she understood the heartbreak\".\n\n\n\n\n\nNow raising Robbie, 6, and twins Jessie and Luke, 4, Buckley-Stokes runs a Facebook group for donors and hopeful parents looking to connect.\n\n\n\n\n\nShe considers herself lucky to have found a donor and says watching others wait months or even years to find donated eggs is deeply distressing.\n\n\n\n\n\n\"It's really hard and it breaks my heart when I hear their stories,\" she says.\n\n\n\nThere's not a lot more than I can do apart from just give them the support and give them the platform.\n\nAccording to Monash IVF, the supply and demand ratio between donors and hopeful parents in Australia is 1:52 — meaning one donor for every 52 hopeful parents.\n\n\n\nRobbie (left), Luke (centre) and Jessie were all born using eggs from the same donor. Credit: Supplied Many are now calling for changes to how egg donation is incentivised — and even compensated.\n\n\n\nGrowing demand\n\nSince the first IVF-conceived babies were born in the early 1980s, Australia's fertility industry has boomed.\n\n\n\n\n\nAround one in every 16 babies born in Australia is now conceived via IVF. For women aged 35 and older, the figure is closer to one in 10.\n\n\n\n\n\nThe demand for donated eggs is also growing and far outstrips the supply.\n\n\n\n\n\nKarin Hammarberg, a senior research fellow at Monash University's School of Public Health and Preventive Medicine, says this disparity is increasing as people postpone having children.\n\n\n\nREAD MORE Why Brooke chose Facebook over an IVF clinic to find a sperm donor\n\n\"Women are starting to try for a baby later in life and that results in more women finding it difficult to conceive,\" Hammarberg says.\n\n\n\n\n\n\"The need [for eggs] is increasing and the supply is not increasing, so there's a larger and larger proportion of women who need it but can't access it here.\"\n\n\n\n\n\nThose looking for donated eggs can find them in one of two ways: through personal connections or through IVF clinics. The majority of pregnancies achieved using donated eggs in Australia are the result of personal connections, with women donating eggs to same-sex partners, family and friends.\n\n\n\n\n\nWhile the exact number of people waiting for donated eggs in Australia is unknown, a survey from The University of Melbourne, published last year, found that out of 59 women placed on an egg donation waiting list at an IVF clinic, only 13 received a donor egg.\n\n\n\nLiz Buckley Stokes (left) says the process of trying to find an egg donor in Australia was \"soul-destroying\". Credit: Supplied Hammarberg says it's likely many women would be deterred from donating eggs because of how invasive the procedure can be and its physical demands.\n\n\n\n\n\n\"To imagine that women out of just pure generosity would sign up to donate eggs to anyone and go through that procedure for no kind of compensation whatsoever is — I think — asking a lot,\" she says.\n\n\n\n'Reproductive tourism'\n\nThe lack of available eggs in Australia has driven many who dream of becoming parents to what is known as 'reproductive tourism' — buying eggs and undergoing IVF overseas.\n\n\n\n\n\nSouth Africa, Argentina, Spain, Greece, Russia, Asia, Canada and the United States are common destinations for Australians seeking out these services.\n\n\n\n\n\nHowever, laws and ethical standards of gamete (egg and sperm) donation can differ markedly in overseas markets. For example, sex selection for non-medical reasons is legal in the US but not in Australia.\n\n\n\nMany other countries also do not have laws ensuring children born using donor gametes are able to contact their biological parents after turning 18, as is the case in Australia, depending on the rules of the specific state or territory.\n\n\n\n\n\nThis can present deep ethical challenges for children born using gametes sourced from overseas.\n\n\n\n\n\nIn 2016, Victoria became the first jurisdiction in Australia to legislate that all donor-conceived people should have the opportunity to receive information about their sperm, egg or embryo donors.\n\n\n\n\n\nNarelle's Law was named after Narelle Grech, a woman who was conceived by sperm donation and died in 2013 from hereditary bowel cancer. She had spent 15 years searching for her donor.\n\n\n\n\n\nHammarberg says Australia needs to reconsider its treatment of altruistic egg donors to try and meet the growing demand.\n\n\n\n\n\n\"We have to face up to the fact that [women travelling overseas for donor eggs] is the consequence of the system we have now and then think of ways of perhaps making it a bit more appealing for women to donate their eggs,\" she says.\n\n\n\n'We need to find a middle ground'\n\nWith demand consistently outpacing supply, many experts in Australia have raised questions about the legal restrictions that prevent donors from receiving financial compensation for their eggs.\n\n\n\nWhile in other countries, such as the US, donors can be paid a significant sum for eggs, Australian laws state that gamete donation must be altruistic, and any direct or indirect inducements are illegal.\n\n\n\n\n\nHowever, reimbursement for out-of-pocket expenses, such as medical and counselling costs, travel and accommodation, loss of earnings, insurance, childcare costs, and legal advice, is permitted.\n\n\n\n\n\nThe National Health and Medical Research Council guidelines on assisted reproductive technology say this position \"reflects concerns about the potential exploitation of donors [particularly egg donors] and the potential risks to all parties\".\n\n\n\n\n\nResearch has found the US system of allowing women to sell eggs — which can go for tens of thousands of dollars — can disproportionately target young and financially insecure women.\n\n\n\n\n\nWhile she acknowledges the ethical complexities of paying women to donate eggs, Hammarberg says she has concluded that Australia may need to allow some financial incentive to do so.\n\n\n\nLISTEN TO \"Very rare\" IVF mix up expected to lead to renewed policies, regulation SBS News 06:25 English\n\nIn the United Kingdom, women are not paid directly for altruistic egg donation; however, donors can receive standardised compensation of up to £986 ($2,021) for each cycle to cover their costs. Additionally, women can claim extra compensation for expenses such as travel, accommodation, and childcare.\n\n\n\n\n\nHammarberg believes that while women should not be paid directly for their eggs, Australia should consider a similar model to recognise women's contributions with a set amount of compensation.\n\n\n\n\n\n\"I've come to the conclusion that we need to find some kind of middle ground here because there is clearly a supply and demand issue,\" she says.\n\n\n\nHammarberg also notes that while women can't be compensated for egg donation in Australia and the vast majority of IVF clinics are private, it creates a bizarre situation where women donate altruistically, but clinics are able to profit from them.\n\n\n\nEveryone gets paid — the doctor gets paid, the clinic gets paid — everyone gets paid but not the donor.\n\nThe IVF clinic at the Royal Women's Hospital in Victoria is one of only a handful of public fertility clinics in the country, established under the Victorian government's Public Fertility Care service.\n\n\n\n\n\nThe clinic offers altruistically donated gametes free of charge to eligible persons seeking public fertility care.\n\n\n\n\n\nAssociate Professor Wan Tinn The, a fertility specialist from the hospital, tells SBS News a number of \"very generous\" people have donated eggs to this program, but says \"the supply is still not enough for the demand\".\n\n\n\nHammarberg says this type of contribution needs to be recognised.\n\n\n\n\n\n\"I think this needs to be something where there's some kind of compensation that's not an incentive to donate just for the sake of money, but some kind of respectful recognition of the effort that's involved in being an egg donor,\" she says.\n\n\n\n100,000 in storage\n\nDespite a lack of donors, there are lots of eggs in Australia that could be used to plug the gaps in donation — in fact, there could be thousands.\n\n\n\n\n\nExperts believe that more women who have undergone elective egg freezing could be incentivised to donate unused eggs.\n\n\n\n\n\nAustralia's IVF industry is facing a mounting issue of surplus frozen eggs. One study that examined ten years of egg freezing at Monash IVF clinics in Victoria found less than 13 per cent of patients returned to use their eggs each year.\n\n\n\n\n\nIt's estimated that approximately 100,000 eggs are currently sitting in storage around Australia.\n\n\n\nWhile the decision to donate these unused eggs can be morally and emotionally fraught, Lucy Caughey, a behavioural research scientist from The Royal Women's Hospital who examines decision-making around egg freezing, says women need more information.\n\n\n\n\n\n\"Ideally, we should be seeing transparency from the beginning, including information on open identity donation, the egg shortage in Australia, age criteria, and the impact of donating your eggs to others,\" she says.\n\n\n\n\n\nExperts also argue women could be paid back for the cost of storage if they donate.\n\n\n\n\n\nStephen Page, a fertility law expert and board member of the Fertility Society of Australia and New Zealand, tells SBS News the Commonwealth legislation, which refers to the commercial trading of eggs, should allow women to be compensated for the cost of already-frozen eggs as a \"reasonable expense\" of donation.\n\n\n\nPage believes Australian women should be able to access some compensation both for undergoing egg retrieval for donation and donating already frozen eggs.\n\n\n\n\n\n\"What that means is that we're less inclined to import eggs from overseas and more inclined for the child, therefore, to be able to find who the donor is because of the transparent nature of donation in Australia, [because it] is someone local — not on the other side of the world,\" he says.\n\n\n\n\n\nBuckley-Stokes says while she's unsure of what policy changes could increase the number of donors, she wants more open dialogue about egg donation and the enormous benefits it can provide to people looking to start families.\n\n\n\n\n\n\"At the end of the day, they're actually doing it to help someone,\" she says.\n\n\n\nI think that's the biggest conversation that needs to be had: is educating women on the impact.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-its-like-to-compete-in-microsoft-excel-world-championship/xdada7hn3",
        "title": "'It's nerve-wracking': What it's like to compete on the world stage — in Excel",
        "publish_date": "Fri, 26 Sep 2025 20:32:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Theme music. A championship belt. People fighting it out on the stage.\n\n\n\n\n\nNo, this isn't professional wrestling — it's the Microsoft Excel World Championship (MEWC), where the best number-crunchers in the world compete for prize money, oversized WWE-style belts and the right to call themselves the ultimate spreadsheet champion.\n\n\n\n\n\nYes, that Excel.\n\n\n\n\n\nAustralian actuary Andrew 'The Annihilator' Ngai dominated the tournament for three years straight and was dubbed the Kobe Bryant of Excel. But since being dethroned by British Canadian Michael 'The Jarman Army' Jarman last year, he's no longer the only one drawing attention.\n\n\n\n\n\nMelburnian Grayson Huynh, a self-confessed foodie who first used Excel to track restaurant reviews, also made it to the 2024 finals in Vegas — narrowly missing out on the title.\n\n\n\nLast year, Melbourne man Grayson Huynh made it into the finals of the Microsoft Excel World Championship. This year, he's hoping to do one better. Source: Supplied / Grayson Huynh With this year's tournament weeks away, Huynh is hoping to improve on his finals finish.\n\n\n\n\n\n\"It was nerve-wracking on stage,\" he tells SBS News.\n\n\n\n\n\n\"You hear commentators in the background, you're on someone else's computer, there's a live audience …. it's like public speaking.\"\n\n\n\nInside the world of Excel championships\n\nThe MEWC is less like an exam hall and more like a bright, flashy esports event.\n\n\n\n\n\nQualifying rounds take place around the world, with the top 256 funnelled into an October knockout that whittles them down to 32 Vegas-bound finalists.\n\n\n\n\n\nThe competition is livestreamed on YouTube and broadcast on ESPN from Vegas, replete with a live audience, Fox Sports-esque commentators and even a catchy theme song: It's the Excel World Championship, who's going in the spreadsheet bin?\n\n\n\nLast year's final challenge asked players to design formulas for tracking avatars and their vital signs in a World of Warcraft-inspired scenario. Some competitors use Python — a programming language — to solve their problems, while others rely purely on Excel formulas. The only thing you need is speed and accuracy, Huynh says.\n\n\n\n\n\n\"It's like solving a Rubik's Cube,\" he says.\n\n\n\nThere are a lot of algorithms, but everyone has different approaches.\n\nSpeaking to SBS News ahead of a qualifying test, Huynh admits nerves are still part of the process.\n\n\n\n\n\nHis training regimen includes reviewing past cases under timed conditions, consulting other competitors about problem-solving strategies and building mental fortitude.\n\n\n\nBetween live commentators and an audience watching his every move, Grayson Huynh says strong mental fortitude is key to succeeding in the competition. Source: Supplied / Grayson Huynh \"I didn't do too well on stage. There were a lot of mental challenges that I wasn't able to get a hold of,\" Huynh says.\n\n\n\n\n\n\"You get stage fright. I was wondering if I could even type properly.\"\n\n\n\n\n\nThis time, he is focused less on formulas and more on the mind.\n\n\n\n\n\n\"Just like any other sport, mental strength is an area I can overlook.\"\n\n\n\nThe other big league\n\nNot to be confused with the MEWC is the Microsoft Office Specialist World Championship, strictly for students aged 13 to 22. The top competitors from each country are flown to Florida for a once-in-a-lifetime opportunity to claim the title. Lose, and you can't come back.\n\n\n\n\n\nGuatemalan teenager Carmina Solares was 16 when she competed, placing in the global top 10 — the only girl and the only Latin American to do so.\n\n\n\n\n\nBy day, she was a regular teenager: wearing lip gloss, scrolling TikTok and listening to One Direction. By night, she dreamed of Excel spreadsheets.\n\n\n\n\n\n\"I dream of Excel spreadsheets,\" Solares tells SBS News.\n\n\n\n\n\n\"I would invent formulas in my sleep and try them out when I woke up.\"\n\n\n\nCarmina Solares competed in the Microsoft Office Specialist World Championship in 2023, being the only girl and Latin American to place in the top 10. Source: Supplied / Spreadsheet Champions For the now 18-year-old, placing in the top 10 is more than just a personal accolade.\n\n\n\n\n\n\"I feel like Guatemala isn't heard of much in these areas. We have limited opportunities,\" Solares says.\n\n\n\nThe ones who can get out are either super smart and win a scholarship, or they're wealthy.\n\nSolares's story is one of six followed in Spreadsheet Champions, a new Australian documentary that premiered at Melbourne International Film Festival in August.\n\n\n\n\n\nMelburnian director Kristina Kraskov admits she didn't think the competition was real at first. But soon, she found herself hooked by its unique world.\n\n\n\n\n\n\"A lot of people mistake Excel for being something really benign and boring, but the immediate question is: Why are these people spending so much time dedicating themselves to a competition most people do not care about and have never heard of?\" she says.\n\n\n\nKraskov started to notice how cultural differences influenced the seriousness with which students approached the competition.\n\n\n\n\n\n\"In Australia or the US, it's not exactly cool to be good at school. Whereas Vietnam has a huge reverence for exam test-taking and doing well … so therefore the competition is a much bigger deal,\" she says.\n\n\n\n\n\nPrize money also plays a role.\n\n\n\n\n\n\"$7,000 to an Australian teen is pretty cool,\" she says.\n\n\n\n\n\n\"But $7,000 to someone in Cameroon is more than a lot of people's average income for the year.\"\n\n\n\nAustralian documentary Spreadsheet Champions follows six school students as they compete for the title of the best Excel spreadsheeter. Source: Supplied / Spreadsheet Champions For Kraskov, the documentary's focus was always about acceptance.\n\n\n\n\n\n\"It was always going to be complete openness and acceptance for people loving what they love and doing what they do best. It shows what you can achieve if you let people who are square pegs go into their square hole and do their square thing,\" she says.\n\n\n\nA life in the gridlines\n\nHuynh's dedication to spreadsheets goes well beyond competitions.\n\n\n\n\n\nHe keeps track of flight itineraries, house inspections, investments, and Melbourne restaurants he's logged for over a decade.\n\n\n\n\n\n\"It was always a running joke that people said I should compete. I never really considered it seriously … but then I figured it would be a good way to motivate me to learn Excel again and try my hand at this competition I've heard heaps about,\" he says.\n\n\n\n\n\nLast year, around 600 to 700 people signed up for the MEWC. Huynh made it into the finals — something he counts as a bucket list moment.\n\n\n\nI want to do better than last year, but there's no pressure.\n\nWhile Excel esports is still niche in Australia, Hunyh thinks it's growing.\n\n\n\n\n\n\"It's definitely picking up. I feel like there's more traction this year … I'm trying to get into the content creation space too,\" he says.\n\n\n\nGrayson Huynh never thought he'd compete in the Excel championship. But after being egged on by his friends, he decided to throw his hat in the ring. Source: Supplied / Grayson Huynh Among the competition's audience are a mix of corporate folk and what Huynh calls \"Excel influencers\".\n\n\n\n\n\nIt's a thriving online subculture. One TikToker, on a self-proclaimed \"50 date mission\", tracks her dating life in a spreadsheet, complete with formulas predicting who's most likely to ghost (Hinge users over 35, if you're curious).\n\n\n\n\n\nOther creators profit off downloadable templates — including habit trackers, budget planners, cleaning schedules and even Christmas trackers.\n\n\n\n\n\nThen there are influencers who've racked up millions of views teaching tips and tricks on TikTok or YouTube, or over in Reddit's Excel community, which boasts more than 800,000 members.\n\n\n\n\n\nFor those of us whose Excel prowess extends to =SUM — who dream of mastering VLOOKUP (an Excel function that allows users to look up and aggregate data from other sheets into a column or table) one day, or tackling array formulas without fear — watching pros tear through problems in seconds has its own addictive appeal.\n\n\n\n\n\nHeck, you might even find yourself loving it, like Huynh: \"Excel is my bread and butter … Give it a try — you might enjoy it. You might get hooked like me.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/court-throws-out-terror-related-charge-against-irish-rap-group-kneecap/vbjsav2g0",
        "title": "Court drops terror-related charge against member of Irish rap group Kneecap",
        "publish_date": "Fri, 26 Sep 2025 11:19:46 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A UK court threw out a terrorism charge against a Northern Irish singer from the punk rap group Kneecap which had provoked an outcry among their fans.\n\n\n\n\n\nCheers erupted from supporters as the judge found there had been a technical error in the case against Liam Óg Ó hAnnaidh — who was initially charged under the Anglicised name Liam O'Hanna and whose stage name is Mo Chara — and told him he was \"free to go\".\n\n\n\n\n\nO'Hanna, 27, had denied the offence, after being charged in May when a video emerged from a November concert in London, in which he was alleged to have displayed a flag of Lebanese militant group Hezbollah .\n\n\n\n\n\nO'Hanna and his two bandmates had arrived earlier wearing balaclavas in the colours of the Irish flag for the hearing at Woolwich Crown Court in southeast London.\n\n\n\n\n\nHis legal team had challenged whether the charge was filed correctly.\n\n\n\n\"I find that these proceedings were not instigated in the correct form,\" chief magistrate Paul Goldspring agreed, adding \"consequently the charges are unlawful and null and the court has no jurisdiction\".\n\n\n\n\n\nThe band had branded the legal process a \"witchhunt\".\n\n\n\n\n\nSince the UK banned Hezbollah as a \"terrorist\" organisation in 2019, it has been an offence to show support for the group.\n\n\n\n\n\nO'Hanna said in earlier interviews he did not know what the Hezbollah flag was and that he was part of a sometimes satirical musical act not to be taken at face value.\n\n\n\n\n\nKneecap has also said the video that led to the charge was taken out of context.\n\n\n\nO'Hanna and his two bandmates arrived wearing balaclavas in the colours of the Irish flag for the court hearing. Source: AP / Joanna Chan In an interview with Agence France-Presse earlier this month, O'Hanna predicted the charge was \"clearly going to get thrown out because it's ridiculous\".\n\n\n\n\n\nThe raucous punk-rap group, who sing in the Irish language as well as English, has also issued a statement saying \"they do not, and have never, supported Hamas or Hezbollah\".\n\n\n\n\n\nThey have seen their notoriety increase since the start of the legal proceedings, having been banned in Canada and Hungary, with some of their concerts cancelled in Germany and Austria.\n\n\n\n\n\nThe group cancelled all 15 dates of a planned US tour next month because they fell too close to the court case.\n\n\n\nPalestine Action arrests\n\nKneecap has grabbed headlines for statements denouncing Israel's war in Gaza.\n\n\n\n\n\nThe UK legal case comes amid growing controversy over support for organisations that have been banned.\n\n\n\n\n\nHundreds have been arrested , mostly at demonstrations, since the Palestine Action group was outlawed in early July under anti-terrorism laws.\n\n\n\n\n\nThe government ban on Palestine Action came into force days after the group took responsibility for a break-in at an air force base in southern England that caused an estimated £7.0 million ($14.32 million) of damage.\n\n\n\n\n\nThe group said its actions were to protest against Britain's military support for Israel during the Gaza war.\n\n\n\nSupporting a proscribed group is a criminal offence punishable by up to 14 years in prison in the UK.\n\n\n\n\n\nDaring provocateurs to their fans, dangerous extremists to their detractors, Kneecap was formed in 2017 and is no stranger to controversy.\n\n\n\n\n\nIts lyrics are filled with references to drugs, members have repeatedly clashed with the UK government and they have vocally opposed British rule in Northern Ireland.\n\n\n\n\n\nLast year, the group was catapulted to international fame by a semi-fictional film based on them that scooped multiple awards, including at the Sundance festival.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/lions-and-cats-greet-huge-melbourne-crowds-ahead-of-saturdays-grand-final/iutkkd9kc",
        "title": "Lions and Cats greet huge Melbourne crowds ahead of Saturday's Grand Final",
        "publish_date": "Fri, 26 Sep 2025 09:47:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lions and Cats greet huge Melbourne crowds ahead of Saturday's Grand Final\n\nPublished 26 September 2025, 9:23 am\n\nThousands of fans have taken their final chance to cheer on Brisbane and Geelong before tomorrow's AFL Grand Final. Crowds in Melbourne coming out for the traditional pre-game parade, with players and coaches from the two teams taking centre stage.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/anthony-albanese-touches-down-in-london-for-talks-with-key-western-allies/vw3r1a3oa",
        "title": "Anthony Albanese touches down in London for talks with key western allies",
        "publish_date": "Fri, 26 Sep 2025 09:45:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/us-tariff-of-100-per-cent-on-pharma-trade-announced-ahead-of-trump-albanese-meeting/1zs1ccuqw",
        "title": "US tariff of 100 per cent on pharma trade announced ahead of Trump-Albanese meeting",
        "publish_date": "Fri, 26 Sep 2025 09:45:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "US tariff of 100 per cent on pharma trade announced ahead of Trump-Albanese meeting\n\nPublished 26 September 2025, 9:22 am\n\nThe government and medical companies have been sent scrambling to understand the implications of the Trump administration's latest tariff move. 100 per cent duties on imports will apply to branded pharmaceuticals under certain conditions, coming into effect at the start of next month. $2 billion of Australian trade is under scrutiny.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/sbs-marks-50-years-with-documentary-on-indigenous-broadcasting/15v4lpjqo",
        "title": "How a radical three-month experiment changed Australia's TV landscape forever",
        "publish_date": "Fri, 26 Sep 2025 08:00:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "In celebration of 50 years on air, SBS is airing a powerful documentary that tells the story of how a bold experiment in ethnic broadcasting became a platform for some of the most important voices in modern Australian history.\n\n\n\n\n\nThis hour-long special episode of Living Black traces the broadcaster's evolution from its early days as a fledgling multicultural radio service to its current status as a national leader in Indigenous storytelling.\n\n\n\n\n\nTold through the eyes of prominent broadcasters, trailblazing journalists and community leaders, including Ray Martin, Rhoda Roberts, Frances Rings, and Catherine Liddle, the documentary examines not just a media history, but a story of cultural transformation.\n\n\n\n\n\nAmong them is Living Black presenter Karla Grant, who this year marks 30 years with the broadcaster. She takes viewers on an emotional journey through decades of groundbreaking reporting, from coverage of the historic Sydney Harbour Bridge Walk for Reconciliation in 2000 to the 2008 apology to the Stolen Generations and the 2023 Voice to Parliament referendum.\n\n\n\nREAD MORE About Living Black\n\n\"At its core, my job is to document the many challenges facing First Nations people and give them a voice,\" Grant said.\n\n\n\n\n\n\"And I can't help but wonder how diminished that voice would be if NITV and SBS didn't exist.\"\n\n\n\nA radical idea\n\nBorn from a need to communicate changes to the Australian population about a new healthcare reform, Medicare, the immigration minister at the time, Al Grassby, suggested the creation of a radio service designed primarily to speak to multicultural Australia.\n\n\n\n\n\n\"It was the simple problem of communication. So, the idea was to have an experiment in communication,\" he said at the time.\n\n\n\n\n\nWhat followed was the creation of two experimental radio stations, 2EA in Sydney and 3EA in Melbourne. The letters EA stood for \"Ethnic Australia\". The experiment was originally meant to last only 3 months, but it was extended and continued to evolve.\n\n\n\nGiving a voice to First Nations stories\n\nAt the time, one of the most urgent gaps in Australian media was the absence of First Nations voices. It was a void that SBS would gradually, and then decisively, work to fill.\n\n\n\n\n\nIn 1989, First In Line became the very first Aboriginal current affairs show in the country. Presented by Rhoda Roberts and Michael Johnson and supported by a team of First Nations journalists and producers, their stories were finally told nationally in prime time.\n\n\n\nVeteran journalist Ray Martin remembered the impact of the program.\n\n\n\n\n\n\"I think it was really important that SBS looked at First Nations stories for the first time. We knew more about Greeks and Italians in this multicultural network than we knew about Aboriginal peoples,\" he said.\n\n\n\n\n\nOver the years, SBS continued to lead the way with its Indigenous news content. It aired the Indigenous Current Affairs Magazine program and Living Black, along with a swathe of important documentaries, including First Contact and The Australian Wars. NITV, founded in 2007 , became a part of the broadcaster in 2012.\n\n\n\nFrom crisis to innovation\n\nSBS has also faced its fair share of challenges. In 2014, the Abbott government announced a cut of $54 million over five years from SBS’s budget, forcing a rethink of operations. But adversity sparked innovation.\n\n\n\n\n\nTanya Orman, who was a channel manager at NITV at the time, recalls how the broadcaster pivoted.\n\n\n\n\n\n\"We put as much money as we could into content. Technology was changing, so we experimented by broadcasting live from the Garma Festival, and creating new models for remote production,\" Orman said.\n\n\n\n\n\n\"We problem-solved our way through it.\"\n\n\n\nREAD MORE History of NITV\n\nPart of the problem-solving came in the training for the next generation of reporters.\n\n\n\n\n\nYears earlier, Grant had helped advocate for an Indigenous cadetship program at the broadcaster. Today, that program has produced some of the country’s top journalists, including Nakari Thorpe, now with ABC News.\n\n\n\n\n\n\"I applied because I never saw my community in the news,\" Thorpe said.\n\n\n\n\n\n\"The cadetship changed my life. You’re not just learning journalism, you’re learning how to tell our stories, with truth and respect.\"\n\n\n\n\n\n\"I think people would be surprised how many First Nations journalists started at NITV,\" SBS Managing Director James Taylor said.\n\n\n\n\n\n\"We’re a platform for excellence in Indigenous storytelling and that must grow.\"\n\n\n\n\n\nAs Australia continues to grapple with questions of identity, inclusion and reconciliation, this program serves as a timely reminder of the power of public broadcasting to not only reflect a nation, but to help shape it.\n\n\n\n\n\n‘Redefining Australia: 50 Years of SBS’ airs tonight at 8:30pm on SBS and SBS On Demand .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pharma-stocks-tumble-following-us-pharma-import-tariffs/mud4bfff3",
        "title": "Pharma stocks tumble following US pharma import tariffs",
        "publish_date": "Fri, 26 Sep 2025 07:22:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/afl-grand-final-2025-key-information/7cphviiz9",
        "title": "What time does the 2025 AFL grand final start? All the key details to know",
        "publish_date": "Fri, 26 Sep 2025 06:19:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Geelong Cats and Brisbane Lions will face off on Saturday 27 September in the AFL grand final at the Melbourne Cricket Ground (MCG).\n\n\n\n\n\nThe Cats beat the Lions three weeks ago, but premiership glory is still up for grabs for the two sides, whose clash will be attended by an expected 100,000 fans.\n\n\n\n\n\nThe two teams have had grand final success in previous years, with the Cats taking the premiership in 2022. If the Lions succeed, they will have won back-to-back titles after last year's victory over the Sydney Swans.\n\n\n\n\n\nHere's what you need to know.\n\n\n\nWhat time is Saturday's AFL grand final?\n\nThe start time will vary depending on your time zone.\n\n\n\n\n\nFor fans in the ACT, NSW, Queensland, Tasmania and Victoria the first bounce is at 2.30pm AEST.\n\n\n\n\n\nFor people in the NT and South Australia, the at 2pm ACST, while it will be 12.30pm for Western Australians.\n\n\n\nWhere can you watch?\n\nIf you're not attending the MCG on the day, you can watch the game for free on Channel 7, which will broadcast the entire match on television and its streaming services.\n\n\n\n\n\nThe ABC will also have live commentary on the game across its radio platforms.\n\n\n\n\n\nThere will also be events held in person to watch matches with fellow barrackers on the big screen.\n\n\n\n\n\nFooty fans in Geelong can attend the Eastern Beach Reserve from 12pm AEST, while Brisbane supporters can head to a watch party at New Farm Park from 8.30am AEST.\n\n\n\n\n\nThe grand final will also be shown at Fed Square in Melbourne's CBD from 12pm AEST.\n\n\n\nWhat time is the pre-game entertainment?\n\nUS rapper Snoop Dogg will be joined by Australian artists including Baker Boy, Tash Sultana, Emma Donovan and Kee'ahn.\n\n\n\n\n\nThe pre-game entertainment is scheduled one hour before the opening bounce.\n\n\n\n\n\nAustralian artist Vera Blue will perform the national anthem and Mike Brady will perform Up There Cazaly, an AFL grand final tradition.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/health-minister-responds-to-trumps-100-per-cent-pharma-tariff-hike/ngur97kvl",
        "title": "Butler criticises Trump's 'unfair' pharma tariffs that Ley says are 'shocking but unsurprising'",
        "publish_date": "Fri, 26 Sep 2025 04:43:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Health Minister Mark Butler has said the federal government will do what it can to support companies affected by an \"unfair, unjustified\" hike in pharmaceutical tariffs announced by United States President Donald Trump.\n\n\n\n\n\nIn a social media post, Trump said the US would be imposing a 100 per cent tariff on \"any branded or patented Pharmaceutical Product, unless a Company IS BUILDING their Pharmaceutical Manufacturing Plant in America\".\n\n\n\n\n\nHe said the tariffs would start on 1 October and \"'is building' will be defined as 'breaking ground' and/or 'under construction'\".\n\n\n\n\n\n\"There will, therefore, be no tariff on these pharmaceutical products if construction has started,\" he said.\n\n\n\n\n\nButler said during a press conference that the Australian goernment was \"still working to understand the implications of this announcement, which is still only a few hours old\".\n\n\n\nLISTEN TO Donald Trump announces 100% tariffs on branded medicines from October SBS News 00:58 English\n\n\"We have been making the case since it first became clear that the US was going to take some action in this area about the benefits of continued free trade in pharmaceuticals between our countries,\" Butler said.\n\n\n\n\n\nThe government would \"do what we can to support Australian companies who might be hit by what we regard as unfair, unjustified tariffs after 20 years of free trade,\" he said.\n\n\n\n\n\nThe Coalition has also said it \"strongly opposes\" Trump's new tariff rate and is \"ready to help the government in any way to help protect Australia's pharmaceutical sector and the jobs of Australians\".\n\n\n\n\n\nOpposition leader Sussan Ley and several other Coalition figures said in a statement: \"This is a shocking but unsurprising development, and it is moments like this when a strong direct relationship with the president of the United States is critical to help save Aussie jobs.\"\n\n\n\n\n\n\"While other leaders are able to pick up the phone to the [US] president, [Prime Minister] Anthony Albanese has not established such a relationship,\" they said.\n\n\n\n\n\nAlbanese is due to meet with Trump next month .\n\n\n\nTrump's July tariff ultimatum\n\nPharmaceutical imports to the US were initially hit with a 25 per cent tariff in May, and Trump proposed further hikes in July, saying they could go as high as 250 per cent.\n\n\n\n\n\nTreasurer Jim Chalmers said at the time that the government was \"urgently seeking some more detail\", highlighting how \"exposed to the US market\" the Australian pharmaceutical industry was.\n\n\n\n\n\nMedicines and pharmaceuticals are among Australia's top exports to the US, with around $2.1 billion in shipments last year, according to the Australian Bureau of Statistics.\n\n\n\n\n\nButler said in July that Trump's tariff plan would be a blow to producers such as CSL, Australia's largest pharmaceutical company.\n\n\n\nHowever, CSL said in a statement on Friday it didn't expect \"any material impact from these tariffs\".\n\n\n\n\n\n\"In addition to CSL's Australian facilities, we have a very significant United States manufacturing footprint,\" a CSL spokesperson said in a statement.\n\n\n\n\n\n\"We are already expanding our US capabilities to meet the growing demand for our therapies and we have announced further expansion of significant, new capital investments during the next five years.\"\n\n\n\n\n\nCSL's share price slumped 3.6 per cent shortly after the stock market opened on Friday, before retracing some of its losses to sit 1.7 per cent lower by late morning.\n\n\n\nUS pharma industry's push against PBS\n\nAustralian drug pricing has become a source of tension with the Trump administration, with the US pharmaceutical industry pressuring Trump to impose tariffs on Australian and other manufacturers of pharmaceuticals covered by Australia's Pharmaceutical Benefits Scheme (PBS).\n\n\n\n\n\nIn a January submission to the US government, the Pharmaceutical Research and Manufacturers of America trade group said the PBS was \"egregious and discriminatory\" and \"undervalued American innovation\", putting jobs and exports at risk.\n\n\n\n\n\nMeanwhile, the Labor Party is promising to make PBS medicines cheaper by capping every script at $25 or less from January 2026.\n\n\n\n\n\nButler said in July that the PBS — which subsidises a wide range of prescription medicines for Australians — would not be changed to appease US companies and escape the threatened tariffs.\n\n\n\n\n\n\"To the extent that this is motivated by big pharma companies seeking to lobby the US administration to water down the protections of our PBS, it's simply not up for negotiation under our government,\" he said.\n\n\n\nREAD MORE Is the election promise of cheaper medicines under threat from US tariffs?\n\nBut Butler said on Friday he didn't think the most recent tariff hike was primarily motivated by US opposition to the PBS.\n\n\n\n\n\n\"I think it's pretty clear that the core objective of the US administration is to lower drug prices in their own country, and they're using tariffs as a tool to try to achieve that objective,\" he said.\n\n\n\n\n\nHowever, he said tariffs weren't the right policy to achieve that objective, highlighting that Australia buys \"more pharmaceutical products from the US, by quite a distance, than they buy from us\".\n\n\n\n\n\n\"It is not in the American consumers' interest to impose a higher price on the exports from Australia to America.\"\n\n\n\n\n\n— With additional reporting by Reuters and AAP.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/queensland/bungled-child-safety-program-set-for-audit-after-critical-it-failure-20250927-p5mybn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bungled child safety program set for audit after ‘critical IT failure’",
        "publish_date": "Sat, 27 Sep 2025 11:42:57 +1000",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Queensland Child Safety Minister Amanda Camm will launch an audit into what she described as a “critical IT failure” potentially affecting the ability of staff to act on time-sensitive risks to vulnerable children.\n\nAt a media conference in Brisbane on Saturday morning, Camm revealed issues with a long-awaited IT system upgrade, dubbed Unify, which her department transitioned to in April.\n\n“This bungled IT program has resulted in frontline staff not being able to access timely and accurate information,” she said, adding that this had affected information sharing with other agencies, as well as reporting functions.\n\nChild Safety Minister Amanda Camm has blamed the former Labor government for the “bungled” program. Credit: Matt Dennien\n\n“My major concern, as the minister for child safety, is a system failure of this type could result in the death of a child,” she said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/afl-grand-final-geelong-cats-v-brisbane-lions-at-mcg-20250927-p5myb9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final - Geelong Cats v Brisbane Lions at MCG",
        "publish_date": "Sat, 27 Sep 2025 11:16:49 +1000",
        "category": "sports",
        "authors": [],
        "text": "AFL grand final - Geelong Cats v Brisbane Lions at MCG\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/the-age-photos-of-the-week-september-27-2025-20250924-p5mxj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, September 27, 2025",
        "publish_date": "Sat, 27 Sep 2025 10:31:47 +1000",
        "category": "sports",
        "authors": [],
        "text": "6/26\n\nJanelle Lynch, who has been a Lions cheers squad member for 55 years, since she was five, met her husband, Ian, when he was a fellow cheer squad member when they were 15 years old. Credit:Jason South",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/i-disapprove-of-james-graham-s-attack-on-ashley-klein-but-i-ll-defend-his-right-to-spray-it-20250925-p5mxzb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I disapprove of James Graham’s attack on Ashley Klein. But I’ll defend his right to spray it",
        "publish_date": "Sat, 27 Sep 2025 09:45:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Perhaps freedom of speech is a more arcane concept than it first seems. Isn’t it an exercise in free speech for Penrith winger Brian To’o to go ballistic on his Instagram account at his club’s end-of-season presentation?\n\nIsn’t the father of Lleyton Hewitt railing against the sanctioning of his son for manhandling a doping control volunteer freedom of speech? Glynn Hewitt can say all he wants, and I’d defend his right to do so. But I would also suggest it wise for Hewitt Snr to consider the decision of the sanctioning panel, chaired by Michael Heron KC – who is a former Solicitor-General of New Zealand, not Dennis Denuto.\n\nAnyway, the much-vaunted “right to free speech” isn’t a Willy Wonka golden ticket that allows anyone to say anything, anywhere, with impunity. Instead, the “right” to say what you want is enshrined in the idea that government officials are legally barred from suppressing views the government itself doesn’t agree with.\n\nThe right to free speech does not confer upon Jimmy Kimmel the latitude to front his eponymous TV show and say whatever he wants about whomever he chooses. Defamation laws also operate as a curtailer.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/the-south-korean-market-where-you-can-still-buy-dog-meat-but-not-for-long-20250922-p5mx1f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The South Korean market where you can still buy dog meat, but not for long",
        "publish_date": "Sat, 27 Sep 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin",
            "Sean Na"
        ],
        "text": "At its peak, the market supplied one-third of the country’s canine meat, according to local media. Its closure in 2018 and a ban on selling live dogs were the first steps by authorities to end the trade completely, bringing it into line with other parts of Asia, including Hong Kong, Taiwan, Thailand and Singapore. Even Kim concedes the industry was already in decline with his customers, mostly older Koreans, but says the transition to goat meat has been difficult. “When business was good, we sold a lot of dog meat. Maybe about 100 kilograms a day. Now we sell 10 kilograms a day, or even less,” Kim says. Cha Hee-jung, 48, with her dog Dodam who she rescued from a dog meat farm eight years ago. Credit: Sean Na “After 2027, if anyone slaughters or eats dogs, they’ll be fined. Some people may still do it secretly, but it will mostly disappear.”\n\nRegular surveys show that eating dog meat is not popular, with one poll by Gallup Korea in 2022 finding just 8 per cent of Koreans had consumed it in the past year, down from 27 per cent in 2015, while 64 per cent opposed it. The ban was decreed under a national law passed in 2024, which gave dog farmers, butchers and restaurant owners three years to shut down their operations or switch jobs. It was accompanied by a package of financial support measures. Farmers who quickly shut up shop by early 2025 were compensated up to 600,000 won per dog they surrendered, with payments reducing to 225,000 won per dog as the 2027 deadline approaches. It also set government authorities on a mission to rehome up to half a million dogs in shelters or through adoption, but both farmers and animal rights activists agree there is little clarity about what happens to the dogs that can’t be rescued. “From an animal protection perspective, this is difficult and frustrating to discuss. We believe euthanasia is preferable to slaughter because the slaughter process violates animal welfare laws,” says Chae Il-taek, a senior director at the Korean Animal Welfare Association. The worst-case scenario, he says, is that dogs will be abandoned and left to reproduce in neglected conditions.\n\n“The government must act quickly to establish guidelines and budgets to ensure humane treatment during closures,” he says. On a Saturday morning in Seoul’s Olympic Park district, Cha Hee-jung, 48, is taking her dog Dodam for a walk. It has been eight years since she rescued Dodam, then a puppy, from a dog farm where he was being held in a small cage. His hind paw is wrapped in a bandage – an old injury he sustained from a fight with an older dog at the farm – and he is still a little skittish and doesn’t like people walking behind him. The Moran black goat street market in Seongnam, South Korea. Credit: Lisa Visentin “It’s a very, very dark business,” Cha says of the dog meat industry. When she found Dodam, she had been working with a volunteer animal rights group that tried to find rescue homes for farmed dogs, often by paying farmers to take the animals from squalid conditions.\n\n“But then, after this farmer got paid, he started having more dogs again and again,” she says of the farm where Dodam was found, adding they eventually abandoned rescue attempts there. But with the deadline for the ban now just 18 months away, Cha wants to see South Korean authorities provide financial assistance for those who rescue the remaining farm dogs, such as subsidised pet training. The South Korean government has said it will “strictly monitor the market” to ensure all dog farms close by 2027 or transition to new businesses. Any dogs left behind will be managed by local animal shelters or temporarily remain on the farms under government supervision. “We want support from the country’s dog meat business owners so that Korea can become an advanced nation with regard to animal welfare,” Park Jung-hoon, chief of the ministry’s Animal Welfare and Environment Policy Bureau said earlier this year. But the high costs of setting up new farming facilities for different livestock make transitioning impossible for most dog farmers, even with the compensation, says Ju Young-bong, president of the Korea Dog Meat Association.\n\n“Every dog facility must be demolished, and a new facility must be built for new species. That requires massive investment,” says Ju. Loading “Most dog farmers are over 60; I am over 60 as well. Even young farmers are finding it extremely difficult [to transition]. Almost no one can take on the challenge.” Still, more than 70 per cent of dog farms have already shut down, leaving about 500 running, according to the Ministry of Agriculture, Food and Rural Affairs. At Ju’s own farm, he now has just 300 dogs, down from 2000, but says many farmers are now facing their ageing years without an income stream, and compensation should be extended to cover this loss for at least two years.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/albanese-to-meet-with-king-charles-at-balmoral-20250927-p5mybi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese to meet with King Charles at Balmoral",
        "publish_date": "Sat, 27 Sep 2025 08:37:33 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Albanese to meet with King Charles at Balmoral\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-william-speaking-out-on-his-most-difficult-year-20250927-p5mybh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William speaking out on his most difficult year",
        "publish_date": "Sat, 27 Sep 2025 08:37:30 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William speaking out on his most difficult year\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-william-reveals-2024-was-hardest-year-of-his-life-20250927-p5mybf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William reveals 2024 was 'hardest year' of his life",
        "publish_date": "Sat, 27 Sep 2025 08:22:40 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William reveals 2024 was 'hardest year' of his life\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-william-opens-up-on-2024-in-eugene-levy-interview-20250927-p5mybc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince William opens up on 2024 in Eugene Levy interview",
        "publish_date": "Sat, 27 Sep 2025 08:18:40 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince William opens up on 2024 in Eugene Levy interview\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/anthony-albanese-sits-down-with-britain-s-pm-20250927-p5myb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese sits down with Britain’s PM",
        "publish_date": "Sat, 27 Sep 2025 07:27:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese sits down with Britain’s PM\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/benjamin-netanyahu-unleashes-on-world-leaders-who-recognise-palestine-20250927-p5myb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benjamin Netanyahu unleashes on world leaders who recognise Palestine",
        "publish_date": "Sat, 27 Sep 2025 07:23:54 +1000",
        "category": "finance",
        "authors": [],
        "text": "Benjamin Netanyahu unleashes on world leaders who recognise Palestine\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/sharks-coach-questions-penalty-count-20250927-p5myaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sharks coach questions penalty count",
        "publish_date": "Sat, 27 Sep 2025 06:17:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Sharks coach questions penalty count\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/could-18-penalties-cost-ashley-klein-the-nrl-grand-final-gig-20250926-p5my2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could 18 penalties cost referee Ashley Klein the NRL grand final gig?",
        "publish_date": "Sat, 27 Sep 2025 06:00:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Loading\n\nGrant Atkins could be just 80 minutes away from ousting Ashley Klein as next Sunday’s NRL Grand Final referee.\n\nKlein has been in charge of three deciders, including 2022 and 2024, but came under fire for blowing no fewer than 18 penalties during Friday night’s preliminary final between Melbourne and Cronulla.\n\nSharks coach Craig Fitzgibbon said the Storm deserved the win and were the better side, but the stop-start nature of the game would have made it difficult viewing for the fans – and hoped there would be no repeat next week.\n\nOne of the few times Klein should have blown the whistle was the 64th minute when Harry Grant appeared to execute a hip-drop tackle on Sharks flyer Ronnie Mulitalo.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/it-s-an-oasis-in-the-heart-of-suburbia-and-it-may-be-about-to-change-20250820-p5moej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s an oasis in the heart of suburbia. And it may be about to change",
        "publish_date": "Sat, 27 Sep 2025 05:30:00 +1000",
        "category": "finance",
        "authors": [
            "Carolyn Webb"
        ],
        "text": "“There’s a feeling of uncertainty,” said Weiss. “And some people are catastrophising, and saying the whole place is going to be destroyed.\n\nBut for how long? Change is looming now that the state government has pinpointed this relatively low-rise and low-key suburb in its citywide push for denser, higher-rise housing.\n\nLocals also praise the village feel of Blackburn’s main strip of mostly one- and two-storey shops in South Parade, opposite the station.\n\n“When you come home at night, it’s like walking into paradise. It’s fantastic.”\n\n“I love the area. It’s like the country, but you’re close to all the facilities,” said long-time resident Rob Weiss, who lives in the heavily treed, full-of-birdlife series of streets called the Bellbird area, which is less than one kilometre south of Blackburn railway station.\n\nEfforts since the 1960s to plant native trees and destroy weeds have paid off – in some corners, there’s a distinct feeling of being in the bush here, 17 kilometres east of Melbourne’s CBD.\n\nSome residents refer to Blackburn as a suburban oasis. A slice of paradise, where you wake up to the laugh of kookaburras and the smell of gum leaves.\n\nAdd articles to your saved list and come back to them any time.\n\nReferring to the Bellbird area, Weiss believes the new planning regime “if it allows higher-density developments here, will basically destroy the ambience of the whole place”.\n\nAnd townhouses and low-rise apartment blocks are permitted in a wider footprint around these hubs.\n\nWhile details for Blackburn’s activity centre aren’t out yet, indications – based on the recently announced 25 suburbs in the scheme – are that buildings of up to 16 storeys will be allowed in areas closest to trains.\n\nThe City of Whitehorse, which includes suburbs like Blackburn, Box Hill, Burwood and Mitcham, has been set a target of creating 76,500 new homes to help ease the housing crisis.\n\nThe state government has earmarked Blackburn to be among its next tranche of 25 suburbs that will have activity centres, aka “train and tram zones”.\n\n“I personally don’t think that. But it could still have some dramatic effects.”\n\nPayne and her husband, Ian, have volunteered for more than 50 years to preserve the sanctuary, a wildlife haven that was regenerated from farmland.\n\n“It’s really sad,” she said. “I guess we won’t be here to see it, but our children will.”\n\nAnne Payne, who since 1968 has lived in Central Road east of the station, opposite the 30-hectare Blackburn Lake Sanctuary bush park, reckons a house like hers – single-storey, 1940s weatherboard on a big block – could be demolished in the future and units built on the land under the new rules.\n\n“We recognise that there is need for new housing, but it shouldn’t be at the expense of the existing dense canopy cover, when the government is trying to increase canopy,” Weiss said.\n\nBuildings could now cover up to 25 per cent of a block, “which allows the rest for trees, but this could increase to buildings taking up most of the block”, he said.\n\nHe said the current height limit of houses in his area was two storeys, but he feared it could go to up to six storeys.\n\nPayne, a member of Whitehorse Historical Society, said that before European settlement, Indigenous people had moved through the area seasonally.\n\nPayne said “a lot of tree canopy” had already been lost “and the council’s and residents’ ability to change that, or have any say in that, is diminishing rapidly with the new housing policies”.\n\n“The housing around the area that should be the corridor for birdlife is becoming more and more concrete,” Payne said.\n\nThe sanctuary was protected, but the greenery amid housing around it was at risk, she said.\n\n“I see a beautiful bushland area that’s so precarious, in the middle of suburbia,” Payne said.\n\nPayne, who with Ian raised three daughters in Blackburn, loved how they could walk 400 metres from her house in Central Road to the South Parade shops.\n\nThe Blackburn and District Tree Preservation Society, which Payne joined in 1969, and of which she is now secretary, lobbied council to plant native trees along median strips, and members did their own planting.\n\nPayne said there was a surge in new housing after World War II. In the 1960s, “there was a big drive to have bushland settings and to try and grow indigenous plants” – not just in public parks but in the yards of houses.\n\nThe coming of the early coach route from Melbourne to Lilydale along Whitehorse Road then the railway line in 1882 led to shops and houses being built, and Blackburn Lake became a popular picnic destination.\n\nIn 1889, housing developers dammed Gardiners Creek to create Blackburn Lake to irrigate orchards and farms.\n\nIn the 1970s, there were two fruit shops, three butchers, three milk bars, a Supa Valu supermarket, a shoe shop, baby-wear shop, women’s clothing shop, the Blue Moon bakery, three banks and Raftis fuel merchants.\n\n“My girls would say, ‘Mum, when we go down to the shops, you’re not to talk to anyone’. Because everyone knew each other.”\n\nToday, there is one milk bar, no supermarket, no banks, lots of eateries, plus real estate agents, gift shops, a chemist, a newsagent and one chain store – a Subway.\n\nHowever, the strip has “always been referred to as Blackburn village” and Payne still runs into people she knows.\n\nLong-term business owner Cortney Wise, owner of Pride Lane hairdressing salon in South Parade, also has serious concerns about the government’s activity centre plans.\n\n“I feel like it’s going to completely change the landscape of Blackburn, in a negative way,” Wise said.\n\nWise’s shop has been a hairdresser for at least 60 years. Wise has owned the salon for 11 years, and her mother, Kerryn Pride, ran it for 11 years previously.\n\nHairdresser Cortney Wise, owner of Pride Lane salon, is concerned about future development of Blackburn. Credit: Eddie Jim\n\nWise said she, and many of her clients were “very scared, very worried” about the new plans.\n\nShe feared she would have to close the salon, and that outlets like the two-storey shop she rented would make way for 20-storey buildings. Taxes could soar due to re-zoning and redevelopment and current tenants would be priced out.\n\nWise said that while areas near Blackburn station needed an upgrade, the “activity centre” as she understood it was not the answer.\n\nRichard Welch, the Liberal member for the North-Eastern Metropolitan Region, has started a Save Blackburn campaign. Credit: Joe Armao\n\nWise feels that the state government has put an arbitrary “stamp” on locations around Melbourne such as this, “without consideration for Blackburn’s unique identity”.\n\nOn Wise’s salon wall, there is a poster saying Save Blackburn: No Activity Centre. It is authorised by Richard Welch, the Liberal upper house member for the North-Eastern Metropolitan Region.\n\nWelch, whose office is in Blackburn, believes there will be up to 20-storey towers built near Blackburn station, creating “canyon” and wind-tunnel effects, and that further from the station, six-storey apartment blocks will replace family homes.\n\nWelch’s campaign website, inviting comments he will pass on to parliament, has had 3000 responses.\n\nYoung nature lovers at Blackburn Lake Sanctuary. Credit: Joe Armao\n\nHe said “the overwhelming response” was that people didn’t want this level of high-rise or high-density housing, for reasons ranging from insufficient parking to mature trees being felled due to developers building-out to land boundaries.\n\nHe said “moderate and proportionate development” near the station would be more sensible, meaning three- to six-storey buildings, rather than “overwhelming” the area.\n\nWelch said businesses would be forced out, due to rezoning that raised building values, triggering windfall tax gainsfor the government. Landlords wouldl either have to sell to developers, or be forced to raise rents.\n\nWelch said Blackburn was known for its pleasant lifestyle. “People choose this area because the want to live in an environment like this. This will radically change the equilibrium.”\n\nBut the Labor state member for Box Hill, Paul Hamer said the Liberals were running a scare campaign.\n\n“Consultation will open soon for the Blackburn train and tram zone, and I encourage everyone in Blackburn to have their say,” Hamer said.\n\n“Planning Minister Sonya Kilkenny recently joined me for a local walk in Blackburn with a representative of the Blackburn Residents Action Group for the minister to see the qualities that make Blackburn unique.”\n\nReferring to the Bellbird area, which currently has council landscape protection controls, Hamer said: “Landscape overlays that apply south of the station will continue to apply under any possible planning changes that may be considered as part of the program.\n\n“Liberal scare campaigns are just that and are not based on fact,” Hamer said.\n\nAccording to the state government, the first round of consultation for the next 25 activity centres, including Blackburn, will open in the coming months.\n\nFeedback from this round would inform the development of draft maps, including draft heights and boundaries, which will go back to the community for further input.\n\nA government spokesperson said it would “work closely with the community on our plan to deliver more homes where we need them most”.\n\n“We are building more homes in Blackburn because it is well-connected to public transport – with the Lilydale Line level crossing-free, and Belgrave and Lilydale lines running services every five minutes during peak times.\n\n“Too many people are locked out of suburbs where they grew up or want to live, and we’re on their side – that’s why we’ve introduced bold reforms to boost housing supply in areas where Victorians have been locked out for far too long.”\n\nKieran Simpson, an independent City of Whitehorse councillor for Cootamundra ward, which covers Blackburn, and who is a Labor Party member, said: “My position is that we need to wait and see what the plans say.”\n\nSimpson acknowledged that some people were fearful, however, he said: “I believe that’s because there is a narrative being promulgated at the moment that’s designed to scare people.”\n\nCity of Whitehorse councillor Kieran Simpson says he doesn’t believe there will be 20-storey buildings in Blackburn. Credit: Joe Armao\n\nHe said Box Hill’s development “isn’t a comparison to what we’re going to get, due to different zoning” and he didn’t see Blackburn as having the same level of density as Box Hill in future.\n\n“Some residents are opposed to any densification, and I respect their point of view,” he said. “I cannot deny that there will be some increased densification in the area. But I do not believe that we’re going to see 20-storey towers.”\n\nOne new Blackburn resident, Angus McLay, moved with his partner days ago into a rented apartment on the sixth floor of a seven-floor block, built two years ago in Whitehorse Road. “We’d been looking for our first home for a while, it’s a nice area, there’s a train station nearby, lots of facilities around.”\n\nAngus McLay has just moved into an apartment in a seven-storey block, built a few years ago in Whitehorse Road, Blackburn. Credit: Joe Armao\n\nHis balcony has a view of Box Hill’s cluster of apartment towers, three kilometres away.\n\nMcLay, 25, a structural engineer, said he liked Blackburn’s leafiness but added: “I don’t mind the idea of more high-rises. I definitely understand it.\n\n“I don’t want it to get to the stage of Box Hill, though, when it’s almost that there’s too many.”\n\nTess de Vries, a doctor aged in her 30s who rents a house in southern Blackburn, said she was “torn” about the proposed planning rules.\n\nTess de Vries has lived in a house in the south of Blackburn for three years. Credit: Eddie Jim\n\nIncreased density of housing was needed to accommodate the growing population, but it shouldn’t compromise “the integrity of the suburb”.\n\nde Vries feels that allowing 16-storey high-rises “might be a little bit too much” in changing the feel of the suburb.\n\nHaving three or four-storey apartment blocks further out would “depend on how they plan it”.\n\nShe called for “smart planning” that would preserve gardens.\n\n“I’m torn because there is going to be development. We can’t stop it. I just want it to be done in a way that is sensible and preserves the character of our neighbourhoods around Melbourne,” de Vries said.\n\nThe Morning Edition newsletter is our guide to the day’s most important and interesting stories, analysis and insights. Sign up here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/the-time-is-right-for-the-time-is-now-wrestling-s-most-maligned-anthem-20250918-p5mw5z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The time is right for The Time Is Now, wrestling’s most maligned anthem",
        "publish_date": "Sat, 27 Sep 2025 05:30:00 +1000",
        "category": "sports",
        "authors": [
            "Scarlett Harris"
        ],
        "text": "“You don’t get new music because that is my voice on that song and your time is up, my time is now,” said John Cena about his iconic theme song, The Time Is Now, when he turned heel – wrestling speak for became the villain – earlier this year. Cena is inching towards the final leg of his wrestling retirement tour to focus on acting full-time after 23 years with World Wrestling Entertainment, including a date in Perth for WWE Crown Jewel next month.\n\nMost wrestlers undergo such transformations in their careers, oscillating between heel and babyface (hero). Cena debuted as a generic babyface before settling on his white rapper character, the Doctor of Thuganomics, a natural heel who freestyled on the mic as well as in the ring. But his popularity – at least among children and their merchandise-buying parents – soon forced him into the role of a babyface, one he’s inhabited for the better part of two decades.\n\nWith tears in your eyes, chant along with us: “John Cena suuuucks!” Credit: WWE via Getty Images\n\nWhile his wrestling promos are rarely lyrical any more, he has maintained his all-American look – baggy denim shorts, sneakers in lieu of traditional wrestling boots, bright matching t-shirt and baseball cap boasting aspirational catchphrases like “Hustle, loyalty, respect” and “You want some, come get some” – as well as his signature theme song, a rarity in wrestling except for the most untouchable stars.\n\nLike Cena himself, The Time Is Now has crossed over into the mainstream in a way not often seen in wrestling. The song has found its way to NFL team entrances to Carpool Karaoke to car ads and even Cena’s own Neutrogena commercial this year. In a time when monoculture is extinct, it’s no mean feat that it retains such relevance.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/highly-infectious-disease-rise-aus-005530620.html",
        "title": "Highly infectious disease on the rise in Aus",
        "publish_date": "2025-09-27T00:55:30Z",
        "category": "lifestyle",
        "authors": [],
        "text": "A highly-contagious virus is making a troubling comeback - a decade after it was wiped out in Australia.\n\nSo far this year, 127 measles cases have been recorded nationwide, the highest since 2019, prompting public health alerts and temporary precautions in several states.\n\nExperts say misinformation on social media, including false claims originating from the United States, has contributed to declining confidence in vaccines, leaving more Australians vulnerable.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nQueensland, Western Australia, Victoria, and New South Wales have all reported cases, with many linked to travellers returning from Southeast Asia, particularly Bali.\n\nExperts warn that declining childhood vaccination rates are leaving Australia vulnerable to measles outbreaks. Picture: Department of Health and the Australian Academy of Science.\n\nA highly contagious threat\n\nProfessor Adrian Esterman, Chair of Biostatistics and Epidemiology at the University of South Australia, described the virus as “one of the most contagious viruses known, far more infectious than influenza.”\n\n“It spreads through microscopic droplets released when an infected person coughs, sneezes, or even breathes. These droplets can remain suspended in the air for up to two hours, infecting others even if the person has no rash,” Professor Esterman told NewsWire.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“If you’re not immune and are exposed, there’s about a 90 per cent chance you’ll become infected. Because people can transmit the virus for about four days before the telltale rash appears, outbreaks often start silently, long before anyone realises measles is circulating.”\n\nProfessor Esterman said that while most people recover, measles is far from harmless. It can cause pneumonia, brain inflammation (encephalitis), or death, especially in young children, pregnant women, and people with weakened immune systems.\n\nAuthorities stress that vaccination remains the strongest defence. Two doses of the measles-mumps-rubella (MMR) vaccine are recommended for full protection, but coverage is slipping.\n\nTwo doses of the MMR vaccine provide around 97 per cent protection and catch-up vaccinations are essential. Picture: Supplied\n\nDeclining coverage since the pandemic\n\nThe National Centre for Immunisation Research and Surveillance (NCIRS) Annual Immunisation Coverage Report 2024 shows “concerning and ongoing declines” in childhood vaccination.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCoverage fell across all three childhood milestones, 12, 24, and 60 months, with 24-month coverage dropping below 90 per cent for the first time since 2016.\n\nOn-time vaccination has also fallen sharply. In 2024, one in three children received their first MMR dose late, and one in five were delayed for their second diphtheria-tetanus-pertussis dose.\n\nFor measles specifically, on-time coverage of the first MMR dose was more than 11 percentage points lower than in early 2020.\n\nAdolescent vaccination has suffered too. Two out of 10 adolescents had not received the HPV vaccine by age 15, while three in 10 missed their meningococcal ACWY dose by age 17.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDeclines are even steeper among Aboriginal and Torres Strait Islander children. One in two received their first MMR dose late, three in 10 had not received HPV by 15, and four in 10 missed meningococcal ACWY by 17.\n\nHealth officials warn that targeted strategies are urgently needed for these populations.\n\n“If that trend continues, we can expect more frequent, larger outbreaks over the next decade, especially in childcare centres, schools, and under-vaccinated communities. Even a handful of imported cases could spark chains of transmission,” Professor Esterman warned.\n\nProfessor Esterman urges people to watch for symptoms up to 18 days after possible measles exposure and stay home if unwell. NCA NewsWire / David Mariuz\n\nMistrust and misinformation\n\nA new paper from the National Vaccination Insights project highlights key barriers to childhood vaccination, including costs, limited appointment availability, and declining trust in immunisation information.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nLead author Dr Kasia Bolsewicz said childhood vaccination rates remain below the national target of 95 per cent. She emphasised prioritising catch-up doses for overdue children to prevent serious, vaccine-preventable diseases.\n\nDr Maryke Steffens, also from NCIRS, said a 2024 survey of 2000 parents revealed obstacles including appointment difficulties, cost, safety concerns, and mistrust of provider information.\n\nShe outlined four priority actions: improving access through bulk billing and after-hours clinics, supporting healthcare providers, engaging communities with trusted messages, and providing better local immunisation data.\n\n“Because these barriers are complex, no single solution will suffice. Coordinated, multi-sector action is essential,” Dr Steffens said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMistrust and misinformation also play a significant role, with false claims about vaccine safety and effectiveness circulating on social media and from international sources.\n\nAdjunct Professor Terry Slevin, CEO of the Public Health Association of Australia, said the United States has influenced the flow of false or misleading information about vaccines.\n\n“The power and reach of social media, the challenges raised by COVID-19 and misinformation around immunisation coming out of the USA mean it has never been more important to boost access to and confidence in vaccines,” Professor Slevin said.\n\nExperts warn that even a single imported case can spark an outbreak in areas with low vaccination coverage. Image: ISTOCK\n\nResetting Australia’s immunisation agenda\n\nThe federal government has launched the National Immunisation Strategy for Australia 2025–2030, setting six priority areas to reverse downward trends and tackle vaccine hesitancy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA key focus is engagement with communities, particularly Aboriginal and Torres Strait Islander Peoples, to address inequities in access and uptake.\n\nOther priorities include improving the timeliness and quality of immunisation register data, strengthening the immunisation workforce, expanding catch-up vaccination activities, and exploring a no-fault vaccine injury compensation scheme.\n\nTargeted strategies are already underway, including free SMS recall programs reminding older Australians to catch up on pneumococcal and COVID-19 vaccinations.\n\nThe Australian Immunisation Handbook has also been updated with guidance for immunocompromised people.\n\nMeasles can be severe, especially for young children and those with weakened immune systems. Picture: istock\n\nExperts urge vigilance\n\nQueensland Health’s Dr Jacqueline Murdoch urged holidaymakers to check their vaccination status before travelling overseas.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“If anyone is going to these places over the school holidays or in the upcoming months, please see your GP and make sure you have sufficient immunity to measles,” Dr Murdoch said.\n\nGPs are also being advised to stay alert. With measles having a basic reproduction number of 12 to 18, even a single imported case can trigger a significant outbreak in under-vaccinated areas.\n\nProfessor Esterman stressed that anyone who may have been exposed should check their vaccination status without delay.\n\n“Two doses of the MMR vaccine provide about 97 per cent protection,” Professor Esterman said.\n\nIf you’re unsure or haven’t had both doses, see your GP promptly. Vaccination within 72 hours of exposure can still help.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Watch for symptoms for up to 18 days after exposure and stay home if you become unwell to avoid infecting others. Contact your GP before attending to avoid exposing others.”\n\nTemporary precautions, including alerts and mask requirements, have been introduced in some hospitals to limit transmission. Picture: Getty\n\nA narrowing window\n\nHealth experts warn the current window to prevent widespread measles transmission is narrowing. Australia was declared free of endemic measles in 2014, but local clusters in under-vaccinated communities underscore how fragile that status is.\n\n“Measles is, in many ways, a litmus test for public health,” Professor Esterman said.\n\n“If we let vaccination rates fall, it’s not a question of if measles outbreaks will occur, but when.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/shoddy-build-leaves-woman-homeless-091933152.html",
        "title": "New home uninhabitable after critical error",
        "publish_date": "2025-09-27T00:17:45Z",
        "category": "finance",
        "authors": [],
        "text": "A woman is homeless after her new house was left in ruins by an “incompetent” builder that used telecommunication pipes instead of proper PVC in the plumbing.\n\nPerth resident Kathy Ellis spent years living in a caravan while she waited for her “shoddy” home to be completed by banned Perth builders NicheLiving.\n\nWhen she was finally able to move into the home, her dreams were quickly dashed as the house crumbled around her.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAnother builder that completed the job found her ensuite and shower were not connected to the plumbing, and the plumber had used telecommunications piping.\n\nShe has been left with a $100,000 damages bill to fix the mess.\n\nNiche Living customer Kathy Ellis was left with a shoddy home constructed by the banned builders NicheLiving that used telecommunication piping instead of PVC piping in the plumbing. Picture: Nine News\n\nNine News footage shows mould growing throughout the home and masses of water drip through the ceiling when she uses taps upstairs.\n\nMs Ellis cut holes in her roof to collect water that pours into buckets on the ground floor of her newly built home.\n\n“The assessor that came out is concerned the weight of the water is going to actually make the ceiling fall down,” she told Nine News.\n\n“It was him that discovered in the ceiling there’s communications PVC piping instead of plumbing piping.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He laughed and said: ‘This has got to be a joke.’\n\n“I said, ‘No, it was built by Niche Living,’ and he goes ‘Oh, okay.’\n\n“The stress of all that — I can’t get to sleep, then I wake up at 4am.”\n\nPerth resident Kathy Ellis was told her ceiling could collapse from the weight of water in her new NicheLiving home. Picture: Nine News\n\nNationals WA leader Shane Love called on the state government to step in and support Ms Ellis and other families left with shoddy work and incomplete homes by NicheLiving.\n\nLast year, the state government banned NicheLiving directors from building for 10 years and provided a $40m Home Insurance Indemnity Scheme from policy premiums paid by builders to finish the incomplete NicheLiving homes.\n\nClaims made under the scheme were assessed by the insurer and paid out up to the maximum cap of $200,000 for unfinished or defective works.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut Mr Love said it wasn’t enough to cover the damage for heartbroken customers who were left with crippling costs and little support.\n\n“Kathy is once again homeless because of the sheer incompetence of NicheLiving, and worse, she has very little resource because of the indemnity deal signed off by the Cook Labor Government which shields NicheLiving and its directors from further penalties,” he said.\n\nA NicheLiving customer cut holes in their ceiling to let water pour down from the upstairs taps. Picture: Nine News\n\n“And the limited Home Indemnity Insurance she has access to simply doesn’t cover the scale of the damage.”\n\nMr Love said the government signed off on the deal and should take responsibility to resolve issues on a case-by-case basis.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The extra cost to government may be in the millions, but that’s the price of doing the right thing after years of turning a blind eye to the problems being caused by NicheLiving,” he said.\n\n“Families should not be left to chase the Building Commissioner or the State Administrative Tribunal when the Government could act now.\n\n“The Cook Labor government needs to stop dragging its feet, stop hiding behind legal agreements, and do the right thing for WA families who have already suffered enough.”\n\n“We empathise with Nicheliving customers and that’s why our Government stepped in last year and made an agreement with A WA Government spokesman said the deal secured a clear pathway forward so that owners of incomplete residential houses could proceed with claims under home indemnity insurance policies and finish their private builds.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It’s unfortunate to hear some customers have found defects in completed private building projects, homeowners should work with their new builder to fix the issues in the first instance,” a spokesman said.\n\n“If new homeowners remain unsatisfied, we would advise them to lodge a building service complaint with Building and Energy for further investigation.”",
        "source": "Yahoo"
    }
]