[
  {
    "url": "https://www.9news.com.au/world/china-has-a-valuable-card-to-play-as-it-holds-trade-talks-with-the-us-today/65b87191-b89d-491e-a3df-f4503b42def7",
    "title": "China's valuable card that puts Trump in a tough spot",
    "publish_date": "Tue, 10 Jun 2025 00:28:29 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A new round of trade negotiations between the United States and China will continue into tomorrow in London, with both sides trying to preserve a fragile truce brokered last month.\n\nThe fresh talks were announced last week after a long-anticipated phone call between US President Donald Trump and Chinese leader Xi Jinping, which appeared to ease tensions that erupted over the past month following a surprise agreement in Geneva.\n\nThe talks began yesterday and tomorrow will mark the second day, a source told CNN.\n\nREAD MORE: About 700 Marines being mobilised in response to LA protests\n\nA new round of trade negotiations between the United States and China will continue into Tuesday in London, with both sides trying to preserve a fragile truce brokered last month. (CNN)\n\nLast month, the two sides agreed to drastically roll back tariffs on each other's goods for an initial 90-day period. The mood was upbeat.\n\nHowever, sentiment soured quickly over two major sticking points: China's control over so-called rare earth minerals and its access to semiconductor technology originating from the US.\n\nBeijing's exports of rare earths and their related magnets are expected to take centre stage at the London talks.\n\nExperts say Beijing is unlikely to give up its strategic grip over the essential minerals, which are needed in a wide range of electronics, vehicles and defence systems.\n\n\"China's control over rare earth supply has become a calibrated yet assertive tool for strategic influence,\" said Robin Xing, Morgan Stanley's chief China economist.\n\n\"Its near-monopoly of the supply chain means rare earths will remain a significant bargaining chip in trade negotiations.\"\n\nSince the talks in Geneva, Trump has accused Beijing of effectively blocking the export of rare earths, announcing additional chip curbs and threatening to revoke the US visas of Chinese students.\n\nREAD MORE: NSW Deputy Premier Prue Car diagnosed with breast cancer\n\nSince the talks in Geneva, Trump has accused Beijing of effectively blocking the export of rare earths (CNN)\n\nThe moves have provoked backlash from China, which views Washington's decisions as reneging on its trade promises.\n\nAll eyes will be on whether both sides can come to a consensus in London on issues of fundamental importance.\n\nUS Treasury Secretary Scott Bessent, Commerce Secretary Howard Lutnick and Trade Representative Jamieson Greer will meet a Chinese delegation led by Vice Premier He Lifeng.\n\nTrump has authorised his trade negotiating team, led by Bessent, to ease up on some key export restrictions of US goods to China that the United States had put in place for national security concerns, three sources familiar with the matter told CNN.\n\nIt remains unclear exactly what the negotiators will put on the table, but it appears as though the Trump administration will draw the line at some critical technology that the United States maintains is crucial for its competitiveness with China, the world's second-largest economy.\n\nIn exchange for immediately easing or halting some — or perhaps a large number of – export controls, the United States wants China to release high volumes of rare earth materials. On Saturday, Beijing appeared to send conciliatory signals.\n\nA spokesperson for China's Commerce Ministry, which oversees the export controls, said it had \"approved a certain number of compliant applications.\"\n\nREAD MORE: Hundreds stranded after Qantas jet forced to divert\n\nit appears as though the Trump administration will draw the line at some critical technology that the United States maintains. (AP)\n\n\"China is willing to further enhance communication and dialogue with relevant countries regarding export controls to facilitate compliant trade,\" the spokesperson said.\n\nKevin Hassett, head of the National Economic Council at the White House, told CBS's Face the Nation on Sunday that the US side would look to restore the flow of rare earth minerals.\n\n\"Those exports of critical minerals have been getting released at a rate that is higher than it was, but not as high as we believe we agreed to in Geneva,\" he said, adding that he is \"very comfortable\" with a trade deal being made after the talks.\n\nOn Monday morning in an interview with CNBC, Hassett said: \"This was a very significant sticking point, because China controls … something like 90 per cent of the rare earths and the magnets.\n\nAnd if they're slow rolling, sending those to us because of some licensing deal that they set up, then it could potentially disrupt production for some US companies that rely on those things.\"\n\n\"And there are enough of those, like, for example, auto companies, that President Trump took it very seriously, called President Xi and said, we got to get this stuff coming out faster. And President Xi agreed,\" he added.\n\nHassett said the Trump administration might be open to loosening restrictions on some microchips that China viewed as critical to its manufacturing sector, although the United States would maintain restrictions on \"very, very high-end Nvidia\" chips that were capable of powering artificial intelligence systems.\n\nFollowing the trade truce negotiated in Geneva, the Trump administration expected China to lift restrictions on those minerals. (AP)\n\nThe Biden administration had cut off Chinese access to most AI chips because of national security concerns, and Trump has kept those restrictions in place.\n\nA valuable card to play In April, as tit-for-tat trade tension between the two countries escalated, China imposed a new licensing regime on seven rare earth minerals and several magnets, requiring exporters to seek approvals for each shipment and submit documentation to verify the intended end use of these materials.\n\nFollowing the trade truce negotiated in Geneva, the Trump administration expected China to lift restrictions on those minerals.\n\nBut Beijing's apparent slow-walking of approvals triggered deep frustration within the White House, CNN reported last month. Rare earths are a group of 17 elements that are more abundant than gold and can be found in many countries, including the US.\n\nBut they're difficult, costly and environmentally polluting to extract and process. China controls 90 per cent of global rare earth processing.\n\nExperts say it's possible that Beijing may seek to use its leverage over rare earths to get Washington to ease its own export controls aimed at blocking China's access to advanced US semiconductors and related technologies.\n\nThe American Chamber of Commerce in China said on Friday that some Chinese suppliers of American companies had received six-month export licences.\n\nReuters, citing two sources, also reported that suppliers of major American carmakers – including General Motors, Ford and Jeep-maker Stellantis – were granted temporary export licences for a period of up to six months.\n\nWhile China may step up the pace of licence approvals to cool the diplomatic temperature, global access to Chinese rare earth minerals will likely remain more restricted than it was before April, according to a Friday research note by Leah Fahy, a China economist and other experts at Capital Economics, a London-based consultancy.\n\n\"Beijing had become more assertive in its use of export controls as tools to protect and cement its global position in strategic sectors, even before Trump hiked China tariffs this year,\" the note said.\n\nChina's economic woes\n\nAs China tackles a tariff war with the US head-on, it's clear that the disruptions are continuing to cause economic pain at home.\n\nTrade and price data released on Monday painted a gloomy picture for the country's export-reliant economy.\n\nIts overall overseas shipments rose by just 4.8 per cent in May, compared to the same month a year earlier, according to data released by China's General Administration of Customs.\n\nThe Biden administration had cut off Chinese access to most AI chips because of national security concerns. (AP)\n\nIt was a sharp slowdown from the 8.1 per cent recorded in April, and lower than the estimate of 5.0 per cent export growth from a Reuters poll of economists.\n\nIts exports to the US suffered a steep decline of 34.5 per cent.\n\nThe sharp monthly fall widened from a 21 per cent drop in April and came despite the trade truce announced on May 12 that brought American tariffs on Chinese goods down from 145 per cent to 30 per cent.\n\nStill, Lü Daliang, a spokesperson for the customs department, talked up China's economic strength, telling the state-run media Xinhua that China's goods trade had demonstrated \"resilience in the face of external challenges\".\n\nMeanwhile, deflationary pressures continue to stalk the world's second-largest economy, according to data released separately on Monday by the National Bureau of Statistics (NBS).\n\nIn May, China's Consumer Price Index (CPI), a benchmark for measuring inflation, dropped 0.1 per cent compared to the same month last year.\n\nFactory-gate deflation, measured by the Producer Price Index (PPI), worsened with a 3.3 per cent decrease in May from a year earlier.\n\nLast month's drop marks the sharpest year-on-year contraction in 22 months, according to NBS data.\n\nDong Lijuan, chief statistician at the NBS, attributed the decline in producer prices, which measures the average change in prices received by producers of goods and services, to a drop in global oil and gas prices, as well as the decrease in prices for coal and other raw materials due to low cyclical demand.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/prue-car-nsw-deputy-premier-diagnosed-breast-cancer/5557902e-fe10-4a1d-b6ee-ce550ad7fd2e",
    "title": "NSW deputy premier reveals cancer diagnosis",
    "publish_date": "Mon, 09 Jun 2025 21:29:28 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "New South Wales Deputy Premier Prue Car has been diagnosed with breast cancer.\n\nThe Londonderry MP revealed the \"not so great\" news in a statement this morning.\n\n\"Some recent screening has confirmed that I've been diagnosed with breast cancer,\" she said.\n\nNSW Deputy Premier Prue Car has been diagnosed with breast cancer. (Prue Car/X)\n\n\"This means that I'm going to have to have a little bit of time off.\"\n\nCar said she would be receiving \"some pretty significant treatment\" and that others would act for her in her ministerial roles.\n\nAs well as being deputy premier, Car holds the portfolios of Education and Early Learning, and Western Sydney.﻿\n\nREAD MORE: Hundreds stranded after Qantas jet forced to divert ﻿\n\nShe urged residents of her electorate to continue to contact her office with any issues of concern.\n\n\"I've fought this before and I'm really confident that I can fight it again,\" Car said.\n\n\"The prognosis is good. The amazing medical team around me are really hopeful about the prospects after treatment, and so am I.\"\n\nCar and NSW Premier Chris Minns with King Charles and Queen Camilla during the royal couple's visit to Australia. (Getty)\n\nShe thanked the \"absolutely amazing\" workers of NSW Health﻿ and urged women to be \"really vigilant\" with their checks.\n\nShe noted her condition had been caught early.\n\n\"I know a lot of people have been through this and there's lots of people in our community that have been affected by cancer, particularly breast cancer,\" Car said.\n\n\"And I'll just be taking this time to get myself well and spend time with my young family. So thanks very much, and I'll see you around.\"\n\nCar had previously been diagnosed with kidney can﻿cer in 2022.\n\nPremier Chris Minns﻿ said on X that the state governments thoughts were with their \"colleague and friend\".\n\n\"I know Prue well. She is a fighter, and I know she will face this challenge with the same determination and grace that she brings to everything she does,\" Minns wrote.\n\nHe said he had asked Minister for Natural Resources Courtney Houssos, a member of the NSW Legislative Council, to act for Car in the latter's ministerial portfolios.\n\nSuper-rich family torn apart by sensational murder trial View Gallery\n\nCar will remain deputy premier of NSW in her absence.﻿\n\nNSW opposition leader Mark Speakman also posted a message wishing Car well on X.\n\n\"On behalf of the NSW opposition, and as a fellow MP, I know her community of Londonderry and colleagues will all be with her – and we're wishing her strength, care and a full recovery,\" he said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/baldonis-complaint-escalated-the-ongoing-legal-battle-stemming-from-the-film-that-baldoni-directed-and-costarred-in-with-lively/b1fd4c8c-9b1c-4882-a0b8-d1c9c57e6d5d",
    "title": "Judge dismisses $400m defamation suit against Blake Lively and Ryan Reynolds",
    "publish_date": "Mon, 09 Jun 2025 22:47:05 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A judge on Monday dismissed Justin Baldoni's $400 million defamation lawsuit against Hollywood power couple Blake Lively and Ryan Reynolds, a major development in the ongoing civil litigation between former co-stars Lively and Baldoni.\n\nIn January, Baldoni sued Lively and her husband Ryan Reynolds, alleging that the Hollywood couple sought to \"destroy\" him and his career, after hijacking his film, \"It Ends With Us.\"\n\nBaldoni's complaint escalated the ongoing legal battle stemming from the film that Baldoni directed and co-starred in with Lively.\n\nREAD MORE: About 700 Marines being mobilised in response to LA protests\n\nA judge on Monday dismissed Justin Baldoni's $400 million defamation lawsuit against Hollywood power couple Blake Lively and Ryan Reynolds. (CNN)\n\nIn a statement, Lively's lawyers Esra Hudson and Mike Gottlieb called the ruling \"a total victory and a complete vindication.\"\n\n\"As we have said from day one, this '$400 million' lawsuit was a sham, and the Court saw right through it,\" the statement added.\n\nMotions to dismiss Baldoni's claims by Lively, Reynolds and their publicist, Leslie Sloane, were all granted. The judge also granted a motion to dismiss by the New York Times.\n\nBaldoni had sued the publication for $250 million for libel, claiming that the newspaper published an article \"rife with inaccuracies, misrepresentations, and omissions\" that relied on Lively's \"self-serving narrative.\"\n\nThe judge ruled that Baldoni can file an amended complaint on the allegations of tortious interference with contract, relating to Reynolds and Lively, and breach of implied covenant, relating to Lively, by June 23, if they choose to do so.\n\nREAD MORE: NSW Deputy Premier Prue Car diagnosed with breast cancer\n\nLively first filed a civil rights complaint, claiming that she was sexually harassed by Baldoni during production of the film. (Getty)\n\nIn a statement, New York Times spokesperson Charlie Stadtlander said, \"We are grateful to the court for seeing the lawsuit for what it was: a meritless attempt to stifle honest reporting.\"\n\n\"Our journalists went out and covered carefully and fairly a story of public importance, and the court recognised that the law is designed to protect just that sort of journalism,\" the statement added.\n\n\"We will continue to stand up in court for our journalism and for our journalists when their work comes under attack.\"\n\nCNN has reached out to representatives for Baldoni for comment.\n\nA months-long legal battle\n\nThe ongoing saga between Lively and Baldoni erupted in December 2024, when Lively first filed a civil rights complaint, claiming that she was sexually harassed by Baldoni during production of the film and then was retaliated against for speaking up about her alleged mistreatment.\n\nBaldoni immediately denied Lively's claims.\n\nLively eventually escalated her civil rights complaint, officially filing a lawsuit against Baldoni.\n\nREAD MORE: Hundreds stranded after Qantas jet forced to divert\n\nJustin Baldoni and Blake Lively in It Ends With Us. (Sony Pictures)\n\nShe alleged that after being sexually harassed with inappropriate comments and behaviour on set, Baldoni's team then orchestrated a smear campaign against her to ruin her reputation in the public sphere.\n\nLively's complaint contained hundreds of text messages between Baldoni and his crisis PR team, including one text that read they could \"bury\" her.\n\nThe New York Times was the first to report – in an article titled \"'We Can Bury Anyone': Inside a Hollywood Smear Machine\" – that Lively had filed a complaint with Civil Rights Department about Baldoni's alleged conduct on set of \"It End With Us\" and after production.\n\nThose complaints are typically confidential.\n\nBaldoni's production company Wayfarer Studios, his business partner Jamey Heath, Wayfarer co-founder Steve Sarowitz, and members from Baldoni's PR and crisis management team were all cited as plaintiffs on the suit against the Times.\n\nThe judge's ruling did not address the merits of Baldoni's complaint but rather held that Lively's sexual harassment claims in her complaint were protected by law and could not form the basis of a defamation claim.\n\nHe cited a piece of California legislation that came in response to the #MeToo movement.\n\nAs their legal fight unfolded, Baldoni's team published a website containing texts and an alleged timeline relating to Lively's claims. (Getty)\n\nHe also wrote in his decision that the act of providing Lively's complaint to the New York Times was not sufficient to constitute defamation \"because the complaint is protected by the fair report privilege.\"\n\nAs their legal fight unfolded, Baldoni's team published a website containing texts and an alleged timeline relating to Lively's claims.\n\nThe website, a separate leaked voice note that Baldoni sent to Lively and several public statements made by Baldoni's lawyer were the subject of several court hearings in recent months.\n\n\"It Ends With Us\" starred Lively and Baldoni as an on-screen couple and featured instances of domestic violence.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/technology/most-anticipated-video-games-releasing-in-2025/6927c72a-5a89-4c3d-9147-f2ae1707c74e",
    "title": "The most anticipated video games of 2025",
    "publish_date": "Wed, 12 Feb 2025 05:49:36 +0000",
    "category": "finance",
    "authors": [
      "February"
    ],
    "text": "1 of 22 Attribution: Nine\n\nGrand Theft Auto VI is by far the most anticipated game of the last 10 years, and it's scheduled to release in 2025.\n\nBut that's not all, this year is bringing with it an all new console from Nintendo, the Nintendo Switch 2, alongside a new Mario Kart.\n\nThere's dozens more great gaming titles on the way, here's our list of the most anticipated.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/jobs-fastest-salary-growth-seek-data/6b19c6bc-3089-42fa-b04c-be4b88865990",
    "title": "Want a pay rise? These jobs experienced the fastest salary growth this year",
    "publish_date": "Mon, 09 Jun 2025 19:40:13 +0000",
    "category": "finance",
    "authors": [
      "June"
    ],
    "text": "1 of 11 Attribution: Supplied\n\nWant a pay rise?\n\n﻿New data from Seek has revealed the roles that have experienced some of the fastest advertised salary growth between February and April, compared to the same quarter last year.\n\nThe mining and construction industry has seen some of the strongest growth.\n\nFrom 15 to more than 26 per cent, here are the top 10 roles.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/restricted-cable-beach-4wd-access-redevelopment-angers-locals/105391768",
    "title": "Restricted 4WD access at famous WA beach leaves locals fuming",
    "publish_date": "Tue, 10 Jun 2025 01:49:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "The ongoing redevelopment of one of Western Australia's most famous beaches is frustrating locals, who have lost four-wheel drive access to a popular stretch of the sand.\n\nStage one of works at Cable Beach, 2,100km north of Perth, was recently completed and the Shire of Broome's main redevelopment is now getting underway.\n\nThe 22-kilometre-long beach is one of Broome's premier tourist attractions and is famous for its four-wheel drive access.\n\nCrowds sprawl across the sand in deck chairs and cars every night to watch the sun set, but stage two of the redevelopment has seen vehicle access to the northern stretch of the beach cut and its main car parks closed.\n\nThe disruption has left residents frustrated and nearby businesses scrambling to relocate.\n\nStage 2 of the redevelopment will see access ramps to the beach and roads temporarily closed. (ABC Kimberley: Ruby Littler)\n\nA trade-off for residents\n\nOnce complete, the redevelopment will feature improved public spaces coupled with better beach access and protection for the coast.\n\nStage one of the development targeted the precinct's southern end, where Premier Roger Cook unveiled a new basketball court and skate park last week.\n\nAn artist's impression of the multi-million-dollar redevelopment. (Supplied: Shire of Broome)\n\nStage two, targeting the remaining areas, includes a community plaza, water park and amphitheatre.\n\nBut Broome residents face a challenging trade-off, as the works are not expected to be complete until mid-to-late 2026.\n\nFood vans forced to move\n\nFor years, food trucks have set up shop in an area near the beach now impacted by the development.\n\nThe space has been designated as overflow parking while access to the main car park is closed.\n\nSomjit Onvimon says the redevelopment has caused her business sales to plummet. (ABC Kimberley: Dunja Karagic)\n\nFood van owners Petris Torres and Somjit Onvimon said trying to find somewhere else to trade had been tough.\n\n\"It's attacking my business so bad,\" Ms Onvimon said.\n\n\"We tried to ask them (the shire) about which spot, 'Can we go here and can we go there?' They keep saying no and no.\n\n\" It makes us very broken-hearted. \"\n\nMany vans have resorted to trading from the Broome Turf Club car park at Gantheaume Point to the south, but there is less foot traffic and many customers have said it is too far.\n\n\"We did less than half of our normal earnings … and it's not like less than half is still good,\" Mr Torres said.\n\n\"It's very easy to identify the problems — where the energy needs to go is finding the solutions.\"\n\nThe sentiment has been echoed by other vendors, who are pleased about the development but believe it could have been managed better.\n\nFood truck vendors say they are seeing less customers at Gantheaume Point. (ABC Kimberley: Dunja Karagic)\n\nBeach-goers frustrated\n\nA community petition calling for a temporary access ramp to the northern stretch of the beach is circulating online and has garnered more than 1,000 signatures.\n\nDan Healy, who signed the petition, said he was \"very excited\" about the development but not being able to drive onto the beach had impacted his family's lifestyle.\n\nTraffic around the Cable Beach has been backed up since one of the main car parks was closed. (ABC Kimberley: Ruby Littler)\n\n\"I think it will be great once it's finished,\" he said.\n\n\"But I haven't really seen any justification as to why [vehicle access] was removed.\n\n\"It's part of the reason we live in Broome — for freedom of access to the amazing environment and all the beautiful beaches.\"\n\nVehicles are still permitted to access a stretch of sand on Gantheaume Beach further south, but this smaller space is already becoming overrun.\n\nThe Shire of Broome has extended vehicle access at Gantheaume Beach by an additional 500 metres, however some beach goers are frustrated by how busy it has become.\n\nNo pain, no gain\n\nShire of Broome deputy president Desiree Male said it was a no pain, no gain situation, and asked locals and tourists to be patient.\n\nDesiree Male says the wait will be worth it. (Mya Kordic: ABC Kimberley )\n\n\"There's always going to be disruptions when you have major infrastructure projects like these,\" she said.\n\n\"As a local born and bred here, I would access that beach with my dogs, so I'm going to miss it.\n\n\" The end result is going to be so worth it — just hang in there, we will reopen it as soon as it's practical to do so. \"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/paluma-residents-frustrated-tmr-mount-spec-road-permits/105381542",
    "title": "Restrictions frustrate residents reliant on flood-wrecked road",
    "publish_date": "Tue, 10 Jun 2025 01:47:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "There is growing frustration among residents of a rainforest community north of Townsville who are struggling with a permit system to return home each night.\n\nThe Mount Spec Road, leading to the townships of Paluma and Hidden Valley, was cut by landslips during record-breaking monsoon rain in February.\n\nAlternative routes increase travel times by more than two hours along roads mainly suitable for four-wheel drives.\n\nRecord-breaking rain caused more than 60 landslips at Mount Spec Road. (Supplied: Department of Transport and Main Roads)\n\nQueensland's Department of Transport and Main Roads (TMR) has not provided a timeline for fully reopening the road.\n\nIt last month introduced a permit system for full-time residents to access Mount Spec between 6am and 6pm.\n\n\"We assure the community that we are working as quickly and safely as possible to progress critical repairs,\" a spokesperson said.\n\nTraffic controllers monitor entrances and the road is shut and monitored by cameras outside permitted hours.\n\nTourism operators said the impact had been \"devastating\", with one business estimating more than $100,000 in lost bookings.\n\nCurfew 'difficult'\n\nRhett Harrison, who lives between Paluma and the Hidden Valley, said the permit system had been challenging.\n\n\"After you work an eight-hour day, by the time you travel into town, you really haven't got a lot of time to be able to live your life, get groceries and you have to pretty much hope there's not an accident on the way back to the range road,\" he said.\n\nRhett Harrison says he homeschooled his son while the road was closed. (Supplied: Rhett Harrison)\n\nMr Harrison worked from home and homeschooled his son while Mount Spec Road was closed, and relocated to his sister's house in Townsville to reduce travel times.\n\n\"We would come back in and stay at her place for the entire week, all in one bedroom,\" he said.\n\n\"Pretty much so that we could go to work, so that he could have some level of normalcy of being able to return to school.\"\n\nHe said he wanted access hours to Mount Spec Road reviewed.\n\n\"I actually think that road is safer to drive at night because if there are any vehicles oncoming I can see them because of the headlights,\" he said.\n\nFrustrations growing\n\nPaluma and District Community Association president Jamie Oliver said part-time residents were being denied access to their homes and the community was growing frustrated.\n\n\"For those people who work in town and finish by around 5:30pm, it's very difficult to get to the start of the road by six,\" he said.\n\n\"It's still extremely inconvenient even for those permit holders to get up.\"\n\nJamie Oliver says the permit system is frustrating residents. (Supplied: Jamie Oliver)\n\nMr Oliver said residents wanted TMR to release geotechnical expert assessments so they could understand the key data and logic behind the department's decisions.\n\n\"Repeatedly we get nothing but vague information that is contained in the road reports,\" he said.\n\n\"It really is infuriating and insulting to be held in this kind of disregard.\"\n\nA TMR spokesperson acknowledged the residents' frustration and said public safety had remained a top priority throughout the planning process.\n\nThe spokesperson said the department would continue to update the community.\n\n\"Engineering reports are complex technical documents and uncontrolled distribution can lead to misinterpretation and misinformation,\" they said.\n\nThe authority said it was complying with conditions outlined by geotechnical experts, which included limiting the number of vehicles travelling on the road to reduce the risk of further landslips.\n\nThey said the 6am-to-6pm timeframe provided drivers with the \"best opportunity\" to react to oncoming hazards.\n\n\"TMR anticipates changes may be made to the conditions once restoration works occur and the risk of the slope sites reduces,\" they said.\n\n\"Traffic data is being monitored and if volumes remain within safe limits, TMR would be able to issue further permits to other residents within the area, including those who reside there part-time.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/what-do-the-socceroos-need-to-qualify-for-2026-fifa-world-cup/105387428",
    "title": "What the Socceroos need to qualify for the World Cup",
    "publish_date": "Tue, 10 Jun 2025 01:44:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Socceroos are so close they can almost taste it.\n\nAutomatic qualification for the 2026 FIFA World Cup is just 90 minutes away following the Socceroos' dramatic 1-0 victory over Japan in Perth.\n\nHowever, the Socceroos first face the task of Saudi Arabia on Wednesday morning before they can book their spot on the plane.\n\nSaudi Arabia is still in with a chance of upsetting Australia's hopes and stealing the final automatic qualification spot.\n\nHere's what needs to happen for Australia to progress to their sixth-straight World Cup finals.\n\nAustralia qualifies with a win or a draw\n\nMitch Duke could be called upon to help the Socceroos against Saudi Arabia. (Getty Images: Graham Denholm)\n\nSimply put, a draw or a victory over Saudi Arabia in Jeddah will confirm the Socceroos' spot on the plane to North America.\n\nThe Green Eagles, in third spot, are three competition points behind second-placed Australia in Group C of this phase of qualifying.\n\nWith two teams from each of the three six-team groups progressing to North America next year, the Socceroos only have to equal Saudi Arabia to join group winners Japan at the showpiece 32-team tournament.\n\nWhat if Saudi Arabia wins?\n\nThe Socceroos can still progress even if Saudi Arabia wins.\n\nDue to the Socceroos' far superior goal difference, Saudi Arabia will need to win by a whopping five clear goals to leap-frog Australia to second spot.\n\nSaudi Arabia has not beaten a team by this margin since they beat Palestine 5-0 in March 2021 and have not scored more than that since a 7-2 victory over Cambodia in January 2017.\n\nSaudi Arabia has scored just six goals in this phase of qualifying, with only Bahrain (5) scoring fewer across all the teams in Asia in this phase of qualifying.\n\nWhat happens if Australia doesn't finish in the top two?\n\nThe Socceroos will hope everything goes smoothly in Jeddah. (Getty Images: Matt King)\n\nThings get mighty complicated if Australia can't hang on to second spot in the group.\n\nSocceroos win never needed to be pretty Photo shows Aziz Behich is congratulated by teammates Nobody will confuse the Socceroos' victory over Japan as anything other than the most desperate of smash-and-grab victories. But in the end, does that even matter?\n\nThe Socceroos cannot finish any lower than third or fourth, which will put them in the fourth phase of qualifying.\n\nThat means the Socceroos would be placed into a round-robin tournament in October, played at a centralised venue within the Asian Football Confederation (AFC) and featuring the other third- and fourth-placed teams from across the AFC in two groups of three.\n\nThat is likely to be the UAE and Qatar from Group A; and Oman, Iraq or Palestine from Group B — although those groups are still in flux.\n\nThe two group winners from each three-team group will progress to the 2026 World Cup.\n\nIf the Socceroos finish second in that group, there is still another chance to qualify through the intercontinental play-offs, but first they'd have to beat the other second-placed finisher from the other group in another two-legged match.\n\nThen they'd need to finish in the top two of a six-team inter-confederation play-off tournament in the USA.\n\nWhat happened last time these two teams met?\n\nThe Saudis were furious after having a late goal chalked off for offside. (Getty Images: Graham Denholm)\n\nLast time around the Socceroos drew 0-0 with Saudi Arabia in Melbourne all the way back in November.\n\nIncredibly, the Saudis had a last-gasp winner (correctly) ruled out for a narrow offside decision.\n\nWhen is kick-off?\n\nSaudi Arabia vs the Socceroos kicks off at 4:15am (AEST) on Wednesday morning in New South Wales, Queensland, the ACT, Victoria and Tasmania.\n\nThat's 2:15am in Western Australia and 3:45am in South Australia and the Northern Territory.\n\nHow can I watch the Socceroos match?\n\nThis game is exclusive to Paramount+.\n\nHowever, you can follow all the action as it unfolds in the ABC Sport live blog.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/munster-the-man-to-lead-maroons-in-origin-ii/105398192",
    "title": "Cameron Munster the man to lead Maroons in Origin II",
    "publish_date": "Tue, 10 Jun 2025 01:13:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "Cameron Munster will celebrate his 20th State of Origin match as the new captain of Queensland.\n\nCameron Munster Age: 30\n\nMaroons debut: 2017\n\nQueensland Maroons: (2017-: 19 games, 3 tries, 12 points)\n\nState of Origin series wins: 2017, 2020, 2022, 2023\n\nNamed Queensland skipper, game II 2025\n\nThe 30-year-old Melbourne playmaker has edged out fellow Storm teammate Harry Grant and Gold Coast prop and captain Tino Fa'asuamaleaui for the role.\n\nHe replaces former skipper Daly Cherry-Evans, who was axed after the 18-6 loss in game one of this year's series.\n\nMunster will take charge for game two in Perth next Wednesday night as the Maroons aim to square the ledger.\n\nThe new skipper has scored three tries in his 19 Origin outings so far, and he would no doubt love to add to the tally as the Queenslanders seek to keep the series alive in the west.\n\nMunster is a proven leader and is in the Storm leadership group.\n\nAccording to the Maroons, Slater informed the playing group of the appointment following a training session at Twin Waters this morning.\n\nSlater has also confirmed Canterbury Bulldogs forward Kurt Mann will make his Origin debut in Perth.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/aaron-cadman-key-forwards-time-to-develop/105375156",
    "title": "Why this top AFL selection feels for his fellow number one draftees",
    "publish_date": "Tue, 10 Jun 2025 00:58:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "The one thing Aaron Cadman didn't realise he would need in abundance when he arrived at GWS was patience.\n\nAt 17, he was a winger drafted in the prized number one spot to become a key forward, and by his own admission, \"weighed nothing\" and \"was just skin and bone running on the wing\".\n\n\"There's always a couple of man-childs getting around who dominate early … Obviously, I've got a bit of a thinner frame. I had to spend years in an elite environment for my body to develop the way that it needs to,\" Cadman told ABC Sport.\n\n\"Then there's also the craft stuff that's different to say a midfielder or small forward … It's much harder to shift someone who's 110 kilos than 70 kilos.\"\n\nAll that made one of the toughest components for him coming into the system his own impatience.\n\n\"I didn't want to wait for anything,\" Cadman said.\n\n\"And then also the pressure with being number one. You want to play straight away and showcase what you got and show people why you've been drafted at number one. So, it was really tough.\"\n\n'I should be dominating now'\n\nNow 21 and in his third year, Cadman feels that a good game for him might not be kicking multiple goals but rather bringing the ball to ground enough to get others involved.\n\nThis year, he has already had more goal assists than last season and he is on track to beat his goal tally.\n\nAaron Cadman said a good game in his first two years was just bringing the ball to ground for others to get involved. (Getty: Michael Willson/AFL Photos)\n\n\"I've slowly reined in my emotions and really developed in that area, developed a lot of patience,\" he said.\n\nBut there are still days he thinks, \"I should be dominating now\".\n\nIn these moments — and wanting to be a premier goal scorer of the competition — he thinks of the likes of Carlton's Charlie Curnow.\n\nAaron Cadman has started to take more marks in his third year. (Getty: Darrian Traynor)\n\nCurnow debuted in 2016 after being taken by Carlton at pick 12. Six years later he became a two-time Coleman medallist and All-Australian (2022, 2023) after an injury-riddled start to his career.\n\nSimilarly, former Geelong star Tom Hawkins debuted in 2007 yet didn't start his five-time All Australian run until 2012. He is now ranked 13th highest in the history of the league for goalkicking.\n\nAmong some Cats fans, there was an impatience for him to develop quicker in his early years.\n\n\"Sometimes it takes you six years. So, it takes time — but I hate waiting,\" Cadman said.\n\n\"I guess it is a good mindset to have, in a way, but sometimes it does kill me\"\n\n'Not a one-man show'\n\nCadman has also been afforded time to develop in Sydney away from the limelight and in a side that is not dwelling down the bottom of the ladder.\n\nWhile number one draft picks often find themselves in struggling or rebuilding sides — such as Harley Reid at West Coast, Jason Horne-Francis while at North Melbourne and Sam Lalor at Richmond — the Giants made a preliminary final in 2023, the year Cadman debuted.\n\nHarley Reid has had a lot of external pressure as the number one pick at the Eagles. (Getty: Paul Kane)\n\n\"People think that just because they come in, they can swing everything around, but it's not a one-man show,\" Cadman said.\n\n\"I feel for those guys and the pressure that's put on them. They seem to be dealing with it. Everyone deals with it in different ways but they seem to be striving and playing some really good footy.\n\n\"But you can't expect someone in their first — you could almost say first three years — to be the best player on the team. It takes a lot of time.\n\n\"There's always going to be outliers with [Nick] Daicos and [Harry] Sheezel. They're unbelievable players. But people need to develop an elite environment and just have time in the system and to educate and hone in their skills.\"\n\nLoading...\n\nCadman is also in a forward line with the reigning Coleman medalist Jesse Hogan and 2023 All Australian captain Toby Greene, which helps things.\n\n\"Even if I compare me and [Nate Caddy] a little bit … but you can't even really compare us because he's basically been handed the reins to the whole forward line himself,\" Cadman said of the 19-year-old Bomber who coach Brad Scott hailed as a \"point of difference\" for the club after just three games.\n\n\"He's getting basically the number one defender every week, and sometimes he's got limited help. So he's flying for balls with three other people on him. He's doing it tough, but hats off to him, and he's going to be a superstar.\"\n\nGWS star completely deaf in one ear Photo shows Tom Green looks on during a GWS game Tom Green's teammates will tell you he's a hard player to get off the field. His excuse? He's completely deaf in one ear.\n\nCadman added that for key forwards, it's not always about what happens on the stat sheet, where a good game for him in his first two years was just bringing the ball to the front.\n\n\"That's all it was. [And] it's all these things, all these patterns that key forwards will run that set others up. It's the same with every other position,\" he said.\n\n\"And first-year players, I think there's way too much pressure being put on them … I'm just super grateful that I'm here in Sydney, where a bit of the limelight is off and just allows me to focus on what I need to focus on.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/far-north-queensland-residents-push-for-second-cardiologist/105395282",
    "title": "Cairns's only paediatric cardiologist under 'intense pressure'",
    "publish_date": "Tue, 10 Jun 2025 00:41:11 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Medical advocacy groups and a national charity are backing a call from parents for a second paediatric cardiologist to be appointed in Queensland's vast far north.\n\nSome patients are waiting almost a year to see a paediatric cardiologist in the region, where the rate of rheumatic heart disease in children under 14 is about 30 times higher than the state average.\n\nDoctors' groups say the far north's sole paediatric cardiologist, Ben Reeves, is under \"intense pressure and stress\" to provide care to children across a region that stretches more than 1,000 kilometres to Cape York and the Torres Strait.\n\nPaediatric cardiologist needed Photo shows A mum holding her two young sons Children in Far North Queensland are waiting months for check-ups with the region's only paediatric cardiologist.\n\nHeartKids chief executive Marcus Sandmann said his organisation was supporting hundreds of families in north Queensland, many of whom were travelling more than 200km for an appointment.\n\n\"We've had some families that we've worked very closely with over the years that have had to relocate to Brisbane just based on the need to have better levels of care for their child,\" he said.\n\n\"That's obviously quite daunting and confronting for families to have to do that.\"\n\nCairns and Hinterland Hospital and Health Service chief executive Leena Singh said the far north needed an additional paediatric cardiologist to meet demand.\n\nThe hospital service has been developing a business case to secure the funding needed to bolster its paediatric cardiology care with an extra specialist and more allied health workers and nurses.\n\n\"I believe the paediatric cardiologist, as a sole practitioner there, must be under intense pressure and stress,\" Queensland paediatrician Nitin Kapur said.\n\nLoading...\n\nProfessor Kapur, who until recently was president of the Royal Australasian College of Physicians' (RACP) paediatric and child health division, said many children had chronic care needs.\n\nHe said long wait times led to poorer health outcomes, particularly as GP care was also increasingly hard to access.\n\n\"A single paediatric consultant in a city of Cairns's [size] I can't believe can ever do justice to such a huge requirement,\" he said.\n\n'More incentives needed'\n\nThe lack of adequate paediatric cardiology services in Cairns, one of the largest centres in northern Australia, has led to calls for more incentives to lure specialists to the regions.\n\nProfessor Kapur said more accommodation support, childcare, and the ability to work part-time could help address the situation, as well as a streamlined pathway for overseas doctors to take up positions.\n\n\"A lot of our paediatric workforce nowadays is female … and it's difficult for part-time work,\" he said.\n\n\" If positions are created where it's flexible to work, I have no doubt many doctors will be willing to move to a beautiful city like Cairns. \"\n\nQueensland Children's Hospital in Brisbane supports regional paediatric cardiology services. (ABC News: Chris Gillette)\n\nProfessor Kapur said the RACP's advanced paediatric training was the only college pathway that mandated time in a regional area.\n\nHe said the college would accredit any funded training positions in regional hospitals but a decision to employ a full-time consultant specialist was entirely up to each individual public hospital service.\n\nThe Australian Medical Association Queensland (AMAQ) branch has also called for more state government investment in attraction and retention incentives.\n\nNick Yim says Queensland needs to offer more incentives to attract and keep specialists. (Supplied: AMA Queensland)\n\nAMAQ president Nick Yim said a workforce plan was needed to identify which regions had specialist shortages, and where the health system was losing professionals.\n\n\"We know that burnout unfortunately leads to doctors leaving the profession, so we do need to ensure they have sustainable workloads,\" Dr Yim said.\n\nProfessor Kapur said paediatricians \"have let ourselves down in not strongly advocating for more support as well\".\n\n\"Probably the government doesn't see this as a priority because outpatient-based, subspecialty medicine-based medicine doesn't grab attention,\" he said.\n\n\" Whereas oncology services, surgical waiting times, ED ramping — they are always grabbing [media] attention. \"\n\nSome Far North Queensland communities are 1,000 kilometres from Cairns Hospital. (ABC News: Brendan Mounter)\n\nAttracting workers\n\nProfessor Kapur said two new consultant paediatric cardiology positions had been created in Townsville in recent months.\n\nIn February, the Queensland government scrapped the Workforce Attraction Incentive Scheme, which offered health workers up to $70,000 to take critical roles in regional areas.\n\nIn a statement, a spokeswoman for Health and Ambulance Minister Tim Nicholls said the government was committed to delivering 34,200 extra clinicians by 2032, labelling the former government's scheme as \"ineffective\".\n\n\"The Crisafulli government is undertaking significant local, national and international recruitment activities to attract key medical professionals to help address short, medium and long-term workforce needs across the hospital and health system,\" she said.\n\n\"Our hospital rescue plan is investing in health infrastructure across the state, including building new staff accommodation which will go a long way in attracting skilled workers to the regions that need it most.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/monash-ivf-incorrect-embryo-transfer-clayton-asx-announceme/105397894",
    "title": "Fertility group incorrectly transfers wrong embryo for second time",
    "publish_date": "Tue, 10 Jun 2025 00:33:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "A major fertility group has incorrectly transferred the wrong embryo to a patient — the second incident the company has apologised for in recent months.\n\nIn an announcement to the ASX on Tuesday morning, Monash IVF said the incident happened on June 5 at its laboratory in Clayton, Melbourne.\n\n\"The patient's own embryo was incorrectly transferred to that patient, contrary to the treatment plan which designated the transfer of an embryo of the patient's partner,\" the announcement said.\n\n\"Monash IVF has extended its sincere apologies to the affected couple, and we continue to support them.\"\n\nIt comes two months after the company revealed a Brisbane patient was mistakenly implanted with another patient's embryo.\n\nMonash IVF mix-up could spark legal battle over child's parentage Photo shows A medical image from the IVF process. Monash IVF realised the mistake in February, after the birth parents asked to transfer their remaining frozen embryos to another provider.\n\nThe patient gave birth to a baby who had no genetic link to her later that year, which the ABC understands happened in 2023.\n\nQueensland Health visited every Monash IVF clinic in the state to check policies and procedures after learning of the Brisbane embryo bungle.\n\nMonash IVF only discovered that mix-up in February this year after the birth parents asked to transfer their remaining embryos to another provider.\n\nIn the statement today, Monash IVF said it was conducting an internal investigation into the latest incident and has also extended the scope of the independent review into the Brisbane incident, \"noting that the different incidents occurred some years apart\".\n\nThe company also said it would immediately implement \"additional verification processes and patient confirmation safeguards over and above normal practice and electronic witness systems to ensure patients and clinicians have every confidence in its processes\".\n\nIn its ASX statement, the company said while industry leading electronic witness systems were being rolled out across Monash IVF, there \"remains instances and circumstances whereby manual witnessing is required\".\n\nThe company says the incident occurred at its Clayton facility. (DrKontogianniIVF via pixabay)\n\nMonash IVF said it had disclosed the incident to the Reproductive Technology Accreditation Committee's certifying body and the Victorian Health Regulator.\n\nThe company said it had also notified its insurers and expected the incident to \"fall within the scope of its insurance coverage\".\n\nMonash IVF's share price dropped from $1.08 to a low of 69 cents after the Brisbane bungle was made public in April.\n\nAt 10am today the share price was 74 cents.\n\nThe latest incident is expected to lead to louder calls for nationally consistent laws regulating the lucrative assisted reproductive technology (ART) industry in Australia.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/ian-macgregor-kings-birthday-honours-toodyay/105377710",
    "title": "West Australian fire volunteer's decades of service honoured",
    "publish_date": "Mon, 09 Jun 2025 23:00:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "More than three decades of dedicated service has seen a volunteer fire and rescue captain — who has responded to some of Western Australia's most traumatic road incidents — recognised with national honours.\n\nToodyay Volunteer Fire and Rescue Service (VFRS) captain Ian MacGregor has been awarded an Australian Fire Service Medal for his contribution to the Wheatbelt region as a volunteer firefighter over the past three decades.\n\nMacca, as he is affectionately known locally, is the fourth member of the brigade in Toodyay, about 90 kilometres north-east of Perth, to receive the honour.\n\nIan MacGregory puts out flames at Toodyay District High School in May 1993. (Supplied: Ian MacGregor)\n\nMr MacGregor got his first taste of fighting fires shortly after moving to Toodyay in 1980, battling a fire near the Avon River on Christmas Day.\n\nHe officially joined the Toodyay VFRS in 1993 and has been the captain for more than two decades.\n\n\"In those days you just got on the truck and put the fire out,\" he said.\n\n\"I can help save one house or get someone out of a car and get them to hospital and help someone that's worse off than me.\"\n\nUnder Mr MacGregor's leadership, the brigade has more than doubled in size and boasts one of the highest female-to-male ratios in the state.\n\nLoading...\n\nCompassion for victims\n\nMr MacGregor said looking after his team always came first, particularly during challenging and traumatic incidents.\n\n\"I preach this to all our crews — we didn't put them there,\" he said.\n\n\" We're there to help them get out of the situation that they've unfortunately found themselves in. \"\n\nIan MacGregor has been a leader in Toodyay's brigade for more than three decades. (Supplied: Toodyay Visitor Centre)\n\nMr MacGregor has been pivotal in improving the access to support services for witnesses to traumatic events.\n\n\"We unfortunately had a fatal accident out on Goomalling Road a few years ago and I was sitting in the fire truck when I noticed some people on the side of the road reeling from what they had seen,\" he said.\n\n\"I watched them and thought, 'What happens to them?'\n\n\"We, as firefighters, have counselling and peer support but they have nothing.\"\n\nAs a result, Mr MacGregor worked with the Volunteer Fire & Rescue Services Association of WA to ensure that adequate support resources were given to anyone involved in or witnessing a traumatic incident.\n\nFamily his proudest achievement\n\nThroughout his decades of volunteering, Mr MacGregor has often seen tragedy touch his local community, including his own family.\n\nEighteen years ago, his eldest son Shane suffered a serious brain injury in a motorcycle accident.\n\nFather and son Ian and Shane MacGregor celebrate milestone achievements. (ABC Midwest and Wheatbelt: Eliza Bidstrup)\n\n\"For 18 days while Shane was on life support we were told by staff at Royal Perth Hospital to not get our hopes up and that he was going to die,\" Mr MacGregor said.\n\nAfter nine months of rehabilitation, Shane was released from hospital and brought back home to Toodyay where he has been embraced ever since.\n\nThis month Shane celebrated 25 years of volunteer service with the Toodyay VFRS, working alongside his dad.\n\nShane MacGregor was awarded a 25-year service medal for his dedication to the Toodyay VFRC. (ABC Midwest and Wheatbelt: Eliza Bidstrup)\n\n\"Shane is always the first to put his hand up to turn out to an incident and sets the example to others to never give up,\" he said.\n\n\"He brings a lot of fun and humour to the brigade, as well as at the local tennis and hockey clubs where everyone loves him.\"\n\nMr MacGregor's youngest son Darren has followed a similar path, working as a career firefighter in Perth.\n\nDarren, Shane and Ian MacGregor share a passion for helping those in need. (Supplied: Ian MacGregor)\n\nMr MacGregor said countless mentors and mates over his decades of involvement in VFRS made him the firefighter he was today.\n\n\"It's very humbling to have my name alongside three other wonderful leaders from this brigade who have made a difference in Toodyay,\" he said.\n\n\"I've had a lot of good people come before me to get me to where I am.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/south-australia-drought-sets-low-rainfall-records-farming-areas/105376286",
    "title": "Worry as SA drought smashes low-rainfall records in farming areas",
    "publish_date": "Mon, 09 Jun 2025 22:34:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "All of South Australia's agricultural areas are in a severe drought, with many locations receiving record-low rainfall over the past 12 months.\n\nThe Mid North and the upper Eyre Peninsula have had the least rainfall and the majority of the record lows, although no place in the southern part of the state is unaffected, according to data from the Bureau of Meteorology.\n\nWhile farmers were able to harvest a good crop in 2024–25 because of sub-soil moisture from previous wet years, the dry weather in autumn has meant either delaying seeding or going ahead despite the dry weather.\n\nLocation Mean rainfall Record yearly low Rainfall June 2024—May 2025 Ceduna 292mm 133mm 131mm Clare 534mm 288mm 284mm Minnipa 285mm 191mm 185mm Pallamana 309mm 184mm 160mm Port Pirie 302mm 188mm 171mm Snowtown 367mm 243mm 209mm Whyalla 263mm 139mm 126mm\n\nMany parts of southern South Australia received good rain over the weekend, with the highest concentrations in the Adelaide Hills and the South East, but farmers say more will be needed to break the drought.\n\nPlanning goes awry\n\nThe Mid North town of Snowtown received a record-low amount of rain in 2024, and from June 2024 to May 2025 the figure was even lower at 209 millimetres.\n\nRain 'celebration' for farmers facing drought Photo shows A close up shot of a man's hand holding a rain gauge showing almost 24mm of rain Much-needed rain has soaked parched land across parts of South Australia but farmers say more is required to break the drought.\n\nOnly 26mm has been recorded at the town's weather station since the start of the year.\n\nSnowtown sheep and mixed cropping farmer Andrew Michael has seeded in the hope of rain coming.\n\n\"We have no sub-soil moisture left, which has got us through now for the last two-and-a-half [years] prior to this … but the loss if we don't get a grain year will be a massive impact,\" he said.\n\nHis family also owns properties in Meningie and Willalooka, in the South East, which have also recorded extremely low rainfall.\n\nAndrew Michael's farm at Snowtown is the driest it has ever been. (Supplied: Alistair Michael)\n\n\"It makes it really difficult when you set up your best business plan to have a farm in different areas and a season like this brings it undone,\" Mr Michael said.\n\nPart of long-term trend\n\nBureau of Meteorology senior climatologist Jonathan Pollock said South Australia's drought was not particularly long-lasting or widespread like the 1997–2009 millennium drought, but it was quite deep.\n\nRainfall deficiency in South Australia over the past 12 months. (Supplied: Bureau of Meteorology)\n\n\"It certainly is record-breaking in the sense that for a lot of the agricultural areas they have never seen a 16-month period from February to the following year's May with rainfall this low — and that's looking at data going all the way back to 1900,\" Mr Pollock said.\n\nHe said it was caused by the atmosphere above the state being dominated by slow-moving high-pressure systems rather than cooler systems that brought rain with them.\n\nRainfall deficiency in South Australia since the start of 2025. (Supplied: Bureau of Meteorology)\n\n\"Part of the reason why is we've seen a shift towards drier conditions across south-eastern Australia in recent decades and we're seeing more frequent periods of below-average rainfall and especially for the cool-season months from April through to October,\" he said.\n\n\"This is due to a combination of natural variability on longer timescales but also changes in the large-scale atmospheric circulation largely driven by an increase in greenhouse gas emissions.\"\n\nHope on the horizon — five reasons the drought will ease this year Photo shows Dry, cracked ground on a farm. There are multiple signs a boost in rainfall this winter and spring will alleviate the record drought currently crippling southern Australia.\n\nThe bureau's latest seasonal climate summary says the mean temperature across South Australia in autumn was 21.3 degrees Celsius, or 1.75C above the 1961–1990 average and the third warmest on record for all autumns since 1910.\n\nSuccess despite challenges\n\nBetter farming practices that make the most of sub-soil moisture led to a 5.2-million-tonne grain harvest in 2024–25.\n\nThat was 40 per cent below the five-year average but 80 per cent above what was reaped in 2006–07 — another drought year.\n\nDepartment of Primary Industries and Regions (PIRSA) general manager for industrial partnerships and intelligence Matthew Palmer said the productivity increase over the past 20 years was \"quite remarkable and a testament to producers and the research and development that supports the grains industry\".\n\n\"It's certainly been a very challenging season and it continues to be, but the result overall is quite remarkable compared with what would have happened in droughts in years gone by,\" he told the South Australian Country Hour.\n\nVic Smith visits the ABC every day it rains to report his measurement. (ABC South East SA: Eugene Boisvert)\n\nNinety-year-old Vic Smith has kept rainfall records in Nangwarry since 1985, when he moved to the town to work at the timber mill.\n\nHe recorded 102mm of rain until the end of May — similar to last year but about half the normal amount.\n\nHe said he was worried about the conditions of plantation forests.\n\n\"It's dangerously dry,\" Mr Smith said.\n\nMr Smith started calling into the ABC in 1999 to report his rainfall records while at the same time promoting the Nangwarry Forestry Museum where he volunteered until last year.\n\nHe has not given up his habit despite retiring.\n\n\"It's something you can look back on and compare year by year, which I do. And, if I hadn't have done that, I wouldn't have realised how much drier it was this year than other years,\" he said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/aussie-number-one-kasatkina-falls-at-first-hurdle-at-queens/105397436",
    "title": "Aussie number one Kasatkina falls at first hurdle at revived Queen's",
    "publish_date": "Mon, 09 Jun 2025 22:27:28 +0000",
    "category": "sports",
    "authors": [],
    "text": "Daria Kasatkina has suffered her worst defeat since switching to represent Australia in late March, beaten 6-1, 3-6, 6-3 by fast-rising Brit Sonay Kartal at the revived Queen's Club women's tournament.\n\nKasatkina was fresh off a promising run to the last 16 at Roland Garros last week and her weekend engagement to long-term partner Natalia Zabiiako, a former Olympic skater.\n\nQueen's Club Women's singles, first round Daria Kasatkina (AUS) lost to Sonay Kartal (GBR) 6-1, 3-6, 6-3\n\nMaddison Inglis (AUS) vs Karolína Muchová (CZE) 6-7 (7/5), 6-3 (Play suspended, bad light)\n\nBut her joy was soured, temporarily at least, as Kartal delighted the home crowd in the first women's tournament at Queen's in more than 50 years.\n\nIn the last final, in 1973, Evonne Goolagong (now Cawley) lost to Russia's Olga Morozova, who would go on to lose that year's Wimbledon final a few weeks later.\n\nThat was the fourth successive final featuring an Australian, Margaret Court having won in 1970 and 1971 and Karen Krantzcke losing to Chris Evert in 1972.\n\nAny hopes that Kasatkina would maintain the Aussie run 52 years on soon disappeared against Kartal, who has climbed from 271st in the world to 50th in a year.\n\nThis was the 23-year-old's best win of her career, world number 16 Kasatkina becoming her second top-20 victim after beating Beatriz Haddad Maia at Indian Wells.\n\nKasatkina wins at the French Open Photo shows GettyImages-2217978263 The recently recruited Daria Kasatkina beats Paula Badosa and ends a 37-year drought for Australia at the French Open.\n\nKasatkina briefly hinted at battling back when she rallied from 0-40 at 2-4 in the final set to force deuce, but on the newly christened Andy Murray Arena, Kartal held for 5-2 then served out at 5-3, her winning forehand leaving Kasatkina flat-footed.\n\nThe result left two Australians in the draw, Ajla Tomljanovic and Maddison Inglis.\n\nInglis drew number six seed Karolína Muchová and was last on court on Monday evening. She lost the first set on a tiebeak 7-6 (7/5) but battled back to take the second set 6-3. At that point, with darkness falling, play was suspended.\n\nAustralia's Maddison Inglis's match with Czechia's Karolína Muchová will be completed on day two at Queens Club. (AP: Joanna Chan)\n\nThe winner will meet German qualifier Tatjana Maria, who beat former US Open runner-up Leylah Fernandez 7-6 (7/4), 6-2.\n\nOn Tuesday Tomljanovic plays Alex de Minaur's fiancee Katie Boulter, who earlier teamed up with Emma Raducanu in a doubles pairing that had the British media swooning as they won their first-round match.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nIn the day's opening match Haddad Maia came from a set down to beat former Wimbledon champion Petra Kvitova 2-6, 6-4, 6-4.\n\nTwo-time Wimbledon winner Kvitova, 35, returned from a 17-month maternity break in February but has only won one match since.\n\nLast year's Wimbledon semi-finalist and Olympic runner-up Donna Vekic lost 6-3, 6-3 to Anastasia Zakharova, who set up a clash against American Madison Keys.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-06-10/blueberry-strawberry-fruit-prices-high-flood-supply-issues/105395280",
    "title": "Flooded growers ask for patience as blueberry prices near $10 a punnet",
    "publish_date": "Mon, 09 Jun 2025 22:19:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Eye-watering blueberry prices could stay higher for longer this year due to seasonal shortages and crop damage caused by last month's torrential rain in northern New South Wales.\n\nThe family favourite has been priced as high as $9.80 per 125-gram punnet in supermarkets in the past week, equating to $78.40 per kilogram.\n\nThat compares to a low of less than $2.50 for a 125-gram punnet in most capital city retailers last October and a high of $19.99 a punnet at Fitzroy Crossing in Western Australia in June 2024.\n\nBerries Australia executive director Rachel Mackenzie said consumers could expect prices to ease as winter production increased in the next couple of weeks.\n\nRachel Mackenzie says berry prices will drop as supply increases. (ABC Rural: Jennifer Nichols)\n\nHowever, torrential rain in northern NSW last month could have longer-term impacts, as most of Australia's blueberries are grown in the Coffs Harbour region.\n\n\"Some growers have been completely flooded; others have had infrastructure damage and another problem is pest and disease increases after a big rain event like that,\" Ms Mackenzie said.\n\nThe Australian Horticulture Statistics handbook valued blueberry production at $505.1 million in Australia last financial year, with 27,540 tonnes produced.\n\nCoffs Harbour diversified from bananas into blueberries, tomatoes and cucumbers. (Supplied: Phillip Wilk)\n\nBlueberries are also grown in Queensland, Victoria, WA and South Australia to ensure year-round supply.\n\n\"At the moment any Australian fruit you see will probably be coming mostly from Far North Queensland, on the Atherton Tableland,\" Ms Mackenzie said.\n\nBlueberries are expensive because of flooding and seasonal variations. (ABC Rural: Jennifer Nichols)\n\nImport, export markets\n\nAustralia has traditionally imported 700–1,700 tonnes of fresh blueberries a year, mostly from New Zealand.\n\nMs Mackenzie said that despite Australia's higher production costs, the industry was focused on growing exports, competing with countries like Peru.\n\n\"We're hopeful that we'll be able to have access to Vietnam relatively soon,\" she said.\n\n\"China is a bit more of a long game but we are the current negotiating priority so that certainly means that we're in the mix.\"\n\nAustralian growers are looking to export blueberries. (ABC Rural: Eliza Rogers)\n\nMs Mackenzie said a recent Chinese delegation visited Australian blueberry farms looking to fill a gap in their home-grown supply, aligning with peak production in Australia.\n\n\"They actually do grow a lot of blueberries in China and interestingly, a lot of the genetics they grow are Australian genetics,\" she said.\n\n\"Despite being quite a small production country for blueberries, we're actually a real powerhouse in terms of genetics.\n\n\" We have the benefit of quality, proximity and obviously our fantastic record on food safety and sustainable practices. \"\n\nStrawberries also pricey\n\nWet weather and seasonal shortages have also impacted strawberry prices, with a 250-gram punnet retailing for $5.50 in some supermarkets.\n\nStrawberry prices will drop as Queensland's seasonal supply increases. (ABC Rural: Jennifer Nichols)\n\nQueensland Strawberry Growers Association president Adrian Schultz said the state supplied most of Australia during winter and spring.\n\nApart from some recent sunshine, farmers have battled months of rain since planting began in March, meaning lower volumes of fruit on the market.\n\nMr Schultz said a move towards hydroponic production on tabletops, using more mature plants that fruit earlier in the season, was good news for consumers.\n\nHydroponic tabletop production avoids soil-borne diseases. (ABC Rural: Jennifer Nichols)\n\nHe appealed for patience with prices until supply increased, explaining that growers had already outlaid hundreds of thousands of dollars in the past six months.\n\n\"We try and recoup all of our production costs and then later in the season is where we hope to make a profit,\" Mr Schultz said.\n\nAdrian Schultz says the strawberry supply will soon increase. (ABC Rural: Jennifer Nichols)\n\nFigures from the Australian Horticulture Statistics Handbook 2023/24 show Australian growers produced 80,741 tonnes of strawberries worth $505.5 million.\n\nMr Schultz said the industry was consolidating, with the association's membership about half what it was 20 years ago.\n\nDeep red, perfectly proportioned red rhapsody strawberries were bred in Australia. (ABC Rural: Jennifer Nichols)\n\n\"That's basically because small family farms have gone by the wayside and the larger corporate entities have continued to expand,\" he said.\n\nWhile the number of growers may be shrinking, he said production remained steady, and strawberries were popular with consumers.\n\n\"They've got a lot of vitamins and folate, nearly as much vitamin C as a Valencia orange,\" Mr Schultz said.\n\nTasty new varieties\n\nAustralian strawberry breeding program head Jodi Neal said it took six to seven years from cross-pollination to commercial release to develop varieties suited to subtropical production in south-east Queensland and Bundaberg, temperate areas in the southern states and Stanthorpe and Perth's Mediterranean conditions.\n\nJodi Neal leads Australia's research and development of new strawberry varieties. (ABC Rural: Jennifer Nichols)\n\nShe said it took several more years for nurseries to multiply enough plants for farmers to adopt new releases, including the Stella variety.\n\nThe strawberry named in honour of the late disability activist and comedian Stella Young is being grown commercially this year.\n\nThe late Stella Young and the strawberry named in her honour. (Supplied: James Penlidis, Queensland Department of Agriculture and Fisheries)\n\n\"It's potentially a more profitable strawberry variety,\" Dr Neal said.\n\n\"It has larger fruit which means that the cost of production is a lot lower for our farmers, so they can continue making a profit.\"\n\nDr Neal said developing tasty, disease-resistant, productive varieties was satisfying.\n\nThe new white strawberry variety's skin blushes pink in the sun. (Supplied: Jodi Neal)\n\n\"Getting farmers talking to us and telling us how much that variety helped them this season — having consumers coming to us, saying, the fruit this winter is tasting fantastic, that's what drives me.\"\n\nNew white and pink strawberry varieties will become commercially available to growers next year.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/act-cooking-class-mens-kitchen-changing-lives-of-older-men/105371792",
    "title": "'I was the apprentice': Dennis is learning to cook after his wife's death",
    "publish_date": "Mon, 09 Jun 2025 22:17:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "In a bustling community kitchen in Canberra's south, the sounds of chopping, sizzling and dad jokes fill the air.\n\nIt's lunchtime at the Men's Kitchen — a grassroots program teaching men over 60 how to cook.\n\nFor many of the men here, cooking is a brand new skill.\n\nSome are recently widowed or caring for partners who can no longer cook, others are simply looking for connection in retirement.\n\n'Meals don't just magically arrive on the table'\n\nMen's Kitchen participant John Seymour says after his wife fell ill he realised he didn't know much about cooking. (ABC News: Sarah Grieb)\n\nJohn Seymour's reason for signing up is a deeply personal one.\n\nAfter his wife fell ill, he found himself taking on the role of head chef for the first time in his life — but was unsure where to begin.\n\n\"I realised I didn't know very much about cooking, and I needed to learn,\" Mr Seymour said.\n\n\"I think a lot of men, including me, have realised that the time has come to do more around the house.\n\n\"Meals don't just magically arrive on the table. You have to learn, and I've learned a great deal.\"\n\nMr Seymour said he now understands how to shop for ingredients, follow a recipe and even whip up a Moroccan chicken dish.\n\n\"Recipes are rated by how difficult they are — one, two or three hats,\" he said.\n\n\"I'm still at the one-hat stage, but I've progressed.\"\n\nDennis Granlund says he joined the class to get new ideas for healthy eating and make new friendships. (ABC News: Sarah Grieb)\n\nFor newcomer Dennis Granlund, the class comes 15 months after the death of his wife.\n\n\"She was the chief chef, I was the apprentice,\" Mr Granlund said.\n\n\" She left behind a large binder of recipes and now I'm looking after everything myself, including all of the cooking. \"\n\nMr Granlund said he joined the Men's Kitchen to build new skills, get new ideas for healthy eating and hopefully make new friendships.\n\nJohn Seymour said the group is always excited to get new members like Mr Granlund.\n\n\"It's a very friendly group,\" Mr Seymour said.\n\n\"All of us are at the same stage in life and we support each other. It's a very sociable occasion.\"\n\nA recipe for connection\n\nInstructor Sonja Berghuis says volunteering with Men's Kitchen is good for her wellbeing as well as being a way to give back. (ABC News: Sarah Grieb)\n\nThe sessions are run by volunteer instructors like Sonja Berghuis, who has spent more than 30 years as a home economics teacher helping her students learn to cook.\n\n\"I thought this was something where I could give back to the community and use the skills that I have to help other people,\" Ms Berghuis said.\n\n\" It's also good for my own wellbeing. \"\n\nEach class involves a full recipe walk-through, with men taking turns to shop for ingredients, prepare, bake and cook — all while swapping stories and sharing a laugh.\n\nMs Berghuis said even learning the most basic skills can make a huge difference.\n\nInstructor Sonja Berghuis (left) says Men's Kitchen participants are often surprised by how much they learn. (ABC News: Sarah Grieb)\n\n\"I was quite surprised when I came my first week, some of the gentlemen didn't realise you needed to wash the vegetables,\" Ms Berghuis said.\n\n\"They also ask some great questions. They're surprised by how much they're learning — and they take it seriously.\n\n\"We'll decide today what we're going to cook next time and some of the men will go home and practice the recipe, so they know what to do next time. I think it's really lovely.\"\n\nThe program was brought to Canberra by Don White, who said he saw a growing need for social connection among older men — especially after retirement or losing a spouse.\n\n\"A lot of men have lost their work networks or are living alone, so this gives them an opportunity to get together with others,\" Mr White said.\n\n\"They look forward to coming, they love being together and talking to each other.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/eyre-peninsula-whale-tourism-threatened-by-dew-proposal-nursery/105392768",
    "title": "Proposal to keep whale-watching vessels further back concerns operators",
    "publish_date": "Mon, 09 Jun 2025 21:30:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "The owner of a whale-tourism business says the proposed creation of new whale nursery protection areas could bankrupt his Eyre Peninsula company.\n\nIn addition to the established protection zone in Encounter Bay, new protection areas could be formed in Fowlers Bay and Sleaford Bay.\n\nSouth Australia's Department for Environment and Water (DEW) said the areas were independently identified as important for the recovery of the southern right whale.\n\nViewing vessels would need to stay at least 300 metres from whales under the proposal, an increase of 200m on restrictions already in place.\n\nThe Sleaford Bay area attracts southern right whales and their calves every winter. (Supplied: Fran Solly/ Take2Photography)\n\nWhale tourism operator Rod Keogh, who has run EP Cruises for 17 years at Fowlers Bay, on the far west coast, said the changes would have a serious impact on his operation.\n\n\"The guidelines that have been written by these researchers are stating that due to the lower numbers of southern right whales, they're saying they're not coming back as what they expected,\" Mr Keogh said.\n\nWhile the distance requirement was 300m for a calf, Mr Keogh said he had been operating under an exemption for more than 12 years.\n\nMr Keogh said his operation had no detrimental effect on whales in the area.\n\nHe said there was one whale in the bay per year when he started the tours in 2008, compared to a record of 67 whales in 2019, with 150 passing through overall.\n\nMr Keogh was concerned he would not be able to enter Fowlers Bay if it became a sanctuary zone.\n\nRod Keogh films the whales and calves every morning during whale season. (ABC Eyre Peninsula: Jodie Hamilton)\n\n\"We bought a jet boat specifically for this operation, not only for the safety of the whales, but we are able to sit in very close in shallow water and protect ourselves from the weather,\" he said.\n\n\" If they put these rules in play, it'll push us offshore. It'll push us further away from the whales. \"\n\nHe said his business already struggled to get customers.\n\n\"If you start putting those rules and restrictions on our operation now … why would people come to Fowlers Bay and travel thousands of kilometres just to come out on a boat to see from 300 to 600 metres away,\" he said.\n\nSignificant industry\n\nTourism Industry Council of South Australia chief executive Shaun de Bruyn said whale-watching played a significant part in tourism on the far west coast.\n\nHe said changes would have a \"big impact\" on the tourism industry.\n\n\"It's a really important part for that community and for the local economy during the winter period; it's certainly established itself as a really important asset,\" he said.\n\nHe said balancing conservation and commercial activity was challenging and it should be carefully considered.\n\nApproach limits would be increased under the proposed changes. (Supplied: Marianne Stockham)\n\n\"You're interacting with a threatened or endangered species, and whenever that happens, there's always conservation requirements,\" he said.\n\n\"If whale-watching wasn't possible on the far west coast, it would be really disappointing and would definitely hurt visitation to the area.\"\n\nMr Keogh said he was concerned the restrictions would reduce visitation to the area and force his business to go under.\n\n\"Operationally, we know what works in Fowlers,\" he said.\n\n\"If they take that away from us as well, people won't come out to Fowlers for this.\"\n\nRod Keogh says he is concerned about the impacts of the proposed changes. (ABC Eyre Peninsula: Jodie Hamilton)\n\nHe said operating a 15-metre charter vessel was \"extremely expensive\".\n\n\"The insurances alone are astronomical,\" he said.\n\n\" It's a massive hit. The emotions are huge. \"\n\nA DEW spokesperson said the introduction of the Whale Nursery Protection Areas would not prevent vessel access to the waters or vessels travelling through the areas.\n\n\"The Department for Environment and Water acknowledges that the existing permit held by EP Cruises is valid until March 31, 2027,\" the spokesperson said.\n\n\"A staged increase in approach distance has been suggested to EP Cruises for whale-watching seasons in 2026 and 2027.\n\n\"Stakeholders, including EP Cruises, have been invited to meet with staff from the Department of Environment and Water conservation and wildlife division to discuss the proposal and to submit feedback.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/australia-south-africa-world-test-championship-how-to-watch/105391408",
    "title": "What you need to know about this week's World Test Championship final",
    "publish_date": "Mon, 09 Jun 2025 21:27:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia can make cricket history this week and become the first nation to win the World Test Championship twice.\n\nDefending the crown they won in 2023, Australia will face South Africa at Lord's to determine the best Test nation over the previous two years.\n\nFollow every ball of the World Test Championship final with the ABC Sport live blog, and the live commentary between Australia and South Africa at Lord's.\n\nThis will be the third World Test Championship final since its inception, and the second time Australia is in the final.\n\nHere is everything you need to know about the 2025 World Test Championship final.\n\nWhen is the World Test Championship final?\n\nThe World Test Championship final will be played at Lord's Cricket Ground from Wednesday, June 11, to Sunday, June 16.\n\nThe first ball of the Test match on Wednesday is scheduled to be bowled at 7:30pm, AEST.\n\nHow can I watch the World Test Championship final?\n\nThe World Test Championship will be streamed on Amazon's Prime Video.\n\nPrime Video has an exclusive broadcast deal for all ICC events from 2024-2027.\n\nThose with an Amazon subscription will be able to watch the World Test Championship final.\n\nABC Sport will cover every ball of the World Test Championship online with the live blog, as well as live commentary on ABC Sport Digital Radio and via the ABC Listen App.\n\nWho has Australia and South Africa picked to play?\n\nAustralia South Africa Pat Cummins (Captain) Temba Bavuma (Captain) Scott Boland David Bedingham Alex Carey Corbin Bosch Cameron Green Tony de Zorzi Josh Hazlewood Marco Jansen Travis Head Keshav Maharaj Josh Inglis Aiden Markram Usman Khawaja Wiaan Mulder Sam Konstas Senuran Muthusamy Matt Kuhnemann Lungi Ngidi Marnus Labuschagne Dane Paterson Nathan Lyon Kagiso Rabada Steve Smith Ryan Rickelton Mitchell Starc Tristan Stubbs Beau Webster Kyle Verreynne Brendan Doggett (travelling reserve)\n\nHow does the World Test Championship points table work?\n\nThe World Test Championship is held over a two-year cycle.\n\nFor each Test, a nation can score championship points for a win, a draw or a tie.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nThe top two teams at the end of the cycle play in the final.\n\nBecause not every nation plays the same number of Tests, the standings are based on the percentage of points a team could have won.\n\nSouth Africa played 12 Tests during the two-year cycle, compared to 19 by Australia.\n\nSouth Africa finished the cycle with 100 points, compared to Australia's 154.\n\nBut the 100 points secured by South Africa were 69.44 per cent of the total available to them.\n\nMeanwhile, Australia's 154 points were 67.54 per cent of the maximum amount of points they could have won.\n\nIndia, which had been the beaten finalist in the two previous finals, was third in the standings with 50 per cent of available points achieved.\n\nHow did Australia qualify for the World Test Championship?\n\nAustralia began its cycle with an Ashes series in England, fresh off defeating India in the World Test Championship final in 2023.\n\nA drawn Ashes series 2-2 gave Australia a solid foundation to build their points tally.\n\nOf the 14 Test matches Australia played after the 2023 Ashes, they won 11.\n\nA shock loss to the West Indies at the Gabba in January 2024, and a defeat in the first Test of last summer's Border-Gavaskar Trophy series against India were the only defeats for the defending champions.\n\nAustralia is on a four-match winning streak, winning the final two Tests against India, then completing a 2-0 sweep of Sri Lanka earlier this year.\n\nHow did South Africa qualify for the World Test Championship?\n\nSouth Africa made the perfect start to their two-year cycle during their Boxing Day Test against India in 2023.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAt home, South Africa defeated India by an innings and 32 runs, but then results floundered.\n\nSouth Africa would not win in their next four Tests, with three losses (one against India, two against New Zealand) and a draw with the West Indies.\n\nBut the Proteas surged to the top of the standings and into the final with seven consecutive wins.\n\nSouth Africa defeated the West Indies in August 2024, then completed 2-0 series sweeps of Bangladesh, Sri Lanka and Pakistan to qualify.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-10/mckeown-survives-dq-and-a-dark-place-to-qualify-for-world-titles/105397240",
    "title": "McKeown survives DQ and a dark place to qualify for world titles",
    "publish_date": "Mon, 09 Jun 2025 21:24:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "Multiple Olympic gold medallist Kaylee McKeown has survived a disqualification scare to qualify for the Swimming World Championships in Singapore.\n\nThe backstroker was sensationally disqualified for moving on the blocks in her heat of the women's 50m backstroke on the first day of the Australian Swimming Trials in Adelaide, before lodging a successful protest.\n\nAfter several hours, officials upheld the protest ruling that she was distracted by movement just before the start signal.\n\nThe final was the race of the night, with McKeown winning in 27.33, just .06 seconds ahead of Mollie O'Callaghan — an Olympic freestyle gold medallist.\n\n\"It's not the first time I've been DQ'd, not something that you really want to practice,\" she said.\n\nNational swimming trials to reveal fresh talent Photo shows Mollie O'Callaghan swimming over a lane rope in the pool, smiling, after winning a final Some of Australia's future swimming stars will battle this week to earn selection for this year's World Aquatics Championships.\n\nShe wouldn't elaborate on what happened apart from confirming she was distracted.\n\n\"Things happen and it just crumbled that way, I knew as soon as I started what I'd done, but thankfully we have the technology to look back at footage and saw the distraction and yeah, got reinstated,\" she said.\n\nShe said she was disappointed with her time, but didn't blame the distraction and subsequent protest.\n\n\"Tonight just wasn't my night, didn't swim the way that I wanted to,\" she said.\n\n\"Racing at 10 o'clock at night for a 50 isn't exactly ideal, but I can keep throwing out all these excuses. At the end of the day, I just haven't done the work I would have usually done with my prep.\n\nShe said she struggled after her double gold success in the 100m and 200m backstroke events at the Paris Olympics.\n\n\"Coming off the Olympics I was in a really dark place mentally,\" she said.\n\n\"I think when you go from such a high straight back to such a low and you're kind of left scrambling for ideas on what you're going to do next, it is hard to find your feet.\n\n\"I don't think people really know, and Mollie can second this, how much pressure we put on ourselves.\n\n\"I lost my world record [to American Regan Smith], same as Mollie going into Paris, and you're just so fixated on wanting to swim well for yourself, for your country, and for your team.\n\n\"And you know you just have all that amount of pressure to just do it under, you know 58 seconds.\n\nO'Callaghan said she also felt immense pressure.\n\n\"We don't really have a life outside of swimming. It's just all swimming,\" she said.\n\nPallister breaks 4 minutes in 400m free\n\nWith Ariarne Titmus in commentary for Channel 9 during her year's sabbatical from swimming, Lani Pallister stepped up to win the women's 400m freestyle final in a personal best time of 3:59.72 with Jamie Perkins more than three seconds behind.\n\nBoth women have qualified for the World Championships.\n\nThe final took place a day after Canadian Summer McIntosh smashed Titmus's former 400m free world record by more than a second.\n\nPallister said she was excited by McIntosh's world record.\n\n\"She's incredible. She's so young,\" she said.\n\n\"I think it's silly to ever say that you doubt anyone. You know Ariarne dropped the record so many times, so I don't think I thought it was going to stay stagnant for long.\n\n\"I also think it's really incredible for women's swimming going forward and everything we've done over the past decade.\"\n\nMcIntosh was also an inspiration for the winner of the men's 400m freestyle, Sam Short, who blitzed down the pool in of 3:41.03 — his fastest time in two years.\n\n\"She's incredible, I love watching her swim,\" he said of McIntosh.\n\n\"It's contagious, I love watching greatness in any sport.\"\n\nShort finished fourth at the Paris Olympics — a performance he described as \"a failure\".\n\n\"Took me a while. I did a lot of work with sport psychology,\" he said.\n\n\"In our eyes it's a little bit of a failure, but I've got tonnes of mates back home who would literally chop their legs off just to get the opportunity to come fourth in the Olympics,\" Short said.\n\nThe man who claimed the silver medal in the 400m at Paris, Elijah Winnington, was second almost three seconds behind Short, but did enough to qualify for the World Championships.\n\nThe retirement of Emma McKeon has opened up a spot for a new madam butterfly in the Australian team.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAlexandria Perkins is the heir apparent after making the semifinals at the Paris Olympics and now she'll be going to the World Championships after winning the women's 100m butterfly in a personal best time of 56.42.\n\nShe said it was a relief to make the World Championships team.\n\n\"Definitely, I think 100 fly is always on day one and this time it was the first event, and we've still got the 50 tomorrow but it's such a relief to get the ticket booked on that flight over to Singapore,\" she said.\n\nShe said it was a strange experience racing without the presence of McKeon.\n\n\"She's been at the forefront of this event for so long and she's just so talented and she was amazing role model to look up to.\n\n\"It sucks that she's not here to race anymore, but hopefully we can bring 100 fly for Australia at the next big meets.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-police-hunt-accused-geraldton-roadside-sex-predators-20250609-p5m621.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Police hunt accused Geraldton roadside sex predators; Sewage leaks into Swan",
    "publish_date": "Tue, 10 Jun 2025 12:08:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Opposition water spokesman Peter Rundle says it’s “completely unacceptable” raw sewage has contaminated “one of our most iconic natural assets” the Swan, as well as suburban streets, and called on the government to address what labels its failure to invest in critical infrastructure.\n\n“It’s a serious public health and environmental risk that’s left families and communities exposed to human waste,” he said.\n\n“While Labor boasts about record surpluses, we’re seeing basic infrastructure collapsing, it begs the question: where is the money for essential water services going?”\n\nHe said Water Corporation handed over more than $500 million in dividends to the state which spent them elsewhere, not on maintaining and upgrading infrastructure.\n\nHe called on Water Minister Don Punch to explain how this happened, and how Labor justified “taking half a billion dollars out of Water Corporation” while critical systems were “falling apart”.\n\nPremier Roger Cook will be holding a press conference later this morning, where we will be putting these questions to him and reporting back.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-minister-diagnosed-with-cancer-trump-threatens-governor-s-arrest-australia-criticised-on-tobacco-wars-20250610-p5m64a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Monash IVF caught in second embryo transfer bungle; additional military sent to LA as protests intensify",
    "publish_date": "Tue, 10 Jun 2025 11:58:08 +1000",
    "category": "finance",
    "authors": [
      "Amber Schultz"
    ],
    "text": "A shadow minister has proposed making private school fees tax-deductible, saying she hopes to start new conversations following leader Sussan Ley’s pledge to stand for “lower, simpler, fairer taxes”.\n\nSpeaking on Melbourne’s 3AW radio this morning, South Australian senator Leah Blyth said the initiative would level out the playing field for parents.\n\n“Even the most elite private institutions do receive a significant amount of public funding every year, and the net effect for those parents is they’re contributing essentially twice because they’re not only paying school fees, but they’re also contributing to the public system through general taxation,” she said.\n\nLeah Blyth, escorted by Senator Alex Antic (left) and leader of the opposition in the Senate Michaelia Cash (right), was sworn into the Senate in February. Credit: Alex Ellinghausen\n\n“What we can look at doing is evening out that playing field, but also looking at how we are funding public schools. I think it’s fair to say education standards have been dropping, particularly in our public schools across our nation, for decades, and we’ve got to do something to make sure that we aren’t leaving any children behind, while also appreciating how different families choose to educate their children.”\n\nBlyth said her proposal was before the parliamentary budget office to be costed, and she said it also involved investing money saved into public schools to narrow the gap between them and private ones.\n\nBlyth also proposed an increase in “income splitting”. This involves a worker who earns more than their partner splitting off some of their income to their spouse, so that their income is lower, and they do not have to pay as much tax.\n\nBlyth entered the Senate in February and was appointed shadow assistant minister for stronger families and stronger communities in last month’s shadow cabinet reshuffle.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/sub-standard-tigers-feel-the-pain-but-one-loss-shouldn-t-overshadow-their-progress-20250608-p5m5rj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sub-standard Tigers feel the pain, but one loss shouldn’t overshadow their progress",
    "publish_date": "Tue, 10 Jun 2025 11:50:09 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "And don’t forget 196-centimetre interceptor Josh Gibcus, who has endured a horror injury run since an eye-catching debut season in 2022 – after being the No.9 pick – and is yet to appear this season. As a result of the departures, Richmond made seven top-30 selections in 2024, but also snared a probable top-four choice from the Kangaroos in this year’s edition, for the No.27 pick last year and their 2025 second-rounder. Richmond need to improve their midfield brigade around Tim Taranto and Jacob Hopper. Credit: Getty Images Something the Tigers need are more blue-chip midfielders to complement and eventually take over from Tim Taranto, 27, and Jacob Hopper, 28. They are set to pick two of the best few teenage talents in November, even with top-liners Zeke Uwland (Gold Coast) and Daniel Annable (Brisbane Lions) tied to northern academies.\n\nLoading Richmond recruiters will be ogling potential top-five selections Dyson Sharp, Willem Duursma – brother of Xavier, Zane and Yasmin – Sam Grlj and Oliver Greeves, while ruck-forward Cooper Duff-Tytler, a No.1 pick candidate, is another option. They have onballers Josh Smillie and Taj Hotton, both selected in the top 12 last year, waiting in the wings, too, so Blair Hartley and co. have identified their list building blocks. It makes you think of ex-Tigers coach Damien Hardwick’s bold statement on joining Gold Coast, where he said he believed he already had 80 per cent of the Suns’ inaugural premiership side. There is less evidence at Punt Road for Yze to make such a call about Richmond, but they should be pleased with the early signs.\n\nThe Tigers know key-position players take longer to develop and come with a higher bust risk than their midfield peers, but also how crucial they are, which was why they drafted so many, so early in this process. They are hopeful the next Alex Rance and Jack Riewoldt are lurking within this crop, while Richmond are planning for life after Toby Nankervis, with Samson Ryan, Mate Colina and Oliver Hayes-Brown jostling to be his ruck successor. Tiger Tom Brown has been one of the bright spots for Adem Yze’s team. Credit: Getty Images Beyond the wins, competitive defeats and first-year draftees, another positive is that some other emerging Tigers have put their hand up to suggest they could be meaningful parts of a successful future, too. Tom Brown, Seth Campbell, Sam Banks, Steely Green, James Trezise and Kane McAuliffe are chief among those – and that is as important as any other development.\n\nLoading Noah Balta, Jack Ross, Ben Miller, Rhyan Mansell and Thomson Dow headline a modest mid-20s group that needs to get stronger but offers a decent-enough plank for now between the kids and veterans. Speaking on Fox Footy, Riewoldt, like Yze, was concerned with Saturday’s effort, saying too many of these types of losses can be “soul-destroying”. The coach himself mentioned there would be pain along the journey, yet the underlying evidence is that Richmond are ahead of schedule. Frittering away chance Melbourne were looking more like the side many expected before their latest Alice Springs horror show against St Kilda, so it was not particularly surprising that they ran Collingwood close.\n\nThe problem for Simon Goodwin’s Demons is they started the season 0-5 and have a sub-90 percentage, so finals remain a longshot for a club that gave away its first-round pick this year to Essendon (a strategy that has consistently worked for them). Bayley Fritsch has kicked 207 goals in 100 games since the start of 2021, but he’s had a challenging season and even at his best was criticised – including by Matthew Lloyd – for being selfish at times. The aftermath of Bayley Fritsch’s ill-advised decision to play on near goal. Credit: AFL Photos Fritsch is back in form after being dropped ahead of round six, and kicked two of his three goals in the final quarter to give Melbourne a shot at upsetting the ladder-leading Pies. However, there was a brain-fade moment, with scores tied in the last term, when Fritsch marked 25 metres out, and instantly played on while not realising Isaac Quaynor was in front of him. That was bad enough without factoring in that teammate Tom Sparrow was on his own running towards the goal square.\n\nGoodwin probably takes the good with the bad from Fritsch, but it was certainly costly. What the 2021 premiership coach would be thrilled with was the Demons’ disciplined team job on Collingwood superstar Nick Daicos, from Ed Langdon to Clayton Oliver and Judd McVee. Langdon did the lion’s share of the lifting in a sacrificial role, but the overall willingness to stick at it was one of the most positive takeaways. Daicos finished with a modest 19 disposals, one goal and only four score involvements. Mission accomplished. All-Australian ruck race We are amid one of the most competitive races to be the starting ruckman in the All-Australian side.\n\nSelectors might need to consider picking two of seven-time All-Australian Max Gawn, Tristan Xerri and Tom De Koning, given how good they have been. Neither Xerri nor De Koning has ever made the final cut, although the Kangaroo made the extended squad last year. The last time two ruckmen made the team was in 2021, when Gawn (starting) and Nic Naitanui (bench) were selected. Xerri, De Koning and Gawn were excellent again in round 13, and offer different qualities. Tristan Xerri and Tom De Koning, pictured during their Good Friday battle, have built All-Australian ruck cases. Credit: Getty Images Xerri leads all ruckmen in clearances and hitouts-to-advantage; Gawn averages more marks, disposals and contested possessions than all his ruck peers; and the uber-athletic De Koning performs strongly in almost every relevant category. None of their teams are in the top eight, which continues an unhealthy narrative about ruckmen’s worth, but that should not take away from how great each of them has been.\n\nOf note is that Xerri towelled Gawn in round two, while De Koning received coaches’ votes against Xerri in round six (Xerri won the hitouts and was a tackling machine but De Koning kicked a goal and had more clearances in a big Carlton win). Gawn and De Koning are due to do battle in round 19. Jack Silvagni shut down in-form Bomber Nate Caddy to be one of Carlton’s best players. Credit: AFL Photos Where do Blues fit? Carlton’s unconvincing victory over Essendon on Sunday night provided little evidence that they have turned the corner and are set to challenge for a finals berth. Coach Michael Voss performed his best spin-doctor impression after their 38-point first-half lead disintegrated to only six with almost four-and-a-half minutes left, against a Bombers side missing Mason Redman, Sam Draper, Nick Bryan, Kyle Langford, Ben McKay, Zach Reid and Jordan Ridley.\n\nVoss said they addressed their constant second-half fadeouts during the bye a week earlier and that the worrying trend would not be instantly solved. Loading “It’s a good problem to have, if you’re in front by that much, and you’re getting that many opportunities,” he said. “The harder one to solve is you’re behind all the time, you get no opportunities, and you’re trying to win your game from a completely negative base.” The Blues could take heart from Jack Silvagni’s job on Nate Caddy in his first game back, Zac Williams’ reintegration as a forward, and tagger Alex Cincotta’s effort on Zach Merrett. First-gamer Hudson O’Keeffe also showed promise. Voss revealed afterwards that the 202-centimetre ruckman made significant strides as a forward in the past month to earn his shot.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/music/fan-storms-stage-and-puts-arm-around-katy-perry-during-sydney-concert-20250610-p5m654.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Serial TikTok prankster storms stage and puts arm around Katy Perry during Sydney concert",
    "publish_date": "Tue, 10 Jun 2025 11:47:02 +1000",
    "category": "entertainment",
    "authors": [
      "Thomas Mitchell"
    ],
    "text": "Katy Perry’s Monday night concert in Sydney took a serious turn when the touring US superstar was rushed on stage by a serial prankster Johnson Wen, who managed to put an arm around the singer before eventually being grabbed by security.\n\nA fan puts an arm around Katy Perry during Monday’s concert in Sydney. Credit: Screenshot\n\nPerry, who is in Australia performing as part of her Lifetimes tour, was onstage at Sydney’s Qudos Bank Arena when the security breach happened midway through the show.\n\nWen is a serial prankster who goes by the username Pyjama Man on TikTok, where he regularly shares videos of himself being a public nuisance, invading stages during concerts or running onto sporting pitches.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/monash-ivf-admits-another-embryo-mix-up-20250610-p5m68q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Monash IVF admits another embryo mix-up",
    "publish_date": "Tue, 10 Jun 2025 11:46:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Monash IVF admits another embryo mix-up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Alan Moir",
    "publish_date": "Tue, 10 Jun 2025 11:43:40 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Alan Moir\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/re-imagining-your-home-for-the-next-chapter-20250606-p5m5hp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Re-imagining your home for the next chapter",
    "publish_date": "Tue, 10 Jun 2025 11:42:47 +1000",
    "category": "lifestyle",
    "authors": [
      "Katie Cunningham"
    ],
    "text": "O’Connell advocates for what she describes as “decluttering with purpose”. That means focussing on the items you truly use and love, then making a fun project of donating and selling the rest. By decluttering with purpose — rather than just haphazardly heaping items into a bin bag — “you’re not just throwing it away, you’re actually passing it on to someone else who could use it better than you can”.\n\nIf you’re thinking about rightsizing your home for somewhere easier to look after, you should also consider where that next home is located — because easy access to services like health care, transport, walkable environments and community centres or programs can make all the difference as you age.\n\nFuture-proofing your home for the years to come\n\nRightsizing can be a great opportunity to ensure our homes are as accessible as possible for the decades to come. And future-proofing your home “doesn’t have to be expensive, and it doesn’t have to mean renovations”, says O’Connell.\n\nThere are many minor adjustments you can make to help you stay independent and at home for longer. These include replacing doorknobs, which due to conditions such as arthritis, may become difficult to turn as you age, with simple levers. Door hinges can be offset so you can widen the doorway for future accessibility needs if required. And adding grab rails to toilets and showers can help you move around the bathroom with confidence.\n\nBrighter lighting, especially in stairways and hallways, can increase visibility and reduce fall risk, as can adding contrasting colours on the edges of steps. You might also consider installing smart-home technology that offers features like voice-activated assistance to control lights, video doorbells and alarms.\n\nAgain, it’s never too early to start on these changes.\n\n“I do think starting early and making changes gradually makes it more affordable,” says O’Connell. “And small changes now can equal more autonomy later.”\n\nStaying socially connected through activities like walking is key to healthy ageing.\n\nBonus tips for setting yourself up for healthy ageing\n\nHere’s a statistic that might surprise you: “Only around 25 per cent of age-related decline is genetic,” says O’Connell. “So, what that means is that we can do an awful lot to help ourselves live well now and into our later years.”\n\nIn her work with LiveUp, a national platform designed to help older Australians stay well as they age, O’Connell uses healthy ageing principles set out by the World Health Organization.\n\nThat includes encouraging simple but effective steps like getting physically active and eating well, staying socially connected, joining clubs, volunteering, learning new skills to keep the brain sharp, as well as getting regular health checks to catch any small issues before they become big ones.\n\nO’Connell believes that both in and outside of the home, with a little forward planning, you can set yourself up to be able to do what you both need and want to be able to do in the future.\n\nReady to take the next step in reimagining your home and life? Visit liveup.org.au to explore more resources and support for healthy ageing.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-cathy-wilcox-20230608-p5df54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Cathy Wilcox",
    "publish_date": "Tue, 10 Jun 2025 11:42:14 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Cathy Wilcox\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/the-ghost-of-holger-osieck-is-the-only-thing-that-can-stop-the-socceroos-20250609-p5m5w0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ghost of Holger Osieck is the only thing that can stop the Socceroos",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The Socceroos were a bit on the nose with the public. Osieck had allowed the ageing “Golden Generation” to hang on for too long, and his style of football was hardly inspiring. Later that year, in their wisdom, Football Federation Australia scheduled back-to-back friendlies, both away, against Brazil and France. Rare chances for them to measure up against true global yardsticks.\n\nIt was 2013, and Australia had just sealed a spot at the World Cup in Brazil. Josh Kennedy was the saviour, thanks to his iconic late header against Iraq in front of 80,000 people in Sydney. But there was no saving the unpopular Holger Osieck, who was sacked three months later, despite delivering Australia’s third successive qualification.\n\nCritics accused the Socceroos of making the Australian game look like a “joke” on the world stage with their “spineless” performances, and several players of outstaying their welcome in the team. As soon as he returned to the team hotel after game two in Paris, Osieck was dismissed, and moves were immediately afoot to get the federation’s No.1 coaching target, Ange Postecoglou, out of his contract at Melbourne Victory, thus setting in train a series of events that would soon lead to Postecoglou taking over and regenerating the squad, Mark Schwarzer’s retirement, and the handing over of the gloves to Ryan, who will win his 100th cap on Wednesday morning (AEST) by hopefully contributing to what would be one of the best moments of his career.\n\nFor that not to happen, the Socceroos would need to turn in a stinker the likes of which they have not had in 12 years. Not since that day in Paris. Or that other day in Brasília. That is how bad they would have to be to miss out on the 2026 World Cup from here. That is how long ago they last lost by five goals or more.\n\nA lifetime ago: Lucas Neill and Holger Osieck in 2013. Credit: Penny Stephens\n\nThat is the sort of heist Saudi Arabia has to pull off in Jeddah.\n\nIt is an unfathomable thought on multiple levels. So far in this qualifying phase, the Saudis have scored only six goals in nine games – so to do it, they’d essentially need to reproduce that whole output in one match. Only twice before have the Socceroos ever lost a competitive match (not friendlies) by 5-0 or worse, and not since 1997.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/one-of-the-greatest-shots-i-ve-ever-seen-phil-mickelson-can-still-make-a-golf-ball-talk-20250610-p5m658.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘One of the greatest shots I’ve ever seen’: Phil Mickelson can still make a golf ball talk",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Gene Wang"
    ],
    "text": "“So that was one of my better ones,” said Mickelson, who added a birdie at No. 18 for a 6-under 65 and a 54-hole total of 13-under 200, two shots off the pace. “Even I was a bit surprised.”\n\nMickelson’s birdie from the bunker at No. 17 with his back to the flagstick overshadowed Joaquín Niemann outlasting a charge from a group of major champions to win the event in Gainesville, Virginia. Even as Niemann celebrated onstage, the chatter from patrons around the property remained squarely on Mickelson’s wizardry.\n\nThe six-time major championship winner, who will turn 55 next week, treated a disbelieving gallery to perhaps the most improbable shot of his career - which is saying something for one of the most creative players in history - during Sunday’s weather-delayed final round of LIV Golf Virginia at Robert Trent Jones Golf Club.\n\nThe moment unfolded after Mickelson landed his approach at the par-4 17th in a bunker guarding the left front of the green. Facing an uphill lie, Mickelson glanced at the target, addressed the ball for the last time with his right side pointed at the green and proceeded into his backswing gripping his sand wedge.\n\nAt contact, the ball sailed high and travelled practically behind Mickelson’s head, landing within two feet of the pin and trickling into the cup, triggering a wild celebration from his legion of fans who had endured miserable conditions to track Mickelson’s round to completion.\n\nPhil Mickelson during a LIV tournament. Credit: AP\n\n“Man, he created some Phil magic there,” said Bryson DeChambeau, playing in the threesome with Mickelson and finishing tied for fourth at 13 under. “You could just see his wheels turning, and then he hit the shot, and I got the perfect angle of it. … I go, ‘Oh my gosh, he’s going to make it,’ and it went in the hole, and I was like, ‘That’s got to be one of the greatest shots I’ve ever seen in my entire life.’ ”\n\nThe dazzling shot was the highlight of LIV Golf’s second stop in three years in the shadow of the nation’s capital, where the tour’s future has been oft debated. In February, Tiger Woods joined PGA Tour Commissioner Jay Monahan and player director Adam Scott in a White House meeting with President Donald Trump and Yasir Al-Rumayyan, governor of the Saudi Public Investment Fund that bankrolls LIV Golf, for negotiations to reunify the fractured sport.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/how-steve-waugh-s-sledge-fired-south-africa-to-lord-s-finale-20250610-p5m65f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Steve Waugh’s sledge fired South Africa to Lord’s finale",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "It wasn’t the first time Steve Waugh had reached into his bag of mental disintegrators to upset South Africa, but when Waugh accused the Proteas of not caring about the future of Test cricket in January last year, South African great Graeme Smith was unimpressed.\n\nFormer South Africa captain Smith has hit back at Waugh on the eve of the World Test Championship final, in which Australia will tackle the Proteas at Lord’s from Wednesday.\n\nWaugh was famed for goading South Africa with words to the effect of “you’ve just dropped the World Cup” when Herschelle Gibbs spilled a chance against him at the 1999 tournament, which Australia went on to win.\n\nSmith was taken aback that Waugh did not contact him to understand the reasons for the Proteas fielding what amounted to a third XI to tour New Zealand, which clashed with the privately-owned SAT20 League, before making his comments.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/iranian-superstar-unleashes-joyful-frenzy-20250610-p5m66i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Iranian superstar unleashes joyful frenzy",
    "publish_date": "Tue, 10 Jun 2025 11:19:50 +1000",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "From Harbour to Harbour 2 is the second incarnation of a project in which Sharifian’s band, Lian, is joined by didgeridoo virtuoso William Barton and his mother, singer Aunty Delmae Barton. The concept, however, was better than the execution, as where I was sitting the bottom-end sound was sludgy, and the didgeridoo’s nuances were largely lost.\n\nMohsen Sharifian’s folkloric music comes from the southern Iranian coast on the Persian Gulf, and for the local Iranian community Sharifian has the star power of Elvis, Michael Jackson and Taylor Swift rolled into one. He has done what Goran Bregovic did for Balkan music: locate it within the universal dance beat of a thumping bass drum – here an electronic wallop triggered by Morteza Palizdan’s foot – and take it to the world.\n\nI had a little glimpse of what it would be like to be a god. From my box in Chatswood’s Concert Hall, high above the front edge of the stage, I gazed down on a seething mass of humanity in what was effectively a mosh-pit, only with seating getting the way. The excitement of these people was as explosive as the music.\n\nBarton and Aunty Delmae only topped and tailed a generous show that started 35 minutes late, while we, in a new low for concert presentation, watched ads on a big screen. The rest embodied the instant party that’s a Lian performance, with people dancing from the moment the band launched into the raucous Eshkeleh, and only stopping when Sharifian addressed us.\n\nHe’s a virtuoso player of the ney-anban, an Iranian bagpipe with a sound that’s shriller and even more transfixing than the Celtic version. His band also contains a second ney-anban player, his daughter Liana, whose main solo incorporated a dissonance that sliced through one like shards of glass, and whose instrument was adorned with a string of pom-poms, so when she twirled while playing, these gracefully arced around her.\n\nFrom the moment the band’s formidable density – having three hand-drummers, an oud player and an electric bassist – fully kicked in, you understood why such a piercing instrument is demanded. Sharifian also sings, although the primary vocalist was the impressive Aka Safavi, who also had to scale this wall of sound, and did so more as a seasoned professional than as the natural charismatic that is Sharifian. The lyrics, meanwhile, sometimes drew on Omar Khayyam’s poetry.\n\nMore than anything this concert was the sound of joy: a joy that engulfed a room more used to hosting polite applause with rumps firmly glued to seats. Intermittently the mood could change to the pensive beauty of Reza Kashi’s oud, but that pounding ersatz bass drum, intent on stoving in one’s ribcage, was not to be denied, and soon enough we were back in a musical frenzy, with the ecstatic response it engendered. It was just a shame the sound was so muddy.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/anthony-albanese-set-to-outline-political-vision-for-second-term-in-key-speech/hfdbkvryf",
    "title": "Anthony Albanese set to outline political vision for second term in key speech",
    "publish_date": "Mon, 9 Jun 2025 21:15:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese is set to lay out his second-term agenda in a key speech, as he prepares for potential talks with United States President Donald Trump.\n\n\n\n\n\nIn his first major address since an emphatic election win in May, Albanese will speak at the National Press Club on Tuesday about his priorities for when parliament resumes in July.\n\n\n\n\n\nAfter securing an expanded mandate among voters at the election in which Labor increased its parliamentary majority, Albanese will say delivering on promises will be his priority.\n\n\n\n\n\n\"Delivering these commitments matters for every Australian, regardless of who they voted for. It matters for our economy, for the jobs, skills, technology, infrastructure and energy we need to grow and thrive in the years ahead,\" he will say in the speech.\n\n\n\n\n\n\"It also matters for our democracy. We are living in a time of significant global uncertainty — and that reaches beyond just economic instability.\"\n\n\n\nREAD MORE PM urged to intervene after Australian journalist hit by rubber bullet in LA protests\n\nMay's federal poll was the first time since 1966 that an incumbent government retained all the seats it held at an election.\n\n\n\n\n\nAlbanese will say promises of expanding urgent care clinics, cheaper childcare and an increase in affordable housing will remain central to his government's priorities.\n\n\n\n\n\n\"Our government's vision and ambition for Australia's future was never dependent on the size of our majority. But you can only build for that future vision if you build confidence that you can deliver on urgent necessities,\" he will say.\n\n\n\nLabor will have a responsibility in its second term to disprove voter cynicism with governments, Albanese will say.\n\n\n\n\n\n\"To recognise that some of this frustration is drawn from people's real experience with government — be it failures of service delivery, or falling through the cracks of a particular system,\" he will say.\n\n\n\n\n\n\"And to counter this, we have to offer the practical and positive alternative.\"\n\n\n\nThe speech comes days before Albanese flies to Canada for the G7 summit, where a one-on-one meeting with Trump is on the cards.\n\n\n\n\n\nTariffs imposed by Trump on other countries are set to dominate discussions at the international forum, with Australia trying to secure an exemption to the economic measure.\n\n\n\n\n\nAustralia had been imposed with a 10 per cent tariff on all exports to the US, with steel and aluminium products having a 50 per cent tariff .\n\n\n\n\n\nAlbanese will say Australia will still be able to play a critical role in global affairs amid the instability.\n\n\n\n\n\n\"Our vision is for a society that is a microcosm for the world, where all are respected and valued and our diversity is recognised as a strength.\n\n\n\n\n\n\"Our international relationships in the fastest growing region of the world in human history benefit us, but also provide a platform for us to play a positive a stabilising global role in uncertain times.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/australias-whooping-cough-surge-is-not-over-and-it-doesnt-just-affect-babies/9suvurboc",
    "title": "What's driving Australia's current whooping cough surge, and who's at risk?",
    "publish_date": "Mon, 9 Jun 2025 20:30:57 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Whooping cough (pertussis) is always circulating in Australia, and epidemics are expected every three to four years.\n\n\n\n\n\nBut the numbers reported during the current surge — which started in 2024 — are higher than usual epidemics.\n\n\n\n\n\nVaccines for this highly infectious respiratory infection have been available in Australia for many decades. Yet it remains a challenging infection to control because immunity (due to prior infection or vaccination) wanes with time.\n\n\n\n\n\nIn 2025, more than 14,000 cases have been recorded already. Some regions, including Queensland and Western Australia's Kimberley region, are experiencing a marked rise in cases.\n\n\n\nIn 2024, more than 57,000 cases of whooping cough were reported in Australia — the highest yearly total since 1991 — including 25,900 in NSW.\n\n\n\nWhat is causing the current surge?\n\nSeveral factors are contributing to numbers higher than expected for an anticipated epidemic.\n\n\n\n\n\nCOVID-19 lockdowns in 2020 and 2021 reduced natural immunity to many diseases, disrupted routine childhood vaccination services, and resulted in rising distrust in vaccines. This has meant higher-than-usual numbers for many infectious diseases.\n\n\n\n\n\nAnd it's not only Australia witnessing this surge.\n\n\n\nIn the United States, whooping cough cases are at their highest since 1948, with deaths reported in several states, including two infants.\n\n\n\n\n\nIn Australia, vaccine coverage remains relatively high, but it is slipping and is below the national target of 95 per cent.\n\n\n\n\n\nEven small declines may have a significant impact on infection rates.\n\n\n\nWho is at risk of whooping cough?\n\nYoung babies, especially those under six weeks of age, are extremely vulnerable to whooping cough because they're too young to be vaccinated.\n\n\n\n\n\nInfants under six months of age are also more likely to require hospitalisation for breathing support or have severe outcomes such as pneumonia, seizures or brain inflammation. Some do not survive.\n\n\n\n\n\nHowever, the greatest number of cases occurs in older children and adults. In fact, in 2024, more than 70 per cent of cases occurred in children 10 years and older, and adults.\n\n\n\nCan you get whooping cough even if you’re vaccinated?\n\nThe whooping cough vaccine works well, but its protection fades with time. Babies are immunised at six weeks, four months and six months, which gives good protection against severe illness.\n\n\n\n\n\nBut without extra (booster) doses, that protection drops, falling to less than 50 per cent by four years of age. That's why booster doses at 18 months and four years are essential for maintaining protection against the disease.\n\n\n\n\n\nA whooping cough vaccine is also recommended for any adult who wishes to reduce the likelihood of becoming ill with pertussis. Carers of young infants, in particular, should have a booster dose if they've not received one in the past ten years.\n\n\n\n\n\nA booster dose is also recommended every ten years for healthcare workers and early childhood educators.\n\n\n\nThe whooping cough vaccine works well, but its protection fades with time. Source: AAP / PA/Alamy One of the best ways we can protect babies from the life-threatening illness of whooping cough is vaccination during pregnancy, which transfers protective antibodies to the unborn baby.\n\n\n\n\n\nIf a woman hasn't received a vaccine during pregnancy, they can be vaccinated as soon as possible after delivery (preferably before hospital discharge). This won't pass protective immunity to the baby, but reduces the likelihood of the mother getting whooping cough, providing some indirect protection to the infant.\n\n\n\nHow contagious is whooping cough?\n\nWhooping cough is extremely contagious — in fact, it is up to ten times more contagious than the flu.\n\n\n\n\n\nIf you're immunised against whooping cough, you're likely to have milder symptoms. But you can still catch and spread it, including to babies who have not yet been immunised.\n\n\n\nData shows siblings (and not parents) are one of the most common sources of whooping cough infection in babies.\n\n\n\n\n\nThis highlights the importance of on-time vaccination not just during pregnancy, but also in siblings and other close contacts.\n\n\n\nHow do I know it's whooping cough, and not just a cold?\n\nEarly symptoms of whooping cough can look just like a cold: a runny nose, mild fever, and a persistent cough.\n\n\n\n\n\nAfter about a week, the cough often worsens, coming in long fits that may end with a sharp \"whoop\" as the person gasps for breath.\n\n\n\n\n\nIn very young babies, there may be no whoop at all. They might briefly stop breathing (called an \"apnoea\") or turn blue.\n\n\n\nREAD MORE Australia's first case of clade 1b mpox found in man who was holidaying in Thailand\n\nIn teens and adults, the only sign may be a stubborn cough (the so-called \"100-day\" cough) that won't go away.\n\n\n\n\n\nIf you have whooping cough, you may be infectious for up to three weeks after symptoms begin, unless treated with antibiotics (which can shorten this to five days).\n\n\n\n\n\nYou'll need to stay home from work, school or childcare during this time to help protect others.\n\n\n\nWhat should I do to reduce my risk?\n\nStart by checking your vaccination record. This can be done through the myGov website, the Express Plus Medicare app or by asking your GP.\n\n\n\n\n\nIf you're pregnant, get a whooping cough booster in your second trimester. A booster is also important if you're planning to care for young infants or meet a newborn.\n\n\n\n\n\nGot a cough that lasts more than a week or comes in fits? Ask your GP about testing.\n\n\n\n\n\nOne quick booster could help stop the next outbreak from reaching you or your loved ones.\n\n\n\n\n\nNiall Johnston is a conjoint associate lecturer at Faculty of Medicine, UNSW Sydney.\n\n\n\n\n\nHelen Quinn is a senior research fellow at National Centre for Immunisation Research and Surveillance, and a senior lecturer at Children’s Hospital Westmead Clinical School, University of Sydney.\n\n\n\n\n\nPhoebe Williams is a paediatrician and infectious diseases physician, and a senior lecturer and NHMRC fellow, Faculty of Medicine, University of Sydney.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/i-do-this-s-for-a-living-the-australians-awarded-for-doing-absolutely-nothing/r4ulo314u",
    "title": "'I do this s*** for a living': The competition that rewards you for doing absolutely nothing",
    "publish_date": "Mon, 9 Jun 2025 19:50:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "An engineer, a fountain with warm running water, a Japanese elder, two rival Teletubbies and an actual labrador — these were some of the \"athletes\" in the running for the winner of Melbourne's competition to be the best at doing absolutely nothing.\n\n\n\n\n\nThe Space Out contest, part of the city's winter Rising Festival, crowns its champion based on who can maintain the lowest heart rate for 90 minutes, as competitors veg out in a public space.\n\n\n\n\n\nParticipants have their heart rate measured by doctors every 15 minutes to capture their technical score, and can be awarded points for their costumes and vibe — their artistic score.\n\n\n\nThe Space Out competition's winner and finalists. Source: SBS News / Madeleine Wedesweiler There is a somewhat serious element along with the novelty. South Korean artist Woopsyang first ran the competition in Seoul in 2014 to make a statement about hustle culture and burnout.\n\n\n\n\n\nThis year in Melbourne, with perhaps the most elaborate costume of the day and certainly the only to use running water and electricity, local puppeteer Amelia took home the winner's certificate, dressed as a fountain.\n\n\n\n\n\nSitting in a pool of water for the event's duration, Amelia had two helpers heating the water with kettles to help manage the cold conditions caused by polar air across southeastern Australia.\n\n\n\nCompetition winner Amelia portrayed a running fountain. She sat submerged in water for over 90 minutes on a cold Melbourne day. Source: SBS News / Madeleine Wedesweiler But the event's presenters speculated the water lowered her heart rate — cold water is known to slow the body's blood pressure and heart rate and can eventually lead to hypothermia and possibly death from prolonged exposure.\n\n\n\n\n\n\"I chose to do a puppet that uses water as I think it is the laziest of all elements, it always finds the path of least resistance,\" Amelia told SBS News before the competition started.\n\n\n\n\n\n\"My strategy is to imagine that I am a sea sponge.\"\n\n\n\n\n\nIn her winner's speech Amelia dedicated the win to the fountain in her grandmother's garden.\n\n\n\n\n\n\"It's where she likes to sit and experience serenity. [I dedicate this] to everyone here as well, we are all fountains from when we wake up and take a shower until, well, when we next take a shower.\"\n\n\n\nTiggolo the retired seeing-eye dog placed third. Source: SBS News / Madeleine Wedesweiler Runner-up was Anthony, a man who initially claimed to be an engineer and was dressed as one, but then said he lied and he's unemployed.\n\n\n\n\n\nTiggolo, a retired seeing-eye dog, was awarded third place for his very low heart rate and zen nature.\n\n\n\n\n\nThe black Labrador's owner said he was keen to chill out after his years of service, though around 5pm (his dinner time) he nearly lost composure, but gained it and stared deeply into her eyes.\n\n\n\n\n\nAnother puppet costume, with a giant paper mache head that took two months to make, was awarded the \"special prize\".\n\n\n\nThis was the Space Out competition's Australian debut. Source: SBS News / Madeleine Wedesweiler Participants were required to write a statement about why they were competing and audience members could place a vote on their answers in the form of red stickers.\n\n\n\n\n\n\"Full time sofa coder. I do this shit for a living,\" one wrote.\n\n\n\n\n\n\"ADHD sisters about to enter their mind palace,\" said another.\n\n\n\nEach competitor had to share a statement about why they were competing. Source: SBS News / Madeleine Wedesweiler \"90 minutes of quiet dress ups and keeping kids entertained,\" said a clever parent.\n\n\n\n\n\n\"I want to learn to space out to teach my children that it's already wonderful and valuable to just BE!\" reads a much-stickered statement.\n\n\n\n\n\nWoopsyang cultivated an air of mystique, wearing sunglasses, a white, Korean hanbok-inspired dress and black hat, and silently walking onstage to unveil huge scrolls with messages for participants just before the competition starts.\n\n\n\n\n\n\"Sometimes doing nothing can be the most powerful and valuable act,\" the first scroll reads.\n\n\n\nSouth Koran artist Woopsyang created the Space Out competition as a statement about burnout. Source: SBS News / Pranjali Seghal After she revealed all the scrolls and called sequined performer Gabi Barton onstage to lead some stretching, the still-silent Woopsyang rang a tiny bell into a microphone to commence the competition.\n\n\n\nTackling burnout culture\n\nInformed by hardcore work culture in some Asian countries, Woopsyang has toured the Space Out competition to other cities including Tokyo, Hong Kong and Shanghai — this is its first time in Australia.\n\n\n\n\n\nShe says she was surprised to learn that Australians, who seem so laid back, report high levels of burnout.\n\n\n\nPo from the Teletubbies participated, as did Dipsy. The pair didn't know each other. Source: SBS News / Pranjali Seghal \"Normally Asians think that Western people are very chilled and relaxed, have their nice lifestyle, but then when I came to Melbourne a few days ago and saw people coming and going and rushing, I figured out even in Melbourne, life is so busy and everyone is very overwhelmed,\" she told SBS News through an interpreter.\n\n\n\n\n\nRecent research indicates two in five Australian workers began 2025 already feeling burnt out, and 90 per cent of Australian employees feel that burnout is ignored until it becomes critical.\n\n\n\n\n\nBurnout is an \"occupational phenomenon\", not a medical condition, according to the World Health Organization's (WHO) 2019 definition.\n\n\n\n\n\nThe WHO says it typically presents as exhaustion, negative feelings towards one's job, and reduced professional productivity.\n\n\n\nMany different professions were represented in the competition. Source: SBS News / Madeleine Wedesweiler Woopsyang wanted the event to represent all different ages and professions, as though she was creating a miniature city where everyone was spacing out together.\n\n\n\n\n\n\"Ten years ago when I was working as an artist, I felt so burnt out, and so overwhelmed.\n\n\n\n\n\n\"I was interrogating myself: 'Why do I feel so much anxiety? Why can't I stop, why can't I pause?'\n\n\n\nMany participants remarked they felt very zen afterwards. Source: SBS News / Madeleine Wedesweiler \"But then I thought everyone who surrounded me was still busy and doing other stuff and so I thought what if we all need to stop and then we can all take a break and recover,\" she said.\n\n\n\n\n\nWoopsyang said the Melbourne event is now her favourite and almost brought her to tears because of how well everyone performed, though the first iteration will always have a special place in her heart.\n\n\n\n\n\nBut 10 years later, she says she's busier and has much less time to space out than ever before.\n\n\n\n\n\nHer own advice might be helpful for that — to find moments of appreciation, calm and stillness throughout the day, wherever you can.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/how-sbs-has-transformed-diverse-broadcasting-for-over-50-years/tvn8d9bse",
    "title": "How SBS has transformed diverse broadcasting for over 50 years",
    "publish_date": "Mon, 9 Jun 2025 10:31:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "How SBS has transformed diverse broadcasting for over 50 years\n\nPublished 9 June 2025, 7:58 am\n\nSBS is celebrating 50 years. On 9 June 1975, 'Radio Ethnic Australia' launched a bold experiment by then Immigration Minister Al Grassby to explain Medibank, the first version of Medicare, to migrants in different languages. As Australia’s most diverse broadcaster, the Special Broadcasting Service aims to inspire all Australians to explore, respect and celebrate our diverse world, and, in doing so, promote an inclusive and cohesive society.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/gunlom-falls-prepares-to-re-open-in-the-northern-territory/k4nupu5b4",
    "title": "Gunlom Falls prepares to re-open in the Northern Territory",
    "publish_date": "Mon, 9 Jun 2025 09:11:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Gunlom Falls prepares to re-open in the Northern Territory\n\nPublished 9 June 2025, 7:59 am\n\nAfter more than five years closure to the public, a famous waterfall site in the Northern Territory is reopening. Gunlom Falls was at the centre of a legal battle after Parks Australia was fined for exposing a sacred Aboriginal men's site. But traditional owners say their relationship with staff has 'healed'.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/darwin-celebrates-36th-greek-glenti-festival/voixmnebi",
    "title": "Darwin celebrates 36th Greek GleNTi festival",
    "publish_date": "Mon, 9 Jun 2025 09:02:02 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Darwin celebrates 36th Greek GleNTi festival\n\nPublished 9 June 2025, 7:58 am\n\nThe Northern Territory's largest cultural food festival at the weekend has wrapped up, celebrating everything Greek. GleNTi took over Darwin's esplanade for the 36th year. In anticipation volunteers prepared more than 600 kilograms of dolmades.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/measles-cases-are-surging-globally-should-children-be-vaccinated-earlier-in-australia/vjwrop36h",
    "title": "Measles cases are surging globally. Should children be vaccinated earlier in Australia?",
    "publish_date": "Mon, 9 Jun 2025 08:30:08 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Measles has been rising globally in recent years. There were an estimated 10.3 million cases worldwide in 2023, a 20 per cent increase from 2022.\n\n\n\n\n\nOutbreaks are being reported all over the world including in the United States, Europe and the Western Pacific region (which includes Australia). For example, Vietnam has reportedly seen thousands of cases in 2024 and 2025.\n\n\n\n\n\nIn Australia, 77 cases of measles have been recorded in the first five months of 2025, compared with 57 cases in all of 2024.\n\n\n\n\n\nMeasles cases in Australia are almost all related to international travel. They occur in travellers returning from overseas, or are contracted locally after mixing with an infected traveller or their contacts.\n\n\n\nSource: The Conversation / WHO Measles most commonly affects children and is preventable with vaccination, given in Australia in two doses at 12 and 18 months old. But in light of current outbreaks globally, is there a case for reviewing the timing of measles vaccinations?\n\n\n\nSome measles basics\n\nMeasles is caused by a virus belonging to the genus Morbillivirus. Symptoms include a fever, cough, runny nose and a rash. While it presents as a mild illness in most cases, measles can lead to severe disease requiring hospitalisation, and even death. Large outbreaks can overwhelm health systems.\n\n\n\n\n\nMeasles can have serious health consequences, such as in the brain and the immune system, years after the infection.\n\n\n\nREAD MORE From HIV to polio and measles: WHO chief warns US aid cuts could cost millions of lives\n\nMeasles spreads from person to person via small respiratory droplets that can remain suspended in the air for two hours. It’s highly contagious — one person with measles can spread the infection to 12–18 people who aren’t immune.\n\n\n\n\n\nBecause measles is so infectious, the World Health Organization (WHO) recommends two-dose vaccination coverage above 95 per cent to stop the spread and achieve “herd immunity”.\n\n\n\n\n\nLow and declining vaccine coverage, especially since the COVID pandemic, is driving global outbreaks.\n\n\n\nWhen are children vaccinated against measles?\n\nNewborn babies are generally protected against measles thanks to maternal antibodies. Maternal antibodies get passed from the mother to the baby via the placenta and in breast milk, and provide protection against infections including measles.\n\n\n\n\n\nThe WHO advises everyone should receive two doses of measles vaccination. In places where there’s a lot of measles circulating, children are generally recommended to have the first dose at around nine months old. This is because it’s expected maternal antibodies would have declined significantly in most infants by that age, leaving them vulnerable to infection.\n\n\n\n\n\nIf maternal measles antibodies are still present, the vaccine is less likely to produce an immune response.\n\n\n\n\n\nResearch has also shown a measles vaccine given at less than 8.5 months of age can result in an antibody response which declines more quickly. This might be due to interference with maternal antibodies, but researchers are still trying to understand the reasons for this.\n\n\n\nA second dose of the vaccine is usually given 6–9 months later. A second dose is important because about 10–15 per cent of children don’t develop antibodies after the first vaccine.\n\n\n\n\n\nIn settings where measles transmission is under better control, a first dose is recommended at 12 months of age. Vaccination at 12 months compared with nine months is considered to generate a stronger, longer-lasting immune response.\n\n\n\n\n\nIn Australia, children are routinely given the measles-mumps-rubella (MMR) vaccine at 12 months and the measles-mumps-rubella-varicella (MMRV, with “varicella” being chickenpox) vaccine at 18 months.\n\n\n\n\n\nBabies at higher risk of catching the disease can also be given an additional early dose. In Australia, this is recommended for infants as young as six months when there’s an outbreak or if they’re travelling overseas to a high-risk setting.\n\n\n\nA new study looking at measles antibodies in babies\n\nA recent review looked at measles antibody data from babies under nine months old living in low- and middle-income countries. The review combined the results from 20 studies, including more than 8,000 babies.\n\n\n\n\n\nThe researchers found that while 81 per cent of newborns had maternal antibodies to measles, only 30 per cent of babies aged four months had maternal antibodies.\n\n\n\n\n\nThis study suggests maternal antibodies to measles decline much earlier than previously thought. It raises the question of whether the first dose of measles vaccine is given too late to maximise infants’ protection, especially when there’s a lot of measles around.\n\n\n\nShould we bring the measles vaccine forward in Australia?\n\nAll of the data in this study comes from low- and middle-income countries, and might not reflect the situation in Australia where we have much higher vaccine coverage for measles, and very few cases.\n\n\n\n\n\nAustralia’s coverage for two doses of the MMR vaccine at age two is above 92 per cent.\n\n\n\n\n\nAlthough this is lower than the optimal 95 per cent, the overall risk of measles surging in Australia is relatively low.\n\n\n\nIn Australia, children are routinely given the MMR vaccine at 12 months and the MMRV vaccine at 18 months. Source: AP / Mary Conlon Nonetheless, there may be a case for broadening the age at which an early extra dose of the measles vaccine can be given to children at higher risk. In New Zealand, infants as young as four months can receive a measles vaccine before travelling to an endemic country.\n\n\n\n\n\nBut the current routine immunisation schedule in Australia is unlikely to change.\n\n\n\n\n\nAdding an extra dose to the schedule would be costly and logistically difficult. Lowering the age for the first dose may have some advantages in certain settings, and doesn’t pose any safety concerns, but further evidence would be required to support this change. In particular, research is needed to ensure it wouldn’t negatively affect the longer-term protection that vaccination offers from measles.\n\n\n\nMaking sure you’re protected\n\nIn the meantime, ensuring high levels of measles vaccine coverage with two doses is a global priority.\n\n\n\n\n\nPeople born after 1966 are recommended to have two doses of measles vaccine. This is because those born before the mid-1960s likely caught measles as children (when the vaccine was not yet available) and would therefore have natural immunity.\n\n\n\n\n\nIf you’re unsure about your vaccination status, you can check this through the Australian Immunisation Register. If you don’t have a documented record, ask your doctor for advice.\n\n\n\n\n\nCatch-up vaccination is available under the National Immunisation Program.\n\n\n\n\n\nMeru Sheel is an associate professor at Sydney School of Public Health, University of Sydney. She receives funding from the National Health and Medical Research Council and the Department of Foreign Affairs and Trade.\n\n\n\n\n\nAnita Heywood is an associate Professor at the School of Population Health at UNSW Sydney.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-9-june-2025/wq0bangws",
    "title": "SBS News in Easy English 9 June 2025",
    "publish_date": "Mon, 9 Jun 2025 04:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Camille Bianchi.\n\n\n\n+++\n\n\n\n830 Australians have been recognised as part of the King's Birthday Honours.\n\n\n\n\n\nFormer Prime Minister of Australia, Scott Morrison, is one of 14 people named as a Companion of the Order of Australia.\n\n\n\n\n\nThe title has been offered to every Prime Minister since 1975.\n\n\n\n\n\nMr Morrison says he is proud.\n\n\n\n\n\n\"I am very humbled by the recognition and thankful to the Australian people who gave me the opportunity to serve as Prime Minister during one of the most difficult periods in Australia's history. Everything from natural disasters to the COVID-19 pandemic, the recession it caused. The threats we faced in the Indo-Pacific and the assertions and coercions of China - and our response to that. But through all of that, the Australian people were absolutely amazing.\"\n\n\n\n+++\n\n\n\n\n\nA former federal politician who lost her seat at the recent election, says she wants to move into Tasmanian state parliament.\n\n\n\n\n\nLast week, Tasmanian premier Jeremy Rockliff lost his job, when other politicians voted against his leadership - and now there will be a sudden election.\n\n\n\n\n\nFormer Liberal M-P Bridget Archer wants to be chosen to represent a seat in the Bass electorate.\n\n\n\n\n\n\"I'm not going to be anybody's stooge or anybody's puppet.\"\n\n\n\n\n\n\"Bridget is a fighter. Bridget, understands the importance of being part of Team Tasmania.\"\n\n\n\n+++\n\n\n\n\n\nToday is SBS 50th birthday.\n\n\n\n\n\nThe national public broadcaster started in 1975 as an experiment to share information about a national health care program, to Australians from non-English speaking backgrounds.\n\n\n\n\n\nToday, SBS broadcasts in 63 languages.\n\n\n\n\n\nNITV began in 2012 - a channel made by, for and about Aboriginal and Torres Strait Islander people.\n\n\n\n\n\nManaging Director of SBS, James Taylor, says there is a lot to celebrate.\n\n\n\n\n\n\"We've got the highest volumes of multilingual content than ever before in our history. And in 60 languages. We're also being acknowledged across a number of other fronts. We've got the Australian streaming platform through SBS On Demand, and we are the podcaster of the year, three years in a row. These are all things to really be celebrated. We're a public good, we are in part funded by the public, and it's really important for us to be delivering more and more value each year to Australians.\"\n\n\n\n+++\n\n\n\n\n\nIn Tennis, defending champion Carlos Alcaraz has defeated Jannik Sinner in the French Open final.\n\n\n\n\n\nThis is his fifth Grand Slam trophy.\n\n\n\n\n\nAlcaraz said kind words about his rival, Sinner, who had wanted to win his third major tennis trophy.\n\n\n\n\n\n\"Honestly, I know how hard you're chasing this tournament or every tournament. I'm pretty sure you're going to be champion not once but many, many times. It's a privilege to share the court with you in every tournament, making history with you.\"\n\n\n\n+++\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-minister-diagnosed-with-cancer-trump-threatens-governor-s-arrest-australia-criticised-on-tobacco-wars-20250610-p5m64a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Monash IVF caught in second embryo transfer bungle; additional military sent to LA as protests intensify",
    "publish_date": "Tue, 10 Jun 2025 11:58:08 +1000",
    "category": "finance",
    "authors": [
      "Amber Schultz"
    ],
    "text": "A shadow minister has proposed making private school fees tax-deductible, saying she hopes to start new conversations following leader Sussan Ley’s pledge to stand for “lower, simpler, fairer taxes”.\n\nSpeaking on Melbourne’s 3AW radio this morning, South Australian senator Leah Blyth said the initiative would level out the playing field for parents.\n\n“Even the most elite private institutions do receive a significant amount of public funding every year, and the net effect for those parents is they’re contributing essentially twice because they’re not only paying school fees, but they’re also contributing to the public system through general taxation,” she said.\n\nLeah Blyth, escorted by Senator Alex Antic (left) and leader of the opposition in the Senate Michaelia Cash (right), was sworn into the Senate in February. Credit: Alex Ellinghausen\n\n“What we can look at doing is evening out that playing field, but also looking at how we are funding public schools. I think it’s fair to say education standards have been dropping, particularly in our public schools across our nation, for decades, and we’ve got to do something to make sure that we aren’t leaving any children behind, while also appreciating how different families choose to educate their children.”\n\nBlyth said her proposal was before the parliamentary budget office to be costed, and she said it also involved investing money saved into public schools to narrow the gap between them and private ones.\n\nBlyth also proposed an increase in “income splitting”. This involves a worker who earns more than their partner splitting off some of their income to their spouse, so that their income is lower, and they do not have to pay as much tax.\n\nBlyth entered the Senate in February and was appointed shadow assistant minister for stronger families and stronger communities in last month’s shadow cabinet reshuffle.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/sub-standard-tigers-feel-the-pain-but-one-loss-shouldn-t-overshadow-their-progress-20250608-p5m5rj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sub-standard Tigers feel the pain, but one loss shouldn’t overshadow their progress",
    "publish_date": "Tue, 10 Jun 2025 11:50:09 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "And don’t forget 196-centimetre interceptor Josh Gibcus, who has endured a horror injury run since an eye-catching debut season in 2022 – after being the No.9 pick – and is yet to appear this season. As a result of the departures, Richmond made seven top-30 selections in 2024, but also snared a probable top-four choice from the Kangaroos in this year’s edition, for the No.27 pick last year and their 2025 second-rounder. Richmond need to improve their midfield brigade around Tim Taranto and Jacob Hopper. Credit: Getty Images Something the Tigers need are more blue-chip midfielders to complement and eventually take over from Tim Taranto, 27, and Jacob Hopper, 28. They are set to pick two of the best few teenage talents in November, even with top-liners Zeke Uwland (Gold Coast) and Daniel Annable (Brisbane Lions) tied to northern academies.\n\nLoading Richmond recruiters will be ogling potential top-five selections Dyson Sharp, Willem Duursma – brother of Xavier, Zane and Yasmin – Sam Grlj and Oliver Greeves, while ruck-forward Cooper Duff-Tytler, a No.1 pick candidate, is another option. They have onballers Josh Smillie and Taj Hotton, both selected in the top 12 last year, waiting in the wings, too, so Blair Hartley and co. have identified their list building blocks. It makes you think of ex-Tigers coach Damien Hardwick’s bold statement on joining Gold Coast, where he said he believed he already had 80 per cent of the Suns’ inaugural premiership side. There is less evidence at Punt Road for Yze to make such a call about Richmond, but they should be pleased with the early signs.\n\nThe Tigers know key-position players take longer to develop and come with a higher bust risk than their midfield peers, but also how crucial they are, which was why they drafted so many, so early in this process. They are hopeful the next Alex Rance and Jack Riewoldt are lurking within this crop, while Richmond are planning for life after Toby Nankervis, with Samson Ryan, Mate Colina and Oliver Hayes-Brown jostling to be his ruck successor. Tiger Tom Brown has been one of the bright spots for Adem Yze’s team. Credit: Getty Images Beyond the wins, competitive defeats and first-year draftees, another positive is that some other emerging Tigers have put their hand up to suggest they could be meaningful parts of a successful future, too. Tom Brown, Seth Campbell, Sam Banks, Steely Green, James Trezise and Kane McAuliffe are chief among those – and that is as important as any other development.\n\nLoading Noah Balta, Jack Ross, Ben Miller, Rhyan Mansell and Thomson Dow headline a modest mid-20s group that needs to get stronger but offers a decent-enough plank for now between the kids and veterans. Speaking on Fox Footy, Riewoldt, like Yze, was concerned with Saturday’s effort, saying too many of these types of losses can be “soul-destroying”. The coach himself mentioned there would be pain along the journey, yet the underlying evidence is that Richmond are ahead of schedule. Frittering away chance Melbourne were looking more like the side many expected before their latest Alice Springs horror show against St Kilda, so it was not particularly surprising that they ran Collingwood close.\n\nThe problem for Simon Goodwin’s Demons is they started the season 0-5 and have a sub-90 percentage, so finals remain a longshot for a club that gave away its first-round pick this year to Essendon (a strategy that has consistently worked for them). Bayley Fritsch has kicked 207 goals in 100 games since the start of 2021, but he’s had a challenging season and even at his best was criticised – including by Matthew Lloyd – for being selfish at times. The aftermath of Bayley Fritsch’s ill-advised decision to play on near goal. Credit: AFL Photos Fritsch is back in form after being dropped ahead of round six, and kicked two of his three goals in the final quarter to give Melbourne a shot at upsetting the ladder-leading Pies. However, there was a brain-fade moment, with scores tied in the last term, when Fritsch marked 25 metres out, and instantly played on while not realising Isaac Quaynor was in front of him. That was bad enough without factoring in that teammate Tom Sparrow was on his own running towards the goal square.\n\nGoodwin probably takes the good with the bad from Fritsch, but it was certainly costly. What the 2021 premiership coach would be thrilled with was the Demons’ disciplined team job on Collingwood superstar Nick Daicos, from Ed Langdon to Clayton Oliver and Judd McVee. Langdon did the lion’s share of the lifting in a sacrificial role, but the overall willingness to stick at it was one of the most positive takeaways. Daicos finished with a modest 19 disposals, one goal and only four score involvements. Mission accomplished. All-Australian ruck race We are amid one of the most competitive races to be the starting ruckman in the All-Australian side.\n\nSelectors might need to consider picking two of seven-time All-Australian Max Gawn, Tristan Xerri and Tom De Koning, given how good they have been. Neither Xerri nor De Koning has ever made the final cut, although the Kangaroo made the extended squad last year. The last time two ruckmen made the team was in 2021, when Gawn (starting) and Nic Naitanui (bench) were selected. Xerri, De Koning and Gawn were excellent again in round 13, and offer different qualities. Tristan Xerri and Tom De Koning, pictured during their Good Friday battle, have built All-Australian ruck cases. Credit: Getty Images Xerri leads all ruckmen in clearances and hitouts-to-advantage; Gawn averages more marks, disposals and contested possessions than all his ruck peers; and the uber-athletic De Koning performs strongly in almost every relevant category. None of their teams are in the top eight, which continues an unhealthy narrative about ruckmen’s worth, but that should not take away from how great each of them has been.\n\nOf note is that Xerri towelled Gawn in round two, while De Koning received coaches’ votes against Xerri in round six (Xerri won the hitouts and was a tackling machine but De Koning kicked a goal and had more clearances in a big Carlton win). Gawn and De Koning are due to do battle in round 19. Jack Silvagni shut down in-form Bomber Nate Caddy to be one of Carlton’s best players. Credit: AFL Photos Where do Blues fit? Carlton’s unconvincing victory over Essendon on Sunday night provided little evidence that they have turned the corner and are set to challenge for a finals berth. Coach Michael Voss performed his best spin-doctor impression after their 38-point first-half lead disintegrated to only six with almost four-and-a-half minutes left, against a Bombers side missing Mason Redman, Sam Draper, Nick Bryan, Kyle Langford, Ben McKay, Zach Reid and Jordan Ridley.\n\nVoss said they addressed their constant second-half fadeouts during the bye a week earlier and that the worrying trend would not be instantly solved. Loading “It’s a good problem to have, if you’re in front by that much, and you’re getting that many opportunities,” he said. “The harder one to solve is you’re behind all the time, you get no opportunities, and you’re trying to win your game from a completely negative base.” The Blues could take heart from Jack Silvagni’s job on Nate Caddy in his first game back, Zac Williams’ reintegration as a forward, and tagger Alex Cincotta’s effort on Zach Merrett. First-gamer Hudson O’Keeffe also showed promise. Voss revealed afterwards that the 202-centimetre ruckman made significant strides as a forward in the past month to earn his shot.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/music/fan-storms-stage-and-puts-arm-around-katy-perry-during-sydney-concert-20250610-p5m654.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Serial TikTok prankster storms stage and puts arm around Katy Perry during Sydney concert",
    "publish_date": "Tue, 10 Jun 2025 11:47:02 +1000",
    "category": "entertainment",
    "authors": [
      "Thomas Mitchell"
    ],
    "text": "Katy Perry’s Monday night concert in Sydney took a serious turn when the touring US superstar was rushed on stage by a serial prankster Johnson Wen, who managed to put an arm around the singer before eventually being grabbed by security.\n\nA fan puts an arm around Katy Perry during Monday’s concert in Sydney. Credit: Screenshot\n\nPerry, who is in Australia performing as part of her Lifetimes tour, was onstage at Sydney’s Qudos Bank Arena when the security breach happened midway through the show.\n\nWen is a serial prankster who goes by the username Pyjama Man on TikTok, where he regularly shares videos of himself being a public nuisance, invading stages during concerts or running onto sporting pitches.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/monash-ivf-admits-another-embryo-mix-up-20250610-p5m68q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Monash IVF admits another embryo mix-up",
    "publish_date": "Tue, 10 Jun 2025 11:46:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Monash IVF admits another embryo mix-up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Alan Moir",
    "publish_date": "Tue, 10 Jun 2025 11:43:40 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Alan Moir\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-cathy-wilcox-20230608-p5df54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Cathy Wilcox",
    "publish_date": "Tue, 10 Jun 2025 11:42:14 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Cathy Wilcox\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/the-ghost-of-holger-osieck-is-the-only-thing-that-can-stop-the-socceroos-20250609-p5m5w0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ghost of Holger Osieck is the only thing that can stop the Socceroos",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The Socceroos were a bit on the nose with the public. Osieck had allowed the ageing “Golden Generation” to hang on for too long, and his style of football was hardly inspiring. Later that year, in their wisdom, Football Federation Australia scheduled back-to-back friendlies, both away, against Brazil and France. Rare chances for them to measure up against true global yardsticks.\n\nIt was 2013, and Australia had just sealed a spot at the World Cup in Brazil. Josh Kennedy was the saviour, thanks to his iconic late header against Iraq in front of 80,000 people in Sydney. But there was no saving the unpopular Holger Osieck, who was sacked three months later, despite delivering Australia’s third successive qualification.\n\nCritics accused the Socceroos of making the Australian game look like a “joke” on the world stage with their “spineless” performances, and several players of outstaying their welcome in the team. As soon as he returned to the team hotel after game two in Paris, Osieck was dismissed, and moves were immediately afoot to get the federation’s No.1 coaching target, Ange Postecoglou, out of his contract at Melbourne Victory, thus setting in train a series of events that would soon lead to Postecoglou taking over and regenerating the squad, Mark Schwarzer’s retirement, and the handing over of the gloves to Ryan, who will win his 100th cap on Wednesday morning (AEST) by hopefully contributing to what would be one of the best moments of his career.\n\nFor that not to happen, the Socceroos would need to turn in a stinker the likes of which they have not had in 12 years. Not since that day in Paris. Or that other day in Brasília. That is how bad they would have to be to miss out on the 2026 World Cup from here. That is how long ago they last lost by five goals or more.\n\nA lifetime ago: Lucas Neill and Holger Osieck in 2013. Credit: Penny Stephens\n\nThat is the sort of heist Saudi Arabia has to pull off in Jeddah.\n\nIt is an unfathomable thought on multiple levels. So far in this qualifying phase, the Saudis have scored only six goals in nine games – so to do it, they’d essentially need to reproduce that whole output in one match. Only twice before have the Socceroos ever lost a competitive match (not friendlies) by 5-0 or worse, and not since 1997.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/one-of-the-greatest-shots-i-ve-ever-seen-phil-mickelson-can-still-make-a-golf-ball-talk-20250610-p5m658.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘One of the greatest shots I’ve ever seen’: Phil Mickelson can still make a golf ball talk",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Gene Wang"
    ],
    "text": "“So that was one of my better ones,” said Mickelson, who added a birdie at No. 18 for a 6-under 65 and a 54-hole total of 13-under 200, two shots off the pace. “Even I was a bit surprised.”\n\nMickelson’s birdie from the bunker at No. 17 with his back to the flagstick overshadowed Joaquín Niemann outlasting a charge from a group of major champions to win the event in Gainesville, Virginia. Even as Niemann celebrated onstage, the chatter from patrons around the property remained squarely on Mickelson’s wizardry.\n\nThe six-time major championship winner, who will turn 55 next week, treated a disbelieving gallery to perhaps the most improbable shot of his career - which is saying something for one of the most creative players in history - during Sunday’s weather-delayed final round of LIV Golf Virginia at Robert Trent Jones Golf Club.\n\nThe moment unfolded after Mickelson landed his approach at the par-4 17th in a bunker guarding the left front of the green. Facing an uphill lie, Mickelson glanced at the target, addressed the ball for the last time with his right side pointed at the green and proceeded into his backswing gripping his sand wedge.\n\nAt contact, the ball sailed high and travelled practically behind Mickelson’s head, landing within two feet of the pin and trickling into the cup, triggering a wild celebration from his legion of fans who had endured miserable conditions to track Mickelson’s round to completion.\n\nPhil Mickelson during a LIV tournament. Credit: AP\n\n“Man, he created some Phil magic there,” said Bryson DeChambeau, playing in the threesome with Mickelson and finishing tied for fourth at 13 under. “You could just see his wheels turning, and then he hit the shot, and I got the perfect angle of it. … I go, ‘Oh my gosh, he’s going to make it,’ and it went in the hole, and I was like, ‘That’s got to be one of the greatest shots I’ve ever seen in my entire life.’ ”\n\nThe dazzling shot was the highlight of LIV Golf’s second stop in three years in the shadow of the nation’s capital, where the tour’s future has been oft debated. In February, Tiger Woods joined PGA Tour Commissioner Jay Monahan and player director Adam Scott in a White House meeting with President Donald Trump and Yasir Al-Rumayyan, governor of the Saudi Public Investment Fund that bankrolls LIV Golf, for negotiations to reunify the fractured sport.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/how-steve-waugh-s-sledge-fired-south-africa-to-lord-s-finale-20250610-p5m65f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Steve Waugh’s sledge fired South Africa to Lord’s finale",
    "publish_date": "Tue, 10 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "It wasn’t the first time Steve Waugh had reached into his bag of mental disintegrators to upset South Africa, but when Waugh accused the Proteas of not caring about the future of Test cricket in January last year, South African great Graeme Smith was unimpressed.\n\nFormer South Africa captain Smith has hit back at Waugh on the eve of the World Test Championship final, in which Australia will tackle the Proteas at Lord’s from Wednesday.\n\nWaugh was famed for goading South Africa with words to the effect of “you’ve just dropped the World Cup” when Herschelle Gibbs spilled a chance against him at the 1999 tournament, which Australia went on to win.\n\nSmith was taken aback that Waugh did not contact him to understand the reasons for the Proteas fielding what amounted to a third XI to tour New Zealand, which clashed with the privately-owned SAT20 League, before making his comments.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/iranian-superstar-unleashes-joyful-frenzy-20250610-p5m66i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Iranian superstar unleashes joyful frenzy",
    "publish_date": "Tue, 10 Jun 2025 11:19:50 +1000",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "From Harbour to Harbour 2 is the second incarnation of a project in which Sharifian’s band, Lian, is joined by didgeridoo virtuoso William Barton and his mother, singer Aunty Delmae Barton. The concept, however, was better than the execution, as where I was sitting the bottom-end sound was sludgy, and the didgeridoo’s nuances were largely lost.\n\nMohsen Sharifian’s folkloric music comes from the southern Iranian coast on the Persian Gulf, and for the local Iranian community Sharifian has the star power of Elvis, Michael Jackson and Taylor Swift rolled into one. He has done what Goran Bregovic did for Balkan music: locate it within the universal dance beat of a thumping bass drum – here an electronic wallop triggered by Morteza Palizdan’s foot – and take it to the world.\n\nI had a little glimpse of what it would be like to be a god. From my box in Chatswood’s Concert Hall, high above the front edge of the stage, I gazed down on a seething mass of humanity in what was effectively a mosh-pit, only with seating getting the way. The excitement of these people was as explosive as the music.\n\nBarton and Aunty Delmae only topped and tailed a generous show that started 35 minutes late, while we, in a new low for concert presentation, watched ads on a big screen. The rest embodied the instant party that’s a Lian performance, with people dancing from the moment the band launched into the raucous Eshkeleh, and only stopping when Sharifian addressed us.\n\nHe’s a virtuoso player of the ney-anban, an Iranian bagpipe with a sound that’s shriller and even more transfixing than the Celtic version. His band also contains a second ney-anban player, his daughter Liana, whose main solo incorporated a dissonance that sliced through one like shards of glass, and whose instrument was adorned with a string of pom-poms, so when she twirled while playing, these gracefully arced around her.\n\nFrom the moment the band’s formidable density – having three hand-drummers, an oud player and an electric bassist – fully kicked in, you understood why such a piercing instrument is demanded. Sharifian also sings, although the primary vocalist was the impressive Aka Safavi, who also had to scale this wall of sound, and did so more as a seasoned professional than as the natural charismatic that is Sharifian. The lyrics, meanwhile, sometimes drew on Omar Khayyam’s poetry.\n\nMore than anything this concert was the sound of joy: a joy that engulfed a room more used to hosting polite applause with rumps firmly glued to seats. Intermittently the mood could change to the pensive beauty of Reza Kashi’s oud, but that pounding ersatz bass drum, intent on stoving in one’s ribcage, was not to be denied, and soon enough we were back in a musical frenzy, with the ecstatic response it engendered. It was just a shame the sound was so muddy.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-police-hunt-accused-geraldton-roadside-sex-predators-20250609-p5m621.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Police hunt accused Geraldton roadside sex predators; Sewage leaks into Swan",
    "publish_date": "Tue, 10 Jun 2025 11:19:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "Opposition water spokesman Peter Rundle says it’s “completely unacceptable” raw sewage has contaminated “one of our most iconic natural assets” the Swan, as well as suburban streets, and called on the government to address what labels its failure to invest in critical infrastructure.\n\n“It’s a serious public health and environmental risk that’s left families and communities exposed to human waste,” he said.\n\n“While Labor boasts about record surpluses, we’re seeing basic infrastructure collapsing, it begs the question: where is the money for essential water services going?”\n\nHe said Water Corporation handed over more than $500 million in dividends to the state which spent them elsewhere, not on maintaining and upgrading infrastructure.\n\nHe called on Water Minister Don Punch to explain how this happened, and how Labor justified “taking half a billion dollars out of Water Corporation” while critical systems were “falling apart”.\n\nPremier Roger Cook will be holding a press conference later this morning, where we will be putting these questions to him and reporting back.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/victoria/monash-ivf-caught-in-second-embryo-transfer-bungle-20250610-p5m66h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Monash IVF caught in second embryo transfer bungle",
    "publish_date": "Tue, 10 Jun 2025 11:09:25 +1000",
    "category": "finance",
    "authors": [
      "Grant Mcarthur"
    ],
    "text": "Monash IVF has transferred the wrong embryo into a Melbourne woman, the second such incident admitted by the fertility giant in two months.\n\nIn a statement to the ASX on Tuesday, Monash IVF revealed it had mistakenly transferred a patient’s own embryo to her during a process in which she was supposed to receive an embryo from her partner as they sought to extend their family.\n\nIt is the second Monash IVF bungle admitted this year. Credit: Istock\n\nThe Melbourne bungle comes just two months after Monash IVF was forced to admit an embryo mix-up at its Brisbane clinic resulted in a Queensland woman giving birth to a stranger’s baby.\n\nWhile the Brisbane bungle occurred at least a year earlier, it was only discovered when the woman’s embryos were being relocated to another clinic.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://au.news.yahoo.com/aussies-at-risk-as-dangerous-road-problem-reaches-record-breaking-levels-073751731.html",
    "title": "Aussies at 'risk' as dangerous road problem reaches record-breaking levels",
    "publish_date": "2025-06-09T07:37:51Z",
    "category": "finance",
    "authors": [],
    "text": "It's going to take 'all three tiers' of government to see an improvement in road conditions.\n\nReports of issues on roads by cyclists have tripled since 2022. Source: Supplied\n\nAussie road users are growing increasingly fed up with the deteriorating state of the tarmac across the country. New data reveals reports of sub-par roads and bike paths have tripled in the past three years, with \"no signs of slowing down\".\n\nWhile the number of reports correlates with an uptick in Aussies opting to travel on their bikes, the state of roads poses an \"increasing risk\" to the wellbeing of cyclists, according to Danny Gorog, CEO of council reporting app Snap Send Solve.\n\nCycling advocacy group Bicycle NSW's CEO Peter McLean has called on authorities to pay attention to the complaints, telling Yahoo it's critically important \"all three tiers\" of government acknowledge that there are more cyclists than ever on the roads.\n\n\"We need to evolve and react to managing our assets and infrastructure more appropriately,\" he said. \"People want better, more consistent infrastructure, and where they're not seeing it, they are reporting it,\" he said.\n\nThere have been thousands of reports of dodgy roads in the past year alone. Source: Supplied\n\nCycling has seen a 'massive uptake' in last five years\n\nSince 2020, cycling has seen a \"massive uptake\", according to McLean. Now, over five million Australians are riding a bike every week, particularly with the advent of e-bikes.\n\nADVERTISEMENT\n\nWith that, has come a rise in complaints on the state of infrastructure meant to serve cyclists. Last year, there was a \"record-breaking\" 5,235 reports of issues in bike paths including crumbling tarmac, regular debris in the way, as well as overgrown nature strips across the country, according to Snap Send Solve data.\n\n2025 looks like it's going to be even worse with 3,153 reports already recorded between January and May this year.\n\n\"This rapid growth strongly suggests that conditions on the ground are deteriorating year over year,\" Gorog told Yahoo News Australia.\n\nWhile the Snap Send Solve app itself is increasing in popularity among responsible citizens, he believes the rise in complaints is \"unlikely\" to be explained simply by reporting behaviour alone.\n\n\"It signals worsening infrastructure conditions, poor repairs, ageing bike lanes, and potentially inadequate maintenance cycles,\" he said.\n\nADVERTISEMENT\n\nHe warns the current pace of deterioration could \"undermine broader mobility goals and pose increasing risks to cyclists.\" Gorog hopes the insights will guide smarter investments and ongoing upgrades from authorities.\n\nBig threats impacting cyclists on Aussie roads\n\nIt's not just the quality of the roads putting cyclists at risk, but also fellow road users like car drivers. A disproportionate amount of crashes involve cyclists on Australian roads despite them being a small percentage of overall road users.\n\nLast year, cyclist deaths jumped from 34 in 2023 to 38 in 2024, an 11.8% increase, with motor vehicles involved in the majority of crashes.\n\nADVERTISEMENT\n\nFootage shared earlier this year shows a scary near-miss between a driver and a cyclist in the Melbourne suburb of Brunswick.\n\nCyclist Rory Meister told Yahoo News he thought it was \"absurd\" the driver didn't see him despite having flashing lights on his bike. He said incidents with drivers are alarmingly frequent.\n\nMcLean previously told Yahoo education and awareness are the first port of call for improving safety for cyclists. \"Fundamentally, we need better awareness at an early stage of when people are getting their licenses,\" he said.\n\n\"There's lots of great drivers out there and we just need to equalise everyone on the road.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  }
]