[
    {
        "url": "https://www.9news.com.au/national/sydney-heatwave-continues/0bf5a5ed-78de-41ea-9d04-12a9b6d9a667",
        "title": "Sydney's first heatwave this summer has authorities on high alert",
        "publish_date": "Sat, 06 Dec 2025 00:53:48 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "There are fears that up to four homes have been lost in a\n\nbushfire\n\nthat began on Thursday on NSW's Mid North Coast in Bulahdelah.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/netflix-to-acquire-warner-bros-studio-and-streaming-business-for-72-billion/a195b128-e099-4ec5-94df-0a34cf91546d",
        "title": "Netflix to acquire Warner Bros studio and streaming business for $72 billion",
        "publish_date": "Fri, 05 Dec 2025 13:40:56 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Netflix has struck a deal with Warner Bros Discovery to buy the legacy Hollywood giant's studio and streaming business for $US72 billion ($108 billion).\n\nThe acquisition, announced overnight, would bring two of the industry's biggest players in film and TV under one roof. Beyond its namesake television and motion picture division, Warner owns HBO Max and DC Studios. And Netflix has risen to dominance as a household name ubiquitous to on-demand content, while building its own production arm to release popular titles like Stranger Things and Squid Game .\n\nThe cash and stock deal is valued at $US27.75 per Warner share, giving it a total enterprise value of approximately $US82.7 billion ($124.55 billion). The transaction is expected to close after Warner separates its Discovery Global cable operations into a new publicly-traded company in the third quarter of 2026.\n\nThis image released by Warner Bros Pictures shows Leonardo DiCaprio in a scene from One Battle After Another. (AP)\n\nShares of Warner Bros rose nearly 3 per cent in premarket trading while shares of Netflix and Paramount fell more than 2 per cent.\n\nGaining Warner's legacy studios would mark a notable shift for Netflix's current movie theatre footprint. Under the proposed acquisition Netflix has promised to continue theatrical releases for Warner's studio films — honouring Warner's contractual agreements for movie releases.\n\nNetflix has kept most of its original content within its core online platform. But there have been a few exceptions, such as limited theatre screenings of a KPop Demon Hunters sing-a-long and its coming Stranger Things series finale.\n\nAs recently as October — when Warner signalled that it was open to a potential sale of its business — Netflix co-CEO Ted Sarandos reiterated on an earnings call that the company had been \"very clear in the past that we have no interest in owning legacy media networks\" and that there was \"no change there\".\n\n\"We believe that we can be and we will be choosy,\" Sarandos said at the time, without fully ruling out a potential bid for Warner.\n\nREAD MORE: Tributes to woman killed by her own dog in South Australian home ﻿\n\nNetflix has struck a deal with Warner Bros Discovery to buy the legacy Hollywood giant's studio and streaming business for $US72 billion ($108 billion). (AP)\n\nFriday's announcement arrives after a monthslong bidding war for Warner Bros Discovery. Rumours of interest from Netflix, as well as NBC owner Comcast, started bubbling up in the northern hemisphere autumn. But Skydance-owned Paramount, which completed its own $US8 billion merger in August, had also reportedly made several all-cash offers backed heavily by CEO David Ellison's family.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-music-festival-cancellations-exclusive-poll-insights/d413b6db-52cb-446e-9438-35a4be3b68e1",
        "title": "Music festivals keep getting canned. Nearly half of Aussies say this could fix it",
        "publish_date": "Fri, 05 Dec 2025 01:36:13 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: Thousands of Australians have been directly affected by the slew of music festival cancellations over the last 12 months, including Park Waves festival this week.\n\nNow they're calling for more government investment in the scene, according to a nine.com.au reader poll.\n\nMore than 40 per cent of﻿ the ﻿434 readers surveyed agreed that federal and state governments should invest in Australia's live music industry to support festivals and prevent more cancellations in 2026.\n\n\"The government should support music the same way they support international sports such as tennis, golf and soccer,\" one told 9news.com.au.﻿\n\nA further 39 per cent of readers confessed to being at least 'somewhat concerned' about the future of Australian music festivals in light of recent events.\n\nPark Waves festival, scheduled for February 2026, was cancelled on Tuesday due to challenges including economic issues.\n\n\"Ultimately, the numbers no longer stack up,\" organisers said in a statement.\n\nChanging Tides 2025 was canned, and Groovin' The Moo cancelled its 2024 shows and didn't return in 2025.\n\nFalls Festival and Splendour in the Grass gave 2025 a miss as well.\n\nLong-running festival Splendour in the Grass did not return in 2025. (Mark Metcalfe/Stringer/Getty)\n\nMoney is the biggest issue for most Australian music festivals, according to two Creative Australia reports on the sector.\n\nRising operational costs, a lack of available funding and grants, and insurance costs have made it challenging for organisers to finance festivals.\n\nAustralians' ticket buying habits have also changed, creating uncertainty for organisers.\n\nFestival goers ages 18 to 24 are purchasing tickets at lower rates﻿ than pre-pandemic.\n\nPatterns of later ticket buying are also continuing, creating additional costs and risks some organisers simply can't keep up with.\n\nG﻿roovin' the Moo cancelled its 2024 shows and didn't return in 2025. (Instagram/Groovin the Moo)\n\nBut when organisers have to jack up ticket prices to cope with ﻿rising operational costs, it prices some Aussies out altogether.\n\n\"Music festival tickets are too expensive,\" one reader said.\n\nAnother added that it's not surprising that Aussies can't afford them when many struggle to afford groceries and rent.\n\nA combined 61 per cent of nine.com.au readers said they were ﻿'not very concerned' or 'not concerned at all' about festival cancellations.\n\nBut only 30 per cent were opposed to government investment in Australia's live music industry to support festivals.\n\nOne reader said events like festivals need to be self-sustainable, rather than relying on government support.\n\nAbout 28 per cent of readers were on the fence about government investment.\n\n\"I don't go to music festivals but some could bring more tourism to the country so perhaps the government should invest in some,\" one said.\n\nOthers were concerned about how it could affect taxpayers.﻿\n\n\"Festivals should be supported by the music labels to support our music industry, not be taxpayer-funded,\" said one.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/private-health-people-paying-more-getting-less-ama-says/680984f6-3ec4-47dd-9c81-41093623322e",
        "title": "Aussies paying more for private health insurance and getting less",
        "publish_date": "Thu, 04 Dec 2025 22:59:09 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Australians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says.\n\nThe Australian Medical Association has released its latest Private Health Insurance Report Card, which found that consumers were abandoning gold-tier policies and questioning the value of other policies, while insurer profits piled up ever higher.\n\nThe AMA said the sector was in urgent need of reform, and President Dr Danielle McMullen renewed the call to establish an independent private health authority to drive that process.\n\nPeople are paying more for private health insurance and receiving less, a new report says. (Getty)\n\n\"Australia's health system is valued for its mix of public and private healthcare, but both parts of the system are under increasing pressure,\" McMullen said.\n\n\"Public hospitals are struggling with a severe logjam crisis, which is pushing more patients towards the private sector.\n\n\"However, runaway insurance premiums, low value offerings and shady tactics like product phoenixing leave customers facing tough choices about the level of cover they can afford.\"\n\nCost of living pressures are seeing people drop gold-tier policies. (Nine)\n\nAustralians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says. (Getty)\n\nThe report card showed that every year since 2008, the growth of private health insurance premiums has outstripped inflation, health sector inflation, average weekly earnings and the indexation of the Medicare Benefits Schedule (MBS).\n\nBetween 2008 and 2024, premiums climbed more than 100 per cent, while MBS indexation – which was frozen for several years from 2013 – increased by less than 20 per cent.\n\nThe report card also shows that over the six years to June 2025, insurers increased benefits paid for in-hospital medical treatment by only 18.1 per cent, while sector profits grew by nearly 50 per cent over the same period.\n\nREAD MORE: Manhunt for prisoner who escaped from police at hospital ﻿\n\nIn 2024-2025, insurers returned 84.2 per cent of premiums to consumers as benefits, below the 2019 level of 88 per cent.\n\nThe AMA is calling on the federal government to mandate a 90 per cent return minimum for insurers.\n\n\"Of course, private health insurers must make a surplus to be sustainable, but it is clear they are holding out on Australians while recording significant profits each year,\" McMullen said.\n\nThe AMA is calling for major reform. (Getty Images/iStockphoto)\n\n\"These insurers have ample capacity to increase the benefits paid to patients.\"\n\nThe report also found gold-tier policies are in decline as consumers face rising premiums and cost-of-living pressures.\n\nSince the start of the COVID-19 pandemic in March 2020, the number of gold-tier policies have dropped by 360,000, despite the overall number of policies growing.\n\n\"These trends show that private health insurance is becoming less affordable for many Australians – and we are already seeing the drastic effects of this, with at least 14 private maternity units closing over the past five years,\" McMullen said.\n\n\"The need for a Private Health System Authority to better regulate the sector and drive long-term reform has never been more crucial. There are too many bodies involved in the regulation of private health – a single, independent authority would provide a unified and coherent approach.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/princess-kate-celebrates-community-work-at-christmas-servive/106110208",
        "title": "Princess Kate celebrates community work at Christmas service",
        "publish_date": "Sat, 06 Dec 2025 01:21:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Prince and Princess of Wales have hosted an annual Christmas concert at Westminister Abbey in London to celebrate community work.\n\nThe royal family say the event, which Princess Catherine launched five years ago, offers them a chance to thank people across Britain for volunteering, raising funds for charity and supporting the vulnerable.\n\nThe service was held at Westminster Abbey. (Reuters: Aaron Chown)\n\nCatherine, 43, last year completed a course of preventative chemotherapy to address an unspecified form of cancer.\n\nShe gave each guest a note highlighting how a \"moment of listening\" and \"word of comfort\" can make a difference to people's lives.\n\nThis is the fifth time the princess has held the service. (Reuters: Aaron Chown)\n\nShe and Prince William were pictured arriving at the service with their three children, George, 12, Charlotte, 10, and Louis, 7.\n\nWilliam was due to deliver a reading before 1,600 guests, along with actors Kate Winslet, Chiwetel Ejiofor and Joe Locke, as well as actor and comedian Babatunde Aléshé.\n\nThe royal family attended the service alongside 1,600 other guests. (Reuters: Chris Jackson)\n\n\"At a time when life can sometimes feel fragmented or uncertain, the Christmas season invites us to remember the power of reaching out to one another with generosity of heart, understanding and hope,\" Catherine wrote in her note.\n\nThe service was aimed at people of all faiths and those without faith, her Kensington Palace office said.\n\nWestminster Abbey's choir was due to sing traditional Christmas carols, alongside performances of more contemporary music by Katie Melua.\n\nThe 'Together at Christmas' service will be broadcast on Britain's ITV television on Christmas Eve. (Reuters: Chris Jackson)\n\nThe \"Together at Christmas\" service will be broadcast on Britain's ITV television on Christmas Eve, while 15 community carol services supported by the couple's Royal Foundation charitable arm will be held across Britain during December.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/interest-rates-2026/106106712",
        "title": "After latest one-two punch, Australians will feel the pain in 2026",
        "publish_date": "Sat, 06 Dec 2025 01:20:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "An interest rate hike on Tuesday is a practical impossibility.\n\nBut if a growing number of forecasters are proved correct, it's a moot point, because one or more are on the way.\n\nThe reason is that Australia's inflation problem has not gone away and, by some measurements, is worsening.\n\nTwo official economic reports this week — the national accounts and the monthly household spending indicator — highlighted the key problem facing policymakers: too much money is chasing too few goods.\n\nUp to now, nobody's figured out how to solve this problem.\n\nUntil it's solved, millions of mortgage borrowers will continue to pay the price.\n\nA story RBA may not want to hear\n\nInflation fighters copped a one-two punch this week and both hits stung.\n\nThe national accounts for the September quarter, released by the Australian Bureau of Statistics (ABS), showed the economy on a reasonably solid footing.\n\nAustralia's gross domestic product grew by 0.4 per cent in the September quarter, following growth of 0.7 per cent in the June quarter.\n\nGDP's sting in the tail Australia's latest economic growth numbers show an economy in generally rude health, but that might result in a rude shock for mortgage borrowers earlier rather than later in 2026.\n\nEssential household spending was up 1 per cent, driven by payments for banking and superannuation services, electricity and health.\n\nPublic investment grew by 3 per cent in the September quarter, rebounding from a 3.5 per cent fall in the June quarter.\n\nA day later, the second punch came.\n\nThe ABS media release headline seemingly toying with the Reserve Bank: \"Strong growth in goods lifts household spending\".\n\n\"Discretionary spending surged this month led by goods as promotional events saw households spend more on clothing, footwear, furnishings and electronics following months of weaker spending in these categories,\" ABS head of business statistics Tom Lay said.\n\nMillions of Australians clearly have money to spend.\n\nWhere from, you ask? Higher wages and investments income.\n\n\"The strong rise in gross disposable income was driven by COE [Compensation of Employees],\" the ABS noted.\n\n\" Superannuation investment income also contributed to the rise, reflecting a strong performance in the domestic share market. \"\n\nThe upshot of all this for the Reserve Bank is that there may be too much demand in the economy.\n\nAustralians are going shopping with the extra money in their pockets. (Pexels: Ron Lach)\n\nAn economy overwhelmed breeds inflation\n\nWhen it rains too much, dams overflow.\n\nWhen demand exceeds the capacity of an economy to meet it with supply, inflation rises.\n\nIndependent economist Chris Richardson has the hard numbers — extracted from the national accounts — to back this up.\n\nHe points out that although national production, or overall supply, lifted 2.1 per cent in the three months to September, demand rose 2.6 per cent.\n\n\"Worse still,\" he adds, \"that 2.6 per cent was probably 2.8 per cent\" because the ABS just announced it had to guess the speed of the rise in illegal tobacco.\n\n\"So, although our growth rate is disappointing, it is probably in line with what we're set to achieve over the longer term,\" he said.\n\nIt means \"our dollar desires are pressing on the accelerator even though the clapped-out engine of the Australian economy is doing the best it can\".\n\n\"That gap — too much money chasing too little stuff — is part of why price pressures are lingering,\" he said.\n\nThe solution? Productivity\n\nThe solution is to raise productivity, but it's happening at a snail's pace.\n\nQuarterly growth in productivity has been oscillating between -0.5 per cent and 0.4 per cent for about 18 months.\n\nIn the three months to September this year it was 0.2 per cent.\n\nThe annual pace of productivity, however, lifted to slightly above the assumed rate of productivity the Reserve Bank uses in its forecasts.\n\nLoading...\n\nBut, given the pace of demand appears to be increasing on the back of higher wages and investment incomes, productivity will also likely need to lift.\n\nOne positive development taken from the national accounts is the notable investment in data centres by business.\n\n\"This is likely due to firms looking to support growth in artificial intelligence and cloud computing capabilities,\" ABS head of National Account Grace Kim said.\n\nThis is a tangible example of a type of economic expansion.\n\nAnd the ABS also noted real unit labour costs were -0.1 per cent in September quarter, which means each worker is now, on average, costing — a slightly more productive firm — less.\n\nThis reduces the pressure on business to pass costs onto customers.\n\nMultiple rate hikes could be coming\n\nBut there is an inescapable fact: the economy, though only growing modestly, is buckling under the pressure.\n\nIt means demand needs to fall.\n\nYou could crash the property and stock markets, but few would agree to that.\n\nAnd you can forget further hurting young renters by footing a higher cost of living.\n\nThat, rightly or wrongly, leaves mortgage borrowers to foot the bill for the productivity shortfall.\n\nAnd they're now staring down the barrel of not just one, but potentially several interest rate hikes in 2026.\n\nThe state of the economy leaves RBA Governor Michele Bullock and her board with a narrow path forward. (ABC News: John Gunn)\n\n\"In our assessment, the detail of the data showed a much healthier consumer, hot housing market and elevated unit labour costs,\" investment firm Barrenjoey wrote in a note.\n\n\" We continue to expect rate hikes in May and August 2026. \"\n\nInternational bank HSBC is also onboard the multi-hike train.\n\n\"Growth is on an upswing, and, in our view, the economy is already operating at, or beyond, its 'speed limit',\" chief economist Paul Bloxham wrote.\n\nRate hike could be here within months Hotter-than-expected inflation figures have caught many off guard and open the door for an RBA interest rate hike in 2026.\n\n\"We retain our view that the easing phase is done and shift our own central case to pencilling in hikes to begin from Q3 2026 (from Q1 2027 previously).\"\n\nNote the plural \"hikes\" used by Bloxham.\n\nHSBC is also flirting with the idea of factoring in an RBA interest rate hike even sooner in the New Year, perhaps as early as February.\n\nMarket meltdown\n\nWhat's also noteworthy is most, if not all, economists have placed a caveat on their interest rate hike predictions, warning of, as Paul Bloxham phrases it, \"a negative global shock\".\n\nNext week, the Federal Reserve meets and hundreds of billions of dollars' worth of investment funds are betting on an interest rate cut.\n\nYou wouldn't want to be caught wrong-footed during next week's press conference.\n\nAt the same time Japanese interest rates are becoming more attractive by the hour to offshore investors — perhaps those without nerves of steel betting on American exceptionalism.\n\nThe economic year could be set to finish off with a bang.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/adelaide-residents-in-the-dark-over-gilbert-street-development-p/106108752",
        "title": "Adelaide residents 'in the dark' over Gilbert Street development proposal",
        "publish_date": "Sat, 06 Dec 2025 00:26:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in Adelaide's CBD say planning laws have left them \"in the dark\" over a proposal to build a five-storey building, complete with a car stacker, that will overlook a childcare centre and an eco-living community.\n\nThey were first notified about the development proposal for 108 Gilbert Street in early 2024 through a leaflet drop from Adelaide City Council.\n\nThe Council Assessment Panel then received about 10 objections, and three people brought their concerns to its April 2024 meeting before the proposal was rejected.\n\nThe plan to boost Adelaide's CBD to 50,000 residents The Lord Mayor wants to nearly double the population of the CBD and North Adelaide by 2036.\n\nAbout 12 months later, residents \"informally\" found out that an appeal had been made via the Environment, Resources and Development Court (ERDC).\n\nA compulsory conference had been held behind closed doors, and planning permission for a compromised proposal later granted by the CAP.\n\n\"While the appellant, the developer, was allowed to submit a new proposal, the interested public were not informed of the court proceedings or directly informed of the judicial outcome,\" said Gilbert Street resident Peter Brady.\n\n\"It makes a mockery of the democratic court process.\"\n\nThree storey-townhouses exist on the other side of Considine Place. (ABC Radio Adelaide: Malcolm Sutton)\n\nThe ERDC Act states that proceedings before the court must be heard in public.\n\nBut it also states that the court, where it considers reasons to be \"sufficient\", can give directions to exclude any person from a hearing, or require that that it be held in private, or prohibit or restrict the publication of evidence — or contents of any document — given to the court.\n\n\"Unless I am missing something, the whole system is at odds with itself. It appears to be a closed court while insisting in its documentation that it is truly open,\" Mr Brady said.\n\n\" You're in the dark. \"\n\nDeputy Lord Mayor Keiran Snape, who spoke to the ABC in his capacity as an independent candidate for Adelaide for next year's state election, is a former member of the CAP.\n\n\"Often the developers are unsuccessful that first time around, effectively told the reason why, and then they can go back and tweak those particular reasons and re-lodge — often without having to disclose to residents,\" he said.\n\n\"[This] is a difficult example of what happens.\"\n\nA City of Adelaide spokesperson said it had expressed concern regarding \"a reduction in third party appeal rights\" following the state government's planning reforms in 2021.\n\n\"Council provided this feedback as part of its submission into the Planning System Implementation Review in January 2023,\" he said.\n\nAbutting Christie Walk\n\nThe original proposal involved demolishing an existing building at the site, and building a six-level mixed-use building with an office at ground level and apartments above.\n\nThe CAP decided it constituted \"excessive height\", \"overdevelopment with minimum site areas not satisfied\", and there was a lack of adequate setbacks from the northern boundary abutting the Christie Walk eco-community.\n\nResident Geoff Schrader lives inside one of 27 dwellings at the village, which is used to demonstrate ecologically sustainable living in a city location, both through the buildings' construction and ongoing life span.\n\nGeoff Schrader says the biggest issue with the development is associated car parking. (Supplied: Geoff Schrader)\n\nHe said the biggest problem with the proposal was car parking and how it would work when the building's access point will be Considine Place — a narrow laneway off Gilbert Street.\n\n\"It's how people get out of Christie Walk, and if there's a queue of cars trying to get into their car parks at the end of the day, or beginning of the day, that will be problematic,\" Mr Schrader said.\n\nHe said the lane also supported foot traffic from people heading to and from homeless shelters in and around Whitmore Square.\n\n\" The other issues are the fact it's kind of higher than the current height allowance for this portion of Gilbert Street, and it overlooks a childcare centre, so there are issues around child safety and so forth. \"\n\nThe five-storey mixed-used building, if approved, will abut this childcare centre. (ABC Radio Adelaide: Malcolm Sutton)\n\nThe compromised proposal was presented to CAP at its January 29 2025 meeting, where it decided to grant planning consent.\n\nThe building height had been reduced to five levels, car parking spaces reduced from 28 to 19, and the set-back between the first and fourth levels and the northern boundary increased from 1 metre to more than 5m.\n\nAt ground level, however, from where the car stacker is believed to be located, it will be only a metre from Christie Walk buildings.\n\nSystem 'allows for transparency'\n\nA state government spokesperson said it was a matter for Adelaide City Council to communicate with \"their residents about the decision they came to with the developer in the ERDC\".\n\n\"The system allows for transparency, with publicly available documents uploaded to Plan SA at all times throughout the process per the legislative and policy frameworks,\" he said.\n\n\"Details of matters to be heard in the ERDC are publicly available through the case lists published daily on the Courts Administration Authority website.\"\n\nThe Christie Walk ecocity development was finished in December 2006. (ABC Radio Adelaide: Malcolm Sutton)\n\nMr Brady warned that a system that excluded third parties from appeal processes could be taken advantage of by developers.\n\n\"They know that the legislation is there, and indeed, everything that's been done so far here is due process and legal, but so what?\" he said.\n\n\"I could be sitting here on my balcony and at the end of next year all of a sudden Whelan the Wrecker rolls in with a big ball, knocks the building down, and we're going, 'What?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/national-indigenous-art-triennial-after-the-rain-tony-albert/106105020",
        "title": "After the Rain reflects on Indigenous art's legacy while looking to future",
        "publish_date": "Sat, 06 Dec 2025 00:15:05 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Tony Albert was an aspiring artist and arts worker when the inaugural National Indigenous Art Triennial opened almost 20 years ago.\n\nHaving travelled to Kamberri (Canberra) for it, Albert remembers standing in the National Gallery of Australia (NGA) and \"knowing implicitly how important it was to be in that place, at that time with this institutional recognition of First Nations art\".\n\nTony Albert is the first man to lead the National Indigenous Art Triennial. (Supplied: NGA)\n\nNow the Girramay/Yidinji/Kuku-Yalanji man is one of the country's foremost contemporary artists and the artistic director of the latest triennial, which opens today at the NGA.\n\nAlbert's triennial is called After the Rain and reflects on matters of legacy as well as rebirth and renewal; on what rain washes away and what grows in its wake.\n\nThis is also the first artist-led iteration of the blockbuster exhibition.\n\n\"That's not symbolic; it's structural. Allowing an artist to lead shifts the model from representation to one of authorship,\" Albert tells ABC Radio National's Awaye!\n\n\"We have wonderful curators that are doing such a fantastic job and I never wanted to put myself in that position or to say that I believe I'm even in parallel to the incredible work they do.\"\n\nMaŋgalili artist Naminapu Maymuru-White's Milŋiyawuy (Milky Way) depicts a Yolŋu understanding of the universe. (Supplied: NGA)\n\nInstead he chose to use his role (and title) of artistic director to change the infrastructure and the ways in which institutions like the NGA work with Blakfullas.\n\n\"From the very instigation of [our] conversations we were making sure that the artists were heard, they were listened to, and I feel this triennial is the result of a different way of working,\" he says.\n\nCreating seminal works\n\nWith only 10 featured projects, After the Rain might sound like a modest offering.\n\nHowever, in paring back, Albert was able to provide his artists with more time, resources and care.\n\n\"Rather than try to fit many voices into a limited framework, After the Rain invests deeper into fewer projects. This allows artists to realise what may be their most seminal works of their career,\" Albert says.\n\nOne powerful example of this can be found in the immersive installation by Alair Pambegan, a Wik-Mungkan man from Aurukun and a cultural custodian of the flying fox story.\n\nHis own father had been part of that first triennial in 2007, and \"featured as one of the 'big guns' — the major artists in the exhibition\".\n\nWhen Albert invited Pambegan to take part in After the Rain he wrote a letter asking he make his \"most ambitious work to date\", both on a cultural and artistic level.\n\nPambegan rose to the challenge.\n\nHis work, Kalben-aw story place of Wuku and Mukam the flying fox brothers, features more than 600 cylindrical painted wooden carvings suspended from the ceiling, as well as two ceremonial sculptures representing the brothers and the never-before-shown origins of that story.\n\nPambegan first worked with Albert on his first solo exhibition, in Sydney in 2017. (Supplied: NGA)\n\nPambegan's reinterpretation of such an important story (one that is explicitly about the consequences of our actions) also signals to Albert how strongly the art world has elevated First Nations and contemporary Indigenous art.\n\n\"There was a point in time where that custodianship of the story was about replicating and keeping it alive, but now we're seeing innovation,\" Albert says.\n\nAn artist-led approach\n\nAs much as Albert has encouraged the featured artists to push themselves and their artistic boundaries, often he found the featured artists were leading the charge themselves.\n\n\"It seems like a silly thing to say, but it should be the direction and trajectory of this decolonising, Indigenising space,\" Albert says.\n\n\"Setting parameters was really interesting because I know artists will always have the right answer but I've been surprised every step of the way.\"\n\nAlbert knew from the start he wanted to include the work of Grace Kemarre Robinya from Tangentyere Art Centre, because he is \"in love with the simplistic nature of all that Gracie paints\".\n\nRobinya is the oldest artist featured in After the Rain, and the one whose work has the strongest visual connection to the cultural, environmental, social and political themes Albert wanted to explore and share.\n\nIn Robinya's 11-panel Kwatjala nhama timela (Raining time), the artist paints the rain: \"We love rain because if it don't come for a long, long time it isn't good,\" she says. (Supplied: NGA)\n\n\"When I look at [her] work, I'm compelled to think both holistically and metaphysically about what sits within a raindrop,\" he says.\n\n\"But if we go back to these conversations about pushing boundaries, about doing this seminal practice, I knew from my love with Gracie and my time and relationship I've had with her, I couldn't give her a four- or five-metre canvas to paint because that was never going to happen,\" Albert explains.\n\nTheir solution was to provide Robinya with a series of canvases that she could \"attack from every angle\".\n\nRobinya painted 11 before Albert got the call to say she was finished.\n\n\"And so by piecing all these canvases together, we get this incredible, monumental work from a very senior artist that epitomises to me the idea of what After the Rain means about being on Country and understanding Country,\" Albert says.\n\nSprouting new beginnings\n\nDespite the excitement of After the Rain there's one element of the National Indigenous Art Triennial that has been a longstanding point of contention — the exhibition has never been every three years until now.\n\nWarraba Weatherall, featured in the triennial, works to etch mortuary tables with patterns mirroring those in trees. (Supplied: NGA)\n\nAfter the Rain follows on from Culture Warriors in 2007, unDISCLOSED in 2012, Defying Empire in 2017 and Ceremony in 2022.\n\n\"That's something we [Blak arts professionals] are concerned about and we talk about as mob, like: 'What is this thing? What is the commitment that the National Gallery has to Indigenous art?'\" Albert says.\n\nHe hopes that as the first artist-led triennial, After the Rain has set parameters for the triennial's future and in doing so has also \"set the tone for our own sovereignty, our own autonomy\".\n\nNATSIAA winners announced Gaypalani Waṉambi, Bulanjdjan Lucy Yarawanga, Owen Yalandja and Jahkarli Felicitas Romanis are among the winners at the National Aboriginal and Torres Strait Islander Art Awards.\n\nLooking to his own art practice, Albert says his experience as After the Rain's artistic director has solidified his desire to be given the opportunity to be heard when working with institutions and blockbuster art shows.\n\n\"[I want] for someone to take what I want to do, my idea under my autonomy and make it the best possible for me,\" he says.\n\n\"That's what I did for the artists in After the Rain. And that's I think all we want as artists, for someone to lift us, to put the time, energy, and resources into making our dreams come true.\"\n\nThe 5th National Indigenous Art Triennial: After the Rain is at National Gallery of Australia until April 26.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/asbestos-found-in-new-ecu-campus-in-perth-cbd/106109070",
        "title": "Asbestos found in new ECU city campus, but won't be removed before it opens",
        "publish_date": "Sat, 06 Dec 2025 00:10:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Asbestos has been discovered in fire doors at Perth's first inner-city university, and authorities say it will not be replaced before the brand new campus welcomes its first students early in the new year.\n\nEdith Cowan University's flagship $853 million city campus has been jointly funded by the university and state and federal governments, and is due to open for students in semester one next year.\n\nGovernment minister Jackie Jarvis revealed in parliament on Thursday the building had received an exemption from work health and safety regulations to allow it to open with \"asbestos-containing material\" inside.\n\nECU's inner-city campus in Perth is due to open its doors early next year. (Supplied: Edith Cowan University)\n\nShe said the material had been found in 14 fire doors, and the exemption had been granted \"to facilitate safe completion of the doors to meet fire engineering requirements and enable completion of the construction work and scheduled occupancy\".\n\n\"Door replacement was not practicable in the medium-term,\" she said.\n\n\"The exemption specifies a range of conditions, which include the use of class A asbestos removalists, supervision by a licensed asbestos assessor, air monitoring and compliance with specified procedures.\"\n\nNo asbestos exposure risk\n\nIt is understood the asbestos is within a metal frame in the custom fire doors, meaning there is low risk of exposure for staff and students.\n\nAsbestos is prohibited in Australia because it is highly carcinogenic. Inhalation of its fibres is associated with an increased risk of respiratory diseases like asbestosis, mesothelioma and lung cancers.\n\nECU declined to comment, deferring to builder Multiplex, which said it became aware of the risk of asbestos in the doors in September and started testing fire doors at the city campus.\n\nOnce the 14 doors were identified, the company said, it immediately told WorkSafe and workers.\n\nEdith Cowan University has been exempted from health and safety regulations to enable it to open in February. (ABC News: Jack Stevenson)\n\n\"WorkSafe granted an exemption for minor works on the affected fire-rated doors to enable building completion,\" a company spokesperson said.\n\n\"Work to remove and replace the doors will occur in a timeframe that has been agreed with WorkSafe and ECU.\"\n\nIndustrial Relations Minister Simone McGurk told the ABC the asbestos appeared to have been imported from overseas by a manufacturer in Queensland.\n\n\"The identification and action to prevent this importation is ongoing and is being undertaken by federal authorities including Australian Border Force,\" she said.\n\nDoors to be replaced\n\nMs McGurk said the Department of Local Government, Industry Regulation and Safety was satisfied Multiplex was \"managing the risks appropriately\".\n\n\"The doors will be removed and replaced during semester breaks,\" she said.\n\nIt comes after asbestos was recently discovered in brake pads at a number of Australian wind farms and in coloured sand.\n\nAsked earlier in the week whether any of those brake pads were in use in Western Australia, Ms McGurk told parliament regulating the material remained a challenge.\n\nAsbestos was recently discovered in brake pads used in wind turbines. (ABC Capricornia: Katrina Beavan)\n\n\"Products are imported from China, for instance, but other countries may not have guidelines that are as stringent as the ones we have in Western Australia,\" she said.\n\n\"We need to work with our federal authorities to ensure we understand that the materials we bring in from overseas have undergone the same sorts of checks we would expect any domestically manufactured or sourced products to go through.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/concerns-as-roger-cook-seeks-to-speed-up-project-approvals/106100190",
        "title": "Roger Cook wants to use parliament to avoid FOMO. Not everyone is on board",
        "publish_date": "Sat, 06 Dec 2025 00:04:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "While most West Australians are busy thinking of Christmas presents and summer holidays, many of the state's politicians are preoccupied with something else.\n\nWhether or not to help Premier Roger Cook with his self-admitted fear of missing out.\n\nHe's not worried about missing out on concert tickets though.\n\nThe premier has \"big, shiny, job-creating projects\" on his mind — and he's anxious other places will snap them up.\n\nJob creation is on the premier's mind in his push to spruik the new legislation. (ABC News: Andrew O'Connor)\n\nRoger Cook wants the parliament to give him — and whoever else succeeds him — wide-reaching powers to change the rules on approvals for hand-picked projects.\n\nIt has prompted concern from the opposition, environmentalists and even lawyers about potential consequences.\n\nWhat's changing?\n\nThe legislation would give extra powers to the state development minister (currently Mr Cook) and the coordinator general (a government-appointed bureaucrat) in relation to \"priority projects\".\n\nThat could be almost anything considered to be of \"strategic or economic significance\" by both the state development minister and the premier.\n\nOakajee, north of Geraldton, is an example of where infrastructure has been built for future industrial development. (ABC Midwest & Wheatbelt: Chris Lewis)\n\n\"This check and balance on power is actually just a conversation inside Premier Cook's head, because he is the minister and premier,\" Greens MLC Sophie McNeill told parliament on Thursday.\n\nState development areas can also be established to make it easier for the government to provide infrastructure like power and water ahead of time to attract new industry.\n\nWith a few exceptions, the minister or coordinator general will be able to change existing approvals pathways for priority projects or state development areas in four ways if the law is passed in its current form:\n\nModification orders allow the minister to change how laws apply to a project, but cannot remove approval requirements altogether.\n\nallow the minister to change how laws apply to a project, but cannot remove approval requirements altogether. Timeframe notices adjust or create deadlines for decisions, but there's no clear consequence if deadlines aren’t met.\n\nadjust or create deadlines for decisions, but there's no clear consequence if deadlines aren’t met. Joint decision notices escalate disagreements up the chain — if a decision isn't agreed upon between the agency and the coordinator general or the relevant minister and state development minister, the premier can have the ultimate say.\n\nescalate disagreements up the chain — if a decision isn't agreed upon between the agency and the coordinator general or the relevant minister and state development minister, the premier can have the ultimate say. Due regard notices force decision makers to consider specific factors they’d otherwise only consider optionally.\n\nOne big project already announced is the expansion of the Henderson shipyard south of Perth into a major defence hub. (Supplied: Australian Department of Defence)\n\nWhat's the reaction been?\n\nIt won't surprise you to hear business, and especially the resources industry, are fully on board.\n\nWA's Chamber of Commerce and Industry said it would allow the state to \"capitalise on global trends\" like critical minerals, defence and advanced manufacturing.\n\n\"These laws are designed to improve efficiency within government and speed up assessments without compromising on their rigour,\" Chamber of Minerals and Energy policy director Anita Logiudice said.\n\nAnita Logiudice is right behind the proposed legislation. (Supplied)\n\n\"If a project fails to tick all the required boxes it will still be rejected — the proponent will just get there much faster.\"\n\nWhat are critics saying?\n\nIn short, they say the new powers give the minister and coordinator general too much power and risk slowing down projects, rather than speeding them up.\n\nThere are also concerns that while the powers have been sold as speeding up approvals for renewable energy projects, there is nothing stopping a future government using them for any type of project.\n\nCritics fear the changes will be used to prioritise projects far more harmful than renewable energy developments. (ABC Great Southern: Mark Bennett)\n\n\"The botched drafting of this bill is like doing surgery with a sledgehammer instead of a scalpel,\" Greenpeace Australia Pacific CEO David Ritter said.\n\n\"Prioritising clean energy projects through due process approvals is one thing, but this perverse shemozzle could allow polluting projects to cut corners on important, independent processes that are there to protect communities and nature.\"\n\nDavid Ritter says the legislation is a \"perverse shemozzle\". (ABC News: Grace Burmas)\n\nThe Law Society of WA, which represents lawyers, also isn't supportive, warning a lack of objective criteria to choose priority projects could create a \"new bottleneck\" of companies seeking \"special treatment with no consistent way to assess merit or priority\".\n\n\"We will provide a framework of priorities so that there's absolute clarity around what are the priorities,\" Energy Minister Amber-Jade Sanderson explained on Thursday.\n\nHas something like this been tried before?\n\nIt certainly has — and the Liberals' energy spokesperson Steve Thomas says none of those attempts to speed up the bureaucratic process worked.\n\n\"Do you know how I can prove this? We are sitting here today debating the government's seventh attempt to streamline approvals and put appropriate infrastructure in place,\" he told parliament on Tuesday.\n\nWA's accelerated planning laws under scrutiny Planning reforms the WA government says were brought in to combat \"naysayers\" and \"NIMBYs\" are set to be put under the microscope by an upper house committee.\n\nThe most notable attempt was in 2023 when the government stripped the Environmental Protection Authority of the power to factor in carbon emissions when considering projects, saying that was already regulated under federal environmental law.\n\nOne of Labor's own MPs later broke ranks to criticise that, describing it as a \"wish list that certain industry groups have been touting for years\", before ultimately voting for the changes.\n\nSo why do we need these new laws?\n\nAddressing a friendly crowd at a business breakfast last week, the premier said his FOMO took hold after a decision by mining magnate-turned-climate change campaigner Andrew Forrest.\n\nLoading...\n\nHe'd decided to build a hydrogen electrolyser manufacturing facility in Queensland, rather than WA, in Cook's retelling, because the site already had infrastructure in place.\n\n\"That was a signal to me that we're living in a different paradigm now when it comes to developing these strategic industrial areas,\" the premier said.\n\n\"They have to be ready to go, because companies will come and say, 'How quickly can we establish, how quickly can we build, how quickly can we get our product to the market?'\"\n\nMr Cook said that meant having both development-ready areas prepared and approvals laws that gave quick answers.\n\nWill the laws pass?\n\nAlmost certainly, it's just a matter of when.\n\nThe Greens tried unsuccessfully to send the bill to a committee for closer consideration, but that failed without the opposition's support.\n\n\"We understand this is important, we understand the significance of it and we understand that the sector has been broadly in support of it,\" opposition leader Basil Zempilas said on Tuesday.\n\nWA Liberal leader Basil Zempilas says his party understands the bill is important. (ABC News: Courtney Withers)\n\nThe opposition's support is conditional on Labor voting for a handful of amendments put forward by Dr Thomas, including requiring the government to tell parliament when it uses certain powers.\n\nThe Greens have described that as a \"dirty deal\".\n\nNo matter what you call it though, it will mean the legislation should pass the upper house before its last sitting day for the year on Thursday.\n\nIt will then have to go back down to the lower house — meaning some MPs will have their Christmas holidays cut slightly short to make it back for a special sitting on December 16.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/victorian-miniature-railway-opens-harcourt-trains/106095804",
        "title": "Victorian hobby club opens 'Australia's biggest' miniature railway",
        "publish_date": "Sat, 06 Dec 2025 00:01:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "A hobby club in central Victoria has spent a decade building what they claim is \"Australia's biggest\" miniature railway.\n\nIt was a 2012 visit to the world's pinnacle of miniature railway, Train Mountain in Portland, Oregon, that set the wheels in motion.\n\nAndrew Mierisch, a lifelong enthusiast, and a group of friends had shipped over three engines they'd built, wanting to take them on a run on the American track.\n\nAfter the six-hour miniature train ride Andrew had made up his mind — \"Australia needs one of these\".\n\nAndrew Mierisch says the miniature railway station is modelled on Maryborough's train station. (ABC News: Anna McGuinness)\n\nThirteen years later and the Victorian Miniature Railway is officially opening to the public this weekend.\n\nThe 2.7-kilometre track is nestled on the slopes of a former paddock in Harcourt, central Victoria.\n\nWhile just a fraction of Train Mountain's 523 kilometres, the 26-hectare Harcourt site means there's plenty of room to grow.\n\nFamily passion\n\nAndrew has been around miniature railways his whole life.\n\nHis father, Colin Mierisch, was involved in the Diamond Valley Railway at Eltham, on the outskirts of Melbourne, for decades.\n\nAndrew and Colin Mierisch take in the view from the overpass. (ABC News: Anna McGuinness)\n\n\"I've always been my dad's shadow, I was that little budding apprentice beside his father,\" Andrew said.\n\nHe remembers pushing a matchbox around in the dirt and then getting to drive the trains himself as he got older.\n\nColin is a toolmaker by trade and said his passion began when his own father bought him a steam engine when he was 7 years old.\n\n\"The thing I do enjoy the most is the passengers,\" Colin said.\n\n\" The little kids jumping on the train with such excitement and taking them for an enjoyable ride on the train. \"\n\nColin Mierisch on the train platform. (ABC News: Anna McGuinness)\n\nThe father and son are just a small part of the Victorian Miniature Railway club, home to more than 50 members all dedicating their passion, skill and time to the project.\n\nSo much so that Andrew estimates 95 per cent of the work has been done by the club members.\n\n\"It's such a massive feat, to fund it wouldn't be financially possible or viable. It's only a hobby and a club at the end of the day,\" he said.\n\nMany are \"genuine train nuts\", but others are there to tinker and make things or put their green thumb towards transforming the old paddock.\n\nAnd nothing about the railway is an accident.\n\nOne of the model trains ready to take passengers for a ride. (ABC News: Anna McGuinness)\n\nFrom the station — modelled on the 130-year-old train station at Maryborough, 50 kilometres west of Harcourt — to the tracks, diesel and steam engine trains.\n\n\"We are fanatical modellers,\" Andrew said.\n\n\"We aim for every detail — the door handle, the horns, windows, the glass, we put everything on there we possibly can.\"\n\nThe scale, 2.5 inches to every foot, is strictly adhered to — apart from carriage seats to allow for a comfortable ride.\n\nOpening at last\n\nAndrew said it's been a \"really hard\" decade of work after hitting unexpected granite and rock on the site and being stalled for two years by COVID.\n\nHe said the whole club is eager to let the public in and share their work, for more than one reason.\n\n\"It can get pretty boring just driving around in circles by yourself,\" Andrew said.\n\nMembers of the Victorian Miniature Railway during the build. (Supplied: Victorian Miniature Railway)\n\nThe railway's opening weekend, December 6 and 7, is just another milestone for the club.\n\n\"It's a bit like restoring a car — you're always going to want to make something a bit better, add, or get the next thing,\" Andrew said.\n\nThe tickets, at $5 a ride, are a \"peppercorn rate\" to cover the bills for the club, which will open to the public each Sunday going forward.\n\nAs for Harcourt, a town of about 1,000 people known for its apple cider and scenic bush backyard, Andrew said he is confident it's about to make a splash on the global miniature railway scene.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/frank-gehry-guggenheim-bilbao-dies-aged-96/106109892",
        "title": "Frank Gehry, world-renowned architect behind Guggenheim Bilbao, dies aged 96",
        "publish_date": "Fri, 05 Dec 2025 23:03:37 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Frank Gehry, who became a superstar of world architecture with daring creations of leaning towers and sweeping sheets of curved metal such as the Guggenheim Museum in Bilbao, has died at the age of 96.\n\nThe world-renowned designer of the \"paper bag\" building at the University of Technology Sydney died on Friday morning at his home in Santa Monica, California, after a brief respiratory illness, according to Meaghan Lloyd, the chief of staff at his architecture firm.\n\nGehry's most memorable and riotous creations often looked as if they had recently collapsed in an artistic manner — or were in the process of doing so. They were lauded as works of genius or reviled as self-indulgent messes.\n\nHis works were so fantastical that sometimes even he was not sure what he had wrought, as was the case with the Bilbao museum.\n\nThe Guggenheim in Bilbao, Spain, has been hailed as one of the great works of modern architecture. (Reuters: Guillermo Martinez)\n\nIn 2010, a panel of experts put together by Vanity Fair cited it as the most important work of architecture since 1980.\n\nEminent architect Philip Johnson called it \"the greatest building of our time\" and Gehry \"the greatest architect we have\".\n\nHowever, Gehry himself said that \"it took a couple of years\" before he started to like it.\n\n\"I went there just before the opening and looked at it and said, 'Oh, my God, what have I done to these people?'\" Gehry said.\n\nMuseums, Facebook campus among works\n\nIn March 2015, Facebook's campus in Menlo Park, California, opened a massive expansion designed by Gehry, who was given instructions not to be so bold that the facility would not fit in with its surroundings.\n\nGehry also opened La Fondation Louis Vuitton museum in Paris in 2014.\n\nLa Fondation Louis Vuitton in Paris was inspired by the glasshouses that previously stood on the site. (Reuters: Charles Platiau)\n\nFrench billionaire Bernard Arnault, CEO of the LVMH group, paid tribute to Gehry following his passing.\n\n\"Frank Gehry — who possessed an unparalleled gift for shaping forms, pleating glass like canvas, making it dance like a silhouette — will long endure as a living source of inspiration for Louis Vuitton,\" he said in a statement.\n\nFrank Gehry opens UTS building likened to 'paper bag' Architect Frank Gehry says the Dr Chau Chak Wing Building at the University of Technology Sydney was inspired by renaissance artists' fascination with folds in skin and clothing.\n\nHis other notable buildings included the Walt Disney Concert Hall in Los Angeles, the Dancing House in Prague, the Experience Music Project in Seattle and the 8 Spruce residential tower in New York.\n\nGehry's critics accused him of disregarding function in favour of form.\n\nHis Disney concert hall was lambasted by various critics as \"a pile of broken crockery\", \"a fortune cookie gone berserk\", \"deconstructionist trash\" and \"an emptied waste basket\".\n\nHis first Australian design, the Dr Chau Chak Wing building at UTS in Sydney, was likened to a paper bag when it was opened in 2015.\n\nGehry tried to shrug off such criticism, telling The New Yorker in 2007, \"You kind of say, 'At least they're looking!'\"\n\nBut he was not always so sanguine. While in Spain in October 2014 to accept an award, Gehry was asked about criticism that his work was too showy.\n\nHe raised his middle finger and said: \"In this world we are living in, 98 per cent of everything that is built and designed today is pure shit. There's no sense of design, no respect for humanity or for anything else.\n\n\"They are damn buildings and that's it.\"\n\nThe Disney Concert Hall was labelled \"a fortune cookie gone berserk\" when the design was first revealed. (Reuters: Lucy Nicholson)\n\nA lifelong love of design\n\nBorn Ephraim Owen Goldberg in 1929 in Toronto, Canada, Gehry began designing buildings and miniature cities out of scraps of wood as a child.\n\n\"That's what I remembered, years later, when I was struggling to find out what I wanted to do in life,\" he told The New Yorker in 1977.\n\n\" It made me think about architecture. It also gave me the idea that an adult could play. \"\n\nAfter graduating from the University of Southern California, Gehry went through a restless period.\n\nHe worked at a couple of Los Angeles architecture firms, began studies at the Harvard Graduate School of Design but quit without a degree, served a year in the US Army and moved to Paris for a year.\n\nBy the time he returned to Los Angeles in 1962, he had changed his last name to Gehry, at his wife's suggestion, as a way to avoid antisemitism.\n\nFrank Gehry's Santa Monica residence is a mainstay of Los Angeles architecture tours. (Supplied: Architectural Resources Group)\n\nHis breakthrough project was in 1978, when he rebuilt his own Santa Monica home — taking a pink traditional Dutch colonial house and turning it into something fantastical with common materials such as chain-link fencing, corrugated aluminium and unfinished plywood.\n\nBy the mid-1980s, he was attracting international attention with buildings sheathed in stainless steel or aluminium that seemed to bend and sway, subverting the conventions of architecture.\n\nIn 1989, he won the Pritzker Prize, his profession's most prestigious award.\n\nBut his masterpiece came when he was charged with designing the Guggenheim Museum in Bilbao, completed in 1997 using computer software that enabled him to build in increasingly eccentric shapes.\n\nGehry, who was married twice and had four children, also designed furniture, jewellery, watches, a bottle for a vodka distiller and a hat for singer Lady Gaga that looked like a tall, crumpled mass of silver fabric.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/piastri-struggles-as-norris-leads-abu-dhabi-f1-practice/106109968",
        "title": "Piastri struggles as Norris leads Abu Dhabi F1 practice",
        "publish_date": "Fri, 05 Dec 2025 22:54:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "Oscar Piastri has suffered a tough, truncated opening day in practice at the title-deciding Abu Dhabi Grand Prix, as teammate and championship leader Lando Norris laid down a significant early marker by going fastest in both sessions.\n\nThe Australian driver was left frustrated at the Yas Marina circuit on Friday, forced to take a mandatory break in morning practice before taking time to find his feet in the under-lights second session when he finished 11th quickest, 0.68 seconds slower than Norris's best lap of 1:23.083.\n\nHow to follow Oscar Piastri during the F1 title decider this weekend The Formula 1 world drivers' championship has gone down to the wire, with three drivers set to battle it out for glory at the season-finale Abu Dhabi Grand Prix.\n\nIt was the perfect boost for the Briton, who is 12 points ahead of Red Bull's Max Verstappen and 16 ahead of McLaren colleague Piastri, as the Dutch champion, second quickest on the day, still finished 0.363 slower than Norris under the floodlights.\n\nVerstappen was also noted by stewards for impeding Norris in the first flashpoint of the weekend after the champion had been fed wrong information by his race engineer, but they decided not to investigate further.\n\n\"What's this guy doing? I almost crashed,\" Norris had been left exclaiming.\n\nFor Piastri, desperate for the pace he had in Qatar last weekend when only McLaren's strategy blunder stopped him sweeping every session, it felt a stop-start day as, first, he spent the morning on the team's pitwall.\n\nWhile Norris led Verstappen by 0.008sec in another one-two, he gave up his seat to reserve Pato O'Ward in a session designed largely for young prospects and development drivers.\n\nPiastri was doubtless itching to get out on track as his McLaren boss Zak Brown joked: \"There's some guy that has taken my seat!\"\n\nThe humble beginngs that define Oscar Piastri After finishing dead last in his first ever race, Oscar Piastri has risen from humble beginnings to the brink of Australian sporting history as he chases his first F1 world title.\n\nNot much of a laughing matter for Piastri, though, as he started on the back foot in the second session, more representative of what they will all face on Sunday.\n\nHe locked up on his quickest lap and couldn't get near Norris's fastest, with Brown noting: \"Oscar is not totally dialled in yet but he will get there.\"\n\nPiastri certainly did not seem concerned, appearing his usual unflappable self as he told reporters: \"Finding my feet. Clearly, some things to try and improve for tomorrow, but after just one session, not too bad.\n\nOscar Piastri is facing the biggest weekend of his F1 career — but he still has time for the fans. (AP: Darko Bandic)\n\n\"It's more just little details, the car feels like it's in a pretty decent place, but just didn't get the grip out of it on that first soft lap. So some small tweaks for tomorrow, of course. It didn't feel perfect out there, but nothing major.\"\n\nNorris did not evidently want to get too high himself so early in the week, saying: \"Obviously, from the times, things look good at the minute, but I still want a bit more from the car. I'm not completely happy, or completely confident.\n\n\"We all know it gets a lot closer going into quali. So nothing to smile about just yet.\"\n\nVerstappen had more than a few grumbles about the Friday set-up of his Red Bull, complaining in the morning that \"something is broken on the car\".\n\nAsked what the main issues were by his race engineer Gianpiero Lambiase, he replied: \"It is everywhere now.\"\n\nMercedes' George Russell, who could play a key role yet in Sunday's race, was third quickest in second practice.\n\nBrown, meanwhile, revealed McLaren might yet employ team orders in the race, after speculation all week that Piastri could be asked to move over for Norris, sacrificing his own slight championship chance if it appeared Verstappen could be heading for overall victory.\n\nPiastri quiet on key F1 title question Oscar Piastri dodges the question of whether he might help Lando Norris lift the world F1 title in Abu Dhabi, saying McLaren has not discussed the issue.\n\nBrown admitted: \"If, as the race develops, it becomes clear one of our drivers has a significantly better chance than the other, then we're a team that wants to win the drivers' championship and we will race accordingly, to do whatever we can to get that driver in front to try and win the race.\"\n\nHe did not say what sort of chance would qualify as \"significantly better,\" but indicated team orders would only come into play if \"it becomes clear that both (Norris and Piastri) can't\" win.\n\nAsked if he believed Piastri would agree to any order to help out Norris, Brown said: \"Yes. Our drivers have always complied with team wishes, just as we comply with their wishes.\n\n\"I've got no doubt either of our drivers will continue to race as they've done brilliantly, in the best interest of the team.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/paralympian-returns-to-wheelchair-basketball-after-25-years/106104752",
        "title": "Paralympian returns to sport after 25 years to help next generation of athletes",
        "publish_date": "Fri, 05 Dec 2025 22:43:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Paralympian Mellissa Dunn rolls onto a Darwin basketball court today, she is surrounded by the kind of energy and support she once only dreamed of.\n\nTwenty-five years ago, high-performance wheelchair basketball in the Northern Territory looked like just a handful of determined athletes, a borrowed gym and no coaches in sight.\n\nMost mornings Dunn practised before the gates of the local school she trained at opened, the sound of her wheelchair tyres echoing through empty gym halls as the sun came up.\n\nDespite those barriers, Dunn went on to reach the Sydney 2000 Paralympic Games — winning a silver medal while four months pregnant.\n\n\"That was definitely the highlight,\" she says, smiling.\n\nMellissa Dunn won a silver medal in wheelchair basketball at the Sydney 2000 Paralympic Games. (Supplied: Mellissa Dunn)\n\n\" After that, my life changed dramatically. \"\n\nWith limited means to both support her new family and chase her sporting dreams, Mellissa retired in her mid-20s.\n\nNow, after 25 years, Dunn is back on court.\n\nAs both a player in the National Wheelchair Basketball League and a mentor back home in Darwin, she is helping to shape the next generation of territory athletes.\n\nA life-changing accident that led to a new beginning\n\nAt the age of 17, Dunn's life was turned upside down.\n\n\"In 1994 I was completing Year 12 and was involved in a car accident involving a drunk driver,\" she says.\n\n\" I broke my back and injured my neck and became an incomplete paraplegic. \"\n\nDuring rehabilitation in Adelaide, a physiotherapist introduced Dunn to wheelchair basketball.\n\nShe watched Australian athletes training — strong, confident and laughing together — and asked if she could join in.\n\nThat moment changed everything.\n\nMellissa Dunn says playing wheelchair basketball and pursuing a Paralympic career was life-changing. (ABC News: Marcus Kennedy)\n\nBut back home in Darwin, Paralympic success seemed out of reach.\n\nThere were no coaches, no specialist facilities and few others to train with — just determination and a lot of improvisation.\n\nEquipment was scarce and travel costs were crushing.\n\n\"If we wanted to get exposure to the game, we'd spend our weekends at the petrol station, begging people to buy a raffle ticket to support our travels down south,\" she says.\n\n\" You had to be more motivated and determined, because you were pretty much on your own. \"\n\nFrom isolation to a training community\n\nFor years para-athletes in the NT trained in isolation. But recently, that has begun to change.\n\nThe Para Futures Pathways Program, led by Jodie Zanini through the NT Sports Academy, has built the structure for athletes that Dunn once lacked throughout the Northern Territory.\n\nIt provides access to qualified coaches, strength and conditioning facilities, gym support, regular competition and athlete development workshops.\n\nThe Para Futures Pathways Program is giving more NT para-athletes access to the training and facilities they need to be successful. (ABC News: Marcus Kennedy)\n\nLaunched in 2022, the program now supports more than 20 athletes aged 13 to 35.\n\nIt also applies to those living outside of Darwin, where barriers to access like distance and cost make the challenges even greater.\n\nZanini says while it can be challenging to reach athletes across such a vast region, the goal is inclusion for all Territorians, from Darwin to remote Arnhem Land.\n\n\"The whole point of this system uplift is to bring people along for the ride quicker,\" Zanini says.\n\nJodie Zanini says the aim of the program is to give para-athletes the support they need to achieve their goals more quickly. (ABC News: Marcus Kennedy)\n\n\"We want more athlete representation by the 2032 Brisbane Paralympics, and for people with disabilities to have real opportunities here at home.\"\n\nThe difference the program has made, Dunn says, is \"life-changing\".\n\nAnd where NT para-athletes once trained mostly on their own, Zanini says today the program allows up-and-coming athletes to train alongside their peers, providing a sense of community.\n\n\"What brought me back to wheelchair basketball was the fabulous community we have,\" Dunn says.\n\n\"Everyone is so supportive of each other.\"\n\nThe pathways program gives para-athletes access to gym support. (ABC News: Marcus Kennedy)\n\nThat sense of belonging is what Zanini wants every athlete to experience.\n\n\"Anyone with a disability can come and try sport,\" she says.\n\n\"Not everyone feels comfortable just rocking up to a club.\n\n\" We make sure there's a pathway for them after they try it. \"\n\n\"The whole point is to bring people along for the ride quicker and create a legacy that lasts beyond 2032.\"\n\n17yo Arnhem Land para athlete set to compete in world championships Arnhem Land teenager Briseis Brittain is set to represent Australia at the World Para Athletics Championships in New Delhi, competing in the 200m and 400m races.\n\nDunn says she can see the difference.\n\n\"Back then, we had to organise everything ourselves: travel, accommodation, airfares,\" she says.\n\n\"These days there's support, so athletes can focus on training and improving.\n\n\"At this stage in my life, I'm happy to support other athletes coming through.\"\n\nNT growing pathways to 2032\n\nNatalie Charlton from Paralympics Australia says the NT's rapid progress in para-athlete development has caught national attention.\n\n\"It's not a matter of the NT catching up to the rest of the nation. The NT is doing incredible things and developing pathways,\" she says.\n\nNatalie Charlton says the NT is no longer catching up to the rest of the country when it comes to opportunities on offer to para-athletes. (ABC News: Michael Franchi)\n\nCharlton says she hopes the territory's homegrown athletes will feature strongly in the Brisbane 2032 Paralympic Games.\n\n\"I'd love to see athletes representing at the 2032 Games, who've been able to develop as athletes at home in the Northern Territory,\" she says.\n\nDunn comes full-circle\n\nDunn isn't looking to don the green and gold again and play for Australia. Instead, she has set her sights on inspiring the next generation.\n\n\"I'd like to see younger athletes have the same incredible opportunities that I got to experience,\" she says.\n\n\"I hope that one day I can inspire future athletes in the same way previous athletes have inspired me.\n\n\" Behind every success is a great community. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/coronial-inquest-investigates-terry-airey-death/106090278",
        "title": "Death prompts major hospital protocol overhaul as inquest scrutinises 'chaotic day'",
        "publish_date": "Fri, 05 Dec 2025 21:57:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A Queensland hospital has increased staffing and revamped its radiology protocols following the death of an 87-year-old farmer after routine surgery, an inquest has heard.\n\nTen Sunshine Coast University Hospital (SCUH) staff were cross examined at a coronial inquest this week in order for Deputy State Coroner Stephanie Gallagher to determine the circumstances of Terry Airey's death on June 11, 2022.\n\nThe beloved father and grandfather, who lived in Gympie for more than 50 years, leaves behind his wife Josie and six children from two marriages.\n\nThe four-day inquest heard his death was a result of organ failure after surgery performed by an unsupervised training doctor.\n\nOutside the Maroochydore Magistrates Court where the inquest was held, family members told the ABC they wanted to understand the \"human error\" at play in his death to prevent similar, preventable deaths from befalling another family.\n\n'Chaotic day' of surgery\n\nMr Airey presented to SCUH for a scheduled surgery, in pain with a cyst that was described in court as \"gigantic\", \"unusual\", and \"uncommon\" on Wednesday June 8, 2022.\n\nHe was admitted to the hospital's interventional radiology suite.\n\nBianca Stringer, the barrister representing Sunshine Coast Hospital and Health Service, said it was a \"chaotic day\".\n\nDr Roger Wilson — who was undergoing his fellowship at SCUH under the supervision of Dr Johnathon Langton and Dr Paul Leschke — drained Mr Airey's kidney cyst of about 2 litres of fluid.\n\nDr Wilson told the court he was taught to refill the cyst with half the amount that was drained.\n\nHowever, there was only 320ml of the medical grade ethanol available.\n\nDr Langton told the court his rule of thumb was to never exceed 100ml of ethanol.\n\nDr Leschke said he was aware of both guidelines.\n\nThe court heard Mr Airey was exposed to toxic levels of alcoholic betadine, 30 per cent, and medical grade ethanol at 96 or 98 per cent, but treated by staff as 100 per cent.\n\nCoroner Gallagher established it was an inappropriate amount of ethanol to instil but did not contribute to the death.\n\nCyst not drained a third time\n\nAfter the procedure, while in recovery, a senior nurse drained and refilled Mr Airey's cyst twice with 1 litre of alcoholic betadine, rotating him in between.\n\nThe court heard the nurses expected Dr Wilson to perform the final drainage.\n\nDr Wilson said he believed the nurses had performed the final drainage, though he aspirated about 20ml of residual fluid.\n\nNo staff used the ultrasound in the recovery room to check if Mr Airey's cyst had been drained, the court heard.\n\nThe inquest will determine if adequate procedures are now in place to prevent similar deaths. (ABC News: Jake Grant)\n\nExpert witness Dr John Richards, the medical director of imaging at Gold Coast University Hospital, told the court rotating an older patient could have kinked the catheter and contributed to his death.\n\nThe inquest heard on the evening of the surgery, Mr Airey returned to Gympie, about 100 kilometres away, with 1 litre of alcoholic betadine still in his cyst and the drain removed.\n\nLater that night, Mr Airey presented to the Gympie Hospital and was transferred back to SCUH where his cyst was drained the following day.\n\nHe died three days later on June 11.\n\nHospital protocol overhauled following death\n\nThe inquest heard since Mr Airey's death SCUH had increased staffing and implemented procedural changes, with senior doctors to be the primary operators and to not allow nurses to perform drainage and exchanges.\n\nThere were also updates to the tracking of fluids in the patient, with a paper fluid chart staying with every patient in recovery and ultrasounds being undertaken after every procedure.\n\nStaff must breathalyse each sclerotherapy procedure patient before the procedure and not continue if they do not blow zero.\n\nThey must also breathalyse each sclerotherapy procedure patient after the procedure and the patient must blow zero or below 0.05 with two readings showing a downward trajectory.\n\nThe hospital also implemented that one nurse stay with the patient in recovery until they are discharged. Mr Airey was passed on to multiple nurses.\n\nSurgeries were also scheduled for earlier in the day, as Mr Airey's surgery was pushed back to after 2pm.\n\nDoctors are not too instil more than 100ml of ethanol, complex surgeries are double scrubbed, and rosters are distributed eight weeks in advance with staff pre-assigned duties.\n\nHospital staff have also been given written sclerotherapy procedure protocols and guidelines.\n\nSpeaking to media outside court the Airey family said it was satisfied with the changes.\n\nCoroner Gallagher also commended SCUH for implementing the changes.\n\nShe said she would only take submissions regarding instilling and not draining the last litre of alcoholic betadine as this had ultimately caused Mr Airey's death.\n\nCoroner Gallagher's findings are expected in six to eight months.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/australian-open-golf-cameron-smith-chasing-victory/106109936",
        "title": "The simple approach Cam Smith is adopting as he chases Australian Open win",
        "publish_date": "Fri, 05 Dec 2025 21:56:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "When Cameron Smith was asked what it would take for him to win the Australian Open ahead of the final two rounds, his answer was blunt.\n\n\"Good golf,\" the 2022 British Open champion told reporters following his second round at Royal Melbourne on Friday.\n\nTo say the least, Smith's reply did not beat around the bush.\n\nBut it did reflect the simple approach he adopted as he moved into contention for the Stonehaven Cup with a bogey-free 6-under-par 65 in the second round.\n\nMcIlroy nervously avoids Australian Open cut Five-time major champion Rory McIlroy survives to fight another day at the Australian Open.\n\nSmith sank six birdies to share fourth place on 7-under with fellow Australian major winner Adam Scott and Mexican Carlos Ortiz.\n\nIt will be more of the same for Smith on 'moving day', the colloquial title given to the third round, as he looks to chase down co-leaders Rasmus Neergaard-Petersen and Daniel Rodrigues, who are 9-under for the tournament.\n\n\"I don't think I need to do anything different,\" Smith said.\n\n\"That (second round) was just really solid, really committed to shapes, and shots and flights. It was just nice to do that. I gained a lot of confidence out of that.\"\n\nDespite describing himself as a \"pretty gritty player\", Smith cut a casual figure as he strode the fairways in his second round, playing alongside rising Australian star Elvis Smylie and Englishman Danny Willett.\n\nThe laid-back Queenslander seemed to thrive on the fact much of the spectator interest surrounded the star-studded trio of Rory McIlroy, Min Woo Lee and Scott, who were playing ahead of his group.\n\nCameron Smith (right) played with Danny Willett during the second round on Friday. (Getty Images: Josh Chadwick)\n\nThat is not to say the galleries following Smith, Smylie and Willett were lacking in numbers, as there was enough fan support to create a vibrant atmosphere.\n\n\"There wasn't yelling and screaming out there, thank God,\" Smith said.\n\n\"There was a lot of people. But it was good fun out there.\"\n\nSmith's form line ahead of the Australian Open might have left tournament organisers anxious about whether one of their drawcards would be playing this weekend.\n\nAfter a promising start to the Australian PGA Championship in Brisbane last week, Smith capitulated in his second round to miss the cut at 2-over.\n\nThe 32-year-old comfortably avoided the same fate in Melbourne but stressed he did not travel to the Victorian capital just to make up the numbers.\n\n\"I'm not here to make the cut,\" Smith said.\n\n\"I'm here to win the Stonehaven Cup and I've put myself in a good spot to do that, so I'm really happy with that.\"\n\nSmith, Scott and Ortiz will tee off in the second-last group of the third round at 11.39am AEDT.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/what-is-next-for-approved-hobart-afl-stadium/106105676",
        "title": "When will construction begin on the Hobart stadium?",
        "publish_date": "Fri, 05 Dec 2025 21:27:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "After three and a half years, the question of whether Tasmania is getting a new stadium — and with it an AFL team — has been answered.\n\nBut now that the parliamentary fight is over, how does the stadium actually get built? And when exactly will the Macquarie Point precinct transform from an industrial wasteland to an elite sporting hub?\n\nLet's take a look.\n\nThe official timeline has the Devils starting to play at the new stadium in 2029. (Supplied: MPDC)\n\nFirst things first — will the stadium be ready for 2029?\n\nMacquarie Point Development Corporation chief executive Anne Beach is in charge of transforming the site, best known at the moment for hosting bits of the Dark Mofo winter festival and as the home of a sewage plant.\n\nShe says it's too early to commit to when AFL games could first be hosted on the new ground.\n\n\"We'll be able to lock down and communicate clearly with the community the timelines and the key milestones along that delivery pathway and what they can expect to see when once we appoint the major construction contractor,\" Ms Beach said.\n\nTasmania Devils CEO Brendon Gale (centre). (ABC News: Mackenzie Heard)\n\nBut Tasmania Devils chief executive Brendon Gale says he's not holding his breath that the stadium will be ready for Round 1 in 2029, despite it being in the contract between the AFL and the state government.\n\n\"It's probably an assumption internally that we'll be playing games in Hobart and Launceston at Bellerive and York Park for two years,\" he said.\n\nWith the Devils set to enter the AFL in 2028, that means he's preparing for it to be ready in 2030.\n\nWho will build it?\n\nThe stadium will be built in the Macquarie Point precinct. (ABC News: Kate Nickels)\n\nA yet-to-be-appointed major contractor.\n\nThe process to find a builder, who will also help to finalise the stadium's design, won't be quick.\n\nMs Beach says she hopes an expression of interest process to find that contractor will open in January, with a tender process to follow.\n\nThe time frame for the actual appointment of that contractor is the final quarter of 2026, so October to December next year.\n\nWhen will construction actually begin?\n\nThere's going to be a fair bit happening on the site next year (more on that below), but Ms Beach says building a stadium won't actually start for about 18 months.\n\nThat's because the corporation first needs to appoint a contractor, and get building and plumbing approval from the Hobart City Council.\n\n\"So we would expect to hopefully have everything in place to start around May 2027,\" she said.\n\nA render of the internal concourse around the edge of the seating bowl at the Macquarie Point stadium. (Supplied: MPDC)\n\nCan the stadium really be delivered on budget?\n\nThat's the question that will come up endlessly over the next few years.\n\nAs part of deals to get the stadium through parliament, the state government committed to limiting the amount paid by Tasmanian taxpayers at $875 million.\n\nThat means it has only two options if the project budget blows out again: make decisions to \"value manage\" the project and reduce its cost, or get extra funding from the federal government, Cricket Australia, the AFL or private investors.\n\nWhat would it be like to visit the proposed Hobart stadium? Setting all the politics aside — just for a moment — what would it actually be like to visit the building at the heart of Tasmania's fiery stadium debate?\n\nMs Beach says MPDC has already made a series of decisions to value manage the project.\n\n\"There are efficiencies in the way that the foundations are done, the way we support different structures,\" she said.\n\n\"One, for example, is the rakers, which is the steel that supports the concrete seating bowl. By moving those to a double raker rather than a single gave us some efficiencies and some savings in steel.\"\n\nShe says those decisions will be made throughout the process, making sure that cost is managed without compromising the quality of the stadium.\n\nMacquarie Point Development Corporation boss Anne Beach and Tasmanian Treasurer Eric Abetz at the construction site. (ABC News: Kate Nickels)\n\nTreasurer Eric Abetz says he's confident the project can be delivered for the current price tag, continually stressing that the government has received what's called a \"P90\" — which is a cost estimate made by a quantity surveyor with 90 per cent certainty.\n\nBut as economist Saul Eslake points out, construction costs continue to rise.\n\nHe says it's likely that the $1.13 billion estimate will increase by the time the stadium is delivered.\n\nHow the government responds if and when that happens will be crucial.\n\nDoes any work happen between now and the contractor appointment?\n\nYes. Two big tenders have just gone out.\n\nThe first is to excavate contaminated soil (it is a former industrial site after all) and to level the land.\n\n'Fair assumption': Devils boss warns of stadium debut delay The Tasmania Devils CEO says the club will likely play in the AFL from existing venues for a year longer than expected.\n\nMs Beach says there's still about 130,000 cubic metres, or 220,000 tonnes of contaminated land on the site.\n\nThe other tender is to dismantle the heritage-listed Goods Shed, which will eventually be relocated at the concourse level on the northern end of the site.\n\nMs Beach says the pieces of shed will be stored for a couple of years, until an underground half-ring road and a few other facilities are built below it.\n\nThe company that wins the tender will also be in charge of working out exactly how the shed will actually be dismantled, and then put back together.\n\nOne of the first steps will be to dismantle the heritage-listed Goods Shed. (Supplied: Nearmap)\n\nWhat happens to the Red Shed?\n\nThat shed is the home of Hobart Brewing Co.\n\nThe plan is for that to be removed soon after the company's lease ends in June, at roughly the same time as the Goods Shed is packed up.\n\nIs there any work to test the roof?\n\nCricket Australia is pretty confident that the stadium will be able to host domestic and international cricket matches, despite some initial concerns.\n\nBut Ms Beach says a test rig to examine what shadows will be cast by the proposed roof, how much light it lets in, and what it means for grass growth, will be installed on the site in February next year to make sure that the roof design delivers before the tender process begins.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/tommy-lamb-ashes-trip-to-adelaide-manchester/106109176",
        "title": "The 100 days, 21 countries and one fractured skull behind one Pom's wild Ashes tour",
        "publish_date": "Fri, 05 Dec 2025 21:18:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "There are intrepid travellers, then there's Manchester's Tommy Lamb.\n\nThe 18-year-old cricket fanatic has already travelled through 21 countries in an odyssey that's taken more than 100 days in an effort to make it to Adelaide Oval for the third Ashes Test.\n\nThe challenge: make the entire trip overland or by sea. No planes allowed.\n\nThe plan is to join his parents, who are both members of the Barmy Army supporting the England cricket team on the Ashes tour.\n\nHe told Saturday Extra's Nick Bryant why he was inspired to take on such an epic trek.\n\nAustralia delights in English woe Australia took control of the second Ashes Test at the Gabba on a day that carried plenty of the hallmarks of failed English tours of yesteryear.\n\n\"It'd be a great way to get myself off the beaten path and force myself to see different parts of the world that otherwise I wouldn't go to,\" Lamb said.\n\n\"That's — that's the sort of travel I want to do.\"\n\nHis journey has taken him from England through Western Europe, into the Balkans, then south through Türkiye into Iran, Pakistan and China and on to south-east Asia.\n\nWith his trusty cricket bat in his backpack, Lamb has found a way to get a game of some sort happening in every country he's visited.\n\n\"Every time I spend the night in a place, a new place, I try and play some cricket there,\" Lamb said.\n\n\"You get all these people giving you weird looks: 'What on earth are you asking? What on earth are you doing?'\n\n\"But eventually you'll find a few people that are really up for it, and you end up playing a 30-minute game with a border guard on the lake in northern Albania and it's just a memory for a lifetime.\"\n\nHis journey was inspired by his father telling Tommy a story of one completed by Lonely Planet founders Tony and Maureen Wheeler in the early 1970s.\n\n\"I always wanted to take a year out after school [and] I've always been interested in travel. I love my cricket obviously, as well,\" Lamb said.\n\n\"My dad, about two years ago, was just telling a story of two people that did this same trip in the 1970s and when I heard him talking about that, I thought that sounded great.\n\n\"I knew I wanted to go to the Ashes during my year off, I knew it would collide, and I thought, well, if I could get to the Ashes without a plane, it'd be a great way to make content online.\"\n\nLamb has been publishing a daily log of his journey on his Instagram account. His video diaries have documented his travels — warts, cuts, breaks, bruises and all — including a serious motorcycle accident in Vietnam.\n\nLoading Instagram content\n\n\"I've never driven a motorbike before, so it was just the stupidest thing you could possibly do as an 18-year-old Brit travelling in south-east Asia,\" Lamb said.\n\n\"So, I fractured my skull, broke my nose, had quite a few bad scratches here and there, but it wasn't the end of the world.\n\n\"Spent a few days in hospital, thankfully, was very well taken care of and then a few days in a hotel.\n\n\"I just felt worse telling my mum — that was probably the most nerve-racking part of the whole thing, rather than the accident itself.\"\n\nHe's experienced unexpected delights like discovering the beauty of Iran.\n\n\"Absolutely loved it, it was one of my favourite places that I've been to,\" Lamb said.\n\n\"I mean that there's definitely a bias here that I think when I was in Iran, every day you wake up and as a Westerner, as a Brit, you're sort of thinking, 'oh my God, I'm in Iran' and you can't quite believe it.\n\n\"It wasn't what I expected to find — it was a beautiful place with beautiful people and you gotta separate the government from the rest of it.\"\n\nThat was in stark contrast to his experience in the Pakistan province of Balochistan, where terrorist attacks and bombings have killed hundreds this year alone.\n\nThe Australian government's Smartraveller website recommends against travelling to the province because of the poor security situation and high risks of kidnapping.\n\nLamb found himself shuffled from police car to police van and spent two nights sleeping in cells.\n\nLoading Instagram content\n\n\"I'm travelling for 12 hours in a day, that'll probably be about 20 different military escorts because every time you move district, you get into a new car,\" Lamb said.\n\n\"So, on the first day, I only got about halfway into Balochistan and I was in the middle of absolutely nowhere, dropped off in this town.\n\n\"It was about midnight, and they basically said to me, 'there's no hotels here. You're gonna have to stay in the prison cell.'\n\n\"I have a few Pakistani friends back home and when I told them I was going into Balochistan, they couldn't quite believe it themselves.\n\n\"My logic always goes that, you know, if the locals can survive it for their whole lives, I'm sure I can survive it for a couple of days.\"\n\nHis next stop was south-east Asia, where he got stuck in floods in Thailand before losing his luggage and passport after leaving them in a car. Somehow, he regained them within a day.\n\nLoading Instagram content\n\nIf you think Lamb sounds like a somewhat naive and lucky young man, you're probably right, but he displays maturity beyond his years.\n\nHe is also exceptionally open to the world and all the experiences that have come his way.\n\n\"My older brother was a big fan of calling me a naive 18-year-old who doesn't know about the real world,\" Lamb said.\n\n\"But I always had this belief that … 99 per cent of the people you meet are all nice, no matter where you are in the world.\n\n\"And that's exactly what I've experienced: No matter which part of the world I'm in, I meet so many nice people that are willing to help me no matter what situation I'm in.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHis latest \"situation\" is being stuck in Singapore and desperately trying to get a lift of some sort on a boat to take him further south to Indonesia.\n\n\"I've emailed every single cargo ship company I can think of, I've gone to multiple cargo ship HQs, I've gone to marinas, I've asked everyone for boats heading towards Australia,\" Lamb said.\n\nHe at least found time to watch Joe Root score his maiden test century in Australia from the bar of the Singapore Cricket Club.\n\nThe plan is to meet his Barmy Army parents for the third Test in Adelaide, and if he can't make that, the backstop is Boxing Day in Melbourne.\n\nAnd no matter what, he won't be catching a plane.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-06/deaf-seniors-falling-through-aged-care-cracks/106084008",
        "title": "Deaf residents in aged care left without basic support services",
        "publish_date": "Fri, 05 Dec 2025 21:09:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Every day June Beutel sits alone, unable to connect with those around her.\n\nThe 87-year-old woman was born deaf and has spent the past two years living in a nursing home in Brisbane without Auslan support after she was diagnosed with dementia.\n\n\"She is sitting in a chair by herself, and when I come in to see her, she is signing to herself, interacting with nobody,\" her niece Brita Murphy said.\n\n\"[She is] profoundly deaf, she can't lip-read at all, she also has a vision impairment as well. And then having dementia as well on top of all of that … her needs are very complex.\"\n\nJune Beutel signs in Auslan with her niece Brita Murphy. (ABC News: Luke Bowden)\n\nMs Murphy has spent the past two years advocating for Auslan services — the Australian Deaf community's language, for her aunt in aged care.\n\nThe process has highlighted gaps in care available for Deaf seniors in Australia.\n\n\"I feel disheartened that in 2025 it is an issue that a deaf person in an aged care facility cannot have access to Auslan,\" Ms Murphy said.\n\nChief executive of the national peak body Deaf Connect, Brett Casey, told the ABC Ms Beutel's story reflects \"what many families experience when trying to secure culturally appropriate care for Deaf seniors\".\n\n\"Most mainstream nursing homes do not have access to an Auslan-proficient workforce, despite that responsibility sitting with the facility,\" he said.\n\n\"There is a nationwide shortage of Auslan-fluent support workers and the pathway to train existing staff to an appropriate level takes time.\"\n\nJune Beutel's family visit her each week, including her great nieces. (ABC News: Luke Bowden)\n\nA spokesperson for the Department of Health, Disability and Ageing said while it funds Deaf Connect, who is the provider for the National Sign Laguage Program (NSLP), the NSLP \"does not provide funding for aged care workers like social support or personal care workers\".\n\nThese service gaps mean the only time Ms Beutel can communicate is when her family visits.\n\n\"I'll sit with her and then she'll just burst into tears,\" said Ms Murphy.\n\n\"She'll say 'I'm on my own, it's just me' … she is so confused.\"\n\nBrita Murphy has spent the past two years advocating for Auslan support for her aunt in aged care. (ABC News: Luke Bowden)\n\nNo funding available\n\nBetween full-time work, caring for her four children, and looking after her father who is also deaf, Ms Murphy has been exploring avenues for Auslan support.\n\nShe has contacted the national peak bodies Deaf Connect and Deaf Australia, the Commonwealth Volunteer Visitors Scheme, her local MP, and had a number of meetings with the Ozcare nursing home where her aunt lives.\n\n\"No matter where I go … nothing is done, no one can tell me why there is no funding or any program that can bridge that communication gap,\" she said.\n\nAuslan is not included as an option in the language list when applying for My Aged Care, which Mr Casey has said means Deaf seniors face access barriers \"from the first step\".\n\nDeaf man rationing Auslan interpreting after 'gutting' NDIS cut Disability advocates say cuts to Deaf participants' NDIS funding is a \"systemic\" problem that reflects a belief that Deafness can be \"fixed\".\n\nHe said Deaf Connect could provide Auslan-fluent support workers \"to supplement care for some residents\", but it was \"only possible when the service is identified and funded by the nursing home\".\n\nIn June, Ms Murphy lodged a formal complaint with the Aged Care Quality and Safety Commission, who launched an investigation into Auslan accessible services.\n\nDuring the investigation, Ozcare confirmed it would provide Ms Beutel with a support worker two hours a fortnight, which only lasted a few visits due to resourcing.\n\n\"At the moment we are just back to square one … and it has just been heartbreaking to see that she is so isolated,\" Ms Murphy said.\n\nJune Beutel and Brita Murphy's first language is Auslan. (ABC News: Luke Bowden)\n\nOzcare's chief executive Michael Crutcher told the ABC: \"Ozcare provides as much assistance as possible to residents whose needs go beyond the usual span of aged-care support measures\".\n\nBut Ms Murphy worries that if her aunt needed help, or was in pain, there would be no way for staff to know.\n\n\"She just has to basically tolerate what she's feeling, there's no ease for her,\" she said.\n\nA spokesperson from the Aged Care Quality and Safety Commission said the new Aged Care Act \"means that people receiving care have a right to communicate in the language or method they prefer. Aged care providers should understand and follow the Statement of Rights.\"\n\n'Falling through the cracks'\n\nAccording to the latest census, more than 16,000 Australians use Auslan at home, but there is no exact data on how many of these people live in aged care.\n\nCouple 'effectively unable to be involved in care decisions' before man's death Bruce Drabsch's daughter Melinda Dagger, who was travelling to hospital to be with her ailing father, was phoned by a doctor and asked to inform her mother her husband of more than six decades had died, because no Auslan interpreter was provided.\n\nGiven her age, Ms Beutel is not eligible for NDIS funding, and because she is in aged care, she cannot access services through the Aged Care Assessment Team.\n\nProfessor Piers Dawes, director of the Centre for Hearing Research at the University of Queensland, said people like Ms Beautel can fall through the cracks.\n\n\"Hearing impairment tends to be under recognised and under supported … because it's not a visible sort of problem,\" he said.\n\nProfessor Dawes has led a number of national projects exploring how to better identify and support the needs of people with hearing impairments in aged care settings.\n\nBrita Murphy signs with her aunty June Beutel (ABC News: Luke Bowden)\n\nHe said the \"particular cultural and communication needs of Deaf people\" are often overlooked, despite it being a basic level of care.\n\n\"The most common reason for [moving into aged care] is that people have dementia, so they are not able to look after themselves,\" he said.\n\n\"If you can imagine all of that being compounded by not being able to communicate well with your carers or engage in social activities … you can imagine what an awful situation that would be,\" he said.\n\nProfessor Piers Dawes, director of the Centre for Hearing Research at the University of Queensland, says the cultural needs of Deaf elders are often overlooked. (Supplied: Piers Dawes)\n\nRegis Aged Care Blackburn in Victoria has a dedicated wing for Deaf residents, with staff either deaf themselves, or trained in Auslan.\n\nProfessor Dawes said more facilities like this are needed.\n\n\"There is a whole rich culture associated with the Deaf community … ideally somebody might have the option of specialised services.\"\n\nDeaf advocate Sherrie Beaver said this is particularly important for \"Deaf people born in the 1960s\", when the rubella epidemic led to a significant number of babies born deaf in Australia.\n\nShe's worried the aged care sector is not prepared for the next two decades, when many of these individuals will likely be entering care settings.\n\n\"There are so many heartbreaking stories of Deaf seniors being isolated in aged care, not having ample access to social opportunities,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/live-2025-australian-open-golf-day-two-from-royal-melbourne-20251206-p5nldu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2025 Australian Open golf LIVE: The discarded banana peel that caused a Rory McIlroy double bogey",
        "publish_date": "Sat, 06 Dec 2025 12:57:36 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Sam Mcclure",
            "Scott Spits"
        ],
        "text": "Rory McIlroy slipped up on a banana peel with a double bogey on the second hole at Royal Melbourne to struggle in the early stages of his Australian Open third round.\n\nThe world No.2 was hoping to maintain the momentum of three birdies late in his second round when he arrived on course for an early tee time on Saturday, seven shots off the pace.\n\nSwamped by a sell-out crowd, the Northern Irishman opened with a par but missed the fairway on the par-four second hole with his ball nestled next to a grassy bush.\n\nThe lie went from bad to worse with a discarded banana skin draping the ball, with McIlroy unable to remove it for fear of the ball moving which would mean a one-stroke penalty.\n\nHe hacked it out, the ball travelling only about 10 metres, and his third shot came up short, and he was unable to get up and down, making double-bogey.\n\nThe setback came after Friday’s embarrassment on the par-five 14th when McIlroy had a rare air swing after his tee shot finished up under a ti-tree, and he then clipped a branch on the backswing.\n\nHe was then able to escape with a one-putt bogey.\n\nShowing his class, golf’s newest grand slam winner immediately shook off Saturday’s early blow to birdie the par-four third.\n\nAAP",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/formula-1-oscar-piastri-struggles-as-lando-norris-leads-abu-dhabi-grand-prix-practice-20251206-p5nldh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We’re realistic’: McLaren will use team orders if necessary to secure F1 title",
        "publish_date": "Sat, 06 Dec 2025 12:31:59 +1100",
        "category": "sports",
        "authors": [],
        "text": "It was the perfect boost for the Briton, who’s 12 points ahead of Verstappen and 16 ahead of McLaren colleague Piastri, as the Dutch champion, second quickest on the day, still finished 0.363 slower than Norris in his Red Bull under the floodlights. Verstappen was also noted by stewards for impeding Norris in the first flashpoint of the weekend after the champion had been fed wrong information by his race engineer, but they decided not to investigate further. Lando Norris and members of the McLaren team in Abu Dhabi. Credit: Getty Images “What’s this guy doing? I almost crashed,” Norris had been left exclaiming. For Piastri, desperate for the pace he had in Qatar last weekend when only McLaren’s strategy blunder stopped him sweeping every session, it felt a stop-start day as, first, he spent the morning on the team’s pitwall.\n\nWhile Norris led Verstappen by 0.008sec in another one-two, he gave up his seat to reserve Pato O’Ward in a session designed largely for young prospects and development drivers. Piastri was doubtless itching to get out on track as his McLaren boss Zak Brown joked: “There’s some guy that has taken my seat!” Not much of a laughing matter for Piastri, though, as he started on the back foot in the second session, more representative of what they’ll all face on Sunday. He locked up on his quickest lap and couldn’t get near Norris’s fastest, with Brown noting: “Oscar is not totally dialled in yet but he will get there.”\n\nPiastri certainly didn’t seem concerned, appearing his usual unflappable self as he told reporters: “Finding my feet. Clearly, some things to try and improve for tomorrow, but after just one session, not too bad. “It’s more just little details, the car feels like it’s in a pretty decent place, but just didn’t get the grip out of it on that first soft lap. So some small tweaks for tomorrow, of course. It didn’t feel perfect out there, but nothing major.” Norris didn’t evidently want to get too high himself so early in the week, saying: “Obviously, from the times, things look good at the minute, but I still want a bit more from the car. I’m not completely happy, or completely confident. “We all know it gets a lot closer going into quali. So nothing to smile about just yet.” Loading\n\nVerstappen had more than a few grumbles about the Friday set-up of his Red Bull, complaining in the morning that “something is broken on the car”. Asked what the main areas of issue were by his race engineer Gianpiero Lambiase, he replied: “It is everywhere now.” Mercedes’ George Russell, who could play a key role yet in Sunday’s race, was third quickest in second practice. Brown elaborated on the prospect that McLaren might yet employ team orders in the race. Brown admitted: “If, as the race develops, it becomes clear one of our drivers has a significantly better chance than the other, then we’re a team that wants to win the drivers’ championship and we will race accordingly, to do whatever we can to get that driver in front to try and win the race.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/more-than-a-dozen-hospitalised-overnight-in-e-scooter-crash-spike-20251206-p5nldn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than a dozen hospitalised overnight in e-scooter crash spike",
        "publish_date": "Sat, 06 Dec 2025 11:40:25 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Thirteen people have been hospitalised after a spate of e-scooter and e-bike crashes across Queensland overnight ahead of fresh public hearings into the vehicles’ safety and enforcement.\n\nParamedics were called to 11 separate incidents, from Biloela to Palm Beach, between 6pm on Friday and 4.30am on Saturday – most in the south-east and all but two involving e-scooters.\n\nIn the worst accident, a teenage boy suffered significant foot injuries on the Gold Coast after an “e-scooter and vehicle incident” about 6pm, paramedics said.\n\nSince their introduction in Brisbane in 2018, the popularity of e-scooters and bikes has surged – along with injuries. Credit: Matt Dennien\n\nThen in Logan, a man in his 30s suffered what were described as significant leg injuries after an e-scooter fall just after 7pm. Both were taken to hospital in a stable condition.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/sydney-set-for-its-hottest-day-in-almost-two-years-20251206-p5nldi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney set for its hottest day in almost two years",
        "publish_date": "Sat, 06 Dec 2025 11:21:51 +1100",
        "category": "finance",
        "authors": [
            "Jack Gramenz",
            "Eryk Bagshaw"
        ],
        "text": "Sydney will swelter through its hottest day in almost two years as thousands of commuters are forced off the metro due to track work.\n\nThe temperature at Observatory Hill reached 31.4 degrees at 11am, with the heat forecast to rise to 39 degrees in the Sydney CBD and 41 degrees in Penrith by 3pm, marking Sydney’s hottest day since January 2024.\n\nSteven Crameri beats the heat at Penrith Beach on Saturday morning. Credit: Sitthixay Ditthavong\n\nA total fire ban is in place as the Rural Fire Service attempts to contain a fire in Bulahdelah that has burnt through 2685 hectares and is not yet under control.\n\nThe smoke from the fire has drifted across Sydney and the Central Coast, blanketing the city in a light haze which is expected to clear throughout the morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/frank-gehry-titan-of-architecture-dies-aged-96-20251206-p5nldq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Frank Gehry, titan of architecture, dies aged 96",
        "publish_date": "Sat, 06 Dec 2025 11:12:38 +1100",
        "category": "finance",
        "authors": [
            "Nicolai Ouroussoff"
        ],
        "text": "“I was rebelling against everything,” Gehry said in an interview with The New York Times in 2012, explaining his antipathy toward the dominant architectural movements of the time, as exemplified by the Farnsworth House on the Illinois prairie, a stark, flat, steel-and-glass modernist pavilion by Mies van der Rohe. “I couldn’t live in a house like that,” he said. “I’d have to come home, clean up my clothes, hang them properly. I thought it was snotty and effete. It just didn’t feel like it fit into life.” The Gehry-designed Dr Chau Chak Wing Building at UTS Business School in Sydney. Credit: Fairfax Media For some, his work was more sculpture than architecture. Others saw it as emblematic of a global culture that reduced architecture to a form of branding. Gehry, whose name was recognised around the world, was sometimes derided as a “star-chitect”. But his work’s emotional ferocity could feel empowering, as if architecture had rediscovered a part of itself that had been lost after decades of dreary functionalism and postmodernist cliches. And the widespread focus on his buildings’ dazzling exteriors could distract from Gehry’s deeper goals: to create an architecture that was not just affecting but democratic in spirit and evocative of the messiness of human life.\n\nHe was born Frank Owen Goldberg on February 28, 1929, in Toronto to Irving and Sadie (Caplan) Goldberg. His father held a series of jobs, including managing a grocery store and selling pinball and slot machines. Frank and his sister, Doreen, lived with their parents in a two-family house clad in brick and tar-paper shingles (a material he would use in some of his designs). As a boy, he worked part-time in his maternal grandfather’s hardware store, stocking the shelves with tools, screws and bolts – an experience, he said, that spawned his love of everyday materials. The Walt Disney Concert Hall in Los Angeles, another Gehry masterpiece, opened in 2003. Credit: Getty Images Once a week, his maternal grandmother would come home from the market with a live carp, another formative experience, which would inspire the fish imagery that later appeared in his work. “We’d put it in the bathtub,” Gehry recalled, “and I’d play with this fish for a day until she killed it and made gefilte fish” (a traditional Ashkenazi Jewish dish). Frank’s world abruptly fell apart in the mid-1940s, when his father, a heavy drinker, had a heart attack as the two were arguing on the front lawn, a memory that Gehry said haunted him for decades. His father never fully recovered. After a doctor warned that he would not survive another Toronto winter, the family moved to Los Angeles, renting a cramped $US50-a-month apartment in a run-down neighbourhood just west of downtown.\n\nAs an architect, Gehry was a late bloomer. After a brief stint in the army, he married Anita Snyder, who helped pay his way through the University of Southern California, where he initially studied ceramics. He shifted to architecture after a teacher introduced him to Raphael Soriano, a pillar of postwar modernism in Southern California. (It was around this time, too, that he adopted Gehry as his surname, a somewhat random choice inspired, he said, by the desire to avoid antisemitism.) Gehry spent several years toiling as a mid-level designer and project manager at Gruen Associates, a firm known for its shopping malls. After he opened his own office in 1962, much of his early work was for mainstream developers. He designed a sprawling headquarters for the Rouse Co. in Columbia, Maryland, and two unremarkable department stores for Joseph Magnin in California. ‘You go into architecture to make the world a better place. A better place to live, to work, whatever. You don’t go into it as an ego trip.’ Frank Gehry, speaking in 2012 But he was an outsider by nature, and he began looking beyond the work of other architects for inspiration. Like many Angelenos, he was drawn to the laid-back, anything-goes atmosphere of the city, whose mix of garish mansions, flimsy bungalows, vacant lots, Googie’s coffee shops and colourful billboards was the antithesis of East Coast architectural academicism. And he became close to a generation of Los Angeles artists – Robert Irwin, Billy Al Bengston, Ed Moses, Larry Bell – whose surfboard-inspired aesthetic and raw work spaces suggested an alternative to the chilly austerity of late modernism and the reactionary tendencies of postmodernism.\n\n“The artists were living in industrial buildings and warehouses,” Gehry said in the 2012 interview with the Times. “They were constantly moving things around – changing the rooms, building lofts or storage spaces. It was so free and unselfconscious. I wanted to do that.” In the late 1960s, Gehry and his wife divorced, and in 1975, he married Berta Aguilera. She survives him, along with their two sons, Sam, an architectural designer, and Alejandro, an artist; a daughter, Brina Gehry, from his previous marriage; and his sister, Doreen Gehry Nelson. Another daughter from his first marriage, Leslie Gehry Brenner, died in 2008. Gehry’s approach to his own Santa Monica home divided critics – and his neighbours. Credit: wikipedia.org The Gehrys bought their Santa Monica house, a two-story pink-stucco affair, in 1977. At Aguilera’s prodding, he began to tear it apart. The house’s rough, unfinished appearance attracted the attention of architecture critics, even as it infuriated neighbours. But its tormented forms – suggesting a world that had been ripped up and gently pieced back together – had their own kind of beauty. And the use of crude, everyday materials was Gehry’s assertion that the working-class aesthetic he had grown up with could be as appealing as anything found in the more refined corners of the city.\n\nDecades later, he and Aguilera moved out of the little house that had first brought him fame and into a more luxurious spread overlooking Santa Monica Canyon. Designed with his son Sam, the new house was a sprawling, sometimes awkward composition of angled, heavy-timber posts and beams. Nonetheless, it retained some of the rough-and-tumble qualities of Gehry’s earlier architecture, and its jostling forms reflected a lifelong quest for emotional and creative freedom. Gehry kept on working. An interior view of Gehry’s Luma Foundation building in Arles, France. Credit: Getty Images In 2017, he completed the Pierre Boulez Hall in Berlin, designed in collaboration with conductor Daniel Barenboim: a compact, box-like space with a sunken floor and a floating elliptical balcony, contained inside an austere neo-classical building from the 1950s. And in 2021, the Luma Foundation building in Arles, in southern France, was finished; a twisting tower of stainless-steel bricks, it was inspired, in part, by the rocky terrain of the nearby Alpilles mountain range. At his death, Gehry was completing several projects for luxury goods magnate Bernard Arnault, including an 7618-square-metre flagship store for Louis Vuitton in Beverly Hills, California, and, in Paris, the conversion of an abandoned 1960s building into an exhibition space and events hall down the block from Arnault’s Fondation Louis Vuitton building. He was also putting the final touches on a 1000-seat concert hall for the Colburn School of Music, near his Walt Disney Concert Hall in Los Angeles.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/socceroos-handed-tough-but-manageable-draw-for-world-cup-20251206-p5nldv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Socceroos handed tough but manageable draw for World Cup",
        "publish_date": "Sat, 06 Dec 2025 10:47:58 +1100",
        "category": "sports",
        "authors": [],
        "text": "Socceroos handed tough but manageable draw for World Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/historic-win-vast-indigenous-cultural-landscape-gains-protection-20251205-p5nl8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Historic win: Vast Indigenous cultural landscape gains protection",
        "publish_date": "Sat, 06 Dec 2025 10:46:50 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "A 33,000-square-kilometre expanse of land in south-west Queensland will be protected from major mining activity after federal Environment Minister Murray Watt placed the site of Indigenous significance on the National Heritage List.\n\nMithaka cultural landscape, which spans the Barcoo and Diamantina shires, has gained interest as the site of the East Lake Eyre Trade Route, believed to be the most extensive Indigenous trade and exchange network.\n\nThe area has multiple well-preserved sites, including quarries, standing gunyahs (homes), and stone arrangements. One of these quarries is the largest in the world created by a pre-agriculture society, and two of the housing structures date back to 1770 and 1787.\n\nAn aerial view of Mithaka quarries, one of which is the largest in the world created by a pre-agriculture society.\n\nThe site’s inclusion on the National Heritage List means anyone planning to carry out activities in the area will need a self-assessment of whether it could significantly impact the listed value of the area. This generally does not include day-to-day pastoral activities.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/truly-terrified-queensland-ballet-dancers-issue-on-stage-plea-for-funding-20251128-p5nj7k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Truly terrified’: Queensland Ballet dancers issue on-stage plea for funding",
        "publish_date": "Sat, 06 Dec 2025 10:39:32 +1100",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "Queensland Ballet dancers have made an extraordinary on-stage appeal to the federal government for more funding for their cash-strapped company.\n\nAt the opening night curtain call of The Nutcracker, soloist Georgia Swan asked the audience to sign a petition calling on the federal House of Representatives to increase ballet’s funding in line with other major Australian performing arts companies.\n\n“Despite over 60 years of success and the tireless efforts of our leadership team, we remain significantly underfunded compared to our industry peers,” Swan said, backed by the company’s dancers on the Lyric Theatre stage at the Queensland Performing Arts Centre.\n\nIn 2026, only two Queensland Ballet dancers will earn above the average wage, and 12 will be on the minimum wage. Credit: Angharad Gladding\n\n“This company is my family, and I am truly terrified about what may happen for us, and for Queensland, if we can’t secure a better funding outcome,” she said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/virginia-giuffre-s-family-asks-where-are-her-missing-millions-20251205-p5nlb1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Virginia Giuffre’s family asks: ‘Where are her missing millions?’",
        "publish_date": "Sat, 06 Dec 2025 10:22:39 +1100",
        "category": "finance",
        "authors": [
            "Connor Stringer",
            "Victoria Ward"
        ],
        "text": "Virginia Giuffre’s family members have raised questions over a “significant amount of missing money” in the ongoing row over what is believed to be her multimillion-dollar estate.\n\nGiuffre, who was 41 when she died in Western Australia in April, is thought to have amassed an estimated $US22 million ($33.1 million) fortune through victim compensation funds and civil lawsuit settlements relating to the years of abuse she suffered at the hands of the late American financier Jeffrey Epstein.\n\nVirginia Giuffre’s brother, Sky Roberts, has long challenged his brother-in-law’s right to inherit her money. Credit: Leigh Vogel for Sydney Morning Herald\n\nThis includes an estimated $US12 million payment she received from Andrew Mountbatten-Windsor, the former Prince Andrew, to settle a sexual abuse claim brought against him in 2022. Andrew has always vehemently denied any wrongdoing.\n\nHowever, court documents filed in the legal battle over her estate in Australia on Friday value it at just $472,000 – a legal threshold that dictates how assets in Australia are divided when there is no will. It may increase when more assets are discovered.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/is-labuschagne-back-the-signs-are-good-but-his-28-month-drought-continues-20251205-p5nlcc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Labuschagne back? The signs are good, but his 28-month drought continues",
        "publish_date": "Sat, 06 Dec 2025 10:17:02 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "The signs are promising that Marnus Labuschagne has announced himself as a mainstay of the Australian top order once again, as he cemented his reputation as the world’s most formidable batsman against the pink ball.\n\nBut the Queenslander’s hunt for an elusive century remains, in what will be the greatest indicator of whether the Labuschagne of old is truly back.\n\nThe No.3’s mid-year axing from the side has coincided with a new mentality, one free of the distrust in his instincts that plagued him for two years.\n\nMarnus Labuschagne, who made 65, has gone more than two years without a Test century. Credit: Getty Images\n\nOnce the world’s No.1 batsman, the 31-year-old has gone more than 28 months without a Test century, averaging 30.91 from the start of 2023 until the Ashes’ opening clash in Perth.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/this-sydney-lookout-was-once-a-local-secret-then-a-k-pop-star-came-20251202-p5nk9q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Sydney lookout was once a local secret. Then a K-pop star came to visit",
        "publish_date": "Sat, 06 Dec 2025 10:00:00 +1100",
        "category": "finance",
        "authors": [
            "Ellie Busby"
        ],
        "text": "Hidden down a dirt trail and with stunning panoramic views of Jamison Valley, Lincoln’s Rock at Wentworth Falls was once a local secret.\n\nBut now, on any given day hundreds of tourists flock to the Blue Mountains site to sit on the rock’s edge and capture the perfect Instagram shot.\n\nLincoln’s Rock has experienced a surge in visitors recently. Credit: Steven Siewert\n\nBlue Mountains Mayor Mark Greenhill said the recent influx of visitors could be explained by one thing: K-pop.\n\nIn 2023, one of the world’s biggest names in the Korean K-pop industry, Jennie from group Blackpink, shared with her 80 million-plus Instagram followers photos of herself at the lookout.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-would-anybody-want-to-be-an-independent-director-at-the-tigers-20251204-p5nkxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why would anybody want to be an independent director at the Tigers?",
        "publish_date": "Sat, 06 Dec 2025 10:00:00 +1100",
        "category": "finance",
        "authors": [
            "Darren Kane"
        ],
        "text": "Loading Wests Tigers Rugby League Football Club Pty Ltd is a voting member of ARLC and a licensee of the NRL, entitling it to participate in the NRL competition. Wests Tigers first participated under that licence in 2000. Before that time, there were the Balmain Tigers and the Western Suburbs Magpies; creatures hardly known for living in harmony in the wild. Each is a foundation rugby league club with a storied history. Wests Tigers’ membership of ARLC, and its licence agreement tethering it to the NRL, are interdependent - if the licence agreement is axed, the membership of ARLC cuts out too, and vice versa. Wests Tigers is a company with two shareholders: Balmain Tigers Rugby League Football Club Limited, and Wests Magpies Pty Limited. But this is where things unravel.\n\nThe internal governance of Wests Tigers isn’t a democracy, or anything close to it. Balmain holds 1,000,020 Class A ordinary shares in Wests Tigers; Wests Magpies holds quadruple that number. Wests Magpies owns 80 per cent of the total share equity and voting rights in Wests Tigers. But it wasn’t always that way, as you discover once you examine the history books (and the ASIC registers). Back in the simpler times of 1999, when the Magpies/Tigers arranged marriage was forged – with the spectre of extinction hovering – the union at least was an equal one. No more. Sustained financial calamities, striking with dreadful regularity throughout the last quarter-century, have manifested in the renegotiation of arrangements and the destruction of any semblance of balance in what’s now a husk of a “joint” venture.\n\nThe control of the Balmain and Wests Magpies shareholders is curiouser still. Balmain’s governance is unremarkable in a sporting club sense; the company is in the control of its members. Wests Magpies is fundamentally different. It has two shareholders: Western Suburbs Leagues Club Limited and Western Suburbs District Rugby League Football Club Limited. There’s three shares on issue in Wests Magpies: an A Class share, a B Class share and a C Class. Wests Leagues holds the A Class and B Class shares, Wests Football holds the C Class, but Wests Leagues exerts control over Wests Football regardless. Complicated, much? Wests Tigers is supposed to be governed by a nine-person board that includes “independent” directors. The concept of being a member of a football club connotes having a democratic say in things. Conversely, that’s not really how the Wests Tigers structure operates. And it seems nobody really values any independent thinkers and doers there.\n\nIn line with the unequal shareholdings, Wests Magpies has the power to appoint many more directors to Wests Tigers than Balmain can. But a different problem exists, in terms of how Wests Magpies itself makes decisions. West Magpies is a registered club, governed by both the Corporations Act and the Registered Clubs Act. The latter legislation prescribes the classes of members a registered club can have, and other internal governance rules. Like most registered clubs, there’s thousands of members. But a bizarre quirk of the Wests Magpies structure, is that the majority of power rests with a cohort of 20 “debenture” holders, who’ve (apparently) lent the club $100 at an interest rate of six per cent, in consideration for enjoying entry into the inner cabal that effectively controls Wests Magpies in terms of director appointments. It’s those 20 lenders, who control four-fifths of the voting strength of Wests Tigers, and the NRL franchise itself. Democratic? Hardly. But there are other issues here as well. Clause 47.1 of the Wests Tigers constitution says the company shall have a maximum of nine directors.\n\nLoading The appointment, removal and replacement of the directors is to occur in accordance with the company’s shareholder agreement and other instruments. The word “independent” is used no less than 55 times across the Wests Tigers’ constitution and shareholders agreement. There’s even an entire schedule that defines what the term means. Clause 4.11(g)(ii) of the shareholders agreement, governing the relationship between the Wests Tigers’ shareholders, casts material doubt on whether shareholders (not just Wests Magpies) can effectively give notice to remove an “independent director” as classified by the documents. Clause 4.11(g)(i) permits a shareholder who appointed a non-independent director to remove that director. Clause 4.11(g)(ii) requires notice from both shareholders AND National Rugby League Limited, to remove an independent director.\n\nWhich then leads to this question: which of Charlie Viola, Michelle McDowell, Annabelle Williams and Barry O’Farrell are the “independent directors” for the purpose of the Wests\n\nTigers governance documents? Those documents, in places, contemplate there being two independent directors. If there are only two directors of the four that, by proper definition, are the “independent directors”, legal questions exist about the proper basis for Wests Magpies’ belief that it, as the majority shareholder, can act alone. Wests Tigers CEO Shane Richardson. Credit: Oscar Colman Those questions need answers, before the Wests Tigers descend further. Whether O’Farrell or anyone else would bother torching money seeking Supreme Court injunctions about this stuff is hypothetical – who’d want to risk further damage to their reputation by seeking to stay in the tent? But assuming that Wests Magpies can issue a notice to remove an independent director, where that notice has proper legal effect, that then leads back to the fundamental question as to why anyone would want to be an independent director at all.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/man-seriously-injured-after-motorbike-collided-with-car-20251206-p5nldo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Man seriously injured after motorbike collided with car",
        "publish_date": "Sat, 06 Dec 2025 09:55:13 +1100",
        "category": "sports",
        "authors": [],
        "text": "Man seriously injured after motorbike collided with car\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/princess-of-wales-hosts-carols-service-20251206-p5nldc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Princess of Wales hosts carols service",
        "publish_date": "Sat, 06 Dec 2025 08:36:08 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Princess of Wales hosts carols service\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-markle-reaches-out-to-her-estranged-father-20251206-p5nldd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan Markle reaches out to her estranged father",
        "publish_date": "Sat, 06 Dec 2025 08:35:07 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan Markle reaches out to her estranged father\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/trump-has-orchestrated-a-golden-age-for-australia-20251204-p5nkrd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump has orchestrated a golden age for Australia",
        "publish_date": "Sat, 06 Dec 2025 08:30:00 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "By October, gold had topped $US4000 an ounce for the first time – soaring 60 per cent for the year and outperforming both the US sharemarket and a woeful bitcoin. UBS notes that market analysts have struggled to keep up with gold’s parabolic ascent and says the precious metal could top $US4750 in the second half of next year. People line up to buy gold and silver bullion at ABC Bullion in Sydney’s Martin Place. Credit: Dominic Lorrimer “We continue to see a supportive market backdrop for gold, noting that the foundations of gold’s ascent – particularly the structural shift in private and official sector demand – suggest that price risks remain skewed to the upside over the next 12 months,” UBS analysts say. There may be more to the soaring gold price than Trump, but it would certainly not have achieved its current trajectory without him.\n\nWhile the public focus has been on the sight of Australians literally queuing up to buy gold as the precious metal topped fresh highs, the real action has been from sovereign nations, their reserve banks and wealthy buyers. China and Russia have joined the buying frenzy to avoid the risk of investing in US financial assets in the age of Trump. New figures from the Australian Bureau of Statistics showed the country shipped $5.7 billion in non-monetary gold to the rest of the world in October alone. Credit: Bloomberg But they are not alone. Other countries, reserve banks and investment professionals are buying the precious metal by the truck load as a hedge against the so-called debasement of traditional stores of wealth like the US dollar and government bonds, which risk having their value eroded by massive government spending and rising debt levels. The argument is simple, why store your wealth in financial instruments in governments spending way more than they earn, and whose only way out of the fiscal mess is to devalue their currencies and what they owe to lenders via the bond market?\n\nLoading It means that the average buyer at the Perth Mint is merely the froth on our nation’s latest flood of wealth. Australia is one of the globe’s biggest gold producers and exporters, and it is starting to show up in the numbers that count, including Australia’s export numbers and GDP. The Minerals Council of Australia really put things in perspective in October when it forecast that gold is now on its way to becoming our second-biggest export earner behind our world-leading iron ore industry. It forecasts that gold exports will soar this year and top $60 billion, putting it well ahead of Australia’s dominant LNG and coal export sectors.\n\nIt will add to the tens of billions of dollars that Australia as a nation collects from elevated commodity prices each year and acts as a counterbalance to waning bulk commodity prices as China’s economy matures. The most startling metric is how – despite Trump’s trade war with the world including Australia – the trade deficit between the two countries has not been this low in more than 20 years. A big driver has been the tenfold increase in gold exports to the US, which topped $US10.6 billion for the year to September. As with our soaring beef trade with the US, this was not how things were meant to pan out for a country like Australia – built on global trade – in a world supposedly being forced to choose between the US and China. Local gold miners are already spending a fortune to increase capacity – including multibillion-dollar deals like ASX-listed Perseus Mining’s pursuing West African gold explorer Predictive Discovery to create a $10 billion gold miner. It is an expensive process to commercially exploit the tiny gold seams, of course, and for the average punter, it’s not easy to get to terms with its modest scale compared to the vast bulk exports of iron ore, coal and LNG.\n\nAustralia will export 900 million tonnes of iron ore this year compared with gold production expectations of just 369 tonnes, according to the MCA. Loading But iron ore trades at less than $US100 a tonne. Gold is currently trading at $US131 million a tonne. And we don’t need to worry about the gold boom going bust just yet – not with Trump less than a year into his second term. His pick for head of the US Federal Reserve is just the latest threat to the sort of orderly financial world that kills gold booms as professional market watchers know all too well.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/make-memories-the-tragic-reality-of-childhood-dipg-and-the-new-research-giving-families-hope/2x3x9nh6j",
        "title": "'Make memories’: the tragic reality of childhood DIPG and the new research giving families hope",
        "publish_date": "Fri, 5 Dec 2025 20:30:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPippa Rae was nine years old when she was diagnosed with diffuse intrinsic pontine glioma, or DIPG.\n\n\n\n\n\nHer mother, Virginia, says she was a remarkable child.\n\n\n\n\n\n\"Pippa was a really vibrant personality. She was everybody's friend. She had lots of friends. She was sporty, athletic. She just made the most of life. It was almost like she lived an entire life in 11 years.\"\n\n\n\n\n\nIt's a rare and aggressive type of deadly brain cancer that forms in the brain stem - it mainly affects children.\n\n\n\n\n\nVirginia says Pippa's diagnosis was shattering.\n\n\n\n\n\n\"Your whole world comes crumbling down. At that point, I didn't realise that it was the worst possible tumour that anybody could be delivered, but I'd never had experience with brain tumours. You know that brain tumours are bad but to know the extent of that - I didn't know at the time.\"\n\n\n\n\n\nThe cancer is challenging to treat due to its location and infiltrative nature, making surgical removal impossible - so survival rates are so low.\n\n\n\n\n\nFamilies are often told to spend their time making memories.\n\n\n\n\n\nPippa died 21 months after she was diagnosed.\n\n\n\n\n\nShe was just 11 years old.\n\n\n\n\n\n\"We were very fortunate that we had 21 months and the majority of that time Pippa was relatively well and she was able to travel with us, so one of the best memories was living out her dream and taking her to Paris, and that's just something that remains with our family forever. It was a very beautiful and special time and we spent two weeks there.\"\n\n\n\n\n\nThe Australian Cancer Research Foundation has awarded a $2.5 million grant to the Walter and Eliza Hall Institute of Medical Research in Melbourne.\n\n\n\n\n\nIt will fund a lab dedicated to research treatments for brain cancers like DIPG in children and glioblastoma - another aggressive type of brain cancer - in adults.\n\n\n\n\n\nKerry Strydom is the C-E-O of the Cancer Research Foundation.\n\n\n\n\n\n\"There really isn't a fantastic treatment option at the moment and what we are hoping is that this grant will provide hope to families with children with DIPG.\"\n\n\n\n\n\nThe ACRF Brainstorm Research Lab will use AI and other tools to test thousands of treatment options and determine the best course of action.\n\n\n\n\n\nIt will also fund a clean room to make personalised cell therapies for patients.\n\n\n\n\n\nProfessor Misty Jenkins, the head of the Walter and Eliza Hall Institute, admits it's a challenge.\n\n\n\n\n\n\"Prognosis for DIPG is the most dismal of any other cancer, and in fact, brain cancers kill more children than any other disease. And so the dial hasn't shifted for decades. And unfortunately oncologists are still having the same conversations with patients, which is telling them to go home and make memories with their families, and that there are no options available. And so we really need to start working together and collaborating better and really start to take more of a creative approach to tackling these really insidious, intractable diseases like brain cancer.\"\n\n\n\n\n\nThe Brainstorm project will test new drugs as well as therapies for brain cancers, which they hope will speed up the process from discovering treatment options right through to clinical trials.\n\n\n\n\n\n\"This is an end to end pipeline, so it's going from the drug discovery using AI approaches and liquid handling robots for drug screening all the way through to laboratory based testing all the way through to our patients that are in the operating room, having their tumours removed, and then being able to sequence some quickly and diagnose quickly, and then using that information to inform our drug design.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-is-the-fifa-peace-prize-and-why-was-trump-selected-as-the-inaugural-recipient/48x417rme",
        "title": "What is the FIFA peace prize, and why was Trump selected as the inaugural recipient?",
        "publish_date": "Fri, 5 Dec 2025 20:18:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "The draw for the 2026 World Cup took place in Washington on Saturday morning AEDT, with US President Donald Trump playing a prominent part in a star-studded ceremony that will map the path to glory for contenders at the first ever 48-team finals.\n\n\n\n\n\nBefore the draw began at the Kennedy Center, FIFA chief Gianni Infantino, who has built a close relationship with Trump, awarded the US president FIFA's inaugural peace prize.\n\n\n\n\n\nFIFA says the honour \"recognises the enormous efforts of those individuals who unite people, bringing hope for future generations\".\n\n\n\nA video prior to the presentation celebrated Trump for resolving the war in Gaza and trying to end Russia's war in Ukraine.\n\n\n\n\n\nThe trophy, a gold-plated globe carried by upraised hands, was considerably larger than the Nobel, which is just a simple medal.\n\n\n\n\n\nHe took a moment to congratulate himself. The United States, he said, was \"not doing too well\" before he took office, but now \"we're the hottest country anywhere in the world.\"\n\n\n\n\n\nEarlier, Trump told reporters he did not care about the prize, but noted that he had \"settled eight wars\" in his 10 months in office.\n\n\n\n\n\n\"I don't need prizes. I need to save lives,\" Trump said. \"I saved millions and millions of lives, and that's really what I want to do.\"\n\n\n\nThe most logistically complex World Cup in history will be held across the United States, Mexico and Canada from 11 June to 19 July, with 16 more teams added to the global showpiece, up from the 32 nations involved in Qatar in 2022.\n\n\n\n\n\nThe draw was co-hosted by supermodel Heidi Klum and American actor and comedian Kevin Hart, and featured performances by the Village People, Robbie Williams and Andrea Bocelli.\n\n\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw.\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw. Source: AP / Alex Brandon Trump has made the World Cup a centrepiece event of both his second presidency and the 250th anniversary of US independence next year.\n\n\n\n\n\nBut he has injected domestic politics into the preparations, threatening to move World Cup matches from Democratic-run cities if he deems conditions \"unsafe\".\n\n\n\n\n\n\"I would call Gianni, the head of FIFA, who's phenomenal, and I would say, let's move it to another location. And he would do that,\" Trump said recently.\n\n\n\n\n\nEleven of the 16 World Cup venues are in the United States, with three in Mexico and two in Canada.\n\n\n\n\n\nThe Azteca Stadium in Mexico City will host the opening game and the final will take place at the MetLife Stadium outside New York City.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-6-december-2025/thgghatj1",
        "title": "Socceroos draw co-hosts US for next year's World Cup | Morning News Bulletin 6 December 2025",
        "publish_date": "Fri, 5 Dec 2025 20:09:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has been drawn in the same group as co-hosts in the United States for next year's football World Cup.\n\n\n\n\n\nThe draw for the tournament has been held in Washington in the presence of dignitaries including U-S President Donald Trump.\n\n\n\n\n\nAustralia is in Group D next June alongside the U-S, Paraguay, and the winner of next March's European playoff between Turkiye, Romaania, Slovakia, and Kosovo.\n\n\n\n\n\nFIFA has clarified that exact dates, times, and venues for each match will be confirmed tomorrow.\n\n\n\n\n\nThe top two teams in each of the twelve groups, plus the eight best-ranked third-placed teams, will make it to the knockout stage of the newly-expanded 48-team men's World Cup.\n\n\n\n\n\n+++\n\n\n\n\n\nUS President Donald Trump has become the first ever recipient of FIFA's inaugural peace prize at the 2026 World Cup draw.\n\n\n\n\n\nGianni Infantino, the head of world football's governing body and a close ally of the President, presented Mr Trump with the award during the ceremony.\n\n\n\n\n\nIn accepting the award, Mr Trump said it was one of the great honours of his life.\n\n\n\n\n\n\"We saved millions and millions of lives. The Congo is an example. Over 10 million people killed, and it was heading for another 10 million very quickly. The fact that we could do that, India, Pakistan, so many different wars that we were able to end, in some cases, a little bit before they started, just right before they started. It was going to be late, but we got them done.\"\n\n\n\n\n\nMr Infantino says Trump won the award for exceptional and extraordinary actions to promote peace and unity around the world.\n\n\n\n\n\n+++\n\n\n\n\n\nRussian President Vladimir Putin says he is ready to continue uninterrupted shipments of fuel to India, in spite of heavy pressure from the United States for India to stop buying oil from Moscow.\n\n\n\n\n\nPrime Minister Narendra Modi is hosting Mr Putin at a summit in New Delhi dominated by energy, defence and trade talks.\n\n\n\n\n\nIn his first visit to the country since Russia's full scale invasion of Ukraine, Mr Putin was given a red-carpet welcome with an honour guard and 21-gun salute.\n\n\n\n\n\nHe says the countries pledged to develop multi-faceted relations - and boost trade and the supply of oil and gas.\n\n\n\n\n\n+++\n\n\n\n\n\nDangerous fire conditions are set to continue across parts of eastern Australia with fears dry lightning risks sparking new blazes.\n\n\n\n\n\nIn Tasmania , authorities say it is not yet safe for residents affected by a fire at Dolphin Sands to return home, after more than a dozen buildings and cars were damaged and two firefighters injured.\n\n\n\n\n\nBut cooler temperatures and showers washing across the state [[on Saturday]] will likely bring relief to fire crews.\n\n\n\n\n\nA fire on the New South Wales mid-north coast at Bulahdelah has been downgraded to advice but is not yet under control.\n\n\n\n\n\nTotal fire bans are in place across much of the state, with heatwave conditions set to remain throughout the day.\n\n\n\n\n\nIn Victoria, firefighters are working to contain a bushfire in Markwood, northeast of Melbourne, which has affected at least three properties.\n\n\n\n\n\n+++\n\n\n\n\n\nThe National Commissioner for Aboriginal and Torres Strait Islander Children and Young People has slammed Victoria's new 'adult time for violent crime' laws.\n\n\n\n\n\nThe legislation passed Parliament late Thursday [[041225]], allowing children as young as 14 to face life sentences for a number of violent crimes.\n\n\n\n\n\nThese include home invasion, carjacking and armed robbery, with the legislation mirroring similar tough-on-crime reforms in Queensland.\n\n\n\n\n\nCommissioner Sue-Anne Hunter has told NITV that the laws breach Australia's human rights obligations and won't make communities safer.\n\n\n\n\n\n\"Because we're not addressing the underlying issues of whatever that is for that child, whether it be a health issue, undiagnosed, whether it be family violence at home, you know if we don't intervene early, this will continue to happen. Each time we choose punishment over prevention, we compound their trauma, fuel re-offending, and entrench the very behaviours that we claim we want to stop as a society.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn cricket, Australia is on top after two days of the second Ashes test against England in Brisbane.\n\n\n\n\n\nAfter dismissing England for 334 in their first innings early on day two, Australia is 6 for 378 in their own first innings.\n\n\n\n\n\nThat's a lead of 44 runs, with four wickets in hand entering day three.\n\n\n\n\n\nThe Australians, who scored at more than five runs per over, were helped by England dropping four catches in the final session.\n\n\n\n\n\nOpening batsman Jake Weatherald top-scored for Australia, scoring 72.\n\n\n\n\n\nMarnus Labuschagne was second-top score, getting 65.\n\n\n\n\n\nHe's told Fox Cricket Australia have set themselves up to bowl at England in favourable conditions on the evening of day three.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/for-millions-of-australian-retailers-christmas-cheer-turns-to-fear-as-theft-soars/13ajosv1c",
        "title": "For millions of Australian retailers, Christmas cheer turns to fear as theft soars",
        "publish_date": "Fri, 5 Dec 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nShoplifting has become so relentless at Orange Supermarket in Sydney's south that staff say it now feels like part of the daily routine.\n\n\n\n\n\nLizhen Cai explains.\n\n\n\n\n\n\" Basically, theft happens every day and on average the losses range from $200-300 on smaller days to $500-600.\"\n\n\n\n\n\nAnd the thefts add up.\n\n\n\n\n\nAnnual losses of around $150,000 cut deeply into already-thin margins.\n\n\n\n\n\nMost thefts are small and easily hidden, according to staff member Harry Zhao.\n\n\n\n\n\n\" The most common cases are petty theft, where people quietly slip drinks or snacks into their bags or pockets while browsing.\"\n\n\n\n\n\nStore assistant Ray Huang says offenders come from all ages and backgrounds, though one group stands out.\n\n\n\n\n\n\" Offenders range from young to old, but the majority are young people.\"\n\n\n\n\n\nIt’s a view reinforced by a recent Monash University survey of 1,047 Australian shoppers aged 18 and older, released in October.\n\n\n\n\n\nThe Consumer Deviance Spotlight report ’s lead author is Stephanie Atto:\n\n\n\n\n\n\" Younger people are certainly more accepting of theft. Survey found that 54% of 18-to-34 year olds said that retail theft was justifiable to some degree.\"\n\n\n\n\n\nThe Australian Bureau of Statistics reported 270,000 retail thefts last year, a rise of 7 per cent on the previous year, and the highest in two decades.\n\n\n\n\n\nMs Atto says it’s part of a broader shift in attitudes.\n\n\n\n\n\n\" During an alarming crime rise, Australia is certainly more accepting of retail theft and our survey found that one in four believed it was justifiable to some degree to commit retail theft including taking an item and not paying for it. We do expect an increase in retail crime leading up to Christmas and we do say that retailers need to certainly be vigilant and also that police and law enforcement need to be out there looking after retailers as well.\"\n\n\n\n\n\nOver the past year, Victoria recorded the highest rise in all robberies, up by 16 per cent, followed by Tasmania with 11 per cent. Dr Vincent Hurley is a lecturer in criminology at Macquarie University, and a former police officer.\n\n\n\n\n\n\" There's inflation, there's stagnation of their wages if they're working part time. So even to survive, they would consider stealing to be a way to survive in this cost-of-living crisis.\"\n\n\n\n\n\nHowever, not everyone agrees.\n\n\n\n\n\nUp to 93 per cent of consumers aged 55 years and older view shoplifting as ‘not at all justifiable’.\n\n\n\n\n\nDr Hurley says self-checkouts that depersonalise payments, may be part of the problem.\n\n\n\n\n\n\"They do not see stealing from an individual, from a person. They see the stealing from an organization, a corporation, which has no face, it has no identity.\"\n\n\n\n\n\nSeventy per cent of shop owners report a rise in shoplifting over the past financial year.\n\n\n\n\n\nDespite retailers, police and peak bodies uniting to crack down on repeat offenders, Dr Hurley says the crime surge shows no signs of slowing.\n\n\n\n\n\n\" We should be worried about this trend as a society, absolutely! Low level crime can lead to much wider and more crime.\"\n\n\n\n\n\nCrime Stoppers Victoria reports that nearly 70 per cent of retail theft in that state is committed by repeat offenders, many operating in well-organised networks.\n\n\n\n\n\nIt’s one reason Harry Zhao fears fighting theft is a losing battle.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-fifa-world-cup-2026-opponents-revealed/r064zjm0t",
        "title": "First time since 1974: Australia's FIFA World Cup 2026 opponents revealed",
        "publish_date": "Fri, 5 Dec 2025 19:26:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2026 FIFA World Cup draw was as dramatic as the Andrea Bocelli performance that opened the ceremony — revealing the fate of every nation for football's biggest stage in the US, Canada and Mexico and a new peace prize.\n\n\n\n\n\nThe event was hosted by Comedian Kevin Hart and Heidi Klum, a German-American TV Personality, at the Kennedy Centre in Washington, DC, where FIFA president Gianni Infantino made the opening remarks describing the World Cup as '104 Super Bowls in one month' for the Americans.\n\n\n\n\n\n\"Welcome in all the languages of the world, in the language of football, which is the language of passion. FIFA is the official happiness provider of humanity,\" he said.\n\n\n\n\n\nHere's what happened at the glitzy 2026 FIFA World Cup draw event:\n\n\n\nWho is in Australia's group?\n\nFormer Manchester United and England defender Rio Ferdinand, along with broadcaster Samantha Johnson and sporting icons such as Tom Brady, Wayne Gretzky, Aaron Judge, and Shaquille O'Neal, conducted the draw for 48 national teams, placing them in 12 different groups.\n\n\n\n\n\nO'Neal drew Australia's name for group D, meaning the Socceroos will be playing against one of the hosts, the US (USMNT), and Paraguay.\n\n\n\n\n\nThis will be the first time Australia is facing the host nation since 1974 in Germany.\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw. Source: AP / Alex Brandon The other team in the group will be the winner of playoff C, which will be between Turkiye, Romania, Slovakia, and Kosovo.\n\n\n\n\n\nSocceroos Head Coach Tony Popovic, has described the group as \"tough\", but said the team is \"looking forward to the challenge that lies ahead\".\n\n\n\n\n\n\"Finally finding out exactly who we will be playing at the FIFA World Cup 2026™ makes it all feel a lot more real. Now the real planning can begin,\" he said.\n\n\n\n\n\n\"There is still a bit of unknown in drawing a team from UEFA Play-Off C and we play them first — but we're excited.\"\n\n\n\nHow tough is Australia's group?\n\nThe draw means Australia has avoided coming up against the world's top teams in the group stage, including Spain, Argentina, France, and England.\n\n\n\n\n\nPosting on X, a former Australian football player and sports analyst has described Australia's group as \"positive but challenging group for Australia\".\n\n\n\n\n\n\"Playing home nation will be fantastic, great focus and drama, and the US support at a home event will be immense, and exciting,\" he said.\n\n\n\n\n\nThe United States, the world's No.14-ranked team, will be the hardest team Australia is facing. The Socceroos have played the US four times, for one win, one draw and two losses.\n\n\n\n\n\nSpeaking on Fox, the USMNT manager, Mauricio Pochettino, pointed out their previous clash against Australia.\n\n\n\n\n\n\"We need to respect all the opponents. All is going to be difficult. We know Paraguay was doing so well in the South American qualification. Australia, until we played them, were unbeaten in 12 or 13 games,\" he said.\n\n\n\n\n\n\"Full respect, but yes, believing that we can go through. But we need to perform.\"\n\n\n\nThe last time Australia won a match against the US was their first friendly game in 1992.\n\n\n\n\n\nAustralia have not played world No.39 Paraguay since a 1-0 friendly win in 2010 but are unbeaten in five clashes — two wins, three draws — with the South American team.\n\n\n\n\n\nThe Socceroos have never faced Kosovo, they've lost twice to Türkiye, have one defeat against Romania and one draw against Slovakia.\n\n\n\nWhen and where are the Socceroos playing?\n\nTeams will wait for confirmation of the venues and dates for all their group matches on Saturday (Sunday morning AEDT). Since the Socceroos are in the group with one of the hosts, their games are likely to be scheduled on North America's west coast.\n\n\n\n\n\nThe Socceroos' opponent for the first match is still unknown, as the national team will play their first match against the winner of playoff C between Slovakia, Kosovo, or Turkiye, on 13 June in Vancouver.\n\n\n\n\n\nOn 19 June, Australia will be facing the hosts, United States, in Seattle, probably for their most important match in the group stage.\n\n\n\n\n\nSix days later, for their last match, Australia will face Paraguay in Santa Clara.\n\n\n\nWhat if the Socceroos qualify?\n\nBased on the new World Cup rules, the top two teams from each of the 12 groups will qualify to the next stage, along with the eight best third-placed teams.\n\n\n\n\n\nIf the Socceroos win group D, they will face the best third-placed team from groups A, B, C, D or F, and if they get second, they have to play against the runners-up of group G, one of Egypt, Iran or New Zealand.\n\n\n\n\n\nFinishing one of the eight best third-placers will also mean that the Socceroos will face the Group E, I, or K winner.\n\n\n\nFull group draw revealed\n\nGroup A: Mexico, South Africa, South Korea, Play-off D winner (Czechia, Ireland, Denmark or Macedonia\n\nGroup B: Canada, Play-off A winner (Wales, Bosnia and Herzegovinam, Italy or Northern Ireland), Qatar, Switzerland,\n\nGroup C: Brazil, Morocco, Haiti, Scotland\n\nGroup D: The US, Paraguay, Australia, Play-off C winner (Slovakia, Kosovo, Turkiye or Romania)\n\nGroup E: Germany, Curaçao, Ivory Coast, Ecuador\n\nGroup F: Netherlands, Japan, Play-off B winner (Ukraine, Sweden, Poland or Albania) Tunisia\n\nGroup G: Belgium, Egypt, Iran, New Zealand\n\nGroup H: Spain, Cabo Verde, Saudi Arabia, Uruguay\n\nGroup I: France, Senegal, Play-off 2 winner (Bolivia, Suriname or Iraq), Norway\n\nGroup J: Argentina, Algeria, Austria, Jordan\n\nGroup K: Portugal, Play-off 1 winner (New Caledonia, Jamaica or Democratic Republic of the Congo), Uzbekistan, Colombia\n\nGroup L: England, Croatia, Ghana, Panama\n\nWhich is 'the group of death'?\n\nIt looks like for 2026, it will be hard to pick 'the group of death'.\n\n\n\n\n\nHowever, Group I (France, Senegal, playoff 2 winner —Bolivia, Suriname or Iraq — and Norway) can be one to watch, as the French superstar Kylian Mbappe, will be facing the Norwegian goal scorer Erling Haaland.\n\n\n\n\n\nGroup L (England, Croatia, Ghana and Panama) is another one to watch, as England might be looking for revenge from Croatia, who beat them in the 2018 World Cup semifinal, bringing their World Cup streak to an end at that time\n\n\n\nTrump winning the controversial '2025 FIFA peace prize'\n\nThe event, however, was not just about football, as Infantino presented the inaugural FIFA peace prize to the US President Donald Trump.\n\n\n\n\n\nInfantino said the award is presented by \"billions of football lovers\", and they gave the award to Trump for his \"actions to provide peace around the world\".\n\n\n\n\n\nInfantino said: \"This is what we want from a leader, a leader that cares about the people. We want to live in a safe world, in a safe environment … and you definitely deserve the first FIFA peace prize.\"\n\n\n\nFIFA said the peace prize \"recognises the enormous efforts of those individuals who unite people, bringing hope for future generations\". Source: AP / Chris Carlson/AP The prize was announced in early November and has since raised questions about whether Trump will be its first recipient.\n\n\n\n\n\nTrump and Infantino are known to have a close relationship.\n\n\n\n\n\nInfantino has supported Trump’s nomination for this year’s Nobel Peace Prize, and he was the unexpected guest of the Egypt Peace Summit, being invited personally by Trump.\n\n\n\n\n\nAfter receiving the FIFA peace prize, Trump said: \"This is truly one of the great honours of my life and beyond.\"\n\n\n\n\n\n\"The world is a safer place now ... Now I have to say we’re the hottest country anywhere in the world and we’re going to keep it that way,\" he said.\n\n\n\nHow to watch the World Cup?\n\nThe first match will be played between Mexico and South Africa on 11 June, at Estadio Azteca in Mexico City, and the tournament will be determined on 19 July, at MetLife Stadium in New Jersey.\n\n\n\n\n\nYou can watch all 104 games of the FIFA World Cup 26™ Live, free and exclusive on SBS, SBS VICELAND and SBS On Demand , next year.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ulurus-ayers-rock-resort-sold-to-us-company/8k5lb6k93",
        "title": "Uluru's Ayers Rock Resort sold to US-owned tourism company",
        "publish_date": "Fri, 5 Dec 2025 10:49:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Ayers Rock Resort in Uluru will change hands to a US private equity-owned tourism company, as part of a deal that will see the resort's land and buildings returned to Traditional Owners.\n\n\n\n\n\nThe resort, owned by the Indigenous Land and Sea Corporation (ILSC) and operated by the corporation's subsidiary Voyages Indigenous Tourism Australia, is the sole accommodation option for tourists visiting Uluru.\n\n\n\n\n\nThe ILSC struck an agreement with \"experiential tourism\" company Journey Beyond, a firm owned by New York-based Crestview Partners that already operates notable tourism assets across Australia including the Ghan and Indian Pacific railways.\n\n\n\n\n\nJourney Beyond will purchase the operational assets of Voyages Indigenous Tourism Australia, which include the Ayers Rock Resort and the Mossman Gorge Cultural Centre in far north Queensland.\n\n\n\n\n\nLand and buildings at both locations will be transferred to Traditional Owners, the Aṉangu Pitjantjatjara Yankunytjatjara and the Kuku Yalanji, respectively.\n\n\n\nThe ILSC was set up in 1995, a decade after the historic Mabo High Court decision that recognised Torres Strait Islander and Aboriginal traditional title to land.\n\n\n\n\n\nHowever, a government agreement required Aṉangu to lease the park to the Australian National Parks and Wildlife Service for 99 years.\n\n\n\nLand returned after years of work\n\nThe latest partnership deal will see the communities paid rent from Journey Beyond's leasing of the sites on 90 and 10-year leases, respectively.\n\n\n\n\n\nILSC chief executive Joe Morrison said the deal was \"the culmination of years of work\" to transfer the land to Traditional Owners, with more than $500 million in benefits to flow to the First Nations community.\n\n\n\n\n\n\"We are pleased to move closer to fulfilling the ILSC's statutory obligations of returning land to Aboriginal and Torres Strait Islander peoples,\" he said in a statement on Friday.\n\n\n\n\n\nJourney Beyond chief executive Chris Tallent said the company had worked with Indigenous communities across Australia and the agreement aligned with its goal to create \"immersive, authentic and uniquely Australian\" experiences.\n\n\n\nThe transaction is expected to be finalised early in 2026, with the divestment of the Yulara land to Aṉangu also expected to be finalised in 2026.\n\n\n\n\n\nThe Yulara Anangu Corporation board said Traditional Owners were happy with the decision and described the agreement as \"an investment in our future that will bring benefits in employment, education and support for Anangu enterprises\".\n\n\n\n\n\n\"We look forward to working closely with Journey Beyond in the development of world-class Indigenous tourism experiences that will share our language, our culture and our rich landscapes with visitors from all over Australia and around the world,\" the board said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/tasmania-afl-stadium-gets-official-approval-after-years-of-debate/w7a2oxpdu",
        "title": "Tasmania AFL stadium gets official approval after years of debate",
        "publish_date": "Fri, 5 Dec 2025 08:30:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tasmania AFL stadium gets official approval after years of debate\n\nPublished 5 December 2025, 6:11 am\n\nIt's official. Tasmania will get its own AFL stadium and team in the national football competition, after the state's parliament passed controversial plans to build the 1.1 billion dollar stadium. It follows years of debate and division, with opponents vowing their fight isn't over.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/openai-invests-in-australia-markets-prepare-for-us-and-local-interest-rates-decision/w1ziighwi",
        "title": "OpenAI invests in Australia & markets prepare for US and local interest rates decision",
        "publish_date": "Fri, 5 Dec 2025 06:16:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/revealed-the-travel-hotspots-australians-are-heading-to-this-summer/oin7dr97m",
        "title": "Revealed: The travel hotspots Australians are heading to this summer",
        "publish_date": "Fri, 5 Dec 2025 04:37:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "With Christmas holidays looming and temperatures rising, so too are desires for an end-of-year escape.\n\n\n\n\n\nCase in point: 74 per cent of Australians are planning a summer holiday, according to a new survey of 1,510 Australians from the Tourism and Transport Forum (TTF), the peak body for businesses in the tourism, transport and aviation sectors.\n\n\n\n\n\nBut cost pressures and tighter budgets mean more travellers are sticking to domestic or local sights. Around 34 per cent plan to holiday within their own state and 25 per cent hope to travel interstate. Just 15 per cent of Australians say they're heading overseas.\n\n\n\n\n\nHere are the states, cities, regions and countries set to attract the most visitors this summer.\n\n\n\nWhat are this year's travel hotspots?\n\nWhen it comes to interstate travel, there are two clear frontrunners: NSW and Queensland, attracting 29 per cent of domestic Australian travellers each.\n\n\n\n\n\nThey're followed by Victoria (22 per cent), then Western Australia and South Australia (both 6 per cent).\n\n\n\n\n\nThe survey found the most popular individual destination to be the Gold Coast, with 11 per cent planning to soak up the sun there. Sydney (10 per cent), Melbourne (9 per cent) and Brisbane (5 per cent) round out the top picks.\n\n\n\n\n\nOther emerging hotspots include Coffs Harbour and NSW's South Coast.\n\n\n\nThe Gold Coast is the most popular destination for Australian travellers this summer. Internationally, Aussies also plan on flocking to New Zealand. Source: SBS News\n\nWhere are Australians heading overseas?\n\nFor those going abroad, New Zealand remains the top choice, with 14 per cent of people who are travelling overseas planning to head across the ditch.\n\n\n\n\n\nEurope is rebounding too: 12 per cent of travellers will take a winter holiday, up from 9 per cent last year.\n\n\n\n\n\nAustralia's love affair with Japan will continue, with 11 per cent heading there this summer.\n\n\n\n\n\nTrips to Bali and Indonesia have nudged up from 8 per cent to 10 per cent, while Thailand and the US round out the list of most visited international destinations.\n\n\n\nAccording to TTF's report, 54 per cent of Australians say financial pressure has impacted their travel plans. Source: SBS News TTF's report also found 54 per cent of Australians say financial pressure has impacted their travel plans.\n\n\n\n\n\nIn response, many are taking shorter trips and planning to holiday for seven days or less.\n\n\n\n\n\nOthers are waiting for last-minute travel deals and discounts, while some plan on saving coin by travelling domestically instead of overseas.\n\n\n\n\n\nMost travellers (75 per cent) plan to spend under $5,000, while 18 per cent expect to spend between $5,000 and $10,000.\n\n\n\nREAD MORE Australia is facing a hot summer — but the forecast comes with caveats\n\nShifting away from the coast\n\nMeanwhile, Expedia's Summer Travel Outlook report from November paints a slightly different picture; while Queensland dominates, the popularity of quieter, cooler inland destinations is rising fast.\n\n\n\n\n\nIts survey of 1,000 Australians travelling this summer showed all top ten domestic destinations (excluding capital cities) are in Queensland, especially the Gold Coast and Sunshine Coast areas.\n\n\n\n\n\nBut there's a clear shift inland, with searches surging for:\n\n\n\n\n\n— Yarra Valley, Victoria (+85 per cent)\n\n\n\n— Jindabyne, NSW (+65 per cent)\n\n\n\n— Tweed Heads, NSW (+55 per cent)\n\n\n\n\n\n\"Destinations such as Jindabyne, NSW and Daylesford, VIC, can potentially offer average daily accommodation rates of up to 55 per cent less than the popular coastal hotspots and often less crowds,\" said Expedia travel expert Sarah King.\n\n\n\nDomestic travellers are increasingly opting for trips inland, according to Expedia's report. Internationally, colder, snowy destinations are on the rise. Source: SBS News\n\nNot feeling the heat\n\nMore than one third (36 per cent) of Australians say they want to swap summer heat for snowy winter escapes.\n\n\n\n\n\nInternationally, Expedia found six of Australia's top ten international summer destinations are in Asia, with huge jumps in interest for:\n\n\n\n\n\n— Shenzhen, China (+145 per cent)\n\n\n\n— Sapporo, Japan (+70 per cent)\n\n\n\n— Helsinki, Finland (+50 per cent)\n\n\n\n\n\nStill, the most in-demand cities overall are Tokyo, Bali, Singapore, Osaka, London, Bangkok, Fiji, New York, Ho Chi Minh City, and Paris.\n\n\n\nTrending domestic destinations\n\nYarra Valley, Victoria (+85 per cent) Jindabyne, NSW (+65 per cent) Tweed Heads, NSW (+55 per cent) New Norfolk, Tasmania (+50 per cent) Daylesford, Victoria (+45 per cent) Kingscliff, NSW (+35 per cent) Kangaroo Valley, NSW (+35 per cent) Kiama, NSW (+30 per cent) Mission Beach, Queensland (+30 per cent) Barossa Valley, SA (+25 per cent)\n\nTrending international destinations\n\nShenzhen, China (+145 per cent) Sapporo, Japan (+70 per cent) Helsinki, Finland (+50 per cent) Hanoi, Vietnam (+40 per cent) Kowloon, Hong Kong (+40 per cent) Whistler, Canada (+30 per cent) Dubai, UAE (+25 per cent) Prague, Czech Republic (+20 per cent) Auckland, New Zealand (+20 per cent) Taipei, Taiwan (+15 per cent)",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-to-expect-as-the-under-16s-social-media-ban-begins/zn7wx10br",
        "title": "What to expect as the under-16s social media ban begins",
        "publish_date": "Fri, 5 Dec 2025 04:26:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nStarting next Wednesday...\n\n\n\n\n\n\"Australia will become the first country in the world to ban under-16s from having social media accounts.\"\n\n\n\n\n\nThat's Communications Minister Annika Wells trumpeting the long-awaited social media restrictions for under-16s that she says will help protect them from further harm online.\n\n\n\n\n\n\"With one law we can protect Generation Alpha from being sucked into purgatory by predatory algorithms described by the man who created the feature as behavioural cocaine. And on 10th December there are going to be withdrawal symptoms. Teenagers will be upset, some will fight to get back on, some will manage to find their way around the tech and keep their accounts but I truly believe the short-term discomfort will work be worth the long-term benefits.\"\n\n\n\n\n\nYou might be wondering what platforms are covered under these restrictions and how exactly the government expects to enforce this.\n\n\n\n\n\nSo, Australia's eSafety Commissioner has identified 10 social media platforms that will now be age-restricted, with the list expected to be broadened in the future.\n\n\n\n\n\nThese are Facebook, Instagram, Snapchat, TikTok, Reddit,, X (formerly known as Twitter), YouTube, Threads, and live-streaming platforms Twitch and Kick.\n\n\n\n\n\nFrom Wednesday, these platforms must remove accounts of users under the age of 16 and take what the government considers to be reasonable steps to prevent the children from creating accounts on their services.\n\n\n\n\n\nIf they fail to take these steps they will risk being fined up to $50 million.\n\n\n\n\n\nDr Tiffani Apps is a senior lecturer at the University of Wollongong and chief investigator at the ARC Centre of Excellence for the Digital Child.\n\n\n\n\n\n\"These social media spaces have not been designed for children in mind, and we have seen over recent years a number of harms that alarm parents and communities and alarm children as well. I would say that it's an interesting response because it restricts children from accessing the platforms, so restricting children rather than requiring the platforms to create spaces that are safe for children.\"\n\n\n\n\n\nDr Apps says each platform will implement the steps differently.\n\n\n\n\n\n\"We will see changes come in pretty swiftly, and we've begun to see them over the last couple of weeks. For those platforms that are included, it will look different across those platforms. They're owned by different people and they're managing the restrictions in different ways.\"\n\n\n\n\n\nMeta, the owner of Facebook, Instagram and Threads, has started removing half a million accounts belonging to teens under 16.\n\n\n\n\n\nYoutube, on the other hand for instance will be a little different as it doesn't require users to have an account to access content.\n\n\n\n\n\nUnder-16s will not be allowed to have active YouTube accounts or subscribe to YouTube channels but children will still be able to watch videos on the website in a logged-out state or under parental supervision.\n\n\n\n\n\nPublic support for the Albanese government's changes to the Online Safety Act was one factor in the Labor government's successful re-election campaign heading into the federal election this May.\n\n\n\n\n\n\"This is about letting kids be kids. It's also about empowering parents to be able to have those discussions with their children.\"\n\n\n\n\n\nA number of parents in Sydney say they're excited for the pioneering move.\n\n\n\n\n\nVOXIE 1: \"There’s so many mental health implications, and to take that off my hands and leave it to the government to decide. Give my kids a break from after school and they can rest and hang out with the family. I think it’s a great initiative, a great thing.\"VOXIE 2: \"I think it’s fantastic. As a mum of two teenage girls , I’m really pleased with the initiative of the Australian government and I think it's wonderful that they’re a world leader in this.\"\n\n\n\n\n\nSome are a little more sceptical of how it will work.\n\n\n\n\n\n\"Children are clever. They can work systems much more cleverly than adults actually realise. So it’s going to have a big impact, hopefully for the better, but it's going to take a bit of time to get that rolled in and implemented in the best way possible.\"\n\n\n\n\n\nThe government says platforms must deactivate existing accounts of those under 16, ensure no new accounts are activated, implement workarounds and correct errors.\n\n\n\n\n\nBut many experts are warning the age verification tools that platforms are using to prevent kids from signing up are far from perfect.\n\n\n\n\n\nChair of Electronic Frontiers Australia, John Pane, says kids could use software or even an older family member to skirt around many of these methods.\n\n\n\n\n\n\"Kids are looking at using VPNs obviously to get around the ban. Kids could also use individuals to sit in for them, an older brother or a sister, to take a photograph and have it go through biometric estimation of their age. They can use software to modify their own photograph to make them look older. There are so many ways to get around this. It has more holes in it than swiss cheese.\"\n\n\n\n\n\n15-year-old Noah Jones is one of those teens determined to get around the ban.\n\n\n\n\n\n\"I'm just going to make a new account on Instagram and it'll either ask for me to scan my face or an id and I don't see what's stopping me from getting my older brother's ID or my mum's ID.\"\n\n\n\n\n\nThe government says there won't be penalties for parents or young people who find ways to continue using social media, with the onus entirely on platforms to prevent access.\n\n\n\n\n\nThese potential flaws have piled more pressure on the Albanese government to get this social media age restriction right and adapt to the countless number of work-arounds and new social media platforms that are expected to pop up in response.\n\n\n\n\n\nAs Communications Minister Annika Wells says, the world will be watching to see how this first-of-its-kind policy will play out.\n\n\n\n\n\n\"This law is world leading and countries around the world are taking our lead. Denmark, Greece, Romania, France, New Zealand, Malaysia, the European Commission have all signaled intent introduce a minimal age for social media.\"\n\n\n\n\n\nAnd for the millions of children under 16 who won't find ways around these restrictions, Dr Tiffani Apps says this could be a tough adjustment for kids.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/can-eurovision-survive-four-countries-withdraw-from-contest-over-israels-eligibility/59wz2t4pz",
        "title": "Can Eurovision survive? Four countries withdraw from contest over Israel's eligibility",
        "publish_date": "Fri, 5 Dec 2025 02:29:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMembers of the European Broadcasting Union have elected not to hold a direct vote on Israel’s participation.\n\n\n\n\n\nInstead, they introduced strengthened rules designed to prevent government interference, a response to concerns raised after previous contests.\n\n\n\n\n\nGermany and Austria supported the outcome, describing it as a reaffirmation of Eurovision’s founding principles.\n\n\n\n\n\nGerman Radio network ARD- ZDF representative Katja Wildermuth says the Union prioritised its values over immediate political pressure.\n\n\n\n\n\n\"We are very happy that in the end rules and values and impartiality of public service media has been stronger than emotional public debates of the day. We're talking about the biggest song contest in the world and it's a contest that stands for building bridges, for diversity, for tolerance. And we underlined these values today in the debate.\"\n\n\n\n\n\nAustria’s Broadcasting Corporation director Roland Weissmann echoes that, noting that the vote reflected democratic process and that Israel’s broadcaster KAN therefore remains eligible to compete.\n\n\n\n\n\nAfter the European Broadcasting Union formally confirmed Israel’s eligibility for the 2026 Eurovision Song Contest, four countries - Spain, the Netherlands, Ireland and Slovenia - immediately withdrew.\n\n\n\n\n\nSo, why did the EBU make this decision and why did many members accept it?\n\n\n\n\n\nWilliam Lee Adams, founder of Wiwiblogs and one of Eurovision’s most respected analysts, tells the B-B-C that the Union had already acknowledged political interference in earlier contests, and the reforms introduced this week were seen by most broadcasters as sufficient.\n\n\n\n\n\n\"What we do know is that the discussion of new rules was presented; the EBU recognised that there was political interference that occurred during the previous Eurovision, and they had these new rules, additional measures to prevent a recurrence. Apparently countries accepted, as a whole, that those rules were enough and that a vote on Israel's participation did not need to take place.\"\n\n\n\n\n\nBut he says there is a thin line between politics and the personal.\n\n\n\n\n\n\"Israel's most recent entry from Yuval Raphael, she was a survivor of October the 7th, some people said that carries a political message, others said no, her song is about perseverance, it's a personal message. This is the problem with art: they're not just kicking a ball on stage, they're being judged for lyrics, for words, for meaning and it all gets very convoluted, and things are misinterpreted, ideas are projected. It's complicated.\"\n\n\n\n\n\nIn Vienna, host of next year’s contest, many residents expressed acceptance of Israel’s participation, even if they regretted losing several competing countries.\n\n\n\n\n\nAustrian resident Bernhard Kleemann says the public should not be punished for the actions of any government.\n\n\n\n\n\n“As far as Israel is concerned, I distinguish between the government and the population. Why should the population, or a part of the population, not participate? That is my reasoning. If countries decide not to participate because they condemn the government and the prime minister, that is their decision. That is my bottom line. It's a shame because it means less choice, but it is politically understandable. Yes, that's how I see it.”\n\n\n\n\n\nOthers in Vienna stressed that Eurovision was devised to promote cultural exchange, not political exclusion.\n\n\n\n\n\nMeanwhile, in Madrid, the tone was unequivocally different.\n\n\n\n\n\nMany Spanish Eurovision fans said their country's withdrawal was necessary given the war in Gaza.\n\n\n\n\n\nDrag performer Enigma Queen captured the sentiment among Spain’s most dedicated fans.\n\n\n\n\n\n\"Honestly, I think it’s great, because since Eurovision doesn’t take steps to remove a genocidal, violent country that causes wars from its festival, it’s very good that Spain withdraws as a form of protest, and hopefully more countries join so the festival can’t go ahead and they stop allowing these things.”\n\n\n\n\n\nIn Tel Aviv, the response was one of relief.\n\n\n\n\n\nEurovision fans there said they had spent days fearing exclusion.\n\n\n\n\n\nJurij Vlasov says he was stressed over whether the EBU would allow Israel to participate or not.\n\n\n\n\n\n\"I feel like our reaction is full of happiness and huge relief. Feel like there was a lot of stress in the last hour that they wanted to go into the voting. And I was Oh my God, I'm a guy who's going to be anonymous. I think that's a huge relief right now and a lot of happiness that the Eurovision going to keep the non-political song contest and let it'll be fun and joy for all of Europe.\"\n\n\n\n\n\nWith four nations withdrawing, affecting untold millions of viewers across Europe and around the world, some are speculating whether the contest will be able to go on.\n\n\n\n\n\nEBU leadership have been quick to insist that the contest is not troubled.\n\n\n\n\n\nMartin Green is Eurovision's director.\n\n\n\n\n\n\"It's in no ways a crisis. We've got 35 members or so going to join us next year. Now, I understand the four or five who might not come. That's their choice. I completely respect that. I very much hope they'll be back with us in 2027 and I also very much hope that they will still broadcast the show and allow those fans who want to watch the show to watch it. But again, that's their choice.\"\n\n\n\n\n\nHe also noted that Bulgaria, Romania and Moldova are returning to the contest.\n\n\n\n\n\nSBS who has Australian broadcast rights for Eurovision 2026, has issued a statement saying that participation in, and coverage of Eurovision will continue in 2026.\n\n\n\n\n\nIt continued:\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/give-us-a-chance-more-than-900-asylum-seekers-still-in-visa-limbo-in-australia/ex0eo92hk",
        "title": "'Give us a chance': More than 900 asylum seekers still in visa limbo in Australia",
        "publish_date": "Fri, 5 Dec 2025 02:18:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSara Mashalian and her partner Ali Gharaei look like they're living the Australian dream.\n\n\n\n\n\nRenovating their home in Western Sydney, and building a veggie patch around a classic Hill's hoist.\n\n\n\n\n\nBut Sara who fled religious persecution in Iran nearly 13 years ago still can't call Australia home.\n\n\n\n\n\n\"I am married with the person which is Australian citizen, he is Australian citizen, my father Australian citizen, my brother is Australian citizen, my mother's family, all Australian citizen. How I can leave this country, go to the different country? Already I have a family in Australia. I want to keep my family, I don't want to stress every time, they call me say 'you are not for Australia', 'you can't live in Australia'. Why? Because I come to Australia for a better life? Because I'm Christian?\"\n\n\n\n\n\nSara works as a dental assistant, pays tax, and her legal partner, brother and father are Australian citizens.\n\n\n\n\n\nBut she still has to renew her visa every six months.\n\n\n\n\n\n\"Every six months my visa is expired. Imagine I told you every six month my Medicare is expired. More than three months I don't have Medicare. Even my visa not allowed to a study, not for a study. Even I can't buy the mobile. I can't buy SIM card. I can't driving in Australia. You know why? If I'm driving or any fault in the street, which is not my fault, okay? That's my issue. Immediately, immigration can cancel it, my visa. Immigration exactly say to me, if we call you, immediately you should answer your phone. For example, if I'm in the toilet, don't answer my phone, immigration can cancel my visa.\"\n\n\n\n\n\nSara doesn't have a pathway to permanent residency because of an immigration policy introduced by then Prime Minister Kevin Rudd on the 19th of July 2013, just days before she and her mother arrived by boat:\n\n\n\n\n\n\"From now on, any asylum seeker who arrives in Australia by boat, will have no chance of being settled in Australia as refugees.\"\n\n\n\n\n\nSara and her mother were sent to Christmas Island, then Nauru for processing.\n\n\n\n\n\nThere, Sara says she faced sexual harassment and horrific living conditions.\n\n\n\n\n\nBoth became ill and were medically evacuated, and in a Darwin detention facility, Sara says she witnessed extreme self-harm by people protesting being sent back offshore.\n\n\n\n\n\n\"The lady was pregnant, maybe three months I couldn't remember exactly the time. She cut it with a knife, her stomach. The baby's come out. That's few years ago but it stays in my mind, I feel it. And the kids, cutting their hands because they don't want to back. Imagine my mum come back from hospital. She's a stay in the room. She go to the keep in the wall and she keep in the hand and officer was inside the my mother room. And I wake up and I mama, what's happened? And I hug it my mom. Mama, you are safe. You don't worry. You are fine. And she's crying loudly 'What's going on? What's going on? I don't want to back. I don't want to back.'\"\n\n\n\n\n\nSara is one of around 900 people calling on the government to release them from visa limbo.\n\n\n\n\n\n13 year old Hossam spoke at the protest:\n\n\n\n\n\n\"My brother is 10 now, and he has citizenship but the rest of my family doesn't have a citizenship.\"\n\n\n\n\n\nAnd 13 year old Amir also said he wanted the government to hear his voice.\n\n\n\n\n\n\"I came here when I was 10 months old now I'm 13. I have a little sister she's got her citizenship. I just want the government to give us a chance to call Australia home.\"\n\n\n\n\n\nTheir only hope is the intervention of Immigration Minister Tony Burke.\n\n\n\n\n\nAmong those who have written to him is 23-year-old Ferdos - who requested SBS omit her surname.\n\n\n\n\n\n\"I got a letter from immigration saying unfortunately you're not eligible for a permanent residency and you've got only two option. It's either you go back to your home country or you choose the third country. But Nauru was the third country. I've spent five years there and I think I've done my time.\"\n\n\n\n\n\nThe letter Ferdos received came from an unnamed representative of the Department of Home Affairs' Director Resettlement Programs Immigration Compliance Group, writing on behalf of Burke.\n\n\n\n\n\nIt said: \"As a transitory person, your stay in Australia is temporary only, and you do not have a permanent settlement pathway in Australia\".\n\n\n\n\n\nIt added, \"We encourage all transitory persons to consider their options to depart Australia, either to a third country or return to your home country\".\n\n\n\n\n\nFerdos was just 10 years old when she was put in offshore detention, and has no real connection to any country but Australia.\n\n\n\n\n\n\"I've lost my entire childhood. The damage is done. I'm not talking about that now. I'm here now. I feel Australian in everything except my paperwork. I do everything and Aussie does. I work. I contribute. I grew up here. I went to school here and I'm doing everything a normal Australian citizen would do. I just need that green light that I don't have.\"\n\n\n\n\n\nFerdos works and pays tax, but her visa restricts her from pursuing tertiary education.\n\n\n\n\n\n\"I was a child when all of this happened, and I had no say in how I came here. And I don't know why I'm still being punished. No bank, no educational institution, no one recognised me. And simply because I'm not Australian citizen or I'm not a permanent resident. And despite like living, working, contributing, paying taxes, Australia still doesn't see me as a citizen.\"\n\n\n\n\n\nLaura John is an associate legal director at the Human Rights Law Centre, and is Sara Mashalian's lawyer.\n\n\n\n\n\nShe's among advocates pushing for ministerial intervention in so-called 'legacy cases' that remain unresolved.\n\n\n\n\n\n\"This is a policy that was implemented over a decade ago. It simply does not reflect the practical reality of Sara's life and the lives of the other people who are caught in this permanent limbo. These are people who work alongside us, whose children go to schools and childcare. These are people who are Australian in every sense of the way other than their visa status. And it's time for the minister to intervene and to grant people in this group permanent visas to accept what is already the case. They are Australian. This is their home, and they deserve to be able to stay here with their families.\"\n\n\n\n\n\nIn 2023, 19,000 refugees who also arrived by boat were granted permanent settlement pathways.\n\n\n\n\n\nA the time - the then-Immigration Minister Andrew Giles said it made \"no sense\" to keep people who worked and paid taxes \"in limbo\".\n\n\n\n\n\nBut applications were only open to those who arrived before Operation Sovereign Borders began in September 2013, or who already held temporary protection or safe haven enterprise visas.\n\n\n\n\n\nSara and Ferdos were in offshore detention by the cut off, and were never granted one of those visas.\n\n\n\n\n\nThey say they're left in a permanent state of uncertainty, which has taken a physical and psychological toll.\n\n\n\n\n\nAnd Sara also fears she's lost the chance to become a mother - as she's delayed having children due to her visa uncertainty.\n\n\n\n\n\n\"I'd like to be having children. That's the normal life when you are marriage. How can I imagine if I have a children. I'm 42 years. I can't be older. I have a limited time I can be a mother.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/teen-social-media-ban-visa-holders/9lvj3s138",
        "title": "Australia’s social media ban to follow teens overseas — and hit visa holders",
        "publish_date": "Fri, 5 Dec 2025 00:08:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Meta has started locking the accounts of under-16s on Instagram and Facebook ahead of Australia's world-first social media ban, but uncertainty remains over whether young temporary visa holders — including international students — will also be swept up in the restrictions.\n\n\n\n\n\nThe tech giant has confirmed to SBS News Australian under-16s users travelling overseas for a short-term holiday will still be restricted from using Facebook and Instagram.\n\n\n\n\n\n\"We will still recognise them as a resident of Australia, and they will still be subject to Australian law,\" a spokesperson for the company said.\n\n\n\n\n\nThe ban starts on 10 December , yet Meta has already notified users aged 13 to 15 that their accounts will be shut down. About 150,000 Facebook users and 350,000 Instagram accounts are expected to be affected. Under-16s are now blocked from creating new accounts on either platform.\n\n\n\n\n\nA spokesperson for the eSafety commissioner told SBS News the rules apply to young people under 16 who are \"ordinarily resident\" in Australia.\n\n\n\nBut what does \"ordinarily resident\" mean in practice — and could it include young people on temporary visas, such as international students?\n\n\n\nDoes the ban apply to under-16 international students?\n\nA spokesperson for Meta told SBS News it's unlikely teens who enter Australia for a short holiday will have their accounts restricted.\n\n\n\n\n\n\"However, if they stay in Australia for an extended period, such as long study periods, then our age assurance measures will take effect,\" they said.\n\n\n\n\n\nAccording to the latest figures from the Department of Education, 19,768 international students were enrolled in Australian schools and 331,402 in VET programs as of September this year.\n\n\n\n\n\nIt isn't clear how many of those students are under 16.\n\n\n\nA spokesperson for the eSafety commissioner said temporary visa holders, including international students, should be aware their accounts \"may be flagged\".\n\n\n\n\n\nThis could include \"age checks, deactivation or removal if platforms receive signals indicating they are in Australia for a significant period of time or indefinitely\".\n\n\n\n\n\nSBS News has sought clarification from the eSafety commissioner on what counts as a \"significant period of time\".\n\n\n\n\n\nAccording to the Australian Citizenship Act (2007) a person is not \"ordinarily resident\" in Australia if they reside in the country for a \"special or temporary purpose only\", but considered resident if they are home or have a permanent abode in the country.\n\n\n\nNot just location data\n\nIt's understood platforms won't rely solely on location data to determine whether a young person is living in Australia.\n\n\n\n\n\nAn eSafety spokesperson said the industry will use \"various signals\" to identify a person's country of residence.\n\n\n\nA spokesperson for the eSafety commissioner told SBS News they understand Meta will use \"various signals\" to detect users' locations. Source: AAP / Nicholas T. Ansell \"This approach will also be leveraged to prevent issues such as circumvention via VPN as well [as] limit unintended disruption of services to people visiting the country for a short period,\" they said.\n\n\n\n\n\nIt's not clear what those signals might be, but the spokesperson said platforms are expected to take reasonable steps to address potential errors, such as mistakenly including a young person .\n\n\n\n\n\n\"Platforms should also provide clear ways for people to request a review if they have been age-restricted by mistake,\" they said.\n\n\n\nNearly 'every teen affected'\n\nRoy Morgan research released this week shows 624,000 Australians aged 14 and 15 use at least one social media platform.\n\n\n\n\n\nYoutube was the most popular platform, with 95 per cent of young Australians using it.\n\n\n\nSnapchat was next at 87 per cent, followed by Facebook and then Instagram at 81 per cent and 78 per cent respectively.\n\n\n\n\n\nRoy Morgan CEO Michele Levine said the number shows how \"deeply social media is embedded in the daily lives of Australian teenagers\".\n\n\n\n\n\n\"The new legislation to ban social media for Australians under 16, set to be enforced from next week, will affect almost every 14 to 15-year-old in the country.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/where-s-our-transmitter-how-the-whitlam-dismissal-nearly-silenced-radio-4zzz-20251112-p5new7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Where’s our transmitter?’ How the Whitlam dismissal nearly silenced radio 4ZZZ",
        "publish_date": "Sat, 06 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Nick Dent"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size At noon on Monday, December 8, 1975, John Woods, a TV journalist from Adelaide fired from his Channel Nine job for taking part in a gay rights march, spoke into the microphone in the basement of the student union building at the University of Queensland. “You are listening to 4ZZ-FM in Brisbane, bringing you stereo FM rock on a frequency of 105.7 megahertz,” Woods said. “4ZZ-FM is Brisbane’s first new radio station in over 30 years, and first ever stereo FM station … “While some people may not enjoy some of the material we put to air we certainly don’t deny them the right to switch us off. To attempt to impose limitations or restrictions on public broadcasting is to seriously threaten a fundamental liberty, that of free speech.” He then played a song intended as a statement: Won’t Get Fooled Again by British mod rockers The Who. Volunteers, announcer Helen Hambling (second left) and station engineer Ross Dannecker (centre) getting ready for a 4ZZ-FM (4ZZZ) test broadcast, 1975. Credit: Greg Perry/State Library of Queensland The birth of community radio in Queensland did not happen in a slow news week. That same day, journalist Roger East was murdered in Dili – East Timor having been invaded by Indonesia the day before. Australia was heading into a snap election one week later, following the dismissal of the Whitlam Labor government in November.\n\nAdvertisement\n\nIndeed, the premature ousting of Labor was just one in a series of unfortunate events that almost stopped 4ZZZ in its tracks. Just prior to the government’s sacking, the Labor minister Moss Cass had approved 12 licences for community radio stations, including one for a scrappy bunch of radicals, feminists and music fans in the University of Queensland’s student union. 4ZZZ’s future was thrown into jeopardy following the Whitlam Dismissal in 1975. Credit: Michael Howard “When [Malcolm] Fraser was put in as the interim prime minister, there was no guarantee that those licences would ever get signed off on,” says Heather Anderson, author of new book-length history of 4ZZZ, People Powered Radio. Ultimately, the acting Postmaster-General in Fraser’s caretaker government, Peter Nixon, reluctantly decided it was a fait accompli. “The ink was still wet on the licence when they went to air,” Anderson says. Queensland’s first community radio station began the way it would continue for the next 50 years: amid the fires of dissent and oppression.\n\nAdvertisement\n\nIn July 1971, hundreds of peaceful protesters against the tour of the South African Springboks rugby team were attacked, pursued and beaten by about 500 police in Wickham Terrace, given carte blanche by premier Joh Bjelke-Petersen. The student union hosted a fiery public meeting the next day. “People were angry as all hell because of the bashings,” recalls Jim Beatson. Beatson was studying for an honours degree in Australian history, on the history of communism in Queensland, and as a member of the Labor Party had been active in the Brisbane radical movement of the 1960s. Local media were indifferent to the bashings or had actively taken the side of the police. An alternative voice was desperately needed. “And John Stanwell out of the blue said: ‘Why don’t we set up draft resister radio?’ ” Stanwell, a law student who would later spearhead the station’s fundraising through ‘Joint Effort’ gigs, explains: “In Melbourne and Sydney at the university campuses, the Draft Resisters Union, which was the public face of the anti-conscription movement, ran a sort of protest pirate radio, and got huge media coverage.” Beatson, who had experience of pirate radio having spent two years in London, consulted an academic and learned that pirate broadcasts are easily triangulated and shut down. He realised the only way to go was to obtain a legal and permanent radio licence.\n\nAdvertisement\n\nThe beauty of this approach was the fact radio licences came under federal jurisdiction – free from the hectoring of Joh’s goons, unlike left-wing publishing ventures such as the newspaper Beatson worked on, The Brisbane Line, which lasted three issues in 1968. Trish NiIvor and Jim Beatson reading for the 4ZZ-FM (4ZZZ) test broadcast at the 1975 University of Queensland Orientation Week. Credit: Greg Perry/State Library of Queensland After Whitlam’s election in 1972, Beatson, editor of the student union paper Semper Floreat, Alan Knight, and engineering student Ross Dannecker formed the University of Queensland Media Committee to lobby the federal government for an FM licence. Beatson made trips to Canberra and Sydney, attending a conference in 1974. “All these Trotskyites from Sydney and Maoists from Melbourne were there, and they stood up and started talking about how minorities weren’t having access to the media,” he recalls. Inspired by the UQ Media Committee’s music expert, Stuart Matchett, Beatson stood up and told them: never mind minorities – majorities weren’t being served by the current system. “We wanted FM radio because the biggest-selling music in Australia was LPs like Deep Purple and Pink Floyd, not [singles], which dominated commercial radio. “Everyone said it was the speech of the day, and we went from being a collection of unknowns to being thought of as the smartest people campaigning.” “They weren’t just lobbying for Triple Z to get a licence,” Anderson notes. “They were lobbying for the federal government to establish a community radio sector.” (There are now around 450 community radio services across the country.)\n\nAdvertisement\n\n“They weren’t just lobbying for Triple Zed to get a licence, they were lobbying to establish a community radio sector.” Heather Anderson Following the conference Beatson met with Jane Blaxland at the government Media Department about their licence application. “And she says, ‘Jim, the problem for your group is nobody in Sydney or Melbourne’s ever heard of you. You need people writing letters, like at least one a day,’” Beatson says. A team of seven volunteers was rallied – including Helen Hambling, who would become one of the station’s first full-time announcers, and future Four Corners producer Marian Wilkinson – to contact community organisations to write letters of support to the PMG and to Whitlam’s Minister for the Media, Moss Cass. In Anderson’s book, Wilkinson recalls “spending hours and hours and hours and hours on Triple Z work to get the station started ... It was full on. It consumed our lives”. “They’re the unsung heroes,” Beatson says, “this group of feminists that literally rang every church, every sports group, saying ‘if we get a licence, you’ll get a spot on the station.’ “Jane Blaxland rang me up and said, ‘Jim, your campaign’s been unbelievably successful, we are getting at least six letters a day coming in.’ ”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/town-and-country-the-bunfight-over-mcdonald-s-in-two-very-different-locations-20251125-p5ni6a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Town and country: The bunfight over McDonald’s in two very different locations",
        "publish_date": "Sat, 06 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss"
        ],
        "text": "From a quiet corner of regional Victoria to a bustling stretch in inner-city Melbourne, an iconic fast food behemoth is facing stubborn resistance from local communities intent on keeping it away.\n\nIn the outer Bendigo suburb of Strathfieldsaye and in Northcote in Melbourne’s inner north, residents are banding together to stop McDonald’s from opening restaurants.\n\nThe site of the proposed McDonald’s in Strathfieldsaye. Credit: Joe Armao\n\nBut the global chain has vowed to pursue all options to build the two new restaurants after local councils rejected its recent permit applications. In both cases, a legal challenge from McDonald’s appears all but inevitable.\n\nLast month, the City of Greater Bendigo’s council officers recommended the McDonald’s application for a new outlet be approved. But councillors rejected that advice and refused the application.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/these-common-plastic-items-can-t-be-recycled-but-everyone-throws-them-in-the-wrong-bin-anyway-20251126-p5nis0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "These common plastic items can’t be recycled, but everyone throws them in the wrong bin anyway",
        "publish_date": "Sat, 06 Dec 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Madeleine Heffernan"
        ],
        "text": "Supermarkets are worsening Australia’s waste problem by placing meat, produce and ready-made meals on black trays that cannot be recycled and go straight to landfill, waste experts say.\n\nRon Wainberg, of waste management consulting business MRA Consulting, is calling on governments to ban plastic packaging that contains carbon black, the common colourant or pigment included in plastic to make it black or to block light.\n\nSupermarket meat on a non-recyclable black tray. Credit: Shutterstock\n\n“People diligently will put these things in their recycling bin, and they’re just going to go to landfill,” said Wainberg. “What is needed is for the government to show leadership and regulate that these things can’t be used, but they won’t do it.”\n\nThe federal government did not answer questions as to whether it would ban the trays. A spokesperson said it was working “with states and territories to phase out single-use plastics and transform Australia’s packaging regulations”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/what-i-saw-when-i-accidentally-on-purpose-crashed-the-world-cup-draw-20251206-p5nld1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What I saw when I (accidentally on purpose) crashed the World Cup draw",
        "publish_date": "Sat, 06 Dec 2025 13:00:00 +1100",
        "category": "sports",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Inside, it was Disneyland for soccer fans. The grand foyer – one of the world’s largest rooms – was filled to the brim with swanky guests wearing lanyards, stands bearing coffee, Taittinger champagne, muffins, cut fruit and Greek yoghurt parfaits. A string octet played while the great and the good mingled and took photos in front of a giant soccer ball and FIFA 2026 signage. Suits and sneakers – a common combination in the US – were everywhere. This correspondent inside the FIFA World Cup draw reception. Credit: Michael Koziol Somehow, I’d made it inside the party without even really trying. But I wanted to ditch my peacoat and scarf at the coat check. That meant going back outside. Foolishly, I took the gamble. At first, my attempt to re-enter the red carpet failed. This time, someone on their A-game directed me to the media centre – two words that have come to strike fear into my heart.\n\nI’ve been at the media centre for plenty of large-scale events, and it’s never good. You are dumped in a drab holding pen with a big screen, far from the action. Fortunately, I found my way through the car park back to the red carpet, where I arrived just in time to spot FIFA boss Gianni Infantino posing with Brazilian soccer legends Ronaldo and Kaka. When the carpet closed, I seized my chance to sneak through the crowd back into the reception. FIFA President Gianni Infantino (centre) with Ronaldo (left) and Kaka on the red carpet ahead of the World Cup draw. Credit: Getty Images Once inside, I helped myself to a glass of beetroot juice and tried to find the Australians. I looked for green and gold, kept my ears peeled for the accent, and inquired after anyone drinking a beer or hovering near the bar. Eventually, I heard it – that unmistakable Aussie twang. She turned out to be a Melburnian who now lives in Miami and works for FIFA. Apparently, only a handful of Australians were in attendance.\n\nInspecting my lanyard, she quickly clocked me for the imposter that I was. “You actually shouldn’t even be in here,” she said, pointing me towards – yep – the media centre. But I was feeling confident. As guests filed into the majestic theatre and had their tickets checked, I noticed people taking camera equipment through a separate entrance. I flashed my badge and waltzed right in. Andrea Bocelli performs the World Cup staple, Puccini’s Nessun dorma. Credit: AP I ended up at the back of the hall with the photographers, just below the dress circle, where US President Donald Trump and first lady Melania Trump were seated with Infantino, Canadian Prime Minister Mark Carney and Mexican President Claudia Sheinbaum. Proceedings began with a rousing rendition of Puccini’s Nessun dorma by Andrea Bocelli, which everyone in the room filmed on their phones. Trump was the first in the dress circle to leap to his feet for a standing ovation, while Carney at one point seemed to shake his head in awe.\n\nIt turned out to be the highlight of the day. To say the draw was drawn out would be a grave understatement. FIFA naturally awarded its inaugural “peace prize” – a bit of nonsense it invented to suck up to Trump, who gave the shortest and most modest speech I can remember him giving. Trump was awarded FIFA’s inaugural “peace prize” and quickly hung the medal around his neck. Credit: Getty Images It’s one thing to hear Trump boast, dubiously, about ending eight wars; quite another to hear it from the head of FIFA. But Infantino knows there’s no such thing as too much when it comes to stroking the president’s ego. Somehow, that obsequious stunt wasn’t even close to the most cringe part of the ceremony. That honour went to the awkward and painfully unfunny banter between hosts Kevin Hart and Heidi Klum, who never quite mastered the art of the teleprompter.\n\nAs the interminable videos and interviews piled up, the audience began to drift. By the time the pots appeared and the draw finally started, many people were scrolling on their phones. I snapped back to life during a playful bit when former basketballer Shaquille O’Neal – who makes even NFL legend Tom Brady look small – mercilessly toyed with the 5-foot-something Hart. Kevin Hart and Shaquille O’Neal. Credit: Getty Images The draw itself was suspenseful enough – if you’re into that sort of thing – though, honestly, it felt like a meeting that could have been an email. Australia was grouped with the US, Paraguay and a yet-to-be-determined qualifier – which my colleague Vince Rugari says is “a pretty good group for the Socceroos”.\n\nThe ceremony ended with Village People performing Y.M.C.A. – another sop to Trump, who likes to end his major speeches with the camp classic. However, the band bungled their entrance, ambling on stage nearly 30 seconds after the musicians began playing. Trump performs his signature Y.M.C.A. dance at the FIFA World Cup draw. Credit: Getty Images The hiccup didn’t stop Trump from breaking out his signature dance move and applauding with gusto as guests below filmed him with their phones. I also spotted him pointing out the Kennedy Centre’s recent renovations to Carney and Sheinbaum. Back out in the post-draw reception, I sampled some dry chicken sliders and delicious fresh salmon with all the trimmings (dill, capers, red onion), while others popped open the Taittinger. Alas, I never did find the Australians.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/live-2025-australian-open-golf-day-two-from-royal-melbourne-20251206-p5nldu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2025 Australian Open golf LIVE: The discarded banana peel that caused a Rory McIlroy double bogey",
        "publish_date": "Sat, 06 Dec 2025 12:57:36 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Sam Mcclure",
            "Scott Spits"
        ],
        "text": "Rory McIlroy slipped up on a banana peel with a double bogey on the second hole at Royal Melbourne to struggle in the early stages of his Australian Open third round.\n\nThe world No.2 was hoping to maintain the momentum of three birdies late in his second round when he arrived on course for an early tee time on Saturday, seven shots off the pace.\n\nSwamped by a sell-out crowd, the Northern Irishman opened with a par but missed the fairway on the par-four second hole with his ball nestled next to a grassy bush.\n\nThe lie went from bad to worse with a discarded banana skin draping the ball, with McIlroy unable to remove it for fear of the ball moving which would mean a one-stroke penalty.\n\nHe hacked it out, the ball travelling only about 10 metres, and his third shot came up short, and he was unable to get up and down, making double-bogey.\n\nThe setback came after Friday’s embarrassment on the par-five 14th when McIlroy had a rare air swing after his tee shot finished up under a ti-tree, and he then clipped a branch on the backswing.\n\nHe was then able to escape with a one-putt bogey.\n\nShowing his class, golf’s newest grand slam winner immediately shook off Saturday’s early blow to birdie the par-four third.\n\nAAP",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/boat-destroyed-by-us-military-not-heading-to-us-20251206-p5nle8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boat destroyed by US military not heading to US",
        "publish_date": "Sat, 06 Dec 2025 12:35:39 +1100",
        "category": "finance",
        "authors": [],
        "text": "Boat destroyed by US military not heading to US\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/formula-1-oscar-piastri-struggles-as-lando-norris-leads-abu-dhabi-grand-prix-practice-20251206-p5nldh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We’re realistic’: McLaren will use team orders if necessary to secure F1 title",
        "publish_date": "Sat, 06 Dec 2025 12:31:59 +1100",
        "category": "sports",
        "authors": [],
        "text": "It was the perfect boost for the Briton, who’s 12 points ahead of Verstappen and 16 ahead of McLaren colleague Piastri, as the Dutch champion, second quickest on the day, still finished 0.363 slower than Norris in his Red Bull under the floodlights. Verstappen was also noted by stewards for impeding Norris in the first flashpoint of the weekend after the champion had been fed wrong information by his race engineer, but they decided not to investigate further. Lando Norris and members of the McLaren team in Abu Dhabi. Credit: Getty Images “What’s this guy doing? I almost crashed,” Norris had been left exclaiming. For Piastri, desperate for the pace he had in Qatar last weekend when only McLaren’s strategy blunder stopped him sweeping every session, it felt a stop-start day as, first, he spent the morning on the team’s pitwall.\n\nWhile Norris led Verstappen by 0.008sec in another one-two, he gave up his seat to reserve Pato O’Ward in a session designed largely for young prospects and development drivers. Piastri was doubtless itching to get out on track as his McLaren boss Zak Brown joked: “There’s some guy that has taken my seat!” Not much of a laughing matter for Piastri, though, as he started on the back foot in the second session, more representative of what they’ll all face on Sunday. He locked up on his quickest lap and couldn’t get near Norris’s fastest, with Brown noting: “Oscar is not totally dialled in yet but he will get there.”\n\nPiastri certainly didn’t seem concerned, appearing his usual unflappable self as he told reporters: “Finding my feet. Clearly, some things to try and improve for tomorrow, but after just one session, not too bad. “It’s more just little details, the car feels like it’s in a pretty decent place, but just didn’t get the grip out of it on that first soft lap. So some small tweaks for tomorrow, of course. It didn’t feel perfect out there, but nothing major.” Norris didn’t evidently want to get too high himself so early in the week, saying: “Obviously, from the times, things look good at the minute, but I still want a bit more from the car. I’m not completely happy, or completely confident. “We all know it gets a lot closer going into quali. So nothing to smile about just yet.” Loading\n\nVerstappen had more than a few grumbles about the Friday set-up of his Red Bull, complaining in the morning that “something is broken on the car”. Asked what the main areas of issue were by his race engineer Gianpiero Lambiase, he replied: “It is everywhere now.” Mercedes’ George Russell, who could play a key role yet in Sunday’s race, was third quickest in second practice. Brown elaborated on the prospect that McLaren might yet employ team orders in the race. Brown admitted: “If, as the race develops, it becomes clear one of our drivers has a significantly better chance than the other, then we’re a team that wants to win the drivers’ championship and we will race accordingly, to do whatever we can to get that driver in front to try and win the race.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/more-than-a-dozen-hospitalised-overnight-in-e-scooter-crash-spike-20251206-p5nldn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More than a dozen hospitalised overnight in e-scooter crash spike",
        "publish_date": "Sat, 06 Dec 2025 11:40:25 +1100",
        "category": "finance",
        "authors": [
            "Matt Dennien"
        ],
        "text": "Thirteen people have been hospitalised after a spate of e-scooter and e-bike crashes across Queensland overnight ahead of fresh public hearings into the vehicles’ safety and enforcement.\n\nParamedics were called to 11 separate incidents, from Biloela to Palm Beach, between 6pm on Friday and 4.30am on Saturday – most in the south-east and all but two involving e-scooters.\n\nIn the worst accident, a teenage boy suffered significant foot injuries on the Gold Coast after an “e-scooter and vehicle incident” about 6pm, paramedics said.\n\nSince their introduction in Brisbane in 2018, the popularity of e-scooters and bikes has surged – along with injuries. Credit: Matt Dennien\n\nThen in Logan, a man in his 30s suffered what were described as significant leg injuries after an e-scooter fall just after 7pm. Both were taken to hospital in a stable condition.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/weather/sydney-set-for-its-hottest-day-in-almost-two-years-20251206-p5nldi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney set for its hottest day in almost two years",
        "publish_date": "Sat, 06 Dec 2025 11:21:51 +1100",
        "category": "finance",
        "authors": [
            "Jack Gramenz",
            "Eryk Bagshaw"
        ],
        "text": "Sydney will swelter through its hottest day in almost two years as thousands of commuters are forced off the metro due to track work.\n\nThe temperature at Observatory Hill reached 31.4 degrees at 11am, with the heat forecast to rise to 39 degrees in the Sydney CBD and 41 degrees in Penrith by 3pm, marking Sydney’s hottest day since January 2024.\n\nSteven Crameri beats the heat at Penrith Beach on Saturday morning. Credit: Sitthixay Ditthavong\n\nA total fire ban is in place as the Rural Fire Service attempts to contain a fire in Bulahdelah that has burnt through 2685 hectares and is not yet under control.\n\nThe smoke from the fire has drifted across Sydney and the Central Coast, blanketing the city in a light haze which is expected to clear throughout the morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/frank-gehry-titan-of-architecture-dies-aged-96-20251206-p5nldq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Frank Gehry, titan of architecture, dies aged 96",
        "publish_date": "Sat, 06 Dec 2025 11:12:38 +1100",
        "category": "finance",
        "authors": [
            "Nicolai Ouroussoff"
        ],
        "text": "“I was rebelling against everything,” Gehry said in an interview with The New York Times in 2012, explaining his antipathy toward the dominant architectural movements of the time, as exemplified by the Farnsworth House on the Illinois prairie, a stark, flat, steel-and-glass modernist pavilion by Mies van der Rohe. “I couldn’t live in a house like that,” he said. “I’d have to come home, clean up my clothes, hang them properly. I thought it was snotty and effete. It just didn’t feel like it fit into life.” The Gehry-designed Dr Chau Chak Wing Building at UTS Business School in Sydney. Credit: Fairfax Media For some, his work was more sculpture than architecture. Others saw it as emblematic of a global culture that reduced architecture to a form of branding. Gehry, whose name was recognised around the world, was sometimes derided as a “star-chitect”. But his work’s emotional ferocity could feel empowering, as if architecture had rediscovered a part of itself that had been lost after decades of dreary functionalism and postmodernist cliches. And the widespread focus on his buildings’ dazzling exteriors could distract from Gehry’s deeper goals: to create an architecture that was not just affecting but democratic in spirit and evocative of the messiness of human life.\n\nHe was born Frank Owen Goldberg on February 28, 1929, in Toronto to Irving and Sadie (Caplan) Goldberg. His father held a series of jobs, including managing a grocery store and selling pinball and slot machines. Frank and his sister, Doreen, lived with their parents in a two-family house clad in brick and tar-paper shingles (a material he would use in some of his designs). As a boy, he worked part-time in his maternal grandfather’s hardware store, stocking the shelves with tools, screws and bolts – an experience, he said, that spawned his love of everyday materials. The Walt Disney Concert Hall in Los Angeles, another Gehry masterpiece, opened in 2003. Credit: Getty Images Once a week, his maternal grandmother would come home from the market with a live carp, another formative experience, which would inspire the fish imagery that later appeared in his work. “We’d put it in the bathtub,” Gehry recalled, “and I’d play with this fish for a day until she killed it and made gefilte fish” (a traditional Ashkenazi Jewish dish). Frank’s world abruptly fell apart in the mid-1940s, when his father, a heavy drinker, had a heart attack as the two were arguing on the front lawn, a memory that Gehry said haunted him for decades. His father never fully recovered. After a doctor warned that he would not survive another Toronto winter, the family moved to Los Angeles, renting a cramped $US50-a-month apartment in a run-down neighbourhood just west of downtown.\n\nAs an architect, Gehry was a late bloomer. After a brief stint in the army, he married Anita Snyder, who helped pay his way through the University of Southern California, where he initially studied ceramics. He shifted to architecture after a teacher introduced him to Raphael Soriano, a pillar of postwar modernism in Southern California. (It was around this time, too, that he adopted Gehry as his surname, a somewhat random choice inspired, he said, by the desire to avoid antisemitism.) Gehry spent several years toiling as a mid-level designer and project manager at Gruen Associates, a firm known for its shopping malls. After he opened his own office in 1962, much of his early work was for mainstream developers. He designed a sprawling headquarters for the Rouse Co. in Columbia, Maryland, and two unremarkable department stores for Joseph Magnin in California. ‘You go into architecture to make the world a better place. A better place to live, to work, whatever. You don’t go into it as an ego trip.’ Frank Gehry, speaking in 2012 But he was an outsider by nature, and he began looking beyond the work of other architects for inspiration. Like many Angelenos, he was drawn to the laid-back, anything-goes atmosphere of the city, whose mix of garish mansions, flimsy bungalows, vacant lots, Googie’s coffee shops and colourful billboards was the antithesis of East Coast architectural academicism. And he became close to a generation of Los Angeles artists – Robert Irwin, Billy Al Bengston, Ed Moses, Larry Bell – whose surfboard-inspired aesthetic and raw work spaces suggested an alternative to the chilly austerity of late modernism and the reactionary tendencies of postmodernism.\n\n“The artists were living in industrial buildings and warehouses,” Gehry said in the 2012 interview with the Times. “They were constantly moving things around – changing the rooms, building lofts or storage spaces. It was so free and unselfconscious. I wanted to do that.” In the late 1960s, Gehry and his wife divorced, and in 1975, he married Berta Aguilera. She survives him, along with their two sons, Sam, an architectural designer, and Alejandro, an artist; a daughter, Brina Gehry, from his previous marriage; and his sister, Doreen Gehry Nelson. Another daughter from his first marriage, Leslie Gehry Brenner, died in 2008. Gehry’s approach to his own Santa Monica home divided critics – and his neighbours. Credit: wikipedia.org The Gehrys bought their Santa Monica house, a two-story pink-stucco affair, in 1977. At Aguilera’s prodding, he began to tear it apart. The house’s rough, unfinished appearance attracted the attention of architecture critics, even as it infuriated neighbours. But its tormented forms – suggesting a world that had been ripped up and gently pieced back together – had their own kind of beauty. And the use of crude, everyday materials was Gehry’s assertion that the working-class aesthetic he had grown up with could be as appealing as anything found in the more refined corners of the city.\n\nDecades later, he and Aguilera moved out of the little house that had first brought him fame and into a more luxurious spread overlooking Santa Monica Canyon. Designed with his son Sam, the new house was a sprawling, sometimes awkward composition of angled, heavy-timber posts and beams. Nonetheless, it retained some of the rough-and-tumble qualities of Gehry’s earlier architecture, and its jostling forms reflected a lifelong quest for emotional and creative freedom. Gehry kept on working. An interior view of Gehry’s Luma Foundation building in Arles, France. Credit: Getty Images In 2017, he completed the Pierre Boulez Hall in Berlin, designed in collaboration with conductor Daniel Barenboim: a compact, box-like space with a sunken floor and a floating elliptical balcony, contained inside an austere neo-classical building from the 1950s. And in 2021, the Luma Foundation building in Arles, in southern France, was finished; a twisting tower of stainless-steel bricks, it was inspired, in part, by the rocky terrain of the nearby Alpilles mountain range. At his death, Gehry was completing several projects for luxury goods magnate Bernard Arnault, including an 7618-square-metre flagship store for Louis Vuitton in Beverly Hills, California, and, in Paris, the conversion of an abandoned 1960s building into an exhibition space and events hall down the block from Arnault’s Fondation Louis Vuitton building. He was also putting the final touches on a 1000-seat concert hall for the Colburn School of Music, near his Walt Disney Concert Hall in Los Angeles.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/socceroos-handed-tough-but-manageable-draw-for-world-cup-20251206-p5nldv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Socceroos handed tough but manageable draw for World Cup",
        "publish_date": "Sat, 06 Dec 2025 10:47:58 +1100",
        "category": "sports",
        "authors": [],
        "text": "Socceroos handed tough but manageable draw for World Cup\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/historic-win-vast-indigenous-cultural-landscape-gains-protection-20251205-p5nl8k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Historic win: Vast Indigenous cultural landscape gains protection",
        "publish_date": "Sat, 06 Dec 2025 10:46:50 +1100",
        "category": "finance",
        "authors": [
            "Dominique Tassell"
        ],
        "text": "A 33,000-square-kilometre expanse of land in south-west Queensland will be protected from major mining activity after federal Environment Minister Murray Watt placed the site of Indigenous significance on the National Heritage List.\n\nMithaka cultural landscape, which spans the Barcoo and Diamantina shires, has gained interest as the site of the East Lake Eyre Trade Route, believed to be the most extensive Indigenous trade and exchange network.\n\nThe area has multiple well-preserved sites, including quarries, standing gunyahs (homes), and stone arrangements. One of these quarries is the largest in the world created by a pre-agriculture society, and two of the housing structures date back to 1770 and 1787.\n\nAn aerial view of Mithaka quarries, one of which is the largest in the world created by a pre-agriculture society.\n\nThe site’s inclusion on the National Heritage List means anyone planning to carry out activities in the area will need a self-assessment of whether it could significantly impact the listed value of the area. This generally does not include day-to-day pastoral activities.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/truly-terrified-queensland-ballet-dancers-issue-on-stage-plea-for-funding-20251128-p5nj7k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Truly terrified’: Queensland Ballet dancers issue on-stage plea for funding",
        "publish_date": "Sat, 06 Dec 2025 10:39:32 +1100",
        "category": "entertainment",
        "authors": [
            "Nick Dent"
        ],
        "text": "Queensland Ballet dancers have made an extraordinary on-stage appeal to the federal government for more funding for their cash-strapped company.\n\nAt the opening night curtain call of The Nutcracker, soloist Georgia Swan asked the audience to sign a petition calling on the federal House of Representatives to increase ballet’s funding in line with other major Australian performing arts companies.\n\n“Despite over 60 years of success and the tireless efforts of our leadership team, we remain significantly underfunded compared to our industry peers,” Swan said, backed by the company’s dancers on the Lyric Theatre stage at the Queensland Performing Arts Centre.\n\nIn 2026, only two Queensland Ballet dancers will earn above the average wage, and 12 will be on the minimum wage. Credit: Angharad Gladding\n\n“This company is my family, and I am truly terrified about what may happen for us, and for Queensland, if we can’t secure a better funding outcome,” she said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/virginia-giuffre-s-family-asks-where-are-her-missing-millions-20251205-p5nlb1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Virginia Giuffre’s family asks: ‘Where are her missing millions?’",
        "publish_date": "Sat, 06 Dec 2025 10:22:39 +1100",
        "category": "finance",
        "authors": [
            "Connor Stringer",
            "Victoria Ward"
        ],
        "text": "Virginia Giuffre’s family members have raised questions over a “significant amount of missing money” in the ongoing row over what is believed to be her multimillion-dollar estate.\n\nGiuffre, who was 41 when she died in Western Australia in April, is thought to have amassed an estimated $US22 million ($33.1 million) fortune through victim compensation funds and civil lawsuit settlements relating to the years of abuse she suffered at the hands of the late American financier Jeffrey Epstein.\n\nVirginia Giuffre’s brother, Sky Roberts, has long challenged his brother-in-law’s right to inherit her money. Credit: Leigh Vogel for Sydney Morning Herald\n\nThis includes an estimated $US12 million payment she received from Andrew Mountbatten-Windsor, the former Prince Andrew, to settle a sexual abuse claim brought against him in 2022. Andrew has always vehemently denied any wrongdoing.\n\nHowever, court documents filed in the legal battle over her estate in Australia on Friday value it at just $472,000 – a legal threshold that dictates how assets in Australia are divided when there is no will. It may increase when more assets are discovered.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/is-labuschagne-back-the-signs-are-good-but-his-28-month-drought-continues-20251205-p5nlcc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Is Labuschagne back? The signs are good, but his 28-month drought continues",
        "publish_date": "Sat, 06 Dec 2025 10:17:02 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "The signs are promising that Marnus Labuschagne has announced himself as a mainstay of the Australian top order once again, as he cemented his reputation as the world’s most formidable batsman against the pink ball.\n\nBut the Queenslander’s hunt for an elusive century remains, in what will be the greatest indicator of whether the Labuschagne of old is truly back.\n\nThe No.3’s mid-year axing from the side has coincided with a new mentality, one free of the distrust in his instincts that plagued him for two years.\n\nMarnus Labuschagne, who made 65, has gone more than two years without a Test century. Credit: Getty Images\n\nOnce the world’s No.1 batsman, the 31-year-old has gone more than 28 months without a Test century, averaging 30.91 from the start of 2023 until the Ashes’ opening clash in Perth.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/this-sydney-lookout-was-once-a-local-secret-then-a-k-pop-star-came-20251202-p5nk9q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Sydney lookout was once a local secret. Then a K-pop star came to visit",
        "publish_date": "Sat, 06 Dec 2025 10:00:00 +1100",
        "category": "finance",
        "authors": [
            "Ellie Busby"
        ],
        "text": "Hidden down a dirt trail and with stunning panoramic views of Jamison Valley, Lincoln’s Rock at Wentworth Falls was once a local secret.\n\nBut now, on any given day hundreds of tourists flock to the Blue Mountains site to sit on the rock’s edge and capture the perfect Instagram shot.\n\nLincoln’s Rock has experienced a surge in visitors recently. Credit: Steven Siewert\n\nBlue Mountains Mayor Mark Greenhill said the recent influx of visitors could be explained by one thing: K-pop.\n\nIn 2023, one of the world’s biggest names in the Korean K-pop industry, Jennie from group Blackpink, shared with her 80 million-plus Instagram followers photos of herself at the lookout.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-would-anybody-want-to-be-an-independent-director-at-the-tigers-20251204-p5nkxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why would anybody want to be an independent director at the Tigers?",
        "publish_date": "Sat, 06 Dec 2025 10:00:00 +1100",
        "category": "finance",
        "authors": [
            "Darren Kane"
        ],
        "text": "Loading Wests Tigers Rugby League Football Club Pty Ltd is a voting member of ARLC and a licensee of the NRL, entitling it to participate in the NRL competition. Wests Tigers first participated under that licence in 2000. Before that time, there were the Balmain Tigers and the Western Suburbs Magpies; creatures hardly known for living in harmony in the wild. Each is a foundation rugby league club with a storied history. Wests Tigers’ membership of ARLC, and its licence agreement tethering it to the NRL, are interdependent - if the licence agreement is axed, the membership of ARLC cuts out too, and vice versa. Wests Tigers is a company with two shareholders: Balmain Tigers Rugby League Football Club Limited, and Wests Magpies Pty Limited. But this is where things unravel.\n\nThe internal governance of Wests Tigers isn’t a democracy, or anything close to it. Balmain holds 1,000,020 Class A ordinary shares in Wests Tigers; Wests Magpies holds quadruple that number. Wests Magpies owns 80 per cent of the total share equity and voting rights in Wests Tigers. But it wasn’t always that way, as you discover once you examine the history books (and the ASIC registers). Back in the simpler times of 1999, when the Magpies/Tigers arranged marriage was forged – with the spectre of extinction hovering – the union at least was an equal one. No more. Sustained financial calamities, striking with dreadful regularity throughout the last quarter-century, have manifested in the renegotiation of arrangements and the destruction of any semblance of balance in what’s now a husk of a “joint” venture.\n\nThe control of the Balmain and Wests Magpies shareholders is curiouser still. Balmain’s governance is unremarkable in a sporting club sense; the company is in the control of its members. Wests Magpies is fundamentally different. It has two shareholders: Western Suburbs Leagues Club Limited and Western Suburbs District Rugby League Football Club Limited. There’s three shares on issue in Wests Magpies: an A Class share, a B Class share and a C Class. Wests Leagues holds the A Class and B Class shares, Wests Football holds the C Class, but Wests Leagues exerts control over Wests Football regardless. Complicated, much? Wests Tigers is supposed to be governed by a nine-person board that includes “independent” directors. The concept of being a member of a football club connotes having a democratic say in things. Conversely, that’s not really how the Wests Tigers structure operates. And it seems nobody really values any independent thinkers and doers there.\n\nIn line with the unequal shareholdings, Wests Magpies has the power to appoint many more directors to Wests Tigers than Balmain can. But a different problem exists, in terms of how Wests Magpies itself makes decisions. West Magpies is a registered club, governed by both the Corporations Act and the Registered Clubs Act. The latter legislation prescribes the classes of members a registered club can have, and other internal governance rules. Like most registered clubs, there’s thousands of members. But a bizarre quirk of the Wests Magpies structure, is that the majority of power rests with a cohort of 20 “debenture” holders, who’ve (apparently) lent the club $100 at an interest rate of six per cent, in consideration for enjoying entry into the inner cabal that effectively controls Wests Magpies in terms of director appointments. It’s those 20 lenders, who control four-fifths of the voting strength of Wests Tigers, and the NRL franchise itself. Democratic? Hardly. But there are other issues here as well. Clause 47.1 of the Wests Tigers constitution says the company shall have a maximum of nine directors.\n\nLoading The appointment, removal and replacement of the directors is to occur in accordance with the company’s shareholder agreement and other instruments. The word “independent” is used no less than 55 times across the Wests Tigers’ constitution and shareholders agreement. There’s even an entire schedule that defines what the term means. Clause 4.11(g)(ii) of the shareholders agreement, governing the relationship between the Wests Tigers’ shareholders, casts material doubt on whether shareholders (not just Wests Magpies) can effectively give notice to remove an “independent director” as classified by the documents. Clause 4.11(g)(i) permits a shareholder who appointed a non-independent director to remove that director. Clause 4.11(g)(ii) requires notice from both shareholders AND National Rugby League Limited, to remove an independent director.\n\nWhich then leads to this question: which of Charlie Viola, Michelle McDowell, Annabelle Williams and Barry O’Farrell are the “independent directors” for the purpose of the Wests\n\nTigers governance documents? Those documents, in places, contemplate there being two independent directors. If there are only two directors of the four that, by proper definition, are the “independent directors”, legal questions exist about the proper basis for Wests Magpies’ belief that it, as the majority shareholder, can act alone. Wests Tigers CEO Shane Richardson. Credit: Oscar Colman Those questions need answers, before the Wests Tigers descend further. Whether O’Farrell or anyone else would bother torching money seeking Supreme Court injunctions about this stuff is hypothetical – who’d want to risk further damage to their reputation by seeking to stay in the tent? But assuming that Wests Magpies can issue a notice to remove an independent director, where that notice has proper legal effect, that then leads back to the fundamental question as to why anyone would want to be an independent director at all.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/man-seriously-injured-after-motorbike-collided-with-car-20251206-p5nldo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Man seriously injured after motorbike collided with car",
        "publish_date": "Sat, 06 Dec 2025 09:55:13 +1100",
        "category": "sports",
        "authors": [],
        "text": "Man seriously injured after motorbike collided with car\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/sad-reason-aussie-with-disability-repeatedly-kicked-out-of-pubs-have-some-awareness-000053576.html",
        "title": "Sad reason Aussie with disability repeatedly kicked out of pubs: 'Have some awareness'",
        "publish_date": "2025-12-06T00:00:53Z",
        "category": "finance",
        "authors": [],
        "text": "Imagine being turned away from bars, clubs, and venues for simply moving through a crowd the only way you safely can.\n\nThat’s the reality for Sydney man Daniel Leighton, 36, who lives with Retinitis Pigmentosa.\n\nIn an interview with Yahoo, he explained that the experience happens far too often.\n\n\"I was born with a hearing loss, and as I hit puberty, I started to lose my peripheral vision,\" Daniel said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I remember not ever being able to see well in low-light conditions, and then slowly I started losing more periphery until, by my 30s, it was basically gone.\n\n\"Now I just have a very narrow field of view, like a tunnel vision sort of situation.\"\n\nThere’s no treatment yet. Glasses don’t help, and stem cell research overseas hasn’t reached human trials.\n\nSo Daniel navigates the world with what vision he still has, and in crowded social settings, that comes with added challenges.\n\nDaniel lives with Retinitis Pigmentosa, a condition that causes gradual vision loss, especially in low-light settings. Source: Supplied\n\nBars, clubs, and music venues are the toughest. Daniel rarely uses his cane in packed environments because of their size.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Moving that around on the ground in large groups of people isn’t going to tell me anything. It’ll just tell me there are people all around me.”\n\nInstead, he places a hand on a friend’s shoulder — the only way he can safely move through tight crowds with low light and uneven footing.\n\nDo you have a story? Contact newsroomau@yahoonews.com\n\nBut to security staff, that often looks like someone who's unsteady on their feet.\n\n\"Bars and anywhere there’s drinking is notoriously bad,\" Daniel said.\n\n\"I personally don’t drink. If I buy a four-pack of pre-mixes, that’ll last me a fortnight. But when I go to bars, I might have a drink or two. I’ve shown up, not even walked up to the bar, and I’ve been asked to leave because they think I’m intoxicated when it’s clearly not the case.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOnce security makes that call, Daniel says it’s almost impossible to change their minds, even when he produces a pass confirming he's visually impaired.\n\n\"Sometimes they won’t even listen to the issue. They’ll just say, 'I don’t believe you’ve only had one drink,' and then it's, 'you don’t have to go home, but you can’t stay here.'\"\n\nDaniel attends gigs multiple times a month, at crowded venues and in chaotic mosh pits, all while living with low vision. Source: Supplied\n\nAnd despite brushing it off now, it hasn’t always been so easy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It used to definitely put a dampener on the night. We used to go home,\" he said. \"It feels pretty sh*tty. But my mates are such good friends — we just blacklist that place and never go back.\"\n\nDaniel's experience is far from isolated.\n\nVision Australia says many people with low vision describe similar treatment from bouncers, bar staff, and venue security.\n\nFocus groups conducted by the organisation found attendees consistently felt misunderstood and unsupported, often leaving events early or avoiding them altogether.\n\nDaniel's experience reveals a bigger issue at play\n\nChris Edwards, General Manager of Corporate Affairs and Advocacy at Vision Australia, said these incidents reveal a broader problem.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Music and concerts play an important role in social inclusion and cultural participation. People with a disability have a right to enjoy these events with their peers. However, mishandling by venue staff can easily derail this,\" he said.\n\n\"While increased lighting, large print signage, audio announcements and audio description are important accessibility features at all events, this needs to be effectively communicated to patrons.\"\n\nEdwards says accessibility isn’t just about physical design — though improved lighting, clear signage, audio announcements and audio description help — but about communication and awareness.\n\n\"Well-trained staff can bridge gaps in design and respond to individual needs in real time to support accessibility,\" he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nVision Australia is urging venues to brief staff on accessibility features, companion seating options, inclusive language, and the location of ramps, lifts, and viewing areas.\n\nDimly lit concert venues are particularly tough for him, but the biggest challenges go beyond environmental hurdles. Source: Supplied\n\nThey also recommend assigning a clear point of contact for accessibility queries and encouraging the use of both verbal and non-verbal communication when assisting patrons.\n\nDaniel believes the solution is simultaneously simple and overlooked.\n\n\"It’s got to be awareness and a little bit of empathy,\" he said. \"Yes, as security or a bouncer, that is your job, but a little bit of sensitivity and awareness is probably the main thing that needs to happen.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe also wants the public to understand that vision loss doesn’t always look the way people assume.\n\n\"I think the biggest thing is just how varied it can be. Just because someone’s blind doesn’t mean they don’t have any perception,\" he said.\n\n\"If you saw me out in public with a friend and not with my cane, I don’t think most people would pick it up. I can see what’s directly in front of me.\n\n\"I make good eye contact. Every person’s blindness or disability is different, even if it’s the same condition.\"\n\nDespite the setbacks, Daniel keeps showing up. The music scene, especially metal and punk, gives him the sense of community he wishes security guards could see.\n\nFor him, accessibility isn’t about rules. It’s about belonging.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]