[
  {
    "url": "https://www.9news.com.au/national/new-zealand-commentator-sparks-debate-over-plea-to-make-country-australian-state/b24e44f2-2dd8-4171-bcff-83df839d4de2",
    "title": "Top Kiwi pushes for New Zealand to become an Australian state",
    "publish_date": "Wed, 04 Feb 2026 01:10:43 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "A﻿ fresh debate has erupted across the Tasman Sea over whether New Zealand should officially be adopted as Australia's seventh state.\n\nKiwi pollster and political commentator David Farrar re-ignited ﻿the longstanding discussion and said it was high time New Zealand took up the 125-year-old invitation to become part of Australia.\n\nFarrar wrote in an opinion piece for The Post that ﻿Aotearoa should merge with Australia in the name of security amid rising global political tensions.\n\nAustralian Prime Minister Anthony Albanese and New Zealand Prime Minister Christopher Luxon. (Getty)\n\nHe said NZ needs to be \"bigger to survive\" and floated the idea of the ﻿country of 5.2 million people becoming an Australian colony.\n\n\"Joining Australia will protect New Zealand, enhance Australia and benefit us all,\" Farrar wrote.\n\nThe writer claimed the Trump administration has threatened the old world order﻿, a reference to Canadian Prime Minister Mark Carney's speech at the NATO meeting in Davos.\n\n\"The rules-based order is gone, and is not returning,\" Farrar added.\n\nShould New Zealand become an Australian state? Yes 529 No 610\n\n\"We are in an era where countries with might will do what they see as right for them.\"\n\nFarrar's suggestion is not far-fetched – Australia's constitution actually states that New Zealand may be admitted into Australia as a state.\n\nThe Commonwealth colony of NZ also participated in early Federation conferences before it was deemed an independent state.\n\nThere is also a reciprocal agreement ﻿which allows NZ residents to visit, live and work in Australia without a tourist or work visa, and vice versa.\n\nREAD MORE: Thousands back push to memorialise Bondi victim Matilda at playground\n\nFarrar argued New Zealand needs to be \"bigger to survive\". (Getty Images/iStockphoto)\n\nHowever, it appears many Kiwi residents aren't chuffed with the idea.\n\nThe opinion piece quickly triggered similar articles arguing against New Zealand becoming an Australian state.\n\nConservative political commentator Liam Hehir said the country's political independence is not something that should be traded away and argued the country's national identity is something to be preserved.\n\n\"If independence is to end, it will end because it has become impossible to sustain, not because a cost-benefit analysis shows we might do better as someone else's state,\" he wrote.\n\n\"Until then, the task is not to redesign ourselves, but to do our very best to adapt and thrive giving up as little about ourselves as possible.\"\n\nREAD MORE: Scorching heat and high winds trigger extreme fire danger warnings\n\nThere is also a reciprocal agreement ﻿which allows NZ residents to visit, live and work in Australia without a tourist or work visa. (Getty Images/iStockphoto)\n\nAnother piece from The Post noted that any desire from New Zealand to join Australia would likely be \"unrequited\".﻿\n\nA survey launched by Stuff also found 56 per cent of its readers oppose the idea.\n\nNZ Prime Minister Christopher Luxon immediately ruled out the idea of abandoning sovereignty.\n\n\"This won't be happening,\" a spokesperson from his office told The Post .\n\n\"New Zealand values our close relationship with Australia, but we also value our unique national identity and our sovereignty.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/interest-rates-australia-forecast-2026-rba-hike/78b14cd1-8594-499e-a22a-9046ca0a9624",
    "title": "Aussies warned to brace for more interest rate pain after RBA hike",
    "publish_date": "Wed, 04 Feb 2026 01:51:29 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Australian borrowers have been warned to expect even more mortgage pain in the coming months after yesterday's interest rate hike .\n\nThe Reserve Bank's monetary policy board unanimously decided to raise the cash rate by 25 basis points, up to 3.85 per cent, at its first meeting of the year, in a move widely expected by economists.\n\nIn her press conference following the decision, RBA Governor Michele Bullock would not be drawn on whether future hikes were likely.\n\nREAD MORE: AI bot says it would kill a human to avoid shutdown ﻿\n\nSome economists have warned Australians to expect another interest rate hike this year. (Getty)\n\n\"It is not the same as the tightening cycle when we were coming out of COVID, when we were coming from a 0.1 per cent cash rate; it was quite clear that we had to go up and we had to go up quickly,\" she told reporters.\n\n\"This isn't as clear.\"\n\nOthers aren't as circumspect.\n\nCommonwealth Bank has now changed its interest rate outlook for the year, joining NAB in pencilling in a hike to 4.10 per cent in May.\n\nREAD MORE: Big four banks all pass on RBA rate hike ﻿\n\nThe RBA's updated forecasts now have inflation remaining above the 2-3 per cent target until mid-next year, while core inflation isn't predicted to reach the middle of that band until 2028.\n\nCBA head of Australian economics Belinda Allen said that \"will not be tolerated by the RBA\".\n\n\"The risk always sat with a second rate hike to bring inflation back towards target and the economy back into balance,\" she wrote.\n\n\"With the labour market now in a better position than a few months ago, and an increased resolve from the RBA, on the balance of probabilities we now see the RBA hiking again in May to take the cash rate to 4.10 per cent.\n\nREAD MORE: New push for tradies to stop work in extreme heat ﻿\n\nReserve Bank Governor Michele Bullock, as always, refused to provide forward guidance about where rates are heading.. (Louie Douvis)\n\n\"But it remains a line-ball decision and is dependent on the data flow from here.\"\n\nThe remaining two big four banks – Westpac and ANZ – are tipping interest rates will remain on hold for the rest of the year, although both have admitted there is a risk of another hike.\n\n\"The low bar for further hikes means that, (without) a downside surprise in the March quarter inflation outcome, the monetary policy board is likely to hike again in May,\" Westpac chief economist Luci Ellis said.\n\nIn a further blow to the likelihood of inflation cooling off quicker – and potentially avoiding the RBA pushing up rates again – new research from non-profit the e61 Institute showed yesterday's rate increase may not do much to slow down rising prices.\n\n\"Raising rates may not have a large impact on consumer spending in the near term,\" research director Dr Gianni La Cava said.\n\nREAD MORE: More than a million homeowners struggling to pay mortgage ﻿\n\nWhile it's not known whether the RBA will hand down another hike, any chance of lower rates is well and truly gone. (Tony Yoo)\n\n\"We found that when the RBA hiked rates by 4.25 percentage points over 2022 and 2023, people with variable mortgages barely changed their spending habits despite payments rising by $14,000 a year on average.\n\n\"This was because they could mostly finance the extra payments from large savings held in offset and redraw accounts.\n\n\"Those savings absorbed the shock, letting many households preserve their lifestyles despite higher interest costs.\n\n\"In late 2025, households still had significant buffers in their offset and redraw accounts, with 40 per cent of mortgage holders holding enough savings to make minimum payments for two years.\n\n\"This indicates that the latest interest rate rise will likely have a limited impact on spending through the cash flow channel.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/finance/interest-rates-more-than-one-in-three-mortgage-holders-struggling-with-repayments/a130f045-2ded-4ff2-898b-3eeba1f92a65",
    "title": "'Silent strain': More than a million homeowners struggling to pay mortgage",
    "publish_date": "Tue, 03 Feb 2026 22:41:12 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "N﻿ew research shows more than a million mortgage holders were struggling with repayments before the Reserve Bank of Australia lifted the cash rate yesterday .\n\nOne in three homeowners – equivalent to 1,155,000 people – said they struggled to pay their mortgage in January, according to a survey by comparison site Finder released today.\n\nIt comes after the the official cash rate was yesterday increased by 25 basis points to 3.85 per cent, the first hike in two years﻿.\n\nREAD MORE: Big four banks all pass on RBA rate hike\n\nThe interest rate hike is putting further financial stress on Aussie households. (Getty)\n\nAustralia's big four banks have all moved to raise variable interest home loan rates .\n\nTo gain any relief from financial stress, the average borrower would need their interest rate to drop to 4.6 per cent, the Finder research found.\n\nIt also revealed 12 per cent of borrowers say they have missed at least one mortgage repayment in the past six months.\n\n﻿The rates hike also added to the gloomy outlook of Australians seeking to buy their first home, with 36 per cent believing they'll never take a first step on the property ladder.\n\nYesterday's rate hike will add about $100 to an average mortgage holder's minimum monthly repayments, although many borrowers have a buffer built up thanks to last year's three cuts.\n\nFinder home loans expert Richard Whitten says the small rise in interest rates could push thousands of borrowers further into financial stress﻿.\n\n\"Many ﻿households are already cutting back on spending just to keep up with their home loans – it's a silent strain on families,\" he said.\n\n\"And the cost of living has continued to rise. So rising loan repayments only add to the strain.\"\n\n\"Now is the time to explore your mortgage options before stress turns into a crisis.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/not-so-grey-nomads-south-australian-couple-allan-mercer-jess-smith-ditched-mortgage-and-rentals-for-life-on-the-road/c46712f9-d91b-4600-80ae-621757bfed51",
    "title": "Jess and Allan chose a 116,000km trip over a mortgage and have no regrets",
    "publish_date": "Tue, 03 Feb 2026 18:32:35 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Five years ago, as the COVID-19 pandemic raged on , Allan Mercer and Jess Smith reached a fork in the road.\n\nThe South Australian couple realised they had two options: pursue the white picket fence dream and buy a house, or leave it all behind to live permanently on the road.\n\nNaturally, the pair of \"not-so-grey\" nomads chose the latter.\n\n﻿Mercer, 41, and Smith, 32, sold almost everything they owned, gave up their three-bedroom rental and decked out a campervan to permanently explore Australia.\n\nAllan and Jess quit their jobs to travel full-time around Australia. (Supplied)\n\nAround ﻿116,000 kilometres later, they have no plans to ever return to their old lives.\n\n\"﻿We were both working normal jobs,\" Mercer told nine.com.au.\n\n\"Jess is a physiotherapist by trade, and at the time, I was running my own personal training business, which was doing well.\"﻿\n\nThe couple often worked six-day weeks and grew weary of the rat race.\n\nAnd while plenty of their friends and family members back home knuckled down to buy a house, Mercer and Smith wanted something more.\n\nThey didn't want to wait until retirement to see their own backyard.﻿\n\n\"We hardly ever got to go away. We never really had weekends,\" Mercer added.\n\n\"We kind of got sick of paying somebody else's mortgage for their house.\n\n\"While we were sort of saving money, it wasn't enough to be able to get out of the rent cycle.\"\n\nThe South Australian couple decided to avoid a mortgage for life on the the road. (Supplied)\n\nMercer said he \"pestered\" his now-fiancee to take the leap.\n\n\"One particular day, Jess actually just turned around and said, 'Yep, let's do it',\" he recalled.\n\nAfter ending their lease and holding a garage sale, the couple set off ﻿for an indefinite trip alongside Mercer's parents, who also live on the road full-time.\n\nSmith said her own parents were a little \"shocked\" by their decision﻿.\n\n\"They [asked me], but you've got a partner, why don't you buy a house?\" she laughed.\n\nAged in their 20s and 30s when they embarked on their adventure, Mercer and Smith are among tens of thousands of younger Australians who are eschewing mortgages for life on the road.\n\nAn Australian Facebook group known as \" Not Grey Nomads ﻿\" has over 300,000 members and counting.\n\nAround ﻿116,000 kilometres later, they have no plans of ever returning to their old lives. (Supplied)\n\n﻿Half a decade and a trove of priceless ﻿experiences later, Mercer and Smith have no regrets about buying a van instead of a property.\n\nThey have travelled ﻿to almost every state and territory in Australia except the ACT.\n\nTheir dream life has taken them to WA's Pilbara, Fortescue Bay in Tasmania, the Nullabor Plain, SA's Flinders Ranges, Rottnest Island, Bundaberg and Uluru.\n\n\"We've definitely done the coin toss before to decide which way to go,\" Mercer said.\n\n﻿\"I like being spontaneous now, I can deal with not having an exact plan for where we are going,\" Smith added.\n\nRight now, they are slowly making their way through Victoria's High Country.\n\nWhen it gets colder, the couple will migrate north to \"follow the sun\".﻿\n\nThe pair sometimes toss a coin to decide where they will go next. (Supplied)\n\nFinances can be the most difficult part of full-time travel.\n\nSmith still keeps her ﻿registration as a physio by taking on casual appointments wherever they travel, and they both pick up odd jobs at pubs, caravan parks or bottle shops in small towns to earn cash.\n\n\"The most it's ever taken us to find work over five years is two days,\" Mercer said.\n\nThey also run a popular YouTube channel and Instagram page called ExploreOz , which they hope can earn them full-time income.﻿\n\nIt can cost between $500 to $1000 per week to live on the road.\n\nThat includes petrol, van maintenance, internet bills, ﻿flat tyres, food and campsite fees.\n\nDiesel petrol for their ﻿2023 Isuzu D-Max is the biggest expense that eats into their budget.\n\n\"We're spending a lot less money per week now compared to what we would be spending ﻿on a mortgage,\" Mercer added.\n\nMercer and Smith have no intention of ending their travels and say it's possible to live on the road \"forever\".\n\n\"We still get a lot of, 'How's your trip going? How's your holiday?\" Mercer said.\n\n\"But this is our life now. This is what we do.\"﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/queensland-government-sells-off-state-owned-land-for-housing-developments/f540fa21-2411-42d5-a95d-1613eeb4335c",
    "title": "Queensland government's plan to boost housing draws criticism",
    "publish_date": "Tue, 03 Feb 2026 16:02:20 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "The Queensland government is selling off state-owned land to developers, in a bid to boost housing supply.\n\nToday, Deputy Premier Jarrod Bleijie started the state-wide sale with a 400-home development on Brisbane's northside.\n\nBut the new developer-driven housing scheme has drawn criticism from local residents and housing advocates alike.\n\nREAD MORE: ﻿ Fears homes may have been lost as bushfires rage in South Australia\n\nThe Queensland government is trying to boost housing supply but a 400-home development in Brisbane's north has drawn criticism from residents and housing advocates alike. (9News)\n\nThe scheme's effectively a land sale program, unlocking under-utilised state-owned land for private development.\n\nThe first parcel, a six-hectare block in Banyo, will go from a former Energex depot to 400 new homes.\n\n\"We are serious about supply, supply, supply and we're serious about partnering with the private sector,\" Bleijie said.\n\n\"When government and industry work in lockstep, we can actually deliver things faster.\"\n\nBut Queensland Council of Social Service chief executive Aimee McVeigh had questions over affordability.\n\nDeputy Premier Jarrod Bleijie started the state-wide sale, with a 400-home development on Brisbane's northside. (9News)\n\n\"The concern is, that this plan won't deliver more social and affordable housing for Queenslanders, which is so sorely needed,\" she said.\n\nLocal residents are also critical, claiming they weren't consulted and calling for better infrastructure in the area.\n\n\"[I'm] happy to see it developed and it needs to be developed but now they're talking high density, 400 housing, the streets just can't handle it,\" neighbouring resident Keith Bitossi told 9News.\n\nThe scheme's effectively a land sale program, unlocking under-utilised state-owned land for private development. (9News)\n\nFellow resident Chris Vale agreed.\n\n\"The infrastructure for roads, stormwater and sewer just cannot handle what we've got now,\" he said.\n\nCriticism aside, the deputy premier is expected to announce further sites across the state in coming days and the land sales won't stop there.\n\nUnder the new scheme, developers can also register interest in public land not already earmarked for sale.\n\nLocal residents are critical, claiming they weren't consulted and calling for better infrastructure in the area. (9News)\n\nThe government stresses it isn't about selling land for the right price, it's \"about land activation and housing supply\".\n\nBut opposition spokesman for state development Cameron Dick isn't buying it.\n\n\"This LNP plan is a big win for property developer and a massive loss for Queenslanders seeking to put a roof over their own head,\" he said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/interest-rates-major-banks-announce-rate-changes-following-rba-hike/ef7913a0-37ce-49a0-a063-ce159c48d6b2",
    "title": "Big four banks all pass on RBA rate hike",
    "publish_date": "Tue, 03 Feb 2026 21:52:24 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "Australia's big four banks have all moved to pass on the Reserve Bank of Australia 's interest rate hike .\n\nThe official cash rate was today increased by 25 basis points to 3.85 per cent , the first hike in two years.\n\nWestpac was the first to announce that it would raise its variable interest home loan rates by 0.25 per cent but the Commonwealth Bank of Australia, National Australia Bank and ANZ quickly followed suit.\n\nAS IT HAPPENED: Reserve Bank announces rate hike﻿\n\nThe official cash rate has risen by 0.25 basis points to a total of 3.85 per cent. (Dominic Lorrimer)\n\nWestpac's changes will take effect from February 17 while the other banks will shift on the 13th.\n\nToday's hike will add around $100 to an average mortgage holder's monthly repayments , although many borrowers have a buffer built up thanks to last year's three cuts.\n\nThe central bank's updated economic forecasts didn't bode well for borrowers, with inflation not predicted to come back into the 2 to 3 per cent target band until June 2027, and core inflation not tipped to reach the middle of that range for a further year.\n\nBut Governor Michele Bullock seemed genuinely unsure about what her bank's next move will be.\n\n\"It is not the same as the tightening cycle when we were coming out of COVID, when we were coming from 0.1 per cent cash rate; it was quite clear that we had to go up and we had to go up quickly,\" she said.\n\n\"This isn't as clear.\"﻿\n\nCBA's economists expect another hike in May, taking the cash rate to 4.1 per cent, because there's unlikely to be enough evidence by then to show today's hike is slowing demand.﻿\n\n\"Inflation is simply too high for the RBA at this stage, and the central bank has signalled a stronger resolve to bring it back within target,\" Commonwealth Bank head of Australian economics Belinda Allen said.\n\nNAB chief economist Sally Auld suspected this was unlikely to be a \"one-and-done\" scenario for the RBA.\n\nFinancial comparison site Canstar also warned homeowners to prepare for the possibility of future rate hikes while noting the banks' silence on savings.\n\n\"None of the big four banks have said anything about savings rates – creating an unfortunate waiting game that keeps loyal savers in the dark,\" data insights director Sally Tindall said.\n\n\"A climbing cash rate can be good news for steadfast savers, but know that banks often hand-pick which rates go up and which ones miss out.\"\n\nInvestors ramped up bets for a follow-up hike in May, which is now priced about 75 per cent. Markets expect an additional total tightening of 40 basis points this year.\n\nThe RBA joins the Bank of Japan as the only other developed-world central bank tightening policy at the moment. Markets are still priced for rate cuts in the US, UK and Canada, while the European Central Bank is widely expected to be on an extended pause.\n\nMarkets had wagered on a 78 per cent probability of a hike given inflation surprised on the high side in the fourth quarter, while unemployment hit a seven-month low in December.\n\nThe Australian dollar extended earlier gains to be up 0.9 per cent to $US0.7002 while three-year government bond yields jumped 8 basis points to 4.3 per cent.\n\nThe RBA did not raise interest rates as aggressively as its international peers when inflation was running hot due to its desire to preserve gains in the labour market.\n\nThat approach may yet test policymakers. The central bank's three rate cuts last year saw inflation rear its head again, forcing it to pivot towards a hawkish stance late in 2025 and prompting market bets of an earlier-than-expected start to the tightening cycle.\n\n- reported with Reuters ﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/constructions-workers-narrowly-avoid-falling-load/70e1b4a6-f98a-4f15-94e3-c067f9c2bf76",
    "title": "Construction workers narrowly avoid falling scaffolding on Sydney job site",
    "publish_date": "Tue, 03 Feb 2026 07:30:23 +0000",
    "category": "finance",
    "authors": [
      "Feb"
    ],
    "text": "More than a tonne of scaffolding narrowly missed a group of construction workers as it plummeted more than 20 storeys in Sydney 's north this morning.\n\nDashcam from shortly after 8am today captured workers jumping out of the way to avoid the falling load.\n\nThe crash zone off Talavera Road at Macquarie Park was fenced off today, with crane work halted as its steel wire ropes remain buckled below.\n\nDashcam from just after 8am today capturing the load of scaffolding narrowly missing this worker who jumps out of the way. (2GB)\n\nSafeWork NSW is now looking into the incident to determine whether human error or mechanical failure played a role. (Nine)\n\nWorkers were seen getting stuck back in to work, though the focus remains on what caused the failure.\n\n\"Urban is proud of its safety record and will conduct a full investigation into this matter,\" Urban Property General Manager Nick Gaudry told 9News in a statement.\n\nSafeWork NSW is looking into the incident to determine whether human error or mechanical failure played a role, and if it was preventable.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/ski-racing-event-lake-bonney-riverland-cancelled-south-australia/106299936",
    "title": "Waterski racing event cancelled amid permit issues",
    "publish_date": "Wed, 04 Feb 2026 02:37:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "A waterski racing event in South Australia's Riverland has been cancelled after organisers said they would not be able to meet the necessary permit requirements.\n\nIt comes as South Australia's Department for Infrastructure and Transport (DIT) and the sport's peak body, Ski Racing Australia, previously confirmed the event was unsanctioned.\n\nThe event — organised by a group called Riverland Water Ski Racing SA and promoted on Facebook in early December — was scheduled to take place at Lake Bonney on February 7 and 8.\n\nIt had 17 races scheduled, with some set to feature racers being towed by powerboats at speeds of up to 144 km/h.\n\nSome of the proposed events were set to reach speeds of up to 144km/h (90mph). (Source: Riverland Water Ski SA lake race format)\n\nThe event promoted entry fees of $350 per boat and $300 per participant on its Facebook page, with 130 participants across 27 boats confirmed to take part as of January 21.\n\nBut in a social media post, Riverland Water Ski Racing SA said Marine Safety SA had \"presented a late list of permit conditions\" that was not \"feasible to meet\" so close to the event taking place.\n\nEvent organisers say they will be refunding participants who had already entered. (Source: Riverland Water Ski Racing SA)\n\n'Further clarification' required\n\nIn a statement, a DIT spokesperson confirmed it had still been reviewing an application from the organisers for an aquatic activity licence when it was notified of the event's cancellation.\n\nThe department said it had reached out to receive \"further clarification and documentation from the organiser\" as part of its assessment process.\n\n\"We had been undertaking a detailed review of the application ... to determine whether sufficient assurance was provided that risks to participants, officials and other river users could be adequately managed,\" the DIT spokesperson said.\n\nThe department told the ABC it had received an aquatic activity licence application from Riverland Water Ski Racing SA on January 16 — two weeks ahead of the event taking place.\n\nThe department requires applications for such a licence to be submitted \"no less than four weeks before an event\", and at least four weeks' notice is required to \"ensure the licence can be issued before the event\".\n\nDIT requested \"further clarification and documentation from the organiser\". (Source: Riverland Water Ski Racing SA proposed race course)\n\nRiverland Water Ski Racing SA did not provide answers to questions from the ABC about the cancellation of the event.\n\nIn its social media post earlier this week, it stated \"all paid memberships will be refunded\" while it works on getting the event \"back on the water\".\n\nRacing under review\n\nThe national body, Ski Racing Australia, is currently undertaking a broader review of its risk management framework following the suspension of racing events in 2024.\n\nThe review recommended the prohibition of all water ski racing on river courses and a permanently-imposed speed limit of 110km/h on all towing activities.\n\nDIT said outcomes of the review, which was undertaken by the NSW Government, are \"expected to inform future ski racing events\".\n\nDIT says it will be monitoring Lake Bonney this weekend. (ABC Riverland: Sophie Landau)\n\nThe department confirmed its staff would be operating in the Riverland this weekend to ensure compliance was upheld on Lake Bonney.\n\n\"Marine Safety Officers will be present in the Riverland over the weekend to monitor activity and enforce compliance, including speed limits and other safety requirements, to help ensure the safety of all waterway users,\" it said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/diamonds-eye-timely-glimpse-of-jamaica-in-test-series/106304506",
    "title": "Diamonds eye timely glimpse of Jamaica in Test series",
    "publish_date": "Wed, 04 Feb 2026 02:21:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's netballers expect to gain precious intelligence ahead of a showpiece tournament when they host Jamaica in a three-Test series.\n\nThe world number one Diamonds meet Jamaica in the first Test in Adelaide on Thursday night — a rematch of the 2022 Commonwealth Games gold-medal game.\n\nAustralia won that clash, and with another Commonwealth Games looming in Scotland from late July, the Test series will provide coach Stacey Marinkovich's side with a timely glimpse of the world number three Jamaicans.\n\nDiamonds bolster defence for Jamaica series Australia's netball hierarchy settles on a replacement for an injured defender ahead of the Diamonds' three-Test series against Jamaica.\n\nBut it will be just a glimpse rather than an in-depth look, with Jamaica resting a batch of stars, including shooters Jhaniele Fowler-Nembhard and Romelda Aiken-George.\n\n\"You still prepare the same way,\" Diamonds defender Matilda Garrett told reporters on Wednesday.\n\n\"Obviously the list is slightly different. It's our job to make sure that we analyse every single player who you might come up against and see what each player likes to do, what channel they like to run in and things like that.\n\n\"So similar preparation as to what we would if we were playing against some of the other players that we have played against multiple times.\n\n\"It's kind of exciting to see the depth that they have in their squad, and it helps with Commonwealth Games preparation as well, because any of these girls could be selected.\"\n\nGarrett was summoned into the 12-strong Diamonds squad to replace fellow defender Sunday Aryang, who tore an anterior cruciate ligament during Australia's most recent Test in October.\n\n\"Obviously it was very devastating for Sunday and also us, seeing her go down,\" Garrett said.\n\n\"But with netball when people do go down with injuries, it does open up opportunities, and I feel very, very grateful to be here.\n\n\"When the list came out, I did shed a few tears — I just feel super grateful to be here, and I just want to take every opportunity with two hands if I get the chance to go out and play.\"\n\nAfter the series opener in Adelaide, the Diamonds host Jamaica in Perth on Sunday and Melbourne next Wednesday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/demons-defender-may-misses-afl-pre-season-training/106304280",
    "title": "Demons defender May misses AFL pre-season training",
    "publish_date": "Wed, 04 Feb 2026 01:47:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "Veteran Melbourne defender Steven May was a notable absentee from training, six weeks out from the start of the AFL season.\n\nThe 2021 premiership defender will be a restricted free agent at the end of this season.\n\nMay was a key figure in last year's trade period, but failed to find a new home.\n\nThe Demons have been contacted for comment after May was not at Wednesday morning's training session.\n\nOff the field, May and Richmond midfielder Dion Prestia are fighting criminal charges after a late-2024 brawl in Sorrento on Victoria's Mornington Peninsula.\n\nLast month, the pair asked for the charges to be withdrawn, saying they were not there.\n\nThey are due to face Frankston Magistrates Court again on February 20.\n\nMay, 34, played 16 senior games last year for a career total of 251. He endured a mixed season, serving a three-match ban for a high bump, and also had Hawthorn veteran Jack Gunston kick a bag of seven on him.\n\nThe Demons are in major transition, with coach Simon Goodwin sacked last year and Steven King appointed for his first senior role.\n\nStar onballers Christian Petracca (Gold Coast) and Clayton Oliver (GWS) were traded after last season.\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/defence-to-sell-leeuwin-irwin-barracks-in-perth-aukus/106304108",
    "title": "Defence to sell prime Perth riverside land to help pay for AUKUS",
    "publish_date": "Wed, 04 Feb 2026 01:38:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Dozens of hectares of prime residential land in Perth's leafy western suburbs and along the Swan River will be sold off amid a shake up of the Australian Defence property portfolio.\n\nThe federal government has announced plans to either fully or partially sell 67 defence sites across the nation in the hopes of freeing up around $1.8 billion for bases in Australia's north and the AUKUS submarine pact.\n\nIn Western Australia, the Defence Department plans to sell off its main Army Reserve site at Irwin Barracks, which sits on a 61.5-hectare site in Karrakatta.\n\nAs many as 1,150 reservists are expected to be impacted by the move, with the department anticipating their work will move to Palmer Barracks in South Guildford once the site is sold.\n\nAbout 200 Australian Defence Force personnel and 250 cadets would also be affected by the move.\n\nThe government will also try to sell Leeuwin Barracks, which sits on 14-hectares of prime riverfront land in East Fremantle, for a second time after a bid in 2015 fell over.\n\nThe government has tried to sell Leeuwin Barracks before, without success. (ABC News: Jessica Strutt)\n\nAbout 250 cadets will be the largest group affected by the move, as well as up to 150 reservists, 100 public service staff and 50 ADF personnel.\n\nNew facilities at Palmer Barracks\n\nDefence Personnel Minister and WA MP Matt Keogh said the process would now begin to start moving people from both bases.\n\nDefence Personnel Minister Matt Keogh says Palmer Barracks will be turned into \"the ongoing base in the Perth metro area\". (ABC News: Courtney Withers)\n\n\"There will be quite a bit of construction work that will need to happen with new, state-of-the-art facilities to go into Palmer Barracks which will provide a consolidated site, near the airport, good transport links, to be the ongoing base in the Perth metro area, if you like, to support our predominantly reservist forces,\" he told ABC Radio Perth.\n\n\"And then once that's ready to go those defence force members, public servants, will move to that site, and then Irwin and Leeuwin will be able to be divested.\"\n\nMr Keogh said while across the nation Defence land would end up being used for a \"wide variety\" of purposes, it would be fair to say some would be turned into housing.\n\nGovernment to sell historic defence properties The Albanese government has identified 67 defence sites for potential sale, aiming to unlock up to $1.8 billion.\n\nA Defence fact sheet about plans for WA says final decisions about personnel movements will be made \"following consultation\".\n\nChanges in regional WA\n\nThe government says all proceeds from land sales will be retained and reinvested by Defence.\n\nThe importance of strengthening the nation's northern bases was highlighted in the 2023 Defence Strategic Review, which described Western Australia's northern coast in particular as a \"primary area of military interest\".\n\nNot only is it likely the nation's first line of defence against any potential attack, but the region is also home to much of the nation's mining and resources industry,\n\nArmy cadets are likely to be most affected by the closure of Leeuwin Barracks. (ABC News: Charlotte Hamlyn)\n\nThe audit which recommended the government's planned sell off also called for an \"integrated strategy\" for all Defence facilities in the Exmouth region.\n\nThe Commonwealth agreed to that recommendation, committing to create an \"integrated strategy for the Exmouth region aligned with the Defence Strategic Review\" and a plan to manage the area as an \"integrated regional precinct\".\n\nThe shake up is also expected to see the government ends its lease of two regional rife ranges near Busselton and Karratha.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/paedophile-compensation-payment-loophole/106300310",
    "title": "Child abuse survivors want paedophile pay-out loopholes tightened",
    "publish_date": "Wed, 04 Feb 2026 01:23:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Edan van Haren was 14 in 2010, when a pattern of repeated sexual abuse began at the home of former Bega Cheese boss Maurice Van Ryn, on the far south coast of New South Wales.\n\nFive years later, Van Ryn was jailed for 13 years for abusing nine boys and girls since 2003.\n\nIn July 2023, after initially being offered $25,000 by Van Ryn's legal team, the now 29-year-old Mr van Haren was awarded $1.4 million in damages by the NSW Supreme Court.\n\nHis abuser has since declared bankruptcy, using a legal loophole that extinguishes the victim payment while protecting assets in superannuation, and the Adelaide resident is yet to see a cent of the money.\n\n\"It made me feel abused and manipulated, and like the world just wanted victims to keep losing,\" he said.\n\nEden van Haren was a teenager when he fell victim to child predator Maurice Van Ryn. (Supplied: Van Haren family)\n\nThe federal government is considering changes to superannuation and bankruptcy laws that would help survivors access their abuser's retirement savings if the perpetrators fail to pay court-ordered compensation.\n\nThe draft law would let survivors apply to the Australian Taxation Office for information about their abuser's superannuation accounts and seek the release of money to meet unpaid compensation orders.\n\nThe proposed changes would also see compensation debts survive if abusers declare bankruptcy to avoid paying their victims.\n\nThe payments would be limited to certain types of super contributions made from the time the abuse began, including personal contributions, and extra employer contributions not legally required.\n\nMr van Haren welcomed the government's attempt to close the loopholes, but said the draft legislation contained \"a few errors\".\n\n\"I think all super should be available to victims, not just … additional contributions,\" he said.\n\n\"If the government doesn't get this right, then you end up with a cycle where there are all these victims that don't end up having their own super in the long run because they haven't been able to maintain a job.\n\n\" It just makes the victims suffer and not the paedophiles. \"\n\nAndrew Carpenter says the draft legislation does not go far enough. (ABC News: Ashlin Blieschke)\n\nMr van Haren's lawyer, Andrew Carpenter, said the proposed legislation did not go far enough.\n\n\"The original pitch to the government that we made was that it should be for all victim-survivors of child abuse, regardless of [an abuser's] conviction or not,\" he said.\n\n\"The many people who succeed with civil actions should have it available to them, because if a judge makes a ruling that the abuse occurred and someone is awarded damages, why shouldn't they be able to access the superannuation of the offenders?\n\n\" This means that the taxpayer is going to continue to indemnify the sins of these offenders, and the offenders can simply enjoy their retirement and their millions of dollars of superannuation. \"\n\nMr Carpenter said it took on average more than two decades for victim-survivors to report abuse.\n\n\"By that time evidence dries up, witnesses pass away and it is very hard to get a conviction with the passing of that time,\" he said.\n\n\"However in the civil sphere, offenders don't usually enjoy the right to silence and have to take part in the civil action and subject themselves to cross-examination.\"\n\nAttorney-General Michelle Rowland announced the public consultation period on Monday. (ABC News: Matt Roberts)\n\nJason Harris, professor of corporate law at Sydney University, said the reforms were a step in the right direction.\n\n\"One thing that is unfortunate is that the period of consultation is only a few weeks, and there are no doubt complexities in these proposals and how they will slot into the tax and bankruptcy system,\" he said.\n\n\"So they will need to be fully considered to make sure that the proposals are going to achieve the victims' goals and help provide them with realistic avenues of compensation.\n\n\" Often when the government has a very short consultation period, it's because they have already made up their mind. \"\n\nA spokesperson from the office of Assistant Treasurer and Minister for Financial Services Daniel Mulino said the bill was likely to pass parliament over the next few months.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/south-australia-government-low-interest-loans-farmers-drought/105129392",
    "title": "SA government offers low-interest drought loans to farmers",
    "publish_date": "Wed, 04 Feb 2026 01:00:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "South Australian farmers under financial strain from years of drought will be able to access low-interest loans of up to $250,000 from the state government.\n\nThe $200-million program will be made available to drought-affected farmers in some of SA's worst-hit regions — the Murray Mallee, Riverland and Upper North.\n\nIt follows months of calls from farmers and industry groups for the government to offer no or low-interest loans to those whose finances have been significantly impacted in recent years by some of the worst drought conditions on record.\n\nSA Premier Peter Malinauskas says the new loan program adds to drought support measures previously announced by the government. (ABC News: Sophie Holder)\n\nPremier Peter Malinauskas deemed the measure necessary due to an \"unprecedented\" situation.\n\n\"This is not what state governments normally do,\" he said.\n\n\"If I'm honest about it, some of our treasury officials are worried about setting the precedent, but some of the conditions that some of the farmers are facing are unprecedented, which is why ultimately I made the judgement that this response was necessary.\n\n\"We don't want to see good farmers missing out on access to cashflow at critical times around seeding, that then potentially could set them up for years ahead.\"\n\nThe SA Drought Loan Scheme comes in addition to $97-million drought assistance measures previously announced by the state government.\n\nFarmers struggling with finances\n\nEmily Morgan, who farms in Jabuk in the Murray Mallee, says farmers have been asking for such a measure \"for a very long time\".\n\nEmily Morgan, a farmer from Jabuk in SA's Mallee, has advocated for low-interest loans. (Supplied: Emily Morgan)\n\n\"We would have loved to have heard about this a year and a half ago, but look, it's a really positive announcement,\" she said.\n\n\"We really struggled when the drought hit with inputs, really struggled to pay for hay, for fertiliser, for fuel — and the government's package at the time didn't really match what we actually needed, which was a low-interest loan.\n\n\"We run legitimate businesses and when we face tough times we need the ability to be able to pause our interest and principal repayments so we can recover — and when we recover and [get] back in the swing of things, we're able to repay.\n\n\" We're not asking for handouts or charity — we're asking for the ability to continue to run our business. \"\n\nIndustry group Grain Producers SA (GPSA) proposed the loan scheme to the state government throughout the drought.\n\nChief executive Brad Perry said it was essential drought-affected farmers got access to the loans quickly to ensure crops could be planted this year.\n\nFarmers won't have to start repaying the new loans for the first two years, in which time it's hoped their situation will improve. (ABC News: Emily Doak)\n\n\"They've done everything they can in their power, but if it doesn't rain you can't grow crop,\" he said.\n\n\"They're really struggling and talking about only being able to put in a quarter or less of their crop this season.\n\n\"What we want is for this loan to be able to help them get back on their feet, get through these seasons to when it does rain again, and they can get back to some normality, we keep these good farmers in the industry, and we don't lose generations of farmers.\"\n\nUnder the program, grain and livestock producers will be able to borrow up to $250,000 under a 10-year loan, with a two-year grace period before repayments need to be made.\n\nThe drought forced many SA farmers to either destock or invest heavily in fodder to keep their livestock fed and healthy. (ABC Rural: Selina Green)\n\nThe loans will have concessional interest rates for the first two years at 50 per cent of the Commonwealth 10-year bond rate, after which the rate will match the Commonwealth rate.\n\nLower interest loans on offer\n\nMr Malinauskas says this will be lower than the current interest rate offered by the federal government's Regional Investment Corporation (RIC) loan scheme, which sits at 5.18 per cent.\n\nHe said it had become clear the RIC's loans were not \"as generous as many people in the agricultural sector would like\".\n\nParts of SA recorded their driest conditions in 2024. (ABC Rural: Selina Green)\n\n\"Industry has made pretty clear that the adjustments that were made following the review of the RIC loans by the federal government haven't met their needs,\" Mr Malinauskas said.\n\n\"That's what spurred us into action to say 'listen, there are still a number of communities around the state still very adversely affected by the drought'.\n\n\"Because the federal government's program doesn't work, we're going to do our own.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/nrl-rule-changes-announced-kick-off-trial/106303402",
    "title": "Change to rugby league kick-off rule delayed until end of season",
    "publish_date": "Wed, 04 Feb 2026 00:47:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "A proposed rule change to the rugby league kick-off will not be enforced at the start of the 2026 NRL season, instead being trialled during matches later in the year.\n\nThe Australian Rugby League Commission on Wednesday announced four new on-field rule changes ahead of the new season, which begins in Las Vegas on Sunday, March 1, AEDT.\n\nHowever, there was no change to the kick-off announced in the ARLC's package of approved rule adjustments.\n\nA change to the kick-off rule had been proposed following a score, where the non-scoring team would have the option of either kicking or receiving the restart.\n\nThe ARLC announced on Wednesday the rule tweak would be trialled at the end of the season in matches \"with no bearing on the finals\".\n\n\"The consultation process was thorough and constructive, and while there was initial support for the kick-off proposal, stakeholders raised legitimate concerns,\" ARLC chairman Peter V'landys said.\n\n\"After weighing that feedback carefully, the Commission determined that it was not in the best interests of the game to proceed with that particular change at this time.\"\n\nA statement from the ARLC announced four rule changes for the 2026 season:\n\nTrainer rules — Trainers will be restricted from entering the field of play to prescribed and clearly defined circumstances. This will ensure player safety remains the priority while reducing unnecessary intrusions by trainers carrying messages.\n\nInterchange rules — Teams may interchange four players, up to eight times per match, from a squad of six players (players 14 to 19 inclusive).\n\nAccidental breach (zero tackle) in-goal — There will be no seven-tackle set following a knock-on in-goal by the attacking team.\n\nRestarting the tackle count — For certain infringements beyond the 20-metre line, the tackle count will restart, replacing the current 40m threshold.\n\nIn a statement, Mr V'landys said it was hoped the changes would improve the spectacle of the game, while also adding tactical options for coaches.\n\n\"The changes that are being implemented are intended to build on the success of the 2025 season by enhancing the entertainment value for fans, while also providing additional tactical options for coaches.\n\n\"The game is in a brilliant place. The players are producing incredible feats and the fans are responding. These changes will enhance the game further and continue to ensure this is the best and most watched sport in the country.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/measles-case-in-adelaide-prompts-exposure-site-release/106302520",
    "title": "Measles case in person who hadn't travelled 'very much a concern'",
    "publish_date": "Wed, 04 Feb 2026 00:22:35 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "South Australia's health department says undetected measles is circulating in Adelaide, after an infection was identified in someone who had not recently travelled.\n\nSA Health said the adult acquired the infection locally, with chief public health officer Nicola Spurrier describing the case as \"very much a concern\".\n\nSA Health has released a list of possible exposure sites — including trams, food venues, a swimming centre and the BHP building in the CBD — that were attended by the adult while infectious.\n\nProfessor Spurrier said measles was \"highly contagious\" and can have potentially severe consequences.\n\nShe said while measles was always concerning, cases in recent years had typically been in people who had travelled overseas.\n\n\"In this particular case that we've had notified, they have not travelled, they haven't travelled interstate, they haven't been on a plane and they haven't been overseas and that means we've got undetected measles circulating in Adelaide, which is really very much a concern to us,\" she told ABC Radio Adelaide.\n\n\"We've been for such a long time in a measles-free state, in a way.\n\n\"Measles is highly contagious — it's one of the most contagious infectious diseases and it can also have very severe complications and in fact one of those is brain infection or encephalitis.\"\n\nProfessor Spurrier said contact tracing had been undertaken.\n\nSA Health said the measles case visited the following locations while infectious, and that people who were there at the same time might have been exposed:\n\nJanuary 26: Unley Swimming Centre, Ethel St, Forestville, 4pm to 6:30pm\n\nUnley Swimming Centre, Ethel St, Forestville, 4pm to 6:30pm January 27: 9:42am Adelaide Metro Tram from Forestville to Royal Adelaide Hospital\n\n9:42am Adelaide Metro Tram from Forestville to Royal Adelaide Hospital 10:11am Adelaide Metro Tram from Royal Adelaide Hospital to South Terrace\n\nBHP, 10 Franklin Street Adelaide, on 27 January, 9:45am to 5:30pm\n\nRolls n Rice, 6/118 King William Street, Adelaide, 12:45pm to 1:30pm\n\n48 Flavours, 248 Unley Road, Hyde Park, 5pm to 6:00pm\n\nThe BHP office on King William Street in Adelaide is on the list of possible exposure sites. (ABC News: Eugene Boisvert)\n\nSA Health advised anyone not fully immunised, and who attended those locations at those times, \"to be alert for symptoms over the next few weeks and to see a doctor if they become ill\".\n\nBut it urged people who suspected they could have measles to phone their doctor beforehand and tell them why they were intending to attend, \"so precautions can be taken to avoid spreading disease to others\".\n\n\"Once it's in the air and the person leaves, it can actually hang around for about 30 minutes,\" Professor Spurrier said.\n\n\"When you're in an enclosed space — if it's in the change room, for example, it's an enclosed space — then it is highly contagious.\"\n\nSA Health said the latest case is the second notified in South Australia this year, and it has recommended people ensure they are vaccinated with two doses.\n\n\"With measles … you're actually infectious a day before you get the symptoms, and you start off with symptoms which are a cough and a bit of runny nose,\" Professor Spurrier said.\n\n\"It becomes more obvious when, about four days later, you get a rash.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/metro-trains-premier-apologise-over-passenger-delay/106302914",
    "title": "Metro Trains boss, premier apologise for chaos on peak hour services",
    "publish_date": "Wed, 04 Feb 2026 00:00:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Melbourne's rail service provider and the premier have both apologised to passengers who were trapped in hot carriages for hours after a fault halted services running through the new Metro Tunnel on Tuesday evening.\n\nThousands of peak hour commuters were disrupted when an overhead power fault at Armadale halted peak-hour trains on the newly re-routed Cranbourne, Pakenham and Sunbury lines just days after full services began running through the new tunnel.\n\nAbout 600 passengers were stuck on board two trains without air-conditioning for up to to two hours in 30 degree Celsius heat before they could be evacuated from their carriages and walked along the line to their nearest station in Malvern.\n\nOther services were cancelled during the chaos and after the fault was fixed, including services from Caulfield through the Metro Tunnel and out to West Footscray for the rest of Tuesday night.\n\nPassengers had to walk to Malvern station after being helped off a stationary train. (Supplied: Britney Burgess)\n\nMetro Trains CEO Raymond O'Flaherty said the shutdown was caused by an overhead wire and pantograph — the apparatus mounted on the roof of a train that connects to the powerline — becoming entangled.\n\nHe said he apologised to all Melbourne commuters.\n\n\"I know it was incredibly frustrating and took a lot of extra time for them to make their journeys,\" Mr O'Flaherty told ABC Radio Melbourne.\n\n\"Particularly, I want to apologise to the 600 passengers that were on board the two trains that were stuck on the network for one-and-a-half to two hours while we went through a safe method to de-train them.\n\n\" They deserve better. \"\n\nRaymond O'Flaherty inside the Parkville station when the Metro Tunnel opened in November. (ABC News)\n\nMr O'Flaherty defended the amount of time it took to get the passengers off the sweltering carriages.\n\n\"Because of where the incident occurred between two stations on a live track, it was a very complex environment,\" he said.\n\n\"We had trains running on adjacent lines, we had electrical wires that came down and were on top of the trains.\n\n\"Because we were very nervous making sure that everybody would be safe, that no-one would be electrocuted, that's why it took us that 90 minutes to two hours before we could get people off the trains.\"\n\nHe said passengers were directed onto alternative City Loop trains and replacement buses.\n\n\"It was inconvenient, but having the City Loop … did give us that backup, we were able to get people onto trains.\"\n\nMetro Trains says crews had to make sure it was safe before passengers could walk to to Malvern station. (Supplied: Britney Burgess)\n\nTransport and technology journalist Jeremy Burge was heading into the city on a City Loop train last night when he heard about the Metro Tunnel disruptions.\n\n\"Being a transport nerd, [I] walked to State Library to see how the first major disruption to the Metro Tunnel was being handled,\" he said.\n\nMr Burge said the screens that displayed service and schedule information were still indicating that trains were running as normal, half an hour after the lines were shut down.\n\n\"I saw staff frantically trying to stop people heading down to the platforms, because if you were transferring at Melbourne Central you'd look at the screen and it would say, 'Train in five minutes or 10 minutes' and that was not true,\" he said.\n\n\"That was definitely the source of confusion.\"\n\nHe said there was no signage directing passengers to instead take a City Loop train.\n\n\"Passenger information displays were also not updated for about 40 minutes or so.\n\n\"Staff were having to verbally tell people to turn around.\"\n\nJacinta Allan says the fault and display of wrong passenger information would be investigated. (ABC News)\n\nPremier Jacinta Allan on Wednesday joined Metro Trains in apologising to commuters.\n\n\"I'd like to acknowledge and apologise to those passengers who had a really difficult experience last night,\" she said.\n\nMs Allan said investigations into the cause of the fault were underway, and there would also be a probe into what went wrong with passenger information screens.\n\n\"It's not the experience that we want passengers on any part of our train network to have.\"\n\nMetro Tunnel big switch New timetables are being rolled out across Melbourne's train network, with more than 1,200 extra weekly services commencing from today.\n\nThe state opposition has accused the government of failing to prepare Melbourne's train network for high capacity metro trains (HCMT).\n\nShadow Minister for Public Transport Matthew Guy said the existing infrastructure could not support the city's new trains.\n\n\"This is like an Apple iPhone but the system is built … with a battery that can manage Nokia phones.\"\n\nThe routes of the Cranbourne, Pakenham and Sunbury lines changed as part of the Metro Tunnel project and on Sunday began running at full capacity every three to four minutes through the underground stations.\n\nMetro Trains said it would consider whether affected passengers would receive compensation in the coming weeks.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/wittenoom-trespass-pilbara-townsite-filled-with-asbestos/106242016",
    "title": "No plans to increase security at Wittenoom after blogger's 'devastating' visit",
    "publish_date": "Tue, 03 Feb 2026 22:41:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Authorities say they have no plans to increase security or patrols around one of Western Australia's most heavily contaminated landscapes, despite a popular travel video blogger showing just how easy it is to access.\n\nWittenoom, 1,600 kilometres north of Perth, was home to Australia's biggest industrial disaster, with the former town's asbestos mines linked to an estimated 4,000 deaths.\n\nAfter years of deliberation and planning, demolition work at the Wittenoom town began in 2023. (Supplied)\n\nThe town was closed and buildings demolished by the WA government due to the risks.\n\nBut Queensland mum Ronelle Fotinis said she was drawn to visiting the former town as part of her fascination with places \"out of the norm\".\n\nRonelle and her daughter plan to continue their travels around Australia in the next few years. (Supplied: Facebook)\n\nHer curiosity led her to Wittenoom late last year, filming and posting videos to social media and her YouTube channel Adventure Life Oz.\n\nBut her decision to bring her four-year-old daughter to her visit has been heavily criticised by asbestos disease advocates.\n\n'It only takes one visit'\n\nAsbestos Disease Society of Australia chief executive Melita Markey says you cannot take back an asbestos exposure.\n\n\"It's devastating, as a parent, as a mother,\" Ms Markey said of the visit.\n\n\"I think it just comes down to people making that choice of risk. People are attracted to risk. But where I feel that it's wrong is that they are putting their attitude to risk onto their children.\n\n\" We do have teenagers with mesothelioma in this country. \"\n\nMelita Markey, CEO of the Asbestos Diseases Society of Australia (ABC News: Nicholas Martyr)\n\nMs Markey said people did not need to be in the town long to inhale deadly crocidolite fibres that were invisible to the naked eye.\n\nWhile the asbestos mine was closed in 1966, the town continued to operate for decades, with the school open until 1985 and the Wittenoom races held until 1991.\n\nJockeys who attended the circuit fewer than five times have since succumbed to asbestos-related diseases, with Wittenoom their only known contamination.\n\nCrowds gather at Wittenoom Race Course in 1970, despite the asbestos mine closing in 1966. (Supplied: State Library of Western Australia)\n\nAttention despite safety risks\n\nDespite the serious risks posed by visiting the site, a small but steady stream of travellers continues to dice with both a physical and financial penalty.\n\nBut the WA government does not plan to take any further action to restrict access.\n\nIn a statement, the Department of Planning, Lands and Heritage said access remained prohibited, and could incur a $500 fine.\n\nWittenoom sits next to picturesque gorges and mountains in the Pilbara, but all infrastructure was demolished in 2023. (Supplied)\n\n\"It is critical that anyone in the area complies with warning signs and road bunding that is in place for their own health and safety,\" a spokesperson said.\n\nBut the curiosity remains, with videos such as Ms Fontinis's attracting a considerable online audience.\n\n\"I thought it would be our version of Chernobyl, and it is in a way,\" she said in one video.\n\n\"[That] you'd still have buildings and play equipment, I don't know that's how I envisaged it — they've just taken everything and what's left is a few roads that nature is taking back.\"\n\n'A calculated risk'\n\nMs Fotinis said she took precautions for her own and her daughter's safety.\n\n\"I made sure I never got out of the car,\" she said.\n\n\"I also made sure that my air conditioning was on recirculate, windows were up … we never touched the ground there, anything like that.\n\nRonelle and her daughter were able to drive around barriers to the town site, which is not gated or fenced off. (Supplied: Facebook)\n\n\"I don't believe we were any more exposed driving through there than we were in Karijini National Park when you could flick it [asbestos] off the wall.\"\n\nAfter posting videos of her visit, Ms Fotinis said some of the feedback she had received was positive, with many recalling fond memories of their time living there or visiting.\n\nOthers called her out on her actions.\n\nExposed asbestos fibres can be seen at Dales Gorge in Karijini National Park. (ABC News: Michelle Stanley)\n\n\"I completely understand where they are coming from,\" she said.\n\n\"However, I did take a calculated risk in that sense and made sure we were as safe as.\n\n\" In hindsight, I would have definitely never taken my daughter there. \"\n\nMs Fotinis said the blocked-off entry was very easy to bypass, with another car also having a look around while she was there.\n\n\"If [WA authorities] were dead-set serious and it was as toxic as what they were saying, it would be cleaned up for one and closed off properly for two,\" she said.\n\n\"I don't regret going, but at the same time, I'm not going to go back.\"\n\nTowering asbestos tailings remain at the former Wittenoom mine to this day. (Supplied)\n\nPolicing a contaminated site\n\nDue to contamination, the area is not routinely checked by WA Police or the local shire, with emergency services and police only responding to life-threatening situations.\n\nWA Police said it was aware of the social media post and held concerns that online promotions of Wittenoom would encourage people to visit.\n\nA spokesperson said Wittenoom was not a tourism destination.\n\n\"Doing so exposes individuals to serious health risks associated with the well-documented asbestos contamination,\" they said.\n\n\"The contamination at Wittenoom is permanent, and the risk to health is significant.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-02-04/randa-abdel-fattah-to-attend-adelaide-writers-event/106302864",
    "title": "Randa Abdel-Fattah to appear at Adelaide literary event in March",
    "publish_date": "Tue, 03 Feb 2026 22:37:33 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Palestinian Australian author Randa Abdel-Fattah will appear next month at an alternative event to this year's now-cancelled Adelaide Writers' Week, after she was uninvited from the original literary festival.\n\nThe organisers of Constellations: Not Writers' Week said Abdel-Fattah would appear in conversation with former Writers' Week director Louise Adler, who resigned last month amid furore regarding the Adelaide Festival board's decision to cancel Abdel-Fattah's scheduled appearance.\n\nThe \"in conversation\" event between Abdel-Fattah and Adler will be presented by the Australian Friends of Palestine Association at the Adelaide Town Hall on March 1.\n\nConstellations: Not Writers' Week has been organised by a group of local booksellers, publishers and authors in lieu of the annual Writers' Week.\n\nThe Adelaide Festival board last month decided to rescind an invitation for Abdel-Fattah to speak at Adelaide Writers' Week because of comments she had made about Israel and Zionism.\n\nAdelaide Writers' Week was scrapped this year amid controversy over the cancellation of Randa Abdel-Fattah. (ABC News)\n\nHer cancellation came after SA Premier Peter Malinauskas wrote to the board strongly urging against the inclusion of Abdel-Fattah on the program of Writers' Week, saying it was \"not in the public interest\".\n\nThe announcement of her non-attendance prompted a mass boycott by more than 100 other authors, which in turn triggered the cancellation of the event for 2026.\n\nAmid the controversy, the Adelaide Festival board stepped down, and a new board was swiftly appointed.\n\nThe new board later apologised to Abdel-Fattah, saying she would be invited to speak at Writers' Week upon its return in 2027.\n\nAbdel-Fattah and Adler's appearance was one of several items on the Constellations program announced today.\n\nAbdel-Fattah will also be appearing at a session entitled Rivers of Reason: Blak & Arab Writers in Conversation on March 2, alongside authors including Yankunytjatjara poet Ali Cobby Eckermann, novelist Melissa Lucashenko and academic Chelsea Watego, organisers said.\n\nAdelaide-based Nobel Prize winner J. M. Coetzee is scheduled to appear at a mini-poetry festival curated by poet and former host of the ABC's Poetica program Mike Ladd.\n\nOrganisers said the Constellations line-up showcased First Nations authors, as well as interstate and international writers.\n\nEconomist and former Greek finance minister Yanis Varoufakis, who had been scheduled to talk at Writers' Week, will take part in a panel discussion at the Adelaide Town Hall alongside guests including Bob Brown.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/this-is-about-the-best-version-of-pirates-of-penzance-you-could-see-20260128-p5nxok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This is about the best version of Pirates of Penzance you could see",
    "publish_date": "Wed, 04 Feb 2026 13:31:27 +1100",
    "category": "entertainment",
    "authors": [
      "Bridget Davies",
      "Nadia Bailey",
      "Andrew Fuhrmann",
      "Jessica Nicholas",
      "Sonia Nair"
    ],
    "text": "Advertisement\n\nKey points OPERA: Victorian Opera puts on a joyous staging of The Pirates of Penzance\n\nMUSIC: Nick Cave and the Bad Seeds perform at Alexandra Gardens\n\nDANCE: Garabari at Midsumma is enjoyable – and participating is non-negotiable\n\nJAZZ: The Necks deliver a five-star performance at Melbourne Recital Centre\n\nTHEATRE: The Placeholder at fortyfivedownstairs wades into thorny territory\n\nOPERA\n\nThe Pirates of Penzance ★★★★\n\nVictorian Opera, Palais Theatre, until February 6 If The Pirates of Penzance proves one point, it’s that silliness is timeless. Raucously popular for almost 150 years, a good Pirates is still a guaranteed money-spinner. This staging, originally by Opera Australia, has been met with laughter and acclaim wherever she sails. Victorian Opera is now at the helm, but audience reaction will be no different. Ben Mingay as The Pirate King. Jeff Busby With comedic plots of clever rhymes sung at rapid-fire pace to catchy melodies, Gilbert & Sullivan is a style unto itself. Pirates is the most joyous piece in the G&S canon, with innumerable proliferations across popular culture, including perhaps the most parodied song in the English language, I Am the Very Model of a Modern Major-General. VO artistic director Stuart Maunder has fashioned this production with a lifetime’s worth of devoted insight. There’s thought behind the tiniest details; he has squeezed as much funny out as is possible.\n\nAdvertisement\n\nBen Mingay’s much-lauded Pirate King is charismatic and wonderfully riotous, always scene-stealing. He gels naturally with Nicholas Jones, a VCA graduate turned Paris Opera principal artist, as Frederic. Jones deploys his full bag of tricks for this role: effortless operatic tenor, impeccable comedic timing, notably un-wussy sword fighting, even some ballet. Opposite him are emerging and seasoned opera darlings (respectively) Nina Korbe and Antoinette Halloran. Korbe’s coloratura hits every mark perfectly, and while Halloran’s cockney Ruth might conjure up her recent turn as Mrs Lovett, she’s reliably excellent, as is tenor Douglas Kelly as the pirate Samuel. This is just about the best version of Pirates of Penzance you can see. Jeff Busby Stage stalwart Richard Piper (Major-General Stanley) appears more at home with comedy than music. He somehow, on opening night, managed to get ahead of the orchestra during his famous number, though he still landed the laughs. Conductor James Pratt does an otherwise superb job of keeping everyone and everything together, bringing requisite buoyancy to Orchestra Victoria’s playing of the score. One omission sorely missed is surtitles. Though sung in English, diction in the chorus numbers tended towards unintelligibility. Any real pitfalls are those present in the work itself (and some are very dated). With that in mind, is this production just about the best version of Pirates that you could see? Aye aye!\n\nReviewed by Bridget Davies\n\nAdvertisement\n\nMUSIC\n\nNick Cave and the Bad Seeds ★★★★★\n\nAlexandra Gardens, January 30 Across his decades-long career, Nick Cave’s work has always courted darkness: his lyrics reverberate with images of biblical violence, with the ache of loneliness and grief, with the kind of love that goes hand in hand with death. Yet equally, he is attuned to beauty and salvation; to the distant, longed-for possibility of redemption. It is in the tension between these two impulses, never quite reconciled, that the strength of his artistry lies. Nick Cave and The Bad Seeds at Alexandra Gardens on Friday. Richard Clifford This artistry was on full display at Melbourne’s Alexandra Gardens, where an electrifying 2½-hour set somehow didn’t seem long enough. It’s been nine years since Cave last toured with the full complement of the Bad Seeds, and the band seems determined to make up for lost time. Every person on stage comes to the performance with absolute conviction: from Warren Ellis working his unruly magic with the violin, to the gorgeous textures of the gospel-inflected backing choir, and the magnetic, visceral energy of Cave himself.\n\nAdvertisement\n\n“It seems like we’ve been on a great odyssey across this country to get to Melbourne,” he says, to roars of approval. This is a show for the home crowd. The set deftly balances work from the band’s 2024 album, Wild God, with cherry-picked tracks from its extensive back catalogue. An early highlight is a searching performance of O Children from the 2004 album, Abattoir Blues/The Lyre of Orpheus, while Cave’s darker impulses are on full display in the seductively menacing groove of Red Right Hand and the apocalyptic bombast of The Mercy Seat. Nick Cave’s artistry was on full display at Melbourne’s Alexandra Gardens, where an electrifying 2½-hour set somehow doesn’t seem long enough Richard Clifford While the show contains its moments of pain, rage and despair, these days, joy is perhaps Cave’s primary register. It’s there in the naive lyrics of Frogs, in his open-hearted tribute to former bandmate and collaborator Anita Lane in O Wow O Wow (How Wonderful She Is), and most defiantly in Joy, in which Cave conjures up a ghostly child visitor with a message of hope amid the tragedy of the everyday: “We’ve all had too much sorrow, now is the time for joy.” A generous, six-song encore showcases some of the band’s best work: from an elemental rendition of The Weeping Song to a sensitive cover of Young Charlatans’ Shiver (perhaps the world’s most accomplished love song ever to have been written by a 16-year-old). A luminous performance of Into My Arms brings the evening to a close: tender, plainspoken, the darkness tempered always by light.\n\nReviewed by Nadia Bailey\n\nAdvertisement\n\nDANCE\n\nMIDSUMMA | Garabari ★★★\n\nMeat Market, North Melbourne, until January 31 Garabari is billed as a participatory event, so there’s no excuse for not playing along. Forewarned is fair warning: you’ve bought a ticket, so you’ve got to help out. It’s not going to work if you don’t bring your dancing shoes. Garabari at Midsumma Festival fits the community mood and travels well. Courtesy of Sydney Festival Yes, at first, it’s awkward. People meander through the large, dark space, drifting aimlessly and smiling apologetically. The soundscape is a disconcerting mix of creakings and scrapings. We’re warming up to the room and to each other. Of course, it’s all part of a larger narrative. We’re already inside a re-visioning of the story of the Murrumbidgee River’s creation. This first part is a time of drought, we’re told, a time of dust and heat and general suffering.\n\nAdvertisement\n\nThe performers circulate through the crowd and little dances begin to appear: fragmentary routines for two or three or four. Crowds gather and disperse. It’s as if something is bubbling away, building up. Eventually, there’s a short but effective narrative dance showing the liberation of the waters by the youngest and bravest of the goanna women. Huge shadows loom against a curtain as the earth cracks open and land is quenched. After that, the party begins in earnest. Everyone has to dance. The performers keep it moving, calling people in, co-ordinating mass choreography, whooping and hollering and carrying on. It’s diverting – even if it feels a little forced. It almost recalls the compulsory jollity of cruise ship entertainment or theatre for children, with the performers policing participation, albeit with endless grinning and an ultimately tolerant attitude to refusal. As a celebration of the stories and rituals from the Wiradjuri community around Wagga Wagga and the Riverina, where the show was developed, Garabari is enjoyable, for all its goofiness and happy-clappy enthusiasm. It’s a fun homage to the institution of corroboree. Whether it becomes anything like a true rite of passage, leaving participants altered, is another question. That’s a tall order for such a brief performance – little over an hour. But at Midsumma Festival, it fits the community mood and travels well.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nJAZZ\n\nThe Necks ★★★★★\n\nMelbourne Recital Centre, January 29 At first glance, the three members of The Necks are mere musicians. But Chris Abrahams, Lloyd Swanton and Tony Buck are also magicians. How else to explain the way they pull invisible threads of sound from the ether and fashion them – instinctively, intuitively and moment-by-moment – into perfectly formed musical tales? The Necks - Lloyd Swanton, Tony Buck and Chris Abrahams. Camille Walsh Photography Now in their 39th year together, the trio has developed the kind of creative communion that makes each fully improvised journey feel both thrillingly unpredictable and somehow inevitable. Thursday night marked the start of the band’s annual Australian tour, and an air of hushed anticipation greeted the trio’s arrival on stage. Sparsely lit and heads bowed, they waited in silence. When Swanton began plucking his bass – slowly, deliberately – it felt more like a prayer than a series of notes. Buck’s touch on cymbals was equally spare and reverential, as was Abrahams’ glistening piano.\n\nAdvertisement\n\nInfinitesimal variations in tone and texture were explored, drawing us deep into this meditative realm as the mood gradually darkened. Related Article Melbourne live reviews Even this pop star thinks having her gig at the tennis is a bit weird Swanton’s bass morphed into an insistent buzz, its vibrations merging with Abrahams’ open-pedal piano clusters and Buck’s briskly whisked cymbals. Tranquility gave way to tension, the blood-red stage lights echoing the sense of high drama that was as menacing as it was enthralling. The second set opened in a pool of limpid beauty: exquisitely lyrical piano motifs, reverberant bass and lightly padding toms. Serene, drifting, lovely. Again, the music beckoned and disarmed us, luring us in as the restful sway turned into a more full-bodied swell and then a churning sea. This time, the roiling waves seemed majestic rather than forbidding. Perhaps by now we’d surrendered – no longer caught in the current but letting ourselves be swept along by it, just as the musicians were. Buck’s torso rocked back and forth, embodying the restless energy that coursed through the music. Agitation and abstraction; hallucinatory spirals of sound; and then, as if by magic, the waves subsided and we found ourselves gently carried back to shore.\n\nReviewed by Jessica Nicholas\n\nAdvertisement\n\nTHEATRE\n\nThe Placeholder ★★★\n\nfortyfivedownstairs, until February 8 The shared experience of grief has culminated in many an incisive theatre piece centred on chosen families navigating existential questions of loss, friendship and mortality – Domenica Feraud’s off-Broadway play Someone Spectacular and, closer to home, Ash Flanders’ Malthouse production This Is Living among them. The kitchen of matriarch Pat (Meredith Rogers, centre) becomes the focal point of The Placeholder. Darren Gill Ben MacEllen’s The Placeholder is the latest play to wade into thorny territory. We’re plunged headfirst into 2017, notably the year queer communities were subjected to a postal survey on marriage equality. It’s a devastating time, illustrated by clips of real-life interviews and news segments showcasing the bigotry that was allowed to flourish. United by virtue of Barb’s Bosom Buddies – a fundraising collective dedicated to honouring the memory of namesake Barb, who died of breast cancer – five disparate people in the fictional rural town of South Bend find themselves meeting monthly to brainstorm badges, banners, cookies and muffins.\n\nAdvertisement\n\nRelated Article Performing arts What is it about this show that can prompt a lifetime of obsession? Matriarch Pat (Meredith Rogers) is a soft-spoken retiree whose kitchen becomes the focal point of the play, brilliantly materialised by Bethany J. Fellows’ set design. Helen (Michelle Perera) is a widow with a heart of gold and a penchant for baking. A proud lesbian, Keira (Rebecca Bower) self-medicates with alcohol to withstand living in a cloistered town. Barb’s niece Jo (Brigid Gallacher) is the conservative black sheep of the group. And sporty Nic (Oliver Ayres) used to go by Nicole, until they announce they’re transitioning into a man. The reprisal is swift. The elder members of the group, Pat and Helen, paradoxically take it in their stride, but Keira is incensed by the perceived loss of a lesbian peer, and Jo insists it’s all just a phase. The remainder of the play details the fallout of Nic continuously insisting on his personhood against bad-faith arguments and a gulf of miscomprehensions. As the kindest, most level-headed character, Helen is who most audiences will project themselves onto. But Perera, so brilliant in This Is Living, is also the strongest of the ensemble. Her comedic timing is impeccable as she expertly oscillates between empathetic displays of allyship and perfectly executed moments of humour that imbue the play with levity at key junctures. Pat (Meredith Rogers) and Nic (Oliver Ayres) in The Placeholder. Darren Gill\n\nAdvertisement\n\nFunctioning like a time capsule by virtue of being set nearly a decade in the past, The Placeholder provides a stage for various expressions of acceptance and opposition as the group muddles through supporting Nic. A cookie-cutter bigot, Jo’s views cover well-trodden, odious ground. But it’s Keira’s see-sawing between solidarity and gender essentialism and a self-victimisation that’s impervious to the marginalisation of others that’s harder to stomach – and altogether more interesting. MacEllen presents thought-provoking contrasts between desired gender-affirming care and unwanted life-saving surgery, gender and sexuality, mental deterioration and newly prized lucidity. But at close to three hours, The Placeholder is simply too long. MacEllen’s script retreads familiar ground in the play’s second act, which drags lugubriously to its emotional climax(es). Related Article Exclusive\n\nArts From a New York bathroom to regional Victoria: An exhibition of art’s heavy hitters is on its way The tenuous connecting thread of a makeshift charity doesn’t explain why these characters are so invested in one another, and why they tolerate unconscionable behaviour – particularly from Jo. As a result, the emotional payoffs are muted, hampered further by unnatural, dialogue-heavy exposition and uneven acting during key dramatic reveals. Much is left unresolved by close. Keira’s alcohol addiction continues to be the butt of jokes, Pat’s clear descent into dementia is unremarked upon. String-heavy interludes between scenes are peppered with a greatest hits compilation of what happened in the intervening years – good, bad, ridiculous. But the cacophony, so effective initially in illustrating the overwhelm of the marriage equality vote, overpowers the play by the end.\n\nReviewed by Sonia Nair The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/traveller/travel-news/two-weeks-seven-stops-revived-original-kangaroo-route-takes-off-20260204-p5nzg4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two weeks, seven stops: Revived original ‘Kangaroo route’ takes off",
    "publish_date": "Wed, 04 Feb 2026 13:06:30 +1100",
    "category": "finance",
    "authors": [
      "Ute Junker"
    ],
    "text": "Advertisement\n\nTravel newsAir travel Two weeks, seven stops: Revived original ‘Kangaroo route’ takes off Ute Junker February 4, 2026 — 1:06pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt is rare for a boarding announcement to be greeted with cheers, but when Captain’s Choice chief executive Bas Bosschieter announced that QF1337 was ready for boarding this morning, the crowd of 131 passengers at Gate 11 at Sydney’s Kingsford Smith airport hollered their approval. This Sydney to Darwin flight is the first leg in a two-week, seven-stop journey recreating the “Kangaroo Route” launched by Qantas in 1947, so called because of the short “hops” made by aircraft with limited flying range. Flight attendants don vintage Emilio Pucci-designed Qantas 1970s uniforms. Excitement as passengers board the first Kangaroo Route QF1337 flight. To enhance the nostalgic feel, ground staff were clad in vintage Qantas uniforms from the 1970s designed by Emilio Pucci, featuring a fetching floral print for women and a striking orange-jacket-with-mustard-shirt combination for the men.\n\nAdvertisement\n\nBut there are significant differences between this trip aboard the Port Stephens, a chartered Qantas Airbus A330-300, and the journey on the Lockheed L-749 Constellation pioneered in 1947. Sign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now. Back then, the trip from Sydney to London took five days, including 59 hours flying time – a lightning-fast pace when compared with the flying boats of the 1930s, which took twice as long. The route for the journey in 2026. A 1947 poster shows the Lockheed L-749 Constellation that pioneered the Kangaroo Route. The updated itinerary for the Captain’s Choice Pioneering Spirit of the Kangaroo Route journey is a more leisurely experience. Over 14 days it follows an almost identical flight path to the first route wholly operated by Qantas in 1947, with stops in Darwin, Singapore, Kolkata, Colombo, Cairo, Rome and Toulouse.\n\nAdvertisement\n\nMost of the flights will be between three and five hours, with the longest leg, Colombo to Cairo, stretching seven hours and 50 minutes. Only half the onboard seats were made available for sale, ensuring passengers have space to stretch out. The retro-style boarding pass. Ute Junker A Qantas Lockheed Constellation, which used to fly the Kangaroo Route. Captain’s Choice is using a chartered Qantas Airbus A330 for its recreation. Unsurprisingly, many of the passengers willing to shell out for the experience – all-inclusive fares start at $49,950 – are serious aviation nerds. They include Singapore-born Perth resident Keng Wong, whose passion for planes began as a child when his brother would take him to the Paya Lebar airport to watch the aircraft. “I fell in love with the Lockheed Constellation. It had such huge propellors, it made so much noise, it had this dolphin shape and a three-pointed tail,” says Wong, who later spent 25 years working in catering for Qantas.\n\nAdvertisement\n\nWong and his fellow devotees will have plenty of opportunities to get their geek on. Optional activities along the way including a visit to the Darwin Aviation Museum, access to the Singapore Air Show, and a tour of the state-of-the-art facilities at the Jean-Luc Lagardère Final Assembly Line (FAL), a facility of Airbus, France’s leading aerospace company. Entry to one of Egypt’s ancient pyramids among more traditional itinerary items. iStock More traditional sightseeing activities include entry into one of Egypt’s ancient pyramids and an after-hours tour of the Vatican Museums, while cricket fans will meet and chat with a member of Sri Lanka’s 1996 World Cup-winning cricket team. The ambitious one-off itinerary has been a long-term project for the Captain’s Choice chief executive. “We first started talking about this at the end of 2017, with the intention to travel in 2020,” Bosschieter told guests at a pre-flight dinner at the Sydney Opera House on Tuesday night. A pre-launch performance of “I Still Call Australia home” by the Australian Girls’ Choir.\n\nAdvertisement\n\nWendy Miles, daughter of Qantas co-founder Sir Wilmot Hudson Fysh, recalls flying the route as a 17-year-old to Bas Bosschieter. Although a planned flyover by a Lockheed L-1049 Super Constellation aircraft was cancelled at the last minute due to airspace restrictions, guests enjoyed a performance by the Australian Girls’ Choir (inevitably the set list featured I Still Call Australia Home) and an interview with Wendy Miles (nee Fysh), the daughter of Qantas co-founder Sir Wilmot Hudson Fysh. Related Article Air travel The most unusual planes airlines are still flying Miles recalled travelling the Kangaroo Route in 1947 as a 17-year-old girl. “It was the first flight I went on and everybody was dressed up. All the women were in hats and gloves and all the men were in suits.” Today’s passengers may not quite meet those sartorial standards but they are guaranteed attentive service with 12 Qantas staff on board including captains, cabin crew, an engineer, and catering staff. The dining experience is also elevated, with all passengers enjoying business-class menus. On the Sydney to Darwin leg, the choice of mains included croque monsieur, gruyere and mushroom quiche and a lamb and rosemary pie with mushy peas and crispy potatoes. The writer is travelling as a guest of Captain’s Choice.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/why-is-one-nation-suddenly-so-popular-20260204-p5nzj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why is One Nation suddenly so popular?",
    "publish_date": "Wed, 04 Feb 2026 13:03:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Why is One Nation suddenly so popular?\n\nWhat's the deal with One Nation and why is it suddenly so popular? Nine.com.au explains the rise of Pauline Hanson.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-afterglow-20260203-p5nz5c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you’re after a Heated Rivalry fix in the flesh, look no further",
    "publish_date": "Wed, 04 Feb 2026 13:01:46 +1100",
    "category": "sports",
    "authors": [
      "Cameron Woodhead",
      "Andrew Fuhrmann"
    ],
    "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews If you’re after a Heated Rivalry fix in the flesh, look no further Cameron Woodhead and and Andrew Fuhrmann Updated February 4, 2026 — 1:01pm ,first published February 3, 2026 — 3:37pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points THEATRE: Tastefully erotic, Afterglow at Chapel Off Chapel explores polyamory\n\nDANCE: Songs of the Bulbul draws inspiration from the Sufi myth of the caged nightingale\n\nTHEATRE\n\nMIDSUMMA | Afterglow ★★★★\n\nChapel Off Chapel, until February 21 Gay sex has a pop-cultural currency that would have been unimaginable a decade ago. Think of all those comments about Heated Rivalry clogging up your feed. It can’t be only gay and bisexual men who were aroused by raunchy encounters between closeted hockey players in the show, or it wouldn’t have been such a huge phenomenon. In fact, women consume almost half of all gay male porn on Porn Hub, and as we enter an age of increasing heteropessimism, it seems homoeroticism has become flavour of the month. Matthew Mitcham (left) and Matthew Predny in a scene from Afterglow. Cameron Grant That’s good news for S. Asher Gelman’s Afterglow. The play bears the tagline “the climax is just the beginning”, and true to its word, starts in flagrante, with a gay male threesome nuzzling and pashing each other, post-coitally entwined. If you’re jonesing for a Heated Rivalry fix in the flesh, look no further. The show comes fully stocked in the eye candy department, with liberal displays of full-frontal male nudity (the most I have seen onstage since Puppetry of the Penis).\n\nAdvertisement\n\nAll three actors are intimidatingly hot and ripped. Gym-toned physiques. Washboard abs. Bubble butts. And the characters are unabashedly sexual, with tastefully choreographed erotica underpinning Gelman’s relationship drama. Scientist Alex (Julian Curtis) and his theatre director husband, Josh (Matthew Mitcham – yes, the Olympic gold medallist), are a Manhattan gay couple in an open marriage. Afterglow is non-judgmental about the various forms contemporary relationships may take. Cameron Grant They seem to have it all. They’re handsome, successful and loaded – and they have a commitment to starting a family together, expecting their first child via surrogacy in a few months. Their equilibrium is fractured when Josh desires something more than a casual fling with their latest playmate, Darius (Matthew Predny), a younger massage therapist.\n\nAdvertisement\n\nAlex consents to his partner’s new “friend with benefits” arrangement, with a veto if it starts to make him feel threatened or uncomfortable. Josh fails to inform his husband of a crucial detail, while seeking to avoid confronting marital difficulties or disappointments in his newfound passion for Darius. Darius genuinely falls for Josh and is torn between desire for what he cannot have and appal that the love triangle he’s entered is causing unintended distress. Related Article Lunch with ‘Nourishes my soul’: The side gig Matthew Mitcham swears by The set is modular genius that’d put IKEA designers to shame (and allows for steamy shower scenes). And the performances are strong and likeable, lending a charismatic gloss to the unfolding melodrama, even if the underlying emotional dynamics aren’t always fully and precisely articulated. As an examination of modern polyamory, the play is a touch predictable and superficial for my taste. Yet it does have the advantage of being broadly relatable – whether you’re gay or straight or something in between – and remains non-judgmental about the various forms contemporary relationships may take. If there’s a message, it’s that you can get hurt no matter what kind of romance your heart leads you to pursue. You’ll be forgiven if you get distracted from it, though, by the sensuality of the sex scenes and the way Afterglow plugs so directly into the homoerotic zeitgeist.\n\nReviewed by Cameron Woodhead\n\nAdvertisement\n\nDANCE\n\nSongs of the Bulbul ★★★\n\nPlayhouse, Arts Centre Melbourne, until February 7 The UK-based Aakash Odedra is a superb dancer. His emotional intensity and poetical abundance feel almost radical in the world of contemporary concert dance. He’s a proper phenomenon and still very much in the prime of his career. Aakash Odedra performs in Songs of the Bulbul Angela Grabowska For Songs of the Bulbul he has teamed up with choreographer Rani Khanam to make an hour-long solo from the Sufi myth of the caged nightingale or bulbul. The more the bird suffers, goes the story, the more beautiful its song. The result is a tour de force: a moody, mettled drama that slips between plain statement and lyric suggestion. It is yearning and inward but with plenty of athletic excitement in the combination of rapid Kathak footwork and the loosened spinning of the Sufi dervishes.\n\nAdvertisement\n\nIn the beginning, Odedra ranges freely across the stage, buoyant and smiling, skirts flaring into blurred halos, bare feet snapping lightly at the floor. Birdlike figurations, with quicksilver movements of head and hand, connect cleanly with happy leaps and turns. Related Article Melbourne live reviews This is about the best version of Pirates of Penzance you could see The pathways of movement become narrower as the cage descends. The bird strains against captivity, projecting anguish: arms reach upward, palms open, sometimes pleading, sometimes offering. The light begins to dwindle and flicker as Odedra collapses, clutching at the red confetti that swirls around him. The soundtrack, by composer Rushil Ranjan, is epic: thunderous percussion, tinkling music-box phrases, blanketing strings and soaring arias. Select UK performances reportedly featured a full live arrangement. One can only imagine the immersive force of such an event. Here, pre-recorded, the intensity is still formidable. Indeed, sometimes, with the strings building and building and building, it all becomes too much, too busy, too alarming.\n\nAdvertisement\n\nAt the show’s climax the bird has its eyes removed. This moment is staged with clarity and admirable restraint. It’s the quietest passage, wisely, and therefore the most concentrated. The tragedy lands with the barest ornament, its awful resonance unimpeded. Coming down from that is hard. The closing scenes, for me, fall into something a little too gimmicky: standing before a bank of electric candles, Odedra gestures here and there, lighting the lights and dousing them as if by the magic of the suffering he has just passed through. Still, in Melbourne right now there are few chances to see an international touring dance artist at all, let alone one of this calibre, moving across traditions with such total imaginative surrender and generosity of feeling.\n\nReviewed by Andrew Fuhrmann The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-fall-as-wall-street-scuffles-gold-silver-rebound-20260204-p5nzcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher as miners surge; tech shares slump",
    "publish_date": "Wed, 04 Feb 2026 12:42:27 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX edges higher as miners surge; tech shares slump Staff reporter Updated February 4, 2026 — 12:42pm ,first published February 4, 2026 — 5:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket had climbed into positive territory by lunchtime with mining stocks sharply higher, but technology stocks are weighing on the bourse. After opening lower, the S&P/ASX 200 was 17.1 points, or 0.2 per cent higher, at 8874.2 points in early afternoon trade, with eight of 11 industry sectors in the red. Wall Street is in reverse on Tuesday. AP Mining stocks are sharply higher, with gold and silver rebounding overnight to continue their wild swings in recent days. Among gold miners, Northern Star soared 6.2 per cent and Evolution Mining climbed 2.3 per cent, while silver giant South32 rose 3.6 per cent. A jump in copper prices boosted the iron ore heavyweights, with BHP bouncing 3.8 per cent, Rio Tinto surging 3.6 per cent and Fortescue 1.3 per cent higher. Financial stocks have trimmed some of their early losses, with Commonwealth Bank dipping 0.1 per cent in early afternoon trade, while Westpac has shed 1 per cent and ANZ Bank was 0.9 per cent lower. National Australia Bank has climbed into the green to be 0.2 per cent higher. All four banks have said they will pass on the Reserve Bank’s interest rate rise in full, the first hike in more than two years.\n\nAdvertisement\n\nRelated Article Opinion\n\nCurrencies Trump’s vulnerable America is a target for China Stephen Bartholomeusz Senior business columnist Local technology shares slumped after heavy falls on Wall Street’s Nasdaq overnight, with Xero diving 12.2 per cent, WiseTech tumbling 8.6 per cent and TechnologyOne diving 8.1 per cent. Energy stocks advanced as oil prices strengthened. Woodside Energy added 2.1 per cent, Santos jumped 2.5 per cent and Yancoal was 3.1 per cent higher in early afternoon trade. The Australian dollar was trading at at US70.28¢ at 12.38pm AEDT. Overnight, the S&P 500 fell 0.8 per cent and pulled further from its all-time high set last week. The Dow Jones dipped 166 points, or 0.3 per cent, and the Nasdaq composite sank 1.4 per cent.\n\nAdvertisement\n\nSeveral influential Big Tech stocks weighed on the market, including drops of 2.8 per cent for Nvidia and 2.9 per cent for Microsoft. Such giants have been hampered by worries that their stock prices shot too high and became too expensive following their years-long dominance of the market. Stocks of software companies and others seen as potential losers to competitors powered by artificial intelligence also slumped. ServiceNow fell 7 per cent to bring its loss for the young year so far to 28.3 per cent. Such declines dragged the S&P 500 to its fourth loss in the last five days, even though the majority of stocks in the index rose. That included a 6.8 per cent climb for Palantir Technologies, which reported a bigger profit for the latest quarter than analysts expected. Its forecast for 61 per cent growth in revenue this year also topped analysts’ expectations. Some of the day’s strongest action remained in the metals markets. Gold’s price climbed 6.1 per cent to settle at $US4935.00 per ounce in the latest swing since its jaw-dropping rally suddenly halted last week. Silver’s price, which has been whipping through even wilder moves, rallied 8.2 per cent. Gold and silver prices had been climbing for more than a year as investors looked for safer places to park their cash amid worries about everything from tariffs to a weaker US dollar to heavy debt loads for governments worldwide. Their prices took off in particular last month, and gold’s price at one point had roughly doubled over 12 months.\n\nAdvertisement\n\nBut those rallies suddenly gave out last week, and gold’s price dropped from close to $US5600 to less than $US4500 on Monday. Silver plunged 31.4 per cent on Friday alone. Many traders say that what turned the momentum was expectations that President Donald Trump’s nominee to lead the Federal Reserve will keep interest rates high to fight inflation, though some disagree. Most agree that simple gravity took over afterward. After gold and silver prices had shot up so much, so quickly, they were bound to fall back at some point, particularly with so many investors piling in to gold as a way to bet on continued weakness for the US dollar. “The move underscored how stretched anti-USD positioning had become,” according to strategists at Barclays. On Wall Street, PayPal dropped 20.3 per cent after reporting weaker results for the latest quarter than analysts expected. It also named a new CEO after it said “the pace of change and execution” over the last two years “was not in line” with the board of directors’ expectations.\n\nAdvertisement\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/companies/strickland-discovery-fires-up-a-55m-growth-push-in-serbia-20260204-p5nzi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Strickland discovery fires up a $55m growth push in Serbia",
    "publish_date": "Wed, 04 Feb 2026 12:28:14 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Strickland discovery fires up a $55m growth push in Serbia Brought to you by BULLS N’ BEARS Rowena Duckworth February 4, 2026 — 12:28pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStrickland Metals has lit up its Serbian Rogozna project with a fresh high-grade gold-copper discovery, immediately loading the war chest with a $55 million capital raise to accelerate drilling and development studies. The one-two punch signals a clear shift from discovery mode to development intent, with drilling success now matched by the funding firepower to accelerate growth. Core from Strickland Metals’ Red Creek discovery at Rogozna in Serbia showing massive chalcopyrite mineralisation in contact with carbonate. The discovery was made at the Red Creek prospect, about 1km west of the company’s 5.3-million-ounce gold equivalent Shanac deposit. Initial drilling has intersected both shallow epithermal gold mineralisation and deeper skarn-hosted gold and base metals zones - a geological mix that mirrors other major deposits across the Rogozna system. The standout discovery hole delivered numerous zones of mineralisation, including a solid 4.0 metres running at an impressive 4.0 grams per tonne (g/t) gold equivalent from 44.0m and a deeper interval of 53.0m at 2.3g/t gold equivalent from 514.4m.\n\nAdvertisement\n\nWithin that deeper 53m zone, the drill bit threw up a 35-metre wide, higher-grade core, running 3.1g/t gold equivalent, including a thick 4.4-metre slice at a stellar 8.9g/t gold equivalent at 522.0m, followed by another hefty 5.8-metre interval grading 4.5g/t gold equivalent from 536.7m. Importantly, Red Creek sits on the same structure that hosts the Copper Canyon deposit, about 1.5km along strike, opening up a new corridor of exploration ground between Copper Canyon and Shanac that has seen little drilling to date. Mineralisation at Red Creek remains open along strike and at depth, with assays pending from several additional holes. Strickland managing director Paul L’Herpiniere said: “Our world-class team in Serbia have done it again, with exploration drilling at Red Creek, just 1km from our cornerstone Shanac Deposit, delivering a new high-grade discovery. This is an exciting development which reinforces the highly endowed nature of the mineral system at Rogozna and offers an exciting new focal point for resource growth.” Hot on the heels of the discovery, Strickland moved to lock in funding, announcing a $55m institutional placement priced at 16 cents per share. The raise will fund an additional 70,000m of drilling across Rogozna in 2026 and support delivery of a pre-feasibility study targeted for the first half of 2027. Backing the story is some heavyweight support. Global mining major Zijin Mining Group has committed $5m to the placement, lifting its stake in Strickland to four per cent. The endorsement from one of the world’s largest copper and gold producers adds serious credibility to Rogozna’s development pathway and underlines the project’s strategic appeal as drilling success continues to stack up.\n\nAdvertisement\n\nStrickland’s $55 million funding package will bankroll one of the most aggressive exploration campaigns ever mounted in the Balkans, with a massive 70,000m drilling program planned across Rogozna through this year. The drilling will serve the dual purpose of tightening up and upgrading resources at Shanac, Gradina and Copper Canyon, while simultaneously chasing growth at the new Red Creek discovery and testing fresh targets across the broader system. Crucially, the scale and structure of the program are designed to fast-track Rogozna towards development, feeding directly into an internal scoping study in the first half of this year and a full pre-feasibility study targeted for the first half of 2027. This will deliver Strickland’s first detailed economic picture of Rogozna, including costs, production profiles and project returns - the kind of milestone that typically unlocks institutional backing and strategic interest, provided the geology stacks up. With gold running hot, copper tightening and a $55m war chest locked in, Strickland now has both the discoveries and the firepower to push Rogozna hard. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/hector-s-deli-opens-a-second-little-collins-street-store-in-the-former-le-shoppe-site-20260204-p5nzh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hector’s Deli opens a second Little Collins Street store in the former Le Shoppe site",
    "publish_date": "Wed, 04 Feb 2026 12:08:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe sleek new outpost is at the other end of the CBD eat street.\n\n1 / 7 Hector’s Deli’s sleek new site on Little Collins Street. Supplied 2 / 7 Classics like the rare beef sandwich are still on the menu.. Cheyne Toomey 3 / 7 Located in Scott Pickett’s former Le Shoppe site. Supplied 4 / 7 Chicken salad sandwich. Hctor's Deli supplied Cheyne Toomey 5 / 7 Inside the new shop. Supplied 6 / 7 The sausage muffin at Hector’s Deli gives Macca’s a run for its money. Supplied 7 / 7 Some seating is available inside. Supplied Previous Slide Next Slide\n\nContemporary$$$$\n\nNearly two years after arriving at the Paris end of the CBD, sandwich supremo Hector’s has opened yet another outpost on Little Collins Street. Located between Queen and William Streets in Scott Pickett’s former Le Shoppe site, the sleek new location is serving all of Hector’s signatures plus seasonal specials. Join the queue to take away or nab one of the few stools inside.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/unions-leads-push-for-tradies-to-stop-work-in-extreme-heat-20260204-p5nzhn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unions leads push for tradies to stop work in extreme heat",
    "publish_date": "Wed, 04 Feb 2026 12:06:40 +1100",
    "category": "finance",
    "authors": [],
    "text": "Unions leads push for tradies to stop work in extreme heat\n\nA peak union body is pushing for a new national safety standard to allow tradies and other workers to automatically stop work when it gets too hot.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/e-bikes-swarm-sydney-harbour-bridge-in-wild-footage-20260204-p5nzgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "E-bikes swarm Sydney Harbour Bridge in wild footage",
    "publish_date": "Wed, 04 Feb 2026 12:06:35 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/defence-offloading-islands-golf-courses-barracks-to-be-sold-raising-2-billion-20260204-p5nzdv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Defence to sell islands, golf courses and barracks, raising $2 billion",
    "publish_date": "Wed, 04 Feb 2026 11:59:59 +1100",
    "category": "finance",
    "authors": [
      "Matthew Knott"
    ],
    "text": "Advertisement\n\nUpdated PoliticsFederalDefence Defence to sell islands, golf courses and barracks, raising $2 billion Matthew Knott Updated February 4, 2026 — 11:59am ,first published February 4, 2026 — 10:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA dramatic sale of 35,000 hectares of defence real estate – including some of the nation’s most historic barracks – is expected to raise almost $2 billion to be ploughed back into new military equipment and upgrades to essential bases. Islands, golf courses, rifle ranges, office buildings and training depots across the country will be sold under the Albanese government’s long-awaited response to a sweeping audit of the nation’s defence estate portfolio. Defence Minister Richard Marles and Assistant Defence Minister Peter Khalil announce the major sale of Defence property. Dominic Lorrimer The government has decided to stare down opposition to sell-offs from the military establishment, which has jealously guarded its access to prized sites. The release of the government’s response to the audit has been delayed by over two years as it braces for blowback from veterans and local communities to the sale of some of the country’s most iconic defence facilities.\n\nAdvertisement\n\nThis masthead revealed on Wednesday that the Victoria Barracks sites in Sydney, Melbourne and Brisbane will be sold, opening up the possibility of housing developments in inner-city areas. Defence Minister Richard Marles said the government was undertaking the “most significant reform to Australia’s defence estate in our nation’s history”. “The heritage value of these properties does not belong to the Australian Army or, for that matter, the Australian Defence Force. It belongs to the Australian people,” Marles said. “And right now, the Australian people are prevented from seeing these properties, they exist behind a defence wall.” Acknowledging the long delay between receiving the audit and releasing a response, Marles said: “It has taken time because it has been difficult. This is a challenging issue.”\n\nAdvertisement\n\nRelated Article Exclusive\n\nDefence Historic buildings, prime real estate: Defence ready to sell off Victoria Barracks in Sydney, Melbourne and Brisbane Sixty-seven defence sites will be fully or partially sold – including the birthplace of the Royal Australian Air Force in Victoria and the army’s headquarters in Sydney – by the Department of Finance, with an estimated sale price of $3 billion. Relocating staff and remediation works ahead of sale could cost as much as $1.2 billion, meaning net proceeds of up to $1.8 billion are expected from the divestments. The government also expects to save $100 million a year by reducing maintenance costs. All the money raised from the sales, which are expected to take years to complete, will be reinvested into defence. Asked about the scope to expand the supply of housing by selling defence sites, Marles said: “I expect that housing will be part of the opportunity that is created here, but I want to be really clear: that’s not why we’re doing this.\n\nAdvertisement\n\n“This is around making sure we have a defence estate which is properly attuned to the capabilities of the Australian Defence Force, and that we are not wasting money on property which gives no capability benefit.” Finance Minister Katy Gallagher said the asset sales would be decided on a case-by-case basis. “I mean, there are some prime locations. I imagine there will be a lot of interest and a lot of views about what it can be used for,” she said. “I’m hopeful some of that would be for housing, but it really is to be determined, and no decisions have been made.” Assistant Defence Minister Peter Khalil said he was shocked to recently visit a vacant training depot in Penrith, in western Sydney, which had cost $1 million over six years to maintain but was strewn with rubbish and covered in graffiti.\n\nAdvertisement\n\nMeanwhile, he said, some salubrious facilities “have grass tennis courts that rival Wimbledon, manicured lawns, sprawling golf courses, but they are also not meeting the operational and capability requirements for our ADF”. The audit, conducted by former Defence Housing Australia managing director Jan Mason and Infrastructure Victoria chair Jim Miller, found the defence estate is riddled with waste and that tough decisions are required to ensure taxpayer money is being spent wisely. “It is very clear and widely acknowledged that Defence does not need and cannot afford all of the current estate,” Mason and Miller wrote in their audit report, delivered to the government in December 2023. “Underutilised portions of the Defence estate are draining resources from higher priority needs. Sustainment budgets as they relate to this part of the estate are stretched too thinly, resulting in critical failures and costly unscheduled repairs.” The auditors acknowledged that their recommendations “are likely to evoke strong emotions associated with its history, scale and diversity”.\n\nAdvertisement\n\nA government source, speaking on condition of anonymity to discuss sensitive matters, said taxpayers had been “pissing money up against a wall and it needs to stop”. In NSW, the sites to be sold include: Victoria Barracks, Paddington\n\nLancer Barracks, Parramatta\n\nHMAS Penguin (partial sale)\n\nRandwick Barracks (partial sale)\n\nRAAF Glenbrook\n\nSpectacle Island\n\nAdvertisement\n\nIn Victoria, the sites include: Latchford Barracks\n\nNewland Barracks\n\nRAAF Williams, Point Cook\n\nRAAF Williams, Laverton (partial)\n\nDefence site Maribyrnong\n\nVictoria Barracks In Queensland, the sites include: St Lucia Training Depot\n\nMount Isa Rifle Range\n\nVictoria Barracks\n\nAdvertisement\n\nIn Western Australia, the sites include: Irwin Barracks\n\nLeeuwin Barracks More to come. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/business/workplace/the-end-of-the-executive-assistant-corporate-australia-shifts-job-to-the-philippines-20260204-p5nzdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The end of the executive assistant? Corporate giant shifts roles to the Philippines",
    "publish_date": "Wed, 04 Feb 2026 11:59:14 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Advertisement\n\nBusinessWorkplaceWorkplace The end of the executive assistant? Corporate giant shifts roles to the Philippines Millie Muroi February 4, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nExecutive assistants will all but disappear from the offices of one of Australia’s largest consultancy firms to be replaced by remote workers dialling in from the Philippines as the firm cuts costs. Once widespread throughout white-collar workforces in the mid-20th century, only the most senior staff at KPMG will retain Australian-based executive assistants after the planned transition, representing about a fifth of the number it once employed here. Executive assistant jobs have been cut in Australia and sent offshore by KPMG. Eamon Gallagher Under the proposal leaked to corporate gossip Instagram page The Aussie Corporate, there would be a phased approach, with 100 roles shunted from Australia to the Philippines in April and a further 100 across May and June.\n\nAdvertisement\n\nThe cost-cutting measure, also aimed at improving consistency of service across the business, comes as demand for consulting services has dropped off among the big-four consulting firms. In the year to June 2025, KPMG reported revenue of $2.3 billion: slightly lower than the previous year, while remuneration for its partners grew 10.3 per cent. Nicole Gorton, executive recruitment director at recruitment agency Robert Half, said offshoring can be successful in some cases where work is highly repetitive. “Where it’s very administrative task heavy, such as triaging emails or formatting documents and entering data, that’s when we’re seeing [these jobs] be offshored,” she said. “That’s where organisations see that they can have cost benefit by offshoring.” However, Gorton said it is more difficult for organisations where the assistant is involved in strategy, execution, decision-making and stakeholder engagement. “These responsibilities require deep knowledge of the business and local stakeholder understanding,” she said. “The EA role has evolved to being a strategic partner who often has input in conversations and decisions. Proximity matters in these cases, and EAs are often the glue to the business.”\n\nAdvertisement\n\nGorton said offshoring tends to be cyclical, but that she has seen an increasing number of jobs being outsourced over the past decade. “A company might do an offshoring project that will be sustainable for a period of time, and then the people in the weeds of managing the offshoring relationships have challenges,” Gorton said. “But most definitely, offshoring has been happening at a larger scale.” Job ad data from employment marketplace Seek shows personal assistant, executive assistant and secretarial roles have been declining steadily for the past few years. As of December, these roles declined 18 per cent over the year, while wider administration and office support industry roles fell 7 per cent over the same time period and job ads more widely dropped 4 per cent. KPMG Australia last year conducted its own analysis of the fastest growing jobs and those “going extinct”, noting some occupational groups had seen sharp declines in workers.\n\nAdvertisement\n\n“The number of executive assistants fell by more than 20 per cent to 82,300 over the past decade due to the automation of administrative functions through smartphones and apps,” it said. While roughly 65 of KPMG’s EA roles would remain in Australia, the scope of services covered by every role will change with updated position descriptions. Related Article Unfair dismissal Employee sacked for failing to return to office despite contract allowing WFH The final decision on KPMG’s proposal, which is subject to consultation with impacted employees, will take place in early- to mid-March, with the firm looking to redeploy as many people as possible to other roles within the business. A spokeswoman for KMPG said consultation with its people was ongoing as the firm moved away from the practice of doing everything in-house.\n\nAdvertisement\n\n“We are continually evolving the way we work to build a scalable, modern, resilient business that positions us for growth and competitiveness,” she said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/technology/why-elon-musk-just-created-a-1-8-trillion-space-monster-20260204-p5nzdj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Elon Musk just created a $1.8 trillion space monster",
    "publish_date": "Wed, 04 Feb 2026 11:58:55 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Advertisement\n\nTechnologyMergers & acquisitions Opinion Why Elon Musk just created a $1.8 trillion space monster Stephen Bartholomeusz Senior business columnist February 4, 2026 — 11:58am\n\nFebruary 4, 2026 — 11:58am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLast year, Elon Musk’s xAI artificial intelligence start-up bailed out investors in X, his social media platform. Then Musk’s Tesla pumped $US2 billion ($2.85 billion) into xAI, which was burning more than $US1 billion of cash a month. Now he’s caused SpaceX to merge with xAI in a deal valuing the combined businesses at $US1.25 trillion ($1.8 trillion). See the pattern? As one of the companies he controls needs cash, he turns to another that has it. When that proves insufficient, he has looked to one of the two most valuable companies within his orbit – one without the approvals and governance complexities of Tesla – to bail them out. Elon Musk is known for his outlandish plans. AP There was speculation that it would be Tesla that would acquire xAI but, while Tesla has about $US44 billion of cash in its balance sheet, the switch of focus from producing electric vehicles to robotaxis and robots that Musk revealed last month and the cashflow-negative impact of the $US20 billion investment that entails probably ruled it out, at least this time. SpaceX planned a float this year, with a mooted valuation of about $US800 billion, which would raise about $US50 billion of cash from new investors. Some of that cash will now be available to xAI.\n\nAdvertisement\n\nThe merged group’s valuation of $US1.2 trillion represents a big lift from the most recent valuations of its components as, just over a year ago, the merged xAI and X was deemed to have an equity value of about $US113 billion and a $US20 billion capital raising last month was struck at a valuation of $US230 billion. Related Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist For the purposes of the merger, xAI is now valued at $US250 billion, while SpaceX’s value has jumped to $US1 trillion and there’s talk of the IPO producing a $US1.5 trillion valuation. The numbers, and their escalation, are mind-blowing, but so are artificial intelligence’s appetite for capital and Musk’s visions. xAI is one of the minnows competing with giants in the hugely capital-intensive race to stake out a position in AI.\n\nAdvertisement\n\nWhere giants like Google, Amazon, Meta and Microsoft have torrents of cashflow from their legacy businesses to fund the hundreds of billions of dollars they are ploughing into AI – and even they are now having to raise external debt because of the scale of the spending on training large language models and building data centres – start-ups like xAI, OpenAI and Anthropic are reliant on seemingly endless rounds of equity raisings (and, increasingly, debt issues) at ever-greater valuations. The sector’s insatiable appetite for capital has outstripped the capacity or willingness of equity markets to supply it, hence the increasing levels of debt in the sector and the incestuous deals between its participants. Musk himself said the rationale for the merger was that, within two or three years, the least expensive way to do AI computations would be in space. AP On some estimates, the four or five heavyweight players in the sector will spend about $US500 billion over the next three years. It wouldn’t surprise if it were significantly more. This is an extraordinary period of highly focused and extraordinarily capital-intensive industry development. At some point, perhaps quite soon, there’ll be either a consolidation of the sector or a wipeout of its weaker players.\n\nAdvertisement\n\nA puncturing of the ever-inflating, and arguably already highly inflated, valuations would force rationalisation (and cause a lot of pain for the companies and their investors and lenders) if the equity spigot were turned off. Related Article Analysis\n\nAI ‘Absolute nightmare’: The social network where AI chatbots exchange ideas and gossip about humans With the enlarged SpaceX not the only big AI-tinged float planned for this year – OpenAI and Anthropic have theirs on drawing boards – the market’s willingness to continue to support financial models that involve massive outlays today for uncertain returns in three, four or five years’ time will be stress-tested. That’s why, as was the case when xAI was used to bailout investors in X (who were badly underwater on their investments), Musk has turned to SpaceX and its ability to raise a very big lump of cash – at $US50 billion, an IPO equity raising would be the biggest in history, dwarfing the $US29 billion raised by Saudi Aramco in 2019 – just to keep xAI in the game. The industrial logic for combining Space X with xAI is thin.\n\nAdvertisement\n\nThere are not many synergies between launching rockets and operating a network of satellites, an AI start-up that lags its competitors and a controversial social media platform where the interest on its debt absorbs roughly half its revenues. xAI’s Grok chatbot doesn’t have the users or financial backers (almost the entire AI sector) that OpenAI’s ChatGPT has, nor the distribution platform of Google’s Gemini or the corporate acceptance of a rival start-up, Anthropic (which moved markets with the release of new AI productivity tools on Tuesday). xAI is getting a helping hand. Bloomberg SpaceX said it was acquiring xAI to “form the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile communications and the world’s foremost real-time information and free speech platform.” Musk himself said the rationale for the merger was that, within two or three years, the least expensive way to do AI computations would be in space.\n\nAdvertisement\n\nHe envisages putting AI data centres into space on SpaceX’s rockets and said there would be cost efficiencies that would enable innovative companies to train their models and process data at unprecedented speeds and scales. “This marks not just the next chapter but the next book in SpaceX and xAI’s mission: scaling to make a sentient sun to understand the universe and extend the light of consciousness to the stars,” he said, whatever that means. Maybe the future of AI and the data centres needed to support it lies in space, but Musk seems to have skated over the logistics and costs of building something in space that is already stretching, to their limits, AI companies on Earth. The sector’s insatiable appetite for capital has outstripped the capacity or willingness of equity markets to supply it, hence the increasing levels of debt in the sector and the incestuous deals between its participants. There is some financial logic to the combination, given that SpaceX is cashflow positive – it appears to have generated more than $US2 billion of positive cashflow last year and is on a steeply rising curve – while xAI churned through $US9.5 billion in the first nine months of last year at an annualised rate of more than $US12.5 billion.\n\nAdvertisement\n\nIt appears obvious, however, that the capital SpaceX raises in its IPO will be quickly devoured by xAI unless the industry trend of capital expenditures rising at a much greater rate than revenues can be reversed. Related Article Opinion\n\nBillionaires Why Australian billionaires are falling behind their uber rich peers Elizabeth Knight Business columnist Musk does, of course, still have Tesla, valued by the market at more than $US1.5 trillion, that he could merge into a Musk Inc conglomerate if he needs more cash (and if its change in strategy from EVs to robotaxis and robots produces cashflows and earnings to validate the valuation). On his track record, such a merger appears quite a likely eventuality, particularly if xAI’s demands for cash outstrip SpaceX’s ability to generate it. Musk’s “vision” for SpaceX appears fanciful. He has, however, demonstrated a remarkable capacity to convince investors to capitalise his visions.\n\nAdvertisement\n\nData centres in space, transported by SpaceX rockets, fed by xAI’s models that have trained on X’s data, perhaps with some future input from Tesla’s engineers and with roles for its robots? It all sounds fantastical but, if he gets a $US1.5 trillion valuation for SpaceX in its float, it would signal that there are plenty of investors who think his vision can be realised. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/lifestyle/influencer-faces-backlash-after-freeze-drying-late-dog-20260204-p5nzh8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Influencer faces backlash after freeze-drying late dog",
    "publish_date": "Wed, 04 Feb 2026 11:51:18 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/how-what-you-eat-affects-your-cancer-risk-20260203-p5nz65.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How what you eat affects your cancer risk",
    "publish_date": "Wed, 04 Feb 2026 11:45:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Nina Agrawal"
    ],
    "text": "Advertisement\n\nLifestyleHealth & wellnessCancer How what you eat affects your cancer risk Nina Agrawal February 4, 2026 — 11:45am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOver decades, a growing body of literature has shown clear links between what we eat and how likely we are to develop various cancers. In recent years, the research has moved away from the impact of individual “superfoods” and antioxidants to focus on how overall, long-term dietary habits affect risk. That’s not to say that any individual cancer diagnosis can be blamed on someone’s diet; cancer, after all, arises as a result of a large constellation of factors – and it occurs in people who make healthy choices. Decades of research suggests that your diet can influence the risk of various cancers. Getty Images/iStockphoto But on a population level, there are some trends in the data. Here’s what we know. Prioritise plants\n\nAdvertisement\n\nEating patterns that emphasise whole grains, fresh fruits and vegetables, and lean or plant-based proteins have shown the most consistent association with a lower risk of cardiovascular disease, diabetes and cancer. One reason may be that people who follow these eating patterns have lower levels of insulin and inflammation, said Fred Tabung, who studies diet, metabolism and cancer at the Ohio State University College of Medicine and Comprehensive Cancer Centre. Related Article Health This little organ is rarely thought about – and it’s costing lives Chronically high levels of insulin and inflammation are key features of obesity and metabolic syndrome, which mediate cancer risk. High insulin and inflammation also promote unnecessary cell division, cell growth, DNA damage and the inhibition of cell death, which are all hallmarks of cancer, Tabung said. Whole grains, fresh fruits and vegetables, and legumes and nuts contain lots of dietary fibre, which has been associated with lower cancer risk. This may be because fibre helps speed stool along the digestive tract, limiting exposure to carcinogens, and because it feeds microbes in the gut that help protect against inflammation, said Dr Kimmie Ng, associate chief of the division of gastrointestinal oncology at Dana-Farber Cancer Institute in Boston. Tabung added that leafy, green vegetables like lettuce, kale, spinach and arugula, and dark yellow vegetables like carrots, yams and squash, when part of a broader dietary pattern, appeared to promote lower levels of insulin and inflammation.\n\nAdvertisement\n\nChoose your meat carefully The International Agency for Research on Cancer has labelled processed meat like bacon, salami and hot dogs as carcinogenic to humans. The agency has said red meat is “probably carcinogenic” due to limited but strong evidence. Research has shown that the type of iron in red meat, as well as the chemicals formed when red meat is cooked at high temperatures, for example during grilling and smoking, produce compounds involved in DNA damage. Nitrates and nitrites in processed meats have also been strongly associated with cancer. Nutrition and cancer researchers recommend avoiding processed meats altogether, and limiting red meat to two to three servings per week. If you are going to grill, use an acidic marinade, like one that’s citrus- or vinegar-based, as that can help reduce the amount of carcinogens formed, said Carrie Daniel-MacDougall, a professor of epidemiology at The University of Texas MD Anderson Cancer Centre. Or instead eat fish, which may independently lower cancer risk, said Dr Andrew Chan, a gastroenterologist at Mass General Brigham. Limit ultra-processed foods There is increasing evidence linking ultra-processed foods, including sugar-sweetened beverages, to cancer. One reason might be that they tend to be high in sugar and calories, which can contribute to insulin resistance and obesity. But lab studies also suggest that chemicals in these foods alter the balance between “good” and “bad” gut microbes and damage the gut lining, promoting inflammation, Chan said.\n\nAdvertisement\n\nA recent study of a large French cohort showed that several common preservatives increased the risk of all cancer, and particularly breast and prostate cancer. About a third of the preservatives that subjects consumed came from ultra-processed foods, but they were also found in alcohol, dried or canned fruits, and packaged vegetables. Related Article Nutrition Can we call butter and beef tallow ‘healthy fats’? You can limit your intake of preservatives by buying whole, fresh or frozen produce and prepared foods made only with ingredients you might find in a household kitchen, said Mathilde Touvier, director of the nutritional epidemiology research team at the French National Institute for Health and Medical Research. Drink less, or not at all The risks of alcohol are greatest for heavy and binge drinkers, but even light drinking increases the risk of some cancers. “There’s no safe level for cancer risk,” said Giota Mitrou, executive director of research and policy for the American Institute for Cancer Research. “Less is better and avoiding is best,” she added.\n\nAdvertisement\n\nA recent study, for example, showed that consistent heavy alcohol intake and higher lifetime consumption (averaging 14 or more drinks per week) increased the risk of colorectal cancer; quitting appeared to lower the risk. Alcohol may cause cancer in a few ways, Mitrou said. The body breaks it down into acetaldehyde, which is toxic to cells. Alcohol increases levels of estrogen, which fuels some types of breast cancer. And it has been linked to oxidative stress — when the body produces too many unstable molecules that react with DNA – and may interfere with DNA repair. If you do drink, avoid doing so on an empty stomach. Drinking without food may result in a higher exposure to carcinogens, Ng said. Consider coffee, tea and dairy Tabung found that drinking up to three cups of coffee or tea per day was associated with lower levels of insulin resistance and inflammation. Coffee and tea are full of chemicals that help protect cells from damage, said Robin Ralston, a dietitian and nutritionist at The Ohio State University Comprehensive Cancer Centre. She encourages drinking them – whether hot or cold, brewed at home or drunk from a bottle – as long as there isn’t added sugar.\n\nAdvertisement\n\nDairy, and the calcium in it, appears to lower colorectal cancer risk. As part of a broader healthy diet, full-fat dairy – which was recently endorsed in new federal dietary guidelines – was also associated with reduced inflammation and insulin resistance in some studies. Ralston recommended fermented dairy like plain yoghurt, kefir and cheese because they can support gut health and have been associated with reduced inflammation in several studies. Related Article Fitness The goal posts for a longer, healthier life are closer than you think Know the risks of obesity The clearest link between diet and cancer is through obesity. A large body of evidence has linked obesity to more than a dozen cancers, including breast, colorectal, endometrial, gastric, kidney, liver and pancreatic cancers. Obesity, of course, is not just the product of diet, but also physical activity, genetics and other factors, said Edward Giovannucci, a professor of nutrition and epidemiology at the Harvard T.H. Chan School of Public Health. But to the extent that diet leads to excess body fat or body weight, that is likely “the biggest single impact of diet on cancer risk,” he said.\n\nAdvertisement\n\nFat tissue increases estrogen, which is a driver for some kinds of breast and endometrial cancer. Fat that accumulates in the abdomen, called visceral fat, promotes inflammation and insulin resistance, Giovannucci said. Exercise – at least 30 minutes of moderate-intensity activity most days of the week – can increase insulin sensitivity and reduce inflammation, in addition to helping with weight loss. Some early research has suggested that GLP-1 drugs may also reduce cancer risk, but evidence is limited. Maintaining a healthy body weight and exercising to promote good metabolic health are “a big part of the battle,” Giovannucci said – and not only to lower cancer risk. “It overlaps a lot with diabetes, cardiovascular risks and dementia,” he said. “I think they’re all tied together.” This article originally appeared in The New York Times.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Cancer\n\nFor subscribers\n\nDiet",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/article/cigarette-butts-most-littered-item-in-australia/1o7c3ktf0",
    "title": "Nearly nine billion a year: The 'particularly nasty' litter polluting Australia",
    "publish_date": "Wed, 4 Feb 2026 00:06:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "More cigarette butts ended up in Australian waterways, bushland, parks and streets than any other litter item last year.\n\nMaking up nearly one quarter of all litter collected by Clean Up Australia (CUA) volunteers for an annual survey, the pervasive source of waste unseated soft plastics as the most prevalent item tossed on the ground.\n\nChair of the environmental charity, Pip Kiernan, said many smokers did not realise the ends of their cigarettes were made of plastic.\n\n\"The cigarette butt is particularly nasty because it's made up of cellulose acetate, so a plastic that doesn't break down,\" she said.\n\n\"It breaks up and it sheds microfibres and it leaches toxins into the environment, often ending up in the stomach of birds.\"\n\nIn the 35 years CUA has been producing the litter report, cigarette butts have always been a problematic item, and among the top three littered items.\n\nA 2021 WWF Australia report found that of the nearly 18 billion cigarettes smoked each year, between 5.9 and 8.9 billion butts end up as litter.\n\nWhile smoking prevalence in Australia is either declining or stable, depending on the data source, 2025 Roy Morgan research suggests both illicit tobacco and vapes have become more widespread than in the past.\n\nVapes are still becoming a more prominent source of waste despite a ban on the import and selling of the disposable e-cigarettes since mid-2024.\n\nDespite the regulations, vapes are still in circulation and particularly hazardous when they land in the environment, because they contain batteries and harmful chemicals.\n\nLitter dominated by plastics\n\nPlastic continues to dwarf all other material types ending up as litter, making up more than 80 per cent of all counted items in the 2025 survey.\n\nConsumption of plastic is increasing, and about 250kg of it enters the environment as litter every minute, where it can be ingested by birds and marine life with potentially fatal results.\n\nPlastic also remains a problematic waste stream, with just 14 per cent recycled and recovered.\n\nThere was some policy progress in 2025, with a voluntary soft plastics program introduced and container deposit schemes finally in place in every state and territory.\n\nBut Kiernan said national packaging reform was \"absolutely overdue\" in Australia to enforce mandatory rules on brands to make them responsible for the packaging they create.\n\n\"We've tried the voluntary targets, they haven't worked,\" she said.\n\n\"The thing with voluntary targets is you get free riders. So some people do the right thing and pay more to do the right thing with their packaging, and others don't.\"\n\nThe federal environment department is weighing up options for packaging reform to put to the government.\n\n\"We'd love to hear some announcement from the environment minister on that,\" Kiernan said.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/left-out-how-hate-laws-leave-lgbtiq-workers-vulnerable/dcbwzf1ze",
    "title": "'Left out': How hate laws leave LGBTIQ+ workers vulnerable",
    "publish_date": "Tue, 3 Feb 2026 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT:\n\nSince leaving their last full-time job five years ago, Ezra says they've been afraid to enter another workplace.\n\nEzra is non-binary and says their last job was both uncomfortable and unsafe.\n\nFaced with frequent misgendering, they say work at the call centre already felt unwelcoming.\n\nThen one day, when Ezra wore a necklace to work, things got worse.\n\n\"I was, you know, answering calls, and I was on the call to a client at the time, I remember, and this guy, he, he wasn't from my department, but we were on the same floor, and he came up behind me, and he just pulled at my choker, and I was just like... I kind of just froze, and I was like: 'Did that really just happen?' \"\n\nAfter speaking to a co-worker and raising it with their manager, Ezra says it soon became clear that the harassment wasn't being taken seriously.\n\n\"I think I cried in the bathroom that day and when I got home as well. But she said she'd bring it up to his manager. Then it got taken to the big manager, and they spoke to him, but nothing really came of it. I didn't feel like I was well-supported or safe in the workplace. I had a lot of anxiety and was struggling with anxiety attacks due to that. They wanted me to come back into work. I was trying to ask if I can go to a different floor or, like, area to him or to be transferred to a different department, and they just refused it. They were like, 'No.' Um, and I ended up quitting. I mean, my mental health wasn't doing great anyway while working there, but I did end up leaving that job, and I haven't, I haven't worked full time since working at that bank.\"\n\nIt's been just over 50 years since South Australia became the first Australian state to decriminalise male homosexuality.\n\nIt's been almost a decade since Australians voted in favour of same-sex marriage laws.\n\nRepresented in politics, pop culture and even professional sport, it might seem like the push for greater LGBTIQ+ inclusion has done what it set out to do.\n\nBut that isn't the case.\n\nRecent data from Diversity Council Australia shows workplace discrimination against queer and gender diverse employees is increasing.\n\n\"It doesn't surprise me. We know that discrimination has always been a huge problem for our communities. It can destroy lives, and of course, it's terrible for employers as well, in terms of the impacts on staff wellbeing, workplace health and safety, and financial impact as well.\"\n\nHeather Corkhill is the Legal Director of Equality Australia.\n\nShe says a rise in hate speech in Australia more broadly is exacerbating the issue.\n\n\"One of the problems, of course, is that there is an increasing issue of escalating hate speech against our communities. And of course, workers are also people with lives outside of work too, and can be influenced by disinformation, negative media and social media about our communities too.\"\n\nIn a recent survey of 3,000 workers across Australia, the research found that almost half of LGBTIQ+ workers had experienced workplace discrimination and / or harassment in the past year.\n\nMarking a 24 per cent increase since the 2024 survey, the Diversity Council says the findings suggest not enough has been done to prevent this behaviour.\n\nCharlie Hamra is the President of Pride in Law South Australia.\n\nHe says while exclusion in the workplace can often be a result of othering and a lack of understanding, it can also be more overt.\n\n\"I'm aware of a situation where a trans lawyer has been deadnamed* in a courtroom by a judge, and so things can be really that overt in terms of, you know, you come to work and being deadnamed. But there can also be the kinds of, sort of microaggressions, assumptions being made about a person's sexuality, or gender, just each of those little things which can add up on a day-to-day basis. You know, people assuming the gender of one's partner, and so on. Or even going so far as to sort of make inappropriate sexual comments or inappropriate jokes, which are sexual harassment, but which are sort of laughed off as being a bit of a joke.\"\n\nDiversity Council Australia says this isn't about isolated incidents in the workplace, it's persistent exclusion.\n\nAhead of recent Hate Speech legislation passed following the Bondi terror attack, some rights groups called on the government to include stronger protections against LGBTIQ+ discrimination.\n\nHeather Corkhill says the community has been left out of legislation that could make a real difference.\n\n\"At the moment, there's a requirement that employers are required to actively prevent sex discrimination, harassment, before it occurs. But these reforms left us out, much like the recent hate crime reforms did as well, and LGBTIQ+ people deserve the same protection from hate speech and discrimination. We think that a positive duty to eliminate discrimination would improve workplace culture and not just respond after the damage is done.\"\n\nThe Council says periods of heightened social polarisation around identity can create conditions where people feel more emboldened to show prejudice at work.\n\nWith the rising prominence of neo-Nazi groups in Australia and laws undoing or limiting gender-affirming care for young people in parts of the country, discriminatory language and negative media attention on the community can normalise discrimination.\n\nWhether intentional or not, workplace discrimination creates environments where more serious harms can occur.\n\nCharlie Hamra says the current processes in place mean such incidents often go unreported.\n\n\"We've got these huge numbers of LGBTQIA+ people experiencing discrimination or harassment at work and that's unsurprising to us. You know, we're hearing about that at the moment on the ground. And what I'll say is that while we've got this, we might have this protection sort of on its face, the nature of the way that the process is means that people aren't making complaints and so over the course of a five-year period, we only had 39 complaints to the Equal Opportunity Commission in South Australia.\"\n\nTo address this, rights groups say there needs to be more investment in dedicated legal services for LGBTIQ+ employees.\n\n\"Because if you're a LGBTQI+ person who's being discriminated against in the workplace, it would make all the difference to be able to go to a service that is staffed and designed by LGBTQI+ people, a legal service, to be able to go to them for legal assistance in navigating the anti-discrimination framework.\"\n\nIn addition, experts say employers can go beyond symbolic gestures of inclusion by forming Pride Committees at work, providing training about discrimination and making clear to employees that discrimination in any form won't be accepted.\n\nA full report on the broader state of inclusion in the Australian workforce the past year is due out later this month.\n\nThese days, Ezra is a writer and does advocacy work.\n\nThey say the ability to be themselves means they can put their energy back into their work.\n\n\"Well, a combination of things really, like having, having a support network around me, you know, utilising my support workers that I have due to psychosocial disability, but also being now in an environment where I do feel like I belong, and it's safe, and I can be myself. Because I feel like being able to be myself in the workspace and not having to consciously, like, hide that and put the mental energy into that means that I can put the energy into work.\"",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-four-big-banks-will-pass-on-the-the-interest-rate-rise-morning-news-bulletin-4-february-2026/hof7tiorl",
    "title": "The four big banks will pass on the the interest rate rise | Morning News Bulletin 4 February 2026",
    "publish_date": "Tue, 3 Feb 2026 19:40:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAustralia's big four banks will pass on yesterday's interest rate rise in full, with ANZ, NAB, Westpac and the Commonwealth Bank set to raise rates by 25 basis points mid-way through this month.\n\nThe official cash rate now sits at 3.85 per cent after the Reserve Bank of Australia's monetary policy board reached the unanimous decision to raise rates in response to rising inflation.\n\nIt was the first hike to interest rates for more than two years, and a second increase is being widely tipped by economists.\n\nRBA Governor Michele Bullock has acknowledged the pain many will feel, but says rates are at least going up for the right reasons.\n\n\"This interest rate rise, it sort of comes across quite negatively. We're actually in a really good position. The labour market is really strong, and domestic demand is recovering. These are good things, but it's just that we're supply constrained, and we think we're even a little more constrained than we thought back a little while ago. So, yes, the strategy still is trying to bring the economy back into balance and the labour market back into balance, without over overshooting.\"\n\n+++\n\nThe Race Discrimination commissioner is warning the use of the phrase “social cohesion” by politicians is undermining progress towards a harmonious society.\n\nGiridharan Sivaraman says the phrase is being used as code for assimilation, and to avoid talking about the problem of racism, which he says Australians find hard to talk about.\n\nMr Sivaraman says people calling out racism get attacked more than racists.\n\nPrime Minister Anthony Albanese has used the term “social cohesion” more than 35 times in public speeches since the Bondi massacre in December.\n\nOpposition leader Sussan Ley has used the term at least 24 times since she assumed her job in May of last year.\n\n+++\n\nA coalition of eleven disability groups have cautiously welcomed a three-month delay to the Thriving Kids program, which will begin in October, three months later than planned.\n\nThe Thriving Kids program aims to increase the role of states in providing services for children with mild to moderate autism, or developmental delays.\n\nDetails of the delivery model and funding arrangements have only been revealed, months after families first raised their concerns.\n\nThe National Ethnic Disability Alliance's Sadikshya [[Sa-dik-sha]] Dulal says the uncertainty has been tough diverse families.\n\n\"It's not just navigating disability systems. They're doing so across language barriers, cultural differences and how disability is understood, and they do this often with limited prior knowledge of available support. So when information isn't available in community languages, or when co-design does not actively engage diverse communities, or when workforce training does not include cultural competency, these families fall through the gaps, and this is where we feel the delay must be used to build equity into the foundations.\"\n\n+++\n\nThe U-S military says it has shot down an Iranian drone after it flew towards the aircraft carrier USS Abraham Lincoln in the Arabian Sea.\n\nIt says the Shahed-139 drone approached the carrier at speed with unclear intent, prompting an F-35 fighter jet to bring it down in what it called a defensive move to protect the ship and its crew.\n\nNo personnel were injured and no equipment was damaged.\n\nHours later, Central Command reported a second confrontation in the Strait of Hormuz, saying Iranian Revolutionary Guard boats and a drone closed in on a U-S-flagged merchant vessel at high speed and threatened to seize it, before pulling away.\n\n+++\n\nU-N Secretary-General Antonio Guterres has reaffirmed the inalienable rights of Palestinians, warning that 2026 could prove decisive for peace as Gaza and the West Bank continue to endure deepening hardship.\n\nHis remarks came as the Rafah crossing reopened on a limited basis, with Mr Guterres calling for rapid and unimpeded delivery of humanitarian aid into Gaza.\n\nHe also warned that continued Israeli settlement expansion, demolitions and displacement in the occupied West Bank threaten territorial contiguity and deal a serious blow to the viability of a two-state solution.\n\nAddressing the UN’s Economic and Social Council, Mr Guterres said the world faces a critical moment\n\n“For 50 years, this committee has stood firm in defending a simple truth: the inalienable rights of the Palestinian people – including the right to self-determination – must be realised and respected, fully, consistently and without delay. We enter 2026 with the clock ticking louder than ever. Will the year ahead bend towards peace – or slip into the abyss of despair?”\n\n+++\n\nThe Sudanese army says it has broken a years-long siege on the city of Kadugli, potentially providing tens of thousands of people a reprieve from famine.\n\nThe conflict between the Sudanese army and the paramilitary Rapid Support Forces ((RSF)) has displaced millions, drawn in regional powers and caused a vast humanitarian crisis since it broke out in April 2023.\n\nThe end of the seige at Kadugli signals a shift in the war's momentum.\n\nThe army said in a statement that they succeeded in opening the Kadugli-Dalanj road, after what they called 'a heroic battle'.\n\n+++\n\nIn skiing, one of the United States' most-celebrated Olympic athletes claims she can makes one of sport's most remarkable comebacks from injury at the Winter Olympics next week.\n\n2010 gold medal winner Lindsey Vonn tore the anterior cruciate ligament in her left knee competing in Switzerland four days ago.\n\nThat's an injury that usually requires six to nine months of rehabilitation.\n\nBut Vonn believes she can compete in the women's downhill event at the Olympics in Italy next Monday.\n\nThe 41-year-old claims her knee actually feels better than it has at times in the past.\n\n\"I still need to do the downhill training run. But I also know what my knee has felt like with previous injuries in the gym and what it's felt like during all the physical tests. And I can say that I feel a lot better right now than I have in the past. I feel a lot better right now than I did in 2019 for the last World Championships.\"\n\nThe Milan-Cortina Winter Olmypics begin on Saturday.",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-australians-competing-in-skimo-a-new-olympic-sport-so-steep-athletes-get-delirious/ny3ysml8r",
    "title": "The Australians competing in skimo, a new Olympic sport so steep athletes get 'delirious'",
    "publish_date": "Tue, 3 Feb 2026 18:35:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "What do you get when you mix a love for navigating ascents and descents and snow? Ski mountaineering, of course.\n\nOtherwise, known as \"skimo\", this winter sport will be debuting at the Milano Cortina Winter Olympics, which start on 6 February. The schedule will include sprint races and mixed relays.\n\nThe sport has a rich history, steeped in practical mountain travel and military patrol competitions.\n\nHowever, skimo was only recognised by the International Olympic Committee almost 100 years after other winter sports such as ice skating and ski jumping.\n\nLISTEN TO Has the Olympics done its dash? SBS News 07:55 English\n\nThe sport combines elements of cross country, alpine skiing and mountaineering.\n\nWhat is skimo?\n\nAthletes sprint uphill with fabric strips called 'skins' on the bottoms of their skis, which grip the snow. They then attach their skis to a special backpack, run a section of the course in boots, and then turn their boots into downhill mode to race downhill.\n\nThe sprint races are over in a couple of minutes.\n\nSo, how did two Australians — Phil Bellingham, 34, and Lara Hamilton, 27, end up competing in skimo's first Olympic events?\n\nFor Bellingham, this will be his fourth Winter Olympics, having competed in cross-country skiing at Sochi 2014, PyeongChang 2018 and Beijing 2022.\n\nHamilton, from Sydney's north shore, will be making her Winter Olympics debut. Her background is in Nordic skiing and trail running, but last year she made skimo her focus and qualified for the Australian team at this year's Games.\n\nHamilton told SBS News the speeds athletes are sprinting uphill at produce a huge amount of lactic acid — but she finds the descent after the climb in ski mountaineering the biggest challenge.\n\n\"My legs are shaking, I'm feeling delirious, and I'm expected to do these precise movements as quickly as possible,\" she said.\n\n\"It's like you suddenly stop and you need to do this manipulation of the gear. So I guess learning how to calm to be able to do that after an all-out effort has been my biggest challenge.\"\n\nBellingham, who hails from Victoria's High Country, said TV viewers should be aware just how steep the decline is.\n\n\"It kind of just looks like people walking along quite slowly on skis, but it's actually a really steep ski run,\" he told SBS News.\n\nFrom cross-country skiing to ski mountaineering\n\nBellingham almost hung up his skis following the 2022 Beijing Winter Olympics, but cross-country skiing program director Finn Marsland encouraged him to give skimo a go.\n\nHe said he'd always been interested in the sport.\n\n\"I had always done a lot of backcountry skiing and downhill skiing, so I decided to give it a go in the 2023 season ... it was a bit of a rough start, but it turned out okay and I enjoyed doing it.\"\n\nThe Milano Cortina Winter Olympics will be Phil Bellingham's fourth games. Source: AAP / Dan Himbrechts\n\nHamilton, who grew up skiing and running, focused on running after high school after she landed a cross country scholarship in the United States.\n\nBut during her university winter breaks she kept up her skiing in the slopes of Colorado, until she saw some people ski mountaineering, and thought she would give it a go.\n\n\"I was backcountry skiing, but on a super heavy setup, not the setup that we know for skimo,\" she said.\n\n\"I had some friends in Colorado who were doing similar sports, so they gave me some advice on what to get ... so I bought my first setup secondhand, super crappy and just started doing [skimo] in the evenings around the resort.\"\n\nHamilton officially moved to Colorado in 2022 where she competed in her first races, and followed the US circuit, competing in her first World Cup in 2024.\n\n\"I learnt (through) trial by fire, but it’s been a really good journey.\"\n\n'You do have to make a lot of sacrifices'\n\nAfter buying her first setup on Facebook marketplace, Hamilton soon realised she'd need a better one.\n\n\"I was like: 'How the hell am I going to afford this?'\"\n\nAt 27 years-old, Lara Hamilton is making her Olympic debut. Source: Getty / Morgan Hancock\n\nShe contacted a ski manufacturing company and offered her skills in marketing in exchange for skimo gear.\n\n\"I made that last something of two years before I broke it. But in saying that, that's a representation of how it's not that accessible, just because of how expensive the gear is,\" she said.\n\nThe high cost comes largely from the best equipment being made from carbon fibre, which keeps things extremely light for the athletes to climb and ski in, and store in their backpacks.\n\nA full skimo setup includes skis, boots, crampons, climbing skins, gloves, poles, helmet, backpack and avalanche gear and can cost up to around $10,000 for elite racers.\n\n\"You do have to make a lot of sacrifices, I guess, especially as an Australian coming into a very Eurocentric sport. It's a lot of travel, a lot of gear, things break easily, race suits, entry fees, coaching, all of it,\" Hamilton said.\n\nBellingham had a similar experience, also noting how expensive the sport is.\n\n\"It definitely wasn't easy, just because boots cost around $3,000,\" he told SBS.\n\n\"I had a ski supplier who gave me cross country skis when I was racing ... and I told them I was going to try and go to the Olympics for this different sport ski mountaineering and they helped me out with my first pair of skis.\"\n\nOlympians are paid $5,000 once they have qualified for each Games, and medal winners are paid up to $20,000 if they win gold. Athletes may be able to access other funds and have sponsors provide them with gear, but Hamilton is not the first Australian Winter Olympian to point out the high costs she's had to cover herself.\n\nAll geared up and ready to rise ... and descend\n\nBellingham spends his time chasing winters, spending time at Falls Creek in Australia and training overseas. Hamilton spends her summer competing in World Cup trail running circuits, and her northern hemisphere winters are spent in Europe or America.\n\nBoth are now in Italy ready for the ski mountaineering competition, which will be held from 19-21 February at the Stelvio Ski Centre in Bormio.\n\n\"It’s really intense, which is awesome for the audience and a real challenge for athletes,\" Hamilton said.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-digital-wild-west-spain-planning-to-ban-social-media-for-under-16s/bkomqip4t",
    "title": "'The digital Wild West': Spain planning to ban social media for under-16s",
    "publish_date": "Tue, 3 Feb 2026 10:53:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Spain plans to ban access to social media for minors under 16, and platforms will be required to implement age-verification systems, Spanish Prime Minister Pedro Sánchez has announced.\n\nSánchez's left-wing Coalition government has repeatedly complained about the proliferation of hate speech, pornographic content and disinformation on social media, saying it had negative effects on young people.\n\n\"Our children are exposed to a space they were never meant to navigate alone ... We will no longer accept that,\" Sánchez said as he addressed the World Government Summit in Dubai on Tuesday, calling on other European countries to implement similar measures.\n\n\"We will protect them from the digital Wild West,\" he added.\n\nIn December, Australia became the first country to ban social media for children under 16, a move being closely watched by other countries considering similar age-based measures, such as the UK and France.\n\nSánchez said Spain had joined five other European countries — that he dubbed the \"Coalition of the digitally willing\" — to coordinate and enforce cross-border regulation.\n\nThe Coalition will hold its first meeting in the coming days, he said. Sánchez didn't say which countries were in the group, and his office didn't immediately respond to a request for clarification.\n\n\"We know that this is a battle that far exceeds the boundaries of any country,\" he said.\n\nSpain will also introduce a bill next week to hold social media executives accountable for illegal and hate speech content, as well as to criminalise algorithmic manipulation and the amplification of illegal content, Sánchez said.\n\nLISTEN TO One month on, how is the teen social media ban working? SBS News 06:05 English\n\nAmong the measures he proposed was a system to track hate speech online, while platforms would be required to introduce age verification systems that \"were not just check boxes\", he said.\n\nHis government would begin the process of passing legislation as early as next week, he said.\n\nHe added that prosecutors would explore ways to investigate possible legal infractions by Elon Musk's AI chatbot Grok, as well as social media platforms TikTok and Instagram.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/rba-governors-four-reasons-for-rate-hike-as-materially-higher-inflation-predicted/tw8nsbl5f",
    "title": "RBA governor's four reasons for rate hike as major banks react to increase",
    "publish_date": "Tue, 3 Feb 2026 07:55:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Reserve Bank of Australia (RBA) has lifted the cash rate by 25 percentage points to 3.85 per cent — its first increase in over two years — citing inflation that has risen \"materially\" since mid-2025.\n\nThe move was tipped by many economists and expected by financial markets, after inflation surged back above the central bank's 2–3 per cent target band.\n\nTreasurer Jim Chalmers said the decision was widely expected, but that didn't make it any easier for homeowners.\n\n\"This will be difficult news for millions of Australians with a mortgage, and we understand the pressure that this will put on families and businesses,\" he said on Tuesday.\n\nThe RBA's Statement on Monetary Policy released on Tuesday said: \"While part of the pick-up in inflation is assessed to reflect temporary factors, it is evident that private demand is growing more quickly than expected, capacity pressures are greater than previously assessed and labour market conditions are a little tight.\"\n\nREAD MORE What could disappear if rates rise today — and how much a hike would cost you\n\n\"The board judged that inflation is likely to remain above target for some time and it was appropriate to increase the cash rate target.\"\n\nRBA governor Michele Bullock said those developments drove the board's decision, pointing to four key factors that guided the hike:\n\nDemand stronger than expected\n\n\"Our updated view, driven by the latest data, is that demand was stronger-than-expected over the second half of 2025, and we think some of that strength has carried into 2026,\" Bullock said.\n\n\"Conditions in the labour market have held up well, and unemployment has remained lower than thought,\" she added.\n\nSupply constraints tightened\n\n\"The economy is closer to its supply capacity than we previously thought, which means supply constraints are binding in some more sectors,\" Bullock said.\n\n\"It's not taken much of a pick-up in demand to generate price pressures,\" she added.\n\n\"Years of weak to no productivity growth is a big part of that story,\" she said.\n\nGlobal economy more resilient\n\nThirdly, Bullock said the global economy had turned out to be \"much more resilient than we thought\", despite \"the ongoing high level of uncertainty and unpredictability\".\n\nShe noted that this resilience had fed into domestic conditions, strengthening demand and price pressures.\n\n'Uncertain' whether financial conditions restrictive\n\n\"Financial conditions have eased, and it's uncertain now whether they remain restrictive overall,\" Bullock said.\n\n\"The recent pick-up in inflation and credit growth are enough to make us question this,\" she added.\n\nThese four factors, taken together, led the board to deem it necessary to increase the cash rate, Bullock concluded.\n\nLISTEN TO Interest rate rise ends two-year pause SBS News 05:22 English\n\nThe 'big four' banks have matched the increase, which will mean a monthly increase of more than $90 on a $600,000 mortgage.\n\nOn Tuesday evening, the Commonwealth Bank, NAB, ANZ and Westpac announced they would be increasing their home loan variable interest rates by 0.25 per cent. Commonwealth, NAB and ANZ's increases will come into effect on 13 February, while Westpac's will come into effect on 17 February.\n\nAre there more hikes to come?\n\nANZ's head of Australian economics Adam Boyton said that with the RBA expecting higher inflation, lower GDP growth, higher medium-term unemployment and higher assumed interest rate path than previously thought, an additional rate hike appears likely.\n\nNAB chief economist Sally Auld said given the increasing pressures on inflation, it was unlikely to be a \"one-and-done\" scenario for the RBA.\n\n\"We continue to forecast a follow-up 25bp hike in May, although risks are biased to an earlier hike and the possibility of more than just a modest 50bp recalibration,\" she said.\n\nThe RBA board said it would use upcoming data about the global economy, domestic demand, inflation and the labour market to guide future decisions.\n\nThe big four banks have passed along the RBA's rate hike. Source: AAP / Joel Carrett\n\nWhen speaking to reporters on Tuesday, Bullock addressed the impact on households.\n\n\"For mortgage holders, this isn't a great outcome,\" she said. \"But what's also not great for them, or for anyone else, is if inflation remains elevated,\" she added.\n\n\"Ultimately, it is best if we get inflation under control, and our instrument is the interest rate.\n\n\"I empathise with them, but the alternative is potentially even harder.\"\n\n— With additional reporting by the Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rba-pulls-the-trigger-on-rates-gold-and-silver-rebound/4ok7lrcvh",
    "title": "RBA pulls the trigger on rates; gold and silver rebound",
    "publish_date": "Tue, 3 Feb 2026 07:45:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/new-study-genetics-play-a-key-role-in-human-longevity/s1lpsa5sm",
    "title": "The key to a long life? One factor may matter more than we thought",
    "publish_date": "Tue, 3 Feb 2026 07:30:06 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Living a long, healthy life is sometimes framed as the outcome of daily choices, but a new study suggests genetics play a bigger role than previously thought.\n\nStandard advice for staying healthy longer includes exercising more, eating healthy food, having regular medical check-ups, sleeping well, drinking less alcohol and quitting smoking.\n\nBut new research by scientists at the Weizmann Institute of Science in Israel suggests, after removing deaths caused by external factors, genetics influence around 55 per cent of a person's lifespan.\n\nPublished in the journal Science, the new findings are based on mathematical modelling, drawing on more than a century of data from twins in Sweden and Denmark, countries with high living standards and relatively equal access to healthcare.\n\nThe authors of the new peer-reviewed research claim longevity genes can reveal ageing mechanisms and inform medicine. However, they point out the previous estimates of how much genetics influence life expectancy were confounded by external factors of mortality — accidents or infectious diseases — and therefore contributed to scepticism about the role of genetics in ageing.\n\nAccording to the researchers at the Weizmann Institute of Science, most lifespan studies previously used data on cohorts of the population born in the 18th and 19th centuries, which were periods of high mortality caused by external factors.\n\nIn order to separate external factors from \"intrinsic\", mostly shaped by genetics, the researchers ran simulations of the two mortality models. They then tested their conclusions on three different twin studies.\n\nAs a result, they found, external mortality caused systematic underestimates of the link between genetics and longevity. While previous estimates put heritability at only 20 to 25 per cent, the new results showed genetics influence around 55 per cent of a person’s lifespan.\n\n\"The study ... has important consequences for ageing research,\" wrote Daniela Bakula and Morten Scheibye-Knudsen, researchers at the University of Copenhagen, in a related Perspective article published in Science.\n\nThey said the findings give researchers good reason to identify genes linked to longer lives and to better understand the biological processes behind ageing.\n\nDr Jack da Silva, an evolution expert from the University of Adelaide, said the new study adds to previous research in lifespan heritability observed in other species.\n\n\"This is an impressively thorough study. We’ve known for quite some time that there is a lot of genetic variation for lifespan in populations of organisms such as fruit flies studied in the laboratory, and that single genes can have a very large effect on lifespan in these organisms,\" De Silva said.\n\n\"The present study usefully shows that the same is true for humans. The study is also valuable in teasing out the effects of things that can kill us that aren’t age-related, such as accidents and infections, which has been a difficult task in the past.\"\n\nContext dependent\n\nProfessor Tony Blakely, epidemiologist at the Melbourne School of Population and Global Health at the University of Melbourne, told SBS News the study was interesting, but \"not too surprising\".\n\n\"Because we know that you inherit risks for cancer. So for example, breast cancer has an inheritability, colorectal cancer has an inheritability, cardiovascular disease has some level of inheritability. So of course, therefore, some of the variation between us humans is going to be due to genetics.\"\n\nREAD MORE Should you be freaking out about microplastics?\n\nBlakely said variations in the environment can play a significant role.\n\n\"If you live in a place where half the people smoke, half the people don't, where there's really bad diets amongst some people, and really good diets amongst others, where half the population lives in really polluted cities, you've got more environmental variability. That will drive the overall variability of how long people are likely to live,\" he said.\n\nHe added that, in the Scandinavian countries that were studied, just like in Australia, some of the environmental determinants have been reduced.\n\n\"In Sweden or Denmark, and in Australia to a large extent, where we've reduced some of those environmental determinants or tried to squash them out. Then things like genes start to come out a little bit more as explaining some of the residual difference between humans and how long we might live.\"\n\nHowever, Blakely says countries such as Denmark or Sweden are more homogeneous than Australia, and longevity rates would be context-dependent.\n\n\"In a population like Australia with different countries of birth, different ethnicities, different socioeconomic groups, you might see more variability because the environment is causing more variability, not just genes causing how long you live.\"\n\nIn Australia, life expectancy has increased by over 30 years since 1900.\n\nBlakely says that this was not because genetics changed.\n\n\"That's because of improving diets, reduced smoking, better sanitation — all those things. And so what drives how long a population lives on average is the environment. But within wherever your population is, at some point in time, there will be variability in that due to genetics, as well as other variability that's due to things like whether you smoke or not.\"\n\nLife expectancy for females born between 2021-23 is now 85.1 years, and for males it's 81.1 years, according to figures from the Australian Institute of Health and Welfare.\n\nDo lifestyle choices influence longevity?\n\nBlakely said lifestyle choices, as well as access to quality health care, are critical to living longer.\n\n\"The quality of your diet, physical activity, alcohol consumption, sodium consumption, eating the fruit and vegetables, all that stuff still matters, and will be driving a lot of our own life expectancy.\"\n\nHe said it’s not just about genetics and healthy habits. Sometimes it's also about luck.\n\n\"There's a certain amount of chance whether your gene is going to do a mutation and cause a cancer that's not inherited that happens as you get older,\" he said.\n\n\"So of course, lifestyle matters a lot. And so does the quality of our health services and treatments. We have treatments now that can save lives or prevent illness as well.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interest-rate-rise-ends-two-year-pause/iqjmz8d1s",
    "title": "Interest rate rise ends two-year pause",
    "publish_date": "Tue, 3 Feb 2026 06:14:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT:\n\nWOMAN 1: “I'm going to do my grocery shopping now, and, yeah, I've got to watch every penny. I'm not in the market at the moment, and I'm probably won't be entering it for a long time.\"\n\nWOMAN 2: \"I believe in the future, our kids can't buy a house. It's going to be like a rental system, even if it's buying all their life they're going to pay it. They're not going to have life. Even if I'm working, they're saying, 125 or $160,000, how are you gonna repay the loan?\"\n\nThese women are responding to the interest rate rise announced by the independent Reserve Bank of Australia, bringing the cash rate up from 3.6 per cent to 3.85 per cent.\n\nIt's the first rate rise in over two years, making the RBA the second advanced economy central bank - behind Japan - to begin a new rate-rising cycle.\n\nDespite concerns that public spending fuelled inflation and crowded out the private sector, Treasurer Jim Chalmers said in a noisy session in parliament the Reserve Bank’s report identifies private demand - not government spending - as the primary driver of inflation.\n\n\"It makes it very clear that the pressure on inflation is coming from private demand. Let me make this really clear. This is the Reserve Bank board in their statement just released. Mr Speaker, growth in private demand has strengthened substantially more than expected. Mr Speaker, this is the point that the Reserve Bank has made today.\"\n\nDr Chalmers says criticism of government spending and its role in driving up inflation is motivated by politics and not facts.\n\nWhile acknowledging that interest rates have risen further than the government hoped, Dr Chalmers is emphasising the urgent need to address inflation and productivity reform as global economic uncertainty intensifies.\n\nBecause the Reserve Bank raises rates specifically to curb inflation, the Treasurer took to ABC’s Radio National Breakfast to defend the budget.\n\nAcknowledging the cost of living pressure Australians are facing, Dr Chalmers says the government is enacting policies to help ease daily pressures.\n\n\"Well, first of all, more than acknowledge that people are still under pressure, we're acting on that. Cheaper medicines, which came out last month, more bulk billing, student debt relief, three tax cuts: that's all about acknowledging and acting on the very real pressures that people are feeling in our community and around our country.\"\n\nDespite the Reserve Bank statement , Opposition leader Sussan Ley insists government spending is responsible for the inflation problem.\n\n\"Australians are struggling even more with the cost of living crisis. This is Labor's cost of living crisis. When labor spends, prices rise and Australians pay. And I've been speaking to a lot of mums, and I know my colleagues have and as they look at the expenses of going back to school last week and this week, and they're staring straight down the barrel of possibly more interest rate rises.\"\n\nMeanwhile the Leader of the Greens party, Larissa Waters, blames Australia's speculative housing market for the inflation problem.\n\n\"We know the reason the housing market is overheated is the policies of this government to prop up property investment and to give billions of dollars to property investors, rather than helping first home owners and renters. Those are the policy settings that the government should have fixed. But instead, the government is delivering for the big banks, just like they deliver for their big corporate mates all the time.\"\n\nDr Tim Thornton, the director of the school of political economy, says the level of government spending as a percentage of GDP is not particularly large in Australia by OECD standards.\n\nHe says raising interest rates is not the only lever available to rein in inflation.\n\n\"Well, there are actually a range of other tools that can be used to manage inflation, beyond simply lifting interest rates. Most but not all of these would be the responsibility of the government rather than the Reserve Bank of Australia. These tools include price controls, credit controls, rationing, establishing buffer stocks, and also what are called income policies, which are political agreements between different stakeholders in society. Now it's currently the intellectual fashion to vehemently dismiss these other tools as being somehow outdated or even discredited. I think this is quite the mistake, as all of these tools have been used successfully in Australia in the past, and at least some of these could be used again and in the future.\"\n\nMeanwhile Dr Andrew Grant, Associate Professor of Finance at the University of Sydney, warns there could be more rises.\n\n\"Typically, when the Reserve Bank increases rates, they don't typically stop at one increase. Historically, it's sort of been a sign that they might be two or three in a row. We typically have seen that there's a bit of momentum in these things. So I wouldn't be surprised at all if, you know, we get another rate increase before the end of the year, or even before half be the end of the financial year, especially if this sort of struggles to put a brake on inflation. So that's what I will expect to see.\"",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australias-interest-rate-increased-for-first-time-since-2023-evening-news-bulletin-3-february-2026/v31oy1z2k",
    "title": "Australia's interest rate increased for first time since 2023 | Evening News Bulletin 3 February 2026",
    "publish_date": "Tue, 3 Feb 2026 05:07:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nAustralia's interest rate increased for the first time in more than two years\n\nFormer Liberal senator Cory Bernardi joins Pauline Hanson's One Nation party\n\nWallabies Rugby World Cup matches revealed\n\nThe Reserve Bank of Australia has lifted interest rates, bringing the cash rate up from 3.6 per cent to 3.85 per cent.\n\nIt's the first time the central bank has hiked the rate in more than two years.\n\nAustralia's big four banks and many economists had anticipated an increase, after Australian Bureau of Statistics data showed a rise in inflation last week.\n\nTreasurer Jim Chalmers says the federal government understands more needs to be done to control inflation and reduce cost-of-living pressures.\n\n\"Even though today's decision was expected it doesn't make it any easier for people who are already under pressure, I think I've made that really clear. And we don't just acknowledge that, we're acting on that as a government collectively. We're acting on that with cheaper medicines and tax cuts, more bulk billing, student debt relief and the like. Now if those opposite really cared about the pressure on people around this country, they would have supported that cost of living help.\"\n\n---\n\nFormer Liberal senator Cory Bernardi has joined Pauline Hanson's One Nation party.\n\nHe is the latest former Coalition member to join her party following Barnaby Joyce's defection from the Nationals in December.\n\nMr Bernardi is running as a candidate for One Nation at the South Australian election next month.\n\nHe says he has been having conversations with Ms Hanson over a number of years, after he quit the federal Senate in 2020.\n\n\"There is no doubt that I will stay a member of One Nation. Pauline and my views are aligned. And quite frankly if you look at history, we were both members of the Liberal Party at one point. Pauline has been trying to reshape politics for 30 years. I thought I could reshape politics as well by dragging parties back to where they should be. They don't want that. But right now Pauline Hanson has legacy that is worth defending and is worth building upon.\"\n\n---\n\nThe protest restrictions in New South Wales have been extended ahead of a planned visit of Israel's president.\n\nNationwide protests have been planned against the visit by President Isaac Herzog, who has been invited to visit Australia after the Bondi terror attack in December.\n\nThe New South Wales Police Commissioner, Mal Lanyon, has declared the restrictions on applications for approval for public assemblies will be in effect for the next 14 days.\n\nIt will apply to the region covered by the Eastern Suburbs Police Area Command; and in parts of Sydney’s CBD, excluding Hyde Park.\n\nPremier Chris Minns says a balance must be struck.\n\n\"There’s a need to protect both the president, who is an invited guest of Australia, and also regular Australians as they go about their jobs and lives in Sydney next week. And we want to make sure we’re balancing those protections.\"\n\n---\n\nVictoria's government has announced it's allowing general practitioners to diagnose and treat attention deficit hyperactivity disorder or ADHD in adults and children.\n\nAdults in the state can currently only be diagnosed and prescribed medication by a psychiatrist, and children must see a paediatrician or psychiatrist.\n\nPremier Jacinta Allan says that is leading to high out-of-pocket costs and long wait times.\n\n\"Too many families are waiting too long. It can take months for some and up to more than a year to receive that first diagnosis and then that repeat visit to get the scripts refilled adds stress as well for these families. But also too it puts additional pressure on our specialists in the system - our paediatricians and our psychiatrists.\"\n\nThe change will be supported with $750,000 allocated to accredited training for an initial 150 GPs by September this year to diagnose and treat ADHD in adults and children.\n\n---\n\nTo sport,\n\nThe Wallabies will kick off the 2027 Rugby World Cup against Hong Kong in Perth on October 1st.\n\nThe tournament is being held in Australia for the first time since 2003.\n\nThe Wallabies second match will be against the All Blacks in Sydney on October 9, followed by a game against Chile on October 16 in Brisbane.\n\nThe expanded 24-team World Cup will feature 52 matches across 19 match days in seven cities - with a shortened pool stage but a new knockout round of 16.",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/school-staff-face-termination-under-new-hate-speech-rules-sbs-news-in-easy-english-3-february-2026/ghzttaslg",
    "title": "School staff face termination under new hate speech rules | SBS News In Easy English 3 February 2026",
    "publish_date": "Tue, 3 Feb 2026 02:55:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nWelcome to SBS News in Easy English. I'm Biwa Kwan.\n\nOpposition leader Sussan Ley has offered to reunite the Coalition this week on the condiiton that the three senators who crossed the floor on hate speech laws remain on the backbench for six months.\n\nMs Ley described conversations with Nationals leader David Littleproud last night as 'constructive' - a fortnight after the Nationals announced an end to the Coalition arrangement with the Liberal Party.\n\nMs Ley says she feels confident about progressing talks with the Nationals.\n\n\"We had constructive conversations with the national party last night, but I want to make a point that they were they were constructive. We agreed to keep doing that because we are both parties on the non Labor side of politics.\"\n\n---\n\nTeachers and principals in New South Wales who engage in hate speech could be fired under new rules for school staff.\n\nThe state government says the policy change applies from today.\n\nThe changes affect the code of conduct for staff across government, independent and Catholic schools - giving the regulator the power to direct a school to fire a staff member in the event of a breach.\n\nPremier Chris Minns says it follows cases where prominent teachers or principals have been accused of hate speech, but the government felt it could not take action.\n\nDeputy Premier Prue Car says the change is needed.\n\n\"This is a common sense change. The vast majority of schools this will never apply to. But it is important that the government sends a message to parents of New South Wales that schools should always be safe places. And in order for those to be as safe as possible, we will crack down on hate speech in schools and the community.\"\n\n---\n\nThe United Nations has welcomed the re-opening of the Rafah crossing into Gaza from Egypt, but appealed for an increase in the number of people allowed to cross the border.\n\nThe reopening marked a key step in the Israel-Hamas ceasefire process but a mostly symbolic one, as few people will be allowed to travel in either direction and no goods will pass through.\n\nGaza health officials say there are around 20,000 Palestinian children and adults needing medical care who hope to leave the devastated territory via the crossing.\n\nUN spokesman Stephane Dujarric wants the restrictions at the border to be lifted further.\n\n\"As we have said before, civilians must be allowed to leave and return voluntarily and safely, as international law requires ultimately, essential humanitarian supplies must enter in sufficient quantities and with fewer restrictions through Rafah and all other crossings.\"\n\n---\n\nThe United States Justice Department says it's taken down several thousand documents and media relating to its Epstein investigation that may have inadvertently included victim-identifying information.\n\nIt blamed the release of sensitive information on 'technical or human error'.\n\nThe effect of errors in the documents was highlighted on Monday [[2 Feb US time]] at a sex trafficking trial in New York federal court.\n\nThe lawyers for two high-end real estate brokers and their brother had asked Judge Valerie Caproni for a mistrial because of documents that were made public without necessary redactions.\n\n---\n\nIn tennis,\n\nTwo mothers feature inside the Top 10 for the first time in rankings history.\n\nBelinda Bencic and Elina Svitolina are the fifth and sixth players to be ranked inside the Top 10 as mothers, following Margaret Court, Evonne Goolagong Cawley, Kim Clijsters nd Serena Williams.\n\nBencic says she is proud of the achievement.\n\n\"That means of course a lot to me. Making the top 10 means a lot to me. I am super proud of this achievement, but I think mainly I have to thank my support team - my family for helping me so much; to make this possible for me to do what I'm doing. To travel around the world and still play tennis. I think without them, I wouldn't be able to do that. And in general, I am just super happy. And also thanks so much for the fans for the support.\"\n\nUnder rules introduced from 2019, new mothers returning to the tour are able to use their previous ranking to enter 12 tournaments over a three-year period from the birth of their child.\n\nAnd that's SBS News in Easy English. I'm Biwa Kwan.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/this-is-about-the-best-version-of-pirates-of-penzance-you-could-see-20260128-p5nxok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This is about the best version of Pirates of Penzance you could see",
    "publish_date": "Wed, 04 Feb 2026 13:31:27 +1100",
    "category": "entertainment",
    "authors": [
      "Bridget Davies",
      "Nadia Bailey",
      "Andrew Fuhrmann",
      "Jessica Nicholas",
      "Sonia Nair"
    ],
    "text": "Advertisement\n\nKey points OPERA: Victorian Opera puts on a joyous staging of The Pirates of Penzance\n\nMUSIC: Nick Cave and the Bad Seeds perform at Alexandra Gardens\n\nDANCE: Garabari at Midsumma is enjoyable – and participating is non-negotiable\n\nJAZZ: The Necks deliver a five-star performance at Melbourne Recital Centre\n\nTHEATRE: The Placeholder at fortyfivedownstairs wades into thorny territory\n\nOPERA\n\nThe Pirates of Penzance ★★★★\n\nVictorian Opera, Palais Theatre, until February 6 If The Pirates of Penzance proves one point, it’s that silliness is timeless. Raucously popular for almost 150 years, a good Pirates is still a guaranteed money-spinner. This staging, originally by Opera Australia, has been met with laughter and acclaim wherever she sails. Victorian Opera is now at the helm, but audience reaction will be no different. Ben Mingay as The Pirate King. Jeff Busby With comedic plots of clever rhymes sung at rapid-fire pace to catchy melodies, Gilbert & Sullivan is a style unto itself. Pirates is the most joyous piece in the G&S canon, with innumerable proliferations across popular culture, including perhaps the most parodied song in the English language, I Am the Very Model of a Modern Major-General. VO artistic director Stuart Maunder has fashioned this production with a lifetime’s worth of devoted insight. There’s thought behind the tiniest details; he has squeezed as much funny out as is possible.\n\nAdvertisement\n\nBen Mingay’s much-lauded Pirate King is charismatic and wonderfully riotous, always scene-stealing. He gels naturally with Nicholas Jones, a VCA graduate turned Paris Opera principal artist, as Frederic. Jones deploys his full bag of tricks for this role: effortless operatic tenor, impeccable comedic timing, notably un-wussy sword fighting, even some ballet. Opposite him are emerging and seasoned opera darlings (respectively) Nina Korbe and Antoinette Halloran. Korbe’s coloratura hits every mark perfectly, and while Halloran’s cockney Ruth might conjure up her recent turn as Mrs Lovett, she’s reliably excellent, as is tenor Douglas Kelly as the pirate Samuel. This is just about the best version of Pirates of Penzance you can see. Jeff Busby Stage stalwart Richard Piper (Major-General Stanley) appears more at home with comedy than music. He somehow, on opening night, managed to get ahead of the orchestra during his famous number, though he still landed the laughs. Conductor James Pratt does an otherwise superb job of keeping everyone and everything together, bringing requisite buoyancy to Orchestra Victoria’s playing of the score. One omission sorely missed is surtitles. Though sung in English, diction in the chorus numbers tended towards unintelligibility. Any real pitfalls are those present in the work itself (and some are very dated). With that in mind, is this production just about the best version of Pirates that you could see? Aye aye!\n\nReviewed by Bridget Davies\n\nAdvertisement\n\nMUSIC\n\nNick Cave and the Bad Seeds ★★★★★\n\nAlexandra Gardens, January 30 Across his decades-long career, Nick Cave’s work has always courted darkness: his lyrics reverberate with images of biblical violence, with the ache of loneliness and grief, with the kind of love that goes hand in hand with death. Yet equally, he is attuned to beauty and salvation; to the distant, longed-for possibility of redemption. It is in the tension between these two impulses, never quite reconciled, that the strength of his artistry lies. Nick Cave and The Bad Seeds at Alexandra Gardens on Friday. Richard Clifford This artistry was on full display at Melbourne’s Alexandra Gardens, where an electrifying 2½-hour set somehow didn’t seem long enough. It’s been nine years since Cave last toured with the full complement of the Bad Seeds, and the band seems determined to make up for lost time. Every person on stage comes to the performance with absolute conviction: from Warren Ellis working his unruly magic with the violin, to the gorgeous textures of the gospel-inflected backing choir, and the magnetic, visceral energy of Cave himself.\n\nAdvertisement\n\n“It seems like we’ve been on a great odyssey across this country to get to Melbourne,” he says, to roars of approval. This is a show for the home crowd. The set deftly balances work from the band’s 2024 album, Wild God, with cherry-picked tracks from its extensive back catalogue. An early highlight is a searching performance of O Children from the 2004 album, Abattoir Blues/The Lyre of Orpheus, while Cave’s darker impulses are on full display in the seductively menacing groove of Red Right Hand and the apocalyptic bombast of The Mercy Seat. Nick Cave’s artistry was on full display at Melbourne’s Alexandra Gardens, where an electrifying 2½-hour set somehow doesn’t seem long enough Richard Clifford While the show contains its moments of pain, rage and despair, these days, joy is perhaps Cave’s primary register. It’s there in the naive lyrics of Frogs, in his open-hearted tribute to former bandmate and collaborator Anita Lane in O Wow O Wow (How Wonderful She Is), and most defiantly in Joy, in which Cave conjures up a ghostly child visitor with a message of hope amid the tragedy of the everyday: “We’ve all had too much sorrow, now is the time for joy.” A generous, six-song encore showcases some of the band’s best work: from an elemental rendition of The Weeping Song to a sensitive cover of Young Charlatans’ Shiver (perhaps the world’s most accomplished love song ever to have been written by a 16-year-old). A luminous performance of Into My Arms brings the evening to a close: tender, plainspoken, the darkness tempered always by light.\n\nReviewed by Nadia Bailey\n\nAdvertisement\n\nDANCE\n\nMIDSUMMA | Garabari ★★★\n\nMeat Market, North Melbourne, until January 31 Garabari is billed as a participatory event, so there’s no excuse for not playing along. Forewarned is fair warning: you’ve bought a ticket, so you’ve got to help out. It’s not going to work if you don’t bring your dancing shoes. Garabari at Midsumma Festival fits the community mood and travels well. Courtesy of Sydney Festival Yes, at first, it’s awkward. People meander through the large, dark space, drifting aimlessly and smiling apologetically. The soundscape is a disconcerting mix of creakings and scrapings. We’re warming up to the room and to each other. Of course, it’s all part of a larger narrative. We’re already inside a re-visioning of the story of the Murrumbidgee River’s creation. This first part is a time of drought, we’re told, a time of dust and heat and general suffering.\n\nAdvertisement\n\nThe performers circulate through the crowd and little dances begin to appear: fragmentary routines for two or three or four. Crowds gather and disperse. It’s as if something is bubbling away, building up. Eventually, there’s a short but effective narrative dance showing the liberation of the waters by the youngest and bravest of the goanna women. Huge shadows loom against a curtain as the earth cracks open and land is quenched. After that, the party begins in earnest. Everyone has to dance. The performers keep it moving, calling people in, co-ordinating mass choreography, whooping and hollering and carrying on. It’s diverting – even if it feels a little forced. It almost recalls the compulsory jollity of cruise ship entertainment or theatre for children, with the performers policing participation, albeit with endless grinning and an ultimately tolerant attitude to refusal. As a celebration of the stories and rituals from the Wiradjuri community around Wagga Wagga and the Riverina, where the show was developed, Garabari is enjoyable, for all its goofiness and happy-clappy enthusiasm. It’s a fun homage to the institution of corroboree. Whether it becomes anything like a true rite of passage, leaving participants altered, is another question. That’s a tall order for such a brief performance – little over an hour. But at Midsumma Festival, it fits the community mood and travels well.\n\nReviewed by Andrew Fuhrmann\n\nAdvertisement\n\nJAZZ\n\nThe Necks ★★★★★\n\nMelbourne Recital Centre, January 29 At first glance, the three members of The Necks are mere musicians. But Chris Abrahams, Lloyd Swanton and Tony Buck are also magicians. How else to explain the way they pull invisible threads of sound from the ether and fashion them – instinctively, intuitively and moment-by-moment – into perfectly formed musical tales? The Necks - Lloyd Swanton, Tony Buck and Chris Abrahams. Camille Walsh Photography Now in their 39th year together, the trio has developed the kind of creative communion that makes each fully improvised journey feel both thrillingly unpredictable and somehow inevitable. Thursday night marked the start of the band’s annual Australian tour, and an air of hushed anticipation greeted the trio’s arrival on stage. Sparsely lit and heads bowed, they waited in silence. When Swanton began plucking his bass – slowly, deliberately – it felt more like a prayer than a series of notes. Buck’s touch on cymbals was equally spare and reverential, as was Abrahams’ glistening piano.\n\nAdvertisement\n\nInfinitesimal variations in tone and texture were explored, drawing us deep into this meditative realm as the mood gradually darkened. Related Article Melbourne live reviews Even this pop star thinks having her gig at the tennis is a bit weird Swanton’s bass morphed into an insistent buzz, its vibrations merging with Abrahams’ open-pedal piano clusters and Buck’s briskly whisked cymbals. Tranquility gave way to tension, the blood-red stage lights echoing the sense of high drama that was as menacing as it was enthralling. The second set opened in a pool of limpid beauty: exquisitely lyrical piano motifs, reverberant bass and lightly padding toms. Serene, drifting, lovely. Again, the music beckoned and disarmed us, luring us in as the restful sway turned into a more full-bodied swell and then a churning sea. This time, the roiling waves seemed majestic rather than forbidding. Perhaps by now we’d surrendered – no longer caught in the current but letting ourselves be swept along by it, just as the musicians were. Buck’s torso rocked back and forth, embodying the restless energy that coursed through the music. Agitation and abstraction; hallucinatory spirals of sound; and then, as if by magic, the waves subsided and we found ourselves gently carried back to shore.\n\nReviewed by Jessica Nicholas\n\nAdvertisement\n\nTHEATRE\n\nThe Placeholder ★★★\n\nfortyfivedownstairs, until February 8 The shared experience of grief has culminated in many an incisive theatre piece centred on chosen families navigating existential questions of loss, friendship and mortality – Domenica Feraud’s off-Broadway play Someone Spectacular and, closer to home, Ash Flanders’ Malthouse production This Is Living among them. The kitchen of matriarch Pat (Meredith Rogers, centre) becomes the focal point of The Placeholder. Darren Gill Ben MacEllen’s The Placeholder is the latest play to wade into thorny territory. We’re plunged headfirst into 2017, notably the year queer communities were subjected to a postal survey on marriage equality. It’s a devastating time, illustrated by clips of real-life interviews and news segments showcasing the bigotry that was allowed to flourish. United by virtue of Barb’s Bosom Buddies – a fundraising collective dedicated to honouring the memory of namesake Barb, who died of breast cancer – five disparate people in the fictional rural town of South Bend find themselves meeting monthly to brainstorm badges, banners, cookies and muffins.\n\nAdvertisement\n\nRelated Article Performing arts What is it about this show that can prompt a lifetime of obsession? Matriarch Pat (Meredith Rogers) is a soft-spoken retiree whose kitchen becomes the focal point of the play, brilliantly materialised by Bethany J. Fellows’ set design. Helen (Michelle Perera) is a widow with a heart of gold and a penchant for baking. A proud lesbian, Keira (Rebecca Bower) self-medicates with alcohol to withstand living in a cloistered town. Barb’s niece Jo (Brigid Gallacher) is the conservative black sheep of the group. And sporty Nic (Oliver Ayres) used to go by Nicole, until they announce they’re transitioning into a man. The reprisal is swift. The elder members of the group, Pat and Helen, paradoxically take it in their stride, but Keira is incensed by the perceived loss of a lesbian peer, and Jo insists it’s all just a phase. The remainder of the play details the fallout of Nic continuously insisting on his personhood against bad-faith arguments and a gulf of miscomprehensions. As the kindest, most level-headed character, Helen is who most audiences will project themselves onto. But Perera, so brilliant in This Is Living, is also the strongest of the ensemble. Her comedic timing is impeccable as she expertly oscillates between empathetic displays of allyship and perfectly executed moments of humour that imbue the play with levity at key junctures. Pat (Meredith Rogers) and Nic (Oliver Ayres) in The Placeholder. Darren Gill\n\nAdvertisement\n\nFunctioning like a time capsule by virtue of being set nearly a decade in the past, The Placeholder provides a stage for various expressions of acceptance and opposition as the group muddles through supporting Nic. A cookie-cutter bigot, Jo’s views cover well-trodden, odious ground. But it’s Keira’s see-sawing between solidarity and gender essentialism and a self-victimisation that’s impervious to the marginalisation of others that’s harder to stomach – and altogether more interesting. MacEllen presents thought-provoking contrasts between desired gender-affirming care and unwanted life-saving surgery, gender and sexuality, mental deterioration and newly prized lucidity. But at close to three hours, The Placeholder is simply too long. MacEllen’s script retreads familiar ground in the play’s second act, which drags lugubriously to its emotional climax(es). Related Article Exclusive\n\nArts From a New York bathroom to regional Victoria: An exhibition of art’s heavy hitters is on its way The tenuous connecting thread of a makeshift charity doesn’t explain why these characters are so invested in one another, and why they tolerate unconscionable behaviour – particularly from Jo. As a result, the emotional payoffs are muted, hampered further by unnatural, dialogue-heavy exposition and uneven acting during key dramatic reveals. Much is left unresolved by close. Keira’s alcohol addiction continues to be the butt of jokes, Pat’s clear descent into dementia is unremarked upon. String-heavy interludes between scenes are peppered with a greatest hits compilation of what happened in the intervening years – good, bad, ridiculous. But the cacophony, so effective initially in illustrating the overwhelm of the marriage equality vote, overpowers the play by the end.\n\nReviewed by Sonia Nair The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/traveller/travel-news/two-weeks-seven-stops-revived-original-kangaroo-route-takes-off-20260204-p5nzg4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two weeks, seven stops: Revived original ‘Kangaroo route’ takes off",
    "publish_date": "Wed, 04 Feb 2026 13:06:30 +1100",
    "category": "finance",
    "authors": [
      "Ute Junker"
    ],
    "text": "Advertisement\n\nTravel newsAir travel Two weeks, seven stops: Revived original ‘Kangaroo route’ takes off Ute Junker February 4, 2026 — 1:06pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nIt is rare for a boarding announcement to be greeted with cheers, but when Captain’s Choice chief executive Bas Bosschieter announced that QF1337 was ready for boarding this morning, the crowd of 131 passengers at Gate 11 at Sydney’s Kingsford Smith airport hollered their approval. This Sydney to Darwin flight is the first leg in a two-week, seven-stop journey recreating the “Kangaroo Route” launched by Qantas in 1947, so called because of the short “hops” made by aircraft with limited flying range. Flight attendants don vintage Emilio Pucci-designed Qantas 1970s uniforms. Excitement as passengers board the first Kangaroo Route QF1337 flight. To enhance the nostalgic feel, ground staff were clad in vintage Qantas uniforms from the 1970s designed by Emilio Pucci, featuring a fetching floral print for women and a striking orange-jacket-with-mustard-shirt combination for the men.\n\nAdvertisement\n\nBut there are significant differences between this trip aboard the Port Stephens, a chartered Qantas Airbus A330-300, and the journey on the Lockheed L-749 Constellation pioneered in 1947. Sign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now. Back then, the trip from Sydney to London took five days, including 59 hours flying time – a lightning-fast pace when compared with the flying boats of the 1930s, which took twice as long. The route for the journey in 2026. A 1947 poster shows the Lockheed L-749 Constellation that pioneered the Kangaroo Route. The updated itinerary for the Captain’s Choice Pioneering Spirit of the Kangaroo Route journey is a more leisurely experience. Over 14 days it follows an almost identical flight path to the first route wholly operated by Qantas in 1947, with stops in Darwin, Singapore, Kolkata, Colombo, Cairo, Rome and Toulouse.\n\nAdvertisement\n\nMost of the flights will be between three and five hours, with the longest leg, Colombo to Cairo, stretching seven hours and 50 minutes. Only half the onboard seats were made available for sale, ensuring passengers have space to stretch out. The retro-style boarding pass. Ute Junker A Qantas Lockheed Constellation, which used to fly the Kangaroo Route. Captain’s Choice is using a chartered Qantas Airbus A330 for its recreation. Unsurprisingly, many of the passengers willing to shell out for the experience – all-inclusive fares start at $49,950 – are serious aviation nerds. They include Singapore-born Perth resident Keng Wong, whose passion for planes began as a child when his brother would take him to the Paya Lebar airport to watch the aircraft. “I fell in love with the Lockheed Constellation. It had such huge propellors, it made so much noise, it had this dolphin shape and a three-pointed tail,” says Wong, who later spent 25 years working in catering for Qantas.\n\nAdvertisement\n\nWong and his fellow devotees will have plenty of opportunities to get their geek on. Optional activities along the way including a visit to the Darwin Aviation Museum, access to the Singapore Air Show, and a tour of the state-of-the-art facilities at the Jean-Luc Lagardère Final Assembly Line (FAL), a facility of Airbus, France’s leading aerospace company. Entry to one of Egypt’s ancient pyramids among more traditional itinerary items. iStock More traditional sightseeing activities include entry into one of Egypt’s ancient pyramids and an after-hours tour of the Vatican Museums, while cricket fans will meet and chat with a member of Sri Lanka’s 1996 World Cup-winning cricket team. The ambitious one-off itinerary has been a long-term project for the Captain’s Choice chief executive. “We first started talking about this at the end of 2017, with the intention to travel in 2020,” Bosschieter told guests at a pre-flight dinner at the Sydney Opera House on Tuesday night. A pre-launch performance of “I Still Call Australia home” by the Australian Girls’ Choir.\n\nAdvertisement\n\nWendy Miles, daughter of Qantas co-founder Sir Wilmot Hudson Fysh, recalls flying the route as a 17-year-old to Bas Bosschieter. Although a planned flyover by a Lockheed L-1049 Super Constellation aircraft was cancelled at the last minute due to airspace restrictions, guests enjoyed a performance by the Australian Girls’ Choir (inevitably the set list featured I Still Call Australia Home) and an interview with Wendy Miles (nee Fysh), the daughter of Qantas co-founder Sir Wilmot Hudson Fysh. Related Article Air travel The most unusual planes airlines are still flying Miles recalled travelling the Kangaroo Route in 1947 as a 17-year-old girl. “It was the first flight I went on and everybody was dressed up. All the women were in hats and gloves and all the men were in suits.” Today’s passengers may not quite meet those sartorial standards but they are guaranteed attentive service with 12 Qantas staff on board including captains, cabin crew, an engineer, and catering staff. The dining experience is also elevated, with all passengers enjoying business-class menus. On the Sydney to Darwin leg, the choice of mains included croque monsieur, gruyere and mushroom quiche and a lamb and rosemary pie with mushy peas and crispy potatoes. The writer is travelling as a guest of Captain’s Choice.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/why-is-one-nation-suddenly-so-popular-20260204-p5nzj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why is One Nation suddenly so popular?",
    "publish_date": "Wed, 04 Feb 2026 13:03:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Why is One Nation suddenly so popular?\n\nWhat's the deal with One Nation and why is it suddenly so popular? Nine.com.au explains the rise of Pauline Hanson.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-afterglow-20260203-p5nz5c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you’re after a Heated Rivalry fix in the flesh, look no further",
    "publish_date": "Wed, 04 Feb 2026 13:01:46 +1100",
    "category": "sports",
    "authors": [
      "Cameron Woodhead",
      "Andrew Fuhrmann"
    ],
    "text": "Advertisement\n\nCultureLive reviewsMelbourne live reviews If you’re after a Heated Rivalry fix in the flesh, look no further Cameron Woodhead and and Andrew Fuhrmann Updated February 4, 2026 — 1:01pm ,first published February 3, 2026 — 3:37pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nKey points THEATRE: Tastefully erotic, Afterglow at Chapel Off Chapel explores polyamory\n\nDANCE: Songs of the Bulbul draws inspiration from the Sufi myth of the caged nightingale\n\nTHEATRE\n\nMIDSUMMA | Afterglow ★★★★\n\nChapel Off Chapel, until February 21 Gay sex has a pop-cultural currency that would have been unimaginable a decade ago. Think of all those comments about Heated Rivalry clogging up your feed. It can’t be only gay and bisexual men who were aroused by raunchy encounters between closeted hockey players in the show, or it wouldn’t have been such a huge phenomenon. In fact, women consume almost half of all gay male porn on Porn Hub, and as we enter an age of increasing heteropessimism, it seems homoeroticism has become flavour of the month. Matthew Mitcham (left) and Matthew Predny in a scene from Afterglow. Cameron Grant That’s good news for S. Asher Gelman’s Afterglow. The play bears the tagline “the climax is just the beginning”, and true to its word, starts in flagrante, with a gay male threesome nuzzling and pashing each other, post-coitally entwined. If you’re jonesing for a Heated Rivalry fix in the flesh, look no further. The show comes fully stocked in the eye candy department, with liberal displays of full-frontal male nudity (the most I have seen onstage since Puppetry of the Penis).\n\nAdvertisement\n\nAll three actors are intimidatingly hot and ripped. Gym-toned physiques. Washboard abs. Bubble butts. And the characters are unabashedly sexual, with tastefully choreographed erotica underpinning Gelman’s relationship drama. Scientist Alex (Julian Curtis) and his theatre director husband, Josh (Matthew Mitcham – yes, the Olympic gold medallist), are a Manhattan gay couple in an open marriage. Afterglow is non-judgmental about the various forms contemporary relationships may take. Cameron Grant They seem to have it all. They’re handsome, successful and loaded – and they have a commitment to starting a family together, expecting their first child via surrogacy in a few months. Their equilibrium is fractured when Josh desires something more than a casual fling with their latest playmate, Darius (Matthew Predny), a younger massage therapist.\n\nAdvertisement\n\nAlex consents to his partner’s new “friend with benefits” arrangement, with a veto if it starts to make him feel threatened or uncomfortable. Josh fails to inform his husband of a crucial detail, while seeking to avoid confronting marital difficulties or disappointments in his newfound passion for Darius. Darius genuinely falls for Josh and is torn between desire for what he cannot have and appal that the love triangle he’s entered is causing unintended distress. Related Article Lunch with ‘Nourishes my soul’: The side gig Matthew Mitcham swears by The set is modular genius that’d put IKEA designers to shame (and allows for steamy shower scenes). And the performances are strong and likeable, lending a charismatic gloss to the unfolding melodrama, even if the underlying emotional dynamics aren’t always fully and precisely articulated. As an examination of modern polyamory, the play is a touch predictable and superficial for my taste. Yet it does have the advantage of being broadly relatable – whether you’re gay or straight or something in between – and remains non-judgmental about the various forms contemporary relationships may take. If there’s a message, it’s that you can get hurt no matter what kind of romance your heart leads you to pursue. You’ll be forgiven if you get distracted from it, though, by the sensuality of the sex scenes and the way Afterglow plugs so directly into the homoerotic zeitgeist.\n\nReviewed by Cameron Woodhead\n\nAdvertisement\n\nDANCE\n\nSongs of the Bulbul ★★★\n\nPlayhouse, Arts Centre Melbourne, until February 7 The UK-based Aakash Odedra is a superb dancer. His emotional intensity and poetical abundance feel almost radical in the world of contemporary concert dance. He’s a proper phenomenon and still very much in the prime of his career. Aakash Odedra performs in Songs of the Bulbul Angela Grabowska For Songs of the Bulbul he has teamed up with choreographer Rani Khanam to make an hour-long solo from the Sufi myth of the caged nightingale or bulbul. The more the bird suffers, goes the story, the more beautiful its song. The result is a tour de force: a moody, mettled drama that slips between plain statement and lyric suggestion. It is yearning and inward but with plenty of athletic excitement in the combination of rapid Kathak footwork and the loosened spinning of the Sufi dervishes.\n\nAdvertisement\n\nIn the beginning, Odedra ranges freely across the stage, buoyant and smiling, skirts flaring into blurred halos, bare feet snapping lightly at the floor. Birdlike figurations, with quicksilver movements of head and hand, connect cleanly with happy leaps and turns. Related Article Melbourne live reviews This is about the best version of Pirates of Penzance you could see The pathways of movement become narrower as the cage descends. The bird strains against captivity, projecting anguish: arms reach upward, palms open, sometimes pleading, sometimes offering. The light begins to dwindle and flicker as Odedra collapses, clutching at the red confetti that swirls around him. The soundtrack, by composer Rushil Ranjan, is epic: thunderous percussion, tinkling music-box phrases, blanketing strings and soaring arias. Select UK performances reportedly featured a full live arrangement. One can only imagine the immersive force of such an event. Here, pre-recorded, the intensity is still formidable. Indeed, sometimes, with the strings building and building and building, it all becomes too much, too busy, too alarming.\n\nAdvertisement\n\nAt the show’s climax the bird has its eyes removed. This moment is staged with clarity and admirable restraint. It’s the quietest passage, wisely, and therefore the most concentrated. The tragedy lands with the barest ornament, its awful resonance unimpeded. Coming down from that is hard. The closing scenes, for me, fall into something a little too gimmicky: standing before a bank of electric candles, Odedra gestures here and there, lighting the lights and dousing them as if by the magic of the suffering he has just passed through. Still, in Melbourne right now there are few chances to see an international touring dance artist at all, let alone one of this calibre, moving across traditions with such total imaginative surrender and generosity of feeling.\n\nReviewed by Andrew Fuhrmann The Booklist is a weekly newsletter for book lovers from Jason Steger. Get it delivered every Friday.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-fall-as-wall-street-scuffles-gold-silver-rebound-20260204-p5nzcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher as miners surge; tech shares slump",
    "publish_date": "Wed, 04 Feb 2026 12:42:27 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX edges higher as miners surge; tech shares slump Staff reporter Updated February 4, 2026 — 12:42pm ,first published February 4, 2026 — 5:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket had climbed into positive territory by lunchtime with mining stocks sharply higher, but technology stocks are weighing on the bourse. After opening lower, the S&P/ASX 200 was 17.1 points, or 0.2 per cent higher, at 8874.2 points in early afternoon trade, with eight of 11 industry sectors in the red. Wall Street is in reverse on Tuesday. AP Mining stocks are sharply higher, with gold and silver rebounding overnight to continue their wild swings in recent days. Among gold miners, Northern Star soared 6.2 per cent and Evolution Mining climbed 2.3 per cent, while silver giant South32 rose 3.6 per cent. A jump in copper prices boosted the iron ore heavyweights, with BHP bouncing 3.8 per cent, Rio Tinto surging 3.6 per cent and Fortescue 1.3 per cent higher. Financial stocks have trimmed some of their early losses, with Commonwealth Bank dipping 0.1 per cent in early afternoon trade, while Westpac has shed 1 per cent and ANZ Bank was 0.9 per cent lower. National Australia Bank has climbed into the green to be 0.2 per cent higher. All four banks have said they will pass on the Reserve Bank’s interest rate rise in full, the first hike in more than two years.\n\nAdvertisement\n\nRelated Article Opinion\n\nCurrencies Trump’s vulnerable America is a target for China Stephen Bartholomeusz Senior business columnist Local technology shares slumped after heavy falls on Wall Street’s Nasdaq overnight, with Xero diving 12.2 per cent, WiseTech tumbling 8.6 per cent and TechnologyOne diving 8.1 per cent. Energy stocks advanced as oil prices strengthened. Woodside Energy added 2.1 per cent, Santos jumped 2.5 per cent and Yancoal was 3.1 per cent higher in early afternoon trade. The Australian dollar was trading at at US70.28¢ at 12.38pm AEDT. Overnight, the S&P 500 fell 0.8 per cent and pulled further from its all-time high set last week. The Dow Jones dipped 166 points, or 0.3 per cent, and the Nasdaq composite sank 1.4 per cent.\n\nAdvertisement\n\nSeveral influential Big Tech stocks weighed on the market, including drops of 2.8 per cent for Nvidia and 2.9 per cent for Microsoft. Such giants have been hampered by worries that their stock prices shot too high and became too expensive following their years-long dominance of the market. Stocks of software companies and others seen as potential losers to competitors powered by artificial intelligence also slumped. ServiceNow fell 7 per cent to bring its loss for the young year so far to 28.3 per cent. Such declines dragged the S&P 500 to its fourth loss in the last five days, even though the majority of stocks in the index rose. That included a 6.8 per cent climb for Palantir Technologies, which reported a bigger profit for the latest quarter than analysts expected. Its forecast for 61 per cent growth in revenue this year also topped analysts’ expectations. Some of the day’s strongest action remained in the metals markets. Gold’s price climbed 6.1 per cent to settle at $US4935.00 per ounce in the latest swing since its jaw-dropping rally suddenly halted last week. Silver’s price, which has been whipping through even wilder moves, rallied 8.2 per cent. Gold and silver prices had been climbing for more than a year as investors looked for safer places to park their cash amid worries about everything from tariffs to a weaker US dollar to heavy debt loads for governments worldwide. Their prices took off in particular last month, and gold’s price at one point had roughly doubled over 12 months.\n\nAdvertisement\n\nBut those rallies suddenly gave out last week, and gold’s price dropped from close to $US5600 to less than $US4500 on Monday. Silver plunged 31.4 per cent on Friday alone. Many traders say that what turned the momentum was expectations that President Donald Trump’s nominee to lead the Federal Reserve will keep interest rates high to fight inflation, though some disagree. Most agree that simple gravity took over afterward. After gold and silver prices had shot up so much, so quickly, they were bound to fall back at some point, particularly with so many investors piling in to gold as a way to bet on continued weakness for the US dollar. “The move underscored how stretched anti-USD positioning had become,” according to strategists at Barclays. On Wall Street, PayPal dropped 20.3 per cent after reporting weaker results for the latest quarter than analysts expected. It also named a new CEO after it said “the pace of change and execution” over the last two years “was not in line” with the board of directors’ expectations.\n\nAdvertisement\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/companies/strickland-discovery-fires-up-a-55m-growth-push-in-serbia-20260204-p5nzi1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Strickland discovery fires up a $55m growth push in Serbia",
    "publish_date": "Wed, 04 Feb 2026 12:28:14 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Strickland discovery fires up a $55m growth push in Serbia Brought to you by BULLS N’ BEARS Rowena Duckworth February 4, 2026 — 12:28pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStrickland Metals has lit up its Serbian Rogozna project with a fresh high-grade gold-copper discovery, immediately loading the war chest with a $55 million capital raise to accelerate drilling and development studies. The one-two punch signals a clear shift from discovery mode to development intent, with drilling success now matched by the funding firepower to accelerate growth. Core from Strickland Metals’ Red Creek discovery at Rogozna in Serbia showing massive chalcopyrite mineralisation in contact with carbonate. The discovery was made at the Red Creek prospect, about 1km west of the company’s 5.3-million-ounce gold equivalent Shanac deposit. Initial drilling has intersected both shallow epithermal gold mineralisation and deeper skarn-hosted gold and base metals zones - a geological mix that mirrors other major deposits across the Rogozna system. The standout discovery hole delivered numerous zones of mineralisation, including a solid 4.0 metres running at an impressive 4.0 grams per tonne (g/t) gold equivalent from 44.0m and a deeper interval of 53.0m at 2.3g/t gold equivalent from 514.4m.\n\nAdvertisement\n\nWithin that deeper 53m zone, the drill bit threw up a 35-metre wide, higher-grade core, running 3.1g/t gold equivalent, including a thick 4.4-metre slice at a stellar 8.9g/t gold equivalent at 522.0m, followed by another hefty 5.8-metre interval grading 4.5g/t gold equivalent from 536.7m. Importantly, Red Creek sits on the same structure that hosts the Copper Canyon deposit, about 1.5km along strike, opening up a new corridor of exploration ground between Copper Canyon and Shanac that has seen little drilling to date. Mineralisation at Red Creek remains open along strike and at depth, with assays pending from several additional holes. Strickland managing director Paul L’Herpiniere said: “Our world-class team in Serbia have done it again, with exploration drilling at Red Creek, just 1km from our cornerstone Shanac Deposit, delivering a new high-grade discovery. This is an exciting development which reinforces the highly endowed nature of the mineral system at Rogozna and offers an exciting new focal point for resource growth.” Hot on the heels of the discovery, Strickland moved to lock in funding, announcing a $55m institutional placement priced at 16 cents per share. The raise will fund an additional 70,000m of drilling across Rogozna in 2026 and support delivery of a pre-feasibility study targeted for the first half of 2027. Backing the story is some heavyweight support. Global mining major Zijin Mining Group has committed $5m to the placement, lifting its stake in Strickland to four per cent. The endorsement from one of the world’s largest copper and gold producers adds serious credibility to Rogozna’s development pathway and underlines the project’s strategic appeal as drilling success continues to stack up.\n\nAdvertisement\n\nStrickland’s $55 million funding package will bankroll one of the most aggressive exploration campaigns ever mounted in the Balkans, with a massive 70,000m drilling program planned across Rogozna through this year. The drilling will serve the dual purpose of tightening up and upgrading resources at Shanac, Gradina and Copper Canyon, while simultaneously chasing growth at the new Red Creek discovery and testing fresh targets across the broader system. Crucially, the scale and structure of the program are designed to fast-track Rogozna towards development, feeding directly into an internal scoping study in the first half of this year and a full pre-feasibility study targeted for the first half of 2027. This will deliver Strickland’s first detailed economic picture of Rogozna, including costs, production profiles and project returns - the kind of milestone that typically unlocks institutional backing and strategic interest, provided the geology stacks up. With gold running hot, copper tightening and a $55m war chest locked in, Strickland now has both the discoveries and the firepower to push Rogozna hard. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/hector-s-deli-opens-a-second-little-collins-street-store-in-the-former-le-shoppe-site-20260204-p5nzh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hector’s Deli opens a second Little Collins Street store in the former Le Shoppe site",
    "publish_date": "Wed, 04 Feb 2026 12:08:32 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe sleek new outpost is at the other end of the CBD eat street.\n\n1 / 7 Hector’s Deli’s sleek new site on Little Collins Street. Supplied 2 / 7 Classics like the rare beef sandwich are still on the menu.. Cheyne Toomey 3 / 7 Located in Scott Pickett’s former Le Shoppe site. Supplied 4 / 7 Chicken salad sandwich. Hctor's Deli supplied Cheyne Toomey 5 / 7 Inside the new shop. Supplied 6 / 7 The sausage muffin at Hector’s Deli gives Macca’s a run for its money. Supplied 7 / 7 Some seating is available inside. Supplied Previous Slide Next Slide\n\nContemporary$$$$\n\nNearly two years after arriving at the Paris end of the CBD, sandwich supremo Hector’s has opened yet another outpost on Little Collins Street. Located between Queen and William Streets in Scott Pickett’s former Le Shoppe site, the sleek new location is serving all of Hector’s signatures plus seasonal specials. Join the queue to take away or nab one of the few stools inside.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/unions-leads-push-for-tradies-to-stop-work-in-extreme-heat-20260204-p5nzhn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unions leads push for tradies to stop work in extreme heat",
    "publish_date": "Wed, 04 Feb 2026 12:06:40 +1100",
    "category": "finance",
    "authors": [],
    "text": "Unions leads push for tradies to stop work in extreme heat\n\nA peak union body is pushing for a new national safety standard to allow tradies and other workers to automatically stop work when it gets too hot.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/e-bikes-swarm-sydney-harbour-bridge-in-wild-footage-20260204-p5nzgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "E-bikes swarm Sydney Harbour Bridge in wild footage",
    "publish_date": "Wed, 04 Feb 2026 12:06:35 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/defence-offloading-islands-golf-courses-barracks-to-be-sold-raising-2-billion-20260204-p5nzdv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Defence to sell islands, golf courses and barracks, raising $2 billion",
    "publish_date": "Wed, 04 Feb 2026 11:59:59 +1100",
    "category": "finance",
    "authors": [
      "Matthew Knott"
    ],
    "text": "Advertisement\n\nUpdated PoliticsFederalDefence Defence to sell islands, golf courses and barracks, raising $2 billion Matthew Knott Updated February 4, 2026 — 11:59am ,first published February 4, 2026 — 10:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA dramatic sale of 35,000 hectares of defence real estate – including some of the nation’s most historic barracks – is expected to raise almost $2 billion to be ploughed back into new military equipment and upgrades to essential bases. Islands, golf courses, rifle ranges, office buildings and training depots across the country will be sold under the Albanese government’s long-awaited response to a sweeping audit of the nation’s defence estate portfolio. Defence Minister Richard Marles and Assistant Defence Minister Peter Khalil announce the major sale of Defence property. Dominic Lorrimer The government has decided to stare down opposition to sell-offs from the military establishment, which has jealously guarded its access to prized sites. The release of the government’s response to the audit has been delayed by over two years as it braces for blowback from veterans and local communities to the sale of some of the country’s most iconic defence facilities.\n\nAdvertisement\n\nThis masthead revealed on Wednesday that the Victoria Barracks sites in Sydney, Melbourne and Brisbane will be sold, opening up the possibility of housing developments in inner-city areas. Defence Minister Richard Marles said the government was undertaking the “most significant reform to Australia’s defence estate in our nation’s history”. “The heritage value of these properties does not belong to the Australian Army or, for that matter, the Australian Defence Force. It belongs to the Australian people,” Marles said. “And right now, the Australian people are prevented from seeing these properties, they exist behind a defence wall.” Acknowledging the long delay between receiving the audit and releasing a response, Marles said: “It has taken time because it has been difficult. This is a challenging issue.”\n\nAdvertisement\n\nRelated Article Exclusive\n\nDefence Historic buildings, prime real estate: Defence ready to sell off Victoria Barracks in Sydney, Melbourne and Brisbane Sixty-seven defence sites will be fully or partially sold – including the birthplace of the Royal Australian Air Force in Victoria and the army’s headquarters in Sydney – by the Department of Finance, with an estimated sale price of $3 billion. Relocating staff and remediation works ahead of sale could cost as much as $1.2 billion, meaning net proceeds of up to $1.8 billion are expected from the divestments. The government also expects to save $100 million a year by reducing maintenance costs. All the money raised from the sales, which are expected to take years to complete, will be reinvested into defence. Asked about the scope to expand the supply of housing by selling defence sites, Marles said: “I expect that housing will be part of the opportunity that is created here, but I want to be really clear: that’s not why we’re doing this.\n\nAdvertisement\n\n“This is around making sure we have a defence estate which is properly attuned to the capabilities of the Australian Defence Force, and that we are not wasting money on property which gives no capability benefit.” Finance Minister Katy Gallagher said the asset sales would be decided on a case-by-case basis. “I mean, there are some prime locations. I imagine there will be a lot of interest and a lot of views about what it can be used for,” she said. “I’m hopeful some of that would be for housing, but it really is to be determined, and no decisions have been made.” Assistant Defence Minister Peter Khalil said he was shocked to recently visit a vacant training depot in Penrith, in western Sydney, which had cost $1 million over six years to maintain but was strewn with rubbish and covered in graffiti.\n\nAdvertisement\n\nMeanwhile, he said, some salubrious facilities “have grass tennis courts that rival Wimbledon, manicured lawns, sprawling golf courses, but they are also not meeting the operational and capability requirements for our ADF”. The audit, conducted by former Defence Housing Australia managing director Jan Mason and Infrastructure Victoria chair Jim Miller, found the defence estate is riddled with waste and that tough decisions are required to ensure taxpayer money is being spent wisely. “It is very clear and widely acknowledged that Defence does not need and cannot afford all of the current estate,” Mason and Miller wrote in their audit report, delivered to the government in December 2023. “Underutilised portions of the Defence estate are draining resources from higher priority needs. Sustainment budgets as they relate to this part of the estate are stretched too thinly, resulting in critical failures and costly unscheduled repairs.” The auditors acknowledged that their recommendations “are likely to evoke strong emotions associated with its history, scale and diversity”.\n\nAdvertisement\n\nA government source, speaking on condition of anonymity to discuss sensitive matters, said taxpayers had been “pissing money up against a wall and it needs to stop”. In NSW, the sites to be sold include: Victoria Barracks, Paddington\n\nLancer Barracks, Parramatta\n\nHMAS Penguin (partial sale)\n\nRandwick Barracks (partial sale)\n\nRAAF Glenbrook\n\nSpectacle Island\n\nAdvertisement\n\nIn Victoria, the sites include: Latchford Barracks\n\nNewland Barracks\n\nRAAF Williams, Point Cook\n\nRAAF Williams, Laverton (partial)\n\nDefence site Maribyrnong\n\nVictoria Barracks In Queensland, the sites include: St Lucia Training Depot\n\nMount Isa Rifle Range\n\nVictoria Barracks\n\nAdvertisement\n\nIn Western Australia, the sites include: Irwin Barracks\n\nLeeuwin Barracks More to come. Cut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/business/workplace/the-end-of-the-executive-assistant-corporate-australia-shifts-job-to-the-philippines-20260204-p5nzdl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The end of the executive assistant? Corporate giant shifts roles to the Philippines",
    "publish_date": "Wed, 04 Feb 2026 11:59:14 +1100",
    "category": "finance",
    "authors": [
      "Millie Muroi"
    ],
    "text": "Advertisement\n\nBusinessWorkplaceWorkplace The end of the executive assistant? Corporate giant shifts roles to the Philippines Millie Muroi February 4, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nExecutive assistants will all but disappear from the offices of one of Australia’s largest consultancy firms to be replaced by remote workers dialling in from the Philippines as the firm cuts costs. Once widespread throughout white-collar workforces in the mid-20th century, only the most senior staff at KPMG will retain Australian-based executive assistants after the planned transition, representing about a fifth of the number it once employed here. Executive assistant jobs have been cut in Australia and sent offshore by KPMG. Eamon Gallagher Under the proposal leaked to corporate gossip Instagram page The Aussie Corporate, there would be a phased approach, with 100 roles shunted from Australia to the Philippines in April and a further 100 across May and June.\n\nAdvertisement\n\nThe cost-cutting measure, also aimed at improving consistency of service across the business, comes as demand for consulting services has dropped off among the big-four consulting firms. In the year to June 2025, KPMG reported revenue of $2.3 billion: slightly lower than the previous year, while remuneration for its partners grew 10.3 per cent. Nicole Gorton, executive recruitment director at recruitment agency Robert Half, said offshoring can be successful in some cases where work is highly repetitive. “Where it’s very administrative task heavy, such as triaging emails or formatting documents and entering data, that’s when we’re seeing [these jobs] be offshored,” she said. “That’s where organisations see that they can have cost benefit by offshoring.” However, Gorton said it is more difficult for organisations where the assistant is involved in strategy, execution, decision-making and stakeholder engagement. “These responsibilities require deep knowledge of the business and local stakeholder understanding,” she said. “The EA role has evolved to being a strategic partner who often has input in conversations and decisions. Proximity matters in these cases, and EAs are often the glue to the business.”\n\nAdvertisement\n\nGorton said offshoring tends to be cyclical, but that she has seen an increasing number of jobs being outsourced over the past decade. “A company might do an offshoring project that will be sustainable for a period of time, and then the people in the weeds of managing the offshoring relationships have challenges,” Gorton said. “But most definitely, offshoring has been happening at a larger scale.” Job ad data from employment marketplace Seek shows personal assistant, executive assistant and secretarial roles have been declining steadily for the past few years. As of December, these roles declined 18 per cent over the year, while wider administration and office support industry roles fell 7 per cent over the same time period and job ads more widely dropped 4 per cent. KPMG Australia last year conducted its own analysis of the fastest growing jobs and those “going extinct”, noting some occupational groups had seen sharp declines in workers.\n\nAdvertisement\n\n“The number of executive assistants fell by more than 20 per cent to 82,300 over the past decade due to the automation of administrative functions through smartphones and apps,” it said. While roughly 65 of KPMG’s EA roles would remain in Australia, the scope of services covered by every role will change with updated position descriptions. Related Article Unfair dismissal Employee sacked for failing to return to office despite contract allowing WFH The final decision on KPMG’s proposal, which is subject to consultation with impacted employees, will take place in early- to mid-March, with the firm looking to redeploy as many people as possible to other roles within the business. A spokeswoman for KMPG said consultation with its people was ongoing as the firm moved away from the practice of doing everything in-house.\n\nAdvertisement\n\n“We are continually evolving the way we work to build a scalable, modern, resilient business that positions us for growth and competitiveness,” she said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/technology/why-elon-musk-just-created-a-1-8-trillion-space-monster-20260204-p5nzdj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Elon Musk just created a $1.8 trillion space monster",
    "publish_date": "Wed, 04 Feb 2026 11:58:55 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Advertisement\n\nTechnologyMergers & acquisitions Opinion Why Elon Musk just created a $1.8 trillion space monster Stephen Bartholomeusz Senior business columnist February 4, 2026 — 11:58am\n\nFebruary 4, 2026 — 11:58am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLast year, Elon Musk’s xAI artificial intelligence start-up bailed out investors in X, his social media platform. Then Musk’s Tesla pumped $US2 billion ($2.85 billion) into xAI, which was burning more than $US1 billion of cash a month. Now he’s caused SpaceX to merge with xAI in a deal valuing the combined businesses at $US1.25 trillion ($1.8 trillion). See the pattern? As one of the companies he controls needs cash, he turns to another that has it. When that proves insufficient, he has looked to one of the two most valuable companies within his orbit – one without the approvals and governance complexities of Tesla – to bail them out. Elon Musk is known for his outlandish plans. AP There was speculation that it would be Tesla that would acquire xAI but, while Tesla has about $US44 billion of cash in its balance sheet, the switch of focus from producing electric vehicles to robotaxis and robots that Musk revealed last month and the cashflow-negative impact of the $US20 billion investment that entails probably ruled it out, at least this time. SpaceX planned a float this year, with a mooted valuation of about $US800 billion, which would raise about $US50 billion of cash from new investors. Some of that cash will now be available to xAI.\n\nAdvertisement\n\nThe merged group’s valuation of $US1.2 trillion represents a big lift from the most recent valuations of its components as, just over a year ago, the merged xAI and X was deemed to have an equity value of about $US113 billion and a $US20 billion capital raising last month was struck at a valuation of $US230 billion. Related Article Opinion\n\nAI Robots, redundancies and runaway spending: Not all AI hits the mark Elizabeth Knight Business columnist For the purposes of the merger, xAI is now valued at $US250 billion, while SpaceX’s value has jumped to $US1 trillion and there’s talk of the IPO producing a $US1.5 trillion valuation. The numbers, and their escalation, are mind-blowing, but so are artificial intelligence’s appetite for capital and Musk’s visions. xAI is one of the minnows competing with giants in the hugely capital-intensive race to stake out a position in AI.\n\nAdvertisement\n\nWhere giants like Google, Amazon, Meta and Microsoft have torrents of cashflow from their legacy businesses to fund the hundreds of billions of dollars they are ploughing into AI – and even they are now having to raise external debt because of the scale of the spending on training large language models and building data centres – start-ups like xAI, OpenAI and Anthropic are reliant on seemingly endless rounds of equity raisings (and, increasingly, debt issues) at ever-greater valuations. The sector’s insatiable appetite for capital has outstripped the capacity or willingness of equity markets to supply it, hence the increasing levels of debt in the sector and the incestuous deals between its participants. Musk himself said the rationale for the merger was that, within two or three years, the least expensive way to do AI computations would be in space. AP On some estimates, the four or five heavyweight players in the sector will spend about $US500 billion over the next three years. It wouldn’t surprise if it were significantly more. This is an extraordinary period of highly focused and extraordinarily capital-intensive industry development. At some point, perhaps quite soon, there’ll be either a consolidation of the sector or a wipeout of its weaker players.\n\nAdvertisement\n\nA puncturing of the ever-inflating, and arguably already highly inflated, valuations would force rationalisation (and cause a lot of pain for the companies and their investors and lenders) if the equity spigot were turned off. Related Article Analysis\n\nAI ‘Absolute nightmare’: The social network where AI chatbots exchange ideas and gossip about humans With the enlarged SpaceX not the only big AI-tinged float planned for this year – OpenAI and Anthropic have theirs on drawing boards – the market’s willingness to continue to support financial models that involve massive outlays today for uncertain returns in three, four or five years’ time will be stress-tested. That’s why, as was the case when xAI was used to bailout investors in X (who were badly underwater on their investments), Musk has turned to SpaceX and its ability to raise a very big lump of cash – at $US50 billion, an IPO equity raising would be the biggest in history, dwarfing the $US29 billion raised by Saudi Aramco in 2019 – just to keep xAI in the game. The industrial logic for combining Space X with xAI is thin.\n\nAdvertisement\n\nThere are not many synergies between launching rockets and operating a network of satellites, an AI start-up that lags its competitors and a controversial social media platform where the interest on its debt absorbs roughly half its revenues. xAI’s Grok chatbot doesn’t have the users or financial backers (almost the entire AI sector) that OpenAI’s ChatGPT has, nor the distribution platform of Google’s Gemini or the corporate acceptance of a rival start-up, Anthropic (which moved markets with the release of new AI productivity tools on Tuesday). xAI is getting a helping hand. Bloomberg SpaceX said it was acquiring xAI to “form the most ambitious, vertically-integrated innovation engine on (and off) Earth, with AI, rockets, space-based internet, direct-to-mobile communications and the world’s foremost real-time information and free speech platform.” Musk himself said the rationale for the merger was that, within two or three years, the least expensive way to do AI computations would be in space.\n\nAdvertisement\n\nHe envisages putting AI data centres into space on SpaceX’s rockets and said there would be cost efficiencies that would enable innovative companies to train their models and process data at unprecedented speeds and scales. “This marks not just the next chapter but the next book in SpaceX and xAI’s mission: scaling to make a sentient sun to understand the universe and extend the light of consciousness to the stars,” he said, whatever that means. Maybe the future of AI and the data centres needed to support it lies in space, but Musk seems to have skated over the logistics and costs of building something in space that is already stretching, to their limits, AI companies on Earth. The sector’s insatiable appetite for capital has outstripped the capacity or willingness of equity markets to supply it, hence the increasing levels of debt in the sector and the incestuous deals between its participants. There is some financial logic to the combination, given that SpaceX is cashflow positive – it appears to have generated more than $US2 billion of positive cashflow last year and is on a steeply rising curve – while xAI churned through $US9.5 billion in the first nine months of last year at an annualised rate of more than $US12.5 billion.\n\nAdvertisement\n\nIt appears obvious, however, that the capital SpaceX raises in its IPO will be quickly devoured by xAI unless the industry trend of capital expenditures rising at a much greater rate than revenues can be reversed. Related Article Opinion\n\nBillionaires Why Australian billionaires are falling behind their uber rich peers Elizabeth Knight Business columnist Musk does, of course, still have Tesla, valued by the market at more than $US1.5 trillion, that he could merge into a Musk Inc conglomerate if he needs more cash (and if its change in strategy from EVs to robotaxis and robots produces cashflows and earnings to validate the valuation). On his track record, such a merger appears quite a likely eventuality, particularly if xAI’s demands for cash outstrip SpaceX’s ability to generate it. Musk’s “vision” for SpaceX appears fanciful. He has, however, demonstrated a remarkable capacity to convince investors to capitalise his visions.\n\nAdvertisement\n\nData centres in space, transported by SpaceX rockets, fed by xAI’s models that have trained on X’s data, perhaps with some future input from Tesla’s engineers and with roles for its robots? It all sounds fantastical but, if he gets a $US1.5 trillion valuation for SpaceX in its float, it would signal that there are plenty of investors who think his vision can be realised. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/lifestyle/influencer-faces-backlash-after-freeze-drying-late-dog-20260204-p5nzh8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Influencer faces backlash after freeze-drying late dog",
    "publish_date": "Wed, 04 Feb 2026 11:51:18 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/how-what-you-eat-affects-your-cancer-risk-20260203-p5nz65.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How what you eat affects your cancer risk",
    "publish_date": "Wed, 04 Feb 2026 11:45:00 +1100",
    "category": "lifestyle",
    "authors": [
      "Nina Agrawal"
    ],
    "text": "Advertisement\n\nLifestyleHealth & wellnessCancer How what you eat affects your cancer risk Nina Agrawal February 4, 2026 — 11:45am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOver decades, a growing body of literature has shown clear links between what we eat and how likely we are to develop various cancers. In recent years, the research has moved away from the impact of individual “superfoods” and antioxidants to focus on how overall, long-term dietary habits affect risk. That’s not to say that any individual cancer diagnosis can be blamed on someone’s diet; cancer, after all, arises as a result of a large constellation of factors – and it occurs in people who make healthy choices. Decades of research suggests that your diet can influence the risk of various cancers. Getty Images/iStockphoto But on a population level, there are some trends in the data. Here’s what we know. Prioritise plants\n\nAdvertisement\n\nEating patterns that emphasise whole grains, fresh fruits and vegetables, and lean or plant-based proteins have shown the most consistent association with a lower risk of cardiovascular disease, diabetes and cancer. One reason may be that people who follow these eating patterns have lower levels of insulin and inflammation, said Fred Tabung, who studies diet, metabolism and cancer at the Ohio State University College of Medicine and Comprehensive Cancer Centre. Related Article Health This little organ is rarely thought about – and it’s costing lives Chronically high levels of insulin and inflammation are key features of obesity and metabolic syndrome, which mediate cancer risk. High insulin and inflammation also promote unnecessary cell division, cell growth, DNA damage and the inhibition of cell death, which are all hallmarks of cancer, Tabung said. Whole grains, fresh fruits and vegetables, and legumes and nuts contain lots of dietary fibre, which has been associated with lower cancer risk. This may be because fibre helps speed stool along the digestive tract, limiting exposure to carcinogens, and because it feeds microbes in the gut that help protect against inflammation, said Dr Kimmie Ng, associate chief of the division of gastrointestinal oncology at Dana-Farber Cancer Institute in Boston. Tabung added that leafy, green vegetables like lettuce, kale, spinach and arugula, and dark yellow vegetables like carrots, yams and squash, when part of a broader dietary pattern, appeared to promote lower levels of insulin and inflammation.\n\nAdvertisement\n\nChoose your meat carefully The International Agency for Research on Cancer has labelled processed meat like bacon, salami and hot dogs as carcinogenic to humans. The agency has said red meat is “probably carcinogenic” due to limited but strong evidence. Research has shown that the type of iron in red meat, as well as the chemicals formed when red meat is cooked at high temperatures, for example during grilling and smoking, produce compounds involved in DNA damage. Nitrates and nitrites in processed meats have also been strongly associated with cancer. Nutrition and cancer researchers recommend avoiding processed meats altogether, and limiting red meat to two to three servings per week. If you are going to grill, use an acidic marinade, like one that’s citrus- or vinegar-based, as that can help reduce the amount of carcinogens formed, said Carrie Daniel-MacDougall, a professor of epidemiology at The University of Texas MD Anderson Cancer Centre. Or instead eat fish, which may independently lower cancer risk, said Dr Andrew Chan, a gastroenterologist at Mass General Brigham. Limit ultra-processed foods There is increasing evidence linking ultra-processed foods, including sugar-sweetened beverages, to cancer. One reason might be that they tend to be high in sugar and calories, which can contribute to insulin resistance and obesity. But lab studies also suggest that chemicals in these foods alter the balance between “good” and “bad” gut microbes and damage the gut lining, promoting inflammation, Chan said.\n\nAdvertisement\n\nA recent study of a large French cohort showed that several common preservatives increased the risk of all cancer, and particularly breast and prostate cancer. About a third of the preservatives that subjects consumed came from ultra-processed foods, but they were also found in alcohol, dried or canned fruits, and packaged vegetables. Related Article Nutrition Can we call butter and beef tallow ‘healthy fats’? You can limit your intake of preservatives by buying whole, fresh or frozen produce and prepared foods made only with ingredients you might find in a household kitchen, said Mathilde Touvier, director of the nutritional epidemiology research team at the French National Institute for Health and Medical Research. Drink less, or not at all The risks of alcohol are greatest for heavy and binge drinkers, but even light drinking increases the risk of some cancers. “There’s no safe level for cancer risk,” said Giota Mitrou, executive director of research and policy for the American Institute for Cancer Research. “Less is better and avoiding is best,” she added.\n\nAdvertisement\n\nA recent study, for example, showed that consistent heavy alcohol intake and higher lifetime consumption (averaging 14 or more drinks per week) increased the risk of colorectal cancer; quitting appeared to lower the risk. Alcohol may cause cancer in a few ways, Mitrou said. The body breaks it down into acetaldehyde, which is toxic to cells. Alcohol increases levels of estrogen, which fuels some types of breast cancer. And it has been linked to oxidative stress — when the body produces too many unstable molecules that react with DNA – and may interfere with DNA repair. If you do drink, avoid doing so on an empty stomach. Drinking without food may result in a higher exposure to carcinogens, Ng said. Consider coffee, tea and dairy Tabung found that drinking up to three cups of coffee or tea per day was associated with lower levels of insulin resistance and inflammation. Coffee and tea are full of chemicals that help protect cells from damage, said Robin Ralston, a dietitian and nutritionist at The Ohio State University Comprehensive Cancer Centre. She encourages drinking them – whether hot or cold, brewed at home or drunk from a bottle – as long as there isn’t added sugar.\n\nAdvertisement\n\nDairy, and the calcium in it, appears to lower colorectal cancer risk. As part of a broader healthy diet, full-fat dairy – which was recently endorsed in new federal dietary guidelines – was also associated with reduced inflammation and insulin resistance in some studies. Ralston recommended fermented dairy like plain yoghurt, kefir and cheese because they can support gut health and have been associated with reduced inflammation in several studies. Related Article Fitness The goal posts for a longer, healthier life are closer than you think Know the risks of obesity The clearest link between diet and cancer is through obesity. A large body of evidence has linked obesity to more than a dozen cancers, including breast, colorectal, endometrial, gastric, kidney, liver and pancreatic cancers. Obesity, of course, is not just the product of diet, but also physical activity, genetics and other factors, said Edward Giovannucci, a professor of nutrition and epidemiology at the Harvard T.H. Chan School of Public Health. But to the extent that diet leads to excess body fat or body weight, that is likely “the biggest single impact of diet on cancer risk,” he said.\n\nAdvertisement\n\nFat tissue increases estrogen, which is a driver for some kinds of breast and endometrial cancer. Fat that accumulates in the abdomen, called visceral fat, promotes inflammation and insulin resistance, Giovannucci said. Exercise – at least 30 minutes of moderate-intensity activity most days of the week – can increase insulin sensitivity and reduce inflammation, in addition to helping with weight loss. Some early research has suggested that GLP-1 drugs may also reduce cancer risk, but evidence is limited. Maintaining a healthy body weight and exercising to promote good metabolic health are “a big part of the battle,” Giovannucci said – and not only to lower cancer risk. “It overlaps a lot with diabetes, cardiovascular risks and dementia,” he said. “I think they’re all tied together.” This article originally appeared in The New York Times.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Cancer\n\nFor subscribers\n\nDiet",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/road-markings-not-legally-enforcable-painted-on-aussie-road-to-deter-controversial-act-012028626.html",
    "title": "Road markings 'not legally enforcable' painted on Aussie road to deter controversial act",
    "publish_date": "2026-02-04T01:20:28Z",
    "category": "finance",
    "authors": [],
    "text": "An Australian council has taken the rare step of allowing residents to paint the road in front of their properties in a bid to instruct drivers where to park, to avert a long-standing parking problem in Aussie suburbs. While the move is \"not legally enforceable\", it's hoped it might prevent further disputes.\n\nThe Neighbourhood Watch Ku-ring-gai and Hornsby (NHWK&H) shared images this week, saying fed-up homeowners may now paint white demarcation lines on the road to prevent motorists parking over the resident's driveway.\n\nWhile the organisation is a community group and not a government division, the Ku-ring-gai Council, on Sydney's Upper North Shore, confirmed it backs the move to prevent vehicles blocking driveways.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"[The act] not only upsets schedules, but can block the moving of bags of shopping, wheelchairs and prams,\" NHWK&H said this week.\n\nThe Ku-ring-gai Council acknowledged the lines aren't legally enforceable, but believes they may \"serve as an encouragement to motorists\" not to obstruct driveways, and allow for better visibility.\n\n\"They also provide guidance to rangers to judge whether a vehicle is parked too close to or obstructing a driveway,\" the council said.\n\n\"Legally, motorists can park up to the wing of a driveway. Where a painted transverse parking line is present, motorists are highly encouraged to park in accordance with this line marking.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe nearby Hornsby Council has also \"OK'd residents painting their own white lines\", NHWK&H said.\n\n\"The rule, however, is that they must be painted at the top of the kerb,\" it said.\n\nResidents in the area who would like white lines on the kerb outside of their property can register their interest here.\n\nDo you have a story about illegal parking? Contact newsroomau@yahoonews.com\n\nParking over driveways is a contentious act, and in Sydney's Inner West, cars are being towed for it without notice. Source: Facebook/Keri Michael/Mosman Collective\n\nOnline, the original post prompted a bit of confusion among some locals.\n\n\"Not legally enforceable ... yet you keep implying it [is]. The law is ambiguous on it, so please don't say it is legal,\" one person said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Would that be vandalism? It's graffiti on the road,\" said another.\n\nOthers praised the move. \"Not a car in sight — well done,\" a man wrote.\n\nAustralia's growing driveway parking problem\n\nOver the years, parking over driveways has emerged as a major concern for residents right across Australia, with numerous examples emerging in recent times.\n\nIn October, motorists in Sydney's east were warned that parking across someone’s driveway will soon result in a steep $600 fine, with their cars also being towed.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Waverley Council said in 2025, vehicles blocking driveway access were one of the most common gripes to the council, with 2,136 complaints recorded.\n\nIn the year to May 2025, the Inner West Council said it had received an incredible 4,393 complaints concerning the contentious act.\n\nIn response, it now orders tow trucks to remove vehicles obstructing driveways. It also doubled fines for offending drivers from $320 to $660.\n\nEven with permission, blocking driveway access can prove costly, as a Queensland man found out in November.\n\nIn Concord in Sydney, frustrated neighbours of a busy hospital have started painting their own white lines on the street.\n\nA driver was recently branded 'arrogant' for blocking a public footpath in Sydney's north. Source: Reddit\n\nThey've also been sticking makeshift \"parking enforcement notices\" on vehicles in an attempt to force drivers to follow the rules, with visitors to the hospital purportedly clogging streets and preventing residents from accessing their own homes.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 37
  }
]