[
  {
    "url": "https://www.9news.com.au/national/oz-lotto-70-million-dollar-jackpot-up-for-grabs/55e12fcd-1777-4039-abb9-2f662a46733e",
    "title": "Millions of Aussies expected to enter $70 million Oz Lotto draw",
    "publish_date": "Mon, 02 Jun 2025 00:54:23 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "M﻿illions of Australians are expected to enter tomorrow $70 million Oz Lotto jackpot draw, the fourth biggest in the competition's 31-year history.\n\nAnyone lucky enough to capture the entire prize will take home the second-biggest lottery prize of the year.\n\nOz Lotto is forecasting one-in-five Australian adults will enter draw 1633, to be revealed tomorrow night.\n\nAustralians have the chance to grab a $70 million prize in tomorrow's Oz Lotto jackpot draw. (The Lott)\n\nThe Lott spokesperson Matt Hart said Oz Lotto was eagerly awaiting its fourth division one win for this year.\n\n\"So far this year, three Oz Lotto division one winning entries have pocketed a total of $185 million.\n\n\"Could we add to our 2025 winners list and see our fourth division one win in Oz Lotto this week?\" he said.\n\n\"We'll be standing by ready to reach out to any registered division one winner immediately after the draw on Tuesday night, so make sure you register your ticket to The Lott Members Club for the chance to receive that winning phone call.\"\n\nHow Australia's lotto winners spent their cash View Gallery\n\nThe last Oz Lotto $70 million draw in April was won by a 15-share Queensland syndicate, with each receiving more than $4.7 million.\n\nIt attracted a surge of late entries, with the peak of sales recorded over the last 30 minutes before the draw closed at 7.30pm.\n\nWhether it is an individual or syndicate that scoop the cash tomorrow, ﻿the overnight millionaires will end the financial year on a high note.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/us-asks-australia-to-lift-defence-spending-by-billions/2fc1cef9-a256-41cb-b581-6c9b49f903e9",
    "title": "Trump official tells Australia to lift defence spending to 3.5 per cent of GDP",
    "publish_date": "Sun, 01 Jun 2025 23:24:51 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "T﻿he Trump administration has asked Australia to pump billions of extra dollars into the defence budget \"as soon as possible\" to raise it to 3.5 per cent of GDP.\n\nUS Defence Secretary Pete Hegseth made the request after he met Australian Deputy Prime Minister and Defence Minister Richard Marles at a regional security conference in Singapore over the weekend.\n\n\"On defence spending, Secretary Hegseth conveyed that Australia should increase its defence spending to 3.5 per cent of its GDP as soon as possible,\" a Pentagon statement released overnight says.\n\nUS Secretary of Defence Pete Hegseth has asked Australia to hike its defence budget to 3.5 per cent of GDP. (Getty)\n\nThe pair also discussed advancing defence industrial base cooperation, creating supply chain resilience and accelerating US force posture initiatives in Australia.﻿\n\nHegseth has previously asked Australia to increase defence spending, but hasn't previously named a figure.\n\nThe federal government has projected defence spending to rise from 2.02 per cent of GDP to 2.33 per cent by 2033-2034.\n\nPrime Minister Anthony Albanese said yesterday Australia alone would decide its defence policy.\n\n\"What we'll do is we'll determine our defence policy, and we've invested just across the forwards, an additional $10 billion in defence﻿.\"\n\nThe Australian government has eyed a rise in defence spending to 2.33 per cent of GDP by 2033-34. (AAP)\n\nHegseth said China's designs on Taiwan pose a threat to global peace and stability that requires \"our allies and partners do their part on defence\".\n\n\"There is no reason to sugarcoat it,\" Hegseth said in a speech to the Shangri-La Dialogue, Asia's premier defence forum, in Singapore on Saturday.﻿\n\n\"The threat China poses is real. And it could be imminent.\"\n\nMarles told the forum it was \"deeply welcome\" the US regarded the Asia Pacific region as a strategic priority.\n\n\"But we cannot leave it to the United States alone,\" he said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/heavy-fog-sydney-city-covered-in-pictures/79904d4b-4203-49ae-a378-d27e69767e8d",
    "title": "Iconic landmarks vanish as thick fog blankets Aussie city",
    "publish_date": "Sun, 01 Jun 2025 23:54:37 +0000",
    "category": "finance",
    "authors": [
      "June"
    ],
    "text": "15 of 18 Attribution: 9News\n\nDrivers are urged to take it slowly on the roads and use their headlights if necessary.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/productivity-commission-report-says-work-from-home-not-to-blame-for-productivity-dip/6fe2e9e8-01c1-44ae-97cb-dabc1119f6cf",
    "title": "Is working from home behind a drop in national production levels?",
    "publish_date": "Sat, 31 May 2025 21:13:21 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A new report from the Productivity Commission has knocked down the theory that working from home is behind the nationally drooping production levels.\n\nThe new report looked at the \"productivity bubble\" in which labour productivity rose ﻿during the COVID-19 pandemic between January 2020 and March 2022, and the reasons for its subsequent decline.\n\n\"The COVID-19 pandemic was a rollercoaster for productivity, but we are now back to the stagnant status quo,\" commission deputy chair Dr Alex Robson said.\n\nThe COVID-19 lockdowns have led to a lasting change in Australia's workforce. (Getty)\n\nThe report found productivity grew in that time bec﻿ause those industries hardest hit, such as accommodation and food services, were those with the lowest labour productivity.\n\nThis meant the workforce by default shifted to have an emphasis on more productive sectors.﻿\n\nProductivity experienced more genuine growth from December 2020 to March 2022﻿, as worker output improved and the labour market began to recover.\n\nWorking from home is not deemed threatening to productivity, a new report has found. (Getty)\n\nBut it's the phase after that - the \"productivity loss\" phase between June 2022 and June 2023 - which the report was built around.\n\nIt found that the investment in equipment, tools and resources needed to get the most out of work didn't keep pace with the increase in hours worked post-lockdowns.\n\nPeople were working longer hours, but with less support to help their productivity.\n\nAlso, many younger and less experienced people joined the workforce after years in and out of lockdown and shrinking employment.\n\nREAD MORE: The top ten richest people in Australia\n\nBut working from home was not among the report's culprits for lost productivity.\n\nWhile it found research suggested fully remote working with no in-person interaction could make people less productive, the report also found hybrid models helped boost job satisfaction, worker retention, and potentially productivity.\n\nWorking from home \"all or most days\" of the week has also tripled around the country from the start of the pandemic (12 per cent) to August 2024 (36 per cent).\n\nThe report did note that less experienced and younger workers may benefit from more in-person work.\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\n\"However, given most studies find hybrid work to be either neutral or positive for labour productivity, there is no evidence to suggests that the trend towards hybrid working has contributed to the productivity loss phase of the productivity bubble,\" the report said.\n\nRobson said the \"big lesson\" of the burst productivity bubble was that there were \"no shortcuts\" to growing productivity.\n\n'Tackling our productivity problem will require dedicated effort and reform from business and government,\" he said.\n\nThe commission will pass the results of five inquiries into the issue to the government this year.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/champions-league-final-paris-st-germain-vs-inter-milan-fans-clash-with-riot-police-in-violent-aftermath/b0a8aa68-540c-4d00-a229-03d715a46e37",
    "title": "Two fans dead, police officer in coma after Champions League celebrations",
    "publish_date": "Sun, 01 Jun 2025 13:30:00 +0000",
    "category": "sports",
    "authors": [
      "Jun"
    ],
    "text": "Two fans died have died and a police officer is in a coma after mass nationwide celebrations for Paris Saint-Germain's historic Champions League victory, French authorities say.\n\nThe fatalities marred what started as a night of exuberance after PSG clinched European football's biggest prize for the first time in a 5-0 win over Inter Milan .\n\nThe Eiffel Tower glowed in team colours, and fans partied through the night in celebrations that were largely peaceful but degenerated into violence in some areas.\n\nREAD MORE: Russell Brand pleads not guilty to rape and sexual assault charges ﻿\n\nFootball fans in Paris have clashed with police after the Champion's Cup final. (9News)\n\nIt was Paris Saint-Germain's first premiership win in the competition. (9News)\n\nEarlier on Saturday night in Munich, police lined up in front of the PSG end of the stadium at the final whistle but struggled to contain the fans for several minutes when they came down from the stands following the trophy presentation.\n\nThey did eventually manage to force them back into the stands, and PSG players had already headed back to the locker room, appearing to cut short celebrations in front of their supporters.\n\nPlayers eventually made their way back to the field with the trophy after order was restored.\n\nA 17-year-old boy was stabbed to death in the western city of Dax during a PSG street party after Saturday night's final in Munich, the national police service said.\n\nA man in his 20s was killed in Paris when his scooter was hit by a car during PSG celebrations, the interior minister's office said. The circumstances of both are being investigated.\n\nA police officer was hit accidentally by fireworks at a PSG gathering in Coutances in north-west France and placed in an artificial coma because of grave eye injuries, the national police service said.\n\nSupporters celebrate a PSG goal outside a cafe during the the Champions League final soccer match between Paris Saint-Germain and Inter Milan, on Saturday, May 31, 2025 in Paris. (AP Photo/Aurelien Morissard)\n\nA total of 192 people were injured around the capital, four of them seriously, the Paris police chief said on Sunday.\n\nThe team was expected to return to a big victory parade on the Champs-Elysees on Sunday afternoon, with up to 110,000 people allowed along the iconic, tree-lined avenue to see the victorious players.\n\nLater, the team will join fans packed into PSG's home stadium, the Parc des Princes, on the city's western edge, for a concert and light show and official presentation of the Champions League trophy.\n\nA wide swathe of central Paris was closed to traffic for the exceptional day. The security measures are also impacting the French Open unfolding nearby.\n\nREAD MORE: Trump deals serious blow to major Australian industries ﻿\n\nFireworks explode on the Champs-Elysees avenue after the Champions League final soccer match between Paris Saint-Germain and Inter Milan, on Sunday, June 1, 2025 in Paris. (AP Photo/Aurelien Morissard)\n\nThousands of police are being deployed to keep order, and will employ similar tactics as they did Saturday night, Paris police chief Laurent Nunez told reporters.\n\nAP reporters saw tear gas used near the stadium and and water cannons used near the Arc de Triomphe to disperse rowdy crowds.\n\nIn addition to the injuries and arrests, Nunez said four stores were looted. Firefighters were so busy extinguishing garbage can fires in the middle of celebrations and dealing with other emergencies that the fire hotline was saturated.\n\nBy 2am on Sunday (10am AEST), a total of 294 arrests had been made, including 30 people who broke into a shoe shop on the Champs-Élysées. Two cars were set alight close to Parc des Princes, police added.\n\nAt the Place de la Bastille, there were joyous scenes as fans climbed onto the base of the famous column, singing, dancing and letting off flares, while those around joined in.\n\nFootage showed fireworks and flares set off outside the stadium. (9News)\n\nAt one point, motorbikes loudly revved their engines and the crowd cheered as they did laps around the column.\n\nThere were no police nearby and, by 1am, the atmosphere was upbeat with no tensions and plenty of singing.\n\nNunez blamed the scattered troubles on \"thousands of people who came to commit acts of violence\" instead of watching the match.\n\nHe noted similar unrest on the sidelines of prior celebrations in the capital, such as after France's World Cup win in 2018.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/melbourne-market-dispute-ends-legal-threat-protest/105365324",
    "title": "Melbourne market rental dispute ends with new lease agreements signed",
    "publish_date": "Mon, 02 Jun 2025 01:57:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Months of protests and legal threats at Melbourne's wholesale market have ended in a fresh deal for stallholders.\n\nThe Victorian government-run Melbourne Market Authority (MMA) in Epping said it had signed leases with all 17 stallholders involved in the dispute, ending eight months of bitter tensions.\n\nIt comes after vendors were threatened with legal action if they did not sign a revised rent deal in April this year.\n\nThe dispute began in October last year when the authority revealed rents for traders would rise between 6 and 7.6 per cent each year for 10 years.\n\nThat sparked an angry protest from stallholders and concerns about fresh produce costs skyrocketing for consumers.\n\nThe dispute between the market authority and vendors has been going for eight months. (ABC News: Cath McAloon)\n\nNew deal\n\nMMA chair Peter Tuohey said all 17 tenants have agreed to new lease terms.\n\n\"We're pleased to have reached a resolution that provides our tenants with clarity about their future at the market,\" he said.\n\n\"We know it's been a challenging period, but this outcome provides stability and certainty and allows the market to focus on what it does best, getting the freshest fruit and vegetables out to Victorians.\"\n\nPeter Tuohey says he is pleased the dispute has been resolved. (ABC News: Danielle Grindlay)\n\nIn April, the Valuer-General declared a compromised rate of yearly rent increases of between 2.4 per cent and 3.6 per cent for vendors.\n\nAt the same time, the authority threatened to take the stallholders to court if they did not sign on.\n\nThe vendors were still concerned they would be paying too much in rent.\n\nVendors were concerned about the size of the rent increase. (ABC News: Joseph Dunstan)\n\nSupport for tenants\n\nThe MMA said the new agreement included further assistance for stallholders.\n\nThe authority has reduced bond and electricity costs and waived rent back payments between August and February.\n\n\"We've taken a practical approach throughout this process and worked to find a fair balance between ensuring the market remains financially sustainable and supporting our tenants,\" Mr Tuohey said.\n\nLease renewals for an additional 100 stallholders at the market will be due in August.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/blak-in-justice-exhibition-heide-museum-torch-project/105356854",
    "title": "'Stain on this nation.' Exhibition calls out Indigenous incarceration rates",
    "publish_date": "Mon, 02 Jun 2025 01:05:42 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When Prime Minister Anthony Albanese visited Pope Leo XIV at the Vatican in early May, he took with him, by way of gift for the new Catholic Church head, a painting by Ngarrindjeri artist Amanda Westley.\n\n\"I wonder if the Pope knew that we're 36 per cent of the prison population when he received that painting,\" Barkindji artist Kent Morris says.\n\nI've driven though a miserable autumn day in Melbourne to Heide Gallery in the city's leafy eastern suburbs to meet Morris, the curator and director of the First Nations-led not-for-profit organisation, The Torch project.\n\nAs we chat, he's walking me through his latest curation, the incredible exhibition Blak In-Justice: Incarceration and Resilience.\n\n\"Our artwork and culture is somehow revered on the international stage and high enough for an exchange at that level, but yet, we're the most incarcerated people on the planet.\"\n\nNgarrindjeri artist Trevor Nickolls' paintings \"were among the first to portray the harsh realities of contemporary life from an Aboriginal perspective\", AGSA curator Nici Cumpston writes. (Supplied: Heidi Museum of Modern Art)\n\nSince the 1991 Royal Commission into Aboriginal Deaths in Custody, Indigenous incarceration rates have more than doubled, and deaths in custody have continued to rise.\n\n\"I think generally, as a nation, it's just seen as something that's, well, it is what it is,\" Morris says.\n\n\"It's a huge stain on this nation.\"\n\nExhibition 'a call to action'\n\nMorris is warm, smiles easily. But it's clear this exhibition is close to his heart.\n\nWhen I ask him what's inspired it, his response is: \"Sheer frustration.\"\n\nMorris says \"we've created for ourselves\" — but White Australia's support is crucial. (Supplied: Heidi Museum of Modern Art/Tina Baum)\n\nMorris is incensed by the over-representation of Indigenous people in our legal system.\n\nBut, he adds, Blak In-Justice has also provided an opportunity to bring together works by First Nations artists who have created political art engaging with the problem.\n\n\"It's a call of concern ... but it's also a call for action,\" he says.\n\nThat action is to turn around a brutal series of statistics. Morris highlights some:\n\nIndigenous people are 4 per cent of the population, yet 36 per cent of the national adult prison population. Indigenous men are 17 times more likely to go to prison than non-Indigenous men. Indigenous women are 27 times more likely to be incarcerated.\n\nJulie Dowling's 2002 painting, The Visit, is dedicated to \"all the mothers kept in prison for trivial crimes such as unpaid fines and other crimes of poverty\". (Supplied: Heidi Museum of Modern Art)\n\nAs we walk down the corridor leading into the exhibition, my eyes fix on a quote plastered across the archway. It's from the 2017 Uluru Statement from the Heart.\n\n\"We are not an innately criminal people,\" reads part of it.\n\nA truth-telling exhibition\n\nBlak In-Justice presents works by the who's who of Australian First Peoples artists — Richard Bell, Reko Rennie, Gordon Bennett, Jimmie Pike, Destiny Deacon — alongside works by participants in The Torch program, which brings art teaching and support to currently incarcerated or recently released First Peoples in Victoria.\n\nThe first room of the Blak In-Justice exhibition presents the full force of the problem.\n\nRichard Bell's painting, Walk On (Bell's Theorem), 2007, alludes to Aboriginal deaths in custody with its words, \"We live in the valley of the shadow of death.\" (Supplied: Heidi Museum of Modern Art)\n\nThe walls are painted a dusty blue — symbolic of both the blue stone of the earth, representing Country, and the bluestone walls of Loddon, of Pentridge, common to our prisons and former prisons in Victoria.\n\n\"The exhibition's grounded in Country,\" Morris explains. \"Even the bluestone walls — that's rock from the Country as well. And those prisons are built on our Country too.\"\n\nSet against the walls are visceral works from well-known Indigenous artists. The bright hues of Reko Rennie's Three Little Pigs (2024), depicting three white police officers against a red background holding down a faceless Indigenous figure in yellow, a police officer's knee in the restrained man's back. The red scars and hanging ropes of Gordon Bennett's Bloodlines (1993).\n\n65,000 Years: A Short History of Australian Art Photo shows Photograph of woman surrounded by green shrub and trees holds a large butterfly on her hand and looks down at it. Professor Marcia Langton is \"overwhelmed\" by a monumental celebration of Aboriginal art and design.\n\nA striking work, Blood Tears (2023) by Judy Watson is at one end of the room, made up of long red strips of plastic, punched out with the names of Aboriginal people who have died in custody, in Braille.\n\nThe works are in-your-face, political, satirical, shocking, starkly depicting police brutality and the systemic problems of the justice system Indigenous people are up against.\n\nSome of it is hard to look at, but that — Morris says — is the point.\n\n\"This is hard-hitting. But it's all truth-telling, you know? It's shared and lived experiences.\" He says this gravely, before his eyes fire up, his gears shift. \"I mean, here,\" Morris says, steering me towards the next room, \"Well, this is the solution that we've created for ourselves.\"\n\n'This program saved my life'\n\nThe next part of the exhibition opens out in walls painted in soft ochre, the themes and colours presented in the works displayed against them offering a vastly different experience to that of the room before.\n\nPlayfully painted emus appear in frames with candy-bright backgrounds, splendid blue wrens and pelicans against a black-and-white diamond pattern.\n\n\"It means so much to me when people buy my artwork because it's kept me out of jail, it's given me a better life,\" says Thelma Beeton (co-creator with Stacey Edwards of this 2021 painting, Banj Banj/nawnta). (Supplied: Heidi Museum of Modern Art)\n\nIn the centre, carved wooden pelicans gather in a circle. Morris tells me proudly that this work by Torch participant Daniel Church, Pelican Mudjin (Family), 2022, was acquired as part of the National Gallery of Victoria's permanent collection.\n\nMorris says the support The Torch provides to connect or reconnect artists with art practice, Country and culture gives them strength and purpose.\n\nAnd, importantly, the money the participants make from their art (100 per cent of the artwork price goes to the artist) enables them to support their families and imagine a life for themselves beyond prison.\n\n\"[It means] you're not just on the outside of society. You're actually included, and you have a part to play, and you have a story to tell.\"\n\nAs we walk through Blak In-Justice, Morris's stories send us zig-zagging across the room — stories of those in The Torch who have gone on to major art awards, like ceramicist Raymond Young, or who have come back to teach or otherwise work as part of the program, like Stacey Edwards.\n\n\"It's not just based around being an artist,\" Morris says. \"This really is about people removing the shackles and finding their pathway. People are going into employment, education, training and employment, a whole range of areas.\"\n\nDestiny Deacon was \"deeply political and unashamedly blak\", the ABC's Daniel Browning has said. (Supplied: Heidi Museum of Modern Art)\n\nMorris says every year artists come up to him to say, \"This saved my life. This program saved my life.\"\n\nHe wants to see that fact getting broader recognition and support.\n\n\"Solutions [to Indigenous over-representation in prisons] won't come from the non-Indigenous community, but they really need the support of the non-Indigenous community.\n\n\" At the Torch, we're still running on the smell of an oily rag. Whereas imagine the impacts if there was greater investment and belief in supporting this. \"\n\nThe Torch's success story is told not only in the stats (the recidivism rates of participants is more than half that of non-participants), but in these human stories, many of whose voices are part of the exhibition, through video documentary, panels accompanying their works and in large quotes on the walls.\n\nFor Morris, it's not surprising the program has had such success because it's been developed for Indigenous people, by Indigenous people. Although The Torch began in 2011, it was built on the back of more than 40 years of activism and listening to community.\n\n\"Solutions will only come from our community because we're the ones who have the most at stake,\" he says. \"We care the most, and we believe and have hope. And this is one extraordinary example.\"\n\nBlak In-Justice: Incarceration and Resilience is at Heide Museum of Modern Art (Naarm/Melbourne) until July 20, 2025.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/callide-power-station-unit-back-online-after-explosion-cs-energy/105364686",
    "title": "One of Queensland's biggest power generators back online after explosion",
    "publish_date": "Mon, 02 Jun 2025 00:37:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Queensland's biggest power generators is operational again after it was forced offline in April by another explosion.\n\nThe embattled government-owned Callide Power Station in central Queensland, near the town of Biloela, came back online over the weekend.\n\nThe C3 coal-fired generator was badly damaged by a powerful \"pressure spike\" inside its boiler on April 4.\n\nThe incident left the C3 boiler with considerable structural damage, but did not result in power outages with the company saying at the time they had \"sufficient forecast generation\" to meet expected demand.\n\nA 2021 explosion at the plant caused the state's worst power outage in more than a decade. (ABC News: Russell Talbot)\n\nOn Monday, a spokesperson for the state-owned CS Energy said the Callide C3 unit \"returned to service Sunday, June 1, shortly before 3am\".\n\nThe Queensland government's deadline was to have repairs completed by May 30.\n\nHowever, on May 19, CS Energy informed the market of a revised return to service of June 2.\n\nThe company said approximately 100 people were working on rotating shifts to repair the areas of the C3 unit damaged in the major operational safety event.\n\nWorkers repair areas of unit C which were damaged in the incident. (Supplied: CS Energy)\n\nIt's not the first explosion at the plant in recent years.\n\nIn May 2021, multiple generators and high voltage transmission lines in Queensland were tripped following an explosion in the C4 unit at Callide.\n\nThe incident caused nearly 500,000 customers to lose power, from the NSW border to north of Cairns.\n\nPremier David Crisafulli yesterday welcomed the plant's return to service, and said his government would focus on long-term maintenance of the plant.\n\n\"Obviously that's good news, but that doesn't change my focus that unless we spend long-term maintenance on those assets, we're not going to have them as reliable as what they should be,\" Mr Crisafulli said.\n\n\"But I stress we are still some time away before the investment return on to those plants can give the reliability that they deserve.\"\n\nThe Callide Power Station is located just outside Biloela in central Queensland. (ABC Capricornia: Tobi Loftus)\n\nCallide Power Station has two power plants — B and C — which each have two generating units.\n\nState-owned CS Energy owns and operates Callide B, and it owns Callide C in a 50-50 joint venture with Czech company 7GI.\n\nThe most recent explosion in April led to CS Energy's CEO and general managers resigning.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/matildas-reveal-joe-montemurro-as-new-head-coach/105365074",
    "title": "FA finally reveals new Matildas coach after 10-month search",
    "publish_date": "Sun, 01 Jun 2025 23:58:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "The 10-month search for a new Matildas coach is officially over.\n\nJoe Montemurro has been unveiled as Tony Gustavsson's replacement after an exhaustive search for the new head of the Australian women's football team.\n\nThe 55-year-old Australian leaves Lyon after steering the team to the women's French title, but falling short of a UEFA Champions League final appearance after going down to the Steph Catley-led Arsenal in the semifinal.\n\nMontemurro has overseen successful campaigns at Arsenal, Juventus and Melbourne City, and has strong relationships with some of Australia's biggest stars.\n\n\"Joe brings world-class experience, a deep understanding of the Australian football landscape, and a genuine connection to our national identity,\" Football Australia interim CEO Heather Garriock said.\n\n\"Importantly, he has spent the last decade coaching at the very highest levels of the women's game in Europe and brings with him an unparalleled understanding of what is required to compete and succeed at the top of modern football.\n\n\"Joe has shown an ability to build high-performing teams that play with tactical clarity and attacking intent, and we believe his vision and values are the perfect fit to lead the next era of the Matildas with professionalism, vision, and distinction.\"\n\nThe announcement means tonight's Matildas friendly against Argentina will be Tom Sermanni's final game at the helm as interim coach.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/queensland-brain-injury-survivors-connect-music-program/105364712",
    "title": "Brain injury survivors connecting through rhythm and music",
    "publish_date": "Sun, 01 Jun 2025 23:57:29 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "After suffering a massive stroke at 11 years old, Jordan Carroll has spent years in and out of hospital.\n\nHe was diagnosed with a brain tumour at the age of 12, then underwent chemo, radiation therapy, and a drug trial.\n\nOver the course of his treatment, Jordan has missed holidays and key milestones, including his year 12 formal and graduation.\n\n\"Having a brain injury, I don't really fit in with any particular group,\" he said.\n\nJordan Carroll says the program has helped his social life. (ABC: Emma Johnson)\n\n'Invisible injury'\n\nFor the last five weeks, Jordan has taken part in NeuroRhythm — a group therapy program for brain injury survivors.\n\nIt combines dance with Djembe drumming to offer participants a space to express themselves and connect with others.\n\nOrganisers say the program is designed to be more inclusive than traditional one-on-one therapy. (Supplied: Citrine Sun Entertainment)\n\n\"Honestly this is the best thing that's ever happened to me in terms of my social [life],\" Mr Carroll said.\n\n\"I'm surrounded by people with brain injuries themselves.\n\n\"It's not like when I was at school where I was forced into a group with other people that didn't really understand me that well.\"\n\nAnother participant, Tyson Hoy, sustained a severe traumatic brain injury in 2023 after he was hit by a car.\n\nTyson Hoy says the program has helped raise awareness for those living with \"invisible\" brain injuries. (ABC: Emma Johnson)\n\nHe said the program has given him the opportunity to do what he loves and show what people with brain injuries are capable of.\n\n\"It makes me happy,\" he said.\n\n\" Brain injury is basically an invisible injury, so this program raising awareness is great in the sense that it'll get it out there. \"\n\nAiding recovery\n\nThe program sessions start with meditation, before moving into group dance movements and drumming.\n\nLead program facilitator and researcher Danielle Pretty said the activities focused on providing social connection but also offered a mental workout.\n\nThe program is focused on providing social connection and offering a mental and physical workout. (Supplied: Citrine Sun Entertainment)\n\n\"You've got to combine the auditory, the visual, and movement patterns,\" she said.\n\n\"It's actually quite tricky to have someone else doing a different rhythm beside you and still maintain what you're doing.\n\n\"All of that impact on the brain and neuroplasticity, future us would like to be assessing.\"\n\nA different kind of therapy\n\nPhysiotherapist Kerry Read helped design the program to be more inclusive than traditional one-on-one therapy.\n\n\"It's quite unusual that you can do a program where, as a family member, you can come along and do it as well,\" she said.\n\n\"Normally you would drop your loved one at therapy and then wait outside.\n\n\"This is so different — you're there, you're an integral part, so you can actually hang out and have a good time.\"\n\nFor five weeks, six brain injury survivors have participated in the therapeutic program, culminating in a showcase performance. (Supplied: Citrine Sun Entertainment)\n\nMs Read, who attended the program's first and last sessions, said the group showed significant improvements over five weeks.\n\n\"The changes have blown me away,\" she said.\n\n\"Seeing how everyone has progressed has been amazing.\"\n\nLack of resources\n\nBelinda Adams OAM founded NeuroRhythm with funding from the federal government after her son sustained a traumatic brain injury 13 years ago.\n\nShe felt there was a lack of available resources once he was ready to re-enter the community.\n\n\"Because it's an invisible disability, it seems to slip through the cracks of the system sometimes,\" Ms Adams said.\n\n\"Especially when it comes to arts-based programs and the value that they hold in connection.\"\n\nBelinda Adams felt there was a lack of available resources when her son Dylan sustained a traumatic brain injury. (Supplied: Belinda Adams)\n\nThe NeuroRhythm pilot program concluded with a final performance for friends and family.\n\nMs Adams said she hopes it can continue as an evidence-based study in the future.\n\n\"It's really been a community effort and we're like a family now I think,\" Ms Adams said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/bussell-highway-duplication-ongoing-frustrating-drivers/105363250",
    "title": "Drivers slam 'astronomical delay' of WA road duplication project",
    "publish_date": "Sun, 01 Jun 2025 23:56:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Work is still underway on a 17-kilometre stretch of road in the South West of WA, more than five years after upgrades were first announced.\n\nThe duplication of the Bussell Highway began in 2020 to ease congestion between Bunbury and Busselton.\n\nBut five years on, finishing works are still going even though the highway was officially opened in April, with drivers frustrated over lane closures and speed reductions.\n\nA sticker was placed over the completion date on a Bussell Highway road sign, marking delays to the project. (ABC South West WA: Pip Waller)\n\nRichelle Piggott lives in Capel and travels to Busselton five to six times a week.\n\nShe said driving on Bussell Highway was \"extremely frustrating\".\n\n\"It takes a very long time. There's a lot of different signage and I see a lot of people getting confused and unaware of the directional requirements with regards to the roadworks,\" Ms Piggott said.\n\nRichelle Piggott drives from Capel to Busselton at least five times a week. (ABC South West WA: Pip Waller)\n\n\"I can see it being a very good project once it's finished.\n\n\"But the constant frustration of broken promises and goalposts being moved with regards to when it's going to be finished? I battle to understand why it's taken so long.\"\n\nTraffic diverted\n\nTo avoid delays on the Bussell Highway, Ms Piggott said she drove along Tuart Drive, just off the highway.\n\nScott Olney has lived just off Tuart Drive in Ludlow for almost a decade.\n\nHe said since construction on the highway began, traffic had been diverting down the single-lane, tree-lined road to avoid the roadworks.\n\n\"Down south is obviously a really popular holiday destination, but the majority of traffic has been coming down Tuart Drive,\" Mr Olney said.\n\nScott Olney says traffic is diverting down Tuart Road to avoid delays on the highway. (ABC South West WA: Pip Waller)\n\n\"Five years ago, we used to be able to walk down Tuart Drive and people used to walk their horses along the road.\n\n\"But now no-one does and I'd hazard a guess it's because there's been a 500 to 1,000 per cent increase in cars.\"\n\nIn February, the RAC announced its top 10 riskiest roads across metropolitan and regional areas.\n\nThe intersection of Bussell Highway and Tuart Drive in Yalyalup came in at number three.\n\nTuart Drive is a 14km stretch of road that some drivers use to avoid delays. (Supplied)\n\nThe intersection has already claimed multiple lives over the past 18 months.\n\nA 40-year-old motorcycle rider was killed in April last year after their bike and a ute collided at the intersection.\n\nJust two months later, an 18-year-old woman was killed at the same intersection after a collision involving a minibus.\n\nMr Olney said there should not be more fatalities on the road, which was getting busier.\n\n\"The road signage is inadequate; there's no extra signage, no flashing lights saying slow down, dangerous intersection,\" he said.\n\n\"There's other parts of the world where they've built skyscrapers in lesser time and all we've done is construct a dual highway.\n\n\"The time that it's taken to complete this road [Bussell Highway] is astronomical and we're still not there.\"\n\nSeveral roadside memorials are in place at the intersection of Bussell Highway and Tuart Drive. (ABC South West WA: Pip Waller)\n\nAlways a 'staged' project\n\nWA Transport Minister Rita Saffioti announced in February last year that the Bussell Highway duplication would be open by the end of 2024.\n\nBut while the road was completed in April 2025, finishing works requiring lane closures and speed reductions are expected to continue until the end of June or early July, depending on the weather.\n\nRoadworks were also paused on the Easter and WA Day long weekends.\n\nIn a statement, a state government spokesperson said the duplication was always designed as a staged project to be delivered over several years.\n\n\"We appreciate these works have caused disruption and we thank the community for their patience,\" the spokesperson said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/top-soil-lost-and-pasture-drowned-by-mud-after-floods/105159884",
    "title": "Floodwater strips away topsoil, leaving paddocks bare in western Qld",
    "publish_date": "Sun, 01 Jun 2025 23:10:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "While parts of western Queensland have turned green following record flooding, other areas could take decades to recover after the top layer of soil, which is vital for pasture growth, was washed away.\n\nThe sheer velocity and volume of the floodwater washed away up to 40 centimetres of topsoil, along with fencing, roads and livestock.\n\n\"We've got big areas here that have just lost all the topsoil,\" Quilpie property owner Jon Mooring said.\n\n\"There's great piles of silt that are half a metre deep.\"\n\nFast-flowing floodwater caused extensive erosion damage across western Queensland. (Supplied: Desert Channels Queensland)\n\nThe Bulloo River cuts through the middle of Jon and Kerri Mooring's Quilpie property, and during the March floods the river and a lake on the property met for the first time in 10 years.\n\n\"When the two systems got together, it [the water] was rising nearly two feet an hour and the road of that went on for nearly four nights past our house,\" Mr Mooring said.\n\nFour years of restoration and thousands of dollars of work were washed away in just a matter of days as a \"sea of water\" took over the landscape.\n\nHe said it could take up to 20 years for the landscape to recover from some of the more extensive flooding damage, such as scouring and erosion.\n\nThe rehydration projects at Jon and Kerri Mooring's Quilpie property have been washed away by flooding. (ABC Rural: Kalle Buchanan)\n\nPasture drowned by mud\n\nChannel country springing to life Photo shows A river channel cutting through greenery, sun reflecting on the water. Just add water to the Channel Country and watch it spring to life. It's a silver lining of recent devastating flooding in the outback.\n\nTopsoil is the top layer of soil on the ground, usually up to 20cm deep, and is rich in nutrients and organic matter, making it essential for vegetation growth.\n\nEnvironmental damage like loss of topsoil, erosion and weed spread were often the longest-lasting impacts of widespread flooding.\n\nGeoff Penton, operations manager at natural resources management group Desert Channels Queensland, said the impact of the floods varied.\n\n\"In some areas, it's a great season and in other areas, it's devastating, and they can be literally feet apart,\" Mr Penton said.\n\nThick layers of mud and silt have dried across paddocks in western Queensland, drowning any plants growing underneath. (Supplied: Wendy Sheehan)\n\n\"There's many areas where the water, both the volume and the velocity, has stripped the topsoil off entirely.\n\n\"Some places where that erosion is settled it's drowned pastures in a foot of mud.\"\n\nCostly recovery\n\nMr Penton said it was likely to take \"several seasons\" to see pasture response, and it would be a long and expensive road to repairing the environmental damage.\n\nMore than 13 million hectares of western Queensland were inundated by floodwaters. (Supplied: Wendy Sheehan)\n\n\"What will help accelerate this is if we can secure some flood recovery investment from the state and federal government,\" he said.\n\nWhile he acknowledged the current funding options from the state and federal governments were a start, Mr Penton said attention would need to shift to recovering the environment.\n\n\"The environmental recovery usually comes substantially later,\" Mr Penton said.\n\n\"That's under consideration by both levels of government at the moment.\"\n\nThe force of the floodwaters scoured pastures and washed away vital topsoil across western Queensland. (Supplied: Jon Mooring)\n\nThe Queensland Reconstruction Authority said in a statement that $186.75 million in extraordinary assistance had been approved in response to the floods through joint Commonwealth-state Disaster Recovery Funding Arrangements (DRFA).\n\n\"The Australian and Queensland governments are working together to provide all support necessary for flood recovery in western Queensland,\" the statement read.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/giro-ditalia-simon-yates-wins-2025-event/105364902",
    "title": "Pope blesses the peloton as Brit claims historic Giro d'Italia victory",
    "publish_date": "Sun, 01 Jun 2025 22:40:28 +0000",
    "category": "sports",
    "authors": [],
    "text": "British rider Simon Yates cruised to overall victory in the Giro d'Italia overnight — finally winning the race that had eluded him so often.\n\nAfter attacking on the gravel-road climb to take the pink jersey in the penultimate stage on Saturday, Yates finished nearly four minutes ahead of runner-up Isaac Del Toro, the 21-year-old Mexican who wore pink for 10 days before Yates took control.\n\nIt's the second Grand Tour title for Yates after he won the Spanish Vuelta in 2018.\n\n\"It's a defining moment of my career, there's no doubt about that,\" Yates said.\n\nYates wore pink for 13 days during the 2018 Giro before cracking on one of the final climbs. He also had to withdraw from the Italian race in 2020 and 2022 — because of coronavirus and a knee injury, respectively.\n\n\"I'm still in shock of what I've done,\" Yates said.\n\n\"It's something that I've been working toward for a long time.\"\n\nYates, who rides for Team Visma Lease a Bike, finished 3 minutes, 56 seconds ahead of Del Toro and 4:43 ahead of Richard Carapaz, the 2019 champion from Ecuador.\n\nDutch rider Olav Kooij, Yates' teammate, won the final stage in a sprint finish. It was his second victory in this Giro after also winning the 12th stage — and third overall after winning one in 2024.\n\n\"Perfect final weekend for us. After yesterday we were all really happy with what Simon pulled off,\" Kooij said.\n\n\"To finish it off is really cool.\"\n\nDuring the non-competitive neutralised period just before the mostly ceremonial final stage actually began, the peloton passed through the Vatican and was blessed by Pope Leo XIV.\n\nThe 143km final stage concluded with a circuit of eight laps through downtown Rome and finished next to the Circus Maximus — the ancient Roman chariot-racing stadium.\n\nAt age 32, Yates already acknowledged that this victory is \"the peak\" of his career. His best finish in the Tour de France was fourth in 2023.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/french-open-tennis-carlos-alcaraz-defeats-ben-shelton/105364836",
    "title": "Alcaraz applauded for sportsmanship after handing Shelton a point",
    "publish_date": "Sun, 01 Jun 2025 22:30:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "Carlos Alcaraz is such a constant ray of sunshine on court that it always seems a surprise when a darker mood descends.\n\nYet the Spaniard was still able to win the battle with his own mind to earn his 100th tour clay court victory and advance to the French Open quarterfinals overnight.\n\nThe 22-year-old subdued dangerous Ben Shelton 7-6 (10-8), 6-3, 4-6, 6-4 on Court Philippe Chatrier, meaning he has now lost a set in each of the last three matches of his title defence en route to the quarterfinals.\n\nThey have all featured spells of familiar stellar quality but also careless patches — \"dumb mistakes\" as Alcaraz dubbed them — that have begun to irritate him even if, in truth, they've never looked like derailing him.\n\n\"Honestly, today I fought against myself in the mind,\" Alcaraz said.\n\n\"I just tried to calm myself. In some moments I was mad.\n\n\"I was angry with myself, talking not good things. I'm happy that I didn't let that thought play against me.\n\n\"I tried to calm myself and tried to keep going.\"\n\nHe did keep going and the crowd couldn't have loved him more, especially when he owned up that one seemingly amazing winner he had hit should not count.\n\nHe had flung his racquet out at full stretch to get to a Shelton passing shot and, miraculously, pulled off what looked to everyone like a winning volley.\n\nHe was awarded the point, but admitted to the chair umpire that his hand wasn't holding the racquet and got a rousing ovation from the crowd for his sportsmanship.\n\n\"I would have felt guilty if I didn't say anything,\" Alcaraz said.\n\n\"It's just about the respect we have against each other.\"\n\nAlcaraz, after 19 wins in 20 clay-court matches this season now, will be hot favourite to get past his next obstacle too, even though 12th seed Tommy Paul looked a potentially troublesome quarterfinal foe as he outclassed Australian Alexei Popyrin 6-3, 6-3, 6-3.\n\nThe first American man to reach the French Open quarterfinals in 22 years since Andre Agassi, Paul loves pitting himself against the Spaniard and had beaten him a couple of times, though Alcaraz won their last encounter at Roland Garros in the Olympic quarterfinal.\n\n\"I remember that every match I've played against him he was really tough,\" Alcaraz said.\n\n\"In grand slams, Masters 1000s, all tournaments I've played against him it wasn't easy at all. His level is really high right now.\n\n\"I'll try to keep going, trying to be better. I'll try to learn from the mistakes I made today. I'm not going to make the same against Tommy.\"\n\nFrances Tiafoe was another American to make the last eight, defeating German Daniel Altmaier 6-3, 6-4, 7-6 (7-4).\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/perth-rollerskating-couple-peter-barbara-rye-roll-back-years/105338824",
    "title": "Married for five decades, Peter and Barbara keep rolling back the years",
    "publish_date": "Sun, 01 Jun 2025 21:24:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Peter and Barbara Rye get into their rollerskates, they move in a kind of unison that only comes after five decades of marriage — three of them on wheels.\n\nNow aged in their seventies, the pair first fell in love with rollerskating when they competed in a couples' dance event in the 1990s, a time when the category was overflowing with skaters.\n\nBut the event has since died out.\n\nIn fact, Peter and Barbara were the only couple in the rink at the state championships in Perth this year.\n\nBarbara and Peter Rye started rollerskating in their forties and are still going strong 30 years later. (ABC News: Glyn Jones)\n\nDespite the challenges, the couple have maintained the same commitment to the sport as they have to each other, in the hope artistic rollerskating can be revived.\n\nAn antidote to 'vegetating'\n\nPeter and Barbara picked up the skates by chance when they were in their forties, and have been hooked ever since.\n\nBarbara and Peter Rye hope their sport can make a comeback. (ABC News: Grace Burmas)\n\nDespite their age, the couple trains about three times a week.\n\n\"You can trip each other up and we do sometimes have falls,\" Barbara said.\n\nThe joy of coming up with choreography and keeping the beat of the music has kept the pair engaged in the sport, even if there isn't much competition.\n\nWhen Peter and Barbara Rye started skating, the couples' competitions were full of dancers. (ABC News: Grace Burmas)\n\n\"It's still fun. It's still rewarding to go out there and compete, to push yourself,\" Peter said.\n\n\"So many people our age sort of just vegetate rather than push yourself and keep achieving.\n\n\"Even if sometimes you can't achieve what you used to be able to achieve.\"\n\n'We are quite unique'\n\nWhen rollerskating first hit Australia in the 1980s, it was a booming sport for social and competitive skaters.\n\nBarbara and Peter Rye have no plans to stop skating anytime soon. (ABC News: Glyn Jones)\n\nBut participation declined over the following decades, as trends moved on and more options entered the market.\n\n\"Couples skating like [us] have really gone out of fashion, there are very few left now,\" Barbara said.\n\n\"It's a real shame that the young skaters aren't still doing it because they can do so much more than we can now.\"\n\nPeter and Barbara Rye, aged 75 and 73, started roller skating in the 1990s. (ABC News: Grace Burmas)\n\nMany of Peter and Barbara's peers have either given up the sport or died, but for those still committed to rollerskating, the competitions have become an opportunity to reminisce.\n\nBarbara and Peter Rye have been skating for decades. (Supplied)\n\n\"The national championships isn't so much a competition as a reunion,\" Peter said.\n\n\"It's unfortunately becoming less and less so as our friends have faded away one way or the other.\"\n\nThe couple are now an anomaly in Perth.\n\nBut they don't mind standing out from the crowd and have no intention of slowing down while they are both willing and able to keep skating.\n\n\"You get some quite amazing feedback from the audience when we skate at competitions because we are quite unique,\" Peter said.\n\nUps and downs\n\nThe fluctuation of rollerskating's popularity, particularly in a social capacity, has often been tied to popular culture.\n\nBarbara said that cycle has kept her hopeful that up-and-coming skaters will start walking through the doors again.\n\nMorley Rollerdrome opened in 1980. (ABC News: Grace Burmas)\n\n\"We've had ups and downs, but it's never stayed that way,\" she said.\n\n\" Fads come through and suddenly people get excited about rollerskating and you get a whole lot of people coming in. \"\n\nMorley Rollerdrome owner Ozzy Kilgallon said the end goal was to get rollerskating to the Olympics.\n\nOzzy Kilgallon wants to see rollerskating in the Olympics. (ABC News: Grace Burmas)\n\n\"World sports are best when you watch on TV and then you can go and do it … it's accessible,\" he said.\n\n\"If they can get rollerskating to the Olympics, like skateboarding did, everyone will want to try it and that's a good thing.\n\n\"That will keep us going.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/asx-markets-business-news-live-updates/105363692",
    "title": "Live: ASX slips on tariff turmoil, Soul Patts and Brickworks soar on $14b merger",
    "publish_date": "Sun, 01 Jun 2025 21:12:45 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Stephanie Chalmers"
    ],
    "text": "Reuters is reporting that car makers in the US have been lobbying the Trump administration with a fair degree of urgency about the lack of rare earth magnets being exported to the US from China.\n\n\n\nHere's the Reuters story from the weekend.\n\nGlobal auto executives are sounding the alarm on an impending shortage of rare-earth magnets from China — used in everything from windshield-wiper motors to anti-lock braking sensors — that could force the closure of car factories within weeks.\n\nIn a previously unreported May 9 letter to Trump administration officials, the head of the trade group representing General Motors, Toyota, Volkswagen, Hyundai and other major automakers raised urgent concerns.\n\n\"Without reliable access to these elements and magnets, automotive suppliers will be unable to produce critical automotive components, including automatic transmissions, throttle bodies, alternators, various motors, sensors, seat belts, speakers, lights, motors, power steering, and cameras,\" the Alliance for Automotive Innovation wrote the Trump administration.\n\nThe letter, which was also signed by MEMA, The Vehicle Suppliers Association, added that, without those essential automotive components, it would only be a matter of time before US vehicle factories were disrupted.\n\n\"In severe cases, this could include the need for reduced production volumes or even a shutdown of vehicle assembly lines,\" the groups said.\n\nBoth Alliance CEO John Bozzella and MEMA CEO Bill Long told Reuters on Friday the situation was not resolved and remained a concern. They expressed gratitude for the Trump administration's high-level engagement to prevent disruption to US auto production and the supply chain.\n\nBozzella noted that the automotive issue was on the agenda during Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer's talks with their Chinese counterparts in Geneva earlier this month.\n\nMr Greer told CNBC on Friday that China had agreed to lift restrictions on the exports of rare-earth magnets to US companies and was not moving fast enough to grant access for key US industries.\n\n\"We haven't seen the flow of some of those critical minerals as they were supposed to be doing,\" he said.\n\nChina — which controls over 90% of global processing capacity for the magnets used in everything from automobiles and fighter jets to home appliances — imposed restrictions in early April requiring exporters to obtain licenses from Beijing.\n\nRare-earth magnet exports from China halved in April as companies grappled with an opaque application process for permits that sometimes require hundreds of pages of documents.\n\nIn a social-media post Friday, President Donald Trump accused China of violating the terms of a deal reached this month to temporarily dial back tariffs and other trade restrictions.\n\n\"China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US,\" Mr Trump said in a post on his Truth Social platform.\n\nChina's embassy in Washington responded by saying it was the US that was abusing export controls in the semiconductor sector.\n\nA US official with knowledge of the talks told Reuters that only tariffs and Chinese non-tariff countermeasures were covered in Geneva talks, and that US export controls were not part of the deal.\n\nThe official also expressed frustration that Beijing appeared to be moving slowly on promises to issue rare-earth export licenses, which could kick start export control retaliation by Washington if automakers vulnerable to shortages of the minerals were forced to halt production.\n\nWhile a handful of licenses have been granted, including to some Volkswagen suppliers, Indian automakers said they had still received none and would have to stop production in early June.\n\nGerman auto parts maker Bosch said this week that its suppliers had been bogged down by China's more-rigorous procedures to receive export licenses.\n\nA Bosch spokesperson described the process as \"complex and time-consuming, partly due to the need to collect and provide a lot of information.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/act-nt-qld-tas-yet-to-include-breast-density-reports-mammograms/105358802",
    "title": "'I had no idea': Not every mammogram includes a breast density report",
    "publish_date": "Sun, 01 Jun 2025 21:08:45 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Canberra woman Jenny Edwards feels very lucky.\n\nThis year her routine mammogram showed a few small white spots, prompting a call for her to come back for a better look.\n\nA 3D scan and ultrasound found a small tumour, and also revealed Ms Edwards had high breast density.\n\n\"I had no idea I had dense breasts, [or that they] were hiding various lumps,\" she said.\n\n\"As well as a tumour in my left breast I had two fibroadenomas — which are other sorts of benign lumps — and in my right breast I had a cyst.\n\n\" I certainly wasn't aware that with dense breasts it's harder to detect the lumps and tumours yourself, and even on the imaging it's not as obvious. \"\n\nJenny Edwards says she had no idea she had dense breasts. (ABC News: Joel Wilson)\n\nBreast density reports not nationwide\n\nMs Edwards is now undergoing radiation treatment, and said she was lucky those few white spots were caught at all, particularly given her dense breasts and the fact she had no known family history of breast cancer.\n\nBreast density refers to the amount of glandular and connective tissue in the breast, compared to fatty tissue, as seen on a mammogram.\n\nOn a mammogram non-dense breast tissue (left) appears dark, while dense breast tissue (right) appears white. (Supplied: Breast Cancer Network Australia)\n\nHigh breast density not only makes breast cancer harder to detect through routine 2D mammography, but is also an independent risk factor for developing breast cancer.\n\nBreastScreen Australia is the national screening program, jointly funded by the federal, state and territory governments, to provide free mammograms through state-run services.\n\nThere have long been calls for BreastScreen Australia to change its national policy not to record participants' breast density, nor report it to them.\n\nLast week, BreastScreen Australia updated its policy to recommend that everyone screened be informed in writing of their breast density, and encouraged to have further discussions with their GP about additional screening options.\n\nBut currently only New South Wales, Victoria, South Australia and Western Australia measure and report breast density.\n\nVicki Durston from Breast Cancer Network Australia says everyone has a right to know their breast density and understand their breast cancer risk. (Supplied.)\n\nBreast Cancer Network Australia's Vicki Durston said a person's access to potentially lifesaving information about their breast density and cancer risk shouldn't be dependent on where they lived.\n\n\"Every woman has the right to know her breast density and understand her breast cancer risk,\" Ms Durston said.\n\n\"We need every state and territory to act now to provide this information, along with clear pathways for supporting women at higher risk.\n\n\"The progress being made elsewhere shows timely implementation is both achievable and beneficial for women.\"\n\nIn a statement, the ACT government said it was \"working on plans to introduce recording and reporting of breast density following mammograms\", but it did not have a timeline for implementation.\n\nOn their websites, BreastScreen Queensland says it's \"actively working towards statewide implementation of breast density recording and reporting\", while BreastScreen NT says breast density will be included in results by 2026.\n\n'A polar bear in a snowstorm'\n\nKym Berchtenbreiter, who has lived experience with breast cancer, said if she had known she had dense breasts when she received a negative mammogram result her outcome may not have been as severe.\n\nKym Berchtenbreiter says it's vital people are informed about their breast density so they can make informed decisions. (Supplied: Breast Cancer Network Australia)\n\n\"If I'd known that I had extremely dense breasts … I could have looked into the possibility of having supplemental screening, and perhaps my outcome might not have been as severe as it was,\" Ms Berchtenbreiter said.\n\n\"[Instead] within 12 months of that negative result I was subsequently diagnosed with early breast cancer and underwent a mastectomy, chemotherapy and years of hormone blocking treatment.\n\n\"But I'm one of the lucky ones. I'm still here to tell this story.\n\n\"There are others who are not that fortunate because interval cancers got missed in a screening.\"\n\nA tumour in fatty breast tissue (left) is much easier to see on a 2D mammogram than a tumour in dense breast tissue (right). (Supplied: Breast Cancer Network Australia)\n\nMs Berchtenbreiter said it was important to inform people of their breast density because looking for a tumour in very dense breast tissue was \"a bit like looking for a polar bear in a snowstorm\".\n\n\"It's vital that women are informed about their breast density, so they can make informed decisions about supplemental screening options,\" she said.\n\n\"We are so fortunate to have a breast screening program in Australia but let's make it even better, and save more lives, by having a national commitment to reporting breast density.\"\n\nWomen can't tell their own breast density\n\nBreast Cancer Network Australia says 58 people are diagnosed with breast cancer every day in Australia.\n\nNational Breast Cancer Foundation CEO Cleola Anderiesz says early detection is critical to improving breast cancer outcomes. (LinkedIn: Cleola Anderiesz)\n\nNational Breast Cancer Foundation chief executive Cleola Anderiesz said nobody could tell their own breast density.\n\n\"The size of your breast, or how firm or not firm your breast feels, doesn't give you any indication of your breast density. It has to be detected through a mammogram,\" Ms Anderiesz said.\n\n\"What it measures is the relative amount of dense breast tissue — so glandular and connective tissue, which actually appears white on the mammogram — compared to non-dense — or fatty — tissue, which appears dark.\"\n\nShe said early detection was critical to improving outcomes from a breast cancer diagnosis.\n\n\"We know that if your breast cancer is diagnosed early in Australia, your outcomes are much better,\" Ms Anderiesz said.\n\n\"For example if your breast cancer is diagnosed at what we call stage one, where it's still confined to your breast, your five-year survival outcomes are actually 100 per cent.\n\n\"So it's a really important thing for women to be informed about because they can then have a shared conversation with their GP or their breast specialist about their level of risk of developing breast cancer — and ultimately that knowledge is power.\"\n\nJenny Edwards is currently undergoing radiation treatment. (ABC News: Joel Wilson)\n\nMs Edwards said her message to others who didn't know if they had dense breasts was to \"go get screened\".\n\n\"Now that I know so much more about breast cancer it seems like [breast density checks are] really very important,\" she said.\n\n\"I've got an adult daughter who now, because of her family history, I suspect also has dense breasts.\n\n\"It would be good to know that so she can monitor things earlier than the free mammograms, which kick in at 40.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-02/menindee-lakes-tourism-birdlife-queensland-floodwater/105358708",
    "title": "Tourists and birds flock to outback Menindee Lakes as water rises",
    "publish_date": "Sun, 01 Jun 2025 20:55:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "As water levels steadily rise at Menindee Lakes, so too do the numbers of tourists and birdlife in the area.\n\nFloodwaters from Queensland have been flowing from the northern basin catchments into the lake system for several months.\n\nThe lakes are dotted along the Darling River about 100 kilometres south-east of Broken Hill in far west New South Wales.\n\nThe Menindee Lakes at Sunset Strip look like a dreamscape now that Queensland floodwaters are flowing through. (ABC Broken Hill: Viki Ntafillis)\n\nRiver Lady Tours owner Rob Gregory said tourist numbers in the area had risen on the back of the influx of water.\n\n\"Certainly a lot more people hanging around a bit longer, but our warmer weather has also hung on a bit longer too,\" Mr Gregory said.\n\nRob Gregory says people from all over the world are visiting the region. (ABC Broken Hill: Viki Ntafillis)\n\n\"Normally [by] Anzac Day, it's starting to get down cool but it's taking sort of four weeks and it's still quite pleasant.\n\n\"[There are] a lot of different number plates [on vehicles in the area] … the occasional overseas tourist, as well.\"\n\nA group of pelicans working as a team to catch fish at Menindee Lakes. (Supplied: Jen Tom)\n\nIn an update in April, WaterNSW said modelling suggested 800 to 1,200 gigalitres of water from the northern basin tributaries could be received into the lakes by late May or early June.\n\nThe lakes are sitting at 60 per cent capacity.\n\nAt Kati Thanda-Lake Eyre, an 'inland tsunami' is making a sea Photo shows The surface of Kati Thanda-Lake Eyre. Australia’s biggest lake is believed to have reached capacity on only three occasions in the past 160 years, but the mass of floodwater now flowing into Kati Thanda-Lake Eyre is raising more than river levels.\n\nMr Gregory said so much water had come through the Menindee Lakes, he had to move his tour boat along Wetherell Lake to a spot where he could \"access it a bit easier\".\n\n\"[Tourists] are seeing a few birds, water flows … around where we go, there is a bit of current there which is unusual to see in here because we're normally pretty placid,\" he said.\n\n\"Lots of the dead trees, scarred trees, a few fish surfacing.\n\n\"It's a good look.\"\n\nMr Gregory said when the lakes were at maximum capacity, the 500 square kilometres of water in the middle of the desert made it \"one special region\".\n\n\" It is amazing for people, especially when they drive out from Broken Hill and they see barren plains and savanna grasslands … and then we've got an amazing water system. \"\n\nJen and Bill Tom visited the lakes from Cobram in Victoria. (ABC Broken Hill: Viki Ntafillis)\n\nTourists Bill and Jen Tom made their way to the Menindee Lakes on a five-week road trip.\n\nMs Tom is a keen birdwatcher and Mr Tom made sure to bring his bagpipes with him, which he played by the lakes.\n\nBirdwatchers are heading to the Menindee Lakes as the inflow of water attracts species such as cormorants. (ABC News: Niall Lenihan, file photo)\n\n\"We live on the Murray at Cobram [Victoria], and it's nice to see the contrast in the [Darling and Murray] rivers,\" Mr Tom said.\n\n\"I'm also interested in seeing what's happening here at the lakes. It's beautiful to see, there's so much water coming down.\"\n\nBirdwatching is a popular pastime at Menindee Lakes, particularly at Lake Pamamaroo. (ABC Broken Hill: Viki Ntafillis)\n\nMenindee publican Deena Tangey said she had seen an uptick in the number of people around town, with people visiting from all around the country.\n\nShe said the pub's lunch service had \"probably doubled\" in the past three months.\n\n\"Meals have gone through the roof at lunchtimes,\" Ms Tangey said.\n\n\"In the summer, you might do eight or nine tables … now we're doing anywhere from 15 and above.\"\n\nDeena Tangey says the pub's lunch service has doubled since the lakes began filling up. (ABC Broken Hill: Viki Ntafillis)\n\nMs Tangey said residents and tourists alike were having luck fishing — but as for where, she couldn't say.\n\n\"The fish are on, everyone's catching fish, and they're catching quite a big perch,\" Ms Tangey said.\n\n\"I don't know where because that's a big secret. 'In the water,' you get told.\"\n\nCopi Hollow is one of the smaller bodies of water in the Menindee Lakes system. (ABC Broken Hill: Viki Ntafillis)",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/why-did-trump-double-his-steel-tariffs-because-he-could-20250602-p5m42l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why did Trump double his steel tariffs? Because he could",
    "publish_date": "Mon, 02 Jun 2025 11:57:50 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Apart from trying to show that he still has some, albeit more limited, authority to act on tariffs, Trump’s announcement, to a rally of US steelworks, had a secondary purpose. Loading During last year’s election campaign, Trump was vehemently opposed to a proposed $US15 billion ($23.3 billion) acquisition of US Steel by Japan’s Nippon Steel – as was Joe Biden, who blocked the deal only days before he left office. Both were chasing the votes of steelworkers and their powerful union in the critical swing state of Pennsylvania, where US Steel is headquartered and has its major plants. Having won the election, however, Trump has had a change of mind.\n\nWhile the US will impose some significant conditions on the deal – including, perhaps, a “golden share” that would give the government a veto over major decisions along with a commitment from Nippon Steel to appoint a US chief executive and a majority of Americans to the board – it now appears that he will approve the deal, even though he says he hasn’t seen its final details. Nippon Steel, one of the world’s most sophisticated steel producers, has promised to invest about $US14 billion in US Steel’s operations, which have been struggling, shrinking and suffering from under-investment for decades. Trump’s doubling of the tariff rate for steel and aluminium is a way of justifying the decision to approve the deal, as well as enhancing the economics of US Steel and other US steelmakers and helping to underwrite Nippon Steel’s massive investments, most of which will occur over the next four years. Trump’s original tariffs on steel and aluminium infuriated America’s trade partners, including Australia, even though Australia’s exports of those metals to the US are quite modest. Canada, whose steel exports represent about a quarter of US steel imports and half its aluminium imports, has far more at stake.\n\nMexico, Brazil, South Korea, Vietnam, Japan and European nations will also be impacted, with Canada and the European Union already threatening retaliation, as they did in response to Trump’s initial 25 per cent tariffs. Australia is still, probably fruitlessly, seeking an exemption. Loading The decision to allow the Nippon Streel deal to proceed, if that is the outcome, is good policy. The US steel industry is small – about half the size it was half a century ago – and has been shrinking. It has poor profitability and ageing technology. Nippon Steel’s investment and its technologies can arrest that decline. The decision to double the tariffs on steel – indeed the original decision to impose the 25 per cent tariff – is, however, poor policy. It will increase investment in the sector, and will probably improve its profitability, plant utilisation rates and employment numbers. But that will come at a significant cost.\n\nIn 2018, when Trump first imposed tariffs on imported steel, steel prices rose almost 10 per cent, the sector’s profits rose by about $US2.5 billion, capacity utilisation jumped from 74 per cent to about 80 per cent and nearly 10,000 jobs were added within the sector. The impact was quite short-lived, with those numbers subsequently reversing as the industry resumed its long-term decline. The initial impact was predictable. Tariffs are protectionist. They protect domestic industries and companies from more efficient producers elsewhere by boosting their sales, margins and profits. That’s what happened after the 2018 tariffs. Loading They come, however, at a cost to the customers of the protected industries, which is also what happened after Trump’s 2018 tariffs were imposed. A Peterson Institute for International Economics study concluded that the 2018 tariffs cost US downstream steel-using industries about $US5.6 billion, or about $US650,000 for each new job they added in the steel sector. The US Federal Reserve Board concluded that they cost about 75,000 jobs in those downstream industries, or more than eight times the number of jobs added by the steelmakers.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/property/news/st-kilda-east-home-fails-to-sell-after-only-bidder-didn-t-show-up-20250602-p5m433.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "St Kilda East home fails to sell after only bidder didn’t show up",
    "publish_date": "Mon, 02 Jun 2025 11:57:06 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "Perruzza said he was seeing an increasing number of properties selling through private sale rather than at auction. Loading “Sales are being made, but auctions are very hit and miss,” he said. A nearby home, 4 Maryville Street in Ripponlea, also failed to secure any bids at auction. Listed with a price range of $2.875 million to $3.15 million, the four-bedroom, renovated home is located in the coveted Brunning estate.\n\n“It is a tightly held suburb, so it’s not very often you get the opportunity to buy a block this big,” said lead agent Rachael O’Connor from McGrath Estate Agents St Kilda. While one registered bidder was at the auction, O’Connor said they didn’t make a bid and declined to negotiate privately afterwards. O’Connor had been hopeful that more stock would come onto the market in the area after the federal election, but that has not happened. “It’s one of the lowest levels of quality stock I’ve seen,” she said.\n\nThe two homes were among 1417 scheduled auctions across Melbourne over the past week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 70.3 per cent from 1048 reported results, while 105 auctions were withdrawn. Loading Separate figures from Cotality, formerly CoreLogic, found Melbourne home values rose 0.4 per cent in May. Louis Christopher, the general manager and head of research at SQM, cautioned against hastily interpreting the week’s auction results, as they were affected by a surge in auction volume due to coming King’s Birthday long weekend. “The amount of auction stock substantially increased from last week; it’s in excess of 30 per cent since,” he said.\n\n“Long weekends are usually quiet on the auction front, and if sellers realise that their auction date falls on a long weekend, they often bring the date forward, which is why we see this spike.” In Chelsea, a 1920s period weatherboard home sold $255,000 over the reserve, for $1.505 million. The home at 32 Catherine Street had a price guide of $1.18 million to $1.22 million, with a reserve of $1.25 million. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide. Lead agent Ruben Gueli from Ray White Chelsea, said the result “eclipsed expectations”.\n\nLoading There were 10 registered bidders, six of whom were active in the auction. “The proceedings kicked off with a bang,” Gueli said. “The opening bid came in $110,000 above the top of the price range. This shocked everyone and really set the tone for the rest of the competitive auction.” The auction finale was a tussle between two couples who were drawn to the beachside location and quality renovation.\n\n“They were going bid for bid, but it was ultimately sold to a young couple starting a family,” Gueli said. The sellers had owned the property for 10 years, one of whom was Ray White Judd White director Andrew Dimashki. In Footscray, a three-bedroom period home passed in at auction but sold in private negotiation for $865,000 afterwards. The home at 68 Essex Street was listed with a price guide of $800,000 to its reserve price of $870,000.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-cyclist-dies-after-collision-with-train-20250530-p5m3kq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Cyclist dies after collision with train; Murder-accused mother dies after being found unresponsive in cell; Crisafulli rebukes calls to abandon net zero targets",
    "publish_date": "Mon, 02 Jun 2025 11:55:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Premier David Crisafulli has rebuked calls from some Liberal-National colleagues in Canberra to abandon net-zero emissions targets, saying he is focused on a balanced approach that can bolster the state’s agricultural industries while supporting the expansion of renewable energy.\n\nCrisafulli refused to walk away from net-zero targets while speaking to the ABC this morning, amid fierce debate from both sides of the federal Coalition regarding their commitment to emission goals.\n\nQueensland Premier David Crisafulli. Credit: AAPIMAGE\n\n“The markets are demanding we do things to a standard when it comes to emissions as well as protection. We are on a journey to deliver that,” Crisafulli said.\n\n“We are looking at storage options to make sure we bring renewable energy into the grid. That is part of an affordable energy mix.”\n\nCrisafulli’s comments come one day after his government added more than 700 hectares to Queensland’s national parks and nature refuges, as part of efforts to protect the state’s endangered species, ecosystems, biodiversity and threatened flora.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/after-four-titles-tears-and-303-tries-batman-and-robin-finally-face-off-20250602-p5m41g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After four titles, tears and 303 tries, Batman and Robin finally face off",
    "publish_date": "Mon, 02 Jun 2025 11:54:27 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Loading\n\nOn one of the few occasions Nathan Cleary played opposite Jarome Luai, he made the Tigers $1.2 million man cry.\n\nGranted, it was roughly 14 years, four premierships and 90 games of first-grade together ago.\n\n“I’m not sure that will happen again,” Cleary grins, having watched every game Luai has played this year since departing Penrith to lead Benji Marshall’s Concord rebuild.\n\nRegarding himself as the Robin to Cleary’s Batman while steering the Panthers dynasty, Luai takes on his great mate and former halves partner for the first time at NRL level this Sunday at Commbank Stadium.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-albanese-condemns-new-trump-tariffs-ukraine-drones-destroy-41-russian-aircraft-20250602-p5m41a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese condemns new Trump tariffs; Ukraine drones destroy 41 Russian aircraft; Piastri wins Spanish GP",
    "publish_date": "Mon, 02 Jun 2025 11:50:15 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Nationals leader David Littleproud was on Sky News earlier this morning, where he hit out against federal Labor’s 30 per cent tax proposal on any super over $3 million.\n\nLittleproud said the proposal would be especially burdensome on farmers, who will face new cash flow challenges under the new tax.\n\n“This is for everybody, but that is [also] the real experience of what farmers will face when ... they don’t have the cash flow to pay for a tax, but when they get on an unrealised capital gain, on an increase in their property value, it sends them to the wall. This is insanity,” Littleproud said.\n\n“This is where Jim Chalmers must admit he’s got it wrong. Stop being so smug and arrogant and say you got it wrong, and then go back to the drawing board and find other ways to get larger backing.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/property/news/local-buyer-splashes-10-1m-on-sydney-home-he-saw-10-minutes-before-20250602-p5m430.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Local buyer splashes $10.1m on Sydney home he saw 10 minutes before",
    "publish_date": "Mon, 02 Jun 2025 11:48:10 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A buyer who saw the property only 10 minutes before auction, spent $10.1 million on an immaculate turnkey designer home in Strathfield on Saturday.\n\nThe six-bedroom, eight-bathroom home with a parking basement and bowling alley at 131 The Boulevarde was built as a forever home by its vendor.\n\nTwo hundred people watched on as four of the five registered bidders competed for the property in Strathfield’s Golden Mile guided at $8.9 million.\n\nBidding opened at $8.7 million with $100,000 increments, at $9.5 million $200,000 bids accelerated the pace, and a few $50,000 bids were mixed in until it sold under the hammer at $10.1 million meeting its reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/aussie-jet-breaks-10-second-barrier-20250601-p5m3wx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie jet breaks 10-second barrier",
    "publish_date": "Mon, 02 Jun 2025 11:45:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "Aussie jet breaks 10-second barrier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/property/news/sold-for-millions-one-of-west-end-s-last-untouched-queenslanders-20250602-p5m439.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sold for millions: One of West End’s last untouched Queenslanders",
    "publish_date": "Mon, 02 Jun 2025 11:43:26 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "One of West End’s last untouched Queenslanders has sold for $2.5 million in a heated auction that drew a crowd of more than 100.\n\nThe three-bedroom, one-bathroom home – at 22 Sussex Street – has been in the same family since the ’50s and took six months to get market ready, with decades of belongings cleared out and only essential updates made to ensure the property was up to code.\n\nThe home remained ripe for a $1 million-plus renovation – but that didn’t deter 15 registered bidders, drawn in by its elevated, flood-free 536-square-metre block, city views and coveted position within the Brisbane State High catchment.\n\nBidding kicked off at $1.6 million and once down to two bidders, jumped in leaps of $100,000 and $75,000.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/the-harsh-truth-about-australian-rugby-20250601-p5m3vl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The harsh truth about Australian rugby",
    "publish_date": "Mon, 02 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The end of the regular season means it’s time for some uncomfortable truths. Despite the perceived performance benefits of cutting the Rebels, the four remaining Australian sides have actually won fewer games against the Kiwis this year. They have won seven this year compared to nine last year, with the discrepancy explained by both the Reds and Brumbies flipping from a 3-2 trans-Tasman winning record in 2024 to a 2-3 losing one. While the early-season narrative was one of Australian improvement, it quietly flipped about two-thirds of the way through the competition, and the last win against a New Zealand team was the Reds’ victory against the Blues in round 11. It’s an obvious concern on the eve of the British and Lions series.\n\nTwo-tier Super has a problem\n\nThe win-loss record outline above is part of a much broader problem. The top six finishers this year are effectively the same top six teams from the past four years of Super Rugby Pacific. In fact, in the competition’s history (beginning in 2022) only eight teams have finished in the top six, the Waratahs sneaking in twice (6th in 2023 and 6th in 2022) and the Highlanders sneaking in once (6th in 2024). It’s a competition with bedded-in haves and have-nots, as the points differential from this year highlights again. The big six all have positive points differentials, and the rest have deeply negative ones, with the Highlanders the ‘best’ at minus 90. This is one reason why this column has been sympathetic towards Dan McKellar at the Waratahs this year. He’s walked into a job in the current have-nots, and Super Rugby’s lack of player movement makes upward mobility very hard to achieve.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/nsw/penny-s-commute-is-90-minutes-each-way-no-wonder-workers-like-her-are-quitting-20250518-p5m06t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Penny’s commute is 90 minutes each way. No wonder workers like her are quitting",
    "publish_date": "Mon, 02 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade"
    ],
    "text": "A mismatch between where most of Sydney’s care workforce live and where they work is hampering services that support tens of thousands of vulnerable people and taking a toll on the city’s economy.\n\nNew research shows 71 per cent of the city’s care workforce live in greater western Sydney, while at least 50 per cent of the demand for their services – including aged care, childcare and disability care – is in districts to the east of the city, especially the northern beaches.\n\nNurse Penny Farries spends up to an hour and a half commuting to work; long travel times are driving workers out of care jobs. Credit: Max Mason-Hubers\n\nCommunity-based care workers spend an average of 1.5 hours in the car during each work day, while those who catch public transport to work in residential care centres spend an average of 2.3 hours commuting, research by specialist recruitment firm Orchard Talent Group shows.\n\nThe challenge of long commutes is affecting workers in other frontline sectors in Sydney, including health care and emergency services.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/portishead-s-beth-gibbons-offers-darkness-in-shades-of-uncertainty-in-taut-show-20250602-p5m44z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Portishead’s Beth Gibbons offers darkness in shades of uncertainty in taut show",
    "publish_date": "Mon, 02 Jun 2025 11:13:33 +1000",
    "category": "entertainment",
    "authors": [
      "Bernard Zuel"
    ],
    "text": "Within that was the fluidity and coiled spring of an eight-piece band of much more than a dozen parts (Howard Jacobs alone played flute, bass saxophone, tuned percussion and drums; Emma Smith tripled on violin, guitar and vocals; everyone did something extra). Through that was a physical release, almost joyfully so, of some kind of shadow dancing.\n\nIt began with middle eastern flavours, a drone and a hum and sinuous rhythms, and ended with a closed-eyed dance of limbs unfurled beneath rolling drums and chanting under-voices.\n\nHere was a night which could be summarised with its beginning and its end, and yet to do so might also suggest something altogether different than what was experienced.\n\nA sometimes queasy romantic current pulsed within those songs, Tell Me Who You Are Today and Reaching Out, one also evident in the more controlled movement and clearer, if still pock-marked, faith of Lost Changes, a mid-show moment whose refrain of “time changes, life changes/Is what changes thing/We’re all lost together” dispelled and invited darkness at the same time.\n\nAnd how could we not ride the groovy baby groovy splendour of Tom The Model, a song that evoked a never-happened-but-should have ’60s moment of Gene Pitney produced by Neil Diamond. All this was true.\n\nAnd yet inside it all was the other story Beth Gibbons tells, of that darkness in shades of uncertainty, of a taut line holding rhythms close and emotions closer still, of drums as likely to be played with mallets as sticks, sonorous rather than sharp.\n\nAnd most of all of the intensity that held, compelled through everything, broken only when at the end of each song Gibbons – whose voice is unchanged, and if anything even firmer – turned her back, retreated to the even darker space behind and broke from our gaze.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/it-clearly-works-popyrin-reflects-on-career-best-roland-garros-20250602-p5m45n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'It clearly works': Popyrin reflects on career-best Roland-Garros",
    "publish_date": "Mon, 02 Jun 2025 11:07:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "'It clearly works': Popyrin reflects on career-best Roland-Garros\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-up-wall-street-treads-water-20250601-p5m3vn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens lower; Soul Patts and Brickworks jump on $14b merger plan",
    "publish_date": "Mon, 02 Jun 2025 11:06:54 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has dipped lower to start the week as investors remain in a cautious mood as they grapple with US President Donald Trump’s trade wars. Investment firm Soul Patts and brick maker Brickworks soared after announcing a historic $14 billion merger.\n\nThe S&P/ASX200 was down 15.90 points, or 0.2 per cent, at 8418.80 at 11.02am AEST, weighed down by consumer discretionary and energy stocks even as seven of its 11 industry sectors were in the green. The Australian dollar rose 0.5 per cent to 64.60 US cents as of 11.05am.\n\nThe ASX edged lower at the open. Credit: Louie Douvis\n\nBrickworks shares jumped by 16.4 per cent to $32.02 in early trade, while Soul Patts climbed 9.3 per cent after the companies announcing plans to merge after more than five decades of cross-ownership holdings between them.\n\nUnder the proposed deal, Soul Patts shareholders will get one share of the new company for each share they own, while Brickworks investors get 0.82 new company shares for each of their shares, valuing Brickworks’ stock at $30.28 - a 10 per cent premium on Brickworks’ closing share price of $27.51 at the end of last week.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/slater-peppered-on-origin-selection-20250601-p5m3xm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Slater peppered on Origin selection",
    "publish_date": "Mon, 02 Jun 2025 10:54:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Slater peppered on Origin selection\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/how-to-avoid-mid-year-burnout-20250602-p5m456.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to avoid mid-year burnout",
    "publish_date": "Mon, 02 Jun 2025 10:46:13 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "How to avoid mid-year burnout\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/federal-government-weighing-up-taking-trump-tariffs-to-the-wto-midday-news-bulletin-2-june-2025/qqcxpbw2h",
    "title": "Federal government weighs up taking Trump tariffs to the WTO | Midday News Bulletin 2 June 2025",
    "publish_date": "Mon, 2 Jun 2025 02:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe federal government is considering whether to challenge the United States at the World Trade Organisation over Donald Trump's steel and aluminum tariffs.\n\n\n\n\n\nThe U-S president has announced a plan to double tariffs on foreign steel and aluminum imports to 50 per cent, starting on Wednesday [[4 June]].\n\n\n\n\n\nAustralian goods are already subject to a 10 per cent baseline tariff.\n\n\n\n\n\nPrime Minister Anthony Albanese is expected to meet Mr Trump on the sidelines of the G7 summit in Canada later this month [[15-17 June]].\n\n\n\n\n\nHe says he will be making Australia's position very clear through a variety of channels.\n\n\n\n\n\n\"This is an act of economic self-harm by the United States. It will increase costs for consumers in the United States because it is supplied across the board. What it will do is not create any comparative advantage or disadvantage compared with other countries that export into the United States. It is an inappropriate action by the Trump administration.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe federal government is being urged again to consider using targeted sanctions against Israel over its actions in blocking aid in Gaza.\n\n\n\n\n\nLabor party M-P Ed Husic has been joined by former Labor foreign ministers Gareth Evans and Bob Carr - have called for Australia to join the UK, France and Canada in signalling the use of targeted sanctions, if Israel fails to stop the renewed military offensive and lift all of the restrictions on aid.\n\n\n\n\n\nPrime Minister Anthony Albanese has so far rejected the calls, saying he is focused on peace and security for both Israelis and Palestinians rather than soundbites.\n\n\n\n\n\nMr Husic has also urged the federal government to consider backing Palestinian statehood at a UN conference on a two-state solution to be held in New York later this month [[17-20 June]].\n\n\n\n\n\nActivist Reem Borrows, from Palestine Australia Relief and Action, has told SBS Arabic much stronger intervention is needed from the Australian government.\n\n\n\n\n\n\"The responsibility is on the globe, Australia included, to finish this with justice, freedom for all. The first step is to stop what is happening in Gaza, that’s the first step, but not only to treat the symptoms. This is what we’ve got be very careful of.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe federal opposition is accusing social media giant TikTok of trying to bully Australia on the issue of social media age restrictions.\n\n\n\n\n\nThe laws passed during the last federal parliament putting in place a ban for those aged under 16 from using platforms like Instagram, Facebook, and TikTok comes into force in December.\n\n\n\n\n\nTikTok last week brought four and half pages of national newspaper advertising challenging the government on the issue.\n\n\n\n\n\nBut senior opposition frontbencher, James Paterson, has told the Nine Network that TikTok, unlike some other platforms, has no educational value, and kids needs to be protected from some of the content on it.\n\n\n\n\n\n\"It's really important that the Prime Minister doesn't back down here. Because TikTok is not a safe place for children. And surely every parent who's seen the effects of these social media platforms would understand and agree with that. There is no educational content on TikTok, and that is not what kids are getting from TikTok- it's a lot of other stuff, frankly, that is not appropriate for them at their age. So, I really hope the Prime Minister shows some strength here, doesn't back down to this attempted bullying campaing from TikTok, and makes sure that children are protected from what is a really harmful platform.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe Business Council of Australia has called on the federal government to have a focus on supporting innovation in its strategy to regulate A-I.\n\n\n\n\n\nIn a new report, the group warns against over-regulation, saying the country has vast land resources that could be used for data centres for AI.\n\n\n\n\n\nThe report says that Australians more than people in many other countries, express nervousness about AI, and that could lead to over-regulation\n\n\n\n\n\nThere are no specific laws or regulations that directly regulate AI in Australia.\n\n\n\n\n\nThe federal government is considering different reform options to mandate guardrails for AI systems deemed high risk, including introducing a new AI Act.\n\n\n\n\n\n+++\n\n\n\n\n\nThe New South Wales government is investing more than half a billion dollars in dealing with domestic violence, trying to fix what it says has been years of neglect in regards to the issue.\n\n\n\n\n\nThe state budget, to be handed down on the 24th of June, will provide 227 million dollars over five years for the state's victim support service.\n\n\n\n\n\nAnother 50 million dollars will be allocated towards measures to make it easier for victim-survivors to give evidence in court, via remote courtrooms, making sure they don't have to attend the same court complex as their alleged abuser.\n\n\n\n\n\nA hub will also be built to provide counselling, legal aid, and financial advice to those impacted.\n\n\n\n\n\nIt will open in late 2027.\n\n\n\n\n\nAnd if you or someone you know needs support.. you can seek 24 hour help through a phone call to 1800 RESPECT.\n\n\n\n\n\nThat's 1800 737 732.\n\n\n\n\n\n+++\n\n\n\n\n\nExit polls released on the second round of Poland's presidential election shows the contest is too close to call.\n\n\n\n\n\nOfficial results are due later today [[Mon morning local time]].\n\n\n\n\n\nTwo exit polls show the pro-European Warsaw mayor, Rafał Trzaskowski, very marginally ahead of the historian and former amateur boxer Karol Nawrocki.\n\n\n\n\n\nThat hasn't stopped Mr Trzaskowski claiming victory in front of cheering supporters in Warsaw.\n\n\n\n\n\n(Polish then translated into English): \"This is truly a special moment in Polish history. I am convinced that it will help us all move forward like a torpedo and focus primarily on the future. This is what I was very keen on throughout this campaign, to tell all Polish women and men that I will unite, I will build. I will truly be the president of all Polish women nd men, I will be your president.\"\n\n\n\n\n\nMr Nawrocki says it is too early to call the election result, but he believes he will win.\n\n\n\n\n\n+++\n\n\n\n\n\nIn the United States, multiple people have been injured in an attack in the city of Boulder in northern Colorado.\n\n\n\n\n\nWitnesses say a man threw bottles that apparently contained flammable liquid, which hit the ground and exploded in flames.\n\n\n\n\n\nA suspect is in custody and police are investigating what FBI officials immediately called a targeted terror attack.\n\n\n\n\n\nHowever, local authorities say it is too early to know the motive of the attack.\n\n\n\n\n\nStephen Redfearn is the chief of Boulder Police.\n\n\n\n\n\n\"When we arrived, we encountered multiple victims that were injured with injuries consistent with burns and other injuries... There was group of pro-Israel. People that were there in a peaceful demonstration. I wouldn't even call it a protest. They were there in that area. We're looking and actively interviewing victims and witnesses to determine if that group was targeted or others. And we just don't have those answers yet.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Joe Montemurro will be the new coach of the Matildas.\n\n\n\n\n\nHe's signed a three year deal to be coach of the national side through the 2028 Los Angeles Olympics, a period which will also inlcude the 2026 Asian Cup on home soil, and the 2027 World Cup in Brazil.\n\n\n\n\n\nThe 55-year-old Aussie was most recently coach of French side Lyon [[lee-on]].\n\n\n\n\n\nHe's previously coached English side Arsenal, Italian side Juventus, and A-League side Melbourne City to women's league titles.\n\n\n\n\n\nMontemurro's hiring ends the long search for a successor to Tony Gustavsson, who left after the Olympics last year.\n\n\n\n\n\nInterim coach Tom Sermanni will coach tonight's [[mon]] game against Argentina in Canberra.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/natural-disasters-cost-australian-economy-an-estimated-2-2-billion/omqmwmfou",
    "title": "Natural disasters cost Australian economy an estimated $2.2 billion in 2025",
    "publish_date": "Sun, 1 Jun 2025 22:04:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points A new Treasury analysis estimates natural disasters caused a $2.2 billion decline in economic activity in 2025.\n\nMajor disasters include Cyclone Alfred and widespread flooding in NSW and Queensland.\n\nPartial data for March quarter shows disasters particularly impacted retail trade and household spending.\n\nThe cost of lost economic activity because of natural disasters in 2025 has been estimated at $2.2 billion, after Treasury analysed the impacts of Cyclone Alfred and floods across NSW and Queensland.\n\n\n\n\n\nPartial data for the March quarter shows natural disasters particularly impacted retail trade and household spending.\n\n\n\n\n\nThe $2.2 billion figure is based on Treasury's initial assessment at the time of the disasters and there may be rebuilding activity in future quarters.\n\n\n\n\n\nMost of the overall immediate loss in economic activity is expected to impact the March quarter, which will be reflected in the March quarter National Accounts, to be released on Wednesday.\n\n\n\nTreasurer Jim Chalmers said the government's top priority was to help fund the recovery and rebuilding of communities.\n\n\n\n\n\n\"The human impacts matter to us most but the economic cost is very significant too and we'll see that in Wednesday's National Accounts,\" he said.\n\n\n\n\n\n\"Because of the progress Australians have made together in the economy, with inflation down, debt down and unemployment low, we're in a stronger position to provide support when communities need it most.\"\n\n\n\nNominal retail trade in Queensland fell 0.3 per cent in February and 0.4 per cent in March.\n\n\n\n\n\nIn volume terms, the Australian Bureau of Statistics' monthly household spending indicator was flat in the March quarter, with a 0.2 per cent fall in Queensland contributing to this.\n\n\n\n\n\nFlooding in NSW in late May, from the Hunter to the mid-north coast, has left 10,000 homes and businesses damaged or destroyed . The Insurance Council of Australia reported that more than 6,000 insurance claims have been made.\n\n\n\nIn early March, Tropical Cyclone Alfred crossed the coast on Moreton Island and subsequently caused widespread damage and flooding to communities across south-east Queensland and northern NSW.\n\n\n\n\n\nProlonged downpours in south-west and central Queensland in late March and early April flooded a vast area spanning about one million square kilometres.\n\n\n\n\n\nThe government's Disaster Assist website lists 27 separate natural disasters from January-May, consisting of flooding, storms, cyclones and bushfires.\n\n\n\n\n\nOpposition leader Sussan Ley will visit flood-affected communities on the mid-north coast on Monday with local MPs.\n\n\n\nEmergency Management Minister Kristy McBain said the government was funding measures to increase resilience, adaptability and preparedness, and the Disaster Ready Fund initiative would provide another $200 million in 2025-26.\n\n\n\n\n\n\"I have recently been on the ground in NSW seeing first-hand the effects a disaster can have, and it is my priority to work closely with all levels of government to ensure support is provided as quickly as possible.\n\n\n\n\n\n\"We have activated multiple disaster payments and we will continue to work with NSW on any other funding requests and I have been meeting with small business and primary producers who have been hit hard.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/50-years-of-sbs-more-than-simply-sexy-movies-and-soccer/kv09ryd7z",
    "title": "50 years of SBS: More than simply sexy movies and soccer",
    "publish_date": "Sun, 1 Jun 2025 21:32:59 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nProduced in collaboration with SBS Vietnamese, Khmer and Tetum.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Music)\n\n\n\n\n\nWhichever way you look at it, 50 is a milestone birthday.\n\n\n\n\n\nAnd it's one SBS - the Special Broadcasting Service - is celebrating in 2025.\n\n\n\n\n\nIt all began back in 1975.\n\n\n\n\n\nBefore SBS emerged on television and digital platforms, it was a radio station.\n\n\n\n\n\nOn June the 9th, 1975, former immigration minister Al Grassby [[graz-bee]] launched Radio Ethnic Australia with the aim of explaining the new Medibank scheme to migrant groups in different languages.\n\n\n\n\n\n\"This is Al Grassby on behalf of the Australian Community Relations Office welcoming you all to Radio 2EA. The voice of ethnic Australia. Today the program is in Greek.\" A Greek translation of the above words follows.\n\n\n\n\n\nBroadcasting began in seven languages in Sydney on 2EA, and eight on Melbourne's 3EA, with the first broadcast as you just heard in Greek.\n\n\n\n\n\nSBS, as it's now known, emerged just two years after the country abolished the Immigration Restriction Act - mostly known as the White Australia Policy.\n\n\n\n\n\nCultural historian and Emeritus Professor Ien Ang from the University of Western Sydney authored \"The SBS Story\" published in 2008.\n\n\n\n\n\nShe says the abolition of the policy was a turning point for Australia.\n\n\n\n\n\n\"That was the early 1970s when finally the White Australia policy was officially abolished and that made it possible for migrants to come into Australia irrespective of racial categories. So before that, of course there was this assumption that only people who were white could come into Australia after the abolition of the White Australia policy migrants came into Australia from all over the world, and especially from Asian countries. But also from the Middle East and much later from Africa and so forth.\"\n\n\n\n\n\nThe policy dated back to Federation coming into law in 1901.\n\n\n\n\n\nAt its core it was about excluding non-European immigrants from Australia and it took more than 70 years for the policy to be officially scrapped.\n\n\n\n\n\nThat happened in 1973 when the final remnants of the policy were removed.\n\n\n\n\n\nIt was a time of great change in Australia - racial barriers of all kinds were being broken.\n\n\n\n\n\nAnd it had only been a couple years since Indigenous Australians were recognised as citizens in a 1967 referendum.\n\n\n\n\n\nThis is Australian civil rights activist Faith Bandler speaking ahead of the 1967 referendum to Channel 7.\n\n\n\n\n\n\"I don't think that we should take it for granted that there will be a yes vote for the Aborigine. And I feel that the time has come that Australia can no longer tolerate legal discrimination against its Indigenous people.\"\n\n\n\n\n\n1975 also saw the largest constitutional crisis ever to grip the nation.\n\n\n\n\n\n\"Well may we say God save the Queen because nothing will save the Governor-General (cheers).\"\n\n\n\n\n\nThat's former Prime Minister Gough Whitlam whose government was dismissed in 1975, the first and only Australian government to ever be dismissed by the Governor-General.\n\n\n\n\n\nOne of the legacies of the Whitlam government is that it was the first to refer to Australia as a multicultural nation.\n\n\n\n\n\nThe Opposition at the time had also made speeches about multiculturalism.\n\n\n\n\n\nMalcolm Frazer's Liberal government, which took power in 1975, opened the door for refugees fleeing the Vietnam war to come to Australia.\n\n\n\n\n\nJock Collins, who was a Professor of Social Economics at the University of Technology for 45 years, says this marked a cultural shift in Australia' s refugee intake program.\n\n\n\n\n\n\"The Fraser government at the time was very open to the boat people and to refugees in contrast maybe to some of the political parties today. And that was the beginning of a massive change because up till that time, the government in 47 promised nine out of 10 immigrants to Australia would be Britain and British. That didn't happen. And we had to take in refugees from displaced people from Eastern Europe and southern Europeans to keep the numbers up. We could never attract as many Brits as we wanted, but until that moment we really weren't getting any Asian or coloured immigrants. And of course, 75 with the Vietnamese boat people today jumped very quickly forward. The largest immigrant intakes are Indian and Chinese immigrants who of course were blocked because of the white Australian policy then. So really there's been a dramatic change since the mid seventies in the Australian immigration history and story.\"\n\n\n\n\n\nIn 1977, the Vietnamese community got their first radio program on SBS.\n\n\n\n\n\nNicky Chung's parents fled the Vietnam war in the 1970s - making Australia home.\n\n\n\n\n\nShe says when her family arrived after the war, SBS was a vital source of information.\n\n\n\n\n\n\"I can really talk from personal experience there because our family came over in 1979 after the fall of Saigon, and we were connected with SBS media as soon as we were here, really very shortly after. I know that from a personal experience in our family, we used to watch the news every night. When I spoke with my parents about our experience with SBS, it was very much about being able to have a very trusted media source too. The reality was that when we first arrived, we really wanted to understand the culture here in Australia very quickly. We still, though, wanted to stay connected to what was happening around the world, including Vietnam.\"\n\n\n\n\n\nMs Chung is now the CEO of the Australian Vietnamese Women's Association.\n\n\n\n\n\nFifty years since the fall of Saigon she says her dad still listens to the Vietnamese program.\n\n\n\n\n\n\"My dad says, he still goes for his morning walks and he has said to me, he streams SBS from the app to listen to good news where his words and good items to keep abreast of what's happening around Australia, around other world.\"\n\n\n\n\n\nThe 1970s were also a time when Australia started to question the policy of assimilation - the idea that migrants had to become Australian as quickly as possible - whatever that meant.\n\n\n\n\n\nBut it wasn't as if multiculturalism was anything new in Australia.\n\n\n\n\n\nFor around 65,000 years Aboriginal and Torres Strait Islander peoples have lived here making up of more than 250 language and tribal groups.\n\n\n\n\n\nAnd today SBS's NITV provides Indigenous content for Australian audiences.\n\n\n\n\n\nHistorically, Dr Professor Ang says almost every society has had multiple cultural influences, whether through, trade, colonisation or other means.\n\n\n\n\n\n\"When you think of diverse societies, how successful they are, not just in recent times, but historically I think it's quite clear that openness to diversity is in a way an important driver for much more dynamic cross-cultural influences that then become creative forces in society.\"\n\n\n\n\n\n1975 also saw the Khmer Rouge regime take power in Cambodia under the rule of Pol Pot.\n\n\n\n\n\nAt least 1.5 million Cambodians died from starvation, forced labour or execution under the regime that became known as the killing fields.\n\n\n\n\n\nHere's a report from the ABC at the time.\n\n\n\n\n\n\"The Khmer Rouge leaders planned to remould Cambodia into a rural Communist utopia and would spare not life to do it.\"\n\n\n\n\n\nThis saw a wave of refugees and immigrants arrive in Australia from Cambodia.\n\n\n\n\n\nThe first significant wave occurred after the late 1970s.\n\n\n\n\n\nBefore then many Cambodians spent years in refugee camps in neighbouring countries such as Thailand before relocating to Australia.\n\n\n\n\n\nFor Phiny Ung 1975 was a significant year - for all the wrong reasons.\n\n\n\n\n\nIt was the year she and her family were forced to flee Cambodia to save their lives.\n\n\n\n\n\n\"Every year for me 17th of April, It's a really significant day that I become numb. I try, not that I try to forget, but I do not want to think about it, but it's always there. So I knew it is anniversary of that time no matter where I go and no different for this year. And I try to keep quiet and think back of that time, it just like yesterday, 50 years, but it was just like yesterday. It was a lot. Or we do remember that we have to leave the city by force.\"\n\n\n\n\n\nThe growing Khmer-speaking community from Cambodia saw the introduction of the first Khmer program on SBS Radio back in 1979.\n\n\n\n\n\nAt around the same time colour TV was quickly becoming common in many Australian households.\n\n\n\n\n\nBy 1980 SBS took its next big step forward launching a television channel for the very first time.\n\n\n\n\n\n\"Television will never be the same again because of us. Good evening. Welcome to the first edition of your Dateline. I'm Mike Carey. I'm Jana Wendt. Good day. Welcome.\"\n\n\n\n\n\nThe new TV station offered world news, documentaries and international movies, cementing its place on the Australian media landscape.\n\n\n\n\n\nOn the ground Australia was rapidly evolving into the multilingual nation we see today.\n\n\n\n\n\nMore migrants and refugees arrived from Asia and the Middle East.\n\n\n\n\n\nIn particular the civil war in Lebanon which started in 1975 and ended 15 years later, saw the growth of this community in Australia.\n\n\n\n\n\nArabic was introduced into the SBS Radio fold - which has now expanded into a 24-hour digital audio channel.\n\n\n\n\n\n(An excerpt from the Arabic program)\n\n\n\n\n\nIn politics the Labor government of Bob Hawke elected in 1983 brought in a new era of multicultural and immigration policy\n\n\n\n\n\nSince then multiculturalism has evolved beyond a philosophy and is now a reality in modern Australian.\n\n\n\n\n\nProfessor Jock Collins again.\n\n\n\n\n\n\"I think multiculturalism had its peaks and troughs. It probably grew to a peak under the Keating Hawke- Labor government where multicultural was really championed by those governments and by the head of FECCA, the Federation of Ethnic Communities Council was a very powerful ear in government policy and consulting since that time, various have sort of lost some enthusiasm for it. It still remains an official type of policy.\"\n\n\n\n\n\nMeanwhile, SBS was increasingly the place to go for fans of football or soccer encouraged by the National Soccer League launched in 1977.\n\n\n\n\n\n(Commentator: \"Good evening, welcome to World Soccer.\")\n\n\n\n\n\nBy the mid 1990s more languages were introduced into the SBS radio schedule and a thing called the internet began to go mainstream.\n\n\n\n\n\nThis marked the start of a revolution in how people now consume media.\n\n\n\n\n\nMobile phones are now a one stop listening and viewing shop for most Australians.\n\n\n\n\n\nThe shift from a community service in 1975 to a digital streaming powerhouse has been a successful one for SBS.\n\n\n\n\n\nManaging director of SBS James Taylor says SBS is also about providing value for Australian taxpayers who partly fund the broadcaster.\n\n\n\n\n\n\"We've got the highest volumes of multilingual content than ever before in our history. And in 60 languages. We're also being acknowledged across a number of other fronts. We've got the highest rating Australian streaming platform through SBS on demand, and we are the podcaster of the year, three years in a row. These are all things to really be celebrated. We're a public good, we are in part funded by the public, and it's really important for us to be delivering more and more value each year to Australians.\"\n\n\n\n\n\nAnd one of those 60 languages is Tetum, introduced in 2023.\n\n\n\n\n\nTetum is a language spoken on the island of Timor, which saw a big wave of migration to Australia in the wake of civil unrest and the Indonesian invasion in 1975.\n\n\n\n\n\nFleeing conflict, the community has established its roots across the country while maintaining its language and traditions.\n\n\n\n\n\nJose Pires was 8 years old when his family fled violence in what was then known as East Timor in 1975.\n\n\n\n\n\nAfter a three-day journey on a Norwegian cargo ship, they arrived in Darwin.\n\n\n\n\n\n\"It all seemed like it happened very quickly. The civil war broke out. I was in school in Timor. And within a couple of weeks I was in Australia in a different place. We fled from our home to a house near the port and then we could not get there in the day, there was too much fighting a lot of shooting around that I can recall and early the next morning we were able to sneak in and managed to get on the port.\"\n\n\n\n\n\nTimor-Leste achieved Independence from Indonesia in 2002.\n\n\n\n\n\nAs for SBS it now broadcasts in 60 languages across audio, digital and television.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/going-to-get-worse-why-sams-dream-home-came-with-a-30-000-insurance-dilemma/zpfdhtoto",
    "title": "'Going to get worse': Why Sam's dream home came with a $30,000 insurance dilemma",
    "publish_date": "Sun, 1 Jun 2025 19:48:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sam Halloran wanted to raise his son in the house his father Leigh raised him in.\n\n\n\n\n\nBut their dream turned to a nightmare as the biggest flood in living memory tore through their community in May.\n\n\n\n\n\nThe Manning River rose so quickly that Sam, his wife and two-year-old son became trapped on the second level of their riverside home just outside the Taree CBD, in Glenthorne, NSW.\n\n\n\n\n\nHis wife and son were airlifted to safety by helicopter, in a dramatic rescue Sam filmed from their balcony.\n\n\n\n\n\n\"It was a big ordeal,\" Sam told SBS News.\n\n\n\n\n\n\"My wife and son were airlifted by PolAir first. Then they came back and got my roommate who's been living downstairs with us.\n\n\n\n\n\n\"They were going to take me as well, but they couldn't take our two dogs.”\n\n\n\nOn Facebook Sam wrote of the rescue: \"Probably the most traumatic thing I've ever endured having to restrain my beautiful two year old son in this bag screaming while his mum was being lifted up and pass him onto the roof to be lifted into the air with her.\"\n\n\n\n\n\nSam said he decided to stay and wait for a State Emergency Service boat.\n\n\n\n\n\n\"They eventually did come. They came and got me with the two dogs,\" he said.\n\n\n\n\n\n\"There was a moment there where we thought we might not get the dogs out, so when that did happen, it was quite a relief.\"\n\n\n\nSam said he launched straight into the cleanup and hasn't fully processed being rescued and coming back to a house left ruined by floodwater, mud and debris.\n\n\n\n\n\nSam's two-year-old son has been having nightmares about the helicopter rescue, he said.\n\n\n\n\n\n\"I've got to be here [for the cleanup], but it's getting harder to get out of bed.\"\n\n\n\nSam Halloran and his neighbours resorted to starting a fire to burn off debris left by the floods, their entire street lined with mud, household goods, pieces of fencing and walls, as residents launched into a massive cleanup effort. Source: SBS News\n\nInsurance 'skyrocketed' after 2021 floods\n\nProtecting Sam's dream home and his young family's future was put at a very high price.\n\n\n\n\n\n\"We had one insurance company that would have insured us, but it was over $30,000 a year, which we couldn't afford,” Sam said.\n\n\n\n\n\nThe quote provided to Sam in August last year, seen by SBS News, shows the annual premium for standard building and contents insurance on their home was priced at $29,817.91.\n\n\n\n\n\nInsurance premiums in the area soared out of reach for most after floods in 2021.\n\n\n\n\n\nThis year in the Manning Valley, the flood reached more than a metre higher than four years ago, so the insurance problem is only expected to worsen.\n\n\n\n\n\n\"There's going to be people that were insured that won't be insured moving forward,\" Sam said.\n\n\n\n\n\nLeigh, Sam's father, says he purchased insurance on the same home in 2002.\n\n\n\n\"I think I paid about $700 to insure the house. Yes, it was 20 years ago, but it's not comparable, is it?\" Leigh said.\n\n\n\n\n\n\"Insurance companies, sure, they're there to make a profit. I understand that. They wouldn't exist without profit.\n\n\n\n\n\n\"But at the end of the day, they're putting premiums up far beyond the average household's budget.\"\n\n\n\n\n\nThe Hallorans said they'd only heard of one person in the area who was insured, but their premium was still over $10,000 a year.\n\n\n\n\n\nOn their street, they didn't know of anyone able to afford the exorbitant premiums.\n\n\n\n\n\n\"No one in this entire street has flood insurance because they are all quoted around the $30,000 mark,\" Leigh said.\n\n\n\n\n\nIn April, financial comparison site Canstar published its analysis of average annual premiums for home and contents insurance across Australia.\n\n\n\n\n\nIn NSW, the average combined policy costs $2,210, based on homes valued between $300,000 and $1.5 million with $50,000 in contents cover.\n\n\n\nSam Halloran was looking forward to raising his son on this picturesque street in Glenthorne, NSW. But he says insurance was out of reach for him and all of his neighbours. Source: SBS News\n\nInsurance companies, government under pressure to address growing problem\n\nThe Insurance Council of Australia has declared the recent NSW floods an 'insurance catastrophe', with nearly 8,000 claims processed as of Saturday.\n\n\n\n\n\nUp to 10,000 homes have been damaged or destroyed, with more than 800 already declared uninhabitable.\n\n\n\n\n\nDuring a visit to Taree on Tuesday, SBS News asked Insurance Council of Australia CEO Andrew Hall whether he would support reforms to assist people who can't afford to insure their properties or businesses in flood zones.\n\n\n\n\n\n\"When we see that happen and particularly in events like we're going through here at the moment, it underscores the point that we have been making now for a number of years to government,\" Hall said.\n\n\n\n\n\n\"Insurance prices [relate to] the risk, and we know that in Australia there are around 220,000 homes that are built in high-risk flood zones like where we are right now.\n\n\n\n\n\n\"We need to come up with a flood defence fund that can better flood-proof those properties, that can lift the home out of harm's way and, worst-case scenario, we may have to look at buybacks.\"\n\n\n\nHuge amounts of debris washed up against the back porch of this home in Taree show the scale of the damage caused by the floods. Source: SBS News Prime Minister Anthony Albanese, also speaking in Taree on Tuesday, acknowledged \"there are longer-term issues that need to be looked at\" to address the insurance problem.\n\n\n\n\n\n\"We recognise that people are doing it really tough. I've said that more support is going to be needed,\" Albanese said.\n\n\n\n\n\n\"We expect insurance companies to do right by their customers and swiftly process claims. They've set up an office here so that they can be dealt with swiftly.\n\n\n\n\n\n\"But our focus now is on the cleanup and recovery from this event. That's our focus, the immediate needs.\"\n\n\n\nFederal Minister for Emergency Management Kristy McBain also told ABC's RN Breakfast program on Wednesday that insurance in flood-prone areas was a \"significant concern\".\n\n\n\n\n\n\"We know for a number of the businesses and the farms that we spoke to, they either haven't been offered insurance or insurance was too expensive for them to take up,\" McBain said.\n\n\n\n\n\nShe said she and Assistant Treasurer Daniel Mulino would be having direct discussions with insurance companies and the Insurance Council.\n\n\n\n\n\nSam Halloran told SBS News that the immediate relief provided by the federal government wasn't proportionate to the scale of the cleanup and recovery facing the community.\n\n\n\n\n\n\"Seventy people from the [Australian Defence Force] … we've had more volunteers than that just in our street alone in the last week, so I don't know what 70 ADF members are supposed to do,\" he said.\n\n\n\n\n\n\"I've got people here working that have run their own businesses, they're sole operators, and they've donated their time to help me.\n\n\n\n\n\n\"We need machinery. At my place alone, there is something like 400 trucks worth of silt to get rid of.\"\n\n\n\nInsurance hike set to become 'unfathomable'\n\nA few doors down from the Hallorans, Daryl Hammond owns a farm. His main business is producing feed.\n\n\n\n\n\nThe seasonal nature of his business, he says, means insurance is nearly impossible for him to get.\n\n\n\n\n\n\"I can't insure anything because last month I had over 1,000 bales of silage. Come the end of July, August, I might have 50. How can I insure something like that?\" Hammond told SBS News last week.\n\n\n\n\n\n\"I'd be onto the broker every second day. It would cost me $20,000 [to] $30,000 a year just to have everything insured if I could insure it. And, I mean, mostly [the insurance companies] just shake their head.\"\n\n\n\nFeed producer Daryl Hammond told SBS News his business was impossible to insure, given the seasonal nature of his industry, and the flood-prone area in which he operates. Source: SBS News For Hammond, the Hallorans and their neighbours, they want to see change. The community wants to keep living where they have deep roots and connections, but also wants a way to protect their future.\n\n\n\n\n\n\"Houses like this are not a river frontage, there is a farm between us and the river. At the end of the day, yes, it's in a flood zone, but [the insurance] is becoming unfathomable,\" Leigh Halloran said.\n\n\n\n\n\n\"Sam spent his teenage years here. It's a great community. Everyone just gets on perfectly, and it was a great place for him to grow up, and he wants to raise his son in this community, you know? Which is really, really nice.\"\n\n\n\n\n\nSam Halloran says it's impossible to predict what Mother Nature is going to do, but all levels of government need to work harder to prevent the impact of disasters on regional communities.\n\n\n\n\n\n\"The 100-year flood development control in our local council area is, at the moment, 5.2 metres,\" he said.\n\n\n\n\n\n\"Anyone building a new house had to have a floor level of 5.7 metres. This flood was nearly 6.5 metres. So, someone could have built a brand-new house close to the river, had full insurance and still had this water through the house.\n\n\n\n\n\n“It's something that we can't control. You can't not live near the river.\"\n\n\n\n\n\nSam says with the level of damage seen in the homes and businesses of Taree, insuring \"is going to get worse, not better\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-defies-calls-from-the-us-for-australia-to-hike-defence-spending/r8mfvj2ya",
    "title": "Prime Minister defies calls from the US for Australia to hike defence spending",
    "publish_date": "Sun, 1 Jun 2025 08:29:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese is pushing back against US calls for countries in the Asia-Pacific to increase defence spending to five per cent of GDP.\n\n\n\n\n\n\"Ah, no, what we'll do is we'll determine our defence policy, and we've invested, just across the forwards, an additional ten billion dollars in defence. What we'll do is continue to provide for investing in our capability, but also investing in our relationships in the region.\"\n\n\n\n\n\nIt follows controversial comments from US Secretary of State Pete Hegseth at the Shangri-la defence forum in Singapore.\n\n\n\n\n\nHe says it's credible China is potentially preparing to use military force to alter the balance of power in the Asia-Pacific.\n\n\n\n\n\nSpeaking at the same forum defence minister Richard Marles defended Australia's defence spending.\n\n\n\n\n\n\"I mean, the Americans have been very clear about wanting to see more from their friends and allies around the world. It's a sentiment that we understand, and as I've repeatedly said, that's a conversation we are totally up for in terms of the way in which we engage with the United States. And as I said, I think on Friday, in our bilateral meeting Secretary Hegseth did raise the question of increased defence expenditure on the Australian side. Of course we have already engaged in the last couple of years in the single biggest peacetime increase in defence expenditure in Australia's history, so we are beginning this journey.\"\n\n\n\n\n\nAustralia currently spends roughly 2 per cent of its GDP, or $56 billion dollars, on defence, and the government says this will grow to 2.35 per cent by 2034.\n\n\n\n\n\nCoalition finance spokesperson James Paterson told Sky News that's not enough.\n\n\n\n\n\n\"They don't plan to increase defence spending until the end of the decade, and that doesn't meet the challenge of the moment. One of the policies I was most proud of that we took to the last election was to increase defence spending to two and a half percent of GDP within five years and to three percent of GDP within a decade. That reckons with the environment that we are dealing with in our own region, it takes it seriously, and it responds to it to make sure that we can safeguard our own sovereignty and our own freedom.\"\n\n\n\n\n\nDefence isn't the only test to relations with Australia's closest ally.\n\n\n\n\n\nThe Prime Minister is also facing renewed pressure to secure an exemption against steel and aluminium tariffs.\n\n\n\n\n\nUS President Donald Trump has just announced these will be doubled from 25 to 50 per cent.\n\n\n\n\n\nAnthony Albanese is expected to raise the matter with Mr Trump if they meet on the sidelines of the G7 later this month.\n\n\n\n\n\nNationals leader David Littleproud has told Chanel 9 it's important Australia secures exemptions.\n\n\n\n\n\n\"We have a compelling case to have a carve out, even if you take away insanity of these tariffs as a whole, because of our relationship, and the check, we just dropped for submarines with the United States.\"\n\n\n\n\n\nClimate Change and Energy Minister Chris Bowen told the ABC Australia hasn't ruled out taking the issue to the World Trade Organization.\n\n\n\n\n\nBOWEN: \"We will consider all options available to defend the best interest of Australian industry.\"\n\n\n\n\n\nJOURNALIST: \"So, that is an option?\"\n\n\n\n\n\nBOWEN: \"Well, self, evidently, it's an option but I'm not going to pre-empt discussions. The first, the first port of call is to make the strongest possible representations at all levels to the United States, and hope that we can avoid the issue in the first place.\"\n\n\n\n\n\nRaising the dispute in the World Trade Organization is seen as unlikely given Australia is not alone in being slapped with US tariffs.\n\n\n\n\n\nRecent rulings from US courts have also cast doubt on the president's power to level some tariffs, including reciprocal and baseline levies.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-will-determine-its-own-defence-policy-pm/e9b8muahf",
    "title": "Albanese responds to Hegseth: Australia will determine its own defence policy",
    "publish_date": "Sun, 1 Jun 2025 06:32:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia says it will determine its own defence policy in the face of mounting pressure from the United States on countries in the Indo-Pacific to ramp up spending against what the US says is a real and imminent threat from China.\n\n\n\n\n\nAddressing Asia's top security summit in Singapore on Saturday, US defence secretary Pete Hegseth called on his nation's allies in the region to share the burden of deterrence by upgrading their own defences.\n\n\n\n\n\n\"There's no reason to sugar coat it,\" he told the Shangri-La Dialogue.\n\n\n\n\n\n\"The threat China poses is real, and it could be imminent.\"\n\n\n\n\n\nResponding to the remarks, Prime Minister Anthony Albanese pointed to the extra defence spending his government has already committed to.\n\n\n\n\"We'll determine our defence policy, and we've invested just across [the next four years] an additional $10 billion in defence,\" Albanese told reporters in Hobart on Sunday.\n\n\n\n\n\n\"What we'll do is continue to provide for investing in our capability but also investing in our relationships in the region.\"\n\n\n\n\n\nDefence spending will rise to about 2.3 per cent of GDP within the decade, from the 2 per cent it currently hovers at.\n\n\n\n\n\nHegseth asked Australia to increase its defence spending to 3.5 per cent of GDP during a meeting with Defence Minister Richard Marles on the sidelines of the Shangri-La Dialogue, the Pentagon said.\n\n\n\nUS defence secretary Pete Hegseth called on the US allies in Asia to share the burden of deterrence by upgrading their own defences. Source: AP / Anupam Nath \"On defence spending, secretary Hegseth conveyed that Australia should increase its defence spending to 3.5 per cent of its GDP as soon as possible,\" the statement said.\n\n\n\n\n\nMarles said after the meeting, they did not discuss a specific percentage of GDP to raise Australian defence spending.\n\n\n\n\n\nHe said Australia was already planning the \"single biggest peacetime increase in defence expenditure in Australia's history\".\n\n\n\n\n\n\"So we are beginning this journey,\" he said.\n\n\n\n\n\n\"We've got runs on the board.\"\n\n\n\nA graph showing the government's projected defence spending over the next five years. Source: SBS News Hegseth said China's military action around Taiwan was \"rehearsing for the real deal\" in relation to an invasion of the island.\n\n\n\n\n\nAlbanese said Australia's position on Taiwan was \"very clear\" and included a bipartisan stance in support of the status quo.\n\n\n\n\n\nChina views Taiwan as its own territory, and criticised the US as the biggest \"troublemaker for regional peace and stability\".\n\n\n\n\n\nChina has protested to the US over \"vilifying\" remarks made by Hegseth, the foreign ministry said on Sunday, while accusing it of deliberately ignoring calls for peace from regional nations.\n\n\n\n(Left to right) US defence secretary Pete Hegseth, Australia's Defence Minister Richard Marles, Japan's defence minister Nakatani Gen, and Philippines national defence secretary Gilberto Teodoro Jr met on the sidelines of the International Institute for Strategic Studies forum in Singapore. Source: EPA / How Hwee Young China has objected to Hegseth calling it a threat in the Indo-Pacific, the foreign ministry said in a statement, describing his comments at the Shangri-La Dialogue in Singapore on Saturday as \"deplorable\" and \"intended to sow division\".\n\n\n\n\n\n\"Hegseth deliberately ignored the call for peace and development by countries in the region, and instead touted the Cold War mentality for bloc confrontation, vilified China with defamatory allegations, and falsely called China a 'threat'.\n\n\n\n\n\n\"The United States has deployed offensive weaponry in the South China Sea and kept stoking flames and creating tensions in the Asia-Pacific, which are turning the region into a powder keg.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 1
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-wa-stolen-generations-survivors-welcome-redress-scheme/uafe3ljqn",
    "title": "INTERVIEW: WA Stolen Generations survivors welcome redress scheme",
    "publish_date": "Sat, 31 May 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/measuring-the-hidden-burden-of-tourette-and-tic-disorders-on-australia/u6hn78xlq",
    "title": "Measuring the hidden burden of Tourette Syndrome and tic disorders on Australia",
    "publish_date": "Sat, 31 May 2025 21:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAt seven years old, Max was diagnosed with Tourette Syndrome, a lifelong neurological condition that can cause rapid, involuntary movements and sounds known as tics.\n\n\n\n\n\nHe's suffered from bullying at school, leading him to drop out before the end of Year 10.\n\n\n\n\n\nThe ongoing stigma surrounding the condition means Max isn't able to work or volunteer at animal shelters, because employers think his tics might frighten the animals.\n\n\n\n\n\nDr Melissa Licari, a senior Research Fellow at The Kids Research Institute Australia, says those experiences are severely affecting Max's mental health.\n\n\n\n\n\n\"Tourette's took more than just the control of Max's body. It has profoundly impacted mental health. At now 18, Max's mum has lost count of the number of suicide attempts. Max's mother told us Max doesn't want to die, but also cannot live like this.\"\n\n\n\n\n\nIn Australia, one in every 100 school-aged children lives with Tourette Syndrome.\n\n\n\n\n\nShe says Max's story reflects the ongoing challenges that young Australians living with the condition have been facing.\n\n\n\n\n\n\"Now, Max's story reflects the harsh reality based by meaning living with Tourette's and other tic conditions in this country: long waits for diagnosis, limited access to effective treatment, turned away by the NDIS, stigma, discrimination, not being believed, limited understanding and support in schools and workplaces, and this sadly results in severe mental health issues. These challenges aren't new and they've been ignored for far too long.\"\n\n\n\n\n\nDr Ari is a co-author of Impact for Tourette, Australia's first national survey looking at the mental health of people living with Tourette Syndrome.\n\n\n\n\n\nIt interviewed over 200 individuals and caregivers, finding one in two children with a tic-related disorder has thought about ending their life.\n\n\n\n\n\nBut it found one in ten children has actually attempted suicide.\n\n\n\n\n\nThe report also found there is a shortage of psychologists with the expertise to offer treatment for tic disorders.\n\n\n\n\n\nDr Amanda Maxwell is a Clinical Psychologist and Clinical Research Manager at the UNSW Tic Clinic.\n\n\n\n\n\nShe says that lack of psychological services has pushed people to seek medication to treat tic-related disorders.\n\n\n\n\n\n\"Now medication can be very helpful, but of the sample that we surveyed, 50% said that it did not control their tics or minimally controlled their tics. And there's obvious side effects as well with some of the medications. In terms of the impact on function it was great. So 80% of our survey, those surveyed experienced tic daily and about 50% of the children reported that they didn't have tic-free periods of more than five to 10 minutes in a day - so they're ticcing all through the day.\"\n\n\n\n\n\nWith those symptoms, many living with the condition - like Max - are unlikely to be able to work.\n\n\n\n\n\nBut according to Dr Maxwell, they're also struggling to get their NDIS application approved.\n\n\n\n\n\n\"The financial burden is great. It's not just because some adults are unable to work, but there is also a significant cost of accessing healthcare for these young people. One in 20 had NDIS funding. Three out of four had their applications denied. My experience and the experience of other clinicians is that they are denied because tic disorders are not considered a permanent disability, yet even adults we work with - that clearly have tics that have persisted into adulthood and that experiencing significant functional impairment - are also being told that their disability is not a permanent disability and denied funding.\"\n\n\n\n\n\nEach year the Tourette Syndrome Association of Australia holds an Awareness Week (June 1-7 2025).\n\n\n\n\n\nThis year, the theme is \"Understand the Impact\", focusing on educating the public on the condition.\n\n\n\n\n\nProfessor Valsamma Eapen is Scientia Professor and Chair of Child Psychiatry at UNSW Sydney.\n\n\n\n\n\nShe says while it requires a comprehensive care plan to look after people living with tics, sometimes, even health professionals don't have much awareness of what's needed to support their patients.\n\n\n\n\n\n\"GPs are usually the first stop, but could also be paediatrics in neurology, psychology, and some will go to the eye specialist if the fast tic is blinking or screwing of the eye, or ENT specialist when they have a vocal tic like grunting or throat-clearing and so on. But often it's not picked up as tics or Tourette, better understanding is critical as currently caught between two main worldviews. One is, oh, tics not to worry, they'll grow out of it. Or Oh, is that the swearing syndrome where people blurt out the obscenities? You don't swear so you can't have Tourette, right? Neither is a helpful approach because the majority would fall somewhere in between.\"\n\n\n\n\n\nProfessor Eapen calls for more training for professionals, while urging the government to launch a national guideline on Tourette Syndrome.\n\n\n\n\n\n\"A national guideline will provide uniform minimum standards and a consistent approach that's agreed upon by all consumer stakeholders, professionals as to the framework to awareness, early identification, comprehensive assessment, and also matching supports. And that should also include accommodations at school and for disability supports where it is applicable. It is indeed a human rights issue for the 55,000 Australians who are living with Tourettes.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-31-may-2025/t3lovszxb",
    "title": "Evening News Bulletin 31 May 2025",
    "publish_date": "Sat, 31 May 2025 06:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nIn this bulletin;\n\n\n\nPressure mounts for prime minister Albanese to meet with US President Trump after new steel tariffs announced;\n\nThe New South Wales government and rail union strike a deal in the Fair Work Commission;\n\nAnd in sport, Alexei Popyrin reaches the final 16 in the French Open for the first time.\n\nThe Coalition has said it's imperative Prime Minister Anthony Albanese meets personally with US President Donald Trump after Mr Trump announced a 50 per cent tariff on steel.\n\n\n\n\n\nIn a statement, opposition trade spokesman Kevin Hogan says the tariffs are concerning for Australian jobs, and the Coalition does not agree with the policy.\n\n\n\n\n\nMr Trump announced plans to increase tariffs on foreign imports of steel from 25 to 50 per cent, saying it would strengthen the steel industry in the United States.\n\n\n\n\n\nMr Hogan says the Coalition expects the United States to honour its obligations under both nations' free trade agreement, and urges Mr Albanese to meet with Mr Trump on the sidelines of the G7 in Canada in a few weeks time.\n\n\n\n\n\n—\n\n\n\n\n\nThe United States is urging Indo-Pacific countries to increase defence spending to counter military and economic pressure from China.\n\n\n\n\n\nSpeaking at the Shangri-La Dialogue in Singapore, United States Defence Secretary Pete Hegseth said Washington will bolster its defenses overseas to counter what he described as rapidly developing threats from Beijing, particularly in its stance toward Taiwan.\n\n\n\n\n\nChina has conducted numerous exercises to test what a blockade would look like of the self-governing island, which Beijing claims as its own and the US has pledged to defend.\n\n\n\n\n\nMr Hegseth says countries in the region should increase defence spending to levels similar to the 5% of GDP that NATO members are pledging to spend.\n\n\n\n\n\n\"I urge all of our allies and partners to seize this moment with us. Our defense spending must reflect the dangers and threats that we face today. Because deterrence doesn't come on the cheap, just ask the American taxpayer. Time is of the essence. We must step up and move out with urgency. And it's hard to believe a little bit, after some trips to Europe that I'm saying this, but thanks to President Trump, Asian allies should look to countries in Europe as a newfound example.\"\n\n\n\n\n\n—\n\n\n\n\n\nThe New South Wales government and the state's rail union have struck a deal in the Fair Work Commission.\n\n\n\n\n\nFollowing almost a year of industrial action disputes between the union and state government over pay conditions, the deal gets workers a 12 per cent pay rise over three years.\n\n\n\n\n\nThe Rail, Tram and Bus Union initially sought a 32 per cent pay rise over four years and a 35-hour working week, while the government offered a 15 per cent figure over the same time frame.\n\n\n\n\n\nTransport Minister John Graham told the ABC the result is a win for his government, labelling it a \"fair and reasonable\" wage rise they had promised to deliver.\n\n\n\n\n\n\"One of the reasons this deal has landed is that we were one per cent apart when it came to the February negotiations. The government has paid that full one percent to land this deal, we see that as a fair arrangement, it's an investment in reliability. We need a more reliable train service in Sydney, and working with the workforce rather than fighting against them is how we do that.\"\n\n\n\n\n\n—\n\n\n\n\n\nEleven Sudanese migrants and a Libyan driver have been killed in a car crash.\n\n\n\n\n\nIt's understood the accident between the migrants’ vehicle and a truck happened in the desert, 90 kilometres north of the Libyan town of Kufra.\n\n\n\n\n\nIt is the latest deadly incident involving Sudanese migrants in the Libyan desert.\n\n\n\n\n\nEarlier this month, seven Sudanese were found dead after their vehicle broke down in the desert on a path used by traffickers between Chad and Libya, stranding 34 migrants on board for several days.\n\n\n\n\n\n—\n\n\n\n\n\nAlexei Popyrin has reached the final 16 at the French Open for the first time after beating Portuguese Nuno Borges in a three hour match.\n\n\n\n\n\nHe's now the last Australian man standing after the shock early exit of Alex de Minaur.\n\n\n\n\n\nAustralia’s number two ranked player is yet to lose a set on his way to the quarter finals.\n\n\n\n\n\nHe says his aim ahead of his next match with American 12th seed Tommy Paul is to keep his mind on his own game.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/could-labors-super-tax-plan-have-unintended-consequences/g0snoc2rs",
    "title": "'Unintended consequences': Could Labor's $3 million super tax plan hit more than the rich?",
    "publish_date": "Sat, 31 May 2025 05:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "At first glance, it seems aimed at the wealthy — but Labor's superannuation tax plan may have a much broader impact, according to some economists.\n\n\n\n\n\nThe plan, one of the government's key economic policies, is expected to be presented in parliament in the coming months and is proposed to take effect from the start of the next financial year, 1 July.\n\n\n\n\n\nIt will hit those with more than $3 million in their superannuation accounts with an extra 15 per cent tax, on top of the 15 per cent all super fund members are currently taxed on their earnings.\n\n\n\nREAD MORE The super tax that slipped under the radar during the election campaign\n\n'More and more people will be affected'\n\nThe 30 per cent tax could directly impact 80,000 people, or less than 0.5 per cent of individuals, by 2025-26, according to the Treasury.\n\n\n\n\n\nBut this number may increase as people add more money to their super accounts.\n\n\n\n\n\n\"The $3 million threshold is set; it won't be indexed or increased over time unless the government announces that. So over time, more and more people will be affected by the tax,\" Shane Oliver, chief economist at AMP, told SBS News.\n\n\n\n\n\n\"If superannuation returns may remain positive and your fund keeps going up in value ... more and more people will fall over the threshold and be subject to the tax.\n\n\n\n\n\n\"There are a lot of people who [are] sort of halfway through their career ... They could quite easily hit the threshold within the next 10 years if it's not indexed. And that can have a negative impact.\"\n\n\n\n\n\nNot indexing the $3 million threshold means it won't increase with inflation.\n\n\n\n\n\nHowever, in a recent interview with The Conversation's Politics podcast, Treasurer Jim Chalmers appeared to indicate the government may choose to raise the threshold.\n\n\n\n\n\n\"There are so many instances in the tax system where thresholds aren’t indexed, and from time to time governments take decisions to raise those thresholds. I’m anticipating that that’s what would happen here,\" he said.\n\n\n\n'It could affect average Australians'\n\nWhen the plan was introduced in 2023, Treasury said that since most super fund members are unaffected, it aims to \"avoid imposing significant system and reporting changes that could indirectly affect others\".\n\n\n\n\n\nBut some economists are concerned about the potential impacts of the super tax on the broader economy.\n\n\n\n\n\nOliver said the policy \"could affect average Australians\" while \"in theory, there's no impact on those who have less than $3 million\".\n\n\n\nREAD MORE Tax time countdown: Six things you should start doing now\n\n\"What could happen, though, is that people who are close to it or are beyond the threshold, might think, well, I better start rearranging my superannuation such that I'm not exposed to this tax,\" he said.\n\n\n\n\n\n\"That means I take some ... out of the superannuation fund I have, or I put my investments into other parts of the economy.\n\n\n\n\n\n\"So there's potentially less investment in the broader economy that could adversely affect economic growth and therefore affect living standards in Australia at a time when we actually want to boost economic growth and boost living standards.\n\n\n\n\n\n\"There are all sorts of complications associated with this, which could have unintended consequences for the broader economy.\"\n\n\n\n\n\nAccording to Australian Taxation Office figures from 2021, the average super balances for men and women aged between 60 and 64 were $402,838 and $318,203 respectively.\n\n\n\nHow will the housing market be impacted?\n\nOne of the consequences of the super tax, which has been at the centre of the debate, is its potential impact on housing .\n\n\n\n\n\nThe tax will cover unrealised capital gains — meaning people could be taxed each year on the rising paper value of assets like property in a self-managed super fund (SMSF), even if they haven't sold them.\n\n\n\n\n\nNicola Powell, chief of research and economics at Domain, told SBS News this could affect the makeup of property investment.\n\n\n\n\n\n\"It is the first time paper gains have been taxed in this way and not the realised earnings. So in essence, it's edging into new territories,\" she said.\n\n\n\nREAD MORE Australia's new regional hotspot for city leavers as Sunshine Coast slips\n\nShe said that this may lead to SMSFs shifting from the residential market to commercial property, potentially affecting the housing market for both renters and homeowners.\n\n\n\n\n\n\"I think that what it could do is increase the number of homes for sale. It could increase the number of residential property listings and ultimately [lead to] fewer rental listings,\" Powell explained.\n\n\n\n\n\nShe believes the outcome may be similar to a potential removal of negative gearing .\n\n\n\n\n\n\"The research that's been done for negative gearing does show that removal of the negative gearing will increase rents, but it will increase home ownership and reduce property prices. But the bigger impact is [that] it does increase rent.\n\n\n\n\n\n\"You could argue that a similar outcome could come from this type of policy, too.\"\n\n\n\n'Makes the system a bit fairer'\n\nOliver said: \"There are many Australians who use their self-managed super funds to invest in startups that could be small businesses or business ideas.\"\n\n\n\n\n\n\"There's a concern that with those startups that there might be less money available for start-up capital from SMSF funds.\n\n\n\n\n\n\"I think that the issue is not so much an objection to making the system fairer: Yes. Make it fairer, but do it in a way that doesn't create lots of complications.\"\n\n\n\n\n\nAmid the criticism, Chalmers has defended Labor's policy, saying it \"will help us fund our priorities, whether it’s Medicare, the tax cuts, and other priorities in budget repair\".\n\n\n\n\n\n\"I know that people have views about it. I know there's a campaign in a couple of our newspapers about it. But this is all about making sure that it's still concessional treatment.\n\n\n\n\n\n\"It makes the system a bit fairer and it's important in terms of the sustainability of the budget.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/elon-musks-goodbye-to-donald-trump-marred-by-controversy/spokv4lk0",
    "title": "Why Elon Musk's White House farewell has people talking",
    "publish_date": "Sat, 31 May 2025 03:41:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Elon Musk's farewell at the White House, which marked the end of his short tenure as a special government employee, has been overshadowed by a black eye, problems at Tesla, and allegations of drug use.\n\n\n\n\n\nMusk, who led the newly created Department of Government Efficiency (DOGE), recently announced that he was leaving the role .\n\n\n\n\n\nIn a press conference with Donald Trump on Friday local time, the United States president praised Musk as \"one of the greatest business leaders and innovators the world has ever produced\".\n\n\n\n\n\nBut it was an unusual briefing, with Musk dodging questions about his appearance, while receiving a present that Trump reserves for only \"very special people\".\n\n\n\n\n\nMusk told reporters the injury was from his 5-year-old son, after he told the boy: \"'Go ahead, punch me in the face.' And he did\".\n\n\n\n\n\nMusk also received a large golden key in a box, a gift from Trump acknowledging his \"very great talents\".\n\n\n\n\n\nSo, if things appear amicable between Musk and Trump, why are they parting ways?\n\n\n\nWhy is Musk leaving?\n\nMusk has not given a specific reason for his departure from the Trump administration.\n\n\n\n\n\nHe announced on Wednesday that his \"scheduled time\" in the Trump administration had come to an end and thanked Trump for \"the opportunity to reduce wasteful spending\".\n\n\n\n\n\nDuring his time leading DOGE, thousands of government employees were fired or made redundant, and several agencies were downsized, including the US Agency for International Development .\n\n\n\nMeanwhile, his electric vehicle company, Tesla, has been in trouble, with declining sales and stock prices falling 12 per cent this year.\n\n\n\n\n\nTesla shareholders had written an open letter to Musk, describing the company as in \"crisis\" and demanding he return to work a standard 40-hour week.\n\n\n\n\n\nDuring the press conference, Musk was also asked about reports of extensive drug use, which the New York Times claimed involved ketamine, ecstasy, and psychedelic mushrooms.\n\n\n\n\n\nThe Times reported on Friday that Musk had used these drugs while in office, citing White House insiders and people close to the billionaire.\n\n\n\n\n\nThe DOGE leader developed what those sources described to the Times as a serious ketamine habit.\n\n\n\nREAD MORE Why Trump and Elon Musk want to shut down the world's largest humanitarian aid donor\n\nMusk dismissed the claims outright, saying it was \"fake news\".\n\n\n\n\n\n\"The New York Times? Is that the same publication that got a Pulitzer prize for false reporting on the Russiagate?\n\n\n\n\n\n\"I think it is. That New York Times? Let’s move on.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/more-uncertainty-for-australian-steel-producers-as-trump-doubles-tariffs-midday-news-bulletin-31-may-2025/9utyqak25",
    "title": "More uncertainty for Australian steel producers as Trump doubles tariffs | Midday News Bulletin 31 May 2025",
    "publish_date": "Sat, 31 May 2025 01:59:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nMore uncertainty for Australian steel producers as Trump promises to double tariffs\n\nGermany re-thinking arm sales to Israel over Gaza concerns\n\nOlympic champion boxer Imane Khelif ordered to undergo mandatory sex testing\n\nDonald Trump has vowed to double the tariff rate on steel, a dramatic increase that could put pressure on Australian producers.\n\n\n\n\n\nThe US President has made the pledge during a visit to US Steel's Mon Valley Works in Pennsylvania.\n\n\n\n\n\n\"We are going to be imposing a 25 per cent increase. We're going to bring it from 25 per cent to 50 per cent the tariffs on steel into the United States of America, which will even further secure the steel industry in the United States. Nobody's going to get around that.\"\n\n\n\n\n\nTrade law expert Professor Lisa Toohey from UNSW says Bluescope Steel will experience the biggest direct hit, because it exports around 300,000 tonnes of semi-processed steel annually to the US.\n\n\n\n\n\nAustralia has promised to continue to push for the tariff's removal altogether, Trade Minister Senator Don Farrell calling them unjustified.\n\n\n\n\n\n**\n\n\n\n\n\nGermany says it is re-evaluating its delivery of arms to Israel.\n\n\n\n\n\nForeign Minister Johann Wadephul has told the Süddeutsche Zeitung newspaper that while Germany stood with Israel and had responsibility for its security and existence in light of German history, it was considering restricting sales because of concerns Israel's actions in Gaza may not be consistent with humanitarian international law.\n\n\n\n\n\nHe has previously urged Israel to speed up the delivery of humanitarian aid to Gaza [[in a press conference alongside his Spanish counterpart during his inaugural visit to Madrid.]]\n\n\n\n\n\n\"The humanitarian situation is unbearable and must be improved quickly, which is why I have once again urged (Israeli foreign minister) Gideon Saar to ensure that more humanitarian aid is allowed into the Gaza Strip.”\n\n\n\n\n\n**\n\n\n\n\n\nRichard Marles will call for a stronger arms control network in the Indo Pacific at this year's Shangri-La Dialogue.\n\n\n\n\n\nThe Defence Minister will say the network needs to be made tougher to keep up with growing risks and advances in technology.\n\n\n\n\n\nHis address in Singapore is expected to especially highlight the risk posed by China's rapid nuclear modernisation and expansion program, which he says aims to reach parity with or surpass the United States.\n\n\n\n\n\n**\n\n\n\n\n\nA leading advocate says children are being subjected to ongoing \"egregious\" breaches of their rights in Australia.\n\n\n\n\n\nHuman Rights Commissioner Katie Kiss has referred specifically to the 'tough on crime' approaches being taken in Queensland and the Northern Territory in her remarks during the Mabo Oration in Cairns.\n\n\n\n\n\nThe HRC's Aboriginal and Torres Strait Islander social justice commissioner says that she was troubled by Northern Territory chief minister Lia Finocchiaro and Queensland premier David Crisafulli being unfazed by rebukes on their policies from the chair of the United Nations Committee on the Rights of the Child, Ann Skelton.\n\n\n\n\n\n**\n\n\n\n\n\nGunlom Falls in the Kakadu National Park has officially reopened to the public, six years after its closure.\n\n\n\n\n\nIt had been shut in 2019 after Parks Australia damaged a sacred mens site during a construction project.\n\n\n\n\n\nGunlom is one of Kakadu's most cherished attractions, famously featuring in Crocodile Dundee.\n\n\n\n\n\n**\n\n\n\n\n\nA Chinese paraglider has been banned from the skies for six months after being accidentally propelled eight and a half thousand metres into the sky.\n\n\n\n\n\nThe Gansu provincial aeronautical sports association says the suspension is because the site and airspace of the incident had not been approved in advance, despite it being regarded as an unforeseen accident.\n\n\n\n\n\nThe paraglider - identified as Peng Yujiang - says he was testing new equipment at 3,000 metres above sea level in China's Gansu province when a rare air current known as a cloud suck pulled him about 5,000 metres up to a height almost equivalent to the summit of Mount Everest.\n\n\n\n\n\n\"The scariest moment was when I tried to pull out of the spiral and failed and when the canopy nosedived. It's still frightening to think about. I'm sure I won't be trying paragliding again anytime soon, and I'm not even sure if I will do it again in the future.\"\n\n\n\n\n\n**\n\n\n\n\n\nTo sport, World Boxing have introduced mandatory sex testing following Imane Khelif's gold medal performance at the Paris Olympic Games.\n\n\n\n\n\nAll athletes over the age of 18 will now have to undertake a PCR (polymerase chain reaction) genetic test.\n\n\n\n\n\nThe governing body has singled out Ms Khelif for particular attention, writing to the Algerian boxing federation to say she will not be able to compete in next month's Eindhoven Box Cup or any other women's event under their authority until she has completed the testing.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/why-did-trump-double-his-steel-tariffs-because-he-could-20250602-p5m42l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why did Trump double his steel tariffs? Because he could",
    "publish_date": "Mon, 02 Jun 2025 11:57:50 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Apart from trying to show that he still has some, albeit more limited, authority to act on tariffs, Trump’s announcement, to a rally of US steelworks, had a secondary purpose. Loading During last year’s election campaign, Trump was vehemently opposed to a proposed $US15 billion ($23.3 billion) acquisition of US Steel by Japan’s Nippon Steel – as was Joe Biden, who blocked the deal only days before he left office. Both were chasing the votes of steelworkers and their powerful union in the critical swing state of Pennsylvania, where US Steel is headquartered and has its major plants. Having won the election, however, Trump has had a change of mind.\n\nWhile the US will impose some significant conditions on the deal – including, perhaps, a “golden share” that would give the government a veto over major decisions along with a commitment from Nippon Steel to appoint a US chief executive and a majority of Americans to the board – it now appears that he will approve the deal, even though he says he hasn’t seen its final details. Nippon Steel, one of the world’s most sophisticated steel producers, has promised to invest about $US14 billion in US Steel’s operations, which have been struggling, shrinking and suffering from under-investment for decades. Trump’s doubling of the tariff rate for steel and aluminium is a way of justifying the decision to approve the deal, as well as enhancing the economics of US Steel and other US steelmakers and helping to underwrite Nippon Steel’s massive investments, most of which will occur over the next four years. Trump’s original tariffs on steel and aluminium infuriated America’s trade partners, including Australia, even though Australia’s exports of those metals to the US are quite modest. Canada, whose steel exports represent about a quarter of US steel imports and half its aluminium imports, has far more at stake.\n\nMexico, Brazil, South Korea, Vietnam, Japan and European nations will also be impacted, with Canada and the European Union already threatening retaliation, as they did in response to Trump’s initial 25 per cent tariffs. Australia is still, probably fruitlessly, seeking an exemption. Loading The decision to allow the Nippon Streel deal to proceed, if that is the outcome, is good policy. The US steel industry is small – about half the size it was half a century ago – and has been shrinking. It has poor profitability and ageing technology. Nippon Steel’s investment and its technologies can arrest that decline. The decision to double the tariffs on steel – indeed the original decision to impose the 25 per cent tariff – is, however, poor policy. It will increase investment in the sector, and will probably improve its profitability, plant utilisation rates and employment numbers. But that will come at a significant cost.\n\nIn 2018, when Trump first imposed tariffs on imported steel, steel prices rose almost 10 per cent, the sector’s profits rose by about $US2.5 billion, capacity utilisation jumped from 74 per cent to about 80 per cent and nearly 10,000 jobs were added within the sector. The impact was quite short-lived, with those numbers subsequently reversing as the industry resumed its long-term decline. The initial impact was predictable. Tariffs are protectionist. They protect domestic industries and companies from more efficient producers elsewhere by boosting their sales, margins and profits. That’s what happened after the 2018 tariffs. Loading They come, however, at a cost to the customers of the protected industries, which is also what happened after Trump’s 2018 tariffs were imposed. A Peterson Institute for International Economics study concluded that the 2018 tariffs cost US downstream steel-using industries about $US5.6 billion, or about $US650,000 for each new job they added in the steel sector. The US Federal Reserve Board concluded that they cost about 75,000 jobs in those downstream industries, or more than eight times the number of jobs added by the steelmakers.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/property/news/st-kilda-east-home-fails-to-sell-after-only-bidder-didn-t-show-up-20250602-p5m433.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "St Kilda East home fails to sell after only bidder didn’t show up",
    "publish_date": "Mon, 02 Jun 2025 11:57:06 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "Perruzza said he was seeing an increasing number of properties selling through private sale rather than at auction. Loading “Sales are being made, but auctions are very hit and miss,” he said. A nearby home, 4 Maryville Street in Ripponlea, also failed to secure any bids at auction. Listed with a price range of $2.875 million to $3.15 million, the four-bedroom, renovated home is located in the coveted Brunning estate.\n\n“It is a tightly held suburb, so it’s not very often you get the opportunity to buy a block this big,” said lead agent Rachael O’Connor from McGrath Estate Agents St Kilda. While one registered bidder was at the auction, O’Connor said they didn’t make a bid and declined to negotiate privately afterwards. O’Connor had been hopeful that more stock would come onto the market in the area after the federal election, but that has not happened. “It’s one of the lowest levels of quality stock I’ve seen,” she said.\n\nThe two homes were among 1417 scheduled auctions across Melbourne over the past week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 70.3 per cent from 1048 reported results, while 105 auctions were withdrawn. Loading Separate figures from Cotality, formerly CoreLogic, found Melbourne home values rose 0.4 per cent in May. Louis Christopher, the general manager and head of research at SQM, cautioned against hastily interpreting the week’s auction results, as they were affected by a surge in auction volume due to coming King’s Birthday long weekend. “The amount of auction stock substantially increased from last week; it’s in excess of 30 per cent since,” he said.\n\n“Long weekends are usually quiet on the auction front, and if sellers realise that their auction date falls on a long weekend, they often bring the date forward, which is why we see this spike.” In Chelsea, a 1920s period weatherboard home sold $255,000 over the reserve, for $1.505 million. The home at 32 Catherine Street had a price guide of $1.18 million to $1.22 million, with a reserve of $1.25 million. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide. Lead agent Ruben Gueli from Ray White Chelsea, said the result “eclipsed expectations”.\n\nLoading There were 10 registered bidders, six of whom were active in the auction. “The proceedings kicked off with a bang,” Gueli said. “The opening bid came in $110,000 above the top of the price range. This shocked everyone and really set the tone for the rest of the competitive auction.” The auction finale was a tussle between two couples who were drawn to the beachside location and quality renovation.\n\n“They were going bid for bid, but it was ultimately sold to a young couple starting a family,” Gueli said. The sellers had owned the property for 10 years, one of whom was Ray White Judd White director Andrew Dimashki. In Footscray, a three-bedroom period home passed in at auction but sold in private negotiation for $865,000 afterwards. The home at 68 Essex Street was listed with a price guide of $800,000 to its reserve price of $870,000.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-cyclist-dies-after-collision-with-train-20250530-p5m3kq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Cyclist dies after collision with train; Murder-accused mother dies after being found unresponsive in cell; Crisafulli rebukes calls to abandon net zero targets",
    "publish_date": "Mon, 02 Jun 2025 11:55:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Premier David Crisafulli has rebuked calls from some Liberal-National colleagues in Canberra to abandon net-zero emissions targets, saying he is focused on a balanced approach that can bolster the state’s agricultural industries while supporting the expansion of renewable energy.\n\nCrisafulli refused to walk away from net-zero targets while speaking to the ABC this morning, amid fierce debate from both sides of the federal Coalition regarding their commitment to emission goals.\n\nQueensland Premier David Crisafulli. Credit: AAPIMAGE\n\n“The markets are demanding we do things to a standard when it comes to emissions as well as protection. We are on a journey to deliver that,” Crisafulli said.\n\n“We are looking at storage options to make sure we bring renewable energy into the grid. That is part of an affordable energy mix.”\n\nCrisafulli’s comments come one day after his government added more than 700 hectares to Queensland’s national parks and nature refuges, as part of efforts to protect the state’s endangered species, ecosystems, biodiversity and threatened flora.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/after-four-titles-tears-and-303-tries-batman-and-robin-finally-face-off-20250602-p5m41g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After four titles, tears and 303 tries, Batman and Robin finally face off",
    "publish_date": "Mon, 02 Jun 2025 11:54:27 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Loading\n\nOn one of the few occasions Nathan Cleary played opposite Jarome Luai, he made the Tigers $1.2 million man cry.\n\nGranted, it was roughly 14 years, four premierships and 90 games of first-grade together ago.\n\n“I’m not sure that will happen again,” Cleary grins, having watched every game Luai has played this year since departing Penrith to lead Benji Marshall’s Concord rebuild.\n\nRegarding himself as the Robin to Cleary’s Batman while steering the Panthers dynasty, Luai takes on his great mate and former halves partner for the first time at NRL level this Sunday at Commbank Stadium.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-albanese-condemns-new-trump-tariffs-ukraine-drones-destroy-41-russian-aircraft-20250602-p5m41a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese condemns new Trump tariffs; Ukraine drones destroy 41 Russian aircraft; Piastri wins Spanish GP",
    "publish_date": "Mon, 02 Jun 2025 11:50:15 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Nationals leader David Littleproud was on Sky News earlier this morning, where he hit out at federal Labor’s 30 per cent tax proposal on any super over $3 million.\n\nLittleproud said the proposal would be especially burdensome on farmers, who will face new cash flow challenges under the new tax.\n\n“This is for everybody, but that is [also] the real experience of what farmers will face when ... they don’t have the cash flow to pay for a tax, but when they get on an unrealised capital gain, on an increase in their property value, it sends them to the wall. This is insanity,” Littleproud said.\n\n“This is where Jim Chalmers must admit he’s got it wrong. Stop being so smug and arrogant and say you got it wrong, and then go back to the drawing board and find other ways to get larger backing.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/property/news/local-buyer-splashes-10-1m-on-sydney-home-he-saw-10-minutes-before-20250602-p5m430.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Local buyer splashes $10.1m on Sydney home he saw 10 minutes before",
    "publish_date": "Mon, 02 Jun 2025 11:48:10 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A buyer who saw the property only 10 minutes before auction, spent $10.1 million on an immaculate turnkey designer home in Strathfield on Saturday.\n\nThe six-bedroom, eight-bathroom home with a parking basement and bowling alley at 131 The Boulevarde was built as a forever home by its vendor.\n\nTwo hundred people watched on as four of the five registered bidders competed for the property in Strathfield’s Golden Mile guided at $8.9 million.\n\nBidding opened at $8.7 million with $100,000 increments, at $9.5 million $200,000 bids accelerated the pace, and a few $50,000 bids were mixed in until it sold under the hammer at $10.1 million meeting its reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/aussie-jet-breaks-10-second-barrier-20250601-p5m3wx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie jet breaks 10-second barrier",
    "publish_date": "Mon, 02 Jun 2025 11:45:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "Aussie jet breaks 10-second barrier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/property/news/sold-for-millions-one-of-west-end-s-last-untouched-queenslanders-20250602-p5m439.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sold for millions: One of West End’s last untouched Queenslanders",
    "publish_date": "Mon, 02 Jun 2025 11:43:26 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "One of West End’s last untouched Queenslanders has sold for $2.5 million in a heated auction that drew a crowd of more than 100.\n\nThe three-bedroom, one-bathroom home – at 22 Sussex Street – has been in the same family since the ’50s and took six months to get market ready, with decades of belongings cleared out and only essential updates made to ensure the property was up to code.\n\nThe home remained ripe for a $1 million-plus renovation – but that didn’t deter 15 registered bidders, drawn in by its elevated, flood-free 536-square-metre block, city views and coveted position within the Brisbane State High catchment.\n\nBidding kicked off at $1.6 million and once down to two bidders, jumped in leaps of $100,000 and $75,000.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/the-harsh-truth-about-australian-rugby-20250601-p5m3vl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The harsh truth about Australian rugby",
    "publish_date": "Mon, 02 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The end of the regular season means it’s time for some uncomfortable truths. Despite the perceived performance benefits of cutting the Rebels, the four remaining Australian sides have actually won fewer games against the Kiwis this year. They have won seven this year compared to nine last year, with the discrepancy explained by both the Reds and Brumbies flipping from a 3-2 trans-Tasman winning record in 2024 to a 2-3 losing one. While the early-season narrative was one of Australian improvement, it quietly flipped about two-thirds of the way through the competition, and the last win against a New Zealand team was the Reds’ victory against the Blues in round 11. It’s an obvious concern on the eve of the British and Lions series.\n\nTwo-tier Super has a problem\n\nThe win-loss record outline above is part of a much broader problem. The top six finishers this year are effectively the same top six teams from the past four years of Super Rugby Pacific. In fact, in the competition’s history (beginning in 2022) only eight teams have finished in the top six, the Waratahs sneaking in twice (6th in 2023 and 6th in 2022) and the Highlanders sneaking in once (6th in 2024). It’s a competition with bedded-in haves and have-nots, as the points differential from this year highlights again. The big six all have positive points differentials, and the rest have deeply negative ones, with the Highlanders the ‘best’ at minus 90. This is one reason why this column has been sympathetic towards Dan McKellar at the Waratahs this year. He’s walked into a job in the current have-nots, and Super Rugby’s lack of player movement makes upward mobility very hard to achieve.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/nsw/penny-s-commute-is-90-minutes-each-way-no-wonder-workers-like-her-are-quitting-20250518-p5m06t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Penny’s commute is 90 minutes each way. No wonder workers like her are quitting",
    "publish_date": "Mon, 02 Jun 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Matt Wade"
    ],
    "text": "A mismatch between where most of Sydney’s care workforce live and where they work is hampering services that support tens of thousands of vulnerable people and taking a toll on the city’s economy.\n\nNew research shows 71 per cent of the city’s care workforce live in greater western Sydney, while at least 50 per cent of the demand for their services – including aged care, childcare and disability care – is in districts to the east of the city, especially the northern beaches.\n\nNurse Penny Farries spends up to an hour and a half commuting to work; long travel times are driving workers out of care jobs. Credit: Max Mason-Hubers\n\nCommunity-based care workers spend an average of 1.5 hours in the car during each work day, while those who catch public transport to work in residential care centres spend an average of 2.3 hours commuting, research by specialist recruitment firm Orchard Talent Group shows.\n\nThe challenge of long commutes is affecting workers in other frontline sectors in Sydney, including health care and emergency services.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/portishead-s-beth-gibbons-offers-darkness-in-shades-of-uncertainty-in-taut-show-20250602-p5m44z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Portishead’s Beth Gibbons offers darkness in shades of uncertainty in taut show",
    "publish_date": "Mon, 02 Jun 2025 11:13:33 +1000",
    "category": "entertainment",
    "authors": [
      "Bernard Zuel"
    ],
    "text": "Within that was the fluidity and coiled spring of an eight-piece band of much more than a dozen parts (Howard Jacobs alone played flute, bass saxophone, tuned percussion and drums; Emma Smith tripled on violin, guitar and vocals; everyone did something extra). Through that was a physical release, almost joyfully so, of some kind of shadow dancing.\n\nIt began with middle eastern flavours, a drone and a hum and sinuous rhythms, and ended with a closed-eyed dance of limbs unfurled beneath rolling drums and chanting under-voices.\n\nHere was a night which could be summarised with its beginning and its end, and yet to do so might also suggest something altogether different than what was experienced.\n\nA sometimes queasy romantic current pulsed within those songs, Tell Me Who You Are Today and Reaching Out, one also evident in the more controlled movement and clearer, if still pock-marked, faith of Lost Changes, a mid-show moment whose refrain of “time changes, life changes/Is what changes thing/We’re all lost together” dispelled and invited darkness at the same time.\n\nAnd how could we not ride the groovy baby groovy splendour of Tom The Model, a song that evoked a never-happened-but-should have ’60s moment of Gene Pitney produced by Neil Diamond. All this was true.\n\nAnd yet inside it all was the other story Beth Gibbons tells, of that darkness in shades of uncertainty, of a taut line holding rhythms close and emotions closer still, of drums as likely to be played with mallets as sticks, sonorous rather than sharp.\n\nAnd most of all of the intensity that held, compelled through everything, broken only when at the end of each song Gibbons – whose voice is unchanged, and if anything even firmer – turned her back, retreated to the even darker space behind and broke from our gaze.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/it-clearly-works-popyrin-reflects-on-career-best-roland-garros-20250602-p5m45n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'It clearly works': Popyrin reflects on career-best Roland-Garros",
    "publish_date": "Mon, 02 Jun 2025 11:07:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "'It clearly works': Popyrin reflects on career-best Roland-Garros\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-up-wall-street-treads-water-20250601-p5m3vn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX opens lower; Soul Patts and Brickworks jump on $14b merger plan",
    "publish_date": "Mon, 02 Jun 2025 11:06:54 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket has dipped lower to start the week as investors remain in a cautious mood as they grapple with US President Donald Trump’s trade wars. Investment firm Soul Patts and brick maker Brickworks soared after announcing a historic $14 billion merger.\n\nThe S&P/ASX200 was down 15.90 points, or 0.2 per cent, at 8418.80 at 11.02am AEST, weighed down by consumer discretionary and energy stocks even as seven of its 11 industry sectors were in the green. The Australian dollar rose 0.5 per cent to 64.60 US cents as of 11.05am.\n\nThe ASX edged lower at the open. Credit: Louie Douvis\n\nBrickworks shares jumped by 16.4 per cent to $32.02 in early trade, while Soul Patts climbed 9.3 per cent after the companies announcing plans to merge after more than five decades of cross-ownership holdings between them.\n\nUnder the proposed deal, Soul Patts shareholders will get one share of the new company for each share they own, while Brickworks investors get 0.82 new company shares for each of their shares, valuing Brickworks’ stock at $30.28 - a 10 per cent premium on Brickworks’ closing share price of $27.51 at the end of last week.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/slater-peppered-on-origin-selection-20250601-p5m3xm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Slater peppered on Origin selection",
    "publish_date": "Mon, 02 Jun 2025 10:54:53 +1000",
    "category": "finance",
    "authors": [],
    "text": "Slater peppered on Origin selection\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/how-to-avoid-mid-year-burnout-20250602-p5m456.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to avoid mid-year burnout",
    "publish_date": "Mon, 02 Jun 2025 10:46:13 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "How to avoid mid-year burnout\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  }
]