[
  {
    "url": "https://www.9news.com.au/national/paracetamol-australia-tylenol-uses-everything-to-know-explainer/87b991f1-c4d2-41cb-9793-8d81963040f5",
    "title": "Trump just blamed autism on paracetamol. Here's the official advice for Aussies",
    "publish_date": "Tue, 23 Sep 2025 01:20:13 +0000",
    "category": "lifestyle",
    "authors": [
      "Sep"
    ],
    "text": "US President Donald Trump has suggested that the use of a common painkiller during pregnancy \"can be associated with a very increased risk of autism\".\n\nTrump said that women should not take acetaminophen, known by the brand name Tylenol in the US or as paracetemol in Australia, \"during the entire pregnancy\".\n\nHe claimed that he and Health and Human Services Secretary Robert F. Kennedy Jr understood ﻿\"a lot more than a lot of people who studied\" autism.\n\nUS President Donald Trump and Health and Human Services Secretary Robert F. Kennedy Jr have blamed autism on paracetamol. (AP Photo/Mark Schiefelbein)\n\nHere in Australia the Therapeutic ﻿Goods Administration (TGA), which regulates the safety of medicines, said there are no \"current active safety investigations\" into any links between paracetamol and autism.\n\nNor have any changes been made to the rules or advice around paracetamol use in Australia in response to Trump's claims.\n\n\"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy,\" a spokesperson for the TGA told 9news.com.au.\n\n\"The TGA has no current active safety investigations for paracetamol and autism, or paracetamol and neurodevelopmental disorders more broadly.\"\n\nThey explained that the use of any medication during pregnancy is ﻿subject to strict clinical, scientific and toxicological testing to ensure its safety when being registered in Australia.\n\nNo changes have been made to TGA guidelines around paracetamol in response to Trump's claims. (AP Photo/Mark Schiefelbein)\n\n\"The TGA maintains robust post-market safety surveillance and pharmacovigilance processes for all medicines registered in Australia, including paracetamol,\" the spokesperson said.\n\n\"This includes detailed analysis of adverse event reports made by medicine consumers, clinicians and pharmaceutical companies, review of published medical literature, and close liaison with international medicines regulators.﻿\"\n\nWhen safety concerns are raised about a medication, ﻿they are subject to detailed clinical and scientific investigation to confirm the concerns are legitimate.\n\n﻿If a safety issue does exist, the TGA will take appropriate regulatory actions to mitigate the risk.\n\nAussies concerned about ﻿paracetamol use during pregnancy are encouraged to consult their treating healthcare professionals for \"clinical advice tailored to their specific circumstances\".\n\n\"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy.\" (Getty)\n\nThe current TGA guidelines for paracetamol use recommend adults and children 12 years or older take 500 to 1000mg every four to six hours as necessary.\n\nThe maximum adult dose is ﻿4000mg in any 24-hour period.\n\nThe optimal dose for younger children ﻿15 mg per kg, which can be given every four to six hours as required.\n\nChildren should have no more than four doses in 24 hours.\n\nParacetamol should always be used in accordance with the directions on the label and individuals should not take more than one medication containing paracetamol at the same time.\n\nOverdosing on paracetamol can cause liver damage and, in severe cases, death.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/neil-mitchell-brett-sutton-interview-we-never-want-to-do-that-again/f503cd11-b8bf-4f9c-a156-cb8d815ad3a7",
    "title": "Many pandemic measures 'a waste of time': former top doctor",
    "publish_date": "Mon, 22 Sep 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Remember those bizarre days through the pandemic when knocking elbows replaced shaking hands because it was healthier?\n\nRemember the obsession with cleaning everything with disinfectant wipes?\n\nPens, groceries, desks, even traffic light buttons were wiped every few minutes.\n\nWell, according to the man who led the charge, it was a waste of time.\n\nUnnecessary.\n\nHe also says there are \"other ways\" rather than torturous lockdowns to manage a similar crisis, and even the ever-present hand sanitiser was not particularly useful.\n\nThis issue is like life insurance and next week's huge rent bill.\n\nWe know we have to face it but just want it to go away.\n\nBrett Sutton at a media conference where he announced his resignation as Victoria's chief health officer in 2023. (Joe Armao/The Age)\n\nThe bad news is that another pandemic is inevitable, possibly within the next decade.\n\nFor our own health, we need to work out what went wrong, what worked and what didn't.\n\nAnd here's the man who knows better than anybody the errors and the successes: Professor Brett Sutton, the chief health officer who engineered Victoria's COVID-19 strategy which was one of the toughest in the world.\n\n\"Touching elbows was probably never necessary. They're the things that we learn as we go.\n\n\"And through a hundred years of understanding infectious diseases, we overemphasised the idea that it'll pass through surfaces or handshakes or droplets spread when the reality was, it's in our breath.\n\n\"It's very unlikely to spread through surfaces. You didn't have to wash down the groceries.\n\n\"It's not like washing your hands and using hand sanitiser is a bad thing.\n\n\"But it's probably more important for the bacterial infections that occur in hospitals than it is for pandemic viruses that are mostly about the air we breathe.\"\n\nIn a rare interview, Sutton, who is now with the CSIRO, spoke to my Nine podcast Neil Mitchell asks why?\n\nHe described the pandemic as a \"horror show\" and said he woke up many mornings wanting to quit.\n\nHe says more than most he wants to forget it, but as a society we must not.\n\n\"We don't want to talk about it much. The reality is we should do our utmost by continuing to focus on the planning and prevention so that the response and recovery bits are made easier.\"\n\nThrough those dark days, lockdowns were what damaged the people most.\n\nIn Victoria, there were also curfews and limits on travelling more than five kilometres from home.\n\nBusinesses collapsed, families were traumatised. Society was frozen.\n\nIt began with a national six-week lockdown then states took over.\n\nAn empty Bourke Street during one of Melbourne's marathon lockdowns. (Getty)\n\nAfter a second wave arguably caused by government sloppiness, Victoria reached a total of 262 days locked down by the time vaccination rates built.\n\nNSW was less than half that, and with a million more people, had significantly fewer deaths.\n\nSo, did lockdown work and will the public ever accept it again?\n\n\"Maybe we will agree as a society that we never want to do that (lockdown) again,\" Sutton said.\n\n\"I'm okay with that.\n\n\"There are other ways to manage stuff. And if we all wore masks and we all got vaccinated and we all kept distances without them being mandated.\n\nThat's a potential path we can take.\"\n\nToday, some doctors argue that the COVID impact lingers, particularly with children, through increasing disengagement and school refusal.\n\nSutton agrees the kids did it hard.\n\n\"I think absolutely we should recognise that they made a significant sacrifice when they were least at risk, at medical risk.\n\n\"They made a sacrifice for people who were most at risk, people on chemotherapy, people with immune suppression, people who are very elderly and in nursing homes.\n\n\"The children were constrained in their lives and that didn't benefit them as much as it benefited others.\n\n\"But those other people, by God, needed the support of everyone.\"\n\nBrett Sutton (right) at a 2021 COVID-19 press conference with then-premier Daniel Andrews and COVID-19 commander Jeroen Weimar. (Paul Jeffers)\n\nHe says more work needs to be done to assess Victoria's hardline reaction against other states and countries.\n\n\"We've got opportunities to make comparisons around the world for the places that had four weeks of lockdown, like WA, New Zealand and places that had really long lockdowns.\n\n\"My suspicion, and this is a personal view, is that there's a larger global trend with youth that was maybe amplified through COVID-19 with all the challenges that it presented.\"\n\nSutton is unable to speak about the details of his health orders, partly because of impending court action.\n\nAlthough there has always been suspicion of undue influence by politicians in his decisions , he takes full responsibility and says he was \"in the belly of the beast\".\n\nAnd his mistakes?\n\n\"Probably a list that's too long for this podcast. Speed is of the essence. And so I think decision making around the settings that you should have is probably something that I would reprosecute many times in my mind.\"\n\nSutton mostly works from home, a business trend that emerged through the pandemic.\n\nHe is director of Health and Biosecurity at the CSIRO which means much of his job now is to plan for the future.\n\n\"I think I'm an emotional optimist, but an intellectual pessimist.\n\n\"We've got really profound challenges that will shape the nation and shape the world that are coming like a juggernaut.\n\n\"There's no hard hat-wearing, ribbon-cutting solution that's going to make it all good.\n\n\"I think we've got really, really challenging times ahead.\n\n\"A pandemic might be part of the juggernaut, I hope it's not. We've got enough to worry about on our plate.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/jimmy-kimmel-to-be-reinstated-after-suspension-following-charlie-kirk-comments-abc-says/3a2f0e00-def6-4588-b3cf-a347d6557cfb",
    "title": "Roadblock in Jimmy Kimmel's return to TV",
    "publish_date": "Tue, 23 Sep 2025 00:45:40 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "ABC will reinstate Jimmy Kimmel's late night show in the wake of criticism over his comments about the assassination of conservative activist Charlie Kirk , officials with the network said.\n\n\"We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday,\" said a statement from the network.\n\nABC suspended Kimmel indefinitely after comments he made about Kirk, who was killed September 10, in a monologue.\n\nKimmel said \"many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk\" and that \"the MAGA gang\" was \"desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them.\"\n\nJimmy Kimmel to be reinstated after suspension following Charlie Kirk comments, ABC says. (AP)\n\nKimmel has hosted \"Jimmy Kimmel Live!\" on ABC since 2003 and has been a fixture in television and comedy for even longer. He is also well known as a presenter, having hosted the Academy Awards four times.\n\nBacklash to Kimmel's comments about Kirk was swift. Nexstar and Sinclair, two of ABC's largest affiliate owners, said they would be pulling \"Jimmy Kimmel Live!\" from their stations. Others, including several fellow comedians, came to his defence.\n\nSinclair said on Monday that it would not air Kimmel's show Tuesday and would broadcast news programming instead.﻿\n\n\"Discussions with ABC are ongoing as we evaluate the show's potential return,\" the company said.\n\nSinclair owns 39 ABC-affiliated TV stations across the US, covering much of the country.﻿\n\nThere was no immediate comment from Nexstar on its plans for Kimmel's return.\n\nAndrew Kolvert, a spokesperson for Turning Point USA, the organisation founded by Kirk and now headed by his widow, posted on X about Kimmel's reinstatement: \"Disney and ABC caving and allowing Kimmel back on the air is not surprising, but it's their mistake to make. Nexstar and Sinclair do not have to make the same choice.\"\n\nPresident Donald Trump, one of Kimmel's frequent targets, posted on social media that Kimmel's suspension was \"great news for America.\" He also called for other late night hosts to be fired.\n\nDonald Trump on Jimmy Kimmel's show during his 2016 presidential run. (AP)\n\nKimmel was asked in an interview with Variety this past summer if he was worried that the administration would come after comedians. He expressed concern that a crackdown could be on the way.\n\n\"Well, you'd have to be naive not to worry a little bit,\" he said. \"But that can't change what you're doing.\"\n\nKimmel's suspension arrived in a time when Trump and his administration have pursued threats, lawsuits and federal government pressure to try to exert more control over the media industry. Trump has reached settlements with ABC and CBS over their coverage.\n\nTrump has also filed defamation lawsuits against The Wall Street Journal and The New York Times. Republicans in Congress stripped federal funding from NPR and PBS.\n\nBrendan Carr, the head of the Federal Communications Commission, issued a warning prior to Kimmel's suspension that criticised Kimmel's remarks about the Kirk assassination.\n\n\"We can do this the easy way or the hard way,\" Carr said. \"These companies can find ways to change conduct, to take action, frankly, on Kimmel, or there is going to be additional work for the FCC ahead.\"\n\nCarr denied on Monday that he threatened to revoke ABC's local station licences because of Kimmel's remarks.\n\nDo you think Jimmy Kimmel should have been taken off air? Yes 314 No 1079\n\n\"Jimmy Kimmel is in the situation he's in because of his ratings. Not because of anything that's happened at the federal government level,\" Carr said at the Concordia Annual Summit.\n\nThe suspension also happened at a time when the late night landscape is shifting. CBS announced the cancellation of Stephen Colbert's show over the summer.\n\nKimmel's contract with The Walt Disney Co.-owned network had been set to expire in May 2026.\n\nWord of the reinstatement came as hundreds of Hollywood and Broadway stars — including Robert De Niro, Ben Affleck, Jennifer Aniston, Selena Gomez, Lin-Manuel Miranda, Tom Hanks and Meryl Streep — urged Americans \"fight to defend and preserve our constitutionally protected rights\" in the wake of Jimmy Kimmel's suspension.\n\nMore than 430 movie, TV and stage stars as well as comedians, directors and writers added their names to an open letter Monday from the American Civil Liberties Union that argues it is \"a dark moment for freedom of speech in our nation.\"\n\nAlso Monday, ABC's \"The View\" weighed in on the controversy after not raising it for two episodes after Kimmel was suspended. Co-host Whoopi Goldberg opened the show saying: \"No one silences us\" and she and her fellow hosts condemned Disney's decision.\n\nREAD MORE: Australia in firing line as Israeli leader blasts global superpowers",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/qantas-suspends-all-flights-to-hong-kong/974dcf10-d115-4db9-8b8d-0d6a367e7b0a",
    "title": "Qantas halts flights to Hong Kong as super typhoon barrels towards territory",
    "publish_date": "Mon, 22 Sep 2025 22:21:55 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Q﻿antas has suspended all flights to Hong Kong for 36 hours as the territory braces for a super typhoon.\n\nHong Kong airport, a major travel hub for Asia, will be shut down for at least two days in preparation for the impact of Super Typhoon Ragasa, expected to be one of the strongest storms this year.\n\nQantas said Hong Kong's Airport would be closed from 8pm on Tuesday to 8am on Thursday. The carrier said it would contact customers who were impacted.\n\nREAD MORE: Jimmy Kimmel to be reinstated after suspension following Charlie Kirk comments\n\nPeople watch as strong waves generated by Super Typhoon Ragasa batter Basco in the northern Philippines on Monday, September 22, 2025. (AP Photo/Justine Mark Pillie Fajardo) (AP)\n\nHong Kong is a major travel hub for Asia and passengers heading for European destinations.﻿\n\nRagasa brought winds speeds of up to 295km/h when it slammed into the northern Philippines on Monday.\n\nThe giant storm was heading west and forecast to remain in the South China Sea at least into Wednesday while passing south of Taiwan and Hong Kong before landfall on the Chinese mainland.\n\nWhile Hong Kong airport is expected to remain open, authorities said flights would be significantly reduced late on Tuesday and most flight operations would be affected on Wednesday.\n\nHong Kong airline Cathay Pacific Airways said passenger flights scheduled to depart and arrive in the city after 6pm today will be suspended, with more than 500 flight cancellations expected.\n\nA shopper stands near near empty shelves at a supermarket ahead of Typhoon Ragasa in Shenzhen in southern China's Guangdong province on Monday, Sept. 22, 2025. (AP Photo/Olivia Zhang) (AP)\n\nIt said it expected flights to gradually resume from early Thursday.﻿\n\nOther Hong Kong-based airlines announced their flights would be disrupted, including budget airline HK Express, which reported a cancellation of over 100 flights between Tuesday and Thursday.\n\nRagasa is expected to bring torrential rains and heavy winds to China's mainland coastal areas, starting on Tuesday.\n\n- With AP﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/dual-living-builders-seeing-rising-trend-for-multi-generational-living-australia-property-real-estate-news/27a90aa7-27da-4f7a-bb18-3b171ebd0d75",
    "title": "Dual living in demand as solution to housing crisis",
    "publish_date": "Mon, 22 Sep 2025 10:31:17 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Irene Peel was adamant - she was not going into care.\n\n\"Mum always said, 'I'm not going into a nursing home',\" daughter Liz Flanjak told 9News.﻿\n\n﻿But with house prices skyrocketing, her options were limited.\n\nREAD MORE: Staggering number of Aussie jobs at risk over AI\n\nGranny flats could be a new solution to the housing crisis for older Aussies. (Nine)\n\nThe solution was a granny flat, just metres from her daughter's house.\n\n\"﻿It's a win-win for us because she's close,\" Flanjak said.\n\n\"I know she's safe.\"\n\nPooling resources as a family ﻿is becoming increasingly common amid the nation's housing crisis, according to Shane Windsor from Hoek Modular Homes.\n\nHe said the most common request he gets is for two-bedroom granny flats with a kitchen and bathroom.\n\n\"They're combining resources as a family to essentially utilise the land that the family already owns﻿,\" Windsor said.\n\nThis year, \"dual living\" is in the top 10 most searched keywords on real estate site Domain.\n\n\"Dual living, I think, is something that is on the rise,\" Dr Nicole Powell from Domain said.\n\n\"For first-time buyers trying to break into the housing market, it is challenging.\n\n\"It might be adult children living at home for much longer.\"\n\nDevelopers are also tapping into the dual-living trend with some new duplex designs offering two homes under the one roof, separated by a central dividing wall.\n\nAn eight-bedroom build could cost around $1 million, not including the land.﻿\n\n\"﻿It's about people coming into the property market, and with the high cost of living, finding a solution which is more cost-effective,\" Chris Thornton from G. J. Gardner Homes said.\n\nThere are some things to be mindful of, though, including council regulations and legal implications of pooling financial resources.\n\n\"To go too far down the process, without having considered what those rules will be, can be quite a waste of time and money,\" Windsor said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/one-in-four-australian-jobs-at-high-risk-of-automation-ai-disruption/ab5f43e3-5ef5-4404-b3ce-51b42396b31d",
    "title": "One in four ﻿﻿Australian jobs are at 'high risk' of automation, new research reveals",
    "publish_date": "Sun, 21 Sep 2025 19:23:12 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "One in four ﻿﻿Australian jobs are at high risk of automation as robotic processes, chatbots and AI models take over tasks previously performed by humans.\n\nAI alone could transform up to 1.5 million jobs by 2030, according to new research, and roles in retail, finance, and media are among the most affected already.\n\nResearch from ﻿Pearson has revealed that the nature of work in Australia is changing and Australians are struggling to keep up due to a growing skills gap, which could soon become a \"skills chasm\".\n\nOne in four ﻿﻿Australian jobs are at 'high risk' of automation, putting workers under fresh pressure. (Nine/Getty)\n\nAnd workers could lose a fortune in ﻿earnings if they don't start upskilling now.\n\nCurrent employee capabilities don't always ﻿align with what employers need, and that's likely to get worse as more industries embrace AI and automation.\n\n\"Almost one in four people in Australia are going to have automation impact their employment and impact their job in the next five years,\" Pearson's country head Taha Haidermota told 9news.com.au.\n\n\"Jobs will change, but that doesn't mean they're going to be eliminated, they'll just be transformed into a shape or nature that you may not necessarily have today.\n\n\"It's very easy to think, oh my gosh, the robots are coming. And that isn't true.\"\n\nWorkers who can adapt and reskill to work alongside AI and automation will thrive.\n\nThose who can't are likely to struggle because their existing skills won't fit new employer needs.\n\nSuch skills gaps are already making it hard for Aussies to transition from education to work and between jobs, whether due to an involuntary exit or automation disruption.\n\nThese slow transitions take a toll on individuals﻿ though lost income, job insecurity, and diminished wellbeing.\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nWorried AI will take your job? These are the lowest risk professions View Gallery\n\nThey also have a massive impact on Australia's economy, costing the nation up to $104 billion each year.\n\nAnd if Australians can't adapt to new ways of working, these impacts will only get worse.﻿\n\n\"Adaptability is going to be absolutely key over the next few years,\" Haidermota said.\n\n\"Because things are changing, the pace at which things are changing has increased, and the impact on ordinary Australians is how are they equipped to deal with that change?\"\n\nWhich is why it's so important for workers to start future-proofing their careers now.\n\nPearson's report suggests the best ways to do so are by prioritising upskilling and \"learning to learn\", and ﻿moving away from outdated linear career paths.\n\nWorkers who learn to adapt to career changes and reskill effectively are less likely to be negatively impacted by automation and AI.﻿\n\nThey ﻿could see wage growth of up to 12 per cent within two years, and boost the economy by slashing the time it takes workers to transition between roles.\n\nOn-the-job training and external education will help workers upskill and future-proof their careers. (Getty)\n\nEmployers should prioritise upskilling ﻿opportunities for staff, whether it be on-the-job training or external education, to better prepare them for the changing nature of work.\n\nSkills that will be most in-demand in the coming years will include collaboration, customer focus, and cultural and social intelligence.﻿\n\nGone are the days where one-time education ﻿could launch workers into a career they'd stick to for the rest of their working lives.\n\nInstead, ﻿Aussies will need to embrace career pivots outside the traditional path of attending university and climbing a linear career ladder.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/qld-alumina-fined-caustic-spray-gladstone/105805526",
    "title": "Queensland Alumina fined $1 million over caustic chemical plume",
    "publish_date": "Tue, 23 Sep 2025 01:10:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Queensland Alumina Limited (QAL) has been fined $1 million over the release of caustic spray that caused serious environmental harm and damaged people's homes and cars.\n\nThe incident at the alumina refinery in March 2022 was caused by a ruptured pipe in a high-pressure system.\n\nThe Queensland Department of Environment said the pipe contained a dangerous chemical mixture known as \"spent liquor\", which turned into a vapour plume and drifted into a residential area in Gladstone.\n\n\"While no injuries were reported, the incident posed a potential significant risk to residents' health, as spent liquor contains sodium hydroxide,\" the department said.\n\nA spokesperson said it also triggered more than $800,000 in property damage insurance claims.\n\nQueensland Alumina Limited has been operating in Gladstone for 58 years. (ABC Capricornia: Russel Talbot)\n\nOn September 22, Queensland Alumina pleaded guilty in the Magistrates Court to three offences, including one count of unlawfully causing serious environmental harm, and two counts of breaching a condition of its environmental approvals.\n\nMagistrate Nigel Rees ordered the company to pay a fine of $1 million, miscellaneous costs of $78,147 and court costs of $1,500.\n\nA conviction was also recorded.\n\nToolooa residents who lived near the refinery told the ABC their homes and cars were covered in spray droplets, which ate away at the metal.\n\nThe spray spread to the surrounding neighbourhood and damaged cars. (Supplied: Jennifer Dekker)\n\nPipes upgraded\n\nQueensland Alumina said it accepted the court's decision, and it acknowledged the seriousness of the incident.\n\nIt also apologised for not meeting community expectations.\n\n\"All properties affected by the release have been assessed and remediation completed,\" a spokesperson said.\n\nThe company said there were no environmental or human health impacts reported from the event.\n\nIt also said significant steps had been taken to prevent a similar situation from happening again.\n\n\"This includes a $13.2 million upgrade program to replace all carbon steel fittings in our high-pressure circuit with nickel-lined pipes, which have a greater resistance to erosion and a simpler maintenance program to prevent future incidents,\" Queensland Alumina said.\n\nIt has also completed a five-year environmental improvement program and spent more than $450 million to reduce risks to the environment.\n\nThe Gladstone facility is one of the largest alumina refineries in the world and produces about 3.7 million tonnes of alumina every year.\n\nThe operation is independently managed, but Rio Tinto is the majority owner.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/nsw-childcare-inquiry-ceo-questioned-over-bonuses/105805562",
    "title": "Childcare CEO unsure if bonuses were docked over safety breaches",
    "publish_date": "Tue, 23 Sep 2025 01:03:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "The boss of one of Australia's largest for-profit childcare companies has been unable to tell an inquiry whether his bonuses were docked over a rise in safety breaches.\n\nTim Hickey, the chief executive officer of Affinity Education Group, appeared at a state parliamentary inquiry into the sector on Tuesday morning.\n\nMr Hickey told the inquiry his bonus payments were tied to his key performance indicator of delivering safe and high quality centres.\n\nBut when asked by the chair, Greens MP Abigail Boyd, whether he received the full amount in the past few years, he was unsure.\n\nThe inquiry asked Mr Hickey to explain the \"significant decline\" in quality and safety since his company was taken over by the private equity firm. (ABC News: Simon Amery)\n\n\"I'd have to get back to you on that. I don't believe I have, but I don't want to misinform the inquiry,\" Mr Hickey said.\n\n\"It's a significant amount of money though. I would know if I'd got my whole $300,000 to $400,000 bonus every year,\" Ms Boyd said.\n\nMr Hickey said he could receive an annual bonus of up to half of his $625,000 base salary.\n\nLabor MP Anthony D'Adam pressed the chief executive on what dollar amount was at stake if he failed on safety questions.\n\n\"Quite frankly, if I fail at a significant level of safety and quality I can receive nothing,\" Mr Hickey said.\n\nInquiry told of breaches\n\nEarlier, the inquiry heard the rate of breaches at Affinity Education Group centres climbed from 30 per cent above the state average to 70 per cent after the company was bought by Quadrant Private Equity in 2021.\n\nMs Boyd asked Mr Hickey to explain the \"significant decline\" in quality and safety since his company was taken over by the private equity firm.\n\n\"I don't work for private equity, I work for Affinity, and my job is to sustain profitability in our centres so that we can reinvest back into the educators, back into the centres,\" Mr Hickey said.\n\nInvestigating Australia's childcare crisis Photo shows Graphic of dark room with a baby's high chair. The ABC is investigating Australia's childcare sector, revealing what actually goes on behind closed doors.\n\nAs ABC Investigations reported in May, Affinity Education Group centres were slapped with more than 1,700 regulatory breaches between 2021 and 2024.\n\nIn one case, a baby was slapped in the face by a childcare worker at an Affinity Education Group centre in South Strathfield, in Sydney's inner west.\n\nSome staff and parents told Four Corners the company's business model prioritised profit over care.\n\nSenior managers at other major childcare providers, G8 Education, Little Zak's Academy, and Busy Bees, were also scheduled to give evidence.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/doctor-choosing-self-care-over-resilience/105728568",
    "title": "As a doctor, I bang on about self-care — I'm finally taking my own advice",
    "publish_date": "Tue, 23 Sep 2025 01:01:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Over the course of my late-life medical degree, I coined the snazzy phrase, \"First do no harm begins with self-care\".\n\nIt was a play on the Hippocratic oath, designed to empower some of the other, much younger students to look after themselves throughout a high-pressure degree.\n\nDespite regularly advocating for healthy personal and professional boundaries, I wrapped up that degree surprisingly unwell.\n\nPowering on\n\nBy final year, my energy levels had declined and I'd noticed a raft of changes in my body.\n\nBeing a mature-aged student (I was 40 at the time), I told myself I was just getting old. But as we approached graduation, that thought struck a vein of terror. If the perils of age were troubling me this much at medical school, how was I going to survive internship?\n\nMidway through our final exams, I got home from a comedy gig I was performing at and had a funny turn (so to speak). My health deteriorated sharply after that but I powered on.\n\nI applied for special consideration for the exams but didn't have a diagnosis to share at that point, just the vagaries of being very unwell and a medical certificate from a local pharmacist in lieu of my fully booked GP.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nIn the dark as much as I was, the medical school rejected my application.\n\nDespite this, I passed my exams but then ended up in hospital, pale and exhausted, where we finally got to the bottom of things. A benign but nasty tumour had been lurking at the base of my brain and wreaking health havoc for the preceding year or two.\n\nIt turned out that funny turn was the tumour bleeding into my skull.\n\nI made it through exams but wound up in hospital where they found the cause of my \"funny turn\" and subsequent health issues. (Supplied: Roland Bull)\n\n\"You deserve the university medal for getting through exams with all this going on,\" said one of my new specialists a few weeks later.\n\nI wore the statement like a badge of honour for months.\n\nI felt preternaturally resilient: if I could get through medical school in the midst of a health crisis then surely, I could do anything.\n\nAll those thoughts of being less energetic and capable than my younger peers morphed into pride at being able to handle so much more than the average person.\n\nNonetheless, I postponed my internship for three months to get back on my feet.\n\nThe reprieve wasn't all smooth sailing as I packed up my house in Canberra, moved in with family in Queensland, got settled and then braced for Cyclone Alfred. But I was itching to commence life as a junior doctor so ignored my sub-optimal recovery and launched into work in April this year.\n\nHuman after all\n\nI lasted two shifts then totally crashed, physically and mentally.\n\nTail between my legs, I had to admit I was human after all.\n\nIn fact, valuing resilience over adequate self-care had been a trap that set me back a few steps on the path to recovery.\n\nWhile completing medical school that unwell was a notable achievement, it was also incredibly stupid. I'd navigated a dangerous health event in survival mode, but I couldn't live the rest of my life that way.\n\nWhy I turned down my dream job Photo shows Phoebe Thorburn stands behind a wooden kitchen bench with their hands on the benchtop, looking happy. Phoebe was offered a role that was perfect on paper, but the reality of what it entailed made them rethink what a \"dream job\" looks like.\n\nOf course, that didn't stop me from feeling like an absolute failure for having to pause internship again so soon.\n\nHappily, the extra time off gave room for some quiet contemplation. I can't help but think that, while it takes a lot of resilience to navigate a personal crisis, it takes even more to safeguard your health in a society that values testing your limits in pursuit of productivity.\n\nClearly, I still view self-care as indulgence, even though I bang on about it at every opportunity. But taking the time to be healthy and well before delving into something stressful is invaluable. I wish I'd done that rather than rushing into work before I was ready.\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\nGiving yourself permission to step back and breathe or to tread a different timeline to the people around you can prompt all kinds of apprehension, embarrassment and shame. I still feel each of those things from time to time as I carve out the necessary space to balance work and health.\n\nI'm also still itching to progress my medical career, just as long as I'm well enough and have a plan in place to stay that way.\n\nBeing cognisant of my own wellbeing will make me a better doctor and make things safer for my patients.\n\nBecause first do no harm begins with self-care and all that.\n\nRoland Bull is a freelance writer, comedian and doctor.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/deeming-rate-freeze-ends-impact-on-pension-payments/105798966",
    "title": "Why some pensioners might notice a slight drop in their next payment",
    "publish_date": "Tue, 23 Sep 2025 00:49:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Five years after being slashed to historical lows as a pandemic cost-of-living measure, deeming rates have increased again.\n\nDeeming is part of the income test for Centrelink payments, and the rate affects how much a recipient's income from assets reduces their fortnightly payments.\n\nPensioners are the largest group affected by changes to deeming rates — meaning some retirees may see a decrease in their next pension payment.\n\nLet's unpack what the new changes mean.\n\nWhen did the changes happen?\n\nThe new deeming rates came into effect on Saturday, alongside the indexation of other Centrelink payments, including the age pension.\n\nSo recipients should see the changes in their next payment.\n\nThe federal government announced these changes back in August.\n\nWhat is deeming?\n\nDeeming is a set of rules the government uses to work out how much income people earn from their financial assets — things like shares, superannuation, and bank accounts.\n\nIt assumes people receive a set income from the interest on those investments, whether they actually get that much or not.\n\nBut here's the kicker: if your investment return is higher than the deemed rate, the government doesn't count that extra money as part of your income.\n\nThat means anything you earn above that rate isn't counted in the income test for the age pension.\n\nAnd this means the lower the deeming rate, the more people can earn from their investments without it affecting their pension payments.\n\nSo if you're an age pensioner — or a recipient of another payment — earning income from financial assets, you benefit from a lower deeming rate.\n\nWhat are the new deeming rates?\n\nAs of Saturday, deeming rates increased by 0.5 percentage points to:\n\nThe lower deeming rate: 0.75 per cent\n\n0.75 per cent The upper deeming rate: 2.75 per cent\n\nThat's after five years of the lower rate being 0.25 per cent and the upper rate being 2.25 per cent.\n\nThe rates were slashed in 2020 during the COVID-19 pandemic as a way of helping retirees during the economic crisis — before that, the lower rate was 1 per cent and the higher rate was 3 per cent.\n\nWho is affected by this?\n\nAnyone on an income support payment who earns income from financial assets.\n\nBut the main group of people affected will be retirees who receive part-pension payments.\n\n\"Age pensioners comprise around 60 per cent of the recipients affected by deeming and tend to experience the largest impact from deeming on their payment rates,\" the Department of Social Services said in a draft impact analysis paper.\n\n\"This is because age pensioners tend to hold more financial assets than people receiving other income support payments.\n\n\"There are several reasons for this, including that people of age pension age have had longer to accumulate financial assets, and their superannuation balances are assessable.\"\n\nHow will it impact pensioners?\n\nNearly 70,000 pensioners will see a drop in their fortnightly payments, according to Department of Social Services estimates in the draft impact analysis.\n\nBut this is speaking quite broadly, so keep in mind that individual circumstances will change the impact.\n\nHere's the example Services Australia gives on its deeming website for pensioners:\n\nIf you're a single age pensioner: The first $64,200 of your financial assets has the deemed rate of 0.75 per cent applied. Everything over that is deemed to earn 2.75 per cent interest.\n\nThe first $64,200 of your financial assets has the deemed rate of 0.75 per cent applied. Everything over that is deemed to earn 2.75 per cent interest. If you're in a couple and at least one of you receives the age pension: The first $106,200 of your combined financial assets has the deemed rate of 0.75 per cent applied. Everything over that is deemed to earn 2.75 per cent.\n\nThere are currently more than 2.6 million people on the age pension, with 457,300 affected by deeming at the previous rate.\n\nBut the Department of Social Services estimated only 69,500 of those age pensioners will see a decrease in their payments.\n\nThat's because it's being applied at the same time as regular indexation of welfare support like the age pension, and increased payments.\n\nThe analysis said the median decrease was an estimated $6.70 a fortnight.\n\nKeep in mind that's the median, which is the number that falls exactly in the middle of an ordered data set and is generally used instead of a more common measure for averages called the mean, when higher incomes can skew the data.\n\nSo from that estimated median, we can deduce that, of the affected pensioners, half may see their payments go down by less than $6.70, while the other half may see their payments decrease by more than $6.70.\n\nHowever, this is all according to the department's draft impact analysis, which wasn't finalised or assessed by the federal Office of Impact Analysis before the government announced the changes in August.\n\nWill deeming rates go up again?\n\nPotentially.\n\nAt the moment, they're still 0.25 percentage points lower than they were before the pandemic.\n\n\"The Australian Government Actuary will take on the role of recommending future deeming rates,\" a Department of Social Services press release said in August.\n\n\"They will advise government on the most appropriate rate, guided by the returns that pensioners and other payment recipients can reasonably access on their investments.\n\n\"The government will retain the power to make adjustments, including during exceptional circumstances or events.\"\n\nAny future increases will be timed to coincide with indexation of payments, which the department says may cancel out some of the impacts of deeming rate increases on pensioners.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/thousands-of-donated-knitted-items-for-premmie-babies/105762552",
    "title": "For some tiny premature babies, all that fit are these donated knits",
    "publish_date": "Tue, 23 Sep 2025 00:37:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some days Kim Franks is in so much pain that she can't get out of bed.\n\nThe Port Stephens resident suffers from debilitating psoriasis, a chronic inflammatory skin condition characterised by rashes, sores, blisters, as well as swelling and joint pain.\n\nBut knitting has been an outlet for Ms Franks to pass the time — all while helping others.\n\nFor years, Ms Franks has been knitting items for premature babies receiving treatment in the John Hunter Children's Hospital's (JHCH) Neonatal Intensive Care Unit (NICU).\n\nMs Franks knits beanies, booties, blankets and wraps for premature babies. (ABC Newcastle: Keely Johnson)\n\n\"I do blankets, wraps, beanies, booties and the trauma teddies,\" she said.\n\n\"It keeps my mind active, keeps your hands busy.\n\n\" And it takes away from you thinking about yourself and you just start thinking about how you're helping others. \"\n\nMs Franks started donating the knitted goods during the COVID-19 pandemic when the hospital was struggling to get donations.\n\nMs Franks says knitting is a creative outlet for her. (ABC Newcastle: Keely Johnson)\n\n\"I saw a Facebook post … that because of COVID, they weren't getting people donating blankets and beanies and stuff, because people just couldn't go anywhere and do anything,\" she said.\n\n\"I thought, 'I can help with this, I'll knit up what I've got at home.'\"\n\nThanks to wool donated from people across the region and interstate, Ms Franks has continued knitting items for the NICU and donates four shopping bags full every few months.\n\n\"I would have donated thousands [of items] over the past four years,\" she said.\n\nA meaningful gift\n\nMs Franks donates four bags of knitted items every few months. (Supplied: Kim Franks)\n\nJHCH NICU service manager Natalie Butchard said the unit received thousands of donated knitted items every year from individuals and knitting groups to gift to the roughly 1,500 babies who came through the unit annually.\n\n\"Our volunteers put together a pack for each family and that might include a quilt, bonnet and booties and a cardigan,\" she said.\n\n\"Some of these tiny little babies can be 500 grams and nothing fits them commercially.\n\n\"It's a really lovely milestone for parents to be able to dress their baby, so to have something that fits the baby, and looks cute, is really special for the families.\"\n\nNatalie Butchard said the NICU is constantly busy. (ABC Newcastle: Keely Johnson)\n\nLake Macquarie parents Lucy Woods and Brant Collinson had their son Nash at 34 weeks and have been in the NICU for three weeks.\n\nLike many mothers with premature babies, Ms Woods has to visit the hospital multiple times a day to feed and hold Nash, all while caring for a four-year-old son at home, while her partner works to continue their income.\n\n\"It's definitely exhausting and draining,\" Ms Woods said.\n\n\"But in saying that, the nurses make you so welcome and it's definitely a calm environment.\"\n\nBaby Nash was born at 34 weeks. (ABC Newcastle: Keely Johnson)\n\nMs Woods said the knitted bundle they were gifted was a comfort during such a stressful time.\n\n\"It's just lovely,\" she said.\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\nMr Collinson said the gesture was selfless.\n\n\"To know there are ladies knitting at home … they'll never see the baby that they help,\" he said.\n\n\"It's really cool. It just makes you feel like everyone's here to look after your baby.\"\n\nPractical help\n\nMs Woods says the knitted bundle is a \"lovely\" gesture. (ABC Newcastle: Keely Johnson)\n\nMr Collinson said Nash was initially put on a CPAP machine to help pressurise his lungs and he needed a feeding tube.\n\nNow they were waiting for him to be able to regulate his body temperature on his own — a common struggle for premature babies.\n\nBaby Nash has struggled to regulate his body temperature. (ABC Newcastle: Keely Johnson)\n\n\"He really needed his beanie and his cardigan, so it's actually come in handy,\" he said.\n\nThe pair is confident he will be discharged in the coming days.\n\n\"If it wasn't for the beanie and the cardigan, he may not be going home as soon as he is. So thank you to whoever knitted that … because they mean we can go home sooner,\" Mr Collinson said.\n\nVolunteers sort through the donated knitted goods and make them into packs for families. (ABC Newcastle: Keely Johnson)\n\nThe JHCH NICU cares for a range of babies, from very early preterm to term babies that need surgical procedures or have difficulties with feeding or jaundice.\n\nThe 44-bed unit services all of the Hunter and New England, up to the mid north and north coasts, with patients sometimes staying up to 15 weeks.\n\n'Overwhelming' response\n\nMs Franks posted a photo of her latest bundle of donated knitted items headed for the hospital on social media.\n\nThe post received almost 4,000 likes and more than 100 comments from mothers and parents who had received a knitted item while in the NICU.\n\nA pair of tiny knitted booties made by Ms Franks. (ABC Newcastle: Keely Johnson)\n\n\"I don't think I realised, until the post, how many people were really moved by this,\" she said.\n\n\" But I'm no-one important, I'm just somebody that sits here and got a bit of time on my hands, so I try and do something with it. \"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/sydney-train-network-review-live-cable-wire-incident-government/105805558",
    "title": "'Not up to scratch': Scathing review reveals Sydney trains' maintenance woes",
    "publish_date": "Tue, 23 Sep 2025 00:14:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "A review into how a live electrical cable came down on top of a Sydney train plunging the network into chaos for more than 24 hours has found the overhead wire had been identified as a risk years earlier.\n\nIn May, the power connection device on a train between Strathfield and Homebush collided with overhead wires, bringing down a 1,500-volt electrical cable on the carriage.\n\nThe system failure at this critical junction for the rail network meant power to the six tracks between Strathfield and Homebush had to be isolated.\n\nThree hundred passengers from the train were quickly escorted out of the carriages by Sydney Trains response teams.\n\nCommuters who were on at least two other trains on other lines also had to be escorted off due to the power isolation — the whole process of detraining passengers taking three hours.\n\nPassengers were evacuated from the train onto the tracks after the incident in May. (ABC News)\n\nThe incident prompted a meltdown across multiple lines for the afternoon peak hour, with parts of the city's network grounding to a halt.\n\nBy the next morning, rail workers were repairing the overhead wires on the defective train before the power could be switched back on.\n\nBut the damage to commuters' trust and time had been done, amid reduced service frequencies and limited communication about running services.\n\nFollowing the incident commuters faced empty departure boards and little access to information. (ABC News: Jack Ailwood)\n\n'No defensible reason' for lengthy recovery\n\nThe Independent Rail Review, released on Tuesday, found the overhead wire that failed had been identified as a risk in 2020 but was never entered into Sydney Trains' defect management system and not repaired.\n\nTransport Minister John Graham said testing of the wire years ago had shown it was below the condemning level — a point of wear that determines when a wire must be replaced.\n\nThe visual inspectors who examine these wires rely on binoculars, meaning they cannot get close enough for an adequate view.\n\nThe fallen overhead wire caused massive disruption across the Sydney train network. (Supplied: NSW Government)\n\nThe review, commissioned by NSW Premier Chris Minns, found staff were provided with \"insufficient\" tools and lacked management capability to identify and deal with such an issue.\n\nThere was also \"no defensible reason\" why de-training passengers at Homebush was prolonged and that the time between the incident and the recovery was \"far too long\".\n\n\"In this incident the leadership did not appear to be confident, strong or disciplined and the teams were not deployed by that leader as we would have expected,\" the review said. \"Part of the issue was a lack of qualifications in the operation of the railway and the safety procedures and rules that accompany that operation.\"\n\nPassengers were left facing network chaos after the incident. (ABC News)\n\nThe review said another concern was the lack of communication on the day — to passengers stuck on the train, the commuters expecting to catch a train home and the broader public.\n\n\"The government received some limited communication from Sydney Trains but not in detail and not reliable,\" it said.\n\nSystemic issues addressed in report\n\nBeyond the May wire cable incident, the review highlighted the need for Sydney Trains to embrace advanced technology, such as cameras for assessing the condition of the network.\n\nOne of the recommendations was for Sydney Trains to determine whether artificial intelligence could assist in reviewing footage captured by cameras — such as identifying anomalies.\n\nMore than $450 million in funding is set to be spent on the railway network over the next four years. (ABC News: Keana Naughton)\n\nWhen the review's authors visited the Rail Operation Centre (ROC) — which manages the day-to-day running of the network — they said it was \"noisy, crowded and there was a small degree of tension\".\n\nThey recommended the physical layout of the centre and the amount of people on the floor be adjusted to make for a more \"efficient\" environment.\n\nFollowing a separate review into Sydney Trains in 2023, the Rail Repair Plan (RRP) was enacted and saw an immediate infrastructure \"maintenance blitz\" to reduce backlogs to sustainable levels.\n\nIn Tuesday's review, the success of the RRP was addressed and said the improvement in infrastructure performance had \"not been sustained since the completion of the RRP in June 2024\".\n\n'Not up to scratch', says transport minister\n\nMr Graham said the state government accepted all 12 recommendations made by the review into Sydney Trains.\n\n\"The people of Sydney expect a safe and reliable rail network — and right now, it's not up to scratch,\" he said in a statement.\n\n\" A well-managed rail maintenance program could — and should — have fixed this fault after it was detected and prevented the disruption affecting so many. \"\n\nAt a press conference on Tuesday, Mr Graham described the review as a \"blunt assessment\".\n\nJohn Graham said the state government accepted all 12 recommendations made by the review. (ABC News: Liam Patrick)\n\nOne of the report's panellists Kerry Schott said she was \"very pleased\" to see the network issues determined by the review being addressed.\n\n\"It carries over a million people every working day, so the fact that it must run properly is not a trivial one,\" she said.\n\nMr Graham said an investment of $458.4 million would be made over four years to bolster the network.\n\nIn the wake of the incident in May, Transport for NSW coordinator general of Howard Collins said it was rare for a \"catastrophic event\" like this to have occurred, describing the voltage of the fallen overhead wires as \"life-threatening\".\n\nAt the time, Mr Collins said officials did not believe a \"lack of maintenance\" had anything to do with the issue.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/women-create-community-for-rural-mums-suffering-from-loneliness/105803024",
    "title": "Raising 23 children teaches rural mum the importance of asking for help",
    "publish_date": "Mon, 22 Sep 2025 23:29:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "For Tracey Angwin and her husband Steven, raising 23 children on their farm in rural Western Australia remains one of their happiest achievements.\n\nThe couple met on a cruise ship 40 years ago and tied the knot 12 weeks later, after Ms Angwin moved from Queensland to her husband's farm near Tincurrin, 250 kilometres south of Perth.\n\n\"I knew nobody when I came here, didn't even know what farming was,\" she said.\n\n\" It was a bit of a shock, [we're] 63 kilometres out of town. \"\n\nBut she soon fell in love with the land, and was eager to grow their family and build a life on the farm.\n\nRaising a family on a farm can come with significant positives and challenges. (ABC News: Ebony ten Broeke)\n\nWhen Ms Angwin was pregnant with the couple's third child, an advertisement in the local paper about a need for more foster carers caught her eye.\n\n\"My parents always had fosters and adopted kids in our house, so our house just rattled with people,\" she said.\n\n\"[And with Steven] being adopted, he felt we should be giving something back.\n\n\"We've got lots of love to give, so we thought, 'Yeah, let's do it.'\"\n\nLife as a rural mum 'can be brutal'\n\nRaising 23 children on an isolated property was not without its challenges.\n\nWith her family on the opposite side of the country, Ms Angwin grappled with loneliness, a common obstacle for many rural parents.\n\n\"There were lots of tough times with the isolation,\" she said.\n\nAccording to national charity Motherland, which seeks to connect isolated mums in regional areas, 50 per cent of rural mothers cannot access a physical mother's group.\n\nTasmanian farmer Steph Trethewey started the charity six years ago, after her own battle with postnatal depression shone a light on the lack of support available.\n\nSteph Trethewie founded Motherland after experiencing postnatal depression. (ABC South West WA: Madigan Landry)\n\nMotherland recently hosted a fundraiser at Darkan in WA's Wheatbelt, at which Ms Angwin spoke.\n\nThe charity also hosts online mothers' groups, so that women from across the country can have a community no matter where they live.\n\n\"It's all about connection, celebration [and] talking about the tough stuff,\" Ms Trethewey said.\n\n\"Being a mum on the land can be brutal, but it's also beautiful.\n\n\" It's about making women feel less alone and we do that through sharing our stories together. \"\n\nMotherland recently hosted a fundraiser in regional WA to bring rural mums together. (Supplied: Lisa Jackson Photography)\n\nReducing stigma on farms\n\nMotherland said 80 per cent of rural mothers had experienced postnatal depression or anxiety, yet less than half sought professional help due to stigma, shame and lack of access.\n\nDenmark rural counsellor, cattle farmer and mother of two, Louise O'Neill, said farming families needed to be encouraged to put themselves first.\n\n\"Yes, work on the farm is important, but so is their wellbeing,\" she said.\n\n\"[We need] spaces where we can connect with men too and allow them just as much right to talk about their emotions.\n\n\"Then that will affect everyone, like the whole culture around farming and agriculture and family.\"\n\nLouise O'Neill lives on a cattle farm with her family in Denmark, nearly five hours south of Perth. (ABC South West WA: Madigan Landry)\n\nMs O'Neill, who also spoke at Motherland's Darkan event, said she hoped change was already underway.\n\n\"I think there is more talk on the mental load … farming is not just the business of being on a tractor, it's the business of how you handle and manage your family,\" she said.\n\n\" The more we can talk about mental health and wellbeing and not be afraid of it, the better families are going to be, the better rural life is going to be, the better agriculture's going to be. \"\n\nAfter raising 23 children on her farm, Ms Angwin said one of the best ways to handle the \"tough times\" was to simply ask for help.\n\n\"Find your community, always talk to people and you're not alone,\" she said.\n\n\"That's the biggest thing, you're not alone out there.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/alice-springs-prison-described-as-inhumane-ahead-of-summer/105789502",
    "title": "Church leader says Alice Springs jail conditions are 'inhumane'",
    "publish_date": "Mon, 22 Sep 2025 22:57:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Conditions inside the Alice Springs Correctional Centre have been described by a guard and outreach services as \"inhumane\" and dangerous as summer approaches.\n\nA correctional officer at the Alice Springs prison, who wishes to remain anonymous, said overcrowding, lack of appropriate cooling and staff shortages were putting the lives of staff and prisoners at risk.\n\nThey said prisoners were crammed into dorms that were originally built for about eight people but have been retroactively refitted to house double that capacity.\n\n\"We've had more than 17 in there depending on housing needs,\" they said.\n\n\"We had to increase numbers in dorms, but the infrastructure in the dorms hasn't increased.\n\n\"They've added bunk beds, but there's still only two toilets and two showers per dorm for 17 people.\"\n\nPrison capacity\n\nThe most recent publicly available document related to prison numbers in Alice Springs stated the prison's design capacity was 500, with a 650-person operational capacity.\n\nIn October last year, the government said it was installing another 96 beds in the prison, which would take total capacity up to 746.\n\nWhen asked by the ABC about the current capacity of the prison, a statement from the NT government put the figure much higher at 876.\n\nThe prison was designed to have a 650-person operational capacity. (ABC News: Nathan Coates)\n\nHowever, the prison guard estimated the prison population was expected to reach close to 900 when the women's centre opened.\n\nIn the summer of 2024-25, Alice Springs recorded 100 days over 40 degrees Celsius, with the hottest March day ever recorded when the mercury tipped 44.5C.\n\nInhumane conditions\n\nThe correctional officer said they had recorded temperatures as high as 34 degrees in the cells, which was a \"contributing factor\" to unrest.\n\n\"If you stand up with the beds and all their property … they can move around but not much,\" they said.\n\nThey said the conditions were inhumane and were surprised that \"there haven't been more serious injuries\".\n\n\"When our staff is below a certain number, there's operational things that we have to do, ultimately leading to blocks being locked down for the day,\" they said.\n\nHowever, officers try to give prisoners several hours out of cell each day when in lockdown.\n\n\"But an hour or two in 24 hours is not much,\" they said.\n\nAdds pressure\n\nWhen it heats up, they said the prisoners \"get a little bit agitated and it certainly adds to that pressure\".\n\n\"And then obviously the pressure of not being able to move around and being stuck inside the dorm turns into stress.\n\n\"How they vent that stress depends on the individual or what's going on in the environment.\"\n\nThe officer said that prison itself was not the punishment and was supposedly a place of rehabilitation.\n\n\"The judge punishes the prisoners by sentencing them to the time spent at the prison,\" they said.\n\n\"The prison is supposed to be where you serve your time, you get rehabilitated to come back into society and then contribute positively, hopefully.\n\n\"But the sheer number of prisoners we have, the lack of staff we have, the lack of resources that we have available to us mean that you just can't do that.\"\n\nOutreach services condemn conditions\n\nA group of churches that take turns to hold weekly Sunday services at the prison said it had written letters about the inhumane conditions.\n\nIn March, ministers from the Uniting, Anglican, Desert Life and Baptist churches wrote to local CLP member for Braitling, Josh Burgoyne, outlining their grave concerns at the lack of cooling and ventilation at the Alice Springs Correctional Centre.\n\nHowever, Mr Burgoyne said he did not receive the letter.\n\nSpokesperson for the group, Anglican Reverend Kristan Slack, said they wrote the letter after last summer's heatwave when the prisoners were subjected to extreme conditions.\n\n\"We know that heat kills,\" he said.\n\nReverend Slack described the CLP's position that the heat should be a part of the prisoners' punishment as \"inhumane\".\n\nReverend Emily Hayes and Reverend Kristan Slack condemn the conditions at the Alice Springs prison. (ABC News: Will Green)\n\n\"I think every human being made in God's image deserves to be treated with kindness and dignity, no matter what they've done,\" he said.\n\n\" I think it's just an abrogation of responsibilities our government has to care for all people. \"\n\nReverend Slack said that there was a dangerous situation brewing and the NT government needed to act as a matter of urgency.\n\n\"I'm concerned if it's like the last [summer], it's no surprise that people get upset, angry, irritable when they can't see any change to their living conditions,\" he said.\n\nThe consortium of churches met with Mr Burgoyne on Friday and said while he was receptive to their concerns that no commitments were made at the meeting to improve the situation.\n\nPrisoners not a priority\n\nMr Burgoyne said upgrades across NT prisons would cost millions of dollars that would need to come from other portfolios.\n\nJosh Burgoyne says the government's priority is to keep the community safe. (ABC News: Hamish Harty)\n\n\"You can tell me right now which schools you'd like me to take the $20 million off, which police you'd like us to get rid of so that we can fund the $20 million for the prisoners,\" he said.\n\nWhile the previous Labor government was investigating cooling solutions, the CLP has ruled it out.\n\nMr Burgoyne said jail was a punishment.\n\n\"If you commit an offence, if you beat your wife, if you do the wrong thing, you will end up in jail,\" he said.\n\n\"We will find a bed for you, and we will ensure that the community is safe. That's our government's number one priority.\"\n\nMr Burgoyne said the government would \"work with all the agencies to ensure that we're getting better outcomes as we move forward\".",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/football-ousmane-dembele-ballon-d-or-bonmati-salah-yamal/105805184",
    "title": "Dembélé beats Yamal, Salah to Ballon d'Or as Bonmatí joins rare club",
    "publish_date": "Mon, 22 Sep 2025 22:26:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ousmane Dembélé has claimed the Ballon d'Or on a night of triumph for his Paris St Germain club, while serial trophy winner Aitana Bonmatí of Barcelona took home the women's award.\n\nThe 28-year-old France forward Dembélé, who needed time and the guidance of PSG coach Luis Enrique to fulfil his potential as he inspired the capital club to their first Champions League title last season, became the sixth French player to lift the award and the first since Karim Benzema in 2022.\n\nHe beat Spain and Barcelona forward Lamine Yamal, with his PSG teammate Vitinha taking third place. Liverpool's Mohamed Salah finished fourth and did not attend the ceremony.\n\n\"What I have just experienced is exceptional, I have no words for it, what happened with PSG. I feel a bit of stress, it's not easy to win this trophy, and to have it presented to me by Ronaldinho, a legend of football, is exceptional,\" Dembélé said on stage at a Paris ceremony where he was supported by several teammates, the others being in Marseille for the Ligue 1 clash against OM which they lost 1-0.\n\n\"I want to thank PSG, who came to get me in 2023. It's an incredible family. The president, Nasser (Al-Khelaifi) is like a father to me. I also want to thank all the staff and the coach, who have been exceptional with me — he too is like a father — and all my teammates.\n\n\"We have practically won everything together. You supported me in the good and the difficult times. This individual trophy is one the team has won collectively,\" he added, later bursting into tears when he thanked his mother, who joined him on stage.\n\nHe also mentioned his first club, Stade Rennais, and the national team, vowing to win another World Cup next year with coach Didier Deschamps after their 2018 victory.\n\nDembélé's prize was one of several for PSG, who won the treble of Champions League, Ligue 1 and the French Cup last season as well as the UEFA Super Cup this year.\n\nAitana Bonmatí took home the Women's Ballon d'Or for the third consecutive year, putting her in rare air. (AP Photo: Thibault Camus)\n\nThe French champions were named team of the season, Luis Enrique was voted best coach and Gianluigi Donnarumma, who left for Manchester City in the close season, was recognised as top goalkeeper with the Yashin trophy.\n\n\"It's the result of hard work, by everyone at the club,\" PSG president Al-Khelaifi said. \"We've got young players, and stars who work for the team. It's a collective achievement.\"\n\nSpain's Bonmatí, the Champions League player of the season, won the women's Ballon d'Or for the third time in a row.\n\nBonmatí won ahead of her Spain teammate Mariona Caldentey.\n\nShe is only the third player in the award's history to win three in a row after Michel Platini (1983–85) and Lionel Messi (2009–12).\n\n\"Third time in a row here and I still can't believe it,\" Bonmatí said.\n\n\"I owe Barcelona everything, this is the club of my life.\"\n\nShe won a domestic treble with Barcelona and also reached the Champions League final.\n\nBarcelona has won the last five women's awards but it was expected an Englishwoman would win for the first time.\n\nEngland won the Euros and Arsenal took the Women's Champions League. But with five England players among the women's top 10 nominees, the highest-placed was Alessia Russo at third.\n\nAustralia's Steph Catley was also shortlisted for the award, finishing 29th in the voting.\n\nCatley was named the fourth-highest-rated defender in the women's game.\n\nWhile she did not take home individual spoils, Catley made the stage at the Ballon d'Or ceremony after her Arsenal side was named the women's team of the year.\n\nBarcelona forward Vicky Lopez won the women's Kopa trophy and Sarina Wiegman, who led England to European victory, took the Johan Cruyff award for best women's coach.\n\nThe men's and women's Gerd Müller trophies for the top scorers went to Barcelona's Ewa Pajor and Viktor Gyokeres, who joined Arsenal this summer from Sporting Portugal after a prolific season.\n\nReuters/AP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/darwin-dancer-left-waiting-for-ambulance-over-six-hours/105803840",
    "title": "Darwin dancer with dislocated knee left waiting six hours for ambulance",
    "publish_date": "Mon, 22 Sep 2025 22:15:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "The mother of a Darwin dancer who spent more than six hours waiting for an ambulance after dislocating her knee has flagged serious concerns about the resourcing of the Northern Territory's medical services.\n\nMonique Dries, 20, was performing at a dance competition at a Darwin hotel on Saturday night when she fell to the ground.\n\n\"It wasn't until I started screaming in pain that they thought it wasn't a cramp, it was something more,\" she said.\n\nHer mother Rebecca Davis called for an ambulance straight after, at about 8:15pm.\n\nShe said the call operator advised Ms Dries should not be moved or be given any food or pain medication until paramedics arrived.\n\nThe remainder of the dance competition Monique Dries was performing in had to be cancelled, since the injured 20-year-old was told not to move from the stage. (Supplied.)\n\n\"I was lying on that stage floor for like four hours, I was cold … probably because I was also in shock as well,\" Ms Dries said.\n\n\" If I moved, I would scream in pain. \"\n\nStill waiting four hours later, Ms Davis tried to take her daughter to hospital herself by loading her onto a luggage trolley — all the hotel had on hand — but was unable to get her into the car due to the position of her dislocated knee.\n\nThey then waited at least another two-and-a-half hours, as Ms Dries tried to rest.\n\nMonique Dries spent two of her six hour wait for an ambulance laying on a luggage trolley at Darwin Hotel. (Supplied)\n\nMs Davis said she and hotel staff repeatedly called for an ambulance during the time they waited and she was only able to give her daughter painkillers in the early hours of Sunday after pleading with the operator on her last call.\n\nThe ambulance eventually arrived at around 2:30am, more than six hours after the initial call.\n\nMs Davis said the paramedics provided \"perfect\" service, but when the vehicle reached Royal Darwin Hospital, Ms Dries could not be immediately admitted.\n\nInstead she had to wait another 45 minutes in the ambulance, due to ramping in the hospital bay.\n\nMonique Dries, pictured with her mother Rebecca Davis, had to wait more than six hours to be admitted to Royal Darwin Hospital after dislocating her knee on Saturday. (ABC News: Pete Garnish)\n\n\"That's where our taxpayer money goes, it's for those vital services, and not being able to have them when you need it is really disheartening,\" Ms Davis said.\n\nMs Davis said she did not blame the ambulance service for the long delays and acknowledged workers had done their best, but it was clear better resourcing was needed.\n\n\"Our whole system is broken. We need to invest more in our ambulances and our emergency services because they are so underfunded, understaffed, overworked,\" she said.\n\nMs Davis said seeing her daughter in pain for hours had been a terrifying ordeal.\n\n\"I just didn't know what she had done; the only thing we had worked out was you could see her kneecap was on the floor … it had moved so much it was on laying on the floor,\" she said.\n\nMonique Dries's dislocated knee was eventually treated at Royal Darwin Hospital. (Supplied.)\n\nAmbulance service struggling to meet 'ongoing level of demand'\n\nSt John NT director Andrew Thomas acknowledged knee dislocations were \"incredibly painful injuries\" and the ambulance's \"delayed response\" would have been distressing for Ms Dries and her family.\n\nHowever he said the service's four Darwin ambulances had received call-outs for \"multiple life-threatening emergencies\" during the same time frame and had to prioritise.\n\nAndrew Thomas says the St John Ambulance NT service lacks resourcing and has been unable to meet the \"ongoing level of demand\". (ABC News: Michael Franchi)\n\n\"Our emergency medical dispatcher assessed the patient's condition to ensure she was stable, and provided support over the phone,\" he said.\n\n\"This injury, while painful, was not life-threatening and ambulance resources had to be prioritised to other emergency cases.\"\n\n\"Between 8pm and 4am on Saturday night, our four emergency ambulances, covering the Darwin region, responded to multiple life-threatening emergencies, including 18 priority 1 cases.\"\n\n\" Unfortunately our resources cannot meet this ongoing level of demand. \"\n\n\"St John NT is currently in discussions with NT Health to increase the ambulance service's resourcing, including staff and vehicles, to increase our capacity to respond to emergencies in line with community's needs through the upcoming new ambulance service contract.\"\n\nDelays at NT hospital leaving ambulances unable to respond Photo shows Paramedic sits in car park with ambulance in background All five Darwin ambulances are at times unable to respond to emergencies due to delays paramedics face offloading patients at the NT's largest hospital, St John Ambulance NT has revealed.\n\n\"Insufficient ambulance resourcing amplifies fatigue, stress, and burnout in our staff who are already doing incredibly challenging roles.\"\n\nMr Thomas said the impacts of ramping, or delays in transfer of care at hospitals, were being felt across the country.\n\n\"The time spent at hospital significantly reduces the capacity of ambulance crews to respond to emergencies in the community, and is symptomatic of ever-increasing demands on the whole health system,\" he said.\n\nThe NT Health Department has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/afl-zach-merrett-essendon-fans-hawthorn-meeting-shame/105805134",
    "title": "Bombers president steps down as Merrett apologises to fans over trade drama",
    "publish_date": "Mon, 22 Sep 2025 21:56:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Essendon president Dave Barham has stood down from his post with vice-president Andrew Welsh to be promoted into the top role.\n\nBarham's exit comes amid what has been a rocky off-season so far for the Bombers after captain Zach Merrett held a much-publicised meeting with Hawthorn about a potential exit.\n\nBarham has been on Essendon's board since 2015 and has been the club's president since 2022. After describing himself as an \"agent for change\" upon his appointment, Barham's tenure saw Essendon overturn its senior coach, CEO, list management and strength and conditioning roles in its men's program.\n\n'The gloves are off': Zach Merrett's secret meeting a chance for Essendon to get ruthless again Photo shows Brad Scott and Zach Merrett stand together on Anzac Day Essendon has gone from an AFL powerhouse to a cellar-dweller due to its inability to make tough decisions over the last two decades, and now its captain has offered the club a chance to flip the script.\n\n\"I have given my all over the past three and a half years and tackled every challenge with everything that I have,\" Barham wrote in a letter to Essendon members.\n\n\"I took my responsibility to fight for and defend our club, our players, coaches and administrators extremely seriously.\n\n\"I'm proud of what we have achieved in transforming the club and making the hard decisions to set it up for long-term, sustained success.\n\n\"I have no doubt we are now on the right track, and I leave excited about the future.\n\n\"Andrew will be an outstanding president, and it has been a privilege to work with him.\"\n\nAndrew Welsh played 162 games for Essendon before his retirement in 2011. (Getty Images: Robert Prezioso)\n\nWelsh, who played 162 games for Essendon between 2002 and 2011, has become a highly successful property developer in his post-playing career.\n\nHe takes over having been in consultation with Merrett, who broke his public silence on the meeting with Hawthorn when attending the Brownlow Medal on Monday night.\n\nThe 29-year-old stopped for waiting media on the red carpet, speaking for the first time since it became public he was desperate to leave the Bombers after 12 seasons.\n\nMerrett gave several interviews, saying he felt \"a bit of shame\" and hated upsetting the Bombers fans.\n\n\"The Bombers fans are the best in the competition,\" he told the Seven Network.\n\n\"There's still things I need to work on to see where I end up.\n\n\"It's a bit of a shame at the moment, I am not there to upset fans, I appreciate them dearly.\"\n\nMerrett said he still \"feels the love\" from Essendon.\n\n\"It's been a difficult time for me and my family when you're dealing with things largely in the media,\" Merrett, who is contracted until the end of 2027, told Fox Footy.\n\nZach Merrett still harbours a lot of love for Essendon and its loyal fans despite meeting with Hawthorn brass about a potential move to the club. (Getty Images: Morgan Hancock)\n\n\"It's a place that I absolutely adore and have for 12 years.\"\n\nEssendon coach Brad Scott, along with Merrett's teammates Mason Redman and Nic Martin, have expressed serious disappointment about the five-time Bombers best-and-fairest wanting out.\n\nClub great Tim Watson said last week it would be \"nigh on impossible\" for Merrett to play for Essendon again, given the fallout.\n\nEven if the Bombers do stand strong and refuse to trade the contracted Merrett, he would have to give up, or be stripped, of the captaincy.\n\nLoading...\n\n\"I still feel like Brad has love for me and support for me,\" Merrett said.\n\n\"We'll see what happens in the next few weeks as we work through what's next for all of us — but there's plenty of factors at play, and a fair bit of uncertainty as well.\n\n\"I'll go into detail at a later date, but for the moment, right now, I'll get through tonight, wake up tomorrow and get back to training.\n\n\"There'll be conversations and meetings had away from the media behind closed doors with the appropriate stakeholders, and we'll see where it lands.\"\n\nABC/AAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/mallacoota-builders-struggle-five-years-after-black-summer-fires/105562838",
    "title": "Bushfire survivors still camping five years later amid builder backlog",
    "publish_date": "Mon, 22 Sep 2025 21:53:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nestled in the Croajingolong National Park, musician Justin Brady prepares a cup of tea over the fire in his makeshift home.\n\nCarved out of the landscape in Victoria's East Gippsland region, his surroundings show the level of ingenuity and resilience he has had to adopt since he lost everything in the Black Summer bushfires.\n\n\"I have heard this quote that it takes 20 years to properly recover, so I'm in the first five [years],\" he said.\n\nSurrounded by the blackened trees, which still bear the scars of flames that tore through the site five years ago, Mr Brady has managed to build a makeshift home while he waits for a more permanent place to lay his head.\n\nWith a fully equipped camp kitchen, makeshift music studio and even a tent for guests, it is hard to see where what is man-made ends and nature begins.\n\nJustin Brady is using an outdoor camp kitchen while he waits to rebuild. (ABC News: Danielle Pope)\n\nBut for all his creature comforts and positive outlook, Mr Brady is still without a permanent home.\n\nAnd he is not the only one struggling to rebuild after the fires.\n\nMr Brady said the amount of construction work generated by the fires had overwhelmed local trades.\n\n\"It's a challenge … you're trying to bring in builders to a remote area because all the builders in Mallacoota are pretty much tied up,\" he said\n\n\"There's just so much work to do after the fires, and they are under the pump too.\"\n\nJustin Brady has bought a horse float as somewhere to sleep. (ABC News: Danielle Pope)\n\nBuilding backlog\n\nMallacoota builder Andy Harris has been working in the region since 2017.\n\nHe said it had been a difficult period for the construction sector.\n\n\"There was enough work to keep everyone busy before the fires, but once the fires came it was way too much for the local tradesmen,\" he said.\n\n\"There were a series of things, from COVID to when the government put out a $20,000 grant if people built a new home, which virtually booked out builders for years and years.\n\n\"[It] meant that a lot of people who weren't ready to build were put further down the queue.\"\n\nMr Harris said local builders understood people were eager to get back into their homes.\n\n\"It isn't a nice feeling going to work and knowing that the next family is living in a caravan,\" he said.\n\n\"It's been quite difficult — we are lucky to have work but it's also quite overwhelming.\"\n\nJustin Brady's caravan has been converted into a music studio. (ABC News: Danielle Pope)\n\nA town almost lost\n\nSwathes of eastern Victoria were decimated during the Black Summer bushfires.\n\nA Victorian government inquiry found the fires destroyed more than a million hectares in East Gippsland and 316 homes, 127 of which were in and around Mallacoota.\n\nThere were apocalyptic scenes of people in a frightening red haze trying to escape the fire at Mallacoota (Supplied: Allison Marion)\n\nThe region became isolated when the only road into town was cut off, forcing locals and tourists to seek refuge on the beach as flames encroached.\n\nImages broadcast around the world showed the sky above Mallacoota painted red as residents took refuge in the water.\n\nAustralian Defence Force evacuated 1,810 people — the largest-ever maritime evacuation of Australian citizens in a natural disaster.\n\nAn Emergency Recovery Victoria spokesperson said more than $600 million had been invested in recovery following the 2019-20 eastern Victoria bushfires.\n\nHMAS Choules returns to Mallacoota for the first time since the crew evacuated more than 1,300 people during the 2019-20 summer fires. (Supplied: Australian Defence Force)\n\nMore disasters will come\n\nGippsland Lakes Complete Health deployed 25 caseworkers in the immediate aftermath of the fires and has continued to support residents.\n\nIt is part of the Alliance of Regional and Rural Community Health, a group of organisations calling for a more proactive response to disasters and dedicated funding to establish a permanent resilience team across 11 health services statewide.\n\nRecent support efforts from the Alliance of Regional and Rural Community Health. (Supplied: Alliance of Regional and Rural Community Health)\n\nGippsland Lakes Complete Health chief executive Anne-Maree Kaser said the current response model was often fragmented and reactive, leading to inconsistent support and frustrating delays.\n\n\"Working in a scenario where response is time-limited, we lose skilled recovery-trained people from positions, and it takes an inordinate amount of time to get that support up and running post-event,\" Ms Kaser said.\n\nAnne-Maree Kaser says a more proactive approach to disaster recovery is needed. (ABC News: Bec Symons)\n\n\"It [a permanent resilience team] would mean that communities are supported by people who are experienced and trained in the development work [and] the recovery and resilience work that communities need in between events, and we keep those skills embedded in local communities instead of losing them to other roles.\"\n\nMr Brady said without his local caseworker, he would not have been able to navigate the administrative maze of rebuilding.\n\nJulie Parker with her dog Luna, at an evacuation centre on the night of the Mallacoota fires. (Supplied: National Library of Australia, Rachel Mounsey)\n\nA long road to recovery\n\nJulie Parker and her family have only just broken ground on the rebuild of their Mallacoota home.\n\nThe family moved to a larger block after the fires, living in a converted shed furnished with donations from other destroyed buildings.\n\nJulie Parker is rebuilding after bushfires. (ABC News: Danielle Pope)\n\n\"It gets really crowded, it gets cold and it gets hot, and it's not ideal,\" she said.\n\nIt is a slow-going process for the owner-builders, with supply issues, costs and inevitable delays often meaning they have to reapply for permits.\n\nJulie Parker and her family have converted their shed into a temporary home. (ABC News: Bec Symons)\n\nLike Mr Brady, she has used the Gippsland Lakes Complete Health program to help navigate the rebuild process.\n\n\"I think we would never have been able to navigate the bureaucracy and the forms and the paperwork and opportunities, the funding and even the mental health issues that you are facing after such a traumatic incident,\" she said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/asx-markets-business-live-news-sept23-2025/105805154",
    "title": "Live: ASX rises as gold miners rally, Myer slumps on profit loss",
    "publish_date": "Mon, 22 Sep 2025 21:51:57 +0000",
    "category": "finance",
    "authors": [
      "Samuel Yang",
      "Gareth Hutchens"
    ],
    "text": "Nvidia says it will invest up to $US100 ($152) billion in OpenAI and supply it with data center chips, the companies said on Monday, marking a tie-up between two of the highest-profile players in the global artificial intelligence race.\n\nThe move underscores the increasingly overlapping interests of the various tech giants developing advanced AI systems. The deal gives chipmaker Nvidia a financial stake in the world's most prominent AI company, which is already an important customer.\n\nAt the same time, the investment gives OpenAI the cash and access it needs to buy advanced chips that are key to maintaining its dominance in an increasingly competitive landscape. Rivals of both companies may be concerned the partnership will undermine competition.\n\nThe deal will involve two separate but intertwined transactions, according to a person close to OpenAI. Nvidia will start investing in OpenAI for non-voting shares once the deal is finalized, then OpenAI can use the cash to buy Nvidia’s chips, the person said.\n\n\"Everything starts with compute,\" OpenAI CEO Sam Altman said in a statement. \"Compute infrastructure will be the basis for the economy of the future, and we will utilize what we're building with Nvidia to both create new AI breakthroughs and empower people and businesses with them at scale.\"\n\nThe two companies signed a letter of intent to deploy at least 10 gigawatts of Nvidia systems for OpenAI and said they aimed to finalize partnership details in the coming weeks. The power for those chips is equivalent to the needs of more than 8 million US households.\n\nUnder the new deal, once the two sides reach a definitive agreement for OpenAI to purchase Nvidia systems, Nvidia will invest an initial $US10 billion, the person familiar with the matter said. OpenAI was most recently valued at $US500 billion.\n\nNvidia will start delivering hardware as soon as late 2026, with the first gigawatt of computing power to be deployed in the second half of that year on its upcoming platform, named Vera Rubin.\n\nWith Reuters",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/trump-administration-links-autism-to-paracetamol-tga-says-safe/105803566",
    "title": "Experts, TGA reject Trump statement autism is linked to paracetamol",
    "publish_date": "Mon, 22 Sep 2025 21:48:21 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The agency that regulates medicines in Australia says paracetamol is considered safe for use in pregnancy, despite Donald Trump saying it increases the risk of autism in babies.\n\nMr Trump said that he believed pregnant women should \"strongly\" limit the use of paracetamol, also known as acetaminophen, unless they had an \"extremely high fever\" that they could not \"tough out\".\n\n\"Pregnant women should talk to their doctors,\" Mr Trump said.\n\n\"Ideally, you don't take it at all.\"\n\nRFK Jr replaces vaccine advisory panel with anti-vaxxers Photo shows Robert F Kennedy Jr speaks from behind a lectern while wearing a navy blue suit US Health Secretary Robert Kennedy Jr says his new appointments are not anti-vaxxers and the move is necessary \"to re-establish public confidence in vaccine science.\"\n\nThe Food and Drug Administration (FDA), which regulates medicines in the US, will issue a physician's notice about the potential risks of taking paracetamol during pregnancy and begin the process of initiating a safety label change on the medication, Health and Human Services Secretary Robert F Kennedy Jr said.\n\nBut the Australian regulator, the Therapeutic Goods Administration (TGA), along with the Australian Medical Association (AMA), the Royal Australian and New Zealand College of Obstetricians and Gynecologists and their American counterpart, have all reaffirmed the safety and benefits of paracetamol in pregnancy.\n\n\"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy,\" the TGA said in a statement.\n\n\"The TGA has no current active safety investigations for paracetamol and autism, or paracetamol and neurodevelopmental disorders more broadly.\"\n\nAMA president Dr Danielle McMullen told ABC News Breakfast that regulators considered paracetamol safe to use during pregnancy.\n\n\"Of course, like all medications, we try to use as little as possible when pregnant, but certainly for pain and fever in pregnancy, the advice here in Australia still is that paracetamol is still a reasonable and safe option for pregnant women to use,\" she said.\n\nDr Danielle McMullen says Australian regulators consider paracetamol safe to use during pregnancy. (Supplied)\n\nDr Norman Swan, host of the ABC's Health Report, said pregnant women were taking paracetamol for a reason.\n\n\"Fever in pregnancy is not good for the unborn child and you want to prevent fever, hence influenza immunisation, hence COVID immunisation,\" he said.\n\n\"You want to minimise the chances a woman will get infected with a virus.\n\nLoading...\n\n\"If you do get a fever, paracetamol is what will get rid of it.\"\n\nHe added, \"you shouldn't be taking any drug in pregnancy unless you need it\".\n\n\"But, if you need it, take it: you need to be more worried about the fever than the paracetamol,\" he said.\n\nAssociation does not mean causation\n\nAndrew Whitehouse, professor of autism research at the Kids Research Institute Australia and a director of Autism Awareness Australia, said there had been several studies exploring whether taking acetaminophen (also called paracetamol) during pregnancy could increase the likelihood of the offspring of the pregnancy being diagnosed with autism.\n\n\"Some studies have reported small associations, but these findings are not consistent and do not prove that acetaminophen directly causes autism,\" he said in a statement.\n\n\"Autism is a complex condition influenced by many genetic and environmental factors.\n\n\"Any small associations in this area need to be weighed against the risk of untreated high fever in pregnancy for the woman and the developing baby.\"\n\nNeurodivergent students exit mainstream schools Photo shows a teenage boy looks at the camera wearing a cap and headphone. His mum stands at his side smiling at him lovingly. Special assistance schools are experiencing growing demand as traditional classrooms fall short of meeting the needs of neurodivergent students.\n\nA study in Sweden that analysed data from 2.48 million births found that when researchers compared siblings (a method to control for genetic and environmental factors), any apparent links between acetaminophen and autism disappeared.\n\nDr Hannah Kirk, a National Health and Medical Research Council fellow at Monash University, said suggestions that paracetamol (commonly sold in the US as Tylenol) use during pregnancy could increase the risk of autism had, understandably, raised concern among expectant parents.\n\n\"Autism is a neurodevelopmental condition with no known single cause, however, research shows that genetics play a large role, with hundreds of genes being linked to autism,\" she said.\n\n\"No study has shown that acetaminophen, the main ingredient in Tylenol, causes autism.\n\n\"Some studies have reported an association between acetaminophen use and autism, while others have not.\n\n\"Importantly, association does not mean causation.\"\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\nProfessor Scott White from the Royal Australian and New Zealand College of Obstetricians and Gynaecologists described the stance from the White House as \"surprising\", in terms of the science.\n\n\"Having a fever early in pregnancy can be associated with all sorts of adverse pregnancy outcomes other than just autism,\" Professor White said.\n\n\"I would quite confidently use paracetamol in pregnancy and statements like 'pregnant women should just tough it out, if they have a fever,' contribute to what we see about limiting use of medications that are clearly safe for pregnant women.\"",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/afl-matt-rowell-nasiah-moment-brownlow-medal-voting-analysis/105804320",
    "title": "The Nasiah moment that showed the AFL has a serious Brownlow Medal problem",
    "publish_date": "Mon, 22 Sep 2025 21:25:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "If the most memorable moment out of your code's \"night of nights\" doesn't even involve the winner, you've got a problem.\n\nThis is where the AFL is at with the Brownlow Medal after another bizarre count led to more questions about the voting process and whether the umpires should still be in charge of deciding who wins the award.\n\nLoading...\n\nThe moment in question arrived towards the back end of what was at that point an exciting count as the eventual Brownlow Medal winner, Matt Rowell, held off his closest challenger, Nick Daicos.\n\nWhen Round 20 arrived, AFL CEO Andrew Dillon — who reads the votes from each game — had increased his already breakneck reading speed, particularly for games not involving contenders like Rowell and Daicos.\n\nDillon was buzzing through the St Kilda – Melbourne game, better known as the Nasiah Wanganeen-Milera game, when he read out the words that might alter the future of what has always been considered the most prestigious award an AFL player can win: \"St Kilda, N Wanganeen-Milera, two votes.\"\n\nThe reaction from around the room said it all.\n\nPlayers are so used to keeping their poker face on during events like this, but Wanganeen-Milera couldn't help himself, cartoonishly popping his eyes out in disbelief.\n\nHis teammate and St Kilda captain Jack Steele's hands said what his words couldn't at that point.\n\nOver at the Melbourne table, the Demons burst out into laughter after veteran Demons midfielder Jack Viney, he of 23 disposals and 16 tackles, took home the three votes.\n\nFor context, Wanganeen-Milera finished that game with 34 disposals and four goals, and ended the game doing this.\n\nWanganeen-Milera's game was so prolific that it was almost instantly regarded as the best individual game of the season and perhaps of this generation. It was so good that Simon Goodwin referenced it in his farewell press conference when he was sacked as Melbourne's coach just a few weeks later.\n\nThe AFL, like its rival sporting codes around the world, stays alive long after the final goal of the season is kicked due to legacy conversations between fans in every corner of Australia.\n\nNo matter what the sport is, these conversations all go the same way.\n\nHow many premierships have they won? How many All-Australian jackets? How many Norm Smiths? At some point in the conversation comes the inevitable question: How many Brownlows?\n\nMoments like the Nasiah game might alter how these conversations go from now on, because it is clear the Brownlow has lost some of its lustre.\n\nCan we still use the Brownlow as a means by which to decide where players sit on the all-time pyramid? Perhaps not.\n\nIt has long been decided that this is an award that only midfielders can win despite some of the game's most valuable players being those that play in key positions.\n\nMidfielders seemingly having a monopoly on the Brownlow has led to hilariously bloated vote totals in recent years.\n\nLast year, Carlton skipper Patrick Cripps smashed the record by polling 45 votes.\n\nNick Daicos has now polled 98 votes in the previous three seasons but has not come close to winning the Brownlow Medal. (Getty Images: Michael Willson)\n\nThis year's runner-up, Daicos, has now polled 98 votes in the last three years without really coming close to ever winning the Brownlow.\n\nDaicos's average of 33 votes over the last three seasons would have won him the Brownlow in all but six seasons under the 3-2-1 voting system.\n\nNoise about whether the voting should be taken off the AFL's umpires isn't new, but will feel as intense as ever at league headquarters following the reaction to Wanganeen-Milera's two-vote game.\n\nIn yesteryear, the umpires were permitted to have stat sheets to assist them when deciding which players to award votes to. That is no longer allowed due to integrity concerns surrounding the award following a controversial betting scandal involving a former umpire.\n\nFans genuinely considered whether umpires had gotten Gold Coast stars Noah Anderson and Matt Rowell confused, such was the bizarre nature of votes awarded in certain Suns games. (Getty Images: Michael Willson)\n\nIf stat sheets were available to aid the umpires, it is very likely Rowell would not have taken home the Brownlow this year.\n\nOn three separate occasions in the early part of the count, the Suns midfielder took home three votes in games where he didn't poll a single coaches vote.\n\nIt is proof that the disparity between how the umpires see the game and how the coaches see the game has never been greater.\n\nThe voting involving Suns games was so confusing at stages that fans on social media genuinely wondered whether umpires had gotten Rowell and fellow Suns midfield dynamo Noah Anderson confused.\n\nIt was something that Rowell himself couldn't help but allude to in his victory speech, as he paid tribute to the impact his best friend, Anderson, has had on his career.\n\n\"I think I might've pinched a few votes off him that he should've got,\" Rowell said.\n\nThe sad part of the voting controversy is that it takes away from what is undoubtedly the highlight of Rowell's young career.\n\nThe AFL has been waiting on Rowell and the Suns for a few years, but this is further confirmation that both have well and truly arrived.\n\nThe way in which Rowell's victorious count began was similar to how he arrived in the AFL after being taken first overall in the 2019 draft by a floundering Suns side.\n\nRowell was touted as a future Brownlow winner just a month into his AFL career before a shoulder injury at Kardinia Park dragged his career to a screeching halt.\n\nRowell was awarded the Brownlow Medal after a career-best season that saw him average 26.3 disposals, 8.6 tackles and 8.2 clearances per game. (Getty Images: Chris Hyde)\n\nThe votes at the end of that season showed he'd polled three votes in his second, third and fourth career games, something unseen in a first-year player.\n\nThis year he went one better, becoming the first player in league history to poll three votes in each of his first four games.\n\nAfter Daicos came into the night as the raging hot favourite, this was the first sign that the night wouldn't go to plan for the Collingwood superstar.\n\nThe voting drama shouldn't take away from what a wonderful footballer Rowell has become, as many predicted five years ago.\n\nBrownlow Medal red carpet: All the best fashion from AFL's night of nights Photo shows Arlette Jones and Nick Daicos of the Collingwood Magpies. See which players and partners' looks turned heads during the red carpet arrivals ahead of the 2025 Brownlow Medal ceremony.\n\nRowell took some time to recover from the shoulder injury in his debut season, but this year showcased all the traits that made him one of the most hyped top picks heading into the 2019 draft.\n\nHe is able to take a game by the scruff of the neck like very few midfielders in the competition can.\n\nYou want to stop him? You better have three or four midfielders willing to take on the gargantuan task of denying him when the ball is in the same postcode.\n\nThe scary part for the rest of the AFL is that Rowell only seems to be scratching the surface of how good and dominant he can really be.\n\nTo take home the Brownlow, you've got to have a few things go your way.\n\nYou need to be on a team that is decent enough to be in the top eight, unless you're an all-timer like Gary Ablett Jr.\n\nMatt Rowell polled 39 votes to win the Brownlow Medal ahead of Nick Daicos and Bailey Smith. (Getty Images: Morgan Hancock)\n\nYou need to stuff the stat sheet, but that alone isn't enough. The stats need to be impactful.\n\nThis is where Rowell thrives.\n\nWhen Rowell is having a good game, it is impossible not to feel it, even if you're just watching the Suns play on TV while sitting in your living room.\n\nEach possession feels impactful and deflates Rowell's opponents. It is how he is able to take home three votes in games where he's logged possession tallies in the mid-teens.\n\nIn previous generations, the Brownlow Medal was the crowning achievement for a player. It was a sign that you had arrived as one of the game's elites.\n\nRowell is one of those, his accolades outside of the Brownlow Medal suggest this.\n\nSadly, the medal that used to previously rubberstamp a player's arrival in the upper echelon of the game no longer carries the weight it once did.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-23/wa-government-consider-driving-instructor-camera-mandate/105790618",
    "title": "Dash-cam mandate on the table as WA reviews driving instructor laws",
    "publish_date": "Mon, 22 Sep 2025 21:14:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Driving instructors in Western Australia could be forced to install cameras inside their vehicles in a bid to better protect vulnerable young students.\n\nAn ABC 7.30 investigation this month uncovered hundreds of allegations of young women being sexually harassed or assaulted by their driving instructors.\n\nMany of those cases come down to the student's word against the instructor's because no Australian jurisdiction currently requires instructors to have dash cams.\n\nSouth Australia is working towards requiring cameras and GPS tracking for all training vehicles, although the cameras have been opposed by some instructors.\n\nThe WA government is considering mandating the use of dash cameras inside driving instructors' cars. (ABC News: Keane Bourke)\n\nThe WA government has now announced it will soon consider whether to follow suit.\n\n\"Anyone undertaking a driving lesson should be able to do so safely,\" Assistant Transport Minister, Jessica Stojkovski, told the ABC in a statement.\n\n\"The Department of Transport and Major Infrastructure (DTMI) is preparing to review the Motor Vehicle Drivers Instructors Act 1963, including whether [camera surveillance units] should be made mandatory in these vehicles.\"\n\nCamera surveillance units are currently mandatory in taxis.\n\n'Benefits on both sides'\n\nMs Stojkovski said the review would consider a range of issues associated with the licensing of driving instructors under the 62-year-old law, but indicated she supported in-car cameras.\n\nJessica Stojkovski said the dash cameras would give parents and instructors peace of mind. (ABC News: Keane Bourke)\n\n\"I have a 15-year-old who's about to start doing driving lessons. I wouldn't have a problem with her driving with an instructor with a camera in the car,\" she said.\n\n\"I think it provides a level of comfort for parents.\n\n\"It actually provides a level of comfort for driving instructors too, or driving test [assessors] as well … so I think there are benefits on both sides.\"\n\nLack of clarity\n\nTodd Wecker has been teaching learner drivers and driving instructors for years and said he would \"love\" to install an inward-facing camera and had already looked into it.\n\n\"If there was a report or something come up, we can show this is what actually happened,\" he said.\n\nTodd Wecker said he supported the use of dash cameras for driving instructors. (ABC News: Keane Bourke)\n\n\" So it gives security for myself, plus also for my student. \"\n\nBut he said current laws were too ambiguous.\n\n\"There's not enough clarity around where we stand in doing this as well, and you certainly don't want to cross any borders of privacy,\" Mr Wecker said.\n\nMr Wecker is concerned current laws are too ambiguous. (ABC News: Keane Bourke)\n\nHe also hoped the government's review would consider how to make existing complaint mechanisms more effective.\n\n\"It's more about getting the people to come forward and make that complaint to start with,\" he said.\n\nWhat the numbers show\n\nData released to the ABC showed only 113 complaints had been made to the Transport Department about driving instructors since 2021.\n\nMost were classed as practical driving assessment \"booking misuse\" (43 per cent), or \"unlicensed driving instructor\" (27 per cent).\n\nOnly one complaint of sexual assault was made, with five reports of sexual misconduct.\n\nThere have been 113 complaints made about WA driving instructors since 2021. (ABC News: Keane Bourke)\n\n\"Investigations into a driving instructor proceed based on the nature and seriousness of the complaint and the ability to take action,\" a department spokesperson said.\n\nOver that period, the department said it conducted 1,021 suitability reviews of driving instructors as part of new licence applications, reviews of existing licenses or following on from investigations.\n\n\"Reviews include medical fitness as well as assessment of whether a driving instructor is considered fit and proper,\" the spokesperson said.\n\nAs a result of those reviews the department said five licenses were cancelled.\n\nCameras not a done deal\n\nWhile the review of driving instructor laws was first flagged as part of a road safety roundtable held in September 2024, there is no firm timeline for its completion.\n\n\"Work will commence on this review in the coming months, with the review to be completed once all relevant issues have been identified and addressed,\" a Transport Department spokesperson said.\n\nMs Stojkovski cautioned that just because ideas were put forward for review it did not mean they would be adopted.\n\nIt's not known when the review of the act will be completed. (ABC News: Keane Bourke)\n\n\"There are lots of sensible ideas that don't necessarily eventuate,\" she said.\n\n\"That's why we've included it, to test with the drivers and with the department and with parent groups, whether this is something that they'd be comfortable with and happy to see.\n\n\" I think it's an acknowledgement that ... we're living in a digital world, and those things are forming standard practice. \"\n\nMs Stojkovski added that while any reports of sexual assault or harassment should be referred to WA Police, the department did have a role to play.\n\nComplaints can be made on the department's website, by email, over the phone or in person.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/eddie-jimmy-clash-over-zorko-act-20250923-p5mx9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eddie, Jimmy clash over Zorko act",
    "publish_date": "Tue, 23 Sep 2025 11:44:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Eddie, Jimmy clash over Zorko act\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/not-just-the-murdochs-how-to-stop-destructive-inheritance-battles-20250923-p5mx78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not just the Murdochs: How to stop ‘destructive’ inheritance battles",
    "publish_date": "Tue, 23 Sep 2025 11:41:47 +1000",
    "category": "finance",
    "authors": [
      "Noel Whittaker"
    ],
    "text": "The Murdochs made headlines when they settled their family battle recently, but you don’t need to be a billionaire to have trouble with siblings. Money and inheritance can bring out tensions in the best of families, and those fights can be exhausting and destructive.\n\nAs Donal Griffin, Sydney estate lawyer at Legacy Law and trust family adviser, often reminds me, one of the big flashpoints is the discretionary family trust. They work well for a couple, but once the next generation comes along things get tricky. Imagine being told in your 50s that you now have to run a trust with your brothers and sisters – it’s no surprise sparks fly.\n\nThe Murdochs made headlines when they settled their family battle recently, but you don’t need to be a billionaire to have trouble with siblings. Credit: Marija Ercegovac\n\nThe Murdochs’ Nevada hearing, details of which were leaked to the media, showed how courts apply a black-letter approach when interpreting trust deeds. These are often signed without much thought, then forgotten until a dispute erupts.\n\nIt’s not unlike a shareholders’ agreement, which is ignored while business runs on consensus – until suddenly, it doesn’t. While parents control trusts without involving their children, later they’re often horrified to discover their adult children may not run things the same way. As Griffin says, the transition is from a monarchy to a democracy – and there’s usually a revolution along the way.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/people-don-t-want-to-have-this-conversation-virginia-tapscott-s-uncomfortable-crusade-20250909-p5mto8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘People don’t want to have this conversation’: Virginia Tapscott’s uncomfortable crusade",
    "publish_date": "Tue, 23 Sep 2025 11:35:08 +1000",
    "category": "finance",
    "authors": [
      "Parnell Palme Mcguinness"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Virginia Tapscott looks every inch the tradwife. She’s blonde, petite, and pretty. Her hair is loose and long; the sleeveless lavender top she’s worn to lunch matches her phone case. Photos of her with her husband and four children on the farm are redolent of the tradwife aesthetic. There’s no doubt I could, if I wanted to, paint her as one of the “traditional wives” that have been amassing huge social media followings for embracing the role of wife and mother, turning their backs on career-feminist empowerment. But Tapscott doesn’t fit neatly into that box. In the course of our discussion, I wonder if there’s any box that will ever contain this woman in all her contradictions. On the day we meet at Pyrmont’s Zebra Lounge, she’s flown from rural Albury to meet me. She loves seafood, and eating it by the water is a rare treat. The outdoor dining area looks out over a playground, deserted in the rain. The absence of children serves to emphasise the irony that Tapscott, who has written extensively about her choice to stay home with her children, is not home with her children. I want badly to ask her about that. Tapscott has a “tradwife” vibe, but she’s not easy to pigeonhole. We hurry to get the ordering out of the way – there’s so much Tapscott wants to talk about that if we don’t do it now, we’ll never cover off everything before she has to fly home. She’s quick to choose the seared yellowfin tuna with a black poppyseed crust, but hesitates over the wine choice. She’s looking at a French chardonnay, which is $18 a glass. Definitely not Albury prices. “That’s so expensive!” she exclaims, settling instead on an Alsace pinot gris. Tapscott has written a book, which she’s keen to promote. All Mothers Work confronts the notion that women who choose to care for their children full-time are embracing a regressive social hierarchy. It challenges society to properly recognise and honour care work, paid and unpaid. She sent me the manuscript after we met at a conference last year. In contrast to her strong prose, she has a country reserve about her. She often holds back in public debates out of excessive politeness, waiting till everyone else has had a chance to speak. Yet, there’s a certainty about her that comes through even when she’s silent.\n\nAdvertisement\n\nThe book gropes towards a new kind of feminism. “The only liberation that was ever offered or envisaged for women was one where they could be less like themselves,” she writes. “Men and women came to believe that the only way to help women was to allow them to assimilate into a man’s world.” “I’m trying to think what I was thinking about when I wrote that,” she muses. But then it comes to her. “I think we have a really tough conversation to have about internalised misogyny. So ultimately, this idea that women could only be empowered by being in the paid workforce or assuming masculine roles is misogynistic.” Seared yellowfin tuna with a black poppyseed crust. Credit: Edwina Pickles This is not the feminism of our times which, according to Tapscott, only supports unpaid caregivers by getting them out of unpaid work. Tapscott calls it “career feminism in a care cloak”. I need to know how the 34-year-old has developed such unfashionable ideas. Tapscott thinks it’s down to her upbringing. Virginia Tapp grew up in rural Narrabri. Her dad died before she was born; her widowed mother worked on a farm, driving trucks and tractors, and doing the books. The kids didn’t go to childcare, but just tagged along with their mother. As a result, she says, “I feel a bit outside of the culture sometimes. I feel like I’m looking in on the way society is, and the way culture is a lot of the time. It enables me to be hypercritical of it.” Her exposure to mainstream culture was mainly through the radio that was constantly on in the background. That led to her interest in becoming a journalist. Her first job was at the ABC, followed by a stint at The Courier in Narrabri.\n\nAdvertisement\n\nWhen she had her first child at 25, her son Oscar, she planned to put him into childcare to continue her career. “I remember having this conversation with my husband. Like, he’s one now, this is what people do; women go back to paid work now.” But it didn’t work out. Oscar was miserable; she was too. When the second baby came along, Tapscott and her husband decided she would give up formal work and freelance where she could. “We were lucky,” she explains. “We lived in a shack that my husband built on my father-in-law’s property. We lived in a rural area. I still drove my Toyota Corolla I’d had since uni. Our costs were just quite low, and we were young.” She acknowledges this isn’t an option for many families struggling with the cost of housing. Because the universe loves contrasts, this is the moment when our luxurious plates of food arrive. Tapscott exclaims at the beautifully plated tuna, seared lightly on the outside and extremely rare. My food envy dissipates as soon as I taste my seafood pasta, which is stacked with prawns and mussels and finished in a velvety red bisque. Seafood pasta stacked with prawns. Credit: Edwina Pickles Before she even takes a bite, Tapscott has leaped into telling me that she began writing compulsively about what it was like being a mother after her son was born. Her articles seemed to resonate with readers, and it set her on the path she’s on now, saying more and more of the unsaid. She seems to have completely forgotten her food. Thank goodness it doesn’t need to be hot because she’s back in full flight. “People don’t want to have this conversation because it’s really uncomfortable. If we admit that the systems we have in place aren’t optimal, we’re admitting that the whole underpinning of women’s liberation is flawed.” Now seems a good time to ask my question about Tapscott’s central contradiction: much of her writing has been about motherhood, the tug women feel to spend more time with their babies, and the choice to take on the work of child-rearing rather than paid work. Yet here she is in Sydney, a one-and-a-half-hour flight and a world away from her children, gesticulating passionately about the book she’s just written. What part of this is not traditional workforce participation?\n\nAdvertisement\n\nFor the first time in a while, she becomes still again. “I can identify cultural forces that devalue caregivers, but that doesn’t mean I’m immune to them,” she says with a wry smile. “I am also a product of a culture where my self-worth is derived from my paid contributions, which has been a constant struggle for me in motherhood. “That’s why I have worked to try and raise cultural awareness of the value of caregiving, so that my daughters and sons can grow up in a society where they get validation, and they feel valuable in a caregiving role.” She fires up again. “Why can’t we attract policy mechanisms that support caregivers? Because,” she answers her own question, “deep down, most of us haven’t really learnt the true value of caring”. Our conversation is taking place in the aftermath of shocking revelations of widespread sexual and physical abuse of children in childcare centres. Nicola Forrest’s Minderoo Foundation – which is behind the Thrive By Five campaign for universal centre-based childcare – has found that one in 10 parents has withdrawn children from care and 16 per cent have reduced hours of care. Minderoo says this is indicative of “a system in crisis”. Tapscott sees it as vindication and has ramped up her advocacy for childcare to be valued by giving parents greater choice in how it’s delivered. Parents are questioning their childcare options after the industry has been rocked by a series of scandals. Credit: Justin McManus She’s spoken and written about the need for more support for women to stay longer with their babies and to use the childcare subsidy now only available to centre-based care for more flexible modes of care, like grandparents, or nannies. Many parents are getting behind a campaign she is associated with. Which means I now have to move the conversation onto delicate ground. As she has explored in a podcast, Tapscott and her older sister were sexually touched by their step-grandfather when they were little. Her abuse happened in a home setting as she was being cared for by relatives. How does she square that with calling for more in-home care? Is home really better than a well-regulated childcare setting?\n\nAdvertisement\n\nHer tone drops and she hesitates. But she has obviously thought this through. Her answer is fluent and confident. “People who say you can’t support care in the homes because they’re unregulated, and child sexual abuse occurs there are missing the point entirely in terms of primary prevention,” she says. As a child sexual abuse survivor, she believes that the answer is to encourage people who’ve experienced abuse to speak out, so offenders can’t hide behind secrecy. “Also,” she concludes, “it’s a ridiculous notion that any unregulated space is now not appropriate”. That sounds like a vaguely libertarian idea. I want to know where she sees herself on the political spectrum because I for the life of me can’t figure it out. On the one hand, her family advocacy and the whiff of trad-wifery might lead people to label her as right-leaning. But that’s not borne out by her work. I’ve scrawled a note against one passage in towards the end of her manuscript: “Communalist or communist?″⁣\n\n“So confused,” she sighs. “I don’t really fit in anywhere.” The bill. But then she confirms what I’ve been wondering: “I think my approach to early childhood is really quite influenced by socialism.” Margin note triumphant. She goes on to explain: “I think human capital is a public good, and we need to be investing in that. And individualism has really fallen down in the current macroeconomic environment that we have in Australia, where people can’t and won’t have more children because they can’t afford it.” Somehow, despite talking non-stop, we’ve finished our meals. I buy some time by ordering a coffee – she demures – and steer the conversation onto the unusual story of how her book has been published. “The only feasible way I could write it was if I had an advance because I just didn’t really see myself being able to afford that much more free labour”. So she crowdfunded the book. The All Mothers Work Kickstarter raised $33,000, covering childcare and printing costs. In the meantime, this advocate for the choice to stay home has started studying medicine. “I’m really excited about it,” she enthuses. “I mean, health issues and my advocacy for caregivers, it’s all connected. So many health issues, public health problems that arise from people not having time to care for themselves and for each other.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/nsw/rail-review-live-nsw-government-releases-scathing-report-into-sydney-trains-20250923-p5mx7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rail review LIVE: NSW Government releases scathing report into Sydney trains",
    "publish_date": "Tue, 23 Sep 2025 11:32:14 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Jessica Mcsweeney"
    ],
    "text": "Sydney Trains chief executive Matt Longland puts it bluntly: “We did not take care of passengers”.\n\nThe report spells out how passengers were failed on May 20 and 21.\n\nThe “incident train” came to a standstill about 50 metres short of Homebush station at 2.56pm but passengers were not removed until three hours later.\n\nThe incident train which triggered two days of chaos. Credit: Anthony Segaert\n\nFour other trains were left stranded between stations: two within 300 metres of Leppington station, one 720m short of Flemington, and a fourth with one carriage on platform seven of Strathfield station.\n\nPassengers were taken off the Strathfield train within minutes, apart from one passenger with a mobility scooter who left the train almost two hours later. The other three trains arrived at the next station and passengers disembarked within an hour.\n\nFor the “incident train”, passengers were on board for three hours and were left for long stretches without communication.\n\nOne passenger described how about 300 people were stuck with no water, no power and no air-conditioning. For the final 45 minutes, there was no communication and many people had lost battery power in their mobiles and needed the toilet.\n\n“In the Panel’s view, many aspects of [the passenger]’s experience are simply unacceptable,” the report said.\n\n“Detraining took far too long, with the negative effects of this experience compounded by the absence of meaningful customer care – including more assistance in completing their journeys once passengers disembarked. We are also of the view that, with their consent, customer details should have been taken to allow subsequent follow-up.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Still a bit to get through’: Storm star no certainty to face Sharks",
    "publish_date": "Tue, 23 Sep 2025 11:29:08 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh",
      "Billie Eder",
      "Roy Ward"
    ],
    "text": "Melbourne Storm playmaker Jahrome Hughes still has some training sessions to get through before he can be cleared to play in the preliminary final on Friday night.\n\nThe reigning Dally M Medallist is recovering from a fractured forearm and racing against time to prove his arm has healed enough to take on Cronulla AAMI Park for a spot in the grand final next week.\n\nNRL teams will name their sides on Tuesday afternoon and Hughes will likely be in Melbourne’s extended squad with the hope he is fit to play by game day.\n\nStorm captain Harry Grant said Hughes was looking good at training, but the club’s tougher sessions were still to come before Craig Bellamy and his staff make a final call on selection.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/when-it-feels-like-the-world-is-going-to-hell-in-a-handbasket-where-do-you-find-inner-peace-20250917-p5mvv2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When it feels like the world is going to hell in a handbasket, where do you find inner peace?",
    "publish_date": "Tue, 23 Sep 2025 11:13:57 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "To Dr Shannon Foster it’s known as the mangrove cathedral. Hidden in plain sight at Sydney Olympic Park, the space under the tree canopy is more than a place of beauty; it’s a natural sanctuary offering a chance to re-centre, reflect – and connect with Country.\n\n“Mangroves have these tall overarching branches that weave into each other and create a big canopy that creates what I can only describe as the perfect human habitat,” Foster says. “It doesn’t matter what is going on outside – it can be windy, hot, dry, humid or whatever, and this makes its own little microclimate. It is cool, it is calm, it is peaceful.”\n\nDr Shannon Foster says the “mangrove cathedral” at Sydney Olympic Park is more than an oasis of calm, it’s a place to re-centre and reflect. Credit: Louie Douvis\n\nIn the troubled times we live in, the search for places where peace resides has gained greater importance. While ‘No religion’ was the second most common response after ‘Christianity’ in the 2021 census, for many the desire remains to connect with something greater, whether that’s identified as god, the universe or some unnamed energy source. And that is often best facilitated in environments, natural and human-made, that promote opportunities for reflection.\n\nMore than somewhere to switch off from the world and restore balance, these places provide an opportunity to connect with something deeper, in a spiritual sense.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/light-years-team-brings-its-neighbourhood-italian-to-brisbane-20250915-p5mv6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Light Years team brings its ‘neighbourhood Italian’ to Brisbane",
    "publish_date": "Tue, 23 Sep 2025 10:49:53 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Light Years team brings its ‘neighbourhood Italian’ to Brisbane Plenty of small-town operators have tried and failed to take on the big smoke. Newstead’s Bar Monte shows how to do it right. Matt Shea September 23, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nHow do you take a restaurant group from a tourist town to a city? It’s not easy. There’s a different style of diner, of course, and more competition. But also different produce, different suppliers, different landlords, different staff. Bar Monte opened in Newstead earlier this month. Markus Ravik Australian food and beverage is littered with stories of small-town stars who took on the big smoke and swiftly had their backsides handed to them.\n\nAdvertisement\n\nBut if you had to bet on anyone making it work, it’s Arcade Agency, the hospitality “collective” best known for Light Years, which originated in Byron Bay. And perhaps it already has, opening a Light Years in Perth in April; thus far, that restaurant has been a hit. Related Article 1930s Brisbane apartments transformed into stunning new restaurant Now comes Bar Monte in Brisbane. It’s the second Bar Monte after the Gold Coast original, which opened in December. “One thing that’s really convinced us to open in Brisbane was the impact Light Years has had in Perth,” co-owner Lorenzo Toscani says. Bar Monte has transformed the old Allonda digs on Longland Street. Markus Ravik\n\nAdvertisement\n\n“The vision with Light Years before I was with them was always to be in coastal towns – start in Byron Bay and then obviously move up to the Gold Coast, and then Noosa. And then right in the middle of COVID they came up with Newcastle, which was a big step-up in terms of capacity.” This gradual approach has served Arcade Agency well, and it’s taken place against the background of a food and beverage scene where – since the pandemic, in particular – the ties between the cities and the regions, between farmers and producers and the city eateries they serve, have become stronger and stronger. Bar Monte’s menu is much the same as Miami, with clever twists on familiar classics. Markus Ravik “When we opened on the Gold Coast we already had Brisbane in mind, as well,” Toscani says. “Brisbane is growing so fast at the moment, there will be the Olympics.\n\nAdvertisement\n\n“As an Italian who landed in Australia in 2012 and his first city was Brisbane, when I went back a couple of years ago, I really fell in love with how much it had changed. We saw the opportunity and wanted to be part of it.” Vodka paccheri with nduja and stracciatella. Markus Ravik Bar Monte opened mid-September in the Longland Street tenancy previously occupied by Allonda. The bones of the place are the same, with the staircase to the right of the long bar that faces the entrance and laneway that runs between Longland and Wyatt streets. The fit-out by Studio Plenty is moodier and more intimate and playful than Allonda, with dark tiling and marble counters, timber panelling and clever feature lighting. The treatment is modern but nostalgic, and suits the restaurant’s slightly hidden location.\n\nAdvertisement\n\nYellow fin tuna with pineapple, green chilli, lemon and koji mayonnaise. Markus Ravik “[Bar Monte] is ‘neighbourhood Italian’, so we wanted to make it look a little bit retro but with a trattoria feeling – that Italian feeling,” Toscani says. The menu is similar to the Miami original, with engaging twists on familiar Italian items, particularly when it comes to snacks and entrees. Beef carpaccio with truffle mayo, fried capers, shallots, reggiano. Markus Ravik A burrata entree is spiked with nduja and cashew pesto, Ortiz anchovy toast is given a glow-up with smoked tomato butter, and there’s a mortadella bun with pickled green chilli and limoncello aioli that’s become a minor star at the Miami restaurant.\n\nAdvertisement\n\nThe pastas are all unctuous numbers that range from a cacio e pepe and prawn and chilli linguine, to mezze maniche served with pork sausage and Tuscan kale, and a vodka paccheri that tosses in nduja and is finished with a liberal dose of stracciatella. The restaurant retains the basic layout of Allonda before it but has been given a completely new look by designers Studio Plenty. Markus Ravik There’s also a short menu of mains that spruces up classics such as bistecca, veal cotoletta, and a diavola chicken. For drinks, there’s a fun, savoury-focused cocktail menu (caprese martini, celery margarita, that kind of thing) and a 100(ish)-bottle wine list compiled by award-winning sommelier Andrea Martinisi that focuses on Australian, Italian and French drops. The restaurant is tucked away on a small laneway just off Longland Street. Markus Ravik\n\nAdvertisement\n\nIn short, if you’re going to add to Brisbane’s packed market of Italian restaurants, Bar Monte is a good way to do it. “In coastal towns there’s a lot of competition, too, but because they get so busy during certain periods, especially during school holidays – you know you’re going to be full no matter what,” Toscani says. “With the city, you need to bring your right game. It’s about creating that consistency.” Open Wed-Sun 12pm-late. 17 Longland Street, Newstead. barmonte.com.au/newstead\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/books/virginia-woolf-s-lost-book-to-be-published-84-years-after-her-death-20250923-p5mx7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Virginia Woolf’s lost book to be published 84 years after her death",
    "publish_date": "Tue, 23 Sep 2025 10:46:37 +1000",
    "category": "entertainment",
    "authors": [
      "Gareth Corfield"
    ],
    "text": "A lost book by Virginia Woolf will be published next month after its manuscript was discovered in a stately home in England.\n\nThe Life of Violet is a collection of three comic stories about a giantess.\n\nVirginia Woolf and the cover of her ‘new’ book.\n\nIt will be published on October 7, providing a new insight into one of the 20th century’s most influential feminist writers.\n\nWoolf, known for novels and feminist essays, took her own life in 1941. Her works became inspirational to early modern feminist thinkers because of their focus on the stifling social customs of upper-class England.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/after-days-of-fierce-public-debate-jimmy-kimmel-will-be-back-on-air-but-how-did-we-get-here-20250923-p5mx69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After days of fierce public debate, Jimmy Kimmel will be back on air. But how did we get here?",
    "publish_date": "Tue, 23 Sep 2025 10:30:19 +1000",
    "category": "finance",
    "authors": [
      "Kailyn Rhone"
    ],
    "text": "ABC said on Monday that Jimmy Kimmel’s late-night talk show would return to television Tuesday night (US time), nearly a week after the network suspended the show over his comments about the fatal shooting of conservative activist Charlie Kirk.\n\nThe Walt Disney Co., ABC’s parent company, said in a statement that it spent the past few days having “thoughtful” conversations with Kimmel; after those discussions, it decided his show could resume.\n\nJimmy Kimmel will be back on air on Tuesday night (local time) after days of fierce public debate. Credit: Richard Shotwell/Invision/AP\n\nThe decision to pull the program “indefinitely” last week, made under unusual pressure from the Federal Communications Commission, had set off a political firestorm over free speech and the government’s ability to silence commentary it dislikes.\n\nHere’s what has happened.",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/world/north-america/jimmy-kimmel-will-return-to-the-air-disney-says-20250923-p5mx5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Ill-timed, insensitive’: Kimmel back on air after backlash over Charlie Kirk comments",
    "publish_date": "Tue, 23 Sep 2025 10:16:24 +1000",
    "category": "finance",
    "authors": [
      "Mark Kennedy"
    ],
    "text": "American television network ABC will reinstate Jimmy Kimmel’s late-night show after it was suspended over his on-air comments about the assassination of conservative activist Charlie Kirk, officials with the network said.\n\n“Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country,” Disney said in a statement on Tuesday AEST.\n\nJimmy Kimmel will have his program reinstated. Credit: AP\n\n“It is a decision we made because we felt some of the comments were ill-timed and thus insensitive.\n\n“We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.”",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/sport/hollingsworth-impresses-in-tokyo-20250923-p5mx80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hollingsworth impresses in Tokyo",
    "publish_date": "Tue, 23 Sep 2025 10:05:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hollingsworth impresses in Tokyo\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/matildas-star-lauded-as-bonmat-demb-l-win-world-football-s-top-awards-20250923-p5mx77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Matildas star lauded as Bonmatí, Dembélé win world football’s top awards",
    "publish_date": "Tue, 23 Sep 2025 09:56:42 +1000",
    "category": "sports",
    "authors": [
      "Glenn Moore"
    ],
    "text": "Australia’s Steph Catley has made the stage at the Ballon d’Or awards in Paris as her club side Arsenal was named Women’s Team of the Year.\n\nBut the big prizes went to Paris Saint-Germain forward Ousmane Dembélé, and Barcelona midfielder Aitana Bonmatí.\n\nArsenal won women’s club of the year at the 69th Ballon d’Or awards. Credit: AP\n\nCatley was nominated among the top 30 players in the world, finishing 29th in the poll, the fourth highest-rated defender in the women’s game.\n\nIt was a reward for her role in Arsenal’s Champions League triumph and as stand-in captain for the Matildas in Sam Kerr’s absence.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/nsw/scathing-review-slams-sydney-s-train-network-failures-and-a-lack-of-care-20250917-p5mvoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Scathing review slams Sydney’s train network failures and a ‘lack of care’",
    "publish_date": "Tue, 23 Sep 2025 09:50:58 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "An independent review into an overhead wiring failure that crippled Sydney’s train network for days is scathing of the response from authorities, saying it could find “no defensible reason” why it took so long to get passengers off a stranded train.\n\nThe analysis – released on Tuesday morning – pinpoints failings in the passenger rail network and is highly critical of the length of time between the incident on May 20 and the network’s recovery two days later, saying it was “far too long”.\n\nThe wiring incident triggered a power outage that brought the network to a standstill on May 20. Credit: Wolter Peeters\n\nThe latest independent review was commissioned after a single train became entangled in overhead wiring at Homebush, triggering a widespread power outage and crippling most of the passenger train system for 38 hours.\n\n“A confusion about safe rules for detraining in this type of incident occurred even though a 2024 incident at Redfern had posed the same issues,” it said.",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/sport/afl/essendon-president-stands-down-amid-merrett-drama-20250923-p5mx72.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Essendon president stands down amid Merrett drama",
    "publish_date": "Tue, 23 Sep 2025 09:21:53 +1000",
    "category": "sports",
    "authors": [],
    "text": "Essendon president David Barham has announced he will stand down, amid off-field drama over the playing future of captain Zach Merrett.\n\nBarham said in a letter to members on Tuesday morning that he would hand the presidency to vice-president and former Bomber Andrew Welsh.\n\nEssendon president David Barham with Zach Merrett at the Brownlow Medal on Monday night. Credit: AFL Photos via Getty Images\n\n“I have given my all over the past three and a half years and tackled every challenge with everything that I have. I took my responsibility to fight for and defend our club, its players, coaches and administrators extremely seriously,” Barham said.\n\n“I’m proud of what we have achieved in transforming the club and making the hard decisions to set it up for long-term, sustained success. I have no doubt we are now on the right track, and I leave excited about the future.”\n\n\n\nBarham attended the Brownlow Medal on Monday night, where Merrett addressed his future for the first time since it was revealed he had met with Hawthorn coach Sam Mitchell.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/why-many-australians-dont-feel-financially-confident-asx-rises-as-market-waits-for-us-inflation/6m4rs5zov",
    "title": "Why many Australians don't feel financially confident & ASX rises as market waits for US inflation",
    "publish_date": "Mon, 22 Sep 2025 20:48:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/how-australians-reacted-to-the-governments-recognition-of-a-palestinian-state/4q1uq110p",
    "title": "How Australians reacted to the government's recognition of a Palestinian state",
    "publish_date": "Mon, 22 Sep 2025 09:06:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/optus-will-be-held-to-account-penalties-on-the-telco-loom-as-amca-investigates/amyby7pxl",
    "title": "'Optus will be held to account': Penalties on the telco loom as AMCA investigates",
    "publish_date": "Mon, 22 Sep 2025 08:18:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Federal Communications Minister. Anika Wells, is talking tough.\n\n\n\n\n\n\"People have a right to be livid about what has happened here. Right now, our focus is getting to the bottom of what went wrong, before we determine what happens next, but Optus will be held to account. I will say it again for the people whose confidence must be shaken by late Friday afternoon: this is not good enough.\"\n\n\n\n\n\nThe outage – resulting from a network upgrade and primarily impacting South Australia, Western Australia and the Northern Territory – blocked more than 600 emergency calls over 13 hours, during which three people died.\n\n\n\n\n\nTwo customers contacted the telco's call centre early on Thursday [[18 September]] to alert them to the triple-0 failure.\n\n\n\n\n\nBut A-C-M-A Chair, Nerida O'Loughlin, says they weren't notified of the details until it was resolved more than ten hours later.\n\n\n\n\n\n\"It wasn't until the Friday, and very late in the day before the press conference, when we were informed by the CEO that there was 624 calls in play and of the deaths. As part of our investigation we also need to look at just what information they need to provide to all of us when they can get it to us because it was just too late.\"\n\n\n\n\n\nSouth Australia's Premier, Peter Malinauskas, has told the ABC he was equally left in the dark.\n\n\n\n\n\n\"We understand that things go wrong. There are technical failures that occur from time to time. Governments themselves aren't immune from that. It's the way you handle them that often really matters, and at the very least, there's been a fundamental and, in many respects, an inexcusable failure of communications from Optus\"\n\n\n\n\n\nPrime Minister Anthony Albanese similarly describing the triple-0 failure as completely unacceptable.\n\n\n\n\n\n\"We want to see the investigation take place. What we want is to ensure something like this shouldn't happen. Optus has obligations, as do other communications companies, and clearly they haven't fulfilled the obligations that they have.\"\n\n\n\n\n\nA previous Optus outage in 2023 affected about 10 million people's phone and internet services, more than 2,100 of which were unable to make triple-0 calls.\n\n\n\n\n\nThe telco then failed to conduct 369 welfare checks on people who had tried to make an emergency call in that time.\n\n\n\n\n\nIt prompted the then-Chief Executive to resign – cost the company over 12 million dollars in fines.\n\n\n\n\n\nWhile law does not allow for criminal charges, Ms O'Loughlin says Optus will again likely face significant financial penalties.\n\n\n\n\n\n\"The ACMA's investigation will look at a number of matters, but firstly, the requirements and obligations under what's the fundamental piece of legislation: Emergency Call Services Determination. What that requires is that carriers have networks and facilities in place to provide emergency call services and that every person that goes to use emergency call services will be connected to an emergency call services centre.\"\n\n\n\n\n\nBut independent analyst, Paul Budde, says these punitive measures may not be enough.\n\n\n\n\n\n\"Optus is definitely getting a blow – their brand is damaged, their trust is damaged. But people don't have a lot of choice. They're on the system; they need communication. We also, as a country, need Optus. It's not that we say we can only deal with Telstra – that's not what we want to do. It is important that Optus get its act together, and if it happens again, we need to have a different system in place to cope with the problems we are seeing happening in social, economic and life-loss situations.\"\n\n\n\n\n\nGreens Senator, Sarah Hanson-Young, is now calling for independent oversight.\n\n\n\n\n\n\"For too long these big telco companies have relied on self-regulation rather than direct regulation, and it's not costing people's lives. This is one of the most basic essential services. Safety and access to the emergency service when you need them. Our communication devices are now essential ... How many more strikes does this company need?\"\n\n\n\n\n\nUnder Optus' current framework, Mr Budde says this incident may not be the last.\n\n\n\n\n\n\"It could well take Optus several years to fix the underlying problem – get rid of the underinvestment that took place in the network. In other words, we can't wait that long for that to happen. We have to start looking at an alternative for how we can ensure that the triple-0 system is working in Australia, and perhaps we should take it away from the telcos, create an independent organisation who manages this system – still of course using the Telstra, Optus and Vodafone infrastructure.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/fandi-ahmad-urges-australian-clubs-to-return-to-singapore-reigniting-football-links-and-inspiring-next-generation/rdfrg1v4k",
    "title": "Fandi Ahmad urges Australian clubs to return to Singapore, reigniting football links and inspiring next generation",
    "publish_date": "Mon, 22 Sep 2025 07:48:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/healing-country-the-noongar-man-leads-regenerative-land-management-to-restore-ecosystems-and-community-in-western-australias-wheatbelt/30y2tf6la",
    "title": "Healing Country: The Noongar man leading regenerative land management to restore ecosystems and community in Western Australia's Wheatbelt",
    "publish_date": "Mon, 22 Sep 2025 07:47:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/spring-brings-warmer-weather-flower-shows-and-food-safety-concerns/8zt0q2zqs",
    "title": "Spring brings warmer weather, flower shows... and food safety concerns",
    "publish_date": "Mon, 22 Sep 2025 06:49:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs September kicks off, it's time for many in Australia to not just go on camping and attend the various floral festivals, but also clean up food storage.\n\n\n\n\n\nThe Food Safety Information Council is encouraging Australians to do a check on their pantries, fridges and freezers, and clean out those items that have long passed the expiration dates.\n\n\n\n\n\nBut the cleaning could be tricky, as people are often found to confuse two important labels on food, according to Lydia Buchtmann, the chief executive of the Food Safety Information Council.\n\n\n\n\n\n\"It's best to remember the difference between the Best Before and the Use By date, because we don't want to waste food unnecessarily. And essentially, they just mean what they say. Used by means you actually have to use that food by that day, the best before date is, as it says, just about quality. So it will taste better by that day, but you can still eat it after that day.\"\n\n\n\n\n\nMs Buchtmann says people can rotate their food, by putting the new products at the back of the fridge or pantry, and use the older items first.\n\n\n\n\n\nBut effective food storage isn't just about checking the expiration dates, as experts say it's also about how the food is preserved.\n\n\n\n\n\nDr Rozita Vaskoska is CSIRO's Consumer Safety Spokesperson.\n\n\n\n\n\nShe says the packaging of the food also matters.\n\n\n\n\n\n\"If you have a cereal, try to tip it in a container that is dedicated to cereal, rather than just keeping the original packaging in and any other external packaging that is removable. It's good to not bring (external package) inside the pantry, because it can bring the risk of moths as well.\"\n\n\n\n\n\nIn Australia, food-borne illnesses - also known as food poisoning - have caused significant health and economic concerns.\n\n\n\n\n\nAccording to a report by Food Standards Australia New Zealand, in 2022, there were an estimate of 4.67 million cases of food poisoning in Australia each year.\n\n\n\n\n\nIt also found unsafe food had caused over 47,000 hospitalisations and 39 deaths.\n\n\n\n\n\nVincent Ho is an associate professor and Clinical Academic Gastroenterologist at the Western Sydney University.\n\n\n\n\n\nHe says there's what he calls a definite linkage between ineffective food storage and food poisoning.\n\n\n\n\n\n\"Food, they need to be stored in a particular environment to minimise the growth of bacteria, because we know bacteria flourish in a zone of temperature between 5 degrees and 60 degrees Celsius, that's called the danger zone. And that's when we get a lot of bacteria reproduction.\"\n\n\n\n\n\nDespite the persistent issue, in 2024, Food Standards Australia New Zealand found less than half of its over 2000 respondents said they always followed proper procedures when preparing food at home, such as washing hands, and keeping the cutting boards and knives for raw meats separate.\n\n\n\n\n\nAs Australia is expected to be much hotter than average in the next few months, Professor Ho says it means people need to pay extra attention to the temperature their food is exposed to.\n\n\n\n\n\nHe says the heat can also make human bodies more vulnerable to food poisoning.\n\n\n\n\n\n\"If you take away from the heat stroke, which can affect people, what we know is that when you have warm environments, certainly people are more likely to be more susceptible to gastroenteritis. We know that across the world, from all the data, that typically, in very very hot conditions, people are more likely to get gastroenteritis in general.\"\n\n\n\n\n\nSo how should we clean the fridge properly?\n\n\n\n\n\nProfessor Ho says it's important to regularly take out all the food as well as the draws and shelves for a deep clean session.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/simone-was-a-loyal-optus-customer-then-her-husband-needed-an-ambulance/gsno5tkoc",
    "title": "Simone was a loyal Optus customer. Then her husband needed an ambulance",
    "publish_date": "Mon, 22 Sep 2025 05:41:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Adelaide mother Simone Porcaro is lucky she was with her young daughter when the unthinkable happened last week.\n\n\n\n\n\nHer husband was \"in and out of consciousness\" at home, and her calls to emergency services weren't going through.\n\n\n\n\n\n\"Obviously, my husband needed an ambulance, so I called twice. There was nothing … no dial tone, no phone call or anything,\" she told 10 News.\n\n\n\n\n\n\"Then my daughter, who's seven, suggested using her dad's phone.\"\n\n\n\n\n\nAfter rolling him over and using his thumb to unlock the phone, Porcaro was able to get through to triple-zero.\n\n\n\nMore than 26 hours later, Optus gave her a call to see if she needed assistance.\n\n\n\n\n\n\"I said, 'We are already at the hospital. I don't need this, but I needed it then.'\"\n\n\n\n\n\nPorcaro says she feels lucky that she was able to get through to emergency services — but it was only because her husband has a different phone provider than she does.\n\n\n\n\n\nPorcaro is one of many Optus customers who were unable to call triple-zero when the network suffered an outage on Thursday , which led to multiple deaths . Porcaro's husband is with Telstra.\n\n\n\n\n\n\"It just makes me angry because I should be able to call triple-zero.\n\n\n\n\n\n\"We had another phone in the household, but it's not every day that my husband and I are home at the same time.\"\n\n\n\n\n\nAfter being with Optus for more than 15 years, she's now considering changing providers.\n\n\n\n\n\n\"I'm definitely thinking about switching. I've been with Optus for more than 15 years, so I stuck by them after the last outage,\" she said.\n\n\n\n\n\n\"I've already Googled this morning for other telcos I can look into.\"\n\n\n\n'Significant consequences'\n\nWhile Optus may lose goodwill with customers like Porcaro, it's also facing \"significant consequences\".\n\n\n\n\n\nCommunications Minister Anika Wells addressed the media on Monday morning, saying Optus will be \"held accountable for this failure\".\n\n\n\n\n\n\"They have perpetuated a failure upon the Australian people with what has happened here. They can expect to suffer significant consequences as a result,\" she said.\n\n\n\nCommunications Minister Anika Wells said on Monday the Australian Communications and Media Authority has launched an investigation into the Optus network outage. Source: AAP / Mick Tsikas The telco industry's regulator has launched an investigation into the network outage , and could impose financial penalties on Optus, although criminal charges cannot be laid under current legislation.\n\n\n\n\n\nOptus CEO Stephen Rue said: \"Approximately 600 customers were potentially impacted, of which a proportion of their calls did not go through.\n\n\n\n\n\n\"I have been advised that during the process of conducting welfare checks, three of the triple-zero calls involved households where a person tragically passed away,\" he said at a press conference on Friday afternoon.\n\n\n\n\n\nTwo of the deceased were from South Australia and one from Western Australia, Rue confirmed.\n\n\n\n\n\n\"I offer my sincere and heartfelt condolences to the families and friends of the people who passed away. I am so sorry for your loss. What has happened is completely unacceptable. We have let you down.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/former-ndis-director-shows-off-luxury-cars-20250923-p5mxa2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Former NDIS director shows off luxury cars",
    "publish_date": "Tue, 23 Sep 2025 11:52:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "Former NDIS director shows off luxury cars\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/afl/eddie-jimmy-clash-over-zorko-act-20250923-p5mx9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Eddie, Jimmy clash over Zorko act",
    "publish_date": "Tue, 23 Sep 2025 11:44:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Eddie, Jimmy clash over Zorko act\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/not-just-the-murdochs-how-to-stop-destructive-inheritance-battles-20250923-p5mx78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not just the Murdochs: How to stop ‘destructive’ inheritance battles",
    "publish_date": "Tue, 23 Sep 2025 11:41:47 +1000",
    "category": "finance",
    "authors": [
      "Noel Whittaker"
    ],
    "text": "The Murdochs made headlines when they settled their family battle recently, but you don’t need to be a billionaire to have trouble with siblings. Money and inheritance can bring out tensions in the best of families, and those fights can be exhausting and destructive.\n\nAs Donal Griffin, Sydney estate lawyer at Legacy Law and trust family adviser, often reminds me, one of the big flashpoints is the discretionary family trust. They work well for a couple, but once the next generation comes along things get tricky. Imagine being told in your 50s that you now have to run a trust with your brothers and sisters – it’s no surprise sparks fly.\n\nThe Murdochs made headlines when they settled their family battle recently, but you don’t need to be a billionaire to have trouble with siblings. Credit: Marija Ercegovac\n\nThe Murdochs’ Nevada hearing, details of which were leaked to the media, showed how courts apply a black-letter approach when interpreting trust deeds. These are often signed without much thought, then forgotten until a dispute erupts.\n\nIt’s not unlike a shareholders’ agreement, which is ignored while business runs on consensus – until suddenly, it doesn’t. While parents control trusts without involving their children, later they’re often horrified to discover their adult children may not run things the same way. As Griffin says, the transition is from a monarchy to a democracy – and there’s usually a revolution along the way.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/people-don-t-want-to-have-this-conversation-virginia-tapscott-s-uncomfortable-crusade-20250909-p5mto8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘People don’t want to have this conversation’: Virginia Tapscott’s uncomfortable crusade",
    "publish_date": "Tue, 23 Sep 2025 11:35:08 +1000",
    "category": "finance",
    "authors": [
      "Parnell Palme Mcguinness"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Virginia Tapscott looks every inch the tradwife. She’s blonde, petite, and pretty. Her hair is loose and long; the sleeveless lavender top she’s worn to lunch matches her phone case. Photos of her with her husband and four children on the farm are redolent of the tradwife aesthetic. There’s no doubt I could, if I wanted to, paint her as one of the “traditional wives” that have been amassing huge social media followings for embracing the role of wife and mother, turning their backs on career-feminist empowerment. But Tapscott doesn’t fit neatly into that box. In the course of our discussion, I wonder if there’s any box that will ever contain this woman in all her contradictions. On the day we meet at Pyrmont’s Zebra Lounge, she’s flown from rural Albury to meet me. She loves seafood, and eating it by the water is a rare treat. The outdoor dining area looks out over a playground, deserted in the rain. The absence of children serves to emphasise the irony that Tapscott, who has written extensively about her choice to stay home with her children, is not home with her children. I want badly to ask her about that. Tapscott has a “tradwife” vibe, but she’s not easy to pigeonhole. We hurry to get the ordering out of the way – there’s so much Tapscott wants to talk about that if we don’t do it now, we’ll never cover off everything before she has to fly home. She’s quick to choose the seared yellowfin tuna with a black poppyseed crust, but hesitates over the wine choice. She’s looking at a French chardonnay, which is $18 a glass. Definitely not Albury prices. “That’s so expensive!” she exclaims, settling instead on an Alsace pinot gris. Tapscott has written a book, which she’s keen to promote. All Mothers Work confronts the notion that women who choose to care for their children full-time are embracing a regressive social hierarchy. It challenges society to properly recognise and honour care work, paid and unpaid. She sent me the manuscript after we met at a conference last year. In contrast to her strong prose, she has a country reserve about her. She often holds back in public debates out of excessive politeness, waiting till everyone else has had a chance to speak. Yet, there’s a certainty about her that comes through even when she’s silent.\n\nAdvertisement\n\nThe book gropes towards a new kind of feminism. “The only liberation that was ever offered or envisaged for women was one where they could be less like themselves,” she writes. “Men and women came to believe that the only way to help women was to allow them to assimilate into a man’s world.” “I’m trying to think what I was thinking about when I wrote that,” she muses. But then it comes to her. “I think we have a really tough conversation to have about internalised misogyny. So ultimately, this idea that women could only be empowered by being in the paid workforce or assuming masculine roles is misogynistic.” Seared yellowfin tuna with a black poppyseed crust. Credit: Edwina Pickles This is not the feminism of our times which, according to Tapscott, only supports unpaid caregivers by getting them out of unpaid work. Tapscott calls it “career feminism in a care cloak”. I need to know how the 34-year-old has developed such unfashionable ideas. Tapscott thinks it’s down to her upbringing. Virginia Tapp grew up in rural Narrabri. Her dad died before she was born; her widowed mother worked on a farm, driving trucks and tractors, and doing the books. The kids didn’t go to childcare, but just tagged along with their mother. As a result, she says, “I feel a bit outside of the culture sometimes. I feel like I’m looking in on the way society is, and the way culture is a lot of the time. It enables me to be hypercritical of it.” Her exposure to mainstream culture was mainly through the radio that was constantly on in the background. That led to her interest in becoming a journalist. Her first job was at the ABC, followed by a stint at The Courier in Narrabri.\n\nAdvertisement\n\nWhen she had her first child at 25, her son Oscar, she planned to put him into childcare to continue her career. “I remember having this conversation with my husband. Like, he’s one now, this is what people do; women go back to paid work now.” But it didn’t work out. Oscar was miserable; she was too. When the second baby came along, Tapscott and her husband decided she would give up formal work and freelance where she could. “We were lucky,” she explains. “We lived in a shack that my husband built on my father-in-law’s property. We lived in a rural area. I still drove my Toyota Corolla I’d had since uni. Our costs were just quite low, and we were young.” She acknowledges this isn’t an option for many families struggling with the cost of housing. Because the universe loves contrasts, this is the moment when our luxurious plates of food arrive. Tapscott exclaims at the beautifully plated tuna, seared lightly on the outside and extremely rare. My food envy dissipates as soon as I taste my seafood pasta, which is stacked with prawns and mussels and finished in a velvety red bisque. Seafood pasta stacked with prawns. Credit: Edwina Pickles Before she even takes a bite, Tapscott has leaped into telling me that she began writing compulsively about what it was like being a mother after her son was born. Her articles seemed to resonate with readers, and it set her on the path she’s on now, saying more and more of the unsaid. She seems to have completely forgotten her food. Thank goodness it doesn’t need to be hot because she’s back in full flight. “People don’t want to have this conversation because it’s really uncomfortable. If we admit that the systems we have in place aren’t optimal, we’re admitting that the whole underpinning of women’s liberation is flawed.” Now seems a good time to ask my question about Tapscott’s central contradiction: much of her writing has been about motherhood, the tug women feel to spend more time with their babies, and the choice to take on the work of child-rearing rather than paid work. Yet here she is in Sydney, a one-and-a-half-hour flight and a world away from her children, gesticulating passionately about the book she’s just written. What part of this is not traditional workforce participation?\n\nAdvertisement\n\nFor the first time in a while, she becomes still again. “I can identify cultural forces that devalue caregivers, but that doesn’t mean I’m immune to them,” she says with a wry smile. “I am also a product of a culture where my self-worth is derived from my paid contributions, which has been a constant struggle for me in motherhood. “That’s why I have worked to try and raise cultural awareness of the value of caregiving, so that my daughters and sons can grow up in a society where they get validation, and they feel valuable in a caregiving role.” She fires up again. “Why can’t we attract policy mechanisms that support caregivers? Because,” she answers her own question, “deep down, most of us haven’t really learnt the true value of caring”. Our conversation is taking place in the aftermath of shocking revelations of widespread sexual and physical abuse of children in childcare centres. Nicola Forrest’s Minderoo Foundation – which is behind the Thrive By Five campaign for universal centre-based childcare – has found that one in 10 parents has withdrawn children from care and 16 per cent have reduced hours of care. Minderoo says this is indicative of “a system in crisis”. Tapscott sees it as vindication and has ramped up her advocacy for childcare to be valued by giving parents greater choice in how it’s delivered. Parents are questioning their childcare options after the industry has been rocked by a series of scandals. Credit: Justin McManus She’s spoken and written about the need for more support for women to stay longer with their babies and to use the childcare subsidy now only available to centre-based care for more flexible modes of care, like grandparents, or nannies. Many parents are getting behind a campaign she is associated with. Which means I now have to move the conversation onto delicate ground. As she has explored in a podcast, Tapscott and her older sister were sexually touched by their step-grandfather when they were little. Her abuse happened in a home setting as she was being cared for by relatives. How does she square that with calling for more in-home care? Is home really better than a well-regulated childcare setting?\n\nAdvertisement\n\nHer tone drops and she hesitates. But she has obviously thought this through. Her answer is fluent and confident. “People who say you can’t support care in the homes because they’re unregulated, and child sexual abuse occurs there are missing the point entirely in terms of primary prevention,” she says. As a child sexual abuse survivor, she believes that the answer is to encourage people who’ve experienced abuse to speak out, so offenders can’t hide behind secrecy. “Also,” she concludes, “it’s a ridiculous notion that any unregulated space is now not appropriate”. That sounds like a vaguely libertarian idea. I want to know where she sees herself on the political spectrum because I for the life of me can’t figure it out. On the one hand, her family advocacy and the whiff of trad-wifery might lead people to label her as right-leaning. But that’s not borne out by her work. I’ve scrawled a note against one passage in towards the end of her manuscript: “Communalist or communist?″⁣\n\n“So confused,” she sighs. “I don’t really fit in anywhere.” The bill. But then she confirms what I’ve been wondering: “I think my approach to early childhood is really quite influenced by socialism.” Margin note triumphant. She goes on to explain: “I think human capital is a public good, and we need to be investing in that. And individualism has really fallen down in the current macroeconomic environment that we have in Australia, where people can’t and won’t have more children because they can’t afford it.” Somehow, despite talking non-stop, we’ve finished our meals. I buy some time by ordering a coffee – she demures – and steer the conversation onto the unusual story of how her book has been published. “The only feasible way I could write it was if I had an advance because I just didn’t really see myself being able to afford that much more free labour”. So she crowdfunded the book. The All Mothers Work Kickstarter raised $33,000, covering childcare and printing costs. In the meantime, this advocate for the choice to stay home has started studying medicine. “I’m really excited about it,” she enthuses. “I mean, health issues and my advocacy for caregivers, it’s all connected. So many health issues, public health problems that arise from people not having time to care for themselves and for each other.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/nsw/rail-review-live-nsw-government-releases-scathing-report-into-sydney-trains-20250923-p5mx7g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rail review LIVE: NSW Government releases scathing report into Sydney trains",
    "publish_date": "Tue, 23 Sep 2025 11:32:14 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan",
      "Jessica Mcsweeney"
    ],
    "text": "Sydney Trains chief executive Matt Longland puts it bluntly: “We did not take care of passengers”.\n\nThe report spells out how passengers were failed on May 20 and 21.\n\nThe “incident train” came to a standstill about 50 metres short of Homebush station at 2.56pm but passengers were not removed until three hours later.\n\nThe incident train which triggered two days of chaos. Credit: Anthony Segaert\n\nFour other trains were left stranded between stations: two within 300 metres of Leppington station, one 720m short of Flemington, and a fourth with one carriage on platform seven of Strathfield station.\n\nPassengers were taken off the Strathfield train within minutes, apart from one passenger with a mobility scooter who left the train almost two hours later. The other three trains arrived at the next station and passengers disembarked within an hour.\n\nFor the “incident train”, passengers were on board for three hours and were left for long stretches without communication.\n\nOne passenger described how about 300 people were stuck with no water, no power and no air-conditioning. For the final 45 minutes, there was no communication and many people had lost battery power in their mobiles and needed the toilet.\n\n“In the Panel’s view, many aspects of [the passenger]’s experience are simply unacceptable,” the report said.\n\n“Detraining took far too long, with the negative effects of this experience compounded by the absence of meaningful customer care – including more assistance in completing their journeys once passengers disembarked. We are also of the view that, with their consent, customer details should have been taken to allow subsequent follow-up.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Still a bit to get through’: Storm star no certainty to face Sharks",
    "publish_date": "Tue, 23 Sep 2025 11:29:08 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh",
      "Billie Eder",
      "Roy Ward"
    ],
    "text": "Melbourne Storm playmaker Jahrome Hughes still has some training sessions to get through before he can be cleared to play in the preliminary final on Friday night.\n\nThe reigning Dally M Medallist is recovering from a fractured forearm and racing against time to prove his arm has healed enough to take on Cronulla AAMI Park for a spot in the grand final next week.\n\nNRL teams will name their sides on Tuesday afternoon and Hughes will likely be in Melbourne’s extended squad with the hope he is fit to play by game day.\n\nStorm captain Harry Grant said Hughes was looking good at training, but the club’s tougher sessions were still to come before Craig Bellamy and his staff make a final call on selection.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/when-it-feels-like-the-world-is-going-to-hell-in-a-handbasket-where-do-you-find-inner-peace-20250917-p5mvv2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When it feels like the world is going to hell in a handbasket, where do you find inner peace?",
    "publish_date": "Tue, 23 Sep 2025 11:13:57 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "To Dr Shannon Foster it’s known as the mangrove cathedral. Hidden in plain sight at Sydney Olympic Park, the space under the tree canopy is more than a place of beauty; it’s a natural sanctuary offering a chance to re-centre, reflect – and connect with Country.\n\n“Mangroves have these tall overarching branches that weave into each other and create a big canopy that creates what I can only describe as the perfect human habitat,” Foster says. “It doesn’t matter what is going on outside – it can be windy, hot, dry, humid or whatever, and this makes its own little microclimate. It is cool, it is calm, it is peaceful.”\n\nDr Shannon Foster says the “mangrove cathedral” at Sydney Olympic Park is more than an oasis of calm, it’s a place to re-centre and reflect. Credit: Louie Douvis\n\nIn the troubled times we live in, the search for places where peace resides has gained greater importance. While ‘No religion’ was the second most common response after ‘Christianity’ in the 2021 census, for many the desire remains to connect with something greater, whether that’s identified as god, the universe or some unnamed energy source. And that is often best facilitated in environments, natural and human-made, that promote opportunities for reflection.\n\nMore than somewhere to switch off from the world and restore balance, these places provide an opportunity to connect with something deeper, in a spiritual sense.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/light-years-team-brings-its-neighbourhood-italian-to-brisbane-20250915-p5mv6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Light Years team brings its ‘neighbourhood Italian’ to Brisbane",
    "publish_date": "Tue, 23 Sep 2025 10:49:53 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Light Years team brings its ‘neighbourhood Italian’ to Brisbane Plenty of small-town operators have tried and failed to take on the big smoke. Newstead’s Bar Monte shows how to do it right. Matt Shea September 23, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nHow do you take a restaurant group from a tourist town to a city? It’s not easy. There’s a different style of diner, of course, and more competition. But also different produce, different suppliers, different landlords, different staff. Bar Monte opened in Newstead earlier this month. Markus Ravik Australian food and beverage is littered with stories of small-town stars who took on the big smoke and swiftly had their backsides handed to them.\n\nAdvertisement\n\nBut if you had to bet on anyone making it work, it’s Arcade Agency, the hospitality “collective” best known for Light Years, which originated in Byron Bay. And perhaps it already has, opening a Light Years in Perth in April; thus far, that restaurant has been a hit. Related Article 1930s Brisbane apartments transformed into stunning new restaurant Now comes Bar Monte in Brisbane. It’s the second Bar Monte after the Gold Coast original, which opened in December. “One thing that’s really convinced us to open in Brisbane was the impact Light Years has had in Perth,” co-owner Lorenzo Toscani says. Bar Monte has transformed the old Allonda digs on Longland Street. Markus Ravik\n\nAdvertisement\n\n“The vision with Light Years before I was with them was always to be in coastal towns – start in Byron Bay and then obviously move up to the Gold Coast, and then Noosa. And then right in the middle of COVID they came up with Newcastle, which was a big step-up in terms of capacity.” This gradual approach has served Arcade Agency well, and it’s taken place against the background of a food and beverage scene where – since the pandemic, in particular – the ties between the cities and the regions, between farmers and producers and the city eateries they serve, have become stronger and stronger. Bar Monte’s menu is much the same as Miami, with clever twists on familiar classics. Markus Ravik “When we opened on the Gold Coast we already had Brisbane in mind, as well,” Toscani says. “Brisbane is growing so fast at the moment, there will be the Olympics.\n\nAdvertisement\n\n“As an Italian who landed in Australia in 2012 and his first city was Brisbane, when I went back a couple of years ago, I really fell in love with how much it had changed. We saw the opportunity and wanted to be part of it.” Vodka paccheri with nduja and stracciatella. Markus Ravik Bar Monte opened mid-September in the Longland Street tenancy previously occupied by Allonda. The bones of the place are the same, with the staircase to the right of the long bar that faces the entrance and laneway that runs between Longland and Wyatt streets. The fit-out by Studio Plenty is moodier and more intimate and playful than Allonda, with dark tiling and marble counters, timber panelling and clever feature lighting. The treatment is modern but nostalgic, and suits the restaurant’s slightly hidden location.\n\nAdvertisement\n\nYellow fin tuna with pineapple, green chilli, lemon and koji mayonnaise. Markus Ravik “[Bar Monte] is ‘neighbourhood Italian’, so we wanted to make it look a little bit retro but with a trattoria feeling – that Italian feeling,” Toscani says. The menu is similar to the Miami original, with engaging twists on familiar Italian items, particularly when it comes to snacks and entrees. Beef carpaccio with truffle mayo, fried capers, shallots, reggiano. Markus Ravik A burrata entree is spiked with nduja and cashew pesto, Ortiz anchovy toast is given a glow-up with smoked tomato butter, and there’s a mortadella bun with pickled green chilli and limoncello aioli that’s become a minor star at the Miami restaurant.\n\nAdvertisement\n\nThe pastas are all unctuous numbers that range from a cacio e pepe and prawn and chilli linguine, to mezze maniche served with pork sausage and Tuscan kale, and a vodka paccheri that tosses in nduja and is finished with a liberal dose of stracciatella. The restaurant retains the basic layout of Allonda before it but has been given a completely new look by designers Studio Plenty. Markus Ravik There’s also a short menu of mains that spruces up classics such as bistecca, veal cotoletta, and a diavola chicken. For drinks, there’s a fun, savoury-focused cocktail menu (caprese martini, celery margarita, that kind of thing) and a 100(ish)-bottle wine list compiled by award-winning sommelier Andrea Martinisi that focuses on Australian, Italian and French drops. The restaurant is tucked away on a small laneway just off Longland Street. Markus Ravik\n\nAdvertisement\n\nIn short, if you’re going to add to Brisbane’s packed market of Italian restaurants, Bar Monte is a good way to do it. “In coastal towns there’s a lot of competition, too, but because they get so busy during certain periods, especially during school holidays – you know you’re going to be full no matter what,” Toscani says. “With the city, you need to bring your right game. It’s about creating that consistency.” Open Wed-Sun 12pm-late. 17 Longland Street, Newstead. barmonte.com.au/newstead\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/books/virginia-woolf-s-lost-book-to-be-published-84-years-after-her-death-20250923-p5mx7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Virginia Woolf’s lost book to be published 84 years after her death",
    "publish_date": "Tue, 23 Sep 2025 10:46:37 +1000",
    "category": "entertainment",
    "authors": [
      "Gareth Corfield"
    ],
    "text": "A lost book by Virginia Woolf will be published next month after its manuscript was discovered in a stately home in England.\n\nThe Life of Violet is a collection of three comic stories about a giantess.\n\nVirginia Woolf and the cover of her ‘new’ book.\n\nIt will be published on October 7, providing a new insight into one of the 20th century’s most influential feminist writers.\n\nWoolf, known for novels and feminist essays, took her own life in 1941. Her works became inspirational to early modern feminist thinkers because of their focus on the stifling social customs of upper-class England.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/after-days-of-fierce-public-debate-jimmy-kimmel-will-be-back-on-air-but-how-did-we-get-here-20250923-p5mx69.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "After days of fierce public debate, Jimmy Kimmel will be back on air. But how did we get here?",
    "publish_date": "Tue, 23 Sep 2025 10:30:19 +1000",
    "category": "finance",
    "authors": [
      "Kailyn Rhone"
    ],
    "text": "ABC said on Monday that Jimmy Kimmel’s late-night talk show would return to television Tuesday night (US time), nearly a week after the network suspended the show over his comments about the fatal shooting of conservative activist Charlie Kirk.\n\nThe Walt Disney Co., ABC’s parent company, said in a statement that it spent the past few days having “thoughtful” conversations with Kimmel; after those discussions, it decided his show could resume.\n\nJimmy Kimmel will be back on air on Tuesday night (local time) after days of fierce public debate. Credit: Richard Shotwell/Invision/AP\n\nThe decision to pull the program “indefinitely” last week, made under unusual pressure from the Federal Communications Commission, had set off a political firestorm over free speech and the government’s ability to silence commentary it dislikes.\n\nHere’s what has happened.",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/world/north-america/jimmy-kimmel-will-return-to-the-air-disney-says-20250923-p5mx5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Ill-timed, insensitive’: Kimmel back on air after backlash over Charlie Kirk comments",
    "publish_date": "Tue, 23 Sep 2025 10:16:24 +1000",
    "category": "finance",
    "authors": [
      "Mark Kennedy"
    ],
    "text": "American television network ABC will reinstate Jimmy Kimmel’s late-night show after it was suspended over his on-air comments about the assassination of conservative activist Charlie Kirk, officials with the network said.\n\n“Last Wednesday, we made the decision to suspend production on the show to avoid further inflaming a tense situation at an emotional moment for our country,” Disney said in a statement on Tuesday AEST.\n\nJimmy Kimmel will have his program reinstated. Credit: AP\n\n“It is a decision we made because we felt some of the comments were ill-timed and thus insensitive.\n\n“We have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday.”",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/sport/hollingsworth-impresses-in-tokyo-20250923-p5mx80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hollingsworth impresses in Tokyo",
    "publish_date": "Tue, 23 Sep 2025 10:05:59 +1000",
    "category": "finance",
    "authors": [],
    "text": "Hollingsworth impresses in Tokyo\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/matildas-star-lauded-as-bonmat-demb-l-win-world-football-s-top-awards-20250923-p5mx77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Matildas star lauded as Bonmatí, Dembélé win world football’s top awards",
    "publish_date": "Tue, 23 Sep 2025 09:56:42 +1000",
    "category": "sports",
    "authors": [
      "Glenn Moore"
    ],
    "text": "Australia’s Steph Catley has made the stage at the Ballon d’Or awards in Paris as her club side Arsenal was named Women’s Team of the Year.\n\nBut the big prizes went to Paris Saint-Germain forward Ousmane Dembélé, and Barcelona midfielder Aitana Bonmatí.\n\nArsenal won women’s club of the year at the 69th Ballon d’Or awards. Credit: AP\n\nCatley was nominated among the top 30 players in the world, finishing 29th in the poll, the fourth highest-rated defender in the women’s game.\n\nIt was a reward for her role in Arsenal’s Champions League triumph and as stand-in captain for the Matildas in Sam Kerr’s absence.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/nsw/scathing-review-slams-sydney-s-train-network-failures-and-a-lack-of-care-20250917-p5mvoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Scathing review slams Sydney’s train network failures and a ‘lack of care’",
    "publish_date": "Tue, 23 Sep 2025 09:50:58 +1000",
    "category": "finance",
    "authors": [
      "Matt O'Sullivan"
    ],
    "text": "An independent review into an overhead wiring failure that crippled Sydney’s train network for days is scathing of the response from authorities, saying it could find “no defensible reason” why it took so long to get passengers off a stranded train.\n\nThe analysis – released on Tuesday morning – pinpoints failings in the passenger rail network and is highly critical of the length of time between the incident on May 20 and the network’s recovery two days later, saying it was “far too long”.\n\nThe wiring incident triggered a power outage that brought the network to a standstill on May 20. Credit: Wolter Peeters\n\nThe latest independent review was commissioned after a single train became entangled in overhead wiring at Homebush, triggering a widespread power outage and crippling most of the passenger train system for 38 hours.\n\n“A confusion about safe rules for detraining in this type of incident occurred even though a 2024 incident at Redfern had posed the same issues,” it said.",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://au.news.yahoo.com/common-2-woolworths-item-aussies-urged-to-take-on-outdoor-adventures-really-important-013228030.html",
    "title": "Common $2 Woolworths item Aussies urged to take on outdoor adventures: 'Really important'",
    "publish_date": "2025-09-23T01:32:28Z",
    "category": "finance",
    "authors": [],
    "text": "Australians are being urged to take a $2 Woolworths item with them on their next dog walk, as the strong but mighty accessory could be the difference between life and death if they encounter a snake.\n\nWith spring signalling the start of snake season, survival expert Mike Atkinson told Yahoo News he continues to attach one of Woolworths' foldable bags to his dog's leash in case his beloved Labrador Ollie is bitten by a snake. He explained that a few quick adjustments to the bag can make it into an easy sling, enabling him to carry his dog if they are out on a walk or hike and are far away from help.\n\n\"Dogs have much faster metabolisms than humans, so keeping them still is really important,\" he told Yahoo, explaining you don't want to encourage the venom to spread through the circulatory system. \"So the Woolworth's bag, it's shaped like a carrot. They scrunch down really small and they're strong... You just slit the sides, and it makes a sling.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nRecently, Ollie almost died from anaphylaxis after being bitten by a jack jumper ant while out on a walk. In a desperate bid to get him to the closest vet, Mike encouraged his dog to run alongside him to get to the car quicker. But he was later told that running likely contributed to the spreading of the ant venom, and Ollie almost died. Having an aid that enables dogs to be kept as still as possible while the owner can cover ground can be hugely beneficial.\n\n\"My dog weighs 36 kilograms and I've tried carrying him for long distances and my arms get too tired, whereas this just allows you to take most of the weight off your arms if you need it,\" he said.\n\nThe Woolworths bag can be cut along the sides to be made into a makeshift sling. Source: TikTok/outbackmike\n\nWhat to do if your dog is bitten by a snake?\n\nIf a dog is bitten by a snake, the first thing to do is to keep the dog as still as possible. If bitten on the leg, compression bandages can help to limit the spread, and the sling can be used to carry the dog, Atkinson said. Ultimately, getting your dog to the closest vet with anti-venom is essential.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis advice was echoed by Dr Liam Donaldson from Greencross Vet Hospital, who previously told Yahoo News common signs that a dog was bitten by a snake include \"vomiting, collapsing, dilated pupils and the inability to walk\".\n\n\"In dogs, we commonly see vomiting and collapse before a very quick recovery. This recovery is only short-lived, before the toxin has its most fatal effect of causing breathing paralysis,\" Donaldson said.\n\nPreventative measures, such as snake-proofing yards with fencing and \"keeping them on a lead in a snake-y spot\" or \"not walking them in a snake-y spot\", can help safeguard dogs.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 36
  }
]