[
    {
        "url": "https://www.9news.com.au/national/torquay-death-man-dies-after-being-found-with-head-injury-at-queensland-home/20691032-dde5-41b9-b986-dbbb07ffe578",
        "title": "Man dies after being found with a head injury outside Queensland home",
        "publish_date": "Thu, 08 Jan 2026 00:10:50 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "A man has died in hospital after he was found with a head injury outside a\n\nEmergency services found the 66-year-old conscious but unresponsive at an address on Boat Harbour Drive in Torquay, a suburb of Hervey Bay in the state's Fraser Coast Region, just before 5pm on Tuesday.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-heatwave-wa-reaches-record-breaking-temperatures-hot-weather-update/8587f140-07e4-4634-96ca-9622b6e60ef3",
        "title": "WA reaches nearly 50 degrees as record-breaking heatwave continues",
        "publish_date": "Thu, 08 Jan 2026 02:02:24 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Western Australia's current heatwave is breaking records, with parts of the state almost reaching temperatures of 50 degrees.\n\nThe remote town of Paraburdoo recorded a minimum temperature of 35.8 degrees yesterday morning, the highest ever recorded in the state, according to Weatherzone.\n\nIt was also the fifth-highest minimum temperature ever seen in Australia .\n\nThe band of heat stretching from WA and across Australia is clear for all to see. (Weatherzone)\n\nThe high minimum temperature was followed by a day of extreme heat in Western Australia, with the mercury reaching 49 degrees at Onslow Airport in the state's north coast.\n\nWhilst it was not the hottest temperature ever in the state or in Australia, it meant Onslow Airport was officially the hottest place on earth yesterday.\n\nIn fact, Onslow was over 100 degrees hotter than the coldest place on earth yesterday.\n\nThe heatwave is impacting much of the country, with Victoria under catastrophic threat from bushfires. (Facebook/Sassafras-Ferny Creek Fire Brigade CFA)\n\nThe temperature in the Republic of Sakha in Russia was -53.5 degrees, meaning Onslow was 102.5 degrees warmer.\n\nIt comes as much of the country is sweating through a heatwave, which is causing extreme bushfire danger.\n\nREAD MORE: ﻿ The expert advice on exercising during a heatwave\n\nTemperatures soared above 43 degrees in parts of all states and territories except for the ACT , with Melbourne experiencing its hottest day since 2020.\n\n\"Unfortunately, this heat will contribute to extreme and catastrophic fire danger ratings… between Thursday and Saturday,\" Weatherzone's Ben Domensino said.\n\nAll of Victoria will be under a fire ban tomorrow, with authorities saying the risk of bushfires will be catastrophic.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/expert-advice-on-exercise-during-heatwave/e606f93f-99a3-4d00-b5a2-0cb591425562",
        "title": "The expert advice on exercising during a heatwave",
        "publish_date": "Thu, 08 Jan 2026 01:30:51 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "The most severe heatwave in Australia since the 2019-2020 Black Summer has failed to deter many people from their exercise routines.\n\nDespite the extreme weather conditions﻿ across south-eastern Australia sending the mercury over 40 degrees, many dedicated exercisers have been spotted working out.\n\nBut is it safe, and what should you beware of?\n\nHealth experts advise people to try and exercise in the cooler parts of the day during extreme heat. (Photo: Kate Geraghty) (Kate Geraghty)\n\nPrepare for the heat﻿\n\nEven fit people are at increased risk of heat exhaustion or heat stroke when the mercury climbs. ﻿\n\nSports Medicine Australia (SMA) chief executive Jamie Crain advises exercisers to take increased precautions to guard against heat exhaustion or the more serious heat stroke.\n\n\"During times of extreme heat, it's vital for people exercising to take precautions over and above﻿ what they would on a temperate day,\" he told 9news.com.au.\n\nThey include limiting activity times to the cooler periods of the day, such as early morning and evening.\n\nIt's best to avoid the warmest hours, from 10am to 3pm.\n\nMaintaining hydration is essential, and during extreme heat you should keep sipping water even if you don't feel thirsty.﻿\n\nOn very hot days, the SMA advises drinking at least 500 millilitres of water in the hour before taking exercise. And caffeine, including coffee, should be avoided in the hours leading up to working out.﻿\n\n﻿If you're outside, remember to wear sunglasses, sunscreen and a wide-brimmed hat.\n\nChoice of clothing is also important. Where possible, select lightweight and breathable clothes with extra ventilation﻿.\n\nFor those taking exercise indoors, try and find a location with air conditioning.\n\nOn very hot days it's best to try and exercise indoors. (Photo Janie Barrett) (Sydney Morning Herald)\n\n﻿Signs of heat-related illness\n\nCrain says the health impacts of heat-related illness can be a direct result of an increase in core temperature or the result of the strain on the heart associated with combating the jump in body temperature.﻿\n\n﻿\"If anyone experiences nausea or vomiting, that is a sign they need to cease exercising and take immediate action to cool down,\" he said.﻿\n\nOther symptoms of heat exhaustion include dizziness, cramps, headache and general weakness.\n\nAnyone experiencing these should move immediately to a shaded area, remove as much clothing and protective equipment and rehydrate.\n\nCrain says more serious warning signs such as slurred speech, impaired decision making and poorer brain function indicates heat stroke.\n\n\"That requires immediate medical attention ... straight away you'd be calling for medical help ... trying to cool them down with something like an ice bath,\" he said.﻿\n\nWhile even elite athletes are at risk from heat-linked conditions, some people are at more risk than others.\n\nThey include those aged over 65 years, especially if unfit. The SCA cautions that age effects on thermoregulation, the body's process of controlling internal temperature, may become progressively worse with age.\n\nThe risk of falling victim to heat stress is also greater among heart or kidney disorder patients.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bobbi-lockyer-artist-commissioned-painting-missing-in-transit/a754d777-0568-4d17-94cb-8ac9dcf527a6",
        "title": "Bobbi is pleading with Australia Post for help after $4k loss",
        "publish_date": "Wed, 07 Jan 2026 19:09:56 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "A﻿n Indigenous-Australian artist is pleading with Australia Post for help after her irreplaceable painting worth $4000 became lost in transit over Christmas.\n\nBobbi Lockyer spent more than 100 hours painting a one-of-a-kind commissioned artwork for a customer and, like many of her pieces, sent it via express post.\n\nLockyer, who is based in Darwin , told nine.com.au she was instructed to pack her tube in a﻿ cardboard sleeve before paying the postage and sending it away.\n\nBobbi Lockyer spent over 100 hours painting the one-of-a-kind artwork. (Supplied)\n\nOn Christmas Eve, Lockyer's customer sent a frantic message.\n\nThe only thing that had arrived on her doorstep was the empty cardboard sleeve.\n\n\"S﻿he sends me a picture of the empty cardboard sleeve and my heart just dropped,\" Lockyer explained.\n\n\"I immediately drove down to the post office on Christmas Eve, it was so busy and I waited in line.\"\n\nLockyer said she was told Australia Post would open up a case and trace the package route to find where the tube containing the painting became lost.\n\n﻿For the past several weeks, it's been an agonising waiting game.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nThe only thing that had arrived on the customer's doorstep was the empty cardboard sleeve. (Supplied)\n\n\"﻿It's heartbreaking for me and for the customer who was expecting this piece and she's paid this money,\" Lockyer said.\n\n\"I've offered her to redo it. Obviously, it wouldn't be identical, but I would redo it absolutely or refund her. But I just feel like the accountability from Australia Post has been zero.\"\n\nShe is waiting, with fading hope, for the painting to be recovered before starting all over again.\n\nLockyer said ﻿she didn't pay for extra cover on the item.\n\nExtra cover is recommended for items with a higher value.﻿\n\nIn a statement shared with nine.com.au, an Australia Post spokesperson said﻿ it was in contact with Lockyer.\n\n\"Australia Post's processing and delivery teams work hard to handle every item with care and deliver them safely, however in a network of this size, things do occasionally go wrong,\" the spokesperson said.\n\n\"We have apologised to the customer and continue to search for the item throughout our network.\"\n\nMost Australia Post services come with up to $100 compensation for loss or damages.\n\nClaims for compensation are assessed on a case-by-case basis.\n\nThe commissioned piece is worth $4000. (Supplied)\n\nThe renowned artist, whose work has been featured at the Australian Open in the past, said the experience has dented her trust in the national postage system.﻿\n\nLockyer's studio is in the NT and most of her paintings are commissioned by customers who live interstate.﻿\n\n\"There was a lot of tears and I just thought I'm never going to send paintings again through Australia Post,\" she said.\n\n\"It's made me worried for future work.\"\n\nAccording to Australia Post, ﻿per the Australian Postal Corporation Act 1989, and the Australian Consumer Law, the service \"does not accept liability for any consequential or indirect loss or damage arising due to any failure related to our service\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/entertainment/one-battle-after-another-dominates-sags-actor-awards-with-7-nominations/33ef42b5-619e-445d-8593-035ed6902869",
        "title": "'One Battle After Another' dominates SAG's Actor Awards",
        "publish_date": "Wed, 07 Jan 2026 22:23:30 +0000",
        "category": "entertainment",
        "authors": [
            "Jan"
        ],
        "text": "Along with a nod for the guild's top award, best ensemble, the cast of\n\nOne Battle After Another\n\nwas showered with nominations for Leonardo DiCaprio, Chase Infiniti, Teyana Taylor, Sean Penn, Benicio Del Toro and its stunt performers.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/active-holidays-ocean-swimming-popular-on-turkish-lycian-coast/106173770",
        "title": "Boom time for active holiday tours drawing travellers with 'young energy'",
        "publish_date": "Thu, 08 Jan 2026 01:59:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Julia Hughes's eyes sparkle as she contemplates the turquoise waters of the Mediterranean that surround her.\n\n\"As you get old, I truly believe you should carry on doing what you love doing,\" the diminutive 70-year-old says.\n\n\"I love swimming and I've been swimming since I was seven. I just feel happy in the water. It's such a lovely thing to do.\n\n\"Swimming has helped me to meet people and to keep me fit and just be happy.\"\n\nThe British woman has travelled from her home in Britain to the warm, clear waters of the Turkish Lycian coast to join a week-long swim tour with 14 other experienced ocean swimmers.\n\nThe group swims twice a day along a remote stretch of coastline. (Supplied: Basquali)\n\nMany of them are decades younger than the septuagenarian, but she's still capable of leaving a few of them in her wake.\n\n\"You actually just reminded me that she's 70 because, in my eyes, she's 45 or 50,\" says swim guide Aoife Doran.\n\n\"She has a young energy and that's what we see so much with the people that do come on these holidays … they are reminded to play and reclaim that young energy that we all have.\"\n\nJulia Hughes is described as having a \"young energy\". (Supplied: Basquali)\n\nThere's a growing body of evidence indicating that regular strenuous physical activity can help stave off and even reverse the effects of aging.\n\nIt's creating boom conditions for tourism operators specialising in helping older travellers combine holidays to far-flung destinations with healthy activities like hiking, cycling and swimming.\n\n'People want adventure'\n\nAoife Doran says interest in the tours she leads first surged when COVID lockdowns encouraged more people to take to the open water.\n\nIlgen Ilter and Aoife Doran say tour participants enjoy taking time out to focus on themselves. (Supplied: Basquali)\n\n\"[There's been] a massive, massive increase. I've noticed in the last eight years there's definitely a demand for active holidays,\" she says.\n\n\"People don't want to just go on cruise ships or just lie out in the sun all day.\n\n\"People actually want adventure and do something healthy and move and see different parts of the world that they wouldn't normally do on a normal holiday.\n\n\"[Swimming] requires strength and movement and it keeps you young and healthy.\"\n\nThat's echoed by her fellow swim tour guide, Ilgin Ilter, a 23-year-old former World Swimming Championship competitor for Türkiye.\n\nDuring the tour, it's her job to coach the visiting swimmers and help improve their technique. She's noticed many of her best students are old enough to be classed as senior citizens.\n\n\"They're like, retired, and they're not working anymore, and they don't take care of children anymore, so they have more free time to just focus on themselves.\"\n\nFor the love of it\n\nSixty-four-year-old Bryn Nyman took up distance swimming back home in Britain when her kids became adults.\n\n\"I hate being bored and just lying by the pool is nothing for me,\" she says.\n\n\"It's a sport or a thing you can take with you or practise until the day you go, maybe into my 90s if I get that old. I think there's no age limit to this.\"\n\nBryn Nyman and Julia Hughes say swimming makes them happy. (ABC News: Nick Grimm)\n\nEach day, Bryn Nyman, Julia Hughes and a boatload of other swimmers board a repurposed traditional Turkish fishing boat known as a gulet for the short voyage to a remote stretch of coastline, where they jump into the water for a 2-kilometre swim followed by lunch on the boat. They follow up with a second 2km swim in the afternoon.\n\n\"I love being able to swim the whole day, being out on a boat and not having to think about it, and looking at everything that's there,\" Ms Nyman says.\n\nCarol Gifford, 65, has travelled from the United States to share the experience too.\n\nCarol Gifford says she enjoys active travel with a bit of adventure. (Supplied: Basquali)\n\n\"As I get older and older, I just want to continue to be active because I think it's great to be physically fit. I love to do active travel with a little adventure, and I like to do things I've never done before or that get me out of my comfort zone, because that keeps me, I think, mentally good.\n\n\"So I think these kind of trips, you feel good every day and even better every day based on all the exercise.\"\n\nSydney-based heart specialist James Otton is a conjoint associate professor at St Vincent's Clinical School, as well as being a dedicated ocean swimmer.\n\nJames Otton enjoys the perks of ocean swimming, like this view. (Supplied: Basquali)\n\n\"To be honest, the reason why I swim is just because I love it,\" he says.\n\n\"[But] as a cardiologist, I always recommend exercise. [It has] so many health benefits — blood pressure, insulin resistance, increased strength.\n\n\"The more active you can be in terms of both strength and mobility and flexibility in your middle or later years, the longer you'll be able to preserve independence and that strength that's necessary for independence over the long term.\"\n\nAnother medico on the tour, Sydney doctor and surgeon David Yeo, offers a different perspective.\n\nHe says the daily physical challenge isn't just good for the body, it's also a great way to de-stress and relax.\n\nOutback grazier completes 30km ocean swim An outback grazier completes the 32-kilometre Catalina Channel in his latest marathon swim after training in Broken Hill's pool and Menindee Lakes, devoid of waves or currents.\n\n\"Oh absolutely. I think we're all sleeping better at night because we've been active during the day,\" Dr Yeo says.\n\n\"When you get to the end of the day and you've done something useful and enjoyable, you really can enjoy that cocktail or a beer.\n\n\"I mean, it's exhilarating to know that you survived.\"\n\nIt's a survival strategy for 70-year-old Julia Hughes too.\n\nSwimming is something she intends to keep doing for years to come.\n\n\"In the ocean, I just relax and go with the flow because if you've got aches and pains, you can still swim,\" she says.\n\n\"It's not as though we're trying to play tennis or run around or do jerky movements. It's all nice and smooth, easy going, unless you want to up the pace and make more of it.\n\n\"It's a lovely sport to have.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/free-movies-free-tv-watch-online/106207308",
        "title": "The best movies and TV series you can watch now — no fee required",
        "publish_date": "Thu, 08 Jan 2026 01:50:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "The combination of rising monthly fees and new platforms have seen Australian's monthly spend on streaming services hit $42, according to analyst firm Telsyte's 2025 Subscription Entertainment Study.\n\nBut there is another option!\n\nThere is a whole treasure trove of film and TV streaming right now that you can access FOR FREE — if you know where to look.\n\nWe've done the hard yards, sifting through three free Australian streaming services — iview, SBSonDemand and Brollie — to bring you the cream of the crop.\n\nBingeable TV\n\nUnited States of Tara Buck, the foul-mouthed veteran, is just one of Tara's personalities. ( ) It's shows like United States of Tara that really make you think, \"Is there anything Toni Collette can't do?\" In the mid-2000s sitcom, Collette plays not one, but four different characters, all who reside inside a single suburban mum. Tara has dissociative identity disorder (previously known as multiple identity disorder) so in times of stress her 'alters' show up to help. At any time, you don't know if you're going to get 1950s housewife Alice, foul-mouthed Vietnam veteran Buck, or sassy teen Shoshana. It's up to her family — father Max (John Corbett), daughter Kate (a very young Brie Larson) and son Marshall (Keir Gilchrist) — to weather the storm of Tara's changing moods. Created by Juno's Diablo Cody and executive produced by Steven Spielberg, United States of Tara is whip-smart, engaging and an acting masterclass from one of Australia's finest exports. Where to watch: SBSonDemand Trailer Shoresy Letterkenny co-creator Jared Keeso plays the main character in spin-off Shoresy. ( ) Would you believe that Heated Rivalry was not Canadian creator Jacob Tierney's first hockey-themed show? No, that honour belongs to Shoresy — itself a spin-off from Tierney and co-creator/star Jared Keeso's beloved and long-running sitcom Letterkenny. The lightning-quick comedy revolves around Shoresy (Keeso), a loud-mouthed, hockey player whose team is at risk of being shut down after a worrisome season. While there might not be any steamy bedroom scenes in Shorsey, Tierney's directorial fingerprints are all over the show — especially in its ample needle drops and the care afforded to the show's core relationships. It might seem raw and uncouth on the surface but dig a little deeper and you'll find Shorsey has a heart as soft as marshmallow. Where to watch: SBSonDemand Trailer ER The cast of ER. ( ) Before there was The Pitt, there was ER — the ultra-long running medical drama that launched the film career of an alarmingly young George Clooney. In 2026, between The Pitt, St. Denis Medical and the upcoming Scrubs reboot, the hospital procedural is booming, making it the perfect time to revisit the second longest-running prime time medical drama in US history (just behind Grey's Anatomy). Spanning an incredible 15 seasons and 300-plus episodes, ER focused on the high-stakes drama coming out of the Cook County General Hospital. Each week the doctors and nurses must treat the latest patient while also balancing the drama in their own lives. Come for the medical drama, stay to spot the myriad of guest stars, from Ewan McGregor to Zac Efron, that were still building their profiles. Where to watch: iview\n\nNew movies\n\nGodzilla Minus One Godzilla Minus One redefined what you can do with visual effects on a small budget. Godzilla Minus One might be the 37th movie featuring the scaly kaiju but director and writer Takashi Yamazaki's take on the monster classic breathes fresh air into the franchise. While many of Godzilla's US outings focus on the smash and crash of it all, Yamazaki uses the lizard to tap into deep anti-war themes baked deep into Godzilla's 70-plus year history. Set towards the end of WWII, Minus One follows kamikaze pilot Kōichi Shikishima, the lone survivor of a midnight kaiju attack who returns to Tokyo plagued with guilt only to discover his parents have perished in a bombing on the city. This becomes the least of Kōichi's problems as US nuclear tests have mutated Godzilla into a force strong enough to wipe out the whole city. Beyond being a heart-wrenching and effective story, Minus One's visual effects, from citywide destruction to Godzilla's neon spikes, are immaculate and earned the team an Academy Award — making Minus One the only Godzilla film in history to nab an Oscar. Where to watch: SBSonDemand Trailer The Whale Brendan Fraser in the 2022 film The Whale. ( ) Like many of director Darren Aronofsky films, you'll only want to watch The Whale once. Set almost entirely in the cluttered house of morbidly obese college English teacher Charlie (Brendan Fraser). Almost completely immobile, Charlie spends all of his days binge eating, teaching his class from behind a turned-off webcam and occasionally talking with nurse and his only friend Liz (Hong Chau). The film follows his attempts to reconnect with his estranged daughter (Sadie Sink) before his health succumbs to his morbid obesity. Based on the 2012 play by Samual D Hunter, praise was heaped on Fraser's heartbreaking performance, which earned him an Academy Award and a Hollywood redemption arc for the ages. However, some critics took aim at the film's representation of morbid obesity and Fraser's use of a fat suit. Far from the perfect film, The Whale is worth watching for the marvel of human emotion that pours out of Fraser and Chau's performances. Where to watch: SBSonDemand Trailer Priscilla Jacob Elordi as Elvis and Cailee Spaeny as Priscilla, in a scene from Priscilla. ( ) Before Aussie Jacob Elordi set his sights on Oscar gold playing a monster, he was the King in Sofia Coppola's recreation of Priscilla Presley's 1985 memoir. The movie opens in the late 50s where 24-year-old Elvis Presely, at the height of his fame, meets the woman who will eventually be his wife, 14-year-old Priscilla. What follows is a tumultuous relationship between the devoted Priscilla and a musician grappling with both fame and substance abuse, as well as the birth of their only child. Coppola's sensitive hand unspools a dual narrative of dreamy teenage wish fulfilment and the stark reality of young Priscilla's situation. Enriched by lush period costuming and Cailee Spaeny's expansive work playing Priscilla from mid-teens to her late 20s, Priscilla is a headstrong antidote to the mythos of the rock star. Where to watch: SBSonDemand Trailer\n\nFamily favourites\n\nBring It On Bring It On turns 26 in 2026. ( ) This 2000 high school classic has been deceptively tricky to find on streaming in Australia in the past, which is why it's so exciting that it's not only now available to stream but it's completely for frreeeeee. Torrance Shipman has dreamed of being cheer captain since she joined the six-time national-championship-winning Rancho Carne Toros at her sunny California high school. But heavy is the head that wears the crown, and soon Captain Torrance is confronted with the notion that her team's award-winning cheers were all stolen from a nearby competitor school. Lighter than the person at the top of a human pyramid and featuring formative performances from Kirsten Dunst and Eliza Dushku, Bring It On is an essential coming-of-watch for any teen or tween, and a delightful blast from the past for anyone who grew up screaming that there were sexy and cute (and popular to boot). Where to watch: SBSonDemand Trailer The Boy and the Heron The Boy and the Heron follows the story of Mahito and is partly based on Hayao Miyazaki's childhood memories. ( ) In 2023, Studio Ghibli co-founder Hayao Miyazaki pulled a Farnsey and came out of retirement to deliver this eclectic fantasy story. Filled with the wonder and danger of many Ghibli worlds, Miyazaki's latest adventure follows Mahito Maki, a 12-year old boy dealing with the passing of his mother. When a deranged heron tells Mahito that his mum is still alive he enters fantastical worlds full of wizards, man-eating parakeets and, of course, one cantankerous heron. The Boy and The Heron is possibly Miyazaki's most personal film, as parts of Mahito's life mirror the filmmaker's childhood in wartime Japan. His open rumination on resilience and the transformation that comes with responsibility earned Miyazaki's first Academy Award for Best Animated Feature since 2003's Spirited Away. And while the play with Ghibli films is usually to watch in the original Japanese with subtitles, we implore you to give the star-studded English dub for this one — even if it's just to hear Robert Pattinson's insane Heron croak. Where to watch: SBSonDemand Trailer Detective Pikachu Ryan Reynolds voices a very mouthy Pikachu in Detective Pikachu ( ) On paper, a young man trying to solve a mystery with the help of a talking Pikachu Pokemon voiced by Ryan Reynolds can sound … unappealing. But look past the groan-worthy title and Detective Pikachu will reward you with a delightful rollercoaster of a family film. Tim (Justice Smith) is an aspiring Pokemon trainer who gets tumbled up in the years-old conspiracy over the death of his estranged father. Alone in Ryme City, Tim quickly teams up with a Pikachu that just happens to be possessed with the wise-cracking voice of Ryan Reynolds (who only Tim can hear) and looks dashing as a deerstalker. Alongside peppy junior reporter Lucy, the pair dig deep into corruption that threatens the whole city. The narrative wouldn't (and didn't) win any awards but the real delight in the film is how their robust VFX team augments various Pokemon in live action. You'll want to reach right through the screen to touch Pikachu's fluffy fur, you'll recoil at Mr. Mime's uncanny valley appearance, you'll want to ride the mountain-sized Torterra. That alone is worth the 100-minute run time. Where to watch: iview Trailer\n\nAussie nostalgia",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/rba-deputy-andrew-hauser-inflation-interest-rates/106208716",
        "title": "RBA deputy downplays significance of easing inflation for next rates move",
        "publish_date": "Thu, 08 Jan 2026 01:35:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "The deputy governor of the Reserve Bank has confirmed the news mortgage borrowers would not have wanted to hear — interest rates are highly unlikely to head lower anytime soon.\n\nIn an exclusive interview with ABC News, Andrew Hauser said it was \"still true\" that Australians had very likely seen the last rate cuts this cycle.\n\nIn December, RBA governor Michele Bullock effectively ruled out a rate cut for the foreseeable future and said the central bank's board had only weighed up keeping rates on hold or raising them.\n\n\"The governor said … that the likelihood, at least in the near term, of further rate cuts was probably very low,\" Mr Hauser said on Thursday.\n\n\"That's still true, I think, if I'm honest with you.\n\n\" I know that won't be the message that everyone watching this will want to hear. \"\n\nAndrew Hauser joined the RBA in 2024 from the Bank of England. (ABC News: Adam Wyatt)\n\nThe RBA deputy reiterated that the central bank's priority was ensuring inflation remained on target, between 2 and 3 per cent.\n\nThe consumer price index (CPI), released yesterday, showed headline inflation running at 3.4 per cent in the year to November, while the RBA's preferred measure of underlying inflation, the trimmed mean, was at 3.2 per cent.\n\n\"I think we all remember the pain and the difficulty, many of us are still working that through, of that persistent high period of inflation over the last few years,\" Mr Hauser said.\n\n\"It's our job to ensure that doesn't happen again.\"\n\nInflation too high, but 'not a lot of news' in this week's data\n\nReactions to Wednesday's inflation data were mixed, after the CPI eased back more than many economists had forecast.\n\nMr Hauser talked down the significance, however, describing it as \"helpful\" but \"largely as we expected\".\n\n\"Inflation above 3 per cent — let's be clear, it's too high,\" he said.\n\n\"We wish to keep inflation between 2 and 3 per cent, that is currently above that.\"\n\nMr Hauser said there \"wasn't a lot of news in the data yesterday for us\".\n\nHe said inflation coming down partly reflected the Black Friday sales in November, but measures around the costs of housing picked up.\n\n\" Most of those numbers were broadly in line with our expectations. \"\n\nRBA takes one-to-two-year view on inflation: Hauser\n\nMr Hauser also emphasised that the RBA did not target inflation as it stood currently.\n\n\"We're trying to target inflation in a year or two years' time and judging the outlook for inflation.\"\n\nHe said that judgement did not just include the current level of inflation, but also \"on the pace of demand and conditions in the labour market, on global conditions … and five or six other variables\".\n\nInflation cools but February 'remains in play' Inflation cooled in November, with the consumer price index rising 3.4 per cent over the year, down from 3.8 per cent a month earlier.\n\nNovember was just the second set of full monthly CPI data released by the Australian Bureau of Statistics (ABS).\n\nThe ABS will release the December quarterly CPI data at the end of January, giving the central bank another inflation update before its next meeting.\n\n\"We will be waiting for the quarterly inflation number in two or three weeks' time before we take a view on where we think inflation is today,\" Mr Hauser said.\n\nAs for what that number would need to be to prompt a rate rise, Mr Hauser offered a tongue-in-cheek response.\n\n\"How rude can I be on the ABC?\" he asked.\n\n\"But we are not targeting Q4 2025 inflation … you can't even target inflation a quarter out.\n\n\" You're targeting the whole time inflation out a year to two years, and that informs making a judgement. \"\n\nThe deputy governor said if the number was \"spectacularly high or spectacularly low, we'd have to ask ourselves what was driving that, and that might be an important part of our overall judgement\".\n\n\"But we don't have a rule that says if it's 0.9 we hold, and if it's 1 we raise and if it's 0.7 we cut — we take a view of the whole economy.\"\n\nRBA's quandary: To hold or to hike? The Reserve Bank governor has opened the door to interest rate hikes in 2026, but how soon will she walk through it?\n\nAsked about market pricing for the February meeting, which currently sits around two-thirds for rates to remain on hold and one-third for a rate hike, Mr Hauser said he would not comment on whether it was \"a sensible estimate of the outcome\".\n\n\"It's true, as you say, that markets are not placing 100 per cent weight increase in February … you pay your money, you take your choice.\n\n\"It's what financial markets have assumed.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/kentbruck-wind-project-environmental-effects-approval/106206224",
        "title": "Planned wind farm next to Ramsar-listed wetlands passes 'significant' hurdle",
        "publish_date": "Thu, 08 Jan 2026 01:29:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "A major wind-turbine project — planned near Ramsar-listed wetlands — has passed a \"significant\" planning milestone, despite concerns about its environmental impact.\n\nDeveloper HMC Capital has put forward plans for 105 wind turbines, some up to 270 metres tall, between Nelson and Portland in south-west Victoria.\n\nThe turbines would be built inside active pine plantations.\n\nThe 600-megawatt Kentbruck Green Energy Hub would provide power to the nearby Port of Portland and Portland Aluminium Smelter, as well as local homes.\n\nThe proposed footprint of the Kentbruck Green Energy Hub. (Supplied: Neoen Australia)\n\nThe project is also located close to protected environment areas, such as Ramsar-listed wetlands and the Discovery Bay Coastal Park, prompting environmental concerns.\n\nVictorian Acting Planning Minister Gabrielle Williams said the environmental effects statement being approved was a \"significant step\" towards the project moving towards construction.\n\nShe said final approvals were still required.\n\n\"This wind farm will deliver cheaper, cleaner power for hundreds of thousands of homes across Victoria,\" Ms Williams said.\n\n\"We're getting on with helping deliver cleaner and cheaper energy projects, while also ensuring that environmental standards remain strong and safeguards are put in place.\"\n\n'Significant and unacceptable'\n\nThe minister's assessment said while the project \"is likely to have some significant impacts\", it could proceed with some modifications and \"specific mitigations\".\n\nIt also noted the predicted impacts on the Lake Mombeong and parts of the Discovery Bay Coastal Park and Great South West Walk, if the project was to proceed without modification, were \"very significant and unacceptable\".\n\nThe report recommended alterations to \"demonstrate acceptable environmental outcomes can be achieved\".\n\nThe southern bent-wing bat is known to fly in the area of the Kentbruck project. (Steve Bourne, Wikimedia Commons, CC BY SA 4.0)\n\nThis included removing up to five turbines to protect endangered bird and bat species.\n\n\"Decision-makers need to consider this assessment before deciding whether and how the project should proceed,\" the minister's assessment said.\n\nIn an ASX statement, HMC Capital said the project would help meet electricity demand from \"consumer, industrial and emerging AI users\".\n\nA section of pine plantation slated to be the site of the future Kentbruck Green Energy Hub. (Supplied: Neoen Australia )\n\n\"HMC is pleased with the announcement and looks forward to working with the relevant Victorian government authorities and stakeholders on the recommendations in the Planning Minister's assessment,\" Energy Transition Platform chief executive Gerard Dover said.\n\nThe project is expected to create 350 jobs during its construction and 14 ongoing roles once operational.\n\nCommunity opposition\n\nNelson local Fran Thompson, who opposed the project, said the requirements showed the project had a lot of environmental questions to answer.\n\n\"It states the environmental effects statement really was below standard and below par,\" she said.\n\nFran Thompson says the minister's review of the EES raises more questions. (ABC News: Jean Bell)\n\n\"That's why the proponent now has to go back to the drawing board and has to start work again on some very complex environmental research.\"\n\nThe Nature Glenelg Trust is a conservation group that has worked on land rehabilitation projects around Kentbruck's footprint for more than a decade.\n\nManaging director and founder Mark Bachmann said the environmental risks added up to a \"bigger picture\".\n\nMark Bachmann says his organisation has worked for more than a decade to rehabilitate the area around the proposed wind farm. (ABC News: Jean Bell)\n\n\"Our question is, if you step back and look at all that, you ask yourselves, is this really worth it?\n\n\"There's going to be lots of ongoing issues with management of this project in that location because it's such a sensitive site.\n\n\"Is it really a smart place to do a project like this?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/cricket-damien-martyn-returns-home-after-induced-coma/106209598",
        "title": "Ex-Test cricketer Martyn returns home after waking from induced coma",
        "publish_date": "Thu, 08 Jan 2026 01:27:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Australian cricketer Damien Martyn has been released from a Gold Coast hospital after waking from his induced coma.\n\nMartyn was rushed to hospital in late December amid a bout of meningitis, an infection and swelling of fluid and membranes around the brain and spinal cord.\n\nThe 54-year-old had been placed in an induced coma and was fighting for life in a Gold Coast intensive care unit.\n\nBut he awoke last week and began talking again.\n\nDamien Martyn awakes from coma Former Australian Test batsman Damien Martyn is awake and talking after being in an induced coma for several days.\n\nFormer Australia teammate Adam Gilchrist said Martyn had returned home.\n\n\"It's terrific and wonderful to know he's back home, and his family express their gratitude and thanks for all the support,\" Gilchrist said on Kayo Sports during the fifth Ashes Test.\n\n\"The word from the medical staff was the ambulance officers who treated him as soon as they saw him could not have done it any more perfectly, which nipped the infection in the bud.\n\n\"He still has a bit of a journey to go. It was extreme, but great news.\"\n\nDarwin-born Martyn earned a Test debut at 21, replacing Dean Jones in Australia's XI during the 1992/93 home series against West Indies.\n\nHe was appointed Western Australia's Sheffield Shield captain at 23.\n\nDamien Martyn played a pivotal role in Australia's 2003 World Cup victory. (Getty Images: Mike Hewitt)\n\nMartyn was player of the series the last time Australia won the Border-Gavaskar Trophy in India, top scoring in four of Australia's eight innings at the crease in 2004.\n\nHis highest Test score was 165, against New Zealand in 2005, one of 13 centuries he made.\n\nMartyn, who averaged 46.37, was among a handful of star Australian players to retire in the 2006/07 Ashes series.\n\nHe played his final match at Adelaide Oval that summer.\n\nHe also played 208 ODIs, averaging 40.8 and scoring an unbeaten 88 runs when Australia defeated India in the final of the 2003 World Cup in South Africa.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/independent-film-collective-movie-juice-summer-film-festival/106207546",
        "title": "Summer film festival to be launched in Adelaide by independent film collective",
        "publish_date": "Thu, 08 Jan 2026 00:39:13 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Hot nights on the beach, restlessness, young love and the creeping end to summer holidays — such themes would be familiar to many Australians sweltering through a heatwave this week.\n\nThey're also in the mix for Adelaide's newest film festival, which will bring a mix of restored and international classics, micro-budget cinema and a world premiere to the city's western beaches this month.\n\nLaunched by independent film collective, Movie Juice, the Semaphore Summer Film Festival is its largest curated event to date.\n\n\"We were interested in getting a festival together and we liked the idea of creating a festival out of the season, in conversation with the time and place it was happening,\" co-founder Daniel Tune said.\n\nMicro-cinemas on the rise Micro-cinemas showing alternative and niche films are rising in popularity across the country.\n\nAmong the international films is A Summer's Tale by France's Éric Rohmer, from 1996.\n\n\"It's a very beautiful, wry comedy about young love and lust and the folly of both,\" Tune said.\n\n\"It's very autobiographical, I think, about a young man who ends up in Brittany looking for this woman he's had some kind of on-again, off-again relationship with, who hasn't turned up.\n\n\"He sort of just fumbles his way in a very funny fashion.\"\n\nWabi Sabi Rendezvouz, by Adelaide's Jordy Pollock, premiered in 2024. (Supplied: Movie Juice)\n\nInfluenced by Rohmer is Adelaide's Jordy Pollock, whose 2024 film Wasi Sabi Rendezvouz will be shown on one two screens commandeered for the festival at the Semaphore Odeon Star Cinema on January 31.\n\n\"It will we fun to screen his film before the Rohmer film, and we're screening his short as well, which doesn't get put up too much,\" Tune said.\n\nA local's world premiere\n\nAnother local film is the world premiere of The Next Time You Feel Important by Gabriel Bath, about a sailor who washes ashore.\n\n\"That's going to be a pretty crazy, experimental comedy, I guess you could say, lots of fun business with low-budget effects,\" Tune said.\n\nIn keeping with the beach theme is the 1972 classic surf film Morning of the Earth, by Albert Falzon and David Elflick, which put Bali's Uluwatu on the map for surfers.\n\nMorning of the Earth was painstakingly restored and digitised from its original 16 millimetre film for its 50th anniversary in 2022.\n\n\"And we've got Big Wednesday (1978), which is the Hollywood equivalent of that,\" Tune said.\n\n\"There's a lot of cinematic interest, but then also there's this interest from people who like surfing, so it's a win-win.\"\n\nBig Wednesday will be screened along with Morning of the Earth at the film festival. (Supplied: Movie Juice)\n\nOther features include the 2008 Hayao Miyazaki Japanese fantasy film, Ponyo, which was animated by the famed Studio Ghibli.\n\nThen there is 2024's You Burn Me, by Argentinian Matías Piñeiro, 1999's Beau Travail by France's Claire Denis, 2009's Monsters, Marriage and Murder in Manchvegas by the United States' Charles Roxburgh, and 1997's Nowhere by fellow American Gregg Araki.\n\n1997's Nowhere is a black comedy written and directed by Gregg Araki. (Supplied: Movie Juice)\n\n\"That's very much an apocalyptic film set on this blisteringly hot day in Los Angeles, and all these teenagers feel this impending dread coming down on them, and possibly there's an alien invasion taking place,\" Tune said.\n\n\"There's a sort of humour to it, but there's also a real sense of the end coming.\n\n\" We also have a summer shorts program, combining Australian and international shorts, which is a real smorgasbord. \"\n\nMovie Juice was formed in 2022 to screen and distribute alternative, experimental, micro-budget cinema and rarely screened films, sometimes utilising DIY spaces such as warehouses, or even pairing film with live music in pubs.\n\nMovie Juice's Shea Gallagher with Emily Pottinger, Aubrey Winslow, director Gabriel Bath and Daniel Tune at the Adelaide Film Festival. (Supplied: Movie Juice)\n\nThere are similar collectives and groups in capital cities interstate, such as Static Vision in Melbourne, the Brisbane Film Society and Pink Flamingo in Sydney — all of which have growing audiences and are collaborating with each other to support tours and screen alternative film.\n\n\"I think the connections are strengthening with each passing day,\" Tune said.\n\n\"And in terms of the ambition of the undertaking, I think this is the largest scale thing Movie Juice has done,\" Tune said.\n\nHe said Movie Juice had tried to curate a wide ranging set of different items, emotions and cinematic possibilities across the day.\n\n\"Summer can be this very joyous time of being outdoors for fun, but we've also got some films that emphasise the doldrums quality that summer can have, or of the holidays kind of eking by.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/wawrinka-on-kyrgios-australian-open-wildcard/106209186",
        "title": "Wawrinka an unlikely ally for Kyrgios Australian Open wildcard",
        "publish_date": "Thu, 08 Jan 2026 00:32:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Opinions are divided as to whether Nick Kyrgios deserves an Australian Open singles wildcard, but he has an unlikely ally on his side — retiring veteran Stan Wawrinka.\n\nAustralian Open organisers have just three men's singles wildcards remaining, and 40-year-old Wawrinka appears a near certainty to get one.\n\nWawrinka has already announced this year will be his final season on tour, and the 2014 Australian Open winner will be a hit among fans if he is handed a start at Melbourne Park.\n\nAnother guaranteed crowd puller is 2022 Wimbledon finalist Kyrgios, but the wildcard debate surrounding him is far more complicated.\n\nMultiple wrist and knee surgeries means Kyrgios has played just seven singles tour matches over the past three years, with his ranking plummeting to 670.\n\nThe 30-year-old's most recent singles match lasted just 66 minutes — a 6-3 6-4 loss to American Aleksandar Kovacevic at the Brisbane International earlier this week.\n\nKyrgios limps out of Brisbane International Nick Kyrgios limped out of the Brisbane International at the first hurdle as the 30-year-old's ailing body lets him down once again.\n\nBut Kyrgios was able to team with Thanasi Kokkinakis to make it to the second round of the doubles, knocking off the highly fancied pairing of Matt Ebden and Rajeev Ram along the way.\n\nThe pair eventually lost to number six seeds Sadio Doumbia and Fabien Reboul in the second round.\n\nJust last week, Kyrgios stated he would be open to slogging it out in Australian Open qualifying if he wasn't handed a wildcard, but gaining a direct entry would no doubt be his preferred option.\n\nKyrgios and Wawrinka's troubled history\n\nIn 2015, Kyrgios was fined $35,000 for making a derogatory comment about Wawrinka's then-partner during his singles match against him, which at the time prompted the outraged Swiss to demand that the ATP take \"major action against him\".\n\nBut Wawrinka was full of grace on Wednesday night when asked his opinion on whether Kyrgios deserves to receive a wildcard for the Australian Open.\n\n\"He's been injured a lot the last few years, it's not easy for him,\" Wawrinka said after Switzerland secured a berth in the United Cup semi-finals.\n\n\"But he had amazing results in his career, made a final in a grand slam.\n\n\"So, of course, if he's fit and ready, he'll want to play there.\n\n\"And he's been playing a bit more the last few weeks, playing some exhibition matches, and playing in Brisbane now, so hopefully he can be fit without injury for the full year.\"\n\nThe crowd-pulling power of Kyrgios could be hard to ignore.\n\nSpecial Ks lose at Brisbane International Nick Kyrgios and Thanasi Kokkinakis's doubles campaign at the Brisbane International has come to an end.\n\nBut Jordan Thompson, whose injury-plagued 2025 campaign saw him drop to 113th in the world, and fellow Australian Chris O'Connell (114th) would also be deserved recipients.\n\nWawrinka showed he has plenty of fight left in him with a gutsy three-sets win over world No.27 Arthur Rinderknech at the United Cup last weekend.\n\nThe three-time grand slam winner will be back in action alongside teammate Belinda Bencic in Sydney later this week when Switzerland take on either either Belgium or Czechia in the semi-finals of the United Cup.\n\nWawrinka has been in discussions with Australian Open boss Craig Tiley about a wildcard, but nothing has been locked in as yet.\n\n\"I'm super happy if I get one,\" Wawrinka said.\n\n\"I want to play one more time of course, my last year.\n\n\"I have amazing memories from there … after winning my first slam there. It will be amazing.\n\n\"But I had one job to do if I wanted to play one more time. It was to be in the top 100, and I'm not.\n\n\"Next week, I'm going to play Auckland. I've got a wildcard there. So I'm happy where I am right now, and I'm not worried too much about what's going to happen in Melbourne.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/china-close-ties-with-venezuela-inaction-since-maduro-capture/106205836",
        "title": "Why China's strong backing of Venezuela did not help Maduro",
        "publish_date": "Thu, 08 Jan 2026 00:26:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hours before US helicopters landed at the compound of Nicolás Maduro, the president of Venezuela said he had enjoyed a \"pleasant evening\" with Chinese diplomats.\n\nIn a meeting with Chinese President Xi Jinping's special envoy for Latin America, Qiu Xiaoqi, the two countries reaffirmed close ties and commitment to \"building a multipolar world of development and peace\", Mr Maduro said afterwards.\n\nBeijing has since emerged as one of the strongest critics of the move by US President Donald Trump to capture Mr Maduro and his wife for criminal proceedings on a range of charges.\n\nLoading...\n\n\"Release them at once,\" a statement from the Chinese Foreign Ministry said on Sunday.\n\n\"Stop toppling the government of Venezuela.\n\n\"Such hegemonic acts of the US seriously violate international law and Venezuela's sovereignty, and threaten peace and security in Latin America and the Caribbean region.\"\n\nChina slammed reports that the Trump administration ordered acting Venezuelan President Delcy Rodríguez to cut ties with US adversaries China, Cuba, Russia and Iran as \"bullying\".\n\nYet, despite an \"all-weather strategic partnership\" with Venezuela, China has not moved beyond condemnation of Washington.\n\nThe largest buyer of Venezuelan oil\n\nChina has spent decades deepening its ties with South America, investing billions in infrastructure projects to help advance its reputation and economic interests.\n\nAustralia's neighbours slam Trump's 'dangerous precedent' in Venezuela Indonesia, Singapore and Malaysia express \"grave concern\" over the US capture of Venezuelan President Nicolás Maduro.\n\nOne of the strongest US allies in the region, Colombia, became the 22nd country in Latin America and the Caribbean to join China's Belt and Road investment initiative in May last year.\n\nSince 2000, China has replaced the US as the largest or second-largest trading partner of almost every country in the region, said University of Melbourne Latin American studies professor Adrian Hearn.\n\nThe \"uncertainty and instability\" caused by hiked US tariffs under Mr Trump had only accelerated this trend, Professor Hearn said.\n\n\"China has opened up an alternative for Latin America,\" he said.\n\nIt is Venezuela's biggest customer for oil exports, which represent about 95 per cent of the South American country's overseas revenue — a vital economic lifeline amid US sanctions.\n\nGrowing Chinese influence in the region has long worried Washington.\n\nAfter the seizure of Mr Maduro, US Secretary of State Marco Rubio said it would not allow \"the Western Hemisphere to be a base of operation for adversaries, competitors, and rivals of the United States\".\n\nThe timing of the operation against Mr Maduro may thus have been a deliberate \"act of intimidation\", said Oliver Villar, an expert on Latin American geopolitics at Charles Sturt University.\n\nChina has long provided economic and political support to Venezuela. (Reuters: Miraflores Palace)\n\n\"You see this as a desperate act of a declining power,\" Dr Villar said, describing it as a \"brazen attempt\" to warn countries against becoming too close to China.\n\n\"But of course the Chinese, like its main partner Russia, don't scare easily,\" he said.\n\n\" The strength of China's foreign policy in both geopolitical and geo-strategic means is that it does business with everyone. \"\n\nThat even included Argentina, Dr Villar said, where President Javier Milei is \"one of Trump's key allies\".\n\nMaduro toppling 'not an existential threat' to Chinese interests\n\nChinese companies are among the only foreign-owned businesses still operating in Venezuela.\n\nThe largest international buyer of Venezuelan oil is China. (Reuters: Issac Urrutia/File)\n\nThe state-owned China National Petroleum Corporation runs a number of joint ventures in the country.\n\nThe American Enterprise Institute, a Washington-based think tank, estimates some US$2.1 billion ($3.1 billion) in Chinese investment flowed to Venezuela's oil sector between 2016 and 2023.\n\nThe capture of Mr Maduro and heightened instability in Venezuela therefore leaves China exposed.\n\nOutstanding debt to China is estimated to exceed US$10 billion ($14.9 billion) — and there are questions whether this will ever be repaid.\n\n\"But at the end of the day, it's not an existential threat to China if these loans fall through,\" said China-Global South Project editor Eric Olander.\n\nThe much larger economy of Brazil was at the \"epicentre\" of Chinese engagement in Latin America, he told ABC's The World.\n\n\"When we look at Venezuela, it's important, but it's not in the top tier of the geopolitical hierarchy for China in that region,\" Olander said.\n\nDespite China being the largest buyer of Venezuelan oil, it only accounted for around 4 per cent of China's overall crude imports last year.\n\nAnd while Mr Maduro has been removed from power, his administration remains largely intact.\n\nVenezuelans celebrate a future reclaimed — but the power struggle is just getting started Venezuelans celebrate Maduro’s fall — but on the ground the fight for power is just beginning.\n\nSome analysts argue China is well-positioned to engage with those left in power.\n\n\"Beijing has consistently pursued engagement with all viable political actors, regardless of ideology,\" Margaret Myers, director of the Asia and Latin America program at the Inter-American Dialogue, told Bloomberg.\n\n\"[It] is likely to maintain what presence it can over the long term in light of its substantial investments and Venezuela's strategic importance.\"\n\nCharles Sturt's Dr Villar said China's approach was not to engage the US through conflict.\n\n\"China's strategy is to emerge as the adult in the room,\" he said.\n\nA banner depicts Nicolás Maduro and Xi Jinping with a message that reads in Spanish: \"An example for the world.\" (AP: Cristian Hernandez/File)\n\nAs Mr Maduro's trial began in New York this week, Chinese Foreign Ministry spokesperson Mao Ning said: \"No country can act as the 'world policeman', and no country can proclaim itself the 'international judge'.\n\n\"We stand ready to work with all countries to uphold the authority of international law,\" she said.\n\nWhat happens next?\n\nMr Trump has said US oil companies will enter Venezuela to \"spend billions of dollars, fix the badly broken infrastructure, oil infrastructure, and start making money for the country\".\n\nVenezuela has the largest proven oil reserves in the world, but production has declined significantly in recent years.\n\nThe International Energy Agency reports it produced around 860,000 barrels per day in November last year — less than a third of the amount Venezuela was producing a decade ago.\n\nIt would require an estimated US$100 billion in investment and more than a decade to bring Venezuela's sector back to previous production levels, said Professor Hearn from the University of Melbourne.\n\n\"That's a lot of money, it's a lot of time, and it's really not certain that US companies would want to put up that kind of cash,\" he said.\n\nMeanwhile, Mr Trump has entertained the idea of further military interventions in the Americas, suggesting a similar operation in Colombia, which neighbours Venezuela, \"sounds good to me\".\n\nThe US secretary of sate Mr Rubio also hinted at targeting Cuba, which is closely allied with Venezuela.\n\n\"If I lived in Havana and I was in the government, I'd be concerned,\" he said.\n\nSome analysts have suggested US actions in Venezuela could embolden China to act against Taiwan.\n\nWhere will Trump send troops next? As the president flew back to Washington from his Florida Christmas break, he spoke to the press on Air Force One — and entertained the idea of targeting another four nations.\n\n\"US opponents will no doubt play up the lack of a clear justification under international law,\" said Bronwen Maddox, director of the London-based think tank Chatham House.\n\n\"Russia will use US actions to bolster its justifications for its invasion of Ukraine. China may cite Venezuela in its rhetoric regarding Taiwan.\"\n\nThe China-Global South Project's Olander argued that, as with the removal of Saddam Hussein in Iraq, the political instability caused by the fall of Mr Maduro could easily backfire against Washington.\n\n\"It's just too early to suggest if it's a blow [to Chinese interests in Latin America] or not,\" he said.\n\n\"We could be in a situation next year at this time where there's an anti-American push in Venezuela that turns in favour of China.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/world-cup-laura-peel-win-gold-ahead-of-winter-olympics/106209106",
        "title": "Peel boosts Aussie Winter Olympics hopes with World Cup victory",
        "publish_date": "Thu, 08 Jan 2026 00:15:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Laura Peel has improved her Winter Olympics medal prospects with her best performance of the season, topping the podium at the World Cup event in Canada.\n\nThe two-time world aerials champion had been below her best leading into back-to-back World Cup events at Lac-Beauport.\n\nShe finished 23rd in this week's first event after failing to stick her landing.\n\nBut Peel regained her sparkling touch in the second outing and earned her first World Cup medal of the season, blitzing the field with a superb back full-full-full.\n\nThe 36-year-old scored a mammoth 113.76 points ahead of American Winter Vinecki, who won the opening event in Quebec this week.\n\nWith all medallists executing a triple in the super final, Vinecki scored 109.90, with China's Olympic champion Xu Mengtao third with 97.02.\n\nLaura Peel scored 113.76 to claim the gold medal. (AP/The Canadian Press: Jacques Boissinot)\n\n\"It feels really good to be back. I'm really happy with that jump, with my jumping all day,\" three-time Olympian Peel said.\n\n\"Yesterday wasn't really my day, and I'm really stoked to come back today with that.\n\n\"I don't know if we've had three full-full-fulls on the podium before, and it's epic to see women out there doing the big tricks, because we can.\"\n\nAirleigh Frigo was the next best-placed Australian in seventh, while Sidney Stephens had a breakout finish in 11th place.\n\nAbbey Willcox placed 13th, and Danielle Scott finished in 20th place.\n\nAussie teen stuns with World Cup gold medal With the Winter Olympics on the horizon, 15-year-old Indra Brown wins her first World Cup freeski halfpipe gold in Calgary, with Valentino Guseli also winning gold in the snowboard halfpipe.\n\nThere is one more World Cup event in Lake Placid on January 11 and 12 before the Olympics are held in Milano Cortina next month.\n\nPeel won the world championship in 2015 and 2021 and multiple World Cup titles, but an Olympic medal has proved elusive.\n\nShe has finished fifth at the past two Games.\n\nMeanwhile, Australian snowboarder Valentino Guseli topped his heat of the halfpipe World Cup event in Aspen, Colorado.\n\nComing off the back of his recent triumph in Calgary, Guseli scored 92.0 for his best run, which was the leading score in the first heat.\n\nJapan's Yuto Totsuka posted the best mark of the day, with 93.5 in the second heat.\n\nThe top seven from each heat will contest the final.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/ashes-live-blog-day-five-scg/106208540",
        "title": "Live: Aussies making light work of run chase as England fumes over DRS",
        "publish_date": "Wed, 07 Jan 2026 22:53:46 +0000",
        "category": "sports",
        "authors": [
            "Simon Smale",
            "Chris De Silva"
        ],
        "text": "Josh Tongue gave England a glimmer of hope by removing both of Australia's openers. (Getty Images)\n\nHmmmm, this fourth innings is placed beautifully as we head into lunch on day five.\n\nAustralia still ahead, but England have removed both openers and have two mostly new batters at the crease.\n\nThe real key to this chase is Steve Smith. If England is able to remove him relatively cheaply after the break, then we've got a game well and truly on.\n\nIt must be said Australia bats very, very deep with Michael Neser scheduled to come in at number nine, so they still should be able to manage this.\n\nIn some positive news, I'd say we're also pretty likely to get one final Usman Khawaja innings as well on his final day as a Test cricketer.\n\nJosh Tongue with both wickets so far in this innings, continuing what's been an excellent series for him on a personal note.\n\nEngland will feel some sort of justice has been done with Weatherald dismissed — something they'll feel should've happened on that DRS call earlier in the innings.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/heatwave-havens-eurobodalla-vulnerable-residents/106204158",
        "title": "Community havens help to beat the heat in extreme conditions",
        "publish_date": "Wed, 07 Jan 2026 22:28:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "As southern New South Wales experiences its most intense heatwave since the Black Summer of 2019-20, a community-led initiative is being rolled out to help vulnerable residents find relief from the heat.\n\nCommunity buildings across the Eurobodalla Shire, on the state's far south coast, are opening their doors over the coming days, acting as heatwave havens and offering cool, safe spaces for locals.\n\nSeven out of nine spaces will be open from Thursday until Saturday in Batemans Bay, Narooma and Moruya at varying times, in the first trial of the havens.\n\nThe buildings have been retrofitted by the Southcoast Health and Sustainability Alliance (SHASA) with solar panels and batteries, air conditioning, kitchens, and backup generators to ensure they remain operational during extreme conditions and bushfires.\n\n\"At the moment in our community, we don't have large shopping centres or many places where people can go to escape heat or smoke,\" SHASA president Kathryn Maxwell said.\n\n\"If we can have lots of smaller facilities around the community, it takes pressure off the big evacuation centres.\"\n\nThe heatwave havens across the Eurobodalla offer residents a chance to cool down. (ABC South East NSW: Isla Evans)\n\nSafe havens\n\nFollowing the experience of the Black Summer bushfires, SHASA worked with local churches, community halls, and surf lifesaving clubs to upgrade facilities by helping them apply for grant funding.\n\n\"It's absolutely critical to have solar, batteries, and a backup generator because if the power goes down, you can keep these facilities running,\" Ms Maxwell said.\n\n\"The other key element is air conditioning, which allows for temperature control, and air filters if there is a bushfire.\"\n\nHavens are required to have a backup power source like a generator or solar power. (ABC South East NSW: Toby Hemmings)\n\nJulie Brown from Southern Life Church in Moruya said part of the appeal of working with SHASA was the long-term benefits for the facilities, as well as helping the community.\n\n\"It's helped us with our bills because we're an independent church,\" Ms Brown said.\n\n\"To have solar is great, especially when our power bills have been high because we run multiple freezers.\"\n\nThe havens will be operated by volunteers, including Ms Brown.\n\n\"We're just encouraging people to drop in, even if it's just for a few hours or for all day, have a cuppa with us, get cool,\" Ms Brown said.\n\n\"We can put a movie on, we've got music, we've got colouring in for kids, we've got all those sorts of things that we can at least offer for people to come and take refuge.\"\n\nVolunteers at Southern Life Church Moruya have been stocking up ahead of the heat haven opening. (ABC South East NSW: Toby Hemmings)\n\nHelping the vulnerable\n\nA key goal of the havens is to provide a safe and accessible space for vulnerable residents to shelter from extreme conditions.\n\nAffordable housing resident Kellie Beavis said she became aware of the havens through a post on Facebook.\n\nShe said her Moruya villa did not regulate heat well, particularly in such intense temperatures.\n\n\"There's heat that gets in through the windows, and there's no relief,\" Ms Beavis said.\n\nAffordable housing resident Kellie Beavis says she cannot afford to run her air conditioning unit. (ABC South East NSW: Toby Hemmings)\n\nMs Beavis has air conditioning at home, but is reluctant to use it due to the high cost of electricity.\n\n\"I'm still wary of using it because it's expensive,\" she said.\n\n\"The elderly in the community and the people who can't afford the electricity need to know [about these havens]. It's really important that we support people like that.\"\n\nThe havens are designed for vulnerable community members, including children, the elderly, and those who do not have air conditioning. (ABC South East NSW: Isla Evans)\n\nMs Maxwell said this week's extreme weather would be a test to help them figure out what their community needed from heat havens in the future.\n\n\"We don't expect it to be totally smooth, we don't expect it to be perfect,\" she said.\n\n\"It's really an opportunity for us to learn.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/bbl-ollie-peake-melbourne-renegades-perth-scorchers/106208704",
        "title": "Peake's last-ball six hands Renegades controversial win over Scorchers",
        "publish_date": "Wed, 07 Jan 2026 22:05:39 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ollie Peake has survived a contentious overturned catch to smash a last-ball six to seal a four-wicket win for the Melbourne Renegades over the Perth Scorchers.\n\nAfter knocking the Scorchers over for 127 from 19.2 overs at Perth Stadium on Wednesday night, the Renegades almost made a meal of the modest chase before 19-year-old Peake came to their rescue.\n\nWith four runs to win off the last ball, Peake shimmied across in premeditated fashion and paddled Aaron Hardie's full delivery over fine leg deep into the stands.\n\nThe Renegades' pursuit had looked forlorn in the 17th over when Peake was given out for 15 with a soft signal after Scorchers captain Ashton Turner snared a difficult tumbling catch.\n\nBut Peake was reprieved — and subsequently booed by the parochial Perth crowd — after replays showed the ball touched the ground while in Turner's hand as he somersaulted backwards.\n\n\"In the moment, I didn't know I had put it [the ball] on the ground,\" Turner told ABC Sport.\n\n\"But it's one of those ones that I think anyone watching knows is out. That's a catch.\n\n\"But technically, the correct decision was made. That's how the rules are laid out. The officials made the correct call.\n\n\"It doesn't make it less frustrating. I think if that's in the backyard and your brother hits it up, he's walking off the field.\"\n\nOllie Peake showed cool nerves to guide the Renegades home. (Getty Images: James Worsfold)\n\nPeake — who headed straight from the ground to the airport bound for Africa, where he will captain Australia at the ICC Men's Under-19 World Cup — described the finish as \"surreal\".\n\n\"To do it here in front of all the Scorchers fans is pretty special and what you grow up dreaming of doing,\" said Peake, who finished 42 not out.\n\n\"I had a bit of luck and [I'm] just happy that it all paid off tonight.\"\n\nAfter Josh Brown (22) teed off early, the Renegades were cruising at 1-51 from six overs before being restricted to 4-23 from the next eight.\n\nAt one stage, 50 balls passed without a boundary before Peake dominated a 42-run sixth-wicket stand with skipper Will Sutherland (15) and rode his good fortune to finish his BBL campaign on a stunning high.\n\nEarlier, Renegades teammate Gurinder Sandhu snared 4-28 to take his season tally to 14 wickets at 14.71, moving into top position on the Golden Arm leaderboard.\n\nHardie (44) was scratchy but top-scored for the Scorchers, who wobbled early and crashed hard late, losing 5-11 from 17 deliveries.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/beating-the-heat-in-marble-bar-australias-hottest-town/106204346",
        "title": "Top tips for beating the heat from Australia's hottest town",
        "publish_date": "Wed, 07 Jan 2026 21:59:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "In Australia's \"hottest town\", a forecast of 45 degrees Celsius or above is business as usual.\n\nThe country is in the midst of what weather authorities are calling the most significant heatwave in six years, but residents of Marble Bar, 1,470 kilometres north of Perth, are unfazed.\n\nHome to about 200 people, Marble Bar is nestled in the centre of the arid Pilbara region, between the major mining towns of Newman and Port Hedland.\n\nThe town first gained international recognition when it set a world record with 160 days above 100 degrees Fahrenheit (37.8C) in the 1923–24 summer.\n\nWhile the rest of Australia sweats, 45C is a regular summer's day in Marble Bar. (ABC Pilbara: Kimberley Putland)\n\n\"This heat for this time of year is just a Tuesday for us,\" Marble Bar Community Resource Centre manager Bazz Harris laughed.\n\nEven so, with the town's prominent temperature gauge clocking up a reading of 51C earlier this week, residents have shared their tips on how to keep cool in a heatwave.\n\n\"We have had a gentleman who purchased 30 bags of ice and filled his blow-up pool with it, and sat on his front porch with a beer,\" Mr Harris said.\n\n\"The trick there — he was butt naked — it was not a sexy sight, but it's what he did to keep cool.\"\n\nBazz Harris says people take extraordinary measures to stay cool. (ABC Pilbara: Kimberley Putland)\n\nSleep and hydration key\n\nPilbara locals enjoy fresh waterholes to keep themselves cool in the long summers, and early showers before the cold tap turns warm.\n\nBut for those without access to waterholes, Mr Harris's top tip came down to sleeping habits.\n\n\" A good eight hours' sleep at night in a cool air-conditioned bedroom and you can deal with the day. \"\n\nMarble Bar's maximum temperature for this month sits at 51C. (ABC Pilbara: Kimberley Putland)\n\nMisting toilet invention\n\nMarble Bar resident John Mladenovich recalled finding a tin shed toilet at an exploration site in the Great Sandy Desert where an automated mister had been installed.\n\n\"The thunderbox, they called it,\" he laughed.\n\n\"As soon as you sat on the dunny, it was automatic; they had this mist coming down.\n\n\"In the breeze, it was almost like you were in aircon.\"\n\nJohn Mlandenovich likes to keep cool by drinking a beer and watching the cricket. (ABC Pilbara: Kimberley Putland)\n\nOn a more serious note, Mr Mladenovich recommended wearing a wet towel over your head, neck and face, or running under the sprinkler.\n\n\"But make sure you've got your clothes on,\" he said.\n\nHe also urged anyone sweltering through the current heat to remember to replace their electrolytes when drinking plenty of water.\n\n\"One orange, squeezed, a whole lemon and a teaspoon of baking soda — drink that, and you'll feel refreshed,\" he said.\n\nBut most importantly, Mr Mladenovich said sitting in the shade watching the cricket with a beverage in hand was the best way to keep cool.\n\n\"One thousand per cent, you don't feel the heat,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-08/sag-actor-award-nominations/106208668",
        "title": "Australian stars receive nods in 2026 SAG Actor Award nominations",
        "publish_date": "Wed, 07 Jan 2026 21:59:30 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Australian names are among the mix of nominees unveiled for Hollywood's Actor Awards, formerly known as the Screen Actors Guild (SAG) Awards.\n\nRose Byrne's monumental performance as an exasperated therapist in If I Had Legs I'd Kick You earned her a nod, while Jacob Elordi is up for an award for his take on one of cinema's most iconic monsters, Frankenstein.\n\nMeanwhile, in television, Sarah Snook could pick up her second award of the season for her lead role in the twisting thriller All Her Fault.\n\nThe Actor Awards are closely watched ahead of the Academy Awards, as winners are chosen by SAG-AFTRA actor union members — the largest voting bloc for the Oscars.\n\nThe 32nd Actor Awards will take place on March 1 at the Shrine Auditorium in Los Angeles, California.\n\nFor Australians, the ceremony will start about 12pm AEDT on March 2.\n\nHere are all the nominations for this year's Actor Awards.\n\nFilm\n\nCast in a Motion Picture\n\nFrankenstein\n\nHamnet\n\nMarty Supreme\n\nOne Battle After Another\n\nSinners\n\nRose Bryne in If I Had Legs I'd Kick You. (Supplied: VVS Films)\n\nFemale Actor in a Leading Role\n\nJessie Buckley in Hamnet\n\nRose Byrne in If I Had Legs I'd Kick You\n\nKate Hudson in Song Sung Blue\n\nChase Infiniti in One Battle After Another\n\nEmma Stone in Bugonia\n\nMale Actor in a Leading Role\n\nTimothée Chalamet in Marty Supreme\n\nLeonardo DiCaprio in One Battle After Another\n\nEthan Hawke in Blue Moon\n\nMichael B Jordan in Sinners\n\nJesse Plemons in Bugonia\n\nAriana Grande and Cynthia Erivo in Wicked: For Good. (Supplied: Universal Pictures)\n\nFemale Actor in a Supporting Role\n\nOdessa A'zion in Marty Supreme\n\nAriana Grande in Wicked: For Good\n\nAmy Madigan in Weapons\n\nWunmi Mosaku in Sinners\n\nTeyana Taylor in One Battle After Another\n\nMale Actor in a Supporting Role\n\nMiles Caton in Sinners\n\nBenicio Del Toro in One Battle After Another\n\nJacob Elordi in Frankenstein\n\nPaul Mescal in Hamnet\n\nSean Penn in One Battle After Another\n\nTelevision\n\nEnsemble in a Drama Series\n\nThe Diplomat\n\nLandman\n\nThe Pitt\n\nSeverance\n\nThe White Lotus\n\nFemale Actor in a Drama Series\n\nBritt Lower in Severance\n\nParker Posey in The White Lotus\n\nKeri Russell in The Diplomat\n\nRhea Seehorn in Pluribus\n\nAimee Lou Wood in The White Lotus\n\nMale Actor in a Drama Series\n\nSterling K Brown in Paradise\n\nBilly Crudup in The Morning Show\n\nWalton Goggins in The White Lotus\n\nGary Oldman in Slow Horses\n\nNoah Wyle in The Pitt\n\nMartin Short, Selena Gomez and Steve Martin in Only Murders in the Building. (Disney+)\n\nEnsemble in a Comedy Series\n\nAbbott Elementary\n\nThe Bear\n\nHacks\n\nOnly Murders in the Building\n\nThe Studio\n\nFemale Actor in a Comedy Series\n\nKathryn Hahn in The Studio\n\nCatherine O'Hara in The Studio\n\nJenna Ortega in Wednesday\n\nJean Smart in Hacks\n\nKristen Wiig in Palm Royale\n\nMale Actor in a Comedy Series\n\nIke Barinholtz in The Studio\n\nAdam Brody in Nobody Wants This\n\nTed Danson in A Man on the Inside\n\nSeth Rogan in The Studio\n\nMartin Short in Only Murders in the Building\n\nFemale Actor in a Television Movie or Limited Series\n\nClaire Danes in The Beast in Me\n\nErin Doherty in Adolescence\n\nSarah Snook in All Her Fault\n\nChristine Tremarco in Adolescence\n\nMichelle Williams in Dying for Sex\n\nErin Doherty and Owen Cooper in Adolescence. (Netflix)\n\nMale Actor in a Television Movie or Limited Series\n\nJason Bateman in Black Rabbit\n\nOwen Cooper in Adolescence\n\nStephen Graham in Adolescence\n\nCharlie Hunnam in Monster: The Ed Gein Story\n\nMatthew Rhys in The Beast in Me\n\nStunts\n\nStunt Ensemble in a Motion Picture\n\nF1\n\nFrankenstein\n\nMission: Impossible — The Final Reckoning\n\nOne Battle After Another\n\nSinners\n\nStunt Ensemble in a Television Series",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/property/news/billionaire-adrian-portelli-alleges-defects-in-fitout-of-39m-penthouse-20260108-p5nsio.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Adrian Portelli alleges defects in fitout of $39m penthouse",
        "publish_date": "Thu, 08 Jan 2026 13:12:49 +1100",
        "category": "finance",
        "authors": [
            "Elizabeth Redman"
        ],
        "text": "Billionaire businessman Adrian Portelli’s grand penthouse apartment dreams have turned to a nightmare, as a new video alleges a string of defects in the luxury fitout.\n\nWater leaks, cracked benchtops and missing water stops appear in the video, in which Portelli invites a building inspector to look for faults in the oversized Melbourne residence he bought for $39 million in 2023.\n\nZeher Khalil of Site Inspections with billionaire Adrian Portelli. Credit: YouTube - Site Inspections\n\nThe penthouse crowns the Sapphire by the Gardens development in the CBD, a luxurious twin tower project with residences and a hotel. Portelli speaks in the video about how he intended his purchase to be an investment and loves the sweeping city views and easy access via a sky bridge to the hotel’s hospitality offering.\n\nHe intends to use it to host parties or as a guest home for visiting business contacts, and embarked upon a glamorous customised fitout with a double-height ceiling in the living area, an oversized kitchen island bench and an elevated indoor swimming pool. He also made headlines for craning in a McLaren racing car which sits on a podium in the apartment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/she-ll-be-kicking-him-home-for-us-buchanan-eyeing-fairytale-win-to-honour-tragic-jockey-20260108-p5nsj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘She’ll be kicking him home for us’: Buchanan eyeing fairytale win to honour tragic jockey",
        "publish_date": "Thu, 08 Jan 2026 13:11:12 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Local trainer Kristen Buchanan had hoped to have apprentice Bronte Simpson back aboard her favourite horse, Stylebender, at Wyong’s biggest race day on Saturday.\n\nNow, a devastated Buchanan is sure Simpson will be “kicking him home for us” in the race named in honour of the former Wyong-based rider, who died in a car crash on December 22.\n\nApprentice Bronte Simpson and trainer Kristen Buchanan after Stylebender gave Simpson her first winner, at Muswellbrook in May 2025. Credit: Muswellbrook Race Club\n\nThe Ballarat-raised 24-year-old, who moved north to join Tamworth trainer Jane Clement this season, was driving alone when her vehicle hit a tree at Mendooran, north-west of Dubbo.\n\nThe tragedy rocked the racing community, especially at Wyong, where Simpson started her riding career under Sara Ryan and with the support of other trainers like Buchanan.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/the-parlour-amaro-bar-20260108-p5nsla.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Parlour Amaro Bar",
        "publish_date": "Thu, 08 Jan 2026 13:05:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nDuring the pandemic, Provenance chef Michael Ryan turned his attention to another curiosity: amari – the herbal elixirs and one-time medicines of ancient Italy. Produced with the same clarity that defines his food, Ryan’s amari make delicious appearances on Provenance’s drinks list – but they find full expression one floor up at its companion bar, the Parlour Amaro Bar. That’s where you’ll find him after dessert – one hand dropping the needle on an early Tom Waits record, the other mixing a thinking person’s negroni.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/who-is-teagan-croft-meet-the-aussie-star-cast-as-rapunzel-in-disney-s-live-action-tangled-20260108-p5nsj7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Who is Teagan Croft? Meet the Aussie star cast as Rapunzel in Disney’s live-action Tangled",
        "publish_date": "Thu, 08 Jan 2026 12:56:08 +1100",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "The highly anticipated live-action adaptation of Disney’s Tangled has finally found its Rapunzel, and she’s Australian.\n\nTeagan Croft, a 21-year-old rising star from Sydney, will let down her golden locks in the upcoming version of the 2010 hit. She reportedly beat out other blossoming actresses such as The White Lotus star Sarah Catherine Hook (who played Piper Ratliff in the most recent season), Olivia-Mai Barrett (Invasion) and Freya Skye (Zombies 4: Dawn of the Vampires).\n\nRising Australian star Teagan Croft will play Rapunzel in the highly anticipated live-action Tangled.\n\nJoining Croft on this adventure will be Milo Manheim, an American actor best known for his role in the Disney musical franchise Zombies. He’ll take on the role of Flynn Rider, a charming thief who helps Rapunzel escape from her tower imprisonment.\n\nBoth young stars have big shoes to fill, having assumed roles previously held by Mandy Moore and Zachary Levi. They will be directed by Michael Gracey, known for musicals like Better Man and The Greatest Showman.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/cartoons-of-the-week-20260102-p5nrao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cartoons of the week",
        "publish_date": "Thu, 08 Jan 2026 12:55:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Cartoons of the week\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/larvotto-adds-fresh-gold-antimony-firepower-to-nsw-project-20260108-p5nsl6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Larvotto adds fresh gold-antimony firepower to NSW project",
        "publish_date": "Thu, 08 Jan 2026 12:48:33 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Larvotto Resources has again underlined the growth potential of its Hillgrove antimony-gold project in New South Wales after diamond drilling at the company’s Clarks Gully prospect returned further high-grade mineralisation at depth, along strike and to the north - with a dash of tungsten for good measure.\n\nThe company drilled three near-mine exploration holes at the target during October and November 2025, completing more than 500 metres of drilling. The program was designed to test the depth and strike extensions of known antimony-gold mineralisation, with a focus on potential splays and parallel lodes. The program was also used to validate geophysical targets identified in earlier surveys.\n\nStandout intercepts included 6.4 metres at a hefty 12.92 grams per tonne (g/t) gold equivalent from 208m, with 4.1 metres of that interval grading an eye-catching 19.76g/t gold equivalent.\n\nThat hole intersected what the company believes could be a new parallel lode in the footwall of the main Clarks Gully structure, pointing to additional near-mine growth potential and warranting further follow-up drilling.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-off-to-a-slow-start-as-gold-oil-prices-fall-wall-street-drifts-20260108-p5nshf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX treads water after Wall Street drifts; BlueScope, Ansell, James Hardie fall",
        "publish_date": "Thu, 08 Jan 2026 12:18:56 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket continued its lacklustre performance into lunchtime after US stocks wavered overnight as traders digested mixed economic data and took stock of shifting geopolitical risks amid a flurry of social media posts from President Donald Trump.\n\nThe S&P/ASX 200 inched up 11.70 points, or 0.1 per cent, to 8707.30 at 12.01pm AEDT. Gains by tech stocks held the bourse in the green, while miners wobbled. The flattish trade comes after the market eked out a small gain in the previous session, continuing its sluggish start to the new year, with the S&P/ASX 200 edging up 0.2 per cent. The Australian dollar was trading at US67.24¢.\n\nWall Street lacked direction overnight, prompting meagre gains on the local bourse this morning. Credit: Bloomberg\n\nThe bourse didn’t take any more direction from the balance of trade for November. Australia’s trade surplus narrowed to $2.94 billion, down from a revised $4.35 billion in October after a fall in iron ore exports, the Australian Bureau of Statistics said.\n\nTech stocks tracked overnight gains by the US tech giants, which benefited as this week’s Consumer Electronics Show in Las Vegas boosts optimism about the sector. WiseTech Global, Australia’s biggest tech stock, was up 2.8 per cent. Fellow software makers Xero and Technology One rose 2 per cent and 1.5 per cent, respectively. Data centre operator Next DC rose 1 per cent and family tracking app Life360 climbed 2.4 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/aussie-actress-teagan-croft-to-star-in-live-action-tangled-film-20260108-p5nsjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie actress Teagan Croft to star in live-action Tangled film",
        "publish_date": "Thu, 08 Jan 2026 12:18:14 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Aussie actress Teagan Croft to star in live-action Tangled film\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/england-fume-as-drs-robs-them-of-wicket-20260108-p5nsku.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "England fume as DRS robs them of wicket",
        "publish_date": "Thu, 08 Jan 2026 12:15:06 +1100",
        "category": "sports",
        "authors": [],
        "text": "England fume as DRS robs them of wicket\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/drinking-with-the-enemy-the-espresso-cup-blunder-that-enraged-tottenham-fans-20260108-p5nsjx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drinking with the enemy: The espresso cup blunder that enraged Tottenham fans",
        "publish_date": "Thu, 08 Jan 2026 11:54:42 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Tottenham Hotspur boss Thomas Frank has come under fire for drinking out of an espresso cup featuring the logo of the club’s arch-rivals Arsenal as his side slumped to their eighth defeat of the Premier League season away to Bournemouth on Thursday morning (AEDT).\n\nAntoine Semenyo scored in the 95th minute to consign Spurs to a 3-2 loss, netting a double in what is likely to be his final appearance for Bournemouth ahead of a likely transfer to Manchester City.\n\nBut the consequences of the result, which leaves out-of-sorts Tottenham reeling in 14th spot, will almost pale in comparison to the consequences of Frank being photographed pre-match holding a coffee cup with Arsenal’s badge on it, highlighting the almost comical levels of tribalism and animosity within English football.\n\nThe image went viral during the match, angering Spurs fans, many of whom had assumed it was AI-generated, such was their refusal to believe Frank would put himself in such a position.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/gauff-wary-of-young-aussie-star-as-united-cup-heats-up-20260108-p5nsko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gauff wary of young Aussie star as United Cup heats up",
        "publish_date": "Thu, 08 Jan 2026 11:54:42 +1100",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "World No.4 Coco Gauff reckons she will have her hands full even if she fronts up against Australian Maya Joint instead of six-time grand slam champion Iga Swiatek in the United Cup semi-finals.\n\nGauff helped lift the US into the final four with a singles and doubles win in Wednesday’s quarter-final against Greece in Perth.\n\nCoco Gauff of Team USA in action against Team Greece’s Maria Sakkari at RAC Arena on Wednesday. Credit: Janelle St Pierre/Getty Images\n\nThe two-time major winner beat Maria Sakkari 6-3 6-2 before teaming up with Christian Harrison for a thrilling 4-6 6-4 [10-8] victory over Stefanos Tsitsipas and Maria Sakkari, decided on a tense match tiebreak.\n\nThe defending champion US team will next face the winners of Friday’s quarter-final showdown between Poland and Australia in Sydney.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ten-ways-to-get-money-back-into-your-pocket/fohtyx66c",
        "title": "'Don't put your head in the sand': How to quickly improve your finances this year",
        "publish_date": "Wed, 7 Jan 2026 18:34:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Australians return from holidays and settle back into daily life, many are suffering from a post-Christmas financial hangover.\n\n\n\n\n\nOverspending during the holiday season is easy to do and can leave people feeling stressed and overwhelmed when they realise how much debt they have accumulated.\n\n\n\n\n\nBut financial adviser Helen Baker said it was important to take action straight away.\n\n\n\n\n\n\"If you just put your head in the sand, nothing will change and then you'll have more problems down the track,\" she said.\n\n\n\n\n\nTo set your finances on track, here are 10 ways to get money back into your pocket.\n\n\n\n1. Sell unwanted presents or other items around the house\n\nNot every present you receive at Christmas will be useful or something you like, and Baker said these items can be sold on places like Facebook Marketplace.\n\n\n\nYou don't have to keep every present you receive. Decluttering your home can also help boost your bank balance. Source: Getty / Cavan Images RF \"Use that money to clear credit cards or Buy Now Pay Later schemes,\" Baker said.\n\n\n\n\n\n\"Everyone wants to give ... but people don't [always] have room for more stuff, or it's not what they want.\"\n\n\n\n\n\nYou can also sell other items around your house that you no longer need, which gets rid of clutter and makes room for new things you may have received.\n\n\n\n2. Target your most costly debts\n\nIf you have racked up debt on your credit cards, Baker suggested paying off the debts with the highest interest rates first.\n\n\n\n\n\n\"Make sure you're paying something off everything, but try and get [down the debts with the highest rates] first,\" she said.\n\n\n\n\n\nShe said it was worth analysing your spending plan for the next month or so, to work out how much money you can put on these debts to clear them quickly.\n\n\n\n\n\n\"If your mortgage interest rate is 6 per cent but your credit card is 20 per cent ... you might want to try and use anything you've got in your offset account or your redraw to clear those other debts as quickly as possible,\" she said.\n\n\n\n3. Take advantage of 0 per cent balance transfers\n\nMany banks offer 0 per cent interest rate balance transfer deals to get customers to shift their credit card debt. They provide a period of months or even years without interest.\n\n\n\n\n\nBaker said these can be useful as long as you pay your debt off and don't keep adding to it.\n\n\n\n\n\n\"You've got to use this opportunity to clear that debt as quickly as possible,\" she said.\n\n\n\n\n\nYou can also ring your bank and ask to be put on a lower interest rate or move the debt to a card offering a better deal.\n\n\n\nInterest on credit card debt can be high, so it's important to pay them off quickly. Source: Getty / d3sign Converting the debt into a personal loan could be an option, as it will force you to pay it off over a set period and you won't be able to add to it.\n\n\n\n4. Reassess your mortgage or car loan\n\nWith further rate cuts unlikely in the foreseeable future , it is a good time to review your mortgage and consider refinancing options.\n\n\n\n\n\nAccording to the financial comparison site Canstar, the average owner-occupier variable rate in December was 5.51 per cent.\n\n\n\n\n\nIf you are paying more, or even just under this rate, you can ask your bank for a better deal or consider going elsewhere.\n\n\n\n\n\nIt may also be the right time to shift part of your mortgage to a fixed rate, with Canstar noting the number of banks offering fixed rates below 5 per cent had dropped amid expectations of rate increases this year.\n\n\n\nBut Canstar data insights director Sally Tindall said it was important to analyse the numbers carefully when fixing your rate and to shop around, as offers can vary widely.\n\n\n\n\n\nBaker said refinancing a mortgage or car loan could free up cash flow you can use to pay off other debts, such as credit card debt.\n\n\n\n\n\nIt may also make sense to consolidate all debts, so you have just one repayment and use any extra money to pay that back as quickly as possible. This may also save you on separate annual fees for each debt.\n\n\n\n\n\nBut discharging a mortgage can be costly and Baker said it was important to look at all the fees to make sure it is worth doing.\n\n\n\n5. Generate short-term income\n\nTo pay down debt more quickly, Baker said short-term ways to earn money could be considered, such as taking jobs advertised on Airtasker.\n\n\n\n\n\n\"It's not like you are going to be doing these jobs forever, [you're] just going to get rid of this 'hurt money' that's sitting around at the moment,\" she said.\n\n\n\nTaking on odd jobs such as dog walking can help you earn some quick income. Source: Getty / oatawa \"There's lots of needs out there at the moment — people are on holidays — they may need dogs walked or gardens looked after, some cleaning done or Ikea furniture put together, there's job opportunities out there.\"\n\n\n\n6. Review your subscriptions\n\nIt's easy to sign up for subscriptions — whether they are for streaming services like Netflix, fitness apps or media sites — and then forget about them.\n\n\n\n\n\nSBS finance editor Ricardo Goncalves suggests reviewing what you're actually paying for (looking through credit card statements can be a handy way to find forgotten charges) and then assessing whether you really use it.\n\n\n\n\n\nYou could also consider dropping down a subscription tier.\n\n\n\n\n\n\"Some providers have cheaper offers if you're willing to accept a bit of advertising,\" Goncalves said.\n\n\n\nREAD MORE This is what your frequent flyer points are really worth\n\nYou could also rotate subscriptions for streaming services so you are not paying for all of them at the same time. For example, you could watch shows on your Netflix account for three months, then pause your subscription and activate a different service for the next few months.\n\n\n\n\n\nTo save even more money, you can switch to free services like SBS On Demand instead.\n\n\n\n7. Use your reward points\n\nOne advantage of excessive Christmas and holiday shopping is that it can help boost reward points for loyalty schemes.\n\n\n\n\n\nCanstar notes that 100,000 Everyday Rewards or Flybuys points currently translates into $500 off your Woolworths or Coles shop.\n\n\n\n\n\nWhile it can be satisfying to see your balance increase, if you don't use your points, they could also lose value over time.\n\n\n\n8. Check for unclaimed money\n\nThe NSW government is holding around $300 million in unclaimed money, Goncalves said, and other states are also holding money owed to residents.\n\n\n\n\n\nThis money may be from businesses that have been unable to contact you because you’ve moved, changed your name, or they've lost your paperwork.\n\n\n\nTo check if you have unclaimed money, you can use the unclaimed money search on ASIC's Moneysmart website .\n\n\n\n\n\nYou can also check state databases on the relevant websites below:\n\n\n\n9. Slash your bills\n\nThe average family of four spending $260 a week on groceries can potentially save more than $2,000 a year by switching half of their weekly shop to cheaper brands at the supermarket, Canstar research has found.\n\n\n\n\n\nOther tips to save money on groceries include making a weekly meal plan so food doesn't go to waste, cooking from scratch rather than buying pre-packaged and processed foods, using recipes with few ingredients, and cooking larger batches so you can enjoy leftovers.\n\n\n\nMaking food from scratch and buying cheaper brands can save you money. Source: Getty / Tang Ming Tung Goncalves also suggests looking at your electricity bill to see if there are better deals available. The Australian government has its own comparison website called Energy Made Easy, which can help.\n\n\n\n\n\nFamily vouchers can also be a good way to save money.\n\n\n\n\n\nAll state governments offer vouchers to encourage participation in recreational activities, including sports, arts and cultural events. Most of these are aimed at children, but Tasmania also offers vouchers for older Australians.\n\n\n\n\n\nMany of these vouchers are renewed at the start of the new year. Information is available on the relevant websites below:\n\n\n\n\n\n10. Embrace freebies\n\nNowadays, libraries can offer access to a wide range of items, including toys and audiobooks, as well as digital movies, magazines, books and children's resources.\n\n\n\n\n\nThere are also tool libraries that allow you to borrow ladders, angle grinders, circular saws, as well as cleaning, garden, kitchen and camping equipment (although you may have to subscribe for some of these).\n\n\n\n\n\nIt's worth checking your local council's website to see what free programs it offers residents.\n\n\n\n\n\nSites like Facebook Marketplace or local buy/swap/sell pages also offer items for free.\n\n\n\n\n\nDisclaimer: The information in this article is general in nature and is not intended as financial advice. You should consult with a licensed professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/parkes-elvis-festival-returns-for-its-33rd-year/farvrvekp",
        "title": "Parkes Elvis Festival returns for its 33rd year",
        "publish_date": "Wed, 7 Jan 2026 09:04:42 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Parkes Elvis Festival returns for its 33rd year\n\nPublished 7 January 2026, 6:02 am\n\nThe Elvis Festival in New South Wales' central west is back and bigger than ever for its 33rd year. More than 25 thousand fans will descend on the town of Parkes for five days of music and dancing. Hundreds gathered in Sydney this morning for the pilgrimage aboard the Elvis Express",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-easing-inflation-enough-to-stop-a-february-interest-rate-rise/ju02kkej0",
        "title": "Is easing inflation enough to stop a February interest rate rise?",
        "publish_date": "Wed, 7 Jan 2026 06:48:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-is-diet-stacking-and-are-you-doing-it/2cvq1hg9r",
        "title": "What is diet stacking and are you doing it?",
        "publish_date": "Wed, 7 Jan 2026 06:12:58 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFrom clean eating to carnivore muffins - hint, there's no bread involved - to vegan meal prep, Fodmap diets and a hundred other ways of eating, the internet is awash with dietary advice.\n\n\n\n\n\nSome of it's good - from experts, people like doctors, scientists and accredited dietitians - but a lot of it comes from people who don't have any medical training at all.\n\n\n\n\n\nAnd that, say medical experts, is part of the reason an increasing number of people are now mixing up various diet plans at the same time in what has become known as 'diet stacking'.\n\n\n\n\n\n\"Diet stacking is essentially where we see someone accumulate diets or follow multiple diets at the same time. So for example, someone might be vegetarian, so they're following certain dietary restrictions related to being vegetarian. And then they also decide, for example, that they're having some gut symptoms and they try a diet to improve their gut symptoms. So they're basically layering two different diets at the same time.\"\n\n\n\n\n\nThat's Swinburne University dietetics expert Dr Caroline Tuck.\n\n\n\n\n\nShe is one of the authors of a review paper that's recently been published looking at the rising incidence of diet stacking.\n\n\n\n\n\nAnd it's proving to be a challenge for gastroenterologists and dietitians in managing chronic disorders.\n\n\n\n\n\nAnother co-author is Monash University’s Sarah Melton, who is also a dietician.\n\n\n\n\n\nShe says she is seeing a growing number of people in her work following multiple diet plans.\n\n\n\n\n\nMore commonly people will start a gluten and dairy free diet - sometimes without evidence of any intolerance to these foods and without considering whether these diets are even needed.\n\n\n\n\n\n\"Well gluten- and dairy-free can be demonised a little bit across multiple different health conditions or for health generally. So in my experience working with patients, I would see those two more commonly as the initial things that people may restrict just because someone else might've said to them they felt better not eating gluten or not consuming dairy.\"\n\n\n\n\n\nSarah Melton says new eating fads are always emerging, adding another layer to what has already become a complicated mix.\n\n\n\n\n\n\"I've seen the full spectrum. I suppose one of the dietary approaches that the approach itself, I guess, is eliminating so many diets that arguably it's in a way stacking multiple different dietary restrictions together is the carnivore diet. And this is certainly becoming popularised through social media and is very concerning to clinicians in terms of the things that we're excluding, the nutritional implications and your overall health. So if you're excluding all fibre from the diet, all fruits, vegetables, grains, that starts to become, obviously not nutritionally complete and has potential for increasing risk of other conditions.\"\n\n\n\n\n\nDr Caroline Tuck says unsupervised diet-stacking can precipitate discorded eating.\n\n\n\n\n\nIt could also lead to chronic conditions like heart disease, type 2 diabetes, certain cancers and poor mental health.\n\n\n\n\n\n\"They might start to be inadequate in different types of nutrients, such as if they've gone dairy free and they're not having enough calcium sources, for example. So it can be that sort of real nutrient inadequacy, but sometimes it can also then lead to mental health challenges because then they're worried about eating out with friends or they're not going to social occasions or they're going to social occasions but not eating and that can really impact your mental health. We know that food is so much more than just nourishment: it's a really important part of our everyday life and socialisation and family gatherings. \"\n\n\n\n\n\nAnother issue emerging is that medical professionals are finding it hard to diagnose intolerances because people may have already eliminated the suspect foods through diet stacking without medical supervision.\n\n\n\n\n\nThe most common elimination diet to diagnose intolerances is the FODMAP diet.\n\n\n\n\n\nMonash University defines FODMAPs as a group of sugars that are not completely digested or absorbed in our intestines.\n\n\n\n\n\nSome people, especially those with irritable bowel syndrome, have problems digesting these causing sensations of pain, discomfort and other symptoms.\n\n\n\n\n\nSarah Melton says people following multiple diets is making it difficult to diagnose some common conditions.\n\n\n\n\n\n\"Yeah, that's definitely something that's of concern to us. So this may be someone particularly with gastrointestinal symptoms seeks out a dietary intervention for that, of which there are many with very good evidence, and they may see a benefit in the institution of that diet that relieves some of their symptoms. But if they haven't had baseline screening to exclude organic drivers of symptoms or red flags, I guess that would warrant further investigation, there's that missed opportunity where a diagnosis may be missed.\"\n\n\n\n\n\nFor example a person who may have a family history of colon cancer and has noticed changes in their bowel habits may choose to avoid a colonoscopy, believing their diet is protecting them from the cancer and the need for screening.\n\n\n\n\n\nOr the opposite may occur - a young person with constipation as a result of a keto diet might be asked to have a colonoscopy that may not be needed.\n\n\n\n\n\nDr Daisy Coyle is a Research Fellow at The George Institute, and an accredited dietitian.\n\n\n\n\n\n\"You want to give yourself the best chance in life and following a healthy diet's one of the risk factors that we can control. But it doesn't mean that just because you have a healthy diet, you will never get, say, bowel cancer. Unfortunately, it doesn't work like that. It's going to give you the best chance of not getting bowel cancer, but there are other factors that of course come into play, but it doesn't replace getting that expert help, getting those diagnoses that you need like a colonoscopy or even for your skin. If we think about our skin, you can wear sunscreen, you can wear sunglasses, you can wear a hat, you can sit in the shade, you can do all the things that you're meant to do, but it doesn't mean that you don't need to ever get a skin check.”\n\n\n\n\n\nDr Coyle says a healthy diet is the opposite of being restrictive.\n\n\n\n\n\n\"We don't want to restrict anything. You want an abundance of food. That's the purpose of having a healthy diet. You want to be having a diet rich in lots of different sources of fruits, lots of different sources of vegetables, all different types of dairy, cheese, milk, yogurt, cottage cheese, different types of meat, eggs and chicken and fish and red meat and olive oil and nuts. You want to be providing your body and your gut microbiome with heaps of varieties so that you're giving yourself the best chance of getting great nutrient exposure, nutrient absorption, and really build up those probiotics and probiotics in your gut. And these diets really go against that and create this feeling of a healthy diet means it has to be restrictive in some way, and that's not the truth at all.\"\n\n\n\n\n\nScience is making great leaps in personalising nutrition for people, but Dr Caroline Tuck says we are not quite there yet.\n\n\n\n\n\n\"I know from a research perspective, we're hoping in the future that we can be more personalised in terms of looking at measures like your microbiome and the bacteria that lives in our gut. We know it's linked to a lot of things, but the research is not quite there for us to use that on a real personal level yet. But I think that's definitely what the research is driving towards and what we're hopeful for. But even now with what we do have, in a clinic situation, we're always trying to personalise recommendations and ensuring that any dietary changes are done safely.”\n\n\n\n\n\nDr Tuck says the first place to start for people concerned about eating is with a medical professional like a gastroenterologist or dietitian.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/latest-inflation-data-interest-rates/636ddo8pr",
        "title": "Why the latest inflation dip 'keeps alive' interest rate hike expectations",
        "publish_date": "Wed, 7 Jan 2026 04:24:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "A drop in Australia's headline inflation has not eliminated the possibility of a February interest rate hike, according to some economists.\n\n\n\n\n\nThe annual consumer price index (CPI) dipped from 3.8 to 3.4 per cent in November, according to Australian Bureau of Statistics data released on Wednesday.\n\n\n\n\n\nThat was lower than headline figure of 3.6 per cent economists had forecast.\n\n\n\n\n\nBut the RBA places greater emphasis on the trimmed mean or underlying measure of inflation, after removing volatile items, which remains too high.\n\n\n\n\n\nTrimmed mean inflation fell from 3.3 per cent to 3.2 per cent after rising 0.3 per cent month to month. The figure is above the RBA's two to three per cent target band, but is consistent with their November forecast.\n\n\n\n\n\nAlso key to RBA deliberations will be the December quarter inflation report, set for release on 28 January — days before the central bank's board is scheduled to meet on 2-3 February.\n\n\n\nAMP Chief Economist Shane Oliver says the RBA will be concerned by stickier items like the cost of building a new home, which is \"accelerating\".\n\n\n\n\n\n\"New dwelling inflation was up 2.8 per cent on a year ago, compared to 1.7 per cent in October on a year ago,\" he told SBS News.\n\n\n\n\n\n\"So that's still a red flag there with new dwelling construction prices, which are continuing to pick up pace, so that will concern the RBA.\"\n\n\n\n\n\nHe said that although market services didn't go up, they remained too high at around 3 per cent.\n\n\n\n'Still too high': What does this mean for interest rates?\n\nRichard Holden, Scientia Professor of Economics at UNSW Business School, said the inflation data showed the cost of items still went up, but the growth had slowed slightly.\n\n\n\n\n\n\"I think it's telling us that inflation is still too high,\" he told SBS News.\n\n\n\n\n\n\"The RBA are going to have to do something to get it under control. And today's figures don't change that.\"\n\n\n\n\n\nAsked whether this points to an interest rate hike, Holden said it remains on the cards.\n\n\n\n\"It certainly could, and a lot of economists are suggesting that rates will need to go up. So if you thought that they were going to go up before this number, I wouldn't change my mind,\" he said.\n\n\n\n\n\nOliver, relieved by the drop, predicts a hold but admits \"they're not great numbers\".\n\n\n\n\n\n\"They're still too high. The Reserve Bank will still be nervous. It keeps alive the prospect of a rate hike in February,\" Oliver said.\n\n\n\n\n\nHe said the December quarter CPI figures will be a better predictor for the RBA's February meeting.\n\n\n\nTreasurer Jim Chalmers welcomes the CPI data, which was better than economists predicted. Source: AAP / Lukas Coch Treasurer Jim Chalmers said while he understood Australians were still feeling the pinch of competing costs, the CPI results were \"very welcome and very encouraging\".\n\n\n\n\n\n\"We know that households are still under pressure and that’s why our responsible cost of living relief is so important,\" he said in a statement.\n\n\n\n\n\n\"Inflation remains much lower than we inherited from the Coalition but still higher than we would like.\"\n\n\n\n\n\nStephen Smith, partner at Deloitte Access Economics, highlighted that the new data comes with \"wide margins of error\".\n\n\n\n\n\nHe said the RBA should be \"careful and cautious, rather than impulsive\", arguing a cash rate increase would be \"premature\".\n\n\n\n\n\n\"If the RBA feels it has no choice to hike rates, then it is a sad indictment on the failure of policymakers to address the root causes through reform.\"\n\n\n\n\n\nThe Reserve Bank held the cash rate at 3.6 per cent following its board meeting in December.\n\n\n\n\n\nFollowing its decision, the central bank's governor Michele Bullock said it was unlikely there would be further interest rate cuts \"for the foreseeable future\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/property/news/billionaire-adrian-portelli-alleges-defects-in-fitout-of-39m-penthouse-20260108-p5nsio.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Adrian Portelli alleges defects in fitout of $39m penthouse",
        "publish_date": "Thu, 08 Jan 2026 13:12:49 +1100",
        "category": "finance",
        "authors": [
            "Elizabeth Redman"
        ],
        "text": "Billionaire businessman Adrian Portelli’s grand penthouse apartment dreams have turned to a nightmare, as a new video alleges a string of defects in the luxury fitout.\n\nWater leaks, cracked benchtops and missing water stops appear in the video, in which Portelli invites a building inspector to look for faults in the oversized Melbourne residence he bought for $39 million in 2023.\n\nZeher Khalil of Site Inspections with billionaire Adrian Portelli. Credit: YouTube - Site Inspections\n\nThe penthouse crowns the Sapphire by the Gardens development in the CBD, a luxurious twin tower project with residences and a hotel. Portelli speaks in the video about how he intended his purchase to be an investment and loves the sweeping city views and easy access via a sky bridge to the hotel’s hospitality offering.\n\nHe intends to use it to host parties or as a guest home for visiting business contacts, and embarked upon a glamorous customised fitout with a double-height ceiling in the living area, an oversized kitchen island bench and an elevated indoor swimming pool. He also made headlines for craning in a McLaren racing car which sits on a podium in the apartment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/she-ll-be-kicking-him-home-for-us-buchanan-eyeing-fairytale-win-to-honour-tragic-jockey-20260108-p5nsj2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘She’ll be kicking him home for us’: Buchanan eyeing fairytale win to honour tragic jockey",
        "publish_date": "Thu, 08 Jan 2026 13:11:12 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "Local trainer Kristen Buchanan had hoped to have apprentice Bronte Simpson back aboard her favourite horse, Stylebender, at Wyong’s biggest race day on Saturday.\n\nNow, a devastated Buchanan is sure Simpson will be “kicking him home for us” in the race named in honour of the former Wyong-based rider, who died in a car crash on December 22.\n\nApprentice Bronte Simpson and trainer Kristen Buchanan after Stylebender gave Simpson her first winner, at Muswellbrook in May 2025. Credit: Muswellbrook Race Club\n\nThe Ballarat-raised 24-year-old, who moved north to join Tamworth trainer Jane Clement this season, was driving alone when her vehicle hit a tree at Mendooran, north-west of Dubbo.\n\nThe tragedy rocked the racing community, especially at Wyong, where Simpson started her riding career under Sara Ryan and with the support of other trainers like Buchanan.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/the-parlour-amaro-bar-20260108-p5nsla.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Parlour Amaro Bar",
        "publish_date": "Thu, 08 Jan 2026 13:05:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Add articles to your saved list and come back to them anytime.\n\nDuring the pandemic, Provenance chef Michael Ryan turned his attention to another curiosity: amari – the herbal elixirs and one-time medicines of ancient Italy. Produced with the same clarity that defines his food, Ryan’s amari make delicious appearances on Provenance’s drinks list – but they find full expression one floor up at its companion bar, the Parlour Amaro Bar. That’s where you’ll find him after dessert – one hand dropping the needle on an early Tom Waits record, the other mixing a thinking person’s negroni.\n\nWant to visit this venue? Save it in the Good Food app.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/cartoons-of-the-week-20260102-p5nrao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cartoons of the week",
        "publish_date": "Thu, 08 Jan 2026 12:55:23 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this gallery for later\n\nAdd galleries to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/larvotto-adds-fresh-gold-antimony-firepower-to-nsw-project-20260108-p5nsl6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Larvotto adds fresh gold-antimony firepower to NSW project",
        "publish_date": "Thu, 08 Jan 2026 12:48:33 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Larvotto adds fresh gold-antimony firepower to NSW project Brought to you by BULLS N’ BEARS Rowena Duckworth January 8, 2026 — 12:48pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nLarvotto Resources has again underlined the growth potential of its Hillgrove antimony-gold project in New South Wales after diamond drilling at the company’s Clarks Gully prospect returned further high-grade mineralisation at depth, along strike and to the north - with a dash of tungsten for good measure. The company drilled three near-mine exploration holes at the target during October and November 2025, completing more than 500 metres of drilling. The program was designed to test the depth and strike extensions of known antimony-gold mineralisation, with a focus on potential splays and parallel lodes. The program was also used to validate geophysical targets identified in earlier surveys. Standout intercepts included 6.4 metres at a hefty 12.92 grams per tonne (g/t) gold equivalent from 208m, with 4.1 metres of that interval grading an eye-catching 19.76g/t gold equivalent. That hole intersected what the company believes could be a new parallel lode in the footwall of the main Clarks Gully structure, pointing to additional near-mine growth potential and warranting further follow-up drilling. ‘The results from Clarks Gully have strengthened our understanding of the mineralised system.’ Larvotto Resources managing director Ron Heeks\n\nAdvertisement\n\nAnother hole returned 8m going 8.35g/t gold equivalent from 160m, including a blistering 1.6-metre slice running at 22.81g/t gold equivalent from 160.4m. The second drill hole targeted an untested resistivity anomaly in the northern part of the Clarks Gully system, with results confirming mineralisation directly associated with the geophysical response. Notably, Larvotto says the newly identified zone remains open, highlighting further upside. Drilling at Larvotto Resources’ Hillgrove project, just west of Armidale in NSW. Beyond gold and antimony, drilling also delivered encouraging tungsten results associated with the antimony-gold lodes. Notable intercepts included 0.4m grading 2.97 per cent tungsten from 192.4m and 2.4m running at 1.53 per cent tungsten trioxide from 60.9m. Hillgrove already hosts a tungsten resource of 4774 tonnes of contained tungsten at a grade of 0.05 per cent, predominantly within the Freehold and Brackins Spur prospects, both of which remain open for expansion.\n\nAdvertisement\n\nLarvotto Resources managing director Ron Heeks said: “The results from Clarks Gully have strengthened our understanding of the mineralised system, confirming both the continuity of antimony and gold mineralisation to the north and high-grade zones at depth.” Larvotto says the drilling and geological data collected have significantly improved its understanding of the controls on mineralisation and reinforced the system’s potential to grow both north and south along strike. Further drilling at Clarks Gully is planned in 2026. The company currently has four diamond drill rigs operating across the Hillgrove project, with active programs underway at its Metz and Freehold prospects. At Metz, drilling is focused on defining the convergence of the Blacklode and Syndicate structures, testing extensions beneath historic workings and chasing multiple stacked, high-grade zones near existing underground infrastructure. At Freehold, drilling continues to probe historic workings and extensions to known mineralised structures, with additional testing planned at the company’s Smiths, Freehold East and Swamp Creek prospects. Meanwhile, Larvotto’s march towards production continues at pace.\n\nAdvertisement\n\nConstruction of its 525,000-tonne-per-annum processing plant is well advanced, with first gold and antimony pours slated for the second quarter of this year. The build is fully funded through a US$105 (A$158) million senior secured bond and a fresh A$60 million equity raise, locking in the A$140 million capital bill. The company also recently locked in MACA-Interquip-Mintrex to refurbish and expand the plant and appointed underground mining specialist PYBAR under a four-year development contract. Hillgrove’s proximity to Armidale, just over an hour by sealed road, gives Larvotto a clear logistical and cost advantage. The regional centre offers an established workforce, accommodation, services and transport links. Meanwhile, existing road access, power and communications infrastructure have helped reduce capital spend, streamline construction and allow mine equipment to roll in quickly as the project moves into production. With expected annual production of 40,500 ounces of gold, 4878 tonnes of antimony and a scheelite concentrate kicker, Larvotto looks to be positioning Hillgrove as one of the Western world’s rare multi-commodity critical metals producers - just months from first pour. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-off-to-a-slow-start-as-gold-oil-prices-fall-wall-street-drifts-20260108-p5nshf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX treads water after Wall Street drifts; BlueScope, Ansell, James Hardie fall",
        "publish_date": "Thu, 08 Jan 2026 12:18:56 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "Advertisement\n\nBusinessMarketsSharemarket ASX treads water after Wall Street drifts; BlueScope, Ansell, James Hardie fall Staff writers Updated January 8, 2026 — 12:18pm ,first published January 8, 2026 — 8:44am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe Australian sharemarket continued its lacklustre performance into lunchtime after US stocks wavered overnight as traders digested mixed economic data and took stock of shifting geopolitical risks amid a flurry of social media posts from President Donald Trump. The S&P/ASX 200 inched up 11.70 points, or 0.1 per cent, to 8707.30 at 12.01pm AEDT. Gains by tech stocks held the bourse in the green, while miners wobbled. The flattish trade comes after the market eked out a small gain in the previous session, continuing its sluggish start to the new year, with the S&P/ASX 200 edging up 0.2 per cent. The Australian dollar was trading at US67.24¢. Wall Street lacked direction overnight, prompting meagre gains on the local bourse this morning. Bloomberg The bourse didn’t take any more direction from the balance of trade for November. Australia’s trade surplus narrowed to $2.94 billion, down from a revised $4.35 billion in October after a fall in iron ore exports, the Australian Bureau of Statistics said. Tech stocks tracked overnight gains by the US tech giants, which benefited as this week’s Consumer Electronics Show in Las Vegas boosts optimism about the sector. WiseTech Global, Australia’s biggest tech stock, was up 2.8 per cent. Fellow software makers Xero and Technology One rose 2 per cent and 1.5 per cent, respectively. Data centre operator Next DC rose 1 per cent and family tracking app Life360 climbed 2.4 per cent.\n\nAdvertisement\n\nRelated Article Mergers & acquisitions BlueScope Steel knocks back Stokes-led $13 billion takeover bid The big four banks were mixed. Commonwealth Bank, the biggest stock on the local market, slipped 0.2 per cent and ANZ Bank edged down 0.1 per cent, while Westpac (up 0.8 per cent) and National Australia Bank (up 0.5 per cent) saw modest gains. The mining sector’s losses widened after the balance of trade figures. BHP and Fortescue Metals gave up early gains and were down 0.3 per cent and 0.1 per cent. Gold miners Northern Star (down 2.4 per cent) and Evolution Mining (down 0.6 per cent) declined and silver miner South32 shed 0.9 per cent after gold and silver prices softened overnight. BlueScope Steel lost 1.2 per cent to $29.50 after the nation’s largest steelmaker knocked back a $13 billion takeover bid by Kerry Stokes’ industrial group SGH and US steel giant Steel Dynamics last night, dismissing their $30-per-share offer as “an attempt to take BlueScope from its shareholders on the cheap”. Ansell shares plunged 5 per cent after the rubber gloves maker said its chief executive Neil Salmon will retire after 13 years with the company. He will be replaced next month by Finnish executive Nathalie Ahlström.\n\nAdvertisement\n\nJames Hardie slumped 3.8 per cent, mirroring sharp losses by US homebuilders after Trump suggested moves to prevent large institutional investors from buying single-family homes to make it more affordable for people to buy houses. The potential removal of some buyers for homes weighed on the Australian building products maker as it makes three quarters of its sales in the US. On Wall Street overnight, optimism faded after the US president’s latest flurry of social media posts sent homebuilders and defence contractors tumbling. Valero Energy led shares of refiners higher after Trump said Venezuela would turn over millions of barrels of oil to the US. The S&P 500 Index slid 0.4 per cent after notching its second intraday record of 2026, while the Nasdaq 100 edged up 0.2 per cent. The Dow Jones Industrial Average dropped 0.9 per cent from its own record set the day before. Northrop Grumman slid 5.5 per cent and Lockheed Martin lost 4.8 per cent after Trump said he would not permit dividends or stock buybacks for defence companies until they fix problems with the production of military equipment. He didn’t mention specific companies. Meanwhile, tech stocks continued their gains. Nvidia and Microsoft rose about 1 per cent each, and Alphabet rose more than 2 per cent as investors shifted back into AI stocks following recent worries they were overvalued.\n\nAdvertisement\n\n“Investors have come into 2026 with a similar playbook to last year: Buy tech and forget about it. Rumours that the AI trade was done turned out not to be true,” said Jake Dollarhide, chief executive officer of Longbow Asset Management in Tulsa, Oklahoma. Moves across the rest of the US sharemarket were mostly quiet, including for Warner Bros Discovery after it again rejected a buyout bid from Paramount and told its shareholders to stick with a rival offer from Netflix. Warner Bros rose 0.3 per cent, while Paramount Skydance fell 0.9 per cent and Netflix added 0.1 per cent. In the oil market, crude prices fell after Trump said that Venezuela would provide 30 million to 50 million barrels of oil to the United States. A barrel of benchmark US crude dropped 2 per cent to $US55.99. Brent crude, the international standard, fell a more modest 1.2 per cent to settle at $US59.96 per barrel. Any additional oil flowing from Venezuela into the global system would push down on crude prices by increasing their supplies. Prices for oil have swung this week following Trump’s weekend ouster of the president of Venezuela, which is likely sitting on some of the largest deposits of oil in the world.\n\nAdvertisement\n\nOil prices had already fallen back to where they were in 2021, before Trump’s move against Venezuela, because of expectations of plentiful supplies. To pull much more oil from Venezuela’s ground would likely require big investments to improve ageing infrastructure. Related Article Exclusive\n\nAI From dishwasher to world’s ninth-richest man: Nvidia boss faces his future In the bond market, Treasury yields swung following several mixed reports on the US economy. One of the most impactful said that growth for US retailers, finance companies and other businesses in the services sectors accelerated by more last month than economists expected. Separate reports on the US job market offered a mixed view. One said that employers cut back on the number of job openings they were advertising, while a second suggested that employers outside of the government added 41,000 more jobs last month than they cut. A much more comprehensive look at the health of the US job market will arrive on Friday. The yield on the 10-year Treasury fell to 4.13 per cent from 4.18 per cent late on Tuesday following Wednesday’s economic reports. But the two-year yield, which more closely tracks expectations for what the Fed will do, held steadier. It edged down to 3.46 per cent from 3.47 per cent from late Tuesday.\n\nAdvertisement\n\nThe hope on Wall Street is that the economy remains solid enough to avoid a recession but not so strong that it keeps the Fed from cutting interest rates. The Fed cut its main interest rate three times last year to shore up the slowing job market, but it’s indicated fewer cuts may be ahead because inflation remains high. Traders are betting on a less than 12 per cent chance that the Fed will cut interest rates at its next meeting later this month. That’s down slightly from the day before, according to data from CME Group. In stock markets abroad, indexes were mixed among some sharp moves across Europe and Asia. with AP and Bloomberg\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Sharemarket\n\nWall Street\n\nShares\n\nBonds",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/aussie-actress-teagan-croft-to-star-in-live-action-tangled-film-20260108-p5nsjy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aussie actress Teagan Croft to star in live-action Tangled film",
        "publish_date": "Thu, 08 Jan 2026 12:18:14 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/england-fume-as-drs-robs-them-of-wicket-20260108-p5nsku.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "England fume as DRS robs them of wicket",
        "publish_date": "Thu, 08 Jan 2026 12:15:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw-ambulances-steve-vaughan-gives-heatwave-warning-20260108-p5nskt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NSW Ambulance's Steve Vaughan gives heatwave warning",
        "publish_date": "Thu, 08 Jan 2026 12:14:07 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/drinking-with-the-enemy-the-espresso-cup-blunder-that-enraged-tottenham-fans-20260108-p5nsjx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drinking with the enemy: The espresso cup blunder that enraged Tottenham fans",
        "publish_date": "Thu, 08 Jan 2026 11:54:42 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Tottenham Hotspur boss Thomas Frank has come under fire for drinking out of an espresso cup featuring the logo of the club’s arch-rivals Arsenal as his side slumped to their eighth defeat of the Premier League season away to Bournemouth on Thursday morning (AEDT).\n\nAntoine Semenyo scored in the 95th minute to consign Spurs to a 3-2 loss, netting a double in what is likely to be his final appearance for Bournemouth ahead of a likely transfer to Manchester City.\n\nBut the consequences of the result, which leaves out-of-sorts Tottenham reeling in 14th spot, will almost pale in comparison to the consequences of Frank being photographed pre-match holding a coffee cup with Arsenal’s badge on it, highlighting the almost comical levels of tribalism and animosity within English football.\n\nThe image went viral during the match, angering Spurs fans, many of whom had assumed it was AI-generated, such was their refusal to believe Frank would put himself in such a position.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/gauff-wary-of-young-aussie-star-as-united-cup-heats-up-20260108-p5nsko.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gauff wary of young Aussie star as United Cup heats up",
        "publish_date": "Thu, 08 Jan 2026 11:54:42 +1100",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "World No.4 Coco Gauff reckons she will have her hands full even if she fronts up against Australian Maya Joint instead of six-time grand slam champion Iga Swiatek in the United Cup semi-finals.\n\nGauff helped lift the US into the final four with a singles and doubles win in Wednesday’s quarter-final against Greece in Perth.\n\nCoco Gauff of Team USA in action against Team Greece’s Maria Sakkari at RAC Arena on Wednesday. Credit: Janelle St Pierre/Getty Images\n\nThe two-time major winner beat Maria Sakkari 6-3 6-2 before teaming up with Christian Harrison for a thrilling 4-6 6-4 [10-8] victory over Stefanos Tsitsipas and Maria Sakkari, decided on a tense match tiebreak.\n\nThe defending champion US team will next face the winners of Friday’s quarter-final showdown between Poland and Australia in Sydney.",
        "source": "TheAge"
    }
]