[
  {
    "url": "https://www.9news.com.au/national/bondi-beach-shooting-nsw-premier-chris-minns-flags-gun-law-reforms/785f8c4b-9ea3-40fd-8643-fd84b45c4b85",
    "title": "NSW Premier considering gun control reforms",
    "publish_date": "Mon, 15 Dec 2025 00:41:37 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "If you have been impacted by the terror attack in Bondi there is support available.\n\nTo contact Lifeline Australia, call 13 11 14 or text 0477 13 11 14. For people under 25 years old, you can contact Kids Helpline at 1800 55 1800. Both of these are available on a 24/7 basis. If you wish to donate blood, you can find your nearest donor centre\n\nhere",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/bondi-beach-shooting-how-to-help-where-to-donate-explainer/0e6b1ca5-4b47-4144-a752-7b354ccf959a",
    "title": "How to donate blood and find your nearest donor centre",
    "publish_date": "Sun, 14 Dec 2025 23:58:13 +0000",
    "category": "lifestyle",
    "authors": [
      "Dec"
    ],
    "text": "﻿In the aftermath, New South Wales Premier Chris Minns has called on Australians to help out in any way they can: \"If you are looking for something do, you could give blood.\"\n\nHere is how you can donate blood, and where to find your nearest donor centre.\n\n﻿How to donate blood\n\nYou can donate either blood, plasma, or platelets﻿.\n\nTo donate, you can visit your nearest Lifeblood donor centre .\n\n﻿Before doing this, you must check whether you are eligible to do so.\n\nOnce you have checked your ﻿eligibility, you can find your nearest donor centre and book an appointment.\n\nTo donate blood, it takes around 10 minutes to donate with an appointment time of an hour.\n\nREAD MORE: Rabbi identified as victim of Bondi Beach shooting attack\n\nThere are several eligibility criteria that must be met before you donate blood. (Nikki Short)\n\nDonating plasma takes around 45 minutes with a total appointment time of 90 minutes, whilst donating platelets takes around an hour, with a total appointment time of two hours.﻿\n\nOnce you have checked your ﻿eligibility, you can find your nearest donor centre and book an appointment.\n\nTo donate blood, it takes around 10 minutes to donate with an appointment time of an hour.\n\nDonating plasma takes around 45 minutes with a total appointment time of one and a half hours, whilst donating platelets takes around an hour, with a total appointment time of two hours.﻿\n\nHow to find if I am eligible to donate blood\n\n﻿If you have recently had the COVID-19 vaccine, you must wait three days before you can donate blood.\n\n﻿There are some restrictions on what you can donate based on your recent sexual activity.\n\nFor example, if you have had oral or anal sex with a man in the last three months, you can only donate plasma.\n\nREAD MORE: What we know about the two Bondi Beach gunmen\n\nThere are many Lifeblood donor centres across the country. (Lifeblood)\n\nIf you are a sex worker or have had sex with a sex worker in the last three months, you are also only able to donate plasma, and not blood or platelets.\n\nIf you have had sexual activity in the last three months with someone who has had ﻿HIV, hepatitis B, hepatitis C or human T-lymphotropic virus (HTLV) infection, you cannot donate plasma, blood or platelets.\n\nYour eligibility will also be impacted based on your recent travel history﻿.\n\nWhere to donate blood; list of donation centres\n\nThere are donation centres across Sydney and New South Wales.\n\n﻿You can find your nearest donor centre here .\n\nSydney turns out to donate blood\n\nImages are emerging this morning of large lines outside blood donation centres across Sydney.\n\nSydneysiders are urged to go their nearest blood donation clinic to donate blood. (Siena Fagan)\n\n﻿\"We are taking as much as we can,\" said Edgar Parica, donor centre manager at Australian Red Cross Lifeblood at Town Hall told The Sydney Morning Herald .\n\nPeople are encouraged to call ﻿13 14 95 to book an appointment, or to rock up to their nearest donor centre.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/premature-baby-charlie-jones-queenslands-smallest-newborn-just-360g/cd61fc3b-11a4-436c-8a7f-ff2c4aa7f3df",
    "title": "Tiny newborn Charlie breaks record as Queensland's smallest baby",
    "publish_date": "Sun, 14 Dec 2025 05:36:39 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "His minuscule weight is barely one-tenth of the average baby boy and is believed to be the state's\n\ntiniest newborn\n\n– breaking the record once held by the famous \"Coke can kid\", Jonathon Heeley,\n\nwho weighed 400 grams when he was born in 1992.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/nfl-quick-hits-patrick-mahomes-tears-his-acl/106143906",
    "title": "Five quick hits: Grandpa throws a touchdown, as Chiefs star tears his ACL",
    "publish_date": "Mon, 15 Dec 2025 02:04:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "There are just three weeks of action left in the regular NFL season, and while the perennially in contention Chiefs have been knocked out already, another contender suffered a major blow to its defence.\n\nHere are the five quick hits from the week 15 action.\n\n1. Mahomes tears his ACL as Kansas City's season ends\n\nPatrick Mahomes tore the ACL in his left knee while trying to keep the Kansas City Chiefs's post-season hopes alive in the waning seconds of a 16-13 loss to the Los Angeles Chargers, and the team said the star quarterback was considering surgical options.\n\nIt's the most significant injury of a superlative nine-year career for Mahomes, a two-time MVP who has led the Chiefs to three Super Bowl titles and reached the AFC championship game in each of his seven previous seasons as Kansas City's starter.\n\nThis year, the Chiefs won't even make the playoffs, and Mahomes won't be back on the field until sometime in 2026.\n\nThe Chiefs had just crossed midfield with less than two minutes to go when Mahomes scrambled toward the Kansas City sideline, then tried to get rid of the ball. He was spun to the ground upon release by Chargers defensive lineman Da'Shawn Hand, and he immediately grabbed at his left knee while trainers converged on him.\n\nMahomes was eventually helped to the blue injury tent on the sideline, but he only stayed there for a few moments. He soon emerged with staff members on either side of him, limping toward the locker room with a white towel draped over his head.\n\n\"He will get an MRI tomorrow or this evening,\" coach Andy Reid said.\n\n\"Whenever we can.\"\n\n2. Packers star Parsons hurts his knee as Green Bay suffers costly loss\n\nGreen Bay Packers pass rushing star Micah Parsons was helped off the field after injuring his left knee on a non-contact play late in the third quarter against Denver.\n\nHe was later ruled out of the game.\n\nParsons blew past right tackle Mike McGlinchey and was chasing after Broncos quarterback Bo Nix when he suddenly pulled up and fell to the ground. He clutched his knee as trainers and teammates came over to check on him.\n\nIt was the second significant injury for the Packers, who lost receiver Christian Watson to a chest injury.\n\nParsons was having a big game. He forced an early fumble and was credited with a pass break-up.\n\nWithout their star defender, the Packers went down 34-26 in a loss that could have major playoff ramifications.\n\n3. Old man Rivers throws a touchdown as students watch on\n\nMuch was made of the return of 44-year-old father of 10 and grandfather of one Philip Rivers to the NFL this week, and the old man almost pulled off a miracle for the Colts.\n\nRivers, who came out of retirement and signed to the Colts last week after a string of injuries to the team's quarterbacks, threw a touchdown as Indianapolis lost 18-16 to the Seahawks thanks to a last minute record-breaking field goal by Jason Myers.\n\nRivers only threw for 120 yards and did toss an interception in a moment of desperation late in the game, but he showed enough that he should be able to keep the starting position until his injured teammates return.\n\nThe former Chargers legend now coaches at a high school, with vision showing his students getting up and about after their coach threw the TD against one of the best defences in the league.\n\n4. Trump's coin toss goes viral during Army-Navy game\n\nStill on American Football but away from the NFL, US President Donald Trump went viral with a bizarre attempt at a coin toss before a Navy and Army game.\n\nThe 79-year-old was handed the coin to decide which team would receive the ball, and then proceeded to loft the coin into the air, rather than the more — traditional — flick of the coin.\n\n\"President Trump's coin toss will go down in the history books,\" Barstool Sports wrote on X, with the video seen more than 4 million times.\n\nNavy went on to beat Army 17-16 in a tight clash.\n\n5. Commanders end their losing streak, hand one to the Giants\n\nMarcus Mariota emerged from the Washington Commanders's first victory celebration since October 5 with a sense of relief.\n\nBeating the New York Giants 29-21 ended their season-derailing skid at eight games.\n\n\"There's nothing like a winning locker room,\" Mariota said.\n\n\"It's hard to go two months without winning a football game.\"\n\nNow their opponent is stuck with that feeling. The Giants (2-12), who lost their eighth in a row, have not won since October 9.\n\nThe only NFL game this week with no playoff implications had a far bigger bearing on draft positioning.\n\nThe Giants in defeat moved a step closer to the top pick, a last-place finish in the NFC East and potentially front-office changes, with a coaching search already coming.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/dolphin-sands-fire-caused-by-a-landowner-burning-off/106143708",
    "title": "Bushfire catastrophe caused by burn-off not extinguished properly",
    "publish_date": "Mon, 15 Dec 2025 01:08:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "A bushfire in Tasmania that destroyed 19 homes was caused by a registered burn conducted about a week prior, which was not extinguished properly, authorities have confirmed.\n\n\"Unfortunately, the landowner chose to cover the fire with sand, which has contained the heat in the ground and the uplift in wind has caused embers to come out of that,\" Tasmania Fire Service (TFS) deputy chief officer Matt Lowe said today.\n\nLisa and Mick Verrier's shack was destroyed in the bushfire. (Supplied: Lisa and Mick Verrier)\n\nThe bushfire was first reported on December 4, with many residents evacuated for days before they were allowed to return.\n\nA total of 33 houses were damaged, including 19 destroyed.\n\nPowerline infrastructure was also destroyed in the blaze. (ABC News: Morgan Timms)\n\nAuthorities said 122 other assets, including sheds, caravans, water tanks, garages and electrical poles, were damaged.\n\nMr Lowe said anyone conducting a burn or using a campfire had to put it out properly.\n\n\"You never cover it with sand. You need to cool it with water, rake the coals out and monitor it until it's fully extinguished,\" he said.\n\nThe Tasmania Fire Service also announced the state's fire permit period will start on Tuesday, with those conducting burns required to apply for a free permit online or by phone on 1800 000 699.\n\nApplicants are then contacted by a permit officer with advice on how to conduct a safe burn.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/matildas-star-sam-kerr-impresses-again-for-chelsea-in-wsl/106143024",
    "title": "Kerr starts as sub again before starring for Chelsea in WSL victory",
    "publish_date": "Sun, 14 Dec 2025 22:52:12 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sam Kerr has shown it's time for her to be restored to her customary starting role as Chelsea's top striker as she came off the bench to dominate Brighton and help the English champions to a 3-0 win away.\n\nIt's now two years since the Matildas great started a Women's Super League (WSL) match for the Blues after she was left to warm the bench again by Chelsea boss Sonia Bompastor.\n\nBut the way she helped reinvigorate Chelsea in the second half at Brighton's Broadfield Stadium demonstrated that Bompastor must surely employ the 32-year-old more after the winter break if they're to win the league for the seventh successive season.\n\nThey go into the break six points adrift of leaders Manchester City, who beat Aston Villa 6-1 with four goals from Jamaican star Khadija Shaw.\n\nWithout Kerr on the field, the stuttering champs again looked toothless up front in the first 45 minutes, with only a remarkable solo run and shot from French fullback Sandy Baltimore just before the break giving them a half-time lead.\n\nOnce Kerr and Wieke Kaptein had been brought on for the second half, though, Chelsea looked like a different team up front, with the Matildas star bringing more of a robust physical presence and directness than Aggie Beever-Jones.\n\nThe only frustration for Kerr once again was that she didn't end up on the scoresheet herself, having had one rasping shot and a superb diving header kept out by Brighton's busy keeper Sophie Baggaley.\n\nKerr's now scored just four goals in 16 matches for club and country since her comeback in September from the ACL injury that kept her out for so long. In 11 of those matches, though, Kerr has been a substitute.\n\nElsewhere in the WSL, West Ham's Australian captain Katrina Gorry was left ruing a missed late chance, which could have given her side victory in the foot-of-the-table clash against Liverpool. It ended 2-2 with Liverpool still bottom on three points and the Hammers a place above on five.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/wa-wettest-towns-drinking-water-carting/106120700",
    "title": "The state government has trucked water to WA's wettest towns for 15 years",
    "publish_date": "Sun, 14 Dec 2025 22:32:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "The state government has trucked water to two of Western Australia's wettest towns day in, day out for the past 15 years at a cost of at least $4 million — so far.\n\nQuinninup and Northcliffe, 350 kilometres south of Perth, receive an average of 1 metre of rain a year.\n\nHowever, the towns' water schemes are exclusively supplied by contractors trucking in potable water from neighbouring towns Pemberton or Manjimup, 50km away.\n\nMary Williams often counts the water trucks passing by her old mill cottage in the hamlet of Quinninup, where she has lived for 25 years.\n\n\"It must be costing them a fortune,\" Ms Williams said.\n\nHer record was a dozen in a single summer's day, but she wonders how many more will come.\n\n\"How many more trucks are they going to keep running?\" she asked.\n\n\"Is it going to be eventually that we're going to have trucks nose-to-tail just to keep water in the community?\"\n\nMary Williams says a better solution to water carting needs to be found. (ABC South West WA: Jon Daly)\n\n'Cost-effective' water solution\n\nThe Cook government insists it is the most practical solution for the small towns with a combined population of about 450 people.\n\n\"Current demand and population forecasts for these towns remain modest, and there has been no change that would warrant moving away from carting as the most efficient supply method,\" a spokesperson said.\n\n\"Over the past decade, average annual carting costs have been approximately $200,000 per scheme, ensuring a cost-effective and dependable service.\"\n\nMary Williams says her town needs a long-term water solution. (ABC South West WA: Jon Daly)\n\nThe trucks offer little comfort to residents during the summer, when visitor numbers swell and bushfire risk intensifies.\n\nMs Williams fears it was inevitable that a fire would sweep through Quinninup, with residents having few household means of defending their homes.\n\n\"There is no such thing as stay and defend. We get out,\" she said.\n\nNot a drop to drink\n\nBoth towns once had their own local sources of drinking water, but these were defunct due to quality concerns.\n\nKarri Lake is a 56-gigalitre dam in Quinninup, which also has a mothballed water treatment plant a few hundred metres from the town.\n\nThe lake was proclaimed a drinking water source in the early 2000s, but was reverted to a recreational dam in 2009 by the state-owned water agency, the Water Corporation.\n\nQuinninup's Karri Lake is no longer a drinking water source because of water quality concerns. (ABC South West WA: Jon Daly)\n\nIt came to view the lake as a \"risky\" drinking water source due to nearby residential septic systems.\n\nIt is a familiar story at Northcliffe, where town water was once drawn from a spring-fed dam on Michael Armstrong's family farm to the east of town.\n\nMichael Armstrong says it is \"stupidity\" that water is carted into the wettest towns in the state. (ABC South West WA: Jon Daly)\n\n\"It was a gentleman's agreement with my grandmother, my father and then me,\" Mr Armstrong said.\n\nMr Armstrong said the deal ended in 2010 when the then-Department of Water decided the source needed to be better protected from contamination.\n\n\"They were talking about limiting my future growth and also planting trees on a considerable area of my land that ran into that source,\" he said.\n\nThose decisions coincided with a shift in national drinking water quality guidelines, prioritising proactive protection of water sources.\n\nThe Water Corporation stopped using Northcliffe's local water source in 2010 and has trucked in water since. (ABC South West WA: Jon Daly)\n\nIn 2013, Water Corporation chief operating officer Peter Moore told a parliamentary standing committee that guidelines had shifted to more proactive measures to protect water sources.\n\nHe said that explained why Northcliffe's water source was abandoned.\n\n\"They have gone to looking not so much on just testing and analysing but looking to numbers of barriers you have in place as protections,\" Mr Moore said.\n\n\"So, you are restructuring your whole scheme based on barriers.\n\n\"Source protection was the first barrier, treatment is the second barrier and so on and so forth.\"\n\nNorthcliffe is WA's wettest town, receiving more than a metre of rain each year. (ABC South West WA: Jon Daly)\n\nDaily water carting has been viewed as the most economical option ever since.\n\n\"It's stupidity,\" Mr Armstrong said.\n\n\"We're the wettest town in the state, and we're getting water carted in from out of town.\"\n\nWater trucks and a drying climate\n\nWater Corporation's 2015 Water Forever: South West report identified several alternatives, including water pipelines from Pemberton, a new surface water dam at Northcliffe and a micro-desalination plant at Windy Harbour.\n\nA Water Corporation spokesperson said none of the alternatives were viable.\n\n\"Groundwater investigations identified low-yield aquifers and quality risks. A new dam is not feasible due to constrained land availability and environmental constraints,\" the spokesperson said.\n\nThose options were also considered too costly, given the modest water needs of Quinninup and Northcliffe, which have the lowest scheme water demand in the South West region.\n\nThe pipeline, for instance, was estimated to cost a combined $61 million.\n\nDon Punch says the cost of water infrastructure for Northcliffe and Quinninup is \"huge\" and that makes carting viable. (ABC Goldfields: Jarrod Lucas)\n\nLast month, WA Water Minister Don Punch told the ABC the cost of building infrastructure for towns like Northcliffe was huge, making water carting a \"viable option\".\n\n\"That's not ideal but it's a solution that applies to that community at this point in time,\" Mr Punch said.\n\nThe South West towns of Quinninup and Northcliffe have had drinking water carted in for the past 15 years. (ABC South West WA: Jon Daly)\n\nMany residents question whether millions of taxpayer dollars spent on carting water would have been better invested in a permanent fix long ago.\n\n\"It doesn't take long for that four million or five million or 10 million [dollars] to be sucked up and spat out the other end,\" Mr Armstrong said.\n\nBoth towns are forecast to double water usage from 28 megalitres of water a year to 60 megalitres by 2060.\n\nPrevious state government modelling predicts rainfall could decline by up to 25 per cent by then under a worst-case scenario.\n\nManjimup Shire President Donelle Buegge said these communities needed a long-term solution sooner rather than later.\n\nDonelle Buegge says residents are desperate for a long-term water solution. (ABC South West WA: Jon Daly)\n\n\"We are going to be one of the hardest hit in a drying climate,\" she said.\n\nMs Williams said the year-round movement of water trucks through the southern karri forests was easy to ignore when so few people could hear them.\n\n\"I think [the government] think it's a problem they'd hope would go away. If they ignore it enough, it doesn't exist,\" she said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/video-games-end-of-year-wrap-2025/106038598",
    "title": "Hollow Knight to Donkey Kong: Our favourite video games of 2025",
    "publish_date": "Sun, 14 Dec 2025 22:00:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's no secret a lot of people in Australia play video games.\n\nIn fact, the latest Australia Plays report, conducted by Bond University and commissioned by peak body Interactive Games and Entertainment Association (IGEA), suggests video games are played in almost nine out of 10 Aussie households.\n\nIt's not child's play either, with the report showing the average age of gamers is 35.\n\nAnd in 2025, for the first time ever in the survey (which has been conducted since 2014) more women are gaming than men, with 51 per cent playing regularly.\n\nWhether you're playing word games regularly or picking up a controller with the family for some couch co-op, the cultural impact of games extends to our museums and to our festivals for interactive theatre events.\n\nWe have collected the thoughts of a diverse range of ABC writers who love this medium, and they present their picks for the games that have found a place in their hearts this year.\n\nDeath Stranding 2: On the Beach\n\nNorman Reedus stars as Sam Bridges in Hideo Kojima's game Death Stranding 2: On The Beach which is set in Australia. (Supplied: PlayStation Studios)\n\nHideo Kojima — gaming's most delightfully idiosyncratic auteur — returns to the post-apocalyptic world of Death Stranding with the long-awaited sequel, On The Beach.\n\nThis time he trades the first game's Icelandic-inspired North America for Australia, dropping Sam Bridges (Norman Reedus) into harsh, barren landscapes that feel uncannily familiar: equal parts beautiful and ominous.\n\nUnshackling itself from the original's meditative \"delivery game\" loop, Death Stranding 2 leans harder into action and stealth, recalling flashes of Kojima's earlier Metal Gear Solid work.\n\nThe result is a kind of Kojima-greatest-hits-package — stranger, punchier, and more confident in its weirdness.\n\nWhy Hideo Kojima set Death Stranding 2: On The Beach in Australia We were invited to talk to Hideo Kojima about sequels, storytelling, and why Australia is the perfect place to end the world.\n\nWith On The Beach, Kojima also continues to blur the lines between video games and cinema (his Instagram bio literally reads \"70% of my body is made of movies\"), bringing some of his filmmaking idols like George Miller and Hollywood heavyweights such as Elle Fanning into key roles.\n\nIn the end, Death Stranding 2 doesn't just follow up the first game — it challenges it.\n\nIt's still about connection and survival, but in today's fractured, hyper-connected world, it's also about what we lose when we assume being \"linked\" is the same as being together.\n\nWhether you traverse its dusty roads or skip it entirely, this sequel leaves you asking: Should we have connected?\n\n— Angus Truskett\n\nHades II\n\nHades II builds on the rogue-lite gameplay of the first game, with lead character Melinoë battling through levels that change every time you play. Dying is an important part of the process. (Supplied: Supergiant Games)\n\nHades II and its predecessor managed to do something that no other game has achieved for me — make me feel OK about repeatedly failing.\n\nNormally in most run-based games, where I'm retreading the same path again and again, I hit a point where I just cannot make any further progress, and I move on to something else.\n\nWith Hades II, the engaging and developing narrative and accumulation of resources that persist between deaths make every run feel meaningful; I'm always going to get something for my efforts.\n\nThe stunning voice acting and characterisation of the Supergiant's version of the Greek pantheon in this sequel is far more developed. Each incidental boss or side character comments on your progress, notes that you have met before and, again, congratulates or chides you.\n\nUnlike a lot of other challenging rogue-lite games, I never feel like my time is being wasted, or that I'm being punished unfairly.\n\nEach victory feels just within grasp and, when you finally succeed, it's exhilarating.\n\nDarren Korb's soundtrack is filled with pumping guitar and electronic trills. The musical-themed battles of Scylla and the Sirens are an absolute delight, leaving you wondering if you've unlocked a new song each time you meet the undersea pop stars that drive their listeners to obsession.\n\nBut it's the tender, quiet duets like Moonlight Guide Us by Ashley Barrett and Judy Alice Lee that really send a shiver down my spine.\n\nSupergiant initially released the game into early access as a work-in-progress version that was added to over time.\n\nThe story was written around that, too — which is a masterful move. Characters in the game explained when you'd hit the end of a still-in-development area in a narratively consistent way, and that will never be able to be experienced again now that it's finished.\n\nYou just had to be there, and I'm lucky I was.\n\n— Gianfranco Di Giovanni\n\nSplit Fiction\n\nSplit Fiction is designed for two players. Each player has different skills and they need to work together to complete tasks across fantasy and science fiction worlds. (Supplied: Hazelight Studios)\n\nAfter winning 2021 Game of the Year at The Game Awards with their charming co-op It Takes Two, all eyes were on Hazelight Studios to see what high-octane tricks they would pull out to follow their hit.\n\nAnd after the release of Split Fiction in April, the answer became clear — they pulled out all of them.\n\nThe mile-a-minute adventure swaps marital crisis for an enemies-to-friends journey between two aspiring authors; cynical sci-fi nerd Mio and optimistic fantasy-lover Zoe.\n\nBoth are lured to the monolithic Rader Publishing with the promise of trying out a new technology and maybe landing a contract.\n\nBut villainous tech bro JD Rader's real plan is to eradicate the concept of an author altogether, replacing writers with an army of AI to fill shelves and line his pockets.\n\nAn accident with Rader's tech test sees Mio and Zoe thrown into various stories of their own creation as they battle together to make it back to reality and thwart the boss.\n\nIn a similar fashion to It Takes Two, players must cooperate to jump, dash, climb and rappel over incredible landscapes. (An intergalactic depot that's about to be destroyed by a supernova? Sure! A cursed candy-land that has a painful secret? Why not!). All this is taking place while solving puzzles and mastering new features embedded in the numerous levels.\n\nHazelight very much went for the spaghetti method with Split Fiction, throwing everything at the wall, and most of it sticks.\n\nWhile it might not be as fresh and original as its predecessor, it's endless and accessible fun for any level of gamer.\n\n— Velvet Winter\n\nBlue Prince\n\nAn ever-shifting puzzle game, make sure you're writing down your own notes when playing Blue Prince, otherwise you'll quickly become lost. (Supplied: Dogubomb)\n\nThe subtle double meaning behind the name of this puzzling adventure captures its enigmatic charm perfectly.\n\nAs you explore the ever-changing assortment of rooms in Mt Holly Manor, get ready to be intrigued, entranced and utterly, hopelessly absorbed trying to find the elusive Room 46.\n\nThe simple controls, muted colours and faint, elegant music rightfully allow Blue Prince's spectacular story to take precedence.\n\nWhile gaming knowledge isn't required, a love for complicated puzzles is essential.\n\nThe blueprint of this mysterious manor changes daily and juggling the balance of finding resources and avoiding dead ends as you draw room tiles, as well as fatigue, is a challenging enough conundrum on its own.\n\nHowever, the glimpses into the story and the metaphorical puzzle pieces of information you receive make the challenge worth it.\n\nThe mystery of Mt Holly and its previous inhabitants will worm its way into your brain and re-emerge long after you have stepped away from your first play session, beckoning you back to explore its halls once more.\n\nThe only slightly negative critique I have for this game is that it should come with a notebook, because if you want to have a chance at solving this one, you will find the game's suggestion that you write things down is not optional.\n\n— Naomi Jackson\n\nHollow Knight: Silksong\n\nHollow Knight: Silksong broke records when it launched, crashing online stores for PC and console players, but mystery surrounded most of its development. (Supplied: Team Cherry)\n\nA fantastically challenging, frame-perfect test of technique, this Aussie-made sequel to the popular Hollow Knight has the polish you would expect from a game seven years in the making.\n\nAs you ascend to the peak of a haunted kingdom as the comically blunt, badass bug Hornet, Hollow Knight: Silksong introduces a bunch of interesting characters but also a large number of devastatingly difficult enemies that will likely have you backtracking to explore its beautiful environments as you calm down from the frustration of not being able to beat them.\n\nBut while this game is not for the faint of heart, if you stick with it long enough to learn its techniques, the springy, fast-paced yet methodical nature of the combat will delight and entice you to give it 'just one more try'.\n\nHow Australian-made Hollow Knight: Silksong crashed the internet Team Cherry sequel launch was met with unprecedented demand, taking down stores on PC and console when it launched.\n\nAs well as being used for bouncy attacks, Hornet's diagonal needle dash also comes in handy for traversal.\n\nThe parkour-style challenges to reach some of the game's areas are incredibly satisfying — if you manage to complete them, or even find them.\n\nThis game weaves a web in more ways than one — the intelligent way areas of the deceptive map are hidden adds to the fun of untangling this game's story as if it were a really tight silk knot, while tools and map resources can only be purchased with hard-to-come-by currency that is easy to lose, cleverly forcing hoarders like me to accept and surrender.\n\nMy love/hate relationship with this haunted kingdom that's a dream to unlock, but a nightmare as I try to unlock it, grows more and more affectionate every day I dare to play it.\n\nThis game is my personal game of the year, hands down.\n\n— Naomi Jackson\n\nDonkey Kong Bananza\n\nWith incredibly destructable environments, Donkey Kong Bananza encourages players to smash their way through levels to discover all the secrets. (Supplied: Nintendo EPD)\n\nDonkey Kong Bananza will be on a lot of GOTY lists this year.\n\nIn Bananza, DK and his friend Pauline must crash through an entire planet to reach the core and the riches that lie within.\n\nFor DK, it's about obtaining a banana horde. For Pauline, it's finding a way home to the surface.\n\nFor the player, it's a great excuse to wreck everything in sight.\n\nBananza's central gameplay mechanic is that DK can destroy the world around him. There is no problem that can't be solved by simply smashing through a wall.\n\nDK is a wrecking ball. Little can stand in his way, and the novelty of tearing through rock on your way to a specific goal never wears off.\n\nIn 2025, games like Bananza are increasingly rare.\n\nNone of the shareholder-pleasing, revenue-raising cruft that has come to define major games in the 2020s (live service, mandatory multiplayer, micro-transactions, etc) is present here.\n\nThe prioritisation of additional revenue streams is a symptom of an industry that can no longer derive profit from a high number of copies sold.\n\nNintendo continues to take a more old-school approach: produce fun games at a high level of quality, and the rest will take care of itself.\n\nThrough this, Donkey Kong Bananza reminds us what a great video game looks like, and why we fell in love with games in the first place.\n\nFun, challenge, joy, a sense of accomplishment, all packed into a cartridge no bigger than an SD card.\n\n— David Smith\n\nClair Obscur: Expedition 33\n\nClair Obscur: Expedition 33 scooped the pool at this year's Game Awards, taking home a record nine trophies, including the coveted Game of the Year. (Supplied: Sandfall Interactive)\n\nClair Obscur: Expedition 33 made me cry so hard that I threw up.\n\nSlap that quote on the box art Sandfall, you cowards.\n\nThere are a lot of common talking points when discussing why Clair Obscur rocks so insanely hard.\n\nIts stunning art direction. Its captivating story. Its precise, brutal and utterly addictive combat. The way it captures a perfect storm of emotions — the intersection between despair and devotion.\n\nAll of those things are true and not one could exist to its fullest without the other.\n\nComposer's first game soundtrack is set to be one of the biggest of 2025 The music for indie game Clair Obscur: Expedition 33 has racked up millions of streams. It is first game soundtrack Lorien Testard has made.\n\nBut it was this one line, spoken during an encounter with an NPC in an optional side quest in the late game, after hours of dancing on an emotional knife-edge, that truly shattered me: \"He just wants you to fly.\"\n\nI can't really explain why I had such a visceral reaction without a whiteboard, a family mental health plan and a bottle of medical-grade disinfectant, but the result remains the same — Clair Obscur: Expedition 33 made me cry so hard that I threw up.\n\nNow is that a common criteria for my game of the year? No.\n\nBut how incredible is it for a game to be able to impact someone so dramatically?\n\nTo wrap them up in a story so completely and so easily that it can draw out so much emotion — a testament to the work that has gone into creating such a beautiful, captivating, brutal and utterly addictive world.\n\nMy carpet may never be the same, but hey, that's a fair price to pay for such a phenomenal game.\n\n— Gemma Driscoll\n\nDispatch\n\nEveryone loves feeling like a superhero in video games, but in Dispatch you'll be sending a group of supes out on missions all while managing office politics. (Supplied: AdHoc Studios)\n\nDispatch is one of those games that, on paper, shouldn't be nearly as compelling as it is.\n\nIt's an eight-part episodic 'choose your own adventure' game set in a world full of superheroes and supervillains. The catch is you, Robert Robertson, have no powers.\n\nWell that's not entirely true; depending on how you play Robert, his power might actually be endless patience for the metric shit-tonne of roasting he gets from his charges — a small band of ex-villains called the Z Team.\n\nBeing the person to send out the people with powers to do cool missions whilst you babysit a progress bar doesn't sound like a high-tension endeavour.\n\nThat is, until you have four heroes on a mandatory rest break, two out of commission and five separate crimes taking place, the clock ticking down on each of them and you're wondering how it's possible for the one gig you took a chance on letting Waterboy handle has somehow gone so thoroughly awry that the city is facing flooding.\n\nAll that is to say, Dispatch is very good at keeping you on your toes in more ways than one.\n\nIt also manages to pack in a hell of a lot of heart, giving you characters to love, to hate, to love to hate and every emotion in between.\n\nWith so few words, it's hard to properly convey how sick some of the design choices in Dispatch are but suffice to say, as a disciple of the emotional car wreck that was Telltale's The Walking Dead series, it was awesome to see that same sparkle on display.\n\n— Gemma Driscoll\n\nGhost of Yōtei\n\nA rōnin story set on the island of Yōtei, this sequel channels the filmic legacy of Akira Kurosawa and modern anime like Samurai Champloo. (Supplied: Suckerpunch Productions)\n\nHonour or freedom? That was the heartbreaking choice that players wrestled with in Sucker Punch Productions' Ghost of Tsushima (2020).\n\nThe anticipated sequel, Ghost of Yōtei, asks a more personal question: are those who live for revenge truly alive?\n\nAtsu, a battle-hardened rōnin, returns to Ezo seeking revenge against a powerful gang of outlaws, the Yōtei Six, for the murder of her family.\n\nAs Atsu attacks its outposts across Ezo, she earns fear and respect as \"the onryō\", a vengeful spirit.\n\nCombat in Yōtei is straightforward. Most battles with the Yōtei Six can be decided with katanas, but Atsu learns many distinctive combat forms, including the Yari, Kusarigama and Tanegashima.\n\nLike Tsushima, which won The Game Award for Best Art Direction in 2020, the centrepiece of Yōtei is a rolling open world featuring the most breathtaking vistas in all of gaming.\n\nFrom wild horses running free through Yōtei Grasslands, to smouldering villages in Ishikari Plains, the beauty of Ezo — and its scars of oppression — are on display in frightening clarity.\n\nPlayers are invited to savour Ezo, with guiding winds and golden songbirds enticing players away from the beaten path to points of interest.\n\nThe films of Akira Kurosawa are a clear influence on Yōtei, but this strong sense of cinema can oust player choice and control for brief moments.\n\nGhost of Yōtei is a worthy successor to Tsushima, and anyone who enjoyed Tsushima will find a similarly thrilling, strangely calming, inescapably tragic tale of revenge at any cost.\n\n— Joshua Wong\n\nKingdom Come: Deliverance II\n\nKingdom Come: Deliverance II sells itself as a grounded and realistic recreation of medieval Bohemia, which is now the modern-day Czech Republic. (Supplied: Warhorse Studios)\n\nAt the opening of Kingdom Come: Deliverance II, Henry of Skalitz is much as you left him — a peasant-turned-nobleman with all the armour, weapons and pride to prove it.\n\nHowever, like most sequels, much of that is quickly stripped away leaving Henry in rags, penniless and in a strange new land where allies and enemies are hard to tell apart.\n\nBut his mission remains: to unite a kingdom against a new monarch whose violent seizure of the throne has sparked civil war, closely following the real-life ousting of King Wenceslas of Bohemia (now the modern-day Czech Republic).\n\nEverything that makes this game special can be traced to its precursor. Released in 2018, Kingdom Come: Deliverance transported players into a grounded recreation of 15th-century central Europe.\n\nImmersion is woven into every aspect of the experience.\n\nYou manage Henry's hunger, mend his wounds, repair his armour and even sharpen his weapons when they become dull.\n\nYou can even visit a bathhouse to clean your clothes and get a fresh haircut (which grants a temporary charisma boost, of course).\n\nNo fantasy or otherworldly elements get thrown into the mix. This is a slow-paced, first-person, role-playing game deeply invested in tactile gameplay and consistent realism.\n\nWhether you're visiting vendors in a faithfully recreated medieval city, duelling to the death with all manner of weapons, or riding through the countryside on horseback.\n\nFor some, the pace may prove slow and tedious. But for the patient, a compelling narrative, gorgeous open world and rich role-playing journey awaits.\n\n— Don Sheil",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/ashes-adelaide-test-england-warned-pitch-not-friendly/106142732",
    "title": "Data shows Adelaide pitch is not as friendly as it looks for England",
    "publish_date": "Sun, 14 Dec 2025 21:54:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alex Carey has warned that Adelaide may not be the batter's paradise England expect, with data showing the wicket won't necessarily be easier to bat on with a red ball.\n\nStaring down the barrel of an irredeemable 3-0 series deficit, England coach Brendon McCullum predicted on Sunday that the Adelaide pitch would suit England's style this week.\n\nThe tourists are known to prefer flatter wickets, with England's home pitches becoming better for batting in recent years.\n\nBatting averages by Test venue over past decade SCG: 36.38 MCG: 30.54 Gabba: 28.39 Adelaide Oval (day-night): 28.07 Perth Stadium: 27.23 Adelaide Oval (day): 22.77 Bellerive Oval: 18.40\n\nAdelaide has traditionally provided just that, being long regarded as the best wicket in Australia to bat on over the past 50 years, before the introduction of a pink ball.\n\nBut the numbers now suggest otherwise, regardless of ball colour.\n\nWhile only two red-ball Tests have been played at the ground over the past 10 years, the highest team total in either of them is India's 307 against Australia in 2018.\n\nWickets have in fact fallen at a quicker rate than in pink-ball matches, with batting averages also lower in red-ball games.\n\nStatistically, only Bellerive in Hobart has proven a harder venue for players to score runs in Tests over the past decade, when accounting for both day and day-night Tests.\n\nCarey said it was wrong to think Adelaide was only good for batters.\n\n\"In terms of flatness, I think Adelaide is very consistent, which doesn't make it a batting paradise the whole time,\" Carey said.\n\n\"There is always something with the new ball, but there is always something for the batters to score big runs.\n\n\"I love playing here, Trav [Head] loves playing here, the Australian cricket team loves playing here. I think there will be enough in it for bat and ball.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\n\"Sheffield Shield wickets this year have been great for batting and bowling. A bit of spin comes into it late.\"\n\nPotentially working into England's favour is the fact the pitch doesn't traditionally offer as much bounce as Perth and the Gabba, where the tourists have been well beaten.\n\nSeven centuries have been scored on it across four Shield games this summer, in a season where the Gabba has been the most batter-friendly of all Test venues.\n\n\"I think these conditions should suit our style a little bit better as well,\" McCullum said.\n\n\"[They] are going to be quite different to what we've faced in both the Gabba and at Perth as well.\n\n\"We just need to chisel away at some of the things we haven't got quite right and make sure that we still have that conviction in what we're trying to achieve.\n\n\"It doesn't mean we couldn't have been a success from previously, but this is probably more attuned to our best style of cricket.\"\n\nABC Sport will be live blogging all the action from Adelaide Oval on Wednesday. Follow every ball live at abc.net.au/news/sport.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/karratha-applies-for-international-airport-status/106055700",
    "title": "Karratha residents hopeful as council bids for international airport",
    "publish_date": "Sun, 14 Dec 2025 21:32:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "It is 1,400 kilometres from Karratha in Western Australia's north to the beaches of Bali, but to get there residents must fly a further distance in the opposite direction to board a flight at Perth's International Airport.\n\nFares between Karratha and Perth are so high that some families are paying more to get to WA's capital, 1,520 kilometres away, than they would for their international destination, and there is more pain to come after changes to the state's regional flights cap scheme.\n\nThis is part of the reason the City of Karratha applied for international airport status with the federal government's infrastructure department last month.\n\nIf the application is successful, Karratha could be the only regional airport in Western Australia servicing direct international commercial flights, since international routes have collapsed in both Broome and Port Hedland.\n\nThe renewed push comes a decade after Karratha last had international airport status on its radar when it received substantial upgrades.\n\nA strong business case\n\nThe City of Karratha said it was confident it could get international offerings off the ground, citing Singapore and Bali as likely destinations under a \"restricted use\" designation.\n\nCity of Karratha chief executive Virginia Miltrup said she expected initial flights would primarily be for Pilbara residents as outbound tourists, but expected interest from inbound internationals to build.\n\nVirginia Miltrup says there is a strong business case for international flights to Karratha. (ABC News: Kelsey Reid)\n\n\"Our business case is actually built a lot around inbound,\" she said.\n\n\"There's a lot of people coming through for business purposes because we're such an economic engine here.\"\n\nThe city was optimistic about the application but Ms Miltrup said international flights were still years away.\n\n\"If we're talking about 18 months before we get a decision [from the federal government], you're talking a few years at least,\" she said.\n\n\"It'll happen as soon as we can possibly make it happen.\"\n\nLocals hopeful for take-off\n\nKarratha locals were excited by the prospect of an international airport.\n\nBusiness owner Ginger Lo said she would like to visit her home in Taiwan.\n\nGinger Lo is excited by the prospect of an international airport in Karratha. (ABC News: Kimberley Putland)\n\n\"It's gonna be super, super convenient because we normally travel from Perth to Singapore, Singapore to Taiwan because there's no direct flight from Perth to Taiwan,\" she said.\n\n\"If we can have that flight happening in Singapore, it's going to be really beneficial and bring more people to Karratha.\"\n\nKarratha resident Gregory Dodd said there would be plenty of appetite for international routes.\n\nGreg Dodd says there would be high demand for international services. (ABC News: Charlie McLean)\n\n\"That would be a great idea, especially for locals that are wanting to go to Bali and overseas,\" he said.\n\n\"Instead of going down to Perth, they can come here and just organise their flights to go internationally straight from this area.\"\n\nRegional challenges\n\nA two-hour drive north from Karratha, Port Hedland's airport no longer services regular commercial international flights after its 25-year-long service to Bali halted during the COVID-19 pandemic.\n\nIt has been trying to get international flights operating again for years but has faced multiple roadblocks.\n\nPort Hedland International Airport does not have an international flight service. (ABC Pilbara: Jessica Shackleton)\n\nPort Hedland International Airport chief executive Hayley Vale said the airport continued to service international charter flights, but was still seeking a carrier to get regular international services operating again.\n\n\"We've been doing a huge body of work trying to incentivise some of the Asian airlines and Australian-based airlines to actually return the service from Port Hedland to Bali — we're currently talking with numerous airlines about the service,\" she said.\n\nMs Vale said staffing was a challenge.\n\n\"We are lucky that we have an Australian Border Force and a biosecurity staffing base here, supporting the port of Port Hedland,\" she said.\n\n\"However, that is their primary focus … we don't make the rules about staffing levels and what's actually required to be able to service international flights, so it can be difficult.\"\n\nThe City of Karratha has applied to the federal government for international designation at Karratha Airport. (ABC News: Jessica Shackleton)\n\nGovernment 'pursuing increased opportunities'\n\nThe Department of Infrastructure confirmed it had received the City of Karratha's application, and said it was \"pursuing increased opportunities\" for international airline markets, in line with the federal government's Aviation White Paper.\n\n\"The application is being considered by the department in consultation with a number of government agencies responsible for aviation safety, security, air navigation and the provision of border and biosecurity services,\" a spokesperson for the department said.\n\n\"The department has not received any applications at this time for international airline services to operate to Karratha.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/wotjobaluk-nations-festival-marks-20-years-of-native-title/106135506",
    "title": "Wotjobaluk Nations Festival marks 20 years of native title",
    "publish_date": "Sun, 14 Dec 2025 20:58:16 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "As the sun sets, the banks of the Barengi Gadjin (Wimmera River) in Victoria's west come aglow with stories of the Dreamtime.\n\nIt is a Saturday night, and under the shadows of ancient, towering river red gums the voices of Wotjobaluk elders honour the Creation stories of the Wotjobaluk Nations.\n\nThe Wotjobaluk Nations Festival was held at the sacred site of Horseshoe Bend, north-west of Melbourne. (ABC News: Grace Marshall)\n\nThe Wotjobaluk Nations Festival was held at Dimboola on the weekend, and included a light show by Wotjobaluk and Ngarrindjeri artist and storyteller Tracy Rigney.\n\nShe used dance, animation and multimedia to illuminate culturally significant sites around Horseshoe Bend, in the Little Desert National Park, 337 kilometres north-west of Melbourne.\n\n\"It's this immersive self-guided tour where people can just walk around and be drawn like moths to a flame,\" Ms Rigney said.\n\nWARNING: Aboriginal and Torres Strait Islander readers are advised that this article contains images of people who have died.\n\nTchingal, the giant emu is a Wotjobaluk dreaming story. (ABC NEWS: Grace Marshall)\n\nTwelve installations lined the path offering a unique storytelling experience including three Talking Trees and the stories of Bunjil the Spirit Creator, Barra the Red Kangaroo and Tchingal the Giant Emu.\n\nOne of the most powerful moments was at stop seven — Bunyo Budnitt.\n\nIt is there that a snippet of the history of the Ebenezer Mission was told through projections and ceremonial dance performed by the Dalki Murrup ceremonial performance group.\n\nThe Ebenezer Mission station was established in 1859 by Moravian Missionaries and operated for more than 40 years before it was officially shut down in 1904.\n\nA projection on the former Ebenezer Mission as part of the festival. (Supplied)\n\nCeremonial dance returns to Country\n\nFor this year's festival, the traditional dance of the Dalki Murrup ceremonial performance group was returned.\n\n\"It is all about revitalising our language and having our stories told through dance,\" Gunditjmara and Wotjobaluk woman Tanisha Lovett said.\n\nMs Lovett said the group had been rehearsing for the past year to \"create from scratch, what our people spoke before us, shared stories … and the way that they would dance\".\n\n\"Building confidence and finding your own identity in where you come from,\" she said.\n\nThe Dalki Murrup ceremonial performance group dancing at Ebenezer Mission. (ABC NEWS: Supplied)\n\nThe performance included a welcome dance, an origin of fire dance, a repatriation dance and a \"show-off dance\".\n\nAunty Janine Coombs, a Wotjobaluk elder and a board director of the Barengji Gadjin Land Council, is proud to see the return of the Dalki Murrup.\n\n\"To have that back and to see the younger generations just embrace it and to to see that in all its glory gives me a sense of pride,\" Aunty Janine said.\n\nConnection through song\n\nGunditjmara man Andy Alberts and his band The Walkabouts. (ABC News: Grace Marshall)\n\nMusic was a key part of the festival, featuring performances from Wergaia and Wemba Wemba musician Alice Skye, Ngiyampaa singer-songwriter Pirritu and Gunditjmara man Andy Alberts & the Walkabouts.\n\nAlice Skye said she weaved poetry and traditional Wergaia language into her music.\n\n\"It opens up a a bit of a portal in a way of connecting with your old people or your ancestors that were speaking language for a very, very long time. And it also just makes Country make sense,\" Ms Skye said.\n\n\"It's so awesome to see young people singing in language, it feels really special to see.\n\n\"I'm so proud of being from this Country … it's the best place in the world.\"\n\nMusician Alice Skye weaves traditional Wergaia language into her songs. (ABC NEWS: Grace Marshall)\n\nNative title recognition\n\nThe celebrations over the weekend were a powerful reminder of the resilience, identity and ongoing journey of self determination for the Wotjobaluk Nations.\n\nThe federal court's landmark decision on December 13, 2005, was a historic first consent determination under the Native Title Act 1993 as Victoria's first successful native title claim.\n\nAunty Janine said the decision \"recognised that our sovereignty was never ceded within Wotjobaluk Nations\".\n\n\"Our ancestors fought for what is now being determined as self-determination. The hard work they did to get us here has been formally recognised,\" she said.\n\nMore than 450 people attended the weekend event.\n\n\"It's about giving our traditional owners, first and foremost, of all generations an opportunity to come together and celebrate such an outstanding achievement,\" Aunty Janine said.\n\nChris Harrison, a Wotjobaluk man and chair of the Barengi Gadjin Land Council, said returning to the place where the agreement was signed was nostalgic.\n\n\"Today culminates a whole range of different things that have been brought together over time that we've improved and increased along with the organisation to make sure it's something massive and making sure community is taken along on the journey,\" he said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/mildura-council-mallee-care-building-without-permit-vcat/106140872",
    "title": "Parking spat involving new Mildura family care centre heads to VCAT",
    "publish_date": "Sun, 14 Dec 2025 20:55:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's planning tribunal is investigating whether the development of Mallee Family Care's new $28 million headquarters in Mildura, in the state's far north west, has taken place unlawfully.\n\nThe family support service provider is embroiled in a challenge at the Victorian Civil and Administrative Tribunal (VCAT) about whether the planning permit provided by Mildura Rural City Council had lapsed while contractors were clearing the land.\n\nSubmissions to VCAT show it will consider when work at the former Hutchinson Motors site began, and whether the council acted appropriately when it gave Mallee Family Care an extension on its planning permit in 2023, if the permit had already expired.\n\nFinancial documents and annual reports from Mallee Family Care show the organisation bought the former Hutchinson Motors site in December 2019 for about $2.5 million.\n\nIt has spent about $22.7 million on the development since mid-2023, and last year secured a federal government grant of $5.4 million.\n\nIn August, the Mildura Working Man's Club lodged an objection with VCAT about the traffic and car parking conditions attached to the planning permit.\n\nThe club wrote to council pointing out \"anomalies\" in the council's documents supporting Mallee Family Care's request to reduce car parking.\n\nMildura Working Man's Club is also arguing that Mallee Family Care's application to seek an extension of time to the original planning permit was not made to the council within six months of the expiry date.\n\nMore than $25 million has been spent on the Mallee Family Care building so far. (ABC News: Tyrone Dalton)\n\nCouncil's manager of growth and strategy, Phil Stone, said given the matter was still before VCAT, the council \"would prefer not to go into further detail to avoid pre-empting discussions at next week's hearing\".\n\n\"The permit was issued legally and work started on this project legally after the permit was issued in November 2021,\" he said in a statement.\n\n\"We're continuing to work with all parties to resolve the issue as quickly as possible.\"\n\nMallee Family Care CEO, Teresa Jayet, said \"both Mallee Family Care and Mildura Rural City Council consider that all construction on the land has occurred pursuant to a valid planning permit\".\n\nThe Mildura Working Man's Club has been contacted for comment.\n\nA concept design of the Mallee Family Care building, which will bring all its services under one roof. (Supplied: Mallee Family Care)\n\nPermit timing\n\nDocuments show the original permit was granted in December 2021 and gave Mallee Family Care two years to start works and four years to complete those works.\n\nBut another condition, which has created some confusion, stated use must start within two years of the permit issue date.\n\nIt's alleged that the use had not started within the two-year window by November 12, 2023, and the extensions given in 2023 and 2025 should not have been granted.\n\nIn letters to VCAT, the council and Mallee Family Care contend that the terms \"use\" and \"development\" are relatable, and that the use began at the same time development began.\n\nIn it, aerial images show land had been cleared in August 2023 — three months before the November expiry date.\n\nThe case is set down for a two-day hearing in mid-February.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/scorchers-down-sixers-bbl-opener/106142124",
    "title": "Connolly stars as Scorchers down Sixers in BBL opener",
    "publish_date": "Sun, 14 Dec 2025 20:39:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "Star Sydney Sixers recruit Babar Azam failed to follow up the pre-match lightning with his own fireworks as the Perth Scorchers posted a five-wicket win in the BBL season opener at Perth Stadium.\n\nLightning and heavy rain in Perth reduced Sunday's match to an 11-overs-a-side bash, with the Sixers posting 5-113 on the back of an unbeaten 46 off 21 balls from Jack Edwards.\n\nPakistan superstar Azam made just two — and he was lucky not to get out on two occasions before that — as the Sixers slumped to 4-41 before Edwards and Josh Philippe (28 off 18) launched a rescue mission.\n\nIn reply, the Scorchers reached their victory target in 10.1 overs on the back of Connolly's 59 off 31 balls, with his knock featuring five sixes and three fours.\n\nThere was drama an hour before the match when spectators were told to leave their seats and seek shelter as lightning started edging closer to the venue.\n\nThe stadium's lights flickered numerous times as the electrical storm gathered intensity.\n\nHuge puddles formed on the turf as more than 15mm of rain fell within the space of an hour.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPlay eventually began 80 minutes after the original start time, but it wasn't pretty early for the Sixers.\n\nAzam was almost caught on two occasions before he even got off the mark — the first a flat-batted shot that just floated over Laurie Evans at mid-on, the second an aerial whack over mid-off that landed between two fielders.\n\nHis luck ran out next ball when he flat-batted paceman Brody Couch (2-12) down the ground for an easy catch.\n\nEdwards cracked six fours and two sixes to guide Sydney to a competitive total.\n\nScorchers opener Mitch Marsh fell for a third-ball duck when Azam took a sharp catch at slip, and Finn Allen cracked 16 off eight balls before being snaffled in the deep.\n\nConnolly, who shared the BBL player-of-the-season award with Glenn Maxwell last campaign, kept his cool and ensured the required run-rate never got out of hand.\n\nHe eventually holed out in the deep with just nine runs needed for victory.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/asx-markets-business-news-live-updates/106141546",
    "title": "Live: Australian market falls, ASX Limited shares slide on ASIC hit",
    "publish_date": "Sun, 14 Dec 2025 20:25:28 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Jason Dasey",
      "Ben Butler",
      "Emilia Terzon",
      "Stephanie Chalmers"
    ],
    "text": "It wasn't one of those champagne-popping, record-topping ends to the week on Wall Street.\n\nThe bubbles went flat as traders spent the day executing sell orders on tech stocks, which soured the sentiment across the board.\n\nThe S & P 500 closed 1.1% lower while the blue-chip Dow fell 0.5%.\n\nThe tech-centric Nasdaq tumbled 1.9%. The technology sector within the S & P 500 lost 2.9% as AI punters decided to take some profits off the table in double-jig time.\n\nThe cloud-computing company Oracle, which had prompted the tech wobble earlier in the week with a disturbing mix of weak earnings forecasts and massive spending commitments, dropped another 4.5% on top of Thursday's 11% capitulation.\n\nChipmaker Broadcom closed 11% lower after issuing a warning about its margins, and AI leader Nvidia shed another 3.3%.\n\nGranite Wealth Management Managing Director Bruce Zaro told Reuters that \"continued disappointment and uncertainty over the AI trade and technology trade\" pressured the market.\n\n\"I would have thought this choppiness would have ended by now,\" he said. \"We're in a really, really good seasonal period. Typically, mid-December through the last trading days of the year is traditionally the Santa Claus rally period.\"\n\nEuropean stocks also closed lower with the broad Eurostoxx 600 shedding 0.6%, while the global MSCI was also down 0.6%.\n\nOver the week, the S & P 500 fell 0.5%, while the ASX was one of the better performers, picking up 0.7%, matching the effort of the Nikkei.\n\nHowever, if futures markets are anything to go by, the ASX will give up a fair chunk of last week's gains, pricing in a 0.6% loss on opening.\n\nUS Treasury yields rose in line with the global vibe that most central banks were nearing the end of their current easing cycle.\n\nThe US dollar was generally stronger, although the Aussie dollar largely held its ground against the greenback. It notched its third successive week of gains and hit its highest weekly close in almost fourteen months.\n\nOn commodity markets, oil prices slipped due to ongoing worries about oversupply building into next year.\n\nThe global benchmark Brent crude fell 1.5% to be down almost 4% over the week.\n\nGold pushed above $US4,300 an ounce, while silver slipped on profit taking and copper eased 3% after almost hitting $US12,000/tonne and a new record high.\n\nOvernight, Bitcoin again dived back under $US90,000.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-15/southeast-qld-weather-wrap-rain-heat/106137146",
    "title": "Dreary weather to take sting out of south-east Queensland heat",
    "publish_date": "Sun, 14 Dec 2025 19:34:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Parts of south-east Queensland can expect a slight easing of summer heat early this week, with the weather bureau forecasting temperatures to drop by up to 6 degrees Celsius in some areas.\n\nRain and storms are also expected across the state over the coming days.\n\nThe dreary weather comes as Queensland public schools let out for school holidays.\n\nThe lower temperatures are set to provide a reprieve for large parts of the state, which have been sweltering through higher than normal temperatures for this time of year.\n\nA cool change is expected for parts of the south-east this week. (Supplied: Pat Cahill)\n\nCloud cover and change in temperature\n\nMonday is forecast to bring cloud cover with a chance of isolated showers across the south-east.\n\nTemperatures are expected to remain warm. Brisbane is forecast to hit a maximum of 34C, the Gold Coast 31C, and Maroochydore 32C.\n\nGladstone is forecast to reach a maximum of 32C, while temperatures could hit 38C in Longreach and 38C in Mt Isa.\n\nTownsville, Mackay and Cairns are all forecast to reach a maximum of 33C.\n\nThe Bureau of Meteorology's Jordi Cairol said while forecasters were \"not expecting much precipitation\" on Monday, Tuesday would bring a change.\n\nThe weather bureau is forecasting lower temperatures and more rain this week. (ABC News: Lucas Hill)\n\n\"We are expecting more showers and thunderstorms, particularly around the Sunshine Coast, which could have moderate falls of 20 to 25 millimetres,\" he said.\n\n\"Tuesday's cloud cover will also bring a significant change in temperature. It could drop 5 to 6 degrees, down to about 28C.\"\n\nMr Cairol said weather in the state's south-east was broadly expected to clear from Wednesday, with showers \"less likely\".\n\nSevere storms forecast\n\nWhile the weather is forecast to remain relatively mild in the south-east, Mr Cairol said things could be more extreme in central Queensland.\n\nWhat are your options if stormwater runoff damages your property? Who's responsible if your property experiences runoff during heavy rainfall, and what can you do about it?\n\n\"We are expecting severe storms with a risk of heavy rainfall,\" he said.\n\n\"On Tuesday, it will extend towards the southern interior, even reaching the Sunshine Coast and Darling Downs and the New South Wales border.\"\n\nMr Cairol said the storms were forecast to bring heavy rainfall and damaging winds, but no hail was expected.\n\nIn north Queensland, a heatwave warning remains in place for Cape York Peninsula, but that is expected to ease in the coming days.\n\nTemperatures in the state's north have been slightly below average this month, according to the BOM, and showers are expected from Tuesday to Wednesday.\n\nSouth-east still recovering from severe storms\n\nMany residents are still feeling the effects of days of storms that lashed parts of the state, especially the south-east, in late November.\n\nThousands were left without power for days after strong winds, hail and flooding took out power infrastructure and damaged homes.\n\nSix storms over the past three months have brought hail, with the state seeing more than double the usual occurrences of giant hail since July.\n\nMore giant hail than usual has been recorded since July. (Supplied: Kayleen Gordon)\n\nSome of that hail has been especially large, with 14-centimetre hail recorded during a storm in November at Chandler, in Brisbane's south-east, and 11-centimetre hail falling on the city's bayside.\n\nDespite the severe storms, Queensland's December rainfall is sitting slightly below average, while both maximum and minimum temperatures have been broadly above average.\n\nWhat to expect this summer\n\nMr Cairol said the current forecast was not indicating extreme weather around the holiday period.\n\n\"For the next couple of weeks we are looking at an average chance of rain ... nothing unusual,\" he said.\n\n\"For the week from Christmas to New Year we are expecting temperatures to be a little higher than average ... temperatures have been slightly above average in general, particularly in western Queensland.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/business/companies/wide-gold-hits-boost-early-us-mining-plan-for-dateline-20251215-p5nnth.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wide gold hits boost early US mining plan for Dateline",
    "publish_date": "Mon, 15 Dec 2025 13:16:22 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Dateline Resources has jagged another set of impressive high-grade gold intercepts from its ongoing drilling campaign at the company’s 100 per cent-owned Colosseum gold and rare earths project in California, adding further weight to the mineralisation model beneath the existing North Pit.\n\nThe latest results came from a reverse circulation (RC) drilling program testing depth extensions below the historic North and South pits and have delivered some eye-catching grades and widths.\n\nDateline Resources’ Colosseum pit in California\n\nStandout intercepts include a stellar 10.67-metre section running at 7.27 grams per tonne (g/t) gold within a broader intercept of 62.48m grading 2.52 grams per tonne (g/t) gold from 25.91m. Another hole returned a whopping 108.20m going at 1.18g/t gold, including 13.72m at a healthy 4.48g/t gold from just 9.14m depth.\n\nDateline says grades from these latest twelve RC holes have materially improved the continuity of mineralisation and, in several cases, returned grades that far exceed the current mineral resource estimate.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/nathan-lyon-was-filthy-in-brisbane-this-is-why-his-luck-s-about-to-turn-20251215-p5nnnx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nathan Lyon was ‘filthy’ in Brisbane. This is why his luck’s about to turn",
    "publish_date": "Mon, 15 Dec 2025 12:45:33 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Adelaide: Nathan Lyon and spin bowling have been given a rallying cry by Adelaide Oval’s curator Damian Hough, who declared it is up to cricket’s turf custodians around the country to ensure that slow bowlers aren’t pushed out of the game by green pitches.\n\n“I don’t want to be the curator at Adelaide where you don’t pick a spinner. Spin needs to play a part here, it always has,” Hough said.\n\nNathan Lyon is expected to return to the Australian team in Adelaide. Credit: Getty Images\n\n“Even last year when he didn’t bowl a lot of overs, I felt that the pitch would have spun, but they were able to take wickets with the quicks. But spin needs to play a part in pitches around Australia, and we want it to play a part.”\n\nAustralia made a shock selection call for the second Test in Brisbane, leaving Lyon out of the team to play without a specialist spinner, instead opting for Michael Neser as a fourth seam bowler. Lyon admitted on the day he was “filthy” at that decision. But selection chair George Bailey virtually guaranteed on the spot that the veteran tweaker would play in Adelaide.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/nsw/three-minutes-of-footage-show-bondis-night-of-terror-20251214-p5nnlk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three minutes of footage show Bondi's night of terror",
    "publish_date": "Mon, 15 Dec 2025 12:28:13 +1100",
    "category": "finance",
    "authors": [],
    "text": "Three minutes of footage show Bondi's night of terror\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/aussie-darts-showman-doesnt-need-the-ashes-heat-20251215-p5nnsm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie darts showman doesn’t need the Ashes ‘Heat’",
    "publish_date": "Mon, 15 Dec 2025 12:25:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Cricket-loving Aussie darts thrower Damon Heta reckons discretion is the better part of valour as he’s decided against any flamboyant Ashes-themed walk-on antics that might get boisterous English crowds on his back at the world championships.\n\nPerth’s Damon Heta is known for his theatrical entrances. Credit: Getty Images\n\nThe popular Perth showman, known for his theatrical entrances to the oche, delighted in winding up the world matchplay crowd in Blackpool two years ago during the Ashes in full Aussie cricket kit, complete with bat and baggy green, and, naturally, got right royally jeered, even if good-naturedly.\n\nBut “The Heat” was in a much more sober mood before his fine 3-1 first-round win over Irishman Steve Lennon, evidently feeling a boozed-up crowd at London’s Alexandra Palace might not have taken as kindly to being reminded of England’s current Ashes plight Down Under.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-sbs-speaks-to-hn-rights-commissioner-as-un-blocked-from-inspecting-australian-detention-facilities/vbhv62yz5",
    "title": "INTERVIEW: SBS speaks to Human Rights Commissioner as UN blocked from inspecting detention facilities",
    "publish_date": "Sun, 14 Dec 2025 06:15:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 19
  },
  {
    "url": "https://www.sbs.com.au/news/article/attorney-general-expenses/rxako6s0y",
    "title": "Attorney-General Michelle Rowland to repay 2023 family trip as expenses scandal grows",
    "publish_date": "Sun, 14 Dec 2025 00:10:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Attorney-General Michelle Rowland will repay a portion of expenses claimed for a 2023 trip, while Treasurer Jim Chalmers says Rowland has \"done the right thing\" in self-reporting spending.\n\n\n\n\n\nRowland is the first MP to pay back expenses following growing scrutiny on politicians' spending, after she referred her travel to the Independent Parliamentary Expenses Authority (IPEA) for advice.\n\n\n\n\n\nA spokesperson for the attorney-general said in a statement Rowland referred a trip from 2023 to Perth during which she had \"at least 10 official engagements\".\n\n\n\n\n\nIt's understood the expense was related to a family trip in July 2023 which cost taxpayers more than $21,600.\n\n\n\n\n\n\"The IPEA finalised its advice on Friday 12 December and conveyed a portion of the family reunion travel expenses were outside the guidelines,\" the statement read.\n\n\n\n\n\n\"The Attorney-General has formally accepted that advice on Friday and commenced steps to make repayment.\"\n\n\n\nAustralian Prime Minister Anthony Albanese and Australian Communications Minister Anika Wells made a joint public appearance on Thursday during a school visit in Canberra. Source: AAP / Lukas Coch On Sky News on Sunday morning, Chalmers rejected calls for his colleague to step down.\n\n\n\n\n\n\"Michelle has done the right thing in asking the IPEA to take another look, as has Anika ... to make sure everything that's happened here is within the rules,\" he said.\n\n\n\n\n\nLast week, Communication and Sport Minister Anika Wells defended claiming expenses to attend major sporting events for herself and her husband under family reunion guidelines.\n\n\n\n\n\nThese include attending the Paralympics Australia Adaptive Festival where she claimed $3,000 for her husband and children to join her in Thredbo under the entitlements. The Guardian reported further family travel expenses to Melbourne for the AFL grand final in 2022, 2023, 2024 totalled $8,500.\n\n\n\n\n\nPrime Minister Anthony Albanese has asked for advice from the parliamentary expenses watchdog about travel spending, telling reporters on Friday that they'll take on the advice they receive.\n\n\n\n\"It's important that as parliamentarians we're not sort of deciding things for ourselves, because that would bring obvious criticism,\" he said.\n\n\n\n\n\nOpposition leader Sussan Ley has offered bipartisan support to reform the rules for politicians. Ley herself resigned in 2017 while serving as health minister after using taxpayer funds to fly to the Gold Coast to purchase property.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 20
  },
  {
    "url": "https://www.sbs.com.au/news/article/fine-supermarkets-for-excessive-pricing-of-groceries/yhmz3r7il",
    "title": "Supermarket giants face $10 million fines over price gouging",
    "publish_date": "Sat, 13 Dec 2025 22:47:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Consumers will be given added protection from price-gouging at the checkout, but Australia's major supermarkets have a six-month reprieve before the laws kick in.\n\n\n\n\n\nThe federal government has introduced rules to limit \"excessive pricing of groceries\" with changes to Australia's Food and Grocery Code of Conduct, which was made mandatory in April .\n\n\n\n\n\nThe move against price-gouging — foreshadowed before a snap consultation period earlier in the year — takes effect on 1 July.\n\n\n\n\n\nThe ban will prohibit very large retailers from charging prices that are excessive when compared to the cost of the supply, plus a reasonable margin.\n\n\n\n\n\n\"This is all about getting a fairer go for families and pensioners at the checkout,\" Treasurer Jim Chalmers told Sky News on Sunday morning.\n\n\n\n\n\n\"We're delivering what we promised when it comes to cracking down on price gouging.\"\n\n\n\n\n\nIn March, the Australian Competition and Consumer Commission found the near-duopoly enjoyed by Coles and Woolworths gave them little incentive to compete vigorously, noting they were among the most profitable supermarkets in the world .\n\n\n\nBut the report never directly accused the supermarkets of gouging customers, something both Coles and Woolworths have denied.\n\n\n\n\n\nIt did not make a finding on, or seek to define whether supermarket prices were \"excessive\", since high margins are not prohibited under consumer laws.\n\n\n\n\n\nFrom July, supermarkets could face fines of $10 million per breach, three times the value of the benefit derived or 10 per cent of the company's turnover during the preceding 12 months.\n\n\n\n\n\nThe commission will be responsible for policing the new regime.\n\n\n\nChalmers said the changes gave the competition watchdog the powers it needed to hold supermarkets to account.\n\n\n\n\n\n\"One of the best ways to ease the cost of living for Australians is to help people get fairer prices at the checkout and that's what this is all about,\" he said in a joint statement.\n\n\n\n\n\nThe consumer watchdog's report found grocery prices rose at more than double the rate of wages between late 2022 and early 2023, attributing at least some of those rises to additional profits for Coles, Woolworths and Aldi.\n\n\n\n\n\nA Woolworths Group spokesperson said in a statement to SBS News that they acknowledge the tabling of the regulation, however the law is \"unprecedented by targeting only two Australian-owned companies, creating an uneven playing field\".\n\n\n\n\n\nA Coles spokesperson also said that \"carving out large multinationals and other major players from this legislation does not reflect how Australians shop and risks weakening competition\".\n\n\n\n\n\nWhile the watchdog acknowledged the costs of doing business had risen, the supermarkets had increased their profit margins despite the disruption to supply chains caused by the COVID-19 pandemic, the report said.\n\n\n\n\n\nAldi's growth had acted as a handbrake on the duopoly, but the commission noted the German discount chain did not compete directly with them on all product lines.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-electric-air-taxi-prototype-released/ddntu8fkz",
    "title": "New electric air taxi prototype released",
    "publish_date": "Sat, 13 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWith its tinted wrap-around windscreen and multiple sky-bound rotors, it looks like a cross between a futuristic helicopter and an oversize drone.\n\n\n\n\n\nIn fact, it's an electric air taxi - called the Valo - freshly unveiled by British company Vertical Aerospace in London.\n\n\n\n\n\n\"So our mission at Vertical Aerospace is to deliver electric vertical take-off and landing to the masses. To provide point to point transportation.\"\n\n\n\n\n\nThat's Vertical Aerospace's chief engineer David King, laying out the company's ambitious vision behind its impressive prototype.\n\n\n\n\n\nThe Valo is just one version of what's called an Electric Vertical Take-Off and Landing aircraft - or evTOL.\n\n\n\n\n\nAs the name suggests, and a promotional video shows, it has the ability to take off vertically like a helicopter, but without the noise and pollution.\n\n\n\n\n\nThose in the industry, like Mr King, believe it could be the taxi of the future.\n\n\n\n\n\n\"One thing is now slower than it was ten years ago, 30 years ago, 50 years ago, and that's mobility. Mobility in and around populated areas just hasn't kept up. And the solution to that is to unlock the third dimension, it's air mobility, and to be able to provide that to the masses.\"\n\n\n\n\n\nThe Valo boasts luxury seating for up to six passengers and speeds of 240 kilometres an hour over distances up to 160 kilometres.\n\n\n\n\n\nVertical Aerospace test pilot Simon Davies says, it's a breeze to drive.\n\n\n\n\n\n\"Really it is super simple. You push forward on this lever. It makes you go forward. You pull back on the control stick. It makes you go up. And you just point using the tools you've got and looking out the window. And the aircraft works out how to make it all happen for you.\"\n\n\n\n\n\nIn Australia, the Civil Aviation Safety Authority CASA says it expects to see passenger transport services, or air taxis, up and running in urban areas between 2027 and 2029.\n\n\n\n\n\nClem Newton-Brown is the CEO of Skyportz, a Melbourne-based company that's developed a patented landing surface for electric air taxis that helps address practical concerns like noise and safety.\n\n\n\n\n\nHe says the era of air taxi travel is on its way, but the complex infrastructure and regulation required is still catching up.\n\n\n\n\n\n\"It's an evolution of the helicopter, which only becomes the revolution that they're talking about when there's a multitude of new landing sites, places such as shopping centers and offices and tourism destinations, things like that. And the problem with that is that landing aircraft in tighter urban locations produces a whole lot of issues around safety and amenity.\"\n\n\n\n\n\nThere is also scepticism from some about the commercial viability of the air taxi industry.\n\n\n\n\n\nRichard Aboulafia, from AeroDynamic Advisory, says it's a competitive market with limited funding.\n\n\n\n\n\n\"You know I want to live in a world where I can fly helicopters everywhere. I think most of society would check that box and say: 'Absolutely, get me above that traffic, get me there fast.' Unfortunately, the economics of flying vertically have been about the same for a really long time. And while Vertical has produced an interesting machine, a lot of impressive work going into it, the economics are about the same, maybe a little worse - we don't know - than flying in a helicopter. So it's the same challenges from a business perspective.\"\n\n\n\n\n\nVertical Aerospace, who has already received some 1,500 orders for its new Valo aircraft, is not deterred by the challenges.\n\n\n\n\n\nSkyportz CEO Clem Newton-Brown says China and the Middle East are moving rapidly on regulating air spaces for the growing industry.\n\n\n\n\n\nHe says while many aircraft will fail to get to market, developers at the forefront will soon make an impact.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/companies/wide-gold-hits-boost-early-us-mining-plan-for-dateline-20251215-p5nnth.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wide gold hits boost early US mining plan for Dateline",
    "publish_date": "Mon, 15 Dec 2025 13:16:22 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Dateline Resources has jagged another set of impressive high-grade gold intercepts from its ongoing drilling campaign at the company’s 100 per cent-owned Colosseum gold and rare earths project in California, adding further weight to the mineralisation model beneath the existing North Pit.\n\nThe latest results came from a reverse circulation (RC) drilling program testing depth extensions below the historic North and South pits and have delivered some eye-catching grades and widths.\n\nDateline Resources’ Colosseum pit in California\n\nStandout intercepts include a stellar 10.67-metre section running at 7.27 grams per tonne (g/t) gold within a broader intercept of 62.48m grading 2.52 grams per tonne (g/t) gold from 25.91m. Another hole returned a whopping 108.20m going at 1.18g/t gold, including 13.72m at a healthy 4.48g/t gold from just 9.14m depth.\n\nDateline says grades from these latest twelve RC holes have materially improved the continuity of mineralisation and, in several cases, returned grades that far exceed the current mineral resource estimate.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/nathan-lyon-was-filthy-in-brisbane-this-is-why-his-luck-s-about-to-turn-20251215-p5nnnx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nathan Lyon was ‘filthy’ in Brisbane. This is why his luck’s about to turn",
    "publish_date": "Mon, 15 Dec 2025 12:45:33 +1100",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "Adelaide: Nathan Lyon and spin bowling have been given a rallying cry by Adelaide Oval’s curator Damian Hough, who declared it is up to cricket’s turf custodians around the country to ensure that slow bowlers aren’t pushed out of the game by green pitches.\n\n“I don’t want to be the curator at Adelaide where you don’t pick a spinner. Spin needs to play a part here, it always has,” Hough said.\n\nNathan Lyon is expected to return to the Australian team in Adelaide. Credit: Getty Images\n\n“Even last year when he didn’t bowl a lot of overs, I felt that the pitch would have spun, but they were able to take wickets with the quicks. But spin needs to play a part in pitches around Australia, and we want it to play a part.”\n\nAustralia made a shock selection call for the second Test in Brisbane, leaving Lyon out of the team to play without a specialist spinner, instead opting for Michael Neser as a fourth seam bowler. Lyon admitted on the day he was “filthy” at that decision. But selection chair George Bailey virtually guaranteed on the spot that the veteran tweaker would play in Adelaide.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/national/nsw/three-minutes-of-footage-show-bondis-night-of-terror-20251214-p5nnlk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three minutes of footage show Bondi's night of terror",
    "publish_date": "Mon, 15 Dec 2025 12:28:13 +1100",
    "category": "finance",
    "authors": [],
    "text": "Three minutes of footage show Bondi's night of terror\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/aussie-darts-showman-doesnt-need-the-ashes-heat-20251215-p5nnsm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie darts showman doesn’t need the Ashes ‘Heat’",
    "publish_date": "Mon, 15 Dec 2025 12:25:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Cricket-loving Aussie darts thrower Damon Heta reckons discretion is the better part of valour as he’s decided against any flamboyant Ashes-themed walk-on antics that might get boisterous English crowds on his back at the world championships.\n\nPerth’s Damon Heta is known for his theatrical entrances. Credit: Getty Images\n\nThe popular Perth showman, known for his theatrical entrances to the oche, delighted in winding up the world matchplay crowd in Blackpool two years ago during the Ashes in full Aussie cricket kit, complete with bat and baggy green, and, naturally, got right royally jeered, even if good-naturedly.\n\nBut “The Heat” was in a much more sober mood before his fine 3-1 first-round win over Irishman Steve Lennon, evidently feeling a boozed-up crowd at London’s Alexandra Palace might not have taken as kindly to being reminded of England’s current Ashes plight Down Under.",
    "source": "TheAge",
    "cluster_id": 18
  }
]