[
    {
        "url": "https://www.9news.com.au/national/blind-vision-impaired-rideshare-subsidy-victoria-expanded-nationally-disability-news/d77ba9d1-d19d-43e7-816f-dc025e1b13cb",
        "title": "Why Caitlin waits 45 minutes for a taxi even when there's an Uber around the corner",
        "publish_date": "Sat, 02 Aug 2025 23:17:00 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "P﻿eople who are blind or have low vision are calling for rideshare services such as Uber to be included in taxi subsidy schemes across the country.\n\nState governments subsidise taxi services for people with eligible disabilities, via a special card or voucher that they show the driver, which reduces the cost of each trip.\n\nCurrently, Victoria is the only state that includes rideshare services in its scheme, allowing members to link their membership to their Uber account since 2021.﻿\n\nCaitlin McMorrow is blind and uses a guide dog. She has been forced to cancel medical appointments when taxis simply don't show up. (Supplied)\n\nCaitlin McMorrow, who lives in Redland City north of Brisbane, is totally blind and travels with a guide dog.\n\nShe said she's been forced to cancel medical appointments and social events when her taxi simply didn't show up.\n\n\"There's nothing more stressful than booking an appointment or having a social event planned, and then kind of constantly having that thought in the back of your mind of, 'Am I actually gonna be able to get there and get home again?' which is kind of where we're at with transport in Brisbane at the moment, it just isn't reliable,\" she told 9news.com.au.\n\n\"(With rideshare) you can see exactly where the vehicle is, you've got that kind of real-time communication with the driver, the payment system's all sort of done through the app.\n\n\"You can book an Uber and get one within four or five minutes.\n\n\"It's common that the taxi booking system will sit there for 45 minutes and still not find you one.\n\n\"That's a big difference when you're trying to be a busy, productive member of the community, I guess, and get your stuff done.\"\n\nAccording to Vision Australia, the NDIS guidelines around transport funding are inconsistently interpreted and many of its clients receive no funding.\n\nIt's also capped at $3500 a year, whereas taxi subsidy schemes are not.﻿\n\nBruce Maguire, Vision Australia's lead policy advisor, who lives in New South Wales, said he found rideshare \"more straightforward and less stressful\".\n\n\"As a blind person, when I get into a taxi I don't know what is going on the meter because we don't have talking taxi meters in New South Wales, so I have to take the driver's word for it,\" he said.\n\n\"And if I forget to tell him that I'm going to use the taxi transport subsidy and he doesn't turn the meter on, then I can't use it.\n\n\"You don't have any of those sorts of issues with rideshare.\n\n\"You can enjoy the trip and enjoy getting to your destination without that stress of wondering what's going to happen and what the fare might be and whether you're being told the correct meter amount and even whether the driver can accept the (subsidy) card or not.\"\n\nBruce Maguire, lead policy advisor for Vision Australia, wants to see rideshare services included in taxi subsidy schemes nationally. (Supplied)\n\nNational survey data from Vision Australia showed 59 per cent of respondents believed they would be more likely to use the scheme if it were expanded to rideshare.\n\nVision Australia general manager for corporate affairs and advocacy Chris Edwards said the survey reveals an urgent need for transport policy reform.\n\n\"For people who are blind or have low vision, accessible transport is not a luxury, it's an essential.\n\n\"We're not saying that rideshare services are perfect, for example we're continuing to work with the sector around the issue of dog guide refusals, but we believe states expanding their subsidy schemes to rideshare providers would have a significant benefit for our community.\"\n\nFor McMorrow, rideshare is as close as it gets to being able to jump in the car like a sighted person.\n\n\"As a blind person, I just want the same access to transport and to services that everybody else has,\" she said.﻿\n\n\"I think it's a reasonably simple thing that the government could do that would really improve choice of transport and access and consequently, quality of life, for vision-impaired people such as myself.\"\n\nIn a statement, Uber said it supports a \"﻿provider-neutral approach to taxi subsidy schemes across Australia\".\n\n\"Accessible and flexible transport is key to helping people with disabilities stay active, independent and connected.\n\n\"Since 2021, MPTP members in Victoria have experienced the benefits of subsidised Uber rides.\n\n\"We will continue to engage with advocacy groups and state governments to expand access to rideshare within government subsidy programs nationwide.\"\n\nA spokesman said Uber is conducting a 12-week T﻿ransport Subsidy Trial, with assistance from Vision Australia and Disability Voices Tasmania.\n\n\"We're offering people with disabilities the equivalent subsidy they'd receive through government schemes to use on the Uber platform, unlocking greater access to transportation options.\n\n\"We welcome more organisations across Australia to join the trial to help expand transport access for people with disabilities.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/whos-the-top-dog-waveriding-canines-compete-in-the-world-dog-surfing-championships/e24f5ad5-7074-4140-a5db-0e457be01fd8",
        "title": "Wave-riding canines compete in the World Dog Surfing Championships",
        "publish_date": "Sun, 03 Aug 2025 01:56:13 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "Charlie the 10-year-old yellow lab likes surfing so much, he'll grab his surfboard and run toward the water. His humans sometimes have to hide his board if they want to chat with friends on the beach.\n\nCharlie joined about 15 to 20 other dog wave riders in Pacifica, 22 kilometres south of San Francisco, on Saturday at the World Dog Surfing Championships, an annual contest that draws thousands of spectators to Pacifica State Beach.\n\nPooches competed against similarly sized peers for a chance to appear in the finals. Additional heats featured multiple dogs surfing tandem or riding with people.\n\nJeff Nieboer pushes Charlie Surfs Up through the breakers during the World Dog Surfing Championships. (AP)\n\nLabs, terriers and spaniels in monogrammed life vests dog-paddled out into the Pacific.\n\nOnce out on the waves, their owners helped them hop on colorful boards and hang ten as the crowd cheered from the beach.\n\nJudges scrutinised how long the dogs remained on their boards, how long they held their balance and whether they performed any tricks, like turning around while riding.\n\nCharlie, who has his own Instagram page, entered the extra-large single surfer heat.\n\nHe also rode tandem with two other dogs in what their humans called “The Dream Team.”\n\nFaith the surfing Pitbull gets pushed through the breakers by James Wall during the World Dog Surfing Championships. (AP)\n\n“He loves the crowd,” owner Maria Nieboer said.\n\nCharlie and Nieboer's husband, Jeff Nieboer, prepare for waves together. When Jeff spots a good one, he turns the board around and tells Charlie to “get ready\".\n\nHe pushes the board forward, and Charlie scrunches down and rides the wave as long as he can. Charlie can even steer the board by leaning and surfs toward an awaiting Maria on shore.\n\nHe doesn't have to be rewarded with treats for any of it.\n\n“Charlie does what Charlie wants to do once we’re in the water,” Jeff said.\n\nCoconut is pushed through the breakers during the World Dog Surfing Championships. (AP)\n\nContest winners received medals and bragging rights.\n\nCharlie's “Dream Team” compatriot, fellow yellow lab Rosie, was in four heats. The 4-year-old's owner, Steve Drottar, said she is “stoked” after they go surfing, which they do four to five times a week back home in Santa Cruz.\n\n“It’s like, hey, we actually did something today, right? We did something together as a team,\" Drottar said. “And the fact that you can do something as a team with your dog creates a different bond than you have when you just take your dog for a walk.”\n\nHe can tell Rosie feels a sense of accomplishment afterward because she is extra happy, wags her tail extra hard and snuggles even more than usual.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-northgate-man-killed-in-horror-fatal-crash/7ba5e3cd-3962-45e4-944c-77f99a72e500",
        "title": "Man dies after car crashes into tree in Brisbane",
        "publish_date": "Sun, 03 Aug 2025 00:12:23 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/rba-interchange-fee-cap-proposed-how-this-could-impact-credit-card-perks-reward-points/2eb51926-15ae-4f3b-831f-1cef804272b5",
        "title": "Aussies can breathe sigh of relief after $900 million credit card warning",
        "publish_date": "Fri, 01 Aug 2025 21:08:07 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "A payments expert has watered down fears the Reserve Bank's proposed ban on card surcharges and accompanying cap on interchange fees will force banks to roll back credit card perks like frequent flyer points.\n\nThe RBA's consultation paper on surcharges suggests capping the maximum interchange fee banks and service providers charge for card transactions.\n\nIt said the current fees paid by businesses to card providers are \"too high\".﻿\n\nThe RBA proposed a cap for interchange fees after claiming the current ones are \"too high\". (Nine/The Age)\n\nThose fees﻿ form large parts of bank and card provider revenue streams and pay for credit card perks like frequent flyer points.\n\nThe rewards are incredibly popular – more than a third of credit card spending in Australia is done on Qantas frequent flyer points-earning cards alone, according to the airline.\n\nThe RBA itself warned the programs could be scaled back in response to an interchange fee cap, which could deliver a hit of almost $1 billion.\n\nIt is important to note that American Express credit cards do not fall under the RBA's remit and won't be impacted.﻿\n\n\"Issuers are expected to experience a reduction in interchange revenue of around $900 million under the preferred package and $800 million under the alternate option,\" its consultation paper states.\n\n\"Some issuers may choose to increase cardholder fees or reduce benefits such as rewards points, particularly on credit cards, to boost their profitability in response to reductions in interchange settings,\" it adds.\n\nPayment Services managing director Brad Kelly told 9news.com.au the interchange fee is the \"holy grail\" for financial institutions.\n\nHe said the proposed cap could have a flow-on impact for customers but doesn't expect perks like Qantas points will be stripped back.\n\n\"What it will mean is that revenue bucket is just not big enough anymore to pay for rewards, so they're going to have to work out a different way to pay for it,\" Kelly explained.\n\n\"Potentially what will happen is is that rewards cards will evolve. It's not the end of frequent flyer points on rewards cards. Far from it.\"\n\nKelly said reward points may be offered to customers directly via merchants instead.\n\nBecause this, it could result in increased competition and better perks for spending money on credit cards.\n\n\"The customer could be better off,\" Kelly said.\n\nMoney saving expert Joel Gibson said rewards perks are often overvalued. (Today Extra)\n\n\"I also think there's opportunity for alternatives, where you still get your rewards per spend, but it's handled differently.\"\n\nMoney saving expert Joel Gibson said customers shouldn't be wary of losing perks.\n\nInstead, he warned other key features like scam protection could be impacted.﻿\n\n\"Reducing fraud protection would be a serious downside, for example,\" he said.\n\n\"But reducing the value of rewards programs would probably leave most people better off in my view.\"\n\nGibson said the average punter overvalues rewards.\n\nThe average credit limit in Australia is $10,439,﻿ which isn't a lot if you're hoping to score business-class flights on points alone.\n\n\"Most of us pay more in annual fees, merchant fees and interest than we get back in points, even if we don't realise it,\" he said.\n\n\"And most of us have no idea what a point is worth and the rewards programs make it hard to work out by giving them different values for different purchases.\"\n\nNone of the major banks approached by 9news.com.au said whether or not they are considering reducing card perks in response to the RBA reforms.\n\nIt has been suggested Apple Pay may be under threat if the surcharge ban goes ahead.\n\nAt least one major bank is considering pulling the pin on Apple Pay, the Australian Financial Review reported this month.\n\nKelly said banks won't pull the pin on Apple Pay. (Getty)\n\nKelly said he doubts any bank would risk such a huge chunk of their transactions.\n\n\"﻿Apple Pay now represents about 40 per cent of card payments in Australia,\" he said.\n\n\"There's no way [a bank] would switch off 40 per cent of its payment traffic.\"\n\nA feedback window on the RBA's proposals is open until August 26 this year, before the reforms are finalised.\n\nThey are scheduled to come into effect next July.﻿\n\nThere is a ﻿chance the surcharge fee ban could be passed onto customers, some business owners have warned.\n\nThe RBA has also proposed more transparency around fees by requiring providers to display their wholesale charges clearly.\n\n9news.com.au has contacted the Australian Banking Association for comment.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/pro-palestinian-march-sydney-melbourne-august-3/105605280",
        "title": "Live: Sydney Harbour Bridge closes to traffic ahead of pro-Palestinian march",
        "publish_date": "Sun, 03 Aug 2025 01:43:42 +0000",
        "category": "finance",
        "authors": [
            "Paulina Vidal",
            "Melissa Brown",
            "Luke Royes",
            "Anton Rose",
            "Elissa Steedman"
        ],
        "text": "Thousands are expected to walk across the Sydney Harbour Bridge as part of a pro-Palestinian march today.\n\nThe bridge will remain closed to traffic for several hours.\n\nFollow our live blog below for updates.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/broome-multicultural-history-son-ming-restaurant/105597744",
        "title": "Restaurant fire sparks end of an era for Broome's Chinese community",
        "publish_date": "Sun, 03 Aug 2025 01:14:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "After tens of thousands of meals over more than three decades in Western Australia's north, a devastating fire has forced the closure of Son Ming Chinese Restaurant.\n\nThe building's distinctive facade has been a fixture of Chinatown, the central business district in Broome, for more than 100 years.\n\nHong Yu's father-in-law ran the now heritage-listed building as a general store along Broome's Chinatown strip during the mid-to-late 1900s, before retiring.\n\nIts connection to the family remained strong in the intervening years, with Ms Yu eventually opening the restaurant, which she ran with husband Sam, in 1993.\n\nHong Yu says she will stay in her role as chairperson of the Chinese Community group in Broome. (ABC Kimberley: Ruby Littler)\n\n\"The others said, 'Your father's going to retire and you got no job, you got the shop there, how about changing it to the restaurant?'\" Ms Yu said.\n\nThe first English phrase Ms Yu learnt was \"What would you like?\" as she served behind the till and waited on tables.\n\nHistorical documents and photos were displayed in the restaurant when it was opened. (ABC Kimbereley: Ruby Littler)\n\nSon Ming became more than a place to eat, evolving into a gathering spot, a museum, and a living archive of Chinese-Australian history in Broome.\n\n\"I wanted people to know the Broome Chinese community had been here for a long time,\" Ms Yu said.\n\nAccidental fire\n\nBut after decades of service, a kitchen fire led to the restaurant's closure.\n\nLoading...\n\nIn late June, two people passing by jumped into action upon seeing smoke coming from the restaurant's kitchen.\n\nWhile the blaze was contained to the kitchen, sparing the rest of the property, Ms Yu said the incident was the straw that broke the camel's back.\n\n\"Suddenly, accidentally, by fire, the kitchen burned down, so we need to shut down,\" she said.\n\n\"I can't pay for it to be fixed.\"\n\nMulticultural roots\n\nThe closure represents a loss for Broome, a town with deep multicultural roots dating back to the late 1800s when the pearling industry drew people from China, Japan, Malaysia, and Indonesia.\n\nEuropean pearling masters successfully lobbied for Broome to be exempt from the White Australia Policy, creating a thriving multicultural community on the shores of Roebuck Bay.\n\nBroome had a majority Asian population for much of the first half of the 20th century.\n\nBroome's iconic Chinatown strip in the early 1900s. (Supplied: Broome Chinatown Revitalisation)\n\nBut only a few of the original family-run businesses in Chinatown remain.\n\nMs Yu curated a museum upstairs from the restaurant in a bid to preserve some of the history.\n\n\"When my father passed, I cleaned up and there were all these little photos I hadn't seen before,\" she said.\n\nAre Australians swapping honey chicken for hotpot? Photo shows a spread of freshly sliced meat, seafood and veggies surround a bubbling pot of chilli broth Lemon chicken and sweet and sour pork used to be some of Australia's favourite Chinese foods but new crowd-pleasers are changing the food scene.\n\nMs Yu led the local Chinese Community group in restoring graves in the Chinese cemetery, installing commemorative family names on plaques and coordinating events during Shinju Matsuri, the annual festival celebrating Broome's Asian heritage.\n\nDisappearing history\n\nFor many locals, the closure signals the end of an era.\n\nDoug Fong was born in Chinatown, just before the start of World War II, in a building across the street from what would become Son Ming.\n\nHong Yu has been instrumental in preserving Broome's Chinese heritage, according to Margaret and Doug Fong. (ABC Kimberley: Ruby Littler)\n\n\"Inside the store, they had so many things on their walls depicting Chinese society living in Broome,\" he said.\n\n\" It'll be quite a sad loss for the history of Chinatown when they close down completely. \"\n\nMr Fong said he feared people would forget the culture that gave the town its prominence, with younger generations moving away for work and education opportunities.\n\n\"Broome being such a multicultural town, we need to be part of keeping that attitude going,\" he said.\n\nHis wife Margaret said the closure felt like a piece of the town's Chinese history was \"disappearing\".\n\nMs Yu will continue as chairperson of the Chinese Community group, but said she was unsure what the future held after the restaurant closed.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/japan-rent-grandma-loneliness-epidemic-unemployment/105584684",
        "title": "Elderly women in Japan are keeping themselves employed as grandmas-for-hire",
        "publish_date": "Sun, 03 Aug 2025 00:44:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "As a grandmother-for-hire, 69-year-old Taeko Kaji performs a variety of tasks — from cleaning to cooking to giving life advice.\n\n\"I never get bored,\" the Tokyo resident told the ABC.\n\n\" I get to go out and have these experiences and that's why taking this job was the right decision for me. \"\n\nJapan is experiencing what some have called a \"loneliness epidemic\".\n\nGrandmother-for-hire services allow people to experience what it is like to have an older woman care for them in a maternal way, for as little as $60 a visit.\n\nThey also provide a work opportunity in a society that usually does not value the skills and experience of older women.\n\nMs Kaji said she wanted to find a job to keep her busy after her dog died.\n\nThe only option she could find for a woman at her age was to be a cleaner.\n\nThat was until her daughter came across a company that hired older women to play the role of grandmother for strangers.\n\nBesides working as grandmothers-for-hire, Client Partner's older staff also provide care and emotional support to people their own age. (Supplied: Client Partners)\n\nMs Kaji is employed by Client Partners, a \"women-only handyman\" company that is run by women and employs only women.\n\nClient Partners started the OK!Obaachan (OK!Grandmother) service in 2011, hoping to tackle problems that women were suited for.\n\n\"There were so many male handymen, and we knew that the market was saturated,\" chief executive Ruri Kanazawa told the ABC.\n\n\"Just adding the word 'female' [to the business] really opened up the market.\"\n\nOf the company's approximately 300-400 staff, about 80 are over the age of 60.\n\nNot just grandmothers\n\nClient Partners currently employs approximately 300-400 staff members, with about 80 of them over the age of 60. (Supplied: Client Partners)\n\nOther services the company offers include interpreters and tourist guides, or even renting a friend or an aunt.\n\nThey say they get a wide range of customers, from men and women in their 20s to people in their 70s.\n\nMs Kaji said one client, who was about the same age as her, hired her to pack their expensive tableware.\n\nKaori Okano says Client Partners provides opportunities that are valuable for some older women. (Supplied: Kaori Okano)\n\nMs Kanazawa said the emotional support they provided was what made their company stand out from other \"handyman companies\".\n\nShe said many of their clients sought their services because it could be hard for them to \"ask for help even for things that could be solved between relatives or family members\".\n\n\"Some people may be abused, and some people may never have had a mother in the first place,\" she said.\n\n\"Our grandmother staff members, who cook for the guests and act like a mother to them, help provide the motherly warmth they need.\"\n\nKaori Okano, a professor of Asian Studies and Japanese at La Trobe University, studies gender relations in Japan.\n\nShe said the company provided valuable opportunities for some older women.\n\n\"These organisations value 'housewife' skills,\" said Professor Okano.\n\n\"It gives a sense of self-fulfilment to these women who were previously unemployed that they can be useful and valued by other people.\"\n\nOlder women left behind\n\nRuri Kanazawa says Client Partners founder Maki Abe saw \"a gaping hole that no one else was doing which was mental support\" . (Supplied: Client Partners)\n\nIn Japan, retirees can receive income from employee pension schemes, similar to superannuation in Australia, and the national basic pension scheme.\n\nTo be eligible for the pension, they need to have contributed to it through work, or their husband must have made contributions to their own employee pension scheme.\n\nProfessor Okano said this meant some women might get less pension if they were not married or if they did not have regular income.\n\n\"The dominant trend two decades ago was that women would quit their jobs and stay at home after they got married and had kids,\" she said.\n\n\"And once their kids start school, they re-enter the workforce in casual or contract roles, also known as non-regular work.\"\n\nWhile Japanese mothers have been able to participate more fully in the workforce thanks to improved maternity leave and childcare, there is still a gender gap.\n\nJapan's 2024 Labour Force Survey found that the number of women with regular employment still peaked at 25-34 years old.\n\nEriko Teramura, who is the professor of human resource management and labour economics at Japan's Meikai University, said she expected the number of older women in the workforce to increase.\n\n\"Older women often have long periods of unemployment or part-time work, limiting their accumulation of work skills,\" Professor Teramura told the ABC.\n\n\" It's unlikely that many older women can survive on their own pensions alone. \"\n\nJapan's ageing future\n\nJapan has one of the world's oldest populations, with approximately 30 per cent of citizens aged over 65 years old. (Reuters: Issei Kato)\n\nAccording to Professor Teramura, companies like Client Partners demonstrated the growing need for \"social innovation that combines caregiving, community, and employment\".\n\n\"Contributing to society through life experience, emotional labour, and communication skills can provide purpose and income for older women,\" she said.\n\nOECD economists have warned that the decline in the working-age population in Japan could impact its economic growth.\n\nJapan's Sanseito party surges with anti-foreigner election win Photo shows A crowd of men and women, some with Japanese flags. The once fringe Sanseito has become the fourth largest opposition party in parliament by pushing a nationalist \"Japanese First\" agenda.\n\nTo counter this, they have recommended closing the gender gap in employment and increasing immigration.\n\nThe Japanese government has made some efforts to address these labour gender disparities.\n\nA recent amendment to the Promotion of Women’s Active Engagement in Professional Life Act will force companies to be transparent about their gender pay gap, as well as their share of women in managerial positions, from April 2026.\n\nMs Kanazawa said working with her older colleagues has made her optimistic about Japan's future.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/womens-british-open-minjee-lee-and-kyriacou-make-moves/105606706",
        "title": "Lee and Kyriacou make strong moves at the Women's British Open",
        "publish_date": "Sun, 03 Aug 2025 00:43:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Victory looks a stretch for either of them, but Aussies Minjee Lee and Steph Kyriacou both motored up the leaderboard on the third day of the Women's British Open.\n\n\"I had a nice day. I felt like I moved on moving day. I hoped I could close the gap a little bit with the people teeing off now and a little bit later,\" said Lee, who shot a 68 to move to two under par.\n\nKyriacou, whose sensational hole-in-one stole the headlines on Friday, carded a 69 and shares 11th place on three under.\n\nConditions remained challenging at Royal Porthcawl in Wales, and Japan's Miyu Yamashita maintained her lead despite stumbling to a two-over 74.\n\nYamashita is at nine under, but her advantage was narrowed to a single shot heading into tonight's (AEST) final round.\n\nA Lim Kim of South Korea moved into second place at eight under, with American Andrea Lee third on seven under.\n\nSteph Kyriacou leads the way for Australia, tied in 11th place. (Getty Images: PA Images/Nigel French)\n\nAustralian Lee was an early starter alongside compatriot Grace Kim, the only other Aussie who had made the cut, whose 74 left her well adrift on four over.\n\n\"I missed putts on two and three, obviously 18,\" Lee said.\n\n\"Had a lot of really great looks out there. I feel like the short ones, I'm over-reading them a little bit.\n\n\"It's kind of tough because you think the surface is not going to break, but sometimes it really does break. It's just the way links golf is. Sometimes it's hard to pick the breaks.\"\n\nKim produced one of the most thrilling finishes in major championship history last month to win the Evian Championship.\n\n\"I think, for Grace, it's probably too close to her winning so far. She's probably still a little bit on the high,\" Lee said.\n\n\"She's only had one week off and had to play the next two. It's probably maybe when we have two weeks off next week, she'll be able to really relax and soak it more in maybe.\"\n\nAs for her own chances on Sunday, Lee said she felt she was too far back.\n\nAustralia's Grace Kim has struggled on the back of her incredible Evian Championship victory. (Getty Images: Richard Heathcote)\n\n\"I think tomorrow is going to be go as low as I can. I'm probably too far back,\" she said.\n\nAfter her rollercoaster round on Friday, Kyriacou, who made four birdies, said she had barely looked at the leaderboard.\n\n\"Yes, definitely not as exciting. I mean, it's not a bad thing,\" she said.\n\n\"Less bogeys on the card, which was a goal today. I haven't really checked the leaderboard yet. I assume I moved up in this wind.\n\n\"I dropped one today. I dropped four yesterday, which was quite rough.\n\n\"I'm pretty sure I have to chase, foot on the gas. The same goals as the last couple days. I think I said this yesterday, but you just have to be brave and play with the elements out there.\"\n\nA group of four tied for fourth place at six under included Japan's Minami Katsu and Rio Takeda, England's Charley Hull and American Megan Khang.\n\nYamashita and Takeda, who was alone in second place through two rounds, were the only members of the top 10 on the leaderboard to shoot over-par. Takeda, Yamashita's playing partner, also was two over.\n\nWorld number one Nelly Korda stumbled to a 74 to leave her at even par for the tournament in a tie for 36th place.\n\nDefending champion Lydia Ko of New Zealand shot a two-under 70 and was also tied for 36th at even par.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/sally-mcmanus-negative-gearing-capital-gains-tax-reform/105606474",
        "title": "Union boss calls for one property limit on negative gearing tax breaks",
        "publish_date": "Sun, 03 Aug 2025 00:19:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian Council of Trade Unions will call for bold changes to negative gearing and the capital gains tax at the government's productivity roundtable this month, arguing the tax breaks be limited to one investment property.\n\nUnder the proposal, the current arrangements would continue for five years to allow investors time to rethink their portfolios before the changes come into force.\n\nThe issue is politically fraught for Labor, who took reforms to negative gearing and capital gains to the 2016 and 2019 federal elections and lost.\n\nBut ACTU secretary Sally McManus told ABC's Insiders it was time to \"bite the bullet\".\n\n\"Otherwise, we're just saying 'too bad young people, you're not going to be able to ever own a home',\" she said.\n\n\"Since 2019, the problem has just got worse. It's going to continue to get worse unless the government is brave enough to do something about it.\"\n\nLoading...\n\nNegative gearing refers to a policy that allows investment property owners to deduct losses from rental properties from their overall taxable income, while the capital gains tax discount lowers the rate of tax paid when houses and shares are sold.\n\nNearly half of all Australian landlords had negatively geared properties, according to figures released in December, with the highest earners hauling in tens of billions of dollars from tax concessions and loopholes.\n\nThe ACTU's proposal would raise about $1.5 billion in tax revenue each year, according to Ms McManus, who added that those with investment properties would have time to adjust their portfolios.\n\n\"Part of the problem is that we've been keeping a whole lot of capital in housing. And it's not those people's fault. They've done that because it has worked for them and they've made smart decisions around that,\" she said.\n\n\"But it's also meant that capital is not being invested in areas that are going to increase productivity, like Australian businesses and other ways that it can be invested.\"\n\nWe're talking about negative gearing again, but why is it such a big deal? Photo shows Houses under construction on a bright, sunny day The policy that just won't quit is back. Will Labor revisit its 2016 and 2019 election policies?\n\nAhead of this year's election, Prime Minister Anthony Albanese hosed down speculation Labor was planning to scale back the tax breaks after it emerged that Treasurer Jim Chalmers requested his department to model the impact of changes to the concessions.\n\nAsked if he would rule out future changes to the policies in April, Mr Albanese said: \"I've done that multiple times ... and if you ask me tomorrow, we'll get the same answer.\"\n\nMs McManus did not divulge whether she believed the government, after its landslide victory earlier this year, would back the proposal but stressed that the union would \"go and argue it\".\n\n\"In the end, the government will make their decisions based on what they think is in the national interest. We would say that it is in the national interest,\" she said.\n\nThe union — which represents about 1.8 million workers — will also propose a 25 per cent minimum tax rate for people who earn over $1 million, which would also apply to family trusts.\n\nIt will also argue for a new export levy of 25 per cent of the revenue from the sale of liquified natural gas, instead of the current Petroleum Resource Rent Tax on oil and gas exploration.\n\nMr Chalmers has signalled he will use the three-day roundtable to seek new economic reforms, prioritising \"consensus\" among unions, business and economists.\n\nHe has said he wants any reform proposals brought to the roundtable to be budget neutral or budget positive but that all ideas are on the table.\n\nEarlier this week, the Productivity Commission released the first of several reports requested by Mr Chalmers in the lead-up to the roundtable, in which it called for a 20 per cent tax rate on profits for companies with revenue of up to $1 billion.\n\nThat would represent a significant cut for all but the largest companies from the current rate, which is 25 per cent for companies with turnover under $50 million and 30 per cent for all others.\n\nIt also called for a new 5 per cent tax on net cashflow rather than profits, which could see some large companies pay a higher rate but would provide immediate tax relief for smaller companies seeking to build their capital.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/ambulance-ramping-exposes-deeper-problems-in-wa-health-system/105604616",
        "title": "Amid record ambulance ramping, WA faces a wicked problem",
        "publish_date": "Sun, 03 Aug 2025 00:10:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Across Western Australia, ambulances spent more than 7,000 hours parked outside the state's hospitals last month.\n\nThat figure breaks all previous records — even those set during the height of COVID.\n\nIt goes without saying, that's a big problem.\n\nThose ambulance crews aren't on the road answering other calls, and patients are receiving less-than-ideal care.\n\nIn the grand scheme of the behemoth that is Western Australia's health system, it is also a symptom of much deeper problems, according to experts.\n\nThe first problem is the state does not have enough hospital beds to meet demand.\n\nOn the most recent data (up to mid-2023) Western Australia had the second-lowest rate of hospital beds based on population out of all states and territories.\n\nFor comparison, if WA had the same ratio of beds per person as the highest state – Tasmania – it would have had an extra 1,500 or so places.\n\n“We’ve delivered over 900 beds to the hospital system since 2021, we’ve increased staff by 30 per cent and we’re looking at innovative ways that we can deliver care,” Health Minister Meredith Hammat said on Friday.\n\nMeredith Hammat says the government is attacking the problem from all angles. (ABC News: Keane Bourke)\n\nBut the state still needed “at least 1,000 more beds”, according to the Australian Medical Association.\n\n“At the end of the day, we need more beds. We need more capacity in our health system. It really can’t get any simpler than that,” WA President Kyle Hoath said.\n\nThose beds can take a long time to build and bring online – not the solution you want in the middle of an immediate crisis.\n\nThere’s also the problem, the government says, of too many beds being taken up by people who could be in aged care.\n\nBut solving the problems in that sector is not quick or straightforward, either.\n\nSpare capacity\n\nDr Hoath’s solution was to look to private hospitals and medi-hotels, where he said there was spare capacity.\n\n“There are beds there that could be used as hospital beds and we need to take advantage of that,” he said.\n\nKyle Hoath says the main problem is a lack of beds. (ABC News: Keane Bourke)\n\nMs Hammat wasn’t giving away whether she thought that was a good idea though.\n\n\"We're looking at everything we can do, we're attacking it from every angle,\" she said.\n\nIt was a similar answer she gave to almost every question – repeating that phrase 17 times in about 14 minutes while offering no new ideas on how to tackle the problem.\n\nIncreased load\n\nThe second problem ramping reveals, according to Dr Hoath, is that the hospital system does not have the capacity to handle the increased load of serious illness presenting to emergency departments.\n\nFamily details tragedy of little girl who died from flu Photo shows A black and white photo of a toddler with a computerised image of a frame and daisies Experts urge people to get vaccinated against the flu, after the death of a little girl from the virus in Perth.\n\nIn responding to the grim total, Ms Hammat pointed to the government’s efforts to divert people away from hospitals as a success.\n\nThe minister singled out the Virtual Emergency Department program, which connects patients with doctors before they reach hospital.\n\nShe said a trial of the program enabled 74 per cent of people who called for an ambulance to receive care without going to an emergency department.\n\nThat could help explain why the number of semi-urgent and non-urgent cases in WA’s emergency departments reduced by about 10 per cent between 2020-21 and 2023-24.\n\nBut it was not enough to offset a 15 per cent increase in the two most serious categories – resuscitation and emergency – over that same period.\n\n“Where people may have presented with severe diabetes in the past, they’re now presenting in renal failure and needing a transplant,” Dr Hoath said.\n\n“People are more unwell because they’re not getting the care they need at the right time.”\n\nThat’s a tricky problem to solve but would likely be helped in the long run by increased bulk billing rates – which the federal government could face an uphill battle to do – and more care in the community, rather than in hospitals.\n\nBut that’s also much easier said than done.\n\n'Think about health'\n\nThe opposition was squeezing the terrible report card on WA’s health system for every political point it could on Friday.\n\n“Don’t build race tracks, don’t build movie studios, don’t do those other things,” leader Basil Zempilas said.\n\nBasil Zempilas has called on the government to make health its focus. (ABC News: Courtney Withers)\n\n“My strongest advice for the premier would be: make it your number-one focus.\n\n“That means every day when you get up, and you drive up from Kwinana, don’t think about other projects.\n\n“Think about health. Make that your job, your responsibility, until the people of Western Australia know that ambulance ramping is on the way down.”\n\nIt’s an idea many would challenge. Governments can, and do, handle doing many things at the same time, while prioritising some issues over others.\n\nBut shadow health spokesperson Libby Mettam made a point many would agree with.\n\n“How is it in a state as wealthy as Western Australia that we have such a crumbling health system?” she asked.\n\nNo quick fixes\n\nThe answer is there’s no simple answer.\n\nBuilding a health system which can meet the growing demands of a rapidly aging population is one of the most wicked problems governments across Australia face.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nAdd in a worse-than-usual flu season with low vaccination rates and there’s little surprise hospitals are so full.\n\nEarlier last week, having investigated the deaths of three people who passed away while ramped, a South Australian Coroner called on that state’s government to acknowledge ramping is “a reality that all modern healthcare systems encounter”.\n\n“While efforts to reduce the levels of ramping remain extremely important, efforts must also be made to make the process of ramping safer for those patients who will inevitably experience it,” Acting Deputy State Coroner Ian White concluded.\n\nThat might be an unpalatable answer for many.\n\nBut if growing demand for healthcare continues to massively outstrip government’s ability to meet it, that focus might make the best of a bad situation until the effects of wider reforms start to be felt.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/wnba-fan-arrested-after-throwing-sex-toy-on-court/105606600",
        "title": "Arrest made after sex toys are thrown on court in separate WNBA incidents",
        "publish_date": "Sun, 03 Aug 2025 00:04:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "The WNBA has revealed that an individual who threw a sex toy onto the court at an Atlanta Dream game earlier in the week was arrested, and that any person throwing objects onto the court will be ejected from the arena and face a minimum one-year ban.\n\nThe incident in Atlanta occurred late in the fourth quarter of the Dream's game against Golden State on Tuesday in College Park, Georgia.\n\nLater in the week, another sex toy was thrown in Chicago under the hoop after a whistle was blown to stop play during the third quarter of Golden State's 73-66 victory over the Sky.\n\nAn official kicked the object aside before it was picked up and removed.\n\nIt is unknown if the fan who threw the object at the Sky game was arrested.\n\n\"The safety and wellbeing of everyone in our arenas is a top priority for our league. Objects of any kind thrown onto the court or in the seating area can pose a safety risk for players, game officials, and fans,\" the league said in a statement.\n\n\"In line with WNBA Arena Security Standards, any fan who intentionally throws an object onto the court will be immediately ejected and face a minimum one-year ban in addition to being subject to arrest and prosecution by local authorities.\"\n\nPlayers were left angry that more had not been done to stop the incidents.\n\n\"It's super disrespectful,\" Sky centre Elizabeth Williams said.\n\n\"I don't really get the point of it. It's really immature. Whoever is doing it needs to grow up.\"\n\nNew York Liberty forward Isabelle Harrison commented on social media about the situation on Friday.\n\n\"ARENA SECURITY?! Hello??!\" Harrison said on X.\n\n\"Please do better. It's not funny. Never was funny. Throwing ANYTHING on the court is so dangerous.\"\n\nWNBA arenas have security procedures, with many having either a no-bag policy or some allowing clear bags, often limited in size. Every bag is subject to search upon arena entry.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/bookshop-in-water-tower-unique-australian-buildings-century-old/105566554",
        "title": "Victoria's newest bookstore opens in century-old water tower",
        "publish_date": "Sun, 03 Aug 2025 00:00:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "With its towering, cylindrical form and circular internal shelves, booklovers who enter regional Victoria's newest bookshop have to be willing to fossick for titles in a confined space.\n\nWodonga's 100-year-old water tower has been transformed into a second-hand book store by Melissa Boyes.\n\nFor decades, the water tower housed a shoe repair business but has sat empty for the past year.\n\nMelissa Boyes has created a bookstore inside a water tower at Wodonga. (ABC Goulburn Murray: Philippe Perez)\n\n\"When we first took occupancy, it was very empty and echoey … we've tried to soften it with a bit of carpet, and obviously a lot of books,\" Ms Boyes said.\n\n\" It's been a bit of a slog … we wanted to change it from that empty concrete cylinder into something nice, colourful and cosy where people can hang out. \"\n\nMelissa Boyes has a history of opening bookshops in unique spaces. (ABC Goulburn Murray: Philippe Perez)\n\nWhen the local council asked for expressions of interest for people to occupy the space, Ms Boyes knew a bookshop was the answer.\n\nShe had experience in such ventures, having opened her first bookshop in an old tobacco shed on her farm in north-east Victoria.\n\n\"You can squeeze bookshelves in anywhere, and you can make do with the space that you have,\" she said.\n\nIt's thought the shed was built in the 1930s and was used to dry tobacco and store hay. (ABC Goulburn Murray: Allison Jess)\n\nHidden treasures in Port Fairy\n\nIn Victoria's south west, Jo Canham had just finished an arts degree in literature and criminology when she decided to ditch a career in the justice system and open a bookshop instead.\n\nJo Canham opened Blarney Books in Port Fairy 20 years ago. (ABC News: Jean Bell)\n\nIn 2004, she moved to Port Fairy where she transformed an old Masonic Lodge into a bookshop.\n\n\"It had previously operated as a church and youth centre, so there were crosses, bibles and even a step-into baptismal font,\" Ms Canham said.\n\nBlarney Books is one of two bookstores in Port Fairy, south-west Victoria. (ABC News: Jean Bell)\n\n\" The dreams just started coming to me then, and we pictured turning it into something fun. \"\n\nHer store, Blarney Books & Art, was also once home to a bowling alley that ran the entire length of the hall.\n\nJo Carnham's bookstore in Port Fairy was once a masonic hall. (Supplied: Jo Carnham)\n\n\"We considered for a while whether we should have a combined books and bowling spot, but it was incredibly loud,\" she said.\n\n\"We've chopped it up, used it for tables, benches, and other things, so it hasn't been wasted.\"\n\nBooks rather than beers\n\nA health scare and the need for a tree change inspired Ann and Paul Smith to open a little bookshop in a quaint gold rush town on the outskirts of Castlemaine in central Victoria.\n\nAnn Smith owns a second-hand bookstore in a former hotel building near Castlemaine. (ABC Goulburn Murray: Philippe Perez)\n\nMr Smith had previously managed a bookshop in Melbourne for Frank Cheshire before purchasing the 1854 Bath Arms Hotel at Campbell's Creek in 1994.\n\n\"There was already a good, new bookshop in Castlemaine, so we thought we'd be the good second-hand bookshop,\" Ms Smith said.\n\nThis former hotel near Castlemaine houses 150,000 second-hand books. (ABC Goulburn Murray: Philippe Perez)\n\n\" It's called Book Heaven because that's where the good books go; the bad books go to hell. \"\n\nNow, the renovated building houses approximately 150,000 books in nine rooms.\n\n\"It's probably the biggest second-hand bookshop in Australia now, I think,\" Ms Smith said.\n\nGiving back to the community\n\nBruce Brine (left), Heather Jameson, and Ethan Piddington at Quercus Bookshop in Beechworth. (ABC Goulburn Murray: Philippe Perez)\n\nWater towers and watering holes are not the only heritage buildings in Victoria being repurposed as bookshops — there are old school buildings too.\n\nAt Beechworth, in Victoria's north east, a former schoolroom and chapel for the Wesleyan church built in 1854 now houses the Quercus Bookshop.\n\nThe volunteer-run social enterprise has operated as a second-hand bookstore alongside an opportunity shop since 2008.\n\nQuercus Beechworth volunteers Bruce Brine and Ethan Piddington with Heather Jameson. (ABC Goulburn Murray: Philippe Perez)\n\n\"It's a space where community can come together, and we offer community activities and support programs,\" operations manager Heather Jameson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/jake-weatherald-darwin-cricketer-international-debut-sport/105602082",
        "title": "Darwin-born professional cricketer shines in home-game debut",
        "publish_date": "Sat, 02 Aug 2025 23:48:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "On a sunny Saturday afternoon in Darwin, an oval ringed with palm trees and a sea breeze plays host to a local cricket match.\n\nThe crack of leather meeting wood rings across the grounds, followed by cheers of support — \"Way to go Weathers\" — and a smattering of applause.\n\nJake Weatherald is batting for Darwin Cricket Club, 15 years after he moved south to pursue his dream of becoming a professional cricketer.\n\nA young Jake Weatherald during his first cricket match at Casuarina Middle School in Darwin. (Supplied: Ian Crundall)\n\nThe 30-year-old Territorian returned to his home club in preparation for last month's international debut for Australia A vs Sri Lanka A at Marrara, where he did the home crowd proud.\n\n\"To be here and play in front of some locals, my family members, and people I've grown up with — it's a pretty cool experience,\" he said.\n\nThe left-handed opening batsman scored 183 in the second unofficial Test, showing he can more than hold his own in the international arena.\n\nHe said growing up in Darwin gave him opportunities to learn and challenge himself.\n\n\"I think the clubs up here do a really good job of playing their juniors at a young age, which is something that I think is really important to becoming a better cricketer,\" Weatherald said.\n\nWeatherald batting for Australia A against Sri Lanka A at Darwin's Mararra Stadium last month. (Supplied: Cricket Australia)\n\nHe's part of the golden generation of NT juniors, joining the likes of D'Arcy Short, Tom Andrews and Kane Richardson — all professional cricketers home-grown in the territory.\n\n\"I had a lot of other guys that I grew up with that went on to play first class cricket, so we sort of created a bit of a bubble and had some really good coaches, really supportive people around us,\" Weatherald said.\n\nHis journey to international cricket progressed at a steady pace and had its challenges.\n\nHe said the support of his wife and family, and the Darwin cricket community, helped to keep him focused.\n\nThe fact that Weatherald's dad was into sport gave him the opportunity to try different things, but at the same time he always backed his son academically.\n\nJake's dad enabled him to live and breathe sport from a young age. (Supplied: Ian Crundall)\n\n\"He provided a lot of support in terms of he's just being himself, just providing a little love, a lot of care and a shoulder to cry on when I wasn't doing so well,\" the professional cricketer said.\n\nWeatherald said he also owed a lot to his mum and step-dad, who provided support for him to go south for boarding school and had moved to Adelaide to be close by.\n\nWhen he finished school and started to drift off course, it was his mum who steered him back.\n\n\"Mum sort of pulled me aside and said, 'You need to sort yourself out if you want to become professional cricketer, you can't do it later in life',\" Weatherald said.\n\nJake's mum was a source of encouragement on his journey to becoming a professional cricketer. (Supplied: Ian Crundall)\n\nBut it was his return to Darwin's cricket community that he remembered being a defining moment in life.\n\n\"I was lucky, there was a guy called Tony Judd up here that said, 'If you want to come train full-time with me, you can come play for Tracy Village. I'll work with you every day',\" Weatherald said.\n\n\"So I made a commitment to come up here every day … did everything I possibly could, and it just moulded me into the cricketer I became.\"\n\nWeatherald (seated, far left) with the Australia A cricket team. (Supplied: Cricket Australia)\n\nBy 21, he was playing first class cricket. Weatherald said Darwin gave him a place to train and play in southern winter months when the summer cricket season had finished.\n\nHe said the territory offered great facilities and coaches, plus the caring community a young cricketer needed.\n\n\"I think the community in the territory has got the best interests of the players here,\" he said.\n\n\"That's something that might fall through the cracks down south.\"\n\nWeatherald scored 54 and 183 in two matches for Australia A against Sri Lanka A. (Supplied: Cricket Australia)\n\nWeatherald's cricket career includes featuring in the Sheffield Shield for Tasmania and South Australia and starring in the Big Bash with the likes of the Adelaide Strikers and Hobart Hurricanes.\n\nHe said Tassie had similarities to the territory. Both serve as a place where you feel like you know everyone — with a supportive community to be a part of — and, of course, the love of fishing too.\n\n\"Obviously, the weather's different but it's very relaxed,\" he said of the island state.\n\n\"Everything's done at a pretty slow pace. Everyone's really nice, which I'm really happy about\"\n\nAs for his proudest achievement — Weatherald's quick to answer: it's definitely his wife Rachel.\n\nJake Weatherald with his then-fiancée Rachel in Paris where they got engaged. (Supplied)\n\nBut, from a cricket point of view, it's just playing professional sport in general.\n\n\"To actually live out that dream and repay my family, for making all the sacrifices and all the hours they spent bringing me to games and paying all that money to travel down south — I think that's the thing I'm proud about the most,\" he said.\n\nBy all accounts, Jake Weatherald has never been in better form.\n\nHaving impressed with Australia A, now he's driven to break his way into Australia's top side, led by Pat Cummins.\n\n\"Thankfully, now that I'm 30, I feel like my game's at a point of — and my mindset's in a place where — I feel as if I can be the best version of myself,\" he said.\n\n\"Whether that takes me to the top of the Test cricket, or that means this is the highest I get to, I feel as though I'm getting the best out of myself at the moment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/port-gregory-landlocked-jetty-call-for-wa-government-help/105591658",
        "title": "People once fished off this jetty. Now there's nothing but sand",
        "publish_date": "Sat, 02 Aug 2025 23:20:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sitting on the edge of his local jetty, seven-year-old Jye Gleghorn's feet dangle above hard sand.\n\nBut he imagines an ocean beneath him.\n\nLocals are sad to see the Port Gregory jetty in such a state. (ABC Landline: Chris Lewis)\n\nIt is a place where he can connect to his late father, Beau, who once sat on the same wooden planks at Port Gregory, 527 kilometres north of Perth along Western Australia's Mid West coast.\n\n\"My dad used to ride his bike off [the jetty] and do front flips and back flips, and the jump was right here,\" he said, patting the edge of the jetty,\" Jye said.\n\n\"They used to [swim] under the jetty. Sometimes they'd get the crabs.\"\n\nWhen Jye's dad was alive, the jetty was surrounded by water and filled with marine life.\n\nOnce a beloved spot for both locals and tourists, the Port Gregory jetty holds fond memories for many. (Supplied: Clara Harris)\n\nNow, more and more sand billows across its wooden planks every day, slowly but surely marooning what was once a treasured place of work and play for the small fishing town.\n\nJye's great-aunt, Nat Schultz, wants him to be able to share the childhood experiences of her nephew and other local children who grew up \"jetty jumping\".\n\nJye Gleghorn loved hearing stories of his dad leaping off the Port Gregory jetty back when he was Jye's age. (ABC Landline: Chris Lewis)\n\n\"Port Gregory was his favourite place. He used to love coming up here fishing, going out on the boat, netting — he just loved Port Gregory,\" Ms Schultz said.\n\n\"At night-time in summer and over the Easter break, this jetty would be full of people.\n\n\"The kids would walk down at night-time, it was a hangout place, they loved it. It was their happy place to be able to come, and now they can't do that anymore.\"\n\nNat Schultz is advocating for the repair of the Port Gregory Jetty. (ABC Landline: Chris Lewis)\n\nJust three weeks after his father died, Jye also lost his mother.\n\n\"Jye has had a massive tragedy in his life. I want his mental health to be happy,\" Ms Schultz said.\n\n\"This is where the memories of his dad come from, and we talk about Beau and Sarah all the time.\"\n\nJye Gleghorn associates the jetty closely with his parents. (ABC Landline: Chris Lewis)\n\nA growing beach\n\nIn a region where the threat of the ocean swallowing buildings and infrastructure looms as a multi-million-dollar issue, Port Gregory faces the opposite challenge.\n\nIts beach is growing, with sand now surrounding the jetty and blanketing beach shelters.\n\nLocals, like lobster fisher Colin Suckling, have had enough.\n\nColin Suckling has been calling on the state government to do something about the Port Gregory jetty for years. (ABC Landline: Chris Lewis)\n\n\"It's embarrassing to have a jetty that people can't walk out and actually walk over water,\" he said.\n\n\"We just want our jetty back — to be able to use it.\n\n\" It's very frustrating for the locals because my children enjoyed fishing and swimming and jumping off the jetty. My grandchildren can't. \"\n\nA moment frozen in time of when the jetty was well used. (Supplied: Clara Harris)\n\nFrustration grows with sand\n\nIt has been 14 years since commercial fishers like Mr Suckling and his mate Greg Horsman have been able to tie up to the jetty to unload their catches.\n\nCray fishers now have to bring their catch in by dinghy and transfer it to the truck. (ABC Landline: Chris Lewis)\n\nInstead, the lobster fishers are forced to use dinghies to ferry catch and bait to and from their boats and the beach.\n\n\"This jetty had more than 2 metres of water around it, back to approximately halfway along the first leg of the jetty,\" Mr Horsman said.\n\nWith the jetty no longer accessible, cray fishers load and unload their catch and supplies by dinghy. (ABC Landline: Jo Prendergast)\n\n\" It was used by between five and seven boats most of the year, plus we had a few boats that had come in to get fuel or seek shelter. \"\n\nThe pair was frustrated with the WA government, which owned the jetty, for not acting on their calls for help.\n\n\"It's ridiculous. You can't leave it as it is. They [should] either remove it or fix it,\" Mr Horsman said.\n\n\"The longer it goes, the more costly it's going to become. So it should have been looked at possibly 10 years ago, rather than now.\"\n\nWhile some beaches are eroding, the bay at Port Gregory has been filling up with sand. (ABC Landline: Chris Lewis)\n\nMore than a toilet stop\n\nOnce a key fishing port along the coast north of Perth, Port Gregory is now a much smaller village.\n\nThe pink lake on the outskirts of town attracts hundreds of thousands of visitors each year.\n\nOften, they visit Port Gregory as a toilet stop.\n\nThe iconic pink lake near Port Gregory draws crowds of international visitors all year round. (ABC Landline: Chris Lewis)\n\nMs Schultz said the government needed to consider the volume of travellers who visited the pink lake.\n\n\"We do have tourism here; we had 450,000 tourists through,\" she said.\n\n\"They all get out and come for a wander, but they wander onto a weeded-up boardwalk at the moment.\"\n\nVisitors, especially from China, are drawn to the pink lake’s striking colour. (ABC Landline: Chris Lewis)\n\nIn 2021, WA Transport Minister Rita Saffioti promised to visit the jetty.\n\n\"To my knowledge … she hasn't been here,\" Mr Suckling said.\n\nThe minister was unavailable to speak to the ABC and referred questions about the jetty to the Department of Transport.\n\nThough Port Gregory is a small coastal town, it neighbours a world-famous attraction, the pink lake. (ABC Landline: Chris Lewis)\n\nA spokesperson said sedimentation at Port Gregory had been monitored since 2012, and the coastline was continually growing.\n\n\"Options such as dredging and a jetty extension have been considered, however, due to the rapid rate of siltation at Port Gregory, neither of these options is viable,\" the statement said.\n\n\"There are no plans to upgrade the jetty at Port Gregory.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/tour-de-france-femmes-sarah-gigante-in-second-head-of-final-run/105606536",
        "title": "Aussie star climbs into second ahead of final stage of Tour de France Femmes",
        "publish_date": "Sat, 02 Aug 2025 23:12:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "French rider Pauline Ferrand-Prévôt took a commanding lead at the Tour de France Femmes after launching a solo attack on the final climb of Saturday's penultimate stage.\n\nShe is making her Tour debut at 33 years old and leads Australian rider Sarah Gigante by 2 minutes, 37 seconds and 2023 champion Demi Vollering of the Netherlands by 3:18 heading into tonight's (AEST) last stage.\n\nLast year's event had the smallest winning margin in the history of the women's and men's races, but Ferrand-Prévôt looks like winning far more comfortably, barring mishap.\n\nShe won the mountain bike gold medal at last year's Paris Olympics and the Paris-Roubaix classic in April.\n\nAs the Tour de France Femmes road goes up, Sarah Gigante rises to the top Photo shows Sarah Gigante sprays champagne while standing on a podium wearing a cycling jersey. As the Tour de France Femmes heads into the mountains for the first time on stage five, Australian climber Sarah Gigante may just be getting started.\n\nOvernight, she trailed Mauritian rider Kim Le Court by 26 seconds heading into stage eight from Chambéry to Saint-François-Longchamp, which took the riders on a 112 kilometre trek into the mountains.\n\nIt featured an early climb of 13km up Col de Plainpalais before finishing with a tortuous ascent of 18.6km to Col de Madeleine, one of the most famed climbs in cycling.\n\nFerrand-Prévôt made a move on her main rivals about 9km from the top, pulling away to chase after Niamh Fisher-Black and Yara Kastelijn ahead of her.\n\nShe soon caught them and then rode unchallenged to clinch the stage win.\n\nGigante crossed the line 1:45 behind her, while Fisher-Black rolled in 2:15 behind in third spot. Vollering placed fourth.\n\nThe ninth and final stage from Praz-sur-Arly to Châtel is another mountainous route, with three big climbs, and is even longer at 124km.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/dream-car-tru-blu-ford-falcon-built-after-cancer-diagnosis/105586830",
        "title": "Town rallies to help man build his dream car after cancer diagnosis",
        "publish_date": "Sat, 02 Aug 2025 22:51:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "John Giggins was working at his family-run cafe at Wangaratta in February when he realised something wasn't right.\n\n\"I was making the wrong coffees,\" he said.\n\n\" I even made the wrong coffee for my mum who comes down to the shop every Friday. \"\n\nHis children noticed he was behaving strangely and his text messages were incomprehensible.\n\nA scan led to urgent brain tumour surgery and within days the 56-year-old had a terminal diagnosis to grapple with.\n\n\"With glioblastoma you've only got 12 or 18 months to live,\" Mr Giggins said.\n\nJohn Giggins had only managed to do minor works to his Tru Blu when his best mate stepped in to help. (ABC News: Alice Walker)\n\n\"It's one of the most aggressive cancers that they can't do much about.\"\n\nForced to ask himself how he wanted to spend the time he had left, it seemed as though a passion project sitting idle in his shed would never be finished.\n\nJohn Giggins has always been a car enthusiast, even starting up local monthly \"cruise nights\". (Supplied: John Giggins)\n\nMate helps keep dream alive\n\nLast year, Mr Giggins spent $23,000 on a 1980 XD Falcon with plans to recreate legendary racer Dick Johnson's famous Bathurst-winning Tru Blu.\n\nBut with waning health, and medical appointments stacking up, the project seemed like a lost cause.\n\nThat's when his best mate Heath Lloyd decided to step in.\n\nThe car required a significant makeover, including a new gear box. (Supplied: John Giggins)\n\n\"When John got crook, I just thought I'd do something for my mate … build his dream,\" Mr Lloyd said.\n\nHe became the \"Tru Blu project manager\" and rallied their tight-knit community to organise various fundraisers for Mr Giggins's medical expenses and dream car.\n\n\"He's going through a really rough time, so if we can bring a bit of joy to him, well, that's all it was about.\"\n\nHeath Lloyd and John Giggins have been mates for 30 years. (ABC News: Alice Walker)\n\nThe Wangaratta Hot Rod Club organised an event at the nearby Winton Motor Raceway, the cinema hosted a screening and a range of local businesses donated labour and parts.\n\n\"The amount of people that jumped on board for the whole thing was just phenomenal,\" Mr Lloyd said.\n\nEven Dick Johnson contributed, signing the car's glove box and sending it from Queensland.\n\nDick Johnson regularly signs car parts for fans. (ABC News: Alice Walker)\n\nThe Tru Blu spirit\n\nThe XD Ford Falcon Tru Blu is a car that has legendary status in Australian racing history.\n\nIt was rebuilt after Dick Johnson's infamous crash in the 1980 Bathurst 1000 when, in prime position on lap 18, he hit a rock, putting him out of the race.\n\nDick Johnson racing at the Bathurst 1000. (Supplied: Mount Panorama)\n\n\"Basically he was ruined when the rock was on the road,\" Shell V-Power Racing Team CEO David Noble said.\n\n\"Dick Johnson had taken a second mortgage on his house in 1980 to put that car together to go to Bathurst.\"\n\nAn outpouring of donations from regular Australians followed, allowing Dick Johnson to build a new XD Falcon that he drove to Bathurst victory in 1981.\n\n\"The car is the iconic symbol of perseverance and success,\" Mr Noble said.\n\nHe said it was special to see a similar gesture of goodwill being afforded to John Giggins to build his Tru Blu replica in Wangaratta decades later.\n\n\"For us to be able to share in that … is very cherished from our side of things.\"\n\nDavid Noble says Tru Blu remains one of Dick Johnson's favourite cars. (Supplied: Shell V-Power Racing Team)\n\nA new perspective\n\nMr Giggins hopes to enter his Tru Blu in November's Bright Rod Run, and maybe even take it for a few laps on the Bathurst racetrack.\n\nHaving his dream car doesn't change his terminal diagnosis, but it serves as a symbol of the love and friendship of his community.\n\n\"[I'm] still pinching myself. It's so hard to believe it's happened,\" he said.\n\n\"It's been really special.\"\n\nMr Giggins said he had one answer for how he wanted to see out his days.\n\n\" It's just spending as much time with friends and family as I can. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/england-vs-india-fifth-test-jaiswal-scores-important-ton/105606492",
        "title": "England drops six catches as India takes control of the fifth Test",
        "publish_date": "Sat, 02 Aug 2025 22:41:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Yashasvi Jaiswal loves playing against England's cricketers.\n\nIndia's 23-year-old opening batter struck his fourth Test century against England, and his sixth overall, to put the visitors firmly in control on day three of the fifth and final test at The Oval overnight.\n\nJaiswal had his fair share of luck, though, as he gave his side an excellent chance of tying the series 2-2.\n\nHe was dropped three times on his way to 118, his second hundred of the series, as he helped India pile up 396 in its second innings to set England a daunting victory target of 374.\n\nEngland, which has developed a knack for chasing down sizeable fourth-innings totals since Brendon McCullum took over as head coach in 2022 to launch the so-called 'Bazball' era, reached stumps on 1-50.\n\nIndia's Mohammed Siraj celebrates after bowling England's Zak Crawley on the final ball of the day. (Getty Images: Ben Whitley/PA Images)\n\nMohammed Siraj clean bowled Zak Crawley for 14 with a searing yorker from the last ball of the day, leaving Ben Duckett on 34 not out at the other end.\n\nEarlier, the left-handed Jaiswal turned his 127th ball of the innings to point and was celebrating his hundred before he ran the single he needed; leaping, running and shaping his fingers into a heart.\n\n\"I had to work really hard in my practice session,\" Jaiswal said.\n\n\"I was thinking, 'one last push.' I think overall, wherever you play, it is difficult in England. It is not easy on this wicket. We are really confident. We will try our best and see what happens.\"\n\nThere were also important contributions for India from Akash Deep, Ravindra Jadeja and Washington Sundar.\n\nNightwatchman Deep cut loose for a career-best 66 in a 107-run stand with Jaiswal for the third wicket. Jadeja continued his excellent batting form in the series with 53 and Sundar delivered a swashbuckling 53 off 46 balls at the end of the innings that included four sixes.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nIndia captain Shubman Gill only made 11 but he finished with a tally of 754 runs for the series, passing Graham Gooch's 752 in 1990 for the most by any batter in an India-England series.\n\nEngland did its best to help out India in the field, dropping six catches in all, the team's most in a home test since 2006 when it spilled six against Pakistan, also at The Oval.\n\nThe home side's depleted pace attack toiled hard all day in the absence of the experienced Chris Woakes, who sustained a bad shoulder injury on day one.\n\nJosh Tongue was the pick of the England attack with 5-125, while fellow fast bowler Gus Atkinson took 3-127 to follow up his five-wicket haul from the first innings.\n\n\"It will be a great day of cricket tomorrow, and a great day for us if we get the runs.\" Tongue said.\n\n\"The batting line-up we have is unbelievable. If we can build partnerships, who knows where we might be? Fingers crossed I am not required, but if it comes down to me at the end I will give it a good crack.\"\n\nEngland, which leads the series 2-1, chased down 371 to beat India in the first test at Leeds.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-03/truffle-growers-push-back-on-manufactured-flavouring/105574220",
        "title": "Do you know what a real truffle tastes like?",
        "publish_date": "Sat, 02 Aug 2025 22:22:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "The wet, wintry days are in full swing in southern Australia and truffle hunting season is well underway.\n\nAustralia is now the fourth-largest truffle producer in the world, exporting more than 11 tonnes valued at $9 million in 2023.\n\nThe demand for the expensive but flavoursome fungus continues to rise but growers and wholesalers are concerned consumers do not know what truffles really taste like.\n\nAustralia has become the fourth-largest producer of truffles in the world. (ABC Rural: Annie Brown)\n\nSniffing out the truffles\n\nIn the Strathbogie ranges in north-east Victoria, basenji dogs Audrey and Winnie are busy sniffing the ground in search of truffle in exchange for a treat.\n\nDavid and Kate McConnell started growing truffles in 2007 after planting an orchard of oak trees.\n\nAudrey the basenji dog sniffs a truffle. (ABC Rural: Annie Brown)\n\nThe couple said the rise of synthetic truffle flavour is worrying, considering how much work goes into producing the fungus.\n\n\"It's something that's a concern from a marketing perspective, definitely,\" Mr McConnell said.\n\n\"The idea is to promote more enjoyment in actually experiencing a real truffle, which is what we try to do.\"\n\nSimon Friend grades and sells truffles out of Melbourne and said alarm bells go off in his mind when people describe the flavour as \"strong\".\n\n\"As soon as I hear that my initial thought is that they haven't had any real truffle experience,\" Mr Friend said.\n\nSimon Friend sorts the truffles before selling them on to restaurants in Australia and overseas. (Supplied: Simon Friend)\n\nHe is worried people who have tasted synthetic truffle flavour do not know that it is different to a fresh truffle.\n\n\"It's a misnomer,\" Mr Friend said.\n\n\"There's no real truffle in truffle oil. People don't know that they are actually experiencing a synthetic flavour.\n\n\" It's a huge disappointment to me. It has a negative impact on the industry as you're training people on an unauthentic flavour. \"\n\nTruffle oils are typically made by infusing a flavour often referred to on the bottle as an \"aroma\" or \"essence\".\n\nThere are no laws in Australia around the use of synthetic flavours in products, but Mr Friend is worried that consumers are being misled.\n\n\"It's the same with vanilla in a huge way. Caviar, and maple syrup too,\" he said.\n\n\"Consumers need to understand there's a tremendous amount of work going to getting a beautiful truffle on a table, or in their butter.\"\n\nGrowing truffles a gamble\n\nTruffles will last around a week after they are picked. (ABC Rural: Annie Brown)\n\nDavid McConnell admits truffle growing can feel like a bit of a gamble each year.\n\n\"The interesting thing about truffles is the dog indicates where they are and until we uncover it we don't know if it's ripe or not,\" Mr McConnell said.\n\n\"You buy the trees inoculated with truffle spores and then you cross your fingers and hope that in four to six years that you'll be successful.\n\n\" There's no way of knowing if you will or won't. We've been lucky we have had success. \"\n\nBecause truffles are grown underground, growers must train dogs to sniff out the ripe ones before they can dig them up.\n\nWinnie and Audrey the basenjis. (ABC Rural: Annie Brown)\n\nMr McConnell said the fungi did not ripen with time once they were picked so the dogs needed to get the smell correct straight away.\n\n\" It's sad if it isn't ready because once it's lost its connection to the roots in the ground it doesn't ripen. \"\n\nThe Strathbogie ranges are ideal for growing truffles with high rain, hot summers and very cold winters.\n\nHowever, seasonal conditions this year have been very dry and the truffles have been a bit smaller than usual.\n\n\"There is nothing like rain from the sky. It's been a challenge to keep the soil moist this year,\" Mr McConnell said.\n\n\"But the demand is growing. We've had our truffles sent all over the world.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/tuinakauvadra-powers-over-for-australia-20250803-p5mjwy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tuinakauvadra powers over for Australia",
        "publish_date": "Sun, 03 Aug 2025 12:30:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tuinakauvadra powers over for Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/kelly-cleans-up-the-scraps-20250803-p5mjwq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kelly cleans up the scraps",
        "publish_date": "Sun, 03 Aug 2025 12:11:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kelly cleans up the scraps\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/woman-missing-in-floodwaters-as-wild-weather-rips-across-nsw-20250803-p5mjud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chinese tourist missing in floodwaters as wild weather rips across NSW",
        "publish_date": "Sun, 03 Aug 2025 12:02:05 +1000",
        "category": "finance",
        "authors": [
            "Harriet Alexander"
        ],
        "text": "Wild weather ripped across the state on Saturday night, causing severe thunderstorms on the Mid North Coast, heavy snow on the Northern Tablelands and flooding in the Hunter, where a Chinese tourist is still missing after being swept away in floodwater.\n\nEmergency services are still searching for a woman in her 20s who had been the passenger in a Mini Countryman that attempted to cross floodwater at Black Creek, north of Cessnock, when it became stuck.\n\nThe 27-year-old driver managed to escape uninjured while her passenger was swept away. The women were Chinese nationals who had been visiting family in Australia and staying in Drummoyne.\n\nSES members were called to the scene at about 7.50pm then discovered a 40-year-old man, not connected to the women, stuck up a tree having also been trapped in floodwater.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/russell-plays-with-phone-during-lightning-delay-20250803-p5mjwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Russell plays with phone during lightning delay",
        "publish_date": "Sun, 03 Aug 2025 11:50:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "Russell plays with phone during lightning delay\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/freddy-floats-change-after-trainer-drama-20250803-p5mjwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freddy floats change after trainer drama",
        "publish_date": "Sun, 03 Aug 2025 11:43:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Freddy floats change after trainer drama\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/foster-tackles-big-premier-league-storylines-20250803-p5mjw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Foster tackles big Premier League storylines",
        "publish_date": "Sun, 03 Aug 2025 11:32:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Foster tackles big Premier League storylines\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/lions-hooker-cited-for-elbowing-lynagh-suaalii-cleared-20250803-p5mjvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions hooker cited for elbowing Lynagh, Suaalii cleared",
        "publish_date": "Sun, 03 Aug 2025 11:13:46 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "British and Irish Lions hooker Dan Sheehan has been cited for elbowing Wallabies five-eighth Tom Lynagh in the head during the third Test in Sydney, highlighting the giant blunder of match officials missing the foul play and allowing the act to go unpunished in the game.\n\nBut the Wallabies will be breathing a sigh of relief, with Joseph-Aukuso Suaalii escaping any further scrutiny for a contentious tackle late in the game, leaving him free to travel to South Africa later in the week for the Rugby Championship.\n\nEven though the Suaalii tackle on Tadgh Beirne in the 77th minute did not attract a penalty, there was some nervousness in the Wallabies camp that the citing commissioner could take a different view.\n\nThe Wallabies claimed a much-needed win at Accor Stadium but it could have an easier task if Sheehan’s illegal shot on Lynagh in the 32nd minute was seen and earned him a red card.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/millionaires-property-investor-taxes-in-unions-sights-20250801-p5mjnt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Millionaires, tax breaks for property investors in unions’ sights",
        "publish_date": "Sun, 03 Aug 2025 10:00:00 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Negative gearing would be restricted to a single property, millionaires and family trusts would pay at least 25 per cent of their income in tax, and building approvals would be accelerated on everything from housing to large energy projects, under a union proposal to improve living standards.\n\nThe Australian Council of Trade Unions today revealed its submission to the Albanese government’s three-day economic roundtable at which it will have two seats, outlining proposals that would raise up to $25 billion in revenue that could be pumped back into services such as the National Disability Insurance Scheme and healthcare.\n\nACTU secretary Sally McManus will outline a broad agenda of tax increases and regulation overhauls. Credit: Penny Stephens\n\nJust days after most of the business community rejected a proposal from the Productivity Commission to cut the company tax rate, while introducing a world-first cashflow tax, the ACTU has outlined an agenda unlikely to win corporate or government support.\n\nBut ACTU national secretary Sally McManus said the living standards of Australians, particularly younger generations priced out of an increasingly expensive housing market, had to be paramount in any discussion about productivity reform.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/wallabies-win-on-the-right-side-of-violence-20250803-p5mjuu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies win on the right side of violence",
        "publish_date": "Sun, 03 Aug 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies’ victory over the British and Irish Lions was just on the right side of violence as they inhabited that elusive space between where all big Tests are won.\n\nIt’s been a while since they’ve been there - right on the edge, sometimes over it and always in the Lions faces - but Saturday night was the statement performance of the Joe Schmidt era.\n\nIt also felt like a message to the Lions committee, to those of us in the media whose default position with Australian rugby can sometimes be doom and gloom, to the teams currently ranked above the Wallabies, and to those casual Wallabies supporters who might have fallen off the bandwagon.\n\nThe message was: never turn your back on Australian rugby. Yes, there will be bumps on the road ahead - two Tests in South Africa are next - but the Wallabies won four halves out of the six in this series.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-why-dont-people-speak-up-against-racism/jorde1tcq",
        "title": "INTERVIEW: Why don't people speak up against racism?",
        "publish_date": "Sat, 2 Aug 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-eight-australias-gigante-surges-into-second-place/gcvbzyfrd",
        "title": "Tour de France Femmes: Australia's Gigante surges into second place in shake-up",
        "publish_date": "Sat, 2 Aug 2025 21:37:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "French rider Pauline Ferrand-Prevot took a commanding lead at the Tour de France Femmes after launching a solo victory on the final climb of Sunday AEST's penultimate stage.\n\n\n\n\n\nBut Australian rider Sarah Gigante surged into second place, two minutes and 37 seconds behind, on a day of big changes in the leading positions.\n\n\n\n\n\nThe 2023 champion, Demi Vollering of the Netherlands, is 3:18 adrift heading into Monday's last stage.\n\n\n\n\n\nOvernight leader Kimberley Le Court Pienaar — Gigante's AG Insurance-Soudal teammmate — crashed on the descent from the Col du Frene with 63 kilometres remaining, briefly trailing the peloton by about a minute.\n\n\n\n\n\nShe rejoined, but the effort and the relentless climbing cost her in the general classification as she dropped to 11th place.\n\n\n\n\n\nLast year's event had the smallest winning margin in the history of the women's and men's races, but Ferrand-Prevot — who won the mountain bike gold medal at last year's Paris Olympics — appears to be winning far more comfortably, despite Gigante's efforts.\n\n\n\nThe Frenchwoman trailed Le Court by 26 seconds heading into stage eight from Chambery to Saint-François-Longchamp, which took the riders on a 112-kilometre trek into the mountains.\n\n\n\n\n\nIt featured an early climb of 13 kilometres up Col de Plainpalais before finishing with an ascent of 18.6 kilometres to Col de Madeleine, one of the most famed climbs in cycling.\n\n\n\n\n\nGigante went on the offensive with 12 kilometres to go, and only Ferrand-Prevot of the GC favourites was able to stay with her on the climb.\n\n\n\n\n\nThe Olympic champion then attacked at the start of the final nine kilometres and Gigante was unable to keep up with her.\n\n\n\n\n\nThe Frenchwoman hit the front seven kilometres from the summit and powered to a superb victory.\n\n\n\n\n\nGigante crossed the line 1:45 behind her, while Niamh Fisher-Black rolled in 2:15 behind in third spot. Vollering was fourth.\n\n\n\n\n\nThe 24-year-old Melburnian had joked on Saturday night, at the end of the seventh stage, that some of the big names had \"missed a couple of opportunities\" to shake her off.\n\n\n\n\n\n\"They could have got rid of me yesterday, maybe Kim today. We'll see what happens, but from our point of view, hopefully they live to regret it.\"\n\n\n\n\n\nMonday's ninth and final stage from Praz-sur-Arly to Chatel is another mountainous route, with three big climbs, and is even longer at 124 kilometres.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/guiding-indigenous-students-to-careers-in-science-and-technology/0v0c9mwvq",
        "title": "Guiding Indigenous students to careers in science and technology",
        "publish_date": "Sat, 2 Aug 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"This has opened my eyes, I think there are a lot of opportunities through STEM and I might try them.\"\n\n\n\n\n\nThat's Akia, a 16-year-old student from an Aboriginal high school who has spent three days problem-solving, prototyping tech, and learning about the spectrum of jobs that exist across healthcare.\n\n\n\n\n\n\"My app I choose is called the Magical Mangarrayi country, it's for back home. So when you go swimming in the tourist attraction places, there will be a little QR code that you can scan. And when you scan it it shows you the history of Mangarrayi country and all about Mataranka photos and fishing places and shops and yeah.\"\n\n\n\n\n\nShe talks about her app design - from planning to detailing it out on the computer.\n\n\n\n\n\nIt comes as Monash Health, Victoria’s largest health service and Indigenous-owned and managed non-for-profit organisation, Deadly Coders are helping introduce First Nations students to career pathways in Science, Technology, Engineering or Maths.\n\n\n\n\n\nDan Carter is the Chief Aboriginal Health Adviser at Monash Health.\n\n\n\n\n\n\"This is really to expose Aboriginal and Torres Strait kids in school to STEM science, technology, engineering, math career pathways, and as a large health service that does have many STEM careers across engineering and other areas, we thought this was a really good fit for expanding on our Aboriginal workforce, that we have real targets in place to really try and recruit and engage with more.\"\n\n\n\n\n\nMonash Health also has a well-established program for the recruitment of Aboriginal and Torres Strait Islander nurses, midwives, and allied health workers.\n\n\n\n\n\nMr Carter told SBS News how they have created an opportunity to help build the future workforce and broaden the roles filled by Indigenous Australians.\n\n\n\n\n\n\"We have an Aboriginal employment plan at Monash Health that looks at the recruitment and retention of Aboriginal Torres Strait Islander staff and career development as well. And so we do a pretty good job at the traditional career areas of medicine, doctors, nurses, and allied health. And we thought how do we expand upon that to engage in some of those careers in the STEM place across the spectrum of careers and health.\"\n\n\n\n\n\nThey were approached by Deadly Coders to run a small mini hackathon event to engage local school kids in the area, as they invest resources into digital health.\n\n\n\n\n\n\"Digital Health is really the information and communication structure systems that sit behind our health services that really support us to deliver or tackle health problems and then support us to deliver health solutions in, I guess, delivery of healthcare to improve health outcomes.\"\n\n\n\n\n\nDeadly Coders ran the App Prototyping Program at Melbourne's Moorabbin Hospital, with a focus on digital health.\n\n\n\n\n\nThe Australian Institute of Health and Welfare defines digital health as systems, tools and services based on information and communications technology that can be used to treat patients and collect and share a patient’s health information.\n\n\n\n\n\nAndrew Brodie is the Co-Founder and General Manager Deadly Coders, that more broadly delivers STEM education.\n\n\n\n\n\n\"That might be a face-to-face STEM program at a school for children in Year Two. And in that case, the programs would be designed to be gamified, hands on story based, pedagogically aligned to how indigenous kids learn best and they're really designed to get kids interested in something and bring down barriers.\"\n\n\n\n\n\nHe says they move from there into more formal programs with high school students where they may be teaching text-based coding languages, problem solving with technology, building robots, or learning how to build a website.\n\n\n\n\n\nThe Indigenous-run not-for-profit's aim is to build interest, excitement and curiosity in STEM through hands-on activities and gamified learning.\n\n\n\n\n\n\"We also have an online learning platform, so that online learning platform has valuable content on there. Things like digital literacy, financial literacy, coding tutorials. That particular platform is I think the only platform. It's kind designed by indigenous educators and tech experts and specifically for indigenous students.\"\n\n\n\n\n\nHe adds that if students can learn to link fundamental skills in A-I [[artificial intelligence]] with something in the real world, that's what they want to achieve by building that engagement amongst students.\n\n\n\n\n\nThey also run the Deadly Coders Academy - a job skilling program designed to create alternative pathways into the tech sector through upskilling rather than formal qualifications.\n\n\n\n\n\n\"The students essentially will have some time learning about a design thinking framework. So essentially at big businesses, how to tech groups within those big businesses work together to solve problems. Once the students have a bit of a grounding in that design thinking framework, they will then get access to and a bit of a 101 crash course in how to use an app prototyping software.\"\n\n\n\n\n\nHe says at the end of the three days, the students in their group will get an opportunity to pitch what they've built back to Monash Health and he hopes a panel of people there will be able to decide which app solves the problem the best.\n\n\n\n\n\nAkeima is a 14-year-old from the Katherine community.\n\n\n\n\n\nIn the three-days, she created a Mindset app for people struggling in school.\n\n\n\n\n\n\"On the second day we wrote it down and we started planning it. And at the end of the day we brought out our computers and started making our account to put it in, and the third day we just finishing up our apps with classical coding.\"\n\n\n\n\n\nShe says it was inspiring to hear from the speakers from Monash Health at the event.\n\n\n\n\n\n\"It was kind of inspiring cause it made me thought probably in my course I would have helped out with hospitals or something like that. It was really good of hearing of how they were going with their life.\"\n\n\n\n\n\nDan Carter says the students enjoy tackling digital solutions in a health setting.\n\n\n\n\n\n\"The kids have just really just enjoyed engaging with a bit of a fun program to tackle digital solutions to digital problems in a health setting. So this has more been about engaging the students at a high school level.\"\n\n\n\n\n\nDeadly Coders have been around since mid 2023. Andrew Brodie says they are growing quickly and have space for up to 30 students in their program.\n\n\n\n\n\n\"We always have some students that just take to technology like a duck to water, and it's really nice watching young people who just, something clicks for them and they get it and they get really interested in it, especially when there are kids who may not have seen technology as a pathway that was available to them. So we do get a lot of kids who didn't realise they were interested in technology, it clicks for them and they just love the program and get really interested after that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/reaction-to-victorian-premier-jacinta-allan-new-work-from-home-plan/jl6rx3tel",
        "title": "A 'really important initiative' or 'complete overreach': New WFH plan draws mixed reactions",
        "publish_date": "Sat, 2 Aug 2025 10:34:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "With new Australian-first rules suggested, working from home might soon be a legal right for Victorians.\n\n\n\n\n\nPremier Jacinta Allan announced on Thursday that she would introduce legislation in 2026 legally enshrining the right to work from home for two days a week.\n\n\n\n\n\nAllan said she expected the plan to face some criticism but said many Victorians stood to benefit from the changes, which will cover all employees who can \"reasonably\" do their job from home.\n\n\n\n\n\n\"Bosses who think being seen at a desk is more important than a parent getting home for dinner with their kids, if they want to look their workers in the eye and tell them their time with their families doesn't count, they know where my government stands,\" Allan said.\n\n\n\n\n\n\"We won't stand by while workers — especially women, single mums, carers — get punished for needing balance in their lives.\"\n\n\n\nREAD MORE The male breadwinner is gone. Why working from home is necessary for modern families\n\nDetails are yet to be worked through but Allan signalled the changes could come into effect under Victoria's Equal Opportunity Act, as private workplaces are regulated by federal laws.\n\n\n\n\n\nIssues such as the definition of remote work, who can do it, how it would affect part-time workers and the types of businesses to which the law would apply, will be figured out through a consultation process.\n\n\n\n'Complete overreach'\n\nPeak business bodies have criticised the plan, with Committee for Melbourne CEO Scott Veenker calling it a \"complete overreach\".\n\n\n\n\n\n\"It's another regulatory burden or requirement that just makes the cost of doing business too hard,\" he said, adding that his group \"hadn't been consulted with prior to the announcement\".\n\n\n\n\n\n\"The reality is that we want to actually have an environment where businesses can thrive and flourish, and they don't need more regulation and more legislation to prevent them [from] doing that.\"\n\n\n\n\n\nVeenker said the state government's new plan will make \"members both small and large\" of the business advocacy group ask if they should \"continue trading in Victoria\".\n\n\n\n\"We know that businesses will move their staff and their resources accordingly, and we don't want Victoria to be seen as a place that's too hard to do business,\" he said.\n\n\n\n\n\n\"They should be arrangements that are really done in conjunction with staff and the employers, rather than the state government trying to put their nose into this.\n\n\n\n\n\n\"We want the state government to be looking at how we should be focusing on economic growth and enabling businesses to prosper.\"\n\n\n\n\n\nThe Committee for Melbourne, which merged with the Melbourne Chamber of Commerce in 2024, describes itself as being founded \"to champion key initiatives to stimulate the economy and civic development, which put Melbourne on a pathway to become one of the world’s most liveable cities\".\n\n\n\n'A really good initiative'\n\nHowever, several people SBS News talked to on the streets of Melbourne said they supported the proposal.\n\n\n\n\n\nOne young woman said it was \"a really good initiative\".\n\n\n\n\n\n\"I think working from home allows people to have a bit more of better work-lifestyle balance, therefore making them happy — happy to be at work when it is time to be at work, [and] happy to be at home,\" she said.\n\n\n\nAnother woman SBS News spoke to said the ability to work from home \"just makes life so much easier\". Source: SBS News A middle-aged man said he currently had an arrangement to work one day a fortnight at home and would \"certainly be keen for that to be made a legal thing to do more\".\n\n\n\n\n\nA young man who works from home said: \"going to [the] office necessarily doesn't mean full productivity, so that's something people have to consider,\" he said.\n\n\n\n\n\nSeveral experts recently told SBS News that working from home breaks down barriers to gender equality in the workplace and is necessary for modern families, especially those who face significant commutes to work.\n\n\n\nLISTEN TO New research shows just how much money people working from home save SBS News 03:56 English\n\nMore than one in three Australian employees typically work from home, but that figure rises to 60 per cent among managers and those in professional services, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nThe ABS also says 43 per cent of those who work from home do overtime, compared to one quarter of those who do not.\n\n\n\nState Opposition signals possible support\n\nAllan — whose announcement coincided with the Victorian Labor Party meeting for its annual conference — has promised to introduce the law in 2026, prior to the state election.\n\n\n\n\n\nPolls indicate Labor is on track to win a fourth term but the November 2026 poll will be the first as premier for Allan, who lags Opposition leader Brad Battin as preferred state leader.\n\n\n\n\n\nOn Saturday, Battin indicated he might support the proposal.\n\n\n\n\n\n\"We support measures that help Victorians enjoy a better work-life balance, and will review any legislation closely, to ensure it supports flexibility, productivity and personal choice,\" he said.\n\n\n\nThe federal Opposition's proposal to eliminate remote work for public servants was partly blamed for its poor performance in the May federal election, even though it abandoned the policy before voting day.\n\n\n\n\n\nDuring the campaign, former Opposition leader Peter Dutton apologised after admitting that the proposal to end work-from-home arrangements for public servants was a \"mistake\".\n\n\n\n\n\nThe plan was immediately framed by Labor and Greens parliamentarians as being a regressive move for women's working rights.\n\n\n\n\n\nIt was also criticised as being inspired by the policies of United States President Donald Trump. One of Trump's first policies after being elected for a second term was to order all government workers to return to the office.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-arrente-artist-amunda-gorey-on-kinship-connection-and-deep-listening/vde78r76j",
        "title": "INTERVIEW: Arrente artist Amunda Gorey on kinship, connection and deep listening",
        "publish_date": "Fri, 1 Aug 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-stage-seven-squiban-second-win/vq8ga5ziq",
        "title": "Tour de France Femmes: Local hero Squiban claims back-to-back wins",
        "publish_date": "Fri, 1 Aug 2025 21:50:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Sarah Gigante has kept pace with the Tour de France Femmes leaders as France's Maeva Squiban delighted home fans with a solo victory in the seventh stage.\n\n\n\n\n\nThe overnight victory was Squiban's second in two days, making her only the fourth rider to claim back-to-back stages at the race.\n\n\n\n\n\nGigante, who moved into the leading group after finishing in the leading pack on Thursday AEST, came home in 16th place for the second day running, one minute and 11 seconds behind the winner.\n\n\n\nThe result meant the AG Insurance-Soudal rider slipped a place to eighth in the general classification, one minute and 14 seconds behind yellow jersey wearer Kimberley Le Court Pienaar.\n\n\n\n\n\nSquiban, 23, made pace on the upper slopes of the Col du Granier to reach the finish of the hilly stage alone, which lifted the UAE Team ADQ rider to second in the polka dot jersey standings, level on 17 points with Dutchwoman Silke Smulders.\n\n\n\n'You have to give everything'\n\n\"Honestly, winning once on the Tour is already huge and now a second win...It was an incredible day. I think it was one of the hardest days of my life, mentally as well as physically. But you have to give everything,\" Squiban said.\n\n\n\n\n\n\"On the last climb, I just wanted to lie down on the ground, and by the end, I think for the last 15 kilometres, I was barely present — I couldn't hear anything in my ear.\"\n\n\n\n\n\nIt was another French one-two as Cedrine Kerbaol (EF Education-Oatly) crossed the line 51 seconds behind Squiban to take second place, and American Ruth Edwards was third.\n\n\n\nREAD MORE Tour de France Femmes: Gigante keeps pace as Squiban delights home crowd\n\nA 17-rider breakaway had lit up the 159.7 kilometre stage from Bourg-en-Bresse, with Fiona Mangan (Winspace Orange Seal) becoming the first Irish rider to win an intermediate sprint at the Tour.\n\n\n\n\n\nThe move split on the Cote de Saint-Franc before Squiban's decisive attack on the final climb. Mauritian rider Le Court Pienaar (AG Insurance-Soudal) lost ground on the Granier but finished sixth to retain the yellow jersey.\n\n\n\nLe Court is ahead of Frenchwoman Pauline Ferrand-Prevot (Visma-Lease a Bike) by 26 seconds and Poland's Katarzyna Niewiadoma Phinney (Canyon-SRAM) by 30 seconds.\n\n\n\n\n\nMountains classification leader Elise Chabbey (FDJ-Suez) endured a difficult day and was distanced from the peloton before Squiban's climb.\n\n\n\n\n\nRuby Roseman-Gannon was the only other Australian rider to finish inside the top 100 and she is 68th overall.\n\n\n\n\n\nSunday's mountain stage will be from Chambery to Saint-Francois-Longchamp.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-high-hopes-for-new-hiv-vaccine/uqlh9ezo4",
        "title": "INTERVIEW: High hopes for new HIV vaccine",
        "publish_date": "Fri, 1 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/perth-poised-to-host-historic-serie-a-match-as-ac-milan-eyes-clash-with-como/gquv74722",
        "title": "Perth poised to host historic Serie A match as AC Milan eyes clash with Como",
        "publish_date": "Fri, 1 Aug 2025 11:15:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/tuinakauvadra-powers-over-for-australia-20250803-p5mjwy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tuinakauvadra powers over for Australia",
        "publish_date": "Sun, 03 Aug 2025 12:30:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Tuinakauvadra powers over for Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/kelly-cleans-up-the-scraps-20250803-p5mjwq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kelly cleans up the scraps",
        "publish_date": "Sun, 03 Aug 2025 12:11:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kelly cleans up the scraps\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/woman-missing-in-floodwaters-as-wild-weather-rips-across-nsw-20250803-p5mjud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Chinese tourist missing in floodwaters as wild weather rips across NSW",
        "publish_date": "Sun, 03 Aug 2025 12:02:05 +1000",
        "category": "finance",
        "authors": [
            "Harriet Alexander"
        ],
        "text": "Wild weather ripped across the state on Saturday night, causing severe thunderstorms on the Mid North Coast, heavy snow on the Northern Tablelands and flooding in the Hunter, where a Chinese tourist is still missing after being swept away in floodwater.\n\nEmergency services are still searching for a woman in her 20s who had been the passenger in a Mini Countryman that attempted to cross floodwater at Black Creek, north of Cessnock, when it became stuck.\n\nThe 27-year-old driver managed to escape uninjured while her passenger was swept away. The women were Chinese nationals who had been visiting family in Australia and staying in Drummoyne.\n\nSES members were called to the scene at about 7.50pm then discovered a 40-year-old man, not connected to the women, stuck up a tree having also been trapped in floodwater.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/russell-plays-with-phone-during-lightning-delay-20250803-p5mjwf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Russell plays with phone during lightning delay",
        "publish_date": "Sun, 03 Aug 2025 11:50:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "Russell plays with phone during lightning delay\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/freddy-floats-change-after-trainer-drama-20250803-p5mjwa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freddy floats change after trainer drama",
        "publish_date": "Sun, 03 Aug 2025 11:43:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Freddy floats change after trainer drama\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/foster-tackles-big-premier-league-storylines-20250803-p5mjw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Foster tackles big Premier League storylines",
        "publish_date": "Sun, 03 Aug 2025 11:32:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Foster tackles big Premier League storylines\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/lions-hooker-cited-for-elbowing-lynagh-suaalii-cleared-20250803-p5mjvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions hooker cited for elbowing Lynagh, Suaalii cleared",
        "publish_date": "Sun, 03 Aug 2025 11:13:46 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "British and Irish Lions hooker Dan Sheehan has been cited for elbowing Wallabies five-eighth Tom Lynagh in the head during the third Test in Sydney, highlighting the giant blunder of match officials missing the foul play and allowing the act to go unpunished in the game.\n\nBut the Wallabies will be breathing a sigh of relief, with Joseph-Aukuso Suaalii escaping any further scrutiny for a contentious tackle late in the game, leaving him free to travel to South Africa later in the week for the Rugby Championship.\n\nEven though the Suaalii tackle on Tadgh Beirne in the 77th minute did not attract a penalty, there was some nervousness in the Wallabies camp that the citing commissioner could take a different view.\n\nThe Wallabies claimed a much-needed win at Accor Stadium but it could have an easier task if Sheehan’s illegal shot on Lynagh in the 32nd minute was seen and earned him a red card.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/millionaires-property-investor-taxes-in-unions-sights-20250801-p5mjnt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Millionaires, tax breaks for property investors in unions’ sights",
        "publish_date": "Sun, 03 Aug 2025 10:00:00 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Negative gearing would be restricted to a single property, millionaires and family trusts would pay at least 25 per cent of their income in tax, and building approvals would be accelerated on everything from housing to large energy projects, under a union proposal to improve living standards.\n\nThe Australian Council of Trade Unions today revealed its submission to the Albanese government’s three-day economic roundtable at which it will have two seats, outlining proposals that would raise up to $25 billion in revenue that could be pumped back into services such as the National Disability Insurance Scheme and healthcare.\n\nACTU secretary Sally McManus will outline a broad agenda of tax increases and regulation overhauls. Credit: Penny Stephens\n\nJust days after most of the business community rejected a proposal from the Productivity Commission to cut the company tax rate, while introducing a world-first cashflow tax, the ACTU has outlined an agenda unlikely to win corporate or government support.\n\nBut ACTU national secretary Sally McManus said the living standards of Australians, particularly younger generations priced out of an increasingly expensive housing market, had to be paramount in any discussion about productivity reform.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/wallabies-win-on-the-right-side-of-violence-20250803-p5mjuu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies win on the right side of violence",
        "publish_date": "Sun, 03 Aug 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies’ victory over the British and Irish Lions was just on the right side of violence as they inhabited that elusive space between where all big Tests are won.\n\nIt’s been a while since they’ve been there - right on the edge, sometimes over it and always in the Lions faces - but Saturday night was the statement performance of the Joe Schmidt era.\n\nIt also felt like a message to the Lions committee, to those of us in the media whose default position with Australian rugby can sometimes be doom and gloom, to the teams currently ranked above the Wallabies, and to those casual Wallabies supporters who might have fallen off the bandwagon.\n\nThe message was: never turn your back on Australian rugby. Yes, there will be bumps on the road ahead - two Tests in South Africa are next - but the Wallabies won four halves out of the six in this series.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/tradition-aussies-no-longer-afford-010021186.html",
        "title": "‘Disappointing’ tax hike kicks in tomorrow",
        "publish_date": "2025-08-03T02:06:51Z",
        "category": "finance",
        "authors": [
            "Blair Jackson"
        ],
        "text": "Taxes on draught beer will not go up for two years, a freezing that takes effect on Monday. Picture: David Geraghty / NewsWire\n\nA two-speed booze tax kicks in Monday, as beer taxes are frozen while spirits are slugged by the twice-a-year price hike.\n\nAnthony Albanese made the two-year beer tax freeze an election promise and has paused any tax increases on kegged beer.\n\nBut the freeze creates an unequal playing field between draught and liquor, as cocktail and spirit drinkers will see venues pass on the latest tax hike at the till.\n\n“With cost-of-living pressures biting hard, even the smallest increase in price is noticed by customers and businesses alike,” Night Time Industries Association boss Mick Gibb told NewsWire.\n\n“We’re not asking for special treatment, just equal treatment. Freezing the beer excise is a great thing, but we can’t leave behind the small bars, live music venues and performance spaces that aren’t running beer taps.\n\nADVERTISEMENT\n\n“While there’s lots of factors involved in pricing a cocktail or a drink, if there’s a cost input that the government has control over, they should be leveraging it to give people a bit of breathing room.”\n\nTax increases on draught beer have been paused for two years. Picture: Glenn Campbell / NewsWire\n\nSubstantive, quarterly inflation data released this week shows inflation has flattened out to 2.1 per cent over the past year.\n\nDespite this reprieve for household budgets, the majority of average workers cannot afford a quick drink after work, the Night Time Industries Association finds.\n\nThe association’s latest quarterly report found people on salaries between $80,000 to $150,000 were staying in, while people being paid more than $150,000 were going out more and more.\n\n“Cost-of-living pressures are far from over, with many venues reporting consumers are foregoing the after-work drink for less frequent, but more extravagant experiences for special occasions at a premium restaurant or an international artists’ gig,” Mr Gibb said.\n\nADVERTISEMENT\n\nThe Australian Distillers Association says distillers and venues cannot cop the price hike.\n\n“This is incredibly disappointing. It’s not just another tax hike, it’s a significant one that\n\ndistillers and hospitality venues simply can’t absorb,” distillers boss Cameron Mackenzie told NewsWire.\n\n“In the end, it’s customers who’ll be left paying more for their favourite spirits”\n\nHalf of Australian distilleries were in the regions, he said, and drove manufacturing, jobs and tourism.\n\n“This tax hike hits everyone: producers, venues and consumers who’ll see higher prices for their favourite gin and tonic.”\n\nOut campaigning, the Prime Minister poured plenty of beers, but the tax freeze was announced weeks before the election date was officially called.\n\nThe Labor government has enacted the beer tax freeze, promised by Anthony Albanese before the campaign period earlier this year. Picture: Mark Stewart / NewsWire\n\nAt that time, Treasurer Jim Chalmers called the tax break modest. News.com.au reported last week the lost tax revenue would equal $95m over four years.\n\nADVERTISEMENT\n\nThe Prime Minister’s office declined to say how much the tax break would cost the budget.\n\n“We’re focused on easing the cost of living for Australians, and we know that every little bit helps. This will help take a bit of pressure off beer drinkers, brewers and bars,” a spokesperson said.\n\n“Whether it’s a tax cut for every taxpayer, help with energy bills, or the new relief that’s rolling out this month like higher wages for award workers, we’re doing everything we responsibly can to help with the cost of living.”\n\nThe tax freeze only applies to beers on tap at licensed hospitality venues. Stubbies and cans at the bar or bottle store are excluded. Distilled spirits are totally excluded from the freeze no matter where they are purchased or how they are consumed. From Monday, taxes on spirits with more than 10 per cent alcohol will increase 1.6 per cent.\n\nAlcohol taxes rise in February and August every year. For beer, the rates vary depending on alcohol content, the size and type of container it’s packaged in, and whether it was made at a commercial brewery or a “brew-on-premise” venue.\n\nADVERTISEMENT\n\nKegs of the most common beers at pubs are usually 50 litre. Tax on each 50-litre keg of full strength beer will stay at $43.39 for the next two years.\n\nWillie the Boatman brewery has canonised Anthony Albanese with a pale ale. Picture: Jason Edwards / NewsWire\n\nWine falls under a separate tax regimen than beer and spirits. Wine is taxed at 29 per cent of the wholesale value.\n\nThe beer and spirits excise has ticked up and along without reform for more than 40 years.\n\nThe Australian Hotels Association says the decades-old format needs to change.\n\n“We recognise the need for the government to raise revenue from liquor excise but the way excise was going up every six months was keeping people at home, drinking alone rather than getting out and socialising in safe, local venues,” AHA president David Canny told NewsWire.\n\n“We want to make sure a beer poured at the bar doesn’t become a luxury item and this is a great step towards that.”\n\nHospitality and brewing groups say the tax freeze will support jobs, promote socialisation and provide general cost-of-living relief. Picture: Martin Ollman / NewsWire\n\nThis two-year freeze helped support 300,000 hospitality staff, Mr Canny said.\n\n“It is great to see the Albanese government has listened and acted on this unpopular hidden tax,” he said.\n\n“There’s no better place to have a beer than down at the local – they are a place for community and connection – and anything that makes it a little bit more affordable is worthwhile.\n\n“It’s a win for common sense in the middle of a cost-of-living crisis.”\n\nThe Brewers Association of Australia similarly enjoyed news of the freeze but had its eye on long-term change.\n\n“We certainly thank the Prime Minister, the Treasurer and the Assistant Treasurer for backing this in,” Brewers Association chief executive Amanda Watson told NewsWire.\n\n“Brewers will continue to work with the government to ensure future excise reform is looked at seriously to support a sustainable Australian brewing sector.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.finance.yahoo.com/news/upward-spending-trend-unlikely-shift-020000999.html",
        "title": "Upward spending trend unlikely to shift needle on rates",
        "publish_date": "2025-08-03T02:00:00Z",
        "category": "finance",
        "authors": [
            "Sat",
            "Aug",
            "Min Read"
        ],
        "text": "Australian spending habits will help the Reserve Bank fill in its picture of the nation's economy, with another rate cut expected at its next board meeting amid global tariff woes.\n\nAll eyes will be on the monthly spending indicator for June as it becomes the main measure of retail trade when published by the Australian Bureau of Statistics on Tuesday.\n\nHousehold spending rose 0.9 per cent in May when consumers splashed out on clothes, shoes and new vehicles with borrowing easier since the RBA began cutting rates in February.\n\nThis trend is expected to have continued in June, with Commonwealth Bank economists predicting a rise of one per cent.\n\nEconomists expect consumer spending to have continued rising in June after an increase in May. (Steven Saphore/AAP PHOTOS)\n\nThe data could seal the deal for the central bank's August interest rate decision following a rise in unemployment in June and a fall in inflation for the quarter, with the trimmed mean figure dropping from 2.9 per cent to 2.7 per cent.\n\nRBA deputy governor Andrew Hauser on Thursday hailed the \"very welcome\" data, as the central bank had been searching for more evidence of inflation returning to the midpoint of its two to three per cent target band.\n\nA host of new and increased US tariffs are expected to come into effect later in the week after nations scrambled to try lock down trade negotiations with President Donald Trump ahead of his August 1 deadline.\n\nAustralia has been spared a higher tariff and though most of its goods will continue to face a 10 per cent levy, no US trading partner has a lower rate.\n\nAustralia was spared higher tariffs but the indirect impact could affect domestic financial markets. (Ben Symons/AAP PHOTOS)\n\nThis continuation is a \"relief\" according to AMP chief economist Shane Oliver, who noted Mr Trump has previously foreshadowed further tariffs on pharmaceuticals - one of Australia's biggest exports to the US.\n\nIncreased tariffs on Australia's trading partners could also have indirect impacts for the domestic financial markets.\n\n\"The surge in US tariffs still poses a significant threat to the global economy, which will likely become more evident in the months ahead,\" Mr Oliver said.\n\nWall Street investors were feeling the pinch on Friday as new tariffs on dozens of trading partners and a surprisingly weak jobs report spurred selling pressure.\n\nFor the week, the S&P 500 fell 2.36 per cent, the Nasdaq 2.17 per cent and the Dow 2.92 per cent. (AP PHOTO)\n\nThe S&P suffered its biggest daily percentage decline in more than two months, with an 8.3 per cent tumble in Amazon.com shares after it posted quarterly results but failed to meet lofty expectations for its cloud computing unit also weighing on equities.\n\nAustralian share futures dropped 32 points, or 0.37 per cent, to 16,231.\n\nThe benchmark S&P/ASX200 index on Friday dropped 80.8 points, or 0.92 per cent, to 8,662.0, while the broader All Ordinaries fell 81.9 points, or 0.91 per cent, to 8,917.1.\n\nProfit reporting season also begins this week, with major companies such as News Corp, AMP and QBE Insurance set to reveal earnings results.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/ongoing-407-act-on-side-of-aussie-freeway-prompts-calls-for-new-roadside-cameras-012445568.html",
        "title": "Ongoing $407 act on side of Aussie freeway prompts calls for new roadside cameras",
        "publish_date": "2025-08-03T01:24:45Z",
        "category": "finance",
        "authors": [],
        "text": "Motorists would be fined hundreds, if not thousands, of dollars if caught engaging in the 'gross' trend.\n\nShould roadside cameras be deployed to catch those littering vapes? Source: Reddit/isjimmyhere\n\nYou might drive past and not notice, but if you're paying attention, it would be hard to miss a bizarre – and illegal – roadside practice that is again being called out in one of Australia's biggest cities.\n\nAlong a major freeway in Melbourne, drivers continue to discard disposable e-cigarette cartridges or vapes, causing them to keep building up on a dividing wall along the West Gate Freeway as motorists head into the city.\n\nOne driver took a photo of the stretch of road, sharing it online on Saturday, showing the plastic vapes littered all over the place, prompting some to call for cameras to be installed to catch the drivers responsible for the trend.\n\n\"This is gross, clean this up. Fine the people doing this,\" one commenter said.\n\nADVERTISEMENT\n\n\"This is deeply infuriating. It’s absurd the fact that this amount of people in this country think littering is completely acceptable,\" another wrote.\n\nRelated: Concerning roadside find reveals dangerous trend landing users in hospital\n\nWhile Melbourne, like cities around the country, has increased the number of cameras monitoring motorists for driving infringements like mobile phone use, some residents believe littering cameras should be installed at the trouble spot.\n\n\"Seems like a camera would pay itself back with fines in a week,\" one person commented.\n\nAccording to the Environmental Protection Authority of Victoria (EPA), the fine for littering from a vehicle is $407 and $2,035 for a company. However that jumps if the item is considered dangerous, like a lit cigarette, doubling to $814 and $4,070 respectively.\n\nADVERTISEMENT\n\nIt's been an ongoing issue that authorities have had to deal with over the last couple of years. When previously contacted by Yahoo about the problem on the West Gate Freeway, it was understood The Department of Transport, which oversees the freeway, did not have a specific plan for the vape littering trend and was treating it like regular rubbish build up.\n\nAn Australian Border Force officers inspects cartons of seized vapes at the a Container Examination Facility in Sydney. Source: AAP\n\nLast year, a parliamentary inquiry in Victoria heard how the plastic e-cigarette devices were creating an increasing environmental problem in the state, as well as posing a serious risk of starting fires when littered.\n\n\"Vapes contain lithium-ion batteries, which are combustible and are an ignition source when improperly handled, meaning that they can cause fires when they are not sorted, separated, handled, or stored appropriately,\" the then CEO of Victoria's EPA, Lee Miezis, told the inquiry.\n\nWar against vapes is driving down the number of users\n\nShifting social norms and concerted government campaigns are slowing the number of young people being hooked on vapes, but Australia isn't out of the woods yet, expert say.\n\nADVERTISEMENT\n\nA survey of almost 15,000 14 to 17-year olds found the number of teens vaping fell from 18 to 15 per cent since February 2023.\n\nA report released last month by the Cancer Council's Generation Vape Project found rates of e-cigarettes among 30 to-59-year-olds have halved, while fewer than one-in-five 18 to 24-year-olds used vapes.\n\nDespite being banned, vape shops and tobacconists are leading a rise in black market sales of vapes, Cancer Council chair Alecia Brooks said.\n\nThe report found the number of vapes being bought by young people at stores surged to almost 35 per cent of all sales. That is despite laws only allowing vapes to be sold in participating pharmacies where they are sold for the purpose of helping people quit smoking or manage nicotine dependence.\n\nThe Australian Border Force and the Therapeutic Goods Administration have also seized almost $500 billion worth of illicit vapes since January 2024.\n\nADVERTISEMENT\n\nTobacco use remains the leading cause of preventable death in Australia and is estimated to kill more than 24,000 Australians each year.\n\nwith AAP\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/australia-urged-bite-bullet-tax-011504381.html",
        "title": "Australia urged to 'bite the bullet' on tax breaks",
        "publish_date": "2025-08-03T01:15:04Z",
        "category": "finance",
        "authors": [
            "Kat Wong"
        ],
        "text": "Working Australians will be locked out of home ownership unless the government winds back property tax breaks, a major union body has warned.\n\nAs the federal government seeks ways to reinvigorate the nation's languishing productivity, the Australian Council of Trade Unions has urged the government to reform the tax system and make housing affordable.\n\nTax concessions like negative gearing, which allows investors to claim deductions on losses, and the capital gains tax discount, which halves the amount of tax paid by those who sell assets owned for a year or more, have incentivised property investment and tied up capital that could otherwise be invested more productively, according to the union.\n\n\"Working people can no longer afford to live near where they work and young people are locked out of the housing market and locked into high rents,\" ACTU secretary Sally McManus said.\n\nADVERTISEMENT\n\n\"It's just not right and has to change.\"\n\nThe union has proposed limiting negative gearing and capital gains tax discounts to a single investment property, though those tax breaks would be grandfathered for five years on properties that already benefit, giving investors time to adjust.\n\nACTU secretary Sally McManus says workers and young people are being locked out of home ownership (Paul Braven/AAP PHOTOS)\n\nBut such reforms have historically been political kryptonite for Labor, with a proposal to limit negative gearing contributing to its narrow defeat at the 2019 election.\n\nEven in the aftermath of its significant election win in May, the party has largely avoided the topic and attempts at tax reform in recent years have been met with vocal opposition.\n\nThe government's bill to lift taxes on super balances above $3 million from 15 per cent to 30 per cent has proved controversial among industry giants and the coalition.\n\nADVERTISEMENT\n\nBut Ms McManus insisted the system needs to change.\n\n\"We've got to bite the bullet,\" Ms McManus told ABC's Insiders on Sunday.\n\n\"Otherwise we're just saying, 'too bad young people, you're not going to be able to ever own a home'.\"\n\nThe union has also urged the government to implement a minimum 25 per cent tax rate for individuals who earn more than $1 million and for family trusts.\n\nLabor is preparing to host an economic roundtable later in August that will focus on lifting living standards by improving productivity, building resilience and strengthening the budget.\n\nUnions, business representatives and a host of government and economic figures have been invited to offer their answers.",
        "source": "Yahoo"
    }
]