[
  {
    "url": "https://www.9news.com.au/national/cost-of-living-increase-for-all-households-in-recent-months-abs-data-reveals/fe924618-76bd-4e30-8c5c-8ed4228afcd8",
    "title": "The households battling the biggest cost of living surge",
    "publish_date": "Thu, 08 May 2025 01:29:33 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Living costs rose for all kinds of households around Australia in recent months, new data from the Australian Bureau of Statistics shows.\n\nThe latest ABS numbers showed living costs in the March 2025 quarter lifted between 0.6 per cent and 1.6 per cent.﻿\n\nHealth, housing, food, and non-alcoholic beverages were﻿ the main contributors to the higher numbers.\n\nLiving costs rose for all types of households in the March 2025 quarter, according to the ABS. (Getty)\n\n\"Rises in pharmaceutical products, medical and hospital services, electricity and fruit and vegetables have contributed to higher living costs for all household types this quarter,\" ABS acting head of price statistics Neel Tikaram said.\n\nHouseholds with government payments as their main source of income, including age pensioners, suffered the largest living﻿ costs increase, driven by health spending.\n\n\"Out-of-pocket electricity costs rose as most households in Brisbane had used up the $1000 Queensland State Government electricity rebate,\" Tikaram said.\n\nREAD MORE: PM tears into Greens as leader booted from parliament\n\nRising medical costs were a factor for many households. (Getty)\n\n\"Some households in the remaining states and territories also saw higher electricity bills this quarter due to the timing of the 2024-25 Commonwealth Energy Bill Relief Fund rebate payments.\"\n\nFruit and vegetables like avocadoes, mangoes, asparagus, tomatoes, and lettuce saw seasonal price rises following reduced supply.\n\nLiving costs for employee households rose 1.1 per cent during the quarter.\n\nThese households saw spending increase on the back of mortgage interest charges and education costs.\n\nREAD MORE: Black smoke billows from chimney as secret pope ceremony continues\n\nMortgage interest charges increased by 1.5 per cent during the quarter - down from the 1.7 increase of the December 2024 quarter.\n\nEducation costs - encompassing primary, secondary, and tertiary levels - rose 5.3 per cent due to fee increases at the start of the school year.\n\n\"The rise in mortgage interest charges was driven by higher mortgage debt levels and the continued rollover of expired fixed rate mortgages to higher variable rate mortgages,\" Tikaram said.\n\n\"The effect of the Reserve Bank of Australia's cash rate cut in February 2025 will be seen in the June 2025 quarter due to the timing of the change in the cash rate.\"\n\nBizarre reason serial killer gave for shooting spree View Gallery\n\nSelf-funded retirees saw the smallest rise in living costs, of 0.6 per cent.\n\nFalls in holiday, travel, and accommodation prices helped keep spending growth low.\n\n\"Higher mortgage interest charges, insurance premiums, and food prices over the year contributed to rises in annual living costs across all household types,\" Tikaram said.\n\nAnnually, cost of living rose 3.5 per cent for welfare-dependent households, compared to 3.4 per cent for employee households.\n\n\"Annual growth of 3.4 per cent in employee living costs has continued to slow this quarter and is down from the peak of 9.6 per cent in the June 2023 quarter,\" Tikaram said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/entertainment/the-golden-globes-will-add-a-new-category-recognising-podcasts-starting-next-year/e507507f-4664-4b06-abb7-f1f2db9cf1e1",
    "title": "The Golden Globes will add a new podcast category starting next year",
    "publish_date": "Thu, 08 May 2025 00:25:26 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "The Golden Globes are adding a new category to recognise something other than achievements film and television.\n\nThe Globes today announced that a best podcast of the year category will be added to its awards slate, to debut starting next year when the ceremony will be broadcast on January 11, 2026, according to a news release.\n\nThe category will honour the \"extraordinary and diverse talents in podcasting,\" the release read, while acknowledging that the annual awards ceremony is committed to giving a platform to \"the full spectrum of entertainment, while reflecting today's audiences and consumption behaviour around the world\".\n\nREAD MORE: Crowd gasps as Julie Andrews takes revenge in acceptance speech ﻿\n\nThe Golden Globes are adding a podcasting category. (Getty Images via CNN Newsource)\n\n\"As the world of entertainment continues to evolve, we are excited to recognise new forms of storytelling,\" Golden Globes president Helen Hoehne said in a statement.\n\nHoehne added that \"by celebrating achievements in both audio and visual podcasts, we aim to honour our heritage categories while making room for new voices and formats to be heard\".\n\nAccording to the release, only the \"top 25 podcasts\" will qualify for the award and the category will include a total of six nominees.\n\nA representative for the Golden Globes confirmed to CNN that narrative, video, interview and news-based podcasts will be eligible.\n\nThe Golden Globes will announce more eligibility criteria in the coming weeks.\n\nComedian Nikki Glaser is set to emcee the glitzy awards ceremony in 2026, marking her second time serving as the show's host after her debut earlier this year.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/transurban-announces-hundreds-of-job-cuts/e1ba0f79-0edf-46c7-9954-811a6d7af504",
    "title": "Toll road giant to slash hundreds of jobs",
    "publish_date": "Wed, 07 May 2025 23:57:40 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Transport company and major toll road operator Transurban has announced it will cut hundreds of jobs in a bid to \"streamline\" operations.﻿\n\n\"Transurban aims to be a leader in helping people move more easily and safely around major cities,\" CEO Michelle Jablko said.\n\n\"To do this, we must be a more agile and efficient organisation and re-allocate our capital and resources in ways that best serve our stakeholders.\"\n\nToll road operator Transurban will slash hundreds of jobs.\n\nJablko said that \"regrettably\" it would involve cutting 300 jobs.\n\nThe decision follows a workforce review brought about by changes to the company's operating model in May 2024.\n\n\"Our immediate priority will be to manage this process as quickly and as sensitively as possible and provide support to those impacted by this decision,\" Jablko said.\n\nTransurban estimated the cuts would save more than $50 million, some of which would be re-allocated into \"growth opportunities\" within the company, including improving customer experience.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/kevin-rudd-mocks-donald-trump-movie-tariffs/d14673fd-bb96-42d0-b596-6a65e05a17e7",
    "title": "'Don't tax Bluey': Australian ambassador takes aim at Trump film tariffs",
    "publish_date": "Wed, 07 May 2025 22:44:51 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "\"I don't think we want to see a tax on\n\nBluey\n\n,\" the former prime minister said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/pope-conclave-senior-cardinal-urges-conclave-voters-to-pick-a-pope-who-seeks-unity-ahead-of-secret-voting-ritual/631e0743-cd87-4139-96ec-73c0a426aa08",
    "title": "Black smoke billows from Sistine Chapel, signalling no new pope",
    "publish_date": "Wed, 07 May 2025 19:10:43 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "Black smoke has billowed from the Sistine Chapel chimney, signalling that dozens of cardinals are yet to elect a new leader of the Catholic Church on the first day of the conclave in the Vatican.\n\nRoughly an hour earlier, with the cry of \"Extra omnes\" — Latin for \"all out\" — the great doors of the Sistine Chapel closed as 133 cardinals begin the secretive, centuries-old ritual, opening the most geographically diverse conclave in the faith's 2000-year history.\n\nThe red-robed cardinals entered the Sistine Chapel in pairs on Wednesday (early Thursday AEST), chanting the meditative Litany of the Saints as Swiss Guards stood at attention.\n\nPeople gather in St Peter's Square as they wait to see the smoke billow from the chimney of the Sistine Chapel in St Peter's Square during the cardinals' conclave to elect a new pope, at the Vatican, Wednesday, May 7, 2025. (AP)\n\nBlack smoke billows from the chimney of the Sistine Chapel during the cardinals' conclave to elect a new pope, at the Vatican, Wednesday, May 7, 2025. (AP)\n\nCardinals attend a final Mass at St Peter's Basilica before the conclave to elect a new pope. (AP)\n\nThe hymn, and the one that followed, implores the saints and the Holy Spirit to help the cardinals find a successor to Pope Francis to lead the 1.4 billion-strong Catholic Church.\n\nCardinal Pietro Parolin, the secretary of state under Francis and himself a leading contender to succeed him as pope, assumed the leadership of the proceedings as the senior cardinal under age 80 and eligible to participate in the conclave.\n\nSpeaking in Latin, Parolin stood before Michelangelo's vision of heaven and hell, The Last Judgment, and led the cardinals in a lengthy oath.\n\nEach one followed, placing his hand on the Gospel and promising in Latin to maintain utmost secrecy.\n\nThe dramatic ritual was more colourful than even Hollywood could create, a wash of colours, chants, incense and solemnity that underscored the seriousness of the moment.\n\nOutside in St Peter's Square, hundreds of people watched the proceedings on giant video screens until the Vatican feed cut off.\n\nHailing from 70 countries, the cardinals have been sequestered from the outside world, their cellphones surrendered and airwaves around the Vatican jammed to prevent all communications until they find a new pope.\n\nInside the secret ancient ceremony hidden from the world's eyes View Gallery\n\nFrancis named 108 of the 133 \"princes of the church\", choosing many pastors in his image from far-flung countries like Mongolia, Sweden and Tonga that had never had a cardinal before.\n\nHis decision to surpass the usual limit of 120 cardinal electors and include younger ones from the \"global south\" — often marginalised countries with lower economic clout — has injected an unusual degree of uncertainty in a process that is always full of mystery and suspense, with smoke signals telling the world if a pope has been elected or not.\n\nMany cardinals hadn't met until last week and lamented they needed more time to get to know one another, raising questions about how long it might take for one man to secure the two-thirds majority, or 89 ballots, necessary to become the 267th pope.\n\n\"Wait and see, a little patience, wait and see,\" said Cardinal Mario Zenari, the Vatican's ambassador to Syria.\n\nCardinals arrive for a final Mass inside St Peter's Basilica, before the conclave to elect a new pope, at the Vatican, Wednesday, May 7, 2025. (AP Photo/Gregorio Borgia)\n\nA final Mass, then 'All out'\n\nEarlier in the day, the dean of the College of Cardinals, Cardinal Giovanni Battista Re, presided over a morning Mass in St Peter's Basilica urging the voters to set aside all personal interests and find a pope who prizes unity. The world today needs a leader who can awaken consciences, he said.\n\n\"Let us pray that God will grant the church a pope who knows how best to awaken the consciences of all and the moral and spiritual energies in today's society,\" Re said.\n\nHe reminded them that the awesomeness of the Sistine Chapel's frescoes, and Michelangelo's in particular, is meant to remind the cardinals of the weighty responsibility they bear.\n\nIn his regulations for the conclave, St John Paul II wrote that in the Sistine Chapel, \"everything is conducive to an awareness of the presence of God\".\n\nA nun shelters from the rain as she follows a final Mass celebrated by cardinals inside St. Peter's Basilica. (AP)\n\nAfter the cardinals took their oaths, the master of papal liturgical ceremonies, Archbishop Diego Ravelli, called out \"Extra omnes\" and anyone not eligible to vote left before the chapel doors closed. An elderly cardinal remained to deliver a meditation, but after it was finished he, too, had to leave.\n\nThe cardinals don't have to take a first vote Wednesday, but they are expected to. Assuming no winner is found, the Vatican said black smoke could be expected out of the Sistine Chapel chimney about 7pm (3am AEST).\n\nThe cardinals retire for the night and return Thursday morning. They can hold up to two ballots in the morning and two in the afternoon until a winner is found.\n\nWhile cardinals this week said they expected a short conclave, it will likely take at least a few rounds of voting. For much of the past century, it has taken between three and 14 ballots to find a pope.\n\nJohn Paul I — the pope who reigned for 33 days in 1978 — was elected on the fourth ballot. His successor, John Paul II, needed eight. Francis was elected on the fifth in 2013.\n\nThe dean of the College of Cardinals, Cardinal Giovanni Battista Re, presided over the service. (AP)\n\nLobbying before the conclave\n\nWhile the cardinals are supposed to resist any \"secular\" influences in their choice, such lobbying abounded in Rome in the days before the conclave as various groups reminded cardinals of what ordinary Catholics want in a leader.\n\nYoung Catholics penned an open letter reminding cardinals that there is no church without young people, women and the laity. Conservative Catholic media slipped cardinals copies of a glossy book containing their assessments of contenders. Survivors of clergy sexual abuse warned cardinals that they would be held accountable if they failed to find a leader who will crack down on decades of abuse and cover-up.\n\nCardinal Pietro Parolin, centre, greets Cardinal Giovanni Lajolo during the Mass. (AP)\n\nAdvocates for women's ordination were sending pink smoke signals over the Vatican to demand that women be allowed to be priests and participate in a conclave.\n\nEven the White House got involved, posting a photo of President Donald Trump dressed as a pope. Trump said it was a joke, but the gesture was denounced by former Italian Premier Romano Prodi as \"indecent\" political interference in matters of faith that harked back to times when secular rulers habitually wielded religion to stay in power.\n\nLisette Herrera, a 54-year-old tourist from the Dominican Republic, was deeply moved to find herself by chance in Rome as the conclave began. She decided Wednesday morning to skip the Spanish Steps and Trevi Fountain and pray instead in St Peter's Square.\n\nCardinal Pierbattista Pizzaballa attends the Mass. (AP)\n\n\"I'm praying to the Holy Spirit for a young pope who would stay with us for a long time,\" she said. \"I don't believe in conclave politics, I just feel that the Holy Spirit is here and that's all we need to know.\"\n\nArmando Statti, a pilgrim from Crotone, Italy, said he expected cardinals would settle on a pope in the image of Francis or John Paul II.\n\n\"We hope he will be announced as soon as possible, for the sake of the whole world and for peace, and that he will embrace everyone,\" he said.\n\nChallenges facing a new pope\n\nFaithful capture images with their smartphones of cardinals during a final Mass inside St Peter's Basilica before the conclave to elect a new pope, at the Vatican, Wednesday, May 7, 2025. (AP Photo/Gregorio Borgia)\n\nMany challenges face the new pope and weigh on the cardinals — above all whether to continue and consolidate Francis' progressive legacy on promoting women, LGBTQ+ acceptance, the environment and migrants, or roll it back to try to unify a church that became more polarized during his pontificate. The clergy sex abuse scandal hung over the pre-conclave talks.\n\nSince Francis chose 80 per cent of the voters, continuity is likely, but the form it might take is uncertain and identifying front-runners has been a challenge.\n\nBut some names keep appearing on lists of \"papabile,\" or cardinals having the qualities to be pope.\n\nHailing from 70 countries, the cardinals are being sequestered from the outside world, their mobile phones surrendered and airwaves around the Vatican jammed to prevent all communications until they find a new leader for the 1.4 billion-member church. (AP)\n\n— Cardinal Pietro Parolin, 70, an Italian who was Francis' secretary of state and the Vatican No. 2, is a leading contender.\n\n— Filipino Cardinal Luis Tagle, 67, is a top candidate to be history's first Asian pope. He had a similarly high-profile job, heading the Vatican's evangelization office responsible for the Catholic Church in much of the developing world.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/disneyland-abu-dhabi-disney-announces-first-new-theme-park-in-a-generation/370b46fb-60c8-445e-bb49-c4e6eb35b0ee",
    "title": "Disney announces new theme park in Abu Dhabi, its first in a generation",
    "publish_date": "Wed, 07 May 2025 12:36:45 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "For the first time in 15 years, the Walt Disney Company has announced the development of a new theme park – a resort destination in Abu Dhabi that marks the company's entry into the Middle East .\n\nThe Disneyland Abu Dhabi resort will become Disney's seventh global resort destination, the company announced on Wednesday shortly before its second-quarter earnings call.\n\nDisney's parks have arguably been its most important financial driver, representing 59 per cent of its operating income in the 2024 fiscal year as streaming competition heats up.\n\nThe artist rendering of the castle provided by Disney shows a spiralling, crystal-like structure towering above the rest of the park. (Walt Disney Studios)\n\nAnd while US parks attendance decreased modestly last year, Disney reported Wednesday morning that domestic park attendance rose again, and revenue surged in the first quarter.\n\nAlthough the company sees potential in its international resorts, where there's been more growth in attendance and guest spending, China has been a pain point amid the trade war: park attendance in Shanghai and Hong Kong fell, and international park sales tumbled in the first quarter as a result.\n\nMiral, an Abu Dhabi company, will fully develop, build and operate the resort with Disney \"imagineers\" leading creative design and operational oversight. With a potential opening in the early 2030s, the initial project plan includes one theme park and an unknown number of hotels.\n\n\"Every time we open a new experience or a theme park … it's really important not just to take a theme park that might exist somewhere else and plop it into the ground in that new area that we would be going into,\" Josh D'Amaro, the chairman of Disney Experiences, told CNN in an exclusive interview with CNN's Becky Anderson in Abu Dhabi.\n\nEach park needs to reflect, in its design, its food and more, each specific location, he added.\n\n\"And so here in, in Abu Dhabi, we want the same thing.\"\n\nREAD MORE: Greens set to lose leader in election bombshell\n\nWalt Disney World in Orlando, Florida.\n\nA whole new world\n\nBoth Abu Dhabi and Dubai airports have ambitious plans, with their vision as a pair of world-leading airports connecting a third of the world's population within a four-hour flight. That includes the 1.4 billion people living in India, many of whom would be able to travel a shorter distance to Abu Dhabi than to Disney's parks in Shanghai or Hong Kong.\n\nD'Amaro said a potential 500 million people in the region have the means to visit a Disney theme park. That easy access, coupled with the country's future-oriented development, factored into Disney's decision.\n\n\"There was no question that for our seventh resort, this is where it was going to be,\" D'Amaro said.\n\nDisney's resort will be located on Yas Island, where Miral has developed other resorts including SeaWorld YAS Island Abu Dhabi, Yas Waterworld, and Warner Bros World, built under licence by CNN's parent company, Warner Brothers Discovery.\n\nYas Island is within a 20-minute drive of downtown Abu Dhabi and a 50-minute drive from Dubai. It is home to several existing theme parks, a golf course, marina, waterfront and mall, with 165 eateries across the island.\n\nPeople tour at SeaWorld, the region's first marine life theme park, on Yas Island in Abu Dhabi in May 2023. (Karim Sahib/AFP/Getty Images via CNN Newsource)\n\nLike a living 'Tomorrowland'\n\nDisney says this new venture will be its most technologically advanced park, blending with the city of Abu Dhabi's future-oriented aesthetic.\n\nWhile every Disney resort is anchored with a castle park, this castle will be different than fairytale-style landmarks. The artist rendering of the castle provided by Disney shows a spiralling, crystal-like structure towering above the rest of the park.\n\nThe property will also be the first Disney resort to sit directly on a waterfront (the Tokyo Disney Resort was built on the edge of the Pacific Ocean, but the water is only seen beyond park walls, not accessible by guests).\n\nThe company is also ready to take advantage of its recent investments in immersive gaming.\n\nFor example, D'Amaro said, Disney could use Unreal Engine, a developer tool used in many Disney films to create renderings, to also pull that imagery into theme park attractions.\n\n\"So that the real-time translation of stories from film, from game, to theme park, it's right there for our guests to enjoy. So we're very, very bullish on this space, and I think for this part, particularly given how tech-forward it's going to be, we have a huge opportunity.\"\n\nAussie airport named among world's top 20 View Gallery\n\nPark wars\n\nDisney hasn't announced a new theme park or resort since its 2010 Shanghai Disneyland news.\n\nThe Abu Dhabi announcement comes one month after Universal said it would build its seventh resort, this time in the United Kingdom, and just weeks before Universal opens Epic Universe in Central Florida, the first major opening in 26 years for the country's biggest hub of theme parks.\n\nDisney dismissed concerns that new competition would hurt foot traffic at Walt Disney World.\n\n\"Anytime something opens up in Central Florida, we get more tourists coming in,\" D'Amaro said on CNBC Wednesday morning.\n\n\"You're not going to go to you're not going to come into Central Florida and not go visit Star Wars. … We feel that we're going to benefit from that.\"\n\nGuests ride the Hiccup's Wing Gliders rollercoaster in the How to Train Your Dragon - Isle of Berk area, at Epic Universe theme park in Orlando, Florida, on April 5, 2025. (Thomas Simonetti/Bloomberg/Getty Images via CNN)\n\nDisneyland Abu Dhabi has been under discussion for about a decade, D'Amaro told CNN. Disney's theme parks hosted more than 140 million guests globally in 2023, the most of any amusement or theme park operator in the world. That includes more than 17 million annual visitors each at Magic Kingdom in Florida and Disneyland Park in California, the two most-visited theme parks on Earth.\n\nDomestic theme park attendance softened last year, as Americans criticised big price increases or started to scale back travel spending in an uncertain economy. International parks had been outperforming their domestic counterparts. But the reversal in fortunes in the first quarter proves adding strategic locations around the world can help Disney balance out fluctuations in the global economy.\n\n\"Even with consumer confidence somewhat down and some issues in terms of the economy, people still see a Disney theme park experience as really special,\" Disney CEO Bob Iger said on CNBC on Wednesday.\n\n\"They're just incredibly resilient.\"\n\nWhen asked about a fifth park in Florida, D'Amaro cited aggressive expansion projects within the existing four parks at Walt Disney World without mentioning a new park.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/valerie-sausage-dog-reunited-owners/dd38f62b-1773-4193-a8b9-c9a07169a7f7",
    "title": "Owners reunited with sausage dog after 529 days missing on Kangaroo Island",
    "publish_date": "Wed, 07 May 2025 10:06:14 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "After 529 days of survival in the Kangaroo Island wilderness, Valerie the dachshund has been reunited with her owners, Georgia Gardner and Josh Fishlock.\n\nThe canine's extended solo adventure began during a camping trip in November 2023, and hopes of finding her dwindled until a remote camera captured a distinctive wink in March, reigniting the search effort.\n\nThis prompted Kangala Wildlife Rescue to initiate a plan, using familiar scents and food to entice the elusive dog.\n\nValerie the dachshund has been reunited with her owners, Georgia Gardner and Josh Fishlock. (Nine)\n\nJust a few weeks later, the daring sausage dog was caught.\n\n\"By the time we got to the trap site it was a very nervous drive to make sure she'd stayed in the trap,\" Jared Karran from Kangala Wildlife said.\n\nThe reunion was emotional.\n\n\"I bawled my eyes out when she came running up to me. She came up and she licked me straight in the face and I was like oh god,\" Gardner said.\n\n\"It was incredible to finally have her back in our hands and back on our lap and giving her a big belly rub that we've been missing,\" Fishlock added.\n\nThe canine's extended solo adventure began during a camping trip in November 2023. (Nine)\n\nThe mystery of Valerie's survival remains unsolved.\n\n\"I don't think anyone will know that, that will be a secret she takes to the grave,\" Fishlock said.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/cost-of-living-pressure-on-sport-fees-participation-in-regions/105243892",
    "title": "Family saves and sacrifices to help son chase sporting dream",
    "publish_date": "Thu, 08 May 2025 01:26:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "River Allum will be a long way from home when he runs out to play in Kuala Lumpur later this year.\n\nThe 13-year-old from Geraldton, 420 kilometres north of Perth, has been honing his skills on the soccer field, while his parents have been sacrificing to save the $3,630 needed for travel costs, tournament fees and gear.\n\nHis mother Rachell Allum said she had already spent about $1,700 on her son's soccer-related costs this year.\n\nShe said the rising cost of living was making it harder to afford.\n\nMs Allum says she and her husband are sacrificing and saving. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nAustralian government data showed 6.3 per cent of children surveyed could not afford sport or the associated travel costs as recently as last year.\n\nMs Allum said her family was budgeting strictly for the Kuala Lumpur trip as River was not eligible for any grants she could find.\n\nShe said living in regional WA had also multiplied the cost of participating in sport over the years, as River often travelled to Perth for competitions such as Country Week.\n\n\"We have to miss out on a few things ourselves, but we wouldn't deny him that chance as much as we possibly could,\" Ms Allum said.\n\nRiver says he is grateful for his parents' ongoing support. (ABC Midwest and Wheatbelt: Chloe Henville)\n\n\"We've got to find accommodation for ourselves, let alone petrol … the petrol prices are ridiculous.\"\n\nBut she said the costs were worth it to see River excel at a sport he loved.\n\n\"Every annual fee is expensive, and he's growing — you know, new boots, new uniforms, new everything — but we are very, very proud of River,\" Ms Allum said.\n\nUnderstanding the sacrifice\n\nThe high-school student said he was aware of the financial strain.\n\n\"I do feel a bit bad about all the costs,\" River said.\n\nRiver has been playing soccer since he was six. (ABC Midwest and Wheatbelt: Chloe Henville)\n\nHe said sport helped him work through emotions such as sadness and anger.\n\n\"I can just go to soccer and just wipe my head away from it, and it makes me feel a lot happier again,\" River said.\n\nThe teenager said everyone should have access to sport as an outlet, regardless of their financial position.\n\nIt is a perspective shared by Federation University sport science professor Rochelle Eime.\n\nShe has conducted a national study in conjunction with the Australian Sports Commission.\n\nYet to be publicly released, the study found fees were a growing barrier to club sport participation.\n\nRochelle Eime has conducted a study on the cost of sport across Australia. (Supplied: Rochelle Eime)\n\n\"Cost has always been an issue, but more of an issue now with the rising cost of living,\" Professor Eime said.\n\n\" Participation is much lower in areas of lower socio-economic status. \"\n\nCritical opportunity missed\n\nProfessor Eime said lower participation had huge implications for physical fitness, mental health and social connection, especially for young people.\n\n\"Without those opportunities to play sport, they're missing out on a lot of life skills,\" she said.\n\nProfessor Eime said though sport was often the \"social fabric\" in regional communities, participants could incur more costs than their metro peers, something the Ballarat woman was familiar with.\n\nProfessor Eime says sport is important for social connection in small towns. (ABC Midwest and Wheatbelt: Chloe Henville )\n\nShe said her 18-year-old son, Jay, was travelling to China to compete in a tennis tournament, but even local travel took a toll.\n\n\"He's commuting an hour-and-a-half to training several times a week … now that he can drive, that saves me,\" Professor Eime said.\n\nAlong with the price of fuel, she pointed to other travel fees including overnight accommodation to join metro competitions.\n\nProfessor Eime said geographical barriers and cost burdens could limit the sporting potential of some talented regional players.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/perimenopause-protein-intake-how-much-women-need/105237122",
    "title": "Want to feel stronger in perimenopause? Prioritising protein can help",
    "publish_date": "Thu, 08 May 2025 01:03:42 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Elaine De Silva has spent many hours researching how to look after her body during perimenopause.\n\nThe 48-year-old from South Perth/Whadjuk Noongar country says there's been one big takeaway from her doctor's visits, women's health podcasts and books — consuming adequate amounts of protein is a must.\n\n\"I'm trying as much as I can to incorporate protein, both animal and vegetable in my diet,\" she says.\n\n\"I eat protein for lunch and dinner, and I eat one to two boiled eggs every day.\n\n\"I'm always looking for protein fortified foods.\"\n\nWhy is protein important during perimenopause and how much should we be consuming each day? We looked to three dietetic and nutrition experts to find out.\n\nOur experts Dr Shelley Wilkinson, dietitian and senior research fellow at the University of Queensland\n\nDr Stacy Sims, US exercise physiologist and nutritional scientist based in New Zealand\n\nProfessor Stephen Simpson, academic director of the University of Sydney Charles Perkins Centre\n\nWhy is protein so important during perimenopause?\n\nThere are a couple of reasons, according to Shelley Wilkinson, a dietitian and senior research fellow at the University of Queensland's School of Pharmacy, in Meanjin/Brisbane.\n\nPerimenopause usually begins in your 40s and can last years Photo shows A woman with brown curly hair sits on a grey sofa, looking unwell, with her hand to her head Menopause is technically the single day 12 months after your last period. But perimenopause can last years. Here's what to look for and when to get help.\n\n\"It helps maintain our muscle mass and also promote feelings of fullness or satiety,\" she says.\n\nShe says during perimenopause, oestrogen levels begin to drop which decreases bone density as well as lean tissue, which is our muscle.\n\n\"By having enough protein in our diet, it helps with maintaining that muscle mass, and then it also helps us feel full, which might prevent that weight gain that generally occurs in perimenopause,\" she says.\n\n\"We want to maintain muscle mass to keep our metabolism strong and our body running well, it also keeps us feeling strong and stable as we go into older age.\"\n\nShe says women with strong muscle mass are less likely to have falls as they get older, and keeping bones strong also helps prevent osteoporosis.\n\nHow much protein per day should women be consuming?\n\nDr Wilkinson says you don't have to know whether you're experiencing perimenopause to assess your protein intake.\n\n\"When we look at the national guidelines, they say 0.6 grams per kilogram each day for women between the ages of 19 and 70,\" she says.\n\n\"The daily protein recommendation say for a woman weighing 60 kilos, is 60 multiplied by point six, which is 36 grams a day.\n\n\"If they were 70 kilos, it's 42 grams a day.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nShe says once women reach 50 years of age, the food groups they require change to include more calcium rich foods, which can also be a source of protein.\n\n\"It goes up to four serves of dairy a day and then meat and [protein] alternatives — you want two serves a day.\"\n\nShe says people should be aiming to hit the five food groups every day with a balance of lean meats and poultry as well as plant protein.\n\n\"Half of the protein that people eat should come from those plant sources,\" she says.\n\n\"So that's nuts and seeds, a lot of legumes and lentils, red kidney beans, chickpeas, cannellini beans, tofu, soya beans, edamame, cashews, almonds, walnuts, pecans.\"\n\nShe says instead of using processed protein powders, adding skim milk powder is the cheapest and most nutritious way to increase protein.\n\nAnd be cautious of over-consuming, Dr Wilkinson says if you're taking too many calories in your body, it will store any extra food as fat.\n\nProtein and exercise build muscle and strength\n\nA 2023 study by the International Society of Sports Nutrition found that active women in perimenopause and menopause may need slightly more protein, and have it distributed evenly across meals every three to four hours.\n\nThe work includes research by Stacy Sims, an internationally renowned exercise physiologist and nutritional scientist based in New Zealand.\n\nDr Stacy Sims (centre) says the amount of protein women need depends on their age, activity level and menstrual cycle status. (Supplied)\n\n\"For [these] perimenopausal and menopausal women, daily protein needs increase to about 2-2.3g per kg of body weight,\" Dr Sims says.\n\n\"As we age, our bodies become more resistant to the muscle-building effects of protein and exercise, requiring higher doses of both.\"\n\nShe says that another study found that after eating, older women experienced a smaller increase in muscle protein synthesis (the metabolic process where amino acids are incorporated into new muscle protein), with some studies showing a drop of up to 40 per cent compared to younger women.\n\n\" To achieve the same training responses, an older woman may require a greater quantity of protein to achieve the same result. \"\n\nMs De Silva credits feeling strong and healthy during perimenopause to the combination of extra protein and exercise.\n\n\"I'm doing strength exercising with weights, which I never used to do, I used to love cardio,\" she says.\n\nPerth woman Elaine De Silva has increased her protein intake and exercise routine during perimenopause. (Supplied: Elaine De Silva)\n\nDr Wilkinson says if you need guidance on what's right for you, consult your GP.\n\nShe says GP's can write a chronic disease management plan which includes five subsidised visits a year to practitioners such as dieticians and exercise physiologists.\n\n\"Dietitians are really skilled at going, 'Okay, well, what's your budget? What are your food interests? And how can we change the dietary guidelines to adapt to you?'\" she says.\n\nHow to avoid the 'protein leveraging effect'\n\nStephen Simpson, the academic director of the University of Sydney's Charles Perkins Centre, has been studying the impacts of protein on women experiencing perimenopause.\n\nHe recommends women consume healthy protein sources where possible to avoid what he calls the \"protein leveraging effect\" — when our body is craving protein, but we instead consume foods with lower concentrations of protein (processed foods).\n\n\"That combination means that our protein appetite is going to drive us to eat more to get to our protein target, and in so doing, you eat more calories than you need,\" he says.\n\nStephen Simpson says women experiencing perimenopause can be at greater risk of overeating and weight gain. (Supplied: University of Sydney)\n\n\"How it interacts, specifically with women during perimenopause, is that during that period … the hormonal changes that are happening start to break down lean tissue.\n\n\"That rides your protein appetite, and unless you increase the concentration of protein in the diet, you're going to be prone to eat even more calories to gain your now increased protein requirements and that's a bad combination.\"\n\nHe says the good news is that you can make small dietary changes to ensure you're consuming foods with a high concentration of protein.\n\n\"The evidence suggests it's only about nine or 10 grams of protein extra required a day, so that's a relatively small amount,\" he says.\n\n\"They can be plant-based foods, obviously, the legumes, chickpeas.\n\n\"Or increasing your intake of dairy and animal-based proteins as well, they're both going to give you that little bit extra, and to do it in main meals rather than snacking.\"\n\nKey takeaways Women need to consume adequate amounts of protein during perimenopause to counteract a decrease in muscle mass and bone density\n\nDieticians say the national guidelines are 0.6 grams per kilogram each day for women between the ages of 19 and 70\n\nStudies have shown that active women may need slightly higher doses of protein per day than those who are sedentary\n\nProtein leveraging occurs when women consume foods that don't contain high concentrations of protein, leading to overeating\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/languages-curriculum-education-schools-punjabi-vietnamese/105213638",
    "title": "Schools teach 'prestige' languages over most spoken, professor says",
    "publish_date": "Thu, 08 May 2025 01:03:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "When 10-year-old Guribadat Kaur started kindergarten in regional Victoria her parents changed her Punjabi name to Ebu because no-one could pronounce her name.\n\nEbu's mother Raman Preet Kaur said her daughter was \"lost\" before the change.\n\n\"It was hard — she didn't know if people were talking to her, so we had to change her name to something easy to pronounce,\" she said.\n\nMs Kaur said if Punjabi had been available to learn at her daughter's Ballarat school, Ebu might have felt more accepted and children and teachers might have been able to pronounce her name.\n\nIn 2025, things started to change for Ebu when she attended the volunteer-run Rootz Punjabi language program outside of school hours.\n\n\"[Her] sense of identity grows more strong,\" Ms Kaur said.\n\nAccording to the latest census in 2021, Punjabi is the fastest-growing community in Australia, with about 240,000 people using the language at home.\n\nIn Victoria, Punjabi is the fourth most commonly spoken language, excluding English.\n\nHowever, it is only taught in two Victorian government schools.\n\nRaman Kaur and her daughter, Guribadat Kaur, attending Punjabi school. (ABC Ballarat: Charlotte Wilkes)\n\n'Prestige languages'\n\nUniversity of Melbourne professor of language Joseph Lo Bianco said languages were chosen for schools based on utility, but also \"prestige\".\n\n\"I think it is sad that there is a hierarchy of values that many people have in their heads about what language is worthwhile,\" Professor Lo Bianco said.\n\nProfessor Lo Bianco thinks schools should consider what languages students speak at home. (Supplied)\n\n\"The main Asian languages are seen to have economic benefits, such as Japanese and Chinese.\n\n\"People admire French culture, so there's a lot of prestige attached to that.\"\n\nFrench is one of the top five most-taught languages in Victorian state schools and is offered at many private schools in Melbourne such as Haileybury, Caulfield Grammar, Wesley College and Carey Baptist Grammar.\n\nHowever, there are only 18,543 French speakers in Victoria, which is equivalent to 0.29 per cent of the state's population.\n\nMost commonly taught languages in Victorian government schools Most commonly spoken languages in Victoria, excluding English 1. Mandarin 1. Mandarin 2. Auslan 2. Vietnamese 3. Japanese 3. Greek 4. Italian 4. Punjabi 5. French 5. Italian 6. Indonesian 6. Arabic 7. Spanish 7. Cantonese 8. German 8. Hindi 9. Victorian Indigenous Languages 9. Sinhalese 10. Hindi 10. Spanish\n\n\"I think there is a case for doing more in Arabic and Turkish and Vietnamese and languages like that,\" Professor Lo Bianco said.\n\nHe said changing and diversifying the languages taught in schools was difficult because some people did not value some cultures as much as others.\n\n\"So we can only do it by steadily promoting the value of cultural differences,\" Professor Lo Bianco said.\n\nFastest-growing community\n\nIn 2018, when Ramman Marupur moved to Ballarat, Punjabi was fast becoming one of the most spoken languages in the regional Victorian city.\n\nThe following year, the first-generation Indian-Australian launched a free school to teach Punjabi language, traditional dance and religion to help students develop a sense of pride about their Indian heritage.\n\nPreet Khinda and Ramman Marupur said learning your mother language is important for cultural pride. (ABC Ballarat: Charlotte Wilkes)\n\nThe Rootz Punjabi School in Ballarat, which has recently expanded to another site in Geelong, has 20 students.\n\nMs Marupur said the school helped students overcome cultural put-downs, like being teased for wearing \"Indian costumes\".\n\nPunjabi is now the second-most spoken language in Ballarat, excluding English.\n\nThe teacher at Rootz Punjabi School in Geelong, Preet Khinda, said educating students with an Indian background about their language and culture was important, but it needed to be mirrored by acceptance in the wider community.\n\n\"Our kids feel awkward when they speak our language in a shopping centre,\" Ms Khinda said.\n\n\"I think people should accept all those things, like cultural identity.\n\n\" I think schools should teach all the young children that we should respect each and every culture's language. \"\n\nGrowing up bi-cultural\n\nAs \"one of two Vietnamese students\" in her school, Haylee Hua said she grappled with her sense of identity.\n\n\"People ask you, 'What culture are you from?' or, 'What are you?'\" the 20-year-old Monash University student said.\n\n\"They'll assume that you're Chinese.\"\n\nShe said if Vietnamese had been taught more widely, it would have made life easier for her, and other descendants of Vietnamese migrants.\n\n\"Having an Aussie being able to speak a few words of Vietnamese would really help,\" Ms Hua said.\n\nShe attended an out-of-school Victorian School of Languages (VSL) course every Saturday to improve her understanding of Vietnamese outside of her own home.\n\nMs Hua says seeing Vietnamese taught at school would have been encouraging for her younger self. (Supplied: Haylee Hua)\n\nToday, Vietnamese is the second-most spoken language at home in Victoria, excluding English.\n\nWorse in the regions\n\nProfessor Lo Bianco said Vietnamese was a good example of a language that needed to be more widely taught in mainstream schools to better reflect the real world.\n\n\"In communities where there are a lot of Vietnamese children and families it's mostly neglected,\" he said.\n\nThe Punjabi Rootz School is run by volunteers in Ballarat and Geelong. (ABC Ballarat: Charlotte Wilkes)\n\nWhile the Department of Education offers classes in more than 50 languages outside school hours through the VSL, Professor Lo Bianco said regional and remote communities were still \"disadvantaged\" when it came to language offerings.\n\nProfessor Lo Bianco said that for migrant communities in regional areas, having diverse language offerings in schools was a \"form of respect\" and provided migrants with a sense of belonging.\n\n\"[It's] a way of saying that they count,\" he said.\n\n\"Schools should know more about who their students are and what languages they have in their homes and their communities.\n\n\"If they can't teach those languages, they should celebrate the fact that the students know them.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/afl-carlton-charlie-curnow-hurts-knee-at-training/105267632",
    "title": "'You don't need to know specifics': Blues coach bristles at questions over star's injury",
    "publish_date": "Thu, 08 May 2025 00:58:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "A cagey Michael Voss has attempted to diffuse any concern over Charlie Curnow's fitness after the star Carlton forward was involved in a heavy training collision.\n\nThe Blues coach declared the dual Coleman medallist was available for Friday night's clash with St Kilda at Docklands.\n\nCurnow will take part in Carlton's captain's run today in a bid to reassure medical staff he is fine to play.\n\nVoss confirmed Curnow had collided with star ruckman Tom De Koning at training, but disputed reports the 28-year-old had an issue with his knee.\n\nWith Carlton coming off a thumping defeat to Adelaide, Voss was in no mood to discuss specifics around Curnow's health.\n\n\"He'll be fine,\" Voss said on Thursday.\n\n\"The last 30 seconds of the drill, him and Tom had a nice little collision, so it's not exactly what you want to see.\n\n\"I tried to have a bit of a laugh to fob it off, but holding his knee is incorrect.\"\n\nVoss also rejected suggestions Curnow had been receiving pain-killing injections in his knee to train and play.\n\n\"You don't need to know specifics, let's just say he's playing,\" he said.\n\nVoss also said key defender Jack Silvagni would return after missing the 60-point smashing by the Crows at Adelaide Oval.\n\nSilvagni, who has been one of the Blues' best players this season, broke his hand in the rousing win against Geelong a week earlier.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/queensland-students-headed-to-skipping-world-championships/105262666",
    "title": "Young skipping stars take sport to next level at world championships",
    "publish_date": "Thu, 08 May 2025 00:26:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "James walks into the gym of his school with 60 other students and picks up a skipping rope, ready to practise for the world championships.\n\nThe year seven St Luke's Anglican School student and two classmates, Dominic and Freya, will represent Australia at the Japan competition in July.\n\nThe St Luke Leapers have grown into one of the largest competitive skipping clubs in Queensland in just six years. (ABC Wide Bay: Nikki Sorbello)\n\nJames has come a long way in the three years since he moved from South Africa to Bundaberg, 400 kilometres north of Brisbane.\n\n\"When I arrived here everyone was skipping and I was like, 'Oh, wow, I've never seen this before,'\" James said.\n\n\"At first I couldn't even skip once and I kept on tripping up, but then I kept practising for a long time.\"\n\nThe school's skipping program first started as a lunchtime Jump Rope for Heart session in 2019 but quickly grew to one of the largest competitive clubs in Queensland.\n\nCoach Hayley Russo said she did not realise competitive skipping was an option until it was suggested by club mentor Luke Boon, who has won multiple world titles.\n\nHayley Russo has turned the school's Jump Rope for Heart initiative into a competitive skipping club. (ABC News: Nikki Sorbello)\n\n\"Luke said to me, 'You've got to do something here, your kids have got so much talent,'\" Ms Russo said.\n\n\"In 2023 we attended our first state and national championships and crowned three Australian champions in our first competition, so it turns out we were actually pretty good.\"\n\nMr Boon, founder of Jump Force International, travels to the school yearly to mentor the students.\n\nLuke Boon at the Queensland Skipping State Championships in Bundaberg in May. (ABC Wide Bay: Nikki Sorbello)\n\n\"I get to go up there and just have fun with them and teach them new skills, and they're all just so keen to learn,\" Mr Boon said.\n\n\"Every single child in that school is just extremely talented.\"\n\nSkipping has been such a hit at the small prep to year 12 school of 1,100 students that Ms Russo has successfully lobbied Skipping Queensland to bring the state championships to Bundaberg in May.\n\nIt was the first time the event was held in a regional area.\n\nMore than jumping rope\n\nThe three students will travel with three coaches, and parents who will also be competing in the world championships, as part of the Australian team of 141 athletes.\n\nDominic will be one of 141 Australian athletes at the Skipping World Championships in Japan. (ABC Wide Bay: Nikki Sorbello)\n\nDominic said he was looking forward to competing with his team.\n\n\"I have high hopes for us because our coach, he's top level, he's an Australian champion and all of his friends and partners are all Australian champions, so they all have our backs if we do something wrong,\" he said.\n\nCompetitive skipping is something that must be seen to be understood, Mr Boon said.\n\n\"It's like taking the best of athletics, the best of gymnastics and figure skating and smashing it together into one sport,\" he said.\n\n\"It really has so much to offer.\"\n\nSkipping a great sport for kids\n\nThe Heart Foundation's Jump Rope for Heart program is where many children first pick up a skipping rope.\n\nHeart Foundation senior advisor for physical activity Elizabeth Calleja said in the 42 years since the program began, 90 per cent of schools had participated in the charity event, raising $115 million.\n\nHayley Russo says skipping is a great way to engage with kids. (ABC Wide Bay: Nikki Sorbello)\n\nShe said activity was important for health, with children and teens needing one hour of activity per day.\n\n\"It's helping them with cognition, their learning and development, their strength, their skills, and skipping is a great way to bring all of that together to help the kids to be active and also learn a bit more about their health and bodies,\" Ms Calleja said.\n\nAs a coach, Ms Russo said it was a fun activity that kids could do anywhere.\n\n\"It's really an easy activity that you can implement and have some fun with your kids and bring a little bit of physical activity back into your life,\" she said.\n\nThe ABC has spoken to students with the permission of their families. It is the policy of the school not to use children's surnames.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/erin-patterson-mushroom-murder-trial-live-blog-court-evidence/105267156",
    "title": "Live: Doctor told Erin Patterson she might need liver transplant, court hears",
    "publish_date": "Thu, 08 May 2025 00:16:35 +0000",
    "category": "lifestyle",
    "authors": [
      "Tim Callanan",
      "Melissa Brown",
      "Kristian Silva"
    ],
    "text": "Ms Ashton says Erin got up and said she needed to leave.\n\nShe says the conversation went back and forth between Erin wanting to leave, and Ms Ashton expressing concern for Erin's wellbeing and trying to get her to understand the seriousness of the situation.\n\nShe describes it as \"a very short rapid communication\" which included talking about the poor condition of the other guests and that they were being transferred to other hospitals for higher-level care.\n\nMs Ashton says she told Erin \"her life was at risk. These guys were really unwell. We had two in ICU at the time\".\n\nShe says Erin kept repeating the same reason for leaving — that she hadn't come to the hospital prepared to stay, that she did not think she would need to be admitted, and that she needed to go away to prepare and would come back.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/collie-locals-nuclear-future-post-2025-election/105265538",
    "title": "Mining town locals say politicians should 'keep talking' about nuclear",
    "publish_date": "Wed, 07 May 2025 23:01:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents of a West Australian mining town slated for one of the federal Coalition's proposed nuclear power plants remain open-minded about the policy as the recriminations from Peter Dutton's election loss continue.\n\nCollie, 200 kilometres south of Perth, was one of seven towns picked by the opposition to host a nuclear reactor.\n\nIt was chosen due to its position at the centre of WA's largest electricity grid.\n\nWhile the opposition failed to carry a single booth in the town, Liberal Member for O'Connor Rick Wilson enjoyed a two-candidate-preferred swing of more than 15 per cent across parts of the community.\n\nBut technical challenges — the nature of WA's grid meant Collie would require a small modular reactor — and Mr Dutton's decision not to visit the town during the campaign left residents with more questions than answers.\n\nBy contrast, Prime Minister Anthony Albanese and WA Premier Roger Cook spruiked Labor's battery energy developments when they visited the town late in the campaign.\n\n'Keep talking' about it\n\nJulia Larking is among the residents supportive of nuclear power.\n\nShe hoped discussions about it would continue.\n\n\"I was quite keen on nuclear myself,\" she said.\n\n\"I think it would be very good to do further investigation and put it on the long-term plan because they take a long time to build.\n\n\" They're installed worldwide with success. Cheap base load power is what's missing in the plan at the moment and nuclear would have provided that. \"\n\nJulia Larking would like to see nuclear discussions continue. (ABC South West WA: Jacqueline Lynch)\n\nCorey Graham said he was worried the Coalition's election loss represented a backwards step for what he thought were important conversations to be had about nuclear.\n\n\"They should always keep talking about it but they need to set how long it's going to take and how much money it's going to take because it's coming out of taxpayer money,\" he said.\n\nCorey Graham says he would like to see some of the questions around nuclear answered. (ABC South West WA: Jacqueline Lynch)\n\nIt is unclear if nuclear will stay on the Coalition's agenda.\n\nCollie Shire president Ian Miffling, one of a few people in the community to speak directly with Mr Dutton about the proposal, said the result left the plan \"dead in the water\".\n\nIan Miffling says any future push for nuclear would need to be clearly explained. (ABC South West WA: Jacqueline Lynch)\n\nHe said any revival of the plan would hinge on providing clear answers to the community's questions.\n\n\"Unless someone came to us in the future and said, 'Look, here is a renewed proposal, here is a new policy, what do you think about it?' … we're not going to waste any time worrying about it,\" he said.\n\n\"I think we've got more important things in Collie to think about and do.\"\n\nWith the Liberals absent from the field it was left up to nuclear advocates such as Grace Stanke to back in the plan, visiting Collie during a national tour backed by Dick Smith.\n\nHeather Gangell says plans for nuclear should be taken off the table. (ABC South West WA: Jacqueline Lynch)\n\nLifelong Liberal voter and Collie resident Heather Gangell said her opposition to nuclear power was one of the main reasons she changed her vote.\n\n\"It's the first time in my life I actually voted Labor this time, instead of Liberal,\" she said.\n\n\"Everybody has their views. I for one don't want it [because] what are they going to do with all the waste?\"\n\nNuclear debate to continue\n\nLiberal Member for Durack, Melissa Price, told ABC Perth Radio the nuclear policy was not behind the party's worst-ever election loss.\n\n\"When we first announced it, I thought this is pretty gutsy,\" she said.\n\n\"The Australian public aren't mugs, they've figured out themselves that the renewable revolution just ain't going to cut it to keep the lights on and to make our energy affordable.\"\n\nThe Coalition has retained several seats across Australia that had been slated for nuclear, including O'Connor — which encompasses Collie and an area of southern WA larger than South Australia.\n\nRick Wilson had presented the nuclear plan to Ian Miffling before the election. (ABC South West WA: Kate Forrester)\n\n\"I think [this] sends a clear message that Labor's renewables-only policy does not wash with such an energy-aware workforce,\" Mr Wilson wrote on social media.\n\nSome Liberal MPs viewed the election thumping, which resulted in Opposition Leader Peter Dutton losing his own seat, as a clear sign of voters' rejection of nuclear.\n\nOther high-profile Coalition MPs have indicated they would like to see nuclear remain on the cards, and Nationals leader David Littleproud claimed the policy was not the reason for the election loss.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/champions-league-paris-saint-germain-beats-arsenal/105266954",
    "title": "Heartbreak for Arsenal as PSG claims Champions League final spot",
    "publish_date": "Wed, 07 May 2025 22:11:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Paris Saint-Germain weathered one attack after another and showed remarkable adaptability to hold off and defeat an inspired Arsenal 2-1 to reach the Champions League final on Thursday morning.\n\nDeprived of the ball possession it usually enjoys, PSG looked shaky early on but found answers by relying on counter-attacks and goalkeeper Gianluigi Donnarumma to advance 3-1 on aggregate.\n\nPSG reached the final of Europe's elite tournament for just the second time in club history — it was runner-up five years ago — and did so in the first season following superstar Kylian Mbappe's departure to Real Madrid.\n\nThe French club will try again for its first Champions League title when it faces Inter Milan on June 1 (AEST) in Munich. Three-time European champion Inter defeated Barcelona 7-6 on aggregate in one of the greatest semifinals in the competition's history.\n\nPSG had lost to Borussia Dortmund at this stage last year and was beaten by Bayern Munich in the 2020 final.\n\nPSG broke the deadlock in the 27th minute from a set piece after the Arsenal defence cleared a free kick toward the edge of the area. The ball bounced back into the path of Fabian Ruiz, who smashed a stunning half-volley into the back of the net.\n\nAchraf Hakimi curled in a precise finish in the 72nd minute to make it 2-0 on the night before Bukayo Saka pulled one back for the Gunners.\n\nArsenal had struggled early on last week in London — unable to cope with PSG's intensity in midfield — and lost 1-0.\n\nThis time, boosted by the return of midfielder Thomas Partey, the Gunners started brightly, pressing high and recovering the ball quickly to peg PSG back in its own half.\n\nTheir dominance was quickly rewarded with two good chances. The first came when Declan Rice rose high but missed his header, before Gabriel Martinelli saw his effort saved by Donnarumma.\n\nArsenal attacked relentlessly, overwhelming PSG on the flanks, and went close again in the eighth minute when Martin Ødegaard unleashed a fierce, low drive from outside the area that forced Donnarumma into another fine save.\n\nPSG had little choice but to wait for chances on the counterattack, and they were few.\n\nBut the hosts' defence was solid and they weathered the early storm with composure, waiting for an opening that finally came in the 17th minute. With some space on the left, Khvicha Kvaratskhelia came inside on his right foot and curled one of his trademark pinpoint shots that rattled the post.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPSG then failed to capitalise on a poor pass from William Saliba that could have cost Arsenal a silly goal. But Désiré Doué could only fire a weak shot straight at Raya.\n\nArsenal continued to lay siege of the PSG box after the interval and had another great opportunity soon after the hour mark when Saka curled a precise shot that seemed headed for the top corner, only for Donnarumma to stretch his long body and parry the ball away.\n\nVitinha then missed a penalty after a VAR check ruled a handball on Myles Lewis-Skelly. It was not long, though, before PSG doubled its lead as Hakimi swept the ball into the corner from substitute Ousmane Dembélé's assist.\n\nArsenal kept attacking until the end and cut the deficit through Saka in the 76th minute.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/women-composers-career-and-family/105213212",
    "title": "Generations of women show motherhood isn't a barrier to composing music",
    "publish_date": "Wed, 07 May 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "For generations, women have been made to choose between having a career or a family.\n\nMany female composers, such as Mozart's sister, Maria Anna (Nannerl), Clara Schumann and Alma Mahler, were told they couldn't have both.\n\nBut women, including Australian music matriarchs Margaret Sutherland and Miriam Hyde, showed it could be done.\n\nDespite their success, composers today like Nat Bartsch and Aristea Mellos have still had to consider similar choices.\n\nThe difference is that now, they have the support of partners, mentors and the wider society. Even then, it's not always easy to juggle both\n\nThe obstacle of marriage\n\nMargaret Sutherland is remembered as the matriarch of Australian music. (ABC Archives)\n\nMargaret Sutherland was trailblazing her way in the 1930s.\n\nHaving learned the piano since she was a child, Sutherland studied composition in Melbourne and Europe and was mentored by leading British composer Arnold Bax in 1923.\n\nDedicate music to your mum this Mother's Day From 9am on Sunday May 11, ABC Classic is playing music for mums and mother-figures on Weekend Brunch with Martin Buzacott. Send your requests by SMS on 0437 236 777 or via the ABC listen app.\n\nWhen Sutherland married in 1927, her husband didn't want her to compose, despite welcoming the income she brought into the household.\n\nShe kept composing anyway, advocating for the ABC to support her music.\n\nSutherland's career didn't really blossom until the couple separated and her children grew up.\n\nOver her lifetime, Sutherland composed around 200 pieces of music. She is also remembered as a fierce champion for Australian artists.\n\nIn recent years, interest in Sutherland's work has increased thanks to the work of musicians and academics in reviving her music.\n\nHaving a family and a career in the 1950s\n\nFar from confining herself to her home, composer and pianist Miriam Hyde forged her career while raising her family in the 1950s.\n\nA pianist, composer, lecturer, music examiner and mum, Hyde really nailed the art of juggling.\n\n\"[Mum] would practise during the day when the family was out so that in the evenings, we could concentrate on our studies or do our own practice,\" Hyde's daughter, Christine Edwards, recounts.\n\nTo help with her children's school fees, Hyde taught students at home and marked hundreds of music theory papers.\n\nMiriam Hyde raised two children while also composing, teaching and marking music exams. (Supplied: Christine Edwards.)\n\nHyde spent every spare minute she had copying her own compositions by hand for orchestras and anyone else who was interested in performing them.\n\nWhen she died in 2005, Hyde left upwards of 150 scores, most of which were her hand-written manuscripts, including 11 orchestral works.\n\nEdwards is currently working on getting those scores published so that other musicians can perform her mother's music.\n\nJuggling creative demands and motherhood\n\nPianist Nat Bartsch knows a thing or two about being a mum. One of her most well-loved albums, Forever And No Time At All, was based on her experience of motherhood.\n\nLoading YouTube content\n\nBartsch was diagnosed with autism at the age of 37 and ADHD a year later. By this point, Bartsch had won several music awards and experienced several burnouts.\n\nAfter discovering her neurodivergence, Bartsch has been able to better understand her sensory needs and put support systems in place to fulfil and manage her daily life, including the inevitable juggling.\n\nWhat's your favourite music for the piano? Photo shows A dark blue piano from birds eye view with the words Classic 100 Piano written on top, on a background of colourful swirls Voting is now open in the Classic 100: Piano. Tell us your favourites and we'll be counting down Australia's top 100 choices across June 7 and 8 on ABC Classic and the ABC listen app.\n\n\"It's one thing to focus intensely on completing a commission, but it's another thing to be able to clock off at 2:40 and go and pick up my son on time from school.\"\n\nBartsch has built support systems that include people who can help her complete daily tasks, especially while working on a new album.\n\nBeing a mother has changed Bartsch's relationship with work, for the better.\n\n\"I was working at such an intensive level, 12 hours a day, seven days a week because it's my special interest. And I get to call it my job,\" she says about her previous work habit.\n\n\" When I became a mother, I had to learn how to disconnect. \"\n\nFinding people who can support your aspirations\n\nSydney-based composer Aristea Mellos studied composition almost 100 years after Sutherland began her composition journey, but she still faced the same dilemma: to have a career or a family.\n\nIt was one of Mellos's female teachers who told her that she could have both, provided she had \"a partner who valued my work enough to give me time to write\".\n\nAs a new mother navigating the COVID-19 pandemic, Mellos had to deal with \"the unholy trifecta of sleep deprivation, physical exhaustion and loneliness.\"\n\nTo give Mellos time to compose, her husband took their child on long walks.\n\nHer first album after becoming a mother, Preludes and Duets, was inspired by her own experiences, written in collaboration with Australian pianist Stephanie McCallum.\n\nLoading YouTube content\n\n\"The moments that define motherhood are worthy of being the subject of art,\" Mellos says.\n\nWhile making the album, Mellos became a sandwich carer of both her elderly grandmother and her child.\n\n\"Rather than letting the situation prevent any creative work, I tried to let it feed and inspire me as much as possible,\" Mellos says.\n\nMellos has completed nine commissions since giving birth to her child, many written in collaboration with Australia's finest performers.\n\nShe says having a partner who supports her need to compose, as well as collaborators who champion her work, are the crucial ingredients to \"balance a composition career with the love and loving obligations of family life\".\n\nSign up to the ABC Classic Newsletter",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/asx-markets-business-live-news-may-federal-reserve/105266932",
    "title": "Live: ASX on the up after gains on Wall Street, US Federal Reserve holds rates",
    "publish_date": "Wed, 07 May 2025 21:59:10 +0000",
    "category": "finance",
    "authors": [
      "Rhiana Whitson",
      "Gareth Hutchens",
      "Nadia Daly",
      "Daniel Ziffer",
      "Michael Janda"
    ],
    "text": "Wall Street stocks made gains on Wednesday (US time), while US Treasury yields fell after the Federal Reserve left interest rated unchanged.\n\nThe Dow Jones Industrial Average rose 0.7%, to 41,113, the S & P 500 added 0.4%, to 5,631 and the tech-heavy Nasdaq Composite finished the day up 0.3% at 17,738.\n\nAfter a choppy session there was a late rally, as chipmakers jumped after Bloomberg reported President Donald Trump's administration plans to rescind AI chip curbs made by the Biden administration.\n\nThis was after the Fed Reserve held rates steady, which was in line with expectations.\n\nFed Reserve Chair Jerome Powell said while the US economy continued to expand at a solid pace, it noted that risks of higher inflation and unemployment had risen as it grapples with the impact of Trump's tariff policies.\n\nThe risks of higher unemployment and higher inflation left the Fed with almost no good short-term options, said Julia Hermann, global market strategist at New York Life Investments.\n\n\"Their ability to pre-emptively cut rates to shore up economic growth is constrained by upside inflation risks, and then, conversely, their ability to pre-emptively hike rates to reduce inflation risk is constrained by downside risk to growth,\" she said.\n\n\"So it's a stagflation conundrum.\"\n\n\"We expect to see meaningful easing from the Fed only in the scenario that economic growth figures really disappoint.\"\n\nIn US Treasuries, yields slipped after the Fed's update.\n\nThe yield on benchmark US 10-year notes fell 4.9 basis points to 4.2% from 4.3% late on Tuesday while the 30-year bond yield fell 4.1 basis points to 4.7%.\n\nThe two-year note yield, which typically moves in step with Fed interest rate policy, fell 0.8 basis point to 3.7%, from 3.7% late on Tuesday.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/offshore-wind-zones-call-for-progress-after-labour-re-election/105264734",
    "title": "Offshore wind advocates say Labor's win a 'mandate' for swift action",
    "publish_date": "Wed, 07 May 2025 21:45:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The re-elected federal government is being urged to get on with establishing Australia's offshore wind industry, with the election result hailed as an endorsement of the renewables rollout.\n\nIn the lead-up to the election, opposing Labor's energy plan was a key platform of the Coalition, including a promise to scrap four of the six declared offshore wind zones.\n\nCoalition leadership made rare incursions into Labor's NSW heartland to stoke community opposition to the technology.\n\nFederal politics live updates: Get the latest on the post-election election landscape\n\nLive results: Find out what's happening in your seat as counting continues\n\nIn the Illawarra, the Liberal Party failed to gain ground in any of the three seats adjacent to a zone flagged for the region.\n\nCommunity renewables group Good for the Gong supports the Illawarra Offshore Wind Zone. (Supplied)\n\nSophie Walter from pro-renewables community group Good for the Gong said the Australian public had sent a clear message about offshore wind technology.\n\n\"Now that the election is over, we'll be really pressing the government to get on with it, but to make sure that it's done in a way that delivers benefits to the communities,\" she said.\n\n\" I think Labor now has a mandate from the Australian public, and the Illawarra public, to move quickly and get these projects underway. \"\n\nZones underway\n\nThe six zones around the country are in various stages of development.\n\nLocations of offshore wind zones across Australia. (ABC News: Paul Sellenger)\n\nThe Illawarra area, declared in June 2024, has the potential to generate 2.9 gigawatts of power and is expected to create 870 ongoing jobs.\n\nThe government has yet to issue a feasibility licence for the zone, with US energy company BlueFloat putting its application on hold due to the lack of bipartisan support.\n\nMember for the Wollongong seat of Cunningham Alison Byrnes bore the brunt of the anti-wind farm lobby throughout the campaign.\n\nBut she was comfortably re-elected with a 3.8 per cent increase in her primary vote to increase Labor's stranglehold on the seat.\n\nAlison Byrnes (right) has been re-elected as the federal Member for Cunningham. (ABC Illawarra: Kelly Fuller)\n\n\"We need to wait for the new minister to be appointed and see what the process is going forward on that [offshore wind],\" she said.\n\n\" The company that had put in the only feasibility licence had asked for that to be paused pending the outcome of the election, so we'll see where that progresses over the coming month. \"\n\nNo more 'misinformation'\n\nIn the Hunter region, local communities and industry are also awaiting movement on the Hunter Offshore Wind farm.\n\nThe federal government awarded a feasibility licence for the project to Novocastrian Wind, owned by Equinor and Oceanex Energy, in February.\n\nIt is poised to be the first floating offshore wind farm in the country.\n\nHowever, the company also delayed its decision to proceed with the licence until after the election.\n\nIn a statement, Novocastrian Wind said it was \"still assessing\" its plans moving forward.\n\nThe offshore wind information war Photo shows A map shows Newcastle on the Australian coast, with wind turbines in the sea Offshore wind offers great promise for Australia, but the industry will have to win an information war to convince some towns to take it up.\n\nJustin Page from the Hunter Jobs Alliance said he was eager to see the back of \"misinformation\" circulating around offshore wind.\n\n\"I think it's time to cut through all the misinformation and actually look at the proper, fact-based assessment of the environmental and economic impacts of offshore wind for the Hunter,\" he said.\n\nThe project is expected to create 3,000 jobs during the peak of construction and more than 200 ongoing jobs, which Mr Page said would benefit the region.\n\n\"It's massive for jobs,\" he said.\n\n\"But also, to support our manufacturing industries and sectors like Tomago Aluminium, to be able to have clean energy for them to thrive into the future.\"\n\nParts of the Illawarra community remain opposed to offshore wind. (ABC Illawarra: Tim Fernandez)\n\nMr Page said the government needed to now focus on upskilling and retraining the region's workforce to work in the renewable energy sector.\n\n\"We need to develop pathways for our workers in coal mining and coal-fired power stations to move into the renewable energy and new industry sectors,\" he said.\n\n\"The federal government's already put some policies in place, and we've had a $61 million commitment for a TAFE Centre of Excellence here in the Hunter to facilitate training for those workers.\n\n\" I think with Labor now having another three years in government, we've got the best chance to actually help transition those workers. \"\n\nElephant in the room\n\nThe director of the Energy Futures Network at the University of Wollongong, Ty Christopher, said Labor's re-election provided consistency.\n\nClean energy expert Ty Christopher says companies will be reluctant to invest in the Illawarra until there is a clear plan to upgrade infrastructure. (ABC Illawarra: Tim Fernandez)\n\nHe said legitimate concerns about the technology and environmental impacts of offshore wind still needed to be assessed.\n\n\"All investors want certainty,\" he said.\n\n\" The election result provides that stability and that certainty for people to commit to their investment here in Australia … whether they are Australian super funds or whether they are overseas investors. \"\n\nMr Christopher said the Trump administration spelled uncertainty for renewables in the United States, but that could be a good thing for renewables in Australia.\n\n\"But the elephant in the room that we have to acknowledge here … is Trump's behaviour in the US has created so much volatility and uncertainty that it has scared a lot of global capital out of the United States,\" he said.\n\n\"And what a wonderful thing for Australia, for that global capital to find a home here and to help us decarbonise our lives, decarbonise our industry and become a global powerhouse in renewable energy.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/tennis-italian-open-jordan-thompson-claims-early-tournament-win/105266748",
    "title": "'I actually felt bad': Thompson claims fifth-straight win over rising star",
    "publish_date": "Wed, 07 May 2025 21:07:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jordan Thompson has defied injury concerns to once again prove a \"nightmare\" for one of the rising young stars of world tennis at the Italian Open.\n\nFor the third time in less than six weeks, the Australian number three stood up to another barrage of monster serving from 21-year-old French prospect Giovanni Mpetshi Perricard to prevail after a final-set tiebreak 3-6, 6-3, 7-6 (7-5) at Rome's Foro Italico on a rainy Wednesday in the capital.\n\nThe 31-year-old eventually pulled off his fifth straight win over the much-touted 203cm youngster, despite Mpetshi Perricard sending down 13 aces on the clay, with one delivery timed at a fearsome 235kmh despite still having to deal with a niggling oblique muscle injury.\n\n\"I was actually not sure if I was going to be able to play today, but I'm glad I gave it a go — but my body might not be thanking me tomorrow,\" a smiling Thompson told the Tennis Channel.\n\nThompson, who had a groin problem in Monte Carlo then had to withdraw from the Barcelona Open singles with the oblique problem and missed Madrid, has endured a troubled clay-court campaign but said that, somehow, he has become Mpetshi Perricard's \"nightmare match-up\", having beaten him in Monte Carlo and Miami.\n\n\"I've got an OK serve myself, my second serve's a good kicker, so he can't really run around too many, and then I block a lot of returns that just frustrates the hell out of him,\" said Thompson, who has fallen back to world number 41 this year.\n\nIndeed, he has been defeating Mpetshi Perricard so often of late that Thompson evidently even felt a bit sorry for him.\n\n\"It's a tough one. I actually felt bad at the net today,\" Thompson said.\n\n\"Generally, I don't really care. I take the win, but I would say 'no empathy'. But today I didn't even say anything at the shake of hands. I'm pretty sure he doesn't want to hear from me, he doesn't want to see me — so I got out of his way pretty quick.\"\n\nNext up in the second round, Thompson has another tough assignment against American Brandon Nakashima, the world number 29 who he has played at the last two Wimbledons, winning in 2023 but losing last year.\n\nThompson was the only Australian man to progress on a damp day, with Chris O'Connell proving no match for Britain's former Wimbledon semi-finalist Cam Norrie in a 6-3, 6-2 defeat and his fellow Sydneysider Rinky Hijikata going down 3-6, 6-1, 7-5 to Frenchman Corentin Moutet in a tough two-and-a-half hour duel.\n\nMaya Joint pushes champ all the way\n\nEmma Raducanu had visited Rome's Trevi Fountain on the morning before her Italian Open match against Australian teenager Maya Joint, but didn't have time to make a wish.\n\nIf she had got round to chuck in her three coins, the resurgent British star might have asked for a rather easier evening than the one then given to her in a late-night arm wrestle with the tough, talented 19-year-old.\n\nJoint just kept on fighting when all looked lost and there was no question 2021 US Open champ Raducanu, who has been gradually rediscovering flashes of the form and confidence that marked that amazing Flushing Meadows win, was mightily relieved to eventually prevail 7-5, 6-7 (1-7), 6-3 in a high quality joust.\n\n\"The level was really high. Maya played so aggressive and any time I dropped the ball a tiny bit short, she was just all over it. So really proud of how I came through,\" said Raducanu, who needed two and three-quarter hours to subdue the US-born Queenslander.\n\nRaducanu had been two points away from winning in straight sets, only for Joint to break back with the Briton serving for the match.\n\nJoint, who had won through two qualifying matches at the Foro Italico the previous two days to get into the main draw, then played an almost flawless tiebreak to set up a decider.\n\nRaducanu rediscovered her best to race into a 5-0 lead, but Joint simply wouldn't go away, pulling back the next three games, saving a match point and even grabbing another break point until, finally, the Australian youngster succumbed, clubbing one forehand too long.\n\nRaducanu wondered if her morning's tourist trip might have lulled her into being a bit too chilled.\n\n\"I actually managed to go to the Trevi fountain this morning but I didn't make a wish because the queue was too long and I didn't have a coin,\" she said.\n\n\"It was nice to see the sights and I had a nice lunch on the terrace on the street, all pretty chill but then the toughest part was to trying to then get psyched up for a match after you'd basically had a day off until 6pm.\"\n\nJoint, who's up to a career-high number 78 and could end up a little higher going into her maiden French Open, made it a real examination but, ultimately, ended up losing alongside her two compatriots, Olivia Gadecki and Ajla Tomljanovic, on Wednesday.\n\nGadecki lost 7-6 (7-5), 5-7, 6-2 to American Carloine Dolehide, while Tomljanovic was beaten 6-3, 6-4 by Russian-born Frenchwoman Varvara Gracheva.\n\nThe only Australian left in the women's draw is Daria Kasatkina, the 14th seed, who faces a tough opener against Ukrainian Marta Kostyuk, who's fresh off reaching the quarter-finals in Madrid and who demolished 19-year-old Filipino rising star Alex Eala 6-0 6-1.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/ai-job-recruitment-tools-could-enable-discrimination-research/105258820",
    "title": "Will AI decide if you get your next job? New research says it could",
    "publish_date": "Wed, 07 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian employers are increasingly using artificial intelligence hiring systems to screen and shortlist job candidates, but new research has found the technology creates serious risks of discrimination.\n\nAI systems promise to save employers time and money in the recruitment process by using cutting-edge technology, such as CV scanners and vocal assessments, to \"classify, rank and score\" job applicants.\n\nThis means a computer program could be assessing a jobseeker's application right now, and accepting or rejecting it based on its machine understanding before the person reaches an interview stage with a human.\n\nYet new research from Dr Natalie Sheard, a lawyer and postdoctoral fellow at the University of Melbourne, has found AI hiring systems may \"enable, reinforce and amplify discrimination against historically marginalised groups\".\n\n\"There are some serious risks that are created by the way in which these systems are used by employers, so risks for already disadvantaged groups in the labour market — women, jobseekers with disability or [from] non-English-speaking backgrounds, older candidates,\" she tells ABC Radio National's Law Report.\n\nListen to the podcast Informative, jargon-free stories about law reform, legal education, test cases, miscarriages of justice and legal culture.\n\nAbout 62 per cent of Australian organisations used AI \"extensively or moderately\" as part of their recruitment processes last year, according to the Responsible AI Index.\n\nYet Australia does not currently have any specific laws to regulate how these tools operate or how organisations may use them. It was hoped AI would end bias in the hiring process but several well-publicised cases in America have highlighted that the opposite is occurring.\n\nIn one example, an AI system developed by Amazon learned to downgrade the applications of jobseekers who used the word \"women's\" in their CVs.\n\nThe AI tools used in hiring\n\nDr Sheard interviewed 23 people as part of her research into AI hiring systems. The participants were mainly recruiters who had worked at small, medium and/or large organisations, both private and public, and in a range of industries.\n\nShe also spoke to two careers coaches to understand the impact of AI hiring practices on job candidates, as well as a leading Australian AI expert, and two employees of a large AI developer — the director of AI Services and the AI ethics leader.\n\nThe use of AI tools in recruitment is on the rise among Australian organisations. (Getty: Zia Soleil)\n\nHer focus was on three aspects of recruitment screening: CVs, candidate assessments (which may include psychological or psychometric tests) and video (\"robo\") interviews.\n\nRobo interviews typically involve candidates recording themselves providing answers to a series of questions, which are then assessed by AI. Dr Sheard says there are well-known cases of AI tools initially using \"a controversial technique called facial analysis\" when analysing these interviews.\n\n\"It had a look at the facial features and movements of applicants to assess their behaviour, personality. [For example], it was looking to see [if] they [were] enthusiastic or angry when they spoke to customers.\"\n\nIn 2019, America's Electronic Privacy Information Center filed a complaint against third-party recruitment agency HireVue over software it used to analyse video interviews with applicants, arguing the results were \"biased, unprovable and not replicable\".\n\nFacial analysis has been scientifically discredited. But Dr Sheard warns there is no law in place to prohibit its use and so \"some systems may be still incorporating\" it.\n\nHow do AI hiring systems impact marginalised candidates?\n\nAI hiring tools can experience data bias, Dr Sheard says, since the systems learn from the information they are fed.\n\nSome AI hiring systems are built using large language models, for example, and if they are missing datasets from a disadvantaged group, \"they won't be representative\" of the broader population, the academic says.\n\nThis is similarly the case if there are biases in the AI system's training data, which means it adopts and reproduces the same biases and discriminatory practices as the tools used in its development.\n\nAustralia has no specific laws to regulate how AI hiring tools operate. (AAP: Bianca De Marchi)\n\n\"They're trained on things that are scraped from the internet. For example, we know … only about 15 per cent of women contribute to articles on Wikipedia. So it incorporates that male view, which can then be brought through into recruitment processes.\"\n\nOne example of learned gender discrimination occurred at Amazon when it developed an AI hiring model in 2014 based on CVs collected from applicants for software developer positions over a 10-year period.\n\nJobseekers say finding work has become like online dating Photo shows Dilhara Sivalingam sits in a white dress before her laptop during an interview with Nassim Khadem in Melbourne in February 2025. As Australia's unemployment rate rises, finding a job is getting more challenging. Some describe it like online dating.\n\n\"That model learnt to systemically discriminate against women because it's a male-dominated field. [Many of] those CVs came from men, and so the system learnt to downgrade the applications of women who applied for positions through that tool, particularly when they use the word \"women's\" in their application. For example, [if] they [wrote they] attended a women's college,\" Dr Sheard says.\n\n\"And it also picked up language styles that are used by men, so when particular words were used more typically by men … like executed or actioned, it upgraded those applications.\"\n\nThe recruitment tool was reportedly found to be sexist and ultimately scrapped.\n\nAI tools under the microscope in the US\n\nIn America, several complaints allege AI tools have discriminated against job applicants from different backgrounds.\n\nIn one case, it was claimed the hiring software used by HireVue in the recruitment process resulted in systemic discrimination and violated the Colorado Anti-Discrimination Act (CADA), the Americans with Disabilities Act (ADA), and Title VII of the Civil Rights Act.\n\nThe complaint claims DK, who is Indigenous and is a Deaf woman who speaks with a deaf accent, had been working for her employer for more than five years and was encouraged by her supervisor to apply for a seasonal manager position at her company.\n\nStream your favourite shows on the free ABC listen app Photo shows Image of Dr Karl on a pink background and Listen app logo Dr Karl knows the best app for free podcasts, radio, music, news and audiobooks … and you don't need to be a scientist to find it!\n\nShe had the experience and qualifications needed for a promotion, but she said she was rejected for the role after completing an automated video interview and assessment with HireVue.\n\nHireVue uses automated speech recognition systems to generate transcripts based on the audio of the interview and it is alleged that these systems perform worse for non-white people and also deaf or hard of hearing speakers.\n\n\"The way that these systems [assess your communication skills] is by assessing how well you speak standard English … [so] if you speak English as a second language and use non-standard English when you speak, then you're likely to be assessed as not having good communication skills by these systems,\" Dr Sheard says.\n\nAfter DK was informed she did not get the promotion, she received an email with feedback about how to improve on the HireVue assessment, including a direction to \"practice active listening\".\n\n\"That makes you question what kind of human oversight was provided for this whole process? Because at some point a human should have intervened and said, 'Well, this is just at odds with what we know about this person,'\" Dr Sheard says.\n\nIn a separate case, a tutoring group that was recruiting in the US was found to have programmed a hiring system to automatically reject female applicants over 55 years of age and male applicants over 60 years of age, which resulted in the rejection of 200 qualified candidates.\n\nJobseekers use AI for applications, resumes Photo shows Laptop on desk with chatGPT displayed on screen Artificial intelligence tools such as ChatGPT are being used by jobseekers to write cover letters and resumes.\n\nThe employer was taken to court by the Equal Employment Opportunity Commissioner, an action that resulted in a $US365,000 settlement.\n\nAnother complaint raised by the American Civil Liberties Union Foundation (ACLU) against a provider of AI hiring systems that design, sell, and administer online assessments to employers alleges that the assessments discriminate on the basis of disability and/or race.\n\nOne of the ACLU's complaints is that an algorithmically driven adaptive employee personality test adversely impacts \"autistic people, otherwise neurodivergent people, and people with mental health disabilities such as depression and anxiety\".\n\nThe foundation says this is because it tests for characteristics that are \"close proxies of their disabilities\" and which are \"likely not necessary for essential job functions for most positions\". It adds that the scores of those applicants with disabilities are likely to be significantly impacted by those characteristics.\n\n\"If you're a jobseeker who experiences depression, you're probably not going to score highly on positivity, so that is really going to be a proxy for a disability that you might have and may filter you out of the process when you might be able to perform all of the essential requirements of the role,\" Dr Sheard says.\n\nWhat about AI hiring tools in Australia?\n\nSimilar legal action has not yet taken place in Australia but the Merit Protection Commissioner, which reviews employment decisions such as job progression, has offered guidance for employers in the public sector using AI hiring systems.\n\nThere are warnings AI recruitment tools on the market may not have been thoroughly tested. (Unsplash: Austin Distel)\n\nIt came after its commissioner overturned 11 promotion decisions made by government agency Services Australia in a single recruitment round during the 2021-22 financial year.\n\nApplicants were required to pass through a sequence of AI assessments, including psychometric testing, questionnaires and self-recorded video responses. No human was involved in the process or review, and the commissioner found the system led to meritorious applicants missing out on promotions.\n\nThe Merit Protection Commissioner has since warned that not all AI recruitment tools on the market have been thoroughly tested, nor are they guaranteed to be completely unbiased.\n\n\"I think there's absolutely a need to regulate these AI screening systems,\" Dr Sheard says.\n\n\"Some groups have called for a complete ban on these systems, and I think there is a lot of merit to that argument, particularly while we're in a situation where we don't have proper legal safeguards in place, and where we don't really understand the impacts of these systems on already marginalised groups in the labour market.\"\n\nWhile employers may argue these AI hiring systems create a more efficient recruitment process, Dr Sheard says this argument needs to be balanced with \"the risks of harming marginalised groups\".\n\nIn February, the House Standing Committee on Employment, Education and Training released a report on the Future of Work that recommended a ban on the use of AI systems for final decision-making in HR without any human oversight.\n\nThe Australian government has also been looking at the regulation of AI technologies, including whether Australia should introduce an AI Act similar to that in place in the European Union.\n\n\"The government proposed that there should be some mandatory, what they call, guardrails for high-risk applications of AI. And high-risk applications are generally considered to include these AI screening systems,\" Dr Sheard says.\n\n\"That process hasn't concluded and is somewhat up in the air with the election … [so] there's no time frame for that.\"\n\nIn the meantime, Dr Sheard believes the Australian government needs to review its anti-discrimination laws to make sure they are still \"fit for purpose\" and cover \"these new technologies, particularly around liability\".",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-08/millions-oysters-quarantined-sa-algal-bloom/105266062",
    "title": "Millions of SA oysters quarantined after algae-linked toxin discovery",
    "publish_date": "Wed, 07 May 2025 20:54:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Health authorities have detected a waterborne toxin off Yorke Peninsula that has forced at least six oyster farms to temporarily shut and quarantine up to 10 million oysters.\n\nReports emerged overnight that the Department of Primary Industries and Regions South Australia (PIRSA) tested the waters at Oyster Bay in Stansbury last week and returned positive readings for brevetoxins, which are produced by several species of karenia algae.\n\nA PIRSA spokesperson said the department was still testing the samples and that harvesting areas are \"often temporarily closed as a precautionary measure to ensure food safety standards are upheld\".\n\nA karenia algae bloom, believed to be caused by higher sea temperatures, has caused hundreds of dead marine life to wash up on SA shores over the past month.\n\nCostly losses\n\nFarmers using Oyster Bay have voluntarily cordoned off their sites, according to Pacific Estate Oysters owner Steve Bowley, who said he was awaiting further health advice from PIRSA.\n\nThe Pacific Estate oyster farm at Oyster Bay in Stansbury is under quarantine. (Supplied: Steve Bowley)\n\n\"We don't have any experience with this particular waterborne virus so we've temporarily closed the bay as a precautionary measure whilst we work out what's happening,\" Mr Bowley said.\n\n\"It means we can't sell any oysters out of the bay and if we wanted to transfer oysters to another bay … we need to get government permission to do that.\"\n\nMr Bowley said he was worried about losing \"half a million dollars' worth of stock\".\n\n\"We're not happy, of course, but we would rather sell good oysters rather than [have] them come back because people suddenly became sick,\" he said.\n\nClimate change potential cause\n\nEnvironment Minister Susan Close said rising temperatures caused by climate change likely played a role in the algae bloom that covered an area \"not far off the size of Kangaroo Island\".\n\nSusan Close says a change in weather is needed to break up the bloom. (ABC News: Che Chorley)\n\n\"This is where nature is more powerful than we are, and the only thing that's going to break this algal bloom up is a change in the weather and strong westerly winds,\" Ms Close said.\n\n\"Normally we get that at the end of April and that hasn't happened yet. We need a big change in the weather to break this thing up.\"\n\nEstuarine ecologist Faith Coleman said the toxins could have been caused by \"six or seven\" karenia variants.\n\n\"This one has developed into one of the more toxic species,\" Ms Coleman said.\n\n\"They develop toxins to protect themselves and to prevent other things from growing around them.\n\n\"We believe they do it to reduce grazing pressure on themselves.\"\n\nIt is unclear how long the affected oyster farms will be closed.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/technology/rockstar-games-share-fresh-trailer-for-grand-theft-auto-vi-20250508-p5lxlp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rockstar Games share fresh trailer for Grand Theft Auto VI",
    "publish_date": "Thu, 08 May 2025 12:01:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rockstar Games share fresh trailer for Grand Theft Auto VI\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-zz-top-20250508-p5lxka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘ZZ Top came on looking like ZZ top, which is a culturally beautiful thing to witness’",
    "publish_date": "Thu, 08 May 2025 11:59:32 +1000",
    "category": "entertainment",
    "authors": [
      "Giselle Au-Nhien Nguyen",
      "Jessica Nicholas"
    ],
    "text": "Thorogood made it clear that words were not the most important part of the evening, shouting “I hope you appreciate my intellectual lyrics” after playing his truck-tastic Gear Jammer. But he and the excellent Destroyers hit all the needed themes of the night, from lust (Mama, Talk to Your Daughter) to liquor (One Bourbon, One Scotch, One Beer) to licks (Bad to the Bone) while sticking admirably to the night’s overarching theme of boogie-woogie, blues-rockin’, country-smellin’ guitar worship. A truly excellent set that could only be followed by the masters of the genre, ZZ Top.\n\nGeorge Thorogood strutted on stage at Margaret Court Arena like a man who is the party and kicked things off with: “How sweet it is! Welcome in everybody, there’s a rock party tonight!” then, bam! Straight into Rock Party, because subtlety is for Radiohead.\n\nYou know that bit in The Blues Brothers where the car chase starts at night and about seven minutes in, there’s a cut and suddenly it’s daytime, but the car chase is still going? And you think “by any normal metric, this car chase is too long. But I’m still loving it!” Well, that’s what every blues-rocking guitar solo was like from both George Thorogood and ZZ Top on Wednesday night, where it truly felt like too long wasn’t long enough.\n\nZZ Top came on looking like ZZ top, which is a culturally beautiful thing to witness. Resplendent in beards, cheap sunglasses and rhinestones, they got straight into ’80s classic Got Me Under Pressure and the response was as big as Elwood Francis’ giant 17-stringed yellow bass.\n\nLike a perfect marriage, for 51 years the Top’s lineup was unchanged, making them perhaps the most consistent rock ‘n’ roll lineup of all time. Dusty Hill’s passing in 2021 led to his replacement with Francis, the band’s long-time guitar tech, who is the perfect mix of silly fun and deep groove to step into Hill’s shoes, whilst John Douglas, despite sitting in darkness behind a double bass-drummed metal-style behemoth of a kit, plays an admirable Frank Beard, who is temporarily out of the tour due to medical issues.\n\nBilly Gibbons may have aged, but he has never grown up. Credit: Martin Philbey\n\nOne of the things I have always adored about ZZ Top is their understated, charming choreography, moving like marionettes handled by an octogenarian. Happily, this means they have lost none of their performance ability, even 56 years into their career. We don’t need to see them running about and climbing speaker stacks, because they never have. We’re all just happy that their fingers pluck and strum on classics like Pearl Necklace, My Head’s in Mississippi, Sharp Dressed Man and Legs as perfectly as when those tracks were released.\n\nAfter an encore’s fuchsia-based costume change, the band once again keep their banter at a minimum, letting their clothes do the talking and their bass-lines do the walking (except when the bass-lines are more syncopated and groove-driven). They hit us with the blues of Brown Sugar, the boogie of Tube Snake Boogie and the brilliance of La Grange, bringing the whole floor section to their feet. If there is one lesson to be learned of the evening, it is that while rock ‘n’ roll may age, it never grows up.\n\nReviewed by Andrew McClelland",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/afl/willie-rioli-withdraws-from-port-adelaide-team-for-showdown-20250508-p5lxi9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Willie Rioli withdraws from Port Adelaide team for Showdown",
    "publish_date": "Thu, 08 May 2025 11:57:32 +1000",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Port Adelaide forward Willie Rioli has withdrawn from Saturday night’s Showdown against Adelaide, after a week of turmoil surrounding alleged threats made to three on-field opponents.\n\nThe club confirmed on Thursday morning that Rioli had pulled out of match consideration.\n\nMore to come",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/the-trump-iceberg-has-struck-china-america-is-bracing-for-it-20250508-p5lxhv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump iceberg has struck China. America is bracing for it",
    "publish_date": "Thu, 08 May 2025 11:56:19 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Given the lags in impacts, it was logical that the PBOC should be the first of the two central banks to move. On Tuesday, it unveiled a package of monetary policy support, including a 10 basis point cut in its key short-term interest rate, a 50 basis point reduction in the required reserve ratio for its banks, more credit available for consumption, aged care, the tech industries and cheaper credit for mortgages. Jerome Powell and the Fed are in wait-and-see mode. Credit: Bloomberg In effect, it is making more liquidity and credit available within its financial system although, in the continuing absence of fiscal stimulus from Beijing, it is an open question as to whether there will be any demand for that credit from Chinese businesses and consumers that were in a defensive mode even before Trump’s assault on global trade. The PBOC’s announcement might also have been designed to send a message to the Trump administration ahead of this weekend’s meeting of Chinese and US officials in Geneva – a signal that China has levers to pull to blunt the economic effects of the trade war. The absence of fiscal stimulus could be interpreted as a sign that Beijing isn’t panicking – it has its “bazooka” in reserve.\n\nThe meeting between Bessent and China’s vice premier He Lifeng isn’t going to produce a trade truce. As Bessent told Fox News, they will be initial talks to “agree what we’re going to talk about.” “My sense is that this will be about de-escalation, not about the big trade deal, he said.” Loading Any actual trade deal between the US and China could take months, if not years, to trash out and it is unlikely that, during Trump’s remaining term, they will be reduced to anything close to the average of about 20 per cent rate they were before Trump began ratcheting them up this year. (The 20 per cent rate was a legacy of Trump’s first trade war in 2018-19 that Joe Biden retained). During his election campaign last year, Trump promised a 60 per cent duty on all imports from China, which is probably the US final position in any negotiation. Trump has said Americans will need to accept higher prices and reduced choices if his attempt to return manufacturing investment and employment to the US is to succeed.\n\nBefore April 2, the average US tariff on imports was only 2.5 per cent. The best outcome now appears likely to be a minimum average tariff on all imports to the US of at least 25 per cent, although with Trump dreaming up new tariffs and forms of tariffs – the “Hollywood” tariff on offshore film production, the first tariff mooted on services rather than goods is the most recent example – it’s anyone’s guess where the final imposts will land or what their eventual impact on the US economy will be, other than that it won’t be positive. That explains why the Fed is frozen in its “wait and see” mode. In its formal statement, the Fed said that uncertainty about the economic outlook had increased further and the risks of higher unemployment and higher inflation had risen. Given the lags in impacts, it was logical that the PBOC should be the first of the two central banks to move. Credit: Bloomberg Powell told a news conference that “it’s not really clear what it is that we should do” and that he could not yet say “which way this will shake out” in terms of being more worried about inflation or growth. The costs of waiting, he said, were still low.\n\nThe Fed couldn’t act pre-emptively to head off the inflationary impacts of the tariffs “because we actually don’t know what the right response to the data will be until we see the data,” he said. “If the large increases in tariffs that have been announced are sustained, they’re likely to generate a rise in inflation, a slowdown in economic growth and an increase in unemployment,” Powell said. “The effects on inflation could be short-lived, reflecting a one-time shift in the price level,” he said. It was also possible, however, that the inflationary effects could be more persistent, he said. He said it was premature to declare which side of the Fed’s dual mandate – inflation and employment – would be prioritised.\n\nThat’s the Fed’s dilemma. If the inflationary effects of Trump’s tariffs are transitory, it would cut rates to protect growth and employment. The differences in stance don’t reflect calm in the US and panic in China, but the leads and lags within the trade wars that Donald Trump launched. It is acutely aware, however, that when it declared the impact on inflation of the pandemic to be transitory and lowered rates further than, with hindsight, it should have, it unleashed a wave of inflation it is still battling to contain. It can’t afford to make the same mistake again. The Fed prides itself on being data-driven. It will wait for the data, which means it will be reacting to the effects of the tariffs after they have already emerged, rather than trying to pre-empt them.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/how-to-make-bill-granger-s-favourite-brunch-sweetcorn-fritters-with-tex-mex-sides-20250210-p5laza.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to make Bill Granger’s favourite brunch: Sweetcorn fritters with Tex-Mex sides",
    "publish_date": "Thu, 08 May 2025 11:52:10 +1000",
    "category": "finance",
    "authors": [
      "Bill Granger"
    ],
    "text": "The combination of crunch and big flavours makes Bill Granger’s sweetcorn fritters a winner. Mikkel Vang\n\n“Tex-Mex was huge around the time we opened bills in 1993,” Bill Granger wrote in his 2020 cookbook Australian Food. “Tinned chipotles were flavour of the month, and Navajo blankets were being dragged down every fashionable catwalk. This was in the days before we worried about cultural appropriation, and we were living in a Santa Fe fantasy world.”\n\nThese sweetcorn fritters with roast tomatoes, bacon and avocado salsa were Granger’s nod to that, but they outlived the phase and are still on the menu. With its combination of crunch and big flavours, this was his favourite breakfast dish.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/chooks-paparazzi-and-regrets-behind-the-cheese-s-last-hurrah-in-a-roosters-jersey-20250508-p5lxij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chooks, paparazzi and regrets: Behind the Cheese’s last hurrah in a ‘Roosters’ jersey",
    "publish_date": "Thu, 08 May 2025 11:47:53 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "The irony wasn’t lost on Brandon Smith as he posed in a faux Roosters ‘Nandos’ jersey on Wednesday morning with a bowl of mac and cheese.\n\nIt’s the closest he will get to wearing Tricolours kit again as his tumultuous few years as the club’s marquee signing comes to an early end.\n\n“It’s been disappointing,” Smith said frankly when asked to sum up his time as a Rooster, stressing he has no issue with his looming release to join arch-rivals South Sydney.\n\nSmith arrived at Bondi touted as the $2.5 million missing puzzle piece for Trent Robinson, but instead became an oft-highlighted recruitment misstep before rupturing his ACL last year.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/north-america/australian-high-school-jazz-band-gets-the-ultimate-call-up-in-new-york-20250507-p5lx4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The place you want to be’: How a Melbourne teenager went from watching YouTube to a New York stage",
    "publish_date": "Thu, 08 May 2025 11:44:20 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: When Anna Yamazaki was starting high school in Melbourne, clips from the Essential Ellington jazz program in New York City started popping up among her YouTube suggestions.\n\nThe competition attracts the creme de la creme of school jazz bands from across North America, who gather at the Lincoln Centre in Manhattan to play Duke Ellington tracks and other big band standards. For budding jazz musicians around the world, it’s the north star.\n\nBlackburn High School Jazz Band plays at the Lefrak Concert Hall in Queens ahead of the Essentially Ellington festival. Credit: Alex Towle\n\n“I’ve watched Ellington for years and years, and it’s always been a ‘what if’ thought,” says Yamazaki, who is now in year 12. “I never thought it would become a reality.”\n\nYamazaki and 19 other students from Blackburn High School, a public school in Melbourne’s east, will perform in the Big Apple this week after being selected as finalists for the competition’s special 30th anniversary instalment.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/nsw/this-suburb-is-booming-and-there-s-more-development-on-the-way-what-comes-next-20250506-p5lx2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This suburb is booming, and there’s more development on the way. What comes next?",
    "publish_date": "Thu, 08 May 2025 11:30:01 +1000",
    "category": "finance",
    "authors": [
      "Anthony Segaert"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It’s early on Wednesday morning at Rouse Hill Town Centre – one of the country’s largest greenfield shopping centres – and people are starting their days with coffee and a visit to the playground. Life in Rouse Hill is good. There is a metro stop next to the town centre where driverless trains take residents to the CBD in less than 40 minutes, and the shopping centre features a lot of open space and community facilities. But behind the omnipresent music and the carefully manicured lawns that define the town centre, and after two decades of unprecedented greenfield development, Rouse Hill continues to experience growing pains. The shopping centre has virtually no rental vacancy, and the local council says it is struggling to keep up with the service demands of the tens of thousands of new residents. Construction will soon begin on Rouse Hill Town Centre Stage 2. Credit: Rhett Wyman Rouse Hill is home to more than 11,000 people. But it’s set to take on thousands more over the next decade as the council grapples with how to implement the state government-mandated target of 23,300 new homes in the shire over the next five years. What comes next for one of Sydney’s first greenfield developments?\n\nAdvertisement\n\nThe news On Wednesday, developer GPT Group announced it had begun construction on the second stage of Rouse Hill’s major shopping precinct, Rouse Hill Town Centre. With its leaders and local Liberal Mayor Michelle Byrne using golden shovels for a sod turning in front of tonnes of already moved dirt, the group said the extension of the shopping centre would allow for extra growth in the suburb, with its established main centre approaching capacity. An artist’s impression of Stage 2 of the Rouse Hill Town Centre. Credit: GPT Group The precinct will expand the development by more than 10,000 square metres and bring at least 50 new shops, cafes and leisure facilities to the area. GPT had lodged its development application with plans to include 218 apartments, but Chris Barnett, the head of retail at the developer, said that “at this time we are just focusing solely on the retail option”. “It’s a point in time in the cycle of residential development … what we have been able to do is future-proof what we’re creating today to come back and build residential at the right time.”\n\nAdvertisement\n\nLoading But more people will be coming to the centre regardless of whether GPT builds apartments on top: Hills Shire Council estimates 329,000 residents will join its local government area within 15 years, and is campaigning the state government to urgently provide more infrastructure to keep up with demand. How we got here Eastern suburbs residents, beware: Rouse Hill’s town centre was once a nine-hole public golf course. In 1998, the rural suburb was identified as a candidate for future growth as part of the Carr Labor state government’s report, Sydney Into Its Third Century, which bucked the in-trend notion of building higher density housing along established train lines and instead identified new areas that were free of development constraints. Rouse Hill Public Golf Course, pictured in 1999, was soon turned into a major shopping centre. Credit: Winsome Phillis/Riverstone Historical Society Rouse Hill would be the first suburb in the north-west to be developed. Landcom, the development arm of the state government, planned out the area before handing it over to developers GPT Group and Lendlease to build the town centre and homes around it. The first school opened in 2005, and the first part of the centre in 2007. In 2019, the north-west metro, with a stop outside the town centre, also began operations.\n\nAdvertisement\n\nWhat you need to know Things are slowly changing. Next to the shopping centre is empty land that will one day become Rouse Hill Hospital. After years of uncertainty, the federal Labor government committed in the election to funding a birthing suite after it was revealed that the hospital would be opened without one. The suburb is part of the state government’s North West Growth Area strategy, which has released acres of land across much of the region, with more to come. But even the metro and new bus services are struggling to meet the area’s growth: Windsor Road and Old Windsor Road are clogged. The council claims the average travel speed is 20km/h in the morning peak. The council is now campaigning for the state government to significantly increase its funding for infrastructure. What they said Michelle Byrne, Hills Shire Council Mayor: “At the moment, we’re home to over 200,000 people [in the Hills Shire]. By 2041, we’ll be home to over 328,000 people. That’s an increase in our population of over 71 per cent.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/would-you-pay-135-to-watch-a-squad-get-named-welcome-to-lions-mania-20250505-p5lwpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Would you pay $135 to watch a squad get named? Welcome to Lions mania",
    "publish_date": "Thu, 08 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten",
      "Jonathan Drennan"
    ],
    "text": "Former Wallabies captain James Horwill, who skippered Australia against the Lions in 2013, was playing for Harlequins in London when the 2017 squad was named. “So we were all sitting there in the team room watching the TV with the guys who are hoping to make it, or being talked about as possibilities,” Horwill said. “We had lots of England guys, and they were doing well at that stage. And Jamie Roberts as well. But he didn’t get selected, and a few others didn’t as well. It’s pretty brutal. You’re just there as a teammate and giving congratulations to some guys, and being there to support others.” Australian fans can watch on the Lions’ YouTube channel from 10.30pm. How is the squad selected?\n\nLions coach Andy Farrell and his staff will lean heavily on performances in the most recent Six Nations, but plenty of weight will also be given to form and combinations that have been delivering at Test level for the past few years. Farrell, who took over from Joe Schmidt as head coach of Ireland, has a mix of assistants from the unions: John Dalziel (Scotland), Simon Easterby (Ireland), John Fogarty (Ireland), Andrew Goodman (Ireland), Johnny Sexton (Ireland) and Richard Wigglesworth (England). But most expect the dominance of Irish figures on his staff to be mirrored in the squad, which is likely to contain 37 players, in the first instance. Ireland finished third in the Six Nations this year, behind France and England, but they won in 2023 and 2024 and were also ranked No.1 in the world at times during those two years.\n\nRichard Wigglesworth (England), Simon Easterby (Ireland), Andy Farrell (British and Irish Lions head coach), John Dalziel (Scotland), Andrew Goodman (Ireland) and John Fogarty (Ireland). Credit: Getty Images “They have still been the best team in the home nations over the last four years,” Horwill said. “And four of Farrell’s assistant coaches are Ireland guys … so I still think there is going to be a strong green tinge to the squad. Wales will be lucky to have more than one or two, and Scotland will have a decent handful. “But the majority of the squad will be English and Irish, is my gut feel.” It is also essential for Farrell to consider players who are good tourists, who can create a happy camp alongside their ability to compete for a Test spot.\n\nAre there any ‘Aussie’ Lions? There have only been six Australian-raised players selected for the Lions since 1889: Alec Timms (1889), Tom Richards (1910), Ian Smith (1924), Brent Cockbain (2005), Nathan Hines (2009) and Tom Court (2013). Sione Tuipulotu celebrates after scoring against the Wallabies in November. Credit: Getty Images But four more could be named in this year’s squad. Former Melbourne Rebels centre Sione Tuipulotu is considered a lock by most pundits. Now Scotland captain, Tuipulotu missed the Six Nations after tearing a pectoral muscle but is due back on the field shortly. Brumby-turned-Ireland winger Mack Hansen is also a strong chance.\n\nFormer Wallaby and now Scotland flanker Jack Dempsey is an outside shot to win selection, and Canberra-raised Ireland prop Finlay Bealham is also in the conversation. The topic of foreign-born or raised players in the Lions squad is sure to get some airtime in coming months. There could be a record number of Lions players who are eligible for their nations via grandparents or residency: James Lowe (Ire-NZ), Jamison Gibson-Park (Ire-NZ), Bundee Aki (Ire-NZ), Pierre Schoeman (Sco-SA), Duhan van der Merwe (Sco-SA), David Ribbands (Eng-SA) and the aforementioned Aussies. Will there be any bolters? There is always a classic bolter in a Lions squad, and the name on everyone’s lips is Henry Pollock, a flashy young back-rower at Northhampton who has caught fire at exactly the right time.\n\nThe Saints rookie has been scoring tries befitting a winger, and was outstanding in their Champions Cup semi-final win over Leinster last week. Another “bolter” at the centre of much discussion is at the other end of the experience scale: Owen Farrell. Though Farrell retired from Test rugby for England, the 33-year-old is still playing for Racing 92 in France and many believe he will get a call up from coach – and dad – Andy Farrell. Loading",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/womens-state-of-origin-2025-game-two-20250507-p5lx66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Strange sticks with winning line-up as Blues try to wrap up Origin series",
    "publish_date": "Thu, 08 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder"
    ],
    "text": "Blues coach John Strange has backed his winning line-up, naming the same squad of 17 for game two of the women’s State of Origin series that won the series opener in Brisbane last week.\n\nStrange shook up the NSW side for game one, naming four debutants and a new-look spine, but the NSW mentor was vindicated after his team thrashed Queensland 32-12 at Suncorp Stadium.\n\nThe NSW and Roosters coach said he stuck with the same squad for game two at Allianz Stadium next Thursday because of the performance “of all 17 players”, not “necessarily the result”.\n\n“They all had a job to do, that I asked them to do, and I felt like they did that,” Strange said. “As a coach, that’s all you can ask. Whether they win or not, if the players do what you ask, then I was really happy with that ... The most impressive thing for me was the attitude that all 17 girls took out onto the field.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/a-look-inside-the-worlds-only-floating-farm-house-20250508-p5lxl4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A look inside the world's only floating farm house",
    "publish_date": "Thu, 08 May 2025 11:23:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "A look inside the world's only floating farm house\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/unique-homeowner-goes-fishing-from-his-couch-20250508-p5lxl3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unique homeowner goes fishing from his couch",
    "publish_date": "Thu, 08 May 2025 11:23:28 +1000",
    "category": "finance",
    "authors": [],
    "text": "Unique homeowner goes fishing from his couch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/has-covid-changed-in-five-years-what-to-know-as-winter-looms/0em8uuv32",
    "title": "Has COVID changed in five years? What to know as winter looms",
    "publish_date": "Wed, 7 May 2025 19:55:28 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Five years ago, COVID-19 was all we could think about. Today, we’d rather forget about lockdowns, testing queues and social distancing. But the virus that sparked the pandemic, SARS-CoV-2, is still circulating.\n\n\n\n\n\nMost people who get COVID-19 today will experience only a mild illness. But some people are still at risk of severe illness and are more likely to be hospitalised with COVID-19. This includes older people, those who are immunocompromised by conditions such as cancer, and people with other health conditions such as diabetes.\n\n\n\n\n\nOutcomes also tend to be more severe in those who experience social inequities such as homelessness. In the United Kingdom, people living in the 20 per cent most deprived areas have double chance of being hospitalised from infectious diseases than those in the least deprived areas.\n\n\n\nREAD MORE Does it matter which arm gets a vaccine? A new study offers some clues\n\nHow many cases and hospitalisations?\n\nIn Australia, 58,000 COVID-19 cases have been reported so far in 2025. However, testing rates have declined and not all positive cases are reported to the government, so case numbers in the community are likely much higher.\n\n\n\n\n\nLatest data from FluCan, a network of 14 hospitals, found 781 people were hospitalised for COVID-19 complications in the first three months of the year. This “sentinel surveillance” data gives a snapshot from a handful of hospitals, so the actual number of hospitalisations across Australia is expected to be much higher.\n\n\n\n\n\nWhile deaths are lower than previous years, 289 people died from COVID-related respiratory infections in the first two months of the year.\n\n\n\nWhat can we expect as we head into winter?\n\nWe often see an increase in respiratory infections in winter.\n\n\n\n\n\nHowever, COVID-19 peaks aren’t just necessarily seasonal. Over the past few years, peaks have tended to appear around every six months.\n\n\n\nSome people are still at risk of severe illness, five years after the pandemic. Source: Unsplash / engin akyurt\n\nWhat are the most common COVID symptoms?\n\nTypical early symptoms of COVID-19 included fever, cough, sore throat, runny nose and shortness of breath. These have remained the most common COVID-19 symptoms across the multiple variant waves.\n\n\n\n\n\nEarly in the pandemic, we realised COVID-19 caused a unique symptom called anosmia — the changed sense of taste or smell. Anosmia lasts about a week and in some cases can last longer. Anosmia was more frequently reported from infections due to the ancestral, Gamma, and Delta variants but not for the Omicron variant, which emerged in 2021.\n\n\n\nHowever, loss of smell still seems to be associated with some newer variants. A recent French study found anosmia was more frequently reported in people with JN.1.\n\n\n\n\n\nBut the researchers didn’t find any differences for other COVID-19 symptoms between older and newer variants.\n\n\n\nShould you bother doing a test?\n\nYes. Testing is particularly important if you experience COVID-like symptoms or were recently exposed to someone with COVID-19 and are at high-risk of severe COVID. You might require timely treatment.\n\n\n\n\n\nIf you are at risk of severe COVID, you can see a doctor or visit a clinic with point-of-care testing services to access confirmatory PCR (polymerase chain reaction) testing.\n\n\n\n\n\nRapid antigen tests (RATs) approved by Australia’s regulator are also still available for personal use.\n\n\n\n\n\nBut a negative RAT doesn’t mean that you don’t have COVID-19 — especially if you are symptomatic.\n\n\n\nIf you do test positive, while you don’t have to isolate, it’s best to stay at home.\n\n\n\n\n\nIf you do leave the house while experiencing COVID-19 symptoms, minimise the spread to others by wearing a well-fitted mask, avoiding public places such as hospitals and avoiding contact with those at higher risk of severe COVID-19.\n\n\n\nHow long does COVID last these days?\n\nIn most people with mild to moderate COVID, it can last 7–10 days.\n\n\n\n\n\nSymptomatic people can spread the infection to others from about 48 hours before you develop symptoms to about ten days after developing symptoms. Few people are infectious beyond that.\n\n\n\n\n\nBut symptoms can persist in more severe cases for longer.\n\n\n\n\n\nA UK study which tracked the persistence of symptoms in 5,000 health-care workers found symptoms were less likely to last for more than 12 weeks in subsequent infections.\n\n\n\nGeneral fatigue, for example, was reported in 17.3 per cent of people after the first infection compared with 12.8 per cent after the second infection and 10.8 per cent following the third infection.\n\n\n\n\n\nUnvaccinated people also had more persistent symptoms.\n\n\n\n\n\nVaccinated people who catch COVID tend to present with milder disease and recover faster. This may be because vaccination prevents over-activation of the innate immune response.\n\n\n\nVaccination remains the best way to prevent COVID\n\nVaccination against COVID-19 continues to be one of the most effective ways to prevent COVID-19 and protect against it. Data from Europe’s most recent winter, which is yet to be peer reviewed, reports COVID-19 vaccines were 66 per cent effective at preventing symptomatic, confirmed COVID cases.\n\n\n\n\n\nMost people in Australia have had at least one dose of the COVID-19 vaccine. But if you haven’t, people over 18 years of age are recommended to have a vaccine.\n\n\n\n\n\nBoosters are available for adults over 18 years of age. If you don’t have any underlying immune issues, you’re eligible to receive a funded dose every 12 months.\n\n\n\nBoosters are recommended for adults 65–74 years every 12 months and for those over 75 years every six months.\n\n\n\n\n\nAdults over 18 years who are at higher risk because of weaker immune systems are recommended to get a COVID vaccine every 12 months and are eligible every six months.\n\n\n\n\n\nCheck your status and eligibility using this booster eligibility tool and you can access your vaccine history here .\n\n\n\nA new review of more than 4,300 studies found full vaccination before a SARS-CoV-2 infection could reduce the risk of long COVID by 27 per cent relative to no vaccination for the general adult population.\n\n\n\n\n\nWith ongoing circulation of COVID, hybrid immunity from natural infection supplemented with booster vaccination can help prevent large-scale COVID-19 waves.\n\n\n\n\n\nMeru Sheel is an associate professor and epidemiologist at Infectious Diseases, Immunisation and Emergencies (IDIE) Group, Sydney School of Public Health, University of Sydney. Sheel receives funding from National Health and Medical Research Council and Department of Foreign Affairs and Trade. She serves on WHO's Immunization and Vaccines Related Implementation Research Advisory Committee (IVIR-AC).\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/china-injects-stimulus-ahead-of-us-trade-talks-the-aussie-dollar-at-a-six-month-high/khj6niqe0",
    "title": "China injects stimulus ahead of US trade talks, & the Aussie dollar at a six month high",
    "publish_date": "Wed, 7 May 2025 08:30:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/influenza-cases-surge-time-to-get-vaccinated-say-experts/qc1ff2fed",
    "title": "Influenza cases surge: time to get vaccinated say experts",
    "publish_date": "Wed, 7 May 2025 04:18:03 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEvery year, from April to September, it's influenza season - when there is an increase in cases of what's commonly called the flu.\n\n\n\n\n\nThe highly contagious virus can affect anyone of any age, and while it can be mild for some people, for others it can be a severe illness that results in hospitalisation - or even death.\n\n\n\n\n\nProfessor Patrick Reading works with one of five World Health Organisation centres in the world that tracks influenza and its evolving sub-types each year.\n\n\n\n\n\nHe says so far this year, 63,000 cases of influenza have been recorded in Australia.\n\n\n\n\n\n\"In Australia, we've seen increased influenza activity in all (health) jurisdictions in early 2025 when compared to previous years. Despite the increased influenza activity, we can't currently protect the severity of the upcoming season in Australia. This will be dependent on a range of factors (including) which virus sub-type becomes dominant.\"\n\n\n\n\n\nIn 2024, there were 1,002 deaths involving influenza - a 67.7 per cent increase on the 12 months prior.\n\n\n\n\n\nThat is why all people aged 6 months and over are recommended to receive an annual influenza vaccine that is updated every year to respond to the evolving sub-types of influenza circulating in the community.\n\n\n\n\n\nLast year's influenza season in Australia saw the number of laboratory-confirmed cases reach the highest annual level ever recorded.\n\n\n\n\n\nProfessor Paul Griffin is director of infectious diseases at Mater Health Services in Brisbane.\n\n\n\n\n\nHe says the impacts of influenza outbreaks on the community are often underestimated. \"We know that there are deaths in the order of thousands; hospitalisations - around 20,000 every year. Hundreds of thousands of doctors' visits. And there are quite a lot of financial implications, in terms of lost work days. It can be infectious for quite a long time. So even before symptoms appear, potentially; and then even for up to a week thereafter. So it can be quite easy to transmit. And it is very clear that children contribute very much to the spread. Both because they shed more virus - but also because it is a bit harder to get them to do the hygiene things that we ask of them.\"\n\n\n\n\n\nHe says vaccination remains the most important way of reducing the risk of catching the flu this season, but other measures that can be adopted include hand hygiene, masks, improved air quality and ventilation.\n\n\n\n\n\nIf you do get flu-like symptoms, getting a timely rapid antigen test can pinpoint which virus you have, which can then lead to specific advice on treatment.\n\n\n\n\n\nProfessor Julie Leask is a public health researcher at the University of Sydney who studies attitudes towards vaccination.\n\n\n\n\n\nShe says extensive research has shown the influenza vaccine is effective.\n\n\n\n\n\nBut its impact on the individual will depend on: the age and health of the person receiving it, and the match between the vaccine and the particular influenza sub-type caught by the person.\n\n\n\n\n\n\"So people will often think: 'oh, I've got the flu. Oh, I had a vaccine - and it didn't stop me from getting the flu.' Well, actually it was probably the case that you got another virus (not influenza) - that that flu vaccine couldn't have prevented because it is an entirely separate virus that doesn't have a vaccine for it. Such as adenovirus or rhinovirus, which are a couple of other viruses. Flu has a bit of a personality problem because people think that any old virus the get is flu and therefore, you know if it is mild, it's just the flu. They tend to diminish the potential seriousness of it.\"\n\n\n\n\n\nTo encourage Australians to get the updated annual flu vaccine, the federal government subsidises the cost to make it free for certain groups in the population who are deemed to have a higher risk of severe illness.\n\n\n\n\n\nThese groups include: children aged 6 months to 5 years; pregnant women; and all Aboriginal and Torres Strait Islanders aged 6 months and over.\n\n\n\n\n\nSome states, like Queensland, have funded a free flu vaccination program for all state residents, including international students.\n\n\n\n\n\nA number of workplaces are also subsidising the cost of the vaccine for their employees to reduce absenteeism.\n\n\n\n\n\nVaccine uptake as of the 4th of May is highest for those aged 65 years and over at 35 per cent, according to the National Centre for Immunisation Research and Surveillance]].\n\n\n\n\n\nIt's 14.1 per cent for those between 50- and 64 years of age.\n\n\n\n\n\nFor every other age group it's less than 10 per cent.\n\n\n\n\n\nDr Leask says making the flu vaccine free more broadly would increase uptake - but that is a cost decision to weigh up for the federal, state and territory governments.\n\n\n\n\n\n\"So whenever a particular group is offered a free vaccine, you will see the uptake increase. Reducing out-of-pocket costs, whether it be the vaccine itself or the service that is used to deliver the vaccine - that will also improve uptake in entire populations. Whether that means that it should therefore be free for all age groups is a matter for our very well-established systems in Australia - the Pharmaceutical Benefits Scheme, who assess vaccination to see if offering them to everybody is going to be cost-effective at a population level. And also, for anything to even be considered on that pharmaceutical advisory committee, it needs to be presented to the community by what's called a sponsor. Which is usually the company who make the vaccine - an industry sponsor. Or some other group - such as a group of researchers.\"\n\n\n\n\n\nAnd on the issue of whether vaccine hesitancy is playing a role in the uptake of the influenza vaccine this year, Professor Leask says that is an area that will require further study.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/shes-stockier-now-valerie-the-dachshund-reunited-with-owners-prepares-to-head-home/81oaf7ob9",
    "title": "'She's stockier now': Valerie the dachshund reunited with owners, prepares to head home",
    "publish_date": "Wed, 7 May 2025 03:31:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "After 529 days on the run, Valerie the dachshund has finally been reunited with her owners.\n\n\n\n\n\nThe pooch spent nearly 18 months in the wild on South Australia's Kangaroo Island after she went missing in November 2023.\n\n\n\n\n\nValerie escaped from her pen at owners Georgia Gardner and Josh Fishlock's campsite before running into dense scrub.\n\n\n\n\n\nAfter evading wildlife rescuers, she was eventually captured by Kangala Wildlife Rescue, where she has spent almost two weeks.\n\n\n\n\n\nNow, she's been reunited with her owners for the first time since she went missing.\n\n\n\n'It still doesn't feel real'\n\nOn Tuesday, Valerie was reunited with Gardner and Fishlock, prompting plenty of happy tears and wagging tails.\n\n\n\n\n\n\"I was sitting on the ground when Lisa and Jared brought Valerie in, and she ran straight up to me — I just burst into tears,\" Gardner said. \"She was wagging her tail, making her little happy sounds, and wiggling around with joy. I held her and cried and cried.\"\n\n\n\n\n\nGardner had brought Valerie's old harness, which she could barely fit into.\n\n\n\n\n\n\"She's stockier now, strong and healthy ... healthier than we are, honestly,\" she said.\n\n\n\n\n\nFishlock admitted he wasn't sure if he would see his pup again.\n\n\n\n\n\n\"It was incredible — euphoric! We never thought we'd hold her again, and then suddenly, there she was. It still doesn't feel real,\" he said.\n\n\n\nValerie is now preparing for a long drive back to Albury, where she'll meet a new family member — a dachshund named Dorothy. Source: Supplied\n\n'A miracle she survived'\n\nAccording to the Kangala Wildlife Rescue, the search involved 1,000 hours spent by volunteers, 5,000km travelled in private cars and the use of various cameras, traps, and technologies.\n\n\n\n\n\nJared Karran, director of Kangala Wildlife Rescue, said: \"We felt like we came to know Valerie through the camera.\"\n\n\n\n\n\n\"But when we met her in person, she was just so much smaller than we imagined.\n\n\n\n\n\n\"If it was a miracle before that she'd survived — seeing her size — it's just unbelievable that she was able to survive and thrive out there!\"\n\n\n\n\n\nExperts believe Valerie evaded predators, including eagles and snakes, and believed she lived on a diet of roadkill, native animals, and dam water.\n\n\n\nREAD MORE Hope builds as plan to catch missing dachshund Valerie nears next phase\n\nKarran said it would be difficult to say goodbye to Valerie.\n\n\n\n\n\n\"It's going to be hard to say goodbye to Valerie, but we know that she'll be so well cared for and loved with Georgia and Josh. And if she ever feels like a Kangaroo Island getaway, she's welcome here anytime!\" he said.\n\n\n\n\n\nValerie will now enjoy a long road trip back to Albury, NSW, where she'll reunite with her fur-siblings — Lucy the rescue cat and Mason the red heeler. She'll also meet Dorothy, the family's newest dachshund.\n\n\n\nREAD MORE Social media star Molly the magpie reunited with carers and dog friends\n\nTo support her transition back to suburban life, Valerie will meet with a dog behaviourist.\n\n\n\n\n\n\"Valerie's separation anxiety played a big role in why she went missing, so we’ll be crate training her to provide a safe place to decompress,\" Gardner said.\n\n\n\n\n\n\"We're also keeping her on a raw food diet, considering her incredible condition when she was found.\n\n\n\n\n\n\"I hope Valerie's story brings hope, joy and inspiration to anyone who's ever lost a pet or going through a difficult time. If the smallest sausage dog can survive 529 days in the bush — you, too, can survive whatever life throws at you.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/max-chandler-mather-says-working-in-parliament-was-bloody-awful-and-miserable/ipyjlgfkb",
    "title": "Max Chandler-Mather says working in parliament was 'bloody awful' and 'miserable'",
    "publish_date": "Wed, 7 May 2025 01:45:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Max Chandler-Mather says he is \"really proud\" of his work in giving renters a voice on the national stage, as he reflected on his \"miserable\" time in parliament.\n\n\n\n\n\nThe outgoing Greens housing spokesperson said they operated against \"often very hostile two major parties\" and that he is \"quite happy\" about not spending more time in the House of Representatives.\n\n\n\n\n\nChandler-Mather spoke to Triple J's Hack program after conceding his Brisbane seat of Griffith to Labor's Renee Coffey in the federal election.\n\n\n\n\n\n\"I really feel really proud of a lot of the work we have done over the last three years,\" Chandler-Mather said on Tuesday evening.\n\n\n\n\n\n\"Perhaps what I feel most proud of is giving renters a bit of a voice on the national stage. So often we are ignored and treated like second-class citizens. It felt like at the very least we were able to force that issue onto the national stage.\"\n\n\n\n'I don't regret a thing'\n\nHe said the result \"is always a possibility\".\n\n\n\n\n\n\"It was always going to be a risk, when you're fighting these really big institutions — the property and banking industry, the major political parties, parts of the media establishment — and you're going out there saying renters deserve a little bit, and people on low incomes deserve a bit more.\n\n\n\n\n\n\"There was always going to be a risk that you were going to cop a bit of hostility.\n\n\n\n\n\n\"I take that as a point of pride, but it always comes with risk. I don't regret a thing, really.\"\n\n\n\n\n\nBut he said he feels he has let a lot of people down.\n\n\n\n\n\n\"We helped build a lot of hope and then we lost in Griffith. Ultimately, I have to take responsibility for that.\"\n\n\n\nA 'bloody awful', 'miserable' workplace\n\nThe election was a night of mixed results for the Greens, with the party losing two of its Brisbane seats.\n\n\n\n\n\nParty leader Adam Bandt's seat of Melbourne remains undecided at time of publication.\n\n\n\n\n\nDespite this, Bandt said on Monday that the party has received a record Senate vote this election, and is on track to take 11 upper house seats.\n\n\n\n\n\nChandler-Mather said the Greens were subject to a \"massive collapse in the Liberal vote that transferred to Labor\".\n\n\n\n\n\n\"We were operating against often very hostile two major parties,\" he said.\n\n\n\n\n\n\"I'll be honest — one of the things I'm quite happy about at the moment is I don't have to spend more time in the House of Representatives. Because basically every time I stood up, I got screamed and yelled at.\n\n\n\n\n\n\"In terms of a workplace, it was bloody awful, and frankly a lot of the time, miserable.\"\n\n\n\nLater responding to a question on criticisms directed towards the Greens, including slowing progress on issues such as housing and undelivered promises like rent freezes, he said: \"Parliament is a sick place, can I just say? Genuinely.\"\n\n\n\n\n\n\"There were times when I was sitting in parliament and you'd watch both sides of politics team up to defend the stage three tax cuts.\n\n\n\n\n\n\"Then we were getting attacked because we said we should spend a bit more on public housing and give something for renters.\n\n\n\n\n\n\"I feel proud of that work … and I think if I had my time again, I would do it all again.\"\n\n\n\n\n\n\"Did it have an effect? Maybe that lost us some votes.\"\n\n\n\n'Of course we have fallen short'\n\nChandler-Mather acknowledged the party had fallen short when it came to lower house seats — which was \"bitterly disappointing\".\n\n\n\n\n\n\"But I think there is a lot of reason for hope,\" he said.\n\n\n\n\n\n\"We need to work out how to do better. Two days out from the election, [I] don't have all the answers.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/technology/rockstar-games-share-fresh-trailer-for-grand-theft-auto-vi-20250508-p5lxlp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rockstar Games share fresh trailer for Grand Theft Auto VI",
    "publish_date": "Thu, 08 May 2025 12:01:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rockstar Games share fresh trailer for Grand Theft Auto VI\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-zz-top-20250508-p5lxka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘ZZ Top came on looking like ZZ top, which is a culturally beautiful thing to witness’",
    "publish_date": "Thu, 08 May 2025 11:59:32 +1000",
    "category": "entertainment",
    "authors": [
      "Giselle Au-Nhien Nguyen",
      "Jessica Nicholas"
    ],
    "text": "Thorogood made it clear that words were not the most important part of the evening, shouting “I hope you appreciate my intellectual lyrics” after playing his truck-tastic Gear Jammer. But he and the excellent Destroyers hit all the needed themes of the night, from lust (Mama, Talk to Your Daughter) to liquor (One Bourbon, One Scotch, One Beer) to licks (Bad to the Bone) while sticking admirably to the night’s overarching theme of boogie-woogie, blues-rockin’, country-smellin’ guitar worship. A truly excellent set that could only be followed by the masters of the genre, ZZ Top.\n\nGeorge Thorogood strutted on stage at Margaret Court Arena like a man who is the party and kicked things off with: “How sweet it is! Welcome in everybody, there’s a rock party tonight!” then, bam! Straight into Rock Party, because subtlety is for Radiohead.\n\nYou know that bit in The Blues Brothers where the car chase starts at night and about seven minutes in, there’s a cut and suddenly it’s daytime, but the car chase is still going? And you think “by any normal metric, this car chase is too long. But I’m still loving it!” Well, that’s what every blues-rocking guitar solo was like from both George Thorogood and ZZ Top on Wednesday night, where it truly felt like too long wasn’t long enough.\n\nZZ Top came on looking like ZZ top, which is a culturally beautiful thing to witness. Resplendent in beards, cheap sunglasses and rhinestones, they got straight into ’80s classic Got Me Under Pressure and the response was as big as Elwood Francis’ giant 17-stringed yellow bass.\n\nLike a perfect marriage, for 51 years the Top’s lineup was unchanged, making them perhaps the most consistent rock ‘n’ roll lineup of all time. Dusty Hill’s passing in 2021 led to his replacement with Francis, the band’s long-time guitar tech, who is the perfect mix of silly fun and deep groove to step into Hill’s shoes, whilst John Douglas, despite sitting in darkness behind a double bass-drummed metal-style behemoth of a kit, plays an admirable Frank Beard, who is temporarily out of the tour due to medical issues.\n\nBilly Gibbons may have aged, but he has never grown up. Credit: Martin Philbey\n\nOne of the things I have always adored about ZZ Top is their understated, charming choreography, moving like marionettes handled by an octogenarian. Happily, this means they have lost none of their performance ability, even 56 years into their career. We don’t need to see them running about and climbing speaker stacks, because they never have. We’re all just happy that their fingers pluck and strum on classics like Pearl Necklace, My Head’s in Mississippi, Sharp Dressed Man and Legs as perfectly as when those tracks were released.\n\nAfter an encore’s fuchsia-based costume change, the band once again keep their banter at a minimum, letting their clothes do the talking and their bass-lines do the walking (except when the bass-lines are more syncopated and groove-driven). They hit us with the blues of Brown Sugar, the boogie of Tube Snake Boogie and the brilliance of La Grange, bringing the whole floor section to their feet. If there is one lesson to be learned of the evening, it is that while rock ‘n’ roll may age, it never grows up.\n\nReviewed by Andrew McClelland",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/afl/willie-rioli-withdraws-from-port-adelaide-team-for-showdown-20250508-p5lxi9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Willie Rioli withdraws from Port Adelaide team for Showdown",
    "publish_date": "Thu, 08 May 2025 11:57:32 +1000",
    "category": "sports",
    "authors": [
      "Jake Niall"
    ],
    "text": "Port Adelaide forward Willie Rioli has withdrawn from Saturday night’s Showdown against Adelaide, after a week of turmoil surrounding alleged threats made to three on-field opponents.\n\nThe club confirmed on Thursday morning that Rioli had pulled out of match consideration.\n\nMore to come",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/the-trump-iceberg-has-struck-china-america-is-bracing-for-it-20250508-p5lxhv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trump iceberg has struck China. America is bracing for it",
    "publish_date": "Thu, 08 May 2025 11:56:19 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Given the lags in impacts, it was logical that the PBOC should be the first of the two central banks to move. On Tuesday, it unveiled a package of monetary policy support, including a 10 basis point cut in its key short-term interest rate, a 50 basis point reduction in the required reserve ratio for its banks, more credit available for consumption, aged care, the tech industries and cheaper credit for mortgages. Jerome Powell and the Fed are in wait-and-see mode. Credit: Bloomberg In effect, it is making more liquidity and credit available within its financial system although, in the continuing absence of fiscal stimulus from Beijing, it is an open question as to whether there will be any demand for that credit from Chinese businesses and consumers that were in a defensive mode even before Trump’s assault on global trade. The PBOC’s announcement might also have been designed to send a message to the Trump administration ahead of this weekend’s meeting of Chinese and US officials in Geneva – a signal that China has levers to pull to blunt the economic effects of the trade war. The absence of fiscal stimulus could be interpreted as a sign that Beijing isn’t panicking – it has its “bazooka” in reserve.\n\nThe meeting between Bessent and China’s vice premier He Lifeng isn’t going to produce a trade truce. As Bessent told Fox News, they will be initial talks to “agree what we’re going to talk about.” “My sense is that this will be about de-escalation, not about the big trade deal, he said.” Loading Any actual trade deal between the US and China could take months, if not years, to trash out and it is unlikely that, during Trump’s remaining term, they will be reduced to anything close to the average of about 20 per cent rate they were before Trump began ratcheting them up this year. (The 20 per cent rate was a legacy of Trump’s first trade war in 2018-19 that Joe Biden retained). During his election campaign last year, Trump promised a 60 per cent duty on all imports from China, which is probably the US final position in any negotiation. Trump has said Americans will need to accept higher prices and reduced choices if his attempt to return manufacturing investment and employment to the US is to succeed.\n\nBefore April 2, the average US tariff on imports was only 2.5 per cent. The best outcome now appears likely to be a minimum average tariff on all imports to the US of at least 25 per cent, although with Trump dreaming up new tariffs and forms of tariffs – the “Hollywood” tariff on offshore film production, the first tariff mooted on services rather than goods is the most recent example – it’s anyone’s guess where the final imposts will land or what their eventual impact on the US economy will be, other than that it won’t be positive. That explains why the Fed is frozen in its “wait and see” mode. In its formal statement, the Fed said that uncertainty about the economic outlook had increased further and the risks of higher unemployment and higher inflation had risen. Given the lags in impacts, it was logical that the PBOC should be the first of the two central banks to move. Credit: Bloomberg Powell told a news conference that “it’s not really clear what it is that we should do” and that he could not yet say “which way this will shake out” in terms of being more worried about inflation or growth. The costs of waiting, he said, were still low.\n\nThe Fed couldn’t act pre-emptively to head off the inflationary impacts of the tariffs “because we actually don’t know what the right response to the data will be until we see the data,” he said. “If the large increases in tariffs that have been announced are sustained, they’re likely to generate a rise in inflation, a slowdown in economic growth and an increase in unemployment,” Powell said. “The effects on inflation could be short-lived, reflecting a one-time shift in the price level,” he said. It was also possible, however, that the inflationary effects could be more persistent, he said. He said it was premature to declare which side of the Fed’s dual mandate – inflation and employment – would be prioritised.\n\nThat’s the Fed’s dilemma. If the inflationary effects of Trump’s tariffs are transitory, it would cut rates to protect growth and employment. The differences in stance don’t reflect calm in the US and panic in China, but the leads and lags within the trade wars that Donald Trump launched. It is acutely aware, however, that when it declared the impact on inflation of the pandemic to be transitory and lowered rates further than, with hindsight, it should have, it unleashed a wave of inflation it is still battling to contain. It can’t afford to make the same mistake again. The Fed prides itself on being data-driven. It will wait for the data, which means it will be reacting to the effects of the tariffs after they have already emerged, rather than trying to pre-empt them.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/how-to-make-bill-granger-s-favourite-brunch-sweetcorn-fritters-with-tex-mex-sides-20250210-p5laza.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How to make Bill Granger’s favourite brunch: Sweetcorn fritters with Tex-Mex sides",
    "publish_date": "Thu, 08 May 2025 11:52:10 +1000",
    "category": "finance",
    "authors": [
      "Bill Granger"
    ],
    "text": "The combination of crunch and big flavours makes Bill Granger’s sweetcorn fritters a winner. Mikkel Vang\n\n“Tex-Mex was huge around the time we opened bills in 1993,” Bill Granger wrote in his 2020 cookbook Australian Food. “Tinned chipotles were flavour of the month, and Navajo blankets were being dragged down every fashionable catwalk. This was in the days before we worried about cultural appropriation, and we were living in a Santa Fe fantasy world.”\n\nThese sweetcorn fritters with roast tomatoes, bacon and avocado salsa were Granger’s nod to that, but they outlived the phase and are still on the menu. With its combination of crunch and big flavours, this was his favourite breakfast dish.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/chooks-paparazzi-and-regrets-behind-the-cheese-s-last-hurrah-in-a-roosters-jersey-20250508-p5lxij.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chooks, paparazzi and regrets: Behind the Cheese’s last hurrah in a ‘Roosters’ jersey",
    "publish_date": "Thu, 08 May 2025 11:47:53 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "The irony wasn’t lost on Brandon Smith as he posed in a faux Roosters ‘Nandos’ jersey on Wednesday morning with a bowl of mac and cheese.\n\nIt’s the closest he will get to wearing Tricolours kit again as his tumultuous few years as the club’s marquee signing comes to an early end.\n\n“It’s been disappointing,” Smith said frankly when asked to sum up his time as a Rooster, stressing he has no issue with his looming release to join arch-rivals South Sydney.\n\nSmith arrived at Bondi touted as the $2.5 million missing puzzle piece for Trent Robinson, but instead became an oft-highlighted recruitment misstep before rupturing his ACL last year.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/north-america/australian-high-school-jazz-band-gets-the-ultimate-call-up-in-new-york-20250507-p5lx4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The place you want to be’: How a Melbourne teenager went from watching YouTube to a New York stage",
    "publish_date": "Thu, 08 May 2025 11:44:20 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: When Anna Yamazaki was starting high school in Melbourne, clips from the Essential Ellington jazz program in New York City started popping up among her YouTube suggestions.\n\nThe competition attracts the crème de la crème of school jazz bands from across North America, who gather at the Lincoln Centre in Manhattan to play Duke Ellington tracks and other big band standards. For budding jazz musicians around the world, it’s the north star.\n\nBlackburn High School Jazz Band plays at the Lefrak Concert Hall in Queens ahead of the Essentially Ellington festival. Credit: Alex Towle\n\n“I’ve watched Ellington for years and years, and it’s always been a ‘what if’ thought,” says Yamazaki, 17, who is now in year 12. “I never thought it would become a reality.”\n\nYamazaki and 19 other students from Blackburn High School, a public school in Melbourne’s east, will perform in the Big Apple this week after being selected as finalists for the competition’s special 30th anniversary instalment.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/nsw/this-suburb-is-booming-and-there-s-more-development-on-the-way-what-comes-next-20250506-p5lx2u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This suburb is booming, and there’s more development on the way. What comes next?",
    "publish_date": "Thu, 08 May 2025 11:30:01 +1000",
    "category": "finance",
    "authors": [
      "Anthony Segaert"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It’s early on Wednesday morning at Rouse Hill Town Centre – one of the country’s largest greenfield shopping centres – and people are starting their days with coffee and a visit to the playground. Life in Rouse Hill is good. There is a metro stop next to the town centre where driverless trains take residents to the CBD in less than 40 minutes, and the shopping centre features a lot of open space and community facilities. But behind the omnipresent music and the carefully manicured lawns that define the town centre, and after two decades of unprecedented greenfield development, Rouse Hill continues to experience growing pains. The shopping centre has virtually no rental vacancy, and the local council says it is struggling to keep up with the service demands of the tens of thousands of new residents. Construction will soon begin on Rouse Hill Town Centre Stage 2. Credit: Rhett Wyman Rouse Hill is home to more than 11,000 people. But it’s set to take on thousands more over the next decade as the council grapples with how to implement the state government-mandated target of 23,300 new homes in the shire over the next five years. What comes next for one of Sydney’s first greenfield developments?\n\nAdvertisement\n\nThe news On Wednesday, developer GPT Group announced it had begun construction on the second stage of Rouse Hill’s major shopping precinct, Rouse Hill Town Centre. With its leaders and local Liberal Mayor Michelle Byrne using golden shovels for a sod turning in front of tonnes of already moved dirt, the group said the extension of the shopping centre would allow for extra growth in the suburb, with its established main centre approaching capacity. An artist’s impression of Stage 2 of the Rouse Hill Town Centre. Credit: GPT Group The precinct will expand the development by more than 10,000 square metres and bring at least 50 new shops, cafes and leisure facilities to the area. GPT had lodged its development application with plans to include 218 apartments, but Chris Barnett, the head of retail at the developer, said that “at this time we are just focusing solely on the retail option”. “It’s a point in time in the cycle of residential development … what we have been able to do is future-proof what we’re creating today to come back and build residential at the right time.”\n\nAdvertisement\n\nLoading But more people will be coming to the centre regardless of whether GPT builds apartments on top: Hills Shire Council estimates 329,000 residents will join its local government area within 15 years, and is campaigning the state government to urgently provide more infrastructure to keep up with demand. How we got here Eastern suburbs residents, beware: Rouse Hill’s town centre was once a nine-hole public golf course. In 1998, the rural suburb was identified as a candidate for future growth as part of the Carr Labor state government’s report, Sydney Into Its Third Century, which bucked the in-trend notion of building higher density housing along established train lines and instead identified new areas that were free of development constraints. Rouse Hill Public Golf Course, pictured in 1999, was soon turned into a major shopping centre. Credit: Winsome Phillis/Riverstone Historical Society Rouse Hill would be the first suburb in the north-west to be developed. Landcom, the development arm of the state government, planned out the area before handing it over to developers GPT Group and Lendlease to build the town centre and homes around it. The first school opened in 2005, and the first part of the centre in 2007. In 2019, the north-west metro, with a stop outside the town centre, also began operations.\n\nAdvertisement\n\nWhat you need to know Things are slowly changing. Next to the shopping centre is empty land that will one day become Rouse Hill Hospital. After years of uncertainty, the federal Labor government committed in the election to funding a birthing suite after it was revealed that the hospital would be opened without one. The suburb is part of the state government’s North West Growth Area strategy, which has released acres of land across much of the region, with more to come. But even the metro and new bus services are struggling to meet the area’s growth: Windsor Road and Old Windsor Road are clogged. The council claims the average travel speed is 20km/h in the morning peak. The council is now campaigning for the state government to significantly increase its funding for infrastructure. What they said Michelle Byrne, Hills Shire Council Mayor: “At the moment, we’re home to over 200,000 people [in the Hills Shire]. By 2041, we’ll be home to over 328,000 people. That’s an increase in our population of over 71 per cent.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/would-you-pay-135-to-watch-a-squad-get-named-welcome-to-lions-mania-20250505-p5lwpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Would you pay $135 to watch a squad get named? Welcome to Lions mania",
    "publish_date": "Thu, 08 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten",
      "Jonathan Drennan"
    ],
    "text": "Former Wallabies captain James Horwill, who skippered Australia against the Lions in 2013, was playing for Harlequins in London when the 2017 squad was named. “So we were all sitting there in the team room watching the TV with the guys who are hoping to make it, or being talked about as possibilities,” Horwill said. “We had lots of England guys, and they were doing well at that stage. And Jamie Roberts as well. But he didn’t get selected, and a few others didn’t as well. It’s pretty brutal. You’re just there as a teammate and giving congratulations to some guys, and being there to support others.” Australian fans can watch on the Lions’ YouTube channel from 10.30pm. How is the squad selected?\n\nLions coach Andy Farrell and his staff will lean heavily on performances in the most recent Six Nations, but plenty of weight will also be given to form and combinations that have been delivering at Test level for the past few years. Farrell, who took over from Joe Schmidt as head coach of Ireland, has a mix of assistants from the unions: John Dalziel (Scotland), Simon Easterby (Ireland), John Fogarty (Ireland), Andrew Goodman (Ireland), Johnny Sexton (Ireland) and Richard Wigglesworth (England). But most expect the dominance of Irish figures on his staff to be mirrored in the squad, which is likely to contain 37 players, in the first instance. Ireland finished third in the Six Nations this year, behind France and England, but they won in 2023 and 2024 and were also ranked No.1 in the world at times during those two years.\n\nRichard Wigglesworth (England), Simon Easterby (Ireland), Andy Farrell (British and Irish Lions head coach), John Dalziel (Scotland), Andrew Goodman (Ireland) and John Fogarty (Ireland). Credit: Getty Images “They have still been the best team in the home nations over the last four years,” Horwill said. “And four of Farrell’s assistant coaches are Ireland guys … so I still think there is going to be a strong green tinge to the squad. Wales will be lucky to have more than one or two, and Scotland will have a decent handful. “But the majority of the squad will be English and Irish, is my gut feel.” It is also essential for Farrell to consider players who are good tourists, who can create a happy camp alongside their ability to compete for a Test spot.\n\nAre there any ‘Aussie’ Lions? There have only been six Australian-raised players selected for the Lions since 1889: Alec Timms (1889), Tom Richards (1910), Ian Smith (1924), Brent Cockbain (2005), Nathan Hines (2009) and Tom Court (2013). Sione Tuipulotu celebrates after scoring against the Wallabies in November. Credit: Getty Images But four more could be named in this year’s squad. Former Melbourne Rebels centre Sione Tuipulotu is considered a lock by most pundits. Now Scotland captain, Tuipulotu missed the Six Nations after tearing a pectoral muscle but is due back on the field shortly. Brumby-turned-Ireland winger Mack Hansen is also a strong chance.\n\nFormer Wallaby and now Scotland flanker Jack Dempsey is an outside shot to win selection, and Canberra-raised Ireland prop Finlay Bealham is also in the conversation. The topic of foreign-born or raised players in the Lions squad is sure to get some airtime in coming months. There could be a record number of Lions players who are eligible for their nations via grandparents or residency: James Lowe (Ire-NZ), Jamison Gibson-Park (Ire-NZ), Bundee Aki (Ire-NZ), Pierre Schoeman (Sco-SA), Duhan van der Merwe (Sco-SA), David Ribbands (Eng-SA) and the aforementioned Aussies. Will there be any bolters? There is always a classic bolter in a Lions squad, and the name on everyone’s lips is Henry Pollock, a flashy young back-rower at Northhampton who has caught fire at exactly the right time.\n\nThe Saints rookie has been scoring tries befitting a winger, and was outstanding in their Champions Cup semi-final win over Leinster last week. Another “bolter” at the centre of much discussion is at the other end of the experience scale: Owen Farrell. Though Farrell retired from Test rugby for England, the 33-year-old is still playing for Racing 92 in France and many believe he will get a call up from coach – and dad – Andy Farrell. Loading",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/womens-state-of-origin-2025-game-two-20250507-p5lx66.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Strange sticks with winning line-up as Blues try to wrap up Origin series",
    "publish_date": "Thu, 08 May 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder"
    ],
    "text": "Blues coach John Strange has backed his winning line-up, naming the same squad of 17 for game two of the women’s State of Origin series that won the series opener in Brisbane last week.\n\nStrange shook up the NSW side for game one, naming four debutants and a new-look spine, but the NSW mentor was vindicated after his team thrashed Queensland 32-12 at Suncorp Stadium.\n\nThe NSW and Roosters coach said he stuck with the same squad for game two at Allianz Stadium next Thursday because of the performance “of all 17 players”, not “necessarily the result”.\n\n“They all had a job to do, that I asked them to do, and I felt like they did that,” Strange said. “As a coach, that’s all you can ask. Whether they win or not, if the players do what you ask, then I was really happy with that ... The most impressive thing for me was the attitude that all 17 girls took out onto the field.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/a-look-inside-the-worlds-only-floating-farm-house-20250508-p5lxl4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A look inside the world's only floating farm house",
    "publish_date": "Thu, 08 May 2025 11:23:37 +1000",
    "category": "finance",
    "authors": [],
    "text": "A look inside the world's only floating farm house\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/unique-homeowner-goes-fishing-from-his-couch-20250508-p5lxl3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unique homeowner goes fishing from his couch",
    "publish_date": "Thu, 08 May 2025 11:23:28 +1000",
    "category": "finance",
    "authors": [],
    "text": "Unique homeowner goes fishing from his couch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  }
]