[
    {
        "url": "https://www.9news.com.au/national/koala-in-pub-kangaroo-island-south-australia/8dd2c6b8-ce58-45df-93e2-61a27a6d4cd0",
        "title": "Unusual customer heads to South Australia bottle shop's beer fridge",
        "publish_date": "Fri, 10 Oct 2025 00:45:11 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Staff and patrons at The Queenscliffe Family Hotel on Kangaroo Island, South Australia were treated to a surprise visit by a very unlikely customer this week: a koala.\n\nFootage of him wandering through the venue attracted plenty of attention online, where it's being doing the rounds on social media.﻿\n\nThe koala wandered in on Wednesday and spent about 10 minutes roaming the aisles, assistant manager Nicole Arthur told 9news.com.au.\n\nA koala wandered into The Queenscliffe Family Hotel on Kangaroo Island this week. (Facebook/The Queenscliffe Family Hotel)\n\n\"It's not unusual to see koalas wandering sort of around the streets in Kingscote,\" she said.\n\n\"He just wandered down the road and then just walked into the front of the bottle shop that's attached to the pub.\"\n\nThe koala appeared to be looking for a cool spot to escape the ﻿sun.\n\n﻿Arthur said the koala wandered into the main area of the bottle shop and parked himself by the fridges for a few minutes.\n\nThe koala appeared to be looking for a place to cool down. (Facebook/The Queenscliffe Family Hotel)\n\nThe koala didn't appear injured or in distress but staff contacted a local vet and wildlife services just to be sure.\n\nThey also provided a bowl of water for the koala to sip on while he was in the store.\n\n﻿\"Somebody from the wildlife group came down and had a look at him,\" Arthur said.\n\n\"Made sure he wasn't in distress, made sure he was OK, and they just left him there.\"\n\nBecause it's so common to see koalas in the trees around ﻿Kingscote, where the pub is located, local patrons didn't make much of a fuss about the koala.\n\nTourists, on the other hand, were delighted at getting to see one of Australia's iconic native animals up close and personal.\n\n\"We just monitored him, made sure they weren't harassing him,\" Arthur said, adding that humans should refrain from touching or interacting with wild koalas.\n\n\"And then he wandered back out.\"\n\nThough it's quite uncommon for koalas to venture into businesses or homes on Kangaroo Island, Arthur said she doubted this will be the last time it happens at ﻿The Queenscliffe Family Hotel.\n\n\"It's just one of those things over here,\" she mused.\n\n\"Nothing's ever normal on Kangaroo Island.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-price-spike-could-cripple-small-jewellery-businesses/f7d8fc78-1ecc-4ead-9486-298156c6dfed",
        "title": "Record high gold prices could cripple Larna and Julie's business",
        "publish_date": "Thu, 09 Oct 2025 23:16:06 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Exclusive: The price of gold has skyrocketed to record highs and for small jewellery businesses like ﻿Larna Cooper and Julie Modica's, it's making it harder than ever to stay afloat.\n\nIn the five years they've been running Juju Gems Jewellery, a boutique store offering hand-crafted and bespoke pieces in Sydney's south, the cost of gold has doubled.\n\nIn the past, they tried to absorb those costs but with the price of gold breaking the $US4000 ($6071) barrier ﻿for the first time this week, that's become impossible.\n\nLarna Cooper and Julie Modica, the women behind Juju Gems Jewellery. (Instagram/@jujugems.jewellery)\n\n\"Jules and I have been in the industry for such a long time, we've been through global financial crises and all these ups and downs, but this is next level,\" Cooper told 9news.com.au.\n\n\"Every week we're checking and the gold price has jumped, and it's just adding a lot of extra work to us and making it really hard for us.\"\n\nGold prices tend to spike in ﻿times of economic turbulence and inflation worries, as it's considered a \"safe haven\" investment separate from national economies – so it's no wonder that ﻿prices are surging now.\n\nAnd while the price hikes are tipped to push Australia's gold earnings to $60 billion in the 2025-26 financial year﻿, it could cripple small businesses.\n\n\"It's getting harder for little boutiques like us and artists who create handmade pieces here in Australia,\" Cooper said.\n\n\"We don't want to send anything offshore, we don't want to get anything mass made, but with the price of gold, it is getting harder and harder, and I think you will probably see some small guys like us really struggling.\"\n\nThis week she and Modica made the decision to only honour bespoke quotes for a week instead of months, as prices change so quickly.﻿\n\nIt's just one of the sacrifices they've had to make to stay profitable.\n\nThe duo have also had to cut down on the amount of gold they use in their jewellery, along with raising the prices on ready-to-wear and custom gold pieces, and constantly repricing their stock to align with the ever-increasing cost of gold.\n\nThe cost of making gold pieces like this has skyrocketed with gold prices. (Instagram/@jujugems.jewellery)\n\n﻿\"At first, we were just absorbing most of the spikes and wouldn't increase our costs,\" Cooper said, but it was costing the business too much in lost profits.\n\nNow they constantly have to check gold prices and adjust their own.\n\nIt's costing them time that could be spent designing and making the jewellery that pays their bills.\n\n\"There's so many struggles with small business right now, and this adds to our daily struggle,\" Cooper said.\n\n\"As a small business, we tend to cut costs by paying ourselves very minimum wages and that hurts, especially with the cost of living ... it does feel like a major setback.\"\n\n﻿The number of customers willing to pay for bespoke jewellery has nearly halved due to financial strain and skyrocketing gold prices.\n\nAnd it's probably only going to get worse in the months and years to come.\n\nSmall businesses like Juju Gems are already struggling with the cost of living - the cost of gold just makes it harder. (Instagram/@jujugems.jewellery)\n\n﻿Cooper and Modica have been in the jewellery industry for about 20 and 40 years respectively and have never seen the price of gold dip by more than a few dollars.\n\nThey don't expect that to suddenly change now.﻿\n\n\"We're not going to hold out for the price to drop, although it would be amazing, I think it's just a pipe dream,\" Cooper said.\n\nGiving up on gold to save the business money isn't an option either.\n\nJuju Gems is all about creating high-quality jewellery pieces that can be passed down through generations and that just can't be achieved with cheaper materials.\n\nSo ﻿Cooper and Modica will just have to keep coming up with ways to adapt.\n\nOne tactic that has been working well for the duo is encouraging customers to trade in their unwanted gold jewellery to lower the cost of creating new gold pieces.﻿\n\nJuju Gems created this custom piece using gold the client had lying around at home. (Instagram/@jujugems.jewellery)\n\n﻿Millions of Australians have gold lying around the house, from family heirlooms to jewellery they just ﻿don't wear anymore.\n\nWhat they may not know is that it could be worth hundreds or even thousands of dollars – provided it's solid gold, not plated.\n\n﻿\"We have women come in who started accumulating jewellery in the '80s and they are sitting on quite a lot of money,\" Cooper said.\n\n\"And what they're getting back in trade-in is significantly more than what they paid for it.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/i-burst-into-tears-the-phone-call-from-a-friend-that-stopped-me-cold/dc1db04a-b3d0-4aa3-8b40-135afd51a492",
        "title": "'I burst into tears': The phone call from a friend that stopped me cold",
        "publish_date": "Thu, 09 Oct 2025 23:56:56 +0000",
        "category": "lifestyle",
        "authors": [
            "Oct"
        ],
        "text": "I remember I was in the car, driving to my sister's house. My phone rang, it was one of my girlfriends.\n\nI answered, chirpy and about to gush about how I'd just met my baby nephew for the first time and was on my way for more cuddles - but the tone of her voice stopped me cold.\n\nShe asked me to call her back once I'd gotten home, not keen to distract me with some bad news while I was driving.\n\nBCNA's new campaign reinforces the importance of taking a look. At every opportunity. (Supplied)\n\nBut I pulled into a service station instead, insisting she tell me then. She broke down as she relayed the news that our beautiful friend Paula, had just been diagnosed with an aggressive form of breast cancer. Time stood still.\n\nI had so many questions but was also completely lost for words. Parked in the middle of a suburban petrol station, I burst into tears, as I tried to digest the devastating news.\n\nPaula had just turned 33, days earlier. She'd just given birth to her first child only months before that. She was healthy, hard-working, the kindest person you'll ever meet. I didn't want to believe it.\n\nShe was too young to have breast cancer! She was still breastfeeding her little girl! She was in the prime of her life! And yet she was now in the biggest fight of her life. It just wasn't fair.\n\nI immediately thought back to my chat with Paula just a few days earlier, when she was telling me about nipple rawness that doctors had linked to general breastfeeding sensitivities.\n\nSince 2000, rates among women aged 30-39 have risen \"modestly\" according to Breast Cancer Network Australia (BCNA), and more \"sharply\" for women aged 40-49. (Supplied)\n\nShe had also, during the last trimester of her pregnancy, felt a lump under her left arm, but doctors thought that it was most likely a blocked milk duct.\n\nMany women will know that lumps and bumps pre and post partum are often attributed to hormonal changes or blocked milk ducts. But this time, Paula had pushed for more tests.\n\nAnd sure enough, that lump proved to be much more sinister - Paula was diagnosed with stage 2, grade 3, aggressive HER2 positive breast cancer. Her newborn bubble had burst.\n\nShe was forced to immediately stop breastfeeding and a whirlwind of further testing began - CT scans, MRIs, surgery to biopsy her lymph nodes and fertility preservation - ahead of a gruelling chemotherapy treatment plan.\n\nShe had chemo for six months - the first three months was brutal, Paula says that part of the treatment is known as \"the red devil\" for its potency.\n\nShe also opted to have cold capping during chemo, a painful process but one that saved about 60 per cent of her hair. Then came months of targeted therapy, followed by the most physically altering process - a double mastectomy.\n\nIt was a four-to-five-hour surgery that included reconstruction and involved a recovery process which prohibited her from picking up her one-year-old daughter for six weeks. My heart breaks just thinking back on it all.\n\nBut thankfully, through resilience, grace, and incredible medical care and guidance, cancer was no match for Paula. After about nine months, and that debilitating treatment process, doctors gave Paula the news we'd all been hoping for - she was clear of cancer.\n\nREAD MORE: ﻿ Routine breast cancer test could be used to screen heart disease\n\nBut thankfully, through resilience, grace, and incredible medical care and guidance, cancer was no match for Paula. (Supplied)\n\nShe still had to complete some treatment, and while any patient with lived experience with cancer will tell you they're never really \"free\", it was the end to a significant and painful chapter.\n\nPaula of course lives with ongoing check-ups and the scars of her double mastectomy. But now, those scars are more a reminder of what she's overcome.\n\nShe's been able to have another child, and restore normality to her life. And now, she's investing her experience into advocacy for future generations of young breast cancer patients. And she's an advocate we desperately need - today, around three Australian women under the age of 40, will be diagnosed with breast cancer.\n\nThe same will happen again tomorrow. And again the following day.\n\nEach year, it's on the rise. Since 2000, rates among women aged 30-39 have risen \"modestly\" according to Breast Cancer Network Australia (BCNA), and more \"sharply\" for women aged 40-49.\n\nThe network says these younger women are more likely to be diagnosed at later stages or with more aggressive disease.\n\nBCNA's new campaign reinforces the importance of taking a look. At every opportunity. (Supplied)\n\nIn Australia, the federal BreastScreen program \"actively invites\" women aged 50-74 to have a free mammogram every two years.\n\nWomen aged 40-49 and 75 or over are instead simply \"eligible\" for a free screening, but need to proactively contact their local service if they wish to book an appointment. In our busy lives, it's not hard to see how something like that might be overlooked.\n\nThat's exactly why BCNA's new campaign reinforces the importance of taking a look, at every opportunity.\n\nThey're asking women to \"Know Yourself. Feel Yourself\", and literally feel around for any inconsistencies when it comes to your breast health.\n\nThey want women to give their breasts the same daily attention we give our faces in the mirror. Think about that - how many hours do we collectively spend cleansing, moisturising, applying make-up, to our faces, every single day.\n\nWhy not spend just a fraction of that time familiarising yourself with your breasts? In the shower, when you're getting dressed, undressed, on the couch watching TV, or while in the kitchen waiting for a meal to cook. Normalise knowing your breasts.\n\nAnd if something feels off, get it checked out. You might just catch something early. And when it comes to a breast cancer prognosis, the sooner it can be treated, the better an outcome might be - just like it was, for my friend Paula.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/laurence-watkins-worlds-longest-personal-name-guinness-world-records/7aac01c0-6c33-4e18-a1ac-0980fd3f6ef2",
        "title": "Laurence won a High Court battle to have the world's longest name",
        "publish_date": "Thu, 09 Oct 2025 19:14:21 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "If you want to address Laurence Watkins by his official government name, it might take you about 20 minutes.\n\nThat's because the Sydney man, originally from New Zealand , holds a unique world record.\n\nAfter a lengthy High Court battle decades ago, the 60-year-old has the world's longest personal name.\n\nLaurence Watkins won a High Court battle to have 2253 names. (Supplied)\n\nWatkins' full name is 2253 words long and it was recognised again by the Guinness World Records after a small change to his 1992 title, revising it from the world's longest christian name to world's longest personal name.\n\n\"I always wanted to be a little bit famous,\" he told 9news.com.au .\n\n\"I read the 1989 Guinness World Records from cover-to-cover and that was really the only record I could have a chance of beating.\"\n\nAt the time in New Zealand, there was no law stopping Watkins from changing his legal name to something absurd.\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nNow, official names usually can't be longer than 70 characters and can't resemble or be an official title or rank.\n\nThat wasn't the case when Watkins first petitioned to have his name changed.\n\n\"I chose Lord, Duke, King and Saint as some of my names, I sort of rubbed it in their faces, and one of the two laws they changed after I won was that you couldn't have a title as your name in New Zealand,\" Watkins said.\n\n\"But my favourite name is AZ2000.\"\n\nHis world record pursuit didn't come without a court date, though.\n\nIt was accepted in the district court but when Watkins went to change his driver's license, the clerk didn't believe him.\n\nWatkins' original passport from 1991 had the extra pages attached. (Supplied)\n\nWatkins was challenged by a registrar to take it to the High Court after he didn't accept his lengthy moniker.\n\n\"He called me frivolous, and he said the only way I would force him to go ahead and register my name is if I took him to the High Court,\" Watkins recalled.\n\nHe did exactly that and walked away with the world's longest name.\n\nWatkins' old passport in New Zealand had an extra six pages attached to it to accommodate for his 2000+ extra names.\n\nAnd his revised birth certificate has another six pages added to the back of it too.\n\nGuinness World Records originally awarded him for 2310 names but was later updated this week to 2253 following a change to the record guidelines.\n\nWatkins said he hoped his newly-revised world record will be in the 2026 Guinness World Records. (Supplied)\n\nThe original world record awarded to Watkins. (Supplied)\n\nEven Watkins can't remember all the names and it took him hours to count them out.\n\nTo give you a taste: it's in alphabetical order and his name starts as Laurence Alon Aloys Aloysius Alphege Alun Alured Alwyn Alysander Ambie Ambrose.\n\nAnd it goes on.\n\n\"I'm hoping it will be in next year's [Guinness] book, unless somebody in the world beats me in the meantime,\" Watkins said.\n\n\"Even if I lose the world record, nobody in New Zealand can beat my record, because of the law change.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ferrari-electric-car-maranello-launch-trevor-long/9617d905-c31e-4ee9-8e92-6cbb2dd3295f",
        "title": "Ferrari goes electric with new car but promises same driving thrills",
        "publish_date": "Thu, 09 Oct 2025 08:30:03 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Italy: By now, it's common for almost every traditional car brand to have some sort of offering in the electric car market in Australia.\n\nWhile EVs make up just 10 per cent of all new car sales, and growing slowly, the introduction of an electric model can bring new customers to a brand and create a new experience for existing owners.\n\nHowever, many people might be shocked to hear that Ferrari is launching their own full electric car next year.\n\nFerrari's chief product development officer Gianmaria Fulgenzi stressed the importance of the announcement. (Nine)\n\nFar from a traditional new car launch, Ferrari's gathering of the world's media at their factory in Maranello, Italy revealed only the direction the company was taking as well as the raw and bare underpinnings of the future electric car - the chassis.\n\nThe first of three steps toward revealing the car itself somewhere mid-way through next year, today's event was about setting a benchmark for what to expect, and also creating some certainty for fans of the brand that this new EV would indeed be every bit as Ferrari.\n\nSpeaking exclusively to 9News, Ferrari's chief product development officer Gianmaria Fulgenzi stressed the importance of this announcement, saying \"it's a new chapter of our history\".\n\n\"It's a very important day for us,\" Fulgenzi said.\n\n\"Let me say an historic day, because we wanted to continue our electrification journey starting many years ago.\"\n\nFerrari revealed only the direction the company was taking as well as the raw and bare underpinnings of the future electric car. (Ferrari)\n\nThat journey, as he outlines, took the company from their electrified Formula One cars, into road cars like the LaFerrari, SF90 and others which feature hybrid electrified powertrains to today.\n\n\"We wanted to complete this electrification journey to develop a completely new car,\" Fulgenzi said.\n\n\"Also to enlarge the customer base for our car.\"\n\nThere is no question, though, that petrol-powered internal combustion engines will continue to be part of the Ferrari line-up for a long time to come.\n\nAs Fulgenzi put it, Ferraris will be \"not all electric, but also electric\".\n\nWhile announcing this Ferrari Elettrica, the company was at pains to point out its deep knowledge of what makes a car feel great to drive - what it is that creates the thrill of driving that Ferraris are known for.\n\nIn fact, they know it, and spell it out well: sound, gear change, braking, lateral and longitudinal acceleration.\n\nThe car itself will be revealed somewhere mid-way through next year. (Ferrari)\n\nSo can an electric car replicate all these sensations?\n\nFulgenzi says: \"It's not only an electric car, it's a Ferrari.\"\n\nSimple as that.\n\n\"First of all. First and foremost, it's a Ferrari.\n\n\"What does it mean? What does it mean that the car that has an electric powertrain, but that creates the same emotion of the other Ferrari cars.\"\n\nThere's a real emotive sense to Fulgenzi's passion for this brand and this upcoming car, based around that driving experience.\n\n\"Driving thrills are something that starts in the brain, explode in the heart, creating butterflies in the stomach, and create a very big smile in the face when you drive the car and push you and your companion or your family to use the car massively every day, every moment, because using the car, you enjoy yourself.\"\n\nLike other Ferraris before it, over decades, the all-electric Ferrari will be born in Maranello, Fulgenzi pointing out the significance of this.\n\nThe announcement created some certainty for fans of the brand that this new EV would indeed be every bit as Ferrari. (Ferrari)\n\n\"We are very proud to say that every core components are thought, developed and produced in-house,\" he said.\n\n\"Because like we have done in the last 78 years for the internal combustion engine that we produce, we think, we develop, we test our internal combustion engine in-house - and also for the electric components.\n\n\"For the inverter, for the battery system these components, the key components for the electric cars.\n\n\"So we want strongly to develop them in-house and to keep them in-house, to pursue the excellence and also to guarantee the usability for the car also for the future.\"\n\nI witnessed the very factory floor where the battery is being assembled from raw battery cells, where electric motors are built, paired with gearing and placed into assemblies forged within a few kilometre radius of each other - all by Ferrari.\n\nWe won't see this new electric car until half-way through next year, but here's what we can surmise based on what we've heard thus far.\n\nThe Ferrari Elettrica will be a new model and carry a new name.\n\nIt will also be an SUV body shape, perhaps similar to the Purosangue which is on the roads today.\n\nAnd it will be fast, very fast.\n\nA top speed of 310km/h, accelerating from zero to 100km/h in just 2.5 seconds.\n\nA 122kWh battery will provide at least 530km of range and four motors will power each of the wheels independently, each of which can also steer with the front wheels able to be disconnected from the drivetrain in search of range on open highway driving.\n\nThe specifications look fantastic, and if the company can deliver on the exterior design in the same way they have the underlying technology, then we're in for something very special.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/pauline-hanson-shopping-bags-paper-plastic-woolworths-australia/b95b692c-d76f-4ee6-8c1c-6eeaa54e8279",
        "title": "Woolworths pushes back on Pauline Hanson's paper bag claims",
        "publish_date": "Thu, 09 Oct 2025 02:49:46 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "One Nation Senator Pauline Hanson has called for major supermarkets to bring back plastic bags, despite them being banned across the country.\n\nThe Queensland senator posted a video to her social media pages, which showed her holding a broken Woolworths paper bag with some items inside.\n\nIn the video, Hanson claimed the bags were of poor quality, and expressed frustration at the 25c it costs to buy them at Woolworths.\n\nIn the video, Hanson held a broken paper shopping bag from Woolworths. (Facebook/Pauline Hanson )\n\n\"You buy these cheap, rubbish bags that split and break on you all the time,\" she said.\n\n\"I'm over it, I'm so angry about this.\n\n\"And 25c a bag!\"\n\nShe also called for the return of plastic bags to major supermarkets, writing: \"Bring back the trusty plastic bags.\"\n\nPlastic bag ban decisions are made by states and territories instead of the federal government, but every state and territory has now banned lightweight plastic bags.\n\nColes and Woolworths also voluntarily got rid of plastic bags in 2018, charging a small sum for shoppers to use reusable bags.\n\nHowever, Hanson claimed such a charge in a cost-of-living crisis was unfair on Australians.\n\n\"You charge a fortune for it, cost of living, people can't afford it, and it's ridiculous,\" she said.\n\n\"I'm sure you're making a fortune out of it.\"\n\nA spokesperson for Woolworths told 9news.com.au a range of bags are available for customers, and disputed Hanson's claims of poor quality.\n\n\"﻿Our paper bags have been available for customers since 2020 and while we continue to provide a wide range of shopping bags for our customers, we ultimately want to sell less of them,\" they said.\n\n\"Woolworths paper bags are regularly tested to carry up to 6kg, and are easily recycled at home in kerbside recycling bins.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/judge-dismisses-drake-lawsuit-kendrick-lamar-not-like-us/105876144",
        "title": "Judge dismisses Drake's lawsuit over Kendrick Lamar diss track",
        "publish_date": "Fri, 10 Oct 2025 01:40:51 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A defamation lawsuit that Drake brought against Universal Music Group (UMG) has been dismissed by a US judge, who says lyrics branding the superstar as a paedophile in Kendrick Lamar's song Not Like Us are opinion.\n\nJudge Jeannette A Vargas rejected the suit, beginning her judgement by citing \"the vitriolic war of words\" that erupted in spring 2024, and saying the case arose \"from perhaps the most infamous rap battle in the genre's history\".\n\nThe case stemmed from a feud between Drake and Lamar, which began heating up last year and culminated with the release of Lamar's Not Like Us.\n\nThe track became one of 2024's biggest songs, which won record of the year and song of the year at the Grammys, got the most Apple Music streams worldwide and helped make this year's Super Bowl half-time show the most-watched ever.\n\nMs Vargas said a reasonable listener could not have concluded that Not Like Us was conveying objective facts about Drake.\n\n\"Although the accusation that the plaintiff is a paedophile is certainly a serious one, the broader context of a heated rap battle, with incendiary language and offensive accusations hurled by both participants, would not incline the reasonable listener to believe that Not Like Us imparts verifiable facts about the plaintiff,\" she wrote.\n\nThe judge noted that Drake and Lamar both have recording contracts with UMG.\n\nA spokesperson for Drake said the rapper planned to appeal the ruling.\n\n\"We look forward to the Court of Appeals reviewing it,\" the spokesperson said.\n\nLamar has not publicly responded to the ruling via his social media accounts.\n\nKendrick Lamar performs not Like Us at this year's Super Bowl half-time show. (AP: Matt Slocum)\n\nWho is Not Like Us about?\n\nKendrick released Not Like Us about Drake amid a flurry of insult songs — better known as a \"diss tracks\" — between the artists.\n\nWhat did Kendrick Lamar say about Drake?\n\nLamar's song called out the Canadian-born Drake by name and disputed his authenticity.\n\nIt attacked him as \"a coloniser\" of rap culture who's \"not like us\" in Lamar's home turf of Compton, in the US state of California, and, more broadly, West Coast rap.\n\nNot Like Us also makes insinuations about Drake's sex life, including, \"I hear you like 'em young\" — implications that he rejects.\n\nHere's a snippet of the lyrics:\n\n\"Say, Drake, I hear you like 'em young \"You better not ever go to cell block one \"To any b**** that talk to him and they in love \"Just make sure you hide your lil' sister from him \"They tell me Chubbs the only one that get your hand-me-downs \"And PARTY at the party playin' with his nose now \"And Baka got a weird case, why is he around? \"Certified Lover Boy? Certified paedophile…\"\n\nWhy did Drake sue Universal Music?\n\nFiled in January, Drake's lawsuit alleged UMG intentionally published and promoted the track despite knowing it contained false and defamatory allegations against Drake and suggested listeners should resort to vigilante justice.\n\nThe lawsuit also alleged that the track tarnished his reputation and decreased the value of his brand.\n\nLamar was not named in the lawsuit.\n\nDrake claimed the song amounted to \"falsely accusing him of being a sex offender, engaging in paedophilic acts\" and more.\n\nHe also blamed the tune for attempted break-ins and the shooting of a security guard at his Toronto home.\n\nDrake's mansion was depicted in an aerial photo in the song's cover art.\n\nThe digital cover art for Not Like Us. (Deezer)\n\nNot Like Us became a 'cultural sensation'\n\nMs Vargas said in her opinion Thursday that Not Like Us \"dealt the metaphorical killing blow\" in the feud between the two artists.\n\n\"The song contains lyrics explicitly accusing Drake of being a paedophile, set to a catchy beat and propulsive bassline,\" she said.\n\n\"Not Like Us went on to become a cultural sensation, achieving immense commercial success and critical acclaim.\"\n\nWhy Drake and Kendrick Lamar's feud is great for rap Photo shows A fiery graphic reads \"VS\" with an image of Drake on the left and Kendrick Lamar the right Why are rap's biggest names fighting? And why is that good business for everyone involved? Here's your answers.\n\nPrior to that, the judge noted as she summarised the back-and-forth insults, Drake mocked Lamar's height and shoe size and questioned his success in an April 2024 track called Push Ups, while Lamar insulted Drake's fashion sense that same month in Euphoria.\n\nFrom there, Ms Vargas wrote, the insults escalated and become \"vicious, personal\".\n\nJudge says Not Like Us is opinion\n\nThe judge said in making her decision, she considered the forum in which the insults occurred and concluded that the average listener was \"not under the impression that a diss track is the product of a thoughtful or disinterested investigation, conveying to the public fact-checked verifiable content.\"\n\nMs Vargas wrote that Not Like Us was \"replete with profanity, trash-talking, threats of violence, and figurative and hyperbolic language, all of which are indicia of opinion.\"\n\nA reasonable listener, she added, \"would conclude that Lamar is rapping hyperbolic vituperations\".\n\n\"In the context of this rap diss battle, no reasonable person would listen to Not Like Us and assume that Lamar uniquely had access to credible, provable facts that revealed Drake to be a paedophile,\" she wrote.\n\nThe real winners in Drake vs Kendrick Photo shows A composite image of the rappers Kendrick and Drake both rapping into microphones. Kendrick Lamar and Drake's intense feud risks commodifying and objectifying black people, argues hip-hop scholar.\n\nUniversal 'pleased' with outcome\n\nUMG, which is the parent record label for both artists, denied the allegations in the lawsuit.\n\n\"From the outset, this suit was an affront to all artists and their creative expression and never should have seen the light of day,\" UMG said in a statement.\n\n\"We're pleased with the court's dismissal and look forward to continuing our work successfully promoting Drake's music and investing in his career.\"\n\nABC with AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/matildas-confirm-return-of-sam-kerr/105875916",
        "title": "Kerr's return confirmed, Matildas name squad for England and Wales matches",
        "publish_date": "Fri, 10 Oct 2025 01:24:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sam Kerr is back in the Matildas squad for the first time since late 2023, ahead of friendlies against Wales and England.\n\nCortnee Vine and Katrina Gorry also feature in a 24-player squad announced on Friday.\n\nKerr last played for Australia in November 2023, then endured a horror rehabilitation from an ACL tear suffered at a Chelsea training camp in January 2024.\n\nThe superstar striker returned for the Blues last month, scoring her 100th goal for the club in her first game back.\n\nSam Kerr back in Champions League Photo shows Sam Kerr heads the ball as a goalkeeper tries to save. Australian striker Sam Kerr makes another appearance for Chelsea off the bench, getting 23 minutes of playing time but unable to break a 1-1 deadlock with their Dutch opponent.\n\n\"Having Sam back in the squad is a special moment — not just for the team, but for Australian football,\" Matildas coach Joe Montemurro said in a statement.\n\n\"Her leadership and presence are invaluable as we continue building toward the AFC Women's Asian Cup 2026 and beyond.\"\n\nVine, the penalty shootout hero for Australia at the World Cup, is in the national squad for the first time since the Paris Olympics.\n\nA mental health break, injuries and a difficult start to life in the NWSL with North Carolina Courage had kept her out of the Matildas.\n\nGorry is due to play for the first time under Montemurro, after missing his first window through personal leave.\n\n\"The squad showcases the depth we are looking to build, by utilising experienced players who continue to set high standards alongside the next generation of Matildas players,\" Montemurro said.\n\n\"It will be Australia's first time competing against Wales and there is a competitive history with England, so both games will provide different challenges to test the team, our playing style and the way we play together.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAustralia will play Wales at Cardiff City Stadium on October 25 (local time) and England at Derby's Pride Park three days later.\n\nKerr, 32, has been on limited minutes at Chelsea and is likely to be gradually introduced in those games.\n\nShe previously joined Matildas camps in a non-playing capacity as part of her rehabilitation.\n\nIt is unclear whether Kerr will retain the captaincy, with Steph Catley donning the armband during her absence with aplomb.\n\nForward Mary Fowler (ACL) and midfielder Tameka Yallop (hamstring) remain unavailable.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/albanese-plays-down-treasury-request-superannuation-tax/105875570",
        "title": "PM denies going over Chalmers' head to revisit superannuation tax",
        "publish_date": "Fri, 10 Oct 2025 01:07:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese's request for Treasury to examine a controversial proposal to lift taxes on some superannuation balances is \"nothing unusual\" the prime minister says, rejecting claims he is planning to rewrite it.\n\nThe prime minister said a meeting on the tax policy, which was meant to have begun several months ago, was not out of the ordinary.\n\n\"No, there are no policy changes, our policy stands. There is nothing unusual,\" Mr Albanese said.\n\n\"We receive briefings on policy all the time, as you expect the prime minister's office to do. There's nothing unusual about that.\"\n\nTreasury officials admitted yesterday the prime minister's office met with the department to discuss the government's proposal to raise the tax on superannuation earnings — a policy that would normally be the responsibility of Treasurer Jim Chalmers.\n\nMr Albanese denied he had gone over the treasurer's head.\n\nThe department said it was examining options to address concerns around the tax proposal.\n\nBefore the federal government announced a backflip on stage three tax cuts last term, the prime minister and treasurer repeatedly said there was \"no plan\" to amend the tax cuts.\n\nIn the weeks before that backflip, it was leaked that Treasury had been asked to model possible changes to those tax cuts.\n\nTax increase put on ice\n\nThe federal government proposed last term to double the tax on superannuation balances above $3 million, lifting the tax rate on earnings from 15 to 30 per cent.\n\nThe change was planned to take effect from July 1 this year, and raise about $2 billion a year.\n\nHow does Labor's new super tax work and why is it controversial? Photo shows A close-up of Jim Chalmers in front of a black background. The proposal to tax earnings for super balances over $3 million, including on unrealised gains, is the subject of renewed controversy following the federal election.\n\nBut it has been met with internal resistance inside Labor, and criticism from party elders including former prime minister Paul Keating, who suggested the average young person today would be hit by the tax increase by the time they retired if it was not changed.\n\nMore than two years on, the legislation is yet to be seen.\n\nOne of the key criticisms is that because the higher tax rate is not indexed, more people will be captured by it over time due to inflation.\n\nIt would also apply to unrealised capital gains, like increases in the value of assets like property, which critics say could expose some savers to a higher tax rate even if they do not technically have access to those earnings.\n\nThere is concern the changes could undermine confidence in the superannuation system, if it was perceived that long-term savings plans could be meddled with by future governments.\n\nTreasurer Jim Chalmers argues the change affects only about 80,000 of the wealthiest Australians, and that the threshold could be adjusted in the future to account for bracket creep, as happens with income tax.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/cairns-facing-water-restrictions-wettest-time-year/105874192",
        "title": "One of the wettest cities faces water restrictions at wettest time of year",
        "publish_date": "Fri, 10 Oct 2025 01:00:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Stricter water restrictions could be on the cards for one of Australia's wettest cities as it heads into its wettest time of the year.\n\nCairns Regional Council is pleading with residents to reduce water use as it scrambles to fix major infrastructure failures at three local reservoirs.\n\nTwo water storage facilities are offline due to structural issues, while the city's largest reservoir is operating at just 60 per cent of its usual capacity after it sprang a leak.\n\nCouncil CEO Ken Gouldthorp said heavy rainfall typically forced the council to switch off its water treatment plants on certain occasions each summer because of turbidity problems.\n\n\"It's important that we really manage demand when that occurs,\" he said.\n\n\"Otherwise, we'll run out of potable water, or we'll reduce our pressure to a point that some people will not have a water supply, and we don't want to get to that stage.\"\n\nThe council wants to bring the city's daily water use down to about 70 megalitres. (ABC News: Conor Byrne)\n\nCr Gouldthorp said the three damaged water storages were \"very large … and their particular location and purpose in the system make them critical\".\n\nWater security in balance Photo shows A wide elevated image of a city centre intersection in Cairns Cairns needs tens of millions of dollars to shore up its security of drinking water, but advocates say the city also needs to look at ways to reduce the amount of water being used.\n\n\"We are doing our best to bring at least one of those back online by mid-December,\" he said.\n\nThe council first flagged the prospect of having to enforce level-one water restrictions before the end of the year, a fortnight ago.\n\nBut citywide water consumption has not reduced since then, with daily use peaking last Friday at 87 megalitres.\n\nCr Gouldthorp said the goal was for Cairns to limit its water use to about 70ML a day, particularly during wet weather.\n\nA wetter summer ahead\n\nThe council's edict to reduce water use comes as the Bureau of Meteorology's latest long-range outlook forecasts a wetter and hotter summer than last year for Far North Queensland.\n\nThe signal for above-average rainfall in November has also strengthened.\n\nPermanent water restrictions are in place across Cairns, limiting the use of sprinklers to certain days and times.\n\n\"The awareness of those water restrictions, I think, has dropped off, and we need people to know about it and adhere to them,\" Cr Gouldthorp said.\n\nHe said there was a \"real and genuine risk\" the council would need to introduce tougher restrictions if heavy rain forced it to switch a treatment plant off.\n\n\"We don't want to go there — our preference is to gain cooperation from the community,\" he said.\n\nKen Gouldthorp is urging residents to curb water use. (ABC News: Christopher Testa)\n\nMaintenance decisions questioned\n\nThe council is in the process of building a new water intake and treatment plant to bolster its potable water supply.\n\nIt has received $390 million in state and federal funding for the $472 million project, due to be completed next year.\n\nBut critics of the council say the current issues are a result of chronic underinvestment in the maintenance of existing infrastructure.\n\nRichie Bates, a former Cairns councillor who chaired a water committee, said there had been past failures to address problems that had been flagged as \"high priority\".\n\nCairns state MP Michael Healy said there were \"legitimate questions to ask\" about infrastructure maintenance.\n\n\"That is the sole responsibility of the regional council, and I, like anybody, get a little concerned when our water — treatment plants have to be turned off because of heavy rain,\" he said.\n\nCr Gouldthorp said criticism of the council's track record on maintenance was \"harsh\".\n\n\"Council has invested extensively in the water security stage one project, but we've been nursing our system through and maximising its potential use while that is being built,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/synergy-overcharged-customers-40-million-perth-wa-electricity/105876426",
        "title": "Synergy apologises after overcharging customers $40 million in power bills",
        "publish_date": "Fri, 10 Oct 2025 00:50:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 170,000 customers have been overcharged a total of $40 million by WA's state-owned energy retailer Synergy since 2009, it has been revealed.\n\nThe overpayments range from amounts under a dollar, to thousands of dollars, according to Synergy CEO Kurt Baker, who said most of those affected were residential customers.\n\n\"We've accepted payments to approximately 170,000 closed accounts, resulting in overpayments,\" he told ABC Radio Perth.\n\n\"In many cases this has happened because Synergy's allowed customers to continue to pay to their closed account, even in the absence of a bill.\"\n\nSynergy later clarified that close to 174,000 customers had been affected.\n\nRefunds to take months\n\nMr Baker said Synergy would contact customers directly to issue refunds, but the process was likely to take several months.\n\n\"This isn't good enough, it's not acceptable, we've let our customers down, so I do want to apologise,\" he said.\n\nSome 170,000 Synergy customers have been overcharged tens of millions of dollars altogether. (ABC News: James Carmody)\n\n\"Our systems should have identified or stopped these payments being made.\"\n\nIt comes after a report by the state's economic watchdog in July found Synergy had taken $2.29 million in automatic deductions from Centrelink payments from customers whose Synergy accounts were closed, since 2009.\n\nWhat is Synergy? Synergy is government-owned and WA’s largest electricity generator and gas retailer. It provides 52 per cent of electricity to households and businesses in the South West Interconnected System. The system covers Perth and extends from Kalbarri in the north, east to Kalgoorlie and south to Albany. Source: Synergy website\n\nSynergy's new figures, which Mr Baker said were uncovered by a \"comprehensive review\" following July's revelations, vastly eclipse the extent of overcharging previously uncovered.\n\n\"The total value across the 170,000 accounts is approximately $40 million,\" Mr Baker said.\n\n\" The average amount is $230. More than half is less than $100. \"\n\nSynergy said it had since implemented measures to identify when overpayments were made to closed accounts.\n\nIt said it was working with the state government's independent reviewers to identify potential improvements to its system.\n\nLack of trust\n\nWA's Shadow Energy Minister Steve Thomas said Synergy's overcharging fiascos had eroded public trust in the utility.\n\nSynergy provides 52 per cent of electricity to customers in the South West Interconnected System. (ABC News: Glyn Jones)\n\n\"The first question is how on earth does a closed account accept payments? Once you close your account, your account should be closed,\" he told ABC Radio Perth.\n\n\" That should be an absolute red light. \"\n\n\"How do people trust Synergy to get their bills right?\n\n\"Twice now this year, it's been proved that that trust is misplaced.\"\n\nLoading\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/downsizers-hampered-by-shortage-of-small-homes/105874408",
        "title": "Shortage of smaller homes a challenge for would-be downsizers",
        "publish_date": "Fri, 10 Oct 2025 00:04:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gary, who lives in the affluent Perth suburb of Wembley, summed up the dilemma of many retired would-be downsizers at an ABC Radio Perth live radio forum.\n\n\"I live in a five-bedroom house with just my boomerang son, who keeps leaving and coming back,\" he said.\n\n\"I have a hobby that requires a yard.\n\n\"I'd be happy with a two-by-one, but there just aren't any where I want to live.\n\n\" We don't all want to live in an apartment. I'd like to stay in my area, so I guess I'll just be staying put. \"\n\nLoading...\n\nHis experience was emblematic of the dilemma many older people face.\n\nThey have a large family house, long after the kids have grown up and left home, with more bedrooms than they need but with deep connections in their suburb, and few smaller homes to downsize to.\n\nMany bedrooms, too few houses\n\nA recent report by property data firm Cotality found that 61 per cent of households in Australia contain just one or two people, yet most of the housing is built for larger families.\n\nIt found 76 per cent of housing has three or more bedrooms, and just 18 per cent are two-bedroom dwellings.\n\nProperty investment advisor Damian Collins told the forum, \"we don't have a shortage of bedrooms, we have a shortage of houses\".\n\nMost houses built in Perth have at least three bedrooms, as that is more profitable for developers, architect Michelle Blakely says. (ABC News: Gian De Poloni)\n\nIn some areas of Perth, people wanting to downsize while staying in the same neighbourhood face almost no options.\n\n\"For example, in Lesmurdie [in the Perth foothills] in the last 12 months, there have been 113 house sales, and just one unit sold,\" Mr Collins said.\n\n\"And that's not because there's not demand for it, there's just no stock.\n\n\"There are dozens of suburbs across Perth where we just don't have that choice, and 80 per cent of people, when they downsize, they want to stay in their local community.\n\nMr Collins said while the issue was reflective of Australia's current housing crisis, there had also been long-term resistance from many local communities to building medium-density housing.\n\n\"In City Beach, a number of years ago, they were going to bring in duplexes — or maisonettes — on corners, and there was a mini revolution at the community level. They didn't want that,\" he said.\n\n\"I think as a community, if we're going to embrace downsizing and housing diversity, we have to allow that choice of housing in each community.\"\n\nTownhouses, like these homes built on 80 square metres at Ellenbrook, north of Perth, are a rare sight in Perth's suburbs. (ABC Radio Perth: Emma Wynne)\n\nBuilding industry preferences\n\nArchitect Michelle Blakeley said there was also a lack of support from builders and developers for smaller townhouses and units.\n\n\"You go onto the websites of any of the big builders, and you will only find three-bedroom, two-bathroom, games room, computer room houses with a double garage under the main roof,\" she said.\n\n\"We've actually spoken to some of the bigger builders about coming down to a two-bedroom, one bathroom house. They're just not interested.\n\n\"And people are reluctant to buy a two-bedroom, one bathroom house, because they've been convinced that it's a better investment to have a three-bedroom.\"\n\nAsset-rich, cash-poor\n\nFor many would-be downsizers, the sale of the family home would involve buying another home and paying stamp duty. Then, any cash leftover from the sale would be considered in the pension assets test, potentially reducing a retiree's payments.\n\nFor Don from Maylands, it's an impossible equation.\n\n\"We've been looking for a couple of years at the options for downsizing,\" he told the panel.\n\n\"And every single time we come up against a financial barrier that says, no, it's not worth our while to do it.\n\n\"That's irrespective of availability, or any of the other constraints that are in there. That financial cost of moving from one place to another is just prohibitive.\"\n\nThe audience listens and asks questions at the ABC Radio Perth Mornings Spotlight forum on downsizing. (ABC News: Emma Wynne)\n\nMark Kinsella, chief executive of the Council on the Ageing WA, said it was a common story.\n\n\"I went and saw a guy the other day. He's living in a $2 million property, beautiful home,\" Mr Kinsella said.\n\n\"It's been his family home for 30 years, but he's on a full pension. He's broke. He has no money, very little superannuation, and he's barely limping by.\n\n\"And he said to me: 'If I were to sell this property, I would lose it all. I'd lose all my pension. I'd have to go and find somewhere to live and that would be really hard for me. I would pay stamp duty. I would pay all these costs.'\"\n\nAdvice to plan early\n\nBut Mr Kinsella cautioned against simply deciding that downsizing was too hard, stressing it was better to plan for your needs in old age early, before the situation became a crisis.\n\n\"I think it's really important that your home meets your needs as you age,\" he said.\n\n\"Ask yourself, are you in an environment that you're safe in? Is it going to meet your caring needs?\n\n\"What breaks my heart is we hear from older people all the time who have stayed in their home, I believe, too long, and then their needs change and they can no longer stay in that home, and the family is then forced to do a fire sale of their property.\n\n\" Choose something that's going to work for you now, so you can age in your new home, rather than family making this decision when someone's in a hospital bed and they've got very few options. \"\n\nHe said deciding while still well gave people time to figure out their options.\n\n\"Many older people maybe haven't been in the property market for 30 years,\" he said.\n\n\"Start to get yourself familiar with how the property market works, hearing what agents are good to work with, what developers are good to work with, who you want to trust, and start that conversation.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/pfas-contamination-rockhampton-airport-concerns-for-properties/105830932",
        "title": "Landowner says PFAS contamination knocked $400,000 off property value",
        "publish_date": "Thu, 09 Oct 2025 23:31:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Christine Stasch purchased her country property in central Queensland, she was lured by its natural beauty and picturesque surroundings for her children and grandchildren to be raised on.\n\nFrom running livestock to growing fruit and vegetable crops, it has been a peaceful way of life for her family for nearly 20 years.\n\nBut Ms Stasch's property is now at the centre of a battle with authorities for compensation after discovering per- and polyfluoroalkyl substances, known as PFAS, in soil and groundwater on her rural paradise.\n\nThe property at Pink Lily, a small rural locality on the outskirts of Rockhampton, shares a common boundary with the city's airport, where firefighting foams containing PFAS were used over several decades.\n\nChristine Stasch's Pink Lily property backs onto the Rockhampton Airport. (ABC Capricornia: Aaron Kelly)\n\nA federal parliamentary inquiry is investigating whether urgent remediation is needed.\n\nMs Stasch said she purchased her irrigated property in 2006 and lived there until 2023.\n\nIt is now being rented, although Ms Stasch is hoping to sell.\n\n\"I was contacted by Airservices Australia in January 2024, who stated that they suspected that my property had been contaminated with PFAS that had leached from the fire training site,\" she said.\n\n\" They asked if they could run tests on the water and soil at that time, and as I had tenants living on the property, I felt obligated to get the tests done. \"\n\nResults from samples collected confirmed PFAS in the groundwater and soil. (ABC Capricornia: Aaron Kelly)\n\nAirservices Australia is a government-owned organisation funded by the aviation industry.\n\nMs Stasch said multiple tests were completed in March 2024 and confirmed her property and groundwater had varying \"unacceptable levels\" of PFAS contamination, above the current national guidelines.\n\nProposed remediation works\n\nLast month, Ms Stasch appeared before a Parliamentary Standing Committee on Public Works for a public hearing in Rockhampton, along with representatives from Airservices Australia, to be heard alongside other submissions, including from federal Member for Capricornia Michelle Landry.\n\nThey were told the total estimated cost of the proposed remediation works at the former site — a non-operational area of the airport — was $24.975 million, which included an ongoing monitoring program.\n\nAirservices Australia holds the lease for the site at Rockhampton Airport and is working to develop a remediation plan. (ABC Capricornia: Aaron Kelly)\n\n\"Airservices Australia continues to work with Rockhampton Airport and relevant authorities to investigate and appropriately manage legacy PFAS impacts at our leased sites at the airport,\" an Airservices Australia spokesperson said.\n\n\"Should the committee approve the proposal, Airservices will begin remediation works immediately.\"\n\nNo date has been given for when the committee will release the report.\n\nMs Landry said the residents of Pink Lily were rightly alarmed by the serious and lasting effects of PFAS contamination.\n\nMichelle Landry says families already grappling with the uncertainty of contamination are facing financial and emotional strain. (ABC Capricornia: Aaron Kelly)\n\n\"There needs to be some serious thought about compensation [from Airservices Australia] for these people,\" she said.\n\n\"But I also think that we need to be looking further afield of how far this [PFAS contamination] has gone and how much land's been affected by this and also our waterways.\"\n\nAnswering your PFAS questions Photo shows A man in a laboratory wearing a white jacket and safety glasses with a device in his hand As Australians figure out how to live with so-called \"forever chemicals\", we've asked leading PFAS experts to help us understand the risks.\n\nMs Stasch said the value of her property had fallen by nearly $400,000 since the discovery of the contamination.\n\n\"I got an independent valuer who valued the property, as it is, in current market in August last year and they valued it at $610,000 at that particular time,\" she said.\n\n\"But with the PFAS [testing] report, they felt that it was worth only about $215,000.\n\n\" Personally, I may have to abandon my retirement plans. \"\n\nThe Stasch family had livestock and shared many special memories over the years at their Pink Lily home. (Supplied: Christine Stasch)\n\nMs Stasch now lives in Mareeba, in far north Queensland, where she plans to retire.\n\nShe said aside from the falling value of her property, the stress of having to fight for compensation was taking a toll on her health.\n\nIn a statement, Airservices Australia said it would not comment on individual matters, but accepted that people had concerns if they lived near airports where PFAS had been used.\n\nStudies show PFAS does impact human health\n\nWhile Ms Stasch had a dedicated drinking tap and water tank for her family and now tenants, groundwater was run through the house before she was notified about the possible PFAS contamination.\n\n\"Over the years, I have run livestock on the property and irrigated the pastures with the water from the bore,\" she said.\n\n\"It was in the kitchen for washing dishes and cleaning vegetables or whatever needed doing.\"\n\nNew water tanks were installed on Ms Stasch's property after the detection of PFAS. (ABC Capricornia: Aaron Kelly)\n\nMs Stasch said following the PFAS testing, Airservices Australia offered to provide household water tanks, which it had done.\n\nShaneel Chandra, a senior lecturer in chemistry at CQUniversity, said PFAS was used in firefighting foam for decades and is also commonly found in household items such as non-stick cookware and cleaning products.\n\nDr Chandra said the durability of PFAS, commonly referred to as \"forever chemicals\", meant it could persist in the environment for a long time, including in humans and animals.\n\nShaneel Chandra says PFAS chemicals are known for their ability to effectively resist heat, stains, grease and water. (Supplied: CQUniversity)\n\n\"If PFAS comes in contact with water, that water becomes an agent for the PFAS molecules to spread in other places,\" he said.\n\n\"So, water is really the medium by which PFAS gets transported over wider, bigger areas, like in this case.\"\n\nDr Chandra said the potential impacts on human health had been the subject of extensive research over the years.\n\n\"These studies show there are definite impacts in humans, including impacts on the immune system, high cholesterol, it impacts the liver, and is also seen as a possible cancer risk,\" he said.\n\nLandholders like Christine Stasch want urgent government action taken. (ABC Capricornia: Aaron Kelly)\n\nMs Stasch wishes she had known about the contamination earlier.\n\n\"If I had been informed earlier, I'm certain that it would have made a huge difference to how I used the water,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/epa-closes-in-on-businesses-over-disturbing-humming-noise-sydney/105870234",
        "title": "Sydney industrial sites ramp-up noise monitoring over humming sound",
        "publish_date": "Thu, 09 Oct 2025 23:15:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Two industrial businesses in Sydney's north-west will be required to ramp-up noise monitoring after the NSW environmental watchdog identified them as the potential sources of a disturbing humming sound.\n\nResidents in Ermington and Rydalmere have been kept awake at night by a low humming sound for the last few months.\n\nBuilding material suppliers Knauf and James Hardie, which both have facilities in Camellia, were identified as being the potential sources of the noise.\n\nKnauf's Camellia plant will be required to do more noise testing for the NSW EPA. (ABC Radio Sydney: Declan Bowring)\n\nStephen Beaman from the NSW Environment Protection Authority (EPA) told ABC Radio Sydney the companies would be required to engage an independent noise expert to help find the noise and identify solutions.\n\n\"Following our investigations [the EPA] issued some legally-binding conditions on two companies out of the Camellia peninsula,\" Mr Beaman said.\n\n\"Those conditions require them to engage an independent noise expert to thoroughly go through each facility and look for potential sources of noises and come up with remedial strategies to address it.\"\n\nA James Hardie premises is one of two businesses identified as the potential source of the disturbing noise. (ABC Radio Sydney: Declan Bowring)\n\nMr Beaman said the EPA matched the pitch and loudness of the Rydalmere noise to that coming from the Camellia premises.\n\nHe says both businesses have accepted the noise assessment requirement.\n\n\"So far the businesses have been cooperating,\" Mr Beaman said.\n\nThe businesses will have to report to the EPA by November 26.\n\nMeanwhile, a 24-hour noise monitoring device in Rydalmere has been set up by the EPA and will be reviewed weekly for a month.\n\nIndustrial businesses cooperating\n\nA spokesperson for Knauf said it would work closely with the EPA.\n\n\"We have operated at this site for more than 50 years, with no significant changes to our operations in recent years,\" the spokesperson said.\n\n\" We value being a good neighbour and will continue cooperating with the EPA. \"\n\nPreviously, Knauf said it did not believe it was responsible for the noise.\n\nThe humming noise was identified as coming from the Camellia industrial area. (ABC)\n\nJames Hardie has been contacted for comment.\n\nA spokesperson previously told ABC Radio Sydney James Hardie was also cooperating with the EPA's investigations.\n\n\"While we're not aware of any changes to our manufacturing operations in recent weeks or months that would suggest that our operation is the source of concern, we are assisting the EPA with their investigations,\" they said at the time.\n\nRelief for residents\n\nRydalmere resident Maddi Pettit told ABC Radio Sydney the noise had been reduced but was still audible in her neighbourhood.\n\nLoading...\n\n\"It has gotten better but it hasn't completely gone away,\" Ms Pettit said.\n\n\" A lot of people are still being kept awake. It's quite exhausting and it's not sustainable for the community. \"\n\nErmington resident Brenton Potter was inspired to drive around at night to find the source of the noise in September.\n\nHe said he had not noticed the noise at his home since the end of that month.\n\nMr Beaman said concrete-batching plant Hymix was also investigated but it did not have the same noise signature that was picked up in Rydalmere.\n\nHe said the facility was excessively noisy and the EPA would keep working with the company to mitigate noise.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-10/teen-travels-around-australia-visiting-every-abc-bureau/105839098",
        "title": "Meet Hayden Eastbury, the 17-year-old visiting every ABC bureau in Australia",
        "publish_date": "Thu, 09 Oct 2025 22:37:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hayden Eastbury has two great passions in life — garbage trucks and the Australian Broadcasting Corporation.\n\nIt was the 17-year-old's love for the ABC that inspired his epic journey across the country with his family.\n\nLoading...\n\n\"I've been travelling around Australia with my family, and have been meeting ABC news presenters,\" Hayden said.\n\nHayden, his brother, Jake, and their parents set off from Newcastle in mid-2024 with plans to visit all 68 ABC offices in Australia, fuelling Hayden's dream of one day working for the corporation.\n\n\"We've been to Queensland, Northern Territory, down the coast, Western Australia; I've met lots of people and been given lots of ABC stickers,\" Hayden said.\n\nHayden Eastbury got a taste behind the news desk at the ABC studios in East Perth. (ABC News: Kenith Png)\n\nTeaching through learning\n\nHayden and his brother both live with fragile X syndrome, a mutation of the X chromosome.\n\nThe genetic condition can include a wide range of physical, intellectual and behavioural symptoms.\n\nAccording to the Fragile X Association of Australia, it is the leading cause of inherited intellectual disability, affecting about 1 in 4,000 males and around 1 in 6,000 females.\n\nThe family is hoping to spread awareness for fragile X syndrome. (ABC Great Southern: Kate Forrester)\n\nHayden's father, Phil, hopes the journey will inspire greater awareness and understanding of the syndrome nationwide.\n\n\"Both Hayden and his brother, Jake, live with a lot of challenges but as we've explored this great country, we've encountered so many people who have been so supporting of us, like the ABC,\" Phil said.\n\nPhil noted that while awareness of the syndrome was growing, a significant number of people remained unaware they could be carriers.\n\nPhil and Hayden Eastbury met WA presenter Pamela Medlen in the Perth studios. (ABC News: Kenith Png)\n\n\"Fragile X is inherited through the X chromosome, so my boys inherited it from my wife's side,\" Phil said.\n\n\"Symptoms can be put down to things like Dyslexia, men can have tremors that look like Parkinson's, for women, they can be put down to early onset menopause.\n\n\"It's only when it mutates to the full fragile X do alarm bells ring — that's generally through early childhood when milestones aren't met.\"\n\n\" The boys will need supporting for the rest of their lives but we love parenting them, it's an absolute pleasure to have them in our lives. \"\n\nHayden Eastbury hopes one day to work at the ABC. (Supplied: Phil Eastbury)\n\nLife-long dream\n\nHayden's passion for news and current affairs started with his favourite presenter.\n\n\"Hayden loves to listen to the banter,\" Phil said.\n\n\"Lisa Millar is his favourite presenter on ABC, we're hoping to one day catch up with her.\"\n\n\"I love Backroads at 8pm on the ABC,\" Hayden added.\n\nHayden Eastbury got the chance to try his hand at radio presenting at the ABC Darwin studios. (Supplied: Phil Eastbury)\n\nThe road trip will be put on hold when Hayden returns to Newcastle next year to finish year 12, but Phil says it will resume once Hayden completes his secondary studies.\n\n\"If he could one day score a job with the national broadcaster, that would be brilliant,\" Phil said.\n\nIf that does not work out, Hayden is equally fascinated by his other passion.\n\n\"I think one day if he could get a job with something garbage-related, that would suit Hayden,\" Phil added.\n\n\"I don't think he will be able to get a drivers' licence, which is a big part of driving a [garbage truck], but if he could get something related, that would be great.\"\n\nHayden Eastbury and his family have been travelling through Western Australia, visiting offices in the northern region. (Supplied: Phil Eastbury)",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-trade-period-2025-live-updates-blues-not-impressed-by-cats-curnow-offer-player-moves-deals-pick-trades-and-more-with-clayton-oliver-christian-petracca-zach-merrett-in-the-mix-for-new-clubs-20251010-p5n1he.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trade period 2025 LIVE updates: Hill will be a Magpie says agent; Giants boss says Aleer “shattered” after Saints pull out of deal",
        "publish_date": "Fri, 10 Oct 2025 12:47:08 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "UPDATED: Leek Aleer’s potential return to GWS after St Kilda’s stunning backflip yesterday on him is not as straightforward as it might seem.\n\nA “shattered” Aleer woke up in Barcelona to the life-changing news after previously requesting a trade to the Saints to accept a four-year deal worth north of $700,000 annually.\n\nConor Stone chases the footy in 2024. Credit: Getty Images\n\nThe Giants are happy to bring the 24-year-old defender back to the club, but they will need to do some re-jigging to fit him in, given the league’s list rules. There is also a chance another team emerges as an Aleer suitor.\n\nAFL clubs can have between 36 and 38 players on their primary list, and GWS are already at 35 before trading for Melbourne midfielder Clayton Oliver or potentially re-signing Aleer.\n\nThe challenge for the Giants is they must make at least three national draft selections, so Oliver’s arrival - at minimum - would mean something has to give.\n\nGWS previously told utility Conor Stone, who is contracted for next season, that they may delist him with the idea of redrafting him as a rookie, two sources familiar with that discussion told this masthead on the condition of anonymity.\n\nStone, 23, re-signed for two seasons in October last year after Essendon expressed interest in him.\n\nOne of those sources said the 20-gamer would be at the Giants next season.\n\nGWS may need to delist Stone and a second player if Aleer re-signs, unless they traded a player or two out, potentially in the Oliver deal.\n\nEx-Bomber Jayden Laverde will join the Giants, but will be on the rookie list, so will not take up a primary list spot.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/agnes-lee-is-the-creator-of-the-famous-rubber-ducky-cake-now-world-famous-from-bluey-20251010-p5n1m2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Agnes Lee is the creator of the famous rubber ducky cake – now world-famous from Bluey",
        "publish_date": "Fri, 10 Oct 2025 12:35:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Agnes Lee is the creator of the famous rubber ducky cake – now world-famous from Bluey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Fri, 10 Oct 2025 12:28:26 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/stallions-attack-newborn-foal-at-mt-eliza-property-20251010-p5n1lz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stallions attack newborn foal at Mt Eliza property",
        "publish_date": "Fri, 10 Oct 2025 12:24:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Stallions attack newborn foal at Mt Eliza property\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-fringe-festival-2025-20250930-p5mz1n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Fringe Festival 2025",
        "publish_date": "Fri, 10 Oct 2025 12:21:39 +1100",
        "category": "finance",
        "authors": [],
        "text": "A colourful dance floor has been set up in Fed Square – and the more people that move across it, the more it lights up – and the more energy it generates.\n\nOctober 1, 2025\n\nby Elizabeth Flux",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/record-numbers-of-humpback-whales-20251010-p5n1ls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Record numbers of humpback whales",
        "publish_date": "Fri, 10 Oct 2025 12:16:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Record numbers of humpback whales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Golding",
        "publish_date": "Fri, 10 Oct 2025 12:13:37 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/fantasy-land-nrl-club-bosses-attack-r360-and-back-nrl-sanctions-on-defecting-players-20251010-p5n1l4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Fantasy land’: NRL club bosses attack R360 and back sanctions on defecting players",
        "publish_date": "Fri, 10 Oct 2025 12:12:49 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The clubs have held a meeting with the NRL over the threat of Rugby 360 and backed the governing body as it explores legal options regarding protective measures and sanctions for defecting players and agents.\n\nNRL chief executive Andrew Abdo spoke to club CEOs in a phone hook-up on Friday morning and allayed the fears of team bosses.\n\nAustralian Rugby League Commission boss Peter V’landys also spoke with several club chairmen this week. He will take the views of the clubs to the commission to discuss options available to the NRL.\n\nIt is unclear whether the NRL has the legal right to ban defecting players from returning, but the code is keen to explore potential measures to protect the sport from a raid on its talent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-top-six-why-these-young-batters-are-the-next-big-things-for-australia-20251008-p5n0yt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The top six: Why these young batters are the next big things for Australia",
        "publish_date": "Fri, 10 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Connolly is one of few Australians to score a half-century as a 16-year-old in an under-19 world cup. He has also captained the under-19 side. Had a key role at No.5 on the recent Australia A tour of India. Fergus O’Neill congratulates Ollie Peake on his match-winning Sheffield Shield knock on Tuesday. Credit: Getty Images Ollie Peake (Victoria) Age: 19\n\nTests: 0\n\nIt’s been a stunning 18-month rise for the son of former Victorian batter Clinton Peake. In this time, Peake played in Australia’s under-19 World Cup win, made his debut for the Melbourne Renegades in the Big Bash League, and posted a half-century on debut in the Sheffield Shield. Then came the invite to be a development player and travel with Australia on their Test tour of Sri Lanka last February.\n\nLoading This week, the slick left-handed batter from Geelong, who describes himself as a “little scrapper”, was the match-winner for Victoria in their Shield clash against reigning champions South Australia. In just his second Shield match, and fifth first-class match, Peake finished unbeaten on 70 from 147 deliveries to guide the Vics home in a testing chase of 231 at Adelaide Oval. Close Shield observers say Peake already has the game to play Test cricket, but here’s a scary thought – he is still young enough to qualify for next year’s Under-19 World Cup. Sam Konstas (NSW) Age: 20\n\nTests: 5\n\nThe sometimes brutal nature of sport has hit Konstas, who enthralled the cricketing world with his audacious ramp shots on debut against Jasprit Bumrah at the MCG last summer, but has since struggled to find the middle ground needed to prosper at the top level.\n\nSam Konstas, Harry Dixon and Ollie Peake after Australia claimed the ICC under-19 World Cup in South Africa last year. Credit: ICC via Getty Images Konstas has every shot in the technical – and not so technical – handbook, but when to play these strokes remains a battle. “He’s got all the tools, and I think he has the ability when he wants to, to absorb pressure. And he’s got the ability to put a lot of pressure back on the bowlers. He’s going to have plenty of experiences, and he’s going to learn from them along the way,” Australian batting great Steve Smith said. A century for Australia A in India last month settled the nerves, but a double failure for NSW in the opening round of the Sheffield Shield last weekend in Perth means he is line-ball to hold his place in the team for the Ashes. Heavy hitter: Harry Dixon has based his powerful game on his idol, Australian great David Warner. Credit: Justin McManus\n\nHarry Dixon (Victoria) Age: 20\n\nTests: 0\n\nIt would be unfair to say Dixon is a bull at a gate. But he has modelled his aggressive intent on idol David Warner. Dixon has long been on the national selectors’ radar. His century inside a session against England in Worcester during the Australia under-19 Ashes tour of 2023 remains a talking point in cricketing circles. While he has batted in the middle order for Victoria, coach – and former Australian opener Chris Rogers – told the Cricket Australia website he is considering shifting Dixon to an opening role. “If there’s one player that Harry reminds me of, it’s David Warner. He can play shots that Warner – and potentially [Travis] Head – can play,” Rogers said.\n\nLoading Rogers says the similarities include Dixon’s ability to hit good balls just outside off stump conventionally through cover point or more unconventionally through the leg side. Dixon missed Victoria’s Shield opener against the Redbacks after being selected for the overlapping Australia A one-day series against India A, but fans should brace themselves for the hard hitting to come when he returns to local shores over the next month. Will Salzmann (NSW) Age: 21\n\nTests: 0\n\n“He definitely knows how to hit the ball,” was one comment from a state talent manager, who wished to remain anonymous, to speak freely. That, clearly, was the case in Perth last weekend when, on his first class debut, the fast-bowling all-rounder cracked 43 (seven boundaries) and 72 (10 boundaries and a six) at No.7 and was named man of the match in the Blues’ 74-run win over WA. “There was something lurking within, and he found it in his first game; two fantastic innings,” NSW coach Greg Shipperd said. On the rise: Will Salzmann began his Sheffield Shield career last weekend with man-of-the-match honours. Credit: Getty Images This continued Salzmann’s strong pre-season form, including a century against Victoria in a scratch match in Sydney. While he was given just the one over with the ball in Perth, he will have plenty of opportunity to shine this summer. Hailing from the Campbelltown Camden District Cricket Association, and representing Sydney University in Premier cricket, Salzmann was part of the Australian side that finished third at the 2022 under-19 World Cup, taking 12 wickets in six games, the most of any Australian.\n\nInjury impacted his 2024-25 season, but he has enjoyed a taste of state white-ball cricket in recent seasons, with the Blues now looking to him to be a consistent threat in all formats. “I am really proud of how I have responded physically and the big off-season I have had, but also mentally, tapping into the people in my corner and learning to mature on and off the field. I have high red-ball desires,” Salzmann said. Hugh Weibgen (Queensland) Age: 20\n\nTests: 0\n\nUsman Khawaja, a teammate of Weibgen’s at the Valley District Cricket Club, has said he expects “big things” from the dashing right-hander, and that’s starting to show.\n\nWhile he was captain of Australia’s victorious under-19 side at last year’s World Cup in South Africa, and was named captain and No.3 in the team of the tournament with an average of 50.66, Weibgen was made to wait by the Bulls’ selectors. Hugh Weibgen celebrates taking a catch for the Sydney Thunder last summer. Credit: Getty Images But no more. For those who witnessed his maiden unbeaten century (115 not out from 94 deliveries) to lift the Bulls to a two-wicket win over WA in their one-day match at Allan Border Field last month, there was a feeling he is destined for higher honours – and soon. “He’s, obviously, a very good young leader, and that’s something that’s going to come into it at some stage. I would love him to be captain in two or three years’ time for Queensland,” Bulls coach Johan Botha said. Having spent the northern summer playing in the Surrey Premier League, Weibgen was handed his first-class debut last weekend, lashing 39 off 41 balls as the Bulls crushed Tasmania.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/he-just-fell-how-arjun-s-last-race-proved-one-too-many-for-bima-s-boy-star-20251007-p5n0ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He just fell’: How Arjun’s last race proved one too many for Bima’s boy star",
        "publish_date": "Fri, 10 Oct 2025 11:57:00 +1100",
        "category": "sports",
        "authors": [
            "Zach Hope",
            "Amilia Rosa"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Bima, Indonesia: When he died in a fall at the age of 12, Arjun Bimantara was already a racing veteran. His father had been a jockey. So had his uncles and grandfather. At the age of five or six, it seemed right to the boy and his family that he would start as a jockey too. A natural rider, owners threw contracts at him so big that he bought his own horse for $1000, more than many adults in the Indonesian city of Bima – on the sparse island of Sumbawa – could hope to save in their lives. His nest-egg paid for his mother to go through university. Child jockey Arjun Bimantara was aged 12 died when he died after a fall in 2023. Credit: Amilia Rosa In half a lifetime spent rounding the crude, dirt tracks of West Nusa Tenggara province, Arjun had come off his horses “many times”, his grandfather and mentor, Abdul Malik, says. At full gallop and without a saddle, bodies can slide off. In the suffocating tropical heat, small hands clenching manes and reins can lose their grip. “He just fell,” Malik says. “There was no other horse or person to blame.” Usually, Arjun bounded up and got back on his horse. This time he could not move. Malik ran onto the Bima track, cradling his grandson and urging him to speak. Arjun was slipping in and out of consciousness by the time they reached hospital. Rousing himself, he told everyone he felt no pain and wanted to go home. Ten minutes later, he was dead.\n\nAdvertisement\n\nIt was August 13, 2023, when Arjun became the third boy jockey in four years to die in a fall on Sumbawa island. The total is now five, after the deaths of eight-year-old Febiansyah Putra in May 2024 and seven-year-old Muhamad Iswan in March. “So much as looking at this beautiful photo makes me cry,” Malik says, clutching his best portrait of Arjun staring confidently into the camera. “No matter what, no other grandchild [of mine] will be a jockey. I lost Arjun on a racehorse, and Arjun will be the last.” Abdul Malik with a photo of his late grandson, Arjun. Credit: Amilia Rosa In the pockets of Indonesia where horseracing remains wildly popular, some jockeys start riding even younger than Arjun. Once, Malik says, he saw a little boy climb off a racehorse to feed on his mother’s breast. There are no weight handicaps or restrictions. The lighter the jockey, the better the horse’s advantage. The children wear helmets, vests and kneepads. Forget about saddles. Kilograms equal centimetres. The money is big, and so is the workload. At a multiday carnival, the pool of boys might be a couple of dozen for 700 or more horses. They are often the breadwinners for their families, catapulting their parents and siblings from poverty to wealth.\n\nAdvertisement\n\nAccording to the Stop Child Jockeys Coalition, a collection of more than 10 civil society organisations, the horse owners are “mostly government officials, police and military personnel, businesspeople, council members, and bank employees”. It is barbarous, exploitation and illegal, says the coalition. The racing crowd on Sumbawa calls it tradition. The barrier gates fly open for the first of the grand finals at the Bima Mayor’s Cup. Credit: Amilia Rosa A lucrative game One of the premier events on the racing calendar in West Nusa Tenggara is the Bima Mayor’s Cup, a 10-day knockout-style carnival put on by the city government with prizes of cows, motorbikes and a total pot of about $50,000. This masthead is trackside for the final two days, mingling with the punters crammed into bamboo grandstands and pressing against crumbling fences. At the barrier gates, army men whip the shins of youngsters crowding too close. The kids flee in excited yips of pain, then creep back like a returning tide.\n\nAdvertisement\n\nDrugs for the horses are on open display. Haris, a pharmacist, will make about $3000 at the carnival. “Every single horse is medicated,” he says. “It makes them more energetic.” A collection of drugs available for horses before they race. The injections make them more “energetic”. Credit: Amilia Rosa Never mind that gambling is illegal in Indonesia. Men and boys wave notes of rupiah, looking for takers on their bets. One teenager with a mischievous smile confides that he gets his money from his mum for snacks. “She doesn’t know that I gamble.” The betting and absence of any meaningful oversight to ensure integrity leads to race-fixing and “sabotage”. Between races, a fight almost breaks out among a crowd of men because of such an accusation. Military members and government officials see everything, and do nothing. With no weight handicaps or restrictions, the lighter the jockey, the bigger the advantage. Credit: Amilia Rosa The proud family of Sandi, a winning jockey in one of the penultimate day’s heats atop Queen Sahara, presents him as nine years old. It is not convincing. Minutes after flying around the track to glory on a powerful racehorse, Sandi is so shy at the attention he buries his frightened face into his mother’s waist and refuses to let go of her shirt.\n\nAdvertisement\n\nDoes she get worried about her son? No. “His father was a jockey, and he is fine. His brother was also a jockey, and he is fine,” she says. “Sandi has been doing this for two years without any problems.” Sandi soon after riding Queen Sahara to victory. Credit: Amilia Rosa A child comes off his horse in a cloud of dust. Dozens of people rush to his aid. The excitable race caller warns against taking photos and videos. The boy walks away, shaken and bruised, perhaps, but otherwise unharmed. “I’m aware of the five deaths, and I’m very concerned,” Saiful, the father of a 10-year-old jockey named Sahban, says. “I would rather that he didn’t ride. I believe I can sufficiently provide for the family without Sahban, but he is very insistent. He is proud and he is good. He is proud of the financial gain for our family.” Child jockey Sahban, 10, insists on riding, his father says. Credit: Amilia Rosa Some jockeys are paid per ride, starting from about $10. Others are booked on contracts worth $600, plus bonuses for the duration of a carnival. Jockeys could have multiple contracts per carnival.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/the-child-jockeys-of-indonesia-20251010-p5n1lc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The child jockeys of Indonesia",
        "publish_date": "Fri, 10 Oct 2025 11:53:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "The child jockeys of Indonesia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/parliamentary-sports-club-drops-senator-over-cheap-shot-gambling-lobby-complaints/ni07m8rcy",
        "title": "Parliamentary sports club drops senator over 'cheap shot' gambling lobby complaints",
        "publish_date": "Fri, 10 Oct 2025 01:53:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Wallabies captain turned senator David Pocock had been kicked out of the parliamentary sports club for raising concerns about the gambling lobby.\n\n\n\n\n\nThe independent senator has been critical of the Australian Parliament Sports Club for registering as a lobby group, with many MPs who play unaware of its status.\n\n\n\n\n\nThe club hosts friendly games between MPs, their staff, public servants and journalists during parliament sitting weeks and organises pollies versus press games across multiple sports.\n\n\n\n\n\nSenator Pocock said he raised concerns with the club's CEO Andy Turnbull before going public, including over the gambling lobby's sponsorship.\n\n\n\n\n\nTurnbull has denied lobbying takes place on the field and says the club was registered as a precaution to be on the safe side, given it brings together MPs and corporate sponsors.\n\n\n\nTurnbull said he would deregister the club following written confirmation from the department it did not need to be registered.\n\n\n\n\n\nBut Senator Pocock raised concerns that it should be registered \"if there are paying corporate members who interact with parliamentarians\".\n\n\n\n'You left me with no choice'\n\nTurnbull messaged Senator Pocock on Thursday evening to say \"clearly based on your actions this week you have chosen to ignore my comments above\".\n\n\n\n\n\n\"You have chosen not to do that and in doing so have become the first person ever to politicise the most apolitical operation in the parliament,\" he said in the message.\n\n\n\n\n\n\"I have for the last 24 hours just scratched my head in disbelief. It is inappropriate for you to remain a member of the club in these circumstances.\n\n\n\n\n\n\"You chose a cheap shot that will have no effect on the outcome of your anti-gambling campaign. I am sorry it has reached this point but you left me with no choice.\"\n\n\n\nREAD MORE Fears new breed of influencers could worsen a $25 billion Australian problem\n\nSenator Pocock is among the most vocal critics of the federal government failing to respond to a landmark gambling harm inquiry that recommended phasing out online betting, an advertising ban and stopping gambling inducements.\n\n\n\n\n\nThe government is yet to respond to the review's recommendations more than two years later.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/whats-the-senate-actually-estimating-ft-david-pocock/mh2g41en3",
        "title": "What’s the Senate actually estimating? Ft. David Pocock",
        "publish_date": "Thu, 9 Oct 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-championship-2025-npl-clubs-vying-for-a-league/e8w984a52",
        "title": "'I will defend it with my life': The die-hard NPL fans chasing Australian Championship glory",
        "publish_date": "Thu, 9 Oct 2025 18:35:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "Chants of \"Makedonia\" ring out from beneath a corrugated iron pavilion at a suburban Melbourne football ground, where thousands of keen spectators are gathered.\n\n\n\n\n\nPreston Lions FC have just scored against Avondale FC and the crowd erupts as smoke and the scent of kebapi — a favourite Balkan dish of small, skinless sausages — drifts through the air.\n\n\n\n\n\nWelcome to the National Premier Leagues — the beating heart of grassroots Australian football.\n\n\n\n\n\nStarting tonight, the competition's biggest clubs will make their long-awaited return to the national stage with the launch of the inaugural Australian Championship, broadcast exclusively by SBS.\n\n\n\n\n\nPreston, alongside 15 other semi-professional teams, will be thrust into the spotlight, with supporters hoping the tournament will lay the groundwork for the introduction of a promotion and relegation system — which would allow for the transfer of teams between leagues — to the top-flight of Australian football, the A-League.\n\n\n\nSixteen clubs from National Premier League competitions from across Australia will play in the inaugural Australian Championship. Source: Getty / Darrian Traynor / Football Australia The historic clubs of APIA Leichhardt, Avondale, Marconi Stallions, Preston Lions, South Melbourne, Sydney Olympic, Sydney United 58 and Wollongong Wolves will be joined by the premiers of the NPL competitions from across the country when the Championship — which will run from 10 October to 6 December — kicks off.\n\n\n\n'It felt like home'\n\nFounded in 1947 by Macedonian migrants, Preston Lions FC, like many of its rivals, was born amid Australia's post-war migration boom.\n\n\n\n\n\nThe club was originally called the Makedonia Soccer Club and enjoyed early success in the now-defunct National Soccer League (NSL) — the A-League's predecessor — before being relegated to the lower leagues in 1994.\n\n\n\n\n\nIts cultural roots still run deep, woven through generations of supporters who have built and sustained the club's culture and fan base.\n\n\n\n\n\nTony Dimoski grew up watching games with his Macedonian parents and now brings along his 11-year-old daughter Tianna, who dreams of one day playing for the senior women's side.\n\n\n\nTony Dimoski grew up watching Preston Lions games with his Macedonian parents and now brings his 11-year-old daughter Tianna along. Source: Supplied \"There were many other Macedonian clubs … but Preston was the one we always went to because there was always a great environment,\" he tells SBS News.\n\n\n\n\n\n\"The food, the people, it felt like home.\"\n\n\n\n\n\nIt's a similar story for Peter Kartsidimas, who was only five when he first saw a match played by South Melbourne — a club of Greek heritage that was once home to former Socceroos and Tottenham coach Ange Postecoglou, both as a player and a coach.\n\n\n\n\n\n\"I will defend it with my life because the club means so much to me, and it's given me such great experiences,\" Kartsidmimas says.\n\n\n\n\n\nHis love for the club runs so deep that his wedding photos were taken at South Melbourne's home ground, Lakeside Stadium.\n\n\n\nPeter Kartsidimas's wedding photos were taken at South Melbourne’s home ground, Lakeside Stadium. Source: Supplied Preston and South Melbourne share a fierce rivalry. One of their games in March, played at the Lions' home ground, B.T. Connor Reserve in Reservoir, attracted a crowd of more than 9,000 fans and was dubbed 'The Big Show'.\n\n\n\n\n\nPreston president David Cvetkovski says community football has a \"sense of atmosphere\" that is difficult to replicate.\n\n\n\nWe have a soul, we have character, and we have 78 years of history that money can’t buy.\n\nNow competing in the top Victorian NPL competition after three promotions since 2019, Cvetkovski characterises the club's recent history as a \"renaissance\".\n\n\n\n\n\n\"We have aspirations like any club; if they're good enough, they can compete in the top-tier,\" he says.\n\n\n\n\n\nFormer Melbourne Victory defender Matthew Bozinovski joined Preston earlier this year and says the club's supporters are driven by \"pure passion\".\n\n\n\n\n\n\"We often have five or six locals who come and just watch us train in the cold winter nights, and they don't miss a beat,\" he says.\n\n\n\nHeidelberg’s dream cup run\n\nAnother Melbourne club with deep roots entering the Championship is Heidelberg United — fresh from a fairytale Australia Cup campaign in which they beat three A-League sides before bowing out to Newcastle Jets in the final.\n\n\n\n\n\nThe club traces its history to 1958, when migrants from Florina in northern Greece established Alexander the Great Soccer Club, later renamed Heidelberg United.\n\n\n\n\n\nFor fans — known as 'Bergers' — like Peter Alipanopoulos, the connection spans generations. So much so, he named his son Alexander after the team.\n\n\n\nPeter Alipanopoulos (centre) named his son Alexander (second from left) after Heidelberg United. Source: Supplied “As a kid, it was always my grandfather, my father, my uncle and me in the car going to watch every game,” he says.\n\n\n\n\n\n“My grandfather has since passed away, and now it's my father, my uncle and me and my son going to the game, so the tradition continues.\"\n\n\n\n\n\nHe says the club is more than just a team; it's a social hub and a symbol of cultural identity for Melbourne's post-war Greek-Macedonian community, drawing solid crowds to its home ground in Olympic Village in Heidelberg West.\n\n\n\n\n\nBoard member John Gioftsidis says the Championship is a chance for clubs like Heidelberg to reclaim their place in the national spotlight.\n\n\n\n\n\n\"A lot of these clubs have put in the hard yards and really worked hard to survive, let alone thrive in the current football landscape,\" he says.\n\n\n\nThey were the powerhouses of football throughout the last half a century … there's no reason why they can't be again.\n\nClubs back Australian Championship\n\nAustralia's first national competition, the NSL, began in 1977 and was part of a push to unify the country's fragmented state-based competitions and give migrant-founded clubs — many tied to Greek, Italian, Croatian, Macedonian, and other communities — a bigger stage.\n\n\n\n\n\nBut by the early 2000s, the league was in crisis, with declining attendance, cash-strapped clubs and ethnic tensions sometimes spilling into the stands.\n\n\n\nThe NSL wound up in 2004 and was succeeded by the A-League the following year, which comprised eight teams — most of them new — and aimed to broaden football's appeal.\n\n\n\n\n\nPeter Tsekenis, who coaches Sydney's Marconi Stallions, tells SBS Italian the Australian Championship was a throwback to the \"old NSL days\", a time when the club founded by Italian migrants was a dominant force.\n\n\n\n\n\n\"All these clubs have a rich history and a lot of following, but unfortunately, that following sort of disappeared because it was obviously playing in a lower level,\" he says.\n\n\n\n\n\n\"Now that these clubs have got the opportunity to play at the national stage ... I've already noticed a lot of interest from people.\n\n\n\n\n\n\"That's the exciting part, and it's how the clubs embrace this and bring people back to the stadium to support these clubs that they've supported most of their lives.\"\n\n\n\n\n\nFor Ante Jurić, the head coach of Sydney United 58, the Championship offers his players a chance to play at a higher level.\n\n\n\nREAD MORE How to watch 2025 Australian Championship LIVE on SBS\n\n\"The best teams are playing, obviously the standard will improve because of that, there will be fan growth and engagement,\" he tells SBS Macedonian.\n\n\n\n\n\nHe adds that the introduction of promotion and relegation was a matter of time.\n\n\n\n\n\n\"This is a step towards that,\" he says.\n\n\n\n\n\nFootball Australia interim chief executive officer Heather Garriock tells SBS News the Australian Championship was about strengthening the connection between grassroots football and the broader game.\n\n\n\n\n\n\"Football in Australia is so multicultural, and for us to be able to celebrate that, the heritage, the history and the communities that feel a sense of belonging to the clubs ... is so vitally important.\"\n\n\n\n\n\nThe inaugural Australian Championship will be held over six rounds, followed by quarter and semi-finals, with the final set for 6 December.\n\n\n\n\n\n\n\n– With additional reporting from SBS Italian and SBS Macedonian.\n\n\n\n\n\nYou can catch all the action of the Australian Championship live on SBS or online at SBS On Demand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/court-blocks-pro-palestinian-march-to-sydney-opera-house/r3chajx43",
        "title": "Court blocks pro-Palestinian march to Sydney Opera House",
        "publish_date": "Thu, 9 Oct 2025 08:56:19 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Court blocks pro-Palestinian march to Sydney Opera House\n\nPublished 9 October 2025, 5:58 am\n\nNew South Wales' Court of Appeal has blocked a planned pro-Palestinian march from reaching the Sydney Opera House. An estimated 40,000 people were expected to attend the protest scheduled for Sunday. The court of appeal bench was unanimous in its decision to prohibit the protest, citing safety concerns.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-gaza-peace-deal-signed-au-revoir-to-yet-another-french-pm-australias-new-security-alliance/qpvku4bvv",
        "title": "A Gaza peace deal signed; au revoir to yet another French PM; & Australia's new security alliance",
        "publish_date": "Thu, 9 Oct 2025 07:48:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/gaza-peace-deal-market-impacts-gemini-crypto-exchange-enters-australia/cn4wgwr7z",
        "title": "Gaza peace deal market impacts & Gemini crypto exchange enters Australia",
        "publish_date": "Thu, 9 Oct 2025 06:55:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-common-mortgage-feature-that-could-be-leaving-you-worse-off/353pu5cpx",
        "title": "The common mortgage feature that could be leaving you 'worse off'",
        "publish_date": "Thu, 9 Oct 2025 06:11:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mortgage offset accounts are a fixture of the housing market, allowing homeowners to pay less interest on their deposit while maintaining easy-access savings, but new research has found the system doesn't always benefit everyone.\n\n\n\n\n\nAnalysis published this week in the journal Economic Record has found Australia's mortgage offset system largely benefits wealthier households while leaving lower-income households worse off.\n\n\n\n\n\nJames Graham, the lead researcher on the study and a senior lecturer at the University of Sydney's School of Economics, said his model, the first academic analysis of mortgage offset accounts in Australia, revealed the current system could be deepening inequality.\n\n\n\n\n\nGraham told SBS News he took on the research project because while \"everyone\" around him was discussing purchasing a house and getting a mortgage offset account, he wanted to understand whether they were \"valuable\" products.\n\n\n\n\n\n\"I think a lot of people just take it because it's the default option that a lot of banks offer,\" he said.\n\n\n\n\n\n\"And then there's people who want to think about it a little bit harder and ask whether they would actually make use of the product.\"\n\n\n\nGraham said his research aimed to find out \"who was using mortgage offset accounts, who was benefiting from using them, and to what extent\".\n\n\n\nWhat is a mortgage offset account and how is it supposed to work?\n\nA mortgage offset account is a savings bank account that is linked to your home loan.\n\n\n\n\n\nIt's a common service offered by banks for homeowners and presents an opportunity to reduce interest on their mortgage — and about 40 per cent of Australian mortgageholders use them, according to a 2021 Reserve Bank of Australia analysis.\n\n\n\n\n\nA portion of your home loan is placed in a savings account, which is free to use as a regular savings account.\n\n\n\n\n\nIf you had a home loan of $500,000 and chose a $50,000 mortgage offset account, you would only pay interest on $450,000 of your home loan.\n\n\n\n\n\n\"The benefit of an offset is that the money in the account is just immediately available to you,\" Graham said.\n\n\n\n\n\n\"If you had an emergency tomorrow, you can pull that money out right away and start spending it, and then you're reducing your interest costs to the mortgage too.\"\n\n\n\n\n\nSome plans involve a one-time fee, while others have no upfront cost, but charge extra interest to your savings account .\n\n\n\nIt was this distinction that Graham wanted to investigate.\n\n\n\n\n\nHe said some banks might charge a yearly fee, while others may not but instead charge slightly higher mortgage rate.\n\n\n\n\n\n\"Others will do weird packages, which is really hard to figure out what the actual cost of this thing is,\" he said.\n\n\n\n\n\nHe said some people might not totally understand what they're signing up to and may not be putting enough money in their offset account to get the interest-saving benefit.\n\n\n\n\n\n\"It could be quite hard to figure it out sometimes, what you're actually paying for these things,\" he said.\n\n\n\nDenise Boyd, head of policy and campaigns at Mortgage Stress Victoria, said mortgage offset accounts could be \"quite complex\" and the onus was on banks to provide \"clear, factual information\" for consumers.\n\n\n\n\n\nBut, she said, it was also on the consumer to \"keep asking the questions\".\n\n\n\n\n\n\"You need to make sure that you've got the right instructions at the outset. If you haven't got the right instructions in place, then you lose the interest benefit. People need to know that.\"\n\n\n\nWhat does the research say about mortgage offsets?\n\nDuring his research, Graham looked at how different mortgage offset accounts impacted different kinds of loans, and found \"different pricing benefits and harms different people\".\n\n\n\n\n\nHe said people with the largest mortgages who had a good ability to save were the group that benefited most from offset accounts with an upfront, yearly fee.\n\n\n\n\n\n\"This benefits the wealthiest people because you have to have a large mortgage in the first place to make it worthwhile,\" he said.\n\n\n\n\n\nThere are other plans, that add a slight increase to the mortgage interest rate rather than an upfront fee.\n\n\n\n\n\n\"Those schemes actually tend to favour lower mortgage people a little bit more,\" he said.\n\n\n\n\n\n\"Because then if you've got a small mortgage, then you're paying less in dollars for the product. It tilts the playing field in favour of smaller mortgages, relative to large mortgages.\"\n\n\n\n\n\nIn general, Graham's research found that the most pertinent issue was a lack of education around how to actually benefit from a mortgage offset account.\n\n\n\n\n\n\"Many households are potentially signing up for these products without fully understanding how they work, and in some cases they may actually be worse off,\" he said.\n\n\n\n\n\nGraham said it was very easy for low-income households to lose money over time because of a lack of information about how mortgage offset accounts work, and because bank accounts were \"sticky\" — once people open them, they're very unlikely to close them, even after they have ceased to be beneficial.\n\n\n\nSally Tindall, data insights director at financial comparison website Canstar, said uptake of offset accounts appeared to be on the rise.\n\n\n\n\n\n\"It's a very popular product and can be beneficial because the bank reviews the amount of interest for these accounts on a daily basis, so despite the fact your savings can go up and down, it does make a difference over time.\"\n\n\n\n\n\nShe said previously, offset accounts would come with higher fees and higher interest rates compared to a redraw account, which similarly allows mortgage holders to withdraw certain sums from their mortgage.\n\n\n\n\n\nTindall said it appeared banks had recently caught on to the fact that consumers were interested in offset accounts with low interest rates.\n\n\n\n\n\n\"Now, some banks don't try higher interest rates,\" she said.\n\n\n\n\n\n\"Previously, they might have, but there's more competition now, so it comes down to fees for whether you're getting bang for your buck, and they can vary between the banks.\"\n\n\n\n\n\nBoyd said if people were unclear whether their offset was right for them, they should ask their bank.\n\n\n\n\n\nTindall said she would advise anyone with a mortgage offset account to check their rate at least once a year to ensure they were getting the best deal for their needs.\n\n\n\nREAD MORE The states and territories where renters have it the best — and worst\n\nJustine Davies, a financial expert at Moneysmart, the government's online financial advice tool, said it was \"so important\" to shop around for a mortgage that works for you.\n\n\n\n\n\n\"Don’t be shy about reviewing your mortgage regularly and asking your financial institution to offer you a better deal,\" she told SBS News.\n\n\n\n\n\n\"Check the home loan key facts sheet for any loan you’re considering — it’ll show you your repayments and the total interest over the life of the loan, as well as the fees you’ll pay.\n\n\n\n\n\n\"There is a red flag — some financial institutions charge an extra fee or a higher fee for having an offset account.\n\n\n\n\n\n\"If that’s the case, you need to be confident that the amount of money you keep in your offset account is saving you more in interest than you’re paying in higher costs or rates.\n\n\n\n\n\n\"Otherwise, you could be going backwards.\"\n\n\n\n\n\nShe also recommended comparing multiple loans before choosing one, and using the government tools like Moneysmart's mortgage calculator to work out the likely cost of your home loan over the long term.\n\n\n\n\n\n\"It’s likely to be the biggest debt you’ll ever have and one of your biggest expenses. Differences in the interest rate you’re charged can make thousands or even tens of thousands of dollars difference over the life of your loan,\" she said.\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licensed professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-workplace-laws-aim-to-remove-extra-pain-burden-on-parents-arising-from-stillbirth/yxxby73uk",
        "title": "New workplace laws aim to remove extra pain burden on parents arising from stillbirth",
        "publish_date": "Thu, 9 Oct 2025 04:56:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nFive days into grappling with the death of her six-week-old daughter Priya, her grieving mother notified her employer of 11 years.\n\n\n\n\n\nShe received condolences and gifts from colleagues, but her pain was compounded when her workplace cancelled her three months of pre-approved paid parental leave.\n\n\n\n\n\nNow, laws have been introduced to prevent employers from immediately scrapping these entitlements when families face the tragedy of a stillbirth or death of their baby.\n\n\n\n\n\nPriya's mother cannot be identified for legal reasons.\n\n\n\n\n\nSBS has voiced some of her comments made a press conference just after the bill was introduced into federal parliament.\n\n\n\n\n\n\"My heart aches with sadness because more than anything, I wish my daughter Priya was here with me. At the same time, I feel such immense pride and joy, knowing that she's creating meaningful change for future working parents in Australia.\"\n\n\n\n\n\nThe bill was introduced because in some circumstances some employers immediately cancelled parental leave after the death of a baby and ask parents to take annual leave instead.\n\n\n\n\n\nIn other cases, an employee who did not have annual leave could be told to come back to work straight away.\n\n\n\n\n\nWorkplace Minister Amanda Rishworth says parents shouldn't have to deal with the uncertainty of whether they will receive paid parental leave while also enduring the grief of child loss.\n\n\n\n\n\n\"If you think about the time of a stillbirth or a early infant loss, it is absolutely tragic. It is something that I can't even imagine and to have to deal with not only navigating the grief and loss, but also navigating demands to come back to work early, not have the financial security that comes with recovering from childbirth, but also grieving and loss through having that guaranteed paid parental leave is just unimaginable.\"\n\n\n\n\n\nPriya's parents, who advocated for the laws, met Prime Minister Anthony Albanese and Ms Rishworth after the bill was introduced.\n\n\n\n\n\n\"There is no greater way to honour my little girl than to have her name forever tied to this law - a legacy that will touch countless lives.\"\n\n\n\n\n\nPriya's mother also thanked the more than 32,000 ((32,378)) people who had signed baby Priya's petition calling for the bill to be introduced.\n\n\n\n\n\nThere was a thank you too from Prime Minister Anthony Albanese.\n\n\n\n\n\n\"It's a legacy of course for Priya as well that will last for other families who are going through your tragic circumstances, which must be just so difficult. During the (election) campaign we committed to this in part because of your advocacy, understanding that parents in this situation who've lost a little one need to be looked after.\"\n\n\n\n\n\nAustralian Institute of Health and Welfare data shows six babies are stillborn every day and two die within 28 days of birth in Australia.\n\n\n\n\n\nMs Rishworth says the laws will also give clarity to employers about paid parental leave policies, and benefit workplaces by retaining and attracting staff.\n\n\n\n\n\n\"What this bill is really doing is making it very explicit about what the expectations are. And this is not just good for parents, but it gives absolute clarity to employers. Someone in the HR department doesn't have to wrestle about whether or not they should cancel leave and make people take other leave. This makes it explicit that you are able to keep taking your entitlement of paid parental leave until it's exhausted. And so that really does give certainty to everyone irrespective of whether the baby was stillborn, passed away or indeed of course lived.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-does-the-middle-east-peace-deal-mean/kcb42zhl7",
        "title": "INTERVIEW: What does the Middle East peace deal mean?",
        "publish_date": "Thu, 9 Oct 2025 01:52:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-trade-period-2025-live-updates-blues-not-impressed-by-cats-curnow-offer-player-moves-deals-pick-trades-and-more-with-clayton-oliver-christian-petracca-zach-merrett-in-the-mix-for-new-clubs-20251010-p5n1he.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL trade period 2025 LIVE updates: Hill will be a Magpie says agent; Giants boss says Aleer “shattered” after Saints pull out of deal",
        "publish_date": "Fri, 10 Oct 2025 12:47:08 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward"
        ],
        "text": "UPDATED: Leek Aleer’s potential return to GWS after St Kilda’s stunning backflip yesterday on him is not as straightforward as it might seem.\n\nA “shattered” Aleer woke up in Barcelona to the life-changing news after previously requesting a trade to the Saints to accept a four-year deal worth north of $700,000 annually.\n\nConor Stone chases the footy in 2024. Credit: Getty Images\n\nThe Giants are happy to bring the 24-year-old defender back to the club, but they will need to do some re-jigging to fit him in, given the league’s list rules. There is also a chance another team emerges as an Aleer suitor.\n\nAFL clubs can have between 36 and 38 players on their primary list, and GWS are already at 35 before trading for Melbourne midfielder Clayton Oliver or potentially re-signing Aleer.\n\nThe challenge for the Giants is they must make at least three national draft selections, so Oliver’s arrival - at minimum - would mean something has to give.\n\nGWS previously told utility Conor Stone, who is contracted for next season, that they may delist him with the idea of redrafting him as a rookie, two sources familiar with that discussion told this masthead on the condition of anonymity.\n\nStone, 23, re-signed for two seasons in October last year after Essendon expressed interest in him.\n\nOne of those sources said the 20-gamer would be at the Giants next season.\n\nGWS may need to delist Stone and a second player if Aleer re-signs, unless they traded a player or two out, potentially in the Oliver deal.\n\nEx-Bomber Jayden Laverde will join the Giants, but will be on the rookie list, so will not take up a primary list spot.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/agnes-lee-is-the-creator-of-the-famous-rubber-ducky-cake-now-world-famous-from-bluey-20251010-p5n1m2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Agnes Lee is the creator of the famous rubber ducky cake – now world-famous from Bluey",
        "publish_date": "Fri, 10 Oct 2025 12:35:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Agnes Lee is the creator of the famous rubber ducky cake – now world-famous from Bluey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Simon Letch",
        "publish_date": "Fri, 10 Oct 2025 12:28:26 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/stallions-attack-newborn-foal-at-mt-eliza-property-20251010-p5n1lz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stallions attack newborn foal at Mt Eliza property",
        "publish_date": "Fri, 10 Oct 2025 12:24:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Stallions attack newborn foal at Mt Eliza property\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/melbourne-fringe-festival-2025-20250930-p5mz1n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Fringe Festival 2025",
        "publish_date": "Fri, 10 Oct 2025 12:21:39 +1100",
        "category": "finance",
        "authors": [],
        "text": "A colourful dance floor has been set up in Fed Square – and the more people that move across it, the more it lights up – and the more energy it generates.\n\nOctober 1, 2025\n\nby Elizabeth Flux",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/record-numbers-of-humpback-whales-20251010-p5n1ls.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Record numbers of humpback whales",
        "publish_date": "Fri, 10 Oct 2025 12:16:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Record numbers of humpback whales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-matt-golding-20230608-p5df5o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Matt Golding",
        "publish_date": "Fri, 10 Oct 2025 12:13:37 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Matt Golding\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/fantasy-land-nrl-club-bosses-attack-r360-and-back-nrl-sanctions-on-defecting-players-20251010-p5n1l4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Fantasy land’: NRL club bosses attack R360 and back sanctions on defecting players",
        "publish_date": "Fri, 10 Oct 2025 12:12:49 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The clubs have held a meeting with the NRL over the threat of Rugby 360 and backed the governing body as it explores legal options regarding protective measures and sanctions for defecting players and agents.\n\nNRL chief executive Andrew Abdo spoke to club CEOs in a phone hook-up on Friday morning and allayed the fears of team bosses.\n\nAustralian Rugby League Commission boss Peter V’landys also spoke with several club chairmen this week. He will take the views of the clubs to the commission to discuss options available to the NRL.\n\nIt is unclear whether the NRL has the legal right to ban defecting players from returning, but the code is keen to explore potential measures to protect the sport from a raid on its talent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-top-six-why-these-young-batters-are-the-next-big-things-for-australia-20251008-p5n0yt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The top six: Why these young batters are the next big things for Australia",
        "publish_date": "Fri, 10 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Connolly is one of few Australians to score a half-century as a 16-year-old in an under-19 world cup. He has also captained the under-19 side. Had a key role at No.5 on the recent Australia A tour of India. Fergus O’Neill congratulates Ollie Peake on his match-winning Sheffield Shield knock on Tuesday. Credit: Getty Images Ollie Peake (Victoria) Age: 19\n\nTests: 0\n\nIt’s been a stunning 18-month rise for the son of former Victorian batter Clinton Peake. In this time, Peake played in Australia’s under-19 World Cup win, made his debut for the Melbourne Renegades in the Big Bash League, and posted a half-century on debut in the Sheffield Shield. Then came the invite to be a development player and travel with Australia on their Test tour of Sri Lanka last February.\n\nLoading This week, the slick left-handed batter from Geelong, who describes himself as a “little scrapper”, was the match-winner for Victoria in their Shield clash against reigning champions South Australia. In just his second Shield match, and fifth first-class match, Peake finished unbeaten on 70 from 147 deliveries to guide the Vics home in a testing chase of 231 at Adelaide Oval. Close Shield observers say Peake already has the game to play Test cricket, but here’s a scary thought – he is still young enough to qualify for next year’s Under-19 World Cup. Sam Konstas (NSW) Age: 20\n\nTests: 5\n\nThe sometimes brutal nature of sport has hit Konstas, who enthralled the cricketing world with his audacious ramp shots on debut against Jasprit Bumrah at the MCG last summer, but has since struggled to find the middle ground needed to prosper at the top level.\n\nSam Konstas, Harry Dixon and Ollie Peake after Australia claimed the ICC under-19 World Cup in South Africa last year. Credit: ICC via Getty Images Konstas has every shot in the technical – and not so technical – handbook, but when to play these strokes remains a battle. “He’s got all the tools, and I think he has the ability when he wants to, to absorb pressure. And he’s got the ability to put a lot of pressure back on the bowlers. He’s going to have plenty of experiences, and he’s going to learn from them along the way,” Australian batting great Steve Smith said. A century for Australia A in India last month settled the nerves, but a double failure for NSW in the opening round of the Sheffield Shield last weekend in Perth means he is line-ball to hold his place in the team for the Ashes. Heavy hitter: Harry Dixon has based his powerful game on his idol, Australian great David Warner. Credit: Justin McManus\n\nHarry Dixon (Victoria) Age: 20\n\nTests: 0\n\nIt would be unfair to say Dixon is a bull at a gate. But he has modelled his aggressive intent on idol David Warner. Dixon has long been on the national selectors’ radar. His century inside a session against England in Worcester during the Australia under-19 Ashes tour of 2023 remains a talking point in cricketing circles. While he has batted in the middle order for Victoria, coach – and former Australian opener Chris Rogers – told the Cricket Australia website he is considering shifting Dixon to an opening role. “If there’s one player that Harry reminds me of, it’s David Warner. He can play shots that Warner – and potentially [Travis] Head – can play,” Rogers said.\n\nLoading Rogers says the similarities include Dixon’s ability to hit good balls just outside off stump conventionally through cover point or more unconventionally through the leg side. Dixon missed Victoria’s Shield opener against the Redbacks after being selected for the overlapping Australia A one-day series against India A, but fans should brace themselves for the hard hitting to come when he returns to local shores over the next month. Will Salzmann (NSW) Age: 21\n\nTests: 0\n\n“He definitely knows how to hit the ball,” was one comment from a state talent manager, who wished to remain anonymous, to speak freely. That, clearly, was the case in Perth last weekend when, on his first class debut, the fast-bowling all-rounder cracked 43 (seven boundaries) and 72 (10 boundaries and a six) at No.7 and was named man of the match in the Blues’ 74-run win over WA. “There was something lurking within, and he found it in his first game; two fantastic innings,” NSW coach Greg Shipperd said. On the rise: Will Salzmann began his Sheffield Shield career last weekend with man-of-the-match honours. Credit: Getty Images This continued Salzmann’s strong pre-season form, including a century against Victoria in a scratch match in Sydney. While he was given just the one over with the ball in Perth, he will have plenty of opportunity to shine this summer. Hailing from the Campbelltown Camden District Cricket Association, and representing Sydney University in Premier cricket, Salzmann was part of the Australian side that finished third at the 2022 under-19 World Cup, taking 12 wickets in six games, the most of any Australian.\n\nInjury impacted his 2024-25 season, but he has enjoyed a taste of state white-ball cricket in recent seasons, with the Blues now looking to him to be a consistent threat in all formats. “I am really proud of how I have responded physically and the big off-season I have had, but also mentally, tapping into the people in my corner and learning to mature on and off the field. I have high red-ball desires,” Salzmann said. Hugh Weibgen (Queensland) Age: 20\n\nTests: 0\n\nUsman Khawaja, a teammate of Weibgen’s at the Valley District Cricket Club, has said he expects “big things” from the dashing right-hander, and that’s starting to show.\n\nWhile he was captain of Australia’s victorious under-19 side at last year’s World Cup in South Africa, and was named captain and No.3 in the team of the tournament with an average of 50.66, Weibgen was made to wait by the Bulls’ selectors. Hugh Weibgen celebrates taking a catch for the Sydney Thunder last summer. Credit: Getty Images But no more. For those who witnessed his maiden unbeaten century (115 not out from 94 deliveries) to lift the Bulls to a two-wicket win over WA in their one-day match at Allan Border Field last month, there was a feeling he is destined for higher honours – and soon. “He’s, obviously, a very good young leader, and that’s something that’s going to come into it at some stage. I would love him to be captain in two or three years’ time for Queensland,” Bulls coach Johan Botha said. Having spent the northern summer playing in the Surrey Premier League, Weibgen was handed his first-class debut last weekend, lashing 39 off 41 balls as the Bulls crushed Tasmania.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/he-just-fell-how-arjun-s-last-race-proved-one-too-many-for-bima-s-boy-star-20251007-p5n0ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He just fell’: How Arjun’s last race proved one too many for Bima’s boy star",
        "publish_date": "Fri, 10 Oct 2025 11:57:00 +1100",
        "category": "sports",
        "authors": [
            "Zach Hope",
            "Amilia Rosa"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Bima, Indonesia: When he died in a fall at the age of 12, Arjun Bimantara was already a racing veteran. His father had been a jockey. So had his uncles and grandfather. At the age of five or six, it seemed right to the boy and his family that he would start as a jockey too. A natural rider, owners threw contracts at him so big that he bought his own horse for $1000, more than many adults in the Indonesian city of Bima – on the sparse island of Sumbawa – could hope to save in their lives. His nest-egg paid for his mother to go through university. Child jockey Arjun Bimantara was aged 12 died when he died after a fall in 2023. Credit: Amilia Rosa In half a lifetime spent rounding the crude, dirt tracks of West Nusa Tenggara province, Arjun had come off his horses “many times”, his grandfather and mentor, Abdul Malik, says. At full gallop and without a saddle, bodies can slide off. In the suffocating tropical heat, small hands clenching manes and reins can lose their grip. “He just fell,” Malik says. “There was no other horse or person to blame.” Usually, Arjun bounded up and got back on his horse. This time he could not move. Malik ran onto the Bima track, cradling his grandson and urging him to speak. Arjun was slipping in and out of consciousness by the time they reached hospital. Rousing himself, he told everyone he felt no pain and wanted to go home. Ten minutes later, he was dead.\n\nAdvertisement\n\nIt was August 13, 2023, when Arjun became the third boy jockey in four years to die in a fall on Sumbawa island. The total is now five, after the deaths of eight-year-old Febiansyah Putra in May 2024 and seven-year-old Muhamad Iswan in March. “So much as looking at this beautiful photo makes me cry,” Malik says, clutching his best portrait of Arjun staring confidently into the camera. “No matter what, no other grandchild [of mine] will be a jockey. I lost Arjun on a racehorse, and Arjun will be the last.” Abdul Malik with a photo of his late grandson, Arjun. Credit: Amilia Rosa In the pockets of Indonesia where horseracing remains wildly popular, some jockeys start riding even younger than Arjun. Once, Malik says, he saw a little boy climb off a racehorse to feed on his mother’s breast. There are no weight handicaps or restrictions. The lighter the jockey, the better the horse’s advantage. The children wear helmets, vests and kneepads. Forget about saddles. Kilograms equal centimetres. The money is big, and so is the workload. At a multiday carnival, the pool of boys might be a couple of dozen for 700 or more horses. They are often the breadwinners for their families, catapulting their parents and siblings from poverty to wealth.\n\nAdvertisement\n\nAccording to the Stop Child Jockeys Coalition, a collection of more than 10 civil society organisations, the horse owners are “mostly government officials, police and military personnel, businesspeople, council members, and bank employees”. It is barbarous, exploitation and illegal, says the coalition. The racing crowd on Sumbawa calls it tradition. The barrier gates fly open for the first of the grand finals at the Bima Mayor’s Cup. Credit: Amilia Rosa A lucrative game One of the premier events on the racing calendar in West Nusa Tenggara is the Bima Mayor’s Cup, a 10-day knockout-style carnival put on by the city government with prizes of cows, motorbikes and a total pot of about $50,000. This masthead is trackside for the final two days, mingling with the punters crammed into bamboo grandstands and pressing against crumbling fences. At the barrier gates, army men whip the shins of youngsters crowding too close. The kids flee in excited yips of pain, then creep back like a returning tide.\n\nAdvertisement\n\nDrugs for the horses are on open display. Haris, a pharmacist, will make about $3000 at the carnival. “Every single horse is medicated,” he says. “It makes them more energetic.” A collection of drugs available for horses before they race. The injections make them more “energetic”. Credit: Amilia Rosa Never mind that gambling is illegal in Indonesia. Men and boys wave notes of rupiah, looking for takers on their bets. One teenager with a mischievous smile confides that he gets his money from his mum for snacks. “She doesn’t know that I gamble.” The betting and absence of any meaningful oversight to ensure integrity leads to race-fixing and “sabotage”. Between races, a fight almost breaks out among a crowd of men because of such an accusation. Military members and government officials see everything, and do nothing. With no weight handicaps or restrictions, the lighter the jockey, the bigger the advantage. Credit: Amilia Rosa The proud family of Sandi, a winning jockey in one of the penultimate day’s heats atop Queen Sahara, presents him as nine years old. It is not convincing. Minutes after flying around the track to glory on a powerful racehorse, Sandi is so shy at the attention he buries his frightened face into his mother’s waist and refuses to let go of her shirt.\n\nAdvertisement\n\nDoes she get worried about her son? No. “His father was a jockey, and he is fine. His brother was also a jockey, and he is fine,” she says. “Sandi has been doing this for two years without any problems.” Sandi soon after riding Queen Sahara to victory. Credit: Amilia Rosa A child comes off his horse in a cloud of dust. Dozens of people rush to his aid. The excitable race caller warns against taking photos and videos. The boy walks away, shaken and bruised, perhaps, but otherwise unharmed. “I’m aware of the five deaths, and I’m very concerned,” Saiful, the father of a 10-year-old jockey named Sahban, says. “I would rather that he didn’t ride. I believe I can sufficiently provide for the family without Sahban, but he is very insistent. He is proud and he is good. He is proud of the financial gain for our family.” Child jockey Sahban, 10, insists on riding, his father says. Credit: Amilia Rosa Some jockeys are paid per ride, starting from about $10. Others are booked on contracts worth $600, plus bonuses for the duration of a carnival. Jockeys could have multiple contracts per carnival.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/the-child-jockeys-of-indonesia-20251010-p5n1lc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The child jockeys of Indonesia",
        "publish_date": "Fri, 10 Oct 2025 11:53:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "The child jockeys of Indonesia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.finance.yahoo.com/news/state-backs-coal-fired-power-013211846.html",
        "title": "State backs coal-fired power 'for decades' to come",
        "publish_date": "2025-10-10T01:32:11Z",
        "category": "finance",
        "authors": [
            "Thu October At Pm",
            "Min Read"
        ],
        "text": "A state government plans to keep coal-fired power stations open for decades to come, potentially putting pressure on federal emissions targets.\n\nQueensland Treasurer David Janetzki will on Friday unveil a five-year energy roadmap that will officially axe the former Labor government's plan to phase out coal-fired power generators by 2035.\n\nThe long-awaited blueprint will call for coal-fired power plants in the state to keep burning until at least 2046, outraging conservationists.\n\n\"This is a sensible and pragmatic plan built on economics and engineering,\" David Janetzki says. (Darren England/AAP PHOTOS)\n\n\"Coal will remain part of the state's generation mix for decades,\" Mr Janetzki said in a statement on Friday.\n\n\"The former Labor government's decision to close coal units by 2035 regardless of their condition is officially abolished today.\"\n\nThe technical lifespan of Queensland's coal-fired generators is now set to run until 2046 but the roadmap will allow the Liberal-National government to extend operations as needed.\n\n\"This is a sensible and pragmatic plan built on economics and engineering, not ideology,\" Mr Janetzki said of the roadmap covering the government's goals for long-term coal, gas, wind, solar and renewables resources.\n\n\"It will meet Queensland's energy needs ... it also provides investment certainty to private sector gas and renewables investors.\"\n\nThe move to keep coal-fired plants running looks set to put pressure on a federal commitment to cut emissions by 62 to 70 per cent by 2035 and achieve 82 per cent renewable electricity by 2030.\n\nThe state's targets may also be impacted with the LNP government committed to reaching net zero by 2050 while reviewing a commitment to cut emissions by 75 per cent by 2035.\n\nConservationists slammed the government's plan to keep coal-fired plants burning, saying it will expose Queenslanders to higher energy prices and more climate disasters.\n\n\"This energy roadmap is designed to pander to fossil fuel-loving party members and donors,\" Queensland Conservation Council Director Dave Copeman said.\n\n\"Queensland LNP's moves to axe renewable energy and storage projects, bank on expensive gas and keep Queenslanders chained to failing coal power stations are a recipe for higher power bills and less reliable energy.\n\n\"If they continue down this road to fossil fuel fantasy land, they will ... expose Queenslanders to more climate-driven disasters.\"\n\nConservationists slammed the Queensland government's plan to keep coal-fired plants burning. (Dan Peled/AAP PHOTOS)\n\nThe government's plan will undercut Australia's credibility on climate leadership at a crucial time, according to the Clean Energy Investment Group.\n\nAustralia is bidding to host the world's largest climate gathering, COP31, in 2026.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/child-bride-tragedy-holding-back-180000176.html",
        "title": "Child bride tragedy holding back girls' true potential",
        "publish_date": "2025-10-10T01:22:41Z",
        "category": "finance",
        "authors": [],
        "text": "The harmful practice of child marriage is under scrutiny ahead of International Day of the Girl.\n\nAustralians are being urged to use the day - October 11 - to reflect on outdated cultural norms, values and gender stereotypes that contribute to inequality.\n\nAround the world, 12 million girls under the age of 18 are married each year, which equates to one almost every three seconds.\n\nWhile early and child marriage affects both girls and boys, the impact on girls is much greater and those who grow up in poverty or living through a crisis, conflict or disaster are particularly at risk.\n\nFormer AFLW player Akec Makur Chuot's sister was forced into marriage at 15. (Maeve Bannister/AAP PHOTOS)\n\nFor Akec Makur Chuot, the topic is deeply personal.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe former AFLW player grew up in a Kenyan refugee camp, where she lived for 12 years before settling in Perth.\n\nHer sister, who remained in Kenya, was forced into marriage at 15 to a much older man.\n\n\"People think it's a foreign thing that happens overseas, but it's happening in our community,\" Makur Chuot said.\n\n\"It happened in South Sudan, but I was obviously in Australia, and it affected me because I knew that (my sister) was a young girl who had a lot of dreams, just like millions of girls who have been forcibly married off at such a young age.\"\n\nInternational Day of the Girl, celebrated on October 11, aims to spotlight the potential of girls around the world and the barriers they can face to freedom, safety, justice, health and education.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis year's theme brings attention to child marriage, which remains widespread despite large-scale policy action and legislative reform.\n\nA report by Plan International Australia surveyed more than 250 girls aged 15 to 24 who married as children, as well as activists working to eradicate child marriage.\n\nThe study, conducted across 15 nations, found 66 per cent of child brides had dropped out of school and 75 per cent were unemployed.\n\nAustralians need to tackle outdated ideas that fuel gender inequality, Susanne Legena says. (PR IMAGE PHOTO)\n\n\"Something that really struck me is the girls we spoke to talked about being very isolated,\" Plan International Australia chief executive Susanne Legena told AAP.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"They miss their friends. They're young girls (and) they're living in societies and cultures where the only status you have as a woman is to be married or to have children.\"\n\nWhile child marriage was illegal in Australia, Ms Legena said the nation's girls still faced other forms of gender inequality.\n\n\"The norms, the values, those gender stereotypes, the dismissive views of girls and what they can be, they exist in Australia,\" she said.\n\n\"We have to tackle that attitude here as well. It doesn't manifest in child marriage, but it does manifest in sexual harassment, gender inequality and gender-based violence.\"\n\nGovernor-General Sam Mostyn has been dedicated to gender equality, social justice and child rights. (PR IMAGE PHOTO)\n\nGovernor-General Sam Mostyn, recently announced as a new patron for Plan International Australia, said International Day of the Girl was a time to celebrate and highlight the change girls made around the world when they were not held back.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"If girls could be educated, empowered and included, it would mean a better world, not just for girls, but a better world for everyone,\" she said.\n\n\"Here in Australia, this is a moment of reckoning ... we cannot stop until we are all equal.\"",
        "source": "Yahoo"
    }
]