[
    {
        "url": "https://www.9news.com.au/national/speeding-victoria-learner-driver-caught-at-226-km-hr-on-monash-freeway-crime-news/5b15f32b-c5e3-4711-9595-43b9465119f9",
        "title": "Learner driver accused of clocking extraordinary speed on Monash Freeway",
        "publish_date": "Mon, 19 Jan 2026 01:13:04 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ebikes-sydney-call-for-action/6cee5ea0-fd92-4992-9ff6-ba616812e40a",
        "title": "'Anarchy': Call for action over e-bike gangs",
        "publish_date": "Sun, 18 Jan 2026 23:01:41 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": "A gang of teenagers on e-bikes have been captured hooning down streets and even a golf club on\n\nSydney's\n\nNorthern Beaches, sparking fears it's only a matter of time before there's another fatality.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/australian-open-adam-walton-carlos-alcaraz-first-round/106244122",
        "title": "What it's like to play the world number one at the Australian Open",
        "publish_date": "Mon, 19 Jan 2026 00:46:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "After reaching a career-high ranking of 74 three months ago, Adam Walton had reason to believe he could cause an upset or two at the Australian Open.\n\nThat was until the men's main draw was released last week and the 26-year-old Australian discovered the identity of his first-round opponent: world number one Carlos Alcaraz.\n\nAustralian Open: day two blog The Australian Open continues on day two, with Alex de Minaur among the local hopes taking to the court at Melbourne Park.\n\nIf Walton was to advance to the second round of the Australian Open for the first time, he was going to have play at a level well beyond his current ranking of 81.\n\nFar from being embarrassed by a player who has won six majors, Walton gave a solid account of himself in the 6-3, 7-6 (7-2), 6-2 defeat to Alcaraz on Rod Laver Arena on Sunday evening.\n\nRather than be disappointed with his performance, Walton appreciated the opportunity to face the Spaniard, who is tipped to be remembered as one of the greats of the game.\n\nSo, what is it like to play Alcaraz?\n\n\"For Alcaraz, I think he moves a bit different to the rest of the guys on the tour,\" Walton said.\n\n\"He has that extra venom on the short balls and on the balls that sit up a little bit more.\n\n\"Anytime he can get set on a forehand, he hits it at a different speed that I'm not used to.\n\n\"Obviously, I don't get that exposure week in, week out.\n\n\"It's just really cool to have shared the court on Rod Laver with him tonight.\"\n\nAdam Walton gave a solid account of himself against the world number one. (Getty Images: Shi Tang)\n\nWalton acknowledged he learned what separates the best from the rest.\n\n\"I played pretty well,\" Walton said.\n\n\"I thought I served well. I guess he was a little bit better at some moments than I was.\"\n\n'A difficult match'\n\nAlacaraz had defeated Walton when they first met last year, winning in straight sets on grass in the third round of Queen's.\n\nThere were tricky moments for the reigning French and US Open champion on Sunday, with Walton breaking his serve during the second set.\n\nAdam Walton (left) gained the respect of Carlos Alcaraz following their match. (AP: Dita Alangkara)\n\nAfter the match, Alcaraz was full of praise for Walton.\n\n\"It was, I would say, a difficult match for me,\" Alcaraz said.\n\n\"In the first set, just one break … I think he was playing really good, really solid. I think he was trying to find the position to attack every time he can.\n\n\"Then, the second set I think he found more spots to be aggressive … it was then more complicated for me.\"\n\nAlcaraz, who has never been past the quarterfinals at Melbourne Park, now turns his attention to his next opponent, Germany's Yannick Hanfmann.\n\nFor Walton, he will have to wait another year before he gets the chance to advance from the first round at his home major.\n\nBut he still walks away with memories he will cherish for the rest of his career.\n\n\"To be able to play on a big court against a big player, and especially at home to play on Rod Laver, I think that's a moment I will never forget,\" Walton said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/income-inequality-oxfam-report-calls-to-tax-billionaires/106236612",
        "title": "Calls to tax super-rich more as number of global billionaires hits record",
        "publish_date": "Mon, 19 Jan 2026 00:02:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia has 48 billionaires who hold more wealth than the bottom 40 per cent of the population combined, a new report by Oxfam Australia has found.\n\nIt says that with eight new billionaires added to Forbes's Australian billionaires list since 2020, they are now wealthier than almost 11 million Australians, with more than one third of those — or 3.7 million people — living in poverty according to the latest Poverty in Australia 2025 report by the Australian Council of Social Service and UNSW.\n\nAnd it is a global trend, Oxfam asserts, with the number of billionaires around the world passing 3,000 for the first time, with a combined wealth of $27.7 trillion. That figure is based on Forbes's global list of billionaires.\n\nThe report, Resisting the Rule of the Rich: Defending Freedom Against Billionaire Power, calls for a net wealth tax on the richest 0.5 per cent of households, with tax rates higher in line with increased wealth.\n\nThe Swiss ski resort of Davos hosts the 56th edition of the World Economic Forum this week. (Reuters: Denis Balibouse)\n\nIts release coincides with Monday's opening of the 2026 World Economic Forum in Davos, Switzerland. The five-day event — the 56th edition — will host more than 3,000 participants from 130 countries, including 65 heads of state.\n\nA 5 per cent wealth tax on Australia’s billionaires just last year could have raised $17.4 billion, Oxfam says, enough to deliver cheap childcare for all families, extend energy bill relief for another two years, and increase the humanitarian budget almost seven times over.\n\nOxfam Australia CEO Jennifer Tierney said what the organisation was advocating for was a \"stronger tax system\".\n\n\"Adding an additional 5 per cent to the tax would mean another $17 billion for ... things like childcare and housing ... as one in three Australians has faced food insecurity over the last year,\" Ms Tierney told the ABC.\n\n\" The gap between those doing it toughest and those benefiting most is stark, and well evidenced. \"\n\nBillionaire wealth in Australia is growing by almost $600,000 a day, Oxfam said.\n\nJennifer Tierney says the organisation is advocating for a \"stronger tax system\". (Supplied: Oxfam)\n\nConcerns over democracy threatened\n\nMs Tierney said there was a correlation between inequity and inequality in a country and the vibrancy of its democracy.\n\n91 millionaires paid no tax, ATO stats reveal There were 91 Australians who earned more than $1 million in total income yet paid no tax in 2022-23, new Australian Taxation Office (ATO) shows.\n\n\"The more and more the wealthy control politics or have influence over politics, the erosion partly because people push back and rise up and understand that they're not actually benefiting from the system that the government is putting in place.\n\n\"There becomes a tension and a lack of trust in democracy.\"\n\nThe report also notes the second US presidency of Donald Trump has come at the same time as a rapid rise in billionaires worldwide.\n\nBillionaire fortunes have grown three times faster than the average annual rate in the previous five years since the electoral victory of Donald Trump in November 2024, it said.\n\nTesla CEO Elon Musk — the world's richest man, who was integral to Mr Trump's campaign success and the first weeks of the president's second term — became the first billionaire to briefly surpass half a trillion dollars, the report found.\n\nSouth African-born Elon Musk, who promised massive cuts in US federal spending, is the world's richest man. (Reuters: Nathan Howard)\n\n\"Whilst US billionaires have seen the sharpest growth in their fortunes, billionaires in the rest of the world have also seen double-digit increases,\" the report said.\n\n\" Actions of the Trump presidency, including the championing of deregulation and undermining agreements to increase corporate taxation, have benefited the richest around the world. \"\n\nEnjoying abundant riches meant greater access to power, Oxfam says, with billionaires estimated to be 4,000 times more likely to hold political office than ordinary citizens around the world.\n\nThe super rich are then able, it argued, to shape the rules of our economies and societies to their greater financial benefit, sometimes to the detriment of the rights and freedoms of people around the world.\n\nIt also argues economic inequality plays a major role in the erosion of rights and political freedoms.\n\nCalls to end property tax breaks\n\nIn addition to a wealth tax, Oxfam is calling for a phasing out of negative gearing to close loopholes that allow wealthy individuals pay less tax — plus an end to capital gains tax discounts for individuals and trusts.\n\nRental market remains at record highs Australia's rental market is \"starting to rebalance\" with prices flat in some capital cities but affordability remains a concern, according to property portal Domain.\n\nThe capital gains tax discount is a 50 per cent discount on the tax paid when people sell an asset, like a property, if they have held that asset for more than 12 months.\n\nNegative gearing is the ability to deduct losses on an asset (such as expenses associated with renting out an apartment) from other taxable income, which allows people to lower their tax.\n\nThe introduction of the discount coincided with a rapid increase in the use of negative gearing because, together, they encourage investment in property to secure capital gains that are taxed at concessional rates while also enabling investors to deduct losses.\n\nThe report also found that the wealth divide had increased dramatically since the start of the COVID-19 pandemic in 2020.\n\n\"In 2022, nearly half of the world population (48 per cent), or 3.83 billion people, lived in poverty,\" the report said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/senegal-protests-then-wins-afcon-final-morocco/106243788",
        "title": "Senegal storms off field in penalty protest, then returns to win mad AFCON final",
        "publish_date": "Sun, 18 Jan 2026 23:47:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Senegal stormed off the field in protest at a penalty awarded against them before returning to beat hosts Morocco 1-0 after extra time and win the Africa Cup of Nations amid farcical scenes in Sunday's final.\n\nMidfielder Pape Gueye netted the 94th-minute winner after Morocco's star player Brahim Diaz had squandered the chance to win it for the home side by fluffing the last-gasp penalty in normal time following a 14-minute delay.\n\nSenegal coach Pape Bouna Thiaw ordered his players off and it was talisman Sadio Mane who persuaded them to return.\n\nThe penalty was awarded following a VAR check by Congolese referee Jean-Jacques Ndala after Diaz had been tugged to the ground by Senegal full-back El Hadji Malick Diouf while defending a corner five minutes into stoppage time.\n\nOfficials and players jostled with each other while the referee consulted the touchline screen and again when Senegal walked off.\n\nOnce the players returned to the field, Diaz inexplicably tried a Panenka-style chip and his weak penalty sailed tamely into the arms of Senegal goalkeeper Edouard Mendy.\n\nSenegal's players left the field in protest of a penalty awarded to Morocco. (Reuters: Amr Abdallah Dalsh)\n\nSenegal's actions will be seen as a major blight on an otherwise successful tournament, although defeat continued Morocco's poor record in the tournament, which it only previously won 50 years ago.\n\nSenegal, which has won twice in the last three editions, handed top-ranked Morocco its first defeat in 27 internationals.\n\nGueye's powerful shot gave Morocco goalkeeper Yassine Bounou no chance but he was forced into several other key saves, as was his counterpart Mendy in an end-to-end match.\n\nSenegal's every move was jeered by an ear-splitting cacophony of whistles from the 66,526-strong crowd, but they were undaunted as they took the game to Morocco.\n\nThey should have been behind midway through the first half when Idrissa Gana Gueye, captaining the team in place of the suspended Kalidou Koulibaly, lost possession to allow Ayoub El Kaabi to burst away on goal, but by the time he passed to Ismael Saibari his frontline partner was offside.\n\nThe energy-sapping pace of the game, with furious pressing and frenzied chasing, saw mistakes creep in with Morocco caught flat by Nicolas Jackson's 38th-minute pass to Iliman Ndiaye, whose shot was saved by Bounou.\n\nSenegal celebrates victory in the AFCON final. (Reuters: Amr Abdallah Dalsh)\n\nEl Kaabi had a glaring miss in the 58th minute, steering Bilal El Khannouss' curling delivery from the right narrowly wide of the goal when it looked easier to score.\n\nSenegal had the ball in the net two minutes into stoppage time in a goalmouth scramble, but Abdoulaye Seck had pushed Achraf Hakimi in the build-up and it was ruled out.\n\n\"We are really disappointed for all the Moroccan people,\" said their coach Walid Regragui.\n\n\"When you get a penalty in the last minute, you can see victory very close, but in the end football catches up with you.\n\n\"We congratulate Senegal, even if what we showed of African football was disappointing, given everything that happened when the penalty was awarded.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/australian-open-2026-live-alex-de-minaur-novak-djokovic/106243798",
        "title": "Live: Aussie comeback queen beams after pulling off first-round upset",
        "publish_date": "Sun, 18 Jan 2026 23:12:53 +0000",
        "category": "sports",
        "authors": [
            "Jon Healy",
            "Hanan Dervisevic"
        ],
        "text": "Marina Stakusic is in pursuit of a first ever Australian Open main draw win, clinching the opening set in fashion against Queenslander Priscilla Hon, 6-1.\n\nStakusic is using the court well, and has come out truly firing.\n\nHon on the other hand, has looked a bit nervous and anxious — you're playing your home major, your friends and family are in the stands and you've been given a wildcard, so you're very aware of all those things.\n\nIt's actually been a while since she has started directly in the main draw of a grand slam. Usually, Hon comes through qualifying but now she's come in cold (not many matches under her belt) where there's more excitement, and that's a challenge in itself.\n\nHon left the court at the end of the first set so hopefully she'll come out with a bit of a different mind set in the second set.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/2026-winter-olympics-ice-dancing-holly-harris-jason-chan/105896346",
        "title": "A small reminder of home anchors Australia's Olympic ice dancers",
        "publish_date": "Sun, 18 Jan 2026 22:39:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian ice dancers Jason Chan and Holly Harris both looked off camera as our online conversation drew to a close.\n\nWe were talking while the pair were in Chan's hometown of Montreal, Canada, where Australia's number one-ranked ice dancing team are based for the majority of the year.\n\nIt appeared there was an interloper to our conversation, albeit an adorable one.\n\n\"This is Piper,\" Harris said, making the introductions as Chan grabbed a toy poodle — wearing a jumper to deal with the autumnal Canadian chill — and held her up to the camera.\n\n\"Sorry for her impoliteness,\" Harris added.\n\nPiper's silent interruption was far from impolite.\n\nIndeed, so often are these two away from their home — every few weeks during the season — Piper, understandably inquisitive, quite reasonably decided she wanted to join in.\n\nPiper is a small reminder of home for Holly Harris. (Supplied: Hollu Harris)\n\nJust the week before we spoke late last year, the pair were in the Tblisi Ice Palace, Georgia, skating at the Trialeti Trophy International Skating Union (ISU) Challenger Series event.\n\nThey finished second in the former Soviet republic, their first medal at ISU Challenger level.\n\nA couple of weeks before that, they were in Beijing, earning Australia a quota spot for the Milan-Cortina Winter Olympic Games and fulfilling a life-long dream — confirmed today when they were named in the Olympic squad.\n\nHarris and Chan, along with figure skaters Anastasiia Golubeva and Hektor Giotopoulos, received the honour of becoming the first four athletes officially named to Australia's Olympic team for the 2026 Games.\n\nCompeting at an Olympics is a considerable reward, but the life of an Australian winter sport athlete can still be tough.\n\nA lack of facilities and opportunity means Australia's Winter Olympic hopefuls often have to travel far and travel often to get their chance.\n\nPiper, named after the eastern Sydney suburb of Point Piper, represents a small, desperately sweet reminder of home for Harris, whose dreams of representing Australia at the Winter Olympics have taken her halfway around the world.\n\nIt's a dream that is just days away from finally being realised.\n\nThe challenges of finding a dance partner\n\nHolly Harris and Jason Chan say picking a partner for ice dance is like dating. (Getty Images: Corbis/Tim Clayton)\n\nHarris moved to Canada when she was just 16, a teenager making a painful yet essential sacrifice to pursue her dreams.\n\nAnd events that met her when she arrived as a young woman in a foreign land couldn't have helped whatever anxiety she may have felt about moving away from everything she knew.\n\n\"I was actually moving to Montreal with a different partner,\" Harris said.\n\n\"And they ended up, really last minute, not coming.\n\n\"So I was 16 years old, just moved to a new country and found myself there, like, 'Oh, my God, what am I gonna do? My life's over.'\n\n\"But I was still really determined to keep training, to achieve my goals, so I was like, 'No, I'll skate by myself here.'\n\n\"And then Jason was here looking for a partner, so it was kind of just like fate, almost.\n\n\"We tried out for two weeks and then we were like, 'OK, yeah, let's give it a go' — and it ended up being pretty good.\"\n\nPretty good is one way of looking at it.\n\nBy finishing second at the Skate to Milano event, Harris and Chan — who took Australian citizenship in 2021 in order to compete with Harris — earned Australia a slot at the Winter Olympics in ice dancing, the country's first since Danielle O'Brien and Greg Merriman competed at Sochi in 2014.\n\nEarning a quota spot did not guarantee Harris and Chan a place at the Games themselves.\n\nBut as Australia's premier pairing, it was always going to be tough to overlook them.\n\nDance or figure skating?\n\nThere are some subtle differences between the skills involved in pairs figure skating and ice dance. (Getty Images: Fred Lee)\n\nIce dance is one of four figure skating disciplines that will be contested at the Winter Olympics.\n\nThere are solo competitions for men and women, while there is also a pairs competition, separate to ice dance.\n\nAustralia has also earned a pairs slot at the Games in Milano-Torino: Hektor Giotopoulos-Moore and Anastasia Golubeva will represent Australia in this discipline.\n\nSo what's the difference?\n\n\"The pairs and the ice dance sometimes get confused together because we're both duos,\" Chan explained.\n\n\"But the pairs do a little bit more acrobatic tricks. They lift a bit more above the head, and then they do all the jumps together.\n\n\"For us it's really about what the essence of the skating is, the dance and the skating skills.\"\n\nHarris took over.\n\n\"Skating skills, composition, performance, we also have lifts but they have different rules and requirements,\" she said.\n\n\"I would say ice dance is really about the whole package. We really want to tell a story on the ice, every aspect, every second of the programme.\n\n\"The goal is to look perfectly put together; you're always in character and the costumes and storytelling is really complete.\"\n\nHolly Harris and Jason Chan had to develop a close relationship in a short period of time. (Getty Images: CorbisTim Clayton)\n\nThe fact that Chan and Harris have developed the habit of finishing each other's conversations fits remarkably with the foundations of friendship that have had to develop for them to dance effectively together.\n\n\"People joke that it's kind of like dating,\" Harris said of how hard it was to select a dance partner.\n\n\"You have to try out, decide if it's gonna work out or not,\" she added before Chan chipped in.\n\n\"There's so many factors that go into it,\" he said.\n\n\"There is our personalities, if we mesh well, if our skating styles mesh well.\"\n\nThe timing of their partnership's beginning was less than ideal. COVID plunged the world into lockdown just as the pair were getting used to each other.\n\n\"We were stuck in our homes, doing Zoom calls with our coaching team, doing Pilates on Zoom, ballet workouts, everything,\" Harris said.\n\n\"I feel like it was like that for three months maybe. We slowly started going into the rink, they would find ice somewhere, we'd have to wear masks, there were a lot of rules and restrictions, and then eventually comps just kept getting cancelled and cancelled.\n\nHolly Harris and Jason Chan competed in the ISU World Figure Skating Championships together for the first time in 2021 in Stockholm. (Getty Images: Linnea Rheborg)\n\n\"So eventually … we both went back [to Australia] and we ended up staying there for like six months.\"\n\nHowever, the Zoom calls continued.\n\n\"We had lessons over Zoom, we prepared for our first world championships together via Zoom,\" Harris said, recounting the way their fledgling partnership had to overcome the issues to prepare for the 2021 Stockholm World Championships, which doubled as the final qualifier for the COVID-affected Beijing Games.\n\nDespite those \"less than ideal conditions\", Harris and Chan were tantalisingly close to reaching the Games, being named as one of the alternates, ready to step up in case of injury.\n\n\"We were pretty close,\" Harris said. \"We really were hoping [we would get there]. But it was very early in our partnership, so it was a stretch.\n\n\"But I think we did our best — we were alternates, so that hope [of getting a chance] remained throughout the last Games, so that was a little painful.\n\n\"I even got accreditation as an alternate. I don't know why, but that kind of made it a little more painful.\n\n\"This time it turned out differently.\"\n\nIt really did.\n\nOlympics 'My whole world'\n\nHolly Harris and Jason Chan earned their quota spot for the 2026 Olympics at the ISU Skate to Milano Figure Skating Qualifier in Beijing. (Getty Images: VCG/Tang Xinyu)\n\nChan and Harris set a personal-best score of 183.50 in Beijing's Skate to Milano event to secure their spot at the Games.\n\n\"It would have been nice [to qualify in 2022], but we were just so new as a team,\" Harris said.\n\n\"I think the experience would have just been so different and having achieved this goal in the way that we did this time, it was very transformative for us as athletes.\n\n\"I really feel like this made me become a stronger athlete, made me prioritise everything so much more.\n\n\"It's obviously my whole world, you know, it always has been, but not qualifying at worlds was just so gut-wrenching that it really put our butts in gear and we just really went for it.\n\n\"I knew I did everything I could … to achieve this goal, so going to the qualifier I was super confident.\n\n\"So I think, in those ways, it made us stronger and turned out for the better.\"\n\nHolly Harris and Jason Chan say it was emotional to qualify for a quota spot at the Games. (Getty Images: VCG/Tang Xinyu)\n\nHarris said that she was \"crying all evening\" after the pair secured their spot at the Games in China.\n\n\"I've lain up in bed at night as a little girl, dreaming of this moment, envisioning the Olympics and how it will be,\" she said.\n\n\"All of that just washes over you. You're almost in disbelief and it's just like, there's so much relief that you've finally achieved this goal that you've been waiting for.\n\n\"I was just so emotional … it was one of the best moments of my life.\"\n\nChan said seeing the scores come up and understanding what it meant was \"surreal\".\n\n\"Because it's the culmination of all the hard work and the journey,\" he said.\n\n\"For it to actually come to fruition is pretty amazing.\"\n\nIn all three competitions since the 2025 World Championships in March, Harris and Chan have finished on the podium.\n\nThe pair will compete in a handful of competitions before the Olympics to fine-tune their routine — including in China this week at the Four Continents competition — before heading to Italy in February for the realisation of their dream and the latest stop on what has been an incredible journey so far.\n\nHolly Harris and Jason Chan set a new personal best in Beijing at the start of this Olympic season. (Getty Images: Corbis/Tim Clayton)\n\n\"It's really satisfying to see that finally … things are coming together,\" Harris said.\n\n\"We worked so hard in the last six months from worlds and I really do feel like that's paying off.\n\n\"We just made sure we were ready really early this season and that's really helping us. So I think that's another lesson for the future seasons ahead, because that really just helped us grow faster this season.\"\n\nChan noted that although the hard work had never stopped, the momentum provided by a series of good results had been invaluable heading into their first Olympics together.\n\n\"The process is the same,\" Chan said.\n\n\"We just focus on improving every day … coming into the rink and focusing on what to do and doing our jobs.\n\n\"The process is the same from worlds last March but now we feel like there's a momentum coming up and going into Milan, which is exciting.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/conservationists-alarmed-riverstone-wetland-replacement/106227536",
        "title": "Accidental conservation success story under threat by government plan",
        "publish_date": "Sun, 18 Jan 2026 21:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Conservationists say ponds that have become home to endangered migratory birds are slated for removal under state government plans to develop Sydney's north-west fringe.\n\nLocal birdwatchers say the former waste ponds of a shuttered abattoir have become an ideal habitat for short-legged wader birds, including the endangered Australian painted snipe and the vulnerable sharp-tailed sandpiper.\n\nBirdwatchers are alarmed about the planned removal of the ponds in Riverstone in Sydney's north-west. (ABC Radio Sydney: Declan Bowring)\n\nAvian enthusiasts say the ponds also host birds that migrate as far as Antarctica and Alaska, such as the Pacific golden plover and the curlew sandpiper, which is considered critically endangered both nationally and in New South Wales.\n\nThe state government plans to rezone the currently vacant privately owned land for light industrial use, and replace the ponds with 57 hectares of wetlands, 18 hectares of which would be shallow wetland area.\n\nThe vulnerable sharp-tailed sandpiper has been spotted at the ponds. (Supplied: Mark Fuller)\n\nBirdwatchers say the ponds are ideal because they are above ground level and flood-proof, while other wetlands in Sydney such as Homebush, and the mooted replacements, would be flood-prone.\n\n\"It's the last place that they've really got that they can still find suitable conditions,\" veteran bird watcher Mark Fuller said.\n\n\" When it goes, these birds will have nowhere and there's a good chance that a lot of them will die. \"\n\nMark Fuller says the rare migratory birds will have nowhere to go. (ABC Radio Sydney: Declan Bowring)\n\nEndangered green and golden bell frogs have also been heard calling in one of the ponds by a field survey done for the private landowners, Garfield Pastoral Holdings and Leamac Property Group.\n\nThe new ponds to replace the old Riverstone Meatworks dams would be established before their removal.\n\nHowever, Mr Fuller says the proposed areas are close to creeks, which would make them flood-prone and often unusable to the rare short-legged birds.\n\nMaureen Harper says the government should turn the ponds into a birdwatching tourism destination. (ABC Radio Sydney: Declan Bowring)\n\n\"We're really down to the very last few remaining pieces of suitable wetland and that's not only in Australia,\" Mr Fuller said.\n\n\"Riverstone Meatworks [ponds] has got the runs on the board as far as attracting all the rare birds.\n\n\" I'm very sceptical that they could create anything as good as what they've already got. \"\n\nMarsden Park local and bird enthusiast Maureen Harper says the replacement ponds would also feature a high dirt wall around them, which would take away the birds' ability to spot predators.\n\nMs Harper would like to see the state government develop the ponds into a birdwatching tourism destination.\n\n\"It's the perfect opportunity to do some proper conservation,\" Ms Harper said.\n\n\" Don't throw it away, because nobody's ever going to replace it. \"\n\nDumping ground gets a new life\n\nThe dams were built in the 70s to be used as an effluent dumping ground by the Riverstone Meatworks.\n\nThey were built above ground and flood-proof so the waste would not pollute the nearby environment, including a pair of creeks that feed into the Hawkesbury River.\n\nBirdwatchers say endangered Australian painted snipe have been seen in the wetland. (Supplied: Edwin Vella)\n\nAfter the abattoir closed in 1994, the dams made for an ideal habitat because of their distance from human activity, protection against predators and their shallow depth ideal for short-legged wading birds.\n\nConservationists say the waste product has promoted the growth of microbial invertebrates that the migratory birds feed off.\n\nMP says road project will doom the ponds\n\nBefore entering politics, Riverstone MP Warren Kirby wrote a lengthy online blog post about the wetlands, referring to them as an \"oasis virtually nobody knew existed\".\n\nIn the post, Mr Kirby questioned redeveloping the ponds as \"to pave (avian) paradise and put up a housing lot\".\n\nWarren Kirby says a necessary road project will render the ponds unsuitable for the migratory birds. (ABC News: Isobel Roe)\n\nMr Kirby said part of the development includes a major road running near the artificial ponds that he says will make the ponds unattractive to migratory birds.\n\n\"A problem with that is all of the housing that's been built up all around it, that Bandon Road corridor is actually a really vital link,\" Mr Kirby said.\n\n\"The only way to prevent turning the migratory birds … off [the ponds] … is to get rid of both Bandon Road and essentially three-quarters of the Marsden Park North development.\"\n\nHe said while he doesn't support the ponds' removal, he understands the necessity of developing the area given the scale of housing development in neighbouring areas.\n\nThe state government plans to replace the current ponds (red) with larger habitats closer to nearby creeks. (Supplied: NSW Department of Planning, Housing and Infrastructure)\n\n\"The cost of that inaction at this point in time when all of the other residential development and all the other work has been done all around the place.\n\n\"It's not really a viable solution to say no.\"\n\nMr Kirby said the proposed alternative ponds would result in better, broader environmental outcomes for the area.\n\nJobs hub planned for new growth area\n\nThe state government announced the rezoning of the ponds and surrounding area as part of the Marsden Park North north-west growth area.\n\nWhen the rezoning was announced in November, the state government said the 1,200-hectare area would support about 3,900 new jobs and 960 new homes.\n\nNSW Planning Minister Paul Scully said the government was seeking public feedback on the plans until January 30.\n\n\"All submissions will be carefully considered to inform the final plans for the Marsden Park North precinct, including the settlement ponds,\" Mr Scully said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/man-injured-in-cliff-fall-black-rock-beach/106243498",
        "title": "Man suffers spinal injures in 40 metre cliff fall at Melbourne beach",
        "publish_date": "Sun, 18 Jan 2026 21:27:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "A man is in hospital after falling about 40 metres down a cliff at a beach in Melbourne's south.\n\nThe 18-year-old suffered spinal, arm and leg injuries after falling onto a ledge at Half Moon Bay in Black Rock about 8:30pm on Sunday.\n\nFire Rescue Victoria's (FRV) high angle rescue team joined State Emergency Service crews and paramedics as they attempted to reach the man.\n\nFRV Senior Station Officer Tyson Scurrah said the ledge was about 5 metres above the ground, which posed a further challenge for crews trying to treat him and bring him down safely.\n\n\"We were required to go down there and set up in very difficult terrain,\" he told ABC Radio Melbourne.\n\n\"It's all sandstone so nothing too stable for us to anchor our ropes off.\"\n\nHe said the teams rigged up a system that allowed paramedics to stabilise the patient and then lower him to the sand and walk him out along the beach.\n\n\" He's a very lucky person. \"\n\nThe rescue took about half an hour.\n\nThe man was then transferred to hospital in a stable condition.\n\nThe night-time beach rescue posed a challenge for rescuers. (ABC News)\n\nThe rescue happened on the same day a man aged in his 20s suffered serious injuries after falling from a a cliff at Mount Martha, about 50 kilometres to the south of Black Rock.\n\nRescue crews were called to The Pillars rock formations about 5:15pm.\n\nHe was flown to the Royal Melbourne Hospital in a serious but stable condition.\n\nJust days earlier, a woman fell off a cliff in Beaumaris — a suburb neighbouring Black Rock.\n\nShe remains in a critical condition in hospital.\n\nThere were also a number of similar rescues at beaches in Victoria in December.\n\nLifesaving Victoria rescues a paddleboarder who got into difficulty at Carrum Beach on Sunday. (Supplied: Carrum Surf Life Saving Club)\n\nMeanwhile, lifesavers carried out multiple rescues of paddleboarders around Melbourne yesterday as unusual easterly winds caught beachgoers unawares.\n\nCarrum Surf Lifesavers pulled seven paddleboarders back to shore and Lifesaving Victoria's watercraft rescued another two.\n\nThe club's Ben Rooks said there were also multiple rescues at neighbouring Chelsea, Aspendale and Bonbeach.\n\n\"People would go out within what they felt was their comfort zone and then suddenly realise, a bit like when you go for a bike ride and you've got a tail wind when you go out but then you've got a headwind when on the way back and suddenly you realise you're struggling a bit,\" Mr Rooks said.\n\nHe said most of the rescues were people aged in their 20s but there were some children rescued after drifting out into Port Phillip.\n\n\"If you've got children in the water, always keep them within arm's length so you can grab them if something happens,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/tooperang-fire-rips-through-grass-and-scrub-near-mount-compass/106243392",
        "title": "Bushfire south of Adelaide started by vehicle, CFS believes",
        "publish_date": "Sun, 18 Jan 2026 21:09:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "A bushfire that has ripped through more than 600 hectares and destroyed at least two family homes is believed to have been started by an \"accidental ignition\" from a vehicle, the Country Fire Service (CFS) says.\n\nHundreds of firefighters have been battling theTooperang fire which is burning near Mount Compass and remains uncontrolled.\n\nThe fire broke out about 4:30pm on Sunday and has so far blackened about 640 hectares of grass and scrub, the CFS said.\n\nThe fire has burned through more than 600 hectares. (Facebook: Willunga Country Fire Service)\n\nA watch and act message has been issued for an area including Tooperang, Nangkita, Mount Jagged and Mosquito Hill, with the CFS advising residents to take action.\n\nWater bombers have been battling the fire, which the CFS said had impacted an area between Nangkita Road and Cleland Gully Road, \"including structures and farm sheds\".\n\nDozens of firefighters and trucks have been involved in the CFS response. (ABC News: Caroline Horn)\n\nCFS deputy state controller Brenton Hastie confirmed at least three structures had been lost, including sheds and \"possibly a house\".\n\n\"I have no doubt in addition to the three structures we're able to confirm, that smaller assets — whether that be motorhome or smaller sheds — that toll would unfortunately rise,\" he told ABC Radio Adelaide.\n\n\"Crews were faced with 10 ignitions across a stretch of road yesterday.\"\n\nThe property losses include the motorhome of Natasha Price and the home of Isaac Selfe.\n\nHundreds of firefighters have been battling the Tooperang fire burning since Sunday. (Facebook: Willunga Country Fire Service)\n\nMr Hastie said the weather conditions today were \"more favourable\" than they were on Sunday and they were likely to downgrade the fire from a watch and act later today.\n\nHe also said there was a \"high level of confidence\" that the fire was caused by an \"accidental ignition\" from a vehicle.\n\n\"A vehicle travelling the road — whether that's [a] mechanical issue or something else. But we don't believe this was arson as we initially feared this fire started,\" Mr Hastie said.\n\nThe fire has ripped through more than 600 hectares. (Supplied: Courtney Christie)\n\nABC reporter Caroline Horn was in the area early this morning and said she could see burnt-out paddocks that were \"still smouldering\", as well as other damage.\n\n\"Unfortunately there is a structure that you can see that's been destroyed. I don't know whether it's a shed or a house,\" she told ABC Radio Adelaide.\n\nThe CFS said more than 200 firefighters supported by more than 60 trucks and other agencies including the Metropolitan Fire Service had worked into the night to reduce the fire's spread.\n\nA fire reconnaissance aircraft equipped with an infrared camera for detecting hot spots flew over the fire ground earlier this morning.\n\nThe CFS said it showed about 640 hectares had so far been burnt — up from an earlier figure of 450.\n\nThe extent of the damage is still becoming known. (Supplied: Courtney Christie)\n\nRoad closures are in place in the area.\n\nLocal state MP David Basham, who used to have a dairy farm in the area, said he was helping a local property owner move \"a fair number of cattle out of the way\" well into the night.\n\n\"It certainly was a challenging situation,\" he said.\n\n\"We were sort of just trying to defend and waiting for it to come out of the scrub and trying to put it out before it ran across the grassland, which would have been linked to another lot of scrub, so it was a fantastic job by those 20 local farmers up there.\"\n\nThe Tooperang fire near Mount Compass broke out on Sunday and burned through the night. (Supplied: Courtney Christie)\n\nAlpaca farmer Chris Williams said he had swiftly put his bushfire action plan into effect.\n\n\"One of the biggest problems this year is there's just so much tall grass around,\" he said.\n\n\"I rang a couple of neighbours just to make sure they were aware of everything, because the problem on a hot day is you can be sitting inside your house with your curtains drawn and air conditioner on and you're totally oblivious to what's happening outside.\"\n\nThe CFS said firefighters were working in difficult terrain including plantations. (ABC News: Caroline Horn)\n\nEarlier today, CFS state duty officer Ben Pettman said crews were working to stop the spread to Mount Magnificent and Cox Scrub conservation parks.\n\n\"Thankfully at this stage the fire hasn't entered either of those parks and crews are working really hard to contain the fire and limit the spread so it doesn't impact those areas,\" Mr Pettman said.\n\n\"The winds have kept the fire up overnight and the fire has continued to slowly burn through that inaccessible terrain — our crews have been working really hard overnight to try and implement control lines around this fire.\n\n\"The fire has continued to move in a south-westerly direction towards Cleland Gully Road. However, our crews have continued to hold the fire overnight but it is still burning in those inaccessible areas.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/no-end-in-sight-for-derelict-government-eyesore-boundary-road/106219474",
        "title": "Brisbane 'eyesore' remains as government reneges on construction date",
        "publish_date": "Sun, 18 Jan 2026 21:00:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "A derelict Brisbane block occupied by squatters and vandals will remain abandoned indefinitely as a government construction project stalls with no explanation.\n\nIt comes after the Queensland government evicted shopkeepers along Boundary Road in Coopers Plains so construction could begin on an overpass in mid-2025.\n\nThat construction never happened, and now the Department of Transport and Main Roads (TMR) says it has no timeline for when it expects work to begin.\n\nThe overpass is a joint project by all three levels of government and featured heavily as a federal election promise on the 2022 campaign trail.\n\nThe Coopers Plains overpass has been promised by successive governments since the 1980s.\n\nA broken promise\n\nSuresh Chandra says he now feels unsafe in his own neighbourhood. ( )\n\nSuresh Chandra, who lives down the road from the abandoned \"eyesore\", said residents felt disillusioned.\n\n\"The promise has been broken to the local people,\" Mr Chandra said.\n\n\"Those poor shopkeepers have stopped earning money and their livelihoods have been lost.\"\n\nMr Chandra said it was \"scary\" living near the site due to the trespassers he had seen hanging around the abandoned shopping malls and business centre.\n\nThe project was supposed to remove the level crossing at Coopers Plains and replace it with an overpass with an elevated three-way intersection and pedestrian-cycle lanes.\n\nThe Coopers Plains shopping centre is regularly vandalised. The shop windows have been bashed in by vandals. (ABC Radio Brisbane: Kenji Sato) The Coopers Plains Business Centre has attracted squatters and vandals. ( ) The business centre lies empty and abandoned. (ABC Radio Brisbane: Kenji Sato) The Coopers Plains Shopping Centre site has been sitting abandoned since August. The Coopers Plains Shopping Centre regularly attracts squatters. (ABC Radio Brisbane: Kenji Sato) The notorious Boundary Road level crossing. ( ) Boundary Road is a major thoroughfare. (ABC Radio Brisbane: Kenji Sato)\n\nA spokesperson for Federal Transport Minister Catherine King said they were working towards a start date.\n\n\"The Boundary Road Level Crossing Removal was a 2022 election commitment and remains a priority for the Australian government,\" the spokesperson said.\n\n\"Residents of Coopers Plains experience some of the longest delays due to the level crossing gates being down and this will only get worse when the Cross River Rail project is completed.\n\n\"The Australian government remains willing to work with the Queensland government to ensure early works can commence without further delay, and to understand what is required to deliver the project in full.\"\n\nThe spokesperson did not respond to 612 ABC Radio Brisbane's questions on what caused the delay.\n\nNo explanations given\n\nRowan Gray says the level crossing removal will reduce delays for train passengers, cyclists, and pedestrians. ( )\n\nBetter Transport Queensland president Rowan Gray said this was a serious lack of transparency from the state and federal governments.\n\n\"It's really disappointing that the Queensland government and TMR haven't been up-front with the public on what's causing this delay,\" Mr Gray said.\n\n\"It makes the travelling public a lot more sceptical of whether we're going to have a successful Cross River Rail opening or whether we're going to have a successful 2032 Olympic Games.\"\n\nMr Gray said the level crossing removal would drastically improve commute times for public transport users, cyclists, pedestrians and drivers.\n\nHe said it was crucial to remove the Boundary Road level crossing before the Cross River Rail project was completed, since it intersected with the rapidly growing Gold Coast Line.\n\nA TMR spokesperson said the project remained a priority.\n\n\"The Queensland government remains committed to the project with procurement and construction timeframes subject to further negotiation with the Australian government.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-19/nt-cdu-recycled-rubber-tyres-stronger-roads-heat-waste/106204858",
        "title": "Old tyres could help build tougher roads for the NT's extreme climate",
        "publish_date": "Sun, 18 Jan 2026 20:53:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Repurposing old tyres may be the key to building stronger, longer-lasting roads to handle the Northern Territory's harsh climate, say researchers.\n\nAbout 400 tonnes of tyres are discarded by Darwin residents and commercial operators every year.\n\nThey are dropped off at Shoal Bay Waste Management Facility, stored, then sent interstate or overseas for recycling.\n\nCrumb rumber from old tyres, along with plastics from shrink wrap and shampoo bottles are among the materials being repurposed. (ABC News: Tilda Colling)\n\nBut researchers at Charles Darwin University (CDU) are investigating whether recycled materials, including granulated crumb rubber from ground-up tyres and plastics, can instead be used to improve NT roads.\n\nCDU has been collaborating with the NT Department of Logistics and Infrastructure to test this theory since late 2021.\n\nPhD student with the university, Ramin Shahbazi, said flexible materials — which bend and flex under the weight of traffic — were often used in the road construction process.\n\nRoads in the NT face some of the harshest weather conditions in the country, from blistering heat to drenching rains. (ABC News: Michael Franchi)\n\nBut he said a different approach was needed in places such as the NT, where extreme weather conditions proved challenging.\n\n\"When we have a flexible pavement made of asphalt, it's constantly changing when it's exposed to hot weather and moisture from the rain,\" he said.\n\n\"We wanted to try and replace regular material that was being used in the pavements with recycled alternatives — but try to keep the performance as it is, or also maybe improve it.\"\n\nRamin Shahbazi says flexible pavements made of asphalt can crack under the pressure of extreme weather in the NT. (ABC News: Tilda Colling)\n\nReclaimed asphalt, crushed glass, recycled concrete and crumb rubber from tyres and plastics are being tested with the aim of improving road durability, a Department of Logistics and Infrastructure spokesperson explained.\n\nSenior CDU engineering lecturer and PhD supervisor, Ali Rajabipour, said both council budgets and the environment would benefit from giving the alternative materials a new life.\n\nTyres waiting to be recycled at the Shoal Bay Waste Management Facility in Karama. (ABC News: Michael Franchi)\n\n\"Some countries [burn tyre waste], that's not the best way to use crumb rubber … it produces fumes, which are not very healthy,\" he said.\n\nDr Rajabipour said the NT could save about $2 million a year by recycling materials dumped in landfill.\n\nAli Rajabipour says the NT could save millions of dollars by repurposing waste. (ABC News: Tilda Colling)\n\nCircular economy is the goal\n\nThe City of Darwin has committed to a \"circular economy\", where waste materials are reused and recycled.\n\nBut the council's head of environment and waste, Nick Fewster, said achieving that goal could be logistically challenging.\n\nNick Fewster says materials are often sent overseas for processing. (ABC News: Michael Franchi)\n\nMr Fewster said repurposing disused tyres locally would reduce the environmental impact made by freight activity as transporting waste — including sending materials off-shore for processing — produced carbon emissions.\n\n\"We're all about diverting waste from landfill and reusing materials where possible as part of the circular economy,\" he said.\n\nBut waste management is only part of the equation.\n\nNik Kleine and Nick Fewster inspecting the recycling facility in Karama. (ABC News: Michael Franchi)\n\nCouncil's head of infrastructure, Nik Kleine, said Darwin roads faced unique weather challenges across both the NT's wet and dry seasons which could shorten the life span of road surfaces.\n\n\"You'll see cracking, you'll see potholes,\" he said.\n\nMr Kleine said the CDU trial was an opportunity to give new life to products that would otherwise be sent to landfill.\n\nTyres that are no longer roadworthy can be repurposed into new products. (ABC News: Michael Franchi)\n\nWhat happens next?\n\nIf the research proves successful, Mr Kleine said City of Darwin would consider trialling the recycled materials in local roads.\n\n\"It's done through a tender process … and [this project] would definitely tick the sustainability and environment box,\" he said.\n\nFilippo Giustozzi, professor of civil and infrastructure engineering at RMIT University, said the investigation aligned with existing evidence on the benefits of crumb rubber in asphalt — but warned its effectiveness would need to be proven under territory conditions.\n\n\"Challenging environments like the Northern Territory — with extreme heat, UV exposure and intense tropical rainfall — require site-specific testing to confirm durability, ageing behaviour and moisture resistance over time,\" he said.\n\nThe rubber from old tyres can be recycled. (ABC News: Michael Franchi)\n\nProfessor Giustozzi also said recycled plastics were still relatively new in road construction and often needed to be combined with traditional materials to ensure long-term performance.\n\nThe NT Department of Logistics and Infrastructure said laboratory testing was about 75 per cent complete, with more than 8,000 tests conducted so far.\n\nRoad trials using recycled materials are expected to begin early this year.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/a-new-cbd-grill-serving-wagyu-steak-frites-for-less-than-30-20260119-p5nv4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A new CBD grill serving wagyu steak frites for less than $30",
        "publish_date": "Mon, 19 Jan 2026 13:24:24 +1100",
        "category": "finance",
        "authors": [
            "Emma Breheny"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 7 Steak frites made with Angus rostbiff at Common Cuts, a new city grill. Alex Coppel 2 / 7 Inside the Russell Streett steakhouse. Alex Coppel 3 / 7 Steak frites start at $28.50. Alex Coppel 4 / 7 Steak frites made with wagyu flank. Alex Coppel 5 / 7 The cheeseburger with extra wagyu. Alex Coppel 6 / 7 Yorkshire pudding with padron peppers. Alex Coppel 7 / 7 DJ Ajeet inside the restaurant. Alex Coppel Previous Slide Next Slide\n\nSteakhouse$$$$\n\nAt Common Cuts, opposite Old Melbourne Gaol on Russell Street in the CBD, it’s all about the sub-$30 steak frites. Diners choose between a 220-gram piece of Black Diamond wagyu flank or a 300-gram O’Connor Angus rostbiff cooked over charcoal. Fries are included in the $28.50 dish, but sauces cost an additional $4.50.\n\nBeyond the two entry-level steak frites, there are seven more options priced between $45 and $185 from various producers. A further three O’Connor steaks, dry-aged for four weeks by supplier Vic’s Meat, go up to $220 for a one-kilogram T-bone. Sauces go beyond the typical bearnaise or red wine jus. Charred spring onion and malt butter, mustard and horseradish, and chimichurri are among the six choices.\n\nThe menu also includes steak tartare made with a mix of Angus rump, rostbiff and tenderloin, plus a decadent wagyu lasagne garnished with bone marrow. A 180-gram cheeseburger on a Martin’s potato roll ($28.50) can be upgraded to a wagyu-on-wagyu blowout ($48.50) where 85 grams of sliced A5 Japanese wagyu are laid on top of the melted cheese.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/sydney-fish-market-opening-live-new-836-million-site-opens-at-blackwattle-bay-20260119-p5nuzi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Fish Market opening LIVE updates: Foodies, shoppers flock to new $836 million site at Blackwattle Bay",
        "publish_date": "Mon, 19 Jan 2026 13:24:02 +1100",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "Crowds are being told to either wait in line or “come back later” as the new fish market officially reaches capacity.\n\nWardens were seen herding the queue and telling visitors to “come back this evening” as a long line of patrons snaked down Bridge Road.\n\nJust hours after opening, many visitors have been told to turn around and come back later. Credit: Wolter Peeters\n\nAlex Jensen, who took a train and tram to the soak in the market’s opening day said it was disappointing.\n\n“All we were told is that it’s full and we either have to queue up or come back later,” he said. “It’s disappointing because we made the trip especially to be here.”\n\nPeople line up to get into the new Sydney Fish Market. Credit: Dominic Lorrimer\n\nAs of 12.45pm the queue time to enter the market was running at 20 to 30 minutes.\n\nVisitors are being told by fish market staff that the space is at capacity, and that no one else will be allowed in just five hours into the grand opening day.\n\nGarner and Michelle Annett made a reservation at a restaurant inside the fish market, but have been waiting in line for more than 40 minutes. They were told by staff that markets had reached capacity.\n\n“The restaurant is ringing and saying ‘where are you?’” Michelle said.\n\n“They’ve said they’re going to hold [the table] but we’ll see how that goes,” Garner said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-live-2026-de-minaur-begins-open-quest-gauff-swiatek-djokovic-in-action-20260118-p5nuwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open LIVE 2026: De Minaur begins Open quest against American Mackenzie McDonald; Gauff, Swiatek, Djokovic in action",
        "publish_date": "Mon, 19 Jan 2026 13:22:15 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Scott Spits"
        ],
        "text": "Both tennis figures are Asian-American, both call California home and both have made big inroads in tennis at a young age.\n\nRising star Learner Tien, who shocked Daniil Medvedev last year at the Australian Open on the way to the fourth round, joined forces with Michael Chang midway through 2025, signing the American great as his new coach.\n\nLearner Tien in action. Credit: Getty Images\n\nTien, 20, had another breakout season last year, improving his ranking to as high as world No.26, winning his first ATP title and ruling the roost at the Next Generation ATP Finals, which showcases the game’s young stars.\n\nThe left-hander is happy with his progression, delivering on a goal to win his first title before his 20th birthday, and agrees that last year’s second-round win over Medvedev – a near five-hour match that finished in the early hours – was a significant moment.\n\nCoach and former star player Michael Chang. Credit: Getty Images\n\n“That match actually got me into the Top 100. I started to feel more and more like I belonged,” said Learner, who has Vietnamese heritage, ahead of his Australian Open first-round match against countryman Marcos Giron this afternoon.\n\nChang, a former world No.2 and the youngest man in history to win a singles major – the 1989 French Open title – doesn’t want to put a ceiling on Learner’s potential this year.\n\n“For me personally … if you look at this past year, Learner’s beaten more Top 10 guys than anybody else apart from Carlos [Alcaraz] and Jannik [Sinner],” Chang said.\n\n“When you’ve beaten Top 10 guys … that should give you some confidence.\n\n“For me as a coach, for me personally, I have that belief in him as a person [and] in his game – obviously he’s still learning a lot, he’s still growing a lot, he’s still improving.\n\n“But I think it’s been pretty incredible for him to go through a first full season and accomplish what he has accomplished in such a short period of time.”\n\nLearner and Chang’s paths first crossed a little over a year ago in Hong Kong. As they learnt about each other last year, joining forces seemed the right choice.\n\n“Some aspects (of our relationship and similarities) makes it a little bit easier. We can talk about things that are in Orange County. He knows what I’m talking about, and I know what he’s talking about,” Chang said.\n\n“The one thing that actually has been quite nice is that Learner’s very cerebral, so he’s a thinker out there (on the court), which is very similar to how my mind works.\n\n“I’ve always been a little bit before [inclined to] … over-share about different things, whether it was, you know, technically or strategically.\n\nLearner Tien, 19, caused a massive upset by ousting Medvedev in 2025. Credit: AP\n\n“But Learner doesn’t have an issue with that. He absorbs things very well, he understands things very well. So that’s been refreshing for me as a coach because I don’t have to hold back.”\n\nTien wasn’t even born when Chang retired in 2003, seven years after he lost the Australian Open final to Boris Becker.\n\nTien said his agent did most of the “heavy lifting” when he secured Chang. “I think it’s been a great fit so far,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/storm-s-opponent-was-ranked-327-places-higher-than-her-she-won-anyway-20260119-p5nv14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Storm’s opponent was ranked 327 places higher than her. She won anyway",
        "publish_date": "Mon, 19 Jan 2026 13:18:42 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "When Australian Storm Hunter ruptured her Achilles in April 2024, she didn’t know if she’d ever be able to return to her home slam.\n\nShe was doubles world No.3, had won six singles matches in a row (including qualifying) in Melbourne earlier that year and was preparing to represent Australia at the Billie Jean King Cup when she suffered the potentially career-ending injury.\n\nStorm Hunter celebrates victory at Melbourne Park. Credit: Eddie Jim\n\nBut on Monday afternoon, in front of a roaring crowd at Kia Arena, Hunter was an Australian Open winner again, defeating Spain’s Jessica Bouzas Maneiro 6-4, 6-4.\n\nIt was a win against the odds – Bouzas Maneiro is ranked 327 places higher than Hunter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/larvotto-nsw-antimony-production-gathers-pace-as-growth-options-build-20260119-p5nv46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Larvotto NSW antimony production gathers pace as growth options build",
        "publish_date": "Mon, 19 Jan 2026 12:45:29 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Larvotto Resources is fast emerging as a near-term critical minerals producer, with refurbishment works and underground mining activities at its Hillgrove antimony–gold project in NSW on track and, importantly, on budget, ahead of a return to production by mid-year.\n\nAlongside Hillgrove, the company is lining up its next growth moves, eyeing a rare earths opportunity in Western Australia and a promising copper play near Mt Isa in Queensland as potential next chapters in the company’s expansion story.\n\nAnaiwan cultural mural at Larvotto Resources’ Hillgrove Hub. The artwork will feature on the Hillgrove high-vis work shirts.\n\nIn NSW, meanwhile, Larvotto has wasted no time shifting its high-grade gold and antimony mine into execution mode, ripping out and dispatching processing plant equipment for refurbishment, while upgrading site services.\n\nUnderground mining has also restarted, with contractor PYBAR now fully mobilised. Rehabilitation of more than 2,500 square metres of underground drives is now complete and waste haulage is underway ahead of ore development blasting expected in early February.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/lygon-street-s-last-butcher-has-a-new-owner-with-a-familiar-name-20260119-p5nv0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lygon Street’s last butcher has a new owner with a familiar name",
        "publish_date": "Mon, 19 Jan 2026 12:38:48 +1100",
        "category": "finance",
        "authors": [
            "Emma Breheny"
        ],
        "text": "Advertisement\n\nEating outMelbourne icon Lygon Street’s last butcher has a new owner with a familiar name Customers of the legendary Donati’s butcher shop in Carlton feared the end was nigh when its founder announced his retirement. But their prayers may have been answered by a buyer who wants business as usual. Emma Breheny Updated January 19, 2026 ,first published January 19, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDonati’s Fine Meats, a fixture of Lygon Street since 1972, will continue to trade as a butcher shop with a new owner – who has a name familiar to many on the strip – taking the reins from founder Leo Donati, who is retiring. When the 77-year-old Donati announced his plans to sell the business and retire late last year, it sparked worry that the last butcher shop of Carlton’s Little Italy would also become history. Leo Donati and son Marcello of Donati’s butcher shop on Lygon Street, Carlton. Eddie Jim But Jamie Valmorbida, part of the family who own King & Godfree and several other businesses nearby, has purchased the shop with the intent to continue supplying pork sausages, veal and other meat to its many regular customers. Significantly, he will not be changing the name of the shop. “The shop’s already thriving. My job is to protect that,” said Valmorbida. “Over time, we think the brand has potential, and I’m excited to explore that in the future. But the focus right now is doing the fundamentals right.”\n\nAdvertisement\n\nDonati’s reputation is for more than just excellent meat. The shop is well-known for playing classical music all day, artworks honouring cows and pigs, fresh flowers on the counter, and high-quality conversation spanning current affairs, books, composers and more. Valmorbida takes possession on January 30 and will work with Leo Donati’s son Marcello on a transition. Most of the art and Leo’s playlists come with the sale. Jamie Valmorbida (right) with King & Godfree co-director Luca Sbardella. Wayne Taylor Butcher Sam Spagnuolo, an employee of more than 20 years, will remain while Mark Glenn, executive chef of several Valmorbida venues, will oversee operations. There are plans to recruit a head butcher, and build a team of both current and past team members. “It’s impossible to replace Leo and Marcello but creating a unique service experience is going to be a priority,” Valmorbida said.\n\nAdvertisement\n\nWhile he wouldn’t expand on his ideas for the shop’s future, including new products, Valmorbida said any changes would be six to 12 months away. “The beauty of Donati’s is what’s there. We’re not going to change the core, but we will try some things around the side,” he added. The sale came about when Valmorbida was picking up a ham for Christmas and Leo Donati jokingly asked if he would buy the business. “I said: ‘You’ve planted the seed’ and it was genuine. From there, it moved really quickly.” The two families have long orbited the same world of Carlton’s Lygon Street. The Valmorbida name has been linked with King & Godfree, a deli and continental grocer on the corner of Faraday Street, since 1955. In more recent years, the family’s portfolio has skewed towards hospitality, much like the rest of Lygon Street. Their businesses include rooftop bar Johnny’s Green Room, Pidapipo gelato shops across Melbourne, and restaurants within King & Godfree, which has been closed since July 2024 for further changes and will reopen in stages, beginning February.\n\nAdvertisement\n\nLeo Donati said in a statement: “Jamie shares our values of quality, craft and a long-term commitment to the Carlton neighbourhood,” he said. “Marcello and I feel confident Donati’s is in the right hands as it moves into its next chapter.” Marcello Donati has been contacted for comment. Related Article ‘It’s not just a butcher’: Legendary Carlton shop Donati’s celebrated in its final weeks\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/frustration-mounts-as-borges-blows-up-20260119-p5nv3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Frustration' mounts as Borges blows up",
        "publish_date": "Mon, 19 Jan 2026 12:29:32 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Frustration' mounts as Borges blows up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/appeasing-trump-won-t-work-could-europe-deploy-its-bazooka-over-greenland-20260119-p5nv0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Appeasing Trump won’t work. Could Europe deploy its ‘bazooka’ over Greenland?",
        "publish_date": "Mon, 19 Jan 2026 11:59:23 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "When Donald Trump arrives at Davos later this week he’s likely to receive a frosty reception from European leaders now scrambling to decide on a response to his threat to impose tariffs on European, UK and Nordic economies unless they deliver Greenland to the US.\n\nHis announcement – not an official White House announcement, but a social media posting – that the US would impose 10 per cent tariffs on Germany, France, the UK, the Netherlands, Finland, Sweden, Norway and Denmark on February 1, that would escalate to 25 per cent on June 1 until a deal on America’s ownership of Greenland is reached, has already ignited discussion of European retaliation.\n\nDonald Trump’s threat to increase tariffs unless the US buys Greenland has sparked discussion about retaliation. Credit: AP\n\nAn emergency meeting of EU leaders will be held this week to decide how to respond to Trump’s threats, which have been described in Europe as blackmail, but are more akin to extortion.\n\nAlready in question is the trade deal the EU and US agreed on last July, under which EU exports to the US would incur a 15 per cent tariff, while US exports to the EU would be tariff-free. That deal was supposed to be ratified by the European Parliament late next week, but that vote is now likely to be suspended.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/why-this-is-the-most-dangerous-time-to-swim-in-sydney-20260119-p5nv0s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why this is the most dangerous time to swim in Sydney",
        "publish_date": "Mon, 19 Jan 2026 11:55:28 +1100",
        "category": "finance",
        "authors": [
            "Angus Dalton"
        ],
        "text": "Bull shark activity in Sydney Harbour is increasing during the warmer months and the season where swimmers are at risk of bites is expanding as water temperatures climb due to climate change, which is just one of the factors that may be driving an increase in shark bites in NSW.\n\nA 12-year-old boy bitten near Nielsen Park in Sydney Harbour marks the state’s latest shark attack.\n\nIt is not known yet what kind of shark attacked the boy but this is the time of year when many bull sharks inhabit the harbour.\n\nWhat were the factors behind the attack?\n\nShark Beach is netted during the summer months to protect swimmers, although the boy was reportedly jumping off the six-metre rock ledge into the water outside the net.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/senegal-players-stormed-off-the-field-in-the-africa-cup-of-nations-final-better-times-were-ahead-20260119-p5nv1e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Senegal players stormed off the field in the Africa Cup of Nations final. Better times were ahead",
        "publish_date": "Mon, 19 Jan 2026 11:51:52 +1100",
        "category": "sports",
        "authors": [
            "Mark Gleeson"
        ],
        "text": "Rabat: Senegal stormed off the field in protest at a penalty awarded against them before returning to beat hosts Morocco 1-0 in extra time to win the Africa Cup of Nations amid farcical scenes in Sunday’s final.\n\nMidfielder Pape Gueye scored the 94th-minute winner after Morocco’s star player Brahim Diaz had squandered the chance to win it for the home side by fluffing the last-gasp penalty in regular time following a 14-minute delay that included the Senegal walk off.\n\nThe foul\n\nSenegal coach Pape Bouna Thiaw ordered his players off, and it was left to former Liverpool player Sadio Mane who persuaded them to return.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-tennis-open-draws-record-breaking-crowd-on-day-1/rfbyxntcl",
        "title": "Australian Tennis Open draws record breaking crowd on Day 1",
        "publish_date": "Mon, 19 Jan 2026 02:20:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe sound of a record-breaking crowd packed into Melbourne Park on Sunday, more than 100,000 fans turning up to cheer on tennis greats on day one of the 2026 Australian Open.\n\n\n\n\n\nIt was an exhilarating opener to the two-week tournament- with two world number ones, Carlos Alcaraz and Aryna Sabalenka progressing to the second round with straight-sets victories.\n\n\n\n\n\nBelorussian star Sabalenka had a slow start, losing consecutive points to French wildcard Tiantsoa Rakotomanga Rajaonah in the first set.\n\n\n\n\n\nBut she quickly turned the match around, her 6-4, 6-1 win moving her a step closer to her third Australian Open title in four years.\n\n\n\n\n\nShe says it was her well-practiced serve-and-volley approach which secured her the match.\n\n\n\n\n\n\"I'm super happy to be able to do it on the match. You know, on the practice is one thing, but to be able to be kind of, like, fearless and go there at the match is something else. I'm really proud I'm able to show this tennis.\"\n\n\n\n\n\nBut she says staving off nerves was made harder by the front-row presence of Swiss legend Roger Federer and Australian hero Rod Laver.\n\n\n\n\n\n\"The whole match I was just telling myself, do not look there, please, do not look. But yeah, it's incredible. I would never thought that Roger Federer and Rod Laver are going to be sitting first row watching my match. Yeah, that's unbelievable.\"\n\n\n\n\n\nMen's world number one Alcaraz is a step closer to his first Melbourne title, continuing his campaign to become the youngest player to ever complete a career Grand Slam - a win at all four major tennis tournaments.\n\n\n\n\n\nIn the final match of the day on Rod Laver Arena, the 22-year-old Spaniard secured his win against Australian Adam Walton 6-3, 7-6, 6-2.\n\n\n\n\n\nHe says it's been disappointing the last two years not moving past the quarterfinals, something he's determined to change.\n\n\n\n\n\n\"But I just really want to perform better than I did previous years. So I just feeling this year probably it is one of those years that I will be able to or I will have the chance to go further.\"\n\n\n\n\n\nThere were four Australians on the court on day one, but only one was victorious, with Australian Wildcard Talia Gibson beating world number 62 Anna Blinkova 6-1, 6-3.\n\n\n\n\n\nThe 21-year-old will play either Czech two-time grand slam winner Barbora Krejčíková, or 23rd seed Diana Shnaider in the second round.\n\n\n\n\n\nBut Tennis great Venus Williams won't be progressing to the next stage, after losing to 24-year-old Serbian Olga Danilovic [[dah-nee-lov-itch]] 6-7, 6-3, 6-4.\n\n\n\n\n\nAt the age of 45, Williams received a wildcard to become the oldest woman ever to compete in the singles main draw, returning to the tournament after five years.\n\n\n\n\n\nThe veteran player says her tennis is still improving with every match.\n\n\n\n\n\n\"I'm really proud of my effort today, I'm playing better with each match and getting to the places I want to get to. And right now I'm going to have to just keep going forward and working on myself, you know, I'm still learning. It's kind of weird. But it's super exciting to have played that well, and get myself into that position, and get very close.\"\n\n\n\n\n\nNine Australians are are set to play on day two at Melbourne Park, with home favourite Alex de Minaur taking on American Mackenzie McDonald second on centre court.\n\n\n\n\n\nAustralian Ajla Tomljanovic, who was forced to drop out of the Adelaide International last week with a shoulder injury, will be up against Ukrainian Yuliia Starodubtseva this evening on John Cain Arena.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/wealth-tax-australia-billionaires-oxfam/9wsstq0nw",
        "title": "$17.4 billion a year: As the rich get richer, could a wealth tax disrupt the 'vicious cycle'?",
        "publish_date": "Mon, 19 Jan 2026 00:57:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the world's billionaires grow richer by the day, a few dozen people in Australia hold more wealth than the bottom 40 per cent of the population combined, according to new analysis by Oxfam.\n\n\n\n\n\nOver the past year, Australian billionaires' average wealth grew by almost $600,000 a day, the charity group found.\n\n\n\n\n\nMeanwhile, 3.7 million people, including 757,000 children, were living below the poverty line, according to the Australian Council of Social Service, while many others face mounting financial pressure from rising living costs and increasingly unaffordable housing.\n\n\n\nIn its annual inequality report, released on Monday, Oxfam noted that ordinary people around the world are experiencing relentless food price rises, with one in four people experiencing moderate or severe food insecurity.\n\n\n\n\n\nIn contrast, global billionaire wealth last year increased three times faster than the average annual rate over the previous five years.\n\n\n\n\n\n\"We're really seeing acceleration in billionaire wealth globally and in Australia,\" Oxfam Australia chief executive Jennifer Tierney told SBS News.\n\n\n\n\"We've added eight billionaires since 2020, and we are now at a total of 48 Australian billionaires. Those 48 people actually have more wealth than the bottom 40 per cent of Australians, so 11 million people.\n\n\n\n\n\n\"It's an inequitable, unsustainable and we think, amoral thing for so few people to have accumulated so much of the wealth of this country.\"\n\n\n\nCalls for a wealth tax\n\nOxfam is calling on the Australian government to introduce a wealth tax, among other measures, to reduce inequality, curb the growth of extreme wealth and generate revenue to fund essential services.\n\n\n\n\n\nThe 2024-25 wealth increase alone of Australia's richest man, property mogul Harry Triguboff, was enough to fund the construction of around 10,600 homes, according to Oxfam's analysis.\n\n\n\nThe group estimates that a 5 per cent wealth tax on Australia's billionaires last year could have raised $17.4 billion — funds that could reduce pressure on housing and childcare costs, extend energy bill relief and increase the humanitarian budget.\n\n\n\n\n\n\"There's some very tangible things that can be done to make sure that that inequity doesn't continue at the pace that it has been,\" Tierney said.\n\n\n\n\n\nThat could include ending the capital gains tax discount and phasing out negative gearing, she argued.\n\n\n\n\n\n\"We've got to stop setting policy which benefits the wealthy, like [the] negative gearing and capital gains tax system that allows for people who already have accumulated wealth to invest in housing and then get a tax benefit from that.\"\n\n\n\nThe Greens have repeatedly proposed a 10 per cent tax on the net wealth of Australian billionaires to bring down the costs of food, medical and dental care, public transport and university education.\n\n\n\n\n\nIn a report released in August, the Australia Institute said a 2 per cent wealth tax on people worth more than $5 million (excluding the family home and superannuation) would raise $41 billion per year.\n\n\n\n\n\nThe government would generate another $19 billion per year if it scrapped the capital gains tax discount, the think tank found.\n\n\n\n\n\n\"Australia is a low-tax country that does not do a good job of taxing wealth,\" Matt Grudnoff, a senior economist at the institute, said at the time.\n\n\n\n\n\n\"Correcting this would raise huge amounts of extra revenue for essential services and ease growing inequality in Australia.\"\n\n\n\nConcerns about social cohesion worldwide\n\nOxfam's global report links wealth disparities to political inequalities and democratic backsliding.\n\n\n\n\n\nBillionaires are more than 4,000 times more likely to hold political office than ordinary people, the report found.\n\n\n\n\n\n\"When one billionaire can spend hundreds of millions of dollars to shape political conversations, it shows how extreme wealth can translate directly into political power — undermining a fair and healthy democracy,\" Tierney said.\n\n\n\nUnited States President Donald Trump, for example, has a net worth of $6.6 billion, and his presidency has been the most lucrative in history, according to Forbes.\n\n\n\n\n\nHe received enormous campaign support from the world's richest man, Elon Musk, whose net worth is estimated at more than US$717 billion ($1 trillion).\n\n\n\n\n\nTwelve billionaires have served in Trump's administration, according to a Washington Post tally.\n\n\n\n\n\n\"We see this every single day across the world right now. This concentration of wealth and billionaires holding power really creates a lot of problems with social cohesion,\" Tierney said.\n\n\n\n\"Your average citizen sees that they are not benefiting from the system in the same way that the rich and the elite are. This means that people want to rise up and protest and push back.\n\n\n\n\n\n\"It's just really a vicious cycle.\"\n\n\n\nArtificial intelligence adds a new dimension\n\nIn many markets, a small group of ultra-wealthy individuals and corporations control a large share of news and information platforms.\n\n\n\n\n\nAustralia has one of the most concentrated media markets in the world, with the country’s largest media company, News Corp, forming part of billionaire Rupert Murdoch’s global media empire.\n\n\n\n\n\nSome of the world’s largest social media platforms, including X and Meta, are also owned or controlled by billionaires.\n\n\n\n\n\n\"One of the other things that we really need to be thinking about is how many billionaires own AI companies,\" Tierney said.\n\n\n\n\n\n\"While media companies have been able to have an influence on people's perspectives, and putting their spin into communities, AI is just going to accelerate that in a way that I think we can't even fathom.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/europe-toughens-stance-as-trump-threatens-new-tariffs-over-greenland/k2qgiveh9",
        "title": "Europe toughens stance as Trump threatens new tariffs over Greenland",
        "publish_date": "Mon, 19 Jan 2026 00:52:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIn an emergency meeting called in Brussels, European leaders gathered to devise a response to escalating threats from the United States over Greenland.\n\n\n\n\n\nThe meeting was called after US President Donald Trump threatened to impose new tariffs of up to 25 per cent on European countries unless they supported his plans to incorporate Greenland into US territory.\n\n\n\n\n\n\"And, I may do that for Greenland too. I may put a tariff on countries if they don't go along with Greenland, because we need Greenland for national security. So I may do that.\"\n\n\n\n\n\nMr Trump vowed to implement the increasing tariffs on EU members Denmark, Sweden, France, Germany, the Netherlands and Finland, as well as Britain and Norway.\n\n\n\n\n\nSet to start at 10 per cent on February 1, the increasing tariffs would rise to 25 per cent by June 1, until a deal is reached for the purchase of Greenland.\n\n\n\n\n\nAll eight countries, which are already subject to US tariffs of 10 and 15 per cent, decried the threats, with one minister calling it blackmail.\n\n\n\n\n\nDanish Foreign Minister Lars Lokke Rasmussen, says Denmark will continue to focus on diplomacy, referring to an agreement Denmark, Greenland and the US made last week to set up a working group.\n\n\n\n\n\n“We will not give up on that. I mean, I have an agreement with the American vice president (JD Vance). It was reconfirmed after we have listened to the press spokesperson. So we will stay on track unless the US decides differently. But then, at the same time, of course, we need the European Union to respond.\"\n\n\n\n\n\nThe European Union reached a deal with the US in July for most EU exports to face a 15 per cent tariff.\n\n\n\n\n\nWhile it is unclear how these threats would affect that deal, French media are reporting that President Emmanuel Macron is calling on leaders to activate the EU’s anti-coercion measures.\n\n\n\n\n\nThe anti-coercion law, which has never been used, would enable the bloc to impose punitive economic measures on a country seeking to force policy change.\n\n\n\n\n\nRasmus Søndergaard, a senior researcher at the Danish Institute for International Studies, says it may be Europe's best option.\n\n\n\n\n\n\"The economic weapon is the best option Europe has. So tariffs directed back at Trump, if they're smart, probably directed at Trump's allies, tech people in Silicon Valley, find a way to try and hit the people that are Trump's support base rather than some of the demographics of the states that are already against Trump in this matter. That of course can be difficult. But we'll see. The EU has the ability to really strike back with force if they want to, and it will hurt European economies (and) it will hurt American economies.\"\n\n\n\n\n\nWarning that transatlantic ties are at risk, European leaders say they stand united against the US threats.\n\n\n\n\n\nThe Trump administration argues that Greenland is needed for US national security, that Denmark would be unable to defend Greenland if Russia or China were to invade.\n\n\n\n\n\nUS Treasury Secretary Scott Bessent says securing Greenland would serve the interests of hemispheric security.\n\n\n\n\n\n\"If there were an attack on Greenland, from Russia, from some other area, we would get dragged in. So better now, peace through strength, make it part of the United States, and there will not be a conflict because the United States right now, we are the hottest country in the world, we are the strongest country in the world.\"\n\n\n\n\n\nBut Denmark is a member of NATO.\n\n\n\n\n\nIn response to the escalating rhetoric, Denmark and several of its European NATO allies recently sent small numbers of military personnel to Greenland for an exercise, to which the US was also invited.\n\n\n\n\n\nNorway's Foreign Minister, Espen Barth Eide, says European leaders are ready to bolster the security of Greenland.\n\n\n\n\n\n\"The very essence of NATO is to protect the sovereign integrity and territorial integrity of its member states, so that's what it's all about. And that's again, rooted in the collective right of self defence in the UN Charter. And I want to reiterate what also Lokke said that we have two messages that we shared with all the countries we mentioned in this - not only the eight, but all the European countries and Canada - that, on the one hand, we stand with the Kingdom of Denmark in defence of its sovereignty. But we are also ready to do more together with America and with all our allies in the Arctic, and that's exactly why we are stepping up our presence in Greenland, because if there are security concerns, we can meet them jointly.\"\n\n\n\n\n\nSince the US military operation against Venezuela saw the capture of its leader, Nicolas Maduro, Donald Trump's stance on Greenland has hardened.\n\n\n\n\n\nAsked if he would pull the United States out of NATO if they refuse to assist a US takeover of Greenland, Mr Trump didn't rule it out.\n\n\n\n\n\n\"Wait and see. NATO has been dealing with us on Greenland. We need Greenland for national security very badly. If we don't have it, we have a big hole in national security, especially when it comes to what we're doing in terms of the Golden Dome and all of the other things. We have a lot of, a lot of investments in military. We have got the strongest military in the world, and it's only getting stronger. And you saw that with Venezuela. You saw that with the attack on Iran, with the knocking out their nuclear capabilities, potentially. So, yeah, we're going to — we're talking to NATO.\"\n\n\n\n\n\nThe European Council says it will call a summit of EU leaders in the coming days, following the Brussels meeting.\n\n\n\n\n\nEuropean Commission President Ursula von der Leyen says Greenland can count on Europe for support.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-tariffs-greenland-international-law-analysis/05vs5812g",
        "title": "'Worrying moment': Can Trump use tariffs to force a Greenland deal under international law?",
        "publish_date": "Sun, 18 Jan 2026 04:13:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has escalated his longstanding designs on controlling Greenland, vowing to levy higher tariffs on European allies until the United States is allowed the \"complete and total purchase\" of the autonomous Danish territory.\n\n\n\n\n\nIn a Truth Social post on Sunday, Trump said Denmark, Norway, Sweden, France, Germany, the Netherlands and the United Kingdom would face additional 10 per cent import tariffs from 1 February, rising to 25 per cent on 1 June.\n\n\n\n\n\nThe tariffs would be \"payable until such time as a deal is reached for the complete and total purchase of Greenland\", Trump added.\n\n\n\n\n\nThe countries Trump singled out — all of which already face tariffs imposed by the US president last year — have pledged support for Denmark and the people of Greenland.\n\n\n\n\n\nIn recent days, they have deployed small military contingents to Greenland in a show of NATO support for Denmark.\n\n\n\n\n\nSo, under international law, can the US apply economic pressure to coerce a territorial concession from another state? The answer is complicated, according to one legal expert.\n\n\n\nDonald Rothwell, a professor of international law at the Australian National University, said the legality of each tariff would depend on the individual trade agreements the US has with each European country.\n\n\n\n\n\nThe trade law implications are \"quite significant\", he said, given the transatlantic trade deals the White House reached last year with the European Union and United Kingdom.\n\n\n\n\n\nThe EU pact is now at risk of being derailed after European Parliament members signalled this week they would delay ratification in light of Trump’s Greenland threats.\n\n\n\nLegality questionable if Trump succeeds\n\nLeaders in both Denmark and Greenland, a mineral-rich Arctic territory of strategic importance to the US, have repeatedly said the island is not for sale.\n\n\n\n\n\nWhether tariffs against Denmark amount to unlawful coercion depends on their severity and economic impact, Rothwell said.\n\n\n\nREAD MORE Behind Trump's controversial push to acquire Greenland\n\n\"We're not at that point at the moment,\" he told SBS News. \"But in theory, if State A was to impose absolutely crippling tariffs on State B, well, then that would certainly raise some international questions.\"\n\n\n\n\n\nHowever, if Trump does manage to extract a treaty agreement from Denmark to cede Greenland to the US, its validity could be murky.\n\n\n\n\n\n\"Any treaty concessions by one state to another forced upon a state as a result of coercive activity undermine the legitimacy of the treaty arrangement,\" Rothwell explained.\n\n\n\n\n\nIf Denmark were to capitulate, he said, \"there would be a real question about the legality of the treaty, because of the impact of the trade measures that the United States is threatening against Denmark\".\n\n\n\nTrump invokes global security as justification\n\nTrump has said he is acting in the interests of global and national security, writing in his Truth Social post that \"China and Russia want Greenland\" and that \"world peace is at stake\".\n\n\n\n\n\nThose arguments have no bearing on the legal analysis, according to Rothwell.\n\n\n\nTrump has not ruled out using military force to take Greenland, though the White House says he prefers diplomacy.\n\n\n\n\n\nThe foreign ministers of Denmark and Greenland met with US secretary of state Marco Rubio and vice president JD Vance this week but were unsuccessful in shifting the US position.\n\n\n\n\n\n\"It's clear that the president has this wish of conquering over Greenland. And we made it very, very clear that this is not in the interest of the kingdom,\" Danish foreign minister Lars Løkke Rasmussen told reporters afterwards.\n\n\n\n\n\nHe said the issue was \"very emotional\" for the people of Greenland and Denmark.\n\n\n\nProtesters gathered in front of the US consulate in the Greenlandic capital, Nuuk, on Saturday, bearing signs saying \"Greenland is not for sale\". Source: Getty / Sean Gallup \"Ideas that would not respect [the] territorial integrity of the Kingdom of Denmark and the right of self-determination of the Greenlandic people are, of course, totally unacceptable.\"\n\n\n\n\n\nThousands of people took to the streets in Denmark and Greenland over the weekend to protest Trump's demands. Demonstrators bore signs reading \"Greenland is not for sale\", \"We are not property\", and \"Our land, not yours\".\n\n\n\nGreenlanders' right to self-determination\n\nUnder the United Nations Charter, the people of Greenland have a recognised right to self-determination.\n\n\n\n\n\nA recent poll found 85 per cent of Greenlanders did not want to become part of the US, while more than half said they would vote in favour of Greenlandic independence from Denmark.\n\n\n\nDanish foreign minister Lars Løkke Rasmussen and his Greenlandic counterpart, Vivian Motzfeldt, met with US officials on Wednesday. Source: Getty / Bloomberg UN rights and legal experts expressed serious concerns this week about Trump's posture, calling on the US to \"unequivocally reaffirm its commitment to the UN Charter\".\n\n\n\n\n\nRothwell said that while there is no timeline for Greenlandic independence, it's a realistic future possibility — meaning any attempt to acquire the territory without the endorsement of its people would breach their right to self-determination.\n\n\n\n'Unprecedented' situation\n\nThe UN Charter came into force in October 1945, after the end of World War Two.\n\n\n\n\n\nIn the 19th and early 20th centuries, it was not uncommon for major powers to acquire territory in pursuit of national interests. However, in the post-1945 world order, Rothwell said, such conduct by the US is \"unprecedented\".\n\n\n\n\n\nHe drew broad parallels between the US' current moves and Russia's approach in the lead-up to its 2022 invasion of Ukraine, noting the gradual escalation of pressure.\n\n\n\n\n\n\"The United States is using diplomatic, political and now economic levers,\" he said. \"They've threatened military measures, but they haven't gone that far.\"\n\n\n\n'Worrying moment' for global stability\n\nFrom a global security and stability perspective, \"this is a pretty worrying moment\", Rothwell said, with a diplomatic resolution \"increasingly looking unlikely\" as positions harden on both sides.\n\n\n\nIf the US fails to achieve its objectives through economic pressure and continues on its current trajectory, it may ultimately resort to military force to take Greenland — a move that would, in Rothwell's view, trigger the immediate collapse of NATO.\n\n\n\n\n\nDenmark’s Prime Minister, Mette Frederiksen, has also indicated that a military takeover of Greenland by the US would mark the end of the military alliance.\n\n\n\n\n\n\"Once NATO collapses,\" Rothwell said, \"the global security environment is going to be reshaped.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evacuations-on-sydneys-northern-beaches-amid-flash-flooding-concerns-midday-news-bulletin-18-january-2026/weavw8g56",
        "title": "Evacuations on Sydney's northern beaches amid flash flooding concerns | Midday News Bulletin 18 January 2026",
        "publish_date": "Sun, 18 Jan 2026 01:21:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\nFlash flooding and a landslide force evacuations on Sydney's Northern Beaches.\n\nPalestinians in Gaza voice concern as the U-S unveils a temporary 'Board of Peace'.\n\nIn snowboarding, Scotty James surges into Olympic contention after a dominant win at the final World Cup halfpipe event.\n\nAn evacuation order has been issued for some residents in Sydney's Northern Beaches after a woman died in wild summer storms on the state's south coast.\n\n\n\n\n\nThe evacuation orders for the Northern Beaches and surrounds have been issued amid rapidly rising floodwaters and a landslide at Great Mackerel Beach that damaged three houses.\n\n\n\n\n\nMeanwhile, at least 750 volunteers are on the ground responding to more than 1400 call-outs, with the State Emergency Service conducting 20 flood rescues.\n\n\n\n\n\n.\n\n\n\n\n\nPalestinians in Gaza have expressed concern after the White House announced a 'Board of Peace' to oversee the enclave's temporary governance.\n\n\n\n\n\nThe board includes U-S Secretary of State Marco Rubio, President Trump's special envoy Steve Witkoff, former U-K Prime Minister Tony Blair, and Trump's son-in-law Jared Kushner.\n\n\n\n\n\nForeign Minister Gideon Saar is expected to raise his concerns with Secretary of State Rubio directly, with Israel saying it was not consulted and that the plan runs counter to its policy.\n\n\n\n\n\nMeanwhile, Khan Younis resident, Mohieb Dahlan, says that the board's success depends entirely on Israel's cooperation.\n\n\n\n\n\n\"As for the peace board under the administration of (US President Donald) Trump, it depends on the Israelis, who are the occupying enemy, for it to succeed or fail. If they are keen to make it succeed, they will make it succeed, and if they are not interested in making it succeed, it will fail. It is in the hands of the Israelis in terms of the border crossing, the aid, and the reconstruction, it is all in the hands of the occupation, the Israeli occupation.\"\n\n\n\n\n\n.\n\n\n\n\n\nEuropean Council President Antonio Costa says the European Union is coordinating a response to new US tariffs targeting several European countries.\n\n\n\n\n\nPresident Donald Trump has announced 10 per cent tariffs from 1 February, rising to 25 per cent in June, until a deal is reached for what he has called the complete and total purchase of Greenland.\n\n\n\n\n\nMr Trump argues Greenland is critical for global security and the effectiveness of the U-S Golden Dome defence system.\n\n\n\n\n\nThe tariffs target Denmark, Norway, Sweden, France, Germany, the U-K, the Netherlands, and Finland, which President Costa says the EU will vigorously defend.\n\n\n\n\n\n\"The European Union will always be very firm in the defense of international law, wherever it may be, and of course starting in the territory of the member states of the European Union. Right now I am coordinating a joint response from the member states of the European Union on this issue.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe world's first legally binding agreement to protect marine life in international waters has taken effect.\n\n\n\n\n\nAfter nearly two decades of negotiations, the High Seas Treaty will govern nearly half the planet’s surface - the vast ocean areas beyond any country’s control.\n\n\n\n\n\n83 countries have now ratified the treaty, including China and Japan.\n\n\n\n\n\nThe United States, United Kingdom and Australia have signed but not ratified the treaty, meaning they can participate as an observer but won't have voting rights.\n\n\n\n\n\nAdvocates say the broad support must now turn into rapid implementation, but Megan Randles, from Greenpeace's Ocean Campaign, says it's a landmark moment.\n\n\n\n\n\n\"The treaty is a sign that in a divided world, protecting nature and protecting our global commons can still triumph over political rivalries.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe Australian Tax Office is cracking down on holiday-home owners claiming tax deductions for properties mainly used for personal use.\n\n\n\n\n\nThe ATO says that from 1 July, deductions for interest, rates, and upkeep may only be allowed if the home is mainly rented and available during peak periods.\n\n\n\n\n\nThe agency will cross-check rental platforms, bank records, and property listings to ensure claims match actual income.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport now, Australian snowboarder Scotty James has delivered a masterclass on the halfpipe, claiming victory at the final World Cup event before next month's Winter Olympics in Milano Cortina.\n\n\n\n\n\nHere is the moment where he claimed his fifth career win at the Laax Open in Switzerland.\n\n\n\n\n\n\"Once again, I can't keep up with Scotty James as he lands one of the best runs of the night. He goes into first place - 98.75 with the two NBDs. He'll knock Campbell Melville Ives off the top step. Highest score of the night.\"\n\n\n\n\n\nThe 31-year-old four-time Olympian's emphatic win boosts his bid for Olympic gold, having previously taken bronze in Pyeongchang 2018 and silver in Beijing 2022.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-to-make-a-career-change-in-2026-thats-actually-worth-it/chep8z8d5",
        "title": "Thinking of changing your career this year? Consider these five steps before you do",
        "publish_date": "Sat, 17 Jan 2026 23:57:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the new year settles in, it's not unusual to take stock of your life — including whether it's finally time to make a change at work.\n\n\n\n\n\nThe idea of switching careers can be exciting and daunting, often at the same time. It usually comes with a familiar set of questions: How do you make it work financially, how do you know what career to move into, and do you actually hate your job — or just your boss?\n\n\n\n\n\nIf you're thinking about changing careers, experts say it's worth slowing down before making any big decisions.\n\n\n\n\n\nJane Jackson, a career coach and author of Navigating Career Crossroads, says interest in meaningful, values-led work surged after the pandemic, but the current economic climate has made many people more cautious.\n\n\n\n\n\n\"2025 was the tightest job market I've experienced in all my years of coaching,\" Jackson said.\n\n\n\n\n\n\"There was a little bit of fear about making a change in case they couldn't land the roles that they desired.\"\n\n\n\nBecause of a thinner job market and higher levels of redundancy, Jackson says career changes in 2026 need to be more strategic and targeted.\n\n\n\n\n\nData released by the Australian Bureau of Statistics this week show in November 2025, Australia's total job vacancies were 326,700.\n\n\n\n\n\nThis represented a decrease of 0.2 per cent from August 2025, while over the 12 months to November 2025, there were 17,800 fewer job vacancies — a fall of 5.2 per cent.\n\n\n\n\n\nGiven the need to make strategic and targeted career moves in 2026, as Jackson argues, here are five considerations to keep in mind if you want to make a change that pays off.\n\n\n\n1. Think sideways first, not from scratch\n\nBefore making any big decisions, Jackson says it's important to slow down and identify what's actually driving your dissatisfaction at work.\n\n\n\n\n\nIs it your manager? The company culture? The pay? Or something else entirely?\n\n\n\n\n\n\"What is it that you don't like about your job? You really have to assess that,\" she said.\n\n\n\n\n\n\"It might not be the job at all — it might be the manager, the culture, or the way you're treated.\n\n\n\n\n\n\"People lump it all into one, which is a mistake.\"\n\n\n\nREAD MORE Michelle left her career and marriage and started saying 'yes'. It changed her life\n\nIn some cases, those problems can be solved without leaving your role. In others, a change in employer, industry or position may be enough — without needing to retrain or start again from scratch.\n\n\n\n\n\nBefore leaping into a dramatic career pivot, Jackson encourages smaller, \"lilypad\" moves, such as moving laterally into adjacent industries or similar roles.\n\n\n\n\n\n\"In order to get from A to Z, you're going to be making some detours,\" she says.\n\n\n\n\n\n\"Careers are not linear — it's very much like a matrix.\"\n\n\n\n2. Explore, talk to people, experiment\n\nJackson similarly encourages career changers to identify skills where they have both high competence and high enjoyment, and to leverage those transferable skills to move into tangentially related roles or industries.\n\n\n\n\n\nPart of that process might involve investigative work, such as looking up people on LinkedIn who already have the career you want and examining how they got there.\n\n\n\n\n\n\"Very few careers are linear,\" Jackson says. \"There are so many other roles that people don't even know exist.\"\n\n\n\n\n\n\"When you start to see people's career journeys, you realise they've leveraged transferable skills to get their foot in the door.\n\n\n\n\n\n\"Have a look at how other people got there — you'll see common threads.\"\n\n\n\nLISTEN TO How a literacy and numeracy program is helping adults open up career options SBS News 05:01 English\n\nKate Richardson, a career coach, says exploration doesn't have to involve quitting your job or making a major financial commitment straight away.\n\n\n\n\n\n\"Exploring really comes down to two things: expanding your connections and finding ways to experiment,\" she says.\n\n\n\n\n\nThat might include short courses, side projects, volunteering, contract work or informal conversations with people already working in the field.\n\n\n\n\n\n\"Anything that gives you more hands-on or tangible experience of a pathway without necessarily making a big commitment.\"\n\n\n\n3. Identify your values\n\nValues alignment plays a major role in long-term career satisfaction, Jackson says, and she encourages anyone considering a change to get clear on what they need from work.\n\n\n\n\n\n\"You've got to make values-based decisions, because otherwise it doesn't feel right,\" she says.\n\n\n\n\n\nOne way to do that is by identifying your top five values and ranking them in order of importance. This can help clarify whether the issue is your role, your workplace, or whether a larger shift is needed.\n\n\n\n\n\n\"If your values are being compromised, then you'll know whether staying is acceptable or not,\" Jackson says.\n\n\n\n4. Keep the market in mind\n\nRichardson says it's also important to balance values-driven work with an understanding of current market realities.\n\n\n\n\n\n\"It's got to encompass all of that — values, strengths, lifestyle and what's happening in the market,\" she says.\n\n\n\n\n\n\"You do have to cast an eye across the market and understand the changes that are going on.\n\n\n\n\n\n\"There are trends that impact employability or opportunity, and it's important to know that.\"\n\n\n\nJob ads for nursing and construction roles saw the most growth year-on-year, according to December data from SEEK. Source: SBS News LinkedIn's Jobs on the Rise 2026 report identified the 15 fastest-growing jobs in Australia, with many roles incorporating Artificial Intelligence (AI) standing out. AI engineer ranked first, followed by chief risk officer, mechanical engineer, director of artificial intelligence and organisational development manager.\n\n\n\n\n\nMeanwhile, a December report from job site Seek identified strong year-on-year growth in job ads for nursing roles — particularly theatre, recovery and high-acuity nursing — alongside ongoing demand for general practitioners, aged and disability support workers, and management roles in construction.\n\n\n\n5. Acknowledge fear, but don't let it make the decision\n\nTaking the leap into a career change is difficult at the best of times, and financial logistics can make it even harder.\n\n\n\n\n\nRichardson says concerns about money, study and risk are often what stop people from moving forward — but those fears don't always reflect reality.\n\n\n\n\n\n\"No matter your age, your brain will always kick in with all the reasons why it's not going to work,\" she says. \"That's just your brain kicking into risk management mode.\"\n\n\n\n\n\nShe says the exploration process can help people separate genuine practical constraints from assumptions that haven't yet been tested — whether that's researching salary progression, understanding long-term opportunities, or mapping out what a short-term step back might realistically look like.\n\n\n\nRichardson says many people delay career change not because they lack options, but because they feel pressure to have a clear answer before they begin.\n\n\n\n\n\n\"As long as it feels fuzzy and you're lacking confidence, it's very easy to stick with the status quo,\" Richardson says.\n\n\n\n\n\nRather than trying to land on a perfect end goal, she encourages people to focus on identifying possibilities.\n\n\n\n\n\n\"One of the best ways to get started is to forget the answer just for a minute and instead think about a few possibilities,\" she says.\n\n\n\n\n\n\"When you let go of the answer and you identify possibilities, you can take small steps to actively explore those possibilities further.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-most-liveable-city-is-now-the-cheapest-to-rent-houses/dt08u2lcm",
        "title": "Australia's 'most liveable' city is now the cheapest to rent houses",
        "publish_date": "Sat, 17 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/a-new-cbd-grill-serving-wagyu-steak-frites-for-less-than-30-20260119-p5nv4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A new CBD grill serving wagyu steak frites for less than $30",
        "publish_date": "Mon, 19 Jan 2026 13:24:24 +1100",
        "category": "finance",
        "authors": [
            "Emma Breheny"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 7 Steak frites made with Angus rostbiff at Common Cuts, a new city grill. Alex Coppel 2 / 7 Inside the Russell Streett steakhouse. Alex Coppel 3 / 7 Steak frites start at $28.50. Alex Coppel 4 / 7 Steak frites made with wagyu flank. Alex Coppel 5 / 7 The cheeseburger with extra wagyu. Alex Coppel 6 / 7 Yorkshire pudding with padron peppers. Alex Coppel 7 / 7 DJ Ajeet inside the restaurant. Alex Coppel Previous Slide Next Slide\n\nSteakhouse$$$$\n\nAt Common Cuts, opposite Old Melbourne Gaol on Russell Street in the CBD, it’s all about the sub-$30 steak frites. Diners choose between a 220-gram piece of Black Diamond wagyu flank or a 300-gram O’Connor Angus rostbiff cooked over charcoal. Fries are included in the $28.50 dish, but sauces cost an additional $4.50.\n\nBeyond the two entry-level steak frites, there are seven more options priced between $45 and $185 from various producers. A further three O’Connor steaks, dry-aged for four weeks by supplier Vic’s Meat, go up to $220 for a one-kilogram T-bone. Sauces go beyond the typical bearnaise or red wine jus. Charred spring onion and malt butter, mustard and horseradish, and chimichurri are among the six choices.\n\nThe menu also includes steak tartare made with a mix of Angus rump, rostbiff and tenderloin, plus a decadent wagyu lasagne garnished with bone marrow. A 180-gram cheeseburger on a Martin’s potato roll ($28.50) can be upgraded to a wagyu-on-wagyu blowout ($48.50) where 85 grams of sliced A5 Japanese wagyu are laid on top of the melted cheese.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/sydney-fish-market-opening-live-new-836-million-site-opens-at-blackwattle-bay-20260119-p5nuzi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney Fish Market opening LIVE updates: Foodies, shoppers flock to new $836 million site at Blackwattle Bay",
        "publish_date": "Mon, 19 Jan 2026 13:24:02 +1100",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "Crowds are being told to either wait in line or “come back later” as the new fish market officially reaches capacity.\n\nWardens were seen herding the queue and telling visitors to “come back this evening” as a long line of patrons snaked down Bridge Road.\n\nJust hours after opening, many visitors have been told to turn around and come back later. Wolter Peeters\n\nAlex Jensen, who took a train and tram to the soak in the market’s opening day said it was disappointing.\n\n“All we were told is that it’s full and we either have to queue up or come back later,” he said. “It’s disappointing because we made the trip especially to be here.”\n\nPeople line up to get into the new Sydney Fish Market. Dominic Lorrimer\n\nAs of 12.45pm the queue time to enter the market was running at 20 to 30 minutes.\n\nVisitors are being told by fish market staff that the space is at capacity, and that no one else will be allowed in just five hours into the grand opening day.\n\nGarner and Michelle Annett made a reservation at a restaurant inside the fish market, but have been waiting in line for more than 40 minutes. They were told by staff that markets had reached capacity.\n\n“The restaurant is ringing and saying ‘where are you?’” Michelle said.\n\n“They’ve said they’re going to hold [the table] but we’ll see how that goes,” Garner said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-live-2026-de-minaur-begins-open-quest-gauff-swiatek-djokovic-in-action-20260118-p5nuwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open LIVE 2026: De Minaur begins Open quest against American Mackenzie McDonald; Gauff, Swiatek, Djokovic in action",
        "publish_date": "Mon, 19 Jan 2026 13:22:15 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Scott Spits"
        ],
        "text": "Both tennis figures are Asian-American, both call California home and both have made big inroads in tennis at a young age.\n\nRising star Learner Tien, who shocked Daniil Medvedev last year at the Australian Open on the way to the fourth round, joined forces with Michael Chang midway through 2025, signing the American great as his new coach.\n\nLearner Tien in action. Credit: Getty Images\n\nTien, 20, had another breakout season last year, improving his ranking to as high as world No.26, winning his first ATP title and ruling the roost at the Next Generation ATP Finals, which showcases the game’s young stars.\n\nThe left-hander is happy with his progression, delivering on a goal to win his first title before his 20th birthday, and agrees that last year’s second-round win over Medvedev – a near five-hour match that finished in the early hours – was a significant moment.\n\nCoach and former star player Michael Chang. Credit: Getty Images\n\n“That match actually got me into the Top 100. I started to feel more and more like I belonged,” said Learner, who has Vietnamese heritage, ahead of his Australian Open first-round match against countryman Marcos Giron this afternoon.\n\nChang, a former world No.2 and the youngest man in history to win a singles major – the 1989 French Open title – doesn’t want to put a ceiling on Learner’s potential this year.\n\n“For me personally … if you look at this past year, Learner’s beaten more Top 10 guys than anybody else apart from Carlos [Alcaraz] and Jannik [Sinner],” Chang said.\n\n“When you’ve beaten Top 10 guys … that should give you some confidence.\n\n“For me as a coach, for me personally, I have that belief in him as a person [and] in his game – obviously he’s still learning a lot, he’s still growing a lot, he’s still improving.\n\n“But I think it’s been pretty incredible for him to go through a first full season and accomplish what he has accomplished in such a short period of time.”\n\nLearner and Chang’s paths first crossed a little over a year ago in Hong Kong. As they learnt about each other last year, joining forces seemed the right choice.\n\n“Some aspects (of our relationship and similarities) makes it a little bit easier. We can talk about things that are in Orange County. He knows what I’m talking about, and I know what he’s talking about,” Chang said.\n\n“The one thing that actually has been quite nice is that Learner’s very cerebral, so he’s a thinker out there (on the court), which is very similar to how my mind works.\n\n“I’ve always been a little bit before [inclined to] … over-share about different things, whether it was, you know, technically or strategically.\n\nLearner Tien, 19, caused a massive upset by ousting Medvedev in 2025. Credit: AP\n\n“But Learner doesn’t have an issue with that. He absorbs things very well, he understands things very well. So that’s been refreshing for me as a coach because I don’t have to hold back.”\n\nTien wasn’t even born when Chang retired in 2003, seven years after he lost the Australian Open final to Boris Becker.\n\nTien said his agent did most of the “heavy lifting” when he secured Chang. “I think it’s been a great fit so far,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/storm-s-opponent-was-ranked-327-places-higher-than-her-she-won-anyway-20260119-p5nv14.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Storm’s opponent was ranked 327 places higher than her. She won anyway",
        "publish_date": "Mon, 19 Jan 2026 13:18:42 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "When Australian Storm Hunter ruptured her Achilles in April 2024, she didn’t know if she’d ever be able to return to her home slam.\n\nShe was doubles world No.3, had won six singles matches in a row (including qualifying) in Melbourne earlier that year and was preparing to represent Australia at the Billie Jean King Cup when she suffered the potentially career-ending injury.\n\nStorm Hunter celebrates victory at Melbourne Park. Credit: Eddie Jim\n\nBut on Monday afternoon, in front of a roaring crowd at Kia Arena, Hunter was an Australian Open winner again, defeating Spain’s Jessica Bouzas Maneiro 6-4, 6-4.\n\nIt was a win against the odds – Bouzas Maneiro is ranked 327 places higher than Hunter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/larvotto-nsw-antimony-production-gathers-pace-as-growth-options-build-20260119-p5nv46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Larvotto NSW antimony production gathers pace as growth options build",
        "publish_date": "Mon, 19 Jan 2026 12:45:29 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Larvotto NSW antimony production gathers pace as growth options build Brought to you by BULLS N’ BEARS Rowena Duckworth January 19, 2026 — 12:45pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLarvotto Resources is fast emerging as a near-term critical minerals producer, with refurbishment works and underground mining activities at its Hillgrove antimony–gold project in NSW on track and, importantly, on budget, ahead of a return to production by mid-year. Alongside Hillgrove, the company is lining up its next growth moves, eyeing a rare earths opportunity in Western Australia and a promising copper play near Mt Isa in Queensland as potential next chapters in the company’s expansion story. Anaiwan cultural mural at Larvotto Resources’ Hillgrove Hub. The artwork will feature on the Hillgrove high-vis work shirts. In NSW, meanwhile, Larvotto has wasted no time shifting its high-grade gold and antimony mine into execution mode, ripping out and dispatching processing plant equipment for refurbishment, while upgrading site services. Underground mining has also restarted, with contractor PYBAR now fully mobilised. Rehabilitation of more than 2,500 square metres of underground drives is now complete and waste haulage is underway ahead of ore development blasting expected in early February.\n\nAdvertisement\n\n‘Hillgrove is on the verge of production at a time of unprecedented global demand for criticalminerals.’ Hillgrove Resources managing director Ron Heeks Workforce numbers are ramping up in parallel, with Larvotto forecasting an increase in full-time staff from 53 to 162 by the end of June, positioning the operation for commissioning and first production. Regulatory momentum is also building, with the public exhibition period for a key mine life extension now underway. Hillgrove places Larvotto in the box seat to become Australia’s next antimony producer at a time when the metal has been prioritised under the Federal Government’s $1.2 billion Critical Minerals Strategy. Strong gold and tungsten prices add further leverage as the project edges closer to cash flow. Managing director Ron Heeks said: “With Hillgrove on the verge of production at a time of unprecedented global demand for critical minerals, we are working on being the next Australian producer of antimony. The recent prioritisation of antimony under the Australian Government’s $1.2 billion Critical Mineral Strategy highlights the importance of antimony and supports Larvotto’s emergence as a leading new critical minerals producer.” Larvotto says community engagement remains a top priority, with regular drop-in sessions at its Hillgrove Hub and strong partnerships forged with local schools and Traditional Owners. The approach has paid off, earning the company finalist honours in the 2025 AMEC Community Contribution Award.\n\nAdvertisement\n\nFrom hands-on agricultural education and controlled grazing to manage fire risk, through to celebrating culture with a striking Anaiwan mural, management says it is keen to embed long-term social, environmental and cultural value alongside mine development. In a big tick for farmers and bushfire management, Larvotto has kicked off a grazing and community farm initiative at Echidna Gully Village, introducing cattle onto pastoral land to support agricultural education partnerships with local schools. The program aims to promote the practical benefits of controlled grazing by helping manage vegetation, thereby reducing fire risk around the site. Beyond Hillgrove, Larvotto says it’s steadily building the company’s next growth engines. At its Eyre project in Western Australia, aircore drilling has wrapped up to feed rare earths metallurgical test work. Laboratory studies are now underway to probe mineralogy, recoveries and processing pathways across a suite of promising targets. In Queensland, meanwhile, the company has continued to make progress on its due diligence at the historic Blockade copper mine near Mt Isa, where more than 4,100 metres of reverse circulation (RC) drilling has been completed across five nearby prospects. Visual results so far from Blockade have hinted at multiple copper-mineralised zones, with assays pending and results set to guide potential resource modelling and a decision on acquisition. The Mt Isa assets could underpin a potential hub-and-spoke copper development strategy close to existing processing infrastructure.\n\nAdvertisement\n\nWith refurbishment works accelerating, underground mining back in motion and multiple exploration and acquisition catalysts on the horizon, Larvotto is shaping up as a tightly focused near-term antimony and gold producer with meaningful upside across copper and rare earths. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/lygon-street-s-last-butcher-has-a-new-owner-with-a-familiar-name-20260119-p5nv0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lygon Street’s last butcher has a new owner with a familiar name",
        "publish_date": "Mon, 19 Jan 2026 12:38:48 +1100",
        "category": "finance",
        "authors": [
            "Emma Breheny"
        ],
        "text": "Advertisement\n\nEating outMelbourne icon Lygon Street’s last butcher has a new owner with a familiar name Customers of the legendary Donati’s butcher shop in Carlton feared the end was nigh when its founder announced his retirement. But their prayers may have been answered by a buyer who wants business as usual. Emma Breheny Updated January 19, 2026 ,first published January 19, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDonati’s Fine Meats, a fixture of Lygon Street since 1972, will continue to trade as a butcher shop with a new owner – who has a name familiar to many on the strip – taking the reins from founder Leo Donati, who is retiring. When the 77-year-old Donati announced his plans to sell the business and retire late last year, it sparked worry that the last butcher shop of Carlton’s Little Italy would also become history. Leo Donati and son Marcello of Donati’s butcher shop on Lygon Street, Carlton. Eddie Jim But Jamie Valmorbida, part of the family who own King & Godfree and several other businesses nearby, has purchased the shop with the intent to continue supplying pork sausages, veal and other meat to its many regular customers. Significantly, he will not be changing the name of the shop. “The shop’s already thriving. My job is to protect that,” said Valmorbida. “Over time, we think the brand has potential, and I’m excited to explore that in the future. But the focus right now is doing the fundamentals right.”\n\nAdvertisement\n\nDonati’s reputation is for more than just excellent meat. The shop is well-known for playing classical music all day, artworks honouring cows and pigs, fresh flowers on the counter, and high-quality conversation spanning current affairs, books, composers and more. Valmorbida takes possession on January 30 and will work with Leo Donati’s son Marcello on a transition. Most of the art and Leo’s playlists come with the sale. Jamie Valmorbida (right) with King & Godfree co-director Luca Sbardella. Wayne Taylor Butcher Sam Spagnuolo, an employee of more than 20 years, will remain while Mark Glenn, executive chef of several Valmorbida venues, will oversee operations. There are plans to recruit a head butcher, and build a team of both current and past team members. “It’s impossible to replace Leo and Marcello but creating a unique service experience is going to be a priority,” Valmorbida said.\n\nAdvertisement\n\nWhile he wouldn’t expand on his ideas for the shop’s future, including new products, Valmorbida said any changes would be six to 12 months away. “The beauty of Donati’s is what’s there. We’re not going to change the core, but we will try some things around the side,” he added. The sale came about when Valmorbida was picking up a ham for Christmas and Leo Donati jokingly asked if he would buy the business. “I said: ‘You’ve planted the seed’ and it was genuine. From there, it moved really quickly.” The two families have long orbited the same world of Carlton’s Lygon Street. The Valmorbida name has been linked with King & Godfree, a deli and continental grocer on the corner of Faraday Street, since 1955. In more recent years, the family’s portfolio has skewed towards hospitality, much like the rest of Lygon Street. Their businesses include rooftop bar Johnny’s Green Room, Pidapipo gelato shops across Melbourne, and restaurants within King & Godfree, which has been closed since July 2024 for further changes and will reopen in stages, beginning February.\n\nAdvertisement\n\nLeo Donati said in a statement: “Jamie shares our values of quality, craft and a long-term commitment to the Carlton neighbourhood,” he said. “Marcello and I feel confident Donati’s is in the right hands as it moves into its next chapter.” Marcello Donati has been contacted for comment. Related Article ‘It’s not just a butcher’: Legendary Carlton shop Donati’s celebrated in its final weeks\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/frustration-mounts-as-borges-blows-up-20260119-p5nv3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Frustration' mounts as Borges blows up",
        "publish_date": "Mon, 19 Jan 2026 12:29:32 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Frustration' mounts as Borges blows up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/appeasing-trump-won-t-work-could-europe-deploy-its-bazooka-over-greenland-20260119-p5nv0b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Appeasing Trump won’t work. Could Europe deploy its ‘bazooka’ over Greenland?",
        "publish_date": "Mon, 19 Jan 2026 11:59:23 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Advertisement\n\nWorldEuropeTrump's White House Opinion Appeasing Trump won’t work. Could Europe deploy its ‘bazooka’ over Greenland? Stephen Bartholomeusz Senior business columnist January 19, 2026 — 11:59am\n\nJanuary 19, 2026 — 11:59am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhen Donald Trump arrives at Davos later this week he’s likely to receive a frosty reception from European leaders now scrambling to decide on a response to his threat to impose tariffs on European, UK and Nordic economies unless they deliver Greenland to the US. His announcement – not an official White House announcement, but a social media posting – that the US would impose 10 per cent tariffs on Germany, France, the UK, the Netherlands, Finland, Sweden, Norway and Denmark on February 1, that would escalate to 25 per cent on June 1 until a deal on America’s ownership of Greenland is reached, has already ignited discussion of European retaliation. Donald Trump’s threat to increase tariffs unless the US buys Greenland has sparked discussion about retaliation. AP An emergency meeting of EU leaders will be held this week to decide how to respond to Trump’s threats, which have been described in Europe as blackmail, but are more akin to extortion. Already in question is the trade deal the EU and US agreed on last July, under which EU exports to the US would incur a 15 per cent tariff, while US exports to the EU would be tariff-free. That deal was supposed to be ratified by the European Parliament late next week, but that vote is now likely to be suspended.\n\nAdvertisement\n\nFrance, in particular, is pushing the EU to activate its “bazooka”, or the nuclear option of using the EU’s “anti-coercion” instrument it created in 2023 after China froze all trade with Lithuania, which had allowed Taiwan to open a representative office in Vilnius under its own name. If the instrument were activated – and that’s a big “if”, given how mutually destructive the US response would probably be – it would enable the EU to limit US access to its markets, restrict US investments in Europe, suspend US intellectual property rights, ban US digital services, bar US firms from bidding for government contracts and shut out US banks from the European banking system, among other measures. Related Article Analysis\n\nGreenland The four reasons Trump’s tariff threats won’t hand Greenland to him The likelihood that it would result in more tariffs, Europe’s reliance on the US for weaponry, the dominance of US institutions in the global financial system, the significance of US tech and social media companies within Europe and the probable end of NATO if the anti-coercion instrument was deployed means its activation would have seismic implications for the future of Europe and geopolitics. That makes it a measure of last resort. In the meantime, the EU is busily drawing up plans to revive the €93 billion ($160 billion) of retaliatory tariffs it had identified last year after Trump announced his “Liberation Day” tariffs. Those tariffs were suspended until February 6 this year, pending approval of the trade deal.\n\nAdvertisement\n\nUsing the retaliatory tariffs would be less provocative than resorting to the anti-coercion instrument, but would demonstrate that the EU isn’t going to simply roll over in response to Trump’s demands. The EU has also reached out to Congress, hoping that the threat to NATO and America’s historic relationship with the EU might finally galvanise some Republican opposition to Trump’s presidential over-reach. There does appear to be a nucleus of opposition within Republican ranks to the plan to acquire Greenland, whether by buying it or, as Trump has threatened, by force, although whether that translates to anything substantive from a Congress that, thanks to Republican majorities, has acceded to almost everything the White House has demanded is an open question. Why Trump is so insistent on owning Greenland when both Denmark and Greenlanders themselves say the US can, thanks to a 1951 treaty, establish as many military bases as it wants and that they are open to US companies trying to exploit the island’s considerable mineral resources, is unclear. US Treasury Secretary, Scott Bessent, said at the weekend it was because Europe was too weak to guarantee the security of the strategically important territory in the face of Chinese and Russian aggression.\n\nAdvertisement\n\n“Europeans project weakness, US projects strength,” he said. “The president believes enhanced security is not possible without Greenland being part of the US.” It is unclear why Donald Trump is so insistent on owning Greenland. Bloomberg It is uncertain, given that the only information of Trump’s latest tariffs came via a social media post, what authority Trump is relying on to impose tariffs on the eight countries he has identified, although Bessent referred to a “national emergency”. Asked what that national emergency might be, he replied (bizarrely) that “the national emergency is avoiding the national emergency”.\n\nAdvertisement\n\nAs the US could assuage its national security concerns without owning Greenland, one suspects that the real reason Trump is so adamant that it should be acquired, or taken by force, is that he is being driven by personal ambition: he wants a legacy of being associated with the large-scale expansion of US territory. Greenland’s land area is larger than that acquired in the Louisiana Purchase in 1803 that nearly doubled the then size of America. It’s about Trump’s ego, not national security. Related Article Analysis\n\nTrump diplomacy ‘Europe will not be blackmailed’: Sweeping retaliation on the cards after Trump’s Greenland threats If the tariffs were to be deployed under the banner of national security, using the International Emergency Economic Powers Act (IEEPA) – as most of Trump’s tariffs have been – their threat might be short-lived, or at least postponed until Trump can come up with another mechanism, given that the US Supreme Court is expected to rule on the constitutionality of the IEEPA tariffs imminently. It shouldn’t need to be repeated, but if the Supreme Court ticks off on the IEEPA tariffs and the new duties on EU exports to the US are imposed, they would be paid by American importers (contrary to what MAGA believes and some in the White House assert) and add to the cost of goods for American households that are already experiencing affordability challenges. The cost to its own consumers is why the EU refrained from enacting its own retaliatory tariffs last year.\n\nAdvertisement\n\nIn threatening to revive them, it knows there would be adverse impacts for its members’ economies, but would hope that their threat might cause Trump to back off, as he has tended to do when others, like China, call his bluffs (the “TACO,” or “Trump Always Chickens Out” trade). Last year, when confronted by Trump’s decision to impose punitive tariffs on friends and foes alike, the European response was to appease him rather than risk, not just trade with America, but the future of the NATO alliance at a moment when, with Russia invading Ukraine, an under-prepared Europe needed it. Related Article Opinion\n\nTrade wars Trump’s trade war with China is a $1.8 trillion fail Elizabeth Knight Business columnist Trump’s assault on Denmark and Greenland’s sovereignty, and the reality that the EU can’t deliver what Trump is demanding, however, makes appeasement and the fawning flattery that the Europeans deployed to stroke Trump’s ego non-viable options. Unless Congress or the Supreme Court intervene, Europe will have to confront some very difficult questions about its own sovereignty and integrity and its place within a world where it can no longer see the US as its major trading partner and a long-standing and protective ally. Russia and China would be struggling to contain their glee at that prospect. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/senegal-players-stormed-off-the-field-in-the-africa-cup-of-nations-final-better-times-were-ahead-20260119-p5nv1e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Senegal players stormed off the field in the Africa Cup of Nations final. Better times were ahead",
        "publish_date": "Mon, 19 Jan 2026 11:51:52 +1100",
        "category": "sports",
        "authors": [
            "Mark Gleeson"
        ],
        "text": "Rabat: Senegal stormed off the field in protest at a penalty awarded against them before returning to beat hosts Morocco 1-0 in extra time to win the Africa Cup of Nations amid farcical scenes in Sunday’s final.\n\nMidfielder Pape Gueye scored the 94th-minute winner after Morocco’s star player Brahim Diaz had squandered the chance to win it for the home side by fluffing the last-gasp penalty in regular time following a 14-minute delay that included the Senegal walk off.\n\nThe foul\n\nSenegal coach Pape Bouna Thiaw ordered his players off, and it was left to former Liverpool player Sadio Mane who persuaded them to return.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/systemic-underperformance-new-report-reveals-slump-in-public-service-delivery-20251215-p5nnpv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Systemic underperformance’: New report reveals slump in public service delivery",
        "publish_date": "Mon, 19 Jan 2026 11:50:00 +1100",
        "category": "finance",
        "authors": [
            "Rachel Eddie"
        ],
        "text": "Advertisement\n\nPoliticsVictoriaVictorian Parliament ‘Systemic underperformance’: New report reveals slump in public service delivery Rachel Eddie January 19, 2026 — 11:50am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nVictorian government departments failed to meet their service delivery performance targets more than a third of the time throughout 2024-25, according to the Victorian Auditor-General’s Office. A review into service delivery performance for 2024-25, published in December, found all departments met or exceeded only 65.2 per cent of their targets, and failed to meet them 23.2 per cent of the time by a significant margin. Premier Jacinta Allan in December. Joe Armao The Department of Justice and Community Safety (51.9 per cent) and the Department of Health (53.3 per cent) had the worst performances, meeting a little more than half their targets, while the Department of Treasury and Finance had the best performance (81.3 per cent), followed by the Department of Premier and Cabinet (79.4 per cent). The Country Fire Authority (CFA) also consistently missed its target to respond to 90 per cent of structure fires within its benchmark response time. Of the fires that brigades did not reach within the target time during the 2024-25 period, 39.6 per cent were missed by less than one minute, while 36.3 per cent were missed by less than three minutes.\n\nAdvertisement\n\nRelated Article Victoria bushfires Allan announces review into bushfire season CFA chief officer Jason Heffernan said dedicated volunteers worked around the clock. “CFA is committed to working with brigades to identify opportunities to enhance response times where appropriate,” he said. A political stoush broke out last week about CFA funding, which both the government and CFA board insisted had increased despite this not being reflected in their annual reports. The dispute was clouded by the delay in publishing the CFA’s most recent report, which will be published on Tuesday. The most common justification for failing service delivery targets across departments was operational factors such as project delays, scoping or complexity, and policy changes. Resource constraints, including increased demand, funding or workforce availability, was the next most common excuse.\n\nAdvertisement\n\nCrimes across Victoria took longer to resolve, with the target for crimes against a person missed 20.2 per cent of the time, and 26 per cent of the time for property and deception offences. The justice department said this was due to a reallocation of resources, challenges such as workforce availability and an increase in crime. The Crime Statistics Agency in December revealed that the number of criminal offences increased by 9 per cent in the year to September on a per-capita basis. Theft from a car, car theft, retail theft and family violence order breaches were the biggest increases. A Victoria Police spokesman said it would be unfairly simplistic to focus on this target alone.\n\nAdvertisement\n\n“Property and deception offences, including arson, can also be complex with incidents often involving multiple offenders and forming part of a series of linked offences,” he said. “Victoria Police made a record 77,911 arrests in the last year. “The overwhelming majority of serious, high-harm crimes are ultimately resolved and offenders held to account.” The Department of Families, Fairness and Housing (DFFH) also fell short on several child protection measures.\n\nAdvertisement\n\nThe proportion of Aboriginal children placed with relatives and kin, other Aboriginal carers or in Aboriginal residential care deteriorated by a significant margin in 2024-25. The department said there had been challenges locating family members in a position to provide care, but that Victoria continues to have the highest proportion of Aboriginal children placed with relatives, kin or Aboriginal carers of all jurisdictions. “Our priority is to support families and keep them together when it is safe to do so. We take immediate action to protect children in all instances where a significant risk of harm is substantiated,” a department spokeswoman said. Victorian Aboriginal Legal Service chief executive Nerita Waight said there was a lack of accountability and that child protection needed to work harder to build trust and support parents.\n\nAdvertisement\n\nFailures had knock-on effects for First Nations children disconnected from their community and culture, she said, pointing to the high rate of Aboriginal children removed from their families who end up in the youth justice system. “Family separation continues to have devastating and ongoing impacts for our children today, at rates which should be a national shame,” Waight said. Separately, DFFH’s performance also went backwards in the number of children abused or neglected within three months of failing to substantiate other allegations. The department missed its target on this measure by a significant margin for the third year in a row. The number of children who were the subject of a substantiated report within 12 months of a previous allegation being substantiated also worsened. DFFH said this was because of changes in a child’s circumstances, availability of and engagement with family services and supports, and the impact of COVID-19.\n\nAdvertisement\n\n“The Victorian government has invested more than $4.4 billion in the child protection and family services system over the past six state budgets, including recruiting more workers to give every child in care the support they deserve,” a department spokeswoman said. People on the priority waitlist for social housing, meanwhile, waited an average 17.3 months for a home. This was 64.8 per cent longer than the target. Opposition finance spokeswoman Bridget Vallence said the report confirmed Victorians weren’t getting the quality health, education, community safety and transport services they deserved. “Victorians are paying the price for chronic failures, systemic underperformance, and financial mismanagement under Labor,” she said. A Victorian government spokesman said state Labor was focused on what matters, “good schools, great hospitals, real help with the cost of living and keeping people safe”.\n\nAdvertisement\n\n“We know there’s more work to do, and we will continue to invest in the things that matter to Victorians.” Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    }
]