[
  {
    "url": "https://www.9news.com.au/finance/macqaurie-investment-management-to-fully-compensate-shield-investors/cd3de5cb-3cad-48c7-9d94-f10a84c259b2",
    "title": "Macquarie to repay Shield investors $321 million over failure of super fund",
    "publish_date": "Thu, 25 Sep 2025 00:16:30 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Macquarie Investment Management Ltd (MIML) has today undertaken to repay thousands of people who invested hundreds of millions of dollars from their retirement savings in the collapsed Shield Master Fund (Shield).\n\nThe Australian Securities and Investments Commission (ASIC) began proceedings in the Federal Court against MIML, a subsidiary of the Macquarie investment bank, following admissions that it did not act efficiently, honestly and fairly by failing to place Shield on a watch list for heightened monitoring.\n\nThe corporate watchdog also accepted a court-enforceable undertaking from MIML to ensure Macquarie pays to members 100 per cent of the amounts they invested in Shield less any amounts withdrawn.﻿\n\nMacquarie Investment Management Ltd is a subsidiary of Macquarie Group. (Louie Douvis/AFR)\n\nUnder the terms of the enforceable undertaking, Macquarie must pay the funds to affected customers by September 30.﻿\n\nASIC said, as superannuation trustee, Macquarie Investment Management Ltd oversaw about $321 million in super investments into Shield by about 3000 of its members between 2022 and 2023.\n\nASIC deputy chair Sarah Court said the watchdog's investigation will see Macquarie return these members to the position they were in before their retirement savings were dwindled.\n\n\"This is an important outcome that stems the significant losses that threatened thousands of members' retirement savings after they used Macquarie's platform to invest their super in Shield,\" she said.\n\n\"Many members thought their funds were safe when they used Macquarie's super platform to invest in Shield, which had no track record.\"\n\nThe payments will be made in full by next Tuesday.\n\nASIC deputy chair Sarah Court. (Photo: Alex Ellinghausen) (Alex Ellinghausen)\n\nUnder the agreement, ASIC is not seeking civil penalties against MIML, despite admitting it breached the law.\n\nThe corporate watchdog said this was in recognition of the level of cooperation demonstrated by Macquarie in agreeing to pay members 100 per cent of the amounts invested in Shield less any amounts withdrawn, without waiting for an outcome of the Shield liquidation or proceedings against other parties involved.﻿\n\nMacquarie Group said its decision \"to devote resources to achieve this outcome recognises Shield's unique circumstances, notably the scale of the issue, its material impact on many investors and their limited access to recourse from the many different entities which played a role\".\n\n\"The approach of providing immediate certainty and an improved outcome for investors benefits all parties,\" the bank said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/optus-tripe-zero-outage-updates-singaporean-owner-singtel-group-to-arrive-in-australia/428cef24-8be2-4752-adb2-fd0d6f8ca620",
    "title": "Optus' Singaporean owners to travel to Australia over fatal outage fallout",
    "publish_date": "Thu, 25 Sep 2025 01:18:41 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Optus' Singaporean owner will fly to Australia next week in the wake of the under-fire telco's second major triple-zero outage in two years.\n\nYesterday, Optus chief executive Stephen Rue ﻿admitted the brand had \"absolutely\" suffered reputational damage after a failure to follow step one of an upgrade process caused a 13-hour technical issue that affected about 631 emergency calls and was linked to three deaths last week.\n\nThe team involved that day was comprised of both Optus and third-party Nokia staff in Australia and India, and despite five people calling the customer service line advising that there was an issue affecting triple-zero calls, the matter was never escalated.\n\nOptus' Singaporean owner Singtel Group will fly to Australia next week. (LinkedIn)\n\nParent company, Singtel Group,﻿ will visit Australia next week to discuss the incident with Optus.\n\nSingtel Group is ﻿a Singapore-based telco conglomerate backed by Temasek Holdings, an investment firm fully owned by the Singapore government and managed by Finance Minister and Prime Minister Lawrence Wong.\n\nCommunications Minister Anika Wells is hoping to meet with representatives of Singtel.\n\n\"I have asked to speak to Singtel when they are in the country next week,\" she told ABC this morning.\n\n\"This remains a constant watch for me, and whilst we have to let the investigation play out, and we have to be considered in a government response to the results of this investigation, meeting with Singtel, I think, is an important step.\" ﻿\n\nSingtel Group chief executive Kuan Moon Yuen made his first statement about the triple-zero outage yesterday, almost a week after the technical error occurred.\n\nThe triple-zero outage has called into question Optus' operating licence. (Dominic Lorrimer)\n\nIn it, he said he was \"deeply sorry\". ﻿\n\n\"We are deeply sorry to learn about the network incident at our Optus subsidiary that has impacted Triple Zero calls, and to hear that customers could not connect to emergency services when they most needed them,\" he said.\n\n\"Our hearts go out to the families and friends of those who have passed away, and we know that Optus will get to the bottom of this matter.\n\n\"We are working with the Optus board and management to ensure a thorough investigation of this incident to prevent any future recurrence.\"﻿\n\nThe triple-zero outage has called into question Optus' operating licence due to its second major failure to comply with emergency call service regulations and other related rules in two years.\n\nThese are the same rules the telco breached in 2023 when a nationwide triple-zero outage affected more than 2000 customers.\n\nOptus CEO Stephen Rue updates the media on the company's response the triple-zero outage. (Sitthixay Ditthavong)\n\nOptus was fined $12 million, but failed to implement a third of the recommendations from a review into that outage.\n\nOptus Board Chairman John Arthur said the board was working with Rue, who was hired in November to turn the brand around after his predecessor stepped down following fallout from the first outage, to prevent any further repetition of this incident.\n\n\"What has occurred is clearly unacceptable, and on behalf of the board, I apologise for this failure in our accountability to all those who relied on our triple-zero services,\" he said in a statement.\n\nAn independent review is underway to determine what happened, Optus' management of triple zero calls and its adherence to policies, procedures and legal requirements.\n\nThe report is expected to be completed before the end of the year. ﻿\n\nThe Australian Communications and Media Authority is also investigating, and Wells has hinted there may be a wider review ﻿into the telco industry and emergency service network.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/greta-thunbergs-flotilla-blasted-with-abba-music/c4fa070b-4472-4d3c-88f6-1e6b6f8360e9",
    "title": "Greta Thunberg's flotilla blasted with ABBA music",
    "publish_date": "Wed, 24 Sep 2025 22:50:50 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Activists in a flotilla seeking to break Israel's blockade of Gaza say some of their boats were attacked by drones and their radio communications channel was taken over by jammers playing an ABBA song.\n\nThe Global Sumud Flotilla, which is carrying Swedish activist Greta Thunberg, said it was attacked during the night by “unidentified drones and communications jamming” while in the south of Greece, prompting Spain and Italy to send navy vessels for possible rescues\n\n“At least 13 explosions\" were heard on and around several flotilla boats, while drones or aircraft dropped “unidentified objects” on at least 10 boats.\n\nThe Italian fleet of the Global Sumud Flotilla departs from the port of Siracusa, Italy, Thursday, Sept. 11, 2025. (LaPresse via AP)\n\nNo casualties were reported but there was damage to the vessels and “widespread obstruction in communications,” it added.\n\nActivists posted a brief video showing what appeared to be an explosion on or near one of the vessels. Greece’s coast guard did not report any distress calls.\n\nThe Israeli military did not immediately respond to questions regarding the attack.\n\nThe flotilla, which organisers say includes about 50 vessels and participants from dozens of countries, is carrying a symbolic amount of humanitarian aid, including food and medicine, for Palestinians in Gaza.\n\nThe Israeli Foreign Ministry has accused organisers of being linked to Hamas, an accusation organisers reject.\n\nIsrael has proposed that the activists unload their aid in the Israeli port of Ashkelon for it to be transported into Gaza, saying it will not accept any breach of its blockade.\n\nDefiant activists\n\nThunberg called the strikes a “scare tactic\" that wasn't going to stop the flotilla.\n\n“The most important thing isn’t that we were hit by drones,\" Thunberg said on a livestream, adding that the focus should remain on Gaza. \"Drones are something that Palestinians experience 24-7.\"\n\nItalian activist Simone Zambrin said drones “have been flying over our heads for days now” and on Wednesday \"dropped devices at our boats, damaging both the sails and the hearing of some of our crew members.”\n\nShe said Israel was trying \"to instill fear because it is afraid of our arrival.”\n\nSwedish climate activist Greta Thunberg waves from a boat taking part in a civilian flotilla bound for Gaza, aiming to break the Israeli blockade and deliver humanitarian aid, in Barcelona, Spain, Sunday, Aug. 31, 2025 (AP)\n\nGreg Stoker, an American activist on one of the boats, said online that the vessel's radio communications suffered interference, with the jammers playing an ABBA song over the radio channel the flotilla was using.\n\nItaly and Spain sending navy patrol vessels\n\nItaly condemned the attack and activated a navy frigate to be on hand for possible rescue operations, Italian Defense Minister Guido Crosetto said.\n\nCrosetto said the frigate Fasan was heading to the area from its position north of Crete \"for possible rescue operations.” Italy has informed Israel about the decision.\n\n“In a democracy, demonstrations and forms of protest must also be protected when they are carried out in accordance with international law and without resorting to violence,” Crosetto said.\n\nSpanish Prime Minister Pedro Sánchez said Spain also will send a patrol vessel to assist the flotilla, or carry out a rescue.\n\n“The Spanish Government demands that international law be complied with and that the right of our citizens to navigate the Mediterranean safely be respected,” Sánchez said Monday in New York.\n\nItaly’s Foreign Ministry meanwhile said its computer systems had been overwhelmed by a “mail bombing” campaign in which thousands of what it said were fake emails flooded its servers after the attack on the flotilla.\n\nEarlier Wednesday, the Global Sumud Flotilla had sent out an urgent appeal to its supporters asking them to email the ministry demanding it take a firm position to condemn the attack on the flotilla and put diplomatic pressure on those responsible.\n\nThe emails “had the effect of hindering the work” of the ministry's crisis unit, which has been the main point of contact for Italian citizens aboard the flotilla, the Foreign Ministry said in a statement. Italian officials have said 58 Italians were in the flotilla, including some lawmakers.\n\nThe European Union also warned against the use of any force. “The freedom of navigation under international law must be upheld,\" said Eva Hrncirova, a European Commission spokesperson.\n\nUN Human Rights Office spokesperson Thameen Al-Kheetan called for an investigation.\n\nAttacks on the flotilla\n\nThe flotilla has reported several attacks since it set sail from Spain on September 1, including two while some of its boats were in Tunisian waters.\n\nActivists say it's the largest attempt to date to break the Israeli maritime blockade of the Gaza Strip, which has now lasted 18 years, long predating the current war in Gaza. Israel says the blockade is needed to keep Hamas from importing arms, while critics consider it collective punishment.\n\nThe almost two-year war has killed more than 65,000 Palestinians, according to the Gaza Health Ministry. The ministry does not say how many were civilians or combatants, but says around half were women and children.\n\nThe world’s leading authority on hunger crises said last month that Israel’s blockade and ongoing offensive had already pushed Gaza City into famine. More than 300,000 people have fled the city in recent weeks as Israel has ordered the population to move south, but an estimated 700,000 remain, according to UN agencies and aid groups.\n\nThe war began on October 7, 2023, when Hamas-led militants stormed into Israel and killed 1,200 people, most of them civilians, and took 251 others hostage. Israel says its operation in Gaza is aimed at pressuring Hamas to surrender and return the remaining 48 hostages, about 20 of whom Israel believes are still alive. Most of the rest were released in ceasefires or other deals.\n\nActivists have launched several flotillas aimed at breaking the blockade over the years, nearly all of them intercepted by Israel. Another vessel said it was attacked by drones in May in international waters off Malta.\n\nAn overland convoy traveling across North Africa also attempted to reach the border but was blocked by security forces aligned with Egypt in eastern Libya.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/queensland-lotto-winner-wants-to-build-emu-racing-track/ec770635-e121-4a82-bf9b-9e42fdf57192",
    "title": "Man shares his unusual emu-related plans for $2 million lotto win",
    "publish_date": "Thu, 25 Sep 2025 00:23:33 +0000",
    "category": "sports",
    "authors": [
      "Sep"
    ],
    "text": "A Queensland lotto winner has revealed big plans for his windfall - including a racing track starring one of our national animals.\n\nThe Cannonvale man was one of the five jackpot winners in Saturday's Gold Lotto draw, taking home $2 million.﻿\n\nThe Mackay-Whitsundays region has been a hotspot for lotto wins in 2025, with eight major winners so far this year bagging more than $21.15 million collectively.\n\nA Queensland man has won a $2 million share of a lotto jackpot. (The Lott)\n\n\"I've been playing Saturday Gold Lotto for two years. I never expected for this to happen to me,\" the man said.\n\n\"I'm still decompressing from the win. I found out Saturday morning and have been sitting on it ever since.\"\n\nAnd he's dreaming big about what to do with his winnings.\n\nThe winner joked that he could build an emu racing track. (Adobe Stock)\n\n\"I could use the money to build an emu racing track on my property between Prosperine and Airlie Beach,\" he said.\n\n\"I've loved emus since childhood and have always wondered if I could do such a thing. Now with $2 million – who knows?\"\n\nBut first, he said, he was heading to the local RSL with some mates to celebrate.\n\nMystery lottery winner takes nine months to claim staggering $1.8 billion prize View Gallery\n\nThe man purchased his winning ticket at News Whitsunday in Whitsunday Plaza Centro, Cannonvale.\n\n\"This will be our third division one winning entry that we've sold in the last three years! We're known by the locals as a lucky store,\" store owner Rich Bates said.\n\n\"The last time we sold a division one winning entry before this win was in May 2024, which was also a Saturday Gold Lotto winner.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/millions-of-australians-without-emergency-savings-money-crisis/4b88ee7f-ee7b-433a-b304-5123fe8f36e5",
    "title": "Millions of Aussies facing 'financial chaos'",
    "publish_date": "Wed, 24 Sep 2025 22:03:54 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Millions of Australians are too strapped for cash to deal with a financial emergency, meaning a job loss or medical incident could land them in an instant crisis.\n\nA new survey from Finder found that almost two in five respondents - equivalent to 7.9 million people - don't have enough money saved to cover three months of essential living costs.\n\nAnd one in five said they found it \"very difficult\" to save money.﻿\n\nMany Australians don't have enough money in the bank to deal with a financial emergency. (Getty)\n\n﻿ Nearly one in 10 don't have a three-month savings buffer but are trying to get there, while eight per cent of respondents said they didn't﻿ think a three-month emergency fund was necessary.\n\nFinder money expert Alison Banney said millions of households were vulnerable to an unexpected event like job loss or illness.\n\n\"One sudden unexpected financial setback – like a redundancy or a health scare – could throw their whole life into financial chaos,\" she said.\n\n\"Those without savings could be forced to rely on debt which could quickly leave them in a worse position.\"\n\nHowever, while 37 per cent of Australians don't have a three-month emergency fund, the average Aussie has $43,650 in cash savings according to Finder's Consumer Sentiment Tracker, highlighting a gap between the haves and have-nots.\n\nBanney said even putting away a small amount consistently can add up over time and provide a crucial buffer.\n\nThe 'happiest job in the world' pays just $58k per year View Gallery\n\n\"The idea of saving three to six months worth of expenses can seem daunting to Australians who can't even afford an unexpected $1000 emergency outlay,\" she said.\n\n\"Building an emergency fund is possible. Even $20 a week adds up to more than $1000 in a year, and that's before you include any interest earned on the cash.\"\n\nBanney also urged Aussies to set up an automatic transfer into a separate high interest savings account.\n\n\"There are great savings accounts available that pay a decent rate without making you jump through hoops. These accounts would be ideal for an emergency fund,\" she said.\n\n\"With the festive season around the corner, now is a great time to trim any unnecessary spending. From cancelling subscriptions to getting cheaper health insurance cover, see where you can divert any savings into that emergency fund straight away.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/breastfeeding-mum-says-she-was-told-she-cant-feed-baby-during-first-aid-course-geelong/e35d63d0-cd92-4206-a248-668b4f420709",
    "title": "'Huge inconvenience': Mum's anger over breastfeeding ban during CPR course",
    "publish_date": "Wed, 24 Sep 2025 19:20:27 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Exclusive: A﻿ Victorian mother has told how she was not allowed to breastfeed her baby and made to feel like an \"inconvenience\" during a first aid course.\n\nGeelong mum-of-two and personal trainer﻿ Felicity Ryan needed 20 minutes to feed her son during a day-long CPR training course last year and asked the facilitators to accommodate her request.\n\nRyan explained to 9news.com.au she was told to breastfeed during a 10-minute break outside of the room instead because no children were allowed inside.\n\nFelicity Ryan and her two kids. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\n\"I was made to feel like a huge inconvenience for asking to breastfeed my six-month-old during breaks or in class,\" Ryan said.\n\n\"The balancing act between professional responsibilities and motherhood is challenging enough without social pressures and stigma adding to the burden.\"\n\nWhen she was told by organisers she'd miss too much of the course if she fed her son outside for longer than 10 minutes, Ryan was asked to come back another time or split the course over two days.\n\n﻿\"I'm extremely disappointed that you are making this so difficult for new mums who run businesses,\" Ryan told the trainers via email.\n\nIn response, the course managers said they could not \"guarantee there won't be a disruption to the class\".\n\nAs a personal trainer, Ryan needed to attend the eight-hour class to fulfil her business requirements.\n\n\"It's really upset me… I run a business, I am not just doing this to be away from my baby for fun,\" she said.\n\n\"I don't know why they made it such a drama.\"\n\nRyan did not want to name the CPR course for this article.﻿\n\nShe later found a shorter first aid course with organisers who said she could bring her baby and feed him if needed.﻿\n\nRyan ﻿said Dr Elise Turner's experience being booted out of a Virgin business airport lounge in Melbourne last week for expressing milk reminded her of how she was treated as a new mum.\n\n\"I instantly felt disgusted, furious, upset and disappointed that in 2025 breastfeeding and pumping mothers are still made to feel a sense of shame, guilt and embarrassment,\" she said.\n\nRyan dropped out of the first aid course after being told she couldn't breastfeed. (Supplied)\n\nRyan sent an email asking if she could breastfeed during the class. (Supplied)\n\nCo-founder of ﻿breastfeeding brand Bubka Alicia Segal said she was \"outraged\" when she first heard about Ryan's experience.\n\n\"As a breastfeeding mum in the trenches with a newborn, running her own business and trying to keep up with her first aid training, to be told she wouldn't have a proper opportunity to breastfeed in the course made me mad,\" Segal said.\n\n\"I encouraged her to speak up about it and heard that she decided to change to another first aid program.\"\n\nSegal said her company surveyed 200 Australian mums last month for its Breastfeeding & Pumping Report and found 65 per cent don't feel confident breastfeeding in public.\n\n\"Babies don't run to a schedule and nor should they so it's important that society supports breastfeeding and pumping mums throughout the journey,\" Segal added.\n\nSegal said she also spoke to Turner after her experience at Virgin and personally thanked her for bringing attention to the often under-reported issue.\n\n\"She came face to face with adversity and she took the opportunity to stand up for what is right (and legal),\" she said.\n\nAlicia Segal from Bubka. (Supplied)\n\nPost-partum doula Ricki-Lee﻿, director of The Doula Pod in Sydney, told 9news.com.au she was also surprised to read of Turner's experience in the year 2025.\n\nBut she said it was sadly indicatative of how breastfeeding parents often feel when out in public.\n\n\"I've had clients who have been asked to move to a bathroom to feed their baby, which obviously is unhygienic and really disheartening,\" she said.\n\n\"I've had others who've been stared at, comments that have been made under their breath while they're out in public feeding, so they're feeling really judged and exposed.\n\n\"I've got mums that are returning for work and they've been made to feel really uncomfortable pumping in their office, so they've had to go to their car to pump.\n\n\"Things like that make a woman feel embarrassed and ashamed.\"\n\nRicki-Lee said plenty of her clients face similar discrimination. (Supplied)\n\n﻿Ricki-Lee said she hoped breastfeeding mothers wouldn't have lose their confidence to pump or feed in front of others.\n\n\"It's those kind of moments that really chip away at mother's confidence,\" she said.\n\n\"And while [Turner] was incredibly brave and stood up for herself, some women who are tired, sleep-deprived and don't feel that they can have that confrontation... they just go and do it in private.\"\n\nThe mum said the dialogue \"needs to change\", including in places that aren't a business class lounge like cafes and shops.﻿\n\nFollowing Turner's experience, a spokesperson for Virgin Australia told 9news.com.au the airline was \"sorry for the way this situation was handled\".﻿\n\n\"It fell short of the high standards of care and customer service our team strives to deliver,\" the spokesperson said.\n\n\"We have reached out to our guest today to apologise directly.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/tourism-board-wants-to-charge-tourists-to-visit-twelve-apostles-victoria/a89c04f8-8994-4afb-b8ef-5af55a7c9116",
    "title": "Tourists could be charged a fee to visit famous Aussie landmark",
    "publish_date": "Wed, 24 Sep 2025 07:24:09 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A Victorian tourism board and local council have floated the idea of charging tourists a fee to visit the famous Twelve Apostles on the Great Ocean Road.\n\nGreat Ocean Road Regional Tourism (GORRT) and Corangamite Shire have today called on the Victorian state government to seize a \"once-in-a-generation\" opportunity to greenlight a user-pays model to access the iconic natural attraction.\n\nThe proposed fee would support \"infrastructure, conservation, community wellbeing and user experience,\" the joint statement said.﻿\n\nThe famous Twelve Apostles on the Great Ocean Road. (Getty Images/iStockphoto)\n\n\"As stewards of the visitor economy in this extraordinary region, we believe a thoughtfully introduced user-pays system is not only fair, it is essential,\" said GORRT chair Andrew Jeffers.\n\n\"This approach must allow the active management of visitation across the day and year, encourage overnight stays, capture economic benefit, and reinvest directly into protecting and enhancing the fragile coastal environment.\"\n\nThe fee proposal was suggested in the regional tourism board's strategic business plan for 2025-2029.\n\nThe statement noted that a \"well-designed\" model would reward ﻿overnight and off-peak travel to relieve the peak period pressures.\n\n\"The Great Ocean Road is more than a scenic drive – it's a living, working region filled with vibrant communities, remarkable landscapes, and cultural depth,\" said GORRT general manager Liz Price.\n\nThe Great Ocean Road attracts millions of tourists each year. (Getty Images/iStockphoto)\n\nREAD MORE: Macron forced to walk NYC streets as Trump motorcade blocks traffic\n\n\"It's time we aligned our tourism management with our values – sustainability, responsibility, and long-term community benefit.\"\n\nThe tiered fee system was not determined in the statement.\n\nHowever, the proposal said the user-pays model would help fund a $126 million investment into the﻿ Twelve Apostles Precinct, which includes a new visitor centre.\n\nThe joint message urged the Victorian government to \"lead boldly\" to unlock the full potential of the Great Ocean Road region.\n\n﻿An estimated 6.8 million tourists traverse the Great Ocean Road each year, with tqo million visiting the Twelve Apostles annually.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/rapture-2025-what-is-it-prediction-tiktok-theory-trend-everything-to-know-explainer/ec4fccba-d677-4f92-980e-25e725983be0",
    "title": "Some TikTok users are convinced the world will end today. Here's why",
    "publish_date": "Wed, 24 Sep 2025 02:57:30 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "The world was supposed to end today – at least, according to one sect of TikTok users.\n\n\"RaptureTok\" has taken over millions of users' For You Pages, revealing videos of religious Americans who are convinced the end times are upon us.\n\nThey subscribe to the ﻿evangelical Christian belief that the \"Rapture\", an apocalypse that will see Jesus Christ return to Earth and take true believers to heaven, is coming.\n\nAnd they're convinced it's going to happen on ﻿September 23 and 2﻿4. Here's what you need to know.﻿\n\nThe world was supposed to end today – at least, according to one sect of TikTok users. (Getty)\n\nWhat is 'RaptureTok'﻿?\n\nA surprising number of TikTok users, most of them from the US, have posted videos claiming that the rapture will occur on September 23 and 24.\n\nSeveral TikTok users who have made ﻿videos about the supposedly impending rapture have detailed how they're preparing to leave the Earth for heaven.﻿\n\n\"When you finally start moving up into the air, I recommend that you don't hold on to anything … keep your face looking upwards,\" one user said.\n\nOne user shared a clip of a car being put on a tow truck and claiming they sold their car because they wouldn't need it after the rapture.﻿\n\nAnother claimed she stocked her home with canned food and left 'instructions'﻿ for the people who will be left behind on Earth after the rapture.\n\nSome ﻿have even spoken about how they're preparing their children for the rapture.\n\nSeveral TikTok users have made ﻿videos about how they're preparing to leave the Earth for heaven.﻿ (Getty)\n\nThe movement, dubbed \"RaptureTok\" by some users, has sparked confusion and ﻿ridicule on social media.\n\nBut the more non-believers interact with ﻿\"RaptureTok\" content, even if only to poke fun at it, the more the TikTok algorithm pushes similar content to users.\n\nHence why \"RaptureTok\" appears to be all over everyone's feeds right now.\n\nWhy do people think the rapture will happen this week?\n\nThe theory that the rapture will occur on ﻿September 23 and 24 appears to have originated with a South African man named Joshua Mhlakela.\n\nMhlakela holds no religious titles but claimed to have previously worked as a pastor.\n\nIn June, YouTube user﻿ CettwinzTV posted an interview with Mhlakela where he claimed to have had a vision of Christ telling him the rapture was coming.\n\n\"He says to me: 'On [September] 23 and 24, 2025, I will come to take my Church,'\" Mhlakela said in the clip.\n\n\"The rapture is upon us, whether you are ready or not.\"\n\nThe video has since been viewed more than half a million times.﻿\n\nThis is the YouTube video where Joshua Mhlakela claimed the world would end on September 23 and 24. (YouTube/@centtwinz)\n\nWhat is the rapture according to the Bible?\n\nThough the rapture is a staple in some Christian belief systems, the word 'rapture' does not actually appear in the Bible.\n\nSeveral passages in the New Testament reference the second coming of Christ, the end of the world, or other events that believers may link to the Rapture.\n\nOne such reference is Thessalonians 4:13–17, which reads: \"For the Lord Himself will come down from heaven, with a loud command, with the voice of the archangel and with the trumpet call of God, and the dead in Christ will rise first.\n\n\"After that, we who are still alive and are left will be caught up together with them in the clouds to meet the Lord in the air. And so we will be with the Lord Forever.\"﻿\n\nThe word 'rapture' does not actually appear in the Bible, but there are references to the end times. (Getty)\n\nThe book of Revelation also details specific signs that will precede the end of the world in chapters five, six and eight.\n\nIt starts with seven 'seals'; a white horse, a red horse, a black horse, ﻿a pale horse, martyred souls, natural disasters, and silence in heaven.\n\nFollowing the breaking of the seven seals, angels will sound seven trumpets﻿ of judgement, signalling the end of days.\n\nBelief in the rapture specifically﻿ can be traced back to mid-19th century Britain.\n\nChristians already believed in the second coming of Christ but this new belief suggested that only ﻿some people - especially virtuous Christians, usually - would be accepted into Heaven.\n\nThe theory gained traction in the 20th century and was picked up by ﻿evangelical media, later spreading into pop culture as well.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/nicho-hynes-cronulla-sharks-nrl-preliminary-final/105815774",
    "title": "Sharks star shrugs off personal barbs in NRL title race",
    "publish_date": "Thu, 25 Sep 2025 01:49:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "Accused by some of being too nice and not nice enough by others, polarising Cronulla star Nicho Hynes \"doesn't give a rats\" about criticism that comes his way anymore.\n\nArriving in Melbourne as the Sharks look to upset the Storm in Friday night's preliminary final at AAMI Park, Hynes is again in the headlines — this time for his \"salty\" attitude.\n\nThe veteran halfback, who played three seasons with Melbourne before shifting to Cronulla in 2022, has dismissed the personal criticism as \"noise\".\n\nThe enduring legacy of the 2023 grand final Photo shows A man scores a try during a rugby league match, while another from the opposite team kneels behind. On Sunday, the Broncos and Panthers will face off in the finals for the first time since the 2023 grand final, but the memory of that night still hangs over both sides.\n\n\"I just worry about what my teammates and coaches need from me and external noise is external noise — I don't see it, I don't hear it,\" Hynes said.\n\n\"I couldn't give a rats about what people say about me … there's nothing left they can say more about me because it's already been said.\"\n\nHe said he will always defend his Sharks \"family\", which was why he has become more outspoken of late after previously being a media darling for his openness around his mental health and as an Indigenous advocate.\n\n\"If someone disses your family I think anyone would go out of their way to say something and speak up about it,\" said the 29-year-old Wiradjuri man.\n\n\"I take things personally when people try and diss my family.\n\n\"Maybe I've just had enough of it over the last few years with people disrespecting the Sharks. I'll fight for the Sharks until I stop wearing these jerseys.\"\n\nThe 2022 Dally M Medallist was irked by a perceived lack of respect shown towards his team, who had won just one of six finals games across the last three seasons prior to this year.\n\nIn 2025, they finished fifth, then eliminated the Sydney Roosters and minor premiers Canberra en route to the preliminary final.\n\nThey have also won nine of their last 10 matches, dropping only one game since their last trip to Melbourne where they were thumped 30-6 by the Storm.\n\nHe admitted they had used criticism of the team as motivation for their early finals campaign and are now happy to let their results speak for themselves.\n\n\"I'm not in it to prove it to anyone, I'm just in it to prove ourselves — we deserve to be here and we wouldn't be here if we didn't,\" Hynes said.\n\n\"The respect, that's all other people's opinions and obviously we've probably used that a little bit in that first final with motivation, but at the moment I just want to get the job done for the team.\n\n\"If you get the job done that's how you earn respect.\"\n\nHynes's opposite Jahrome Hughes will enter the match with just one game under his belt in the past two months — the Kiwi Test number seven breaking his arm in a round-27 return from a shoulder dislocation.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nStill good friends with many of the Storm players, Hynes described Hughes as a \"tough little bugger\".\n\nHaving been in the Storm system, he knows how they would approach an injured player if the tables were turned.\n\n\"I know exactly what they would be doing and I'd be making 50 tackles,\" Hynes said.\n\n\"Every halfback is a target, I'm a target, I'm making 30-plus tackles a game at the moment and we're not going to shy away from him.\n\n\"We've got to worry about a lot of players on the field and target a lot of players, not just Jahrome Hughes.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/albanese-united-nations-general-assembly-speech/105815200",
    "title": "Albanese addresses UN on climate, Gaza and a Security Council bid",
    "publish_date": "Thu, 25 Sep 2025 01:42:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Anthony Albanese has used a speech at the United Nations to recommit Australia to the fight against climate change, a day after Donald Trump told the world body it was a \"con job\" that was destroying the West.\n\nThe prime minister also urged world leaders to seize the \"moment of opportunity\" to work towards peace in the Middle East — but he did not mention Israel by name, nor refer to a UN commission of inquiry's recent finding it was carrying out a genocide.\n\nAnd he confirmed Australia would push for a temporary seat on the UN Security Council, a project started by the previous Coalition government but rarely mentioned since Labor's return to power.\n\n\"The United Nations is much more than an arena for the great powers to veto each other's ambitions,\" Mr Albanese told the General Assembly in New York.\n\n\"This is a platform for middle powers and small nations to voice — and achieve — our aspirations.\n\n\" That is why Australia is seeking a place on the UN Security Council in 2029-30. \"\n\nThe speech was Mr Albanese's first at the UN's headquarters, where Foreign Minister Penny Wong has addressed the room in past years.\n\nThe prime minister earlier spoke at two sideline events on climate, outlining his government's new 2035 emissions reduction target and arguing Australia's embrace of clean energy would make it achievable.\n\n'Your countries are going to hell': Trump's complaint-filled speech to the UN Photo shows Donald Trump speaks in front of green marble. Donald Trump uses a speech at the UN to criticise US allies' moves to recognise Palestine and chastise the international community over a range of other American grievances.\n\n\"Australia is acting to meet the environmental challenge of climate change while working to seize and share the economic opportunities of renewable energy,\" Mr Albanese told the General Assembly.\n\n\"Clean energy can carry the world beyond the false choice between economic growth and environmental responsibility.\"\n\nMr Trump, who posed for a selfie with Mr Albanese at a function the night before, had earlier used his UN speech to trash the world's efforts to fight climate change and tell Western leaders it was one reason their \"countries are going to hell\".\n\nBut Mr Albanese said clean energy \"enables the rapidly growing economies of the Indo-Pacific to industrialise and decarbonise at the same time, and to continue lifting their people's living standards while lowering their nation's emissions\".\n\nReviving a decade-old goal\n\nMr Albanese's 19-minute address put a focus on the UN's founding values of global cooperation, and mounted an argument for strengthening the 80-year-old institution in the face of growing threats.\n\nAfter Mr Trump questioned the purpose of the UN and accused it of leaving global peacemaking up to him, Mr Albanese said the body should reform, but: \"If the United Nations steps back, we all lose ground.\n\n\" If we give people reason to doubt the value of co-operation, then the risk of conflict becoming the default option grows. \"\n\nThe world faced \"all manner\" of challenges, including cruel dictators, invading tyrants, oppressive regimes and \"autocracies deploying new technology to undermine our trust in democracy, institutions and each other\".\n\nHe effectively revived a decade-old goal in saying Australia would seek a temporary place on the UN Security Council.\n\nThe decision to seek a seat for the 2029-30 year was announced by then-foreign minister Julie Bishop in 2015.\n\nAt the time, Labor criticised the \"unambitious\" time frame, which Ms Bishop said was appropriate for such a competitive process. \"We don't want to spend unnecessary time and resources trying to campaign at an earlier slot,\" she said.\n\nElections are set for June 2028.\n\nIn the meantime, Mr Albanese said, Australia would also do its part by investing in defence, development and diplomacy and strengthening the security of the Indo-Pacific.\n\nThe speech was Anthony Albanese's first at the UN. (Reuters: Eduardo Munoz)\n\n\"We are deepening our engagement with ASEAN, and elevating our partnerships with Indonesia, India, the Republic of Korea and Japan,\" he said.\n\n\"And we are breaking new ground with old friends: in the United Kingdom, the European Union and our principal ally, the United States.\"\n\nSeeking peace\n\nJust hours after Ukrainian President Volodymyr Zelenskyy warned the UN the \"most destructive arms race in human history\" was underway, Mr Albanese reiterated Australia's support for Ukraine \"against Russia's illegal and immoral invasion\".\n\n\"We share the resolve of every member of the 'coalition of the willing' to secure peace on Ukraine's terms,\" he said.\n\nAnd on the Middle East, he repeated calls for a ceasefire, the release of hostages, and the flow of aid.\n\n\"For decades, leaders have come to this podium in search of new words and new ways to call the world to action on a two-state solution.\"\n\nExperts hope UN report on genocide spurs action Photo shows A crowd of Palestinians walk along a dusty road with their children, a man in front is carrying a baby wrapped in blankets. What ultimately determines whether the UN's report joins the list of other shocking but overlooked inquiries is whether this latest finding moves any governments, including Australia's, to take further action.\n\nAfter quoting the UN Charter's peace-oriented vision, he said: \"We must ask ourselves: When can those words hold meaning, if not now?\n\n\"Where can those words apply, if they do not apply to the Middle East? And what can we, the members of the United Nations, say we stand for if we cannot say we stand for this?\"\n\nHe said Hamas must have no role in Gaza's future, but he did not use the word \"Israel\" during his speech.\n\nIsrael has reacted angrily to the official recognition of Palestinian statehood, made by Australia and other Western nations in recent days, calling it a reward for Hamas. Mr Trump made the same criticism in his speech.\n\nIran's 'criminal acts of cowardice'\n\nMr Albanese also used the speech to take a swipe at the Iranian regime over its alleged antisemitic plots in Australia, which he called \"criminal acts of cowardice, aimed at spreading fear\".\n\n\"If ever we had the luxury of imagining that breaches of international law were not our concern, or that conflict and turmoil in another part of the world could not affect us, those days are long gone,\" he said.\n\n'Ambitious' United Nations of the 1990s is no more Photo shows Donald and Melania walking on the tarmac at the airport The United Nations has been powerless to do anything about the escalating horrors being seen to be inflicted on the Palestinian people in Gaza.\n\n\"Just last month, Australian security agencies confirmed that the Iranian regime orchestrated the firebombing of a synagogue in Melbourne and a Jewish restaurant in Sydney,\" he told the general assembly.\n\n\"We expelled the Iranian Ambassador from Australia, the first time since the Second World War that our country has taken such a step.\n\n\"And here at the United Nations, we repeat to the world: there is no place for antisemitism.\"\n\nSenator Wong, Energy Minister Chris Bowen and Communications Minister Anika Wells were part of the Australian delegation in attendance.\n\nEarlier in the day, Mr Albanese attended a forum to promote Australia's social media age limit to international leaders and delegates.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/nt-para-athlete-briseis-brittain-new-delhi-world-championship/105810758",
    "title": "17yo Arnhem Land para athlete set to compete in world championships",
    "publish_date": "Thu, 25 Sep 2025 01:06:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's a career that started playfully along the dirt tracks of Ramingining in the Northern Territory's remote Arnhem Land, but now Briseis Brittain is steely focused as she steps out onto international tracks.\n\nThe 17-year-old runs because it feels \"fun and free\", and now she's representing Australia at the World Para Athletics Championships in New Delhi, India.\n\n\"I am so excited to represent Australia … racing against people in different countries,\" Briseis says.\n\nShoulders back, chin high, Briseis beams as she steps out in green and gold.\n\nBriseis Brittain is excited to be representing Australia at the world championships in New Delhi. (ABC News: Marcus Kennedy)\n\nIt's the first time she's left Australia, and the international debut also marks a milestone for her community.\n\n\"I am the first Arnhem Land woman from Ramingining and Maningrida [to compete at this level], and I am going to make proud my people and my culture,\" Briseis says.\n\nIt's a passion fuelled by the success of Cathy Freeman, an Aboriginal Olympian cloaked in glory after taking gold in the 400 metres at the Sydney 2000 games.\n\nCathy Freeman celebrating her gold medal win in the 400m race at the Sydney 2000 Olympic Games. (AAP: Dean Lewis)\n\n\"Cathy Freeman was my favourite athlete, she was really amazing and talented, I want to be like her,\" Briseis explains.\n\n\" It was my dream since I was little. \"\n\nInvested in making that dream a reality, Briseis's family relocated to the Northern Territory capital of Darwin.\n\nBriseis's mother Marcey Garrawurra says she always knew her daughter had what it took to make it to the world stage.\n\n\"There's lots of talented kids from Arnhem Land but it's just there's not much [athletics] opportunities there — that's why I came to Darwin,\" Ms Garrawurra says.\n\n\"I am always proud watching her run.\"\n\nMarcey Garrawurra (right) says she's proud to see her daughter Briseis Brittain (left) competing on the world stage. (ABC News: Marcus Kennedy)\n\nRemote Arnhem Land is now abuzz, with family preparing to get online and watch Briseis run against the world's best para athletes in New Delhi.\n\n\"It's really, really, really special for me and my family that she is going to represent Australia and our family,\" Ms Garrawurra says.\n\n\"It's what I want for her.\"\n\nGoing neck-and-neck with the world's best has its hurdles when you live in Darwin, a capital city that is geographically isolated and has a population of just over 150,000 people.\n\nThere aren't enough para athletes in the city to have a standalone competition, so Briseis has been racing against peers without disabilities.\n\nTo refine her \"powerful\" running style, coach Roger Chin has employed AI, sending videos of her sprints to an interstate company for movement analysis and correction.\n\nRoger Chin says competing in New Delhi will be a unique experience and new challenge for Briseis Brittain. (ABC News: Marcus Kennedy)\n\n\"She is a raw runner, she uses a lot of power when she does run and she never gives up,\" Chin says.\n\nThe coach notes that racing in a huge international contest will be a significant test for Briseis.\n\n\"[It's a] new environment, new country, new people, new cultures — the pressures put on her will be quite high,\" Chin says.\n\nFor many of these athletes, success at the games won't be measured in medals. They instead hope the competition can help prepare them for the ultimate goal of competing at the Paralympics in LA in 2028 and Brisbane in 2032.\n\nBriseis Brittain will be competing with other para atheltes from all around the world. (ABC News: Marcus Kennedy)\n\nStephen Caddy is the head of the Para Program at Australian Athletics's high-performance department.\n\nHe's been preparing the Australian para athletes squad in Dubai, running mock races and getting the team acclimatised to tropical conditions, with much of the team having flown in from a southern winter.\n\n\"We've got a number of other nations staging there with us — the Netherlands, Denmark, Great Britain and Canada,\" Caddy says.\n\n\"Obviously, with the para team, we have to move a lot of staff with a lot of athletes for support purposes, so it'll be a wave and staggered approach into New Delhi.\"\n\nBriseis Brittain is now with the squad preparing in New Delhi.\n\n\"We've got Briseis Brittain who will be competing in the 200 and 400m,\" Caddy says.\n\n\"[She] is in the T-38 class, for athletes with minimum impairments but with motor impairments.\"\n\nBriseis Brittain has been working closely with her coach Roger Chin to prepare for the world championships. (Supplied.)\n\nWith 51 team members, this year's Australian para squad is the biggest since the 2000 Sydney Paralympic Games.\n\nCaddy says these are the para athletes who will shape the nation's sporting future.\n\n\"We've got a massive team, it's our second largest world championships team ever that we've taken for para athletics,\" Mr Caddy says.\n\nBriseis's qualification from far-flung Darwin is an exciting opportunity for the Australian team.\n\n\"I've been operating teams for about 10 years, I can't remember the last time, or if in my time, there's been a Northern Territory athlete on our para team,\" Caddy says.\n\nBriseis Brittain is the first Arnhem Land woman from Ramingining and Maningrida to compete in a world athletics championship. (ABC News: Marcus Kennedy)\n\nHe says unprecedented federal government funding is helping to build and prepare Australia's para sport movement.\n\nAlmost $55 million will be used to help athletes like Briseis overcome barriers to developing and competing, through the Para Uplift sport program.\n\n\"It's great to see some opportunities present in that region,\" Caddy says of the NT.\n\n\"We know that area produces some great athletes, it's only a matter of time before we start recognising the potential in the para athletic space or para sport space as well.\"\n\nThe World Para Athletics Championships starts on September 27, with Briseis Brittain's first race set for October 1.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/ilbijerri-theatre-company-artistic-director-andrea-james/105806022",
    "title": "This groundbreaking theatre company shaped Andrea's career. Now she runs it",
    "publish_date": "Thu, 25 Sep 2025 00:51:31 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In the late 90s, Yorta Yorta/Gunaikurnai playwright and director Andrea James performed at Melbourne Festival as part of an Aboriginal clown troupe.\n\nTheir name was the Oogadee Boogadees, and they sprang from Melbourne Workers Theatre, founded by playwright Patricia Cornelius in the late 80s.\n\n\"We didn't really know what we were doing,\" James says.\n\nShe recalls seeing in the audience the late Uncle Bob Maza, an actor, playwright, activist and co-founder of National Black Theatre.\n\n\"He really supported us,\" she says.\n\nMaza is the father of Yidinji, Meriam and Dutch director Rachael Maza, the outgoing leader of Ilbijerri, Australia's oldest Indigenous theatre company.\n\nJames, now an award-winning playwright, was announced on Thursday as Maza's successor at Ilbijerri Theatre Company, as she steps back after almost 18 years as artistic director.\n\nListen to Rachael Maza on ABC Radio National's Speaking Out Photo shows Rachael Maza\n\n\"It's just so lovely to continue to be a bit in that Maza orbit, with Rachael's encouragement and the colleagueship that we've shared over the years, too,\" James says.\n\n\"The way she's built the company up from a project-to-project, community-led company to a major performing arts organisation is just extraordinary.\"\n\nIn a statement, Maza described James as having a \"sharp contemporary voice rooted in identity, creative sovereignty and truth-telling\".\n\n\" Andrea's extraordinary talent as a writer, director and producer will honour Ilbijerri's legacy of bringing bold and impactful Blak stories to the national and international stage. \"\n\nTheatre that shaped her\n\nWhen James graduated from the Victorian College of the Arts (VCA) in 1996, Ilbijerri was a nascent theatre company, formed by a collective of Indigenous artists just five years earlier.\n\nNew play re-examines problematic past Photo shows A stage set of a motel room; an Indigenous woman sits on the bed; a painting of a ship hangs on the wall Andrea James's powerful new play shows just how much work Australia still has to do to reckon with the past.\n\n\"There were such incredible people that were volunteering their time,\" James recalls. \"[They were] artists and community members who were really passionate about having an Aboriginal theatre company.\"\n\nThose artists included writer and activist Bev Murray, actor Kylie Belling, theatre maker John Harding, late artist Destiny Deacon and more.\n\nWithin a few years of graduating from VCA, James worked on the development of what would become one of Ilbijerri's most enduring works: Jane Harrison's play about the Stolen Generations, Stolen, which premiered in 1998.\n\n\"The Naarm community and the artists there, they really encouraged me, but they also challenged me a lot, too,\" James says.\n\nWithin the next decade, she was invited to collaborate with Ilbijerri as a co-writer on Coranderrk: We Will Show the Country, which opened in Melbourne in 2010.\n\nThe late Uncle Jack Charles starred as Wurundjeri Elder and artist William Barak in Ilbijerri's Coranderrk: We Will Show the Country in 2013. (Supplied: Belvoir/Patrick Boland)\n\nThe play was composed of the testimony of men and women who lived on the Coranderrk Aboriginal Reserve and campaigned for land rights and self-determination at an 1881 government inquiry.\n\nLast year saw the premiere of Ilbijerri's Big Name, No Blankets, written by James, about the Warumpi Band, which in the 80s became the first rock band to sing in Aboriginal languages.\n\nBig Name, No Blankets debuted at Sydney Festival in January 2024, before touring to Rising, Darwin Festival and Brisbane Festival. (Supplied: Sydney Festival/Brett Boardman)\n\nBetween those shows, James's career in theatre has seen her take on the role of artistic director of Melbourne Workers Theatre in the 00s, and most recently associate artistic director at Griffin Theatre Company in Sydney.\n\nShe's also written a slew of plays, including Sunshine Super Girl, about Australia's first Aboriginal world tennis champion, Evonne Goolagong, and this year's The Black Woman of Gippsland.\n\nWhile James plans to keep writing plays while running Ilbijerri, she says she will also offer space to other Indigenous theatre makers \"for them to tell their stories, with their communities and their clan groups\".\n\nJames with tennis player Evonne Goolagong, the inspiration for her play Sunshine Super Girl. (Supplied: Griffin/Jhuny-Boy Borja)\n\nThat's space in terms of ambition — she wants to see large-scale works from established writers — and physically; she hopes to establish a dedicated studio space for Ilbijerri in Melbourne to develop work and potentially even perform for audiences.\n\n\"If we want to have more First Nations set designers and costume designers, then we need space for that,\" she says.\n\n\"I really look forward to a day where people come to our space and it's a Blackfella space. It's Blak-led and completely Blak-informed [and] we feel safe and good in the foyer, or, if it's outside, around a fire, whatever that might be.\"\n\nA vital company for today\n\nJames intends to maintain the culturally embedded, community-minded spirit of Ilbijerri, while at the same time enhancing its reputation as a national theatre company.\n\n\"It's going to be a good opportunity to ask the sector in Naarm and around: 'What is it that we've been doing well? Where are the gaps? How can I build on the opportunities that have come [before]?'\" she says.\n\nAs artistic director, James plans to \"listen deeply and respond accordingly\".\n\n\"All you've got to do is open up your heart and mind and do stuff with cultural respect and integrity and listen really carefully to people and the stories they want to tell,\" she says.\n\nShe initially applied for the role at the behest of other members of the theatre community.\n\n\"We get called to these jobs,\" she explains. \"Our community demands it of us.\"\n\nIt's a responsibility James takes seriously, considering the scarcity of opportunities for Indigenous theatre makers in Australia.\n\n\"They're massive jobs,\" she says. \"The Blackfella performing arts sector is immense and diverse, and people really care about this company.\"\n\nJames during rehearsals for Melbourne Theatre Company's production of her play The Black Woman of Gippsland. (Supplied: Jacinta Keefe)\n\nShe says Ilbijerri also feels vital in the wake of recent attacks on Indigenous peoples in Australia, including one on Camp Sovereignty after an anti-immigration rally earlier this month.\n\nSeven men have been charged with the attack.\n\n\"There are groups of people in our society who want us to shrink; that don't want us to do Welcomes to Country; that don't want us to hold our cultural, rightful place in this country,\" James says.\n\nIn the face of that prejudice, she points to Ilbijerri's stated aims, which include working with allies to eradicate racism in Australia.\n\n\"That's not to say that we're making theatre so that we can educate whitefellas, because we don't; we're making our theatre for ourselves and for our mobs,\" James says.\n\n\"But if we can bring our allies and accomplices along the way, who can work with us to counter these extremely racist and dangerous views in our country, that's one of the key things organisations like Ilbijerri can do.\n\n\"The more we can come together to continue to create culture that we invite people into, the more people are going to respect and understand and appreciate the absolute beauty and spirit of this country.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/afl-fan-club-gives-people-with-disability-a-place-to-socialise/105797970",
    "title": "Footy fan who supports 15 AFL teams finds friendship through his passion",
    "publish_date": "Thu, 25 Sep 2025 00:49:19 +0000",
    "category": "sports",
    "authors": [],
    "text": "Karen Cronin was on a camping trip watching an AFL match with her son, Jacob Cozens, when she had an idea that would transform his life.\n\nShe saw a group of young men socialising, and wished her son was having the same experience.\n\n\"My heart broke a little bit for him,\" she said.\n\n\"He shouldn't have been sitting there with us … we believe he needed to be social with other people.\"\n\nJohn and Karen Cronin are thrilled Jacob Cozens (centre) has found friends with similar interests. (ABC News: Alice Walker)\n\nThe 28-year-old Albury man lives with autism, schizophrenia, and intellectual disability — and supports almost every AFL team.\n\n\"Fifteen AFL men's teams,\" Mr Cozens confirmed.\n\nHe is known to wear merchandise from multiple clubs at once, and dreams of visiting every AFL football ground.\n\nMs Cronin realised that passion could be a window to a new social network: an AFL fan club.\n\nJacob Cozens (right) and his stepfather John Cronin are keen football fans. (Supplied: Karen Cronin)\n\n\"Growing up with Jacob, we often didn't get the invitations to the parties,\" she said.\n\n\" He didn't have friendships outside of his disability support network — I needed to do something. \"\n\nAn inclusive party\n\nMs Cronin approached her son's disability support service employer for permission to use an existing venue designed for people with disabilities, and started getting the word out about a new club.\n\nThe idea was to create a relaxed, supervised space where people with disabilities could socialise without explicitly working towards goals in their NDIS plans.\n\nThere is no obligation to RSVP, and numbers vary for each AFL Fan Club gathering. (ABC News: Alice Walker)\n\n\"We started off with three people, we didn't know how it was going to go,\" Ms Cronin said.\n\n\" Within five minutes there was high-fiving, the guys were getting together, they watched football, they were smiling. \"\n\nFrom that first gathering seven years ago, the AFL Fan Club has grown to attract as many as 50 people.\n\nKaren Cronin plans to register the AFL Fan Club as a charity. (ABC News: Alice Walker)\n\nLearning skills\n\nAccording to the 2021 Household, Income and Labour Dynamics in Australia (HILDA) survey, people with disability are twice as likely to experience social isolation.\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\nMr Cozens meets most days with support workers, who assist him with social challenges and work towards independent living.\n\nRespect Support Services co-director Adrian Hoffmann said Mr Cozens could become overwhelmed in the community.\n\n\"He doesn't always know how to interact with some people,\" Mr Hoffmann said.\n\n\"We encourage him to interact with members of the public, with cashiers to select food from menus … he's come a long way.\"\n\nAdrian Hoffmann has been working with Jacob Cozens for about five years. (ABC News: Alice Walker)\n\nMr Cozens's love of AFL is well known by his support team.\n\n\"It's off the charts,\" Mr Hoffmann said.\n\n\"Jacob would be at the footy every weekend if he could.\"\n\nSkills in practice\n\nThere are no memberships for the fan club, just an open invitation to get together every few weeks and enjoy the football and company.\n\nErin Wojtkowski supports Collingwood and enjoys travelling to the football each year. (ABC News: Alice Walker)\n\n\"It gives me a chance to hang out with my friend Jacob,\" regular participant Erina Wotjkowski said.\n\n\"I like talking to everyone,\" club member Mark Inwood said.\n\nMark Inwood is an Essendon fan who enjoys socialising at the AFL Fan Club. (ABC News: Alice Walker)\n\nMs Cronin said the group had worked wonders for her son and his interactions with others.\n\n\"His life has blossomed through this club, it's been amazing,\" she said.\n\n\" And not only his — many of the other participants as well feel connected to something and feel that they're welcomed. \"\n\nThe AFL Fan Club often meets at service provider Mercy Connect's Lavington social hub. (Supplied: Karen Cronin)\n\nMr Cozens supports both Geelong and Brisbane — so whatever happens in this weekend's grand final, he will be a winner.\n\nHe is equally supportive of the social group.\n\n\"I like the AFL Fan Club,\" he said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/peter-tonagh-to-become-chair-of-nine/105814974",
    "title": "Former ABC deputy chair Peter Tonagh to step up as Nine chair",
    "publish_date": "Thu, 25 Sep 2025 00:07:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former ABC deputy chair Peter Tonagh will step up as Nine's chair in November this year.\n\nHe replaces Catherine West, who spent 18 months in the position.\n\nMr Tonagh resigned from the ABC in December last year before joining Nine as an independent non-executive director in January 2025.\n\nMr Tonagh will enter the position with vast senior-level experience in the media industry.\n\nAlongside his role at the ABC, he has worked as CEO and CFO for Foxtel, CEO of News Corp and as interim CEO for the REA Group.\n\nHe is also chair of Quantium, GTN Limited and not-for-profit organisation Bus Stop Films.\n\n\"It's an honour to be appointed chair-elect of the Nine Board — a great Australian company with a rich heritage and an exciting future,\" Mr Tonagh said.\n\n\"On behalf of the Board, I thank Catherine for her leadership, guidance, and commitment to Nine, which have been instrumental in positioning the company for sustainable success.\"\n\nCatherine West became Nine's chair in June 2024. (Supplied)\n\nMs West said it had been a privilege to be a part of Nine's leadership team for almost 10 years, including as chair and deputy chair, thanking her colleagues and the board for their support.\n\n\"I am proud to have successfully led the company through a transformational period,\" she said.\n\n\"Nine has entered FY26 in an enviable position and based on Peter's extensive experience, he is ideally placed to continue the momentum.\"\n\nMr Tonagh will assume the role of chair following the Nine annual general meeting on November 7.\n\nMs West replaced Peter Costello in June 2024 after he spent almost eight years as the company's chair.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/aria-award-nominations-2025-aria-nominees-full-list/105815074",
    "title": "The 2025 ARIA Award nominees - the full list",
    "publish_date": "Thu, 25 Sep 2025 00:06:05 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Nominations for the 39th annual ARIA Awards have been revealed, with a host of Australian musicians and artists in the running to take home a pointy trophy.\n\nWith 29 categories spanning multiple genres and disciplines, it once again reflects the strength and diversity of the local industry over the past year.\n\nWho’s got the most ARIA nominations?\n\nLeading the nominees, with a whopping eight nods, is Central Coast producer Ninajirachi. Her debut album I Love My Computer is vying in major categories like Album of the Year, Best Solo Artist, Best Independent and Electronic Release.\n\nA two-time triple j Unearthed High finalist, Nina Wilson has been making music since she was 12 years old. She brands her sound as \"girl EDM\"— a playful update on the 2010s electronic dance music genre dominated by men.\n\nWe hailed I Love My Computer as an \"instant classic that rewires nostalgia into a deliriously fun, addictive, innovative rush of rave-ready electro-pop\".\n\nNInajirachi's full-length debut is among August's best albums Photo shows Ninajirachi by Tom Vanderzeil [Lead] In a massive month of new releases, these were 10 highlights we played over and over.\n\nJust behind Ninajirachi is Dom Dolla, with seven nominations. An ARIA favourite, the globally revered DJ and producer is in the running for Best Solo Artist, Best Australian Live Act, Best Video, Song of the Year, Best Engineer and Producer, and is the one to beat for Best Dance/Electronic Release – the category he’s conquered three times before.\n\nAmyl and the Sniffers have six nominations, making a strong return to the ARIAs from the Melbourne pub-punks. After taking two ARIA wins in 2022, the enigmatic, electric band have torn across the globe including performances at Glastonbury, Coachella and Reading & Leeds festivals.\n\nWith their third album Cartoon Darkness under their belts, Amyl and The Sniffers have now matched their previous ARIAs nominations record. This year they’re vying to take home the pointy award for Best Australian Live Act, Best Group, Best Rock Album, Best Video, Best Video, Best Cover Art and the coveted Album of the Year.\n\nAmyl take on the world Photo shows Amyl and the Sniffers 2024 by JOHN ANGUS STEWART \"I was starting to feel really ashamed of my big personality\": Why one of our most Australian-sounding bands moved to Los Angeles.\n\nWho else is hoping for ARIAs glory?\n\nNext up, each securing five nominations, is Hilltop Hoods and Thelma Plum.\n\nThe former trailblazing Adelaide hip hop trio are contenders for Best Group, Best Australian Live Act and Best Hip Hop/Rap Release for their chart-topping ninth album Fall From The Light, looking to add to their 10 previous ARIA trophies.\n\nGamilaraay singer-songwriter Thelma Plum is competing for Best Solo Artist, Album of the Year, and Best Pop Release behind second album I’m Sorry, Now Say It Back. She’s only won one ARIA previously: Best Cover Art back in 2019.\n\nIt’s a four-way tie for those in competition to take home four ARIA awards each. Vibe-setting electronic trio RÜFÜS DU SOL (who will be in town on their huge homecoming tour), beloved songwriter (and #4 in the Hottest 100 of Australian Songs), Missy Higgins, Like A Version-dominating duo Royel Otis, and Folk Bitch Trio, an emerging group known for their breathtaking vocal harmonies.\n\nSquaring off in the newly minted Best Music Festival category is Dylan Alcott’s all-inclusive Ability Fest; Victorian NYE event Beyond the Valley; NSW coastal favourites Yours and Owls and controversial Bluesfest, plus, summer touring staple Laneway Festival (fresh from dropping a 2026 line-up topped by Chappell Roan).\n\nAustralian rock and roll luminaries You Am I are being inducted into the Hall of Fame, joining icons including Yothu Yindi, Kylie Minogue, John Farnham and last year’s inductee Missy Higgins.\n\n\"We are bemused, flattered and surprised to be asked to sit at the parents’ table,\" frontman Tim Rogers joked of the induction.\n\nThe winners will be revealed on Wednesday, November 19 at the ARIA Awards ceremony, hosted at Sydney’s Hordern Pavilion on Gadigal Land.\n\n2025 ARIA Awards Nominees\n\nAlbum of the Year\n\nAmyl and The Sniffers – Cartoon Darkness [Amyl and The Sniffers / Virgin Music Group]\n\nMissy Higgins – The Second Act [Eleven Music / EMI Music Australia]\n\nNinajirachi – I Love My Computer [NLV Records]\n\nRÜFÜS DU SOL – Inhale / Exhale [Rose Avenue Records / Warner Music Australasia]\n\nThelma Plum – I'm Sorry, Now Say It Back [Warner Music Australasia]\n\nBest Solo Artist\n\nBARKAA – Big Tidda [Big Apples Music / Island Records Australia / Universal Music Australia]\n\nDom Dolla – DREAMIN’ [Good Fortune Records]\n\nKylie Minogue – Tension II [Mushroom Music]\n\nMallrat – Light hit my face like a straight right [Dew Process / Universal Music Australia]\n\nMissy Higgins – The Second Act [Eleven Music / EMI Music Australia]\n\nNinajirachi – I Love My Computer [NLV Records]\n\nPaul Kelly – Fever Longing Still [EMI Music Australia]\n\nThe Kid LAROI – How Does It Feel? [Columbia Records / Sony Music]\n\nThelma Plum – I'm Sorry, Now Say It Back [Warner Music Australasia]\n\nYoung Franco – it's Franky baby! [Neon Records]\n\nBest Group\n\nAmyl and The Sniffers – Cartoon Darkness [Amyl and The Sniffers / Virgin Music Group]\n\nFolk Bitch Trio – Now Would Be A Good Time [Jagjaguwar]\n\nHilltop Hoods – Fall From The Light [Island Records Australia / Universal Music Australia]\n\nRoyel Otis – hickey [Ourness / Capitol Records]\n\nRÜFÜS DU SOL – Inhale / Exhale [Rose Avenue Records / Warner Music Australasia]\n\nMichael Gudinski Breakthrough Artist\n\nFolk Bitch Trio – Now Would Be A Good Time [Jagjaguwar]\n\nGut Health – Stiletto [AWAL Recordings]\n\nMia Wray – Hi, It’s Nice To Meet Me [Mushroom Music]\n\nNinajirachi – I Love My Computer [NLV Records]\n\nYoung Franco – it's Franky baby! [Neon Records]\n\nBest Pop Release\n\nG Flip – Disco Cowgirl [AWAL Recordings]\n\nKita Alexander – Press Pause [Warner Music Australasia]\n\nKylie Minogue – Tension II [Mushroom Music]\n\nMallrat – Light hit my face like a straight right [Dew Process / Universal Music Australia]\n\nThelma Plum – I'm Sorry, Now Say It Back [Warner Music Australasia]\n\nBest Dance / Electronic Release\n\nConfidence Man – 3AM (LA LA LA) [I OH YOU / Mushroom Music]\n\nDom Dolla – DREAMIN' [Good Fortune Records]\n\nFISHER – Stay [etcetc Music Pty Ltd]\n\nNinajirachi – I Love My Computer [NLV Records]\n\nSonny Fodera, D.O.D & Jazzy – Somedays [Solotoka / ADA]\n\nBest Hip Hop / Rap Release\n\nBARKAA – Big Tidda [Big Apples Music / Island Records Australia / Universal Music Australia]\n\nHilltop Hoods – Fall From The Light [Island Records Australia / Universal Music Australia]\n\nMiss Kaninna – Kaninna EP [Soul Has No Tempo]\n\nONEFOUR – Look At Me Now [ONEFOUR Records / The Orchard]\n\nThe Kid LAROI – Baby I’m Back [Columbia Records / Sony Music]\n\nBest Soul / R&B Release\n\nBOY SODA – Lil Obsession [Warner Music Australasia]\n\nJACOTÉNE - Why’d You Do That? [Epic Records / Sony Music]\n\nJerome Farah – CHLORINE [Sony Music]\n\nLarissa Lambert – Cardio [New Levels / Virgin Music Group]\n\nPANIA – Pity Party [Warner Music Australasia / Say Less]\n\nBest Independent Release\n\nBall Park Music – Like Love [Prawn Records / Inertia Music]\n\nConfidence Man – 3AM (LA LA LA) [I OH YOU / Mushroom Music]\n\nFolk Bitch Trio – Now Would Be A Good Time [Jagjaguwar]\n\nMiss Kaninna – Kaninna EP [Soul Has No Tempo]\n\nNinajirachi – I Love My Computer [NLV Records]\n\nBest Rock Album\n\nAmyl and The Sniffers – Cartoon Darkness [Amyl and The Sniffers / Virgin Music Group]\n\nBall Park Music – Like Love [Prawn Records / Inertia Music]\n\nKing Stingray – For The Dreams [Civilians / The Orchard]\n\nRoyel Otis – hickey [Ourness / Capitol Records]\n\nSpacey Jane – If That Makes Sense [AWAL Recordings]\n\nBest Adult Contemporary Album\n\nFolk Bitch Trio – Now Would Be A Good Time [Jagjaguwar]\n\nGordi – Like Plasticine [Mushroom Music]\n\nMeg Washington – GEM [OriGiN Distribution / ADA]\n\nMissy Higgins – The Second Act [Eleven Music / EMI Music Australia]\n\nPaul Kelly – Fever Longing Still [EMI Music Australia]\n\nBest Country Album\n\nDylan Wright – Half a World Away [Sony Music]\n\nImogen Clark – Choking on Fuel [Potts Entertainment / MGM]\n\nKasey Chambers – Backbone [Essence Music Group / MGM]\n\nKeith Urban – High [CAPITOL – NASHVILLE / EMI Music Australia]\n\nTaylor Moss – Firecracker [Taylor Moss / Ditto Music]\n\nBest Hard Rock / Heavy Metal Album\n\nCivic – Chrome Dipped [ATO Records / Inertia Music]\n\nPress Club – To All The Ones I Love [Inertia Music]\n\nRedHook – Mutation [RedHook Records]\n\nThe Amity Affliction – Let The Ocean Take Me Down (Redux) [GYROstream]\n\nThornhill – Bodies [UNFD / Community Music]\n\nBest Blues & Roots Album\n\nDope Lemon – Golden Wolf [BMG]\n\nMama Kin Spender – Promises [Mama Kin Spender / MGM]\n\nSons Of The East – SONS [Sons Of The East Music / MGM]\n\nTash Sultana – Return to the Roots [Lonely Lands Records via Sony Music]\n\nThe Teskey Brothers – Live At The Hammersmith Apollo [Mushroom Music]\n\nBest Children’s Album\n\nEmma Memma – Dance Island Party [GYROstream]\n\nJustine Clarke – Mimi's Symphony [ABC Music / The Orchard]\n\nTeeny Tiny Stevies – Brain Fart [Love Your Records / Xelon]\n\nThe Vegetable Plot – Season Three [ABC Music / The Orchard]\n\nThe Wiggles – Wiggle Up, Giddy Up! [ABC Music / The Orchard]\n\nBest Music Festival\n\nAbility Fest – Dylan Alcott Foundation + Untitled Group\n\nBeyond The Valley – Untitled Group / Beyond The Valley Music Festival\n\nBluesfest Byron Bay – Bluesfest Byron Bay\n\nLaneway Festival – St Jerome’s Laneway / Laneway Festival\n\nYours and Owls Festival – Yours and Owls\n\nPublic Voted Awards\n\nBest Video\n\nBreak My Love - RÜFÜS DU SOL, Alexander George (Katzki) [Rose Avenue Records / Warner Music Australasia]\n\nCraters – Missy Higgins, Claudia Sangiorgi Dalimore [Eleven Music / EMI Music Australia]\n\nLordy Lordy – Emily Wurramara, Claudia Sangiorgi Dalimore [ABC Music / The Orchard]\n\nAll The Noise – Spacey Jane, Dan Lesser [AWAL Recordings]\n\nCar – Royel Otis, Jamieson Kerr [Ourness / Capitol Records]\n\nBig Dreams – Amyl and The Sniffers, John Stewart [Amyl and The Sniffers / Virgin Music Group]\n\nDreamin - Dom Dolla, Kyle Caulfield & Shevin Dissanayake [Good Fortune Records]\n\nDon’t Happy, Be Worry – Hilltop Hoods, Roman Anastasios and Jordan Ruyi Blanch [Island Records Australia / Universal Music Australia]\n\nDancing2 – Keli Holiday, Ryan Sauer [Keli Holiday / GYROstream]\n\nWASSA – VV Pete, UTILITY, Formation Boyz, UTILITY [Trackwork]\n\nBest Australian Live Act\n\nAmyl and The Sniffers – Cartoon Darkness World Tour\n\nBall Park Music – Like Love Tour\n\nBARKAA – BIG TIDDA TOUR [Jackson Street & Bad Apples Music]\n\nConfidence Man – 3AM (LA LA LA) Tour [I OH YOU]\n\nDom Dolla – Dom Dolla Australia 2024 [Untitled Group]\n\nHilltop Hoods – Hilltop Hoods 2025\n\nKylie Minogue – Tension Tour 2025\n\nMiss Kaninna – Dawg In Me Tour [Astral People]\n\nSPEED – SPEED Australia Tour ‘25\n\nTroye Sivan – Something To Give Each Other Tour [Live Nation]\n\nSong of the Year\n\nCyril, Maryjo – Still Into You [Warner Music Australasia / Spinnin Records]\n\nDean Lewis – With You [Island Records Australia / Universal Music Australia]\n\nDom Dolla Feat. Daya – Dreamin [Good Fortune Records]\n\nFISHER – Stay [etcetc Music Pty Ltd]\n\nGotye, FISHER, Chris Lake Feat. Kimbra, Sante Sansone – Somebody [Eleven: A Music Company / EMI Music Australia]\n\nONEFOUR, Nemzzz – Spinnin [ONEFOUR RECORDS / THE ORCHARD]\n\nRoyel Otis – Linger (SiriusXM Session) [Ourness]\n\nSonny Fodera, D.O.D & Jazzy – Somedays [Solotoko / ADA]\n\nThe Kid LAROI – Girls [Columbia Records / Sony Music]\n\nTobiahs – Angel of Mine [Mushroom Music]\n\nMost Popular International Artist\n\nAlex Warren – You'll Be Alright Kid [Atlantic Records / Warner Music Australasia]\n\nCalvin Harris – 96 Months [Columbia Records / Sony Music]\n\nGracie Abrams – The Secret of Us [Interscope / Universal Music Australia]\n\nKendrick Lamar – GNX [Interscope / Universal Music Australia]\n\nNoah Kahan – Stick Season [Republic Records / Universal Music Australia]\n\nPost Malone – F-1Trillion [Republic Records / Universal Music Australia]\n\nSabrina Carpenter – Short n’ Sweet [Island Records USA / Universal Music Australia]\n\nTate McRae – So Close To What [RCA Records / Universal Music Australia]\n\nTaylor Swift – [Republic Records / Universal Music Australia]\n\nTyler, The Creator – Chromakopia [Columbia Records / Sony Music]\n\nArtisan Awards\n\nBest Cover Art\n\nGiulia McGauran for The Cat Empire – Bird in Paradise [BMG]\n\nJohn Stewart for Amyl and The Sniffers – Cartoon Darkness [Amyl and The Sniffers / Virgin Music\n\nGroup]\n\nKira Puru, Em Jensen for Thelma Plum – I’m Sorry, Now Say It Back [Waner Music Australasia]\n\nNina Wilson, John You, Aria Zarzycki for Ninajirachi – I Love My Computer [NLV Records]\n\nSarah McCloskey for Hilltop Hoods – Fall From The Light [Island Records Australia / Universal Music Australia]\n\nEngineer - Best Engineered Release\n\nAlice Ivy for Alice Ivy – Do What Makes You Happy [Kewpie Mayo Records / Independent]\n\nDom Dolla for Dom Dolla – DREAMIN' [Good Fortune Records]\n\nEric J Dubowsky for Emma Louise & Flume – DUMB [Three Six Zero Recordings / ADA]\n\nKevin Parker for Tame Impala – End of Summer [Columbia Records / Sony Music]\n\nThomas Purcell p/k/a Wave Racer for Ninajirachi – I Love My Computer [NLV Records]\n\nProducer – Best Produced Release\n\nAlex Burnett for Thelma Plum - I’m Sorry, Now Say It Back [Waner Music Australasia]\n\nDom Dolla for Dom Dolla – Dreamin [Good Fortune Records]\n\nKevin Parker for Tame Impala – End of Summer [Columbia Records / Sony Music]\n\nNina Wilson p/k/a Ninajirachi for Ninajirachi – I Love My Computer [NLV Records]\n\nRÜFÜS DU SOL for RÜFÜS DU SOL – Inhale / Exhale [Rose Avenue Records / Warner Music Australasia]\n\nFine Arts Awards\n\nBest Classical Album\n\nAndrea Lam – Piano Diary [ABC Classic / The Orchard]\n\nAustralian Chamber Orchestra / Richard Tognetti – Tchaikovsky: Serenade for Strings and Andante\n\nCantabile / Shostakovich: Chamber Symphony in C minor [ABC Classic / The Orchard]\n\nNat Bartsch – Forever Changed [Amica Records]\n\nSimone Young & Sydney Symphony Orchestra – Mahler: Symphony No.2; Barton: Of The Earth\n\n[Deutsche Grammophon Australia / Universal Music]\n\nSophie Hutchings – Become The Sky [Universal Music Australia / Mercury KX]\n\nBest Jazz Album\n\nEvans Robson Quartet – Zenith [Lamplight Records]\n\nLachlan McKenzie – Departures [ABC Jazz / The Orchard]\n\nLucy Clifford – Between Spaces of Knowing [ABC Jazz / The Orchard]\n\nTL; DR & Peter Knight – Too Long; Didn’t Read [Earshift Music / The Planet Company-MGM]\n\nTouch Sensitive – In Paradise [Future Classic]\n\nBest Original Soundtrack or Musical Theatre Cast Album\n\nAustralian Chamber Orchestra – Memoir of a Snail (Original Motion Picture Soundtrack) [ABC Classic / The Orchard]\n\nFrançois Tétaz - The Surfer [Impressed Recordings / Rubber Music Pty Ltd]\n\nMichael Cassel Group – Michael Cassel Group Presents A (Very) Musical Christmas [The Orchard]\n\nVarious Artists – How To Make Gravy [Origin Recordings]\n\nVidya Makan – The Lucky Country (Original Cast Album) [ORiGiN Distribution / ADA]\n\nBest World Music Album\n\nElectric Fields, Melbourne Symphony Orchestra – Live In Concert [ABC Music / The Orchard]\n\nGurrumul – Banbirrngu – The Orchestral Sessions [Decca Australia & Skinnyfish / UMA]\n\nJoseph Tawadros – The Forgotten Path To Humanity [Independent / The Planet Company]\n\nTenzin Choegyal – Snow Flower [Warner Music Australasia / Rainbow Valley Records]\n\nThe Cat Empire – Bird in Paradise [BMG]\n\nOur Soundtrack Our Ads\n\nBest Use of an Australian Recording in an Advertisement\n\nFox League 2025: Our Greats – Fox Sports Australia, 3%\n\nMenulog: What’s Good in Your Hood – Thinkerbell, Bliss n Eso\n\nParamount+ Australia: Ballad of the GOATS – Paramount+ Australia, Briggs\n\nTooheys: I Feel Like a Tooheys – Thinkerbell, Dune Rats\n\nTourism & Events Queensland: That Holiday Feeling – Publicis Worldwide, Kita Alexander",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/2025-world-bowls-champion-of-champions-barham-murray-river/105805760",
    "title": "World's best bowlers fight for prestigious title in small border town",
    "publish_date": "Wed, 24 Sep 2025 23:03:58 +0000",
    "category": "sports",
    "authors": [],
    "text": "In the small Murray River town of Barham, locals admit their astonishment at hosting a World Bowls title event.\n\nThe New South Wales border town of 1,500 people does not have a traffic light, but it does have world-class greens, attracting state and international events.\n\nUS bowler Charlie Herbert reacts to his opponent's bowl during sectional play. (ABC News: Anna McGuinness)\n\nFifty-seven bowlers from 33 nations travelled three hours north from Melbourne Airport by bus for the 2025 World Bowls Champion of Champions this week.\n\nEach qualified as the best from their country to compete in Barham for a men's or women's singles world title.\n\nSwitzerland player Thomas Wälti joked there was \"nothing there\" when he looked up Barham on the map.\n\nSwitzerland's Thomas Wälti says Barham is beautiful. (ABC News: Anna McGuinness)\n\nBetween play on Monday, he said it was a very small town but beautiful.\n\nFor some players, the biggest shock was the low spring temperature, just 16 degrees Celsius.\n\nTown prepares for influx\n\nIt is the first time Barham has hosted the Champion of Champions after the town's services club, CluBarham, won an expression of interest process against nations including Wales and South Africa.\n\nBarham Bakery manager Melissa Davis was hoping for a 10 to 20 per cent boost in trade from the week and rostered extra staff.\n\nMelissa Davis is hoping for a 10 to 20 per cent boost from the event. (ABC News: Anna McGuinness)\n\nMs Davis said she was surprised the town had secured the prestigious event.\n\n\"It's been fantastic to see so many strangers and tourists around and the excitement's been amazing,\" Ms Davis said.\n\nMurray River Council Mayor John Harvie said the exposure for the town would be extraordinary.\n\n\"Smaller communities such as Barham rarely get events of this size,\" he said.\n\n\"It's great for people from overseas to experience rural Australian culture and hospitality.\"\n\nSpectators watch as the USA's Giulia Gallo contemplates her next turn. (ABC News: Anna McGuinness)\n\nCluBarham has invested more than $4 million in its bowls facilities, including synthetic greens and canopies to allow year-round play.\n\n\"The investment has been quite massive,\" CluBarham CEO Jason Wallace said.\n\n\"But what it does for our region and particularly for Koondrook and Barham, it means a lot for our business community.\"\n\nJason Wallace says the event is good for local businesses. (ABC News: Anna McGuinness)\n\nBarham is hosting the annual Victorian Over 60s State Carnival for five years, bringing 1,300 bowlers to the town and boosting the local economy by $1.3 million.\n\nLocal bowlers up close with world's best\n\nAvid bowler Helen Jenkin and her husband were among those enjoying the action on Monday, having made the trip up with their caravan from Daylesford in central Victoria.\n\nHelen Mizzeni and Helen Jenkin travelled to Barham for the tournament. (ABC News: Anna McGuinness)\n\nMs Jenkin will return to Barham next week to play the same greens among 550 competitors in the Victorian Women's Country Carnival, and jumped at the chance to see world-class bowlers.\n\n\"It's wonderful for Victoria,\" Ms Jenkin said.\n\nWhile spectator numbers for the world title fell short of expectations early in the week, Mr Wallace expected a $500,000 flow-on benefit for the town.\n\nIt is hoped the finals on Thursday will draw a 500-strong crowd.\n\n\"It takes a little while to get here if you're travelling from Melbourne or other parts of the country, but I think once everyone gets here they're just really impressed,\" World Bowls CEO Neil Dalrymple said.\n\nAustralian representative Chloe Stewart grew up a few hours down the highway at Kyneton, where she played bowls with her grandmother.\n\nChloe Stewart in action at the Champion of Champions event. (ABC News: Anna McGuinness)\n\n\"It's a really cool place to come out and be in the country again, it's a beautiful part of the world,\" she said.\n\nThe town has secured a World Bowls Series this December and will host the World Bowls Champion of Champions again in 2026.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/nottingham-forest-draws-with-real-betis-europa-league/105814730",
    "title": "Postecoglou's opening Europa League match with Forest ends with draw in Spain",
    "publish_date": "Wed, 24 Sep 2025 22:46:19 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nottingham Forest's long-awaited return to European competition ended in a 2-2 Europa League draw at Real Betis, with Igor Jesus's first-half double cancelled out by a late Antony strike.\n\nForest's return to a major European competition for the first time since March 1996 began on the wrong foot, with Betis taking the lead inside 15 minutes when Cedric Bakambu fired an effort high into the net.\n\nThe two-time European Cup winners responded swiftly as Jesus levelled from close range within two minutes and then headed in again in the 23rd minute.\n\nBoth sides pushed for a breakthrough following the interval. Betis gradually seized more control as the match wore on and were finally rewarded five minutes from time, when Antony tucked away Marc Roca's cross to ensure the spoils were shared.\n\nWith the result, Forest boss Ange Postecoglou became the club's first permanent manager since Billy Walker in 1946 to go without a win in his opening four matches.\n\n\"I think first I should be proud of the players' efforts. It's a difficult place to come, difficult conditions, people don't realise the humidity out there,\" Ange Postecoglou said to TNT Sports.\n\n\"I'm just disappointed that the players and supporters don't get the rewards for our efforts. I've just got to make sure they keep their heads up because there's plenty to be positive about and the wins will come.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPostecoglou guided Tottenham Hotspur to claim the Europa League title last season, the London-based club's first trophy in 17 years, and first continental trophy in over four decades.\n\nBut a poor English Premier League campaign, where Spurs finished a lowly 17th, led to the Australian being sacked at the end of the season.\n\nPostecoglou was named Forest's manager earlier this month.\n\nPrevious manager Nuno Espírito Santo, who had led the club back to qualifying for European football, had started the season with a win, loss and draw.\n\nSince Postecoglou took over, Forest was beaten by Arsenal 3-0 and drew 1-1 with Burnley in the EPL.\n\nForest also blew a two-goal lead in the second half to be knocked out of the League Cup by Championship side Swansea.\n\nForest's next match will be at its home ground on Sunday, AEST, against Sunderland in the EPL.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/katanning-farmers-fed-up-with-livestock-wandering-rural-roads/105753144",
    "title": "Penalties labelled 'woefully inadequate' as cattle roam roads for decades",
    "publish_date": "Wed, 24 Sep 2025 22:32:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Every weekday, Katanning school bus driver and former shire councillor, Danny McGrath, fears for his passengers' safety.\n\nHe has only been driving the 82-kilometre route, 280km south-east of Perth, for a year, but already has serious concerns about untagged livestock roaming the roads.\n\nDanny McGrath says he feels unsafe driving in Katanning. (ABC Great Southern: Kate Forrester)\n\n\"I've got the most precious cargo on board and my job is to get them safely from A to B, but I have this ongoing saga of livestock continuously on the road, creating a real, present danger,\" Mr McGrath said.\n\nAbout half of the bus run is on gravel back roads, where Mr McGrath said he saw sheep and cows on an \"almost daily basis\".\n\nDanny McGrath says the livestock are big enough to cause a lot of damage if hit. (Supplied: Danny McGrath)\n\nHe said it had been a problem for decades.\n\n\"The council just doesn't seem to have the power or resources to do something about it,\" he said.\n\nThe Local Government Act prohibits livestock from wandering or straying into public spaces, which can result in a $200 fine.\n\nUnder the state government's biosecurity and agriculture management laws, it is an offence to possess unidentified stock, which carries a maximum fine of $5,000.\n\nDanny McGrath says he drives \"the most precious cargo there is\". (ABC Great Southern: Kate Forrester)\n\nLocals at breaking point\n\nKatrina Kowald, whose farm borders much of the road where cattle and sheep frequently escape and whose children ride the bus, said it was only a matter of time before a serious accident happened.\n\n\"At the end of the day, we feel like we are at a point where something serious is going to have to happen for something to change,\" she said.\n\nFor fellow farmer Andrew Bushell, that feeling is all too real and has persisted for more than 40 years.\n\nAndrew Bushell and Katrina Kowald say they fear a serious accident. (ABC Great Southern: Kate Forrester)\n\n\"Personally, I've been trying to sell [my farm] and get out of this area. They've absolutely broken me,\" he said.\n\nMr Bushell described the latest incident involving wandering cattle as \"probably the worst\" he had encountered.\n\nMr Bushell's wife was driving along one of the gravel roads near their farm with their children when a cow jumped in front of the car and \"smashed the front of it\".\n\n\"I met my wife and kids after and they were all crying, in shock,\" he said, noting that because the cow was untagged, insurance was not an option.\n\n\"This is not the first time it's happened, but it is probably the worst — we've paid plenty of excess over the years fixing vehicles.\"\n\nAndrew Bushell's wife and children hit a cow while on their way to a netball match. (Supplied: Andrew Bushell)\n\nAnd that is not the only cost.\n\nFor years, Mr Bushell said he had been dealing with lice-riddled livestock wandering onto his property and mixing with his stock.\n\n\"I couldn't add up how much we've spent on lice control over the years — it's been forever, as long as I can remember,\" Mr Bushell said.\n\nPenalties 'woefully inadequate'\n\nKatanning Shire President Kristy D'Aprile said the shire had issued multiple infringements over the years, with the ranger actively monitoring the situation, but their options were limited when the stock were untagged and penalties were \"woefully inadequate\".\n\nKristy D'Aprile says she receives \"daily\" reports about wandering livestock. (ABC Great Southern: Sophie Johnson)\n\nMs D'Aprile said she would like to see the local government penalties increased in line with the state government for unidentified stock.\n\nA state government spokesperson said Police Minister Reece Whitby met Ms D'Aprile, Shire of Katanning CEO Peter Klein and Katanning police this month to discuss the issue.\n\nThey said the Department of Primary Industries and Regional Development (DPIRD) and WA Police were working with the shire to investigate whether breaches of livestock identification and movement regulations had occurred.\n\nKristy D'Aprile says there should be a higher penalties for wandering livestock on roads. (Supplied: Danny McGrath)\n\nThe shire will also meet Agriculture Minister Jackie Jarvis to discuss strategies for managing untagged and wandering livestock.\n\nRoe MP and Katanning farmer Peter Rundle wrote to the agricultural minister on the issue, and shared the same concerns as the shire.\n\n\"This is an opportunity for leadership from the minister and the department,\" he said.\n\n\"We don't want this to become a bureaucratic paper-shuffling exercise, and people hope the issue just goes away.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/macquarie-admits-to-shield-contraventions/105814728",
    "title": "Macquarie to repay Shield investors after super platform failures",
    "publish_date": "Wed, 24 Sep 2025 22:24:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Macquarie Investment Management has committed to repaying thousands of Australians who invested hundreds of millions of their retirement savings in the collapsed Shield Master Fund (Shield) amid admissions it contravened the Corporations Act.\n\nThe Australian Securities and Investments Commission (ASIC) commenced proceedings in the Federal Court against Macquarie Investment Management after the subsidiary of Macquarie Group admitted that it did not act efficiently, honestly and fairly by failing to place Shield on a watch list for heightened monitoring.\n\nThe corporate regulator also accepted a court-enforceable undertaking from Macquarie Investment Management to ensure it pays members 100 per cent of the amounts they invested in Shield, less any amounts withdrawn.\n\nDeep flaws in Australia's $4.3 trillion system exposed Photo shows A woman wipes away tears as she tells her story. The collapses of the First Guardian and Shield schemes have exposed deep flaws in the regulation of Australia's $4.3 trillion superannuation sector.\n\nASIC said, as superannuation trustee, Macquarie Investment Management Ltd oversaw approximately $321 million in super investments into Shield by about 3,000 of its members between 2022 and 2023.\n\nThose customers will now be fully compensated for any losses by Macquarie, while the investment bank will be forced to wait until the liquidation of the Shield fund to recover some of those funds.\n\n\"This is an important outcome that stems the significant losses that threatened thousands of members' retirement savings after they used Macquarie's platform to invest their super in Shield,\" said ASIC deputy chair Sarah Court.\n\n\"Many members thought their funds were safe when they used Macquarie's super platform to invest in Shield, which had no track record.\n\n\" ASIC's investigation will see Macquarie return these members to the position they were in before their retirement savings were eroded. \"\n\nThe investment banking giant said in a statement that affected investors will receive the funds before the end of this month.\n\n\"Macquarie's decision to devote resources to achieve this outcome recognises Shield's unique circumstances, notably the scale of the issue, its material impact on many investors and their limited access to recourse from the many different entities which played a role,\" the company noted.\n\n\"The approach of providing immediate certainty and an improved outcome for investors benefits all parties.\n\n\"To enact the payments, Macquarie will purchase the investors' holdings in Shield at the current fair value, which is based on the estimated ultimate recovery from the liquidation process. In addition, Macquarie will make a goodwill payment to investors, with the two payments equating to 100 per cent of the net capital each client originally invested in Shield.\"\n\nAs part of the deal, ASIC is not seeking penalties against Macquarie Investment Management, despite admissions it breached the Corporations Act.\n\nThe regulator said this is in recognition of Macquarie's cooperation, its willingness to fully compensate its affected members and to speed up the compensation of those whose retirement savings have been frozen as a result of the Shield collapse.\n\nWhile the 3,000 investors in Shield who accessed the fund through Macquarie's superannuation platform are now poised to get their money back, there's roughly 1,800 other investors who aren't covered by this deal.\n\nMost of them invested in Shield through Equity Trustees, which is also being sued in the Federal Court by ASIC for its role as a super platform host for the collapsed fund.\n\nIt is estimated that about $160 million was invested in Shield through the Equity Trustees super platform.\n\nThen there are roughly 6,000 people who invested funds in First Guardian, a separate fund that collapsed around the same time as Shield. They are believed to be around half a billion dollars out of pocket.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/afl-grand-final-sprint-gout-gout-and-harry-garside/105814536",
    "title": "AFL confirms major change to grand final sprint, as Olympian set to run",
    "publish_date": "Wed, 24 Sep 2025 22:08:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "Just seven AFL players will feature in Saturday's grand final sprint, breaking the tradition of having runners from all 18 clubs.\n\nBeau McCreery (Magpies), Nick Blakey (Swans), Toby Greene (Giants), Jed Walter (Suns), Maurice Rioli (Tigers), Jack Higgins (Saints) and Murphy Reid (Dockers) will run against Olympic boxer Harry Garside at half-time of the AFL grand final, while rising athletics star Gout Gout will fire the starter gun.\n\nTraditionally, players from each of the 18 AFL teams — including the two teams playing — would compete in heats prior to the game before the final is run at half-time.\n\nMcCreery won last year's final from St Kilda's Darcy Wilson.\n\nOlympic boxer Harry Garside will also be running. (Getty Images: PA Images/Adam Davy)\n\nThe sprint has been run consistently since 2002, and was first held in 1979.\n\nHawthorn's Geoff Ablett, the uncle of Suns and Cats champ Gary Ablett Jr, holds the record for most victories with four, while Geelong skipper Patrick Dangerfield won the sprint three times while playing for Adelaide.\n\n\"It would've been great to be playing on Saturday but I'm excited to be part of the biggest day on the AFL calendar racing,\" Greene said in a statement released by the AFL.\n\n\"Can't wait to go up against Harry, and hopefully the boys can impress Gout.\"\n\nThe junior club of the winning runner will be awarded $5,000.\n\nABC Sport will be live blogging and calling all the action from the 2025 AFL grand final between Geelong and Brisbane.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/asx-markets-business-news-live-updates/105814572",
    "title": "Live: Macquarie to compensate Shield investors, share markets fall as rate cut bets dialled back",
    "publish_date": "Wed, 24 Sep 2025 21:47:22 +0000",
    "category": "finance",
    "authors": [
      "Yiying Li",
      "David Taylor",
      "Emilia Terzon",
      "Michael Janda",
      "Clint Jasper"
    ],
    "text": "It might surprise you that a lot of how the telecommunications industry operates in Australia is self-regulated, in the sense that the industry (and therefore companies) help write their own codes of conduct and then these are enforced by their regulator, ACMA.\n\nIt's something the ACCC wants changed.\n\n\"It is time for direct regulation,\" the consumer watchdog's deputy chair Catriona Lowe told me yesterday.\n\nMs Lowe made these comments, as the watchdog's latest action against Optus was finalised by the Federal Court, where Justice O'Sullivan upheld a $100m fine agreed on by the company and the ACCC, noting Optus' conduct scrutinised by that case had been \"appalling\".\n\nIn a nutshell: the case showed Optus had signed up hundreds of vulnerable customers to phone contracts they didn't need and sometimes couldn't use. It even set debt collectors onto some of its own customers.\n\n\"This is not what we expect from any Australian company, let alone a provider of essential services,\" Ms Lowe told me.\n\n\"Some of the cases and what happened to people in this matter makes for truly sobering and truly awful reading.\"\n\nThe fine against Optus was finalised, as it received widespread condemnation this week over its fatal triple -0 outage. Ms Lowe wouldn't comment on this case, beyond noting the \"tragedy\" it is causing for many people.\n\nShe did, however, note that the ACCC had been involved in a review of the Telecommunications Consumer Protections Code since late 2023. Her comments:\n\n\"Part of the telecommunications regulatory system has an industry self-regulatory element to it. \"So there are codes that are developed by members of the industry, that can then, if they meet appropriate standards, be registered by the ACMA and meet the regulatory framework. \"Self-regulation effectively means that the industry, with inputs from others, writes the code and then submits that to the regulator for consideration. That is not the same as legislation or rules written by parliament. \"We would like to see a move from a self-regulatory treatment of some of these consumer protections to a direct regulatory treatment of some of those consumer protections. They are additional to some of the protections provided by Australian consumer law.\"\n\nYou can read more about the ACCC case against Optus here.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/tasmania-rattled-with-magnitude-4-1-earthquake/105814558",
    "title": "Magnitude-4.1 earthquake rattles Tasmania like a 'thunderclap'",
    "publish_date": "Wed, 24 Sep 2025 21:45:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tasmania has recorded a magnitude-4.1 earthquake in the state's south-west that was felt from Maydena to Hobart.\n\nA resident from Strathgordon, near the epicentre, said she initially thought the earthquake was thunder.\n\n\"It felt like a really loud thunderclap that shakes the house and shakes your internals almost, but it carried on for a lot longer than a normal thunderclap,\" Sarah told ABC Radio Hobart's Breakfast program.\n\nShe said the area experienced an earthquake several years ago that was \"lighter\" than this morning's tremor.\n\n\"It just continued on for about 30 seconds or so, this one was a little bit more brief but much stronger,\" Sarah said.\n\nQuake triggered dam's seismic monitors\n\nThe earthquake struck on a known fault line at Lake Pedder, near two of the state's dams — Edgar Dam and Scotts Peak dam.\n\nHydro Tasmania is currently in the process of strengthening Edgar Dam, which modelling showed would pose a risk to towns, including Huonville, if it failed.\n\nNew flood maps show what would happen if Edgar Dam fails Photo shows Flooding covers most of the town of Huonville Tasmania's hydroelectric operator says it did not want to \"create unnecessary concern\" for residents of a small town by releasing flood mapping done in 2016.\n\nHydro Tasmania's executive general manager of assets and infrastructure Jesse Clark said the earthquake triggered its seismic monitoring system but there was \"no need for concern\".\n\n\"We have not been able to see any damage whatsoever at this stage, so we've got no concerns,\" Mr Clark said.\n\n\"The information we have at this stage is the probability of damage is extremely low at this level, we'll continue to inspect across the day but nothing to report at this stage.\"\n\nMr Clark said the dam would need to see an earthquake in the high 6s of magnitude before it expected \"significant\" damage.\n\nModelling has shown the risk of a magnitude-6 or higher quake is estimated as a one-in-10,000 event each year.\n\nLoading...\n\nGeoscience Australia said the earthquake struck at 6:38am this morning at a depth of 14.41 kilometres.\n\nMore than 100 \"felt reports\" were submitted to the organisation.\n\nNo damage has been reported.\n\nA magnitude-2.5 quake struck east of Campbell Town on January 11 this year.\n\nDam upgrade still underway\n\nConstruction underway in August to strengthen Edgar Dam. (Supplied: Hydro Tasmania)\n\nEdgar Dam was finished in 1973, but new modelling on the fault line and risks exposed concerns over what would happen if the dam failed due to an earthquake.\n\nThe dam holds water that would spill downstream all the way to Huonville if it suffered catastrophic damage.\n\nAn update from last month said the upgrade project had hit an important milestone with work starting on the first 50 metres of Edgar Dam's downstream-facing concrete.\n\nEdgar Dam was built in the 1970s and holds in water from Lake Pedder. (ABC News)\n\nPart of the concrete face has been removed.\n\nThe upgrades began in January this year and are expected to finish by mid-2026.\n\n'Significant' quake for Tasmania\n\nSeismologist Tobias Staal told ABC Breakfast the earthquake was a \"fairly significant\" event for the state.\n\nLoading...\n\n\"[The impact of the earthquake] very much depends on the local geology; what kind of rocks you have beneath your feet when it happens,\" he said.\n\n\"At [magnitude 4] there can be damages to buildings and so on, you certainly feel it over big regions, as people are reporting this morning.\"\n\nMr Staal said the state had experienced bigger earthquakes before.\n\n\"In the past there's been stronger earthquakes near Launceston and Flinders, which were more significant.\"",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/alexa-leary-callum-simpson-gold-world-para-swimming/105814486",
    "title": "Leary, Simpson storm to World Para Swimming Championships golds",
    "publish_date": "Wed, 24 Sep 2025 21:42:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alexa Leary was peerless in Singapore to claim gold in the women's 100m freestyle S9 at the World Para Swimming Championships, beating her nearest competitor by almost three seconds.\n\nLeary's win in the final individual event of Wednesday night's action in Singapore bookended a golden night for Australia after Callum Simpson won gold in the first event of the evening.\n\nAfter putting in a strong performance during the heats, Leary was a red-hot favourite to take gold and threaten to better her own world record of 58.89 seconds.\n\nLeary went hard in the opening 50 metres of Wednesday's final in pursuit of another world record but fell narrowly short of that milestone, claiming the gold medal with a time of 59.19 seconds.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nDespite wanting to better her own mark, the Australian said she had achieved her most important goal.\n\n\"Of course I am a bit disappointed, I was so close to the record in the morning but I'm really proud that I got it (the gold). That is the biggest that I wanted,\" Leary said.\n\n\"I've still got more left in the tank and now I'm even more determined to beat my 50m world record later this week, just you wait.\"\n\nLeary holds the world's best mark in the women's 50m freestyle S9, setting the mark at 27.23 seconds in Sydney back in May.\n\nLeary shaved just 0.02 seconds off the previous best mark held by American Raleigh Crossley.\n\nLeary and Crossley will get their chance to battle in the 50m freestyle on Saturday.\n\nMeanwhile, Simpson set an Oceania record time of 57.15 seconds to win the men's 100m freestyle S8 to open proceedings on Wednesday.\n\nGold medallist Callum Simpson of Team Australia poses for photos during the medal ceremony for the men’s 100m freestyle S8. (Getty Images: Yong Teck Lim)\n\nSimpson was made to work hard for his world championship gold, narrowly beating Italy's Alberto Amodeo (57.88) and Ukraine's Eduard Horodianyn (58.14) to the wall.\n\n\"I was definitely not expecting to go that fast and break the Oceania record, or for the race to be that quick,\" Simpson said.\n\n\"To put in a race like that against such good competitors and see my hard work pay off, it means the world.\"\n\nAction continues in Singapore on Thursday with several Aussies in the pool competing for medals.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-25/huntingtons-disease-gene-therapy-slows-progression/105814436",
    "title": "Groundbreaking gene therapy for Huntington's slows progression of disease",
    "publish_date": "Wed, 24 Sep 2025 21:37:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "UK researchers say they have slowed the progression of the fatal neural condition Huntington's disease for the first time with a groundbreaking new gene therapy.\n\nSome patients who took part in early-stage clinical trials at University College London (UCL) saw the speed at which their condition developed reduced by 75 per cent after three years, according to uniQure, a gene therapy company based in the Netherlands and the United States.\n\nThe results are yet to be peer-reviewed.\n\nThe study tested a new gene therapy, AMT-130, which is delivered through an injection directly into the brain.\n\nResearchers said that AMT-130 works by permanently introducing new functional DNA into a patient's cells.\n\nWorld-first CRISPR gene therapy could 'transform' treatment for rare genetic diseases Photo shows Conceptual paper illustration of human hands handling DNA in a lab dish. Could a gene-editing therapy used to treat a young boy with a rare genetic condition help unlock treatments for others?\n\nLead researcher, Ed Wild of UCL's Huntington's Disease Centre, said that on the basis of the results, it seems likely AMT-130 will be the first licensed treatment to slow Huntington's disease.\n\n\"This result changes everything … truly world-changing stuff,\" he said.\n\nSome 29 patients took part in the trial with the 12 who were given the highest dose experiencing the greatest slowing of the disease.\n\nLeading international expert in Huntington's disease Julie Stout, from the school of psychological sciences at Monash University, told ABC News that, while the results of the trial are exciting, it may not be able to help people showing symptoms now.\n\n\"Maybe for their children we can hope for that, but we don't know how it will be delivered and how people will be able to afford it, how much government support there will be for it,\" she said.\n\n\"We can do this treatment in Australia, we have the neurosurgery expertise … that's not so much the issue but the regulatory process and the cost are going to be very significant.\"\n\nWhat is Huntington's disease?\n\nThere is currently no cure for Huntington's, a fatal inherited neurodegenerative disease caused by a single genetic mutation.\n\nThe condition affects the brain and central nervous system, which progressively impairs mental and physical abilities, eventually leading to the loss of critical functions such as walking, talking, eating and reasoning.\n\nHuntington's disease breakthrough Photo shows A model of a brain About 2,000 people in Australia are affected by Huntington's disease, a fatal and incurable condition that affects the nervous system that results in the death of brain cells.\n\nAs it is an inherited condition, there are often several people in a family with Huntington's.\n\nHuntington's Australia said symptoms commonly begin between 30 and 50 years but can be earlier or later and, while the disease can begin in childhood, that is rarely seen in Australia.\n\nAround 2,500 people have been diagnosed with the condition in Australia, which affects movement, thinking and mood, but Professor Stout said there are probably between 7,000 and 10,000 at risk of developing the disease.\n\nDr Wild said the patients who took part in the trial were now stable \"in a way I'm not used to seeing in Huntington's disease\".\n\nUniqure said the positive top-line data from the pivotal phase I/II study of AMT-130 for the treatment of Huntington's disease demonstrated a statistically significant slowing of disease progression after three years.\n\nHuntington's disease carer anguish Photo shows A close up photo of a woman wearing glasses in front of a red tree Natalia Rossiter provides 24-hour care for her husband who has Huntington's disease, but she wonders how she can continue without psychological support.\n\nProfessor Stout said, that if the treatment is approved by regulators in Australia it could eventually help people with Huntington's have less severe symptoms.\n\n\"The kind of approach that we take in different forms of dementia is not so much looking for a cure, but if we could slow the disease down enough, people can live out their natural life span with a high quality of life,\" she said.\n\n\"That's like a cure from the point of view from dementia.\n\n\"The trick with Huntington's disease, because it has an early onset, we're doing a lot of slowing to get them to the point of the natural life span … it's likely they'll live with a more slowly progressing disease that has less severe symptoms.\n\n\"I think that's a huge win.\"\n\nAFP",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/grand-slam-prizemoney-could-hit-500-million-in-new-push-by-players-20250925-p5mxr7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Grand slam prizemoney could hit $500 million in new push by players",
    "publish_date": "Thu, 25 Sep 2025 11:44:14 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder"
    ],
    "text": "Jannik Sinner, Aryna Sabalenka, Coco Gauff and Carlos Alcaraz are among a group of top-10 tennis players who have sent a second letter to the four grand slam tournaments asking for more money, more control and greater contributions to pension, health and maternity benefits.\n\nThe players are asking for their share of prizemoney at grand slams to increase from 16 to 22 per cent of tournament revenue by 2030, which would see the Australian Open prize pool exceed $100 million and the US Open surpass $150 million.\n\nAryna Sabalenka and Jannik Sinner are among the top players who have written to grand slam organisers. Credit: Getty Images\n\nThe combined prize pool across the four slams in 2025 was $440 million. That number could exceed $500 million by 2030 if tournament organisers continue incremental rises each year and agree to what players are asking for.\n\nThe letter, which was signed by other top players such as Iga Swiatek, Jack Draper, Amanda Anisimova, Frances Tiafoe and Ben Shelton, is the second of its kind, with Novak Djokovic the sole signatory on an original letter sent to the grand slam tournaments in March.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bellamy says Jahrome Hughes will play in preliminary final",
    "publish_date": "Thu, 25 Sep 2025 11:42:38 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Michael Chammas",
      "Billie Eder",
      "Dan Walsh"
    ],
    "text": "Meninga’s oversized guard became the stuff of legend but wouldn’t be allowed anywhere near a footy field today. “I was at Canberra when Mal used to wear that guard and no one was game to near him at training in case you copped it,” Bellamy said with a laugh. “But Hughesy’s [guard] is a fair bit thinner than Mal’s was.” Bellamy also praised the toughness of second-rower Shawn Blore who will also return from a fractured larynx to play on Friday night. “That’s a pretty bad injury he got and he kept going in the game - he’s a pretty tough unit,” Bellamy said.\n\n“He was busting to get back. He kept ringing me and telling me that “I’m right, I’m right” but, obviously, I’m taking more advice from the medical people than him. We are confident he has recovered.” The Storm thumped the Sharks 30-6 when they last met at AAMI Park in June but the Sharks have won nine games out of 10 since including knockout final wins over Sydney Roosters and minor premiers Canberra Raiders. So the Sharks will come in fired up as will a sellout crowd hoping to see the Storm progress to another grand final. “I don’t know who wrote them off. They finished fifth,” Bellamy said. “To beat the Roosters and then beat Canberra in Canberra - we know they are in good form, but we are just concerned with what we need to do and how we need to do it.”\n\nBellamy felt for Pezet and several other Storm players who stepped up when key players were injured or suspended late this season. “It’s just the way the game is, it isn’t fair sometimes,” Bellamy said. The Storm hammered the Sharks but it kick-started Cronulla’s season Roy Ward The last time Cronulla trudged off AAMI Park they were at their lowest point of the season.\n\nSince that 30-6 round 17 loss to the Storm, the Sharks have won nine of 10 games, including two knockout finals, and are now just one win away from the NRL grand final. The only problem is that the team standing between them and the NRL decider is the Storm, who they take on at AAMI Park in a preliminary final on Friday night. Sharks playmaker Braydon Trindall remembers that night in June well, and how it galvanised his team to turn their season around. “I think we were all just sick of letting the year slip away from us,” Trindall recalled on Wednesday. “So we sat down and had a good talk about it and went out on the field and changed some of the actions that were hurting us.\n\n“I think it was more of a club thing and everyone wanted to put in a bit more, and now look where we are.” The Storm hammered the Sharks last time they met in Melbourne. Credit: Getty Images Trindall has carried an eye issue through recent games after taking a knock against the Sydney Roosters earlier in the finals, but while there is some visible blood, he said it had no impact on his vision. “I copped a boot against the Roosters, but it’s starting to heal now,” he said. The Storm have plenty of respect for Trindall’s kicking game and the threat it poses, but he knows accuracy is the key given the height and catching ability of Storm wingers Xavier Coates and Will Warbrick.\n\n“It’s good when you have some good chases on the end of the kick,” he said. “Will is a good leaper, so there will be a bit of a challenge there. It doesn’t really change things. I might shorten the kicks up a bit so they have to run a bit more, but we’ve got some good catches as well so I won’t change much.” Knights approach premiership-winning half to work as attack consultant Michael Chammas The Newcastle Knights have reached out to three-time premiership-winning playmaker Luke Keary about a role with the club as an attack and halves consultant from next season. Former Roosters playmaker Luke Keary could be heading to Newcastle. Credit: NRL Photos\n\nThe Knights are in the process of restructuring their coaching staff and have made the bold move to approach the recently retired Catalans pivot to gauge his interest in joining the club. Keary worked with both new coach Justin Holbrook and director of football Chris James at the Sydney Roosters and is highly regarded as one of the smartest players in rugby league. Keary, who spent this season with Catalans in the Super League after finishing his NRL career at the Sydney Roosters in 2024, is weighing up the opportunity. The 33-year-old wants to spend the summer travelling with his young family but is said to be keen to discuss the opportunity to link with the Knights. Newcastle are keen to add some specialised coaches to their ranks and believe Keary would be a huge asset to help work with recruits Dylan Brown and Sandon Smith, as well as incumbents Fletcher Sharpe and Kalyn Ponga.\n\nNewcastle’s attack struggled to fire in 2025 under the guidance of attack coach Blake Green, who missed out on the job as Adam O’Brien’s successor to Holbrook. Keary doesn’t have a job lined up at the Sydney Roosters, who themselves will welcome back Jared Waerea-Hargreaves in an official capacity to work with the club’s younger players in 2026. ‘Still a bit to get through’: Storm star no certainty to face Sharks Roy Ward Melbourne Storm playmaker Jahrome Hughes still has some training sessions to get through before he can be cleared to play in the preliminary final on Friday night.\n\nThe reigning Dally M Medallist is recovering from a fractured forearm and racing against time to prove his arm has healed enough to take on Cronulla AAMI Park for a spot in the grand final next week. Hughes was named in Melbourne’s extended squad on Tuesday in the hope he is fit to play by game day. Back-rower Shawn Blore (fractured larynx) and fullback Ryan Papenhuyzen (concussion) were also named but could still be left out if they aren’t ruled fit to play. Storm captain Harry Grant said Hughes was looking good at training, but the club’s tougher sessions were still to come before Craig Bellamy and his staff make a final call on selection. “He’s been training pretty well and getting through what he has to do, but he still has a fair few things to get through with the week and how it builds up,” Grant said on Tuesday. “It’s good for Hughesy, it’s good for the team, but there is still a bit to get through.”\n\nHughes has remained optimistic about a return on Friday night but the Storm’s medical team have been more measured as the team does not want Hughes to re-injure himself. Jahrome Hughes after his wrist injury. Credit: Getty Images Young playmaker Jonah Pezet, who was also named in the squad, starred in the Storm’s qualifying final win against the Bulldogs, and will be ready to start at halfback should the Storm decide Hughes is not ready. Grant said Hughes’ passing game was looking good meaning the questions would be around his fitness and strength. “When I throw him some shockers [bad passes], that makes it harder for his forearm,” Grant joked. “But I don’t think it [the injury] has changed any of that.”\n\nPapenhuyzen missed the qualifying final win over Canterbury with concussion, but his return to the No.1 jersey would see Nick Meaney shift back to the centres after filling in at fullback. Adam Reynolds and Ezra Mam at Broncos training on Tuesday. Credit: Getty Images Meanwhile, captain Adam Reynolds will return at halfback for the Broncos alongside new super-sub Ezra Mam against Penrith in Sunday’s grand final qualifier. Both return from five-week lay-offs to a side unbeaten since the pair suffered hamstring injuries in round 23 against Melbourne. Reynolds said he was now “100 per cent” fit and ready to perform at No.7 after a minor training setback three weeks ago.\n\nMam has moved well at training the past week and done enough to convince coach Michael Maguire he is ready to shine. Instead of starting, the plan is for Mam to be injected into the match when fatigue sets in among his teammates, and utilise his renowned footwork to trouble the middle forwards and Penrith’s edge defence. The Panthers will remember how dynamic Mam can be after his hat-trick of tries in the 2023 grand final, won 26-24 by Penrith. Mam and Reece Walsh combined for one of those tries in a lethal one-two punch. “I am just really excited for him and to rub shoulders with him again on the field,” Walsh said. “I feel like we have a really good connection and a really good instinct about each other. I’m just ready to go after it with him.” with AAP\n\nPanthers duo shrug off injury worries ahead of Broncos showdown Dan Walsh and Billie Eder Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury. Martin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest. The 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals.\n\n“They’re all right now,” Martin said of his ribs after full-time. “There was a bit of carry-on there. It’s a bit sore at the moment, but they’re all right. I landed on the ball, and ‘Kiks’ is a pretty big man, and he landed on me. I was a bit winded, but I’m all right now. “It crossed my mind at first [that a serious injury may have occurred], but after a while I was like ‘it’s all right, I’m being a sook again’.” Liam Martin is helped from the field at Accor Stadium. Credit: Getty Images Martin won last year’s Clive Churchill medal against Melbourne despite playing through the pain of a popped rib cartilage in the 2024 grand final. He also required painkilling injections for almost the entire season to manage an ongoing AC joint injury in his shoulder, which he has battled again in recent weeks.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/the-dumplings-from-this-south-coast-food-truck-are-a-must-try-on-your-next-road-trip-20250924-p5mxkx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The dumplings from this South Coast food truck are a must-try on your next road trip",
    "publish_date": "Thu, 25 Sep 2025 11:41:23 +1000",
    "category": "finance",
    "authors": [
      "Bianca Hrovat"
    ],
    "text": "Advertisement\n\nReview Eating outNowra The dumplings from this South Coast food truck are a must-try on your next road trip Hidden behind a Nowra pawn shop, Fatty Dumpling serves the kind of Chinese street food you’d expect to find in cyberpunk Chongqing, rather than in regional NSW. Bianca Hrovat September 25, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 9 Weiqing “Elvina” Yang serves some of the best dumplings you’ve ever tasted. Janie Barrett 2 / 9 Barbara noodles (wan za mian). Janie Barrett 3 / 9 Seating at the Fatty Dumpling, Nowra. Supplied 4 / 9 Fatty Dumpling, Nowra. Supplied 5 / 9 Zhong dumplings. Janie Barrett 6 / 9 The sitting area at Fatty Dumpling, Nowra. Supplied 7 / 9 Weiqing “Elvina” Yang in her food truck Fatty Dumpling Janie Barrett 8 / 9 Mum’s beef soup noodles. Janie Barrett 9 / 9 Fatty Dumpling, Nowra. Supplied Previous Slide Next Slide Chinese$$$$ Do you remember the last time you were on a road trip, your stomach clawing with hunger, and you succumbed to a lukewarm pie at the nearest servo? It felt a bit bleak, didn’t it, parking beneath the fluorescent lights to rip open the plastic wrapping? Fighting to keep the gelatinous meat from oozing onto your lap. As you drive south through the Shoalhaven region and enter Nowra, the Princes Highway becomes a smorgasbord of sad pies and fast food outlets. It’s one chain after another, and nothing to indicate that, at a fairy-lit concrete lot behind a pawn shop, there’s a food truck serving some of the best dumplings you’ve ever had the pleasure of eating. Weiqing “Elvina” Yang in her food truck Fatty Dumpling Janie Barrett\n\nAdvertisement\n\nThis is Fatty Dumpling, where owner-cook Weiqing “Elvina” Yang serves the kind of street food you’re far more likely to find in Chongqing – the cyberpunk megacity in China’s mountainous south-west – than in regional NSW. It’s rich, warming and gloriously textural stuff: silky dumplings glossed in chilli oil; slow-braised spiced pork served tongguan roujiamo-style in a crisp golden bun made of layered, laminated dough; and beef soup noodles, tightly coiled in a pool of garlic-heavy red Sichuan heat. For Yang, this is the taste of home. It was the comfort food she turned to during the COVID pandemic, when international borders closed and the “couple of days” she’d planned to stay in Shoalhaven turned into a couple of years. “I’ve always loved food – Chinese food, my hometown’s food – but there was nothing like [that] around Shoalhaven,” Yang says. But first, she had to learn how to cook.\n\nAdvertisement\n\nYang, who formerly worked in sales, crowdsourced her first zhong dumpling recipe over phone calls with her grandparents (and friends’ grandparents) back home in Zunyi, in Guizhou province. The dish originated more than a century ago in Chengdu, the capital of neighbouring Sichuan, and it was the first dish on the menu when Fatty Dumpling launched as a pop-up market stall in 2023. “I had to experiment because [the ingredients] here were so different, but eventually, I was able to combine everything I learned and develop my own recipe,” Yang says. “I invited all of my friends to try it … because I wanted to create flavours that were not just authentic, but also approachable.” The dumplings are delicate crescent moons filled with minced pork, boiled and served with a deep red sauce – part chilli oil and part sweet soy, pulsing with garlic and spice. There’s an undercurrent of heat, more pleasant hum than scream, that compels you to keep eating, and eating, until somehow your plate is empty and, damn, maybe you should have ordered eight dumplings instead of five.\n\nAdvertisement\n\nI’m not their only fan. By 2024, Fatty Dumpling became so popular that Yang went all in, leasing and transforming an empty lot in Nowra’s industrial precinct into a sun-beaten oasis, with a shiny silver trailer, potted cacti and an eclectic collection of weather-worn furniture, shaded by striped umbrellas and illuminated with string lights. It’s a casual, seat-yourself affair with counter service and a small selection of canned soft drinks. Yang mostly works alone, sound-tracked by funk music on a Bluetooth speaker. She takes orders, cooks food, and shouts directions at customers: “You have to mix it!” she tells a woman, starting on a bowl of “Mum’s” beef noodle soup. “That’s the only way you can taste all the flavours!” Mum’s beef noodle soup doesn’t come from Yang’s mother, it should be said. In 2024, she returned to China for a research trip to Chongqing, navigating the city’s vertical sprawl to find the best noodle shop. Barbara Noodles (wan za mian). “I met a gentleman [Pang Shifu] who had been in this little shop for over 40 years, and I stayed there for a few days while he taught me his signature dishes – his mum’s beef noodle soup and his [wan za mian] noodles, with all the secret ingredients,” Yang says.\n\nAdvertisement\n\nThe wan za mian are sold at Fatty Dumpling as “Barbara noodles” and they’re deliciously easy to enjoy: thin wheat noodles ladled with velvety yellow peas, sesame seeds, and brothy minced pork, balanced by bright, just-steamed greens and spring onions. The bowl is light, earthy and creamy – all the elements of a bestseller, as Yang predicted. Weiqing “Elvina” Yang. Janie Barrett What she didn’t predict was the impact cooking would have on her. It’s been one year since Fatty Dumpling opened its permanent home, and in that time, she’s developed a community of customers, regulars and close friends. “Food is connection. I didn’t grow up in Australia, I grew up in China, and I’m proud of where I come from,” Yang says. “I wanted to give people the opportunity to know what authentic Chinese food is because that’s my food. “When I see them eat my food and smile, it makes me so happy. It makes me feel accepted by locals, and accepted by this place. That’s really important to me.”\n\nAdvertisement\n\nThree other places to eat in Nowra and surrounds Hyper Hyper Coffee A rustic shed made of corrugated iron, where both locals and visitors queue for house-roasted coffee made on vintage Italian espresso machines. Try the Portuguese tarts, flaky and fresh, or head next door for brekkie at Punch the Ploughman. 85 North Street, Nowra, hyperhypercoffee.com.au Black Cede Gunyah Order the strawberry gum scones with native jam and whipped cream for morning tea at this bush food cafe led by First Nations women. It’s a beautiful space to spend some time, and you can pick up Indigenous spices for home cooking. 39A/43 Kinghorne Street, Nowra, blakcede.com.au Ramox Cafe Located inside the visually stunning grounds of Bundanon Art Museum, Ramox serves a creative take on seasonal Shoalhaven produce. The fried Tilba halloumi with pickled rhubarb, green olive and fennel is quite special with a glass of natural sparkling from Orange winery Tamburlaine. 170 Riversdale Road, Illaroo, bundanon.com.au Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/europa-league-live-ange-postecoglou-begins-his-title-defence-with-a-different-club-20250924-p5mxkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Postecoglou still chasing first Forest win, but Angeball is back",
    "publish_date": "Thu, 25 Sep 2025 11:41:21 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Angeball is back. And surely, very soon, the results will reflect that accordingly.\n\nOn face value, it’s been a tough start for Ange Postecoglou at Nottingham Forest: a 3-0 hiding away to Arsenal in his first match in charge, a gutting 3-2 defeat to Swansea in the Carabao Cup, then a 1-1 draw against newly promoted Burnley.\n\nThe first win of this new era should have come on Thursday morning (AEST) in Seville against Real Betis. They deserved to win; Forest were comfortably the better team, creating the better chances, threading together the better passages of play. If you’re a believer in “expected goals”, then you can take further comfort in those numbers: Postecoglou’s men generated 3.27xG to just 0.49\n\nAnge Postecoglou is confident the wins will come. Credit: AP\n\nBut in reality, you have to turn expected goals into actual goals. And the sooner that Forest’s frontline heeds that lesson, the sooner Postecoglou’s critics will give him due credit for what he has built in the 16 days since his appointment.\n\nThe bones of a classic Postecoglou team are there already, and that’s no mean feat given the team he inherited, the way they used to play, and the circumstances in which he replaced his beloved predecessor, Nuno Espirito Santo.\n\n“I thought our football was outstanding at times in the first half,” Postecoglou said post-match.\n\n“The only thing I could fault is we didn’t put the game to bed. We should have really finished them off in the first half. There won’t be many teams that come here and dominate like we did in that period. We just needed a third goal.”\n\nCoached by the wily Manuel Pellegrini, Real Betis finished sixth in La Liga last season. And though they were missing a handful of their top-choice players, the trip to face them at the Estadio La Cartuja was, arguably, the toughest of Forest’s eight initial fixtures in the Europa League, as they mark their return to continental football after a 30-year absence.\n\nAnge Postecoglou celebrates with Igor Jesus. Credit: AP\n\nTo come away with a 2-2 draw, then, isn’t awful. But it is deflating.\n\nComing back from a goal down after Cedric Bakambu opened the scoring for the hosts after just 15 minutes, Forest’s next half-hour was, at times, genuinely awe-inspiring. It was the most vivid display of Angeball in recent memory; certainly much better than anything Tottenham Hotspur produced in Postecoglou’s last six or so months in that job.\n\nThe passing was crisp, the movement superb, the pressing relentless, and the energy high despite oppressive heat and humidity. Fans on social media described it as the best attacking football they’d seen from their side in ... forever.\n\nThree minutes after Bakambu’s opener, Igor Jesus became the first Forest player to score in Europe since 1996, capping a cracking left-to-right move by turning in Morgan Gibbs-White’s pass across goal from point-blank range.\n\n“I think the moments like the first goal, when they are constructed like that, are what make our game so beautiful,” Postecoglou said.\n\nThen, five minutes later, he headed in a corner kick to make it 2-1 and further stamp his claims to become Postecoglou’s first-choice striker.\n\nThe Brazilian, who joined Forest from Botafogo for a reported £10 million in the off-season, had two further chances to make it a hat-trick, while Callum Hudson-Odoi also hit the post during their breathtaking purple patch. So it could have been, without hyperbole, 5-1 at the break.\n\nBut there was always a danger that a one-goal lead would not be sufficient, and so it proved. Partly due to the conditions, and partly due to the withdrawal at half-time of midfielder Douglas Luiz - who Postecoglou said had “felt” his hamstring - Forest’s grip on the match loosened. Still, they dealt well with whatever Betis threw at them, which wasn’t much.\n\nMorgan Gibbs-White salutes the travelling fans. Credit: Getty Images\n\nFive minutes from full-time, however, came the sucker-punch. Teed up by substitute Marc Roca, Antony hammered in the equaliser at the back post, and the approximately 3000-odd travelling fans were left shattered.\n\nLoading\n\n“I’m just disappointed the players and the supporters don’t get the rewards for our efforts. I’ve just got to make sure they keep their heads up because there’s plenty to be positive about,” Postecoglou said.\n\n“And the wins will come, if we keep playing our football like that.”\n\nHe’s not wrong, but words alone won’t convince the doubters, even though everyone on the inside seems to have bought into what he’s trying to do. For external, vibes-based reasons, more than anything else, Postecoglou badly needs a win - and it needs to come in Sunday’s clash (2.30am AEST) against Sunderland at home, or else the voices against him will get louder and more confident.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-renowned-brisbane-party-boat-up-for-auction-with-bidding-starting-at-just-9-20250924-p5mxl4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Dog missing after fire razes house | Renowned Brisbane party boat up for auction",
    "publish_date": "Thu, 25 Sep 2025 11:33:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "Aldi has beaten out Coles and Woolworths in a comparison for having the cheapest home-brand staples, according to testing from consumer group Choice.\n\nAs part of its ongoing quarterly surveys of nationwide supermarket prices, Choice’s latest comparison exercise tracked the cost of a basket comprising home-brand versions of cream cheese, thickened cream, puff pastry, frozen mixed berries, tomato paste, spaghetti, tomato sauce and soy milk.\n\nAldi has beaten out Coles and Woolworths in a comparison for having the cheapest home-brand staples, according to testing from consumer group Choice. Credit: Oscar Colman, Louie Douvis\n\nThe total cost of the basket was cheapest at Aldi stores, at $20.08, followed by Coles at $21.30, Woolworths at $21.40, and IGA at $23.89, according to the survey that was conducted across 104 individual supermarkets in 27 locations across Australia in June.\n\nChoice also studied the freshness of strawberries from the four supermarkets, with surveyors assessing the state of the berries on day one and again on day five while storing them in their original punnets in a fridge’s crisper drawer.\n\nColes’ strawberries were deemed the freshest, with 100 per cent of punnets showing no signs of decay on day one and 58 per cent showing no signs of decay by day five. In contrast, 50 per cent of punnets purchased from IGA showed no signs of decay after one day, while just 25 per cent showed no signs of decay after five days.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-game-we-ve-all-been-waiting-for-how-the-battle-between-cats-and-lions-will-be-won-20250924-p5mxmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The game we’ve all been waiting for: How the battle between Cats and Lions will be won",
    "publish_date": "Thu, 25 Sep 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Jimmy Bartel"
    ],
    "text": "Their development program under former Lions great Nigel Lappin continues to identify and produce high-level AFL players from unlikely origins. Fourteen Cats in their preliminary final win over Hawthorn were selected with picks outside the top 30 of the draft. Most of them, in fact, were rookie or category B selections. Cats coach Chris Scott’s ability to move and adjust with the game, year after year, and more importantly week after week, is why he is so often rated among the greatest all-time AFL coaches. Quality: Lions forward Zac Bailey. Credit: AFL Photos via Getty Images The craftsmen Small and mid-sized forwards can be hugely influential on grand final day. Just look at how often the Norm Smith Medal goes to one of these players, and how well-stocked both these teams are.\n\nThe Lions and Cats both have a battalion of crafty forwards who have a huge influence on their matches each and every week. With the quality quartet of Zac Bailey, Charlie Cameron, Kai Lohmann and Cam Rayner, the Lions probably have a slight edge in forward-50m work and direct scoreboard impact. Although not tall, all four are strong overhead and capable of being played one-out as a deep forward, meaning they pose a constant threat to their opposition. You just can’t take your eyes off these four for a moment; even when they look like they’re having a quiet day, any one of them could spring to life and turn a game Brisbane’s way, as they’ve done so many times before. Geelong’s smaller forwards are just as impactful, but in a slightly different way. Tyson Stengle is the Geelong small who likes to play closer to goal; more like a typical forward pocket than Gryan Miers, Bradley Close or Shaun Mannagh. Those three provide the Cats with drive and connection. They each have an enormous work rate, which they use to get up the ground and provide their team with a linking option as the Cats surge forward off half-back. All of them are excellent kicks inside their team’s forward 50m and regularly get involved in Geelong’s scoring chains.\n\nHarass Andrews The Lions have the best defender in the grand final and the Cats have the best forward. But don’t expect this game to be a throwback to the old days; there’s little chance of Harris Andrews and Jeremy Cameron playing head-to-head on each other for long stretches of the match. Ryan Lester is the ultimate team man for the Lions. He is likely to get first crack at Cameron and will be comfortable if the Cat’s superstar is taking marks up on centre wing and beyond. Lions defender Harris Andrews will be crucial to the contest. Credit: Getty Images The Cats might instruct Shannon Neale to use his running power to get in behind Andrews, or maybe recruit Jack Martin will be given the task of helping bring the ball to ground. Whatever the plan, Geelong’s mission against Andrews will be crystal clear: don’t let him mark the footy.\n\nIf they can stop him doing that, the Lions ability to rebound from defence will be seriously curtailed. The taskmasters Look out if the ball spills between Brisbane’s Josh Dunkley and Geelong’s Tom Atkins on Saturday. They are two of the most ferocious and selfless players in the AFL. In fact, only Brownlow medallist Matt Rowell (214) sits between Atkins (226 in first place) and Dunkley (third with 213) on the leaderboard of AFL tacklers in 2025. Tom Atkins is one of the most selfless and ferocious players in the AFL. Credit: Getty Images These two provide the quality control for their team at clearances and in contested situations. The grunt work they do is what allows their more heralded teammates to shine.\n\nIf Lachie Neale overcomes his calf injury and plays in the grand final, I expect Atkins will get the job of making sure the dual Brownlow medallist has limited impact on the contest, while still being tasked with driving the Cats forward, like he did in the preliminary final against Hawthorn. It’s not as easy to predict what Dunkley’s role will be. I’ll be intrigued to see who Fagan assigns him to. Will it be one of Geelong’s dash brothers – Bailey Smith or Max Holmes – or will he get the job of being kryptonite to the man who impersonated Superman for the Cats last week, skipper Patrick Dangerfield? Speaking of players being given assignments, Geelong have two magnificent Irishmen, Mark O’Connor and Oisin Mullin, who are both likely to lock onto a Lions playmaker. The question is, will they be asked to repeat the roles they carried out so successfully at in their team’s qualifying final win over the Lions – O’Connor on Rayner and Mullin on Hugh McCluggage – or will Scott have another match-up in mind this time around? It’s all part of what makes grand finals so special and intriguing – there will be match-ups all over the ground that could shape the result.\n\nIn the shoes of the coaches Putting myself in Chris Fagan’s shoes my message to the Brisbane Lions players before they run out is simple: “Be brave with the ball in hand, like you’ve been all season. Take risks. Kick the ball with dare up the middle of the MCG, and test the Cats with your ball movement. This has been the formula for success against them all season. It’s all about attitude. Yes, you will turn the ball over occasionally, we’ll cop that. You simply must keep attacking them and going for your kicks. We can’t let their back line get settled. That’s what they want, especially without Tom Stewart, so let’s break through and strike before they’re ready.” Premiership coach Chris Scott. Credit: Getty Images If I were Chris Scott, this would be my pre-game missive to the Cats:\n\nLoading “We must repeatedly outnumber them at the contest and spread from there. This is how we swung the momentum against the Hawks last week, and it’s how we’re going to beat the Lions. Speed on the ball is our friend. If we can take care of the contest first, we have the players and the running power to capitalise. Brisbane might be potent, but they won’t be able to keep up with us if we win enough ball at the contest and spread from there.” My tips Surprise, surprise you might say, I’m tipping the Cats in what I’m hoping will be an epic grand final. These teams have the talent, the appealing game styles and coaches with the tactical acumen for this to be a grand final for the ages; one that we will talk about for years to come. So for me, it’s the Cats by three points, with Mannagh to be the Norm Smith medallist.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/watergate-the-kennedys-and-how-the-american-dream-took-a-trumpian-turn-20250923-p5mxd3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Watergate, the Kennedys and how the American dream took a Trumpian turn",
    "publish_date": "Thu, 25 Sep 2025 11:28:00 +1000",
    "category": "finance",
    "authors": [
      "Tony Wright"
    ],
    "text": "Eighteen was the great trophy when I was young: a driving licence, a drink in a pub without looking over the shoulder, the end of high school. Liberation. Somewhere along the track, birthdays discard their gloss until eventually, there comes the ticking down and the looking back. A long time ago, my father was celebrating his 80th birthday when he drew me aside. “Son,” he began, whispering. “I know the years tell my age, but I don’t feel I’m much older than I was when I was about 25 or 30. Does it ever feel like that to you?” “I think everyone feels that at some point,” I told him. “That’s a relief,” said my father, expelling a great sigh. “I thought I was the only one.”\n\nBarry Humphries, comedian, author and satirist, said something similar. Loading “It’s a totally unfamiliar experience. You don’t notice it, you see,” he said of growing old. “I find growing old is sad only in the sense that the world looks exactly the same as it did when I was young.” The world doesn’t look anything like what it seemed when I was young, it happens. But Humphries and my father were talking about something more poignant: that age had rendered them all but invisible within a world they still saw in the colours of youth.\n\nMy mate and I were talking about something different again as we discussed our excursions into the past to avoid the present. For a moment or two, we hit upon the sweet, moody memory of the 1973 movie, American Graffiti. It was set in small-town America over a single night in 1962, when a group of high school graduates, about to fly off to new lives, paid reluctant farewell to their teenage years, cruising the main street and confronting uncertainty about the future. Its soundtrack of rock ′n’ roll, doo-wop, early surf music and ballads overlaid by the voice of the late US radio DJ, Wolfman Jack, still has the power to overwhelm listeners of a certain age. My mate and I did not live in small-town America in 1962, but its central theme of innocent longing resonates among those of us who were young even in Bob Menzies’ less exciting Australia.\n\nAmerica’s sense of moral certitude – and by extension, the Australia that relied so heavily on US supremacy – was shattered the following year when president John F. Kennedy was assassinated. Loading The culture of the 1960s became dominated by an increasingly meaningless war in Vietnam in which 1.3 million civilians and military died (most of them Vietnamese, though almost a quarter of a million were Americans and their allies, including more than 500 Australians). In 1968, both Martin Luther King Jr and Bobby Kennedy were assassinated. All these years later, that once-great nation that had such a cultural impact on the West, including Australia, has devolved to the point its president and his family openly enrich themselves while sooling the tamed Justice Department onto political enemies, universities, liberals, media companies, journalists and satirists.\n\nThis same president, turning his back and his ire onto oppressed peoples everywhere, spouts dangerous, utterly uninformed nonsense linking a common painkiller with autism, standing next to a black-sheep Kennedy with no scientific or medical background who as the US Secretary for Health (!) is undermining decades of the fight against communicable diseases by spouting more nonsense about vaccines. Loading As my mate and I continued our quest for sporadic havens, we inevitably got to the pleasures of watching the footy. But the AFL has lost its mind, we decided. How else to interpret the pro-women and anti-homophobic league’s decision to pay American rapper Snoop Dogg $2 million to entertain the crowd at the grand final?\n\nHere is a fellow who built his career on the most vilely misogynistic lyrics and who has a history of homophobia, however much he claims to have cleaned up his act in recent times. Maybe he understands hypocrisy. Why, having declared in 2017 he would roast any black artist who performed for Donald Trump’s inauguration, he performed himself at the inaugural Crypto Ball in Washington on January 17 this year. It billed itself as an event “intended to honour the 60th Presidential Inauguration, America’s first ‘crypto president’, President-elect Donald J. Trump, his incoming cabinet and administration”.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/traveller/travel-news/wider-seats-bigger-bins-new-qantas-airbus-first-flight-takes-off-20250922-p5mwxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wider seats, bigger bins: New Qantas Airbus’ first flight takes off",
    "publish_date": "Thu, 25 Sep 2025 11:11:37 +1000",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\nTravel newsAir travel Wider seats, bigger bins: New Qantas Airbus’ first flight takes off Katherine Scott Updated September 25, 2025 — 11:11am , first published September 25, 2025 — 5:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nKey points The first two of Qantas’ new A321XLR fleet enter commercial service from September 25, 2025\n\nThe new aircraft are part of the airline’s biggest domestic fleet renewal to date, Project Winton\n\nThe first seven A321XLRs will replace Qantas’ ageing Boeing 737s\n\nThe new aircraft feature larger windows, wider seats, fast, free Wi-Fi, a reduction in aircraft noise and 60 per cent more overhead storage than the Boeing 737\n\nThe airline will take delivery of a further seven A321XLRs before the end of the financial year\n\nQantas customers may note some nifty new features on board domestic flights from Thursday as the first two of its new Airbus A321XLR aircraft enter commercial service, part of the Qantas Group’s multibillion-dollar fleet overhaul. The long-awaited next-generation planes, christened Outback Way (VH-OGB) and Great Ocean Road (VH-OGA), took to the skies on Thursday with an inaugural Sydney-Perth (departing at 11.07am, a little over half an hour late) and Sydney-Melbourne service in the evening (6.50pm). The inaugural Qantas A321XLR flight on the Sydney to Perth route takes off on Thursday. The new planes will replace Qantas’ ageing Boeing 737s, and feature wider economy seats, larger windows and fast, free Wi-Fi. The aircraft also addresses a common passenger pain point: new larger overhead bins feature 60 per cent more baggage space. Last month, Qantas announced orders for an additional 20 A321XLRs, taking its total Airbus orders to 48 aircraft, in a bid to accelerate its fleet renewal program.\n\nAdvertisement\n\nCrucially, the highly efficient single-aisle planes can fly 8700 kilometres – more than 3000 kilometres further than the 737 (the “XLR” in the A321’s name stands for “extra long range”) – opening up more domestic and short-haul international routes for the airline, while taking pressure off existing crowded routes. While new international routes are yet to be confirmed for the A321XLR, Qantas domestic chief executive Markus Svensson said the extended range opened up the possibility of adding “destinations across South-East Asia and the Pacific Islands that are not viable with our current narrowbody fleet”. Qantas chief executive Vanessa Hudson has previously indicated the aircraft will lead to an increase in routes to South-East Asia. Perth-India is also a possibility. The A321XLR increases seat capacity to 197 passengers. Five metres longer than its 737 predecessor, and with lower carbon emissions per seat, the new A321XLR can carry 197 passengers. It has 20 business class seats (up from 12) and 177 economy seats (up from 162), marking an overall 13 per cent increase in seat capacity.\n\nAdvertisement\n\nThe additional capacity hasn’t eaten into space between seats; economy remains unaffected, while business customers come out ahead with 66 per cent more legroom. Business class seats include wireless charging pads and an extendable cocktail table. Business class seats have a pitch of 37 inches (94 centimetres), with a recline of five inches (12.7 centimetres) and a six-way adjustable headrest, calf rest and footrest, with a 2-2 configuration. The seats feature reddish-brown leather covers, wireless charging pads and dual USB A and C charging ports, as well as an extendable cocktail table and in-arm tray table with built-in tablet holder. Economy seats are wider than those in the 737s at 17.6 inches (44.7 centimetres), up from 17 inches (43.2 centimetres), with a pitch of 30 inches (76.2 centimetres), in a 3-3 configuration. Seats feature extra cushioning, six-way leather adjustable headrests, drop-down device holders, adjustable meal tables and dual USB A and C charging ports. Economy seats are wider than those of the 737s at 17.6 inches.\n\nAdvertisement\n\nThe redesigned seats incorporate new materials and a refreshed colour scheme, while the longer cabin’s higher ceilings and larger windows invite more natural light, creating a brighter, more spacious feel. Virgin Australia’s first Embraer 190-E2 aircraft touches down in Perth. While A321s flying domestic routes will not have seatback screens, Qantas has plans to configure 16 of the new aircraft with entertainment screens to service longer routes, including transcontinental flights from Perth, and short- and medium-haul international routes. Related Article ★★★★\n\nAirline reviews Your next international Qantas flight might be operated by this airline The launch forms part of the airline’s biggest domestic fleet renewal to date, Project Winton, announced in 2022 and much delayed due to COVID-related supply chain disruptions in securing parts.\n\nAdvertisement\n\nQantas is expected to take delivery of its third A321XLR aircraft, Seven Peaks Walk (VH-OGC), in November, with seven of the aircraft on track for rollout before the end of the financial year. In more good news for domestic flyers, Virgin Australia took delivery of its first Embraer 190-E2 narrow-body jet earlier this month. The new aircraft will primarily service charter routes, while supporting regional routes in Western Australia from next month, including destinations like Darwin, Kalgoorlie, Karratha, Port Hedland and Broome. The writer flew as a guest of Qantas.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/lifestyle/rom-coms-top-aussie-audiobook-charts-20250925-p5mxuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rom-coms top Aussie audiobook charts",
    "publish_date": "Thu, 25 Sep 2025 11:09:31 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Rom-coms top Aussie audiobook charts\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/lifestyle/king-charles-rules-against-harry-s-royal-comeback-20250925-p5mxuk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles rules against Harry’s royal comeback",
    "publish_date": "Thu, 25 Sep 2025 11:08:22 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles rules against Harry’s royal comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/afl/tony-jones-unpacks-his-concerns-ahead-of-snoop-dogg-performance-20250925-p5mxuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tony Jones unpacks his concerns ahead of Snoop Dogg performance",
    "publish_date": "Thu, 25 Sep 2025 11:04:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tony Jones unpacks his concerns ahead of Snoop Dogg performance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/queensland/where-to-watch-the-2025-afl-grand-final-in-brisbane-20250924-p5mxog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Where to watch the 2025 AFL grand final in Brisbane",
    "publish_date": "Thu, 25 Sep 2025 11:03:59 +1000",
    "category": "sports",
    "authors": [
      "Nick Dent"
    ],
    "text": "It’s Brisbane’s third consecutive AFL grand final and the Lions are looking to be back-to-back premiers in 2025. But not if Geelong have anything to say about it.\n\nThe 2025 Toyota AFL Grand Final starts at 2.30pm on Saturday, September 27, and supporters who haven’t made it down to Melbourne will need somewhere they can watch it live and loud.\n\nYour local pub can fit the bill, and there is also the official viewing site in New Farm. Be sure to settle in early: the pre-match entertainment at the MCG is headlined by Snoop Dogg, with support from Baker Boy, Vera Blue, Tash Sultana, Emma Donovan and Kee’ahn, as well as footy perennial Mike “Up There Cazaly” Brady.\n\nGetting in early on Thursday at New Farm Park was Greenslopes mum Anne Pattearson and her kids Madeleine and George.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/national/he-won-t-be-able-to-talk-soon-facing-a-high-flying-husband-s-incurable-disease-20250901-p5mrih.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He won’t be able to talk soon’: Facing a high-flying husband’s incurable disease",
    "publish_date": "Thu, 25 Sep 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Unfortunately, I’m going to decline. It’s hard to have your independence taken away. Tina reassures me, helps me engage in social interactions, monitors my symptoms. Her strength and patience leave me in awe. As a society, we should talk more about death. Death should be celebrated if you can be peaceful, without struggle, if you leave a legacy. I don’t have regrets, I didn’t leave any stone unturned, but I’ve realised if you’re too busy in life, you miss out on what’s important. The diagnosis has brought me closer to my children; I’m vulnerable now and I assure them this isn’t hereditary. Tina’s love is steady. Her presence gives me peace.\n\nTina: When we met, work was my everything and I was happy to cruise through life and have a baby on my own. I was working at the grand prix as a business development manager for a mineral water brand. We’d ­invited some high-profile chefs along and Teage was one of them. He was quite drunk and I ended up chucking him in a cab and slamming the door. Three months later, I was at the George bar in St Kilda with friends. He walks in and sits next to me: “You’re going to come on a date”; “No, I’m not, actually.” He kept pursuing me. We started dating and that was it.\n\nTeage was open, passionate about life. He’d been doing therapy, trying to find how broken he was and why his relationships fell apart. He was vulnerable. He’d say things like “see how bright the sky is?” He was really raw and I enjoyed that. He’d wake in the middle of the night after crazy dreams. I said “write them down”. He had ideas for all his restaurants [Ezard and Gingerboy in Melbourne, Black by Ezard in Sydney and Ezard at Levantine Hill in the Yarra Valley]. He had this amazing brain. It was attractive to see somebody function at this euphoric level.\n\n‘You lose parts of the person before they’re physically gone.’ Tina Ezard\n\nThe restaurants made for long, fast hours; the work didn’t stop. If we weren’t trying to fix a menu, do tastings or get a new product, we’d travel to eat, locally and overseas. I helped him. I was happy, quietly behind closed doors. I’d tell Teage “believe in your instinct, your passion, because nothing can be a failure then”. We’ve had two kids – Sienna is 18, Kingston is 16 – but the restaurants were always Teage’s first family, first love. I didn’t mind: I love seeing people grow.",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/optus-to-pay-100m-fine-for-sales-practices-targeting-vulnerable-australians/7o8xqa595",
    "title": "Optus to pay $100m fine for sales practices targeting vulnerable Australians",
    "publish_date": "Wed, 24 Sep 2025 09:20:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Federal Court has ordered Optus to pay a $100 million fine over its sales tactics targeting hundreds of vulnerable customers, including First Nations Australians.\n\n\n\n\n\nOptus had already agreed to pay the fine, after the Australian Competition and Consumer Commission brought the case based on tip-offs from financial counsellors.\n\n\n\n\n\nOptus admitted its sales staff acted unconscionably when selling phones and contracts to more than 400 people at 16 stores nationwide between 2019 and 2023, including vulnerable customers such as Indigenous and intellectually disabled people.\n\n\n\n\n\nJustice Patrick O'Sullivan described the company's conduct over several years until 2023 as \"extremely serious\" and \"appalling\".\n\n\n\n\n\n\"Senior management abrogated their management responsibilities and, consequently, Optus abrogated any semblance of responsible corporate behaviour,\" O'Sullivan said.\n\n\n\nOptus chief blames human error for triple-zero disaster\n\nChief executive Stephen Rue outlined the causes of the 18 September outage at a press conference on Wednesday.\n\n\n\n\n\nRue blamed the issue on human error, brushing off concerns the company's Singapore owner, Singtel, had cut spending to Australia's second largest telco.\n\n\n\n\n\n\"Standard processes were not followed,\" Rue told reporters.\n\n\n\n\n\n\"That's not an investment issue, that's people not following process.\"\n\n\n\n\n\n\"That is a result of human error.\"\n\n\n\nThe first step of Optus' firewall upgrade was to divert calls to a separate part of the core network.\n\n\n\n\n\nBut preliminary investigations revealed this had not been followed.\n\n\n\n\n\nThe failure is the second time in two years a major Optus outage has prevented people accessing emergency services.\n\n\n\nCalls for Rue's resignation grow\n\nPressure has continued to mount on Rue after revelations the company had not implemented a third of the recommendations that followed a review on its 2023 outage.\n\n\n\n\n\nRue took the reins in November after the earlier outage and a hacking incident that left millions of customers exposed to potential online fraud that forced the departure of Kelly Bayer Rosmarin as chief executive.\n\n\n\n\n\nThe Opposition and Greens called out federal communications minister Anika Wells for flying overseas in the middle of the current crisis, while urging Rue to resign.\n\n\n\n\n\nSingtel Group defied the demands to sack Rue, a former NBN Co boss brought in to right the ship after scandals.\n\n\n\n\"Our hearts go out to the families and friends of those who have passed away and we know that Optus will get to the bottom of this matter,\" Singtel group chief executive Yuen Kuan Moon said in a statement.\n\n\n\n\n\n\"We will continue to fully support the Optus board and management team as they work through this incident and accelerate the changes needed.\"\n\n\n\n\n\nBoard chairman John Arthur also appeared to stand by Rue as Optus announced distinguished business woman Kerry Schott would lead an independent review on the outage.\n\n\n\n\n\nAsked about calls for his resignation, Rue said the situation was not about him.\n\n\n\nKerry Schott most recently reviewed another outage debacle — on Sydney trains. Source: AAP / Bianca De Marchi \"What we have here is lives have been lost, a failure of triple zero, processes in call centres but also in network, not being followed,\" he said.\n\n\n\n\n\n\"There are no words that can express how sorry I am about the very sad loss of the lives of four people who could not reach emergency services in their time of need.\"\n\n\n\n\n\nSchott's review will press for the causes of the outage and examine the operational management of triple-zero calls on the Optus network.\n\n\n\n\n\nIt will also look at Optus' response to the incident and whether it adhered to policies and legal requirements.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 19
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/higher-inflation-threatens-rate-cuts-is-the-us-market-overvalued/1m3j0wor1",
    "title": "Higher inflation threatens rate cuts & is the US market overvalued?",
    "publish_date": "Wed, 24 Sep 2025 07:28:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-august-inflation-data-could-affect-reserve-bank-rates/7db0sjp24",
    "title": "Three-year inflation high could mean 'wafer-thin' chance of interest rate cut pre November",
    "publish_date": "Wed, 24 Sep 2025 05:53:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "New inflation data \"almost certainly\" rules out a Reserve Bank of Australia (RBA) cash rate cut when it meets next week, but a November cut is still a \"live option\", experts say.\n\n\n\n\n\nThe consumer price index (CPI) — a measure of the percentage change in the price of various household goods and services — rose 3 per cent in the 12 months to August, according to Australian Bureau of Statistics (ABS) inflation data released today.\n\n\n\n\n\nIt's a further increase from the 2.8 per cent CPI rise in the 12 months to July, and 1.9 per cent in the year to June that the ABS has reported in recent months.\n\n\n\n\n\n\"The 3 per cent annual CPI inflation to August was up from 2.8 per cent to July, making this the highest annual inflation rate since July 2024 ,\" ABS head of prices statistics Michelle Marquardt said.\n\n\n\n\n\nThe biggest drivers of the price uptick were food and non-alcoholic beverages, which rose by 3 per cent, alcohol and tobacco by 6 per cent, and housing by 4.5 per cent.\n\n\n\n\n\nThe uptick in housing costs was primarily driven by electricity costs, which rose 24.6 per cent in the 12 months to August as government energy rebates ended and consumers faced higher out-of-pocket costs for electricity bills.\n\n\n\n\n\nHowever, Marquardt said that, even if Commonwealth and state electricity rebates over the last year were excluded from the data, electricity prices rose by 5.9 per cent.\n\n\n\nSeptember rate cut highly unlikely\n\nSally Tindall, financial comparison site Canstar's data insights director, said mortgage holders shouldn't expect the RBA board to make any cash rate changes when it meets early next week.\n\n\n\n\n\n\"The chance of a rate cut next week was wafer-thin to start with, and this [new inflation data] really just almost certainly rules it out,\" she said.\n\n\n\n\n\nWhile one reason for this was \"headline CPI moving in the wrong direction\", she highlighted that headline inflation isn't the central consideration in RBA cash rate decisions.\n\n\n\n\n\nThe central bank treats the annual trimmed mean — a metric that smooths out certain volatile price movements — as a more reliable indicator of underlying inflation, and this figure decreased from 2.7 per cent in July to 2.6 in August.\n\n\n\n\n\n\"It's slightly down from last month's result, but still at 2.6 per cent, that's above the RBA's midpoint of the [2-3 per cent] target band. And so I really think that rules out the chance of a rate cut next week,\" she added.\n\n\n\nLISTEN TO Why many Australians don't feel financially confident & ASX rises as market waits for US inflation SBS News 14:03 English\n\nIG Market analyst Tony Sycamore said this movement in annual trimmed mean inflation was broadly in line with the central bank's expectations.\n\n\n\n\n\nThe RBA’s updated forecasts in August projected that inflation would \"fall back to the midpoint of that 2-3 per cent target band, and that's exactly what it did at 2.6 per cent,\" he said.\n\n\n\n\n\n\"I don't think there were many people thinking they would cut rates in September, but absolutely not after today.\"\n\n\n\nNovember rate cut 'on the cards'\n\nSycamore said the latest figures were a solid basis for the RBA \"to continue its cautious rate-cutting cycle\".\n\n\n\n\n\n\"We expect the RBA to keep rates on hold in September, before cutting the cash rate by 25 basis points [0.25 percentage points] in November 2025, bringing it to 3.35 per cent,\" he said.\n\n\n\n\n\n\"It's not a rate cut that I would say is a 100 per cent guaranteed, but in terms of my conviction level, it is high ... it's probably a 70 per cent probability,\" he added.\n\n\n\nTindall said a rate cut when the RBA board meets in early November was \"a live option\" but would depend on labour force data and quarterly CPI data that would be received between now and then.\n\n\n\n\n\n\"It is still very much on the cards in November,\" she said.\n\n\n\n\n\n\"The RBA has said that further easing is likely — that's code for at least one more cash rate cut [this year].\n\n\n\n\n\n\"However, it also says that it's data-dependent, and it's not a guarantee that there will be further cash rate cuts.\"\n\n\n\n\n\nThe RBA board's last monetary policy meeting for the year will be in December.\n\n\n\n\n\n— with additional reporting from the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/aboriginal-people-report-less-respectful-hospital-care-report-finds/dk8qh9vdv",
    "title": "Aboriginal people report less respectful hospital care. Here's what can make a difference",
    "publish_date": "Wed, 24 Sep 2025 05:04:26 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "First Nations patients are less likely to have positive hospital care experiences than their non-Indigenous counterparts, but Aboriginal health workers can make a significant difference, a report has found.\n\n\n\n\n\nIn 2024, 60 per cent of Indigenous patients rated their care \"very good\", compared with 67 per cent of non-Aboriginal people.\n\n\n\n\n\nAboriginal patients were also 14 per cent less likely to say their cultural or religious beliefs were always respected while in hospital and 11 per cent less likely to say health professionals explained things in a way they could understand.\n\n\n\n\n\nThe report, released by the Bureau of Health Information (BHI), was based on the responses of more than 12,000 Aboriginal people who provided feedback on their hospital care in NSW between 2019 and 2024.\n\n\n\nFeedback 'important' to drive improvement\n\nBHI CEO Hilary Rowell said patient feedback can help hospitals and the healthcare system identify areas for improvement.\n\n\n\n\n\n\"Patient experience is a really important aspect of the overall quality of health care,\" she told the Australian Associated Press.\n\n\n\n\n\n\"Evidence tells us if people have better experiences as patients, particularly around feeling respected, involved in decisions about their care, they have better outcomes too.\"\n\n\n\nREAD MORE Following the First Nations people on the frontline of health services\n\nMore than a quarter (28 per cent) of Aboriginal patients said in the past 12 months, there was a time when they needed to go to hospital but did not.\n\n\n\n\n\nThis was an improvement from 36 per cent in 2022.\n\n\n\n\n\nThere was also an improvement in the proportion of patients who felt they had been unfairly treated by hospital staff, with 6 per cent reporting cases of unfair treatment in their 2024 surveys, down from 8 per cent in 2023.\n\n\n\nAboriginal health workers associated with higher care ratings\n\nRowell said there were a number of indicators that were most strongly associated with higher ratings of care.\n\n\n\n\n\n\"What they told us ... is that they had a better overall experience in hospital when they felt their care was really well organised and the healthcare workers, doctors and nurses were kind and worked really well together,\" she said.\n\n\n\nREAD MORE Decolonising health to provide better care for patients\n\nPatients who were supported by an Aboriginal health worker were also more likely to report more positive care.\n\n\n\n\n\nFour in five said these health professionals were always kind and caring, compared with 69 per cent of those who did not receive this support.\n\n\n\n\n\n\"Among Aboriginal patients who had the support, or offer of support from an Aboriginal health worker, 71 per cent said they were definitely given enough information about how to manage their care at home after discharge, compared with just 56 per cent of patients who hadn't necessarily had that support,\" Rowell said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/donald-trump-walks-his-own-path-on-autism-research-health-experts-say-claims-dont-stack-up/qfmspyi5t",
    "title": "Donald Trump walks his own path on autism research. Health experts say claims don't stack up",
    "publish_date": "Wed, 24 Sep 2025 04:35:14 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn the White House, accompanied by his Health Secretary Robert F Kennedy Junior and other officials, Donald Trump made a leap into uncharted medical territory.\n\n\n\n\n\n\"I want to say it like it is. Don't take Tylenol. Don't take it. If you just can't, I mean, fight like hell not to take it. There may be a point where you have to and that you'll have to work out with yourself. So don't take Tylenol.\"\n\n\n\n\n\nMainstream medical groups have responded strongly and quickly, saying the new recommendations are based on unsubstantiated and inconclusive research.\n\n\n\n\n\nThe drug, used to treat pain and fever, is known as paracetamol in Australia and many other parts of the world.\n\n\n\n\n\nIn the United States - it is known as acetaminophen and is marketed as tylenol.\n\n\n\n\n\nDespite the lack of evidence, the US Food and Drug Administration (FDA) has moved to change paracetamol product labels and issued a letter to physicians to say the decision belongs with parents.\n\n\n\n\n\nResearchers who've spent decades investigating potential causes of autism say the existing data doesn't support the Trump administration's claims.\n\n\n\n\n\nAutism expert and researcher at the University of Texas Dr Audrey Brumback says medicine is more individualised than Mr Trump is suggesting.\n\n\n\n\n\n\"I would say we have strong evidence that acetaminophen is not causing autism. It's certainly not the cause of autism. And so to make that sort of statement that nobody should take Tylenol, takes away the individualised nature of how we practice medicine and how these medicines are prescribed for families, for the people they are prescribed for both during pregnancy and for children.\"\n\n\n\n\n\nAustralia's Therapeutic Goods Administration has also commented, re-confirming that paracetamol is safe for use in pregnancy.\n\n\n\n\n\nThe Australian Medical Association (AMA) was also quick to dismiss Donald Trump's claims, reassuring Australian women of the safety of the drug, and that fever can cause more issues than paracetamol during a pregnancy.\n\n\n\n\n\nDr Danielle McMullen is the AMA President.\n\n\n\n\n\n\"What we can confidently say is that there is not data showing that paracetamol causes autism and that women should feel confident using paracetamol to manage pain or fever during pregnancy.\"\n\n\n\n\n\nIt's not the first time Donald Trump has offered unusual medical advice.\n\n\n\n\n\nIn 2020, during the COVID pandemic he had this to say:\n\n\n\n\n\n\"So, supposing we hit the body with a tremendous, whether it's ultraviolet or just very powerful light, and I think you said that has not been checked but you're going to test it. And then I said, supposing you brought the light inside the body, which you can do either through the skin or in some other way.\"\n\n\n\n\n\nWith the well-known vaccine sceptic Robert F Kennedy Junior by his side, Donald Trump also announced millions of dollars in new funding for autism research, including a long-debunked theory that puts the blame on vaccines.\n\n\n\n\n\nDr Hannah Kirk is a Senior Lecturer in Developmental Psychology at Monash University in Melbourne.\n\n\n\n\n\nShe says there are various reasons why rates of autism have increased in recent years.\n\n\n\n\n\n\"We know that autism is a neurodevelopmental condition with no single known cause. I can't speculate on the reasons for their interest, but we do know that the rates of autism have increased and there is general consensus that the reason for that is broader definition in our diagnostic criteria of autism as well as broader public awareness.\"\n\n\n\n\n\nThe US Food and Drug Administration is also taking the first steps to try to approve a decades-old generic drug for a new group of patients, including some who may have autism.\n\n\n\n\n\nThe agency said it will seek approval of leucovorin for patients believed to have low levels of folate, one form of vitamin B, in the brain.\n\n\n\n\n\nThat may include some people with autism.\n\n\n\n\n\nThe agency’s move is based on a review of small studies performed between 2009 and 2024.\n\n\n\n\n\nProfessor Kirk says there is not enough evidence to support claims that leucovorin is a treatment for autism.\n\n\n\n\n\n\"We know that folate is really important for the development of the central nervous system, and some studies including individuals with autism have shown that there's difficulty in folate metabolism in some individuals with autism. So in theory, this approach could be beneficial, but there's simply just not enough evidence at this point to advocate for it being used as a treatment or a therapy for individuals with autism.\"\n\n\n\n\n\nHealth Minister Mark Butler says his department is looking closely at health announcements from the US, particularly if it comes through the Food and Drug Administration.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-24-september-2025/0xn6bwx5q",
    "title": "SBS News in Easy English 24 September 2025",
    "publish_date": "Wed, 24 Sep 2025 04:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News in Easy English, I'm Essam Al-Ghalib.\n\n\n\n\n\nTwo Australian doctors working in Gaza say they have faced constant threats and fear for their lives since arriving in the besieged enclave.\n\n\n\n\n\nGold Coast doctor Nada Abu Alrub and Brisbane anaesthesiologist Dr Saya Ayiz are currently based in Al Shifa hospital on a humanitarian mission with the Palestinian Australian NZ Medical Association.\n\n\n\n\n\nThe pair have been in Gaza for almost two weeks, and say they have both received threatening text messages and were forced to leave another hospital - Al Aqsa in Gaza City - after intensifying Israeli bombardments.\n\n\n\n\n\nDr Aziz has told SBS News that it has been an intense and horrifying experience.\n\n\n\n\n\n\"I don't think any person who is walking around in Australia can even begin to imagine the scenes that I've seen. Obviously I'm a doctor. I'm trained to see all sorts of things - we're not squeamish - but this has been next level. It's doomsday. You walk in and it's like an abattoir.\"\n\n\n\n\n\n——\n\n\n\n\n\nThe Palestinian envoy at the United Nations has pleaded for humanitarian aid access to Gaza during his address to the Security Council today.\n\n\n\n\n\nRiyad Mansour told the Council that women and children ... are the primary targets of Israeli military action in Gaza, and ... are the most vulnerable.\n\n\n\n\n\nMr Mansour's address came a day after France, Andorra, Belgium, Luxembourg, Malta, and Monaco announced or confirmed their recognition of a Palestinian state which the international community hopes will give momentum to a two state solution and ultimately see peace in the Middle East.\n\n\n\n\n\n\"Mr President, the Palestinian people have suffered from the denial of their existence for decades. Now they are being confronted yet again with an attempt to destroy our nation altogether. Recognition of the state of Palestine is an affirmation that the world rejects such denial, rejects the attempts at our destruction and supports our right to existence, our right to self-determination.\"\n\n\n\n\n\n——\n\n\n\n\n\nThe ABC has been fined $150,000 for unlawfully sacking journalist Antoinette Lattouf, after she shared a Human Rights Watch post on Gaza.\n\n\n\n\n\nThe penalty has been levied in the Federal Court, which found the public broadcaster breached workplace law when it sacked Ms Lattouf from her casual role on ABC Radio Sydney's Mornings program in 2023.\n\n\n\n\n\nThe ABC has 28 days to pay the fine, which comes in addition to the $70,000 in damages she was previously awarded.\n\n\n\n\n\n——\n\n\n\n\n\nTo sport and in cricket news, England has named 16 players for its five-test series with Australia that begins in November.\n\n\n\n\n\nChris Woakes, whose last act as an England player was to bat with a dislocated shoulder on the dramatic last day of the England-India series has not been included.\n\n\n\n\n\nThe selections mean the English will come to Australia with a battery of pace bowlers to spearhead their attempt to regain the Ashes but with questions over their batting line-up and the fitness of several players.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/grand-slam-prizemoney-could-hit-500-million-in-new-push-by-players-20250925-p5mxr7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Grand slam prizemoney could hit $500 million in new push by players",
    "publish_date": "Thu, 25 Sep 2025 11:44:14 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder"
    ],
    "text": "Jannik Sinner, Aryna Sabalenka, Coco Gauff and Carlos Alcaraz are among a group of top-10 tennis players who have sent a second letter to the four grand slam tournaments asking for more money, more control and greater contributions to pension, health and maternity benefits.\n\nThe players are asking for their share of prizemoney at grand slams to increase from 16 to 22 per cent of tournament revenue by 2030, which would see the Australian Open prize pool exceed $100 million and the US Open surpass $150 million.\n\nAryna Sabalenka and Jannik Sinner are among the top players who have written to grand slam organisers. Credit: Getty Images\n\nThe combined prize pool across the four slams in 2025 was $440 million. That number could exceed $500 million by 2030 if tournament organisers continue incremental rises each year and agree to what players are asking for.\n\nThe letter, which was signed by other top players such as Iga Swiatek, Jack Draper, Amanda Anisimova, Frances Tiafoe and Ben Shelton, is the second of its kind, with Novak Djokovic the sole signatory on an original letter sent to the grand slam tournaments in March.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/see-you-in-england-push-for-cronulla-star-to-make-australian-debut-20250925-p5mxsu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "See you in England: Push for Cronulla star to make Australian debut",
    "publish_date": "Thu, 25 Sep 2025 11:44:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Cameron Smith, the man regarded as rugby league’s greatest-ever dummy-half, has hailed Cronulla’s Blayke Brailey “the form hooker in the NRL”, and a player who deserves to head to the Ashes series as the Kangaroos’ back-up No 9.\n\nWhile Sunday’s Broncos-Panthers clash is doubling as an Australian fullback audition for Reece Walsh and Dylan Edwards, Friday night’s battle of the hookers featuring Brailey and Melbourne’s Harry Grant will be just as fascinating.\n\nBrailey is yet to play Origin football for NSW, but Smith knows the 27-year-old and Cronulla captain is good enough to wear the green and gold.\n\nSmith said Brailey had leapt ahead of Roosters-bound Reece Robson, who was the back-up hooker for Australia during last year’s Pacific Championships.",
    "source": "TheAge",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bellamy says Jahrome Hughes will play in preliminary final",
    "publish_date": "Thu, 25 Sep 2025 11:42:38 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Michael Chammas",
      "Billie Eder",
      "Dan Walsh"
    ],
    "text": "Meninga’s oversized guard became the stuff of legend but wouldn’t be allowed anywhere near a footy field today. “I was at Canberra when Mal used to wear that guard and no one was game to near him at training in case you copped it,” Bellamy said with a laugh. “But Hughesy’s [guard] is a fair bit thinner than Mal’s was.” Bellamy also praised the toughness of second-rower Shawn Blore who will also return from a fractured larynx to play on Friday night. “That’s a pretty bad injury he got and he kept going in the game - he’s a pretty tough unit,” Bellamy said.\n\n“He was busting to get back. He kept ringing me and telling me that “I’m right, I’m right” but, obviously, I’m taking more advice from the medical people than him. We are confident he has recovered.” The Storm thumped the Sharks 30-6 when they last met at AAMI Park in June but the Sharks have won nine games out of 10 since including knockout final wins over Sydney Roosters and minor premiers Canberra Raiders. So the Sharks will come in fired up as will a sellout crowd hoping to see the Storm progress to another grand final. “I don’t know who wrote them off. They finished fifth,” Bellamy said. “To beat the Roosters and then beat Canberra in Canberra - we know they are in good form, but we are just concerned with what we need to do and how we need to do it.”\n\nBellamy felt for Pezet and several other Storm players who stepped up when key players were injured or suspended late this season. “It’s just the way the game is, it isn’t fair sometimes,” Bellamy said. The Storm hammered the Sharks but it kick-started Cronulla’s season Roy Ward The last time Cronulla trudged off AAMI Park they were at their lowest point of the season.\n\nSince that 30-6 round 17 loss to the Storm, the Sharks have won nine of 10 games, including two knockout finals, and are now just one win away from the NRL grand final. The only problem is that the team standing between them and the NRL decider is the Storm, who they take on at AAMI Park in a preliminary final on Friday night. Sharks playmaker Braydon Trindall remembers that night in June well, and how it galvanised his team to turn their season around. “I think we were all just sick of letting the year slip away from us,” Trindall recalled on Wednesday. “So we sat down and had a good talk about it and went out on the field and changed some of the actions that were hurting us.\n\n“I think it was more of a club thing and everyone wanted to put in a bit more, and now look where we are.” The Storm hammered the Sharks last time they met in Melbourne. Credit: Getty Images Trindall has carried an eye issue through recent games after taking a knock against the Sydney Roosters earlier in the finals, but while there is some visible blood, he said it had no impact on his vision. “I copped a boot against the Roosters, but it’s starting to heal now,” he said. The Storm have plenty of respect for Trindall’s kicking game and the threat it poses, but he knows accuracy is the key given the height and catching ability of Storm wingers Xavier Coates and Will Warbrick.\n\n“It’s good when you have some good chases on the end of the kick,” he said. “Will is a good leaper, so there will be a bit of a challenge there. It doesn’t really change things. I might shorten the kicks up a bit so they have to run a bit more, but we’ve got some good catches as well so I won’t change much.” Knights approach premiership-winning half to work as attack consultant Michael Chammas The Newcastle Knights have reached out to three-time premiership-winning playmaker Luke Keary about a role with the club as an attack and halves consultant from next season. Former Roosters playmaker Luke Keary could be heading to Newcastle. Credit: NRL Photos\n\nThe Knights are in the process of restructuring their coaching staff and have made the bold move to approach the recently retired Catalans pivot to gauge his interest in joining the club. Keary worked with both new coach Justin Holbrook and director of football Chris James at the Sydney Roosters and is highly regarded as one of the smartest players in rugby league. Keary, who spent this season with Catalans in the Super League after finishing his NRL career at the Sydney Roosters in 2024, is weighing up the opportunity. The 33-year-old wants to spend the summer travelling with his young family but is said to be keen to discuss the opportunity to link with the Knights. Newcastle are keen to add some specialised coaches to their ranks and believe Keary would be a huge asset to help work with recruits Dylan Brown and Sandon Smith, as well as incumbents Fletcher Sharpe and Kalyn Ponga.\n\nNewcastle’s attack struggled to fire in 2025 under the guidance of attack coach Blake Green, who missed out on the job as Adam O’Brien’s successor to Holbrook. Keary doesn’t have a job lined up at the Sydney Roosters, who themselves will welcome back Jared Waerea-Hargreaves in an official capacity to work with the club’s younger players in 2026. ‘Still a bit to get through’: Storm star no certainty to face Sharks Roy Ward Melbourne Storm playmaker Jahrome Hughes still has some training sessions to get through before he can be cleared to play in the preliminary final on Friday night.\n\nThe reigning Dally M Medallist is recovering from a fractured forearm and racing against time to prove his arm has healed enough to take on Cronulla AAMI Park for a spot in the grand final next week. Hughes was named in Melbourne’s extended squad on Tuesday in the hope he is fit to play by game day. Back-rower Shawn Blore (fractured larynx) and fullback Ryan Papenhuyzen (concussion) were also named but could still be left out if they aren’t ruled fit to play. Storm captain Harry Grant said Hughes was looking good at training, but the club’s tougher sessions were still to come before Craig Bellamy and his staff make a final call on selection. “He’s been training pretty well and getting through what he has to do, but he still has a fair few things to get through with the week and how it builds up,” Grant said on Tuesday. “It’s good for Hughesy, it’s good for the team, but there is still a bit to get through.”\n\nHughes has remained optimistic about a return on Friday night but the Storm’s medical team have been more measured as the team does not want Hughes to re-injure himself. Jahrome Hughes after his wrist injury. Credit: Getty Images Young playmaker Jonah Pezet, who was also named in the squad, starred in the Storm’s qualifying final win against the Bulldogs, and will be ready to start at halfback should the Storm decide Hughes is not ready. Grant said Hughes’ passing game was looking good meaning the questions would be around his fitness and strength. “When I throw him some shockers [bad passes], that makes it harder for his forearm,” Grant joked. “But I don’t think it [the injury] has changed any of that.”\n\nPapenhuyzen missed the qualifying final win over Canterbury with concussion, but his return to the No.1 jersey would see Nick Meaney shift back to the centres after filling in at fullback. Adam Reynolds and Ezra Mam at Broncos training on Tuesday. Credit: Getty Images Meanwhile, captain Adam Reynolds will return at halfback for the Broncos alongside new super-sub Ezra Mam against Penrith in Sunday’s grand final qualifier. Both return from five-week lay-offs to a side unbeaten since the pair suffered hamstring injuries in round 23 against Melbourne. Reynolds said he was now “100 per cent” fit and ready to perform at No.7 after a minor training setback three weeks ago.\n\nMam has moved well at training the past week and done enough to convince coach Michael Maguire he is ready to shine. Instead of starting, the plan is for Mam to be injected into the match when fatigue sets in among his teammates, and utilise his renowned footwork to trouble the middle forwards and Penrith’s edge defence. The Panthers will remember how dynamic Mam can be after his hat-trick of tries in the 2023 grand final, won 26-24 by Penrith. Mam and Reece Walsh combined for one of those tries in a lethal one-two punch. “I am just really excited for him and to rub shoulders with him again on the field,” Walsh said. “I feel like we have a really good connection and a really good instinct about each other. I’m just ready to go after it with him.” with AAP\n\nPanthers duo shrug off injury worries ahead of Broncos showdown Dan Walsh and Billie Eder Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury. Martin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest. The 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals.\n\n“They’re all right now,” Martin said of his ribs after full-time. “There was a bit of carry-on there. It’s a bit sore at the moment, but they’re all right. I landed on the ball, and ‘Kiks’ is a pretty big man, and he landed on me. I was a bit winded, but I’m all right now. “It crossed my mind at first [that a serious injury may have occurred], but after a while I was like ‘it’s all right, I’m being a sook again’.” Liam Martin is helped from the field at Accor Stadium. Credit: Getty Images Martin won last year’s Clive Churchill medal against Melbourne despite playing through the pain of a popped rib cartilage in the 2024 grand final. He also required painkilling injections for almost the entire season to manage an ongoing AC joint injury in his shoulder, which he has battled again in recent weeks.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/the-dumplings-from-this-south-coast-food-truck-are-a-must-try-on-your-next-road-trip-20250924-p5mxkx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The dumplings from this South Coast food truck are a must-try on your next road trip",
    "publish_date": "Thu, 25 Sep 2025 11:41:23 +1000",
    "category": "finance",
    "authors": [
      "Bianca Hrovat"
    ],
    "text": "Advertisement\n\nReview Eating outNowra The dumplings from this South Coast food truck are a must-try on your next road trip Hidden behind a Nowra pawn shop, Fatty Dumpling serves the kind of Chinese street food you’d expect to find in cyberpunk Chongqing, rather than in regional NSW. Bianca Hrovat September 25, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 9 Weiqing “Elvina” Yang serves some of the best dumplings you’ve ever tasted. Janie Barrett 2 / 9 Barbara noodles (wan za mian). Janie Barrett 3 / 9 Seating at the Fatty Dumpling, Nowra. Supplied 4 / 9 Fatty Dumpling, Nowra. Supplied 5 / 9 Zhong dumplings. Janie Barrett 6 / 9 The sitting area at Fatty Dumpling, Nowra. Supplied 7 / 9 Weiqing “Elvina” Yang in her food truck Fatty Dumpling Janie Barrett 8 / 9 Mum’s beef soup noodles. Janie Barrett 9 / 9 Fatty Dumpling, Nowra. Supplied Previous Slide Next Slide Chinese$$$$ Do you remember the last time you were on a road trip, your stomach clawing with hunger, and you succumbed to a lukewarm pie at the nearest servo? It felt a bit bleak, didn’t it, parking beneath the fluorescent lights to rip open the plastic wrapping? Fighting to keep the gelatinous meat from oozing onto your lap. As you drive south through the Shoalhaven region and enter Nowra, the Princes Highway becomes a smorgasbord of sad pies and fast food outlets. It’s one chain after another, and nothing to indicate that, at a fairy-lit concrete lot behind a pawn shop, there’s a food truck serving some of the best dumplings you’ve ever had the pleasure of eating. Weiqing “Elvina” Yang in her food truck Fatty Dumpling Janie Barrett\n\nAdvertisement\n\nThis is Fatty Dumpling, where owner-cook Weiqing “Elvina” Yang serves the kind of street food you’re far more likely to find in Chongqing – the cyberpunk megacity in China’s mountainous south-west – than in regional NSW. It’s rich, warming and gloriously textural stuff: silky dumplings glossed in chilli oil; slow-braised spiced pork served tongguan roujiamo-style in a crisp golden bun made of layered, laminated dough; and beef soup noodles, tightly coiled in a pool of garlic-heavy red Sichuan heat. For Yang, this is the taste of home. It was the comfort food she turned to during the COVID pandemic, when international borders closed and the “couple of days” she’d planned to stay in Shoalhaven turned into a couple of years. “I’ve always loved food – Chinese food, my hometown’s food – but there was nothing like [that] around Shoalhaven,” Yang says. But first, she had to learn how to cook.\n\nAdvertisement\n\nYang, who formerly worked in sales, crowdsourced her first zhong dumpling recipe over phone calls with her grandparents (and friends’ grandparents) back home in Zunyi, in Guizhou province. The dish originated more than a century ago in Chengdu, the capital of neighbouring Sichuan, and it was the first dish on the menu when Fatty Dumpling launched as a pop-up market stall in 2023. “I had to experiment because [the ingredients] here were so different, but eventually, I was able to combine everything I learned and develop my own recipe,” Yang says. “I invited all of my friends to try it … because I wanted to create flavours that were not just authentic, but also approachable.” The dumplings are delicate crescent moons filled with minced pork, boiled and served with a deep red sauce – part chilli oil and part sweet soy, pulsing with garlic and spice. There’s an undercurrent of heat, more pleasant hum than scream, that compels you to keep eating, and eating, until somehow your plate is empty and, damn, maybe you should have ordered eight dumplings instead of five.\n\nAdvertisement\n\nI’m not their only fan. By 2024, Fatty Dumpling became so popular that Yang went all in, leasing and transforming an empty lot in Nowra’s industrial precinct into a sun-beaten oasis, with a shiny silver trailer, potted cacti and an eclectic collection of weather-worn furniture, shaded by striped umbrellas and illuminated with string lights. It’s a casual, seat-yourself affair with counter service and a small selection of canned soft drinks. Yang mostly works alone, sound-tracked by funk music on a Bluetooth speaker. She takes orders, cooks food, and shouts directions at customers: “You have to mix it!” she tells a woman, starting on a bowl of “Mum’s” beef noodle soup. “That’s the only way you can taste all the flavours!” Mum’s beef noodle soup doesn’t come from Yang’s mother, it should be said. In 2024, she returned to China for a research trip to Chongqing, navigating the city’s vertical sprawl to find the best noodle shop. Barbara Noodles (wan za mian). “I met a gentleman [Pang Shifu] who had been in this little shop for over 40 years, and I stayed there for a few days while he taught me his signature dishes – his mum’s beef noodle soup and his [wan za mian] noodles, with all the secret ingredients,” Yang says.\n\nAdvertisement\n\nThe wan za mian are sold at Fatty Dumpling as “Barbara noodles” and they’re deliciously easy to enjoy: thin wheat noodles ladled with velvety yellow peas, sesame seeds, and brothy minced pork, balanced by bright, just-steamed greens and spring onions. The bowl is light, earthy and creamy – all the elements of a bestseller, as Yang predicted. Weiqing “Elvina” Yang. Janie Barrett What she didn’t predict was the impact cooking would have on her. It’s been one year since Fatty Dumpling opened its permanent home, and in that time, she’s developed a community of customers, regulars and close friends. “Food is connection. I didn’t grow up in Australia, I grew up in China, and I’m proud of where I come from,” Yang says. “I wanted to give people the opportunity to know what authentic Chinese food is because that’s my food. “When I see them eat my food and smile, it makes me so happy. It makes me feel accepted by locals, and accepted by this place. That’s really important to me.”\n\nAdvertisement\n\nThree other places to eat in Nowra and surrounds Hyper Hyper Coffee A rustic shed made of corrugated iron, where both locals and visitors queue for house-roasted coffee made on vintage Italian espresso machines. Try the Portuguese tarts, flaky and fresh, or head next door for brekkie at Punch the Ploughman. 85 North Street, Nowra, hyperhypercoffee.com.au Black Cede Gunyah Order the strawberry gum scones with native jam and whipped cream for morning tea at this bush food cafe led by First Nations women. It’s a beautiful space to spend some time, and you can pick up Indigenous spices for home cooking. 39A/43 Kinghorne Street, Nowra, blakcede.com.au Ramox Cafe Located inside the visually stunning grounds of Bundanon Art Museum, Ramox serves a creative take on seasonal Shoalhaven produce. The fried Tilba halloumi with pickled rhubarb, green olive and fennel is quite special with a glass of natural sparkling from Orange winery Tamburlaine. 170 Riversdale Road, Illaroo, bundanon.com.au Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/europa-league-live-ange-postecoglou-begins-his-title-defence-with-a-different-club-20250924-p5mxkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Postecoglou still chasing first Forest win, but Angeball is back",
    "publish_date": "Thu, 25 Sep 2025 11:41:21 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Angeball is back. And surely, very soon, the results will reflect that accordingly.\n\nOn face value, it’s been a tough start for Ange Postecoglou at Nottingham Forest: a 3-0 hiding away to Arsenal in his first match in charge, a gutting 3-2 defeat to Swansea in the Carabao Cup, then a 1-1 draw against newly promoted Burnley.\n\nThe first win of this new era should have come on Thursday morning (AEST) in Seville against Real Betis. They deserved to win; Forest were comfortably the better team, creating the better chances, threading together the better passages of play. If you’re a believer in “expected goals”, then you can take further comfort in those numbers: Postecoglou’s men generated 3.27xG to just 0.49\n\nAnge Postecoglou is confident the wins will come. Credit: AP\n\nBut in reality, you have to turn expected goals into actual goals. And the sooner that Forest’s frontline heeds that lesson, the sooner Postecoglou’s critics will give him due credit for what he has built in the 16 days since his appointment.\n\nThe bones of a classic Postecoglou team are there already, and that’s no mean feat given the team he inherited, the way they used to play, and the circumstances in which he replaced his beloved predecessor, Nuno Espirito Santo.\n\n“I thought our football was outstanding at times in the first half,” Postecoglou said post-match.\n\n“The only thing I could fault is we didn’t put the game to bed. We should have really finished them off in the first half. There won’t be many teams that come here and dominate like we did in that period. We just needed a third goal.”\n\nCoached by the wily Manuel Pellegrini, Real Betis finished sixth in La Liga last season. And though they were missing a handful of their top-choice players, the trip to face them at the Estadio La Cartuja was, arguably, the toughest of Forest’s eight initial fixtures in the Europa League, as they mark their return to continental football after a 30-year absence.\n\nAnge Postecoglou celebrates with Igor Jesus. Credit: AP\n\nTo come away with a 2-2 draw, then, isn’t awful. But it is deflating.\n\nComing back from a goal down after Cedric Bakambu opened the scoring for the hosts after just 15 minutes, Forest’s next half-hour was, at times, genuinely awe-inspiring. It was the most vivid display of Angeball in recent memory; certainly much better than anything Tottenham Hotspur produced in Postecoglou’s last six or so months in that job.\n\nThe passing was crisp, the movement superb, the pressing relentless, and the energy high despite oppressive heat and humidity. Fans on social media described it as the best attacking football they’d seen from their side in ... forever.\n\nThree minutes after Bakambu’s opener, Igor Jesus became the first Forest player to score in Europe since 1996, capping a cracking left-to-right move by turning in Morgan Gibbs-White’s pass across goal from point-blank range.\n\n“I think the moments like the first goal, when they are constructed like that, are what make our game so beautiful,” Postecoglou said.\n\nThen, five minutes later, he headed in a corner kick to make it 2-1 and further stamp his claims to become Postecoglou’s first-choice striker.\n\nThe Brazilian, who joined Forest from Botafogo for a reported £10 million in the off-season, had two further chances to make it a hat-trick, while Callum Hudson-Odoi also hit the post during their breathtaking purple patch. So it could have been, without hyperbole, 5-1 at the break.\n\nBut there was always a danger that a one-goal lead would not be sufficient, and so it proved. Partly due to the conditions, and partly due to the withdrawal at half-time of midfielder Douglas Luiz - who Postecoglou said had “felt” his hamstring - Forest’s grip on the match loosened. Still, they dealt well with whatever Betis threw at them, which wasn’t much.\n\nMorgan Gibbs-White salutes the travelling fans. Credit: Getty Images\n\nFive minutes from full-time, however, came the sucker-punch. Teed up by substitute Marc Roca, Antony hammered in the equaliser at the back post, and the approximately 3000-odd travelling fans were left shattered.\n\nLoading\n\n“I’m just disappointed the players and the supporters don’t get the rewards for our efforts. I’ve just got to make sure they keep their heads up because there’s plenty to be positive about,” Postecoglou said.\n\n“And the wins will come, if we keep playing our football like that.”\n\nHe’s not wrong, but words alone won’t convince the doubters, even though everyone on the inside seems to have bought into what he’s trying to do. For external, vibes-based reasons, more than anything else, Postecoglou badly needs a win - and it needs to come in Sunday’s clash (2.30am AEST) against Sunderland at home, or else the voices against him will get louder and more confident.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-renowned-brisbane-party-boat-up-for-auction-with-bidding-starting-at-just-9-20250924-p5mxl4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Dog missing after fire razes house | Renowned Brisbane party boat up for auction",
    "publish_date": "Thu, 25 Sep 2025 11:33:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "Aldi has beaten out Coles and Woolworths in a comparison for having the cheapest home-brand staples, according to testing from consumer group Choice.\n\nAs part of its ongoing quarterly surveys of nationwide supermarket prices, Choice’s latest comparison exercise tracked the cost of a basket comprising home-brand versions of cream cheese, thickened cream, puff pastry, frozen mixed berries, tomato paste, spaghetti, tomato sauce and soy milk.\n\nAldi has beaten out Coles and Woolworths in a comparison for having the cheapest home-brand staples, according to testing from consumer group Choice. Credit: Oscar Colman, Louie Douvis\n\nThe total cost of the basket was cheapest at Aldi stores, at $20.08, followed by Coles at $21.30, Woolworths at $21.40, and IGA at $23.89, according to the survey that was conducted across 104 individual supermarkets in 27 locations across Australia in June.\n\nChoice also studied the freshness of strawberries from the four supermarkets, with surveyors assessing the state of the berries on day one and again on day five while storing them in their original punnets in a fridge’s crisper drawer.\n\nColes’ strawberries were deemed the freshest, with 100 per cent of punnets showing no signs of decay on day one and 58 per cent showing no signs of decay by day five. In contrast, 50 per cent of punnets purchased from IGA showed no signs of decay after one day, while just 25 per cent showed no signs of decay after five days.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-game-we-ve-all-been-waiting-for-how-the-battle-between-cats-and-lions-will-be-won-20250924-p5mxmv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The game we’ve all been waiting for: How the battle between Cats and Lions will be won",
    "publish_date": "Thu, 25 Sep 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Jimmy Bartel"
    ],
    "text": "Their development program under former Lions great Nigel Lappin continues to identify and produce high-level AFL players from unlikely origins. Fourteen Cats in their preliminary final win over Hawthorn were selected with picks outside the top 30 of the draft. Most of them, in fact, were rookie or category B selections. Cats coach Chris Scott’s ability to move and adjust with the game, year after year, and more importantly week after week, is why he is so often rated among the greatest all-time AFL coaches. Quality: Lions forward Zac Bailey. Credit: AFL Photos via Getty Images The craftsmen Small and mid-sized forwards can be hugely influential on grand final day. Just look at how often the Norm Smith Medal goes to one of these players, and how well-stocked both these teams are.\n\nThe Lions and Cats both have a battalion of crafty forwards who have a huge influence on their matches each and every week. With the quality quartet of Zac Bailey, Charlie Cameron, Kai Lohmann and Cam Rayner, the Lions probably have a slight edge in forward-50m work and direct scoreboard impact. Although not tall, all four are strong overhead and capable of being played one-out as a deep forward, meaning they pose a constant threat to their opposition. You just can’t take your eyes off these four for a moment; even when they look like they’re having a quiet day, any one of them could spring to life and turn a game Brisbane’s way, as they’ve done so many times before. Geelong’s smaller forwards are just as impactful, but in a slightly different way. Tyson Stengle is the Geelong small who likes to play closer to goal; more like a typical forward pocket than Gryan Miers, Bradley Close or Shaun Mannagh. Those three provide the Cats with drive and connection. They each have an enormous work rate, which they use to get up the ground and provide their team with a linking option as the Cats surge forward off half-back. All of them are excellent kicks inside their team’s forward 50m and regularly get involved in Geelong’s scoring chains.\n\nHarass Andrews The Lions have the best defender in the grand final and the Cats have the best forward. But don’t expect this game to be a throwback to the old days; there’s little chance of Harris Andrews and Jeremy Cameron playing head-to-head on each other for long stretches of the match. Ryan Lester is the ultimate team man for the Lions. He is likely to get first crack at Cameron and will be comfortable if the Cat’s superstar is taking marks up on centre wing and beyond. Lions defender Harris Andrews will be crucial to the contest. Credit: Getty Images The Cats might instruct Shannon Neale to use his running power to get in behind Andrews, or maybe recruit Jack Martin will be given the task of helping bring the ball to ground. Whatever the plan, Geelong’s mission against Andrews will be crystal clear: don’t let him mark the footy.\n\nIf they can stop him doing that, the Lions ability to rebound from defence will be seriously curtailed. The taskmasters Look out if the ball spills between Brisbane’s Josh Dunkley and Geelong’s Tom Atkins on Saturday. They are two of the most ferocious and selfless players in the AFL. In fact, only Brownlow medallist Matt Rowell (214) sits between Atkins (226 in first place) and Dunkley (third with 213) on the leaderboard of AFL tacklers in 2025. Tom Atkins is one of the most selfless and ferocious players in the AFL. Credit: Getty Images These two provide the quality control for their team at clearances and in contested situations. The grunt work they do is what allows their more heralded teammates to shine.\n\nIf Lachie Neale overcomes his calf injury and plays in the grand final, I expect Atkins will get the job of making sure the dual Brownlow medallist has limited impact on the contest, while still being tasked with driving the Cats forward, like he did in the preliminary final against Hawthorn. It’s not as easy to predict what Dunkley’s role will be. I’ll be intrigued to see who Fagan assigns him to. Will it be one of Geelong’s dash brothers – Bailey Smith or Max Holmes – or will he get the job of being kryptonite to the man who impersonated Superman for the Cats last week, skipper Patrick Dangerfield? Speaking of players being given assignments, Geelong have two magnificent Irishmen, Mark O’Connor and Oisin Mullin, who are both likely to lock onto a Lions playmaker. The question is, will they be asked to repeat the roles they carried out so successfully at in their team’s qualifying final win over the Lions – O’Connor on Rayner and Mullin on Hugh McCluggage – or will Scott have another match-up in mind this time around? It’s all part of what makes grand finals so special and intriguing – there will be match-ups all over the ground that could shape the result.\n\nIn the shoes of the coaches Putting myself in Chris Fagan’s shoes my message to the Brisbane Lions players before they run out is simple: “Be brave with the ball in hand, like you’ve been all season. Take risks. Kick the ball with dare up the middle of the MCG, and test the Cats with your ball movement. This has been the formula for success against them all season. It’s all about attitude. Yes, you will turn the ball over occasionally, we’ll cop that. You simply must keep attacking them and going for your kicks. We can’t let their back line get settled. That’s what they want, especially without Tom Stewart, so let’s break through and strike before they’re ready.” Premiership coach Chris Scott. Credit: Getty Images If I were Chris Scott, this would be my pre-game missive to the Cats:\n\nLoading “We must repeatedly outnumber them at the contest and spread from there. This is how we swung the momentum against the Hawks last week, and it’s how we’re going to beat the Lions. Speed on the ball is our friend. If we can take care of the contest first, we have the players and the running power to capitalise. Brisbane might be potent, but they won’t be able to keep up with us if we win enough ball at the contest and spread from there.” My tips Surprise, surprise you might say, I’m tipping the Cats in what I’m hoping will be an epic grand final. These teams have the talent, the appealing game styles and coaches with the tactical acumen for this to be a grand final for the ages; one that we will talk about for years to come. So for me, it’s the Cats by three points, with Mannagh to be the Norm Smith medallist.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/watergate-the-kennedys-and-how-the-american-dream-took-a-trumpian-turn-20250923-p5mxd3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Watergate, the Kennedys and how the American dream took a Trumpian turn",
    "publish_date": "Thu, 25 Sep 2025 11:28:00 +1000",
    "category": "finance",
    "authors": [
      "Tony Wright"
    ],
    "text": "Eighteen was the great trophy when I was young: a driving licence, a drink in a pub without looking over the shoulder, the end of high school. Liberation. Somewhere along the track, birthdays discard their gloss until eventually, there comes the ticking down and the looking back. A long time ago, my father was celebrating his 80th birthday when he drew me aside. “Son,” he began, whispering. “I know the years tell my age, but I don’t feel I’m much older than I was when I was about 25 or 30. Does it ever feel like that to you?” “I think everyone feels that at some point,” I told him. “That’s a relief,” said my father, expelling a great sigh. “I thought I was the only one.”\n\nBarry Humphries, comedian, author and satirist, said something similar. Loading “It’s a totally unfamiliar experience. You don’t notice it, you see,” he said of growing old. “I find growing old is sad only in the sense that the world looks exactly the same as it did when I was young.” The world doesn’t look anything like what it seemed when I was young, it happens. But Humphries and my father were talking about something more poignant: that age had rendered them all but invisible within a world they still saw in the colours of youth.\n\nMy mate and I were talking about something different again as we discussed our excursions into the past to avoid the present. For a moment or two, we hit upon the sweet, moody memory of the 1973 movie, American Graffiti. It was set in small-town America over a single night in 1962, when a group of high school graduates, about to fly off to new lives, paid reluctant farewell to their teenage years, cruising the main street and confronting uncertainty about the future. Its soundtrack of rock ′n’ roll, doo-wop, early surf music and ballads overlaid by the voice of the late US radio DJ, Wolfman Jack, still has the power to overwhelm listeners of a certain age. My mate and I did not live in small-town America in 1962, but its central theme of innocent longing resonates among those of us who were young even in Bob Menzies’ less exciting Australia.\n\nAmerica’s sense of moral certitude – and by extension, the Australia that relied so heavily on US supremacy – was shattered the following year when president John F. Kennedy was assassinated. Loading The culture of the 1960s became dominated by an increasingly meaningless war in Vietnam in which 1.3 million civilians and military died (most of them Vietnamese, though almost a quarter of a million were Americans and their allies, including more than 500 Australians). In 1968, both Martin Luther King Jr and Bobby Kennedy were assassinated. All these years later, that once-great nation that had such a cultural impact on the West, including Australia, has devolved to the point its president and his family openly enrich themselves while sooling the tamed Justice Department onto political enemies, universities, liberals, media companies, journalists and satirists.\n\nThis same president, turning his back and his ire onto oppressed peoples everywhere, spouts dangerous, utterly uninformed nonsense linking a common painkiller with autism, standing next to a black-sheep Kennedy with no scientific or medical background who as the US Secretary for Health (!) is undermining decades of the fight against communicable diseases by spouting more nonsense about vaccines. Loading As my mate and I continued our quest for sporadic havens, we inevitably got to the pleasures of watching the footy. But the AFL has lost its mind, we decided. How else to interpret the pro-women and anti-homophobic league’s decision to pay American rapper Snoop Dogg $2 million to entertain the crowd at the grand final?\n\nHere is a fellow who built his career on the most vilely misogynistic lyrics and who has a history of homophobia, however much he claims to have cleaned up his act in recent times. Maybe he understands hypocrisy. Why, having declared in 2017 he would roast any black artist who performed for Donald Trump’s inauguration, he performed himself at the inaugural Crypto Ball in Washington on January 17 this year. It billed itself as an event “intended to honour the 60th Presidential Inauguration, America’s first ‘crypto president’, President-elect Donald J. Trump, his incoming cabinet and administration”.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/traveller/travel-news/wider-seats-bigger-bins-new-qantas-airbus-first-flight-takes-off-20250922-p5mwxu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wider seats, bigger bins: New Qantas Airbus’ first flight takes off",
    "publish_date": "Thu, 25 Sep 2025 11:11:37 +1000",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\nTravel newsAir travel Wider seats, bigger bins: New Qantas Airbus’ first flight takes off Katherine Scott Updated September 25, 2025 — 11:11am , first published September 25, 2025 — 5:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nKey points The first two of Qantas’ new A321XLR fleet enter commercial service from September 25, 2025\n\nThe new aircraft are part of the airline’s biggest domestic fleet renewal to date, Project Winton\n\nThe first seven A321XLRs will replace Qantas’ ageing Boeing 737s\n\nThe new aircraft feature larger windows, wider seats, fast, free Wi-Fi, a reduction in aircraft noise and 60 per cent more overhead storage than the Boeing 737\n\nThe airline will take delivery of a further seven A321XLRs before the end of the financial year\n\nQantas customers may note some nifty new features on board domestic flights from Thursday as the first two of its new Airbus A321XLR aircraft enter commercial service, part of the Qantas Group’s multibillion-dollar fleet overhaul. The long-awaited next-generation planes, christened Outback Way (VH-OGB) and Great Ocean Road (VH-OGA), took to the skies on Thursday with an inaugural Sydney-Perth (departing at 11.07am, a little over half an hour late) and Sydney-Melbourne service in the evening (6.50pm). The inaugural Qantas A321XLR flight on the Sydney to Perth route takes off on Thursday. The new planes will replace Qantas’ ageing Boeing 737s, and feature wider economy seats, larger windows and fast, free Wi-Fi. The aircraft also addresses a common passenger pain point: new larger overhead bins feature 60 per cent more baggage space. Last month, Qantas announced orders for an additional 20 A321XLRs, taking its total Airbus orders to 48 aircraft, in a bid to accelerate its fleet renewal program.\n\nAdvertisement\n\nCrucially, the highly efficient single-aisle planes can fly 8700 kilometres – more than 3000 kilometres further than the 737 (the “XLR” in the A321’s name stands for “extra long range”) – opening up more domestic and short-haul international routes for the airline, while taking pressure off existing crowded routes. While new international routes are yet to be confirmed for the A321XLR, Qantas domestic chief executive Markus Svensson said the extended range opened up the possibility of adding “destinations across South-East Asia and the Pacific Islands that are not viable with our current narrowbody fleet”. Qantas chief executive Vanessa Hudson has previously indicated the aircraft will lead to an increase in routes to South-East Asia. Perth-India is also a possibility. The A321XLR increases seat capacity to 197 passengers. Five metres longer than its 737 predecessor, and with lower carbon emissions per seat, the new A321XLR can carry 197 passengers. It has 20 business class seats (up from 12) and 177 economy seats (up from 162), marking an overall 13 per cent increase in seat capacity.\n\nAdvertisement\n\nThe additional capacity hasn’t eaten into space between seats; economy remains unaffected, while business customers come out ahead with 66 per cent more legroom. Business class seats include wireless charging pads and an extendable cocktail table. Business class seats have a pitch of 37 inches (94 centimetres), with a recline of five inches (12.7 centimetres) and a six-way adjustable headrest, calf rest and footrest, with a 2-2 configuration. The seats feature reddish-brown leather covers, wireless charging pads and dual USB A and C charging ports, as well as an extendable cocktail table and in-arm tray table with built-in tablet holder. Economy seats are wider than those in the 737s at 17.6 inches (44.7 centimetres), up from 17 inches (43.2 centimetres), with a pitch of 30 inches (76.2 centimetres), in a 3-3 configuration. Seats feature extra cushioning, six-way leather adjustable headrests, drop-down device holders, adjustable meal tables and dual USB A and C charging ports. Economy seats are wider than those of the 737s at 17.6 inches.\n\nAdvertisement\n\nThe redesigned seats incorporate new materials and a refreshed colour scheme, while the longer cabin’s higher ceilings and larger windows invite more natural light, creating a brighter, more spacious feel. Virgin Australia’s first Embraer 190-E2 aircraft touches down in Perth. While A321s flying domestic routes will not have seatback screens, Qantas has plans to configure 16 of the new aircraft with entertainment screens to service longer routes, including transcontinental flights from Perth, and short- and medium-haul international routes. Related Article ★★★★\n\nAirline reviews Your next international Qantas flight might be operated by this airline The launch forms part of the airline’s biggest domestic fleet renewal to date, Project Winton, announced in 2022 and much delayed due to COVID-related supply chain disruptions in securing parts.\n\nAdvertisement\n\nQantas is expected to take delivery of its third A321XLR aircraft, Seven Peaks Walk (VH-OGC), in November, with seven of the aircraft on track for rollout before the end of the financial year. In more good news for domestic flyers, Virgin Australia took delivery of its first Embraer 190-E2 narrow-body jet earlier this month. The new aircraft will primarily service charter routes, while supporting regional routes in Western Australia from next month, including destinations like Darwin, Kalgoorlie, Karratha, Port Hedland and Broome. The writer flew as a guest of Qantas.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/lifestyle/rom-coms-top-aussie-audiobook-charts-20250925-p5mxuv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rom-coms top Aussie audiobook charts",
    "publish_date": "Thu, 25 Sep 2025 11:09:31 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Rom-coms top Aussie audiobook charts\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/lifestyle/king-charles-rules-against-harry-s-royal-comeback-20250925-p5mxuk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles rules against Harry’s royal comeback",
    "publish_date": "Thu, 25 Sep 2025 11:08:22 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles rules against Harry’s royal comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/afl/tony-jones-unpacks-his-concerns-ahead-of-snoop-dogg-performance-20250925-p5mxuo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tony Jones unpacks his concerns ahead of Snoop Dogg performance",
    "publish_date": "Thu, 25 Sep 2025 11:04:04 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tony Jones unpacks his concerns ahead of Snoop Dogg performance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/queensland/where-to-watch-the-2025-afl-grand-final-in-brisbane-20250924-p5mxog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Where to watch the 2025 AFL grand final in Brisbane",
    "publish_date": "Thu, 25 Sep 2025 11:03:59 +1000",
    "category": "sports",
    "authors": [
      "Nick Dent"
    ],
    "text": "It’s Brisbane’s third consecutive AFL grand final and the Lions are looking to be back-to-back premiers in 2025. But not if Geelong have anything to say about it.\n\nThe 2025 Toyota AFL Grand Final starts at 2.30pm on Saturday, September 27, and supporters who haven’t made it down to Melbourne will need somewhere they can watch it live and loud.\n\nYour local pub can fit the bill, and there is also the official viewing site in New Farm. Be sure to settle in early: the pre-match entertainment at the MCG is headlined by Snoop Dogg, with support from Baker Boy, Vera Blue, Tash Sultana, Emma Donovan and Kee’ahn, as well as footy perennial Mike “Up There Cazaly” Brady.\n\nGetting in early on Thursday at New Farm Park was Greenslopes mum Anne Pattearson and her kids Madeleine and George.",
    "source": "TheAge",
    "cluster_id": 34
  }
]