[
  {
    "url": "https://www.9news.com.au/national/anthony-albanese-promises-further-power-bill-relief/05094902-6485-4ef7-afa3-ffda07c21cc0",
    "title": "Opposition pledges support for 'desperate act' $150 off power bills",
    "publish_date": "Sun, 23 Mar 2025 08:14:36 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "More energy relief is on the way with Prime Minister Anthony Albanese to shave a further $150 off power bills as part of a pre-election pitch to voters.\n\nThe centrepiece of last year's budget was the $3.5 billion in energy bill relief – a $300 rebate, spread over the course of the financial year, for every household in the country.\n\nThe Albanese government will now extend the subsidies until the end of 2025 with $150 in rebates automatically applied to electricity bills again, in quarterly instalments.\n\nMore energy relief is on the way with Prime Minister Albanese to shave a further $150 off power bills. (A Current Affair)\n\nAlbanese said the government's number one priority was helping the family budget.\n\n\"This is another cost of living relief measure that my Government is delivering for Australians while putting downward pressure on inflation,\" he said in a statement.\n\n\"Peter Dutton opposed the $300 energy bill relief to households. His only plan for energy is a $600 billion nuclear scheme that he will cut Medicare to pay for.\"\n\nThe opposition pledged to support the move but slammed it as a \"desperate act\".\n\n\"At some stage this Ponzi scheme the government is running where they pull money out of your pocket through taxes and then give it back to you and expect you to say thank you,\" Opposition Leader Peter Dutton said.\n\nAccording to Treasury estimates, the move will reduce headline inflation by around half of a percentage point, and reduce household bills by 7.5 percent on average nationally, compared to bills without the extension.\n\nThe Albanese government said the subsidies resulted in electricity prices falling by 25.2 per cent in 2024, but would have only dipped by 1.6 per cent without the rebates.\n\nThe extension of energy bill rebates will cost taxpayers $1.8 billion over the forward estimates.\n\nShadow Treasurer Angus Taylor called for savings to be made by sacking \"back offices\" public servants.\n\n\"We'll have to back this [electricity bill relief] otherwise Australians will go broke,\" Nationals leader David Littleproud said.\n\n\"This is the last desperate act of a government that has lost control of your power bill and your food bill.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/whroo-victoria--toddler-drowns-in-dam-in-small-town/5da978c3-5411-4dad-a491-aed9673185c6",
    "title": "Toddler drowns in dam on property in north Victoria",
    "publish_date": "Sun, 23 Mar 2025 08:34:12 +0000",
    "category": "sports",
    "authors": [
      "Mar"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/pope-francis-update-pontiff-appears-on-hospital-balcony-to-bless-crowd-in-first-public-appearance-in-battle-with-pneumonia/49d84783-36b5-48d8-964f-a9e40242df32",
    "title": "Pope Francis back home after life-threatening double pneumonia",
    "publish_date": "Sun, 23 Mar 2025 13:57:51 +0000",
    "category": "lifestyle",
    "authors": [
      "Mar"
    ],
    "text": "A weak and frail Pope Francis has returned home to the Vatican from the hospital after surviving a five-week, life-threatening bout of pneumonia, making a surprise stop at his favourite basilica on the way home before beginning two months of prescribed rest and recovery.\n\nThe motorcade carrying the 88-year-old pope entered the Perugino gate into Vatican City on Sunday morning (Sunday night AEDT), and Francis was seen in the front passenger seat wearing nasal tubes to give him supplemental oxygen.\n\nDuring the trip home from Gemelli hospital, Francis took a slight detour to bring him to the St Mary Major basilica, where his favourite icon of the Madonna is located and where he always goes to pray after a foreign visit. Francis didn't get out of the car, but handed a bouquet of flowers to the cardinal to place in front of the Salus populi Romani icon, a Byzantine-style painting on wood that is revered by Romans.\n\nPope Francis gestures as he appears at a window of the Agostino Gemelli Polyclinic in Rome, Sunday, March 23, 2025, where he has been treated for bronchitis and bilateral pneumonia since February 14. (AP Photo/Domenico Stinellis)\n\n﻿Before leaving the hospital, Francis gave a thumbs up and acknowledged the crowd after he was wheeled out onto the balcony overlooking the main entry. Hundreds of people had gathered on a brilliant Sunday morning to say goodbye.\n\n\"I see this woman with the yellow flowers. Brava!\" a tired and bloated-looking Francis said. He gave a weak sign of the cross before being wheeled back inside.\n\nChants of \"Viva il papa!\" and \"Papa Francesco\" erupted from the crowd, which included patients who had been wheeled outside just to catch his brief appearance.\n\nDoctors, who announced his planned release at a Saturday evening (early Sunday AEDT) news conference, said he needs two months of rest and convalescence, during which he should refrain from meeting with big groups of people or exerting himself. But they said eventually he should be able to resume all his normal activities.\n\nHis return home, after the longest hospitalisation of his 12-year papacy and the second-longest in recent papal history, brought tangible relief to the Vatican and Catholic faithful who have been anxiously following 38 days of medical ups and downs and wondering if Francis would make it.\n\n\"Today I feel a great joy,\" said Dr Rossella Russomando, a doctor from Salerno who didn't treat Francis but was at Gemelli on Sunday.\n\n\"It is the demonstration that all our prayers, all the rosary prayers from all over the world, brought this grace.\"\n\nPope Francis gestures as he appears at a window of the Agostino Gemelli Polyclinic in Rome, on Sunday, March 23, 2025. (AP Photo/Domenico Stinellis)\n\nPope is happy to go home\n\nAt the Vatican on Sunday, pilgrims flocked as they have all year to St Peter's Basilica to participate in the 2025 Holy Year. They swarmed St Peter's Square and progressed through the Holy Door in groups, while big TV screens in the square were turned on to broadcast Francis' hospital greeting live.\n\nNo special arrangements have been made at the Domus Santa Marta, the Vatican hotel next to the basilica where Francis lives in a two-room suite on the second floor. Francis will have access to supplemental oxygen and 24-hour medical care as needed, though his personal physician, Dr Luigi Carbone, said he hoped Francis would progressively need less and less assistance breathing as his lungs recover.\n\nWhile the pneumonia infection has been successfully treated, Francis will continue to take oral medication for quite some time to treat the fungal infection in his lungs and continue his respiratory and physical physiotherapy.\n\n\"For three or four days he's been asking when he can go home, so he's very happy,\" Carbone said.\n\nFaithful and nuns wait a Pope Francis appearing at a window of the Agostino Gemelli Polyclinic in Rome, Sunday, March 23, 2025 (AP Photo/Riccardo De Luca)\n\nTwo life-threatening crises\n\nThe Argentine pope, who has chronic lung disease and had part of one lung removed as a young man, was admitted to Gemelli on February 14 after a bout of bronchitis worsened.\n\nDoctors first diagnosed a complex bacterial, viral and fungal respiratory tract infection and soon thereafter, pneumonia in both lungs. Blood tests showed signs of anemia, low blood platelets and the onset of kidney failure, all of which later resolved after two blood transfusions.\n\nThe most serious setbacks began on February 28, when Francis experienced an acute coughing fit and inhaled vomit, requiring the use of a noninvasive mechanical ventilation mask to help him breathe. He suffered two more respiratory crises a few days later, which required doctors to manually aspirate \"copious\" amounts of mucus from his lungs, at which point he began sleeping with the ventilation mask at night to help his lungs clear the accumulation of fluids.\n\nPope Francis waves as he appears at a window of the Agostino Gemelli Polyclinic in Rome, on Sunday, March 23, 2025. (AP Photo/Andrew Medichini)\n\nHe was never intubated and at no point lost consciousness. Doctors reported he always remained alert and cooperative, though they say he has probably lost a bit of weight given a natural loss of appetite.\n\n\"Unfortunately yes, there was a moment when many were saying that he might not make it. And it was painful for us,\" said Mario Balsamo, the owner of coffee shop in front of Gemelli.\n\n\"Instead, today with the discharge, we are very happy that he is well and we hope he will recover soon and will recover his strength.\"\n\nPope Francis leaves in a car the Agostino Gemelli Polyclinic in Rome, on Sunday, March 23, 2025. (AP Photo/Marco Ravagli)\n\n'I'm still alive!'\n\nDr Sergio Alfieri, the medical and surgical chief at Gemelli who coordinated Francis' medical team, stressed that not all patients who develop such a severe case of double pneumonia survive, much less are released from the hospital. He said Francis' life was at risk twice, during the two acute respiratory crises, and that the pope at the time understandably lost his typical good sense of humour.\n\n\"But one morning we went to listen to his lungs and we asked him how he was doing. When he replied, 'I'm still alive,' we knew he was OK and had gotten his good humor back,\" he said.\n\nAlfieri confirmed that Francis was still having trouble speaking due to the damage to his lungs and respiratory muscles. But he said such problems were normal, especially in older patients, and predicted his voice would eventually return to normal.\n\nPope Francis waves as he appears at a window of the Agostino Gemelli Polyclinic in Rome, on Sunday, March 23, 2025. (Francesco Sforza/Vatican press office via AP)\n\nNo confirmed appointments for now\n\nThe Vatican spokesman, Matteo Bruni, declined to confirm any upcoming events, including a scheduled audience on April 8 with King Charles III or Francis' participation in Easter services at the end of the month. But Carbone said he hoped Francis might be well enough to travel to Turkey at the end of May to participate in an important ecumenical anniversary.\n\nFrancis is also returning to the Vatican in the throes of a Holy Year, the once-every-quarter-century celebration scheduled to draw more than 30 million pilgrims to Rome this year. The pope has already missed several Jubilee audiences and will presumably miss several more, but Vatican officials say his absence hasn't significantly impacted the numbers of expected pilgrims arriving.\n\nOnly St John Paul II recorded a longer hospitalisation in 1981, when he spent 55 days at Gemelli for minor surgery and treatment of an infection.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/brisbane-2032-plans-to-move-rowing-out-of-southeast-queensland/f5117ebc-3eee-48f8-8cb0-6f079c64a0f6",
    "title": "Queensland government set to go against Olympic review and move sport",
    "publish_date": "Sun, 23 Mar 2025 07:33:53 +0000",
    "category": "sports",
    "authors": [
      "Mar"
    ],
    "text": "9News can exclusively reveal the Queensland government is planning to go against the 100-day\n\nOlympic\n\nreview and move a sport out of the state's south-east.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/epcot-disney-world-florida-fire-breaks-out-in-epcot-theme-park/36ab62f6-8a83-4f8e-936a-14ebdeb7e21d",
    "title": "Fire breaks out in Disney's EPCOT theme park in Florida",
    "publish_date": "Sun, 23 Mar 2025 02:00:02 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A large fire has broken out at the EPCOT theme park at Walt Disney World in Orlando, Florida .\n\nThe blaze sent crowds of people fleeing as thick plumes of smoke were seen in the air near the park's French Pavilion.\n\nDisney World told local media the fire started on Saturday afternoon (local time) after a walk-in cooler caught fire.\n\nA ride was evacuated following the fire, which began in a walk-in cooer. (Facebook)\n\nGuests had to be evacuated from the Remy's Ratatouille Adventure ride.\n\nNo injuries have been reported.\n\nDisney confirmed the fire had been extinguished by around 7.20pm local time.\n\nSocial media footage of the blaze shows dark smoke billowing into the sky.\n\nNo injuries have been reported and the park closed as normal. (Facebook)\n\nEpcot is a theme park located at the Walt Disney World Resort in Orlando, one of four parks at the resort.\n\nIt has now shut as normal following the fire, which broke out around two hours before closing time.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/sydney-news-small-block-of-land-for-sale-fifty-thousand-dollars/84bf44d7-8ac8-4b88-9190-2e36e77e9f4a",
    "title": "Tiny slice of Sydney up for sale for $60k - but there's a big catch",
    "publish_date": "Sun, 23 Mar 2025 01:10:28 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A﻿ small slice of Sydney real estate is up for grabs for the cool price of $60,000 – but there's a catch.\n\nThe triangle-shaped block of land at 9 Anderson Street in Neutral Bay, on Sydney's Lower North Shore, is up for sale and it costs less than﻿ most house deposits.\n\nBut the land is only 31sqm, roughly the size of a tiny home or small apartment.\n\nIt's up for sale with an initial asking price of $50,000. (9News)\n\nDespite its size, the block of land is in one of Sydney's most desirable suburbs with the Harbour Bridge right around the corner and a tennis court sitting behind it.\n\nThe price guide of $60,000 is significantly cheaper than the average cost of a property in Neutral Bay, which is around $3 million.﻿\n\nHowever, there is a big downside – the parcel of land has ﻿an electrical transformer box out the front.\n\nThe block of land is just moments away from the harbour. (Domain)\n\n﻿The property is on the market with BresicWhitney.\n\n\"Formerly an easement/access site, it now offers untapped potential – whether as an acquisition for immediate neighbours or something more ambitious,\" the listing for each property reads.\n\n\"We're expecting good buyer interest and that it to mainly be shown from neighbours, locals and individuals seeking a unique property investment or value-add, that likely won't be available again for some time.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/sydney-oxford-st-gay-bars-heritage-listing-historic-photos/dd3db3a0-88af-4a11-ab22-5066f89c7094",
    "title": "Historic photos show iconic Sydney gay bars proposed for heritage listing",
    "publish_date": "Sun, 23 Mar 2025 01:22:36 +0000",
    "category": "music",
    "authors": [
      "March"
    ],
    "text": "1 of 18 Attribution: City of Sydney\n\nThree iconic Oxford Street ﻿institutions could be heritage-listed to preserve their LGBTQIA+ ties and history.\n\nCity of Sydney council is proposing to put the Oxford Hotel (pictured), Palms and the Universal nightclub on a heritage list following a study to identify important places for queer communities.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/property-prices-australia-expert-michael-yardney-home-prices-need-to-rise-to-fix-crisis/6466262c-a870-4832-8bc8-8115bfbf49df",
    "title": "'Tough' news for Aussies trying to buy a home: It's going to get worse",
    "publish_date": "Sat, 22 Mar 2025 20:14:48 +0000",
    "category": "finance",
    "authors": [
      "Mar"
    ],
    "text": "A property expert has offered an unlikely solution to Australia's climbing property prices.\n\nDirector of Metropole Property Strategists Michael Yardney warns there is a \"fundamental mismatch\" between the cost of building new homes and the price it attracts for developers.\n\nHe told 9news.com.au this has resulted in a major housing shortage, which has in turn driven up prices across the board.\n\nTo fix this, Yardney said property prices need to skyrocket even more.\n\nThe average property price in Australia needs to rise even further to fix the crisis, Yardney said. (Dion Georgopoulos)\n\n\"Most large-scale developers reckon that prices have to rise 15-20 per cent to make taking on the risk of developing new projects viable,\" Yardney said.\n\n\"This isn't just about greed; it's about sustainability.\n\n\"If prices continue to stagnate – or worse, fall – then the incentive to build diminishes, further exacerbating the shortage.\"\n\nOver the past 25 years, the median house value nationally has risen by 412 per cent, or $459,900, figures from Aussie Home Loans reveal.\n\nAnd according to the latest figures released by the ABS, the average price of homes in Australia is now a staggering $976,800.\n\nThe median house price has risen by 412 per cent in the past 25 years. (Henry Zwartz)\n\nYardney warned there is \"no way around\" this tough solution, which may come as unwelcome news to those trying to crack into the property market.\n\nHis prediction is the property housing crisis will get a lot worse before it gets better.\n\n\"It's a tough pill to swallow but think of it as a short-term pain for long-term gain,\" Yardney added.\n\n\"We might just find that the path to solving our housing crisis lies in facing up to the unpopular truths we've been reluctant to acknowledge.\"\n\nAustralia is drastically falling short providing enough housing for our growing population.\n\nCurrent projections show the industry is missing the mark by around 300,000 homes over the next five years.\n\nYardney's prediction is the property housing crisis will get a lot worse before it gets better. (Dion Georgopoulos)\n\nMetricon Homes chief executive Brad Duggan said the federal government needs to enact a \"wartime response\" to address this crisis.\n\n\"A dynamic, robust intervention reminiscent of measures typically reserved for national emergencies,\" he said.\n\n\"Developers tell us that if we truly see this as a crisis, we should address it with immediate solutions like cutting through the planning process blockages.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/pope-francis-discharged-from-hospital/105086490",
    "title": "Pope Francis waves from balcony as he's discharged from hospital",
    "publish_date": "Sun, 23 Mar 2025 11:11:28 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Pope Francis made his first public appearance in more than five weeks, waving from a balcony at Rome's Gemelli hospital before he was discharge from the facility on Sunday.\n\nPope Francis, who has been battling pneumonia for more than five weeks, will need a further two months of rest at the Vatican, his medical team has said.\n\nThe 88-year-old pontiff was seen using a wheelchair, as he has for several years, as he smiled and waved at a group of people gathered outside.\n\nPope Francis gestures during his first public appearance in five weeks, on the day he is set to be discharged from Gemelli Hospital (Reuters: Photo/Yara Nardi)\n\nThe pope, whose face looked swollen, appeared only for a few moments.\n\nHe spoke briefly, with a feeble voice, to thank one of the members of the crowd below, who had brought yellow flowers.\n\n“I see this woman with the yellow flowers. Brava!” the pope said.\n\nPope Francis waves as he leaves Gemelli Hospital. (Reuters: Photo/Guglielmo Mangiapane)\n\nA motorcade carrying the pope wound its way through Rome and kept going after reaching Vatican City, where crowds of people had lined the streets to welcome him home.\n\nSecurity guards said Francis was heading to St Mary Major basilica, where his favourite icon of the Madonna is located and where he always goes to pray after a foreign visit.\n\nChants of \"Viva il papa!\" and \"Papa Francesco\" erupted from the crowd, which included patients who had been wheeled outside just to catch his brief appearance.\n\nFrancis had only been seen by the public once before during his hospital stay, in a photo the Vatican released last week, showing him at praying in the hospital chapel.\n\nPope Francis seen celebrating the Holy Mass earlier this week. (Supplied: The Vatican )\n\nFrancis was admitted to Rome's Gemelli hospital on February 14 with a severe respiratory infection that became the most serious health crisis of his 12-year papacy.\n\nWhile Francis will return to the Vatican on Sunday, his doctors said it would take \"a lot of time\" for his aging body to fully heal.\n\nThey said they had prescribed the pope two months of repose, and had advised him against taking any meetings with large groups, or that require special effort.\n\n\"The recommendation for a period of convalescence of at least two months is very important,\" Sergio Alfieri, head of the pope's medical team, told the press conference.\n\nFrancis, who was fighting double pneumonia, suffered four acute attacks of what the Vatican called \"respiratory crises\" during his time in hospital.\n\nA nun holds a rosary as she prays near the statue of late Pope John Paul II at the Gemelli Hospital where Pope Francis is admitted for a treatment, in Rome, Italy, March 22, 2025. (Reuters: Guglielmo Mangiapane)\n\nAlfieri said that two of the crises had been critical, with the pope \"in danger of his life\".\n\nThe pontiff no longer has pneumonia, but is also not completely healed from a \"complex\" infection involving several microorganisms, said the doctor.\n\nIn the moments before the pope's appearance, the crowd of hundreds of well-wishers called out for the pontiff, chanting \"Francis, Francis, Francis\".",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/matthew-dellavedova-gives-nbl-finals-mvp-to-illawarra-hawk/105086456",
    "title": "'Class act': Delly gives NBL finals MVP to victorious Hawks opponent",
    "publish_date": "Sun, 23 Mar 2025 07:56:18 +0000",
    "category": "sports",
    "authors": [],
    "text": "Matthew Dellavedova has selflessly handed his NBL championship series MVP trophy to rival player Will Hickey after the Illawarra guard iced the decisive game-five win over Melbourne United.\n\nJeering rang out at WIN Entertainment Centre when NBL legend Larry Sengstock announced United guard Dellavedova as the MVP of the series despite United's 114-104 loss in the winner-take-all decider on Sunday.\n\n2025 NBL Championship Series Game 1: Hawks 88-96 United\n\nHawks 88-96 United Game 2: United 100-102 Hawks\n\nUnited 100-102 Hawks Game 3: Hawks 77-83 United\n\nHawks 77-83 United Game 4: United 71-80 Hawks\n\nUnited 71-80 Hawks Game 5: Hawks 114-104 United\n\nDellavedova had been United's most consistent player in the best-of-five series, guiding the team to a game-three win in Wollongong that put them 2-1 ahead.\n\nBut it was energetic guard Hickey who inspired the Hawks to the game-four and game-five wins that sealed the Hawks' first title since 2001, and second in their 47-year history.\n\nOn Sunday, Hickey (21 points, 10 rebounds, eight assists) recorded 12 first-quarter points to help Illawarra erase a 10-point deficit and finished just shy of his first triple-double.\n\nWhen NBA champion Dellavedova took to the stage to accept the Sengstock Trophy as the championship series MVP, the guard immediately paid tribute to Hickey.\n\n\"Davo, this belongs to you,\" Dellavedova said, referencing Hickey's nickname and gesturing with the trophy.\n\nStill clearly devastated with the loss, Dellavedova walked from the stage and strode into the crowd among the Hawks' championship winners.\n\nCheers of \"Davo\" rang out as Dellavedova handed his MVP trophy to former United development player Hickey, who reluctantly accepted it.\n\nAndrew Bogut credited his former Boomers teammate as a \"class act\" on social media, but said the voting system needed to change as it was revealed the United guard got three more votes than Hickey (34-31).\n\nDellavedova finished game five with five points on 2/6 shooting and a team-high seven assists to his name.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nUnited came out of the blocks faster in the decider, hitting four of their first six attempts from deep and building a 10-point lead in the first quarter.\n\nHickey was inspirational for the Hawks with 12 first-quarter points after starting in place of Trey Kell, who shone with 26 points, 11 rebounds and seven assists once he returned from the knee injury that rubbed him out of game four.\n\nKell tied the game at 26 with a jump shot on the Hawks' last possession of the first quarter before helping his side to a 12-2 run in the second that put them ahead.\n\nVeteran Todd Blanchfield (eight points, three rebounds) beat the buzzer with his second three of the quarter to restore a 10-point lead for Illawarra at the half, and the home side never trailed again.\n\nFighting to reassert themselves in the contest, United went more than five minutes in the third quarter without a field goal.\n\nThey missed seven consecutive attempts in that time, with star guard Matthew Dellavedova (five points, seven assists) also uncharacteristically butchering both free-throw attempts.\n\nIt did not help United's cause that Lee and Clark spent time on the sidelines with apparent arm injuries in the third quarter.\n\nChris Goulding (21 points, three assists) finished as United's top-scorer, with Shea Ili adding 20 on return from a concussion lay-off.\n\nBut when Kell raced down court for a lay-up that made it a 13-point game with 70 seconds remaining, the Hawks officially looked home.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/alex-de-minaur-to-face-joao-fonseca-at-miami-open/105086378",
    "title": "De Minaur to face teen sensation after good day for Aussies in Miami",
    "publish_date": "Sun, 23 Mar 2025 07:07:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Three Australian men have progressed to the Miami Open's last 32, all doing so impressively in straight sets.\n\nWorld number 11 and 10th seed Alex de Minaur took just 86 minutes to see off China's Bu Yunchaokete 6-4, 6-4.\n\nDe Minaur left it late in both sets to do the damage, breaking in the 10th games of each.\n\nAwaiting the 26-year-old is Brazilian teenage sensation Joao Fonseca, who scored a 6-4, 6-3 win over Frenchman Ugo Humbert.\n\nIt will be a first meeting between de Minaur and Fonseca, who reached the third round at an ATP Masters 1000 for the first time in his fledgling career, and is the youngest player to do so since Carlos Alcaraz in Paris in 2021.\n\n\"I started the match today super relaxed, with no nerves,\" Fonseca said.\n\n\"That was good, I served well. I had a quick break, he was maybe a little bit more nervous in the beginning, but I started well and that's what made the difference.\"\n\nJordan Thompson and Adam Walton also progressed in two sets, Thompson enjoying a gritty 7-6(4), 7-6(1) win over Giovanni Mpetshi Perricard of France while Walton triumphed 6-4, 6-4 against Italy's Luciano Darderi.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAlexei Popyrin was the only Aussie beaten on Saturday, going down 6-7(4), 6-3, 7-5 to Russian Roman Safiullin.\n\nAlexander Zverev has Thompson in his sights after downing British qualifier Jacob Fearnley 6-2, 6-4.\n\n\"Happy to kind of have improved a few things from Indian Wells where I didn't feel well on the court. I didn't feel like I played good,\" Zverev told reporters.\n\n\"Hopefully this is just the first of many matches for me here and I can continue playing well.\"\n\nIndian Wells champion Jack Draper crashed out, the sixth seed and British number one fell 7-6(2), 7-6(3) to Czech Jakub Mensik.\n\nThe start of Fonseca's match against Humbert sparked an exodus of fans from the Draper-Mensik match, with fans unable to get out chanting the young Brazilian's name and jeering loudly.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/nicola-olyslagers-eleanor-patterson-high-jump-indoor/105086390",
    "title": "Aussies go 1-2 in high jump at indoor world championships",
    "publish_date": "Sun, 23 Mar 2025 06:36:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nicola Olyslagers has claimed a second straight women's high jump gold medal at the world indoor championships in Nanjing, edging out fellow Australian Eleanor Patteron on countback.\n\nBoth Australians recorded a best clearance of 1.97m, with Olyslagers pocketing the gold as Patterson had missed once at 1.92m.\n\nWorld record holder and reigning Olympic gold medallist Yaroslava Mahuchikh from Ukraine (1.95m) claimed the bronze, also on countback.\n\nOlyslagers, 28, is accumulating quite the collection of high jump medals at global meets.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nIn addition to her two world indoor crowns in Glasgow last year and now in Nanjing, she claimed silver at the Tokyo and Paris Olympics and was third at the 2023 world championships in Budapest.\n\nPatterson, meanwhile, added a second indoor silver to the one she snared behind Mahuchikh back in 2022. The 2014 Commonwealth Games gold medallist also won gold and silver at the 2022 and 2023 outdoor worlds respectively.\n\nPatterson's attention now turns to the Maurie Plant Meet in Melbourne on Saturday, and said she is confident she can crack the 2m mark for the first time.\n\n\"It's also such an incredible honour to win my fifth global medal,\" she said.\n\n\"We keep changing the colours between Nicola, Yaroslava and myself, and hopefully later this year in Tokyo [at the outdoor World Athletics Championships], I can win my sixth.\"\n\nMahuchikh is the only one of the three with wins at the Olympics, and outdoor and indoor world champs.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe trio has dominated women's high jump in recent years, with at least two of them on the podium at every major global event since the Tokyo Olympics in 2021, when Olyslagers (née McDermott) won silver and Mahuchikh bronze.\n\nNanjing marks the third time in two years that all three have stood on the dais, with the 2023 outdoor worlds and last year's Olympics.\n\nOlyslagers and Patterson were both trying new run-ups in Nanjing, just as Mahuchikh did when she won gold in Paris.\n\n\"I think we bring the best out of each other,\" Olyslagers said of her compatriot.\n\n\"And for Australia, this is the best thing that could possibly happen, winning gold and silver and for record medals.\n\n\"The Olympics was great, indoors is great. We're really going places as a sport.\"\n\nWith one session remaining later on Sunday, Australia has already won a record five medals at the 2025 World Indoors, bettering the previous high-water mark of four set in Toronto in 1993.\n\nLachlan Kennedy was second in the men's 60m and Jess Hull and Ky Robinson pocketed bronze in the two 3000m races.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/nrl-live-updates-eels-bulldogs-sea-eagles-raiders/105083174",
    "title": "'Not in the true spirit of the game': Dogs penalised for impersonating ref in win",
    "publish_date": "Sun, 23 Mar 2025 03:38:18 +0000",
    "category": "sports",
    "authors": [
      "Michael Doyle"
    ],
    "text": "In a scene that seemed more suited to the Lord's Cricket Ground than Western Sydney Stadium, the Canterbury Bulldogs have conceded a penalty for misconduct that was not \"in the true spirit of the game\".\n\nThe bizarre moment came in the Bulldogs' gritty 16-8 win over the Parramatta Eels at Western Sydney Stadium.\n\nReferee Wyatt Raymond penalised Canterbury prop Josh Curran, for calling out to an Eel telling him to remove himself from a tackle.\n\nRaymond deemed that act as misconduct, impersonating the call of a referee to gain an advantage.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Bulldogs held on to defeat Parramatta, who produced their best effort of the season after being well-beaten in their first two matches of 2025.\n\nJosh Addo-Carr, playing his first match for the Eels after having his contract with the Bulldogs terminated last season, scored a try on club debut.\n\nStar recruit Zac Lomax was excellent for the Eels in a losing side, but Parramatta's lack of potency in attack cost them on Sunday.\n\nMeanwhile, new father Reuben Garrick scored four tries as the Manly Sea Eagles belted Canberra Raiders 40-12.\n\nThe first 20 minutes of the match was an arm-wrestle with both teams battling hard.\n\nBut the sin-binning of Canberra prop Corey Horsburgh started a spiral the Raiders could not get out of.\n\nManly scored in the subsequent set, and then Canberra fullback Kaeo Weekes committed three errors that directly led to Manly tries.\n\nThe Sea Eagles score five tries in a 15-minute blitz to lead 30-0 at half-time.\n\nGarrick, who celebrated the birth of his baby on Saturday, scored a pair of tries in each half to cap off a terrific week.\n\nLook back at all the action from both games in our live blog below, and check out all the stats the latest stats in the full ScoreCentre.\n\nKey Events FULL-TIME: Manly Sea Eagles 40 def. Canberra Raiders 12 8 hours ago 64' TRY: Canberra score for their first points 8 hours ago 52' TRY: FOUR TRIES FOR GARRICK 8 hours ago Show all key events NRL Sunday scores M By Michael Doyle That is all for the blog tonight M By Michael Doyle Thanks Mick, see you next week. - Mike That is all for the blog this evening. The Bulldogs and Sea Eagles were winners on Sunday. Parramatta produced a spirited performance in defeat, while the Raiders were given a reality check. ABC Sport will be back next week to bring you round four of the NRL. Remember, you can get all your sport news online with ABC Sport. Goodnight. Reuben Garrick rides the 'rollercoaster' of emotion M By Michael Doyle Loading Instagram content FULL-TIME: Manly Sea Eagles 40 def. Canberra Raiders 12 M By Michael Doyle — reporting by AAP A potentially season-ending injury to towering prop Taniela Paseka has taken the gloss off Manly's best performance of the season after the Sea Eagles thrashed Canberra 40-12. Manly fear Paseka has ruptured an Achilles tendon after the 197cm Tonga international stumbled into a tackle in the first half at Brookvale Oval on Sunday. But even accounting for the absence of their most damaging middle forward and first-choice fullback Tom Trbojevic (hamstring) the Sea Eagles easily handled the Raiders. Centre Reuben Garrick chalked up a 28-point haul for Manly, scoring four tries and kicking six goals from seven attempts to bring the Raiders back down to earth with a bump. Canberra had begun the season on fire, knocking off the Warriors in Las Vegas and pummelling Brisbane in round two. But they had too steep a mountain to climb against a lopsided first-half penalty count that was compounded by errors from their back three and Corey Horsburgh's 22nd-minute sin-binning. Horsburgh was sent for ten following sustained ruck infringements from an ill-disciplined Raiders outfit. Ricky Stuart's side had absorbed plenty of pressure and thought they had scored the game's opener through Seb Kris, only for his try to be called back for an obstruction. Manly quickly marched downfield with Horsburgh's professional foul, the final straw for referee Grant Atkins, who sent the Queensland State of Origin forward to the sin bin. With Canberra down to 12, Manly eventually broke the deadlock when Garrick barged over from close range. Then, the Raiders conceded two near-identical tries. Both times fullback Kaeo Weekes spilled a bomb and both times Ethan Bullemor was the man in the right place at the right time to dot down for the Sea Eagles. Weekes's evening went from bad to worse when he hoofed the next restart out on the full and Manly went up the other end and scored through Jake Simpkin. The hooker's try came just as Horsburgh was making his way back onto the field, meaning Canberra had conceded 22 unanswered points while down to 12 men. Even at full complement, the Raiders were out on their feet and Manly took advantage with Garrick adding his second try to give his side a 30-0 lead at halftime. The hosts continued to poke at the sore points in Canberra's defence as Garrick brought up tries three and four early into the second half. Kris and Hudson Young crossed in the final 20 minutes to ensure the Raiders did not go home scoreless. 78' TRY: Raiders score another consolation try M By Michael Doyle It has been a nice finish to a miserable scoreline for the Canberra Raiders. After being awarded a penalty 10 metres from the Manly tryline, the Raiders tapped the ball and, three plays later, scored. An offload to a charging Hudson Young grants Canberra a second try. For what it is worth, they have scored more points than Manly in the second half. 72' Canberra holding on desperately M By Michael Doyle Some of the statistics out of his game is stunning. Manly has had more than 6t0 per cent of the ball in this match — that is near unheard of. The Sea Eagles have also had more than 60 attacking plays inside Canberra's 20m. Canberra have had 19 inside Manly's redzone. In fairness to the Raiders, Manly has been threatening to score in the past five minutes, and the visitors are defending like that game was still in the balance. 64' TRY: Canberra score for their first points M By Michael Doyle It's too little, too late, but the Raiders have scored a nice try. They had a full set of six at the Sea Eagles' line, and Manly repelled them. On the final play the Raiders nearly blew it when the ball was passed to a forward. Quick thinking got the ball to Jamal Fogarty who put in a little chip kick to the in-goal. Centre Sebastian Kris, who was denied the first try of the game, caught the ball and planted it on the ground. Canberra forward Morgan Smithies fails HIA M By Michael Doyle Morgan Smithies will not return tonight. As he came from the shed after half-time, he began to feel ill, reported ABC Sport sideline eye Michael Carayannis. Nausea can be a symptom of concussion, so the Raiders elected to do a Head Injury Assessment on their man. Smithies has failed that test. It's never great when a player fails a HIA, but credit to the Raiders who identified an issue with their man, and put his health above all else. 52' TRY: FOUR TRIES FOR GARRICK M By Michael Doyle Reuben Garrick has FOUR tries. Another trip into Canberra's territory, and it is another try for Reuben Garrick and the Sea Eagles. The centre was given the ball, flat-footed and busted through a poor Raiders defence to score. It is 40-0. 49' TRY: New dad Garrick has a hat-trick M By Michael Doyle It is a sixth try for Manly and this game surely is over. The Sea Eagles have again been on top in this game, and with their first real opportunity, they score. Daly Cherry-Evans put in a lovely grubber kick and Reuben Garrick scores a hat-trick, just days after the birth of his child. Fears for Taniela Paseka that he has a serious leg injury M By Michael Doyle ABC Sport sideline eye Michael Carayannis is at Brookvale Oval and has reported Manly fear prop Taniela Paseka may have ruptured his Achilles. Of course we hope it is not, but these medics would have a good idea by now what the issue may be. Paseka limped off just before Manly's first try of the night. The second half begins at Brookvale Oval M By Michael Doyle Hello Mick, thanks for hosting the ABC NRL live blog today. I picked Manly to win but didn't expect them to do it in the first half! - Mike The second 40 minutes has begun. And Mike, I too was not expecting this scoreline. Manly wearing black armbands for Beau M By Michael Doyle This is something we wanted to mention in this blog. Manly are wearing black armbands today in memory of 12-year-old Beau Hewitt. Beau was a massive Sea Eagles fan and a very popular young man around the club. Beau passed away earlier this week. There was a beautiful tribute for Beau prior to kick-off. HT: Manly Sea Eagles 30 leading Canberra Raiders 0 M By Michael Doyle Manly almost scored off the final play of the half, by the way. But the first half ends with Manly scoring five tries in 15 minutes to lead 30-0. Canberra were excellent to start this match, but the sin-bin of prop Corey Horsburgh turned this match on its head. Manly were outstanding at the end of that half and made the Raiders pay for their errors. Poor Kaeo Weekes made three errors which directly resulted in Manly tries. 38' TRY: Garrick scores his second as Manly kick clear M By Michael Doyle It is five first half tries for the Manly Sea Eagles. Centre Reuben Garrick has charged over, with two Canberra defenders trying to hold him up, and somehow he god the ball on the ground. The Raiders look stunned. It was not that long ago we thought they had scored the first try of this match. Manly have score five tries in 15 minutes. Stunning. 33' TRY: Manly score again off another Weekes mistake M By Michael Doyle Poor Kaeo Weekes. After two dropped balls allowed Manly to score a pair of tries, he then kicks the restart out on the full. The fullback has his head in his hands. It's another critical mistake. Manly have the penalty and a full set of six at the Canberra line. The Sea Eagles use all six plays and the try is scored by Jake Simpkin, barging over from dummy half. 30' TRY: Canberra's fullback has another drop and Bullemor scores again M By Michael Doyle Oh poor Kaeo Weekes. The Canberra fullback has dropped another bomb, this time in a contest with Manly winger Clayton Faulalo. The ball is collect by Manly, and two passes later Ethan Bullemor has scored the second-easiest try of his career. In the blink of an eye it is 18-0, and all points have come with Canberra reduced to 12-men through the sin-bin of Corey Horsburgh. 28' TRY: Manly score after Canberra's fullback has a shocker M By Michael Doyle It's a gift for Manly, as interchange Ethan Bullemor grounds the ball for the easiest try he will ever score. A sky-high bomb was launched by Manly halfback Daly Cherry-Evans. The bomb is landing near the goal posts, and Canberra fullback Kaeo Weekes makes a meal of the catch. He stuck an arm out but could not catch the ball. The ball bounces in the in-goal, and takes a sharp turn away from Raiders halfback Jamal Fogarty who was trying to clean up the mess. That shape bounce allowed Bullemor to race through and ground the ball. 24' TRY: Manly score but also lose their prop M By Michael Doyle We have the first try of the game, no doubt about it. Manly centre Reuben Garrick has run from dummy half, and wrestled his way over the line. What a week for Garrick, who became a father just a few days ago. There is bad new for Manly, as prop Taniela Paseka has limped off with a suspected Achilles issue. 23' SIN BIN: Corey Horsburgh is off for a professional foul M By Michael Doyle What an awful two minutes for Corey Horsburgh. He was called obstruction just moments ago which disallowed a try. Then in defence, he gave away a six-again restart. Then in a clear offside position on the goaline, Horsburgh tackles the dummy half. Referee Grant Atkins has sent the prop to the sin bin. Show more posts",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/oscar-piastri-wins-formula-1-chinese-grand-prix/105060746",
    "title": "Piastri wins in China as Hamilton, Leclerc and Gasly disqualified",
    "publish_date": "Sun, 23 Mar 2025 03:28:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian Formula 1 driver Oscar Piastri converted his maiden grand prix pole position into victory, while three of his rivals were stunningly disqualified post-race.\n\nThe McLaren driver was flawless in Shanghai to win the Chinese Grand Prix, ahead of teammate Lando Norris and Mercedes driver George Russell.\n\nThe win means McLaren, last year's constructors champions, have triumphed in the first two grands prix of the season, after Lando Norris claimed victory last Sunday in Melbourne.\n\nMeanwhile, it was a disastrous afternoon for McLaren's rivals Ferrari, with both Charles Leclerc and Lewis Hamilton being disqualified from the race, after finishing fifth and six.\n\nAt the front of the grid, Piastri was all smiles as he was embraced by McLaren CEO Zak Brown following his terrific performance.\n\nAfter making a mistake which cost him a podium finish in his hometown one week earlier, Piastri was outstanding all weekend in Shanghai.\n\n\"Mega job, guys. Mega, mega job,\" Piastri said over his team radio after the chequered flag.\n\n\" Thank you very much. The car was very lovely; great team effort. That is one satisfying weekend. \"\n\nThe Australian did not get the fastest start off the line, but he was able to squeeze Russell and maintain the lead at the first corner and Norris jumped into second as Russell was compromised at the apex.\n\nWorld champion Max Verstappen dropped from fourth to sixth off the start, getting jumped by both Ferraris.\n\nPiastri took full advantage of clean air in the opening laps, maintaining a lead over Norris as all drivers managed tyre wear on a track that produces high degradation.\n\nPiastri pitted from the lead at the end of 14 laps, along with Russell from third, while Norris had to wait until the end of the next lap for new tyres.\n\nThe Chinese GP win adds to victories in Hungary and Azerbaijan last year. (AP)\n\nPiastri maintained the net lead of the race, while Norris was overtaken by Russell, who took full advantage of an extra lap with fresh rubber.\n\nNorris was able to retake the position from Russell a couple of laps later.\n\nBut by the time he had achieved that and overtaken the Williams of Alex Albon, who had not pitted, Piastri had established a lead of more than four seconds on lap 20 of 56.\n\nIt became clear just stopping once was the correct strategy, when many believed two stops would be needed on Sunday.\n\nF1 drivers contend with extreme heat and G-forces. Here's how they cope Photo shows An orange and black Formula One car driving partially on the asphalt track, partially on gravel. A new rule implementing cooling systems for F1 drivers was introduced this year. This is how it helps protect drivers.\n\nHamilton, before his disqualification, pitted for a second time with the expectation he would be able to chase down his rivals who were on older tyres.\n\nThat did not eventuate and world champion Vertsappen proved to be one of the fastest on track late in the race, overtaking Charles Leclerc to claim fourth.\n\nMeanwhile, in front, Piastri was cool and measured. The Australian's advantage never dipped below two seconds to Norris.\n\nThe Brit started to struggle on lap 43, with his lap times slowing and taking the pressure off Piastri.\n\nNorris was complaining of a brake issue, allowing Piastri to control his pace and guide his way to victory.\n\nBoth Ferrari drivers and Gasly disqualified\n\nLeclerc and Alpine's Pierre Gasly's cars were both found to be one kilogram under the minimum weight requirement of 800kg.\n\nMeanwhile, Hamilton was removed from the classified finishers after it was determined the rear skid block on his car was below the minimum thickness required by the sport's technical regulations.\n\nLewis Hamilton is one of three drivers disqualified after the Chinese Grand Prix, after winning the F1 sprint race the day before. (Getty Images: Kym Illman)\n\nThe report from FIA F1 technical delegate Jo Bauer for Leclerc and Gasly found both cars were legal when first weighed but after two litres of fuel was removed — as per the regulations — the cars fell below the 800kg benchmark.\n\nFor Hamilton, his rear skid block was thinner than nine millimetres on inspection.\n\nThe rear skid block, also known as a plank, is a mandatory part on the underside of the car that regulates the ride height of an F1 car.\n\nThe rear skid block will often come into contact with the ground during a grand prix, wearing away at its thickness.\n\nBut it cannot wear away to less than nine millimetres in thickness, which is what Hamilton's plank had done.\n\n\"The plank assembly of Car 44 was measured and found to be 8.6mm (LHS), 8.6mm (car centerline) and 8.5mm (RHS). This is below the minimum thickness of 9mm specified under Article 3.5.9 of the Technical Regulations,\" the steward's report said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"During the hearing the team representative confirmed that the measurement is correct and that all required procedures were performed correctly.\"\n\nThe team also acknowledged that there were no mitigating circumstances and that it was a genuine error by the team.\n\n\"The Stewards determine that Article 3.5.9 of the FIA Formula 1 Technical Regulations has been breached and therefore the standard penalty of a disqualification needs to be applied for such an infringement.\"\n\nLeclerc crossed the line fifth, ahead of teammate Hamilton in sixth, while Gasly was out of the points positions in 11th.\n\nThe change in classification now means Esteban Ocon finished fifth for Haas, a remarkable result for the team.\n\nMercedes rookie Kimi Antonelli was sixth, then Alex Albon (Williams), Ollie Bearman (Haas), Lance Stroll (Aston Martin) and Carlos Sainz (Williams).",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/shattered-book-hanif-kureishi-private-man-public-piece-meat/105069662",
    "title": "Hanif Kureishi fell off a chair and broke his neck. From his rage came a 'spark of life'",
    "publish_date": "Sun, 23 Mar 2025 03:26:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's impossible to read Shattered, Hanif Kureishi's raw, unvarnished account of his life as a tetraplegic, without coming to an intimate understanding of the workings of his body. Enemas in his backside — the British author calls his arse \"Route 66\" — catheters in his penis, butt plugs inserted during hydrotherapy, the fingers of strangers in every nook and cranny, washing him, cleaning him, excavating him. Chapters start with sentences like, \"shit and piss\".\n\nA cherished independence swiftly replaced with myriad indignities. \"How did I go from being a private man,\" he asks, \"to a public piece of meat?\"\n\nIt's a shocking story. On December 26, 2022, at the age of 68, Kureishi toppled from his chair whilst watching football at his partner's apartment in Rome. He fell flat on his face and broke his neck. It immediately felt as though his head had disconnected from his body. He came to in a pool of blood, watching his hand, a \"scooped, semi-circular object with talons scuttling towards me\".\n\nA spinal injury hasn't stopped Hanif Kureishi writing Photo shows A black and white photo of a man with shoulder-length dark hair leaning his head on his hand The bestselling British author reflects on his portrait of race, sex and class in London in the 70s, The Buddha of Suburbia.\n\nKureishi had smoked half a joint, drank half a beer, and was recovering from diverticulitis, but it was a random stroke of bad luck; an odd angle, a tilt, a flat fall, and permanent paralysis.\n\nAs he began to wrestle, and rage, against what had happened to his body whilst in an Italian hospital, Kureishi felt a burning urge to write about what was happening to him. Dictating to his son Carlo, he began to tweet. Just two weeks after his accident, one post read: \"An insect, a hero, a ghost or Frankenstein's monster. Out of these mixings will come magnificent horrors and amazements. Every day when I dictate these thoughts, I open what is left of my broken body in order to try and reach you, to stop myself from dying inside.\"\n\nIt is the writing, first on X then Substack then his memoir, Shattered, that enables \"a spark of life\" and a refuge. Writing, he says, \"has never mattered to me more\".\n\nAn urge for connection\n\nGrowing up in London with a British mother and a father who had emigrated from Pakistan, Kureishi was nominated for an Oscar in 1985 for his screenplay of his book, My Beautiful Laundrette, and lauded for his ability to capture the experience of what Zadie Smith called \"new-breeds\", or immigrant families.\n\nIn 1990, his novel The Buddha of Suburbia won the Whitbread prize for best first novel. There had been no books, he said, \"for people like me\".\n\nNow, after the accident, he says he has seen new opportunities for creativity out of an urge to delight people, to connect with people and use his time. One night, when his head jammed awkwardly down the side of his bed, he found himself unable to move and unable to call for help, he says: \"It seemed like a good opportunity for some contemplation.\"\n\n\"I'm still capable of enjoying life. I'm still capable of happiness. I'm still capable of conversation,\" Hanif Kureishi says. (Getty Images: Dave Benett)\n\nWhen I spoke to him recently at the Adelaide Writers' Festival, he was still shaking his fist at fate, furious at having been \"dumped in this awful condition\". He does not pretend this life is anything but often hellish for him, a profoundly unwelcome shock, most of the time.\n\nAt night, his partner tells him, he rages in his sleep, yelling and crying loudly. His memoir is, though, blackly funny: \"Since I became a vegetable I have never been so busy.\"\n\nBut he has also been moved and sustained by new discoveries about, to his own surprise, love. And the stark beauty you can see in hospitals, at a time you feel both reduced and cared for.\n\nHe writes about going to the gym and seeing \"all the patients with their broken or malformed bodies being manipulated and caressed by the physiotherapists, [when] something in me changed. I thought, if you only watch the news and TV shows, you get the impression that the world is a harsh place, inhabited by money-grubbing and narcissistic criminals, when you see the mutual work done in the gym, it is a place of beauty, collaboration and respect.\"\n\nConversation as an anti-capitalist activity\n\nTales of terror and catastrophe, he says, are not the whole story of life, which would have to include \"stretches of harmony, joy and the pleasure that people can take in each other's company. How much people want to give another; how altruistic they can be. Gentleness and kindness — it's hardly dramatic, but there's a lot of it about.\"\n\nThe author and playwright also watches others get pleasure from doing things for him, whilst aware it is an unequal exchange. At times, he writhes and objects: one day when his partner Isabella d'Amico was trying to floss his teeth when he was dictating to his son, he fights with her, coming to feel like \"both a helpless baby and a terrible tyrant\".\n\nIt's impossible to read Shattered without coming to an intimate understanding of the workings of Kureishi's body. (Supplied: Penguin Random House)\n\nMostly though, he told me, his illness has brought out the best in others \"and seems to have done the same to me\". Female friends tidy his room, remote acquaintances shadow his door.\n\nIn hospital you have time to talk, too, something he luxuriates in.\n\nKureishi describes conversation as a kind of anti-capitalist activity, play for adults. With his friend, Lady G, one day, he discusses cross-dressing, marrying the wrong person, a friend who was struck by lightning, violent disputes with siblings, and why so many people, especially on radio, begin sentences with the word \"so\" .\n\n\"Friends of mine came to visit me every single day, and they brought me three course meals, and they would read the newspapers to me, and they would brush my hair, and they would give me a head massage, and they would feed me, and so on,\" he said. \"And the nurses and doctors, I would have long conversations with them about their lives, about who they were. … You could say to them, Why are you doing this? What brought you here? Why are you in this country? Why do you want to do this job? And you could have the most incredible conversations.\n\n\"I tell you, if you want to meet new people, it's a good idea to break your neck. And if you're interested in other people, you want to hear their stories. There's plenty of them. So, far from thinking of the world as being this terrible hellhole where people love to kill each other, which it is, I saw another side of it. Actually, I still see another side of it, particularly with my friends, the people who come and visit me every day and spent time with me. So it was a very illuminating experience to be in hospital for a year.\"\n\nYou find yourself asking — what kind of person am I? What kind of friend?\n\n'I'm still capable of happiness'\n\nKureishi's candour is rare. The ill or broken so often feel compelled or forced to hide or sanitise their experiences. But this honesty unravelled me when I read it. It's clear this is how he has Stayed Upright: writing, caustic humour, and the gentle care of others.\n\nShattered was written not with gentle hindsight, but \"from the trenches\", as he says. Others, too, may relate to the long stints spent in hospital, acute defencelessness, shock, grief and impotence when random accidents upend futures.\n\nHe can't use his hands, can't write, can't walk, can't use his legs. What he has left, he said , is his voice: \"So I'm still myself, in some sense, and I'm still an artist.\"\n\n\"We are bodies that fail. We are our bodies that require to be administered to by doctors and nurses. On the other hand, we are spirits. We are souls that rise above our bodily selves that communicate with other people. So, I think the book explores the fact that we're all those things at once. But for me, writing is the way in which I could transcend the horror of my experience and get back to living a little which is very important.\n\n\"I'm still capable of enjoying life. I'm still capable of happiness. I'm still capable of conversation. There's much, much more to one's life than one might think.\"\n\nThis is part of a regular series called Staying Upright, where I explore how humans manage to persist, despite everything. Feel free to contact me here.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/cricket-new-zealand-australia-t20-international-live-updates/105085852",
    "title": "Mooney stars again as Australia thumps NZ in second T20",
    "publish_date": "Sun, 23 Mar 2025 01:26:28 +0000",
    "category": "sports",
    "authors": [],
    "text": "Beth Mooney has been named player of the match for a second straight time after scoring a game-high 70 runs as Australia beats New Zealand by 82 in the second of three T20s.\n\nAustralia's ultra-consistent opener was also best on ground in the first clash with 75 not out and followed it up with another typically controlled 42-ball knock in Tauranga as the tourists ended their 20 overs on 3-204.\n\nThe White Ferns' chase never got out of first gear after losing Suzie Bates in the second over, with Annabel Sutherland taking 4-8 off 13 balls as New Zealand was bowled out for just 122 in 16.1 overs.\n\nThe third and final T20 will be played in Wellington on Wednesday.\n\nCheck out the scores and stats below.\n\nManhattan\n\nBall-by-ball",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/afl-live-lions-eagles-north-demons-dockers-swans/105085002",
    "title": "'Other things going on': Demons coach's cryptic Gawn answer raises eyebrows",
    "publish_date": "Sun, 23 Mar 2025 01:16:09 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Chris De Silva"
    ],
    "text": "Melbourne coach Simon Goodwin has suggested Max Gawn is dealing with some off-field issues after a sub-par performance from the skipper in a 59-point loss to North Melbourne on Sunday.\n\nGawn struggled mightily in a blockbuster ruck duel with Kangaroos big man Tristan Xerri, who held the seven-time All-Australian to just 11 disposals and one clearance.\n\nAsked about how Gawn had responded to losing the ruck duel — a rarity for him — Goodwin said there had been contributing factors off the field.\n\n\"Today he'll acknowledge he got beaten by a really good opponent, but you also have to realise that in life, there are other things that are going on,\" Goodwin said.\n\n\"We'll support Max, he's a great person, a great leader, and there's a back story to everyone's performance.\n\n\"I'm not going to go into the details. There's footy, there's some stuff in life.\n\n\"He's someone we love dearly and he'll certainly be a big part of our response.\"\n\nEagles coach issues warning after Reid's middle-finger salute\n\nWest Coast coach Andrew McQualter urged AFL pundits not to \"bash the theatre out of the game\" after second-year star Harley Reid again found himself in the thick of it against Brisbane.\n\nThe marquee teenager wore criticism for his antics and lack of influence in a heavy loss to Gold Coast last week and was a natural target in Sunday's 19-point defeat to Brisbane at the Gabba.\n\nReid finished with 15 disposals, seven tackles and six clearances but gave away seven free kicks as the visitors kicked the first five goals but were run down in the final term.\n\nHe had an altercation with Brisbane veteran Dayne Zorko and then, in the final quarter, playfully showed his middle finger to the crowd after one patron had thrust a packet of tissues towards him when he was sent sprawling to the turf.\n\nHarley Reid gave the finger to Gabba fans abusing him after a hit from Oscar McInerney. (Supplied: Fox Sports)\n\nOscar McInerney's hit on Reid resulted in a downfield free kick that led to a goal.\n\n\"There's a fair bit of commentary about Harley all the time, so last week was not necessarily different,\" McQualter said of the 19-year-old.\n\n\"We try and bash the theatre out of this game, don't we?\n\n\"He's just having a bit of fun and sometimes that's good for the game, I think.\"\n\nThe Eagles showed great resolve to win the early contests after being dominated in that area against the Suns a week ago, with McQualter crediting Reid for playing his part.\n\n\"His response today, he played the right way,\" he said.\n\n\"Competed hard. He kept competing and had some big influence on the game at different times.\n\n\"He's still learning the game … and we're going to support him.\"\n\nAmartey the hero as Swans seal heist in final minutes\n\nChad Warner put on a star display and Joel Amartey kicked the match winner with less than 90 seconds remaining as Sydney pulled off a stunning three-point win over Fremantle at Perth Stadium.\n\nThe Dockers led by 22 points at quarter-time and were still clinging to a slender lead as the clock wound down in Sunday's match in front of 43,882 fans.\n\nAmartey gave Sydney the lead when he out-muscled Brennan Cox in a marking contest before calmly slotting the 20m set shot with 86 seconds remaining.\n\nIn a frantic finish, Fremantle surged forward for one final attack with just seconds remaining.\n\nA long kick into attack was marked by Dockers forward Jye Amiss, but the siren had sounded just a second earlier, giving Sydney the 9.14 (68) to 9.11 (65) win.\n\nFollow our live blog below for all of Sunday's AFL action as it happened.\n\nKey Events Davies-Uniacke expected to sign $9 million deal 7 hours ago Bolton to Warner: 'Do you like WA?' 7 hours ago FT: Sydney 9.14 (68) defeats Fremantle 9.11 (65) 7 hours ago Show all key events AFL Sunday scores J By Jon Healy That's it for tonight's live coverage! C By Chris De Silva That's where we'll wrap things up on this Sunday. Just to recap things, we had Brisbane, North Melbourne and the Sydney Swans as today's winners. Thank you for spending your day with us and please join on Thursday night when we return for Essendon's clash against Port Adelaide. Davies-Uniacke expected to sign $9 million deal C By Chris De Silva Star midfielder Luke Davies-Uniacke looks set to remain a Kangaroo for the majority of his career. (AAP Photos) Some more good news for the Kangaroos, with AFL.com.au's Cal Twomey reporting that star midfielder Luke Davies-Uniacke is expected to remain at the club on a seven-year, $9 million deal. Davies-Uniacke finished with 23 disposals, seven tackles and four clearances in today's win over Melbourne. Plenty of love for Dean Cox after his maiden win C By Chris De Silva Dean Cox celebrates with Isaac Heeney and Angus Sheldrick after Sydney's win over Fremantle. (Getty Images) This is a result Dean Cox will surely never forget for as long as he coaches. Round 3 fixtures (all times AEDT) C By Chris De Silva It's shaping up to be a cracking round next weekend. It starts with Essendon and Carlton both needing wins and ends with a Western Derby between the two desperate Perth teams. Here's how the fixture looks: Thursday, March 27 7.30pm: Essendon vs Port Adelaide @ Docklands Stadium Friday, March 28 7.40pm: Carlton vs Western Bulldogs @ Docklands Stadium Saturday, March 29 1.20pm: Melbourne vs Gold Coast Suns @ MCG 4.15pm: St Kilda vs Richmond @ Docklands Stadium 7.35pm: Hawthorn vs GWS Giants @ UTAS Stadium 7.35pm: Brisbane Lions vs Geelong @ Gabba Sunday, March 30 3.20pm: Adelaide vs North Melbourne @ Adelaide Oval 6.10pm: West Coast Eagles vs Fremantle @ Perth Stadium Bye: Collingwood, Sydney Swans Port's star recruit sidelined for 'extended period' C By Chris De Silva Port Adelaide's star recruit Jack Lukosius fractured his kneecap in the win over Richmond at the weekend. (AAP Photos) Jack Lukosius will need surgery on a fractured kneecap in a major injury blow for Port Adelaide. The former Gold Coast forward suffered the injury early in Saturday's comfortable win over Richmond. Port will also be without Ryan Burton (hip) and Lachie Jones (adductor) for Thursday's game against winless Essendon. Lukosius suffered the injury in a collision and the Power said on Sunday he would be sidelined \"for an extended period\". He was hurt only a few minutes into his first home game for the Power. Lukosius tried to return to the field, but clearly was not right and was substituted out of the game. It is a major setback for Port, who recruited Lukosius in last year's trade period. \"Lukosius will undergo surgery in the coming days, with a timeline for return to become clearer soon,\" the Power said in a statement. Port are also without star on-baller Zak Butters (knee), forward Todd Marshall (Achilles) and defender Brandon Zerk-Thatcher (back). AAP The final ladder after round two C By Chris De Silva Here's how the ladder looks following another enthralling round of AFL action: 1. Hawthorn: 3-0, 12 pts, 129.9% 2. Adelaide: 2-0, 8 pts, 172.1% 3. GWS Giants: 2-0, 8 pts, 143.7% 4. Collingwood: 2-1, 8 pts, 120.5% 5. Brisbane Lions: 2-0, 8 pts, 114.6% 6. Gold Coast Suns: 1-0, 4 pts, 277.6% 7. Geelong: 1-1, 4pts, 142.5% 8. North Melbourne: 1-1, 4 pts, 124% 9. Western Bulldogs: 1-1, 4 pts, 105.8% 10. Sydney Swans: 1-2, 4 pts, 91.5% 11. Port Adelaide: 1-1, 4 pts, 90.7% 12. St Kilda: 1-1, 4 pts, 75.2% 13. Richmond: 1-1, 4 pts, 71.8% 14. Carlton: 0-2, 0 pts, 79.6% 15. Melbourne: 0-2 0 pts, 69.3% 16. Essendon: 0-2, 0 pts, 68% 17. Fremantle: 0-2, 0 pts, 62.3% 18. West Coast Eagles: 0-2, 0 pts, 53.9% A look back at the final two minutes in Perth C By Chris De Silva If you missed the action live, here's how the final two minutes panned out as the Swans stole it in WA. Swans fans breathing a huge sigh of relief C By Chris De Silva What a nail biter! Well played Sydney - never a doubt :) Thanks for the blog Chris - Mike The Swans pull one out for the tipsters C By Chris De Silva So glad I tipped the Swans now - going equal top feels so good - Jeremy Bolton to Warner: 'Do you like WA?' C By Chris De Silva Interesting bit of lip from Shai Bolton towards Chad Warner in the final seconds here. If my lip reading is correct, it looks like Bolton says to Warner, \"Do you like WA?\", which is obviously a reference to Warner's contract status. There's a slight hint of a headbutt from Bolton there as well, which I'm sure will catch the attention of the MRO. Get you players that can kick the football C By Chris De Silva My main takeaway from that final quarter and really the entire round is that kicking is the single most important skill in the game. It might seem like common sense saying that foot skills is the key to winning FOOTball matches, but there are that many poor kicks in the competition at the moment. I hate to single him out, but we saw two horrendous shanks from Patrick Voss when he could have really killed the game for Freo. On the other end, Riley Bice was crucial in the final five minutes, not only drilling that goal on the run, but also playing a big part in the lead-up to the Amartey goal with a lovely kick. Kicking efficiency remains the single factor which separates the good teams from bad ones. Chad Warner's take on a thrilling Swans win C By Chris De Silva Chad Warner and the Swans are absolutely stoked after pulling that one out. \"It was pretty tough. They are an amazing contest team ... I couldn't be prouder of the boys, to be honest,\" he tells Fox Footy. \"It's huge (to get a win for Dean Cox). He's such a great fella. Everyone loves him and he's been around for so long and he deserves it so much. He's fitted in seamlessly. There's a few less outburst moments compared to 'Horse', but we love 'Horse' as well. \"(On Riley Bice's late goal) It's probably one of the best first goals you'll ever see. He trusted himself and had the confidence behind him.\" FT: Sydney 9.14 (68) defeats Fremantle 9.11 (65) C By Chris De Silva Hayden McLean was excellent in the second half as the Swans overturned a four-goal deficit against the Dockers. (Getty Images) THE SWANS HAVE DONE IT! Fremantle is literally beaten by mere seconds! The Dockers forced a late turnover and Jeremy Sharp sent the ball inside 50 and Jye Amiss takes the contested mark but it's a few seconds too late. The ball was literally three quarters through its arc on the way to Amiss when the siren sounded. Unbelievable ticker shown by the Swans to win this one, what a performance. Whew. Fremantle players shattered, the crowd is absolutely stunned. They can't believe the Dockers haven't come away with the four points. Serong called for a throw! C By Chris De Silva Oh no! That might be the game! Caleb Serong is adjudged to have thrown the ball 40m out from goal. Free kick Sydney with 32 seconds left. Dockers have to man up here. Dockers with the final press C By Chris De Silva Ball up 75m out from Freo's goal with 44 seconds left. Amartey puts Swans in front! C By Chris De Silva Joel Amartey wins the one on one contest with Brennan Cox deep inside 50. He goes back and kicks the set shot from close range to put the Swans back in front with 1.26 left on the clock! Brilliant composure in the lead-up once again as both Isaac Heeney and James Rowbottom resisted the urge to just bomb the ball forward. HUGE centre clearance coming up. Serong wins a massive one on one C By Chris De Silva Caleb Serong playing the role of a defender as he spoils a kick headed down the throat of Corey Warner 50m out from the Swans goal. How good is that from your star midfielder?! Three minutes left! Into the final five minutes C By Chris De Silva Fremantle dominating territory as they look for the killer blow. There is just over four minutes left on the clock. Swans pinned into their half right now. Bice kicks a HUGE goal as Swans draw closer C By Chris De Silva Riley Bice drills one on the run from 45m out and the game is back on! Voss shanks another one and allows the Swans to have a turnover. Braeden Campbell and Ollie Florent showcase some excellent kicking to get the Swans forward, and eventually the ball gets to Bice on the run. Six minutes left. Plenty of time for the Swans. Show more posts",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/coalition-public-service-migration-cuts/105085682",
    "title": "'No ambiguity' on Coalition spending, migration cuts — but no specifics yet",
    "publish_date": "Sun, 23 Mar 2025 00:47:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Coalition's top economic spokesperson is unable to confirm the size of the opposition's planned public service and migration cuts, the taxpayer cost of building nuclear power plants, or how it would limit government spending.\n\nShadow Treasurer Angus Taylor told the ABC's Insiders on Sunday there was \"no ambiguity\" the Coalition would reduce spending growth, migration, the public service, and long-term energy costs.\n\nBut just weeks out from the federal election, the opposition has yet to finalise specifics for any of these four centrepiece policies, with Mr Taylor suggesting they would be finalised only after Tuesday's federal budget.\n\n\"We're making promises we know we can afford, but we're going to see what is in the budget and how much headroom there is,\" he said.\n\nTaylor walks back 25 per cent net migration cut\n\nMr Taylor declined to repeat the commitment he made in the wake of last year's budget that the Coalition would cut net migration by 25 per cent.\n\nDutton walks back promise to cut net migration Photo shows Peter Dutton wearing high vis and touring a brick factory The opposition leader said the Coalition would decide its plans for net migration after the election, contradicting a promise in May to nearly halve the intake.\n\nThe opposition does plan to cut the number of permanent visas granted each year by 25 per cent, through cuts to the humanitarian program and other migration streams.\n\nBut there have been mixed signals about its plans for the net figure, which includes temporary entrants such as international students and short-term workers.\n\n\"International student numbers have broken all records … We'll put out [our] numbers when we see the budget, but what you can be clear about, no ambiguity about this, is it will be lower under us,\" Mr Taylor said.\n\nNet migration has been at the centre of political debate since it exceeded half a million the year after the pandemic. Budget papers include a forecast for the figure, but not \"targets\" since the government does not directly control the size of temporary visa programs.\n\nLabor sought to change this by legislating a cap on international student numbers but was forced to find alternatives after the Coalition voted against it.\n\nMr Taylor suggested he was not concerned if Australia's economy contracted after a cut, having been bolstered in recent years from the effects of migration.\n\n\"GDP per capita is the number that matters to Australians and it's gone backwards for seven consecutive quarters under this government,\" he said.\n\nTaxpayer cost of nuclear plan unclear\n\nThe shadow treasurer said the Coalition's nuclear policy, which would see several nuclear plants built and owned by the government over the course of decades, would result in a 44 per cent reduction of energy costs over the long term compared to Labor's plans.\n\nLabor promises to shave $150 off energy bills Photo shows chalmers side profile The federal government will extend its energy bill subsidies until the end of 2025 as it frames its re-election pitch to voters around the cost of living.\n\nThat figure comes from Coalition-commissioned modelling that Labor contests. The same modelling estimates the total system cost of the Coalition plan would be $331 billion.\n\nMr Taylor said \"a significant portion\" of the cost, including the cost of transmission lines, would be paid for by the private sector.\n\n\"Let's be clear, that's not all paid by government. A significant portion will be private sector investment … We'll restrict government's role to what is absolutely necessary, [such as] the seven nuclear generators.\n\n\"They'd cost [taxpayers] under $20 billion each. We've been clear about that.\"\n\nHint that public service cuts would number at least 36,000\n\nMr Taylor affirmed the Coalition's intention to return the number of public servants to the levels seen when it was last in office.\n\nCutting public service won't save much money: Productivity Commission Photo shows Woman in red smiles at camera. The Coalition has vowed to cut waste from the government bureaucracy after criticising Labor for growing the public sector.\n\nOn current numbers, that implies a cut of 36,000 jobs, but Mr Taylor suggested that figure could increase.\n\n\"We don't know how many positions Labor has put in place. We'll find out more in the budget. The last number we had was 36,000. It's been growing more, we know that,\" he said.\n\n\"What we've been clear about is we want to get back to where we were when we were last in government. That shouldn't be in areas of frontline services. It should be in the back office areas.\"\n\nLabor's increase to the public service headcount has included new staff to process the backlog of claims in the Department of Veterans' Affairs and new staff at Services Australia. It has also claimed budget savings from shifting work away from external consultants and back to the public service.\n\n\"The idea that there are people sitting around in Canberra doing nothing shows how out of touch Peter Dutton is,\" Prime Minister Anthony Albanese told reporters on Sunday.\n\nMr Taylor said there were \"some amazing people in our public service, but a bigger team is not always a better team\".\n\nPledge to limit spending growth\n\nHe also promised the Coalition would introduce a budget rule to limit the rate of government spending growth to no more than the growth rate of the economy.\n\n\"It's what we did when we were last in government and it worked,\" he said.\n\nThe latest budget figures show spending growth of 5.7 per cent in the current financial year, comfortably exceeding that limit, then falling below it for the next three years.\n\nThe Coalition's finance spokesperson Jane Hume said this would be achieved by taking further steps to limit the cost of fast-growing government spending programs such as the NDIS.\n\n\"We would hope that when Labor goes into opposition they would work with us [on further NDIS measures],\" she said in a Sky News interview.\n\nAsked whether the Coalition had a specific target for NDIS spending growth, which is currently forecast to be 8 per cent on average over the next decade, she said, \"The most important thing is in the long-term that all government spending doesn't grow faster than the economy itself.\"\n\nTreasurer Jim Chalmers said that would mean \"huge cuts to the NDIS and that would send a shiver up the spine of people who rely on the program\".\n\n\"We are way too late in the term for those characters to still be making it up as they go along,\" he said.\n\nIn an ABC interview, Mr Chalmers said Mr Taylor and Opposition Leader Peter Dutton were \"falling apart before our eyes\".\n\n\"They either haven't done the work or won't come clean on their secret cuts or both,\" he said.\n\nMr Taylor did not say whether the Coalition planned to increase defence spending.\n\nMr Chalmers told the ABC Tuesday's budget would not see an increase in the overall level.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-03-23/kalgoorlie-wine-geoff-paynter-kalgoorlie-vineyard-harvest/104873074",
    "title": "Meet the man who makes dessert wine in the desert",
    "publish_date": "Sun, 23 Mar 2025 00:40:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's just before six in the morning, but the grape harvest is already well underway.\n\nBright green leaves are a stark contrast from the dusty red soil the vines climb out of.\n\nWhile the sun has only just begun to rise over the vineyard, it's already close to 30 degrees.\n\nBut the scene is taking place hundreds of kilometres — 834 kilometres, to be precise — from the heart of WA wine country.\n\nThe vines produce primarily shiraz grapes. (ABC Goldfields: Robert Koenig-Luck)\n\nKalgoorlie winemaker Geoff Paynter is expecting about a dozen of his friends to show up to help pick the year's vintage.\n\nHe wouldn't be surprised if there's a couple of no-shows.\n\n\"It's going to be a hot day, I think they're predicting 46,\" he says.\n\nMr Paynter says Kalgoorlie has a history of vineyards due to Italian migrants. (ABC Goldfields: Katrina Tap)\n\nWinemaking tradition\n\nWA's largest, and only, inland city Kalgoorlie-Boulder is best known for its gold mining, arid climate and plentiful pubs.\n\nIt's probably the last place you'd expect to find a vineyard.\n\nMr Paynter begs to differ.\n\nGeoff Paynter has run Binduli wines in Kalgoorlie since 2001. (ABC Goldfields: Robert Koenig-Luck)\n\n\"Kalgoorlie-Boulder's always had a big history of Italians, and they all had vineyards in their backyard,\" he says.\n\n\"Over the years that's probably died out, but it was certainly not uncommon for Kalgoorlie.\"\n\nA gold nugget suspended in wine is a nod to the gold-mining region. (ABC Goldfields: Robert Koenig-Luck)\n\nA mining surveyor by trade, Mr Paynter can generally be found tending to his vines at weekends.\n\n\" I think as a surveyor, I should be able to get the rows pretty straight. \"\n\nA week before harvest, he stops watering the grapes and lets the skin become slightly raisined to increase the sugar content.\n\nIt's a critical step in producing the port that Mr Paynter's vineyard Binduli is best known for.\n\nGrowing a vineyard in a water shortage\n\nCentury-old water idea revived on the WA campaign trail Photo shows A water pipeline runs parallel to the Great Eastern Highway in WA. The WA Nationals' $100 million proposal to pipe desalinated seawater to Kalgoorlie taps a long history of grand plans that have tripped up governments and oppositions alike.\n\nDespite its isolation, Mr Paynter says the region's overall climate is similar to high-profile wine regions such as South Australia's Riverland and the Riverina in New South Wales.\n\nBut the lack of a regular water supply remains a challenge.\n\n\"Only difference is they have a big river going through the middle, we don't even have groundwater here we can use,\" he says.\n\n\"If you go 150 metres down you might hit super hyper-saline water, which you can't use for anything.\"\n\nThe aim is to finish the harvest by mid-morning. (ABC Goldfields: Robert Koenig-Luck)\n\nKeeping a vineyard alive in an arid climate is not without challenges.\n\nMr Paynter has gone from watering the vineyard every day to once a week, amid city-wide water shortages.\n\n\"When I first moved here, there was a dairy, there were veggie patches,\" he says.\n\n\"The oval just up the road was an orange grove.\n\n\"I had bigger plans, but water is the biggest issue in Kalgoorlie, so I'm a bit limited there.\"\n\nBunches are destemmed and grapes are churned before they are left to ferment. (ABC Goldifelds: Robert Koenig-Luck)\n\nTribute to late wife\n\nInside the winery, the floor is starting to fill up with buckets of grapes.\n\nMr Paynter fires up the de-stemming machine.\n\nHe lifts the buckets above his head, tipping the grapes into a chute at the top.\n\nThe crushed grapes trickle into a large steel vat, filling the warehouse with a sweet smell.\n\nEmpty stems funnel out the side.\n\nMr Paynter's late wife, Kathryn. (Supplied: Geoff Paynter)\n\nMr Paynter originally established Binduli Winery in 2001 with his wife Kathryn.\n\n\"I was making the wine, and Kathryn was trying to sell it, and market it and the like,\" he says.\n\n\"When she passed on, that sort of stalled a bit. So now I'm trying to regroup and get going again.\n\n\" She's always with us. \"\n\nFriends and family on hand to help\n\nHelping hands continue to rustle through the leaves to find hidden bunches of grapes.\n\nFriend and former federal MP Tony Crook is one of them.\n\n\"It's always nice to come back here and remember Kathryn fondly,\" he says.\n\nTony Crook joins the harvest crew at 6am. (ABC Goldfields: Robert Koenig-Luck)\n\nMr Crook has helped with the annual harvest for more than 20 years.\n\n\"Every year this is a bit of a ritual for us,\" he says.\n\n\" All of his mates are just happy to help out. \"\n\nWith few grapes left to prune, Mr Paynter's reinforcements gather in the air-conditioned winery to find reprieve.\n\nIt will be a while before they can try the fruits of their labour.\n\nThe grape juice will spend time fermenting before it is aged in oak barrels for months.\n\nBut they aren't too worried, with cold cans of squash and ginger beer on offer.\n\n\"Kalgoorlie is all about friends, there's a lot of people I call friends here in Kalgoorlie,\" Mr Paynter says.\n\n\"Kalgoorlie's good for that.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-03-23/historic-toowoomba-saleyards-close-after-79-years/105004624",
    "title": "'Good times, good people': Old mates say goodbye to historic saleyards",
    "publish_date": "Sat, 22 Mar 2025 23:36:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Early on a gusty morning, Greg Iseppi, Barry Coonan, and Leo McMahon pull their utes into the local livestock saleyard.\n\nIt's a place they've visited thousands of times, but on this occasion, it's different.\n\nThe site, once bustling with bran-coloured hats, cattle, horses, and pigs, is now empty.\n\nInstead, weeds, padlocks, and decaying timber and metal greet them.\n\nThe buyers' lanes have become overgrown with weeds. (ABC Rural: Brandon Long)\n\nElders, the agribusiness that has leased the yards and offices in the Toowoomba suburb of Harristown, is moving to a nearby, yardless facility in June.\n\nIn lieu of a company sweeping in to spend millions on the complex, it likely spells the end of livestock sales in Australia's second-largest inland city after more than 160 years.\n\nFor the trio in their 80s, it's probably their last visit to the site that's played a significant role in their lives and the agricultural community.\n\nGreg started as a stock hand and livestock transporter before spending most of his career jostling among the buyers' lanes (1956–2024); Leo worked as an auctioneer for Elders, pacing the towering catwalks selling stock (1960–2003); and Barry controlled stock in the loading area and along the dirt races (1957–2015).\n\nLeo, Greg, and Barry share yarns about the old days on the catwalk. (ABC Rural: Brandon Long)\n\nSales were held every Monday — and Wednesdays and Fridays for a time — and the men are adamant they only missed a few.\n\nThe routine was intense and the work, often physical and demanding, never seemed to let up.\n\n\"You spent a big portion of your life in the saleyards,\" Leo recalls.\n\nWhen large yardings were logged, work could stretch over days.\n\n\"You'd start Sunday afternoon, and some nights we'd work through here till six o'clock Monday morning,\" he remembers.\n\n\"Then you'd go home and have a shower and be back here to start at seven o'clock [in the morning], finish at midnight or later on Monday night, and then back on Tuesday night for Wednesday's sale.\"\n\nLeo McMahon retired from auctioneering in 2003, but still buys the odd cow for clients. (ABC Rural: Brandon Long)\n\n'Fiercely competitive'\n\nThe saleyards could be fiercely competitive — especially between buyers.\n\nGreg recalls the tough initiation for newcomers, with some established buyers willing to bid above market price to discourage rookies.\n\n\"There's no sympathy in this game,\" Greg says.\n\n\"If you were a new buyer, you'd always cop the chop.\"\n\nBuyers also played tricks on auctioneers, especially young or inexperienced ones, pranking them with false bids.\n\n\"You might have a bit of a stoush in the morning, but in the afternoon, you'd be the best of mates again,\" Leo says with a laugh.\n\nBarry Coonan, Leo McMahon, and Greg Iseppi started working at the Toowoomba saleyards in 1957, 1960 and 1956 respectively. (ABC Rural: Brandon Long)\n\nIconic moments\n\nBy the 1960s, the Toowoomba saleyards was one of Australia's largest, with up to 7,000 head of cattle sold weekly.\n\nSince starting at the saleyards, the trio witnessed many pivotal changes and events.\n\nIn the 1960s there was the shift from pounds to dollars, followed by the move to weighing scales and cents per kilogram pricing in the 1970s.\n\nIn the same decade, the Southern Queensland site was also a pioneer in adopting technology when it introduced computer-driven results — the first in Australia to do so, Leo proudly states.\n\nBut after six decades in the business, one memory stands out for the men: the 1970s cattle price crash — the worst in Australian history.\n\n\"You just went on for weeks at a loss,\" Leo recalls.\n\n\"It was hard on everybody.\"\n\nLong history\n\nMcPhie and Co operated saleyards in the suburb of Newtown (pictured) before establishing yards in Harristown in 1946. (Supplied: Toowoomba Historical Society)\n\nToowoomba's first saleyard was built in the centre of town in 1860 and plenty of others came and went over the decades that followed.\n\nThe Harristown saleyards — established in 1946 by McPhie and Co — were later taken over by Australian Mercantile Land and Finance Company (AML&F) and then Elders.\n\nElders state operations specialist Allen Smythe says sales were suspended in June 2024 due to concerns over aging infrastructure.\n\n\"We had buyers' walkways that were starting to get to a point where they had the potential to fail,\" Mr Smythe said.\n\nHe says the necessary upgrades \"could not stack up commercially\", citing the $500,000 already spent on gate upgrades.\n\nThe sales never returned.\n\nAerial mapping from 1946 shows the saleyards on South Street. (Supplied: Toowoomba Regional Council)\n\nIn recent years, cattle throughput declined dramatically, dropping from 48,111 head of cattle sold in 2013–14 to just 11,310 by 2023–24, representing only 1 per cent of Queensland's total cattle transactions.\n\nThe seven-hectare site, owned by a Sydney family, is listed for sale.\n\nWhile its future is uncertain, Elders head of property Paul Scrivener believes the yards will likely be demolished and the site \"will be a residential development\".\n\nThe state's sixth saleyard closure in 13 years has upset local farmers who will now need to travel up to 300 kilometres to facilities in Dalby or Warwick.\n\nIt comes as the Lockyer Valley Council last month reversed its decision to close the Laidley Saleyards, committing to funding the facility.\n\nBarry Coonan was a stockman at the Toowoomba Saleyards when he met his wife, Roslyn, who worked in the weigh scales area. (ABC Rural: Brandon Long)\n\nNo regrets\n\nDespite the long hours, tough conditions and modest pay, Greg, Barry, and Leo never seriously considered leaving.\n\nThe place 'worth half a dozen psychologists' to farmers Photo shows Older man wearing blue work shirt stands in a paddock, smiling. Saleyards aren't just about cattle and sheep, they offer vital social connection to farmers. But as more complexes close, rural communities worry about the mental health impacts of losing them.\n\n\"You were poor and happy,\" Leo says.\n\n\"Stock was what we lived and breathed,\" Greg reflects.\n\nBarry agrees.\n\n\"If I had my life over, I'd do it again,\" he says.\n\nFor Barry, it's especially true, since he met his wife there.\n\nThe closure ends a community tradition that brought people together week after week, year after year.\n\nSeated next to his mates on an old timber bench outside the livestock pens, Greg admits he'll miss the social side of the work.\n\nGreg, Leo, and Barry have no regrets when it comes to their livestock careers. (ABC Rural: Brandon Long)\n\n\"You really do miss seeing a lot of people who always came here on a Monday, just for the morning out,\" he says.\n\nLeo looks over at the other two.\n\n\"You virtually put the whole of your life into this,\" Leo says.\n\n\"A lot of good times, and a lot of good people.\"\n\nIt's the end of an era for Barry, Leo, and Greg who saw each other every week for decades at the saleyards. (ABC Rural: Brandon Long)",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/rome-s-lesser-known-other-sistine-chapel-is-a-frenzy-of-opulence-20250310-p5libk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rome’s lesser-known ‘other Sistine Chapel’ is a frenzy of opulence",
    "publish_date": "Mon, 24 Mar 2025 00:00:00 +1100",
    "category": "music",
    "authors": [
      "David Whitley"
    ],
    "text": "Entering the Sistine Chapel is an exercise in wonder. It is swathed in art, seemingly no expense spared, and there’s barely a soul inside to detract from the visual onslaught.\n\nTo anyone who has been to the Sistine Chapel in the Vatican’s Apostolic Palace, this description will not ring quite true. The price for seeing Michelangelo’s Last Judgment and world-renowned ceiling frescos in the Vatican is a torrid experience amid hundreds of jostling, herded bodies.\n\nThe impressive dome ceiling in Santa Maria Maggiore Basilica in Rome. Credit: Getty Images\n\nHowever, the Vatican’s Sistine Chapel is not the only one in Rome. And the one inside the Basilica Papale di Santa Maria Maggiore, on the Esquiline Hill, is much quieter.\n\n“Sistine”, it turns out, is not a word reserved for a place of transcendent heavenly beauty. It just means that it’s named after a bloke – or, in this case, a Pope – called Sixtus. The chapel in the Vatican was commissioned by Pope Sixtus IV in 1473, and the one in the Basilica di Santa Maria Maggiore began construction in 1585 at the command of Pope Sixtus V.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/books/a-gen-x-icon-bares-all-about-john-cusack-river-phoenix-and-her-past-20250320-p5ll7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Gen X icon bares all about John Cusack, River Phoenix and her past",
    "publish_date": "Mon, 24 Mar 2025 00:00:00 +1100",
    "category": "music",
    "authors": [
      "Nathaan Smith"
    ],
    "text": "MEMOIR\n\nSay Everything\n\nIone Skye\n\nHarperCollins, $34.99\n\nThe company of other girls with famous fathers – Mick Jagger’s Karis and Mick Fleetwood’s Amelia – gave young Ione Skye comfort from the pain of also having a distant superstar parent.\n\nHer father, the Scottish folk singer Donovan, abandoned Skye and her brother when they were toddlers. The flower power music figure would refer to her only as “the girl” in letters, later even insisting on a paternity test during her teen years. But reveries of a reconciliation were frequent: “I often fantasised that one day my dad would … be overcome with regret for not getting to know such a wonderful girl,” the actress writes in her new memoir Say Everything.\n\nThe Generation X icon, best known for roles in the 1980s films River’s Edge and Say Anything, insists there’s no connection between his abandonment and her adult desire for attention in the spotlight. But Donovan does cast a long shadow over Skye’s life, with the 54-year-old acknowledging that she often struggled with his absent presence.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/superquiz-monday-march-24-20250321-p5llfu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superquiz, Monday, March 24",
    "publish_date": "Sun, 23 Mar 2025 23:59:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Compiled by Michelle Stillman\n\nLooking for Target Time?\n\nWe have a new digital version of our popular nine-letter puzzle. See how many words you can find and how long it takes you to discover the Target word. You can share your results. Premium subscribers can play Target Time here.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/europe/pope-francis-to-be-discharged-from-hospital-on-sunday-says-doctor-20250323-p5llpv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pope Francis appears in public for the first time since life-threatening pneumonia",
    "publish_date": "Sun, 23 Mar 2025 22:31:37 +1100",
    "category": "lifestyle",
    "authors": [
      "Nicole Winfield"
    ],
    "text": "The doctors spoke at a hastily called press conference on Saturday evening in the hospital atrium, their first in-person update on the pontiff’s condition in a month. They said they were discharging Francis after he registered two weeks of stability and increasing progress in his recovery. Loading “The Holy Father would have wanted to go home a few days ago, as even he realised he was improving, breathing better, and that he could work longer. But I have to say he was an exemplary patient,” said Dr Sergio Alfieri, who co-ordinated Francis’ medical team at the hospital. “He listened to the suggestions from me, Dr Carbone and the rest of the team.” Doctors provided details on the severity of the infection and Alfieri noted that not all patients who developed such a severe case of double pneumonia survived, much less be released from the hospital. “When he was in really bad shape, it was difficult that he was in good spirits,” Alfieri said. “But one morning we went to listen to his lungs and we asked him how he was doing. When he replied, ‘I’m still alive’ we knew he was OK and had gotten his good humour back.”\n\nAlfieri confirmed that Francis was still having trouble speaking due to the damage to his lungs and the time he spent on supplemental oxygen and ventilation. But he said such problems were normal and predicted his voice would return. “When you have a bilateral pneumonia, your lungs get damaged and the respiratory muscles are in difficulty. You lose your voice a bit, like when you speak too high,” Alfieri said. “As for all patients, young or old but especially older ones, you need time for it to come back as it was.” Alert and co-operative The Argentine pope, who has chronic lung disease and had part of one lung removed as a young man, was admitted to Gemelli after a bout of bronchitis worsened.\n\nDoctors first diagnosed a complex bacterial, viral and fungal respiratory tract infection and soon thereafter, pneumonia in both lungs. Blood tests showed signs of anaemia, low blood platelets and the onset of kidney failure, all of which later resolved after two blood transfusions. Loading The most serious setbacks began on February 28, when Francis experienced an acute coughing fit and inhaled vomit, requiring the use of a non-invasive mechanical ventilation mask to help him breathe. He suffered two more respiratory crises a few days later, which required doctors to manually aspirate “copious” amounts of mucus, at which point he began sleeping with the ventilation mask at night to help his lungs clear the accumulation of fluids. At no point did he lose consciousness, and doctors reported he always remained alert and co-operative. Over the past two weeks, he has stabilised and registered slight improvements. He no longer needs to wear the ventilation mask at night, and is cutting back his reliance on high flows of supplemental oxygen during the day. Doctors said the pope, who uses a wheelchair, had probably lost some weight during his hospital stay.\n\nAt his home in the Santa Marta hotel, next to St Peter’s Basilica, Francis will have access to supplemental oxygen and 24-hour medical care as needed, though Carbone said he hoped Francis would progressively need less and less supplemental oxygen. Francis will continue to take oral medication for several months to treat the fungal infection in his lungs. Pope Francis in the private chapel on the 10th floor of Rome’s Gemelli Hospital. Credit: Holy See Press Office Alfieri said it was actually safer for him to continue his recovery and rehabilitation at the Vatican since hospitals “are the worst place to convalesce because it’s the place where you can catch the most infections”. The Vatican spokesman, Matteo Bruni, declined to confirm any upcoming events, including a scheduled audience on April 8 with King Charles III or Francis’ participation in Easter services at the end of the month. But Carbone said he hoped Francis might be well enough to travel to Turkey at the end of May to participate in an important ecumenical anniversary.",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/politics/federal/budget-to-reveal-tax-burden-at-its-lowest-since-pandemic-20250323-p5llsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Budget to reveal tax burden at its lowest since pandemic",
    "publish_date": "Sun, 23 Mar 2025 22:30:00 +1100",
    "category": "finance",
    "authors": [
      "David Crowe",
      "Shane Wright"
    ],
    "text": "Taylor criticised Chalmers for not setting a benchmark for tax as a percentage of gross domestic product, a key point for the Coalition after it set a goal of 23.9 per cent a decade ago. “Tax has been going up. Those fiscal guardrails, by the way, the reason they are so important is they discipline the government. They discipline the bureaucracy. They discipline colleagues, and Jim Chalmers has lost control,” Taylor said. The Coalition is vowing to bring the tax target down and to reduce spending growth at the same time, triggering a row with Labor on Sunday about potential cuts to programs. “You would ensure, as we did when we were last in government, your economy grows faster than spending,” Taylor said. “Crucial to that is: boost growth; make sure you’ve got a strong, growing economy. That’s why we’ve said we’ll up the productivity goals – Labor’s given up the ghost on that – and make sure that the economy is growing faster than spending.”\n\nThe budget will show that tax has fallen from 23.7 per cent of GDP last year to 23.1 per cent this financial year, according to sources who spoke on condition they were not named. The new forecast compares with an estimate of 23.4 per cent for the same period in the last budget update. In dollar terms, the lower tax-to-GDP ratio equates to about $6 billion in revenue forgone compared with the slightly higher ratio forecast last year. However, tax receipts will rise in dollar terms from $633.4 billion last year, reflecting the bigger economy. The growth in payments will outstrip the increase in revenue, dragging the budget back into deficit. The government will cite the tax forecast to assure voters it is doing what it can to limit the tax burden on workers, at a time when the Coalition is blaming Labor for loading the federal budget with additional spending.\n\nWhile the Coalition indicated on Sunday it would support the government’s latest spending initiative – a $1.8 billion extension in the subsidies for household energy bills – it also said the policy was giving households something they had already paid for with their taxes. Opposition Leader Peter Dutton called the bill relief a “Ponzi scheme” – a fraud that pretends to offer a financial return by paying early investors with the money collected from later investors – even though Coalition frontbenchers indicated they would support the policy. The budget will contain $2.1 billion in savings and shifts of spending into other areas, just a tenth of the $22 billion the government announced in its first budget in 2022. The cuts include another $720 million reduction in expenditure on consultants, contractors and labour hire, taking to almost $5 billion in savings in this area since Labor took office. Finance Minister Katy Gallagher said the government had made $95 billion in either cuts or reprioritisations since the last election.\n\n“Saving almost $95 billion in a single term of government has meant we can invest in the things that matter most, like cost-of-living support, Medicare and housing,” she said. Loading The Coalition has signalled it will save $6 billion a year by slicing up to 36,000 public servants, prompting accusations from the government that it will reduce services and start re-employing labour-hire workers and consultants. On Sunday, Taylor said the government had allowed the bureaucracy to grow while consumer service had gone backwards. Taylor would not confirm a 36,000 cut, only confirming the Coalition wanted to reduce the public service back to its pre-pandemic level.\n\n“What we’ve been very clear about is we want to get back to where we were when we were last in government,” Taylor told the ABC’s Insiders program. “That shouldn’t be in areas of frontline services. It should be in the back-office areas.” The Coalition has opposed $100 billion in government programs. They include three large off-budget investment vehicles, including the $19 billion Rewiring the Nation Fund, the $20 billion National Reconstruction Fund and the $10 billion Housing Australia Fund, plus Melbourne’s Suburban Rail Loop and the current electric vehicle fringe benefits tax discount. With the budget heading back into deficit after two years of surpluses, Labor has limited means to offer financial help without being blamed for fuelling inflation and delaying further cuts to official interest rates. Albanese seized on the issue of working from home on Sunday morning to accuse Dutton of wanting Australians to be forced to go into the office more days each week, incurring more transport costs. The Labor attack is based on a calculation that Australians would pay $3056 in transport costs, on average nationwide, to get to work two days a week – the key figure in the assumption about what they would have to pay if the Coalition opposed working from home.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/garrick-s-28-point-haul-powers-manly-to-canberra-demolition-20250323-p5lltk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manly ruing likely long-term injury to Paseka in Canberra thrashing",
    "publish_date": "Sun, 23 Mar 2025 22:19:27 +1100",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "Manly may have lost prop Taniela Paseka for the season after he suffered a suspected ruptured Achilles in Sunday night’s 40-12 trouncing of Canberra at Brookvale Oval.\n\nThe towering forward was helped from the field in obvious distress by two trainers after breaking down midway through the first half.\n\nTaniela Paseka was helped from the field. Credit: Getty Images\n\nSea Eagles coach Anthony Seibold said Paseka will need scans to confirm the initial diagnosis, but medical staff were prepared for the worst-case scenario.\n\n“I think he’s booked in for an operation tomorrow, which is really disappointing for Taniela personally, and his family, and us as a club, because he’s been starting front row since I’ve been at the club and someone that we value on and off the field,” Seibold said.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/chinese-grand-prix-2025-live-updates-oscar-piastri-looks-to-bounce-back-from-albert-park-heartbreak-20250323-p5llps.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chinese Grand Prix 2025 LIVE: Sweet glory for Oscar Piastri in Shanghai as he banishes Albert Park heartbreak",
    "publish_date": "Sun, 23 Mar 2025 22:15:56 +1100",
    "category": "sports",
    "authors": [
      "Russell Bennett"
    ],
    "text": "Oscar Piastri drove a nearly faultless race to win in Shanghai. Credit: AP\n\nBayside Melbourne product Oscar Piastri has shown the maturity of a future Formula 1 champion, turning his Albert Park heartbreak into grand prix glory in Shanghai just seven days later.\n\nStarting on pole for the first time in his F1 career, the 23-year-old Piastri was typically cool, calm and collected all race as he kept the best in the business at bay for 56 blistering laps of the Chinese Grand Prix to win his third main race in world motor sport’s premier class.\n\n“It’s been an incredible weekend from start to finish,” Piastri said on Sky after the race, adding that he hoped this victory marked the start of his title charge after finishing ninth in Melbourne.\n\n“[The car was] pretty mega the whole time, I think, today.\n\n“I’m just proud of the whole weekend – this is what I feel like I deserve from last week.\n\n“I’m extremely happy.”\n\nMercedes’ George Russell, Red Bull’s four-time reigning world champion Max Verstappen, and Piastri’s own McLaren teammate Lando Narris – who saluted in Melbourne seven days prior – all pushed Piastri to the brink, but he was unflinching.\n\nThough struggling with wheelspin off the start line at the end of the monstrous Shanghai straight, Piastri kept Russell behind him going into turn one and refused to look back – despite a few hair-raising moments when it came to tyre strategy.\n\nPiastri pitted early from the lead and then stayed on his hard tyres, like the bulk of the field, for the remainder of the race in a true battle of attrition.\n\n“The hard was a much better tyre than everyone expected, I think,” Piastri said of what was essentially a wire-to-wire win.\n\n“To go all the way to the end like that was a bit of a surprise, but a happy surprise.”\n\nPiastri – who after the race said his heritage is part-Chinese, to the roar of the crowd – held his nerve as Norris pushed in second, both of them trying desperately to keep the “dragster” (in the words of Ferrari racer Charles Leclerc) of Russell’s Mercedes behind them.\n\nFor his part, Norris congratulated Piastri for his win.\n\n“Turn one went to plan, but then George [Russell] got me in the pit stops and I was a little bit nervous because our pace was a lot better in the second stint … it was a tough race, just with the management [of it],” Norris said.\n\n“I don’t think many people expected a one-stop today. Oscar drove well, he was quick the whole race – I tried to get close, but in the end I just couldn’t.”\n\nNorris was asked if he could have fought Piastri for the win, to which he replied: “It doesn’t matter now really, does it? He deserved the win, and he drove very well all weekend.”\n\nPiastri had finished second in the sprint race on Saturday before setting two lap times good enough for pole position in claiming the top spot on the grid for the first time in his career.\n\nThere’d be no repeat of Albert Park, where Piastri slid off on lap 44 while battling Norris for the lead. This was redemption.\n\nPiastri summed it up best following the win: “The car was very lovely ... great team effort. That is one satisfying weekend,” he said at his understated best over the radio.\n\nNorris tried everything to push Piastri to the brink again, but this time around the Australian had the race lead to his advantage – setting the race pace, and looking after his tyres after what initially loomed as an action-packed two-or-three-stop race. Norris, by contrast, struggled with his brakes in the race’s closing stages.",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/raiders-left-puzzled-by-denied-try-20250323-p5lluw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Raiders left puzzled by denied try",
    "publish_date": "Sun, 23 Mar 2025 21:43:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "Raiders left puzzled by denied try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/afl/eagles-emphatic-response-falls-short-as-lions-escape-20250323-p5lltj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Roos torched Dees in 11 minutes; Reid set for scrutiny after flipping the bird; Swans sink Dockers in thriller",
    "publish_date": "Sun, 23 Mar 2025 21:22:28 +1100",
    "category": "sports",
    "authors": [
      "Marc Mcgowan",
      "Peter Ryan"
    ],
    "text": "Xerri won the tap, and Powell won a test of strength with Christian Petracca, who slipped to the Marvel Stadium surface as the emerging Roo swooped on the Sherrin and thumped a chaos ball into attack. Petty got his hands to it, fumbled, then the elusive Robert Hansen jnr – who has improved at a rapid rate – produced some fancy footwork before dishing a handball to Larkey for another goal. By this time, Melbourne coach Simon Goodwin had hurried to ground level to join his team on the bench. The Demons fended off another centre clearance and actually managed a shot at goal, but Petracca’s long potshot landed in Aidan Corr’s hands. It was a chance for North to score another way. Corr started a scoring chain from the last line of defence, with Stephens, 300-gamer Jack Darling and Sheezel getting involved, then Hansen jnr shook a tackle and handballed to Curtis, who found Cam Zurhaar for another goal. That was the Kangaroos’ fourth in barely seven minutes, and it was apparent the game was over – but the avalanche was not.\n\nAfter leading by 18 points at three-quarter-time, North Melbourne were suddenly seven goals clear. The next one came via a horror Ed Langdon turnover. Melbourne’s winger had Clayton Oliver nearby, but somehow ballooned the ball over his head to North recruit Luke Parker, who instantly handballed to Simpkin to set up Curtis’ third goal. Tristan Xerri had the better of the ruck battle with Max Gawn. Credit: Getty Images Even elementary errors turned to gold for the Kangaroos. Minutes later, Davies-Uniacke dropped a chest mark, but recovered, busted through multiple Demons, and blasted his team inside 50. What seemed certain to be a stoppage instead transformed into another goal-scoring opportunity as the ball bobbled into the clear, and Zurhaar banged through his fourth. The damage had long been done, but only then did North Melbourne relent ever so slightly.\n\n“[It is] very satisfying because they’re a high-quality midfield, and it’s really hard to get on top of them,” Clarkson said. “I thought ‘X’ [Xerri] was fabulous in the ruck against Max, and that’s where the ascendancy came from. I think we had four centre-bounce goals in the last quarter, and that really broke the back of the Melbourne side, when it can just pop straight out of the centre, and you get a goal straightaway. “I think we had four goals in the first five minutes of the last quarter, in a game where only two or three goals were separating the sides for the bulk of the day. It was really important that we were able to split it open in a quick space of time.” North Melbourne finished with 52 more disposals, 12 extra clearances and plus-19 in contested possessions, yet Melbourne won the inside-50 count by three, largely based on their territory dominance in a wasteful third quarter. Goodwin was understandably disappointed post-match, but offered an explanation for his captain Gawn’s rare down day.\n\nXerri finished with 20 disposals to Gawn’s 11 and 12 clearances to one, as well as outmarking the champion Demon before kicking a goal to start the second half. “Today, I think [Gawn] will acknowledge that he got beaten by a really good opponent, but you also have to realise that, in life, there are other things that are going on,” Goodwin said. “We’ll support Max. He’s a great person, he’s a great leader, and there’s a backstory to everyone’s performance. Max is someone who we take enormous pride in, and he’s going to continue to be a great leader for this footy club, and be a big part of our response. “I’m not going to go into the details, but … he’s someone who we love dearly.” Matt Jefferson suffered a fractured hand in a contest late in the first quarter, while Jake Lever rolled his left ankle.\n\nMarc McGowan Reid set for AFL scrutiny after flipping crowd the bird West Coast have fallen short of inflicting one of the great turnaround victories, pushing defending champions the Brisbane Lions to the brink at the Gabba. The Eagles, who had been dominated at the contest by Gold Coast in an 87-point loss last week, stormed out of the gates, kicking the first five goals of the match. They led at every break, but the Lions proved too good in the end, prevailing 14.10 (94) to 11.9 (75). Harley Reid gave the Brisbane crowd the finger. Credit: Fox Footy\n\nStar West Coast youngster Harley Reid may have to deal with AFL scrutiny on top of the loss after he flipped the bird towards the crowd in the final term. Reid was being heckled by Lions supporters, including one who appeared to be loudly offering him a pack of tissues. Reid (15 touches, seven tackles, six clearances) worked hard and was a playful target for the 30,000-strong crowd whenever he hit the deck. He could face a financial sanction for his act. Retired Richmond star Dustin Martin was fined $7500 ($5000) in 2019 for giving GWS ruckman Shane Mumford the finger, though that involved a secondary gesture, while ex Carlton skipper Marc Murphy was fined $900 for giving the Collingwood cheer squad the finger in 2012. Reid’s coach Andrew McQualter defended his gesture to the crowd. “We try to bash the theatre out of this game sometimes, don’t we? He’s just having a bit of fun. Sometimes that’s good for the game I think,” McQualter said. On Sunday, it was West Coast winning the early battles after a steamy midday start, while their defensive set-up also rattled the Lions, who last week conceded the first four goals against Sydney but still won.\n\nMcQualter demanded more from his team against the premiers than they showed in round one, and his side responded. Attempts to move the ball quickly were continually undone by McQualter’s men, with the Lions repeatedly rushed into mistakes and adding unforced errors as the Eagles shot ahead and maintained a 24-point lead until the main break. The action was intense early on, with Jarrod Berry battling for possession with Jayden Hunt. Credit: AAP It muted a shell-shocked crowd, who had minutes earlier watched club legends Simon Black and Alastair Lynch help unfurl their premiership flag for the first time since that pair helped win the last of their three-straight titles in 2003.\n\nEagles wingman Tyrell Dewar was impressive early, the second of his two quick goals a mighty effort from outside 50 metres from another smooth transition from the centre square. Loading Liam Ryan launched the first of his three goals too, the premiership veteran on song along with Tim Kelly (29 disposals) and Liam Baker (24), who enjoyed a spirited running battle with Brisbane star Lachie Neale (35). Restricted to just 10 touches in last week’s defeat of Sydney, Neale had 11 by quarter time. He snapped a handy goal in the second quarter to keep the Lions close then set up a Zac Bailey goal with another pinpoint kick forward.\n\nBrisbane edged within six points when Callum Ah Chee kicked two goals to begin the third term. The Eagles missed chances to surge clear again, twice hitting the post, having another touched on the line and wasting an opportunity from close range. Ah Chee’s third for the term gave the Lions their first lead since kicking the game’s opening point, but the expected deluge from the home side didn’t quite come. Jack Petruccelle’s goal moments after he was subbed on put the Eagles back in front, and Tyler Brockman’s final-quarter double kept them close. But the hosts chipped away, Josh Dunkley snapping truly and Logan Morris soaring to mark and kick his second that effectively iced the contest, before he added a third.\n\nBrisbane debutant Will McLachlan kicked two goals, winger Jaspa Fletcher was a standout when the chips were down and added a late goal, while Dayne Zorko’s (28 disposals) influence grew approaching half-time. AAP Swans sink Dockers in thriller Chad Warner has put on a star display and Joel Amartey kicked the match-winner with less than 90 seconds remaining as Sydney pulled off a stunning three-point win over Fremantle at Optus Stadium. The Dockers led by 22 points at quarter-time and were still clinging to a slender lead as the clock wound down in Sunday’s match in front of 43,882 fans.\n\nAmartey gave Sydney the lead when he out-muscled Brennan Cox in a marking contest before calmly slotting the 20m set shot with 86 seconds remaining. In a frantic finish, Fremantle surged forward for one final attack with just seconds remaining. Joel Amartey booted two goals, one of which was the match-winner. Credit: AFL Photos via Getty Images A long kick into attack was marked by Dockers forward Jye Amiss, but the siren had sounded just a second earlier, giving Sydney the 9.14 (68) to 9.11 (65) win. The result marked Dean Cox’s maiden AFL win as Sydney coach and ensured the Swans avoided slipping to a 0-3 record heading into their bye week.\n\nWarner, who is being hotly pursued by Fremantle and West Coast, finished with 26 disposals and 10 inside-50s. Sydney tagger James Jordon (24 disposals, 10 clearances) nullified the influence of Caleb Serong (19 disposals, five clearances, one goal) in a critical shut-down role. Chad Warner with a game-high 26 touches. Credit: AFL Photos via Getty Images Jaeger O’Meara (32 possessions) and Nathan O’Driscoll (25) racked up big numbers for Fremantle, while Josh Treacy kicked four goals. Star Dockers recruit Shai Bolton looked rusty on the way to 15 disposals and four clearances.\n\nFremantle defender Brandon Walker was subbed off in the second quarter with a left shoulder injury. The Dockers and the Eagles are 0-2 heading into next Sunday’s western derby. Shai Bolton appeared rusty on the way to 15 disposals and four clearances. Credit: AFL Photos via Getty Images In a pressure-filled opening quarter, Fremantle made the most of their chances by kicking four goals to nil to take a 22-point lead into the first break. Treacy kicked the first two goals of the match, and fellow bigs Luke Jackson and Patrick Voss also hit the scoreboard as Fremantle flexed their muscle.\n\nSydney failed to capitalise on a 10-5 advantage at the stoppages on the way to spraying 0.5 for the term. But they fared much better in the second quarter with three goals. A bit of midfield magic from Warner allowed Peter Ladhams to kick Sydney’s first goal of the match. And when Warner snared a goal himself later in the term, the margin was just four points as the boos rang around Optus Stadium. Serong was largely nullified by Jordon in the opening half but managed to pop up for a goal to give Fremantle a nine-point buffer at half-time.\n\nSydney’s stoppage dominance meant Fremantle were forced to defend for prolonged periods in the third quarter. The Swans hit the lead late in the term, but Bailey Banfield’s tough set shot from near the boundary gave Fremantle a two-point edge at the final change. Dean Cox sings the Swans’ anthem for the first as senior coach. Credit: Getty Images Sydney surprisingly subbed off ruckman Brodie Grundy 11 minutes into the final term, and Amartey limped off just minutes later with a corked leg. Amiss scored the first goal of the last term at the 14-minute mark, but mature-age recruit Riley Bice replied a short time later with his maiden AFL goal.\n\nAmartey came back on the field and popped up for the match-winner. Dangerfield escapes suspension for Byrnes incident Geelong skipper Patrick Dangerfield will be available for the preliminary final rematch against the Brisbane Lions after receiving a fine for elbowing St Kilda’s Ryan Byrnes in the head during the third quarter of Saturday night’s loss. The veteran Cat’s striking action was ruled low impact and careless. Although he caught Byrnes high, his elbow slipped off Byrnes’ shoulder before making contact with his head. Geelong’s Patrick Dangerfield makes late contact on St Kilda’s Ryan Byrnes. Credit: Fox Footy\n\nThe decision is a relief for the Cats, given champion defender Tom Stewart is likely to be unavailable with a knee injury that resulted in him being subbed off in the first quarter against the Saints. Cats coach Chris Scott said post-game the injury was minor, although there are concerns Stewart may have suffered a PCL injury as he landed heavily on the ground. Jeremy Cameron also appeared hampered by a lower leg injury, but the club said it was not worried about the availability of the forward. Dangerfield was one of 13 players fined after Saturday’s matches. Young Eagles midfielder Harley Reid might be added to the list after Sunday’s games are assessed.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/bushfire-comes-close-to-homes-in-perth-20250323-p5lluv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bushfire comes close to homes in Perth",
    "publish_date": "Sun, 23 Mar 2025 21:13:50 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bushfire comes close to homes in Perth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/politics/federal/best-of-cartoons-march-24-2025-20250323-p5lluu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best of cartoons, March 24, 2025",
    "publish_date": "Sun, 23 Mar 2025 21:11:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Best of cartoons, March 24, 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/the-hairpin-of-my-life-five-key-moments-from-piastri-s-china-win-20250323-p5lltb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The hairpin of my life’: Five key moments from Piastri’s China win",
    "publish_date": "Sun, 23 Mar 2025 20:59:37 +1100",
    "category": "sports",
    "authors": [
      "Matthew Clayton"
    ],
    "text": "Unruffled, matter-of-fact and devoid of histrionics: an apt description of Oscar Piastri’s workplace personality, and an equally accurate summation of his third Formula 1 win, the 23-year-old Melburnian cooly converting from his maiden pole position in China on Sunday.\n\nA week after his best chance to snap Australia’s hoodoo of no local driver finishing on the Albert Park podium went awry when a late-race spin in the rain meant he finished ninth, Piastri was utterly dominant, leading for 53 of the 56 laps to head a McLaren one-two over teammate and Australian Grand Prix winner Lando Norris, who finished 9.748 seconds adrift.\n\nWhile late-race brake problems saw Norris fall away in Shanghai, Piastri was in complete control throughout, his lead in the second stint of the race after his sole pit stop on lap 14 never falling below 2.5 seconds as he added victory to his successes in Hungary and Azerbaijan in his sophomore season in 2024.\n\nIt was Piastri at his controlled, decisive best; a victory where his chat over team radio was economical and succinct, underpinned by actions rather than words.",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/real-trouble-united-hit-with-injury-blow-20250323-p5llut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Real trouble': United hit with injury blow",
    "publish_date": "Sun, 23 Mar 2025 20:52:57 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Real trouble': United hit with injury blow\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/manly-star-drops-with-injury-20250323-p5llur.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manly star drops with injury",
    "publish_date": "Sun, 23 Mar 2025 20:27:51 +1100",
    "category": "sports",
    "authors": [],
    "text": "Manly star drops with injury\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/piastri-claims-first-race-win-of-2025-20250323-p5llup.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri claims first race win of 2025",
    "publish_date": "Sun, 23 Mar 2025 20:17:52 +1100",
    "category": "sports",
    "authors": [],
    "text": "Piastri claims first race win of 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/aussie-high-jumpers-claim-gold-and-silver-at-worlds-20250323-p5lluh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie high jumpers claim gold and silver at worlds",
    "publish_date": "Sun, 23 Mar 2025 20:13:10 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie high jumpers claim gold and silver at worlds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/peter-dutton-pledges-millions-for-australias-first-hindu-school-after-labor-commitment/jth17gs3r",
    "title": "Peter Dutton pledges millions for Australia's first Hindu school after Labor commitment",
    "publish_date": "Sun, 23 Mar 2025 06:23:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia is likely to get its first Hindu school regardless of which major party wins the federal election, with the Coalition vowing to spend millions on the project after Labor said it would support the move.\n\n\n\n\n\nOpposition Leader Peter Dutton on Sunday said the Coalition, if elected, would commit $8.5 million toward the faith-based school. An initial $850,000 would go to Hindu Council of Australia for a business case with the further $7.65 million for capital expenditure once the business case is finished.\n\n\n\n\n\n\"The 684,000-strong Hindu community in Australia makes an enormous contribution to our multicultural character,\" Dutton said.\n\n\n\n\n\n\"This important announcement of the first Hindu school to be established is an important recognition of the Hindu community’s vision to have a Hindu school finally realised.\"\n\n\n\n\n\nLast week, Prime Minister Anthony Albanese announced Labor would support a proposed school, to be run by the Hindu Education and Cultural Centre. The organisation has already purchased land in Sydney's north-west.\n\n\n\n\n\nCensus figures show Hinduism grew by 55.3 per cent from 440,300 people in 2016 to 684,002 people in 2021. Almost 2.7 per cent of the Australian population identify as Hindus, up from 1.9 per cent five years earlier.\n\n\n\nCoalition pledges more psychology sessions\n\nIn a separate announcement, the coalition has also peldged more mental health support for Australians, including a plan to double the amount of subsidised psychology sessions on Medicare.\n\n\n\n\n\n\n\nJoining Dutton at a press conference in Parramatta — a seat held by Labor on a small three per cent margin — Liberal senator Anne Ruston said the Coalition would restore the number of subsidised psychology sessions a person can access a year to 20.\n\n\n\n\n\nOpposition Leader Peter Dutton arrives to address the Lowy Institute in Sydney, Thursday, March 20, 2025. (AAP Image/Bianca De Marchi) NO ARCHIVING Source: AAP / BIANCA DE MARCHI/AAPIMAGE During the early stages of the COVID-19 pandemic, people became eligible for 20 sessions a year, but in 2022 the government announced it would bring the amount to 10, causing a backlash from patients and mental health professionals.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-23-march-2025/qgjuyugcw",
    "title": "Evening News Bulletin 23 March 2025",
    "publish_date": "Sun, 23 Mar 2025 05:06:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Treasurer Jim Chalmers says Australia will continue to invest in the Pacific ahead of the federal budget on Tuesday [[March 25]].\n\n\n\n\n\nHe told SBS News that while there won't be a big increase in Pacific aid this year, the Albanese government is committed to continuing engagement with the region, despite the Trump administration pulling out U-S foreign aid.\n\n\n\n\n\nDr Chalmers also says the Budget will address the volatile relationship between Australia and the United States over tariffs.\n\n\n\n\n\n\"One of the reasons why our budget, which is primarily about cost of living, is also about investing and building in our future and making our economy more resilient, is because we are in a new world of uncertainty, unpredictability, and that's just one example.\"\n\n\n\n\n\n[---]\n\n\n\n\n\nThe Coalition has announced $5 million of additional funding to mental health facility Headspace in Sydney's west as part of its election pitch.\n\n\n\n\n\nOpposition leader Peter Dutton says his party is keen to improve mental health access and outcomes for young people, as the cost of living impacts people's ability to access services.\n\n\n\n\n\nHe says an additional 1,800 people in Sydney's western suburb of Paramatta will be able to access Headspace support.\n\n\n\n\n\n\"I want to make sure that we lead a government, and we lead a country that can give easy access to general practice and to health services across the board in other parts of the health system as well. But we can only do that through investment, and wise spending of the money we're putting in. Headspace was something I was very passionate about as health minister, I want to make sure we can get more access for more patients.\"\n\n\n\n\n\nAccording to the National Study of Mental Health and Wellbeing, 26% of people aged 16-24 in 2020-22 experienced high or very high psychological distress.\n\n\n\n\n\n[---]\n\n\n\n\n\nAustralia's military donation has stalled at a logistics hub in Poland, as a result of the United States suspension of military aid to Ukraine.\n\n\n\n\n\nOperations at the logistic hub were paused after U-S President Donald Trump froze assistance to Ukraine, leading to delay and possible complications for Australia's Abram tanks getting to the Ukrainian force.\n\n\n\n\n\nBut Minister for Veterans' Affairs Matt Keogh [[kee-o]] says Australia is aware of the situation, and they are working on coordination for the delivery.\n\n\n\n\n\n\"So the flow of the military assistance into Ukraine is being done in a coordinated way with European partners and of course, with Ukraine, about how that flow needs to be managed. And it's important that we don't telegraph publicly (make public) how all of that timing unfolds. We will continue to work responsibly and responsively with Ukraine in provision of support, understanding the circumstances they are facing because of the illegal invasion by Russia.\"\n\n\n\n\n\n[---]\n\n\n\n\n\nThe Coalition says over 36,000 public servants would be laid off as part of cost savings, if it wins the federal election.\n\n\n\n\n\nThe opposition finance spokesperson Jane Hume says the lay-offs would not be made from frontline services, but didn't detail which services would be targeted.\n\n\n\n\n\nThe Coalition has criticised Labor for expanding the public service workforce while cutting costs on consultants.\n\n\n\n\n\nMeanwhile, Labor has defended current work-from-home entitlements, saying it saves people $5,000.\n\n\n\n\n\nThe Coalition previously stated it would ban the working from home policy if it wins the election.\n\n\n\n\n\n[---]\n\n\n\n\n\nThe United Kingdom government has launched an investigation into an electrical substation fire that led to a temporary closure of London's Heathrow Airport on Friday [[March 21]].\n\n\n\n\n\nOver 1,300 flights were cancelled with more than 200,000 people stranded at the airport due to the closure.\n\n\n\n\n\nOperations resumed on Saturday.\n\n\n\n\n\nChief executive Thomas Woldbye says he's proud of the airport's response to the incident, but aviation trade organisations are questioning the airport's dependence on a single power source.\n\n\n\n\n\nThe Airport has also ordered an internal review into the incident.\n\n\n\n\n\n[---]\n\n\n\n\n\nNow in sports...\n\n\n\n\n\nAustralia has secured another two medals at the World Athletics Indoor Championships in China on Saturday [[March 22]].\n\n\n\n\n\nMiddle and long distance Olympian Jess Hull and fellow runner Ky Robinson both finished on the podium for the 3,000-metre race.\n\n\n\n\n\nThe two medals came after Lachlan Kennedy won silver in the men's 60 sprint on Friday [[March 23]].\n\n\n\n\n\nAustralia hopes to secure more medals in the women's 4 x 400 relay, and also with middle distance runner, Georgia Griffith's participation in the women's 1500 metres.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-treasurer-jim-chalmers-speaks-to-sbs-ahead-of-his-2025-budget/2gg60xli5",
    "title": "INTERVIEW: Treasurer Jim Chalmers speaks to SBS ahead of his 2025 Budget",
    "publish_date": "Sun, 23 Mar 2025 03:20:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nANNA: Treasurer, thanks for joining SBS.\n\n\n\n\n\nCHALMERS: Thanks, Anna\n\n\n\n\n\nANNA: $150 energy rebates. How did you arrive at that number? And according to people who've already been speaking on the streets of Australia this morning, they've found it fairly underwhelming in terms of how much it costs to do their grocery shop every week. Why $150?\n\n\n\n\n\nCHALMERS: This is a bit more hip pocket help for households. It recognizes that even with all of the progress we've made together as Australians on inflation, that people are still under pressure. And so it's providing more help with electricity bills for another six months, taking $150 off those electricity bills, recognizing the pressure that people are talking about in communities around Australia and feeling in communities right around Australia. My message for them would be that it's not the only thing we're doing to help with the cost of living. We've got the tax cuts rolling out, we've got cheaper medicines, we're cutting student debt, we're strengthening Medicare, because more bulk milling means less pressure on families. It's one of a number of ways that we're easing the cost of living because we know that that's still a big pressure on household budgets.\n\n\n\n\n\nANNA: You haven't met that $275 cut to energy bill promise. So what do you say to voters that are now increasingly distrustful about election promises?\n\n\n\n\n\nCHALMERS: Well, we cut electricity bills by $300 last year compared to what they would have otherwise been. The official inflation numbers show that electricity bills came off by 25% last year, and that's mostly, but not entirely, because of our efforts to help people with the cost of living by providing these energy bill rebates. So we're providing this help, this hip pocket help for households in the form of energy bill rebates at the same time as we add more cleaner and cheaper, more reliable energy to the system.\n\n\n\n\n\nANNA: One of the other big pressures on families is childcare. You have made changes, but will Australians see universal free childcare in a second Labor term of government?\n\n\n\n\n\nCHALMERS: Well, this budget will budget for two very big and very substantial steps towards universality when it comes to early childhood education, building more early childhood education centres, particularly in areas where there is a shortage, and particularly for nonprofit providers, as well as our three day guarantee, which is all about getting the system closer to universality. The Prime Minister, the ministers, myself, the whole government, big enthusiasts for early childhood education. It's a game changer for families and for children and for the national economy, because it makes it easier for people to work more and earn more if they want to, and it gives our kids the best start in life. That's why we're investing billions of dollars in the three day guarantee in new childcare centres as well. Getting closer and closer to universality\n\n\n\n\n\nANNA: Is the second term universal childcare plan a possibility.\n\n\n\n\n\nCHALMERS: Well, I'm focused on the government's fourth budget, not a fifth budget, if we get the opportunity to deliver one. We've said that universality is our objective. That's our aspiration, and in a number of budgets. Now, really most of our budgets, we've taken very big steps towards making early childhood education cheaper. Now, building more centres, the three day guarantee. All of these things are the necessary prerequisites for universality, and that's why we're investing in them in the budget.\n\n\n\n\n\nANNA: Can I ask you about tariffs? Could the iron or trade with China end up being under threat here? We know the US has spoken to previous Australian governments about this issue. How realistic Do you think that is as a potential problem? Is it forecast for in the budget?\n\n\n\n\n\nCHALMERS: Well, it remains to be seen whether the Americans go down that path. Obviously, we'll get more clarity in the coming days and weeks about new policies coming from the newish administration in the United States. More broadly, the uncertainty in the global economy and these escalating trade tensions are casting a dark shadow over the global economy and over our budget. One of the reasons why our budget, which is primarily about the cost of living, is also about investing in building our future and making our economy more resilient is because we are in a new world of uncertainty and unpredictability, and that's just one example.\n\n\n\n\n\nANNA: When it comes to the potential hole left by the US potentially pulling out of foreign aid in the Pacific. Is this budget going to put money in at least as a contingency to fill that breach?\n\n\n\n\n\nCHALMERS: Well, we're already investing in our region, and in my portfolio, for example, we've done a lot of work when it comes to Pacific banking, recognizing the economic challenges and also the security challenge challenges in our amongst our nearest neighbours, and so we've been engaging with enthusiasm in a considered and a methodical way. People shouldn't expect a big increase in the aid budget on Tuesday night, but they can expect us to continue to engage in the Pacific and beyond in the service of our national and economic interests.\n\n\n\n\n\nANNA: What about the fraying of social cohesion in our own country? How will this budget address that? What extra funding will you put in place?\n\n\n\n\n\nCHALMERS: Well, we made it clear over the course of recent months and over the past year or so that we're making more investments in combating a division in our society, making our society more cohesive at a really challenging time. We shouldn't pretend that there aren't opportunities for people who want to divide our community. And so we've announced already a number of important investments in keeping people safe and trying to keep our community as united as we can be, people will see that in the budget.\n\n\n\n\n\nANNA: Got a few questions here from our readers that I wanted to put to you. Firstly, in relation to carers, a question came through asking, Why have carers been let down time and time again as their financial security is eroded. What do you say to that?\n\n\n\n\n\nCHALMERS: Well, first of all, I think from memory, whether it was the last budget or the budget before we took some steps when it comes to carers, and I understand carers being as important as they are in our communities and in our country, that we should always be looking to do the best we can buy them. I'd also say that so much of what, of our cost of living agenda, has been informed by and guided by people who need us the most. You know, whether it's the changes to payments, whether it's the rent assistance, whether it's the getting wages moving again, whether it's the cheaper medicines, is a big part of the story for carers, I know whether it's strengthening Medicare. All of these things together are about recognizing that people are under pressure, including carers, and doing what we responsibly can to help.\n\n\n\n\n\nANNA: What's in this budget for pensioners?\n\n\n\n\n\nCHALMERS: Well, a lot of the cost of living help is motivated by the pressure that pensioners are under. If you think about that, the obviously, the indexation is automatic. But in addition to that, so much of our health agenda is driven by getting out of pocket health costs down. I spend a lot of time with the pensioners, particularly the age pensioners in my local community, and I know that out of pocket health costs are a huge part of the pressure that they're under. And so strengthening Medicare, the way that we froze the PBS at $7.70 in addition to what else we're doing in the PBS system, all of that is about recognizing that pressure and doing something about it.\n\n\n\n\n\nANNA: The coalition has this morning, foreshadowed significantly shrinking the money being spent on the NDIS. Do you need to match that?\n\n\n\n\n\nCHALMERS: No, and that was a new half announcement made by the coalition today, and what we know is that they make these announcements on the run, and then they typically don't come clean on what that means for Australians with a disability. We've got investment in the NDIS to a more sustainable level. It was up near 14% growth now about 8% they're now talking about something between two and 3% they need to come clean to Australians with a disability about what that means for the services that they need and deserve, and more broadly, while they're at it, this week is the perfect opportunity for them to come clean on the $600 billion in cuts that they will need to find to fund their nuclear reactors, what that means For Medicare and pensions and payments and the NDIS and veterans, they have left it far too long to come clean on that.\n\n\n\n\n\nANNA: It's widely accepted that the interest rate increases hurt the poorest, hardest and first. Why didn't your government do more with the levers at your disposal to help them?\n\n\n\n\n\nCHALMERS: I don't think any objective observer of this government could conclude anything other than we have in each of our four budgets now provided as much responsible cost of living relief as we can. We permanently increase working age payments, including jobseeker we've strengthened Medicare. We've made early education cheaper. We've provided two rounds of rent assistance. We've got wages moving again, starting with the minimum wage and industries dominated by women. These are all the tax cuts. We rewrote the tax cuts so that 3 million Australians on low and middle incomes didn't miss out. So this has been our motivation to help people who need help. We know that cost of living pressures are front of mind for people, and that's why cost of living is front and centre in this budget like it was in the first three.\n\n\n\n\n\nANNA: Economist Chris Richardson says much of our spending is stupid. Much of our taxing is terrible. Ken Henry, who's also been active in this space in his discussions, has also talked about acts of wilful bastardry around the way wealth inequality exists in our country. What do you look back on this term and your time as treasurer and wish you could have done more to address those big issues?\n\n\n\n\n\nCHALMERS: Well, first of all, I mean, I respect those guys that they're not always right, but I always listen to them respectfully. Chris Richardson is more or less a permanent critic of governments. His job is to get his name in the paper. My job is to make it all add up when it comes to the comments that Ken Henry has made. I worked closely with Ken, I think the world of Ken Henry and the challenge that he is describing is really the challenge I was responding to when we took that big political risk to rewrite the tax cuts so that young people got a tax cut. It's the motivation behind what we're doing in student debt, what we're doing in housing, what we're doing in fee free TAFE. All of these things are about recognizing that the pressures in our economy and in our society do fall disproportionately. That's why there's been a focus on the most vulnerable. That's why there's been a focus on young people in particular, and so I will stack up my record on helping young people with the tax cuts and housing and education and all of these ways against our predecessors, because this is a government that cares about young people. We care deeply about the intergenerational disadvantage in our country. And as treasurer, I've made it a priority as treasurer in a second term.\n\n\n\n\n\nANNA: If that does happen, will those big questions around the structural nature of our tax system have to be addressed?\n\n\n\n\n\nCHALMERS: Well, we're not proposing new changes to the tax system beyond what we've already announced when it comes to raising additional revenue. We've got the PRRT changes through. We still want to get the superannuation changes through we've made changes in multinational tax with reforming income taxes. So in terms of revenue raises, we're not taking to the election a new raft of that. There'll be some additional measures in the budget around compliance and the like, as you would expect, the issue that Ken is identifying when it comes to the generational disadvantage, and particularly as it relates to young people, we have got a very substantial agenda there, and I've run through it, taken the opportunity to run through it today, but the tax cuts, the student debt relief, the issues in housing and education, all of these things are motivated by the challenge that Ken rightly identifies.\n\n\n\n\n\nANNA: Finally, Treasurer, when we see the budget on Tuesday, will we see a net overseas migration number which suggests Labor is the party of a big Australia?\n\n\n\n\n\nCHALMERS: You'll see the net overseas migration forecasts will be updated. We got a number for net overseas migration, I think, last week, or certainly in the last couple of weeks, and it showed that we were 10,000 lower than what we had anticipated. We're managing net overseas migration down in a responsible and a considered and a methodical way. There are always swings and roundabouts in the forecast. It's not just about how many people are arriving, but also how many people are leaving Australia, departing Australia. And so there'll be some some modest changes to the net overseas migration forecast. You'll see them on Tuesday,\n\n\n\n\n\nANNA: And any changes to visa costs, we know in the past, we've seen visas be a kind of easy area for treasurers to reap in some more revenue. Is that coming this time around?\n\n\n\n\n\nCHALMERS: Well, what we've tried to do is we've tried to make sure that the cost of visas reflect our efforts to try and get through the backlog. I think you and I have spoken about this on a number of occasions. One of the big challenges that we had in the budget and in the public service was we had this huge backlog. And so from time to time, we've changed visa charges to help fund the efforts that we've made there to get the backlog down. Not prepared to foreshadow or flag any more steps in that direction, but what we've shown is a willingness to manage the visa system in a responsible way to try and get the backlog down to more manageable levels.\n\n\n\n\n\nANNA: Well we thank you very much for your time, speak to you on Tuesday.\n\n\n\n\n\nCHALMERS: Thanks very much, Anna.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/come-clean-treasurer-jim-chalmers-demands-coalition-clarify-proposal-to-slash-ndis/ylywsad24",
    "title": "'Come clean': Treasurer Jim Chalmers demands Coalition clarify proposal to slash NDIS",
    "publish_date": "Sun, 23 Mar 2025 03:10:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal opposition has clarified it has no policy to cut spending on the National Disability Insurance Scheme after Treasurer Jim Chalmers urged the coalition to \"come clean\" on its plans for the scheme.\n\n\n\n\n\nOn Sunday, opposition finance spokeswoman Jane Hume said spending on the scheme had \"run out of control\" and suggested the party could look to tighten its growth if it won government.\n\n\n\n\"The NDIS, for instance, is one of those areas in the budget that has run out of control; it was growing at 14 per cent per annum,\" she said.\n\n\n\n\n\n\"It's been brought back to around eight per cent … but it's been brought under control somewhat. We think that there's more that can be done.\"\n\n\n\n\n\nAsked if the Coalition had a target in mind for NDIS growth levels, she said: \"The most important thing … is in the long term that all government spending doesn't grow faster than the economy itself.\"\n\n\n\n\n\nOpposition finance spokeswoman Jane Hume on Sunday said spending on the NDIS had \"run out of control\". Source: AAP / aap The nation's economy is forecast to grow by 2-3 per cent each year over the next four years.\n\n\n\n\n\nIn November, a report from the NDIA — the body that administers the NDIS — found the scheme was on track to meet the target of eight per cent spending growth in the four years to 2028, set by former NDIS minister Bill Shorten.\n\n\n\n\n\nIn an interview with SBS News ahead of the federal budget on Tuesday , Chalmers said Labor would not match any proposed cuts.\n\n\n\nHe said the Opposition should clarify its plans for the NDIS and how it would affect Australians with disabilities.\n\n\n\n\n\n\"They make these announcements on the run, and then they typically don't come clean on what that means for Australians with a disability,\" he said.\n\n\n\n\n\n\"They need to come clean to Australians with a disability about what that means for the services that they need and deserve.\"\n\n\n\nLater on Sunday, a spokesperson for Senator Hume said she was speaking about government spending as a whole, not the NDIS specifically.\n\n\n\n\n\n\"The opposition does not have a policy to reduce NDIS spending in line with economic growth, and is not advocating cutting NDIS spending to 2 to 3 per cent,\" the spokesperson said in a statement to SBS News.\n\n\n\nLabor says $5000 cost to return to office\n\nThe coalition has also attacked public servants for working from home too much, saying they would force workers back to the office.\n\n\n\n\n\nLabor estimates transport and parking would cost workers about $5000 a year if they had to return to the office five days a week, up from three.\n\n\n\nThe cost is based on estimates people would spend an extra two hours a week in the car, or just under 100 extra hours a year, with commuters driving an average of just over an hour in the car to get to and from work.\n\n\n\nNew era of 'global economic uncertainty'\n\nIn the wide-ranging interview, the treasurer also discussed new international challenges to Australia's economy, and said Australians shouldn't expect a \"big increase\" in foreign aid .\n\n\n\n\n\nChalmers said Australia would be getting more clarity about trade policies from its major trading partner the United States, as 25 per cent tariffs on Australian aluminium and steel are set to take force on 2 April , and said the world had entered a new era of uncertainty.\n\n\n\nWhen asked about the potential for the US President to zero in on Australia's highly lucrative iron ore exports to China the Treasurer said: \"it remains to be seen whether the Americans go down that path\".\n\n\n\n\n\nHe played down the likelihood of Australia filling the huge gap in global aid made by Donald Trump's decision to slash US aid programs.\n\n\n\nCost of living relief to help vulnerable\n\nChalmers said support for young people and others struggling with cost-of-living relief would be prioritised.\n\n\n\n\n\n\"We know that cost of living pressures are front of mind for people, and that's why cost of living is front and centre in this budget.\"\n\n\n\n\n\nHe said the budget would recognise \"the pressures in our economy and in our society do fall disproportionately\".\n\n\n\nREAD MORE Are international students to blame for the housing crisis?\n\n\"That's why there's been a focus on the most vulnerable,\" Chalmers added.\n\n\n\n\n\nThe government on Sunday announced every household would receive $150 rebates on their electricity bills.\n\n\n\n\n\nThe coalition will support the new rebate but pledged to bring down power prices without government subsidies, with the election to be fought largely on cost of living pressures.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/are-international-students-to-blame-for-the-housing-crisis/f9q327agx",
    "title": "Are international students to blame for the housing crisis?",
    "publish_date": "Sun, 23 Mar 2025 00:25:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "International students have faced blame from both sides of politics for ostensibly contributing to rising housing costs.\n\n\n\n\n\nFor example, Treasurer Jim Chalmers said in May 2024 that increased numbers of foreign students \"puts pressure on prices and rents\".\n\n\n\n\n\nThat same month, Victorian Liberal Senator Jane Hume told Sky News that they put \"exceptional pressure\" on housing markets.\n\n\n\n\n\nHowever, a new study has found they are \"not the culprits of the rental crisis in Australia\" and its authors \"reject the assumption that the growth of international students 'caused' or exacerbated the housing crisis in Australia\".\n\n\n\n\n\n\"International students only constituted a small part of the puzzle of the rental crisis in Australian capital cities,\" the University of South Australia research paper read.\n\n\n\n'There's really no pattern'\n\nLead researcher Michael Mu told SBS News his team looked at several different variables, including international student numbers, rental vacancy rates, inflation rates, and rental costs.\n\n\n\n\n\n\"The main message here is, because the correlations between the international [students] numbers and the rental costs are random, there's really no pattern,\" he said.\n\n\n\n\n\n\"We don't have evidence that international students make finding housing harder for everyone.\"\n\n\n\n\n\nThe research also showed that, after COVID-19 mitigation measures were lifted, an increase of 10,000 international students led to corresponding decrease of $1 in weekly rents when \"rental inflation was controlled and rental vacancy rate was considered\".\n\n\n\nHu said \"very complicated macro-level socio-economic reasons\" were what was truly behind the housing crisis.\n\n\n\n\n\n\"[International students] are not the main competitors in the market, and actually, when some of them do choose to go to the private rental market, they are very vulnerable,\" he explained.\n\n\n\n\n\n\"That perhaps helps to explain why we found really no statistical relationship between international members and the housing crisis.\"\n\n\n\n\n\nThe researchers examined data from government departments and the Australian Bureau of Statistics (ABS) over 70 time points between 2017 and 2024.\n\n\n\nInternational students are at a disadvantage in renting\n\nThe newest findings align with 2024 research from the Student Accommodation Council that also found international students weren't to blame for rising prices.\n\n\n\n\n\nInternational students make up just six per cent of renters nationally, were concentrated in capital cities, and almost 40 per cent of them live in student housing, the council's research found.\n\n\n\n\n\n\"We do have a rental crisis in Australia, and it's a long and systemic problem made up of a number of different factors, but to unfairly place the blame solely at the feet of international students is wrong,\" Tori Brown, the executive director of the Student Accommodation Council, told SBS News.\n\n\n\n\n\nBrown also said that the organisation's research showed that international students were disadvantaged when competing in the private rental market.\n\n\n\n\n\n\"International students have no previous rental history living in Australia, and they usually don't have jobs or income statements when they're putting in for leases.\"\n\n\n\nA 'tariff' on international students?\n\nMeanwhile, government efforts to reduce the number of international students studying in Australia appear to have had some effect.\n\n\n\n\n\nAccording to the ABS, there were nearly 81,000 international student arrivals in January — 2.5 per cent less than the same time last year and 10 per cent less than pre-COVID-19 numbers.\n\n\n\n\n\nLast year, the government tried to cap international student numbers and suggested limiting international student enrolments to 270,000 by 2025.\n\n\n\n\n\nThe plan was scrapped after failing to win support from Opposition, Greens and independent senators .\n\n\n\n\n\nIn response, the government introduced a new policy to slow visa processing and limit the number of international students a university can enrol.\n\n\n\n\n\nIt was enforced through a ministerial direction rather than a bill.\n\n\n\nREAD MORE Caps on international students won't just be a headache for universities\n\nThe Opposition is planning to unveil its own policy to limit the number of international students, with its education spokesperson Sarah Henderson saying it would consist of \"tougher, more effective caps on international students\".\n\n\n\n\n\n\"Our approach will ensure you have long term certainty, underpinned with proper consultation, with special consideration for the regions where foreign students are integral to local economies,\" Henderson said at the Universities Australia Solutions Summit in mid-March.\n\n\n\n\n\nExperts like UNSW economics professor Richard Holden warn that capping international students will \"definitely reduce GDP\".\n\n\n\n\n\n\"It's important to remember that each international student that comes to Australia not only brings in the tuition fees that they pay to the university, but they, they spend money in the rest of the economy,\" he said.\n\n\n\n\n\n\"That's why they're in a really important part of our economic success story and our export success story.\"\n\n\n\n\n\nAccording to the ABS, international education was Australia's fourth largest export — valued at $48 billion — in 2023. They paid $17 billion in course fees and spent $31 billion within the broader economy.\n\n\n\nThe Student Accommodation Council also opposes the cap.\n\n\n\n\n\nBrown said that, as Australia's largest service export, international students \"can't have a tariff placed on them\".\n\n\n\n\n\n\"They are critical to our economy and to Australia's future.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-extends-energy-bill-relief-vows-to-give-households-150-rebate/s8t0fcqau",
    "title": "Labor extends energy bill relief, vows to give households $150 rebate",
    "publish_date": "Sat, 22 Mar 2025 21:24:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Small businesses and all households will have $150 taken off soaring electricity bills as Labor emphasises hip-pocket relief heading into a pre-election budget.\n\n\n\n\n\nSome $1.8 billion in energy rebates would automatically be applied to every residence and one million small businesses around the nation on a quarterly basis from 1 July under the plan.\n\n\n\n\n\nIt's the second time in a year the government will roll out energy rebates after it provided $300 in relief in the 2024 budget.\n\n\n\nThe rebate would slash household bills by an average of 7.5 per cent and bring down inflation by half a per cent, according to Treasury estimates cited by the federal government.\n\n\n\n\n\nElectricity prices are set to rise from mid-year, with the Australian Energy Regulator recommending a 8.9 per cent increase to the maximum amount customers can be charged in certain parts of the country.\n\n\n\n\n\n\"We are going to take a further $150 right off your power bill because helping your family budget is our number one priority,\" Prime Minister Anthony Albanese said.\n\n\n\n\n\n\"This is another cost-of-living relief measure that my government is delivering for Australians while putting downward pressure on inflation\".\n\n\n\nThe government talked it up as immediate relief before wider electricity reforms kicked in, with the consumer watchdog's inquiry into the National Electricity Market extended by 12 months.\n\n\n\n\n\nPrice comparison site Canstar Blue said with electricity prices set to rise by up to $200 a year for an average household, the limited rebate will \"fall short for many struggling families\".\n\n\n\n\n\nIt said data from the Australian Energy Regulator showed that more customers were falling behind on their electricity bills.\n\n\n\n\n\n\"It’s great to see the government providing cost of living relief, however, for some households with higher-than-average energy bills this might not be enough to get them through winter, particularly with electricity price rises coming down the line,\" Canstar's Sally Tindall said.\n\n\n\n'Could be more'\n\nThe announcement was met with mixed reactions on the streets of the south-eastern NSW suburb of Queanbeyan.\n\n\n\n\n\n\"It will help, could be more - it's pretty tough out there at the moment,\" Anthony, who did not give his last name, told SBS News.\n\n\n\n\n\n\"If they really wanted to fix it, they could,\" he added, about the cost of living crisis.\n\n\n\nQueanbeyan pensioner Marty says a $150 saving on his energy bill will \"mean a lot\" for him. Credit: Ewa Staszewska Another local, Marty, said he would bank the savings as a pensioner.\n\n\n\n\n\n\"It means a lot to me,\" he said.\n\n\n\n\n\n\"I'm on the pension so things are hard all the time.\"\n\n\n\n\n\nThe federal budget will be handed down on Tuesday evening, with Opposition Leader Peter Dutton due to reveal his \"positive plans\" for the nation in his reply on Thursday.\n\n\n\n\n\n\"There is a much better way to manage our economy, to help families, to help small businesses grow, to help our economy thrive, to keep Australians safe,\" Dutton told reporters.\n\n\n\n\"That will be detailed in the budget in reply speech, and in other announcements that we'll make in the run-up to the election.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-how-is-australias-congolese-community-dealing-with-war-in-their-homeland/3zyvev23i",
    "title": "INTERVIEW: How is Australia's Congolese community dealing with war in their homeland?",
    "publish_date": "Sat, 22 Mar 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ai-art-generates-cash-and-controversy-at-the-same-time/747dhqvhc",
    "title": "AI Art generates cash and controversy at the same time",
    "publish_date": "Sat, 22 Mar 2025 20:00:00 +0000",
    "category": "music",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nChristie’s auction house in New York has sold everything from Pablo Picasso to Princess Diana’s dresses.\n\n\n\n\n\nEarlier this month, it auctioned off 34 works including digital art sold as unique items knows as non-fungible tokens, and a self-painting robot that added to the canvas each time a new bid was made.\n\n\n\n\n\nAll artworks were generated using artificial intelligence.\n\n\n\n\n\nIt was the first ever AI art sale at a major auction house.\n\n\n\n\n\nDr Jasmin Pfefferkorn is a Research Fellow at The University of Melbourne.\n\n\n\n\n\nShe believes AI may increasingly become a reality at galleries in the future.\n\n\n\n\n\n“If we put it in a historical context, I think it is something that will eventually become embraced. I often liken it to photography which wasn’t recognised as a legitimate art form for quite some time until it started to enter into museums and then into auction houses et cetera. I think we can see a similar, somewhat sped up trajectory for AI as well.”\n\n\n\n\n\nThe sale, titled Augmented Intelligence amassed over 1.1 million dollars [[US$700,000]], despite six of the artworks not selling.\n\n\n\n\n\nIt also accumulated over 6,500 signatures by artists calling to cancel the auction.\n\n\n\n\n\nIn an open letter to the gallery, the letter said, “if you have any respect for human artists, you cancel the auction. Yours sincerely, the undersigned artists.”\n\n\n\n\n\nFor Sue Beyer, the distinction isn’t so clear.\n\n\n\n\n\nAs a multi-disciplinary artist, she says developments in AI simultaneously fascinate and repel her.\n\n\n\n\n\n“I’m using a lot of different new media and also AI. The AI, I really enjoy using because it’s not perfect and I like its weaknesses. I’m sort of treating like an oracle or not God, but I give the AI an instruction, or prompt and it gives me information in return. It’s like a collaborative process.”\n\n\n\n\n\nMs Beyer is even using the technology to learn more about herself.\n\n\n\n\n\n“The way I’ve been using it is not really offensive or scary. Nothing like Black Mirror [[dystopian television series]] or The Terminator [[sci-fi movie]] or anything like that. I’m asking questions like ‘Who am I?’ and ‘Who is Sue Beyer?’. I’m sort of using irony because I’m looking at what it means to be human using something that obviously isn’t human.”\n\n\n\n\n\nLast year, the Brisbane Portrait Prize announced it was changing its entry guidelines stating, “it is impractical to have a blanket ban on the use of AI.”\n\n\n\n\n\nInitially, it allowed entrants to submit artworks completely generated using image creation platforms like Midjourney or DALL-E.\n\n\n\n\n\nAfter receiving criticism by parts of the artistic community, organisers reconsidered its entry requirements to only allow works partly generated using AI.\n\n\n\n\n\nIn the end, Dennis McCart’s self-portrait using reprocessed AI images took home $10,000 for the Digital Award.\n\n\n\n\n\nBirrunga Wiradyuri, a Wiradjuri man and Founder of Birrunga Gallery won the competition's Packer Prize in 2021 for his portrait titled Night Rainbow.\n\n\n\n\n\nHis First Nations gallery boycotted the prize last year for its guidelines on AI.\n\n\n\n\n\nHe says he will not be entering the award again this year.\n\n\n\n\n\n“It was really unfortunate, because I know there are some very reasonable people within that organisation. I just can’t say I’ve got a great deal of respect for the decisions made. It would have been very easy to go, ‘Oh, ok. We hadn’t considered that. It doesn’t even have to be considered a real good point, just a reasonable point. Why don’t time out on this?’. Everyone would have gone ‘Great decision, the Brisbane Portrait Prize listens to Blackfellas.’ Instead, what we’ve got is we’re pressing on regardless because we’ve got experts who say its harmless. I don’t get it, I really don’t.”\n\n\n\n\n\nMr Wiradyuri believes it’s not the change he opposed to.\n\n\n\n\n\nIn fact, he says he’s in favour of controversy and challenging messages.\n\n\n\n\n\n“I’m not about censoring, I’m not about that at all. I just feel as though at a minimum you should not do harm and at the moment, I can see this doing harm. So, there’s this reckless notion that it’s ok to harvest and reproduce First Nations artwork. The ramifications for that are next level cultural appropriation, cultural theft, it’s colonisation, it’s disenfranchisement, it’s diminishing, it’s diluting, it’s invisible-ing us again, another level of invisible-ing us. I mean, that all adds up to false representation.”\n\n\n\n\n\nMr Wiradyuri says cultural appropriation and stereotypical perceptions of First Nations art is a reality he still confronts.\n\n\n\n\n\nAs part of his galleries Cultural Creative Development Program, he provides professional exposure for emerging Aboriginal and Torres Strait artists.\n\n\n\n\n\nThat means creating artworks for businesses' Reconciliation Action Plans.\n\n\n\n\n\nMr Wiradyuri says he still gets asked for traditional dot painting art.\n\n\n\n\n\nIt’s a style derived from the Central and Western Desert regions of Australia - but not Wiradjuri in New South Wales, where he is from.\n\n\n\n\n\nDr Louise Buckingham is the CEO of Arts Law Centre Australia, which provides specialised legal support to First Nations creators through its Artists in the Black service.\n\n\n\n\n\nShe says with the rise of AI, cultural flattening and fake Indigenous art is rife.\n\n\n\n\n\n“We’re well aware of how important the Indigenous art market is and also how extensive the market for fake souvenirs and fake art has been alongside of that and the damage it does to our existing art market. You know, one set of stakeholders is benefiting to a greater extent than ever in the context and history of the technology boom and one group is losing out to a greater extent than ever.”\n\n\n\n\n\nAdobe Stock, a graphics software that provides royalty free photos and graphics, has faced scrutiny by the National Indigenous Times for its representations of First Nations art and culture.\n\n\n\n\n\nA search of ‘Indigenous Australian’ brings up images of people with generic body markings or wearing Native American feather headdresses.\n\n\n\n\n\nPeople wearing business suits on the platform are quote “representing workplace diversity”.\n\n\n\n\n\nA search for ‘Indigenous Australian art’ surfaces images of didgeridoos and boomerangs, AI rock and dot style paintings.\n\n\n\n\n\nAn extended licence for each of these AI images costs nearly 90 dollars on average.\n\n\n\n\n\nUnder Australia’s current legislation, copyright for artistic works generally last the lifetime of the creator plus 70 years.\n\n\n\n\n\nDr Buckingham says while this may seem like an extensive period, for First Nations communities whose art and culture moves across past, present and future, it can raise issues.\n\n\n\n\n\nIn the case of AI-generated art, it gets more complex.\n\n\n\n\n\nIn Australia, copyright law does not subsist or exist for artificial intelligence, as legally, there is considered to be no human authorship or originality to protect.\n\n\n\n\n\nIt also means that concerns over how AI models are being trained using artists' works are difficult to legislate.\n\n\n\n\n\n“The responses to things like the Christie’s auction which received a lot more in sales than people anticipated, but it also elicited a response from creators who were outraged that the notion of an auction for this kind of artwork. You know, there have been other responses from all around the world from creators of all descriptions and when we are talking about visual art, and we have class action complaints in the US that we will be watching very closely here in Australia.”\n\n\n\n\n\nA working group on Indigenous Cultural and Intellectual Property was established in December last year, to protect First Nations knowledge amidst the rise of AI.\n\n\n\n\n\nDr Buckingham says consultation from the working group has already been paused until after the federal election.\n\n\n\n\n\nIn the meantime, The University of Chicago has developed tools like Nightshade or Glaze, which are being used by artists to fight back against AI data scraping.\n\n\n\n\n\nThese tools transform data from images into “poison”, so that AI training on them without consent learn unpredictable behaviours.\n\n\n\n\n\nWith this software, the university says a prompt that asks for an image of a cow flying in space might instead get an image of a handbag in space.\n\n\n\n\n\nDr Pfefferkorn from the Art, AI and Digital Ethics centre believes while AI is new, artists have been balancing the relationship between ethics, technology and science for centuries.\n\n\n\n\n\n“I’m really hopeful the more we engage critically and with the different complexities that are being presented and already have been explored by artists in this space for such a long time, the more we’ll be able to push back and reclaim some of our agency because we will be able to see there are alternatives and other options.”\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-social-media-rules-deemed-digital-trade-barriers/cyr4c0hj6",
    "title": "Australian social media rules deemed 'digital trade barriers'",
    "publish_date": "Sat, 22 Mar 2025 07:41:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian social media rules deemed 'digital trade barriers'\n\nPublished 21 March 2025, 6:51 am\n\nThe US tech lobby has told Donald Trump Australian regulations on social media, streaming platforms and artificial intelligence are imposing unfair digital trade barriers. The advice comes as the President prepares for a second round of tariffs. Meanwhile, Treasurer Jim Chalmers is warning an uncertain global outlook will impact the Budget bottom line.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-supermarkets-named-among-most-profitable-in-the-world/2nrxy8b8g",
    "title": "Australian supermarkets named among most profitable in the world",
    "publish_date": "Sat, 22 Mar 2025 07:29:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian supermarkets named among most profitable in the world\n\nPublished 21 March 2025, 6:36 am\n\nAccording to the competition watchdog, Australia's supermarkets are among the most profitable in the world. The dominance of Coles and Woolworths means there is little incentive for them to lower prices. But the ACCC's recommendations stopped short of calling for the power to break up the big chains.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/international-students-not-to-blame-for-housing-crisis-study-finds/3eun4a599",
    "title": "International students not to blame for housing crisis, study finds",
    "publish_date": "Sat, 22 Mar 2025 02:58:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nInternational students have been blamed on a regular basis for contributing to the nation's housing affordability crisis.\n\n\n\n\n\nVictorian Liberal Senator Jane Hume has told Sky News the Coalition is convinced of that too.\n\n\n\n\n\n\"We have a housing crisis in Australia, and somehow we've got to take the air out of the tyres of the housing crisis, and we know that foreign students put on an exceptional pressure, particularly around our metropolitan universities.\"\n\n\n\n\n\nThe opposition's education spokesperson Sarah Henderson says the LNP wants to introduce tougher and more effective limits on international student numbers.\n\n\n\n\n\nThe Labor government already tried and failed with a similar move last year, with the plan ultimately being scrapped after failing to win senate support.\n\n\n\nBut now new research has put claims that international students are putting pressure on the housing market to the test.\n\n\n\n\n\nUniversity of South Australia associate professor Michael Mu says an Australian-first study of data from government departments and the Australian Bureau of Statistics has found no direct link between international students and soaring rents.*\n\n\n\n\n\n\"We actually look at several different variables: international student numbers, rental vacancy rate, inflation rate, and rental cost. The structural issues such as the vacancy say rate are way, way more important in predicting the rental cost. It's a supply issue.\"\n\n\n\n\n\nResearch from the Student Accommodation Council shows international students make up just 6 per cent of renters nationally, mostly in capital cities.\n\n\n\n\n\nOf those, 39 per cent live in student housing.\n\n\n\n\n\nThe Council's Torie Brown says international students are actually at a disadvantage when competing in the private rental market.\n\n\n\n\n\n\"International students have no previous rental history living in Australia, and they usually don't have jobs or income statements when they're putting in for leases. So they're not a landlord's preferred tenant, which is why we want to see more student accommodation because it's the only accommodation type you can apply for while you're still overseas.\"\n\n\n\n\n\nInternational students make an annual contribution of nearly $50 b illion to the Australian economy.\n\n\n\nEconomists say blunt caps on international student numbers could actually do major financial damage, especially in the context of possible US tariffs.\n\n\n\n\n\nProfessor Richard Holden with the University of New South Wales says caps could lead to both a potential loss of income for Australia - and play into a messy geopolitical trade war.\n\n\n\n\n\n\"On April 2, we're staring down the barrel of retaliatory tariffs of maybe 10 per cent or more on everything that we export to the US. There may be more to come. Our exports are under pressure. Education is one of our biggest export industries and it's something that we're really good at, and is a big growth opportunity for Australia, so I don't know why we would be imposing self-inflicted wounds at a time when we've got enough challenges already coming at us from overseas.\"\n\n\n\n\n\n* The study examined data from government departments and the Australian Bureau of Statistics between 2017 and 2024.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-is-planning-to-expand-its-help-to-buy-housing-scheme-heres-what-it-means-for-you/6u426yfk5",
    "title": "Labor is planning to expand its Help to Buy housing scheme. Here's what it means for you",
    "publish_date": "Sat, 22 Mar 2025 02:26:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points The Albanese government will lift income and price caps to make it easier for first-time buyers to secure a home.\n\nThe income threshold will be bumped up to $100,000 for singles and $160,000 for combined incomes and single parents.\n\nThe maximum price of a home eligible to participants will also be raised.\n\nA signature housing policy is set to be expanded to higher income earners to give more Australians a leg-up into the market, the government says ahead of its fourth federal budget.\n\n\n\n\n\nUnder changes to the Help to Buy scheme , the Albanese Labor government will lift income and price caps to make it easier for first-time buyers to secure a home.\n\n\n\n\n\nHousing Minister Clare O'Neil said the shared equity program would allow 40,000 eligible buyers \"who would otherwise have no chance of home ownership\" to secure a home with federal government contribution.\n\n\n\n\n\n\"We've got a generation of young people growing up in our country who can't see a pathway to home ownership, and our government wants to change that,\" she told reporters on Saturday.\n\n\n\nIncome- and property price cap to lift\n\nWith equity assistance of 40 per cent for new homes and 30 per cent for existing homes, homebuyers would be able to buy with a smaller deposit and mortgage.\n\n\n\n\n\nThe scheme was previously only eligible to singles earning up to $90,000 and couples or households with a combined income of up to $120,000.\n\n\n\n\n\nThe income threshold will be bumped up to $100,000 for singles and $160,000 for combined incomes and single parents.\n\n\n\n\n\nThe maximum price of a home eligible to participants will also be raised from $950,000 to $1.3 million in Sydney, from $850,000 to $950,000 in Melbourne and from $700,000 to $1 million in Brisbane and the Gold Coast.\n\n\n\n\n\nPrice caps in rural areas will also increase.\n\n\n\nThe government has also pledged to speed-up housing construction with a $54 million investment in manufacturing prefabricated and modular home construction.\n\n\n\n\n\n\"We've got a big goal to build 1.2 million new homes in five years and to reach that we need to build homes in new ways - using methods like prefab we can build homes up to 50 per cent faster,\" Ms O'Neil said.\n\n\n\nCost-of-living relief will be the other big budget focus, Treasurer Jim Chalmers said.\n\n\n\n\n\n\"So it will have that familiar combination of relief, repair and reform in the fourth budget, the same as it did in the third,\" he told reporters on Friday.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/rome-s-lesser-known-other-sistine-chapel-is-a-frenzy-of-opulence-20250310-p5libk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rome’s lesser-known ‘other Sistine Chapel’ is a frenzy of opulence",
    "publish_date": "Mon, 24 Mar 2025 00:00:00 +1100",
    "category": "music",
    "authors": [
      "David Whitley"
    ],
    "text": "Entering the Sistine Chapel is an exercise in wonder. It is swathed in art, seemingly no expense spared, and there’s barely a soul inside to detract from the visual onslaught.\n\nTo anyone who has been to the Sistine Chapel in the Vatican’s Apostolic Palace, this description will not ring quite true. The price for seeing Michelangelo’s Last Judgment and world-renowned ceiling frescos in the Vatican is a torrid experience amid hundreds of jostling, herded bodies.\n\nThe impressive dome ceiling in Santa Maria Maggiore Basilica in Rome. Credit: Getty Images\n\nHowever, the Vatican’s Sistine Chapel is not the only one in Rome. And the one inside the Basilica Papale di Santa Maria Maggiore, on the Esquiline Hill, is much quieter.\n\n“Sistine”, it turns out, is not a word reserved for a place of transcendent heavenly beauty. It just means that it’s named after a bloke – or, in this case, a Pope – called Sixtus. The chapel in the Vatican was commissioned by Pope Sixtus IV in 1473, and the one in the Basilica di Santa Maria Maggiore began construction in 1585 at the command of Pope Sixtus V.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/books/a-gen-x-icon-bares-all-about-john-cusack-river-phoenix-and-her-past-20250320-p5ll7v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Gen X icon bares all about John Cusack, River Phoenix and her past",
    "publish_date": "Mon, 24 Mar 2025 00:00:00 +1100",
    "category": "music",
    "authors": [
      "Nathaan Smith"
    ],
    "text": "MEMOIR\n\nSay Everything\n\nIone Skye\n\nHarperCollins, $34.99\n\nThe company of other girls with famous fathers – Mick Jagger’s Karis and Mick Fleetwood’s Amelia – gave young Ione Skye comfort from the pain of also having a distant superstar parent.\n\nHer father, the Scottish folk singer Donovan, abandoned Skye and her brother when they were toddlers. The flower power music figure would refer to her only as “the girl” in letters, later even insisting on a paternity test during her teen years. But reveries of a reconciliation were frequent: “I often fantasised that one day my dad would … be overcome with regret for not getting to know such a wonderful girl,” the actress writes in her new memoir Say Everything.\n\nThe Generation X icon, best known for roles in the 1980s films River’s Edge and Say Anything, insists there’s no connection between his abandonment and her adult desire for attention in the spotlight. But Donovan does cast a long shadow over Skye’s life, with the 54-year-old acknowledging that she often struggled with his absent presence.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/superquiz-monday-march-24-20250321-p5llfu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superquiz, Monday, March 24",
    "publish_date": "Sun, 23 Mar 2025 23:59:00 +1100",
    "category": "finance",
    "authors": [],
    "text": "Compiled by Michelle Stillman\n\nLooking for Target Time?\n\nWe have a new digital version of our popular nine-letter puzzle. See how many words you can find and how long it takes you to discover the Target word. You can share your results. Premium subscribers can play Target Time here.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/world/europe/pope-francis-to-be-discharged-from-hospital-on-sunday-says-doctor-20250323-p5llpv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pope Francis appears in public for the first time since life-threatening pneumonia",
    "publish_date": "Sun, 23 Mar 2025 22:31:37 +1100",
    "category": "lifestyle",
    "authors": [
      "Nicole Winfield"
    ],
    "text": "The doctors spoke at a hastily called press conference on Saturday evening in the hospital atrium, their first in-person update on the pontiff’s condition in a month. They said they were discharging Francis after he registered two weeks of stability and increasing progress in his recovery. Loading “The Holy Father would have wanted to go home a few days ago, as even he realised he was improving, breathing better, and that he could work longer. But I have to say he was an exemplary patient,” said Dr Sergio Alfieri, who co-ordinated Francis’ medical team at the hospital. “He listened to the suggestions from me, Dr Carbone and the rest of the team.” Doctors provided details on the severity of the infection and Alfieri noted that not all patients who developed such a severe case of double pneumonia survived, much less be released from the hospital. “When he was in really bad shape, it was difficult that he was in good spirits,” Alfieri said. “But one morning we went to listen to his lungs and we asked him how he was doing. When he replied, ‘I’m still alive’ we knew he was OK and had gotten his good humour back.”\n\nAlfieri confirmed that Francis was still having trouble speaking due to the damage to his lungs and the time he spent on supplemental oxygen and ventilation. But he said such problems were normal and predicted his voice would return. “When you have a bilateral pneumonia, your lungs get damaged and the respiratory muscles are in difficulty. You lose your voice a bit, like when you speak too high,” Alfieri said. “As for all patients, young or old but especially older ones, you need time for it to come back as it was.” Alert and co-operative The Argentine pope, who has chronic lung disease and had part of one lung removed as a young man, was admitted to Gemelli after a bout of bronchitis worsened.\n\nDoctors first diagnosed a complex bacterial, viral and fungal respiratory tract infection and soon thereafter, pneumonia in both lungs. Blood tests showed signs of anaemia, low blood platelets and the onset of kidney failure, all of which later resolved after two blood transfusions. Loading The most serious setbacks began on February 28, when Francis experienced an acute coughing fit and inhaled vomit, requiring the use of a non-invasive mechanical ventilation mask to help him breathe. He suffered two more respiratory crises a few days later, which required doctors to manually aspirate “copious” amounts of mucus, at which point he began sleeping with the ventilation mask at night to help his lungs clear the accumulation of fluids. At no point did he lose consciousness, and doctors reported he always remained alert and co-operative. Over the past two weeks, he has stabilised and registered slight improvements. He no longer needs to wear the ventilation mask at night, and is cutting back his reliance on high flows of supplemental oxygen during the day. Doctors said the pope, who uses a wheelchair, had probably lost some weight during his hospital stay.\n\nAt his home in the Santa Marta hotel, next to St Peter’s Basilica, Francis will have access to supplemental oxygen and 24-hour medical care as needed, though Carbone said he hoped Francis would progressively need less and less supplemental oxygen. Francis will continue to take oral medication for several months to treat the fungal infection in his lungs. Pope Francis in the private chapel on the 10th floor of Rome’s Gemelli Hospital. Credit: Holy See Press Office Alfieri said it was actually safer for him to continue his recovery and rehabilitation at the Vatican since hospitals “are the worst place to convalesce because it’s the place where you can catch the most infections”. The Vatican spokesman, Matteo Bruni, declined to confirm any upcoming events, including a scheduled audience on April 8 with King Charles III or Francis’ participation in Easter services at the end of the month. But Carbone said he hoped Francis might be well enough to travel to Turkey at the end of May to participate in an important ecumenical anniversary.",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/politics/federal/budget-to-reveal-tax-burden-at-its-lowest-since-pandemic-20250323-p5llsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Budget to reveal tax burden at its lowest since pandemic",
    "publish_date": "Sun, 23 Mar 2025 22:30:00 +1100",
    "category": "finance",
    "authors": [
      "David Crowe",
      "Shane Wright"
    ],
    "text": "Taylor criticised Chalmers for not setting a benchmark for tax as a percentage of gross domestic product, a key point for the Coalition after it set a goal of 23.9 per cent a decade ago. “Tax has been going up. Those fiscal guardrails, by the way, the reason they are so important is they discipline the government. They discipline the bureaucracy. They discipline colleagues, and Jim Chalmers has lost control,” Taylor said. The Coalition is vowing to bring the tax target down and to reduce spending growth at the same time, triggering a row with Labor on Sunday about potential cuts to programs. “You would ensure, as we did when we were last in government, your economy grows faster than spending,” Taylor said. “Crucial to that is: boost growth; make sure you’ve got a strong, growing economy. That’s why we’ve said we’ll up the productivity goals – Labor’s given up the ghost on that – and make sure that the economy is growing faster than spending.”\n\nThe budget will show that tax has fallen from 23.7 per cent of GDP last year to 23.1 per cent this financial year, according to sources who spoke on condition they were not named. The new forecast compares with an estimate of 23.4 per cent for the same period in the last budget update. In dollar terms, the lower tax-to-GDP ratio equates to about $6 billion in revenue forgone compared with the slightly higher ratio forecast last year. However, tax receipts will rise in dollar terms from $633.4 billion last year, reflecting the bigger economy. The growth in payments will outstrip the increase in revenue, dragging the budget back into deficit. The government will cite the tax forecast to assure voters it is doing what it can to limit the tax burden on workers, at a time when the Coalition is blaming Labor for loading the federal budget with additional spending.\n\nWhile the Coalition indicated on Sunday it would support the government’s latest spending initiative – a $1.8 billion extension in the subsidies for household energy bills – it also said the policy was giving households something they had already paid for with their taxes. Opposition Leader Peter Dutton called the bill relief a “Ponzi scheme” – a fraud that pretends to offer a financial return by paying early investors with the money collected from later investors – even though Coalition frontbenchers indicated they would support the policy. The budget will contain $2.1 billion in savings and shifts of spending into other areas, just a tenth of the $22 billion the government announced in its first budget in 2022. The cuts include another $720 million reduction in expenditure on consultants, contractors and labour hire, taking to almost $5 billion in savings in this area since Labor took office. Finance Minister Katy Gallagher said the government had made $95 billion in either cuts or reprioritisations since the last election.\n\n“Saving almost $95 billion in a single term of government has meant we can invest in the things that matter most, like cost-of-living support, Medicare and housing,” she said. Loading The Coalition has signalled it will save $6 billion a year by slicing up to 36,000 public servants, prompting accusations from the government that it will reduce services and start re-employing labour-hire workers and consultants. On Sunday, Taylor said the government had allowed the bureaucracy to grow while consumer service had gone backwards. Taylor would not confirm a 36,000 cut, only confirming the Coalition wanted to reduce the public service back to its pre-pandemic level.\n\n“What we’ve been very clear about is we want to get back to where we were when we were last in government,” Taylor told the ABC’s Insiders program. “That shouldn’t be in areas of frontline services. It should be in the back-office areas.” The Coalition has opposed $100 billion in government programs. They include three large off-budget investment vehicles, including the $19 billion Rewiring the Nation Fund, the $20 billion National Reconstruction Fund and the $10 billion Housing Australia Fund, plus Melbourne’s Suburban Rail Loop and the current electric vehicle fringe benefits tax discount. With the budget heading back into deficit after two years of surpluses, Labor has limited means to offer financial help without being blamed for fuelling inflation and delaying further cuts to official interest rates. Albanese seized on the issue of working from home on Sunday morning to accuse Dutton of wanting Australians to be forced to go into the office more days each week, incurring more transport costs. The Labor attack is based on a calculation that Australians would pay $3056 in transport costs, on average nationwide, to get to work two days a week – the key figure in the assumption about what they would have to pay if the Coalition opposed working from home.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/garrick-s-28-point-haul-powers-manly-to-canberra-demolition-20250323-p5lltk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manly ruing likely long-term injury to Paseka in Canberra thrashing",
    "publish_date": "Sun, 23 Mar 2025 22:19:27 +1100",
    "category": "sports",
    "authors": [
      "Robert Dillon"
    ],
    "text": "Manly may have lost prop Taniela Paseka for the season after he suffered a suspected ruptured Achilles in Sunday night’s 40-12 trouncing of Canberra at Brookvale Oval.\n\nThe towering forward was helped from the field in obvious distress by two trainers after breaking down midway through the first half.\n\nTaniela Paseka was helped from the field. Credit: Getty Images\n\nSea Eagles coach Anthony Seibold said Paseka will need scans to confirm the initial diagnosis, but medical staff were prepared for the worst-case scenario.\n\n“I think he’s booked in for an operation tomorrow, which is really disappointing for Taniela personally, and his family, and us as a club, because he’s been starting front row since I’ve been at the club and someone that we value on and off the field,” Seibold said.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/chinese-grand-prix-2025-live-updates-oscar-piastri-looks-to-bounce-back-from-albert-park-heartbreak-20250323-p5llps.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chinese Grand Prix 2025 LIVE: Sweet glory for Oscar Piastri in Shanghai as he banishes Albert Park heartbreak",
    "publish_date": "Sun, 23 Mar 2025 22:15:56 +1100",
    "category": "sports",
    "authors": [
      "Russell Bennett"
    ],
    "text": "Oscar Piastri drove a nearly faultless race to win in Shanghai. Credit: AP\n\nBayside Melbourne product Oscar Piastri has shown the maturity of a future Formula 1 champion, turning his Albert Park heartbreak into grand prix glory in Shanghai just seven days later.\n\nStarting on pole for the first time in his F1 career, the 23-year-old Piastri was typically cool, calm and collected all race as he kept the best in the business at bay for 56 blistering laps of the Chinese Grand Prix to win his third main race in world motor sport’s premier class.\n\n“It’s been an incredible weekend from start to finish,” Piastri said on Sky after the race, adding that he hoped this victory marked the start of his title charge after finishing ninth in Melbourne.\n\n“[The car was] pretty mega the whole time, I think, today.\n\n“I’m just proud of the whole weekend – this is what I feel like I deserve from last week.\n\n“I’m extremely happy.”\n\nMercedes’ George Russell, Red Bull’s four-time reigning world champion Max Verstappen, and Piastri’s own McLaren teammate Lando Narris – who saluted in Melbourne seven days prior – all pushed Piastri to the brink, but he was unflinching.\n\nThough struggling with wheelspin off the start line at the end of the monstrous Shanghai straight, Piastri kept Russell behind him going into turn one and refused to look back – despite a few hair-raising moments when it came to tyre strategy.\n\nPiastri pitted early from the lead and then stayed on his hard tyres, like the bulk of the field, for the remainder of the race in a true battle of attrition.\n\n“The hard was a much better tyre than everyone expected, I think,” Piastri said of what was essentially a wire-to-wire win.\n\n“To go all the way to the end like that was a bit of a surprise, but a happy surprise.”\n\nPiastri – who after the race said his heritage is part-Chinese, to the roar of the crowd – held his nerve as Norris pushed in second, both of them trying desperately to keep the “dragster” (in the words of Ferrari racer Charles Leclerc) of Russell’s Mercedes behind them.\n\nFor his part, Norris congratulated Piastri for his win.\n\n“Turn one went to plan, but then George [Russell] got me in the pit stops and I was a little bit nervous because our pace was a lot better in the second stint … it was a tough race, just with the management [of it],” Norris said.\n\n“I don’t think many people expected a one-stop today. Oscar drove well, he was quick the whole race – I tried to get close, but in the end I just couldn’t.”\n\nNorris was asked if he could have fought Piastri for the win, to which he replied: “It doesn’t matter now really, does it? He deserved the win, and he drove very well all weekend.”\n\nPiastri had finished second in the sprint race on Saturday before setting two lap times good enough for pole position in claiming the top spot on the grid for the first time in his career.\n\nThere’d be no repeat of Albert Park, where Piastri slid off on lap 44 while battling Norris for the lead. This was redemption.\n\nPiastri summed it up best following the win: “The car was very lovely ... great team effort. That is one satisfying weekend,” he said at his understated best over the radio.\n\nNorris tried everything to push Piastri to the brink again, but this time around the Australian had the race lead to his advantage – setting the race pace, and looking after his tyres after what initially loomed as an action-packed two-or-three-stop race. Norris, by contrast, struggled with his brakes in the race’s closing stages.",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/raiders-left-puzzled-by-denied-try-20250323-p5lluw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Raiders left puzzled by denied try",
    "publish_date": "Sun, 23 Mar 2025 21:43:12 +1100",
    "category": "finance",
    "authors": [],
    "text": "Raiders left puzzled by denied try\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/afl/eagles-emphatic-response-falls-short-as-lions-escape-20250323-p5lltj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Roos torched Dees in 11 minutes; Reid set for scrutiny after flipping the bird; Swans sink Dockers in thriller",
    "publish_date": "Sun, 23 Mar 2025 21:22:28 +1100",
    "category": "sports",
    "authors": [
      "Marc Mcgowan",
      "Peter Ryan"
    ],
    "text": "Xerri won the tap, and Powell won a test of strength with Christian Petracca, who slipped to the Marvel Stadium surface as the emerging Roo swooped on the Sherrin and thumped a chaos ball into attack. Petty got his hands to it, fumbled, then the elusive Robert Hansen jnr – who has improved at a rapid rate – produced some fancy footwork before dishing a handball to Larkey for another goal. By this time, Melbourne coach Simon Goodwin had hurried to ground level to join his team on the bench. The Demons fended off another centre clearance and actually managed a shot at goal, but Petracca’s long potshot landed in Aidan Corr’s hands. It was a chance for North to score another way. Corr started a scoring chain from the last line of defence, with Stephens, 300-gamer Jack Darling and Sheezel getting involved, then Hansen jnr shook a tackle and handballed to Curtis, who found Cam Zurhaar for another goal. That was the Kangaroos’ fourth in barely seven minutes, and it was apparent the game was over – but the avalanche was not.\n\nAfter leading by 18 points at three-quarter-time, North Melbourne were suddenly seven goals clear. The next one came via a horror Ed Langdon turnover. Melbourne’s winger had Clayton Oliver nearby, but somehow ballooned the ball over his head to North recruit Luke Parker, who instantly handballed to Simpkin to set up Curtis’ third goal. Tristan Xerri had the better of the ruck battle with Max Gawn. Credit: Getty Images Even elementary errors turned to gold for the Kangaroos. Minutes later, Davies-Uniacke dropped a chest mark, but recovered, busted through multiple Demons, and blasted his team inside 50. What seemed certain to be a stoppage instead transformed into another goal-scoring opportunity as the ball bobbled into the clear, and Zurhaar banged through his fourth. The damage had long been done, but only then did North Melbourne relent ever so slightly.\n\n“[It is] very satisfying because they’re a high-quality midfield, and it’s really hard to get on top of them,” Clarkson said. “I thought ‘X’ [Xerri] was fabulous in the ruck against Max, and that’s where the ascendancy came from. I think we had four centre-bounce goals in the last quarter, and that really broke the back of the Melbourne side, when it can just pop straight out of the centre, and you get a goal straightaway. “I think we had four goals in the first five minutes of the last quarter, in a game where only two or three goals were separating the sides for the bulk of the day. It was really important that we were able to split it open in a quick space of time.” North Melbourne finished with 52 more disposals, 12 extra clearances and plus-19 in contested possessions, yet Melbourne won the inside-50 count by three, largely based on their territory dominance in a wasteful third quarter. Goodwin was understandably disappointed post-match, but offered an explanation for his captain Gawn’s rare down day.\n\nXerri finished with 20 disposals to Gawn’s 11 and 12 clearances to one, as well as outmarking the champion Demon before kicking a goal to start the second half. “Today, I think [Gawn] will acknowledge that he got beaten by a really good opponent, but you also have to realise that, in life, there are other things that are going on,” Goodwin said. “We’ll support Max. He’s a great person, he’s a great leader, and there’s a backstory to everyone’s performance. Max is someone who we take enormous pride in, and he’s going to continue to be a great leader for this footy club, and be a big part of our response. “I’m not going to go into the details, but … he’s someone who we love dearly.” Matt Jefferson suffered a fractured hand in a contest late in the first quarter, while Jake Lever rolled his left ankle.\n\nMarc McGowan Reid set for AFL scrutiny after flipping crowd the bird West Coast have fallen short of inflicting one of the great turnaround victories, pushing defending champions the Brisbane Lions to the brink at the Gabba. The Eagles, who had been dominated at the contest by Gold Coast in an 87-point loss last week, stormed out of the gates, kicking the first five goals of the match. They led at every break, but the Lions proved too good in the end, prevailing 14.10 (94) to 11.9 (75). Harley Reid gave the Brisbane crowd the finger. Credit: Fox Footy\n\nStar West Coast youngster Harley Reid may have to deal with AFL scrutiny on top of the loss after he flipped the bird towards the crowd in the final term. Reid was being heckled by Lions supporters, including one who appeared to be loudly offering him a pack of tissues. Reid (15 touches, seven tackles, six clearances) worked hard and was a playful target for the 30,000-strong crowd whenever he hit the deck. He could face a financial sanction for his act. Retired Richmond star Dustin Martin was fined $7500 ($5000) in 2019 for giving GWS ruckman Shane Mumford the finger, though that involved a secondary gesture, while ex Carlton skipper Marc Murphy was fined $900 for giving the Collingwood cheer squad the finger in 2012. Reid’s coach Andrew McQualter defended his gesture to the crowd. “We try to bash the theatre out of this game sometimes, don’t we? He’s just having a bit of fun. Sometimes that’s good for the game I think,” McQualter said. On Sunday, it was West Coast winning the early battles after a steamy midday start, while their defensive set-up also rattled the Lions, who last week conceded the first four goals against Sydney but still won.\n\nMcQualter demanded more from his team against the premiers than they showed in round one, and his side responded. Attempts to move the ball quickly were continually undone by McQualter’s men, with the Lions repeatedly rushed into mistakes and adding unforced errors as the Eagles shot ahead and maintained a 24-point lead until the main break. The action was intense early on, with Jarrod Berry battling for possession with Jayden Hunt. Credit: AAP It muted a shell-shocked crowd, who had minutes earlier watched club legends Simon Black and Alastair Lynch help unfurl their premiership flag for the first time since that pair helped win the last of their three-straight titles in 2003.\n\nEagles wingman Tyrell Dewar was impressive early, the second of his two quick goals a mighty effort from outside 50 metres from another smooth transition from the centre square. Loading Liam Ryan launched the first of his three goals too, the premiership veteran on song along with Tim Kelly (29 disposals) and Liam Baker (24), who enjoyed a spirited running battle with Brisbane star Lachie Neale (35). Restricted to just 10 touches in last week’s defeat of Sydney, Neale had 11 by quarter time. He snapped a handy goal in the second quarter to keep the Lions close then set up a Zac Bailey goal with another pinpoint kick forward.\n\nBrisbane edged within six points when Callum Ah Chee kicked two goals to begin the third term. The Eagles missed chances to surge clear again, twice hitting the post, having another touched on the line and wasting an opportunity from close range. Ah Chee’s third for the term gave the Lions their first lead since kicking the game’s opening point, but the expected deluge from the home side didn’t quite come. Jack Petruccelle’s goal moments after he was subbed on put the Eagles back in front, and Tyler Brockman’s final-quarter double kept them close. But the hosts chipped away, Josh Dunkley snapping truly and Logan Morris soaring to mark and kick his second that effectively iced the contest, before he added a third.\n\nBrisbane debutant Will McLachlan kicked two goals, winger Jaspa Fletcher was a standout when the chips were down and added a late goal, while Dayne Zorko’s (28 disposals) influence grew approaching half-time. AAP Swans sink Dockers in thriller Chad Warner has put on a star display and Joel Amartey kicked the match-winner with less than 90 seconds remaining as Sydney pulled off a stunning three-point win over Fremantle at Optus Stadium. The Dockers led by 22 points at quarter-time and were still clinging to a slender lead as the clock wound down in Sunday’s match in front of 43,882 fans.\n\nAmartey gave Sydney the lead when he out-muscled Brennan Cox in a marking contest before calmly slotting the 20m set shot with 86 seconds remaining. In a frantic finish, Fremantle surged forward for one final attack with just seconds remaining. Joel Amartey booted two goals, one of which was the match-winner. Credit: AFL Photos via Getty Images A long kick into attack was marked by Dockers forward Jye Amiss, but the siren had sounded just a second earlier, giving Sydney the 9.14 (68) to 9.11 (65) win. The result marked Dean Cox’s maiden AFL win as Sydney coach and ensured the Swans avoided slipping to a 0-3 record heading into their bye week.\n\nWarner, who is being hotly pursued by Fremantle and West Coast, finished with 26 disposals and 10 inside-50s. Sydney tagger James Jordon (24 disposals, 10 clearances) nullified the influence of Caleb Serong (19 disposals, five clearances, one goal) in a critical shut-down role. Chad Warner with a game-high 26 touches. Credit: AFL Photos via Getty Images Jaeger O’Meara (32 possessions) and Nathan O’Driscoll (25) racked up big numbers for Fremantle, while Josh Treacy kicked four goals. Star Dockers recruit Shai Bolton looked rusty on the way to 15 disposals and four clearances.\n\nFremantle defender Brandon Walker was subbed off in the second quarter with a left shoulder injury. The Dockers and the Eagles are 0-2 heading into next Sunday’s western derby. Shai Bolton appeared rusty on the way to 15 disposals and four clearances. Credit: AFL Photos via Getty Images In a pressure-filled opening quarter, Fremantle made the most of their chances by kicking four goals to nil to take a 22-point lead into the first break. Treacy kicked the first two goals of the match, and fellow bigs Luke Jackson and Patrick Voss also hit the scoreboard as Fremantle flexed their muscle.\n\nSydney failed to capitalise on a 10-5 advantage at the stoppages on the way to spraying 0.5 for the term. But they fared much better in the second quarter with three goals. A bit of midfield magic from Warner allowed Peter Ladhams to kick Sydney’s first goal of the match. And when Warner snared a goal himself later in the term, the margin was just four points as the boos rang around Optus Stadium. Serong was largely nullified by Jordon in the opening half but managed to pop up for a goal to give Fremantle a nine-point buffer at half-time.\n\nSydney’s stoppage dominance meant Fremantle were forced to defend for prolonged periods in the third quarter. The Swans hit the lead late in the term, but Bailey Banfield’s tough set shot from near the boundary gave Fremantle a two-point edge at the final change. Dean Cox sings the Swans’ anthem for the first as senior coach. Credit: Getty Images Sydney surprisingly subbed off ruckman Brodie Grundy 11 minutes into the final term, and Amartey limped off just minutes later with a corked leg. Amiss scored the first goal of the last term at the 14-minute mark, but mature-age recruit Riley Bice replied a short time later with his maiden AFL goal.\n\nAmartey came back on the field and popped up for the match-winner. Dangerfield escapes suspension for Byrnes incident Geelong skipper Patrick Dangerfield will be available for the preliminary final rematch against the Brisbane Lions after receiving a fine for elbowing St Kilda’s Ryan Byrnes in the head during the third quarter of Saturday night’s loss. The veteran Cat’s striking action was ruled low impact and careless. Although he caught Byrnes high, his elbow slipped off Byrnes’ shoulder before making contact with his head. Geelong’s Patrick Dangerfield makes late contact on St Kilda’s Ryan Byrnes. Credit: Fox Footy\n\nThe decision is a relief for the Cats, given champion defender Tom Stewart is likely to be unavailable with a knee injury that resulted in him being subbed off in the first quarter against the Saints. Cats coach Chris Scott said post-game the injury was minor, although there are concerns Stewart may have suffered a PCL injury as he landed heavily on the ground. Jeremy Cameron also appeared hampered by a lower leg injury, but the club said it was not worried about the availability of the forward. Dangerfield was one of 13 players fined after Saturday’s matches. Young Eagles midfielder Harley Reid might be added to the list after Sunday’s games are assessed.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/bushfire-comes-close-to-homes-in-perth-20250323-p5lluv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bushfire comes close to homes in Perth",
    "publish_date": "Sun, 23 Mar 2025 21:13:50 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bushfire comes close to homes in Perth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/politics/federal/best-of-cartoons-march-24-2025-20250323-p5lluu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best of cartoons, March 24, 2025",
    "publish_date": "Sun, 23 Mar 2025 21:11:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Best of cartoons, March 24, 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/the-hairpin-of-my-life-five-key-moments-from-piastri-s-china-win-20250323-p5lltb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The hairpin of my life’: Five key moments from Piastri’s China win",
    "publish_date": "Sun, 23 Mar 2025 20:59:37 +1100",
    "category": "sports",
    "authors": [
      "Matthew Clayton"
    ],
    "text": "Unruffled, matter-of-fact and devoid of histrionics: an apt description of Oscar Piastri’s workplace personality, and an equally accurate summation of his third Formula 1 win, the 23-year-old Melburnian cooly converting from his maiden pole position in China on Sunday.\n\nA week after his best chance to snap Australia’s hoodoo of no local driver finishing on the Albert Park podium went awry when a late-race spin in the rain meant he finished ninth, Piastri was utterly dominant, leading for 53 of the 56 laps to head a McLaren one-two over teammate and Australian Grand Prix winner Lando Norris, who finished 9.748 seconds adrift.\n\nWhile late-race brake problems saw Norris fall away in Shanghai, Piastri was in complete control throughout, his lead in the second stint of the race after his sole pit stop on lap 14 never falling below 2.5 seconds as he added victory to his successes in Hungary and Azerbaijan in his sophomore season in 2024.\n\nIt was Piastri at his controlled, decisive best; a victory where his chat over team radio was economical and succinct, underpinned by actions rather than words.",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/real-trouble-united-hit-with-injury-blow-20250323-p5llut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Real trouble': United hit with injury blow",
    "publish_date": "Sun, 23 Mar 2025 20:52:57 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Real trouble': United hit with injury blow\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/manly-star-drops-with-injury-20250323-p5llur.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Manly star drops with injury",
    "publish_date": "Sun, 23 Mar 2025 20:27:51 +1100",
    "category": "sports",
    "authors": [],
    "text": "Manly star drops with injury\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/piastri-claims-first-race-win-of-2025-20250323-p5llup.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri claims first race win of 2025",
    "publish_date": "Sun, 23 Mar 2025 20:17:52 +1100",
    "category": "sports",
    "authors": [],
    "text": "Piastri claims first race win of 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/aussie-high-jumpers-claim-gold-and-silver-at-worlds-20250323-p5lluh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie high jumpers claim gold and silver at worlds",
    "publish_date": "Sun, 23 Mar 2025 20:13:10 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie high jumpers claim gold and silver at worlds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/driver-fears-410-road-fine-is-impacting-job-prospects-its-unfair-212734400.html",
    "title": "Driver fears $410 road fine is impacting job prospects: 'It's unfair'",
    "publish_date": "2025-03-22T21:27:34Z",
    "category": "finance",
    "authors": [],
    "text": "Montana Shaw believes the driving offence she carries from a passenger's wrongdoing is affecting her chances of getting a job.\n\nMontana Shaw's mum was taking her jacket off when they drove past the roadside camera in Sydney. Source: Supplied\n\nA recent graduate fears her years of hard work could be jeopardised by a split-second decision made by a passenger in her car. Montana Shaw, 22, was heading to an event at Sydney's International Convention & Exhibition Centre in September when her mum removed her heavy puffer jacket while seated in the vehicle.\n\nJust as they passed a roadside camera, her mum's seatbelt \"slipped under her boob\" as she twisted to take the garment off. As a result, the young driver copped a $410 penalty and three demerit points for her passenger's seatbelt not being worn correctly — an offence she worries will now impede her career.\n\n\"It was such bad timing,\" Montana told Yahoo News Australia. \"I have to detail this driving fine in job applications now... I've just completed a bachelor of law... and I'm looking to get into a government job.\"\n\nDue to the nature of her work, the applications are extensive and often ask candidates to provide details on any previous criminal activity. This is where the issue with the driving fine comes in.\n\nADVERTISEMENT\n\n\"When I go to a job application it'll ask standard questions like, 'Have you been in jail?', 'Have you received a fine?'... now every time I have to tick the box and let them know, yes, I have had a fine,\" she said.\n\nDriver concerned fine will impede on her job prospects\n\nMontana's mum paid the fine and looked into changing the offence over to her name, but the pair ultimately came to the realisation the driver would have to take on the responsibility and cop the three demerit points as specified by driving laws.\n\n\"There was one application where it asked how many points I've accrued... it's a little frustrating because it wasn't my fault and I've not had any before. I can understand if it's a speeding fine,\" she told Yahoo. \"The fact that I had to outline the fine I got that wasn't my fault is unfair.\"\n\nMontana now has to include details of the driving offence in her job applications. Source: Supplied\n\nHave you copped a driving offence due to a passenger's wrongdoing? Get in touch with sophie.coghill@yahooinc.com\n\nADVERTISEMENT\n\nShe believes the fine could very likely hinder her chances of being contacted for interviews, fearing many recruitment softwares simply clear out applications that tick a 'yes' for answers to do with criminal activity and fines without looking at the circumstances.\n\n\"I am worried that I won't get through all the stages now that that box is ticked... I have to wear it for five years,\" she said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/young-aussies-380-find-among-rubbish-put-out-for-council-collection-in-wealthy-suburb-204846248.html",
    "title": "Young Aussie's $380 find among rubbish put out for council collection in 'wealthy' suburb",
    "publish_date": "2025-03-22T20:48:46Z",
    "category": "finance",
    "authors": [],
    "text": "Council rubbish enthusiast Em says there is 'more than enough for everyone' to start searching for their own hidden gems.\n\nAmateur treasure hunter Em says there are plenty of valuable items to be found in Australia's richest suburbs. Source: TikTok/Sydstreetbounty\n\nA young Aussie has proven someone's trash truly is someone else's treasure, after making an incredible $380 discovery in a pile of rubbish put out for council collection in one of the country's most affluent suburbs.\n\nSydneysider Em, who describes herself as an \"amateur treasure hunter\" had no idea how valuable the innocent-looking pen she picked up in the eastern suburb of Vaucluse would end up being.\n\n\"Nothing really drew me to it besides the fact that it was a bit heavier than a regular pen and had a base to store it in, and a bit of etching of a logo in the bottom of it,\" she told Yahoo News Australia.\n\nBut when she got it home and did some research, she learned the item she innocently picked up to decorate her desk is a designer item made by ACME Studios which retails for $380 new. The pen, which is made out of lathe spun rosewood and is gold plated, is the work of Italian designer Matteo Thun.\n\nADVERTISEMENT\n\n\"It really was just a bit of luck,\" she said.\n\nEm has furnished her entire house with items she's found on the kerb waiting for council collection. Source: TikTok/Sydstreetbounty\n\nThe treasure hunting trend across Aussie suburbs\n\nEm explained that after she began using a Lime Bike as her main form of transport, she \"started realising how much valuable waste is put out on Sydney's streets every day.\n\n\"At least in the inner city and inner west, there really is a culture of putting perfectly usable items out on the sidewalk with the expectation that people will rummage through it and take whatever they need,\" she said.\n\nUnfortunately, what isn't picked up will end up in landfill, she said. According to the NSW Environmental Protection Agency (EPA), Sydney's landfills are set to run out of space by 2030 — putting a ticking clock on the need to increase recycling rates and divert food waste.\n\nEm started out \"paying more attention\" to online groups to find freebies, but it wasn't long before she realised people were sharing maps and dates of council collections around the city. Since the beginning of the year, Em has headed out five times to areas like Woollahra, Bellevue Hill, Watsons Bay and Vaucluse, all of which are in the top 10 wealthiest suburbs in all of Australia.\n\nADVERTISEMENT\n\n\"It’s well worth the time to go and see what these people are throwing away,\" she told Yahoo. So far, she's found pianos, barbecues, televisions, sturdy tables, working Dyson vacuum cleaners, lamps, and plants.\n\n\"I’ve pretty much furnished my entire house doing this over the summer and it’s been fantastic for my wallet,\" she said.\n\nTreasure hunter's tips to Aussies who want to get involved\n\nWhile Em admits \"some junk is just junk\" much of the stuff people throw out can be made new again with a clean or repair. \"A lot of people really don’t know the value of what they’re throwing away, but for the people willing to make the effort and glove up, it’s anyone’s game,\" she said.\n\nADVERTISEMENT\n\nHer advice to anyone looking to get their hands dirty and sift through rubbish left on the kerb for council collection is that it's important to wear gloves and sunscreen first and foremost.\n\n\"Look in drawers (because sometimes people forget to empty them), respect the people of the suburb and don’t make a mess of the street while looking through,\" she said. \"Don’t worry about what time you go, there really is more than enough for everyone.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 43
  }
]