[
    {
        "url": "https://www.9news.com.au/world/texas-woman-sues-state-lottery-after-not-receiving-controversial-835m-jackpot/e1d30259-9f44-40d2-8af6-77874e8f24d9",
        "title": "Texas woman sues state lottery after not receiving $128m jackpot",
        "publish_date": "Sun, 25 May 2025 01:43:18 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A woman in Texas is suing the state's Lottery Commission for not paying out a US$83.5 million ($128.6m) award, more than three months after the numbers on her ticket matched the winning numbers in a draw, according to court documents obtained by CNN .\n\n\"Every Texan knows what that should mean when it comes to the lottery – if you win, you should get paid,\" the suit says.\n\n\"It shouldn't take a lawsuit to get paid when you win the lottery. But that's exactly what has happened here.\"\n\nA printed ticket from a Texas Lottery sales terminal at Fuel City in Dallas. (AP)\n\nThe woman bought her ticket through a lottery courier service, firms which allow customers to purchase tickets virtually, using a mobile app or other online interface.\n\nThe woman, identified only as Jane Doe in the suit, purchased a ticket for the \"Lotto Texas\" lottery game through an app called Jackpocket on February 17, and her numbers matched those of the numbers pulled at 10.12pm (local time) the same day, according to the lawsuit.\n\nA week after Doe won her ticket, then-Texas Lottery Commission Executive Director Ryan Mindell announced a move to ban courier services like the one Doe used, under Texas law.\n\nThe ban became effective on May 19, according to a lottery commission spokesperson. Mindell resigned in April.\n\nHer ticket matched the winning numbers in a draw, according to court documents . (Getty)\n\n\"We all know the Commission is not allowed to change the rules after the drawing. But the Commission has apparently tried to do so and relied – at least in part – on this ex post facto announcement to continue to refuse to pay plaintiff her lottery winnings simply because she utilised a lottery ticket courier service to buy the winning ticket,\" the lawsuit says.\n\nA spokesperson told CNN in an email Saturday the commission \"does not comment on pending litigation.\"\n\nThe lawsuit also alleges Doe's unpaid winnings could be used to pay other Texas Lottery winners, or may be reallocated and redirected to \"other commission liabilities or purposes,\" potentially reducing the amount owed to her.\n\nAttorneys for the woman have also filed for a temporary restraining order and requested for a temporary injunction to stop Acting Deputy Executive Director of the Texas Lottery Commission Sergio Rey from doling out funds, which the lawsuit alleges Doe still has not received.\n\n\"If Mr Rey is not restrained and enjoined from disbursing or diminishing the plaintiff's jackpot prize winnings, plaintiff will suffer damages that will be incapable of being measured by any certain pecuniary standard before notice is given and a hearing is held on plaintiff's application for temporary injunction,\" a court document said.\n\nCNN has reached out to Texas Governor Greg Abbott's office, Jackpocket, and Rey for comment.\n\nWhat is a lottery courier service?\n\nA lottery courier service acts as a third-party vendor that buys lottery tickets on behalf of customers, coordinates the purchase of physical tickets through brick and mortar stores the services often own, and notifies buyers if they win.\n\nCourier services are typically operated online or through an app, offering a convenient way to play games. Some couriers even offer national lottery games like Mega Millions and Powerball.\n\nLottery couriers, which had been operating in Texas since 2019, became a focus in April 2023 after a single entity bought 25 million lottery tickets in less than 72 hours using a courier service, CNN affiliate WFAA reported.\n\nThe entity purchased \"nearly every possible number combination,\" the release from the governor's office said at the time. The investor doubled its money because the jackpot was so high, and the winner took home US$89 million before taxes, WFAA said.\n\nCourier services are operating in 19 states, according to a report published in 2024 by the Florida Office of Program Policy Analysis and Government Accountability.\n\nOnly three states – New York, New Jersey and Arkansas – regulate the courier service industry, according to a 2024 Texas House report. Without such regulations in Texas, couriers are not required to obtain a licence or permission from the Texas Lottery to operate, the report found.\n\nPurchasing via a lottery courier has two advantages for the customer, said Victor Matheson, professor of economics at College of the Holy Cross.\n\n\"It allows the buyer to conveniently buy tickets without having to go to a regular lottery retailer and it also potentially allows out-of-state buyers to purchase tickets in any lottery across the country,\" Matheson said in February.\n\nThe service can have drawbacks like a fee, legality issues and lack of a limit to how many tickets are purchased, Matheson added. Other legal concerns include the regulation of sales across state lines when each state controls its own lottery games, sales to underage players, ticket buying syndicates and other issues.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/drought-farmers-plead-for-help-in-south-australia/01e0125a-73f2-46f7-8a23-a5f757f8559a",
        "title": "'There's never been a drought like this': Farmers plead for help in South Australia",
        "publish_date": "Sat, 24 May 2025 22:00:05 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Farmers in South Australia are calling for more help amid a drought they say is the worst they've ever seen.\n\nCassie Oster says her family farm of more than 40 years in Peake, two hours from Adelaide , has been suffering for around 18 months.\n\nAnd while some funding help has been announced, she urged leaders to talk to farmers to see how they can better help.\n\nCassie Oster, centre, with Leigh Oster and Dale Farley on their farm in South Australia. (Supplied)\n\n﻿\"We just need people to understand that it's happening,\" she told 9news.com.au.\n\n\"There's never been a drought like this in South Australia.\n\n\"We've never, ever experienced this.\n\n\"It's never gone on for this long.\"\n\nShe says they have just had to make the tough choice to sell 1000 ewes, which will have an impact lasting for years.\n\nFor example, it means far fewer lambs to sell next year, after what has already been a tough few years with falling livestock prices.\n\nEven if it rains soon, the soil will be in no fit state to plant crops.﻿\n\n\"To come off the back of that bad year for livestock prices and straight into a year of drought and into another one, there's only so many emergency funds you can draw on,\" she said.\n\n\"One farmer put it so well. He said, 'To work for an entire year the same amount of hours that I did the year before, to be behind, is heartbreaking.'\"\n\nThe Bureau of Meteorology confirmed that since 2021, parts of agricultural regions of South Australia have seen record low rainfall compared with records as far back as 1900.\n\n﻿A $55 million package was announced last month by the SA government, on top of $14 million from November 2024.\n\nOster said while they were able to get some grants, they need leaders to understand what they are facing and allow more farmers to get more help.\n\n\"Why don't you just talk to us? Have a bit more community feedback and consultation,\" she said.\n\n\"We are the best ones to say, 'This would help, that would help'.\"\n\nWhile there is a petition to urge the state government to declare a drought to release cash, this is no longer the protocol.\n\nThe National Drought Agreement (NDA) says it instead aims to offer help based on need instead, rather than declaring droughts as happened in the past.\n\nW﻿ade Boughen runs family sheep farm Kamora Park Poll Merinos. (Facebook)\n\nW﻿ade Boughen's fields a few years ago, before drought hit. (Facebook)\n\nW﻿ade Boughen, who runs family sheep farm Kamora Park Poll Merinos, two hours east of Adelaide, started the petition and just wants more help.\n\n\"The amount of money they've issued doesn't really cover too much, we haven't got anything in relief,\" he told 9news.com.au.\n\n\"Without timely intervention, we risk irreversible damage.\"\n\nREAD MORE: How the drought crisis will affect your weekly shop ﻿\n\nSouth Australian Liberal MP Nicola Centofanti﻿, the opposition primary industries spokeswoman, said the relief package has \"missed the mark\".\n\nLast week, she read a letter from a farmer in state parliament, in which a farmer said a farming friend had taken his own life over the stress of the drought.﻿\n\n﻿\"There is too much red tape, too much time required to access help and lengthy waiting times for outcomes,\" she said.\n\nClare Scriven, South Australian minister for primary industries and regional development, said in a statement the $73 million drought support package has been \"designed in consultation with primary producers, farmers and key industries bodies\".\n\n\"I want to get the message out; drought declarations don't happen,\" she said.﻿\n\n\"There is an absolute need for people to reach out now because assistance is available.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/vivid-sydney-2025-all-the-lights-and-action-from-opening-night-in-pictures/3bad6187-2021-4d1b-bbf8-87520774ecab",
        "title": "All the lights and action from Vivid Sydney opening night",
        "publish_date": "Sat, 24 May 2025 07:40:49 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "1 of 10 Attribution: Nine\n\nVivid Sydney, the popular festival of lights has illuminated the city's skyline for another year.\n\nWith a range of free activities - and, of course, the spectacular lights - it's expected to draw millions during its run, from May 23 to June ﻿14.\n\nHere's a look at how the festival's opening night illuminated the harbour city.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-rental-reforms-aussie-dad-arafath-mannan-handed-no-grounds-eviction-notice-that-would-be-illegal-today/25a4db1d-8ea4-47b2-843e-62c219d3f308",
        "title": "'What have I done?': Aussie dad handed notice that would be illegal today",
        "publish_date": "Fri, 23 May 2025 21:07:11 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Arafath Mannan was blindsided to receive a notice that would be illegal in NSW today.\n\nThe now 38-year-old moved into a home in Riverwood, in south-west Sydney, in 2017.\n\nHe remained there through several full-time jobs, surgeries, the COVID-19 pandemic, being made redundant, getting married and the birth of his daughter. ﻿\n\nArafath Mannan was blindsided to receive a notice that would be illegal in NSW today. (Supplied)\n\nThe father renewed his lease in August last year and copped a rent hike, which brought the weekly total up from $650 to $720.﻿\n\nMannan struggled to keep up, but his situation deteriorated after he was hit with a no-grounds eviction notice just two months later.\n\nThe no-grounds eviction notice, seen by 9news.com.au, ﻿meant that Mannan was not given a reason why he had to leave, but had 90 days to do so.\n\nMannan said he was blindsided.\n\n\"I just didn't know what to do, literally, because I know how the market is,\" he said.\n\n\"I just was thinking that I was secure, because my rent went up two months ago... the lease period just started.\"\n\nThe surprising housing markets tipped for growth this year View Gallery\n\nMannan was told the owner planned to move in and renovate the home.\n\nBut, in the months after the eviction, he discovered the Riverwood property was back on the market at the same price.\n\n\"They kicked me out, the owner did not move in, and they tried to put the property back in the market, exactly the same price,\" he said.\n\n\"What have I done wrong?﻿ I was actually hurt. It just felt personal. They just kicked me out for no reason whatsoever.\" ﻿\n\nAfter some time on the market, the property's rent was reduced to $700 per week.\n\nMannan luckily found another rental just 150 metres down the road from his former address.\n\nIn the end, he lost about $630 of his bond to repairs and over $300 for moving fees.\n\nNew rental reforms that ended no-grounds evictions came into effect in NSW this week.\n\nNow, agents and landlords are required to ﻿provide a specific reason for eviction, including a tenant breaching their lease, damaging the property or not paying rent, the landlord wanting to sell the property or the property no longer being used as a rental.\n\nAgents and landlords who fail to comply will be dealt with under the Rental Taskforce. ﻿\n\n\"For too long, renters have lived with the fear of being kicked out for no reason. That ends today,\" Housing and Homelessness Minister Rose Jackson said earlier this week.\n\nWhile the changes were welcomed by some, Mannan ﻿said he did not believe they would have much material change because landlords could still decide to increase the rent, effectively evicting tenants who cannot afford the hike, or sell the property.\n\n\"I﻿ know, in the paper and in the books, it looks really nice... but it doesn't secure us. We need more property to be built, it's a simple solution. There's no supply,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/kermit-the-frog-commencement-speech-university-of-maryland/19e73249-8c7a-46d8-bad5-f4a482635c51",
        "title": "Kermit the Frog tells university graduates to 'leap together'",
        "publish_date": "Fri, 23 May 2025 15:35:13 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Kermit the Frog knows it's not easy being green — or graduating from college and entering the real world, especially during a time of economic uncertainty and political turmoil.\n\nMembers of the University of Maryland's class of 2025 received their diplomas on Thursday evening (Friday AEST) with sage advice from the amphibious Muppet ringing in their ears.\n\n\"As you prepare to take this big leap into real life, here's a little advice — if you're willing to listen to a frog,\" the beloved Muppet said.\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md. (Riley Sims/University of Maryland via AP)\n\n\"Rather than jumping over someone to get what you want, consider reaching out your hand and taking the leap side-by-side, because life is better when we leap together.\"\n\nThe university announced in March that Kermit, who was created in 1955 and became the centerpiece of the Muppets franchise, would be this year's commencement speaker.\n\nHe is also no stranger to the school.\n\nMuppets creator Jim Henson graduated from Maryland in 1960. A home economics major, he fashioned the original frog puppet from one of his mother's coats and a Ping-Pong ball cut in half, according to a statement from the university. Henson died in 1990.\n\nA bronze statue of Henson and Kermit sitting on a bench is a well-known feature of the College Park campus.\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md (Stephanie S. Cordle/University of Maryland via AP)\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md. (John T. Consoli/University of Maryland via AP)\n\nIn a video announcing the speaker pick, Kermit is described as an environmental advocate, a bestselling author, an international superstar and a champion of creativity, kindness and believing in the impossible.\n\nHis speaker bio calls him \"a star of stage, screen and swamp\" whose simple mission is to \"sing and dance and make people happy\".\n\n\"I am thrilled that our graduates and their families will experience the optimism and insight of the world-renowned Kermit the Frog at such a meaningful time in their lives,\" university President Darryll J. Pines said in a statement.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/titan-submersible-implosion-sound-captured-on-footage/75bba8ca-ffcc-49a7-9581-da48c7f41f8d",
        "title": "'What was that bang?': Sound of Titan implosion captured in footage",
        "publish_date": "Fri, 23 May 2025 02:12:31 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "T﻿he moment disaster hit the Titan submersible has been captured in footage recorded on the sub's mother ship.\n\nDuring an expedition to the Titanic shipwreck that lies 3800 metres below the Atlantic Ocean, the OceanGate Titan imploded on June 18, 2023.\n\nThe five passengers aboard, who included OceanGate's chief executive Stockton Rush, were all confirmed dead following the discovery of the wreckage.\n\nDebris from the Titan submersible, recovered in 2023 from the ocean floor near the wreck of the Titanic. (AP)\n\nA new BBC documentary into the disaster gained access to material from the US Coast Guard's (USCG) investigation.\n\nFootage obtained by the USCG shows Wendy Rush, the wife of Rush, listening to the sound of the implosion while watching on from the sub's support vessel and asking: \"What was that bang?\"\n\nShe is shown sitting in front of a computer that was sending and receiving text messages from Titan about 90 minutes in from when it started its dive.\n\nA noise sounding like a door slamming is heard when the submersible reaches a depth of 3300 metres, prompting her to look up and ask other OceanGate crew what the noise was.\n\nMoments later, Wendy Rush receives a text message from the sub saying it had dropped two weights, which apparently caused her to mistakenly believe the dive was proceeding safely.\n\nBut the USCG says the noise was in fact the sound of Titan imploding.\n\nOfficials say the text message, which must have been sent just before the sub hit disaster, took longer to reach the ship than the sound of the implosion.\n\nThe five aboard were, from left, pilot Stockton Rush, the CEO of OceanGate; French explorer and Titanic expert Paul-Henry Nargeolet﻿; British adventurer and billionaire Hamish Harding; and Pakistani businessman Shahzada Dawood and his son Suleman. (9News)\n\nStockton Rush and the four other people aboard - businessman Shahzada Dawood and his 19-year-old son, Suleman Dawood; businessman Hamish Harding; and French diver Paul-Henri Nargeolet - died instantly.\n\nEarlier this year at the USCG hearings into the disaster, a damning portrait of the Washington-based company that developed and operated the submersible as well as its founder – who charged passengers about $US250,000 (nearly $400,000) per dive - emerged from testimonies.\n\nAfter the submersible lost contact with its mother ship and failed to resurface, a dramatic international search and rescue mission unfolded in the remote waters several hundred kilometres south-east of Newfoundland.\n\nAuthorities concluded the vessel had suffered a \"catastrophic implosion,\" a sudden inward collapse caused by immense pressure.\n\nThe USGC investigation has centred on the design of the Titan, built from carbon fibre, an unusual material for deep sea submersible crafts.\n\nRemains of the Titan submersible on the floor of the Atlantic Ocean. (US Coast Guard Video via Pelagic Research Services)\n\nA known problem is that carbon fibre layers can separate under pressure, a process called delamination.\n\nUSGC investigators believe the Titan's structure showed signs of weakening in 2022 after the craft completed its 80th expedition.\n\nPassengers reported hearing a loud bang as the sub returned to the surface.\n\nThey were told by Stockton Rush that this noise was the sub shifting in its frame.\n\nBut the USCG says the data collected from sensors fitted to Titan shows that the bang was caused by delamination.\n\nThe US Coast Guard will publish a final report bout its investigation later this year.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .\n\n﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coles-woolworths-debate-how-many-products-should-be-included-in-fake-discount-trial/dc065e30-49e1-42f5-8a24-c8965bf97bb2",
        "title": "Coles, Woolworths debate how many products should be included in fake discount trial",
        "publish_date": "Fri, 23 May 2025 06:32:38 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The nation's supermarket giants will barter with the competition watchdog on the number of items to be interrogated in court over allegations they misled customers with fake discounts.\n\nThe Australian Competition and Consumer Commission (ACCC) has launched court actions against Coles and Woolworths, alleging they broke consumer law by bumping up prices on certain products for brief periods before lowering them again as part of Woolworths' \"Prices Dropped\" and Coles' \"Down Down\" promotions.\n\nThose promotional prices - including dairy, pet food, personal care, coffee, medicine, lollies, cereal and household cleaning products - were lower than during the price bump, but higher than or the same as the regular price, it alleges.\n\nThe nation's supermarket giants will barter with the competition watchdog on the number of items to be interrogated in court. (Getty)\n\nA Federal Court hearing in Melbourne today heard disagreements over the number of sample products from both supermarkets that would be included as evidence in the trial.\n\nColes had agreed with 12 products - six chosen by the ACCC, three class products and three of their choosing, barrister Nicholas De Young told the court.\n\n\"We submitted and believe that was a reasonable proposal, but a minute before court, we heard they want to add an additional four,\" he said.\n\nDe Young said the additional products could mean three or four more witnesses who will need to talk in detail about the price increase and promotional discussion journeys those items had.\n\nHe questioned what attributes the four items have that the existing 12 don't.\n\nWoolworths had proposed six products, but barrister Ruth Higgins told the court the ACCC had submitted 20 yesterday morning before reducing the number to 12 by that night.\n\nREAD MORE: ﻿ Woman fined for riding motorbike with dog harnessed to her chest\n\n\"What we've been doing this morning is trying to work out why those additional products are proposed and what difference those products make,\" Higgins said.\n\nBarrister Michael Hodge said the ACCC had proposed a compromised position of 12 products for both companies, which would ensure everything could be captured.\n\nJustice Michael O'Bryan urged the parties to compromise, giving them until June 13 to finalise a list of agreed items.\n\n\"If we're south of 20, or even better, south of 15, then we're in what I regard as sensible territory for conducting an efficient trial,\" he said.\n\nThe consumer watchdog is seeking a significant penalty for the alleged breaches, which they say took place over 15 months.\n\nColes and Woolworths, which control a combined two-thirds market share, deny the allegations and say the legal cases are misconceived.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/voluntary-assisted-dying-options-limited-if-you-have-dementia/105287128",
        "title": "John is considering a one-way ticket to Switzerland to avoid dementia",
        "publish_date": "Sun, 25 May 2025 00:56:05 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "John Griffiths suspects his mind is starting to fail.\n\nIt is a horrifying prospect for the father-of-three, former Monash University engineering lecturer and CSIRO research scientist.\n\nThe Melbourne man spends much of his time with his wife Rachel, who lives in residential aged care, reading her poems and short stories.\n\n\"I've got nothing but praise for [her] carers. I think they're fantastic, professional and excellent,\" he said.\n\n\" But, nevertheless, there's this total loss of autonomy. \"\n\nMr Griffiths reads to his wife Rachel, who loves poetry. (ABC Melbourne: Danielle Bonica)\n\nWhile doctors say he is all clear at the moment, he will be assessed for dementia in the next year. If he does develop the condition, he would rather die than let it take hold.\n\nBut his options are limited.\n\nAlthough voluntary assisted dying (VAD) will be legal in every Australian jurisdiction except the Northern Territory by the end of this year, it remains entirely off-limits for people with dementia.\n\nInstead, Mr Griffiths is considering a one-way ticket to Switzerland.\n\nThe clock, however, is ticking.\n\nWhile the European nation is famous for the broad access it permits to end-of-life services, a person must still have \"mental capacity\".\n\nMr Griffiths says he would never contemplate VAD while his wife Rachel is still alive. (ABC Melbourne: Danielle Bonica)\n\nMr Griffiths worries if he goes too early, he will needlessly shave years off his life, but if he leaves it too late, he may become ineligible.\n\n\"This is now a terribly difficult thing I have to do, if I want to access (VAD),\" he said.\n\n\"I have to do it while I'm cognitively aware.\n\n\" I don't want to leave it too late. But I don't want to make it too early either. \"\n\nHe suspects other Australians will soon find themselves at a similar crossroads.\n\nJohn and Rachel Griffiths' daughter Deryn hugs her mum. (ABC Melbourne: Danielle Bonica)\n\nThe right to die abroad\n\nUnlike most countries, Switzerland allows people to voluntarily end their lives, even if they are not sick nor a citizen.\n\nA report published by Australian charity Go Gentle this year cited data from one right-to-die association, claiming 38 Australians travelled to Switzerland to die between 1998 and 2021.\n\nSwitzerland's right-to-die organisations charge a fee of between $20,000 and $30,000, excluding travel and accommodation, to procure the medication and handle the aftermath of the death, including cremation or transport of the body.\n\nNeuropsychologist Kylie Ladd, who has worked with dementia patients for 30 years and authored the Go Gentle report, said a person had to pass a series of interviews and be deemed to \"have capacity\" before they could proceed.\n\n\"It is theoretically possible that people in Australia with early dementia who still retain capacity could go to Switzerland to end their lives,\" Dr Ladd said.\n\nMr Griffiths spends much of his time visiting Rachel. (ABC Melbourne: Danielle Bonica)\n\nNow that VAD is legal across much of the country, statistics on how many Australians are still going to Switzerland are hard to come by.\n\nPhilip Nitschke, who has been the subject of long-running controversy, founded Exit International to advocate for end-of-life services around the world.\n\nHe estimated about one to two Australians are continuing to travel abroad to end their lives each month.\n\nBut even he, a vocal supporter of VAD, said dementia posed a particularly difficult problem.\n\nMr Griffiths will be assessed for dementia in the next year. (ABC Melbourne: Danielle Bonica)\n\nAn advance request\n\nDementia now ranks among the leading causes of death across many developed nations.\n\nWith rates only set to increase, health departments all over the world are grappling with the question of VAD for those with the disorder.\n\nBut relevant Australian peak bodies, including Dementia Australia, Council on the Ageing and Palliative Care Australia, said they were neutral on the subject.\n\nThe Netherlands, Luxembourg and Belgium allow VAD for dementia patients through an Advance Care Directive, a legal document setting out a person's healthcare wishes for when they can no longer make them.\n\nBut uptake has been low.\n\nAuthorities are grappling with the question of VAD for people with dementia. (ABC Melbourne: Danielle Bonica)\n\nDementia patients constituted only 3.7 per cent of all VAD deaths in the Netherlands in 2023.\n\nIn Belgium only 0.95 per cent of VAD deaths were people with cognitive disorders, including many forms of dementia, between 2018 and 2021.\n\nIn both cases, most patients had only early-stage dementia.\n\nLoved ones back out\n\nDr Ladd said many doctors and loved ones baulked at the idea of ending the life of a person \"who doesn't know what's going on\".\n\nShe cited a Dutch study that found three in four relatives of nursing home residents with advanced dementia asked physicians not to act on their loved ones' request for VAD through Advance Care Directives.\n\nAnother study found support for the idea dropped dramatically once survey participants were given specific scenarios and asked whether VAD should be administered.\n\n\"Public acceptance … has been shown to decrease significantly when the situation moves from being a theoretical question to a lived reality,\" she wrote.\n\nMr Griffiths fears the loss of autonomy that comes with dementia. (ABC Melbourne: Danielle Bonica)\n\nThere are also legal issues.\n\nIn the Netherlands in 2016, a criminal investigation was launched into a physician who complied with an elderly dementia patient's Advance Care Directive, after it emerged the patient pulled away when given the fatal dose.\n\nPhilosophical questions\n\nAlong with practical hurdles, Dr Ladd said Dutch ethicists were grappling with philosophical questions.\n\nThey ask whether a person who draws up an Advance Care Directive is still the same person once dementia takes hold, and whether it is possible for a competent person to foresee what life with dementia would be like.\n\nIf the answer to either question is \"no\", it may invalidate the document.\n\nThe family, and dog Millie, meet outside Rachel's aged care home. (ABC Melbourne: Danielle Bonica)\n\n\"They're not just medical issues. They're not just legal issues,\" Dr Ladd said.\n\n\" They're really knotty ethical issues as well. \"\n\nA technical solution\n\nDr Nitschke believed while the Dutch should be commended for grappling with VAD for dementia patients, problems would always arise in \"outsourcing death\".\n\nHe believed technology would provide a better option.\n\nMr Griffiths sits with Rachel (left) and their daughter Deryn. (ABC Melbourne: Danielle Bonica)\n\n\"Instead of outsourcing your death to someone else, like the medical profession, you're taking responsibility for your own death,\" Dr Nitschke said.\n\nHis approach has been disputed in the past.\n\nLast year, his organisation opened The Last Resort, designed to let people die for free using specially designed pods.\n\nBut after one was used successfully, several staff were detained on suspicion of aiding and abetting suicide. They were eventually released.\n\nMr Griffiths is a former university lecturer. (ABC Melbourne: Danielle Bonica)\n\nDr Nitschke argued it was important to give people options, and noted a key benefit of the Dutch system was the peace of mind it offered, particularly after a dementia diagnosis.\n\n\"That's by far the biggest benefit we're seeing in the Netherlands,\" he said.\n\n\" It does give people comfort to know that they've signed a piece of paper, even though there might be a thin chance that anyone will act on it. \"\n\n'A great comfort'\n\nIt would certainly be a comfort to Mr Griffiths.\n\nThe Melbourne man said he did not know how Australian VAD laws should be written, or what he would do when \"push comes to shove\".\n\nBut he said he would not make any decision about his own death until his wife had passed away.\n\n\"I think it'd be a bit selfish to go before she does,\" he said.\n\nMr Griffiths adores his wife, Rachel. (ABC Melbourne: Danielle Bonica)\n\nWhen the end is approaching, he said it would be a relief to know he could die on his own terms with dementia in Australia.\n\n\"Very much so,\" he said.\n\n\"Everyone says once you get the OK it gives you a lot of peace.\n\n\"Whether or not you access it or not is not such a big drama.\n\n\" I think it would be a great comfort. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/sundoo-chinese-restaurant-in-townsville-gutted-by-fire/105327982",
        "title": "Fears for the future of retro Chinese dining after blaze guts eatery",
        "publish_date": "Sun, 25 May 2025 00:17:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "The gutting by fire of a much-loved Chinese restaurant in North Queensland after 50 years has left a family heartbroken.\n\nThe Sundoo Chinese Restaurant in Townsville was badly damaged by a fire that began in the back of the building on Monday.\n\nLargely untouched for decades, its distinctive decor made it a time capsule of Cantonese restaurant chic from 1970s Australia.\n\nThe devastation at the Sundoo comes amid a growing appreciation of — and nostalgia for — older-style Chinese restaurants, as their numbers dwindle.\n\nThe Sundoo Chinese restaurant has been in Hermit Park for about 50 years. (Supplied)\n\n'Heartbroken and devastated'\n\nJason Liang said his parents Paul and Jenny had run the business seven days a week for about 27 years.\n\nHe said they were devastated that much of what they had worked for had been destroyed by the fire.\n\n\"[The Sundoo] was pretty much my second home — after school I'd come here and do my homework, I worked here through my teenage years,\" Mr Liang said.\n\nThe Sundoo's distinctive ceiling tiles contained Chinese symbols for longevity. (Supplied)\n\n\"We watched a lot of regular customers grow up; we watched people come in with their parents, then all of a sudden they bring their girlfriend and now they have kids.\n\n'We've just watched them for 27 years, so there was a strong sense of community.\n\n\"At the moment we're heartbroken and devastated.\"\n\nThe Liang family and friends at the Sundoo in the late 90s. (Supplied: Jenny Liang)\n\nLove for the 'retro' Chinese restaurant\n\nMr Liang said there was a surge in customers at the Sundoo after it was featured on the Retro Chinese Restaurants Facebook page, celebrating the interior design and food of mid-century Chinese restaurants.\n\nThe group's founder Kelly Parsons said she was saddened to hear of the fire at the Sundoo, which she described as one of the best of its type in Australia.\n\nThe Sundoo restaurant was rich with style from the 1970s. (Supplied)\n\nMs Parsons said the group's 20,000 members shared her fascination and grew up visiting restaurants just like the Sundoo.\n\n\"It just feels so comfy and familiar to me,\" she said.\n\n\"I'm eternally fascinated by the … kitsch — the plastic flowers, wallpaper, fancy ceilings, wood panelling and, of course, the food.\"\n\nThe salvaged red dragon at the burnt-out Sundoo restaurant. (ABC News: Georgia Loney)\n\nNostalgia for classic Aussie Chinese\n\nChinese restaurants have also played a key social and economic role in regional communities across Australia, dating back to at least the 1890s.\n\nWriter and broadcaster Jennifer Wong has written about regional Australian-Chinese restaurants in Chopsticks or Fork, based on the ABC iview series.\n\nJennifer Wong says many people's first experience dining out was at a Chinese restaurant. (ABC: Chopsticks or Fork)\n\nShe said they signified the contribution of Chinese immigration to regional communities, which stepped up in the 1970s.\n\n\"Back then there were probably only about 50,000 people of Chinese heritage in the country, and there would have been around 13 or 14 million Australian people, so a very tiny per cent of the population,\" Wong said.\n\n\" And yet, if you talk to anyone who grew up in the 70s their first memory of going out to eat would most likely have been at a Chinese restaurant. \"\n\nShe said many would have happy memories of meals in those dining rooms, even as tastes had started to change.\n\nA Sundoo postcard shows the decor in the 1980s. (Supplied: the Liang family)\n\n\"[We are moving] further and further away from a time when these were some of the only restaurants in town,\" Wong said.\n\n\"There's a nostalgia and a fondness for those first early food memories.\"\n\nBuilding block for next generation\n\nWriter and presenter Benjamin Law, who grew up in his parents' food businesses in regional Queensland, said Chinese restaurants laid the foundation for many members of the Chinese diaspora in Australia.\n\nWriter Benjamin Law's family had Chinese restaurants on the Sunshine Coast. (Supplied)\n\n\"When I was growing up on the Sunshine Coast in the 80s and 90s, there were so few Chinese people, besides my family, and most of us that were there were growing up in and amongst Chinese restaurants,\" he said.\n\n\" The Chinese restaurant is a foundational tool so a family can build itself up. \"\n\nLaw said people were always nostalgic for Australia's past, and that included the local Chinese restaurant.\n\n\"They might be ostensibly Chinese restaurants, but they're very Australian restaurants too, when you think about it,\" he said.\n\nMuch of the decor at the Sundoo dated back to at least the 70s. (ABC News: Georgia Loney)\n\nSundoo's future uncertain\n\nJason Liang said the Sundoo's future was still unclear, as his parents owned the business but not the building.\n\nHe said the restaurant's closure — for now at least — was the end of an era, and its success over the decades was a testament to his parents' hard work.\n\nThe fire broke out at the back of the Sundoo. (ABC News: Georgia Loney)\n\n\"They've told me over and over again that it's really hard work [and] we're doing this so you can have a better education,\" Mr Liang said.\n\n\"Most of the kids don't take over the business anymore — they actually do another trade or profession or make their own business. he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/puppy-farming-laws-mean-you-cant-buy-a-dog-at-pet-shop/105320956",
        "title": "You can't buy a puppy at a pet store in WA anymore, and this is why",
        "publish_date": "Sun, 25 May 2025 00:01:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "The era of buying a dog from a pet shop may be over in WA, thanks to new anti-puppy farming laws that come into effect on Monday.\n\nPet shops that want to keep selling dogs can only do so if they get them from a rescue centre, having got a permit from their local government.\n\nBut no pet shop in WA has applied.\n\nThere are only three stores that sell puppies in the state, and it's understood at least two have announced store closures.\n\nBreeding for greed\n\nAnimal welfare groups have welcomed the reforms, saying more buyers are already deciding to adopt a rescue pet instead of shopping elsewhere.\n\nDogs' Refuge Home general manager Robyn Slater said all 70-plus puppies the centre currently has in its care have come from unethical breeding environments.\n\nShenton Park Dog Refuge general manager Robyn Slater with one of the centre's 70-plus pups. (ABC News: Jessica Rendall)\n\n\"There's not a puppy here that hasn't come from either someone who's breeding for greed and couldn't sell a whole litter, or someone who is misinformed and has an accidental litter,\" she said.\n\n\"You can't just easily stick a litter of puppies on Gumtree now and get people coming in and giving you cash.\n\nShenton Park Dog Refuge general manager Robyn Slater checks in on the adult dogs at the centre. (ABC News: Jessica Rendall)\n\n\"They will sell a couple, and the leftovers will go to the pounds, pregnant dogs will go to the pounds and when they've stopped finding purpose or use or financial gain, they end up in shelters like ours.\"\n\nCruelty charges\n\nIt comes amid a number of reports of animal cruelty to RSPCA WA, with a 40-year-old man recently charged after more than 100 dogs were seized from his Canning Vale property in December.\n\nRSPCA WA inspectors allege some of the dogs required urgent medical attention, with most showing signs of distress and poor hygiene.\n\nOne golden retriever puppy appeared to have a bulging eye.\n\nThe man is due to front court on more than 30 counts of animal cruelty next month.\n\nIn another incident, a 60-year-old man who had been running a puppy farming operation from his Bridgetown property was fined $112,000 for gross animal neglect.\n\nThe puppies were kept in terrible conditions at the Bridgetown property. (Supplied: RSPCA)\n\nThe RSPCA's animal services executive Hannah Dreaver said these were not isolated cases.\n\n\"We've certainly had a few large-scale cases, which is concerning to see the volume that's coming through to us, particularly when there is so much education around the issues with puppy farming,\" she said.\n\nHannah Dreaver says the RSPCA relies on the public to help uncover puppy farms. (ABC News: Phoebe Pin)\n\n\"When animals are continually being bred, it's really hard to stop the continued welfare problems that come from large-scale populations.\n\n\"It's really hard to track those animals properly, especially in the backyard breeding space.\"\n\nOnus on pet owners\n\nMs Dreaver said the RSPCA WA relied solely on the public to alert the agency to suspected puppy farms, with common signs including noise from the property, unpleasant odours, and frequent visits to the property from people potentially buying animals.\n\nShe said the restrictions on pet shops were welcome, but said prospective pet owners also must take responsibility for supporting ethical breeding.\n\nThe RSPCA has called on dog owners to act responsibly when it comes to breeding and sterilisation. (ABC News: Jessica Rendall)\n\n\"It means that we can increase the responsibility on the person buying a puppy to make sure that they've really thought about what they're doing before they just go and buy a puppy on a whim, because they've walked past a pet shop front and they've seen a cute puppy that they like,\" she said.\n\nDog and cat registration\n\nA number of provisions under the new laws are yet to roll out, including requirements for dogs to be de-sexed by the age of two years (unless eligible for an exemption), and the launch of a centralised dog and cat registration system.\n\nPeople will also need to apply for approval before breeding their dog.\n\nA Department of Local Government, Sport and Cultural Industries spokesperson said the state government was working to deliver the reforms in a \"staged and planned way\".\n\nThe WA government says its animal welfare reorms are being rolled out gradually. (ABC News: Jessica Rendall)\n\nThe spokesperson said a $100,000 grant was available to help pet shops transition to receiving and selling rescue dogs.\n\nThe spokesperson said funding had also been made available to support responsible pet ownership.\n\n\"Last year, to support animal welfare, the WA Government delivered $500,000 to RSPCA WA to offer a 75 per cent subsidy on sterilisation costs for cats and dogs to WA Seniors Card, Pensioner Concession Card and Health Care Card holders.\n\n\"As of December 2024, more than 1600 eligible pet owners on low incomes had applied to take up the offer, provided through eligible vet clinics in regional and metro areas across the state.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/high-whooping-cough-rates-in-kimberley/105317664",
        "title": "Whooping cough rates soar in WA's north amid low 'on-time' vaccinations",
        "publish_date": "Sat, 24 May 2025 23:58:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Kimberley residents are being urged to vaccinate their children for whooping cough on time, with cases of the potentially deadly disease in the region on track to exceed last year's spike in numbers.\n\nPertussis, the bacterial respiratory disease colloquially known as whooping cough, is highly infectious and can be fatal in young children and newborns.\n\nThe bacteria can spread via airborne droplets when an infectious person coughs or sneezes, potentially putting those around them at risk.\n\nThere were no reported cases of whooping cough in the Kimberley from 2021 to 2023, but 105 cases were recorded last year.\n\nSo far this year, the region has 63 diagnosed cases, the second-highest figure for the state after Perth.\n\nInfection comes in waves\n\nWA Country Health Service physician Pippa May said it was difficult to look at case numbers in isolation post-COVID-19, but the figures were concerning.\n\nPippa May says whooping cough cases come in waves. (ABC Kimberley: Erin Parke)\n\n\"It's something we've been concerned about for a while because we did predict whooping cough would make a resurgence around 2024-2025,\" Dr May said.\n\n\"Whooping cough is known to come in waves … as our immunity from both natural infection and vaccination drops.\"\n\nThe respiratory disease can cause hospitalisation in children and, in extreme cases, death.\n\nWhooping cough vaccines are free under the National Immunisation Program for:\n\nchildren aged two months, four months, six months, 18 months and four years\n\nadolescents aged 12 to 13 years, through school-based vaccination programs\n\npregnant women, ideally between 20 to 32 weeks of each pregnancy.\n\nAbout 80 per cent of whooping cough deaths occur in infants less than three months of age, so herd immunity vaccination plays an important role, according to Dr May.\n\n\"It's easily spread from one person to another and through families, childcare centres and schools,\" she said.\n\n\"And also really importantly, pregnant people are recommended to be vaccinated against whooping cough, every pregnancy, and that is to protect their baby.\"\n\nKimberley particularly vulnerable\n\nDr May said there was not \"one single reason\" why the Kimberley had a higher burden of the disease.\n\nThe region far exceeds cases compared to the rest of Western Australia, when weighted by population.\n\nThis is likely due to increased testing post-COVID, the younger community and the Kimberley's population make-up, according to Dr May.\n\n\"Aboriginal and Torres Strait Islander people, unfortunately, do experience a higher burden of vaccine-preventable diseases compared to their non-Indigenous counterparts,\" she said.\n\n\" We work with the community clinics on the ground, including Aboriginal medical services, to work with families to get their babies immunised when immunisations are actually due. \"\n\nIt's not just about getting vaccinated, but getting vaccinated on time — and that's an area where the Kimberley appears to be falling short.\n\nCountry WA has the second-lowest vaccination rates among two-year-olds in the country, according to the Australian Immunisation register.\n\n'Alarmingly' high cases\n\nCurtin University public health researcher Jaya Dantas said free vaccinations across the board could be a first step. She is calling on the Department of Health to take action.\n\nJaya Dantas says vaccination is the best way for people to safeguard themselves against whooping cough. (Supplied: Curtin University)\n\n\"Free vaccination must be there … if there's money involved, people hesitate, especially those who can't afford it,\" Dr Dantas said.\n\nShe said it was alarming whooping cough case numbers were already high, despite the critical winter months not having begun.\n\nShe believes misinformation about vaccinations was part of the issue and hard to ignore.\n\n\"We have so much information there that tells us vaccines prevent diseases,\" she said.\n\n\"But at the same time, there's a lot of misinformation out there, and when there's misinformation, people get confused.\"\n\nThe Department of Health was contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/bigambul-elders-caring-for-country-plan-guiding-environment-care/105327286",
        "title": "Elders show how traditions can lead to environmental restoration",
        "publish_date": "Sat, 24 May 2025 23:22:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Whether slapping mud pies on the banks of border rivers in south-west Queensland, or flattening out land with a toy steamroller made from a tin filled with dirt, Bigambul woman Leah Mann thought her childhood was all fun and games.\n\nNow an elder of her people, she realises those cherished moments were partaking in the ancient Aboriginal tradition of caring for country.\n\n\"We had an old tobacco tin, our nana would put seeds in it, we would throw them down by the creek and that would grow food,\" Aunty Leah said.\n\nIt is this multi-generational knowledge of the environment that the Bigambul Native Title Aboriginal Corporation, based in Goondiwindi, realised needed to be documented and shared in their new Caring for Country Plan.\n\nThe Bigambul elders have documented their knowledge for the next generation and beyond. (ABC Southern Qld: Peter Sanders)\n\nThe traditional owners said the plan, released on Thursday, would guide the development of infrastructure projects across the region and lead to the ongoing protection, rehabilitation and restoration of country.\n\nAunty Leah said they were also embracing new environmental protection methods to plan for the future.\n\n\"We have a greenhouse, and we propagate all the seeds we have taken from our country. Those will be planted back where they used to grow,\" she said.\n\nStrategies for cleaning the Macintyre River are part of the Caring for Country Plan. (ABC Southern Qld: Peter Sanders)\n\n\"The waterways will look better because we'll add little things like mussels and some certain fish that will clean the waterways.\"\n\nPlan in action\n\nSome strategies in the Caring for Country Plan have already seen success in the Goondiwindi area, including the use of fire to control invasive weeds.\n\nBigambul rangers conduct burnings to help control invasive species. (ABC News: Madison Snow)\n\nFirst Nations firefighter sector commander Jason Scott said they conducted cultural and mitigation burns to help control Harrisia cactus and the mother of millions succulent.\n\n\"We conduct cool burns to boil the cactus, to get it back down to its root system,\" Mr Scott said.\n\n\"Kangaroos will then eat that root system or farmers will put cows over the top.\n\n\"With the mother of millions it's a toxic burn, so we have to be very careful and well-regulated with our breathing.\"\n\nMr Scott said the Bigambul rangers carefully ensured no culturally significant sites were impacted.\n\nJason Scott says fire is crucial for Australia's native trees. (ABC Southern Qld: Peter Sanders)\n\n\"The rangers do a replanting program on country to bring back some of the native trees that have been decimated due to over-logging and removal,\" he said.\n\n\"We've got a lot of native trees coming back because in Australia our trees require fire to be able to propagate.\"\n\nOpen for business\n\nThe Caring for Country Plan took three years to develop and included input from the local community, industry and various government departments and representatives.\n\nProject director Jeremy Hall said they spent nine months building partnerships and collaborating with interested parties across the wider Goondiwindi area.\n\nJeremy Hall says the plan will help developers mitigate damage from new infrastructure projects. (ABC Southern Qld: Peter Sanders)\n\n\"We use this as a very powerful tool when speaking to proponents coming on country, whether it's renewables or major infrastructure,\" Mr Hall said.\n\n\"The first port of call is no harm. But if you're going to cause harm, take a balanced approach on how you will mitigate and not just offset it, but mitigate and care.\"\n\nThe Caring for Country Plan will guide developers on limiting environmental damage on Bigambul country. (ABC News: Stuart Stansfield)\n\nMr Hall said their objective was to foster support and understanding, connecting community and mob to country.\n\n\"Bigambul is open for business … it's part of the nation-building initiatives,\" Mr Hall said.\n\n\" Caring for county has been going on for thousands of years and we hope to do it for thousands more. \"\n\nCultural obligation\n\nThe Bigambul people, whose lands cover about 17,000 square kilometre of south-west Queensland, believe that a healthy country creates healthy people.\n\nElder Regina Munn said it was their cultural obligation to keep the knowledge of the land and water intact for future generations.\n\nBigambul elder Regina Munn says the health of the land affects all who live on it. (ABC Southern Qld: Peter Sanders)\n\n\"When [the land] is dry, arid and scorched it's almost depressing,\" Aunty Regina said.\n\n\"When the rain comes the earth is quenched, the rivers rise, the fish and birds are out. All of that combines to create a happy community.\n\n\"It's not just about Bigambul land, it's about the land in general, and it's all the land in general that we have native title determination over.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/professor-creswell-eastman-dies-age-85/105318606",
        "title": "Tributes flow for the Australian who saved millions of brains",
        "publish_date": "Sat, 24 May 2025 23:01:20 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "He was dubbed \"the man who saved a million brains\" after discovering the critical link between iodine deficiency and cognitive function.\n\nWorld-renowned endocrinologist, Creswell 'Cres' Eastman died peacefully at home last Saturday. He was 85.\n\nProfessor Eastman's life work was the prevention of iodine deficiency, especially in pregnant women, which leads to intellectual and physical disabilities in children.\n\nIt followed his discovery that the trace element in minuscule but daily doses was crucial to healthy brain function.\n\n\"You could put the whole amount of iodine you need for a lifetime into a teaspoon,\" Professor Eastman told Richard Fidler on Conversations in 2015, \"so long as you don't take it all at once\".\n\n\"It's absolutely essential for a normal life.\"\n\nProfessor Creswell Eastman grew up in Lismore. (ABC RN)\n\nFriend and colleague Graeme Stuart said the significance of Professor Eastman's work improving the lives of millions of people could not be overstated.\n\n\"How many people in medicine and medical science could claim to have such an extraordinary impact? He would be there with a very small number, both in Australia and globally,\" Professor Stuart said.\n\n\"He was one of the most compassionate physicians that I've ever known, and an outstanding clinician in his ability to look after the whole patient.\"\n\nProfessor Stuart and other colleagues remembered the oft-quoted mantra he lived by: \"The most basic human right you've got is the chance to fulfil your genetic potential\".\n\nProfessor Eastman spent his career ensuring that potential was realised in people across Australia and Asia.\n\nGround-breaking work\n\nDuring a visit to Sarawak in Malaysia in the early 1980s to study people with goitres, a swelling of the thyroid gland, Professor Eastman discovered a widespread deficiency of iodine in the diet.\n\nWhile helping to fix the plumbing at one village, he facilitated the addition of iodine to the water supply. Twelve months later, goitres had all but disappeared in the village's young children.\n\nThis led the Malaysian government to legalise the importation of only iodised salt to Sarawak.\n\nProfessor Eastman's work identified the effects of iodine deficiencies. (Supplied: The Royal Australasian College of Physicians)\n\nIn China in the 1980s, Professor Eastman found one quarter of the population of more than a billion people had goitres, and of those, he estimated tens of millions had some form of brain damage.\n\n\"I went through some form of epiphany here, I thought, 'what's the point of just doing research here? We've got to translate that research into public health',\" he said on Conversations.\n\nProfessor Eastman examining Tibetan schoolchildren for goitre in Tibet in May 2000. (Supplied: Creswell Eastman)\n\n\"We've got to change the world.\n\n\"We've got to change what's happening in China. So I then started on a totally different mission.\"\n\nProfessor Eastman lobbied the Chinese government, resulting in a national law that salt for human consumption in China must be iodised.\n\nThe incidence of iodine deficiency dramatically reduced.\n\nProfessor Eastman examining Tibetan women for eye disorders in Tibet in 2000. (Supplied: Creswell Eastman)\n\nGetting salt iodised in Tibet proved a bigger challenge than in China; communities there traded crude salt, making it difficult to introduce an iodised product.\n\nInstead, Professor Eastman worked on giving pregnant women an iodised oil capsule that reached 95 per cent of the population, resulting in no new cases of children with health defects.\n\nThis work in China and Tibet led him to be dubbed \"the man who saved a million brains\".\n\nProfessor Eastman at work in Tibet. (Supplied: Creswell Eastman)\n\nIodine deficiency in Australia\n\nThe professor's research also benefited Australians.\n\nProfessor Eastman identified that dietary iodine in Australians was high in the 1950s and 60s through seafood and milk consumption.\n\nHe said milk was an unexpected source of iodine, \"an accidental health triumph\".\n\nThe dairy industry used iodine as a sanitiser to clean equipment, and people received trace elements of iodine in milk.\n\nWhen the industry switched to chlorine in the 1990s, health experts noticed an increase in goitres.\n\n\"We were shocked to find the iodine levels in people we had been monitoring for 20 years had dropped dramatically,\" Professor Eastman said.\n\n\" The World Health Organization started painting Australia on the map with iodine deficiency as a Third World country. \"\n\nThe National Iodine Nutrition Survey, Professor Eastman helped conduct from 2003 to 2005, confirmed iodine deficiency had re-emerged in Australia.\n\nThis study led to the mandatory inclusion of iodised salt in most bread made from 2009.\n\nProfessor Eastman conducting a thyroid examination for goitre in a nursing mother on the island of Tanna in Vanuatu in 2006. (Supplied: Creswell Eastman)\n\nHowever, with the rising popularity of gourmet salts, Professor Eastman remained concerned that pregnant women in Australia were not eating enough iodised salt.\n\nHis daughter Kate Eastman said her father was renowned for pulling the iodised salt to the front of supermarket shelves and hiding the non-iodised product.\n\n\"I was pregnant with my daughter, who is now 20. At that time, pink salt was very fashionable. I did not hear the end of it,\" Ms Eastman said.\n\n\"He accused me and my sister of our love of pink rock salt and fancy gourmet salts as being 'an aberration' … and his grandchildren were not suffering from any iodine deficiency.\n\n\"My father's message, if you had his words ringing in your ears, it's use iodised salt. So if you're in the supermarket … always get the iodised salt.\"\n\nA fondness for Lismore\n\nCreswell Eastman was born in Narrandera on March 30, 1940, to Albert and Margaret Eastman.\n\nJust after World War II, the family moved to Evans Head, where they lived in a tent, before moving to Lismore.\n\nSuch was the housing shortage, the family lived in a fully furnished tent until a house became available.\n\nAlways a bright student, a young Creswell won two scholarships from the New South Wales government and the board of education to further his studies.\n\nLegacy also helped pay for his education after his grandfather died when he was 11.\n\nHe married Annette Delaney, also from Lismore, and the couple had four children; Kate, Damien, Pip, and Nick.\n\nProfessor Eastman with wife Annette and children Nick, Pip, and Damien receiving his Officer of the Order of Australia. (Supplied: Eastman family)\n\nKate Eastman said her dad was dedicated to his wife and Lismore was close to their hearts.\n\n\"He spent his childhood in Lismore, going to school and to church in Lismore,\" Ms Eastman said.\n\nAfter leaving the area, the family would regularly return to the region to holiday with Professor Eastman's sister, Margaret Rix and her husband Len, at their Ballina home.\n\nProfessor Eastman with children from Balgo settlement in Western Australia who were examined by thyroid ultrasound for a National Iodine Study in 2004. (Supplied: Creswell Eastman)\n\nTributes\n\nProfessor Eastman worked at the Garvan Institute of Medical Research, was a clinical professor of medicine at Sydney University Medical School, principal of the Sydney Thyroid Clinic, and consultant emeritus to the Westmead Hospital.\n\nHe received multiple awards, here and overseas and was made an Officer of the Order of Australia in 2018.\n\nAs family and friends farewell Professor Creswell Eastman, his daughter said the family was proud of their father's legacy, which he continued working on to the end.\n\n\"When he passed away, on his bedside table was an article on neo-natal health and iodine, and his little green marker was there — working till the end,\" she said.\n\n\"His life was devoted to the service of the health of others.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/asian-championship-league-final-melbournecity-wuhan-jiangda/105333694",
        "title": "Melbourne City 'gutted' after losing Asian Champions League decider",
        "publish_date": "Sat, 24 May 2025 22:53:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Melbourne City has recorded a drama-filled defeat to Wuhan Jiangda on penalties to fall short in the inaugural Women's Asian Champions League final.\n\nArsenal wins Champions League final Photo shows Steph Catley, Caitlin Foord and Kyra Cooney-Cross of Arsenal celebrate with the UEFA Women's Champions League trophy. Arsenal's Matildas trio — Caitlin Foord, Steph Catley and Kyra Cooney-Cross — are celebrating after the English giants toppled Barcelona 1-0 to claim the UEFA Women's Champions League title.\n\nWith scores locked at 1-1 after a chaotic 90 minutes and extra time, City skipper Rebekah Stott had the chance to seal victory at 4-4 in the penalty shootout in front of a hostile crowd in Wuhan.\n\nBut Stott fired a shot tamely straight at Wuhan goalkeeper Chen Chen.\n\nZhao Yuxin put Wuhan in front and Chen saved Bryleeh Henry's penalty to seal a remarkable shootout victory 5-4.\n\nThe defeat cost City $2 million in prize money and players had been in line to receive around $47,000 each.\n\nInstead, the players each claim about $23,000 as runners-up, with the club's prize money approximately $1.25 million.\n\n\"It's gutting to lose like that,\" Stott said.\n\n\"I think we played well. We dominated the game. We should have come away with the win, but football is like that sometimes.\n\n\"It's disappointing. We're gutted.\"\n\nOnly a few weeks ago, City had high hopes of a treble after claiming the A-League Women premiership in an unbeaten regular season.\n\nBut City cost itself the chance to win the A-League Women championship after losing to Central Coast Mariners in the semifinals.\n\nOn Saturday night, 17-year-old Shelby McMahon headed home a wonderful free kick from Leticia McKenna in the 76th minute to put City in front.\n\nHenry thought she had made it 2-0 in injury time but the goal was chalked off via VAR for a foul she had committed in the build-up.\n\nFrom the subsequent free kick, Mariana Speckmaier was penalised for a handball — after a header ricocheted into her arm — via a VAR review and Wang Shuang equalised from the spot in the 98th minute.\n\nCity had two late chances to beat Wuhan in extra-time, while Stott was lucky not to be penalised for a handball in the 103rd minute.\n\nMcKenna dragged a shot wide in the 116th minute and Leah Davidson was unable to meet Speckmaier's wonderful squaring ball before the match went to spot kicks.\n\n\"Once it went into extra time, it got quite hectic, and not a lot of football was played,\" Stott said.\n\n\"I think we still could have got a goal. But it wasn't meant to be.\"\n\nCity qualified for next season's Champions League through winning the A-League Women premiership.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/shirley-club-social-same-name-birthday/105306852",
        "title": "Shirley hated her name until she joined a same-name club",
        "publish_date": "Sat, 24 May 2025 22:21:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Shirley Towner remembers driving around Christchurch, New Zealand, in a topless pink limousine full of women called Shirley in flamboyant clothing waving at truckies, yelling and having a hoot.\n\nWhy? Because that's what you do when you're a member of the Shirley Club.\n\nIt's a same-name club open to anyone named Shirley, with branches across Australia, New Zealand and America.\n\nACT Shirley Club acting coordinator Shirley Towner says the only thing members have in common is their name. (ABC News: James Tugwell)\n\n\"We've got nothing else in common except our name,\" Ms Towner said.\n\n\" Somehow that's like a glue that's bonded us together and we've had an amazing time. \"\n\nShirley Brown started the first Shirley Club in 1996 in Perth after she had tea with two friends called Shirley and put an advertisement in the paper inviting any other Shirleys happy to share a cuppa.\n\nThere were 62 Shirleys at the first meeting of what would become the Shirley Club.\n\nTheir motto is 'fun, food, friendship'.\n\nShirley Towner has loved being a member for the Shirley Club for 24 years. (ABC News: James Tugwell)\n\nA Guinness World Record\n\nMs Towner said the group was all about having fun — through local monthly meetings and national and international Shirley conventions.\n\n\"We make our own entertainment up,\" Ms Towner said.\n\nThe ACT club performed a Sister Act dance routine dressed in nun's habits during the 2003 Shirley Convention in Melbourne.\n\nACT Shirley Club members performing as nuns during the 2003 Melbourne Shirley Convention. (Supplied: Shirley Towner)\n\nThe finale included one habit being flung open to reveal an apron decorated like a man's hairy chest.\n\n\"It was an absolute hoot,\" Ms Towner said.\n\nAround 180 Shirleys set a Guinness World Record at that same convention, Ms Towner said, for the largest gathering of people with the same name.\n\nThe record was eclipsed in 2005 by 1,096 Mohammeds in Dubai.\n\nA world-record breaking number of Shirleys gather at the 2003 Shirley Convention in Melbourne. (Supplied: Shirley Towner)\n\nDifficulty in cafes, but no need for name tags\n\nMs Towner said the club always had issues ordering at restaurants and cafes, where staff asked for a name for orders.\n\n\"We tell people who we are, and they don't believe us, then they realise we're actually telling the truth,\" she said.\n\nMs Towner once invited a so-called \"non-Shirley\" to a Shirley convention.\n\n\"She loved it so much, she's thinking of adding Shirley to her name so she can come to the 30th birthday next year in Perth,\" Ms Towner said.\n\nShirley Towner has been to several Shirley Conventions all around the world. (ABC News: James Tugwell)\n\nHowever, membership within the Shirley Club is exclusive to those bearing the name — surnames included.\n\nShirley Kenney from the ACT Shirley Club said that was what made the club unique.\n\n\"You can't be any old Tom, Dick or Harry,\" Ms Kenney said.\n\nShe said it came with many positives.\n\n\"You don't have to remember everyone's name,\" she said.\n\n\"You might not have seen them in a while. It's okay.\n\n\" They're surely Shirley. \"\n\nMs Towner and Ms Kenney met 24 years ago when the ACT Shirley Club began and gathered again this week to celebrate the club's birthday.\n\nLearning to love the name\n\nShirley Scholte heard about the Shirley Club in Western Australia and put an advertisement in her local free Canberra newspaper in 2001.\n\nACT Shirley Club founder Shirley Scholte never imagined the club would become as popular as it did. (ABC News: James Tugwell)\n\nThat day, her phone was bombarded with Shirleys wanting to join.\n\nAnd so, the ACT Shirley Club was born, with 46 Shirleys attending the first gathering.\n\n\"I never imagined it would get this big,\" Ms Scholte said.\n\nIt changed Ms Scholte's world.\n\n\"I hated the name Shirley until the Shirley Club came along. It changed my mind. Before then, I cursed my mother — seriously, what was she thinking?\n\n\"Now I love it.\"\n\nACT Shirley Club inaugural members Shirley Kenney, Shirley Cramp and Shirley Scholte. (ABC News: James Tugwell)\n\nThe group reached almost 70 members at its height, meeting monthly.\n\nIt reflected an era where Shirley dominated the most popular baby name lists.\n\nShirley was the fourth most popular girl name in America during the 1930s, when childhood film star Shirley Temple took Hollywood by storm.\n\nShirley was the second most popular girl baby name in 1935 and 1936 in Australia and was among the top 100 baby names nationally until the 1960s.\n\nDying out\n\nBut its popularity has dropped off.\n\nBabyCentre reports Shirley was the 2,438th most popular baby name in 2024.\n\nA graph showing the popularity of Shirley as a girl's name in America. (Source: Social Security Administration)\n\n\"It grew out of fashion and it hasn't come back like some of the other names have,\" Ms Towner said.\n\nThe ACT Shirley Club used to meet monthly but now meets bi-monthly because it's becoming increasingly harder for the aging members of the Shirley Club to get out and about to the meetings.\n\nMost members are above 70, with the oldest in their 90s.\n\nThe ACT Shirley Club has been meeting for 24 years, but its future doesn't look so bright. (ABC News: James Tugwell)\n\nNational conventions held every two years became annual \"because we don't know how much time we've got,\" Ms Towner said.\n\n\"We're a dying club.\n\n\" We have a few Shirleys die every year and no one is calling their daughters Shirley. \"\n\nThe thought the club might disappear forever is devastating for Ms Towner.\n\n\"Some of my friends are a bit jealous that I've got a same-name club,\" she said.\n\n\"I say they should just start one — just do what we did.\n\n\"But it would be so sad to lose it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/bonsai-australian-native-tree-popularity-grows/105319374",
        "title": "In recent years the banksia has become a surprise bonsai",
        "publish_date": "Sat, 24 May 2025 22:16:47 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The craft of cultivating bonsai evolved from Japan with a focus on minituarising trees and plants.\n\nRecent enthusiasm for the world of tiny trees is seeing Australia's native flora re-imagined as bonsai.\n\nLeigh Taafe has crafted more than 10,000 bonsai and said native trees are perfect candidates.\n\nHe is the curator of the National Bonsai and Penjing Collection of Australia and said \"there was a lot of thought within our community in the early days that it was very difficult to do Australian native trees as bonsai\".\n\n\" It wasn't until we realised the mistake we made by applying the maintenance principles of exotic trees. \"\n\nHe said that as bonsai artists increasingly dabbled in natives, they learnt to tailor traditional practices to the local environment, giving shape to an \"Australian style\".\n\nA narrow-leaved black peppermint bonsai at the Arboretum in Canberra. (ABC News: Yasmine Wright Gittins)\n\n'Evokes a memory'\n\nSaw banksia flower on a bonsai, by Neale and Lynne Farrell, styled since 1995.\n\nMr Taafe said high praise came from Japan's Bonsai Art Museum which was \"taken\" with the native trees, particularly banksia.\n\n\"Banksia are quite gnarly old looking trees, so it certainly adds to that illusion of a big tree in miniature,\" Mr Taafe said.\n\n\"They've probably never seen them as bonsai before, so when they came to visit, they were in awe of the size and the texture of the trunks.\"\n\nThe first tree ever donated to the national collection was a now-57-year-old Freshwater Paperbark by Derek Oakley from Western Australia.\n\nMr Taafe said a good bonsai design was one \"that evokes a memory of the Australian landscape\".\n\nA flowering banksia bonsai tree. (ABC News: Yasmine Wright Gittins)\n\nTiny tree turns 50\n\nSteve Liston's love of bonsai began when he was aged 17 and he collected a Japanese maple seedling from a friend's garden — it became his first bonsai tree.\n\nFifty years later and his love for the art is thriving, along with his tiny Japanese maple.\n\n\"It's the one that my family, my wife and kids, like a lot,\" he said.\n\nSteve Liston's Japanese maple bonsai, tended to since 1975. (ABC News: Yasmine Wright Gittins)\n\nMr Liston led a team which curated a display for this year's National Bonsai Convention.\n\nMany of the bonsai have a unique local link and were originally dug up around Canberra.\n\n\"Our last dig was down at Fadden Pines,\" he said.\n\nBonsai on display at the 2025 National Bonsai Convention at the Canberra Arboretum. (ABC News: Yasmine Wright Gittins)\n\n\"We'll go get some of those woody weeds which have escaped from gardens and eventually turn them into bonsai.\"\n\nBut, as Mr Liston warns, there are regulations around taking trees.\n\n\"The first thing is to get permission … the second thing is to do it sensitively and don't leave a mess when you're finished digging it up,\" he said.\n\nLead exhibitioner at the 2025 Bonsai Convention, Steve Liston. (ABC News: Yasmine Wright Gittins)\n\nMr Liston said the array of Australian natives being used by bonsai hobbyists was one the biggest and most exciting changes he had seen in the art.\n\n\"Working with native trees offers great possibilities for bonsai,\" he said.\n\nLocal scene burgeons\n\nTony Gill is president of the Canberra Bonsai Society and said anyone can appreciate native bonsai which are \"very much part of the convention theme\".\n\n\"Bonsai are for all ages … our youngest member, a lad called Henry, is only nine, and our oldest member still active is a lady call Lucia and she is 95,\" he said.\n\nWillow leaf fig by Pauline Phillips and David Russel, styled since 1985. (ABC News: Yasmine Wright Gittins)\n\nThe society was formed in 1975 by eight horticulture students.\n\n\"From that group of eight, basically, we now have close to 200 members,\" Mr Gill said.\n\n\"When it first started it had an emphasis on exotics … nowadays there's probably more of an emphasis on native trees for bonsai.\"\n\nMr Miyagi inspires\n\nA honey myrtle bonsai at the Arboretum in Canberra. (ABC News: Yasmine Wright Gittins)\n\nThe interest in native trees is so great, the society enlisted Marcela Ferreira, an Australian native bonsai artist, to deliver workshops.\n\nMs Ferreira first encountered bonsai while watching the Karate Kid.\n\n\" I would have been around 12 years old … when I saw Mr Miyagi working on them. I said to myself, 'One day, I want to do that'. \"\n\n\"When I first started, there were some people playing and dabbling with them, but it wasn't readily available. You went to shows and if you were lucky, you might see one or two trees. It's really grown and there's a lot of interest for it now.\"\n\nShe said some misconceptions about Australian natives persist.\n\n\"I think it is just a mindset that people have been too stuck on.\"\n\n\"[But] the beauty of our Australian natives is they're quick and easy to grow … I definitely want to see more people using our trees.\"\n\nHer advice to aspiring native bonsai artists is simple:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/giro-d-italia-stage14-groves-second-to-asgreen/105333680",
        "title": "Australian Groves reaches Giro podium in stage 14",
        "publish_date": "Sat, 24 May 2025 22:16:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Kaden Groves has finished second to Dane Kasper Asgreen in the 14th stage of the Giro d'Italia.\n\nGroves (Alpecin–Deceuninck) outsprinted Dutchman Olav Kooij (Visma-Lease a Bike) to take second place in the 195-kilometre stage from Treviso to Nova Gorica in Slovenia.\n\nAsgreen (EF Education-EasyPost) took advantage of a crash in the chasing peloton and went alone to win the stage, with Mexican Isaac del Toro extending his overall lead.\n\nSeveral riders were brought down in the crash, leaving Asgreen to go for broke in the final kilometres as he held off the chasing group.\n\n\"It was a tough day out there,\" Asgreen said.\n\n\"It's annoying when you have to destroy yourself completely like this to win bike races, but when it works out it's all worth it.\"\n\nDel Toro (UAE Team Emirates) managed to avoid trouble and was with the chasing group, which followed Asgreen over the line to increase his lead at the head of the general classification.\n\nBriton Simon Yates (Visma-Lease a Bike) climbed to second.\n\nDel Toro began the day with a 38-second lead over teammate Juan Ayuso but now has a gap of one minute and 20 seconds on Yates.\n\nAyuso is a further six seconds back.\n\nGroves had claimed victory in the crash-laden sixth stage that finished in Naples.\n\nHe now has four top-five finishes in this year's race.\n\nGroves's compatriot Michael Storer (Tudor Pro Cycling Team) leads the Australian contingent in the general classifications in 13th position.\n\nStorer is 4:25 behind del Toro.\n\nStage 15 features a climb up Monte Grappa at the mid-point of the 219km route from Fiume Veneto to Asiago.\n\nReuters/AAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/future-of-specialised-gp-pilot-program-in-tasmania-in-doubt/105302072",
        "title": "Program that brought down paediatric wait times may not continue",
        "publish_date": "Sat, 24 May 2025 22:13:01 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A pilot program designed to reduce paediatric wait times in Tasmania was abruptly ended six months early, according to one of the doctors involved.\n\nThe General Practitioners with Special Interest (GPwSI) project was part of a broader strategy to address wait times in outpatient clinics across the state.\n\nThe idea was to place doctors with a specific interest in a range of outpatient clinics like antenatal, cardiology and mental health services to come up with new models of care.\n\nThe GPs would be working between half a day to two days a week.\n\nPaediatrician shortage leaves 3,300 children on wait list Photo shows A mum at a table watches over her two children painting A retiring paediatrician says the Tasmanian health system is prioritising children with physical complaints rather than developmental issues.\n\nAccording to the Health Department, the funding for the entire program was equivalent to employing two full-time GPs for two years.\n\nThe ABC has been told that while doctors were offered shorter contracts, some were led to believe the pilot program would run for two years, until June 2025, and were shocked when it ended sooner than expected.\n\nTim Jones is one of the doctors who was employed as part of the pilot in mid-2023.\n\nDoctor Tim Jones says waiting times for some patients fell from two years to less than three months. (Supplied: Tim Jones)\n\nHe was placed at the Royal Hobart Hospital (RHH) paediatric clinic.\n\n\"Because of my natural scope being more linked to younger kids, I prioritised seeing any child of seven or under who was on our waitlist here in southern Tasmania,\" Dr Jones said.\n\n\" In the 18 months … we managed to reduce that wait time [for children seven and under] from over two years to essentially less than three months for those kids to be assessed and supported. \"\n\nWhile not a fully qualified paediatrician, Dr Jones was able to provide broader assessments, looking at the child's environment, family and school and then linking them up with the support they needed.\n\n\"We could tease out which kids needed which layer of support,\" he said.\n\n\"That meant the kids that did need to go through and have a full formal ADHD [or autism] assessment, we could screen them out and make sure they then got that assessment, whereas kids who needed other pathways, we made sure they got timely access to those services.\"\n\nHarry had to ask his parents to stop hugging him Photo shows Harry Dannock in karate uniform. Harry was 10 when clenching his fists during karate classes became difficult. But the real turning point came when he asked his parents to stop hugging him because it hurt too much.\n\nOften, Dr Jones said, the primary problem was not attention deficit hyperactivity disorder (ADHD) or autism, but things like poor sleep patterns, inadequate supports in school and dyslexia.\n\nBy managing to filter out those who could be assisted by other services, it meant children who needed more complex assessments could see a paediatrician in a more timely manner.\n\nThen in November, Dr Jones was told his position could no longer be funded, and his contract would not be extended and would end in January.\n\nDr Jones said he had been told from the beginning, including during the interview, that the program would run until the end of June this year.\n\nThe ABC understands other GPs with specific interests were told similar things.\n\n\"What we found was that a lot of the GPs were able to …integrate well with the systems and start to deliver some outcomes, so it came as a shock to all of us that we received limited notice that the funding was not to be continued past the 18 month mark,\" DrJones said.\n\nLong waits for consultation\n\nAccording to the Health Department, wait times in Tasmania for a non-urgent patient to see a public paediatrician can last close to two years.\n\nThat varies depending on where in the state the person is.\n\nAnna Nottage says Dr Jones was a \"great support\" while she and daughter Lottie were on a waitlist to see a paediatrician. (ABC News: Kate Nickels)\n\nThe private system is no better, as Anna Nottage knows. When her daughter Lottie was aged two, she tried to get her into a paediatrician, concerned about her delayed development.\n\nShe was referred to a private clinic and the public one at the Royal. Both had extensive waitlists.\n\nIn the meantime, Ms Nottage and Lottie were able to see Dr Jones, who was working at the developmental clinic at the RHH.\n\nLottie needed to see a paediatrician, but her mother says using the pilot program in the meantime was helpful. (ABC News: Kate Nickels)\n\nWhile Lottie turned out to be one of the complex cases who did need to be seen by a paediatrician, Ms Nottage said being able to discuss her concerns with Dr Jones was reassuring.\n\n\"He was a great support,\" she said.\n\n\" Without that program, I don't know where we would've been. \"\n\nMs Nottage is urging the Health Department to keep the program for children like Lottie. (ABC News: Kate Nickels)\n\n'Early intervention key': Labor\n\nLabor's Shadow Health Minister Ella Haddad said it was disappointing for Tasmanian families waiting in that system that the program had ended.\n\n\"This is a program that was actually having a tangible effect on [those long waitlists],\" she said.\n\n\"For that to be cut, we know the wait times are just going to get longer and harder for Tasmanians who already need these services early.\n\n\" It's really important to remember that early intervention is key when it comes to diagnosis and treatment of things like ADHD and other neurodiverse conditions. \"\n\nIn April, the state government opened a specialist service for children and young people with suspected ADHD in the south, and there are plans to expand statewide.\n\nIt also includes funding for two GPs with special interests in ADHD.\n\nBut that service will not help kids like Lottie, who was eventually diagnosed with autism and is now seeing one of the new paediatricians at a private clinic.\n\nLottie was eventually diagnosed with autism. (ABC News: Kate Nickels)\n\n\"There are a lot of parents probably going through the same thing,\" Ms Nottage said.\n\n\"They haven't got a paediatrician and need that stopgap for children with behavioural or developmental needs.\n\n\" Keep [the program]. It needs to stay. \"\n\nDepartment evaluation underway\n\nIn a statement, a Health Department spokesperson said they acknowledged the positive impact the GPwSI model of care pilot had caused for \"some patients, particularly in paediatrics\".\n\nThe spokesperson said an evaluation of the broader pilot was being finalised, which would provide guidance on how the department \"can best utilise the state's highly-skilled GPwSI and rural generalist workforce across our health service\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/french-open-maya-joint-wins-in-morocco-wta-tour/105333666",
        "title": "Aussie teenager wins first WTA tournament ahead of French Open debut",
        "publish_date": "Sat, 24 May 2025 21:47:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian tennis has been given a major boost on the eve of the French Open after teenager Maya Joint powered to her first WTA Tour title in Morocco.\n\nJoint, 19, collapsed in joy following her 6-3, 6-2 win over Romanian Jaqueline Cristian on clay in the Rabat final.\n\n\"I'm really excited that I was able to win a title here, and hopefully it'll be the first of many,\" Joint said.\n\nJoint also won the doubles title with Georgian Oksana Kalashnikova in Rabat.\n\nUS-born Joint is ranked 78 in the world but will enjoy a significant jump in the WTA standings.\n\nShe could climb as high as 53 in the rankings.\n\nJoint will make her French Open debut, which commences in Paris on Sunday evening AEST.\n\nShe will play fellow Australian Ajla Tomljanović in the first round.\n\nThey faced each other in the Rabat semifinals, with Joint advancing when Tomljanović was forced to withdraw after the first set due to illness.\n\nThey are among seven Australians in the women's main draw at the French Open.\n\nThere are nine Australians contesting the men's singles in Paris, led by world number nine Alex de Minaur.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-25/nsw-first-home-buyers-fomo-cash-rate-increase-house-prices/105323122",
        "title": "'Eight-week window' sends buyers into overdrive in the housing market",
        "publish_date": "Sat, 24 May 2025 21:29:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jason Martin has been searching since November for an apartment in the northern suburbs of Sydney near his daughter's school.\n\nHe wants a two-bedroom place in Epping, but with many exceeding his $800,000 budget, he knows he'll need to compromise.\n\nThis might mean choosing a property with building defects or opting for a one-bedroom apartment with a study area that fits a bed.\n\nBut he's struggling to find something he really likes in his price range.\n\n\"I always thought I'd buy something that I'd fallen in love with. But I haven't found anything worth fighting for,\" he told the ABC.\n\nMany first-home buyers are hoping to find a property within their limited price range. (ABC News: Che Chorley)\n\nThe Reserve Bank of Australia (RBA) has cut the cash rate again, bringing it down to 3.85 per cent — the lowest in two years — with future rate cuts on the cards.\n\nLower interest rates enhance buyers' borrowing capacity, spark buyer activity, fuel competition, and drive up home prices, which are already at record highs.\n\nIn April, Australia's median home price reached a new record of $805,000, according to PropTrack.\n\nMr Martin is aware his mission has become harder.\n\n\"Interest rate cuts benefit existing mortgage holders, but for first-time buyers, they raise property prices. The last RBA rate cut seemed to increase some prices by $40,000.\"\n\nFuture rate cuts are on the cards, likely sparking buyer activity. (ABC News: Ian Cutmore)\n\nBuying homes 'they're not even sure they want'\n\nBroker Alya Manji from Aussie Home Loans Hurstville said there's roughly \"an eight-week window\" to buy after a rate cut before its effects hit the market.\n\n\"If you don't act within that time, it gets tougher,\" she said.\n\nShe said a 0.25 per cent rate cut could increase someone's borrowing power by $10,000 to $25,000 on a $500,000 loan. But at the same time, house prices could move by that same amount or more.\n\n\" I see buyers feeling such FOMO that they sign on properties they're not even sure they want. They feel there's no choice. \"\n\nRate cuts can increase a person's borrowing power, but there can be consequences, noted broker Alya Manji. (Supplied)\n\nPrices to keep rising\n\nNicola Powell, Domain's chief of research and economics, said a downward rate cycle and persistent housing shortages would keep driving property prices up.\n\n\"A rate cut prompts buyers to act quickly, fearing further price increases.\n\n\"Buyer inquiry volumes are up year-on-year in all of our capital cities,\" Dr Powell said.\n\nNicola Powell says a rate cut often prompts buyers to act quickly. (Supplied)\n\nSenior economist at REA Group Eleanor Creagh agreed two rate cuts this year and the prospect of more would boost demand — and therefore prices — when there aren't enough homes to go around.\n\n\"In terms of housing supply, we've still got constraints on the delivery of new homes, particularly in major capitals.\"\n\nOther factors fuelling FOMO\n\nRate cuts and housing shortages aren't the only factors driving buyer FOMO.\n\nThe Labor government's election win means its First Home Guarantee scheme will be extended to allow a larger pool of buyers to purchase with as little as a 5 per cent deposit, without Lenders Mortgage Insurance, from July 1.\n\nWhile this helps more first-home buyers, it intensifies competition.\n\nWith constraints on the delivery of new homes in major capitals, many housing lots are being built in the outer suburbs. (ABC News: Monish Nand)\n\nMeg Elkins, a behavioural economist at RMIT, said supporting first-time buyers while not propping up prices artificially \"is a very difficult balancing act\".\n\n\"We know that if you increase subsidies around housing, it can increase capacity around borrowing and push up those prices.\"\n\nDr Elkins added that millennial first-home buyers were also feeling external pressures to reach life milestones.\n\nMeg Elkins says the pressure on millennial first-home buyers is particularly intense. (Supplied)\n\n\"Many millennials feel they should own property by 30,\" she said.\n\n\"And they're facing the toughest purchasing conditions in history, with high interest rates, living costs and student debt combined with stagnant wage growth.\n\n\"They're so badly done by.\"\n\nIf those conditions weren't tough enough for buyers, the market has become swamped with buyers' agents, who \"can easily outplay regular bidders\", Ms Manji said.\n\nBuyers' agents often have close ties with agents, and they know how to negotiate.\n\nPlus, they've significantly enlarged the buyer pool by acting on the ground for remote clients.\n\n\"Buyers are now facing competition from people across Australia and beyond,\" Ms Manji said.\n\nSome economists think house prices will rise by about 5 per cent by year's end. (ABC News: Elise Pianegonda)\n\nWhat can buyers do?\n\nIt's not all doom and gloom. The prospect of higher prices following another rate cut could entice more people to list their properties for sale, boosting supply.\n\nProperty price rises of about 5% expected by year's end Photo shows an outside view of a row of houses Cheaper money for housing, amid a market with high demand and low supply, will keep fuelling property prices.\n\nAnother factor restraining price growth is, of course, affordability. The Housing Industry Association reported affordability was at a 30-year low in the second half of last year.\n\n\"I think we're all a bit scared after the cash rate hikes, cost of living pressures and wages growth that hasn't kept up with price growth,\" Dr Powell said.\n\nDr Elkins suggested researching available government grants, enlisting the help of a buyer's agent, or considering that dreaded word among buyers: compromise.\n\n\"You may not get exactly what you want. So what are you willing to give up to get closer to your ideal?\"\n\nMr Martin isn't prepared to compromise on location or buy a property he dislikes — and he knows that comes with consequences.\n\n\"There is definitely a FOMO because the prices will rise, potentially pricing me out,\" he said.\n\n\"It's very frustrating. If this goes on for another few months, I'll be locked out of the market.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/not-at-all-joey-quashes-galvin-plan-20250525-p5m207.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Not at all': Joey quashes Galvin plan",
        "publish_date": "Sun, 25 May 2025 12:08:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Not at all': Joey quashes Galvin plan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/vivid-live-a-triumphant-orchestral-excursion-with-sigur-ros-and-the-sso-20250524-p5m1vb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pop-rock veterans Train deliver a crowd-pleaser with special Sydney surprise",
        "publish_date": "Sun, 25 May 2025 11:52:14 +1000",
        "category": "entertainment",
        "authors": [
            "Rod Yates"
        ],
        "text": "TRAIN\n\nICC Sydney Theatre, May 24\n\nReviewed by ROD YATES\n\n★★★½\n\nSay what you will about American pop-rock veterans Train, but they work hard to get the audience on their side.\n\nIn third song If It’s Love, frontman Pat Monahan pulls out his phone and begins filming the room, asking the crowd to go crazy for the clip he’ll post to Instagram.\n\nDuring an extended Meet Virginia, which gives guitarist Taylor Locke an opportunity to show off his chops, Monahan takes a break from singing to lob Train T-shirts into the masses.\n\nThe cleverly constructed set-list also plays its part with staples such as Hey, Soul Sister, Play That Song, a spirited Save Me, San Francisco and a beautifully tender Marry Me peppered with several moments tailored for the Sydney audience.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/jetstar-planes-flying-again-after-mysterious-gps-fault-20250525-p5m1zh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jetstar planes flying again after mysterious GPS fault",
        "publish_date": "Sun, 25 May 2025 11:47:41 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Jetstar has confirmed that its planes are flying normally again after a mystery glitch related to the global positioning system (GPS) forced delays and cancellations last week.\n\nTwo flights from Australia to Bali were cancelled last week, and others were delayed, after faults in the GPS on Jetstar Airbus A320 Neos and A321 Neos prevented the flights from taking off.\n\nThe airline said it understood “the fault message was caused by a satellite signal issue” that occurred from May 21 to May 23 AEST.\n\nA mystery glitch halted some Jetstar flights last week. Credit: Kate Geraghty\n\n“Currently, this fault is not reoccurring. We continue to monitor closely,” a Jetstar spokesperson said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/djoker-wins-100th-title-20250525-p5m1zu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Djoker wins 100th title",
        "publish_date": "Sun, 25 May 2025 11:13:09 +1000",
        "category": "sports",
        "authors": [],
        "text": "Djoker wins 100th title\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/power-outage-across-cannes-during-film-festival-being-treated-as-sabotage-20250525-p5m1zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Power outage across Cannes during film festival being treated as sabotage",
        "publish_date": "Sun, 25 May 2025 11:11:32 +1000",
        "category": "entertainment",
        "authors": [
            "Aurelien Breeden",
            "Kyle Buchanan"
        ],
        "text": "Paris/Cannes: French authorities say a power outage in the Cannes area in south-eastern France that briefly disrupted the film festival there was caused by acts of sabotage, including arson at a substation and damage to a transmission tower.\n\nAbout 160,000 homes in Cannes and the surrounding area were left without power for hours on Saturday, Cannes time, according to RTE, France’s electrical grid operator, which said service had been fully restored by late afternoon.\n\nThe outage interrupted some screenings at the film festival, which quickly switched over to its own generators.\n\nA shop worker stands at the door during the power outage. Credit: Getty Images\n\nLaurent Hottiaux, the state representative for the Alpes-Maritimes area, which includes Cannes, said the outage was caused by “major damage to network installations” near the city, including the arson attack and damage to the tower.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/billy-joel-cancels-shows-due-to-a-brain-disorder-here-s-what-to-know-20250525-p5m1zd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billy Joel cancels shows due to a brain disorder. Here’s what to know",
        "publish_date": "Sun, 25 May 2025 11:09:51 +1000",
        "category": "lifestyle",
        "authors": [
            "Teddy Amenabar",
            "Richard Sima"
        ],
        "text": "Billy Joel has cancelled all scheduled performances in the United States and Britain because of a brain disorder called normal pressure hydrocephalus, according to a statement posted Saturday on the singer’s social media accounts.\n\nHydrocephalus refers to a build-up of cerebrospinal fluid, a watery liquid that cushions the brain and spinal cord. With normal pressure hydrocephalus, the fluid accumulates gradually with little to no increase in intracranial pressure. The excess cerebrospinal fluid presses on the brain and can disrupt neural pathways, causing cognitive impairments, difficulty walking and a loss of bladder control.\n\nBilly Joel has been diagnosed with a brain disorder that affects his vision, hearing and balance. Credit: Getty Images\n\nJoel will be undergoing physical therapy and his doctor has instructed him to refrain from performing as he recovers, the statement said. The Piano Man is cancelling 17 shows and tickets for the cancelled concerts will be automatically refunded.\n\nHow is normal pressure hydrocephalus diagnosed and treated? Here’s what to know.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/could-sharks-hold-the-secret-to-cutting-flight-costs-20250508-p5lxmq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could sharks hold the secret to cutting flight costs?",
        "publish_date": "Sun, 25 May 2025 11:06:28 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Much of aviation’s history hinges on what humans learn from birds about aerodynamics. But the next leap forward may be driven not by birds, but by sharks.\n\nShark’s skin features microscopic grooves that reduce drag as the animal swims.\n\nMicroTau staff install a sample of sharkskin drag-reducing material on a section of an Airbus aircraft. Credit: Kate Geraghty\n\nThe concept is being applied to the surface of planes to reduce drag and boost efficiency, trimming fuel costs.\n\nSydney-based MicroTau, the company pioneering the technology, is partnering with low-cost Spanish airline Vueling to support certification of its “shark skin” Riblet Modification Package.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/freo-coach-defends-captain-s-knock-after-dockers-crush-power-20250525-p5m1z3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo coach defends captain’s knock after Dockers crush Power",
        "publish_date": "Sun, 25 May 2025 10:02:17 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle coach Justin Longmuir is adamant Alex Pearce should have nothing to worry about, declaring the skipper’s collision that concussed Port Adelaide’s Darcy Byrne-Jones didn’t even warrant a free kick.\n\nByrne-Jones was running with the flight of the ball when Pearce cannoned into him from the opposite direction in Fremantle’s 49-point win on Saturday night.\n\nAlthough Pearce didn’t turn his body in a bumping motion, he took his eyes off the ball at the last moment and was airborne when contact was made in the Dockers’ 15.10 (100) to 7.9 (51) victory.\n\nByrne-Jones was helped off the ground after the second-quarter incident and was subbed out of the game with a concussion.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/cannes-2025-the-75-best-red-carpet-looks-20250514-p5lz15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cannes 2025: The 75 best red carpet looks",
        "publish_date": "Sun, 25 May 2025 09:12:23 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Cannes 2025: The 75 best red carpet looks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/blackstenius-puts-gunners-up-20250525-p5m1ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blackstenius puts Gunners up",
        "publish_date": "Sun, 25 May 2025 09:12:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Blackstenius puts Gunners up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/no-chance-of-charles-and-harry-reuniting-on-kings-canada-trip-says-royal-expert-20250525-p5m1yk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No chance of Charles and Harry reuniting on King's Canada trip, says royal expert",
        "publish_date": "Sun, 25 May 2025 09:03:03 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "No chance of Charles and Harry reuniting on King's Canada trip, says royal expert\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/unholy-workplace-row-brewing-in-state-s-catholic-schools-20250522-p5m1as.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unholy workplace row brewing in state’s Catholic schools",
        "publish_date": "Sun, 25 May 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Noel Towell"
        ],
        "text": "A messy workplace dispute is brewing between teachers at Victoria’s Catholic schools and their employers, with the educators’ union threatening Fair Work action to enable its members to take industrial action.\n\nA militant mood among the state’s government school teachers has spread to the 30,000 educators at Victorian Catholic schools, whose wages lag behind their interstate counterparts by up to $10,000 a year.\n\nThe vast majority of Catholic teachers surveyed by the union said they were ready to walk off the job for better pay and conditions, raising the prospect of school strikes.\n\nBut a protected sector-wide strike by Catholic teachers is not a current option because the 30,000 educators are employed by 33 separate church-linked entities, ranging in size from the giant Diocese of Melbourne to single-site employers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/borderlands-on-the-edge-of-humanity-20250522-p5m1kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Borderlands: On the edge of humanity",
        "publish_date": "Sun, 25 May 2025 08:45:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Series\n\nBorderlands: On the edge of humanity\n\nZach Hope and Kate Geraghty travel to the borderlands near Myanmar, where efforts are under way to rescue thousands of trafficking victims from scam factories.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/max-infuriated-by-hamilton-move-20250525-p5m1ye.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Max infuriated by Hamilton move",
        "publish_date": "Sun, 25 May 2025 08:37:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Max infuriated by Hamilton move\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/six-tips-to-prepare-for-filing-your-tax-return/zt71d9agu",
        "title": "Tax time countdown: Six things you should start doing now",
        "publish_date": "Sun, 25 May 2025 01:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's never too early to plan, especially for what can be a long and tricky tax return proces.\n\n\n\n\n\nThis financial year will finish in over a month, at the end of June, and Australians will have four months to lodge their tax returns — preparing for this early may save you time and money.\n\n\n\n\n\nMasoud Habibian, an accountant and tax agent in Australia, said this may be a \"good time to start\" to \"prepare and review\" your tax lodgement.\n\n\n\n\n\nHere are a few tips that may help you in preparing for your tax return:\n\n\n\nDouble-check your myGov account\n\nFirst of all, make sure your information in your myGov account is updated, the account is linked to the Australian Taxation Office (ATO), and it is working.\n\n\n\n\n\n\"Make sure that all the data, like your bank details and personal information, is updated,\" Habibian said.\n\n\n\n\n\n\"Make sure that you have a strong verification [system] in your myGov ... If it is actually working, and it has been linked properly, [and] you've got access to it.\n\n\n\n\n\n\"Make sure that you've got a good and secure access to the personal information and documents within myGov.\"\n\n\n\n\n\nIn addition, he advised that if you have forgotten your password, changed your phone number or are facing any other difficulties, it's important to resolve them early, as the process may be significantly more time-consuming during tax time.\n\n\n\nFind those old receipts\n\nPreparing all those old receipts as proof for your work-related deductions can also save you time and money on your tax return.\n\n\n\n\n\nAccording to Habibian, finding and keeping receipts of work-related purchases, like \"tools, uniforms, equipment, computer, education expenses, car expenses, donations,\" etc, are important.\n\n\n\n\n\n\"[Gathering] all the receipts and all the documents related to the income and expenses is very important,\" he said.\n\n\n\n\n\n\"A common issue we see is missing receipts or documents, especially for work-related expenses. Make sure that you're storing the receipts digitally.\"\n\n\n\nPrepare your work from home record\n\nIn general, there are two different methods you can use to claim your work from home-related deductions: First, gathering all the information about your expenses for the time you worked from home, and second, providing the total hours you worked remotely to the ATO.\n\n\n\n\n\nHabibian suggests gathering this information as soon as possible.\n\n\n\n\n\n\"Sometimes it might be a bit time-consuming to find the detailed record of a daily log of the hours that you worked from home, and also evidence of the expenses like electricity, internet, and phone,\" he said.\n\n\n\n\n\n\"This document actually takes more time to collect and provide to the tax agent.\"\n\n\n\nSeparate your personal and business expenses\n\nIf you own a business and have not yet separated your personal and business expenses, this might be a great time to start, as it may take up a lot of your time.\n\n\n\n\n\n\"Separating your personal [expenses] from the business expenses would be highly important,\" Habibian said.\n\n\n\n\n\n\"Most of the people have their personal and business expenses mixed, and it will take a huge amount of time to separate them.\"\n\n\n\nGenerally, the distinction between personal and business expenses is straightforward.\n\n\n\n\n\nPurchases intended for business use are deductible business expenses, while items bought for personal use are classified as personal expenses.\n\n\n\n\n\nIf you have an item that serves both business and personal purposes, like a laptop or a phone, you can only deduct the portion used for business.\n\n\n\nDocument your other sources of income\n\nWith only one source of income and a limited number of work-related expenses, the tax return process may not take much time.\n\n\n\n\n\nHowever, if you have multiple income sources, Habibian said you should start your preparation sooner.\n\n\n\n\n\n\"If you have an investment property, you need to gather information,\" he said.\n\n\n\n\n\n\"Make sure that you are focusing on the rental property claims as well ... That would actually be a bit time-consuming. You need to have a chat with your real estate agent.\n\n\n\n\n\n\"You need to start from now.\"\n\n\n\n\n\nThe same goes for other investments like cryptocurrencies.\n\n\n\n\n\n\"If you have crypto that is in the radar of the ATO, you need to gather information about it ... If you are trading crypto, you must report it even if you have made a loss,\" he said.\n\n\n\nDon't rush\n\nTax time starts on the first of July each year and finishes by the end of October.\n\n\n\n\n\nBy mid-July, once employers and banks have submitted more information to the ATO, the prefilled data will be available for your tax lodgement.\n\n\n\n\n\n\"Many people rush to lodge on the first of July ... But you should avoid loading these documents too early.\n\n\n\n\n\n\"This reduces the errors and avoids later amendments.\"\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licenced professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-finding-joy-in-a-world-of-chaos/zfhvhw1zu",
        "title": "INTERVIEW: Finding joy in a world of chaos",
        "publish_date": "Sat, 24 May 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/suffering-in-silence-the-rapidly-rising-disease-impacting-australians/vvxbuimso",
        "title": "Suffering in silence: the rapidly rising disease impacting Australians",
        "publish_date": "Sat, 24 May 2025 21:30:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "In her first year of university, when Natasha Jiwani should have been revelling in her new-found independence, she started to experience constant abdominal pain.\n\n\n\n\n\n\"I straight after finishing high school, first year of university would get severe abdominal pain to the point where I would wake up with it and go to sleep with it. No one could diagnose what it was.\"\n\n\n\n\n\nEventually, Natasha was diagnosed with Crohn's disease.\n\n\n\n\n\n\"The overall experience was quite different. So, walking into a gastroenterologist waiting room, I'd look around and I was the only one that was in my close to 20's. Everybody else, the average age was 60 onwards, so there was a lot of confusion.\"\n\n\n\n\n\nCrohn's disease and ulcerative colitis both fall under the umbrella term of Inflammatory Bowel Disease, or IBD — an autoimmune disease where the body's immune system attacks the gut.\n\n\n\n\n\nCrohn’s disease can cause inflammation anywhere in the digestive system, though it usually affects the bowels.\n\n\n\n\n\nUlcerative colitis, often referred to simply as \"colitis\", can cause inflammation and ulcers in the colon and rectum.\n\n\n\n\n\nVincent Ho, a gastroenterologist at Western Sydney University, says both conditions cause multiple symptoms including diarrhea and abdominal pain, though to others they remain invisible.\n\n\n\n\n\n\"People with inflammatory bowel disease may look perfectly fine but are actually suffering from the symptoms of inflammatory bowel disease, which can be quite severe in many cases and affect their daily life.\"\n\n\n\n\n\nThe number of Australians living with I-B-D is rapidly on the rise, increasing from 100,000 a decade or so ago to around 180,000 today, according to a recent State of the Nation Report.\n\n\n\n\n\n\n\nThat number is expected to rise to 200,000 in the next 10 years.\n\n\n\n\n\nDoctor Ho says the rates of IBD in Australia are among the highest in the world.\n\n\n\n\n\n\"Over 65, we're seeing more cases, but we're also seeing cases of inflammatory bowel disease in young children as well. And there are a number of cases of what we call very early onset in inflammatory bowel disease where children can get it a younger than six years of age.\"\n\n\n\n\n\nDr Ho say, while it's largely unknown how this inflammation arises, we are starting to learn more about its causes.\n\n\n\n\n\n\"Some risk factors in the environment include exposure to tobacco smoke, the use of antibiotics, the use of certain drugs like non-steroidal anti-inflammatory drugs, for example Nurofen, Voltaren, those sorts of drugs. We know that some types of infections can increase the risk of developing inflammatory bowel disease.\"\n\n\n\n\n\nAnother risk factor is diet.\n\n\n\n\n\nOne recent world-first pre clinical study, by the Walter and Eliza Hall Institute of Medical Research, shows how eating just a few meals high in saturated fats, can cause inflammation in the body.\n\n\n\n\n\nThose foods can also weaken the production of a crucial protein called IL-22, which helps fight this inflammation.\n\n\n\n\n\nMice were used in this research, which also reveals something that excited researchers: while saturated fats suppress IL-22 production, unsaturated fats, found in nuts and avocados, actually boost the protein’s production.\n\n\n\n\n\nDr Ho says this provides immense hope for people living with chronic inflammatory diseases like IBD.\n\n\n\n\n\n\"We know that certain types of foods, a high-quality diet, for example, reaching fruit, vegetables, fish, and other fibre sources is considered to be a protective factor when it comes to inflammatory bowel disease.\"\n\n\n\n\n\nNatasha has found eating well has had a huge impact on her symptoms.\n\n\n\n\n\n\"I know that if I'm living off fast food for a week as opposed to making healthy at home meals, my Crohn's is a lot better in that latter thing because my body's healthier and it's ensuring that my body's not flaring up with what I'm eating.\"\n\n\n\n\n\nWhile IBD is a chronic condition with no cure, it can be managed with treatment.\n\n\n\n\n\nEarly diagnosis is important, with symptoms including abnormal bowel movements and the presence of mucus or blood in stools, as well as abdominal discomfort, bloating and flatulence.\n\n\n\n\n\nLeanne Raven, CEO of Crohns and Colitis Australia, says greater awareness around I-B-D will also help when it comes to diagnosis, support and treatment.\n\n\n\n\n\n\"Because it's below the belly button, people don't necessarily talk about it. So, a lot of people become quite isolated in trying to manage their conditions. So, we're trying to shatter the IBD silence through raising awareness of and encouraging people to have conversations.\"\n\n\n\n\n\nNatasha says while there is less stigma and embarrassment around I-B-D than ever before, more people need to talk about it.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/taking-coffee-from-functional-beverage-to-indulgence/yk579xo2o",
        "title": "Taking coffee from 'functional beverage' to 'indulgence'",
        "publish_date": "Sat, 24 May 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIndonesia, one of the world’s largest coffee producers, has just hosted a global event that’s turning heads, and turning up the heat, in the specialty coffee world.\n\n\n\n\n\nThis is the World of Coffee Jakarta 2025, the first time this prestigious international coffee showcase has been held in a coffee-producing country.\n\n\n\n\n\nAnd for Indonesia, it’s more than just an honour ... it’s a statement.\n\n\n\n\n\nFrom cutting-edge brewing competitions to ethically sourced beans, thousands gathered in Jakarta for a full-bodied celebration of everything coffee.\n\n\n\n\n\nAt the heart of it is the Specialty Coffee Association, or SCA, which launched the World of Coffee expo back in 1999.\n\n\n\n\n\nThis year, it finally made its way to the farms and forests where so much of the world’s finest coffee begins.\n\n\n\n\n\nYannis Apostolopoulos, the CEO of the Specialty Coffee Association, says the aim is to reframe how we think about coffee.\n\n\n\n\n\n\"I think what we're trying to do is to excite consumers in consuming coffee. Coffee is moving away from being a functional beverage to becoming more of an indulgement. And what we want to do is to get consumers through a journey that they find coffee exciting as food or wine, so that people can actually enjoy coffee and maybe understand the value that they bring to the value chain and to the people that are producing coffee all around the world.\"\n\n\n\n\n\nHe’s talking about a deeper experience, one where coffee sits alongside wine and fine cuisine, with respect for every hand along the supply chain.\n\n\n\n\n\nOne of those hands belongs to Mikael Jasin, the World Barista Champion in 2024.\n\n\n\n\n\nHe’s a familiar face here, brewing with the same meticulous care farmers use when harvesting cherries.\n\n\n\n\n\n“At least for me, it's making sure that the approach that I do when I make this coffee is the same standard at least to the approach that the farmers have done to their coffee, the roasters have done to that coffee, and then me as the barista at least maintain the same standard, if not better. So that the customer when they drink it, they can enjoy that coffee to the best potential of that coffee.\"\n\n\n\n\n\nHe says it’s about preserving the integrity of the bean, from farm to roast to cup.\n\n\n\n\n\nThat sense of duty, he admits, becomes even more intense when he’s making coffee for others.\n\n\n\n\n\n“Coffee, there's still so many people that are involved in the steps and it's very easy to mess it up. So, when I make coffee - and especially when I make coffee for people, when I make coffee for myself, I'm a bit more relaxed - but for people, I want make sure that I'm serving the best of that coffee .\"\n\n\n\n\n\nAnd it all begins with the farmers.\n\n\n\n\n\nOn the volcanic slopes of Bandung, West Java, coffee cherries ripen in the sun.\n\n\n\n\n\nThis is home to Java Halu Coffee, run by Rani Mayasari.\n\n\n\n\n\nAt her booth in Jakarta, she beams with pride.\n\n\n\n\n\nIt’s taken 15 years to build her farm, empower women, and make it here.\n\n\n\n\n\nAnd now, she’s sharing Indonesia’s story with the world.\n\n\n\n\n\n\"It's proof that maybe our world is more better. It's our hope in the coffee industry, our hope, our economy, our politics more better in next year. It's like a medicine for us. It's like a painkiller for us, you know? Because a lot of effort that we already doing in 15 years. So it's like a good food, healthy food, or soulful food maybe for us. So our soul happy, our body happy, so we can make it in these three days.\"\n\n\n\n\n\nShe says serving her first harvest to international buyers is more than a sale, it’s a celebration of identity, resilience, and the soulful joy of good coffee.\n\n\n\n\n\nYoung coffee lovers, too, are finding inspiration here.\n\n\n\n\n\nAmong them, 18-year-old Jamie Elijah Yauw.\n\n\n\n\n\nHe’s just graduated high school but already dreams of joining the industry.\n\n\n\n\n\n“I think every step of the way at the industry is amazing. It's beautiful, it's inspiring, and to be here, meeting people who’ve worked with farmers, meeting people who make the tools we use every day, meeting people explain how they roast their coffee and seeing the effort that people put, or see how much they love, how much they put their whole life into coffee, is so inspiring. Where for me to see people like that, it's just making me awestruck, really.”\n\n\n\n\n\nAnd then, the grand finale, the World Brewers Cup 2025.\n\n\n\n\n\nAfter three days of intense competition, China’s George Jinyang Peng emerged as this year’s champion.\n\n\n\n\n\n\"I feel so very excited and very happy, and maybe a little bit shocked.\"\n\n\n\n\n\nWith over 50 participants and more on the horizon, the competition mirrors the fast-growing specialty coffee market, especially in producing nations like Indonesia, Brazil, and Vietnam.\n\n\n\n\n\nAccording to the Food and Agriculture Organisation, the global coffee industry now generates more than $200 billion in annual revenue.\n\n\n\n\n\nIn 2024 alone, the price of Arabica surged by 58 per cent.\n\n\n\n\n\nAnd with growing interest in transparency, sustainability, and quality, events like World of Coffee Jakarta are redefining the bean, not just as a drink, but as a story.\n\n\n\n\n\nFor Indonesia, that story is just beginning.\n\n\n\n\n\nAnd it smells like a fresh brew of national pride and global respect.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-new-move-to-expose-the-insidious-tactics-of-australias-cults/7f32xq8pv",
        "title": "The new move to expose the insidious tactics of Australia's cults",
        "publish_date": "Sat, 24 May 2025 20:32:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points A committee will oversee an 'inquiry into the recruitment methods and impacts of cults and organised fringe groups'.\n\nIt will look at groups using techniques that harm people emotionally, psychologically, financially, or physically.\n\nSome groups are using coercion techniques and the inquiry will consider whether this should be criminalised.\n\nTore Klevjer has seen the destruction done to the lives of many people who have become part of a cult in Australia.\n\n\n\n\n\nThe president of Cult Information and Family Support Australia is hoping an inquiry into the tactics of cults and fringe groups will bring awareness of the harm such groups are causing and drive change to hold the groups accountable.\n\n\n\n\n\nA Victorian parliamentary committee will oversee the inquiry into the recruitment methods and impacts of cults and organised fringe groups.\n\n\n\n\n\nThe investigation, which is currently taking public submissions, may have a focus on activities in Victoria, but Klevjer said many of the groups that are likely to be analysed operate in much the same way across the country.\n\n\n\n\n\n\n\nElla George, the chair of the Legislative Assembly Legal and Social Issues Committee overseeing the inquiry, said it was \"not about judging or questioning anyone’s beliefs, religious or otherwise\".\n\n\n\nCult Information and Family Support Australia president Tore Klevjer wants those impacted by the practices of cults in Australia to have recourse for the treatment they are subjected to. Source: Supplied The inquiry's guidance notes state its focus will be \"those groups that use techniques that can harm individuals emotionally, psychologically, financially, or even physically\".\n\n\n\n\n\nIt aims \"to understand whether current laws are strong enough to deal with groups that use manipulation or control in ways that can seriously hurt people\".\n\n\n\n\n\nGeorge said in her statement announcing the inquiry that \"recent events in the state\" had led to the probe, but did not detail which groups such events involved.\n\n\n\n\n\nA number of Australian news outlets have reported accounts from former members of groups such as Shincheonji and Geelong Revival Centre, who have spoken about alleged coercion and the negative impacts their involvement with those groups had on their lives.\n\n\n\nThe harm caused by cults\n\nWhile Australians have freedom of religion, the guidance notes for the inquiry state: \"Religious freedom does not grant a licence to cause harm.\"\n\n\n\n\n\nThere is no legal definition of a cult in Australia, but for the purpose of the inquiry, the reference is to groups that use manipulative or controlling tactics to dominate members.\n\n\n\n\n\nGeorge said some groups use \"practices that can cause significant emotional, psychological, financial, or even physical harm\".\n\n\n\n\n\n\"There are legitimate concerns about the techniques being used by certain groups to attract and retain members, and whether they amount to coercion that should be criminalised,\" George said.\n\n\n\nKlevjer said he saw some of the biggest impacts on young people, who some of these groups often tried to sign up.\n\n\n\n\n\n\"It pulls their families apart, a lot of times they quit their education, their uni degree, and when they finally leave, quite often, after three or four years, they've got to start again so they're left behind from their peers, their study and their opportunities,\" he said.\n\n\n\n\n\n\"It disrupts their families as well, because they're taught to lie to their parents and to their family. \"It's very disruptive, and it breaks down a lot of trust.\"\n\n\n\nStatus of such groups\n\nKlevjer said many of the groups that may be considered cults or fringe groups are registered charities in Australia.\n\n\n\n\n\nKlevjer said he would like to see all tax-exempt charities be compelled to make their financial reports publicly available in order for them to demonstrate that funds were being used for \"genuine\" charitable purposes.\n\n\n\n\n\nHe said if the groups themselves were not registered charities: \"A lot of cults will have a front organisation as charitable status, and that's where it gets a little bit tricky, too, because a lot of these groups do have different names in different front organisations.\"\n\n\n\nRecruitment and control\n\nThe use of front groups to mask a group's true nature is listed in the inquiry's guidance notes as one of the tactics used by cults and front groups to recruit new members that may be looked at.\n\n\n\n\n\nOther possible tactics that could be considered include 'love bombing', where new recruits are overwhelmed with affection, praise, and attention to create emotional bonds as well as isolating recruits from outside influences and overwhelming them with group activities or doctrine and framing dissenters as toxic or unenlightened.\n\n\n\nREAD MORE Ruth was born into a cult. She reveals the sly tactics used to lure in victims\n\nOther possible methods used by cults to control members have also been outlined for those considering making a submission.\n\n\n\n\n\nThese include the use of controlling leadership that demands obedience, loss of personal autonomy as members are encouraged to focus fully on a group’s mission, secrecy, deception and emotional and psychological manipulation.\n\n\n\nAddressing the issues around cults\n\nKlevjer said people who feel they have been poorly treated by such groups usually have little recourse and he wanted to see this changed.\n\n\n\n\n\nHe proposes that religious or ideological organisations should have to publish a statement of faith or belief practices to clearly outline their core doctrines, expectations of members, and any practices that may significantly impact individual autonomy or well-being.\n\n\n\n\n\n\"If an organisation is found to have withheld or misrepresented its beliefs in a way that leads to harm, individuals should have legal recourse, similar to protections against deceptive conduct under consumer protection laws,\" Klevjer said.\n\n\n\nIt's understood some groups that are considered cults use the pretext of bible study as a way to bring in new members but fail to fully explain who the group is and what being part of the group will involve. Source: Getty / fstop123 He said often when cults were accused of certain behaviour such as coercion, misrepresentation, or what he referred to as \"personal abuses\" the \"the cult can just turn around, as they often do, and Just say, well, it wasn't our teaching, that was just the leadership you were under at the time, and then just hang someone else out to dry\".\n\n\n\n\n\nHe also wants to see coercive control laws extended beyond domestic relationships to include cases involving such groups.\n\n\n\n\n\nThe Rationalist Society of Australia (RSA) wrote to all states and territories in December, urging them to address coercive control in cults.\n\n\n\n\n\nRSA executive director Si Gladman sent a letter to attorneys-general that said religious cults posed a great danger to the fundamental rights and freedoms of many Australians.\n\n\n\n\n\nGladman wrote that \"numerous survivors of cult groups\", including the Geelong Revival Centre and Shincheonji Church, were \"bravely speaking out about the coercive practices and harm they have been subjected to\".\n\n\n\n\n\n\"These practices are at odds with fundamental human rights norms. Yet, they are all commonplace in certain sections of Australian society.\n\n\n\n\n\n\"Clearly, religious cults pose a great danger to the fundamental rights and freedoms of many Australians.\"\n\n\n\nREAD MORE My daughter has joined a cult. I have no idea how to get her out\n\nGeorge acknowledged upon the announcement of the inquiry that coercive control laws were to be considered as part of the investigation.\n\n\n\n\n\n\"There are legitimate concerns about the techniques being used by certain groups to attract and retain members, and whether they amount to coercion that should be criminalised.\"\n\n\n\n\n\nPublic submissions will be taken until the end of July, and members of the public can also provide input through an online, anonymous questionnaire, with public hearings expected to follow.\n\n\n\n\n\nThe committee is expected to provide its report by the end of September 2026.\n\n\n\n\n\nShincheonji's Melbourne chapter and the Geelong Revival Church have been contacted for comment.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/matildas-womens-asian-champions-league-finals-arsenal-melbourne-city/wofovheff",
        "title": "Biggest night since 2023 World Cup fever as nine Matildas set for Champions League finals",
        "publish_date": "Sat, 24 May 2025 07:08:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Set your alarms and prep the coffee — Australian women's football is about to have one of its biggest nights since Matilda fever gripped the nation during the 2023 Women's World Cup.\n\n\n\n\n\nAcross two cities, nine Matildas players will be taking part in what's set to be a big night of women's football as two teams compete in the Champions League finals.\n\n\n\n\n\nThe first match will start on Saturday night at 10pm AEST, where Melbourne City will face Wuhan Jiangda in the final of the first full Women's Asian Champions League tournament.\n\n\n\n\n\nSix Australians — including current Matildas Holly McNamara, Bryleeh Henry and Leah Davidson, plus Laura Hughes, Karly Roestbakken and veteran keeper Melissa Barbieri — will be chasing the title and a slice of the $2 million prize pool.\n\n\n\n\n\n\"It's so exciting, for it to be the first structured Asian Women's Champions League,\" McNamara told AAP.\n\n\n\nREAD MORE I was a Matilda when we played in front of 50 people and had to pay for our hotels and flights\n\n\"To get all the way to the final as an Australian team is a really good credit to us, and it's something that we've been working towards as soon as we found out about the competition.\n\n\n\n\n\n\"Obviously, playing for your country is such a huge milestone, so those games were pretty big in my career. But in terms of club, this is the biggest game by far.\"\n\n\n\nAustralians look to grasp European Champions League trophy\n\nThen, four hours later at 2am AEST Sunday morning, three of the Matildas' biggest stars — Steph Catley, Caitlin Foord and Kyra Cooney-Cross — will run out in the European Women's Champions League final.\n\n\n\n\n\nTheir club, Arsenal, is aiming to upset reigning champions Barcelona in front of a packed crowd in Lisbon.\n\n\n\n\n\nIf Barcelona is successful, it would be their third consecutive championship win.\n\n\n\n\n\nMeanwhile, underdogs Arsenal are hoping for an upset and are vying to win their second-ever European title.\n\n\n\nSteph Catley (centre) and Kyra Cooney-Cross (right) of Arsenal hope to join the prestigious club of Australian footballers who've won the European Women's Champions League final. Source: AAP / Joel Carrett It's the first time all three women will contest a Champions League final — and they'll be hoping to join the likes of Ellie Carpenter, who is the only Australian woman to lift the trophy after 2020 and 2022 wins with Lyon.\n\n\n\n\n\nThe only other Australian to win the tournament is Harry Kewell, who won the 2005 final of the Men's Champions League with Liverpool.\n\n\n\n\n\nThis week, Ange Postecoglou became the first Australian coach to win a major European football trophy with Tottenham Spurs.\n\n\n\n'Anything can happen'\n\nCatley said Arsenal had \"put ourselves in such an incredible position\".\n\n\n\n\n\n\"A one-off final. Anything can happen, two amazing teams going at it.\"\n\n\n\n\n\n\"It's the best thing about Champions League football. And there's no place I'd rather be.\"\n\n\n\nMatilda player, Steph Catley, has her sights set on winning the Champions League with Arsenal. Source: AAP / Jay Patel \"Obviously, for Australians that follow Arsenal and that follow us, it's a massive occasion.\"\n\n\n\n\n\nCatley said the barriers to Australian women's footballers succeeding on the world stage made the feat even sweeter.\n\n\n\n\n\n\"There is something special about Australians doing well on the world stage, and I think in particular in European football,\" she said.\n\n\n\n\n\n\"Because anyone that knows world football knows how hard it is to be successful over here, especially in the Champions League, and in European competitions in general.\"\n\n\n\nREAD MORE All eyes on the Matildas but it hasn't always been this way\n\n\"Playing in a Champions League final is, along with probably a World Cup final, as high as you can get.\"\n\n\n\n\n\nShe believes it can also inspire young Australian footballers.\n\n\n\n\n\n\"If you see there's three Australians playing in this Champions League final, then it's definitely possible for them,\" Catley said\n\n\n\n\n\n- With reporting by Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/an-elaborate-ruse-the-scam-thats-surging-in-australia-and-how-to-protect-yourself/fxvbsllo7",
        "title": "'An elaborate ruse': The scam that's surging in Australia — and how to protect yourself",
        "publish_date": "Sat, 24 May 2025 03:08:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians looking for work are increasingly being targeted by scammers posing as legitimate employers — and losing money in the process.\n\n\n\n\n\nVictims are tricked into applying for what appears to be a real job by scammers impersonating high-profile companies and recruitment agencies, who then steal their money.\n\n\n\n\n\nJob and employment scams are one of the the fastest-growing scam types in Australia, with the Australian Competition and Consumer Commission (ACCC) tracking a 150 per cent increase in 2023.\n\n\n\n\n\nHere's what these scams look like — and how to avoid them.\n\n\n\nLISTEN TO Job ad scams rising & Donald Trump's market influence SBS News 23/05/2025 12:55 Play\n\nWhat is a job scam?\n\nJob scams come in various forms but ACCC deputy chair Catriona Lowe told SBS that the greatest financial losses were being caused by those in which \"scammers go to quite elaborate lengths to create the illusion of a real job\".\n\n\n\n\n\n\"A person might apply for a job that involves online task-based employment. They might have what seems to be a group chat with other employees. They'll go through a process that looks like a recruitment process,\" she said.\n\n\n\n\n\nScammers then ask for upfront payments to \"unlock\" the income they've promised.\n\n\n\n\n\n\"This is all an elaborate ruse to encourage a person to make small [payments] initially, then big payments to unlock alleged earnings that they've made through performing these tasks.\"\n\n\n\n\"But in fact, it's all an elaborate ruse to obtain those payments, and it's only when a person stops paying that it becomes clear it was all a scam.\"\n\n\n\n\n\nAccording to ScamWatch, the scammers often impersonate well-known recruitment agencies or pretend to be hiring on behalf of high-profile companies and online shopping platforms.\n\n\n\n\n\nThere are also two other types of job scams to watch for:\n\n\n\nBank mule scams : Where victims are unknowingly used to move money through their bank accounts.\n\nFake qualifications: Where victims are encouraged to make payments to receive certifications for jobs that don't exist.\n\n\"There's no job, there's no checks being done. It's just another way, unfortunately, of obtaining money from scam victims,\" Lowe said.\n\n\n\nWhy experts are concerned\n\nJob and employment scams are not only growing rapidly — they also disproportionately target vulnerable job seekers.\n\n\n\n\n\n\"The other dimension of a jobs and employment scam that really makes it such an important candidate for action is, of course, people who are looking for work in difficult economic circumstances are already vulnerable,\" Lowe said.\n\n\n\n\"We see some particularly vulnerable members of our community being disproportionately impacted by this scam.\"\n\n\n\n\n\n\"It might be international students, people on low incomes, people from a culturally and linguistically diverse background, and people that might otherwise find it difficult to secure employment.\"\n\n\n\nHow to protect yourself\n\nThe first step is knowing the warning signs.\n\n\n\n\n\n\"The key one is if you are being asked to pay money to make money, that is a really big red flag that what you're dealing with may, in fact, be a scam,\" Lowe said.\n\n\n\n\n\nShe also advises being suspicious of unsolicited contact.\n\n\n\n\n\n\"That could be a text message. It could be a WhatsApp message or someone reaching out unexpectedly,\" Lowe said. \"That's a sign to be on your guard about the message that you've received.\"\n\n\n\nOther red flags include:\n\n\n\nOffers that promise \"substantial returns for relatively simple work\".\n\nMessages claiming to be from \"high-profile, well-known recruitment businesses\".\n\n\"If you think it could be a legitimate offer or opportunity, the very best thing to do is to independently check.\"\n\n\n\n\n\n\"Don't click on links, don't call the numbers that might be in that message. Go to that company's website or separately find their phone number and make sure that what you are dealing with is legit\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-experiencing-the-hajj/1nov3u8vk",
        "title": "INTERVIEW: Experiencing the Hajj",
        "publish_date": "Fri, 23 May 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cows-dead-on-beaches-beehives-destroyed-locals-numb-after-nsw-flood-devastation/kh34rxr6x",
        "title": "Cows dead on beaches, beehives destroyed: Locals 'numb' after NSW flood devastation",
        "publish_date": "Fri, 23 May 2025 21:19:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in parts of the NSW mid-north coast were met with a shocking scene as dead cattle beneath debris washed up on beaches after being swept away in raging floodwaters.\n\n\n\n\n\nHeavy machinery is removing them from the sand, in a heartbreaking picture of what’s been lost in floods that have decimated the region this week.\n\n\n\n\n\nIt’s expected many more dead animals will be discovered as floodwaters recede further and the true toll is laid bare.\n\n\n\nREAD MORE NSW expected to face 'powerful' cold front with damaging winds after rain and floods\n\nFifth-generation dairy farmer James Neal from Oxley Island, just east of Taree, told SBS he knew of nearly a hundred local dairy farmers impacted.\n\n\n\n\n\n\"It's such a desperate situation, unprecedented in that any plan you had just went straight out the window,\" said.\n\n\n\n\n\n\"It’s been really stressful for everyone involved.\n\n\n\n\n\n\"This is going to take a huge mental toll on farmers for sure. It's upsetting.\"\n\n\n\nFarmers tried to move cattle to higher ground through raging floodwaters by foot and canoe. Source: Supplied / Laura Polson Emotions are still raw as the community grapples with the distressing loss of both animals and property.\n\n\n\n\n\nNeal was one of hundreds who also had to be rescued when water rose rapidly on Tuesday night, catching many off guard.\n\n\n\n\n\n\"I had to get rescued at our own house and there were so many calls, SES was so under the pump,\" he said.\n\n\n\n\n\n\"We had a friend rescue us and some other people up to their waist in water sitting on a table.\n\n\n\n\n\n\"All our houses for our staff went under water as well.\"\n\n\n\nDairy farmer James Neal spoke to SBS over Zoom as he remained cut off by floodwaters on Oxley Island. Source: SBS News Neal said many farmers in the area made contingency plans for moving stock to higher ground after major flooding in 2021, but those areas were under water by half a metre this week.\n\n\n\n\n\n\"In 2021, we had a flood that was recognised as one in 100. This year they're saying this is a one-in-500-year flood because all those areas that were normally flood-free are not flood-free anymore,\" Neal said.\n\n\n\n\n\n\"Cows just got washed away and basically got caught on fences. I've got heaps of photos of stock that has washed up and they're not even local ones, they've come from upriver where obviously people thought they were on flood free paddocks and they just weren't.\"\n\n\n\nAccording to WeatherZone, Oxley Island received 279 millimetres of rain on Tuesday alone, 500 millimetres over three days — equivalent to eight months’ worth of rain.\n\n\n\n\n\nNeal said they weren’t warned of the severity of the weather event, and modelling didn’t reflect how much rain ultimately came.\n\n\n\n\n\nHe and many more on the island have been isolated for days without power and struggling to tend to their livestock that have survived with feed washed away and equipment destroyed.\n\n\n\nLaura Polson feeding a calf as she stayed with her isolated property during flooding on Oxley Island. Source: Supplied / Laura Polson According to Neal, dairy cows also need to be milked every 24 hours, but that is proving a nearly impossible task in current conditions.\n\n\n\n\n\nLaura Polson, part of one of Oxley Island’s biggest dairy farming families, has also been isolated on her property, trying to keep animals alive.\n\n\n\n\n\n\"Sadly, a lot of calves have been lost but we were able to hoist this white calf up out of the water and have been feeding it bread, milk and weet-bix,\" she told SBS on Thursday.\n\n\n\n\n\n\"My dad, brother and sister have made huge efforts to protect our cows and calves on other parts of the island but it’s unknown how those cows are doing.\"\n\n\n\nA calf taking shelter on the veranda of Laura Polson's home as floodwaters raged around it on Thursday. Source: Supplied / Laura Polson\n\n'A few bad years now'\n\nCommercial beekeeper Colin Broos keeps hundreds of hives on Oxley Island and says he’s lost most of them in the flood.\n\n\n\n\n\n\"Pretty devastating. I've lost 40 to 50 per cent of my income. Just like that, gone.\"\n\n\n\n\n\n\"We had the droughts in 2019, we were all affected by bushfires, lost hives there, a lot of people did. Then we had the floods in ‘21, then we had Varroa Mite, and now we've got this. It's pretty tough.\"\n\n\n\nHe was ferried across flooded pastures on a friend’s boat to assess the damage to his hives.\n\n\n\n\n\n\"This is next level. We did not expect this. There were no warnings … nobody knew how bad this was going to get. It’s taken us by completely by surprise.\"\n\n\n\n\n\n\"We’re a bit numb at the moment actually.\"\n\n\n\nCommercial beekeeper Colin Broos says he doesn't know how his business will bounce back after more than 120 of his hives are washed away in the flood. Source: SBS News Other Oxley Island farmers like Lee Fieldhouse say it’s going to be a “tough winter” for everyone in the area.\n\n\n\n\n\n\"From an animal perspective, the pastures are in trouble and a lot of hay has been lost, the soil has been lost as well,\" Fieldhouse said.\n\n\n\n\n\n\"Because [the flood] is so late, it'll take a very long time to dry out this time of year.\n\n\n\n\n\n\"There's going to be a lot of people that have lost everything.\"\n\n\n\nLee Fieldhouse among locals using boats to get to their friends and neighbours, for rescues and to deliver supplies. Source: SBS News He has been reaching isolated friends by canoe, delivering supplies to keep spirits up.\n\n\n\n\n\n\"I've done the bread and milk run and beer and ciggies. All the essentials.\"\n\n\n\nLocals 'cut off' from medical care\n\nSherinah Peck is one of likely hundreds of people whose homes have been completely flooded and who have lost nearly everything.\n\n\n\n\n\nAlready facing the challenge of rebuilding a destroyed home, Peck was injured by a distressed cow while searching the beach for missing belongings that washed away during the flood.\n\n\n\nShe had to travel two hours south to hospital in Newcastle with a suspected broken leg, because the nearest public hospital in Taree was still cut off by floodwater.\n\n\n\n\n\n\"Taree is only 15 minutes away from where I live but I couldn’t get to that hospital,\" Peck said.\n\n\n\n\n\n\"I have to have surgery… for them to put in a plate and screws.\"\n\n\n\n\n\nThe lack of a public hospital in Forster-Tuncurry has been the subject of debate for several years.\n\n\n\nOn Friday, locals on Oxley Island continued using boats to rescue and assist residents still stranded by floodwaters. Source: SBS News On Tuesday, local member Tanya Thompson told SBS it was a serious problem.\n\n\n\n\n\n\"I called on the premier to do a stand up hospital in Forster because people in that area don’t have access to public health at the moment, that’s a concern,\" Thompson said.\n\n\n\n\n\n\"If something happens, where do they go? Our paramedics are stretched. We’re in a whole world of pain here.\n\n\n\n\n\n\"We don’t want any further trauma here; we are already traumatised enough.\"\n\n\n\nSherinah Peck suffered a leg injury after an encounter with a distressed cow on the beach. Source: Supplied\n\nSearching for lost items\n\nPeck has appealed to her community to look out for things that have been washed from her home, including one with deep sentimental value.\n\n\n\n\n\n\"I am after one particular item, that means the world to me and that’s my mum’s bike if anyone finds that I’ll be so grateful,\" she said.\n\n\n\n\n\n\"Her bike – Betsy – was everything.\"\n\n\n\n\n\nMany others have lost everything, and donations have begun to pour in to support those in need.\n\n\n\n\n\nFour people have died in the flooding disaster.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/could-australia-become-a-coffee-growing-nation/c65q6j5sk",
        "title": "Could Australia become a coffee-growing nation?",
        "publish_date": "Fri, 23 May 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe coffee’s steaming hot at the Happy Frog café in Coffs Harbour in northern NSW.\n\n\n\n\n\nThis cup is one of six billion consumed nationwide each year, according to Agrifutures Australia.\n\n\n\n\n\nUnlike most, this one is made with locally grown beans.\n\n\n\n\n\nThe cafe’s owner is Kim Towner:\n\n\n\n\n\n“That's been a real passion of mine since I first went into the cafe business, was to buy as close to home as I could. And it's just a win-win all round for everybody, I think. It's beautiful coffee. We get to know the people that have grown it. And that has been probably my biggest, favouritest thing. But of course it's got the low food miles, so it's good for the environment. I know its story.”\n\n\n\n\n\nAustralia grows less than half a percent of all the coffee we drink.\n\n\n\n\n\nProducing more sounds a great idea, but is it worth the effort?\n\n\n\n\n\nAt Southern Cross University in Lismore, Professor Tobias Kretzschmar is finding out by trialling new trees.\n\n\n\n\n\n“So we're part of a larger project with the World Coffee Research. They're interested in trialling 20 to 30 coffee varieties all around the globe. So we piggybacked on that global project to be able to trial those varieties in Australia. And our aim for Australia is to find new varieties that are better suited for this environment and better suited for the mechanized conditions of coffee farming in Australia.”\n\n\n\n\n\nMost Australian coffee grows in Queensland or northern New South Wales where farmers face climate challenges.\n\n\n\n\n\n“They put their money on a variety that's much too vigorous for this environment. So we're looking at something that's semi-dwarf, easy to be machine harvested. So the next stage would be to take the two to three varieties that we're thinking will out-compete the current varieties and trial them at scale.”\n\n\n\n\n\nGlobally, coffee exports spiked recently after a run of falls and prices remained volatile due to trade tensions and fears of economic slowdown.\n\n\n\n\n\nPaul Joules is a research analyst with Rabobank.\n\n\n\n\n\n“In April we did see Arabica prices ease slightly but nonetheless on a year-on-year basis we're still around 100% higher.”\n\n\n\n\n\nAnd that means ever-rising prices at the coffee shop. So could Australia ever compete with Brazil or Colombia?\n\n\n\n\n\nProfessor Tobias Kretzschmar again:\n\n\n\n\n\n“We’re covering around half a percent of what the Australian consumer is drinking at the moment. If we can double that, that'd be fantastic. If we can triple or quadruple that, we'd be punching above our weight.”\n\n\n\n\n\nIt’s also about finding a coffee style with broad appeal. For clues, scientists have turned to a unique taste wheel which helps analyse the makeup of a particular taste.\n\n\n\n\n\nDr Ben Liu is behind the taste wheel.\n\n\n\n\n\n“First we actually have this coffee tasting by different professionals. They work in the coffee industry for decades. And then we actually collect a different type of data from them and from description from them. And then we summarise them with also some of the score for the taste and the flavour of the coffee. And then we bring the exact same sample they taste back to our lab and do carry out analysis. And so we can associate the data from the chemistry also to the taste and the smell of the coffee.”\n\n\n\n\n\nThe taste wheel doesn’t just identify the flavour of the coffee, but its character as well and uses words as diverse as ‘yoghurty’, ‘apple like’ and even dirty.\n\n\n\n\n\n“ So this coffee character wheel basically helps the panel members to actually get an idea of what they think, what could be used to describe the taste, the flavour, or a different mouthfeel they actually feel. But saying that there are some bad words there because there are also some bad taste coffee there. Unfortunately, during our coffee research, (we not just taste the best coffee, we also taste bad coffee as well.”\n\n\n\n\n\nBut Dr Liu says Australian grown coffee does have some common characteristics:\n\n\n\n\n\n“We collect 100 single-origin coffee around Australian farmers. And when we run this tasting panel, the words that keep coming out for Australian coffee are they are sweet and they are fruity and they are nutty and roasty. So that's the thing that's coming up the most for Australian coffee.”\n\n\n\n\n\nFor Kim Towner, the decision to use locally grown coffee was simple.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-search-for-australias-stillborn-babies/6e2a7dj5c",
        "title": "'Mass graves': Why thousands of families are still searching for their stillborn babies",
        "publish_date": "Fri, 23 May 2025 20:34:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a woman knocked on Geoffrey Horlock's door and told him that her baby brother had been buried in the same grave plot as his own brother, he was more than a little surprised.\n\n\n\n\n\n\"I was not sure what to say at first,\" Horlock says.\n\n\n\n\n\nHis brother Andrew had been stillborn in 1960. Horlock was around nine at the time.\n\n\n\n\n\nHe recalls his mother telling him about how his brother was taken out of the delivery room in a white sheet and buried in the local cemetery while she was still recovering in hospital.\n\n\n\n\n\nThis is how infant loss was often dealt with in the 1960s.\n\n\n\n\"Mum never got over it,\" Horlock says.\n\n\n\nRight until the day she died, she always used to say: 'I wonder which side of the family he looked like.'\n\nThe family was issued a birth certificate and told about the burial site.\n\n\n\n\n\nBut this was not always the case.\n\n\n\n\n\nFor the Harding family, whose baby died less than three weeks after the Horlocks' in the same regional Western Australian town, no birth certificate was issued.\n\n\n\n\n\nUnlike baby Horlock, baby Harding was live-born but arrived prematurely and tragically did not survive.\n\n\n\n\n\nUnbeknownst to both families, he was buried alongside baby Horlock in the lower part of his grave plot in August 1960.\n\n\n\n\n\nIt wasn’t until baby Harding’s older sister, Susan Mead, showed up on Geoffrey Horlock's doorstep some 65 years later that the connection was finally made.\n\n\n\nSusan Mead tracked down one of the siblings of Andrew Horlock, whose grave her baby brother shares, to another small town near where she lives. Source: Supplied She had come to ask whether she could place a marking on the grave to recognise her brother.\n\n\n\n\n\nHorlock says once the initial shock passed, he realised there was only one answer.\n\n\n\nFinding Baby Harding\n\nMead lives on a property in the south-west of WA, about 65km east of the small town of Bridgetown where her mother gave birth to baby Harding. Mead and her siblings had spent decades hoping to find their baby brother’s resting place.\n\n\n\n\n\nBut without formal documentation, such as a birth or death certificate, their efforts to find him were continually stymied.\n\n\n\n\n\nFinally, in March, they reached a turning point.\n\n\n\n\n\nMead's sister-in-law spotted a Facebook post from the Shire of Bridgetown-Greenbushes, about records for the nearby Bridgetown Cemetery having been uploaded to its website.\n\n\n\n\n\nLooking over the shire's list of people buried there, Mead came across a mention of a 'Baby Harding'. That name had not been included in previous searchable listings for the cemetery.\n\n\n\n\n\nIt identified the exact location of the grave, too, but when family members went to visit, they found a gravestone for baby Horlock instead.\n\n\n\n\n\nConfused, the family contacted Bridgetown-Greenbushes Shire, which manages the cemetery. They confirmed that baby Harding is also buried in the plot, which, according to records, had been divided in two — a practice that the local government has since ceased.\n\n\n\nIn a statement to SBS News, a spokesperson for the shire acknowledged the challenges with historical burial records for stillbirths and neonatal deaths, noting it is \"currently completing an audit and correlation of hardcopy documents, current headstones and electronic records\" to ensure it has a fully digitised and accurate record of all listings.\n\n\n\n\n\nThe spokesperson says the shire is aware of one other case in which two unrelated babies were buried in the same plot, dating back to 1954. In that case, two stillborn babies were buried in the same plot eight weeks apart, despite records showing it was not listed as a 'half plot'.\n\n\n\n\n\n\"The Shire is committed to ensuring this information is researched and updated so that descendant family members can search for and locate loved ones,\" the spokesperson says.\n\n\n\nA taboo subject\n\nMany families who lost babies as a result of stillbirth or neonatal death before the 1980s in Australia remain in the dark about their loved one’s final resting place.\n\n\n\n\n\nJoan Noonan is a volunteer co-leader with a group set up by Red Nose Australia, which seeks to prevent the sudden and unexpected death of babies and young children and gives bereavement support for those affected by death of a baby or young child. Its 'Older Loss Group' supports mothers who are still processing the grief of stillbirth years after losing a child.\n\n\n\n\n\nOne of the key aims of the group, which is based in Victoria, is to help families in tracking down burial sites.\n\n\n\n\n\nNoonan says many families search for the final resting place of their stillborn family members in the hope of finding some peace.\n\n\n\n\n\nThe 78-year-old became part of the Older Loss Group about 30 years ago, having lost two infant daughters of her own in the 1970s.\n\n\n\nJoan Noonan, (pictured far right) has helped many women, including Lee (second from left), to find their baby's burial site, years after their loss. Source: Supplied / Red Nose Australia \"In most cases, you weren't given a chance to have a funeral,\" she says.\n\n\n\n\n\n\"The hospital staff would say they were 'looking after these babies', and the hospital would arrange burial and families weren't even told where they were buried.\"\n\n\n\n\n\nNoonan says at that time, it was not the \"done thing\" to question the process. Stillbirth was treated as taboo.\n\n\n\nNobody talked about the death of a baby.\n\n\"In the majority of cases, they were buried in communal graves, they often waited for about 10 babies at a time and there's some places in Melbourne where there's hundreds of babies buried in mass graves.\"\n\n\n\n\n\nNoonan’s volunteer co-lead, Fotini Koklas, says given most babies they have located via the Older Loss Group are in mass graves, the situation involving the Hardings and the Horlocks appears to be \"extremely rare\".\n\n\n\n\n\nKoklas has come across one similar case in which a baby was buried in a grave with an unrelated adult, with no clear explanation as to why this happened.\n\n\n\n\n\n\"It's possible that it was a space issue, or perhaps the cemetery simply didn't know where to place the baby,\" she says.\n\n\n\nCo-leader of Red Nose Australia's Older Loss Group, Fotini Koklas, says while the process of finding a baby’s final resting place should be a healing journey, unnecessary obstacles can make it more emotionally draining than it should be. Source: Supplied\n\nIn search of lost babies\n\nUntil this year, baby Harding's name would have only have been traceable via handwritten records stored in a very specific location by the Bridgetown-Greenbushes shire.\n\n\n\n\n\nKoklas says because of state-based variations in laws, record systems and how stillbirths are handled, it can be incredibly challenging for families to track down accurate information.\n\n\n\n\n\n\"Every cemetery is different, and the level of detail they have in their historical records varies greatly,\" she says.\n\n\n\nHistorically, different stakeholders that may have details that could help families were very siloed from one another.\n\n\n\n\n\n\"There's often a breakdown in communication between cemeteries, stonemasons, and families, in some cases, critical details aren't shared — either because of incomplete records or administrative oversights.\"\n\n\n\n\n\nKoklas says the passage of time complicates the process further.\n\n\n\n\n\n\"Over the decades, cemetery management has often changed hands, record-keeping systems have evolved, and unfortunately, some older records have been lost, damaged, or simply never kept in the first place — especially for babies born before the 1980s.\"\n\n\n\nInconsistent records\n\nInaccurate and inconsistent historical records present an added hurdle for those searching for answers.\n\n\n\n\n\nKoklas explains that naming stillborn babies was subject to variation: they could be recorded with their mother's maiden name or married name, or referred to as names such as: \"Baby Smith,\" \"Stillborn Smith,\" or \"Baby of Kate Smith\".\n\n\n\nLISTEN TO \"I found it to be really lonely': Data show parents often silent after miscarriage or stillbirth SBS News 13/10/2023 04:38 Play\n\n\"While families can sometimes search online for burial records, the transition from handwritten paper records to digital systems has introduced a number of issues,\" she says.\n\n\n\n\n\n\"Dates are often misrecorded due to difficulties in reading old handwriting.\n\n\n\n\n\n\"In one case, a baby who passed away in April 1966 was entered into the system as April 1968.\"\n\n\n\n\n\nNoonan says despite such challenges, it's often still possible to piece information together by cross-referencing available records, contacting multiple sources and a bit of compassionate persistence.\n\n\n\n\n\n\"We've developed some records now that show in Victoria what hospitals used what undertakers and then what cemeteries they used and things like that,\" she says.\n\n\n\n'Something to be forgotten'\n\nIn years gone by, a birth may not have even been considered a birth if the baby was stillborn, so no birth or death certificate was issued. This also meant that protocols around burial fell outside of legal requirements.\n\n\n\nSource: SBS News The statutory instruments and registration practices related to births and perinatal deaths — which include stillbirths and neonatal deaths — have varied between Australian states and territories over the years.\n\n\n\n\n\nFor example, in Queensland and Victoria, legislation around the registration of stillbirths came into place in 1989, while in NSW it was a 1995 Act that recognised stillbirth as a birth and therefore required formal registration.\n\n\n\n\n\nAssociate professor Fran Boyle from the University of Queensland's Institute for Social Science Research and Stillbirth Centre of Research Excellence says it was not until the mid-1980s that social attitudes toward perinatal deaths began to change.\n\n\n\n\n\n\"This was largely due to the voices of bereaved parents,\" she explains.\n\n\n\n\n\nParent advocacy groups under the banner of Stillbirth and Neonatal Death Society (SANDS) — now part of Red Nose — were formed.\n\n\n\n\n\n\"One of their many important achievements was the successful campaign for government to recognise stillborn babies through birth and death certificates,\" Boyle says.\n\n\n\n\n\nToday, across Australia, a stillborn baby at 20 weeks gestation or more is required to be registered, in most states and territories that will warrant a birth certificate, noting stillbirth.\n\n\n\nSource: SBS News Boyle says burial practices tend to reflect the \"prevailing social norm\" of the time, and before the 80s \"the loss of a baby was something to be forgotten\".\n\n\n\n\n\n\"[It was] not something to be discussed or memorialised.\"\n\n\n\nLiving with the trauma\n\nBoyle says such sentiment informed the practice of withholding stillborn babies from their mothers.\n\n\n\n\n\nMany were never given the chance to look at or hold their children.\n\n\n\n\n\n\"The widely held view was that parents needed to be protected, that seeing their baby, having contact with their baby, creating memories of any kind would be harmful, and intensify and prolong their grief,\" Boyle says.\n\n\n\n\n\nHorlock still remembers his mother returning from hospital after giving birth without his baby brother.\n\n\n\nGeoffrey Horlock's recalls how his mother was deeply impacted by not only the loss of her baby, but by the process around the loss in not being able to hold her baby or say goodbye. Source: Supplied He says she spent days sitting by the wood fire stove in their kitchen, just staring at the fire.\n\n\n\n\n\n\"Mum was distressed about it and it troubled her her whole life,\" he says.\n\n\n\n\n\nMuch has changed since laws recognising the births of stillborn babies were strengthened.\n\n\n\n\n\nThe national Care Around Stillbirth and Neonatal Death guidelines, updated in 2024, cover best practice for stillbirth and recommend offering all parents the opportunity to see and hold their baby immediately after birth and allowing them to interact with their baby through activities such as bathing and dressing them.\n\n\n\n\n\nKoklas has seen the benefit of these changes firsthand. As well as being involved in helping to find baby graves, she is a bereaved mum. Her two baby boys died in 2011 and 2016.\n\n\n\n\n\n\"I am so grateful I got to hold my babies, name them and make funeral arrangements for them,\" she says.\n\n\n\nA healing process\n\nFor those who lost children in decades gone by, the hope of finding their graves remains.\n\n\n\n\n\nKoklas says every family she has supported to locate their baby has shared a similar feeling: a deep sense of peace and closure.\n\n\n\n\n\n\"Finding a baby's final resting place is one of the most healing and powerful experiences … it's something that goes beyond words, like a heavy weight being lifted.\n\n\n\nIt doesn't mean they've 'moved on' — because grief doesn't work that way — but they feel like they can now live again, just a little bit lighter.\n\nSimilarly, Noonan attests to the importance of finding burial sites. She says while the Older Loss Group has helped to locate hundreds of babies, there are still so many more Australian families out there wishing they knew where their babies were.\n\n\n\n\n\nShe encourages anyone needing help in their search to reach out, saying: \"it's never too late\".\n\n\n\nREAD MORE Australia is running out of space to bury people. This may be the alternative\n\nAn investigation of historical practices associated with stillborn babies and perinatal infant loss in Australia before the 1980s has never been undertaken.\n\n\n\n\n\nThe federal attorney-general's department did not respond to questions put by SBS News about whether the government plans to conduct a national investigation or apology into the matter.\n\n\n\n\n\nAt least for Mead and the Harding siblings, there is some long-awaited closure — and the chance to place a commemorative plaque on the plot their baby brother shares with baby Horlock.\n\n\n\n\n\nGeoffrey Horlock says he and his siblings decided to place a headstone on the grave a number of years ago after both their parents had died as a way to honour their mother.\n\n\n\nArrangements are being made to have a plaque placed on the lower part of Andrew Horlock's grave to acknowledge it is also the grave of 'Baby Harding.' Source: Supplied He says his mother would have loved for that to have happened in her lifetime.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/fernwoods-biologically-born-females-rule-and-trans-women/dc2gpvpeb",
        "title": "Fernwood's 'biologically born females' only rule broke Elara's hope for a safe workout space",
        "publish_date": "Fri, 23 May 2025 20:34:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Elara was \"caught off guard\" and \"hurt\" when she was denied entry to the women-only gym Fernwood Fitness for not being a \"biologically born female\".\n\n\n\n\n\nA Melbourne-based transgender woman, Elara was drawn to a club owned by the national gym network because her wife and friends had recommended it. She also generally found women's spaces to be more inclusive and accepting of trans women than mixed spaces.\n\n\n\n\n\n\"I think it's a lot easier for trans women in women's spaces, fundamentally,\" Elara told SBS News. \"My experience has been that women's spaces are more accepting.\"\n\n\n\n\n\nBut when she enquired via text message about whether she would be permitted access as a transgender woman, she was told by a manager at Fernwood Fitness in Melbourne that \"the Fernwood company policy is not inclusive of transgender women\".\n\n\n\nElara received a message from a manager at a Melbourne Fernwood Fitness gym, who said only \"biologically born females who identify as female\" could join the women-only gym. Source: Supplied Fernwood Fitness is one of the leading women-only gym chains in Australia. They have over 70 clubs across Australia and over 90,000 members.\n\n\n\n\n\n\"Fernwood offers membership only to biologically born females who identify as female,\" the message, which has been verified by SBS News, read.\n\n\n\n\n\nElara later shared her experience on Reddit, prompting an outpouring of support — and several anonymous accounts from other transgender women who claim they too were turned away by Fernwood.\n\n\n\n\n\n\"I found this out last year when I tried to join,\" one user wrote.\n\n\n\n\n\nAfter the text exchange, Elara said she was phoned by the national CEO of Fernwood, which the company has confirmed.\n\n\n\n\n\n\"I was just flabbergasted,\" Elara said. \"My experience of being a trans woman so far in Melbourne has been that the level of vitriol and pushback and rejection that we expect from watching the news isn't there.\"\n\n\n\n\"I guess I got a little bit forgetful that the world is still like that,\" Elara said.\n\n\n\n\n\n\"It really took me aback and made me think about all the rights that we think we have here ... to just find out that some people can be like, 'nah,' that company policy is to just say no.\"\n\n\n\nIs it legal to exclude trans women from women-only spaces?\n\nThe federal Sex Discrimination Act 1984 makes it unlawful to treat someone unfairly because of their sex, sexual orientation, intersex status, or gender identity.\n\n\n\n\n\nAccording to the Australian Human Rights Commission (AHRC), gender identity includes \"the way people express or present their gender and recognises that a person's gender may be an identity other than male or female\".\n\n\n\n\n\n\"Terms commonly used to describe a person's gender identity include trans, transgender and gender diverse,' AHRC's website reads. \"It does not matter what sex a person was assigned at birth or whether the person has undergone any medical intervention.\"\n\n\n\n\n\nProfessor Paula Gerber, an expert in human rights law at Monash University, said while women-only gyms are lawful both in Victoria and nationwide, excluding trans women is not.\n\n\n\n\n\n\"Fernwood is perfectly entitled to have a women-only gym,\" she told SBS News. \"But women include trans women in Australia.\"\n\n\n\nPaula Gerber, a professor in human rights law at Monash University, said that while women-only gyms are lawful in Australia, excluding trans women from them is not. Source: Getty / Kazuma Seki \"It is not lawful to have a women's only venue and say that's only for people who were described as female on their birth certificate,\" Gerber said.\n\n\n\n\n\n\"The law says trans women are women.\"\n\n\n\n\n\nEvery Australian state and territory has its own anti-discrimination laws that operate alongside federal legislation.\n\n\n\n\n\nIn Victoria, where Elara lives, it's against the law to discriminate against people based on gender identity \"that may or may not be the same as the sex you were designated with at birth\", under the Equal Opportunity Act 2010.\n\n\n\n\n\nBut organisations are permitted to apply for temporary exemptions to the Act, which allows discrimination of any protected characteristics — which include gender identity — to be lawful, provided it would help the Act's goal of promoting equal opportunity.\n\n\n\n\n\n\"For example, some clubs may provide benefits for members of particular age groups or single sex,\" according to the Victorian Equal Opportunity and Human Rights Commission's website.\n\n\n\nFernwood is perfectly entitled to have a women-only gym. But women include trans women in Australia. Paula Gerber, human rights law expert\n\nIn 2021, Fernwood sought an exemption from Queensland's Anti-Discrimination Act 1991, concerned about members' religious freedom and psychological safety, as well as fears that their women-only fitness model \"could give rise to a complaint by a man that Fernwood is directly discriminating against men\".\n\n\n\n\n\nThe commission granted the exemption for five years, saying female-only fitness clubs were a \"welfare\" and \"equal opportunity\" measure.\n\n\n\nIt's unclear on what grounds Fernwood Fitness is excluding trans women, but at present, their publicly available 11-page membership terms and conditions do not reference sex or gender eligibility criteria.\n\n\n\n\n\nAdditionally, they operate under a franchise model, making it difficult to ascertain how widespread their policy is.\n\n\n\n\n\nSBS News has contacted Fernwood for clarification on this issue but has not received a response.\n\n\n\nFernwood defends policy as necessary for 'emotional and physical safety'\n\nIn a statement provided to both SBS News and Elara, Fernwood Fitness said they had \"a responsibility to consider the needs of its broader member community\", adding that female-only spaces \"based on sex\" were necessary to protect members' \"emotional and physical safety\".\n\n\n\n\n\n\"Fernwood Fitness proactively reached out to Elara to acknowledge her as an individual and to talk about her experience,\" the statement provided to SBS News read.\n\n\n\nREAD MORE Government announces federal review into gender-affirming healthcare for young people\n\n\"This outreach was made with genuine care, recognising the personal nature of her enquiry,\" the statement read.\n\n\n\n\n\n\"Fernwood appreciates the courage it can take to enquire about a membership as a transgender woman and acknowledges that the experience may have been hurtful or disappointing. Fernwood Fitness extends its sincere empathy in response.\n\n\n\n\n\n\"At the same time, Fernwood Fitness has a responsibility to consider the needs of its broader member community.\n\n\n\n\n\n\"A significant number of Fernwood Fitness members come from backgrounds where experiences of domestic violence, sexual assault, cultural beliefs, or religious practices necessitate access to female-only spaces based on sex.\n\n\n\n\n\n\"For many of these women, such spaces are not a preference but a requirement for their emotional and physical safety and for accessing the health and fitness services they need.\n\n\n\n\n\n\"This is not a reflection on personal identity, but rather a commitment to maintaining the integrity of a space that many women rely on. Fernwood is currently reviewing all relevant legal requirements.\"\n\n\n\n'Trans women are women', legal expert says\n\nGerber said these arguments may not hold legal weight when used to exclude trans women.\n\n\n\nPaula Gerber, a professor of human rights law at Monash University, said Fernwood's argument may not hold legal weight when used to exclude transgender women. Credit: Paula Gerber \"Women include trans women in Australia — that's very clear from the decision in Tickle and Giggle and the Lesbian Action Group,\" Gerber said.\n\n\n\n\n\nTickle v Giggle was a case centred on transgender woman Roxanne Tickle being denied access to a women-only app, Giggle for Girls. The Federal Court found the app had indirectly discriminated against Tickle based on her gender identity, a breach of the Sex Discrimination Act 1984.\n\n\n\n\n\nThe Federal Court ruled: \"The acceptance that Ms Tickle is correctly described as a woman, reinforcing her gender identity status for the purposes of this proceeding, and therefore for the purposes of bringing her present claim of gender identity discrimination, is legally unimpeachable.\"\n\n\n\nSupporters of Roxanne Tickle hold a sign outside the Federal Court of Australia in April 2024. TERF stands for 'trans-exclusionary radical feminist'. Source: AAP / Bianca De Marchi In 2023, the Lesbian Action Group applied for an exemption from the Sex Discrimination Act to host regular publicly advertised 'lesbians born female only events'.\n\n\n\n\n\nGerber, who acted as an expert witness for the AHRC, said the group argued they needed to be protected from, as she puts it, \"men pretending to be women\".\n\n\n\n\n\nThe commission rejected the application for exemption, saying: \"The commission is not persuaded it is appropriate and reasonable to make distinctions between women based on their biological sex at birth or transgender experience, and to exclude transgender lesbians, from a community event of this kind.\"\n\n\n\n\n\nGerber said: \"The response from the Human Rights Commission and the [Federal Court] tribunal is that the threat is not from trans women. The threat is from men.\"\n\n\n\n\n\nShe said these cases may influence what the law says about Fernwood's exclusion of trans women: \"That's contrary to what the law says — the law says trans women are women.\"\n\n\n\nTrans safety in women's spaces\n\nElara said one of the most upsetting parts of the conversation was the implication that she, as a trans woman, might pose a safety threat.\n\n\n\n\n\n\"People who are saying that we need to exclude trans women for safety aren't really talking about women's safety. They're talking about an ideological position about whether or not trans women are women,\" she said.\n\n\n\n\n\nA spokesperson from Zoe Belle Gender Collective (ZBGC), a trans and gender diverse-led advocacy organisation based in Victoria, told SBS News: \"Trans women and cis women have much in common, including being disproportionately impacted by men's violence.\"\n\n\n\n\n\n\"The same drivers of violence that impact cis women equally drive violence against trans women, including rigid gender norms and dominant forms of masculinity,\" a ZBGC spokesperson said.\n\n\n\nA La Trobe University study found transgender and non-binary people were more likely to experience high psychological distress than cisgender people. Source: SBS News Trans women, trans men and non-binary people were also more likely to experience very high psychological distress compared to cisgender women and men, according to La Trobe University's Private Lives 3 report from 2021.\n\n\n\n\n\nA 2023 survey of 3,099 transgender people conducted by the Trans Justice Project and the Victorian Pride Lobby found one in two participants had experienced anti-trans hate. One in ten had experienced anti-trans violence, and nine in ten had witnessed online anti-trans abuse.\n\n\n\nTrans women and cis women have much in common, including being disproportionately impacted by men's violence. Spokesperson, Zoe Belle Gender Collective\n\nInternationally, a 2021 study by the Williams Institute at the University of California, Los Angeles School of Law found transgender people were over four times more likely to experience violent victimisation than cisgender people, or those whose gender identity corresponds with the sex assigned to them at birth. This included higher rates of violence than both cisgender men and women.\n\n\n\n\n\nMeanwhile, analysis by the Australian Bureau of Statistics found 97 per cent of all sexual assault offenders were male, according to data recorded by police agencies in Australia.\n\n\n\n\n\n\"When incidents of trans exclusion occur, it can reinforce the ideas that we don't belong, that we are not worthy of support, or that the violence perpetuated against our community does not matter,\" a ZBGC spokesperson said.\n\n\n\n\n\n\"These incidents may also contribute to some trans women feeling unsafe to access the services our society has created to support victims of violence.\"\n\n\n\nLISTEN TO 'A really dark place': Chantel is among LGBTIQ+ users fearful of Meta's changes SBS News 22/02/2025 06:45 Play\n\n'Trans women are not a threat'\n\nGerber also warned policies excluding trans women can lead to harmful \"policing\" of women's bodies.\n\n\n\n\n\n\"The privacy that's being violated is trans women having to prove their gender,\" she said.\n\n\n\n\n\n\"We're seeing situations where complete strangers feel entitled to challenge someone's right to be in a space, based solely on how they look.\n\n\n\n\n\n\"This is what we need to avoid.\n\n\n\n\n\n\"If somebody says they’re a woman, then they are a woman.\"\n\n\n\n\n\nShe also questioned traditional narratives that trans women were threats to women's safety.\n\n\n\n\n\n\"Men pretending to be women so that they can get into a women's only gym and assault someone … that's not what trans women are doing,\" Gerber said. \"Trans women are just trying to be themselves and live their authentic life. They're not a threat.\"\n\n\n\n'We thought we were better protected'\n\nGerber said while Australia has some of the strongest legal protections for trans rights in the world, enforcing these laws can involve making an individual complaint to your state's commission.\n\n\n\n\n\n\"It takes a huge toll to take on a big company like Fernwood,\" she said.\n\n\n\n\n\n\"But that's the only way the law gets enforced in these situations where there are breaches of the anti-discrimination provisions.\"\n\n\n\n\n\nFor Elara, the experience has left her feeling disillusioned with the protections she thought were in place.\n\n\n\n\n\n\"I did think we were better protected in Australia … we thought our legal protections were stronger than apparently they are.\n\n\n\n\n\n\"It feels strange when the discrimination paraded in the news contaminates my own life so directly. I wandered into someone's culture war because I wanted to try yoga.\"\n\n\n\n\n\nLGBTIQ+ Australians seeking support with mental health can contact QLife on 1800 184 527 or visit qlife.org.au . ReachOut.com also has a list of support services.\n\n\n\n\n\nIntersex Australians seeking support can visit Intersex Peer Support Australia at isupport.org.au.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/not-at-all-joey-quashes-galvin-plan-20250525-p5m207.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Not at all': Joey quashes Galvin plan",
        "publish_date": "Sun, 25 May 2025 12:08:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Not at all': Joey quashes Galvin plan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/vivid-live-a-triumphant-orchestral-excursion-with-sigur-ros-and-the-sso-20250524-p5m1vb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pop-rock veterans Train deliver a crowd-pleaser with special Sydney surprise",
        "publish_date": "Sun, 25 May 2025 11:52:14 +1000",
        "category": "entertainment",
        "authors": [
            "Rod Yates"
        ],
        "text": "TRAIN\n\nICC Sydney Theatre, May 24\n\nReviewed by ROD YATES\n\n★★★½\n\nSay what you will about American pop-rock veterans Train, but they work hard to get the audience on their side.\n\nIn third song If It’s Love, frontman Pat Monahan pulls out his phone and begins filming the room, asking the crowd to go crazy for the clip he’ll post to Instagram.\n\nDuring an extended Meet Virginia, which gives guitarist Taylor Locke an opportunity to show off his chops, Monahan takes a break from singing to lob Train T-shirts into the masses.\n\nThe cleverly constructed set-list also plays its part with staples such as Hey, Soul Sister, Play That Song, a spirited Save Me, San Francisco and a beautifully tender Marry Me peppered with several moments tailored for the Sydney audience.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/jetstar-planes-flying-again-after-mysterious-gps-fault-20250525-p5m1zh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jetstar planes flying again after mysterious GPS fault",
        "publish_date": "Sun, 25 May 2025 11:47:41 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Jetstar has confirmed that its planes are flying normally again after a mystery glitch related to the global positioning system (GPS) forced delays and cancellations last week.\n\nTwo flights from Australia to Bali were cancelled last week, and others were delayed, after faults in the GPS on Jetstar Airbus A320 Neos and A321 Neos prevented the flights from taking off.\n\nThe airline said it understood “the fault message was caused by a satellite signal issue” that occurred from May 21 to May 23 AEST.\n\nA mystery glitch halted some Jetstar flights last week. Credit: Kate Geraghty\n\n“Currently, this fault is not reoccurring. We continue to monitor closely,” a Jetstar spokesperson said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/djoker-wins-100th-title-20250525-p5m1zu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Djoker wins 100th title",
        "publish_date": "Sun, 25 May 2025 11:13:09 +1000",
        "category": "sports",
        "authors": [],
        "text": "Djoker wins 100th title\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/power-outage-across-cannes-during-film-festival-being-treated-as-sabotage-20250525-p5m1zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Power outage across Cannes during film festival being treated as sabotage",
        "publish_date": "Sun, 25 May 2025 11:11:32 +1000",
        "category": "entertainment",
        "authors": [
            "Aurelien Breeden",
            "Kyle Buchanan"
        ],
        "text": "Paris/Cannes: French authorities say a power outage in the Cannes area in south-eastern France that briefly disrupted the film festival there was caused by acts of sabotage, including arson at a substation and damage to a transmission tower.\n\nAbout 160,000 homes in Cannes and the surrounding area were left without power for hours on Saturday, Cannes time, according to RTE, France’s electrical grid operator, which said service had been fully restored by late afternoon.\n\nThe outage interrupted some screenings at the film festival, which quickly switched over to its own generators.\n\nA shop worker stands at the door during the power outage. Credit: Getty Images\n\nLaurent Hottiaux, the state representative for the Alpes-Maritimes area, which includes Cannes, said the outage was caused by “major damage to network installations” near the city, including the arson attack and damage to the tower.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/billy-joel-cancels-shows-due-to-a-brain-disorder-here-s-what-to-know-20250525-p5m1zd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billy Joel cancels shows due to a brain disorder. Here’s what to know",
        "publish_date": "Sun, 25 May 2025 11:09:51 +1000",
        "category": "lifestyle",
        "authors": [
            "Teddy Amenabar",
            "Richard Sima"
        ],
        "text": "Billy Joel has cancelled all scheduled performances in the United States and Britain because of a brain disorder called normal pressure hydrocephalus, according to a statement posted Saturday on the singer’s social media accounts.\n\nHydrocephalus refers to a build-up of cerebrospinal fluid, a watery liquid that cushions the brain and spinal cord. With normal pressure hydrocephalus, the fluid accumulates gradually with little to no increase in intracranial pressure. The excess cerebrospinal fluid presses on the brain and can disrupt neural pathways, causing cognitive impairments, difficulty walking and a loss of bladder control.\n\nBilly Joel has been diagnosed with a brain disorder that affects his vision, hearing and balance. Credit: Getty Images\n\nJoel will be undergoing physical therapy and his doctor has instructed him to refrain from performing as he recovers, the statement said. The Piano Man is cancelling 17 shows and tickets for the cancelled concerts will be automatically refunded.\n\nHow is normal pressure hydrocephalus diagnosed and treated? Here’s what to know.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/could-sharks-hold-the-secret-to-cutting-flight-costs-20250508-p5lxmq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Could sharks hold the secret to cutting flight costs?",
        "publish_date": "Sun, 25 May 2025 11:06:28 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Much of aviation’s history hinges on what humans learn from birds about aerodynamics. But the next leap forward may be driven not by birds, but by sharks.\n\nShark’s skin features microscopic grooves that reduce drag as the animal swims.\n\nMicroTau staff install a sample of sharkskin drag-reducing material on a section of an Airbus aircraft. Credit: Kate Geraghty\n\nThe concept is being applied to the surface of planes to reduce drag and boost efficiency, trimming fuel costs.\n\nSydney-based MicroTau, the company pioneering the technology, is partnering with low-cost Spanish airline Vueling to support certification of its “shark skin” Riblet Modification Package.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/freo-coach-defends-captain-s-knock-after-dockers-crush-power-20250525-p5m1z3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo coach defends captain’s knock after Dockers crush Power",
        "publish_date": "Sun, 25 May 2025 10:02:17 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle coach Justin Longmuir is adamant Alex Pearce should have nothing to worry about, declaring the skipper’s collision that concussed Port Adelaide’s Darcy Byrne-Jones didn’t even warrant a free kick.\n\nByrne-Jones was running with the flight of the ball when Pearce cannoned into him from the opposite direction in Fremantle’s 49-point win on Saturday night.\n\nAlthough Pearce didn’t turn his body in a bumping motion, he took his eyes off the ball at the last moment and was airborne when contact was made in the Dockers’ 15.10 (100) to 7.9 (51) victory.\n\nByrne-Jones was helped off the ground after the second-quarter incident and was subbed out of the game with a concussion.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/cannes-2025-the-75-best-red-carpet-looks-20250514-p5lz15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cannes 2025: The 75 best red carpet looks",
        "publish_date": "Sun, 25 May 2025 09:12:23 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Cannes 2025: The 75 best red carpet looks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/blackstenius-puts-gunners-up-20250525-p5m1ym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Blackstenius puts Gunners up",
        "publish_date": "Sun, 25 May 2025 09:12:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Blackstenius puts Gunners up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/no-chance-of-charles-and-harry-reuniting-on-kings-canada-trip-says-royal-expert-20250525-p5m1yk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No chance of Charles and Harry reuniting on King's Canada trip, says royal expert",
        "publish_date": "Sun, 25 May 2025 09:03:03 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "No chance of Charles and Harry reuniting on King's Canada trip, says royal expert\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/unholy-workplace-row-brewing-in-state-s-catholic-schools-20250522-p5m1as.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unholy workplace row brewing in state’s Catholic schools",
        "publish_date": "Sun, 25 May 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Noel Towell"
        ],
        "text": "A messy workplace dispute is brewing between teachers at Victoria’s Catholic schools and their employers, with the educators’ union threatening Fair Work action to enable its members to take industrial action.\n\nA militant mood among the state’s government school teachers has spread to the 30,000 educators at Victorian Catholic schools, whose wages lag behind their interstate counterparts by up to $10,000 a year.\n\nThe vast majority of Catholic teachers surveyed by the union said they were ready to walk off the job for better pay and conditions, raising the prospect of school strikes.\n\nBut a protected sector-wide strike by Catholic teachers is not a current option because the 30,000 educators are employed by 33 separate church-linked entities, ranging in size from the giant Diocese of Melbourne to single-site employers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/borderlands-on-the-edge-of-humanity-20250522-p5m1kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Borderlands: On the edge of humanity",
        "publish_date": "Sun, 25 May 2025 08:45:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Series\n\nBorderlands: On the edge of humanity\n\nZach Hope and Kate Geraghty travel to the borderlands near Myanmar, where efforts are under way to rescue thousands of trafficking victims from scam factories.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-woman-makes-15000-from-recycling-scheme-because-trash-is-everywhere-231345085.html",
        "title": "Aussie woman makes $15,000 from recycling scheme because 'trash is everywhere'",
        "publish_date": "2025-05-24T23:13:45Z",
        "category": "finance",
        "authors": [
            "New Recycling Schemes To Get Aussies Involved"
        ],
        "text": "The Melbourne woman has quickly made thousands from recycling and is encouraging others to do the same.\n\nA self-proclaimed \"binfluencer\" who encourages Aussies to make money from collecting cans and bottles says she's made $15,000 fairly easily as \"trash is everywhere\".\n\nSayo Leahy, 39, told Yahoo News the 10c per item offered at her local container collection centre in Melbourne quickly adds up. She says she can collect hundreds of cans in one night, jokingly calling herself an \"OnlyCans\" enthusiast.\n\n\"There's always cans on the side of the road, wherever you go there's always trash,\" she said, explaining she's been collecting cans and bottles since Victoria introduced its container deposit scheme in November, 2023.\n\n\"I calculated I've made about $15k, but obviously there's some costs involved, like fuel and wear and tear of the ute.\" Sometimes Sayo collects cans and bottles during committed evenings when she heads to the suburbs the night before bin day, or simply when she's out for a walk and spots discarded trash on the street.\n\nBinfluencer encourages other Aussies to recycle\n\nSayo has not only been able to earn extra cash to alleviate her own financial pressures, but she's also been able to make donations to charities. She encourages others to get involved, saying people don't need to go out of their way to make the scheme work for them.\n\nADVERTISEMENT\n\n\"People don't realise 10 cents can really add up and help, especially since you can just put your can next to your bin and then donate them,\" she said. \"I think it's amazing that we've finally established it in Victoria. It's been a long time coming.\"\n\nVictoria recently introduced a state-wide incentive to encourage people to use the scheme, with five $10,000 cash prizes up for grabs in the 'Win a million cents' competition if they return at least 50 eligible containers in a single donation before June 15. Sayo attended the launch party on her birthday at the start of the month.\n\nSayo is encouraging Aussies to get involved in their state's return and earn schemes. Source: VicReturn\n\nNew recycling schemes to get Aussies involved\n\nThe chance to win $10,000 is one way that authorities are encouraging Aussies to do their bit to contribute to the country's recycling efforts, with every state and territory now having their own container deposit scheme.\n\nADVERTISEMENT\n\nSchools are also jumping on board the incentive with many competitions playing out among students to encourage recycling. The nationwide program Mobile Muster incentivises students to recycle their old phones, chargers and other electronic accessories, while another scheme called TerraCycle makes it easier to recycle often hard-to-recycle items such as empty beauty products and plastic packaging.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/sad-but-truly-incredible-detail-in-kangaroo-photos-shows-hidden-bonds-among-mob-213333626.html",
        "title": "Sad but 'truly incredible' detail in kangaroo photos shows hidden bonds among mob",
        "publish_date": "2025-05-24T21:33:33Z",
        "category": "sports",
        "authors": [],
        "text": "A kangaroo stands over another while it lies dying on a Victorian golf course. Source: Facebook/Vets For Compassion\n\nThe photo of an injured kangaroo lying on the ground dying has revealed the \"strong familial bonds\" that exist among the country's most iconic animals, with many members of the mob standing over the female roo as she took her final breath.\n\nA wildlife rescuer was called to a Victorian golf course at the start of the month after a golf ball hit the kangaroo on the head, leaving her on the ground \"shaking and convulsing\". When the rescuer arrived, two kangaroos were by her side, with one \"gently stroking her\" while a joey watched on metres away.\n\nPhotos taken of the moment highlight just how social the animals are, Helen Round from the East Trentham Wildlife Shelter told Yahoo News.\n\n\"Kangaroos don't mate for life but they're mates for life. Roos of similar personality will hang out together,\" she explained. \"They stay buddies for their whole lives. They will box each other, they will stay close to each other, feed together and raise joeys together.\"\n\nThe kangaroos continued to watch from afar when the rescuer saved the joey in the mother's pouch. Source: Facebook/Vets For Compassion\n\nJoeys are 'truly orphaned' when mother kangaroo dies\n\nKangaroo joeys are in their mother's pouch for up to a year and remain dependent on their maternal bond until they have fully matured.\n\nADVERTISEMENT\n\n\"A joey is dependent on its mum psychologically, physically and emotionally until it's about two years old, so the joey is truly orphaned when it loses its mum,\" Helen said. \"Wildlife carers will do their best to keep it warm, feed it and mother it, but it's not the same as the bond they had with their mother.\"\n\nWhile an older joey watched on at the golf course, another was found inside the mother's pouch and the rescuer on the ground was able to save the youngster. As the joey was being tended for, the older joey and other roo returned again to be with the female.\n\n\"They have strong family bonds and complex family structures... it's truly incredible, and heartbreaking, to see,\" Helen said, adding that most wildlife workers will have witnessed loving bonds play out in front of them while responding to rescuers.\n\nThe image of a male kangaroo holding a dying female in his arms as she reaches for her joey was shared worldwide in 2016, with photographer Evan Switzer saying he'd \"never seen anything like this before\" and called kangaroo bonds \"a special thing\".\n\nKangaroos form strong bonds with one another. Source: Evan Switzer\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/warning-over-growing-ev-graveyards-as-major-change-looms-for-aussie-electric-car-industry-211640297.html",
        "title": "Warning over growing EV graveyards as major change looms for Aussie electric car industry",
        "publish_date": "2025-05-24T21:16:40Z",
        "category": "finance",
        "authors": [],
        "text": "The case of a BYD Atto 3 left to be written off after \"minor\" damage highlights the challenges faced by the burgeoning EV industry.\n\nA new BYD Atto 3 was left in an Aussie scrapyard after a rear-end collision. Source: TikTok/Paul Maric\n\nA new Chinese electric vehicle sits under a tarp in a dusty Australian scrapyard. Damage to the car, although clearly visible, is relatively minor but the car has been written off.\n\nIt's a scenario that has plagued some early adopters of electric vehicles in the country as challenges persist in the fledgling repair network including a lack of qualified mechanics to work on the modern cars.\n\nThe BYD Atto 3 sitting under the tarp had been written off by the insurance company, ostensibly deemed too much trouble to fix.\n\n\"It had only done 300 kilometres. It was basically brand new and it was rear ended,\" car expert Paul Maric told Yahoo News.\n\nADVERTISEMENT\n\n\"It had very minor rear-end damage. There was no damage to the battery and no further damage to the structure of the vehicle, and despite this, it appears the insurer wrote off the vehicle.\"\n\nIn the end, his electrician brother bought the car for about $2,500 to repurpose the battery as part of a solar storage system.\n\n\"If you look at what is happening in electric cars in general, the repair network doesn't have the skills required at scale, and definitely not on the scale that the government wants,\" Maric said.\n\n\"At the moment there's a lot of hoops for panel beaters to jump through to make it viable to repair an electric car, as a result of that you don't have many of them, and as a result of that it's very expensive to fix them.\"\n\nProposed law change could make EV repair issues worse\n\nNicolas Rio is the general manager at Right2Drive, a company that supplies motorists with a replacement vehicle when they're involved in an accident and it's not their fault. Because the business aims to provide a like for like replacement, it is having to stock more EVs in its fleet and is in constant contact with repairers.\n\nADVERTISEMENT\n\n\"We work very closely with the repair network on understanding how those processes take place,\" he told Yahoo. \"We're starting to get more clarity on best practice, safe practice on electric vehicle repairs.\"\n\nWhile Teslas are the most common EVs in Australia, they can still face repair challenges. Source: Scientific Motor Body Works\n\nHe said while there is an increasing number of accredited EV repairers establishing themselves, any damage to the battery can still cause major challenges.\n\n\"When there's damage to the battery that can often be a very expensive repair which may exceed the value of the car,\" he said. \"That is a factor with electric vehicles.\n\n\"But generally speaking, the repair network that supports electric vehicles is strengthening, and definitely in metropolitan areas.\"\n\nHowever there are concerns in the industry that NSW could be about to introduce a major speed bump on the road to that improvement.\n\nADVERTISEMENT\n\nThere is currently no coordinated national pathway for repairers to get officially certified to work on EVs. To help address that NSW Fair Trade is currently proposing changes to the state's Motor Dealers and Repairers Regulation including requiring mechanics to pass certain training courses before they're legally allowed to service and repair electric and hybrid vehicles.\n\nThe changes would come into effect from July 1, and the industry says it could badly exacerbate shortages and ultimately lead to more damaged cars sitting idle in carparks and scrapyards waiting for repairers to jump through more regulatory hoops.\n\nThe CEO of the Australian Automotive Aftermarket Association (AAAA), Stuart Charity, warned this month that it would \"reduce access to essential repair services and increase costs for NSW motorists\".\n\n\"We agree that technicians working on high-voltage vehicles must be trained and competent — and that’s already happening. But this proposal creates a legislative barrier that will drastically reduce the number of qualified service providers overnight,\" he said.\n\nMembers of the public have until the end of the month to provide feedback to the state government over the proposed changes.\n\nReal risks to working on EV batteries\n\nMaric said the changes could mean workers carrying out ordinary tasks like changing tyres would need to do the mandatory certification which \"just seems outrageous\".\n\nADVERTISEMENT\n\n\"We sometimes underplay the amount of energy stored in one of these batteries and how much can be discharged if you mishandle a high voltage cable, or if you penetrate a battery,\" he said. The batteries can discharge enough energy to kill someone, he added.\n\n\"There are some real risks working on an electrified vehicle if you don't know what you're doing. So I agree we do need some [coordinated] licensing or training that people undertake, but there needs to be logical reasoning behind it.\"\n\nFor now, NSW Fair Trading says no final decisions have been made as it continues consultation with the industry.\n\nAccording to the AAAA, fewer than 10 per cent of NSW automotive technicians are estimated to have completed any formal EV training.\n\nMeanwhile the state government is aiming for more than half of new car sales to be EVs and hybrids by 2030.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]