[
  {
    "url": "https://www.9news.com.au/finance/gold-price-record-high-5300-usd-per-ounce/0321fe75-83e5-4cfe-9a7e-15a4b0ebc34e",
    "title": "Gold price soars to $US5300, but will Aussie dollar rally continue?",
    "publish_date": "Wed, 28 Jan 2026 23:47:14 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "The price of gold has continued to soar, hitting ﻿$US5300 an ounce overnight, driven by a plunging US dollar and geopolitical uncertainty.\n\nThe greenback slumped to its lowest value in nearly four years after US President Donald Trump declared this week he was not worried about the value of the American currency.\n\nAdding to concerns on financial markets has been Trump's decision overnight to send a huge naval force towards Iran, and threatening an attack on the Middle Eastern state unless a nuclear deal is achieved.﻿\n\nThe price of gold bullion has jumped to $US5300. (Getty Images/iStockphoto)\n\nHow long can Aussie dollar surge last?﻿\n\nAustralia's dollar, meanwhile, has risen to its highest level against its US counterpart since February 2023, buying 70.11 US cents yesterday after climbing 1.4 per cent.\n\nBut economists are uncertain whether the jump against the greenback will continue for the rest of this year.\n\nA Commonwealth Bank of Australia investor update today says it would take a \"significant shift\" in economic fundamentals, such as the value of Aussie shares and commodity prices, for the dollar to achieve 75 US cents.\n\nInstead, the bank expects the currency to trade at 70 cents against the greenback for some time.\n\n\"We expect AUD/USD to decline as 2026 progresses.\"﻿\n\nSo it may be better to book that trip to the US sooner, rather than later.\n\nThe US Navy's nuclear-powered aircraft carrier USS Nimitz is part of a huge force heading to Iran. (Cha Geun-ho/Yonhap via AP) (AP)\n\nGold 'could hit ﻿US$6000'\n\nThe surge in gold prices and falling US dollar mark a flight from currencies and sovereign bonds - or debt securities issued by national governments, according to experts.\n\nThe chief executive of UK-based global financial advisory firm de Vere Group, Nigel Green, believes gold could reach $US6000 by the end of this year.\n\n\"Gold benefits when political signals create uncertainty about growth, inflation, and international cooperation,\" ﻿he said.\n\nThe jump in gold also reflects mounting concern in financial markets over government borrowing as debt levels across major economies continue to rise.\n\nAlso propelling central banks and investors to seek refuge in gold has been uncertainty in key bond markets, such as Japan.\n\nGreen believes this week's spike in the gold price is more than a blip.\n\n\"The $US5000 milestone marks a beginning rather than an endpoint. We believe $US6000 is not unrealistic by the end of the year.\"\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/technology/most-anticipated-video-games-of-2026/eb446705-b148-4674-81c1-bac28bc67d71",
    "title": "The biggest video games set to be released this year",
    "publish_date": "Thu, 29 Jan 2026 00:31:34 +0000",
    "category": "finance",
    "authors": [
      "January"
    ],
    "text": "2 of 21 Attribution: Rockstar\n\nAfter multiple delays, the generation defining Grand Theft Auto series is finally expected to release its next mainline game this year.\n\nSet in a modern day Vice City, Grand Theft Auto VI is said to be the biggest GTA game ever. There's two playable characters: Jason Duval, a former drug runner, and Lucia Caminos, fresh out of prison and on a mission.\n\nREAD MORE: Most anticipated video game of all time delayed yet again﻿\n\nThese two look to have fantastic chemistry, how their story unfolds is the big question. Swamps, beaches, city streets and national parks — from what's been shown so far, the game environments have never looked better.\n\nPaired with an abundance of new and interesting characters, it's no wonder they're taking their time to put it all together.\n\nGTA VI is now set to release on November 19 across PlayStation 5 and Xbox Series X|S consoles.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/anzac-day-2026-chris-minns-extra-public-holiday-nsw/b11c12d6-2201-4662-bb65-3043287f6b4f",
    "title": "NSW could be given another public holiday this year",
    "publish_date": "Thu, 29 Jan 2026 01:36:04 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "This means workers do not get a day off on the Monday, like other holidays such as\n\nChristmas\n\n, Boxing Day and New Year's Day, called an additional day.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/noosa-river-houseboat-owners-told-to-leave-or-pay-hefty-fines-after-rule-change/6a8f3d92-46ac-4202-b264-f4d68197012b",
    "title": "Sally is being evicted her 'dream' home after sudden rule change",
    "publish_date": "Wed, 28 Jan 2026 18:26:21 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Dozens of houseboat residents and boat owners are facing imminent eviction from a popular Queensland river following the introduction of an anchoring time limit.\n\nUnmoored boats larger than five metres on the Noosa River can only stay for a maximum of 28 days per year from January 1, 2026, according to a rule announced by the Maritime Safety Queensland (MSQ) , meaning many long-term houseboat owners need to leave this week.\n\nIt has triggered outrage among members of the Noosa River community, some of whom have lived there for decades, who say the cost of relocation is prohibitively expensive.\n\nUnmoored boats larger than five metres on the Noosa River can now only stay for a maximum of 28 days per year. One of the boats on Noosa River pictured above. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nSally White, 62, has been living in her houseboat since 2021.\n\nShe told nine.com.au it was her \"dream\" to live aboard a floating home – but that dream is being ripped away.\n\n\"I was being priced out of the rental market and this was the next best thing. It had been one of those fantasies, a dream,\" White said.\n\nSally White has been living on the Noosa River for five years. (Supplied)\n\n\"﻿It's certainly not a walk in the park by any stretch of the imagination. Everyone thinks we're slumming it, or we're freeloaders.\n\n\"I still pay my taxes, and the money that I save from not paying rates, goes to the maintenance of the boat to make sure she is still compliant and she still floats.\"\n\nWhite, like many other residents on the Noosa River, needs to move her home of nearly five years to another waterway or she could face hefty fines.\n\nShe has applied for a special extension but worries it will be denied.\n\n﻿\"I would have to look at getting some funds, maybe from my superannuation,\" she added.\n\n\"It just smacks of elitism. Which I think is sad.\"﻿\n\nWhite has now put her boat on the market, however acknowledges it will be a tough sell given the anchoring deadline.\n\nREAD MORE: ﻿ Frantic dual citizens scramble to order passports amid major change\n\nWhite's houseboat (pictured above) is her dream home. (Supplied)\n\nShe has applied for a special extension but worries it will be denied. (Supplied)\n\nFellow boat owner Sally Hayes has been a vocal opponent of MSQ's new rules.\n\nShe ﻿recently moved onto her houseboat while she looks for a rental home.\n\n\"It's just financially ridiculous when you think about it,\" Hayes said.\n\n\"It's going to cost, to guess, for a bigger houseboat, around $20,000 to move a boat off the river. That's prohibitive.\n\n\"There's been absolutely no support in relocation of the vessels.\"\n\nHayes took on the task of informing every owner of﻿ a vessel bigger than five metres of the MSQ deadline.\n\nShe estimates around 80 boats on the river are captured under the new rule, with around 27 full-time residents impacted.\n\nSally Hayes is a vocal opponent of the new rule. (Supplied)\n\n\"Most of these people who live aboard or have these boats have spent upward of $100,000 or $150,000,\" she said.\n\n\"Suddenly, by this ruling being put in place, it renders these boats as worthless.\n\n\"There are quite a few people who are happy to move - if they had the means. But they don't have the means, they don't have $20,000 or $30,000 to spare.\"﻿\n\nSome residents on the Noosa River have lived there for decades, Hayes said.\n\n﻿Hayes is calling on the Queensland government to either reverse the decision or provide financial assistance to relocate boats.\n\nShe warned the changes ﻿will ruin the Noosa River for residents and holidaymakers.\n\n\"They're the colourful fabric of Noosa,\" she said.\n\n\"The whole river environment is just being absolutely ripped apart.\"\n\nBoats secured to private jetties are not considered anchored and a﻿re not subject to the rules.\n\nThere are only a limited number of moor﻿ings on the river, though.\n\n\"If the moorings were made available to people like myself, I would jump on it. I'd be happy to pay for it,\" Hayes added.\n\n\"But I was told, 'don't even bother going on the mooring list because we've got a wait list of over 10 years'.\"\n\nThe 28-day rule applies to Noosa River and all adjoining waters, including Noosa Sound, Lake Cooroibah, Lake Cootharabah, Lake Doonella, Lake Weyba, the Everglades and connected creeks.\n\nA sign posted on a boat anchored at Noosa River. (Supplied)\n\nMaritime Safety Queensland's statement in full:\n\nThe Noosa River Management Plan aims to make the Noosa River safer, cleaner and more sustainable, ensuring it remains a key part of Noosa's appeal for years to come.\n\nThe plan, introduced in 2023 after extensive community consultation since 2021, focuses on reducing congestion, improving safety and protecting the environment on this popular waterway.\n\nMaritime Safety Queensland has implemented the Management Plan in carefully considered stages, commencing in September 2023, with each subsequent stage announced 3-6 months in advance.\n\nThe Noosa River Management Plan balances the competing needs of vessel owners, other river users and tourists, local community residents and businesses.\n\nThe new 28-day anchoring restrictions introduced on 1 January 2026 are designed to ensure the river can still be safely enjoyed by all of the community and not used as a long-term vessel storage facility.\n\nOf the 120 vessels still anchored in the Noosa River, MSQ estimates the number of full-time live-aboard vessels still in the river to be around 20, with another 9 used as weekend or part-time accommodation.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/hecs-debt-reduction-what-do-after-paying-off-loan-how-to-stop-employer-deductions-explained/ad7cbd83-c97f-45b3-8ba6-fc37a159f10d",
    "title": "'Doesn't make any sense': Forgotten HECS detail delaying money in your pocket",
    "publish_date": "Wed, 28 Jan 2026 01:23:40 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "T﻿he federal government's 20 per cent HECS reduction scheme has resulted in some Australian taxpayers inadvertently losing unnecessary money from their paycheques.\n\nNearly three million Australians have an average of $5500 in HECS debts owing to the government – and this debt is paid off slowly through compulsory repayments.\n\nThe relief was applied to balances that were still active on June 1, 2025 and has helped some taxpayers clear their debt after years.\n\nREAD MORE: Scientists set a new time for the Doomsday Clock\n\nAround three million Australians have an average of $5,500 in HECS debts. (Getty)\n\nBut if you've forgotten to tell your employer to stop garnishing your wages for fully-paid HECS debts, you might need to act fast.\n\n﻿Director of Tax Communication at H&R Block Mark Chapman told nine.com.au that Australians who don't stop redundant repayments are essentially giving the federal government a no-strings-attached loan.\n\n\"If you do overpay, the money isn't lost, but you won't actually see it again until tax time,\" Chapman explained.\n\n\"You have to lodge your tax return, and at that point, the ATO will repay it. But that does mean that there will be quite a lengthy delay.\n\n\"You're basically just using the money to make a free loan to the government, which doesn't make any sense.\"\n\nAustralian pool manager Maddie paid off her $12,000 HECS debt late last year.\n\nShe told nine.com.au ﻿the 20 per cent reduction shaved off around $2500 from her balance, meaning she could make one voluntary payment and reduce it to zero.\n\nMaddie hasn't told her employer about paying it off yet.\n\n\"There's very little clear or accessible information about paying off HECS – especially about what steps to take once it's fully cleared,\" she said.\n\n\"﻿The lack of guidance makes it confusing and easy to miss important steps.\"\n\nShe expects a hefty tax return come June 30.\n\nMaddie paid off her $12,000 HECS debt in December 2025. (Supplied)\n\nHECS debt repayments don't automatically stop even if you log onto MyGov and find the balance has reached zero, Chapman said.\n\nYou need to fill out a tax form ﻿called a \"withholding declaration\", which indicates to your employer that you no longer have a HECS debt.\n\nIt's as simple as ticking the box ﻿\"no\" on the form when it asks if you have a Higher Education Loan Program (HELP), VET Student Loan (VSL), Financial Supplement (FS), Student Start-up Loan (SSL) or an Australian Apprenticeship Support Loan (AASL) debt.\n\nOnce this has been lodged, your next weekly, fortnightly or monthly pay will be a little bigger.\n\nThis figure will vary depending on your salary and what your regular contributions were.﻿\n\nFor example, anyone earning between $67,001 and $15,000 pays 15c for each dollar over $67000.\n\nThe HECS debt 20 per cent reductions were applied to loans last year. (Supplied)\n\n\"Say you're having $500 taken out of your salary each month to pay your HECS bill. If your HECS bill is no longer there, that $500 is paid to you in extra cash,\" Chapman added.\n\n\"If you told your employer that the HECS debt is gone, that immediately puts more money into your pocket.\n\n\"If you haven't yet, it's not something to panic about, but you should always make sure that you do actually notify your employer as soon as possible because that just makes financial sense for you.\"\n\nIf your HECS debt has reduced to a small amount, Chapman said it is important to clear it to zero before filling out the withholding declaration form.\n\nMark Chapman, Director of Tax Communications at H&R Block (Supplied)\n\n\"﻿If it is a bigger balance, that will actually cost you in terms of additional indexation,\" Chapman said.\n\n\"Your tax agent will be able to give you specific advice regarding your particular circumstances.\"\n\nMaddie said it feels like a financial burden﻿ has been lifted from her shoulders after years of compulsory payments.\n\n\"Even though I didn't finish my degree, carrying a HECS debt of over $12,000 was something that weighed on me,\" she said.\n\n\"Paying it off feels like a massive relief. I no longer feel guilty about leaving university, and mentally it feels like closing a chapter.\n\n\"Financially, it means I can focus more on travelling and future goals without the ongoing pressure of student debt hanging over me.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/nipah-virus-outbreak-west-bengal-india-symptoms-cure-treatment-what-it-does/c78d27d4-2a7a-45fc-8779-9d00ee7f89fb",
    "title": "Untreatable, usually fatal virus detected in India",
    "publish_date": "Wed, 28 Jan 2026 00:31:04 +0000",
    "category": "lifestyle",
    "authors": [
      "Jan"
    ],
    "text": "Airports across Asia are bringing in tighter screening measures after an untreatable and usually fatal disease was detected in India .\n\nTwo people have contracted Nipah virus , a zoonotic illness spread by fruit bats.\n\nAnother 196 contacts have been tested for the disease in West Bengal province, the Minister of Health said in a statement.\n\nNipah virus is frequently fatal and can leave survivors with brain damage. (NIAID)\n\n\"A total of 196 contacts linked to the confirmed cases have been identified, traced, monitored, and tested,\" the statement read.\n\n\"All traced contacts have been found asymptomatic and have tested negative for Nipah Virus Disease.\n\n\"The situation is under constant monitoring, and all necessary public health measures are in place.\"\n\nBetween 40 and 75 per cent of people infected by the virus do not survive, the UK Health Security Agency said.\n\n\"Some survivors may be left with lasting neurological difficulties, including persistent seizures and personality changes,\" the agency said in a statement.\n\n\"In rare cases, the virus can reactivate months or even years after the initial infection.\"\n\nWhile fruit bats are natural hosts of the virus, it is capable of spreading to pigs, dogs, cats, goats, horses and sheep.\n\nThe virus can be spread from animals to humans or person-to-person via contaminated food.\n\nNipah virus is typically spread by fruit bats. (Adobe Stock)\n\nThe virus can often survive in fruit or fruit juice, which has been contaminated with the bodily fluids of infected bats.\n\nThe most common examples stem from the consumption of raw date palm sap.\n\nThere are documented cases of the spread of the virus between infected patients and those taking care of them.\n\nIn humans, symptoms typically appear between four and 21 days after infection.\n\nWhen the symptoms do appear, they can be sudden.\n\nFlu-like symptoms, fever and pneumonia can develop.\n\nBut the virus also commonly causes meningitis or encephalitis (swelling of the brain), conditions which are often fatal.\n\nThere is no vaccination or treatment for the virus.\n\nQuarantine doctors watch thermal scanning of travellers from west Bengal, India at the airport in Samut Prakarn, Thailand. (AP)\n\nPrevious outbreaks have occurred in Bangladesh , Malaysia , Singapore , the Philippines and other parts of India .\n\nHong Kong has announced that passengers arriving from India will be screened for the virus.\n\n\"Hong Kong has the ability to detect infections of unknown causes and emerging infectious diseases at boundary control points and in hospitals,\" Hong Kong's Centre for Health Protection Controller Dr Edwin Tsui said.\n\nAn earlier statement from Australia's Department of Agriculture said it was possible for virus from fruit bats to move into the country from South East Asia.\n\n\"Australia is currently free of Nipah virus, however, an incursion of this virus would have serious consequences for both animal and human health,\" the statement read.\n\n\"Over one million pigs were slaughtered in Malaysia in an attempt to control this disease.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/malaysian-football-executives-resign-over-player-naturalisation-/106282446",
    "title": "Malaysian soccer bosses quit over disastrous 'cheating' scandal",
    "publish_date": "Thu, 29 Jan 2026 02:28:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "The entire executive committee of Malaysian soccer's governing body has \"voluntarily\" resigned over a scandal in which European and Latin American players were improperly granted citizenship to play for the national team.\n\nA complaint was lodged against Football Association of Malaysia (FAM) last year after Malaysia beat regional rivals Vietnam 4-0 with several players who had only been granted citizenship the week before.\n\nAn investigation by FIFA concluded the men's grandparents were not born in Malaysia as claimed, but rather Spain, Argentina, Brazil and the Netherlands.\n\nFIFA alleged FAM had \"doctored\" documents in order to field the players, ordering the association to pay a fine of 350,000 Swiss francs ($663,000).\n\nA table lifted from a report shows names of footballers' grandparents and where FIFA found they were born in doctored versus original documentation. (ABC News: Jarrod Fankhauser)\n\n\"Presenting fraudulent documentation with the purpose of gaining eligibility to play for a national team constitutes, pure and simple, a form of cheating,\" FIFA's report said.\n\nA statement from FAM yesterday announcing the resignations said it was \"a prudent and principled step taken in light of the recent situation\".\n\nThe executives had been elected for the term 2025 to 2029 but their unanimous \"voluntary\" exit was intended to restore the confidence of supporters, stakeholders and the football community, the statement said.\n\n\"Maintaining institutional credibility is essential for the stability, sustainability, and future development of Malaysian football,\" it said.\n\nCourt of arbitration clears suspended footballers to play\n\nWhen FIFA handed down its findings last year, seven players were slapped with a 12-month suspension from football-related activities and individual fines of around $3,800.\n\nThe players whose family heritage was in question were Spanish-born Gabriel Palmera and Jon Irazabal; Facundo Garces, Rodrigo Holgado and Imanol Machuca born in Argentina; Brazil-born Joao Figueiredo; and Hector Hevel who was born in the Netherlands.\n\nFive of the seven foreign-born players suspended by FIFA. (AFP: Mohd Rasfan/ABC News Graphic: Jarrod Fankhauser)\n\nFIFA concluded the players were the \"ultimate beneficiaries\" and \"illegally, and successfully enjoyed the consequences\".\n\nThey have appealed FIFA's decision at the Court of Arbitration for Sport, which this week granted a stay on the 12-month ban until their appeal had been reviewed.\n\nAn in-person hearing for their appeal will be held at the Court of Arbitration's headquarters in Lausanne, Switzerland in late February.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/google-search-preferred-source-how-to-choose-the-abc/106269778",
    "title": "How to see more ABC News stories in Google Search",
    "publish_date": "Thu, 29 Jan 2026 02:16:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Google is now letting you choose which publishers you want to see more of in your search results to give users a personalised experience.\n\nInstead of the algorithm being in control, people in Australia are able to customise their results in Google Search with a feature called preferred sources.\n\nWhen you select ABC News as your preferred source, you'll see more ABC articles displayed prominently within Google Top Stories, whenever fresh and relevant content for your search has been published.\n\nWhy choose ABC News?\n\nABC News is Australia's most trusted news provider.\n\nWe have local news teams across the country, along with specialist reporters covering politics, business, international news, climate, sport and regional issues.\n\nOur expert reporters provide live updates on the biggest news stories and ABC News offers daily explainers on the day's biggest issues.\n\nHere's a step-by-step guide to seeing more stories from the ABC when you search in Google.\n\nHow to select the ABC as your preferred source\n\nGo to the Google search bar and type in a topic that's in the news. Click on the icon to the right of Top Stories (two overlapping cards with a star). Search for the ABC, then select it as your preferred source. Hit refresh, then you will start to see more stories from the ABC appear at the top of your search results.\n\nOr you can click this link and follow the instructions.\n\nIt will take you to a page that looks like this, where you can add ABC News as your choice in source preferences.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/state-government-cleanco-pulls-out-of-moah-creek-wind-farm/106281190",
    "title": "State government backs out of central Queensland wind farm",
    "publish_date": "Thu, 29 Jan 2026 02:11:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "The state government has walked away from a central Queensland wind farm, saying it does not align with its energy road map but will instead partner with another wind farm in the state's north-west.\n\nThe Moah Creek Wind Farm, proposed by private developer Central Queensland Power (CQP), would be built on agricultural land 30 kilometres west of Rockhampton, with 60 turbines to power almost 200,000 homes.\n\nPublicly owned generator CleanCo was in partnership to acquire the project.\n\nHowever, it announced in a statement on Wednesday that it had assessed all projects in development and the Moah Creek Wind Farm did not align with its \"current strategic activities, commercial portfolio and investment priorities, given changing energy market conditions\".\n\nCleanCo said it had withdrawn from further development and all delivery activities for Moah Creek Wind Farm but remained in discussion with CQP about a \"potential future offtake opportunity\".\n\nThe former Palaszczuk government announced in October 2023 that CleanCo had partnered with CQP and once development was completed, it would transition to public ownership.\n\nIt was CleanCo's first partnership since it was established in 2018.\n\nA day after the company announced its withdrawal from the central Queensland project, the Crisafulli government said CleanCo had signed a 10-year agreement with Windlab in the state's north-west to secure 75 per cent of Kennedy Energy Park's wind energy output from 2028.\n\n\"We know the energy shift towards renewables can have a positive impact on regional communities, but only if it is done right,\" Treasurer David Janetzki said.\n\nThe Kennedy Energy Park is located near Hughenden between Mount Isa and Townsville, and includes a 12-turbine, 43-megawatt wind farm, more than 55,000 solar panels and 2 megawatts of battery storage.\n\nMoah Creek Wind Farm still going ahead\n\nNick Holland, pictured with his wife Melanie and son, said he would see up to 20 wind turbines from the Moah Creek Wind Farm, with the closest 2 kilometres away. (ABC News: Scout Wallen)\n\nCentral Queensland Power, a joint venture between Energy Estate and Renewable Energy Systems, said its project would still progress.\n\n\"The Moah Creek project remains a well‑positioned project,\" director Matt Rebbeck said.\n\nThe project secured federal funding in October last year through the Australian Government Capacity Investment Scheme.\n\nCQP would not disclose the amount of funding but has confirmed to the ABC that it remained in place and would be used going forward, but it was also open to another investor.\n\nThe Holland's 2,500-hectare farm at Wycarbah has been in Nick's family for generations. (ABC News: Scout Wallen)\n\nWycarbah grazier Nick Holland, who neighbours the project, last year submitted to the state government a petition with more than 1,000 signatures calling for the wind farm to be axed and the state to withdraw investment.\n\nOn Thursday, Mr Holland said he was relieved that CleanCo had withdrawn.\n\n\"It was not the right location, given the number of residents in the vicinity and the impact it would have on those,\" he said.\n\nMr Holland said other concerns included the visual impacts, construction phase, impact on locals, vegetation buffers and run-off.\n\n\"There's a large number of people that are in the vicinity of this project that all shared all their different concerns of how it would affect them,\" he said.\n\nThe Moah Creek Wind Farm project is currently under assessment through the federal government's Environment Protection and Biodiversity Conservation (EPBC) Act.\n\nIt secured state government approval in 2023.\n\nHeartland of wind farm woes\n\nIn May last year, the state government axed the $1bn wind farm project axed , 40 kilometres west of Rockhampton, five months after it had secured approval from the state planning department.\n\nAbout 200 kilometres away between Rockhampton and Mackay, Andrew \"Twiggy\" Forrest's 100-turbine Clarke Creek Wind Farm $1 billion wind farm opens after three years of construction.\n\nThe Clarke Creek Wind Farm was approved before the LNP state government changed the legislation in 2025.\n\nThe new laws require new development applications to have public consultation and community benefit agreements with local councils, and must allow third-party appeal.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/australian-open-day-12-live-blog-sabalenka-svitolina-rybakina/106282372",
    "title": "Live: Aussie men's doubles pair showdown ahead of women's semifinals",
    "publish_date": "Thu, 29 Jan 2026 01:57:07 +0000",
    "category": "sports",
    "authors": [
      "Andrew Mcgarry"
    ],
    "text": "Australian pair Jason Kubler and Marc Polmans have a chance on day 12 to make the men's doubles final at Melbourne Park, but the highlight of the day will come later with the women's singles semifinals.\n\nKubler and Polmans are up against Briton Luke Johnson and Poland's Jan Zielinski.\n\nTonight on Rod Laver Arena, there will be a marquee double-header, with two-time champion Aryna Sabalenka facing Elina Svitolina, followed by Elena Rybakina against Jessica Pegula.\n\nFollow all the action from Melbourne Park in our live blog below:",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/liberty-bell-ball-loan-default-tas-to-take-ore-stockpile/106281912",
    "title": "Tasmania takes control of ore stockpile after Liberty Bell Bay defaults on loan",
    "publish_date": "Thu, 29 Jan 2026 01:33:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Tasmanian government has appointed receivers and managers to protect the manganese ore stockpile paid for by taxpayers at the Liberty Bell Bay smelter in the state's north.\n\nLiberty Bell Bay is Australia's only manganese alloy smelter.\n\nIt was given a $20 million loan from the state government in August, $14.5 million of which was used to buy one 23,000-tonne shipment of ore which was delivered in October.\n\nDespite this, operations at the troubled smelter have not resumed, after being paused indefinitely in May last year, with the company blaming ore supply issues and global price volatility.\n\nThe smelter was bought in 2020 by international company GFG Alliance, which is headed by British businessman Sanjeev Gupta.\n\nLiberty Bell Bay operates a manganese alloy smelter in northern Tasmania. (ABC News: Owain Stia-James)\n\nMinister for Business, Industry and Resources Felix Ellis said the move had been made following ongoing defaults under the state's loan agreement.\n\n\"Unfortunately, GFG has not delivered on its promises to Tasmanians and to its workers to restart operations, and the loan [has] not been repaid,\" he said.\n\n\"By securing the ore and not moving immediately to sell it, the government is maintaining options and providing opportunity for Liberty Bell Bay and interested parties to continue discussions about potential future operations at the site.\n\n\"We have engaged extensively with Liberty's owners over recent months, including on potential future pathways for the business.\n\nThe smelter, near George Town, is the only one in Australia that can process manganese alloy, used in steel-making. (Supplied: Liberty Steel Group)\n\n\" The state must act responsibly to protect public funds and ensure its secured position is maintained. \"\n\nThe Tasmanian government said it remained open to working with Liberty Bell Bay.\n\nLiberty Bell Bay has been contacted for comment.\n\nSuppliers left unpaid, some considering closure as a result\n\nThe chief executive of the Bell Bay Advanced Manufacturing Zone, Susie Bower, said at least five businesses were collectively owed $1.3 million by Liberty Bell Bay.\n\n\"We have been working with suppliers for quite some time, since October last year,\" she said.\n\nSome suppliers are still waiting on payments from Liberty Bell Bay. (ABC News: Kate Nickels)\n\n\"We found out last week that four [staff] have had to be let go from one business, and another business keeps ringing me every week saying: 'What is happening Susie? I may have to close my business.'\"\n\n\"This has quite significant ramifications with Liberty's non-payment of our suppliers.\n\n\"Liberty really do now need to step up and actually tell us what the future of this site will hold.\"\n\nMs Bower said some businesses have not been paid since December.\n\n\"After December those payments have all stopped,\" she said.\n\n\"They are on a knife's edge.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/farmers-call-long-term-solution-waterfall-way-landslide/106257220",
    "title": "Minister says 'mountain is falling off' on notorious transport route",
    "publish_date": "Thu, 29 Jan 2026 01:18:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers affected by the repeated closure of a key Mid North Coast route are sceptical about plans for an assessment of the notorious stretch of road.\n\nThe New South Wales government has announced a detailed corridor assessment of Waterfall Way and other roads between Bellingen and Dorrigo, nearly two weeks after a 200-tonne landslide closed the road.\n\nMotorists relying on Waterfall Way have been at the mercy of weather events for decades, with the latest closure the fourth in the past 12 months.\n\nA major landslip closed Waterfall Way in 2021. (Supplied: Transport for NSW)\n\nThe road is a key tourism and agricultural route between north-west NSW and the coast, vital for the transport of livestock, dairy and produce over the Great Dividing Range.\n\nMurray Grey stud breeder Sue Francis sent cattle to the abattoir at Wingham on the morning of the latest closure.\n\nWhat would normally be a three or four-hour trip turned into a 24-hour ordeal for her livestock and the driver transporting them.\n\nSue Francis's cattle was on a truck for 24 hours trying to get to the abattoir. (Supplied: Sue Francis)\n\n\"It's pretty hard to know that your cattle are on this sort of adventure,\" Ms Francis said.\n\n\"Yes the cattle have gone to slaughter, but we spend months making sure that that last day is one of comfort and as stress-free as possible.\"\n\nStress before slaughter, including during handling and transport, can reduce the quality of beef under the Meat Standards Australia (MSA) grading program.\n\n\"Because of the stress they went through, I doubt they will grade and fit into the MSA value grid,\" Ms Francis said.\n\n\" So I'll be losing probably a couple of hundred bucks per head on that load, as will everybody else who had cattle on that load. \"\n\nFor dairy farmers on the Dorrigo Plateau, the closure added four hours to the round trip for tankers transporting milk to the processor at Raleigh.\n\nDairy farmer Julie Moore was forced to change her milking schedule due to the closure. (Supplied: Julie Moore)\n\n\"Lots of the tankers do two runs to Dorrigo a day, so it makes an extremely long day for the drivers,\" Julie Moore said.\n\n\"If they're driving that back road [through Grafton] later in the night, they're on unfamiliar roads.\n\n\"It's a sealed surface but it's still not a road you want to be driving a milk tanker around at night.\"\n\nSolutions to be assessed\n\nNSW Regional Transport and Roads Minister Jenny Aitchsion said she was meeting with engineers and technical experts to assess the corridor and explore possible solutions.\n\n\"It is a very difficult situation because the mountain is essentially falling off,\" she said.\n\n\"We've had 150 tonnes coming down over the initial 50 tonnes of material that fell.\n\n\"We understand the frustration, but we don't want a situation where the weight of 10 cars comes down and hits someone trying to go about their day.\"\n\nMinister for Regional Transport and Roads Jenny Aitchison said short and long-term solutions would be considered. (ABC News: Romy Stephens)\n\nMs Aitchison said the NSW government had dedicated more than $100 million for remediation works to address slips in the area caused by severe weather in recent years.\n\nWhile alternative routes connecting the Mid North Coast and Northern Tablelands were being explored, Ms Aitchison said it would not be a simple fix.\n\nCrews are working to stabilise the active slope. (Supplied: NSW Government)\n\n\"We need to make sure we have the right data points in place and we do understand what the alternatives are,\" she said.\n\n\"We’re looking at different options to strengthen the surrounding network so we can provide a better option during times of natural disasters.\"\n\nFarmers sceptical\n\nThe assessment is due to be completed by the middle of 2026.\n\nMs Moore said she would wait to see what concrete action came about as a result.\n\n\"There's been quite a few detailed studies done in the past 20 years and we're still at point A,\" she said.\n\n\" It's well and good for the assessment to be completed by the middle of the year, how many years will we then have to wait for the money to be allocated and work to commence? \"\n\nMs Francis said short-term repairs were no longer suitable.\n\n\"The patching and the band-aids are not working,\" she said.\n\n\"If the assessment is done this year, perhaps they can promise that work will be starting on it by the end of this year as well.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/sabalenka-has-single-focus-with-open-trophy-beckoning/106282116",
    "title": "Sabalenka has single focus with Open trophy beckoning",
    "publish_date": "Thu, 29 Jan 2026 00:57:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Aryna Sabalenka is in very familiar territory after reaching her fourth successive semifinal at the Australian Open, but what's not familiar are her rivals left in the draw, including her last-four opponent Elina Svitolina.\n\nSabalenka has a third title at Melbourne Park in sight after sweeping past US teen prodigy Iva Jovic 6-3, 6-0 while Svitolina made similar short work of Coco Gauff.\n\nWith a politically-charged setting, there's no love lost between Sabalenka and outspoken Ukrainian Svitolina, who has pointedly refused to shake hands post-match with Russian or Belarusian opponents, including the world number one.\n\nWorld number five Elena Rybakina was last in the Open semifinals in 2023 and has been joined by number six Jessica Pegula, with the pair also squaring off Thursday.\n\nBut the tournament has lost the usual grand slam heavyweights in Iga Świątek, Gauff and Amanda Anisimova.\n\nThose three players — ranked two to four — were forced to pack their bags after all suffering quarterfinal losses.\n\nMadison Keys, who shocked Sabalenka in last year's final to end her hat-trick run of titles, is also out after falling to Pegula in the fourth round.\n\nThe loss to Keys was Sabalenka's only reverse in her past 26 matches at Melbourne Park, including titles in 2023 and 2024. A third trophy would also move her to five majors.\n\nThat would draw her level with Martina Hingis and Maria Sharapova on the all‑time winners' list.\n\nThe Belarusian world number one said she didn't think about her stunning consistency when she was in the midst of a tournament.\n\n\"When I'm in the tournament, I'm not thinking about that, but sometimes we all stop for a second and we think the level we're able to reach, it sounds really incredible and tough to believe,\" the 27-year-old said.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"I think what's really helping me to be there all the time is the focus that I'm having — focusing on the right things definitely helps a lot with the consistency.\"\n\nSabalenka said she didn't give too much energy to her opponent, believing that keeping the blinkers on was best for her own game.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBut she expected a tough battle with Svitolina, who is into her fourth major semi — and first since Wimbledon in 2023 — but is still chasing an elusive maiden grand slam title.\n\nThe former world number three has begun 2026 on a 10-match winning streak although Sabalenka has won the past four matches between the pair and five of six overall.\n\n\"It doesn't matter who is going to make it to the semis, it's going to be a battle because whoever makes it there, it's an incredible player,\" Sabalenka said.\n\n\"Every player when they get to the tournament it's the trophy or nothing but I'm trying to shift my focus on the right things and taking it step by step.\n\n\"My approach going to be the same — doesn't matter who I'm facing I'll just be focused on myself and on my game, and fight for every point.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/nt-childrens-commissioner-youth-detention-transfer-report/106280082",
    "title": "Boys and girls detained together without access to health staff, report finds",
    "publish_date": "Thu, 29 Jan 2026 00:06:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Male and female youth detainees in Alice Springs are being housed together for up to 72 hours without access to on-site health staff before being transferred to Darwin, prompting the Northern Territory Children's Commissioner to call for \"urgent reform\".\n\nIn a report released today, NT Children's Commissioner Shahleena Musk found \"the overall trajectory of youth detention in the NT — particularly for Central Australian young people — has worsened\" since the transfers of youth detainees from Central Australia to Darwin began in 2023.\n\nCommissioner Musk said of the 60 Alice Springs Youth Detention Centre (ASYDC) detainees transferred to Darwin during the first 10 months of the plan, all were Aboriginal, while 10 were girls, and 16 either had been or were being assessed for a disability.\n\nThe report represents the second part of a two-part investigation into what was originally the temporary transfer of detainees from Alice Springs to Darwin in 2024, but Commissioner Musk said its relevance had \"shifted significantly\" since the NT government effectively closed the Alice Springs Youth Detention Centre early last year.\n\nThe Alice Springs Youth Detention Centre has effectively been closed, with detainees now held there for up to 72 hours before being transferred to Darwin. (ABC News: Xavier Martin)\n\nIn her report, Commssioner Musk wrote that since the Country Liberal Party (CLP) had taken office in the NT in September 2024, young detainees in Alice Springs were \"routinely transferred to a facility over 1,500km away in Darwin, resulting in their disconnection from family, community and culture\".\n\n\"The purpose-built ASYDC facility has been reduced to a single block for short term and transitionary detention of children, while the majority of the site and infrastructure is being adapted to an adult facility,\" the report reads.\n\n\"Concerningly, it is used to house male and female young people together and for short periods of up to 72 hours only.\n\n\"This measure is in place until a remand facility in Alice Springs is finalised, however the projected dates for completion of this new infrastructure continue to push out.\"\n\nShahleena Musk says a failure to act on her findings will only \"compound the disadvantage faced by young people from Central Australia\" and increase the likelihood of reoffending. (ABC News: Michael Franchi)\n\nThe report states that the ASYDC's school has closed and there are \"no longer health or clinical staff on site\", while \"serious deficiencies\" have been identified \"reflecting systemic weaknesses across the NT youth justice system\".\n\n\"The concentration of youth detention in the one facility in Darwin undermines rehabilitation, family, community and cultural connection, and reintegration outcomes for Central Australian young people,\" Commissioner Musk wrote.\n\n\" Without urgent reform, the NT risks entrenching a system that is punitive, contra to best practice, and inconsistent with the rights of children under both domestic and international law. \"\n\nThe commissioner also found families of youth detainees in Central Australia \"are not being consulted and in some cases not contacted prior to their transfers to Darwin\".\n\nDepartment rejects all recommendations\n\nIn her report, Commissioner Musk made five recommendations she described as \"reasonable and achievable\", but all of which were rejected by the NT Corrections Department.\n\nCommissioner Musk said their rejection would only \"compound the disadvantage faced by young people from Central Australia\" and increase the likelihood of reoffending.\n\nIn response to a recommendation to notify detainees' families when they were transferred to Darwin, the department said while there was \"no legislative requirement\" to do so, an \"extensive review\" of service standards was under way.\n\n\"We endeavour, to the extent possible, to ensure that young people remain in contact with family, without compromising our staff or centres' safety and operational functions,\" the department wrote.\n\nAn ABC investigation last week revealed there were nine self-harm incidents requiring hospitalisation at the Holtze Youth Detention Centre in the year after it opened. (ABC News: Jayden O'Neill)\n\nThe department also said the transfer process could be \"unduly delayed\" if staff were required to provide Indigenous language translators, in response to another recommendation.\n\n\"Detainees may go through the charging and court processes without the assistance of an interpreter and still enter into the youth detention system with an idea of why they are detained,\" the department wrote.\n\n\" All transfers are explained in the simplest manner possible, which includes the use of aids such as picture books. \"\n\nThe department also defended its refusal to commit to adhere to its own policies, saying resources had been \"stretched\" following an \"influx of detainees into the youth detention system\".\n\nNine youths hospitalised after self-harm at new NT detention centre Nine youths ended up in hospital after self-harming at Darwin's new $130 million detention centre in the 12 months after it opened, documents released to the ABC under Freedom of Information laws have revealed.\n\n\"The department is dealing with a large cohort of young people, who enter and exit the youth justice system frequently, but are not in a stable position for long enough to allow thorough planning and preparations to occur,\" the department wrote.\n\n\"A lot of detainees have insufficient supports outside of a detention setting, despite the department's best planning and intentions.\"\n\nIn a statement also released today, Commissioner Musk said the department's response reflected a \"missed opportunity\" to ensure detainees were not further disadvantaged by the decision to consolidate the NT's youth justice centres.\n\n“It is incredibly disappointing that the Department of Corrections has not accepted any recommendations made by the inquiry, including simply following their own existing policies and procedures, and committing to ensuring young people have access to interpreters for key decisions,” she said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/cryptocurrency-qoin-company-fined-14m-misleading-conduct/106278720",
    "title": "Gold Coast firm fined $14m over Qoin cryptocurrency",
    "publish_date": "Wed, 28 Jan 2026 23:51:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Gold Coast company that launched the Qoin crypto token in 2020 has been fined $14 million by the Federal Court for \"serious and unlawful misconduct\".\n\nThe Australian Securities and Investments Commission (ASIC) launched legal action against BPS Financial Limited in 2022, alleging it made false, misleading or deceptive representations to about 80,000 people or businesses.\n\nOn Tuesday, Justice Kylie Downes ordered BPS pay $14 million in pecuniary penalties, be prohibited from providing unlicensed financial services for 10 years, and publish a notice online outlining the court's decision.\n\n\"From January 2020 until mid-2023 the defendant, BPS Financial Pty Ltd (BPS) engaged in serious and unlawful misconduct,\" Justice Downes stated in the court judgement.\n\n\"During the same period, BPS issued more than 96,000 Qoin Wallets and derived substantial revenues totalling over $42 million from the sale of Qoin Tokens.\"\n\nQoin background\n\nQoin was advertised as a digital currency that could be traded exclusively Block Trade Exchange (BTX).\n\nQoin and BTX were owned by BPS and operated from the same Southport office.\n\nOffices for Qoin and Block Trade Exchange (BTX) at Southport on the Gold Coast in 2022. (ABC Gold Coast: Dominic Cansdale)\n\nBPS also claimed Qoin could be used to buy goods and services from a growing number of Australian businesses.\n\nAbout 96,000 Qoin accounts — or wallets — were issued, according to Federal Court documents.\n\nIn November 2021, a class action consisting of Qoin users was launched, amid growing concerns that many businesses registered on Qoin's website did not accept it as payment and that it had lost all value.\n\nIt came as the volume of Qoin sold on BTX collapsed from a high of $700,000 per day to almost zero by the end of 2022.\n\nLast year, BPS settled the class action by providing claimants with 4.3 million Qoin tokens.\n\nIn her judgement Justice Downs said \"the value of Qoin Tokens is likely to be limited\" but that the settlement was \"better than nothing\".\n\nBPS conduct 'condemnable', court finds\n\nASIC launched separate legal proceedings against BPS in October 2022.\n\nIt alleged BPS did not have the proper financial services licence, that it had falsely claimed that the number of Qoin businesses was rising and that the token could be traded for dollars or other cryptocurrencies on an independent exchange.\n\nIn May 2024, the Federal Court found that BPS had engaged in misleading conduct but was exempt from holding an Australian Financial Services Licence for a 10-month period.\n\nASIC successfully appealed that exemption finding last year, and the penalty hearing was conducted in Brisbane this week.\n\nBPS director Tony Wiese. (YouTube: Qoin)\n\nASIC had sought a $21-million penalty but BPS director Tony Weise told the Federal Court the company was on the \"brink of insolvency\".\n\nIn her judgement, Justice Downes stated the conduct of BPS was \"condemnable\".\n\nShe found it made false or misleading claims that Qoin could be exchanged for Australian dollars or other cryptocurrencies on an independent exchange.\n\nJustice Downes also found the claims that Qoin could be used to purchase goods or services from a growing number of businesses, or that it had been officially approved, were also false or misleading.\n\n\"The decline was persistent and known to BPS, and the fact that the representation remained for 12 months, whether resulting from inadvertence or gross carelessness, is condemnable,\" Justice Downes stated in her judgement.\n\nShe also found BPS carried out a financial services business without holding an Australian Financial Services Licence.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/molineux-named-healy-successor-as-australian-captain-cricket/106281600",
    "title": "Molineux named Healy's successor as Australian captain",
    "publish_date": "Wed, 28 Jan 2026 23:49:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sophie Molineux has been named Australia's new all-format captain, replacing the retiring Alyssa Healy.\n\nMolineux, 28, debuted for Australia in 2018 in T20 cricket, playing her first ODI later that year and her first Test in the 2019 Ashes.\n\nShe will make her official captaincy debut at the SCG against India on February 15 in the first T20 of a multi-format series.\n\nMolineux is the captain of Victoria and the Melbourne Renegades, and led her WBBL side to the title in 2024.\n\nTahlia McGrath and Ash Gardner will be Molineux's vice captains.\n\nSophie Molineux replaces Alyssa Healy in the top job. (Supplied: Cricket Australia)\n\n\"It's a real honour to be named Australian captain and something I'm incredibly proud of, especially following on from Alyssa, who's had such a huge impact on this team and the game,\" Molineux said.\n\n\"We've got a really strong group with plenty of natural leaders, alongside a lot of exciting talent coming through, and I'm really looking forward to working together as we keep evolving and pushing ourselves to the next level, while staying true to the identity that makes this team so special.\n\n\"I'm incredibly grateful for the trust that's been shown in me, and I'm excited to grow alongside this group of players and see what we can achieve together with Tahlia, Ash and the rest of the team.\"\n\nFinger-spinning all-rounder Molineux has struggled with injury over recent years, missing significant stretches of cricket with knee and foot issues.\n\nHead of performance and women's selector, Shawn Flegler, said Cricket Australia would continue to \"manage Sophie's workload, prioritising key tournaments and major international series following injury challenges in recent seasons\".\n\nAustralia will face India in three T20s, three ODIs and a Test match through February and March.\n\nStar leg-spinner Alana King is a surprising omission from the T20 squad, while quick Megan Schutt has been left out of the ODI squad.\n\nAll-rounder Nicola Carey has been recalled to the ODI and T20 squads and is a chance to play her first international match since 2022.\n\nWBBL breakout star Lucy Hamilton could make her Test debut, with her left-arm pace considered a point of difference by selectors.\n\nLucy Hamilton could make her Test debut against India. (AAP: Darren England)\n\n\"Nicola has had an impressive past couple of years in domestic cricket and has also performed well overseas in both England and India. She is an experienced player, with a strong skill set, and she will get an opportunity to test those skills as we build towards the T20 World Cup,\" Flegler said.\n\n\"Lucy is an exciting left-arm fast bowler who offers something different with the ball. She has worked hard on her game over the past few years and is someone we believe has a big future, while also benefiting from being around the group at this level.\n\n\"We're fortunate to have great depth in our spin-bowling stocks, with three world-class spinners already in the side, which unfortunately means Alana misses out on the T20 format on this occasion; however, she will play in the Governor-General's match.\n\n\"It was also a tough call with Megan, but at her best she remains an important part of the side, particularly with the T20 World Cup on the horizon.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/what-do-we-know-about-india-nipah-virus-outbreak/106280738",
    "title": "A deadly virus has been re-detected in India. Asian countries are taking no chances",
    "publish_date": "Wed, 28 Jan 2026 23:31:01 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Countries across Asia are stepping up health screening measures after cases of a deadly virus were detected in India.\n\nAuthorities in India, Thailand, Singapore, Hong Kong and Malaysia have enacted new testing regimes after two people were detected with the Nipah virus in West Bengal.\n\nThe illness has a 40 to 75 per cent fatality rate in humans, depending on a country's capacity to test, trace and treat those infected, the World Health Organization (WHO) says.\n\nHowever, while it can spread from person to person, it does not do this easily, and outbreaks are usually small and fairly contained, according to experts and the European Centre for Disease Prevention and Control.\n\nHere's what we know about the virus, how it spreads, its symptoms and what countries are doing about it.\n\nWhat is Nipah virus?\n\nNipah virus is a zoonotic disease — one that spreads from animals to humans.\n\nThe virus sits in the same category as COVID-19 and Ebola and is most commonly spread by fruit bats.\n\nThe WHO says more specifically, the consumption of fruit or fruit products — such as raw date palm juice — containing urine or saliva from infected fruit bats has been the most likely source of infection.\n\nScientists in Bangladesh have previously caught bats to test them for the virus. (Reuters: Mohammad Ponir Hossain, file)\n\nThe virus can also spread between humans, generally between close contacts.\n\nThere is also some evidence it can spread to other animals, including pigs, dogs, cats, sheep and horses, according to the UK Health Security Agency.\n\nIt was first discovered in 1999 after an outbreak in pig farmers in Malaysia and Singapore.\n\nSince then, outbreaks have occurred most years in Bangladesh and in India.\n\nWhat are Nipah virus symptoms?\n\nA sudden onset of flu-like symptoms is common for people with Nipah virus.\n\nIts incubation period is usually between 4 and 21 days.\n\nClimate change disease risk Climate change isn't just expanding the environments where deadly diseases can occur, it's also making their spread more likely as weather events become more extreme, researchers say.\n\nMedical experts say pneumonia and other respiratory symptoms can also develop, but the most serious complication is encephalitis, or inflammation of the brain.\n\nPatients who suffer encephalitis stemming from Nipah virus have a higher mortality rate.\n\nPeople who recover may be left with permanent neurological damage, regular seizures and even personality changes.\n\nIn rare cases, the virus has been known to reactivate some time after a person has recovered from it.\n\nThere is no specific treatment for the virus currently, with intensive care the only option for those with serious infections.\n\nThere is also no vaccine licensed for use.\n\nWhat is happening in India?\n\nIndian health authorities said they had identified two people with the virus in West Bengal since December.\n\nThe National Centre for Disease Control said as a result it had \"initiated prompt and comprehensive public health measures\".\n\n\"A total of 196 contacts linked to the confirmed cases have been identified, traced, monitored, and tested. All traced contacts have been found asymptomatic and have tested negative,\" it said in a statement.\n\n\"Enhanced surveillance, laboratory testing, and field investigations were undertaken … which ensured timely containment of the cases.\"\n\nTwo Nipah cases have been identified in the Narayana Multispeciality Hospital in the eastern Indian state of West Bengal. (AP Photo)\n\nThe West Bengal cases are the state's first in nearly two decades, following five fatal infections in 2007, local media reported.\n\nThe Australian government's Smartraveller website advises that Nipah virus is one to be aware of in India and Bangladesh, but doesn't detail a specific risk following the new cases.\n\nThe Coalition for Epidemic Preparedness Innovations, a group that tracks emerging disease threats and funds the development of medical tools to protect against them, said that as of December, 750 cases had been recorded in all, and 415 of the patients died.\n\nWhat are Asian countries doing about Nipah virus?\n\nAuthorities in Singapore and Hong Kong said they were initiating temperature checks at airports for passengers arriving from India.\n\nThailand earlier this week tightened airport screening measures, with neighbouring Malaysia following suit.\n\nThere are now designated parking bays for aircraft arriving in Thailand from areas with Nipah infections, its health ministry said, while passengers must complete health declarations before clearing immigration.\n\nInternational arrivals at Suvarnabhumi International Airport in Bangkok face extra screenings following the outbreak in India. (Suvarnabhumi Airport Office /Handout via Reuters)\n\nMalaysia's health ministry said it was boosting preparedness through health screening at international ports of entry, particularly for arrivals from countries deemed at risk.\n\nChina's disease control authority said no Nipah infections had been detected in the country but there were risks of imported cases, state broadcaster CCTV reported on Tuesday.\n\nNepal, which shares a busy border with India, said it was on \"high alert\" and had tightened screening for travellers.\n\nHealth ministry officials said border points with India and China had been notified to remain vigilant and check suspected cases.\n\nHow can you avoid Nipah virus?\n\nThe WHO recommends several measures to decrease your risk of catching the virus, should you be travelling in areas where it is known to be occurring.\n\nActive outbreaks of the virus in humans have only been registered in rural or semi-rural areas in India and Bangladesh in recent years.\n\nPhilippines, Singapore and Malaysia have also had outbreaks in the past.\n\nIt says avoiding bats and infected animals is key, along with washing and peeling fruit before eating it.\n\nDiscarding fruit that has bat bite marks or has fallen to the ground in areas with fruit bats is also recommended.\n\nMaintaining proper hygiene is important for those who come into contact with infected people.\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/talison-lithium-mine-greenbushes-residents-want-home-buybacks/106262764",
    "title": "'Enough is enough:' Residents want home buyback scheme",
    "publish_date": "Wed, 28 Jan 2026 22:31:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Home owners living beside the world's biggest hard-rock lithium mine in Western Australia's South West region are calling on the miner to buy out their homes or offer relocation.\n\nMany locals in the historical mining town of Greenbushes, 240 kilometres south of Perth, have struggled to coexist with the mine in recent years because of regular blasting, dust and noise pollution.\n\nThe Greenbushes mine — owned by the Sino-American company Talison Lithium — provides nearly 20 per cent of the world's hard-rock lithium supply, which is crucial to the energy transition.\n\nTrevor Stallard has lived in Greenbushes for 39 years, and he spent 15 of them working at the lithium mine.\n\nTrevor Stallard says locals feel trapped by a comparatively sluggish property market in the town. (ABC South West WA: Jon Daly)\n\nThe retired miner has decided that enough is enough.\n\n\"We didn't sign up for this,\" he said.\n\n\"The constant noise, the dust, the traffic early in the morning. The tremors twice a day.\"\n\nResidents say a mining blast on Sunday, January 11, rocked the town site. (Supplied)\n\nThe big blast\n\nThe final straw for Mr Stallard and some other residents was a big mining blast on January 11, which reverberated across the town.\n\nLocal Rick Fryer described it as \"the mother of all blasts\".\n\n\"It frightened the daylights out of so many people,\" he said.\n\n\" It just slowly formed into this massive, massive cloud. \"\n\nThe self-described \"newbie\" has lived in Greenbushes for the past 15 years.\n\nRick Fryer says dust from the mine is a constant nuisance. (ABC South West WA: Jon Daly)\n\n\"I knew there was a mine here when we moved here nearly 15 years ago, but it wasn't this mine. Not the way it's operating now,\" Mr Fryer said.\n\n\"A lot of the residents, old-time residents, too, are really upset about what's happening to the town, to our town.\"\n\nA Talison Lithium spokesperson said the blast recorded 124 linear decibels (dBL), which breached the mine's Sunday noise limit of 120 dBL.\n\n\"This was Talison's first reportable breach of the airblast limit since that was set in our licence conditions approved in 2015,\" the company said.\n\nThe company said the typical blast would measure 100 dBL, making the January 11 explosion \"considerably more noticeable\".\n\nTalison Lithium says the January 11 blast breached its noise limit and was reported to the regulator. (ABC South West WA: Jon Daly)\n\nAn internal and external investigation concluded that a routine \"pre-split\" blast, a critical technique used to cleanly break rock away from the pit wall, was the cause, according to the company.\n\nTalison Lithium said it had already implemented several changes to the way it conducted such blasts.\n\nThe ABC has spoken to home owners who believe the regular and repeated vibrations from mine blasting have damaged ceilings and cracked drywalls.\n\nThe company said that while some impacts were inherent to mining, it was committed \"to do better and be a good neighbour\".\n\nThe cumulative effects of dust, traffic and noise have ignited calls for a home buyback scheme. (ABC South West WA: Jon Daly)\n\nHome owners want buybacks\n\nThe recent blast has stirred further discontent as the mounting effects of the noise, traffic and dust take a toll on the town's residents.\n\nSome residents have complained of persistent coughs, watering eyes, and the nuisance of having to deal with the thin white dust coating cars and homes.\n\nMr Stallard said the mine's impacts had intensified since approved production capacity increased to 2.8 million tonnes of lithium concentrate a year in 2019.\n\n\"I intended to live here the rest of my life, I really did,\" Mr Stallard said.\n\n\"But it's got to the stage where everything's incessant, and it's not going to stop.\n\n\"Sooner or later you just go, 'Enough's enough.'\"\n\nMr Stallard wants the mine to set up a voluntary home buyback or relocation scheme to help locals leave town.\n\nTalison's mining operation supplies 20 per cent of the world's lithium. (ABC South West WA: Jon Daly)\n\nNorthern Star Resources set up such a scheme in 2021 for residents in the suburb of Williamstown, on the edge of Kalgoorlie's Super Pit gold mine.\n\nTalison Lithium said it planned to operate for \"decades to come\", and that it would take time and meaningful consultation to develop a shared vision for the future with the community.\n\n\"It is too early to determine what will be recommended, but nothing should be ruled out,\" the spokesperson said.\n\nHowever, some locals feel their window of opportunity is closing as surrounding property markets outpace Greenbushes.\n\nThe town has a population of about 365 people, and the median house price is $395,000, compared to $595,000 at Balingup, just 11km away.\n\n\"A lot of them feel like they're trapped here because their house prices aren't going to go up,\" Mr Stallard said.\n\n\"They can't afford to buy elsewhere.\"\n\nTalison Lithium wants to be a \"good neighbour\" as it plans to continue its operations for decades to come. (ABC South West WA: Jon Daly)\n\n'A good neighbour'\n\nThe miner has its eyes set on further expansion.\n\nWA's environmental authority is considering Talison Lithium's proposal to increase its development envelope by more than 25 per cent.\n\nSince Rob Telford was appointed Talison's chief executive in late 2024, the company has adopted a markedly conciliatory tone in its community relations.\n\nMr Telford has previously told the ABC he wants the mine to set the benchmark for transparency and community engagement.\n\nRob Telford has introduced a raft of measures to reduce impacts on nearby residents. (ABC South West WA: Jon Daly)\n\nTalison does not shy away from discussing its impacts and has previously expressed \"deep regret\" for them.\n\n\"We know we need to do better, and we are taking further steps to reduce impacts,\" a public statement read after the January 11 blast.\n\nFollowing community criticism last year, the company introduced a raft of measures, including real-time public dust monitoring, expanded dust suppression, and noise reduction on haul trucks, among other things.\n\nDust level exceedence attributed to the mine halved from eight incidents in 2024 to four last year, according to the company.\n\nTalison is also rebuilding Stanifer Street, a thoroughfare for haul trucks through the middle of town.\n\nThe company said it had considered ways to divert traffic away from the town, but it did not progress due to \"design challenges\" and the potential to create additional impacts.\n\nRick Fryer says the company needs to do more to address its impacts on locals. (ABC South West WA: Jon Daly)\n\nBut it is not good enough for Mr Fryer, who wants a bypass road built to divert traffic away from his home on Stanifer Street.\n\n\"It's very easy to say sorry after you do something,\" he said.\n\nMr Stallard believes managing the effects of a world-leading mining operation on the doorstep of a small community is impossible.\n\n\"I think they're doing everything they can. It's just not enough,\" he said.\n\n\"It's physically impossible to stop it.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/alice-springs-mall-set-for-redevelopment/106274306",
    "title": "Council chief says Alice Springs mall project signals 'strong future'",
    "publish_date": "Wed, 28 Jan 2026 22:02:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key spaces in the centre of Alice Springs are set for a face lift over the next few years, with several redevelopment projects in the pipeline bringing hope for the town's future.\n\nThe Alice Springs Town Council is working to renew the famous Todd Mall, the library, the visitor information centre, Leichhardt Terrace, and the area connecting Parsons Street to the Hartley Street car park.\n\nPrivate stakeholders have plans to develop a shopping centre in the heart of town, while the Northern Territory government has announced a new multi-sport precinct to be built in Gillen.\n\nGum tree-shaped arbours will provide shade over the mall. (Supplied: Alice Springs Town Council)\n\nCouncil chief executive Andrew Wilsmore said the projects were a \"strong sign of faith\" in the town, following the scrapping last year of plans for the multimillion-dollar Aboriginal and Torres Strait Islander Art Gallery of Australia in Alice Springs.\n\n\"We have got so many projects going on at the moment … it's a real show of faith that this is a town with a very strong future,\" he said.\n\nThe $20 million Todd Mall redevelopment will involve the mall's red bricks being replaced with white pavers, 12 trees removed and another 20 planted, a digital display board, a 10-metre sculpture installed on the church lawns, new seating, lighting, bubblers, bins, bike racks and toilets, and arbours designed to look like gum trees to cast shade over the pedestrian-heavy area.\n\nThe work is expected to be finished by the end of 2026.\n\nTwelve trees will be removed, but another 20 will be planted in the redeveloped mall. (Supplied: Alice Springs Town Council)\n\n\"We've also designed for a couple of other aspects around town; that's the Leichhardt Terrace, some of the Parsons Street connectivity and all the way through to the Todd Street,\" Mr Wilsmore said.\n\n\"Those are shovel-ready projects, and if we can secure additional funding, we'll see those brought to life.\n\n\"I have a trip planned to Canberra to try to keep those funds that were originally destined for the art gallery to actually stay here in Alice Springs.\"\n\nAndrew Wilsmore says the redevelopments are positive for Alice Springs. (ABC Alice Springs: Victoria Ellis)\n\nMakeover for popular shopping centre\n\nRedevelopment plans for the Yeperenye Shopping Centre, which sits between Hartley and Bath streets, would result in the building growing to include a four-level car park with more than 200 parking bays, a new loading dock and click-and-collect facilities.\n\nYeperenye managing director Owen Cole said the $27 million redevelopment would include office spaces and a rooftop bar and restaurant.\n\nThe design for Yeperenye Shopping Centre's redevelopment. (Supplied: Owen Cole)\n\n\"We own office spaces around Alice Springs … so we've got our finger on the pulse; the demand is there,\" he said.\n\n\"We think tourists and locals alike will rush to participate in (a new non-licensed restaurant).\"\n\nOwen Cole, the managing director of Yeperenye Shopping Centre in Alice Springs. (ABC Alice Springs: Victoria Ellis)\n\nSupermarket giant Woolworths has been operating at the Yeperenye Shopping Centre for nearly 40 years, but will move to the Alice Plaza at the northern end of the Todd Mall in February 2028, at the end of its current lease.\n\nMr Cole said he had been in conversation with other supermarkets, such as Foodland, to move into the void left by Woolworths, but he ruled out retailer Aldi as an option.\n\nThe design for Yeperenye Shopping Centre's redevelopment. (Supplied: Owen Cole)\n\n\"We'd love to have an Aldi, but unfortunately they've already indicated on several occasions that they can't come to the Territory because it's too far from their distribution centre, the closest of which is in Adelaide,\" he said.\n\nMr Cole said the redevelopment was expected to be completed by September 2027.\n\nFurther work in the pipeline\n\nAlice Springs Town Council and the Northern Territory government will spend $20 million on a new library to be built at the Civic Centre site above the council car park, due to the library outgrowing its current space.\n\nThe new library is planned to include more seating, study zones, collaborative spaces, and larger areas for children's programs, while also meeting accessibility and safety standards, supporting modern technology and digital services, and delivering a more comfortable space for the community.\n\nThe Alice Springs Public Library needs more space after 40 years in its current location. (ABC News: Elsie Lange)\n\nMr Wilsmore said there would be extensive community consultation before any design works were finalised.\n\nTourism Central Australia, which currently operates the visitor information centre at the Todd Mall, will move into the library space and take over the entire current library building once the new library is built.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-29/sa-36ers-bullets-scuffle-nbl-game/106281148",
    "title": "Seven players ejected after brawl in 36ers win over Bullets",
    "publish_date": "Wed, 28 Jan 2026 21:36:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Furious Adelaide coach Mike Wells has slammed the \"dangerous\" actions of two Brisbane imports after a wild scuffle led to seven ejections in the 36ers' blowout NBL win.\n\nThe ladder-leading 36ers punched their in-season Ignite Cup final ticket with a 107-74 Wednesday night victory, winning three of four quarters on the Gold Coast to collect enough points to book their spot in the February 22 spectacle against the New Zealand Breakers for a share in $400,000 prize money.\n\nWells was more concerned by what he claimed were punches thrown late in the final quarter after Bullets guard Hunter Maldonado tangled with Sixers big Nick Rakocevic to prompt an all-in scuffle.\n\nThe pair wrestled into empty chairs in the front row before Brisbane guard Terry Taylor arrived and put Rakocevic, who has already been suspended once this season, in a headlock.\n\nAll three were ejected while Bullets foursome Tristan Devers, Taine Murray, Alex Ducas and Sam McDaniel — the latter pair both inactive players out with injuries — were also marched from the building for joining from the bench.\n\nIn a statement, the NBL said the on-court incident has been referred to its Game Review Panel \"for consideration in accordance with the NBL Tribunal Rules\".\n\n\"Relevant parties will be notified of the next steps in the process,\" the statement read.\n\n\"No further comment will be made by the NBL while the matter is under review.\"\n\nWells struggled to contain his emotions post-game, slamming the actions of Maldonado and Taylor.\n\n\"By the time I got down there … Terry Taylor had Nick in a headlock in his back and Maldonado was punching him in the stomach,\" he claimed.\n\n\"That's not basketball. This is a hard-playing league … [but] that crossed the line.\n\n\"It concerned me … it rattled all of us. He's [Taylor] got a choke-hold … holding a guy by the neck. That is really dangerous.\n\n\"I was really scared for my player. I screamed at Terry, almost like a parent, like 'What are you doing?'.\n\n\"And Maldonado … he was not stopping. I am fired up and a little concerned.\"\n\nIn a post-game press conference, Mike Wells says he was \"fired up and a little concerned\". (ABC News)\n\nThe incident left the already injury-ravaged Bullets with one player on the bench, the 36ers awarded four free-throws and kicking on in the fourth quarter.\n\nThe 33-point loss was Brisbane's 16th from their last 17 games and follows losses of 32 and 38 points in their last two contests.\n\nAdelaide sharp-shooter DJ Vasiljevic stoked the flames further, describing the Bullets' actions as \"unprofessional\".\n\n\"Throwing cheap shots at us because they're going to finish last. I hope the league looks into it,\" he said.\n\nInterim coach refutes Adelaide's claims\n\nBut interim Brisbane coach Darryl McDonald refuted Adelaide's claims.\n\n\"I saw Rakocevic like, power drive Maldonado [into the ground],\" he said.\n\n\"Guys protecting each other … nobody threw punches. He [Maldonado] was trying to get away from the guy.\n\n\"Go to the tape, have a look.\"\n\nBullets forward Jacob Holt had a career-high 24 points in another promising display while Adelaide were led by new import John Jenkins (19 points) and the irrepressible Bryce Cotton (22 points, seven assists, five rebounds).\n\nIsaac Humphries and Flynn Cameron both had 16 points as the visitors shared the load.\n\nA 39-point final term blew the lead out after the Brisbane had won the second quarter and trailed by just six at the main break.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/williams-refuses-to-rule-out-comeback-20260129-p5ny23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Williams refuses to rule out comeback",
    "publish_date": "Thu, 29 Jan 2026 13:38:07 +1100",
    "category": "finance",
    "authors": [],
    "text": "Williams refuses to rule out comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-aussies-in-doubles-semis-svitolina-takes-on-world-no-1-sabalenka-pegula-to-battle-against-rybakina-20260128-p5nxqk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Aussies in doubles semis; Svitolina takes on world No.1 Sabalenka; Pegula to battle against Rybakina",
    "publish_date": "Thu, 29 Jan 2026 13:33:18 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney",
      "Roy Ward"
    ],
    "text": "If you thought Novak Djokovic was having the craziest tournament of his life with two of his AO 2026 opponents retiring hurt before his stroll into the semis, think again.\n\nTen years ago, at the US Open, the Djoker benefited from several retirements and a walkover.\n\nLorenzo Musetti embraces Novak Djokovic after retiring hurt from their quarter-final. Credit: AP\n\nIn the second round that year, Jiri Vesely withdrew before their match due to an arm injury.\n\nMikhail Youzhny retired during the third round while trailing 4-2 in the first set, due to a leg injury.\n\nOnce Djokovic reached the quarter-finals, Jo-Wilfried Tsonga retired while trailing 6-3, 6-2 due to a knee injury.\n\nBut none of this was enough for the tennis legend to lift the US Open crown. He eventually lost in the final to our favourite AO retiree, Swiss star Stan Wawrinka, 7-6, 4-6, 5-7, 3-6.\n\nCan Djokovic lift the Open crown for the record 11th time this year? Stick with us as the slam continues to find out.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/companies/pacgold-broadens-massive-gold-antimony-system-in-qld-20260129-p5ny1s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pacgold broadens massive gold-antimony system in Qld",
    "publish_date": "Thu, 29 Jan 2026 13:27:53 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Pacgold broadens massive gold-antimony system in Qld Brought to you by BULLS N’ BEARS Rowena Duckworth January 29, 2026 — 1:27pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPacgold Limited has kept the drill bit busy and the excitement ticking over at its St George gold–antimony project in North Queensland, wrapping up its maiden reverse circulation (RC) drilling program with another set of shallow, high-grade antimony hits. The company says the new results have added weight to the idea that a much larger mineralised system may be lurking below the surface. Gold and stibnite in quartz vein at Pacgold Limited’s St George project in Northern Queensland. The first-pass nine-hole RC campaign, completed late last year, was designed to poke a few holes beneath historic workings at a once-forgotten antimony field that had already been flashing serious promise at surface. While the mineralised trend runs for more than a kilometre, drilling to date has tested just 200 metres of strike and even that light touch has delivered plenty of fireworks. The results from the last seven holes are now in. Two particular drill holes confirmed that antimony-rich quartz veins don’t stop at surface. Standout hits included 1 metre at 12.8 per cent antimony from 41m downhole. A second intercept returned 3m running at 1.6 per cent antimony from 67m and included a richer 1-metre slice grading a stunning 4.4 per cent antimony from 68m.\n\nAdvertisement\n\n‘The upside of this vast tenement package is immense.’ Pacgold Limited managing director Matthew Boyes Gold made its presence felt as well, adding extra shine to the story. Hits included a solid 8m grading 0.7g/t gold from 45m downhole and in another drillhole, the bit struck 1m at a steady 1.3g/t gold from 82m. Shallow mineralisation was also intersected, with 7m running at 0.5g/t gold from just 4m downhole in a third hole, including a 2m zone grading 1.2g/t gold from 8m depth. All up, seven of the nine RC holes drilled delivered anomalous antimony or gold - a tidy strike rate for a maiden program that barely scratched the edges of the system. Notably, the quartz veins remain open along strike to the north and south and down dip, leaving plenty of blue sky for follow-up drilling. The nine-hole program totalled 826 metres and intersected multiple north-trending quartz veins hosted in interbedded sandstone and shale, with widespread sericite alteration pointing to a fertile hydrothermal system. Historic records show the area previously produced about 60 tonnes of ore grading a staggering 60 per cent antimony from open pit and shallow underground workings during the 1960’s - proof that the rocks here know how to deliver.\n\nAdvertisement\n\nAnd St George isn’t a one-trick pony. The broader geological story shows Pacgold’s tenure sits within a major north-northwest–trending structural corridor that stretches for more than 20 kilometres and hosts multiple additional gold–antimony targets. These include the company’s Fence and Ridgeline gold-antimony prospects. Together with St George, the three prospects form part of a mineralised belt extending for more than 20 kilometres of strike across Pacgold’s tenement package. Pacgold Limited managing director Matthew Boyes said “Intersecting additional high grade antimony numbers confirms we have a large mineralised system which we have only just started to explore. The upside of this vast tenement package is immense, and 2026 is shaping up to be a massive year for our exploration crews.” The timing of these results couldn’t be better. Antimony has been thrust into the global spotlight as a critical mineral thanks to its role in defence, energy storage and advanced manufacturing, while gold prices continue to surge to new highs almost daily, supercharging the economics of any discovery that can grow scale and grade. With the North Queensland wet season temporarily slowing boots-on-the-ground fieldwork and drilling, Pacgold plans to return to St George in the June quarter with an expanded drill plan. The company says it plans to chase extensions beneath historic workings and fan out along the broader corridor to test a suite of high-priority regional targets. With shallow, high-grade antimony confirmed, gold along for the ride and kilometres of fertile ground still untouched, Pacgold looks to have plenty of reasons to be sharpening the drill bits ahead of what shapes as a very busy 2026.\n\nAdvertisement\n\nAs antimony surges up government agendas and gold prices soar due to geopolitical uncertainty, the drilling at St George appears to be hitting the right rocks at exactly the right time. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/aussie-apologises-as-umpire-caught-in-firing-line-20260129-p5ny1u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie apologises as umpire caught in firing line",
    "publish_date": "Thu, 29 Jan 2026 13:26:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie apologises as umpire caught in firing line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/ball-kid-steals-the-show-with-stunning-winner-20260129-p5ny1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ball kid steals the show with stunning winner",
    "publish_date": "Thu, 29 Jan 2026 13:26:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Ball kid steals the show with stunning winner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/daylesford-sunday-market-20260129-p5ny1f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daylesford Sunday Market",
    "publish_date": "Thu, 29 Jan 2026 13:18:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nThe market is on every Sunday - and you can even ride the train.\n\n7 / 7 The market is on every Sunday - and you can even ride the train.\n\nBe sure to stop by the bustling (and dog friendly) Daylesford Sunday market.\n\n2 / 7 Be sure to stop by the bustling (and dog friendly) Daylesford Sunday market.\n\nA visit to the bustling (and dog-friendly) Daylesford Sunday Market is a no-brainer (assuming it’s a Sunday). Located at the historic train station, there are up to 130 stalls to peruse each week selling everything from top-notch biltong to beef-tallow facial products. Crafts, plants, clothes, antiques, jewellery, tools and abound, too – and you can even ride the train! Hungry? There are loads of hot food stalls, and you’ll find more than a few marketeers fuelling up with a barbecued potato rostis topped with fried eggs and beetroot curry.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/companies/killed-the-ability-to-call-000-iphone-update-backfires-on-telstra-users-20260128-p5nxsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Killed the ability to call 000’: iPhone update backfires on Telstra users",
    "publish_date": "Thu, 29 Jan 2026 13:16:00 +1100",
    "category": "finance",
    "authors": [
      "Nick Bonyhady",
      "Elias Visontay",
      "Tim Biggs"
    ],
    "text": "Advertisement\n\nUpdated BusinessCompaniesTelecommunications ‘Killed the ability to call 000’: iPhone update backfires on Telstra users Nick Bonyhady, Elias Visontay and Tim Biggs Updated January 29, 2026 — 1:16pm ,first published January 28, 2026 — 7:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nAt least three iPhone models are unable to take or make phone calls on the Telstra network, in what is the latest telco glitch that left Australian customers momentarily unable to make Triple Zero emergency calls. By Thursday morning, a day after it first announced the issue, Telstra’s customers still appeared unable to use their own network to call emergency services, with an update from the company stating that such calls would have to rely on rival networks. The iPhone X, which has been affected by the issue, was released in 2017. Michael Nagle The company said that if affected customers saw “SOS calls” appear on their device, they would now be able to make calls to Triple Zero by automatically connecting to an alternative mobile network if available. “It can take some time (e.g. one minute) for the impacted device to connect to the alternative mobile network when one is available,” Telstra said in an update on Thursday morning.\n\nAdvertisement\n\nApple issued the software update to the iPhone 12 and other older models on January 26, but iPhone 8, 8 Plus and X users soon began reporting connection issues. Telstra confirmed on Wednesday afternoon that it was investigating an issue with the phones connecting to its network, including to Triple Zero. Loading “We’re working on this as a priority with Apple and will share updates as we have them,” the company said on its website. “We recommend customers using these devices delay updating the software on their device until we confirm the issue is resolved.” An Apple spokesperson said that by midday Thursday, it had identified a fix for Telstra customers and would be released in an upcoming software update.\n\nAdvertisement\n\nRelated Article Updated\n\nTelecommunications TPG says person dead after failed Triple Zero call When investigations were underway, Apple initially paused the software update that caused the issue; by Thursday afternoon, all versions of the update except for one – iOS 16.7.13 – had been rectified and reissued. The reliability of Triple Zero services has come under scrutiny since a major outage at Optus last year was initially linked to four deaths, though police later clarified the emergency call issue did not contribute to two of the fatalities. The others are under coronial investigation. In that incident, many phones that should have connected to another network to reach Triple Zero when Optus’ service failed were unable to switch. Similar failures separately affected older Samsung phones last year. The Apple update this month was intended to stop that type of problem from happening in other situations to users of its phones. “In the rare event that these exceptional circumstances affecting mobile operators’ networks were to happen again, some older mobile phones might still encounter the same issue reaching emergency services through an alternate available network,” the company said in a post on its website.\n\nAdvertisement\n\n“Software updates are available for the following iPhone and Apple Watch models that might be impacted by this network issue. You are encouraged to update your devices to the latest software version.” One user posted on Reddit that the update had left their phone “being near useless”. “Even after trying all of the troubleshooting and calling my carrier, I found that I was only able to connect to Wi-Fi,” the social media user said. “No calls, no SMS, no data. My phone can only be used on Wi-Fi. “And to top it off, it’s even killed the ability to call 000 – the entire reason the update was released in the first place.” Spokespeople for Optus and TPG, which also operates the Vodafone brand, said the Apple issue was not affecting their customers.\n\nAdvertisement\n\nRelated Article Telecommunications Triple Zero was built for 1960s phones. Can it handle 2025? Carol Bennett, the CEO of Australian Communications Consumer Action Network, said public confidence in the Triple Zero system “has taken a significant hit over the last 12 months”. “We have seen outages, device compatibility problems, mixed messaging and general confusion,” she said. Bennett noted the Triple Zero custodian had been in place for several months, but said the government must act further to create a “resilient and evolving” emergency communications system, including a national SMS to Triple Zero service as well as digital channels. “It is a top public safety priority that we strengthen and modernise the Triple Zero system. The chaos we saw last year is bleeding into this year. Enough is enough,” Bennett said.\n\nAdvertisement\n\nAssociate professor Mark Gregory, a telecommunications expert from RMIT University, said vendors, successive governments and the Australian Communications and Media Authority had all dropped the ball on Triple Zero over the past 15 years, and called for regulatory reform. “There needs to be tightening of the regulations. To ensure that the vendors understand fully what their role is in making handsets available for use by consumers in Australia,” he said. Loading “There needs to be performance measures within the legislation, and there needs to be penalties. And we need the government to step up and do something about it. But, you know, at the moment, it’s crickets.” Gregory said that changing technologies, such as rolling out upgrades from 4G to 5G, required specific oversight to ensure telcos didn’t break critical infrastructure in the process.\n\nAdvertisement\n\nRelated Article Investigation\n\nTelecommunications The emails that reveal how Optus downplayed the Triple Zero disaster Federal opposition communications spokeswoman Melissa McIntosh said Telstra had urged customers not to install the update until it had been fixed and advised people to find an alternative way to communicate. “Once again, I am giving the public service announcement on an important issue impacting the safety of our citizens when it should be the Albanese Labor government,” she said in a statement. A spokesman for Communications Minister Anika Wells said Telstra and Apple had advised the government they were working to fix the issue urgently. “People affected should contact Telstra as their service provider if they are concerned or have special needs,” the spokesman said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/queensland/fears-over-vaccine-rollout-after-collapse-keeps-state-s-storage-facility-shut-20260129-p5nxxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears over vaccine rollout after collapse keeps state’s storage facility shut",
    "publish_date": "Thu, 29 Jan 2026 13:01:56 +1100",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Advertisement\n\nNationalQueenslandQueensland Health Fears over vaccine rollout after collapse keeps state’s storage facility shut Courtney Kruk January 29, 2026 — 1:01pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStructural damage to a vaccine storage facility used by Queensland Health could take months to be fixed, raising fear of stock shortages and delays to vaccination schedules. A large section of the loading bay floor and an adjoining retaining wall collapsed at Toll Group’s healthcare distribution centre in Richlands, west of Brisbane, in late December, forcing the warehouse’s closure over safety concerns. The $10 million custom-designed facility is used by Queensland Health and biotechnology multinational CSL to store and distribute vaccines and pharmaceuticals and was opened in 2023. A structural collapse at Toll’s Richlands warehouse disrupted vaccination supply across Queensland. Toll Group Toll established a temporary storage facility following the collapse, but the incident resulted in delays to vaccine deliveries, including childhood vaccines offered through the National Immunisation Program.\n\nAdvertisement\n\nRelated Article Flu season ‘This is not the record we want to be breaking’: Anti-vax ideology helping flu surge, GPs say A spokesperson for the Australian Medical Association Queensland said it was “aware of some practices experiencing difficulty accessing vaccines and has sought an urgent update from Queensland Health”. Queensland Health said service providers should not be concerned about access to vaccine stock. “We took immediate action to avoid any disruption to vaccine supply following an incident at Toll’s storage facility and Toll have established a temporary site in Victoria to support the Queensland vaccine program,” a Queensland Health spokesperson said. “Incoming orders are being prioritised according to most urgent need and it is anticipated that distribution will normalise soon.”\n\nAdvertisement\n\nQueensland Health said stock remained safely stored with appropriate temperature control until access could be co-ordinated. The department was working with Toll to ensure access to the Richlands site as soon as possible. But the scope of structural damage is significant and will require engineering assessments to determine how and when the warehouse can return to operating as usual, with access to the site closed indefinitely. A CSL spokesman said the damage to the facility had not affected its supply chain given the company primarily focused on flu vaccines, which were not required for at least two months in preparation for the winter period. “The supply of CSL products to healthcare professionals and patients hasn’t been impacted as we have been able to supply from within our network,” the spokesman said. Toll was contacted for comment. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-for-flat-start-wall-street-steady-ahead-of-fed-decision-20260129-p5nxu7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX extends losses as tech stocks slump",
    "publish_date": "Thu, 29 Jan 2026 12:58:57 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX extends losses as tech stocks slump Staff reporter Updated January 29, 2026 — 12:58pm ,first published January 29, 2026 — 5:18am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has added to its early losses to fall deep into the red on Thursday while Wall Street recorded a steady session after the Federal Reserve, as expected, kept interest rates on hold. The S&P/ASX 200 was down 69.2 points, or 0.8 per cent, to 8864.7 just after midday, with 10 of 11 industry sectors losing ground. The only sector in the green is energy where stocks are being boosted by a rise in oil prices after US President Donald Trump threatened another attack on Iran, urging Tehran to negotiate a nuclear deal. The Australian dollar was trading at US70.27¢ at 12.39pm AEDT. Wall Street was steady after the latest Federal Reserve decision. AP Mining stocks are mixed, with the iron ore players going backwards, shedding some of their big gains from this week. BHP lost 0.7 per cent, Fortescue tumbled 2.3 per cent and Rio Tinto shed 1.6 per cent.\n\nAdvertisement\n\nAs global investors have stepped away from the US dollar due to political instability and other worries, prices have surged for gold and other metals as people look for something safer to own. Gold’s price topped $US5000 ($7103) per ounce this week for the first time, and it added another 4.3 per cent to settle at $US5340.20. That global turmoil is underpinning miners like Northern Star – it surged 2.3 per cent - and Evolution Mining – up 0.9 per cent – in early trade. Energy stocks rose as oil reached a fresh four-month high. The potential risk to Iranian supplies has injected a premium into oil prices and led futures to start the year on a strong footing, up more than 10 per cent this month, despite forecasts for a glut. That has also kept the cost of bullish options high relative to bearish ones. Woodside added 0.5 per cent, Santos climbed 0.2 per cent and Whitehaven Coal jumped 3.2 per cent after it reported robust sales in the December quarter. Financial stocks are mixed with Commonwealth Bank down 0.9 per cent, Westpac shedding 0.5 per cent while ANZ Bank added 0.2 per cent and National Australia Bank advanced 0.4 per cent. Tech stocks lost ground with Xero down 2.5 per cent and WiseTech dropping 1.9 per cent.\n\nAdvertisement\n\nOvernight, the S&P 500 inched down by less than 0.1 per cent from its all-time high as the Fed pressed pause. The Dow Jones Industrial Average added 12 points, or less than 0.1 per cent, and the Nasdaq composite rose 0.2 per cent. Tesla, Microsoft and Meta released results after the closing bell. Tesla said it would invest $US2 billion in chief executive Elon Musk’s artificial intelligence company xAI – and that production plans for its Cybercab robotaxi and Semi trucks were on track for this year. Musk has pivoted Tesla from an electric vehicle maker to an AI company, with much of the company’s $US1.5 trillion valuation hanging on that bet. The investment in xAI is expected to bolster his autonomous driving and robotics ambitions. Tesla’s shares were up about 3.4 per cent in extended trading.\n\nAdvertisement\n\nThe Austin, Texas-based company reported revenue of $US24.9 billion for the three months ended December 31, beating analysts’ average estimate of $US24.79 billion, according to data compiled by LSEG. Related Article Opinion\n\nCurrency wars Should you book a US holiday? Aussie dollar and gold hit new highs Elizabeth Knight Business columnist Microsoft’s spending surged to a record high and cloud sales growth slowed, sending the shares down amid investor concerns that it could take longer than expected for the company’s AI investments to pay off. Capital expenditures for the fiscal second quarter hit $US37.5 billion, up 66 per cent from a year earlier and exceeding analyst estimates for $US36.2 billion. Microsoft shares fell about 5 per cent in extended trading after closing at $US481.63 in New York.\n\nAdvertisement\n\nMeta’s robust advertising business, which boosted its current-quarter outlook above estimates, is making it possible for the company to invest at record levels on artificial intelligence this year. The owner of Facebook said first-quarter sales will be $US53.5 billion to $US56.5 billion, beating the $US51.3 billion average analyst estimate. The owner of Facebook said full-year capital expenditures will be $US115 billion to $US135 billion, exceeding the $US110.6 billion average analyst estimate, according to data compiled by Bloomberg. Meta shares gained as much as 4.9 per cent in after-market trading after closing at $US668.73. Nvidia, the stock that’s become the poster child of the AI boom, climbed 1.6 per cent and was the strongest single force lifting the S&P 500. It also benefited from an encouraging report from ASML, whose machinery helps make chips.\n\nAdvertisement\n\nThe Dutch company gave a forecast for revenue in 2026 that topped analysts’ expectations, and chief executive Christophe Fouquet said customers had been notably more encouraged about “the sustainability” of AI demand. That helped allay concerns that the AI frenzy has gone overboard and created a potential bubble that may burst. Related Article Opinion\n\nTrade wars The ‘mother of all deals’ that will infuriate Trump Stephen Bartholomeusz Senior business columnist On the losing end of Wall Street was Amphenol, whose stock tumbled 12.2 per cent even though it reported a stronger profit than analysts had forecast. Expectations were high for the maker of fiber-optic connectors and other high-tech equipment after its stock came into the day with a surge of 23 per cent for the young year so far. Apple slipped 0.7 per cent ahead of its profit report coming on Thursday. Because of its immense size, it was the single heaviest weight on the S&P 500. In the bond market, Treasury yields held relatively steady following the Fed’s widely expected move to hold its main interest rate steady.\n\nAdvertisement\n\nThe Fed’s chair, Jerome Powell, said that interest rates look to be “in a good place” at the moment, giving the central bank time to and wait and see how things progress. In the meantime, “the economy has once again surprised us with its strength”, he said. The yield on the 10-year Treasury remained at 4.24 per cent, where it was late Tuesday. With AP, Bloomberg The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/cliffy-s-emporium-20260129-p5ny1a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cliffy’s Emporium",
    "publish_date": "Thu, 29 Jan 2026 12:57:21 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nA semi-canopied street, a spaghetti-western frontage and 1950s advertisements for tea and cocoa colour this Daylesford icon categorically cute. An adorable edit of pantry fillers lines its walls, while in the kitchen, poached eggs are plated with tabbouleh and cardamom yoghurt and ferried out to hungry weekenders and locals alike. Great coffee is a guarantee, and the visual merchandising deserves a medal – budget extra time for browsing.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/the-nasty-handbrake-slowing-djokovic-fairytale-20260129-p5ny16.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The nasty handbrake slowing Djokovic fairytale",
    "publish_date": "Thu, 29 Jan 2026 12:49:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "The nasty handbrake slowing Djokovic fairytale\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/wombat-hill-house-cafe-20260129-p5ny10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wombat Hill House Cafe",
    "publish_date": "Thu, 29 Jan 2026 12:48:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nYou don’t need to go far to find good coffee and breakfast in Daylesford. But if you do fancy a stroll, Wombat Hill House Cafe eagerly awaits your custom at the peak of the majestic botanic gardens. Run by the team that brought you the Lake House and its inestimable pleasures, a morning here is best spent with a brekkie pizza, a cup of joe, and a gentle traipse through these magnificent gardens.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/bull-shark-caught-in-sydney-harbour-20260129-p5ny0y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bull shark caught in Sydney Harbour",
    "publish_date": "Thu, 29 Jan 2026 12:42:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/philippoussis-stuns-legends-cup-with-miraculous-tweener-20260129-p5ny0q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Philippoussis stuns Legends' Cup with miraculous tweener",
    "publish_date": "Thu, 29 Jan 2026 12:31:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Philippoussis stuns Legends' Cup with miraculous tweener\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/winespeake-cellar-and-deli-20260129-p5ny06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Winespeake Cellar & Deli",
    "publish_date": "Thu, 29 Jan 2026 12:27:38 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nThe first thing to know about the gourmet wonderland of Daylesford is that all roads – physical and metaphorical – lead to Winespeake Cellar and Deli. One of Victoria’s best-loved bottle shops, it’s stocked to the hilt with limited-edition local releases and worldly pleasures in equal measure. Fancy tinned fish and local cold cuts abound, too – some even make delicious appearances in their outstanding toasties. Bring a market trolley, fill it with one of everything, pour it out on the lounge room carpet and have yourself an Airbnb picnic for ages.\n\nAlso now in Anglesea.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/rawness-and-urgency-in-couple-s-sydney-festival-dance-debut-20260125-p5nwtj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cultural elites skewered as mayhem descends on dinner party in new David Williamson play",
    "publish_date": "Thu, 29 Jan 2026 12:24:59 +1100",
    "category": "entertainment",
    "authors": [
      "Chantal Nguyen",
      "Kate Prendergast",
      "Joyce Morgan"
    ],
    "text": "Advertisement\n\n★★★½ CultureLive reviewsStage shows Cultural elites skewered as mayhem descends on dinner party in new David Williamson play Chantal Nguyen , Kate Prendergast and and Joyce Morgan Updated January 29, 2026 — 12:24pm ,first published January 25, 2026 — 12:47pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHEATRE\n\nThe Social Ladder\n\nEnsemble Theatre\n\nJanuary 28, until March 14\n\nReviewed by JOYCE MORGAN\n\n★★★½ From Macbeth to August: Osage County, the dinner party that unravels has long been a theatrical trope. Veteran playwright David Williamson uses this to fine comedic effect, taking aim at his favourite subject – status-obsessed Sydney. This time he skewers how the city’s wealthy garner power and cultural cachet through appointments to boards of arts institutions. Mandy Bishop as Katie with Johnny Nasser as her husband Roger in The Social Ladder. Phil Erbacher Social climber Katie Norrie (Mandy Bishop) wants a seat on one of the most prestigious: the Art Gallery of NSW’s fund-raising foundation. She has a plan to win her glittering prize.\n\nAdvertisement\n\nShe invites Sydney’s most influential couple to dinner. Pillars of the establishment, Catherine (Sarah Chadwick) and Charles Mallory (Andrew McFarlane) are major art collectors and on every elite cultural board in town. Desperate to impress, Katie has borrowed an Arthur Boyd masterpiece, hired a celebrity chef to cook, and invited a lefty filmmaker friend and his teacher wife to join them. What could go wrong? Pretty much everything – but no prizes for guessing that. The glee is in watching just how slippery the rungs on this social ladder will be. On a sparse stage, the first three scenes swiftly set up the three couples ahead of the crucial dinner party in this tightly plotted play. Katie has grown up in the Shire and never shaken her working-class accent. Her husband Roger (Johnny Nasser), born into wealth, has little patience for her social ambitions and has a beef with Charles Mallory.\n\nAdvertisement\n\nAndrew McFarlane as ruthless billionaire Mallory with Sarah Chadwick as his wife Catherine. Phil Erbacher Mallory is a ruthless billionaire; his wife Catherine has a cut-glass English accent that conceals her humble roots. Ben (Matt Minto) and Laura Gregory (Jo Downing) have been dropped from Katie’s social circle for several years and are sceptical of why they’re suddenly back in favour. As the dinner party is poised to get under way, Katie’s home is revealed in its bright, brash glory. The hostess in an eye-popping confection and Catherine in sleek ivory are delicious visual contrasts. Veronique Benett’s pitch-perfect set and costumes are a joy to behold. As the dinner party descends into alcohol-fuelled mayhem, anti-woke Charles clashes with Ben over diversity and unions, with Laura over tax avoidance and with Roger over business dealings. Secrets are disclosed – not least about that wow painting. Bitterness and recriminations ensue.\n\nAdvertisement\n\nSo, too, does some Bollywood dancing. For amid the havoc, much fun is to be had in this light-hearted comedy. Matt Minto, Mandy Bishop and Sarah Chadwick in The Social Ladder. Phil Erbacher The three couples are stock types who argue their positions effectively, rather than fleshed-out characters. But the dialogue is sharp, there are laugh-out-loud lines, and Janine Watson’s brisk direction maintains the pace with her capable cast. Bishop is terrific as the brazen Katie, whose grand plans become smoking ruins along with the roghan josh. Chadwick impresses as the imperious Catherine, as does McFarlane as her shameless old bull of a husband who can’t say no to an income stream. The ending is upbeat, although Roger’s volte-face comes out of the blue.\n\nAdvertisement\n\nThis is classic Williamson, replete with witty observations and great one-liners. It tickles the funny bone and pricks the bubble of privilege. THEATRE\n\nGod’s Cowboy\n\nFlight Path Theatre\n\nJanuary 28, until February 21\n\nReviewed by KATE PRENDERGAST\n\n★★ At some point, I started to wonder if I’d fallen into an alternative universe. Had I hit my head on the way to Flight Path, that quaint little Marrickville theatre with its surprise overhead aircraft crescendos? Had I lost my powers of comprehension? With queer love and sexual trauma the preoccupying themes, this debut play by stage producer Les Solomon resembles a conceptual sequence of soapy non sequiturs, scudding awkwardly into a middle distance. Or, perhaps, a lame steed that could not be brought to water, and so wanders into the desert. God’s Cowboy idled several years in development and really should have remained in purgatory, instead of saddling up for this year’s Mardi Gras.\n\nAdvertisement\n\nPeter (Nathaniel Savy) in a dashing, kink-coded ensemble gifted by Daniel (Max Fernandez). David Hooley Characters describe and behave towards each other in ways that not only don’t make sense, they profoundly baffle. The plot gropes towards a non-collapsible shape. The more provoking scenes, involving intimate boundaries being crossed, are not always discomforting in ways that are productive and justifiable. And the ‘memory play’ framing device suffers from amnesia, with the middle section seeming to forget that the story began in a fourth-wall-breaking flashback narrated by twins Peter (Nathaniel Savy) and Penny (Sophia Laurantus). When another flashback was deployed didactically at the end, the audience startled. The gist of it all: our young sibling pair are relating to us the time when they were both cast in a play of their own, and so crossed paths with fellow actor Daniel (Max Fernandez), a Midnight Cowboy-inspired gunslinger lead. First of all, it’s odd that Fernandez got the role of this ‘dark and mysterious’ stranger when the impressively toned and charismatic Savy seems far more suited. But it’s also confusing why either of the twins are drawn to the character of Daniel at all, given his repertoire appears to be making people feel uncomfortable with slimy drawls, snickers and an aggressively cavalier attitude towards sex. Yet, almost in the blink of an eye, we witness the earnestly angelic Peter, a lover of old-timey musicals, fall in love. Somehow, “illiterate f--- nugget” becomes the phrase that breaks the ice and bonds them. Peter had just hurled it at Daniel after (mistakenly) suspecting him of assaulting his sister. And now they’re on the bedroom floor laughing.\n\nAdvertisement\n\nPenny’s subplot of her own queer romance feels perfunctory and wholly underdeveloped. There’s another character, Demetrius (Tate Wilkinson Alexander), whose function is to prowl around with sly and shady intent. Another bizarre logic connecting events occurs between the two acts. Daniel, a former sex worker and the victim of horrific childhood abuse, has for a split-second been overtaken by the demons of his past, and turned monstrous himself when Peter is at his most vulnerable. Peter initially won’t even talk to him. Then he’s performing a gorgeous balletic dance for him. Then he’s insisting Daniel meet his parents. There is another scene in which we see Daniel in the play-within-a-play monologuing about how God wants us to fornicate; to be unashamed of our “manacondas” and “penis fly traps”. The coup de grace at the end is a sentimental and improbable callback to Peter’s favourite movie, Carousel. At last, it was over.\n\nAdvertisement\n\nOPERA\n\nHansel & Gretel\n\nOpera Australia, Joan Sutherland Theatre, Opera House\n\nJanuary 27, until February 25\n\nReviewed by PETER McCALLUM\n\n★★★½ Sydney rejected the composer Engelbert Humperdinck when he applied to become the first director of the Conservatorium in 1914. The fact that Australia had gone to war with Germany just after he submitted his application might have had something to do with it. But Sydney has been more receptive to Humperdinck’s most famous work, Hansel & Gretel as demonstrated by the warm audience reception for this revival by Claudia Osborne of the 1992 production by one of Opera Australia’s best-loved and most frequently revived directors, the late Elijah Moshinsky. Stacey Alleaume as Gretel and Margaret Plummer as Hansel out front of the gingerbread house. Carlita Sari Photo Humperdinck’s achievement was to combine the simplicity of easily memorable, folk-like melodies with harmonic sophistication and an ability to develop musical ideas without overworking them. With a predominantly female cast (there is only one male role) and a children’s chorus, the sound-world is bright, leavened with richer and darker colours by finely-crafted orchestration. Whether the Grimms’ story cuts through with today’s young people I am unsure, but, in the absence of social media, one has to do something.\n\nAdvertisement\n\nMargaret Plummer (Hansel) and Stacey Alleaume (Gretel) drive the action with childish naughtiness and deft musical finesse. Plummer creates the obnoxiousness of little boys with gentle humour and sings with a voice of crimson depth and clarity. Alleaume’s Gretel darts with playful mischief, fine filigree and silvery vocal delight. In Moshinsky’s conception, the mother, Gertrud, in the libretto by Adelheid Wette (Humperdinck’s sister), becomes a harassed scolding stepmother (thus enabling a moment of poignancy in the dream sequence of Act 2). Margaret Plummer as Hansel, Stacey Alleaume as Gretel and Helen Sherman as Stepmother. Carlita Sari Photo Helen Sherman projected the Stepmother’s role firmly, injecting stridency into the sound when the children were particularly irritating. Shane Lowrencev sang the father’s rollicking tipsy entrance song with robust tone and carried the role with lusty flexibility of line. Jane Ede was a fearsome Witch, singing with ringing clarity so that the voice lingered in the head like the foreboding laughter of an unfavourite great aunt. Shikara Ringdahl sang the Sandman’s song with unassuming simplicity. Kathryn Williams as Dew Fairy with some of the troupe. Carlita Sari Photo\n\nAdvertisement\n\nKathryn Williams’ cameo as a clear-voiced Dew Fairy was supported by the clumsy awkwardness of a ballet-school troupe. Humperdinck subtly subverts the expectation of a surging operatic peroration by giving the final apotheosis to a children’s choir, which the Opera Australia Children’s Chorus delivered with nicely shaded pastel colours in quiet moments and sparkling clarity at the close. Conductor Tahu Matheson unfolded the musical narrative without exaggeration and the Opera Australia Orchestra nurtured the score’s finery with warm sound from horns and lower brass. In the first act Mark Thompson’s set is a claustrophobic cottage which becomes oversized in Act 2 as though the children had fallen asleep hungry after the scolding and all the nonsense no more troubling than a dream. DANCE\n\nSISA-SISA\n\nBankstown Arts Centre, January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★ The double bill SISA-SISA (Indonesian for “the remains” or “remnants”) marks the Sydney Festival debut of the extraordinary husband and wife duo Murtala and Alfira O’Sullivan, co-directors of the Indonesian cultural company Suara Dance.\n\nAdvertisement\n\nComprising two autobiographical solos, SISA-SISA represents long-awaited recognition for the couple, who have spent years channelling their energy into dance troupe choreography. Alfira O’Sullivan in SISA-SISA. Victor Frankowski Both husband and wife possess an artistic maturity that makes its presence felt immediately: the kind that sears with intense honesty and a stage presence earned after only decades of experience. O’Sullivan’s work, Jejak & Bisik (which can be translated to “traces and whispers”), explores O’Sullivan’s life as an ageing female dancer caught in the crosshairs of unrelenting professional demands, motherhood and community leadership, and a traumatic misdiagnosed miscarriage. Alfira and Murtala O’Sullivan in the Sydney Festival show SISA-SISA. Victor Fankowski\n\nAdvertisement\n\nAs O’Sullivan changes costumes and fixes her hair on stage, her mobile phone buzzes with voice messages while emails from a management company pop up on-screen. A polite corporate voiceover reads them out: As O’Sullivan’s profession is relegated to “the multicultural stage” and deemed unsuitable for “mainstream” white Australian audiences, it will be subject to various constraints including a fee reduction. Could she create a dance piece for a conference, sandwiched between the Monday morning speaker and the keynote speaker, designed to keep people awake? Using her community troupe? For less than $500? During a period when she is recovering from reproductive surgery? O’Sullivan, blessed with a striking natural glamour, demonstrates a beautiful sense of embodied theatricality and poise as she communicates this emotional journey. Murtala’s piece, Gelumbang Raya (which can be translated as “the Great Wave”), is his danced memory of recovering the bodies of victims of the Boxing Day Tsunami. A local of Aceh, Murtala returned after the tsunami as a disaster relief volunteer, working with survivors and — quite literally — staring death in the face as he carried thousands of bodies out of the mud. Gelumbang Raya is haunting in its rawness and urgency, performed on a stage strewn with sand and visual projections of tides washing in and out. It incorporates Acehnese body percussion, singing, and the frame drum — 11 of which lie buried in the sand, like lives frozen in time by the tsunami. One of the piece’s final images — Murtala, lifted upside down in a head stand amidst the sand, singing in a piercing tenor as the drums lie around him — lands like a rip in your gut.\n\nAdvertisement\n\nTHEATRE\n\nasses.masses\n\nDrama Theatre, Sydney Opera House\n\nJanuary 24, until January 25\n\nReviewed by KATE PRENDERGAST\n\n★★★½ By the fourth hour, you’ve entered a state of trance. Your communal gaming herd is cheering on a self-elected temporary controller who’s playing a version of Guitar Hero in the Sydney Opera House to help a donkey maximise its fornicating delights. This is Sick Ass, one of many donkey avatars, who’s just reached the Astral Plane (aka donkey heaven) as a casualty in the worker-animal uprising. What began as a peaceful protest against the human overlords’ exploitative machine-first system went horribly wrong, leading to death, displacement and disunification within the movement. Patrons engrossed in the ass’s journey at the Sydney Festival show asses.masses. Your own ass is getting sore. Level complete, you all break for snacks.\n\nAdvertisement\n\nThe audience may have thinned after the third interval, with another four hours to go. But those who are spiritually invested for the long haul in this multidisciplinary, multidimensional epic and graphic radical allegory are all in – and rewarded for their loyalty. Travelling through farm and village, circus and abattoir, nightmare and nirvana; through hundreds of ass puns and inventively obscene animations, while conquering button-mashing challenges and philosophical puzzles, we become a pack immersed through live social experiment in a stunningly rendered universe – comrades in a common goal towards “true progress”, united by the liberating mindset of play. Canadians Patrick Blenkarn and Milton Lim are behind the asses.masses project, brought to Sydney Festival for one weekend, and touring as far as Finland, Istanbul and Chicago next. Conceived with vast ambition, a collectivist sensibility and total nerd passion, it’s a unique animal of modern participatory theatre, using the language of video games and dorm-room humour to tell its staunch and timeless revolutionary tale. The game art is truly dope. The “material world” is built with nostalgia-infused pixels, its textures, dialogue boxes, tessellated realms and soundscapes recalling Legend of Zelda or Pokemon. The “astral plane” is of the realism style, transporting us to sublime desert canyons (where donkey souls rave) and rolling infinity pathways (where the player-crowd yells “don’t do drugs!” when a power-boost orb appears). Classics games such as Space Invaders and Pac-Man are built into the narrative to either create obstacles, or simply offer fun little inconsequential diversions. For example, we spent a gleefully inordinate amount of time in the mines getting the donkey foal avatar (whom we voted to name Bitch Ass) to play a version of Pong called Rocks. Later, another controller has Hard Ass hoof-kick a swarm of riot policeman dead a la Karate Champ. The difficulty level ramps up on our quest, with veteran pros stepping up to earn our thunderous applause.\n\nAdvertisement\n\nFar closer to Animal Farm than Animal Crossing, there are some intentionally lurid depictions of violence, particularly against humans – from the life-like screams of burning villagers, to a factory worker getting eviscerated by his own meat hook. Most hilariously macabre is a grim, surreal sequence in which Hard Ass has to sacrifice himself many times to create a corpse bridge for/of himself over a bloody trench. Obviously, with scores of people in the room, not everyone gets (or wants) a go at the controller. The majority are basic spectators – our ‘agency’ limited to adding to the cacophony of yelled dialogue options and directions, jokes and commentary. More theoretically than actually active, the player-herd moves through cycles of elation and fatigue, agony and ecstasy, frustrated boredom and shared jubilation. The durational aspect can take you to the edge: at one point I found myself cry-laughing at the excessively cautious way a controller was moving a mutinous gang of equines hidden inside packing boxes. During the seventh hour, we spontaneously rose to our feet to sing the “song of ascension”, a donkey funeral dirge. Would I have better enjoyed this marathon on a friend’s sofa, where we could have a more equitable share of the controller, and partake of snacks superior to Doritos and dry vegan buns? Sure. But enjoyment isn’t the only marker of a worthwhile experience. Sometimes you have to endure the discomfort to come out the other side, finding yourself, in some way, new.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/chris-minns-to-consider-creating-a-public-holiday-for-nsw/qnw89eo4p",
    "title": "Minns to consider creating public holiday fix for 'underserved' state",
    "publish_date": "Thu, 29 Jan 2026 01:10:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Only a select few million Australians are in line for an Anzac Day long weekend this year.\n\nThe state premier on Thursday flagged his government is in talks to create a new public holiday, accounting for Anzac Day falling on a Saturday.\n\nRemembrance services will be held nationwide on 25 April, but only people in Western Australia and ACT will get an additional public holiday on the following Monday.\n\n\"It's not just this year, it's next year as well that you don't get the day off,\" NSW Premier Chris Minns told Triple M radio on Thursday.\n\n\"And we [NSW] are underserved when it comes to public holidays, there's a lot more in every other state.\n\n\"We're going to have a conversation about it for this year.\"\n\nREAD MORE Here's the reason we should have more public holidays in Australia\n\nTalks with the Returned and Services League (RSL) would be held to ensure the creation of a long weekend didn't detract from the national day of remembrance.\n\n\"I've got to have confidence that it's not going to — if we have a public holiday on the Monday — it doesn't detract from the salience of the 25th,\" Minns said.\n\n\"It's got to be the 25th that's hugely important.\"\n\nThe Victorian government, which also doesn't observe the Monday holiday, and business groups were contacted for comment.\n\nAnzac Day is one of 10 public holidays recognised nationwide in 2026.\n\nMost Australians get another three or four, including those in Victoria, Queensland, ACT and South Australia.\n\nNSW observes two extra days: the King's Birthday in June and Labour Day in October.\n\nChristmas Island celebrates an extra six days, including two for Chinese New Year in mid-February.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/xi-jinping-has-dismissed-two-of-chinas-most-senior-generals/empvsrmcf",
    "title": "Xi Jinping has dismissed two of China's most senior generals. What does this mean?",
    "publish_date": "Wed, 28 Jan 2026 18:38:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Last weekend, China's defence ministry announced that the country's two most senior generals — Zhang Youxia and Liu Zhenli — would be removed from office and placed under investigation for serious disciplinary violations.\n\nZhang had been the People's Liberation Army's (PLA) most senior general since October 2022. He was the highest-ranking military member of the Politburo of the Communist Party of China (CCP), the party-state's 24-member executive policy-making body.\n\nZhang was also the senior vice chairman of the Central Military Commission (CMC), which controls the armed forces.\n\nLiu was the former commander of the PLA's Ground Force and had most recently been in charge of the CMC's Joint Staff Department.\n\nThe reaction to these developments outside China has led to dramatic headlines. A BBC headline initially focused on a \"military in crisis\", while the ABC called it an \"astonishing\" purge that leaves Chinese leader Xi Jinping almost alone at the top of the world's biggest army.\n\nCertainly, the moves were surprising. But so little is known about the internal workings of the CCP's leadership, including Xi's relations with his colleagues in the Politburo, that interpreting these developments is difficult, if not impossible.\n\nREAD MORE What to know about China's major military drills around Taiwan\n\nHere's what we know\n\nFor historical and political reasons, the PLA is an organisation of the CCP. Both fall under the direct purview of Xi, who is chair of the CMC, general secretary of the CCP and president of the country.\n\nThe removal of Zhang and Liu, at least temporarily, leaves military leadership under just Xi and general Zhang Shengmin. Three other members of the CMC have lost their positions since 2024 and haven't been replaced.\n\nThough the Chinese leadership is notoriously opaque, it is clear there have been disciplinary problems within the military in the last few years, particularly related to corruption and procurement in the more technically advanced departments of the PLA. Some two dozen senior military figures have been dismissed or investigated since 2022.\n\nZhang and Liu were fairly recent appointments to even more senior positions. Both were also seen as personal supporters of Xi. The fathers of Xi and Zhang had a close relationship dating back to the early days of the CCP, in the 1930s, before the establishment of the People's Republic of China in 1949.\n\nMoreover, the removals of Zhang and Liu happened more quickly than other senior military dismissals of recent years — and there were fewer warning signs. Both men had appeared in public as recently as a month ago.\n\nThe Wall Street Journal reported that Zhang is accused of providing the United States with information about China's nuclear weapons program, alongside allegations of accepting bribes and forming \"political cliques\".\n\nWhat will happen next?\n\nPast practice suggests that once a senior figure loses their status or is dismissed — for whatever reason — their downfall results in accusations of a litany of crimes.\n\nThe Politburo has also seen its share of intense internal politics in the past, though the precise circumstances of such conflicts usually take years to surface.\n\nA good example is the mysterious death of Lin Biao in 1971, another former PLA commander who, at the time, was Mao Zedong's designated successor.\n\nGiven the broader context at play here with the management of the military and the development of government programs in recent years, as well as the claims Zhang and Liu violated \"discipline and the law\", there are two possible explanations for their dismissals.\n\nBoth may have had direct involvement in corruption, taking bribes to appoint officials or ensure contracts for suppliers. It is equally likely they are being held responsible for corruption that has undoubtedly occurred in military procurement under their watch.\n\nThere is also the possibility of a difference of opinion within the CMC and the Politburo on how to deal with corruption, particularly within the military.\n\nXi has repeatedly stressed the importance of the fight against corruption since he became general secretary of the CCP in 2012.\n\nIn recent weeks, he has made this an even more important crusade in the context of the about-to-be-announced 15th Five-year Plan for Economic and Social Development. On 12 January, he designated the issue of corruption as a \"major struggle\" in a speech to China's top anti-corruption agency:\n\n\"Currently, the situation in the fight against corruption remains grave and complex … We must maintain a high-pressure stance without wavering, resolutely punishing corruption wherever it exists, eliminating all forms of graft, and leaving no place for corrupt elements to hide,\" he said.\n\nTo meet China's developmental goals, he added, the CCP \"must deploy cadres who are truly loyal, reliable, consistent and responsible\".\n\nIt is difficult to see Zhang and Liu or indeed anyone else currently willing or able to challenge Xi. Or, indeed, that Xi might feel immediately threatened by Zhang, Liu or others.\n\nTo that extent, Xi's personal position is neither strengthened nor weakened by these dismissals.\n\nOther analysts have suggested that the disruptions caused by the dismissals could lower Xi's confidence in his military. Some have even said the potential for an invasion of Taiwan has now been lowered.\n\nThe removal of so many leaders may indicate the PLA is now expected to undergo a culture change. At the same time, it would be drawing a very long bow to suggest its military capacity, generally or in relation to Taiwan, has either been strengthened or weakened.\n\nDavid S G Goodman, Director, China Studies Centre, Professor of Chinese Politics, University of Sydney\n\nDavid S G Goodman does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/a-new-partnership-for-a-new-era-pm-signs-cooperation-agreement-with-timor-leste/17i8lhdem",
    "title": "‘A new partnership for a new era’: PM signs cooperation agreement with Timor Leste",
    "publish_date": "Wed, 28 Jan 2026 08:56:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "‘A new partnership for a new era’: PM signs cooperation agreement with Timor Leste\n\nPublished 28 January 2026, 7:34 am\n\nPrime Minister Anthony Albanese is in Timor Leste, visiting ASEAN's newest member state, which is also being courted by China. He signed a new cooperation agreement in Dili but a resolution on mining the gas fields of the Timor Sea remains elusive.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/markets-bet-on-february-rba-interest-rate-rise-after-hot-inflation/jmgzgwxk2",
    "title": "Markets bet on February RBA interest rate rise after hot inflation",
    "publish_date": "Wed, 28 Jan 2026 08:03:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/video/man-charged-after-alleged-explosive-thrown-at-invasion-day-rally-in-perth/4ghuyq7h9",
    "title": "Man charged after alleged explosive thrown at Invasion Day rally in Perth",
    "publish_date": "Wed, 28 Jan 2026 07:50:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/high-inflation-could-push-the-rba-to-raise-rates/rj2dbncru",
    "title": "How much more will you pay? First rate hike in two years now highly likely",
    "publish_date": "Wed, 28 Jan 2026 06:35:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Increasing inflation and a \"hawkish\" approach to reducing it could lead to the first interest rate rise in more than two years, economists say.\n\nIt comes after inflation jumped on Wednesday, with the big four banks — Commonwealth, Westpac, NAB and ANZ — now all predicting a rate hike when the Reserve Bank of Australia's (RBA) monetary policy board convenes for its first meeting of the year on Tuesday.\n\nThe latest figures from the Australian Bureau of Statistics (ABS) showed headline inflation rose to 3.8 per cent in the year to December, up from 3.4 per cent in November. Meanwhile, the trimmed mean — which strips out volatile items — also edged higher to 3.3 per cent from 3.2 per cent.\n\nThe RBA's target band for inflation is 2-3 per cent.\n\nDavid Bassanese, chief economist at Betashares, anticipates the central bank will raise the cash rate following next week's meeting, giving banks a green light to raise interest rates.\n\n\"It's probably going to feel the need to rein in demand somewhat, and the way it does that is by raising rates.\"\n\nSource: SBS News\n\nRSM Australia economist Devika Shivadekar said a cash rate increase this year was a matter of when, not if, describing the RBA as \"hawkish\" and \"stern\" in its goal of reducing inflation.\n\n\"Next week's decision in my opinion is a close 55 to 45 in favour of a rate rise, with the RBA potentially opting to move pre-emptively and hike now rather than risk having to tighten more forcibly later,\" she said.\n\nShe said that anything more than a 0.25 percentage point increase, the most common incremental changes in recent years, would be \"overkill\".\n\nHow would repayments increase if rates rise?\n\nA 0.25 percentage point hike, which ANZ and Westpac joined in forecasting on Wednesday, would add about $90 in monthly repayments for an owner-occupier with a $600,000 mortgage.\n\nFor a $750,000 mortgage, an increase of that level would increase repayments by about $112 a month, while those with a $1 million home loan would fork out $150 more.\n\nGiven recent labour market and household spending data has also been running hotter than expected, the upside surprise on inflation is likely to heighten fears of a rate hike at the RBA's meeting.\n\n\"We think the RBA will conclude that demand is running ahead of supply and that an interest rate adjustment would help ensure inflation returns to the target,\" ANZ head of Australian economics Adam Boyton said.\n\nLISTEN TO Surprise jobs report boosts chance of February rate rise SBS News 11:14 English\n\nWestpac chief economist Luci Ellis also expects a February rate rise, but does not think it will be followed with further hikes.\n\nBefore the inflation release, traders were pricing in the chance of a February rate hike at about 60 per cent, after a drop in the unemployment rate heightened the RBA's fears about a lack of spare capacity in the labour market.\n\nImmediately following the release, market-implied odds of a rate hike climbed to more than 70 per cent, senior investment strategist at Global X Marc Jocum said.\n\nJocum believed a hawkish hold remained the most likely scenario for February, \"but the risks around that call are clearly skewed and mounting toward a rate hike\".\n\nThe RBA has not increased the cash rate since November 2023.\n\nWhat pushed inflation higher?\n\nThe rise in the CPI was driven by housing, up 5.5 per cent, followed by food and non-alcoholic beverages, up 3.4 per cent, and recreation and culture, which rose 4.4 per cent, the Australian Bureau of Statistics (ABS) said.\n\nElectricity costs rose 21.5 per cent in the 12 months to December, largely because of state electricity rebates in Queensland and WA being used up by households.\n\nShivadekar said that some sectors that experienced price increases would have been impacted by seasonal factors.\n\n\"We do know people travel during the school holidays. We know there are Christmas sale periods, so there's more hiring, more temp jobs created,\" she said.\n\n\"It's more seasonal demand than entrenched overheating.\"\n\nBassanese echoed this assessment, saying: \"An increase in things like accommodation, hospitality services, restaurants and takeaways could be a one-off thing, thanks to events like the Ashes [cricket series].\n\n\"We also saw above-average tourist-related spending.\"\n\nThe RBA kept the cash rate unchanged at 3.6 per cent for a third time at its last meeting in December, with governor Michele Bullock all but ruling out further mortgage relief in the new year.\n\n\"I don't think there are interest rate cuts on the horizon for the foreseeable future,\" Bullock said after the last meeting.\n\n— With additional reporting by the Australian Associated Press.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/thousands-owed-after-services-australia-applied-child-support-laws-incorrectly-ombudsman/c8k4pzfqf",
    "title": "Thousands owed after Services Australia applied child support laws incorrectly: Ombudsman",
    "publish_date": "Wed, 28 Jan 2026 05:14:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nA report from the Commonwealth Ombudsman has found that Services Australia knowingly broke child support laws for six years.\n\nBack in 2019, the agency identified that its policy of denying payments to parents with less than 35 per cent of care was unlawful.\n\nUnder the law, these parents are entitled to support, but Services Australia refused to enforce it, citing a \"longstanding principle\" that applying the law could result in a parent with little or no care of children receiving payments from the main carer.\n\nOmbudsman Iain Anderson told SBS that since the agency knew it was breaking the law for six years, it should have escalated the issue much sooner.\n\n\"So if a public servant thinks that the law is not working correctly. What they should do is tell people about it. Public servants can't change the law themselves. They need the agreement of ministers, cabinet and parliament, so they've got to escalate it. They've got to say, here's a problem that needs to be fixed, and they can't just pick or choose for themselves which parts of the legislation they're going to follow.\"\n\nMr Anderson says some of this legal non-compliance occurred prior to the Robodebt Royal Commission, and is acknowledging the department has since made efforts to improve its internal culture.\n\nMr Anderson is confirming that at least 16,600 people were affected, with some owed up to $10,000.\n\nHe says while these individuals have been informed that the law was applied incorrectly, the situation is complicated by the fact that those owed money were not the primary caregivers.\n\nAccording to Mr Anderson, there is no doubt the legislation was producing unintended consequences.\n\nIn response, the Ombudsman has made six recommendations, including a proposal to retroactively change the law so parents with less than 35 per cent of care cannot claim support, while simultaneously offering compensation to those already disadvantaged by the agency's past actions.\n\n\"We're talking about child support legislation here. With child support, it's really important that child support money gets paid to the parents who are caring for children. Now the unintended consequences here are some legislative amendments were that the parent who was doing most of the caring actually is required to pay child support to the parent who's not doing much of the caring. So that's a problem, and because it's child support, it needed to be fixed quickly.\"\n\nNational Legal Aid spokesperson Feiyi Zhang is declining to comment on a potential class action lawsuit, but is emphasising that individuals face significant hurdles when seeking legal redress for issues like child support.\n\n\"Yeah, so one of the issues is that we as legal aid commissions can only provide a limited amount of legal advice and very limited legal representation for people who are seeking help with their child support, rights and claims. So at the moment, only 8% of Australian households can actually access legal aid, while the poverty line stands at 13% so we anticipate, in response to this, this finding by the Ombudsman that there will be a significant increase in the number of people who will be seeking advice from us, and that will depend on the resources that we have available, but it's very limited.\"\n\nAccording to Ms Zhang, these administrative failures do more than just strain bank accounts; they trigger a domino effect that can lead vulnerable families into the justice system.\n\n\"I think the priority for us is making sure that Department of Social Services is accountable for the decisions that it makes impacting the people that we work with. People who miss out on government entitlements, who miss out on child support payments, can re enter our services, and the lack of access to the appropriate legal or government rights earlier on in their life can have compounding impacts, and they end up within the legal system, within the justice system, with, you know, worsening impacts on their lives. So it's really important that the government, you know, intervenes.\"\n\nThis isn’t the first time the agency’s handling of child support has come under fire.\n\nIn a separate investigation handed down last year, the Ombudsman found Services Australia was amplifying financial abuse by failing to enforce payments.\n\nAt the time, $1.9 billion was owed, with the debt affecting mostly mothers, who were disproportionately impacted.\n\nThe report, handed down last year, made eight key recommendations ranging from the urgent recovery of unpaid funds to better tracking of financial abuse within the system.\n\nTerese Edward, a spokesperson from Single Mother Families Australia, says what she calls ' the weaponisation' of the child support system needs to be addressed.\n\n\"So what we've got is a system that allows child support to be weaponised. And it's really simple. An ex partner, a vexatious ex partner, doesn't lodge a tax return in one year, five years, 10 years, there's no ramifications. A provisional or estimated amount is accepted, and then the consequences of that is we have children with an underpayment. We have children who are not receiving that really important money funnel from one parent to another. We need it only to function, not only to provide those necessary funds but also it should be a safe system.\"\n\nServices Australia spokesperson Hank Jongen says the department has already taken a range of steps to improve outcomes, including training for staff to ensure they’re equipped to recognise and support people experiencing financial abuse.\n\nMr Jongen says that the department will implement the recommendations from the Ombudsman report by the end of January.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/williams-refuses-to-rule-out-comeback-20260129-p5ny23.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Williams refuses to rule out comeback",
    "publish_date": "Thu, 29 Jan 2026 13:38:07 +1100",
    "category": "finance",
    "authors": [],
    "text": "Williams refuses to rule out comeback\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-aussies-in-doubles-semis-svitolina-takes-on-world-no-1-sabalenka-pegula-to-battle-against-rybakina-20260128-p5nxqk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Aussies in doubles semis; Svitolina takes on world No.1 Sabalenka; Pegula to battle against Rybakina",
    "publish_date": "Thu, 29 Jan 2026 13:33:18 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney",
      "Roy Ward"
    ],
    "text": "If you thought Novak Djokovic was having the craziest tournament of his life with two of his AO 2026 opponents retiring hurt before his stroll into the semis, think again.\n\nTen years ago, at the US Open, the Djoker benefited from several retirements and a walkover.\n\nLorenzo Musetti embraces Novak Djokovic after retiring hurt from their quarter-final. Credit: AP\n\nIn the second round that year, Jiri Vesely withdrew before their match due to an arm injury.\n\nMikhail Youzhny retired during the third round while trailing 4-2 in the first set, due to a leg injury.\n\nOnce Djokovic reached the quarter-finals, Jo-Wilfried Tsonga retired while trailing 6-3, 6-2 due to a knee injury.\n\nBut none of this was enough for the tennis legend to lift the US Open crown. He eventually lost in the final to our favourite AO retiree, Swiss star Stan Wawrinka, 7-6, 4-6, 5-7, 3-6.\n\nCan Djokovic lift the Open crown for the record 11th time this year? Stick with us as the slam continues to find out.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/companies/pacgold-broadens-massive-gold-antimony-system-in-qld-20260129-p5ny1s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pacgold broadens massive gold-antimony system in Qld",
    "publish_date": "Thu, 29 Jan 2026 13:27:53 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Pacgold broadens massive gold-antimony system in Qld Brought to you by BULLS N’ BEARS Rowena Duckworth January 29, 2026 — 1:27pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nPacgold Limited has kept the drill bit busy and the excitement ticking over at its St George gold–antimony project in North Queensland, wrapping up its maiden reverse circulation (RC) drilling program with another set of shallow, high-grade antimony hits. The company says the new results have added weight to the idea that a much larger mineralised system may be lurking below the surface. Gold and stibnite in quartz vein at Pacgold Limited’s St George project in Northern Queensland. The first-pass nine-hole RC campaign, completed late last year, was designed to poke a few holes beneath historic workings at a once-forgotten antimony field that had already been flashing serious promise at surface. While the mineralised trend runs for more than a kilometre, drilling to date has tested just 200 metres of strike and even that light touch has delivered plenty of fireworks. The results from the last seven holes are now in. Two particular drill holes confirmed that antimony-rich quartz veins don’t stop at surface. Standout hits included 1 metre at 12.8 per cent antimony from 41m downhole. A second intercept returned 3m running at 1.6 per cent antimony from 67m and included a richer 1-metre slice grading a stunning 4.4 per cent antimony from 68m.\n\nAdvertisement\n\n‘The upside of this vast tenement package is immense.’ Pacgold Limited managing director Matthew Boyes Gold made its presence felt as well, adding extra shine to the story. Hits included a solid 8m grading 0.7g/t gold from 45m downhole and in another drillhole, the bit struck 1m at a steady 1.3g/t gold from 82m. Shallow mineralisation was also intersected, with 7m running at 0.5g/t gold from just 4m downhole in a third hole, including a 2m zone grading 1.2g/t gold from 8m depth. All up, seven of the nine RC holes drilled delivered anomalous antimony or gold - a tidy strike rate for a maiden program that barely scratched the edges of the system. Notably, the quartz veins remain open along strike to the north and south and down dip, leaving plenty of blue sky for follow-up drilling. The nine-hole program totalled 826 metres and intersected multiple north-trending quartz veins hosted in interbedded sandstone and shale, with widespread sericite alteration pointing to a fertile hydrothermal system. Historic records show the area previously produced about 60 tonnes of ore grading a staggering 60 per cent antimony from open pit and shallow underground workings during the 1960’s - proof that the rocks here know how to deliver.\n\nAdvertisement\n\nAnd St George isn’t a one-trick pony. The broader geological story shows Pacgold’s tenure sits within a major north-northwest–trending structural corridor that stretches for more than 20 kilometres and hosts multiple additional gold–antimony targets. These include the company’s Fence and Ridgeline gold-antimony prospects. Together with St George, the three prospects form part of a mineralised belt extending for more than 20 kilometres of strike across Pacgold’s tenement package. Pacgold Limited managing director Matthew Boyes said “Intersecting additional high grade antimony numbers confirms we have a large mineralised system which we have only just started to explore. The upside of this vast tenement package is immense, and 2026 is shaping up to be a massive year for our exploration crews.” The timing of these results couldn’t be better. Antimony has been thrust into the global spotlight as a critical mineral thanks to its role in defence, energy storage and advanced manufacturing, while gold prices continue to surge to new highs almost daily, supercharging the economics of any discovery that can grow scale and grade. With the North Queensland wet season temporarily slowing boots-on-the-ground fieldwork and drilling, Pacgold plans to return to St George in the June quarter with an expanded drill plan. The company says it plans to chase extensions beneath historic workings and fan out along the broader corridor to test a suite of high-priority regional targets. With shallow, high-grade antimony confirmed, gold along for the ride and kilometres of fertile ground still untouched, Pacgold looks to have plenty of reasons to be sharpening the drill bits ahead of what shapes as a very busy 2026.\n\nAdvertisement\n\nAs antimony surges up government agendas and gold prices soar due to geopolitical uncertainty, the drilling at St George appears to be hitting the right rocks at exactly the right time. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nShares\n\nSharemarket",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/aussie-apologises-as-umpire-caught-in-firing-line-20260129-p5ny1u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie apologises as umpire caught in firing line",
    "publish_date": "Thu, 29 Jan 2026 13:26:44 +1100",
    "category": "sports",
    "authors": [],
    "text": "Aussie apologises as umpire caught in firing line\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/ball-kid-steals-the-show-with-stunning-winner-20260129-p5ny1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ball kid steals the show with stunning winner",
    "publish_date": "Thu, 29 Jan 2026 13:26:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Ball kid steals the show with stunning winner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/daylesford-sunday-market-20260129-p5ny1f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Daylesford Sunday Market",
    "publish_date": "Thu, 29 Jan 2026 13:18:03 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nThe market is on every Sunday - and you can even ride the train.\n\n7 / 7 The market is on every Sunday - and you can even ride the train.\n\nBe sure to stop by the bustling (and dog friendly) Daylesford Sunday market.\n\n2 / 7 Be sure to stop by the bustling (and dog friendly) Daylesford Sunday market.\n\nA visit to the bustling (and dog-friendly) Daylesford Sunday Market is a no-brainer (assuming it’s a Sunday). Located at the historic train station, there are up to 130 stalls to peruse each week selling everything from top-notch biltong to beef-tallow facial products. Crafts, plants, clothes, antiques, jewellery, tools and abound, too – and you can even ride the train! Hungry? There are loads of hot food stalls, and you’ll find more than a few marketeers fuelling up with a barbecued potato rostis topped with fried eggs and beetroot curry.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/companies/killed-the-ability-to-call-000-iphone-update-backfires-on-telstra-users-20260128-p5nxsc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Killed the ability to call 000’: iPhone update backfires on Telstra users",
    "publish_date": "Thu, 29 Jan 2026 13:16:00 +1100",
    "category": "finance",
    "authors": [
      "Nick Bonyhady",
      "Elias Visontay",
      "Tim Biggs"
    ],
    "text": "Advertisement\n\nUpdated BusinessCompaniesTelecommunications ‘Killed the ability to call 000’: iPhone update backfires on Telstra users Nick Bonyhady, Elias Visontay and Tim Biggs Updated January 29, 2026 — 1:16pm ,first published January 28, 2026 — 7:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nAt least three iPhone models are unable to take or make phone calls on the Telstra network, in what is the latest telco glitch that left Australian customers momentarily unable to make Triple Zero emergency calls. By Thursday morning, a day after it first announced the issue, Telstra’s customers still appeared unable to use their own network to call emergency services, with an update from the company stating that such calls would have to rely on rival networks. The iPhone X, which has been affected by the issue, was released in 2017. Michael Nagle The company said that if affected customers saw “SOS calls” appear on their device, they would now be able to make calls to Triple Zero by automatically connecting to an alternative mobile network if available. “It can take some time (e.g. one minute) for the impacted device to connect to the alternative mobile network when one is available,” Telstra said in an update on Thursday morning.\n\nAdvertisement\n\nApple issued the software update to the iPhone 12 and other older models on January 26, but iPhone 8, 8 Plus and X users soon began reporting connection issues. Telstra confirmed on Wednesday afternoon that it was investigating an issue with the phones connecting to its network, including to Triple Zero. Loading “We’re working on this as a priority with Apple and will share updates as we have them,” the company said on its website. “We recommend customers using these devices delay updating the software on their device until we confirm the issue is resolved.” An Apple spokesperson said that by midday Thursday, it had identified a fix for Telstra customers and would be released in an upcoming software update.\n\nAdvertisement\n\nRelated Article Updated\n\nTelecommunications TPG says person dead after failed Triple Zero call When investigations were underway, Apple initially paused the software update that caused the issue; by Thursday afternoon, all versions of the update except for one – iOS 16.7.13 – had been rectified and reissued. The reliability of Triple Zero services has come under scrutiny since a major outage at Optus last year was initially linked to four deaths, though police later clarified the emergency call issue did not contribute to two of the fatalities. The others are under coronial investigation. In that incident, many phones that should have connected to another network to reach Triple Zero when Optus’ service failed were unable to switch. Similar failures separately affected older Samsung phones last year. The Apple update this month was intended to stop that type of problem from happening in other situations to users of its phones. “In the rare event that these exceptional circumstances affecting mobile operators’ networks were to happen again, some older mobile phones might still encounter the same issue reaching emergency services through an alternate available network,” the company said in a post on its website.\n\nAdvertisement\n\n“Software updates are available for the following iPhone and Apple Watch models that might be impacted by this network issue. You are encouraged to update your devices to the latest software version.” One user posted on Reddit that the update had left their phone “being near useless”. “Even after trying all of the troubleshooting and calling my carrier, I found that I was only able to connect to Wi-Fi,” the social media user said. “No calls, no SMS, no data. My phone can only be used on Wi-Fi. “And to top it off, it’s even killed the ability to call 000 – the entire reason the update was released in the first place.” Spokespeople for Optus and TPG, which also operates the Vodafone brand, said the Apple issue was not affecting their customers.\n\nAdvertisement\n\nRelated Article Telecommunications Triple Zero was built for 1960s phones. Can it handle 2025? Carol Bennett, the CEO of Australian Communications Consumer Action Network, said public confidence in the Triple Zero system “has taken a significant hit over the last 12 months”. “We have seen outages, device compatibility problems, mixed messaging and general confusion,” she said. Bennett noted the Triple Zero custodian had been in place for several months, but said the government must act further to create a “resilient and evolving” emergency communications system, including a national SMS to Triple Zero service as well as digital channels. “It is a top public safety priority that we strengthen and modernise the Triple Zero system. The chaos we saw last year is bleeding into this year. Enough is enough,” Bennett said.\n\nAdvertisement\n\nAssociate professor Mark Gregory, a telecommunications expert from RMIT University, said vendors, successive governments and the Australian Communications and Media Authority had all dropped the ball on Triple Zero over the past 15 years, and called for regulatory reform. “There needs to be tightening of the regulations. To ensure that the vendors understand fully what their role is in making handsets available for use by consumers in Australia,” he said. Loading “There needs to be performance measures within the legislation, and there needs to be penalties. And we need the government to step up and do something about it. But, you know, at the moment, it’s crickets.” Gregory said that changing technologies, such as rolling out upgrades from 4G to 5G, required specific oversight to ensure telcos didn’t break critical infrastructure in the process.\n\nAdvertisement\n\nRelated Article Investigation\n\nTelecommunications The emails that reveal how Optus downplayed the Triple Zero disaster Federal opposition communications spokeswoman Melissa McIntosh said Telstra had urged customers not to install the update until it had been fixed and advised people to find an alternative way to communicate. “Once again, I am giving the public service announcement on an important issue impacting the safety of our citizens when it should be the Albanese Labor government,” she said in a statement. A spokesman for Communications Minister Anika Wells said Telstra and Apple had advised the government they were working to fix the issue urgently. “People affected should contact Telstra as their service provider if they are concerned or have special needs,” the spokesman said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/queensland/fears-over-vaccine-rollout-after-collapse-keeps-state-s-storage-facility-shut-20260129-p5nxxd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears over vaccine rollout after collapse keeps state’s storage facility shut",
    "publish_date": "Thu, 29 Jan 2026 13:01:56 +1100",
    "category": "finance",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Advertisement\n\nNationalQueenslandQueensland Health Fears over vaccine rollout after collapse keeps state’s storage facility shut Courtney Kruk January 29, 2026 — 1:01pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nStructural damage to a vaccine storage facility used by Queensland Health could take months to be fixed, raising fear of stock shortages and delays to vaccination schedules. A large section of the loading bay floor and an adjoining retaining wall collapsed at Toll Group’s healthcare distribution centre in Richlands, west of Brisbane, in late December, forcing the warehouse’s closure over safety concerns. The $10 million custom-designed facility is used by Queensland Health and biotechnology multinational CSL to store and distribute vaccines and pharmaceuticals and was opened in 2023. A structural collapse at Toll’s Richlands warehouse disrupted vaccination supply across Queensland. Toll Group Toll established a temporary storage facility following the collapse, but the incident resulted in delays to vaccine deliveries, including childhood vaccines offered through the National Immunisation Program.\n\nAdvertisement\n\nRelated Article Flu season ‘This is not the record we want to be breaking’: Anti-vax ideology helping flu surge, GPs say A spokesperson for the Australian Medical Association Queensland said it was “aware of some practices experiencing difficulty accessing vaccines and has sought an urgent update from Queensland Health”. Queensland Health said service providers should not be concerned about access to vaccine stock. “We took immediate action to avoid any disruption to vaccine supply following an incident at Toll’s storage facility and Toll have established a temporary site in Victoria to support the Queensland vaccine program,” a Queensland Health spokesperson said. “Incoming orders are being prioritised according to most urgent need and it is anticipated that distribution will normalise soon.”\n\nAdvertisement\n\nQueensland Health said stock remained safely stored with appropriate temperature control until access could be co-ordinated. The department was working with Toll to ensure access to the Richlands site as soon as possible. But the scope of structural damage is significant and will require engineering assessments to determine how and when the warehouse can return to operating as usual, with access to the site closed indefinitely. A CSL spokesman said the damage to the facility had not affected its supply chain given the company primarily focused on flu vaccines, which were not required for at least two months in preparation for the winter period. “The supply of CSL products to healthcare professionals and patients hasn’t been impacted as we have been able to supply from within our network,” the spokesman said. Toll was contacted for comment. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-for-flat-start-wall-street-steady-ahead-of-fed-decision-20260129-p5nxu7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX extends losses as tech stocks slump",
    "publish_date": "Thu, 29 Jan 2026 12:58:57 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX extends losses as tech stocks slump Staff reporter Updated January 29, 2026 — 12:58pm ,first published January 29, 2026 — 5:18am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has added to its early losses to fall deep into the red on Thursday while Wall Street recorded a steady session after the Federal Reserve, as expected, kept interest rates on hold. The S&P/ASX 200 was down 69.2 points, or 0.8 per cent, to 8864.7 just after midday, with 10 of 11 industry sectors losing ground. The only sector in the green is energy where stocks are being boosted by a rise in oil prices after US President Donald Trump threatened another attack on Iran, urging Tehran to negotiate a nuclear deal. The Australian dollar was trading at US70.27¢ at 12.39pm AEDT. Wall Street was steady after the latest Federal Reserve decision. AP Mining stocks are mixed, with the iron ore players going backwards, shedding some of their big gains from this week. BHP lost 0.7 per cent, Fortescue tumbled 2.3 per cent and Rio Tinto shed 1.6 per cent.\n\nAdvertisement\n\nAs global investors have stepped away from the US dollar due to political instability and other worries, prices have surged for gold and other metals as people look for something safer to own. Gold’s price topped $US5000 ($7103) per ounce this week for the first time, and it added another 4.3 per cent to settle at $US5340.20. That global turmoil is underpinning miners like Northern Star – it surged 2.3 per cent - and Evolution Mining – up 0.9 per cent – in early trade. Energy stocks rose as oil reached a fresh four-month high. The potential risk to Iranian supplies has injected a premium into oil prices and led futures to start the year on a strong footing, up more than 10 per cent this month, despite forecasts for a glut. That has also kept the cost of bullish options high relative to bearish ones. Woodside added 0.5 per cent, Santos climbed 0.2 per cent and Whitehaven Coal jumped 3.2 per cent after it reported robust sales in the December quarter. Financial stocks are mixed with Commonwealth Bank down 0.9 per cent, Westpac shedding 0.5 per cent while ANZ Bank added 0.2 per cent and National Australia Bank advanced 0.4 per cent. Tech stocks lost ground with Xero down 2.5 per cent and WiseTech dropping 1.9 per cent.\n\nAdvertisement\n\nOvernight, the S&P 500 inched down by less than 0.1 per cent from its all-time high as the Fed pressed pause. The Dow Jones Industrial Average added 12 points, or less than 0.1 per cent, and the Nasdaq composite rose 0.2 per cent. Tesla, Microsoft and Meta released results after the closing bell. Tesla said it would invest $US2 billion in chief executive Elon Musk’s artificial intelligence company xAI – and that production plans for its Cybercab robotaxi and Semi trucks were on track for this year. Musk has pivoted Tesla from an electric vehicle maker to an AI company, with much of the company’s $US1.5 trillion valuation hanging on that bet. The investment in xAI is expected to bolster his autonomous driving and robotics ambitions. Tesla’s shares were up about 3.4 per cent in extended trading.\n\nAdvertisement\n\nThe Austin, Texas-based company reported revenue of $US24.9 billion for the three months ended December 31, beating analysts’ average estimate of $US24.79 billion, according to data compiled by LSEG. Related Article Opinion\n\nCurrency wars Should you book a US holiday? Aussie dollar and gold hit new highs Elizabeth Knight Business columnist Microsoft’s spending surged to a record high and cloud sales growth slowed, sending the shares down amid investor concerns that it could take longer than expected for the company’s AI investments to pay off. Capital expenditures for the fiscal second quarter hit $US37.5 billion, up 66 per cent from a year earlier and exceeding analyst estimates for $US36.2 billion. Microsoft shares fell about 5 per cent in extended trading after closing at $US481.63 in New York.\n\nAdvertisement\n\nMeta’s robust advertising business, which boosted its current-quarter outlook above estimates, is making it possible for the company to invest at record levels on artificial intelligence this year. The owner of Facebook said first-quarter sales will be $US53.5 billion to $US56.5 billion, beating the $US51.3 billion average analyst estimate. The owner of Facebook said full-year capital expenditures will be $US115 billion to $US135 billion, exceeding the $US110.6 billion average analyst estimate, according to data compiled by Bloomberg. Meta shares gained as much as 4.9 per cent in after-market trading after closing at $US668.73. Nvidia, the stock that’s become the poster child of the AI boom, climbed 1.6 per cent and was the strongest single force lifting the S&P 500. It also benefited from an encouraging report from ASML, whose machinery helps make chips.\n\nAdvertisement\n\nThe Dutch company gave a forecast for revenue in 2026 that topped analysts’ expectations, and chief executive Christophe Fouquet said customers had been notably more encouraged about “the sustainability” of AI demand. That helped allay concerns that the AI frenzy has gone overboard and created a potential bubble that may burst. Related Article Opinion\n\nTrade wars The ‘mother of all deals’ that will infuriate Trump Stephen Bartholomeusz Senior business columnist On the losing end of Wall Street was Amphenol, whose stock tumbled 12.2 per cent even though it reported a stronger profit than analysts had forecast. Expectations were high for the maker of fiber-optic connectors and other high-tech equipment after its stock came into the day with a surge of 23 per cent for the young year so far. Apple slipped 0.7 per cent ahead of its profit report coming on Thursday. Because of its immense size, it was the single heaviest weight on the S&P 500. In the bond market, Treasury yields held relatively steady following the Fed’s widely expected move to hold its main interest rate steady.\n\nAdvertisement\n\nThe Fed’s chair, Jerome Powell, said that interest rates look to be “in a good place” at the moment, giving the central bank time to and wait and see how things progress. In the meantime, “the economy has once again surprised us with its strength”, he said. The yield on the 10-year Treasury remained at 4.24 per cent, where it was late Tuesday. With AP, Bloomberg The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/cliffy-s-emporium-20260129-p5ny1a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cliffy’s Emporium",
    "publish_date": "Thu, 29 Jan 2026 12:57:21 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nA semi-canopied street, a spaghetti-western frontage and 1950s advertisements for tea and cocoa colour this Daylesford icon categorically cute. An adorable edit of pantry fillers lines its walls, while in the kitchen, poached eggs are plated with tabbouleh and cardamom yoghurt and ferried out to hungry weekenders and locals alike. Great coffee is a guarantee, and the visual merchandising deserves a medal – budget extra time for browsing.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/the-nasty-handbrake-slowing-djokovic-fairytale-20260129-p5ny16.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The nasty handbrake slowing Djokovic fairytale",
    "publish_date": "Thu, 29 Jan 2026 12:49:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "The nasty handbrake slowing Djokovic fairytale\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/wombat-hill-house-cafe-20260129-p5ny10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wombat Hill House Cafe",
    "publish_date": "Thu, 29 Jan 2026 12:48:19 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nYou don’t need to go far to find good coffee and breakfast in Daylesford. But if you do fancy a stroll, Wombat Hill House Cafe eagerly awaits your custom at the peak of the majestic botanic gardens. Run by the team that brought you the Lake House and its inestimable pleasures, a morning here is best spent with a brekkie pizza, a cup of joe, and a gentle traipse through these magnificent gardens.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/bull-shark-caught-in-sydney-harbour-20260129-p5ny0y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bull shark caught in Sydney Harbour",
    "publish_date": "Thu, 29 Jan 2026 12:42:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/philippoussis-stuns-legends-cup-with-miraculous-tweener-20260129-p5ny0q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Philippoussis stuns Legends' Cup with miraculous tweener",
    "publish_date": "Thu, 29 Jan 2026 12:31:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Philippoussis stuns Legends' Cup with miraculous tweener\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/winespeake-cellar-and-deli-20260129-p5ny06.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Winespeake Cellar & Deli",
    "publish_date": "Thu, 29 Jan 2026 12:27:38 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nEvery cafe, bakery, bar, pub and restaurant featured in The Age Good Food Guide 2026 in Central Victoria. See all stories .\n\nThe first thing to know about the gourmet wonderland of Daylesford is that all roads – physical and metaphorical – lead to Winespeake Cellar and Deli. One of Victoria’s best-loved bottle shops, it’s stocked to the hilt with limited-edition local releases and worldly pleasures in equal measure. Fancy tinned fish and local cold cuts abound, too – some even make delicious appearances in their outstanding toasties. Bring a market trolley, fill it with one of everything, pour it out on the lounge room carpet and have yourself an Airbnb picnic for ages.\n\nAlso now in Anglesea.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/rawness-and-urgency-in-couple-s-sydney-festival-dance-debut-20260125-p5nwtj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cultural elites skewered as mayhem descends on dinner party in new David Williamson play",
    "publish_date": "Thu, 29 Jan 2026 12:24:59 +1100",
    "category": "entertainment",
    "authors": [
      "Chantal Nguyen",
      "Kate Prendergast",
      "Joyce Morgan"
    ],
    "text": "Advertisement\n\n★★★½ CultureLive reviewsStage shows Cultural elites skewered as mayhem descends on dinner party in new David Williamson play Chantal Nguyen , Kate Prendergast and and Joyce Morgan Updated January 29, 2026 — 12:24pm ,first published January 25, 2026 — 12:47pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nTHEATRE\n\nThe Social Ladder\n\nEnsemble Theatre\n\nJanuary 28, until March 14\n\nReviewed by JOYCE MORGAN\n\n★★★½ From Macbeth to August: Osage County, the dinner party that unravels has long been a theatrical trope. Veteran playwright David Williamson uses this to fine comedic effect, taking aim at his favourite subject – status-obsessed Sydney. This time he skewers how the city’s wealthy garner power and cultural cachet through appointments to boards of arts institutions. Mandy Bishop as Katie with Johnny Nasser as her husband Roger in The Social Ladder. Phil Erbacher Social climber Katie Norrie (Mandy Bishop) wants a seat on one of the most prestigious: the Art Gallery of NSW’s fund-raising foundation. She has a plan to win her glittering prize.\n\nAdvertisement\n\nShe invites Sydney’s most influential couple to dinner. Pillars of the establishment, Catherine (Sarah Chadwick) and Charles Mallory (Andrew McFarlane) are major art collectors and on every elite cultural board in town. Desperate to impress, Katie has borrowed an Arthur Boyd masterpiece, hired a celebrity chef to cook, and invited a lefty filmmaker friend and his teacher wife to join them. What could go wrong? Pretty much everything – but no prizes for guessing that. The glee is in watching just how slippery the rungs on this social ladder will be. On a sparse stage, the first three scenes swiftly set up the three couples ahead of the crucial dinner party in this tightly plotted play. Katie has grown up in the Shire and never shaken her working-class accent. Her husband Roger (Johnny Nasser), born into wealth, has little patience for her social ambitions and has a beef with Charles Mallory.\n\nAdvertisement\n\nAndrew McFarlane as ruthless billionaire Mallory with Sarah Chadwick as his wife Catherine. Phil Erbacher Mallory is a ruthless billionaire; his wife Catherine has a cut-glass English accent that conceals her humble roots. Ben (Matt Minto) and Laura Gregory (Jo Downing) have been dropped from Katie’s social circle for several years and are sceptical of why they’re suddenly back in favour. As the dinner party is poised to get under way, Katie’s home is revealed in its bright, brash glory. The hostess in an eye-popping confection and Catherine in sleek ivory are delicious visual contrasts. Veronique Benett’s pitch-perfect set and costumes are a joy to behold. As the dinner party descends into alcohol-fuelled mayhem, anti-woke Charles clashes with Ben over diversity and unions, with Laura over tax avoidance and with Roger over business dealings. Secrets are disclosed – not least about that wow painting. Bitterness and recriminations ensue.\n\nAdvertisement\n\nSo, too, does some Bollywood dancing. For amid the havoc, much fun is to be had in this light-hearted comedy. Matt Minto, Mandy Bishop and Sarah Chadwick in The Social Ladder. Phil Erbacher The three couples are stock types who argue their positions effectively, rather than fleshed-out characters. But the dialogue is sharp, there are laugh-out-loud lines, and Janine Watson’s brisk direction maintains the pace with her capable cast. Bishop is terrific as the brazen Katie, whose grand plans become smoking ruins along with the roghan josh. Chadwick impresses as the imperious Catherine, as does McFarlane as her shameless old bull of a husband who can’t say no to an income stream. The ending is upbeat, although Roger’s volte-face comes out of the blue.\n\nAdvertisement\n\nThis is classic Williamson, replete with witty observations and great one-liners. It tickles the funny bone and pricks the bubble of privilege. THEATRE\n\nGod’s Cowboy\n\nFlight Path Theatre\n\nJanuary 28, until February 21\n\nReviewed by KATE PRENDERGAST\n\n★★ At some point, I started to wonder if I’d fallen into an alternative universe. Had I hit my head on the way to Flight Path, that quaint little Marrickville theatre with its surprise overhead aircraft crescendos? Had I lost my powers of comprehension? With queer love and sexual trauma the preoccupying themes, this debut play by stage producer Les Solomon resembles a conceptual sequence of soapy non sequiturs, scudding awkwardly into a middle distance. Or, perhaps, a lame steed that could not be brought to water, and so wanders into the desert. God’s Cowboy idled several years in development and really should have remained in purgatory, instead of saddling up for this year’s Mardi Gras.\n\nAdvertisement\n\nPeter (Nathaniel Savy) in a dashing, kink-coded ensemble gifted by Daniel (Max Fernandez). David Hooley Characters describe and behave towards each other in ways that not only don’t make sense, they profoundly baffle. The plot gropes towards a non-collapsible shape. The more provoking scenes, involving intimate boundaries being crossed, are not always discomforting in ways that are productive and justifiable. And the ‘memory play’ framing device suffers from amnesia, with the middle section seeming to forget that the story began in a fourth-wall-breaking flashback narrated by twins Peter (Nathaniel Savy) and Penny (Sophia Laurantus). When another flashback was deployed didactically at the end, the audience startled. The gist of it all: our young sibling pair are relating to us the time when they were both cast in a play of their own, and so crossed paths with fellow actor Daniel (Max Fernandez), a Midnight Cowboy-inspired gunslinger lead. First of all, it’s odd that Fernandez got the role of this ‘dark and mysterious’ stranger when the impressively toned and charismatic Savy seems far more suited. But it’s also confusing why either of the twins are drawn to the character of Daniel at all, given his repertoire appears to be making people feel uncomfortable with slimy drawls, snickers and an aggressively cavalier attitude towards sex. Yet, almost in the blink of an eye, we witness the earnestly angelic Peter, a lover of old-timey musicals, fall in love. Somehow, “illiterate f--- nugget” becomes the phrase that breaks the ice and bonds them. Peter had just hurled it at Daniel after (mistakenly) suspecting him of assaulting his sister. And now they’re on the bedroom floor laughing.\n\nAdvertisement\n\nPenny’s subplot of her own queer romance feels perfunctory and wholly underdeveloped. There’s another character, Demetrius (Tate Wilkinson Alexander), whose function is to prowl around with sly and shady intent. Another bizarre logic connecting events occurs between the two acts. Daniel, a former sex worker and the victim of horrific childhood abuse, has for a split-second been overtaken by the demons of his past, and turned monstrous himself when Peter is at his most vulnerable. Peter initially won’t even talk to him. Then he’s performing a gorgeous balletic dance for him. Then he’s insisting Daniel meet his parents. There is another scene in which we see Daniel in the play-within-a-play monologuing about how God wants us to fornicate; to be unashamed of our “manacondas” and “penis fly traps”. The coup de grace at the end is a sentimental and improbable callback to Peter’s favourite movie, Carousel. At last, it was over.\n\nAdvertisement\n\nOPERA\n\nHansel & Gretel\n\nOpera Australia, Joan Sutherland Theatre, Opera House\n\nJanuary 27, until February 25\n\nReviewed by PETER McCALLUM\n\n★★★½ Sydney rejected the composer Engelbert Humperdinck when he applied to become the first director of the Conservatorium in 1914. The fact that Australia had gone to war with Germany just after he submitted his application might have had something to do with it. But Sydney has been more receptive to Humperdinck’s most famous work, Hansel & Gretel as demonstrated by the warm audience reception for this revival by Claudia Osborne of the 1992 production by one of Opera Australia’s best-loved and most frequently revived directors, the late Elijah Moshinsky. Stacey Alleaume as Gretel and Margaret Plummer as Hansel out front of the gingerbread house. Carlita Sari Photo Humperdinck’s achievement was to combine the simplicity of easily memorable, folk-like melodies with harmonic sophistication and an ability to develop musical ideas without overworking them. With a predominantly female cast (there is only one male role) and a children’s chorus, the sound-world is bright, leavened with richer and darker colours by finely-crafted orchestration. Whether the Grimms’ story cuts through with today’s young people I am unsure, but, in the absence of social media, one has to do something.\n\nAdvertisement\n\nMargaret Plummer (Hansel) and Stacey Alleaume (Gretel) drive the action with childish naughtiness and deft musical finesse. Plummer creates the obnoxiousness of little boys with gentle humour and sings with a voice of crimson depth and clarity. Alleaume’s Gretel darts with playful mischief, fine filigree and silvery vocal delight. In Moshinsky’s conception, the mother, Gertrud, in the libretto by Adelheid Wette (Humperdinck’s sister), becomes a harassed scolding stepmother (thus enabling a moment of poignancy in the dream sequence of Act 2). Margaret Plummer as Hansel, Stacey Alleaume as Gretel and Helen Sherman as Stepmother. Carlita Sari Photo Helen Sherman projected the Stepmother’s role firmly, injecting stridency into the sound when the children were particularly irritating. Shane Lowrencev sang the father’s rollicking tipsy entrance song with robust tone and carried the role with lusty flexibility of line. Jane Ede was a fearsome Witch, singing with ringing clarity so that the voice lingered in the head like the foreboding laughter of an unfavourite great aunt. Shikara Ringdahl sang the Sandman’s song with unassuming simplicity. Kathryn Williams as Dew Fairy with some of the troupe. Carlita Sari Photo\n\nAdvertisement\n\nKathryn Williams’ cameo as a clear-voiced Dew Fairy was supported by the clumsy awkwardness of a ballet-school troupe. Humperdinck subtly subverts the expectation of a surging operatic peroration by giving the final apotheosis to a children’s choir, which the Opera Australia Children’s Chorus delivered with nicely shaded pastel colours in quiet moments and sparkling clarity at the close. Conductor Tahu Matheson unfolded the musical narrative without exaggeration and the Opera Australia Orchestra nurtured the score’s finery with warm sound from horns and lower brass. In the first act Mark Thompson’s set is a claustrophobic cottage which becomes oversized in Act 2 as though the children had fallen asleep hungry after the scolding and all the nonsense no more troubling than a dream. DANCE\n\nSISA-SISA\n\nBankstown Arts Centre, January 23\n\nReviewed by CHANTAL NGUYEN\n\n★★★★ The double bill SISA-SISA (Indonesian for “the remains” or “remnants”) marks the Sydney Festival debut of the extraordinary husband and wife duo Murtala and Alfira O’Sullivan, co-directors of the Indonesian cultural company Suara Dance.\n\nAdvertisement\n\nComprising two autobiographical solos, SISA-SISA represents long-awaited recognition for the couple, who have spent years channelling their energy into dance troupe choreography. Alfira O’Sullivan in SISA-SISA. Victor Frankowski Both husband and wife possess an artistic maturity that makes its presence felt immediately: the kind that sears with intense honesty and a stage presence earned after only decades of experience. O’Sullivan’s work, Jejak & Bisik (which can be translated to “traces and whispers”), explores O’Sullivan’s life as an ageing female dancer caught in the crosshairs of unrelenting professional demands, motherhood and community leadership, and a traumatic misdiagnosed miscarriage. Alfira and Murtala O’Sullivan in the Sydney Festival show SISA-SISA. Victor Fankowski\n\nAdvertisement\n\nAs O’Sullivan changes costumes and fixes her hair on stage, her mobile phone buzzes with voice messages while emails from a management company pop up on-screen. A polite corporate voiceover reads them out: As O’Sullivan’s profession is relegated to “the multicultural stage” and deemed unsuitable for “mainstream” white Australian audiences, it will be subject to various constraints including a fee reduction. Could she create a dance piece for a conference, sandwiched between the Monday morning speaker and the keynote speaker, designed to keep people awake? Using her community troupe? For less than $500? During a period when she is recovering from reproductive surgery? O’Sullivan, blessed with a striking natural glamour, demonstrates a beautiful sense of embodied theatricality and poise as she communicates this emotional journey. Murtala’s piece, Gelumbang Raya (which can be translated as “the Great Wave”), is his danced memory of recovering the bodies of victims of the Boxing Day Tsunami. A local of Aceh, Murtala returned after the tsunami as a disaster relief volunteer, working with survivors and — quite literally — staring death in the face as he carried thousands of bodies out of the mud. Gelumbang Raya is haunting in its rawness and urgency, performed on a stage strewn with sand and visual projections of tides washing in and out. It incorporates Acehnese body percussion, singing, and the frame drum — 11 of which lie buried in the sand, like lives frozen in time by the tsunami. One of the piece’s final images — Murtala, lifted upside down in a head stand amidst the sand, singing in a piercing tenor as the drums lie around him — lands like a rip in your gut.\n\nAdvertisement\n\nTHEATRE\n\nasses.masses\n\nDrama Theatre, Sydney Opera House\n\nJanuary 24, until January 25\n\nReviewed by KATE PRENDERGAST\n\n★★★½ By the fourth hour, you’ve entered a state of trance. Your communal gaming herd is cheering on a self-elected temporary controller who’s playing a version of Guitar Hero in the Sydney Opera House to help a donkey maximise its fornicating delights. This is Sick Ass, one of many donkey avatars, who’s just reached the Astral Plane (aka donkey heaven) as a casualty in the worker-animal uprising. What began as a peaceful protest against the human overlords’ exploitative machine-first system went horribly wrong, leading to death, displacement and disunification within the movement. Patrons engrossed in the ass’s journey at the Sydney Festival show asses.masses. Your own ass is getting sore. Level complete, you all break for snacks.\n\nAdvertisement\n\nThe audience may have thinned after the third interval, with another four hours to go. But those who are spiritually invested for the long haul in this multidisciplinary, multidimensional epic and graphic radical allegory are all in – and rewarded for their loyalty. Travelling through farm and village, circus and abattoir, nightmare and nirvana; through hundreds of ass puns and inventively obscene animations, while conquering button-mashing challenges and philosophical puzzles, we become a pack immersed through live social experiment in a stunningly rendered universe – comrades in a common goal towards “true progress”, united by the liberating mindset of play. Canadians Patrick Blenkarn and Milton Lim are behind the asses.masses project, brought to Sydney Festival for one weekend, and touring as far as Finland, Istanbul and Chicago next. Conceived with vast ambition, a collectivist sensibility and total nerd passion, it’s a unique animal of modern participatory theatre, using the language of video games and dorm-room humour to tell its staunch and timeless revolutionary tale. The game art is truly dope. The “material world” is built with nostalgia-infused pixels, its textures, dialogue boxes, tessellated realms and soundscapes recalling Legend of Zelda or Pokemon. The “astral plane” is of the realism style, transporting us to sublime desert canyons (where donkey souls rave) and rolling infinity pathways (where the player-crowd yells “don’t do drugs!” when a power-boost orb appears). Classics games such as Space Invaders and Pac-Man are built into the narrative to either create obstacles, or simply offer fun little inconsequential diversions. For example, we spent a gleefully inordinate amount of time in the mines getting the donkey foal avatar (whom we voted to name Bitch Ass) to play a version of Pong called Rocks. Later, another controller has Hard Ass hoof-kick a swarm of riot policeman dead a la Karate Champ. The difficulty level ramps up on our quest, with veteran pros stepping up to earn our thunderous applause.\n\nAdvertisement\n\nFar closer to Animal Farm than Animal Crossing, there are some intentionally lurid depictions of violence, particularly against humans – from the life-like screams of burning villagers, to a factory worker getting eviscerated by his own meat hook. Most hilariously macabre is a grim, surreal sequence in which Hard Ass has to sacrifice himself many times to create a corpse bridge for/of himself over a bloody trench. Obviously, with scores of people in the room, not everyone gets (or wants) a go at the controller. The majority are basic spectators – our ‘agency’ limited to adding to the cacophony of yelled dialogue options and directions, jokes and commentary. More theoretically than actually active, the player-herd moves through cycles of elation and fatigue, agony and ecstasy, frustrated boredom and shared jubilation. The durational aspect can take you to the edge: at one point I found myself cry-laughing at the excessively cautious way a controller was moving a mutinous gang of equines hidden inside packing boxes. During the seventh hour, we spontaneously rose to our feet to sing the “song of ascension”, a donkey funeral dirge. Would I have better enjoyed this marathon on a friend’s sofa, where we could have a more equitable share of the controller, and partake of snacks superior to Doritos and dry vegan buns? Sure. But enjoyment isn’t the only marker of a worthwhile experience. Sometimes you have to endure the discomfort to come out the other side, finding yourself, in some way, new.",
    "source": "TheAge",
    "cluster_id": 33
  }
]