[
  {
    "url": "https://www.9news.com.au/national/koolewong-fire-nsw-central-coast/0faaf979-f029-4fa4-8aae-19e135fc97aa",
    "title": "Families lose everything weeks from Christmas as fires rip through NSW Central Coast",
    "publish_date": "Sat, 06 Dec 2025 23:19:03 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A dozen homes have been destroyed and families have lost everything just weeks away from Christmas after a fast-moving fire ripped through the NSW Central Coast.\n\nAbout 250 firefighters, 50 trucks and nine aircraft battled the blaze yesterday which multiplied rapidly due to hot and windy conditions in the region.\n\nClose to 150 firefighters remain on the ground today﻿ fighting 76 fires that are still burning, as 40km/h wind gusts and hot conditions threaten to blow the fires further north.\n\nFOLLOW EMERGENCY BUSHFIRE UPDATES HERE .\n\nlose to 150 firefighters remain on the ground today﻿ fighting 76 fires. (9News)\n\nREAD MORE: Shark drones to protect surfers at unpatrolled beaches after fatal attacks\n\nOf the 76 fires still burning on the Central Coast, more than 20 remain uncontained.﻿\n\nNSW Premier Chris Minns ﻿said more than 12 homes have been destroyed during an \"incredibly difficult\" 24-hour period, however, that number could grow.\n\n\"That's devastating news in the run-up to Christmas,\" Minns said.\n\nMinns said \"scores\" of people have needed emergency accommodation, including at the Gosford RSL which has remained open for the past 24 hours.\n\n\"As difficult and horrible and unexpected as the last 24 hours have been, they were prepared for this to happen and to get as much as they could in the car and evacuate in time,\" Minns said.\n\nThe premier said it was important to note nobody has lost their life in the fires.\n\nHe urged residents to listen to emergency services and to remain vigilant as the conditions could worsen.\n\nA NSW Rural Fire Service truck passes a car burned out by the Koolewong bushfire. (Sitthixay Ditthavong)\n\nOf the 76 fires still burning on the Central Coast, over 20 remain uncontained.﻿ (9News)\n\n\"﻿We can replace homes, we can replace buildings, we can't replace people. I can't stress that enough,\" Minns said.\n\nNSW Rural Fire Service (RFS) Commissioner Trent Curtin said crews are still concerned about Koolewong, ﻿between Gosford and Woy Woy, which was heavily impacted by the flames yesterday.\n\n\"Erratic\" winds today could make it difficult for crews to contain the ongoing blazes, he said.﻿\n\nNSW Premier Chris Minns said families have lost everything in the lead-up to Christmas. (9News)\n\nCurtin warned the fire danger zone could widen as the day progresses.﻿\n\nThe high winds yesterday caused ﻿embers to jump over a one-kilometre stretch of watewr near Woy Woy.\n\n\"Embers can travel over great distances,\" Curtin said.\n\n\"They can create fires well ahead of the main fire.\"\n\nAt least a dozen homes have been damaged or destroyed after a fire suddenly spread on the NSW Central Coast. (Nine)\n\nCrews still fighting dozens of fires﻿\n\nA 48-hectare bushfire is raging in the Lake Macquarie area﻿, while an emergency warning was issued in the Newcastle area over concerns there was a threat to a nearby nursing home.\n\nDozens of RFS crews remain on standby and aerial appliances are ready to be deployed if the conditions worsen in the Koolewong area too.\n\nThe Koolewong fire has already razed through 120-hectares and is yet to be controlled.\n\nThe main focus for firefighters today is to protect nearby properties as﻿ the wind changes.\n\nResidents waking up today have been urged to check the latest updates on the Haxards Near Me app.\n\nNatural disaster declared﻿\n\nThe federal and state government have declared a na﻿tural disaster for six local government areas after the bushfires destroyed or damaged a dozen homes.\n\nDisaster support will be offered for impacted residents on the NSW Central Coast, Mid Coast, in the Upper Hunter, Muswellbrook, Warrumbungle and Dubbo.\n\n\"Bushfires like this are very distressing and my thoughts are with everyone that has been impacted,\" Federal Minister for Emergency Management Kristy McBain said.\n\n\"Conditions yesterday were extremely challenging and I'd like to thank all our emergency services, crews are fighting fires and keeping our communities safe.\n\n\"The Albanese and Minns Governments are working together to get support to communities impacted by these bushfires as quickly as possible.\"\n\nThe disaster assistance includes emergency accommodation, grants, loans and other financial support.﻿\n\nHomes destroyed on Central Coast﻿\n\nBy yesterday evening, NSW Premier Chris Minns said at least 12 homes ﻿had been damaged or destroyed, and potential lightning strikes and another wind change overnight were posing a huge threat.\n\nFifty firetrucks, 250 firefighters and nine waterbombing planes were working to contain the Koolewong blaze (Sitthixay Ditthavong)\n\nMinns said 50 firetrucks, 250 firefighters and nine waterbombing planes were working to contain the Koolewong blaze and some 1100 firefighters would work through the night across the state.Residents were being told to take shelter, and already about 60 people were hunkering down at an evacuation centre set up at Gosford RSL on the Central Coast Highway. Many others had self-evacuated to other areas, Minns said.\n\n'Everything's gone'﻿\n\nHomes dotted in thick bushland on the picturesque part of the NSW coast had no hope as the fire quickly engulfed them yesterday.\n\nFlames licked the tops of tall gums and acrid black smoke blanketed neighbouring streets.\n\nPeople in parts of Koolewong, ﻿between Gosford and Woy Woy, were told to leave as an apparent change in wind direction suddenly sent the blaze towards homes. (Nine)\n\nPremier Chris Minns told 9News it was \"devastating for them on the eve of Christmas for this to happen\". (Nine)\n\nTony Stellino knew he had already lost his home before even being allowed to return last night.\n\n\"I went out there and had a look too and [thought] oh my god … it's on top of us,\" he said.\n\n\"We made it, we're still here, we'll start again.\n\n\"Everything's gone, you know, memories, all our clothes, all our possessions.\"\n\nMinns told 9News it was \"devastating for them on the eve of Christmas for this to happen\".\n\n\"A confronting day … this is a warning for everyone to follow the advice … we need to make sure we do everything we possibly can to protect lives,\" Minns said.\n\nHomes dotted in thick bushland on the picturesque NSW coast had no hope as the fire quickly engulfed them. (Sitthixay Ditthavong)\n\nLightning over Koolewong, part of a band of strikes threatening to spark new blazes. (Sitthixay Ditthavong)\n\nNew threats throughout the night﻿\n\nThe Koolewong fire started in a park area about 1pm, RFS Commissioner Trent Curtin said.\n\nA combination of strong winds, hot conditions and steep land with difficult access for fire crews made for ﻿\"prime conditions for the fire to spread rapidly\".\n\n\"The fire moved very, very quickly into properties,\" Curtin said.\n\n\"We issued a watch and act [alert] and it escalated very quickly to an emergency warning.\"\n\nThe fire was downgraded to a watch and act about 6pm, as conditions began to ease. But residents were told to be on high alert.\n\nChanging weather through the night posed a new threat.\n\nA band of lightning was expected to hit the area early in the evening, threatening to spark new fires.\n\nA combination of strong winds, hot conditions and steep land with difficult access for fire crews made for ﻿\"prime conditions for the fire to spread rapidly\". (Nine)\n\nKatie Greene was devastated when four of her neighbours' homes burnt down around her home in Koolewong. (Sitthixay Ditthavong)\n\nA wind change was then forecasted for between 2am and 5am that authorities feared would make firefighting capabilities difficult.﻿\n\n\"We are expecting some changes in the wind so that will create very challenging conditions for firefighters,\" Curtin said.\n\nThe RFS was using a military Chinook helicopter to help soak the Koolewong fire. It is the only waterbombing aircraft in Australia that can continue to operate at night.\n\n\"The Chinook helicopter will continue bombing operations as long as wind and weather permits throughout the night, to continue to suppress that fire and protect communities,\" Curtin said.﻿\n\nLocals were urged to leave their burning properties as the fire spread rapidly. (Nine)\n\nA helicopter was seen dumping large loads of water over the firezone. (Nine)\n\nPrime Minister Anthony Albanese sent a message of support to residents and firefighters dealing with the blaze.\n\n\"Please look out for each other and follow advice from authorities,\" he said.\n\n\"Thank you to all our emergency services and volunteers on the ground and in the air.\n\n\"We stand ready to assist the NSW government.\"\n\nVideo showed the intensity of the inferno as it tore through homes adjacent to the train line at Koolewong.\n\nBrisbane Water Drive was closed in both direction between The Boulevarde at Woy Woy and Glenrock Parade at Tascott/Point Clare.\n\nTrains on the Central Coast and Newcastle Line were cancelled between Gosford and the Hawkesbury River. due to the fire's proximity to the train line. (Nine)\n\nInferno tears through bushland in the Hunter Valley ﻿\n\nSome 75 bushfires were burning across the state as of yesterday afternoon, with 19 of those uncontained.\n\nA total of 1100 firefighters and 300 fire trucks were on the ground battling the various blazes.﻿\n\nA watch and act was in place for ﻿a fire at Bulahdelah , which has burned through more than 2500 hectares since Thursday.\n\nResidents in part of the rural Goulburn River National Park were told to take cover as a large bushfire burned through the Merriwa River Valley.\n\nIt was too late to leave for residents in ﻿Baerami, Baerami Creek, Widden, Yarrawa and Kerrabee, the RFS said yesterday afternoon.﻿\n\nPeople were told to seek shelter inside a solid structure, like a house, as firefighters and a waterbombing plane ﻿tried to slow the spread of the fire.\n\nPeople in nearby Worondi Creek Road were advised to enact their bushfire survival plans and prepare.\n\n﻿Evacuation centres were open at the Merriwa RSL Club, the Merriwa Showground, which has space for animals and cattle, the Denman RSL Club, and the Denman Pony Club.\n\nTemperatures across NSW soared ﻿yesterday, with parts of Sydney nudging above 40 degrees.\n\nPenrith in Sydney's west recorded a high of ﻿41.7 degrees just before 3pm.\n\nConditions at Sydney Airport reached 39.2 degrees at 12.30pm.\n\nExtreme fire danger is forecast for much of the Hunter Valley, Greater Sydney, Illawarra and Central Coast regions.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/netflix-to-acquire-warner-bros-studio-and-streaming-business-for-72-billion/a195b128-e099-4ec5-94df-0a34cf91546d",
    "title": "Netflix to acquire Warner Bros studio and streaming business for $72 billion",
    "publish_date": "Fri, 05 Dec 2025 13:40:56 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Netflix has struck a deal with Warner Bros Discovery to buy the legacy Hollywood giant's studio and streaming business for $US72 billion ($108 billion).\n\nThe acquisition, announced overnight, would bring two of the industry's biggest players in film and TV under one roof. Beyond its namesake television and motion picture division, Warner owns HBO Max and DC Studios. And Netflix has risen to dominance as a household name ubiquitous to on-demand content, while building its own production arm to release popular titles like Stranger Things and Squid Game .\n\nThe cash and stock deal is valued at $US27.75 per Warner share, giving it a total enterprise value of approximately $US82.7 billion ($124.55 billion). The transaction is expected to close after Warner separates its Discovery Global cable operations into a new publicly-traded company in the third quarter of 2026.\n\nThis image released by Warner Bros Pictures shows Leonardo DiCaprio in a scene from One Battle After Another. (AP)\n\nShares of Warner Bros rose nearly 3 per cent in premarket trading while shares of Netflix and Paramount fell more than 2 per cent.\n\nGaining Warner's legacy studios would mark a notable shift for Netflix's current movie theatre footprint. Under the proposed acquisition Netflix has promised to continue theatrical releases for Warner's studio films — honouring Warner's contractual agreements for movie releases.\n\nNetflix has kept most of its original content within its core online platform. But there have been a few exceptions, such as limited theatre screenings of a KPop Demon Hunters sing-a-long and its coming Stranger Things series finale.\n\nAs recently as October — when Warner signalled that it was open to a potential sale of its business — Netflix co-CEO Ted Sarandos reiterated on an earnings call that the company had been \"very clear in the past that we have no interest in owning legacy media networks\" and that there was \"no change there\".\n\n\"We believe that we can be and we will be choosy,\" Sarandos said at the time, without fully ruling out a potential bid for Warner.\n\nREAD MORE: Tributes to woman killed by her own dog in South Australian home ﻿\n\nNetflix has struck a deal with Warner Bros Discovery to buy the legacy Hollywood giant's studio and streaming business for $US72 billion ($108 billion). (AP)\n\nFriday's announcement arrives after a monthslong bidding war for Warner Bros Discovery. Rumours of interest from Netflix, as well as NBC owner Comcast, started bubbling up in the northern hemisphere autumn. But Skydance-owned Paramount, which completed its own $US8 billion merger in August, had also reportedly made several all-cash offers backed heavily by CEO David Ellison's family.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australia-music-festival-cancellations-exclusive-poll-insights/d413b6db-52cb-446e-9438-35a4be3b68e1",
    "title": "Music festivals keep getting canned. Nearly half of Aussies say this could fix it",
    "publish_date": "Fri, 05 Dec 2025 01:36:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: Thousands of Australians have been directly affected by the slew of music festival cancellations over the last 12 months, including Park Waves festival this week.\n\nNow they're calling for more government investment in the scene, according to a nine.com.au reader poll.\n\nMore than 40 per cent of﻿ the ﻿434 readers surveyed agreed that federal and state governments should invest in Australia's live music industry to support festivals and prevent more cancellations in 2026.\n\n\"The government should support music the same way they support international sports such as tennis, golf and soccer,\" one told 9news.com.au.﻿\n\nA further 39 per cent of readers confessed to being at least 'somewhat concerned' about the future of Australian music festivals in light of recent events.\n\nPark Waves festival, scheduled for February 2026, was cancelled on Tuesday due to challenges including economic issues.\n\n\"Ultimately, the numbers no longer stack up,\" organisers said in a statement.\n\nChanging Tides 2025 was canned, and Groovin' The Moo cancelled its 2024 shows and didn't return in 2025.\n\nFalls Festival and Splendour in the Grass gave 2025 a miss as well.\n\nLong-running festival Splendour in the Grass did not return in 2025. (Mark Metcalfe/Stringer/Getty)\n\nMoney is the biggest issue for most Australian music festivals, according to two Creative Australia reports on the sector.\n\nRising operational costs, a lack of available funding and grants, and insurance costs have made it challenging for organisers to finance festivals.\n\nAustralians' ticket buying habits have also changed, creating uncertainty for organisers.\n\nFestival goers ages 18 to 24 are purchasing tickets at lower rates﻿ than pre-pandemic.\n\nPatterns of later ticket buying are also continuing, creating additional costs and risks some organisers simply can't keep up with.\n\nG﻿roovin' the Moo cancelled its 2024 shows and didn't return in 2025. (Instagram/Groovin the Moo)\n\nBut when organisers have to jack up ticket prices to cope with ﻿rising operational costs, it prices some Aussies out altogether.\n\n\"Music festival tickets are too expensive,\" one reader said.\n\nAnother added that it's not surprising that Aussies can't afford them when many struggle to afford groceries and rent.\n\nA combined 61 per cent of nine.com.au readers said they were ﻿'not very concerned' or 'not concerned at all' about festival cancellations.\n\nBut only 30 per cent were opposed to government investment in Australia's live music industry to support festivals.\n\nOne reader said events like festivals need to be self-sustainable, rather than relying on government support.\n\nAbout 28 per cent of readers were on the fence about government investment.\n\n\"I don't go to music festivals but some could bring more tourism to the country so perhaps the government should invest in some,\" one said.\n\nOthers were concerned about how it could affect taxpayers.﻿\n\n\"Festivals should be supported by the music labels to support our music industry, not be taxpayer-funded,\" said one.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/private-health-people-paying-more-getting-less-ama-says/680984f6-3ec4-47dd-9c81-41093623322e",
    "title": "Aussies paying more for private health insurance and getting less",
    "publish_date": "Thu, 04 Dec 2025 22:59:09 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Australians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says.\n\nThe Australian Medical Association has released its latest Private Health Insurance Report Card, which found that consumers were abandoning gold-tier policies and questioning the value of other policies, while insurer profits piled up ever higher.\n\nThe AMA said the sector was in urgent need of reform, and President Dr Danielle McMullen renewed the call to establish an independent private health authority to drive that process.\n\nPeople are paying more for private health insurance and receiving less, a new report says. (Getty)\n\n\"Australia's health system is valued for its mix of public and private healthcare, but both parts of the system are under increasing pressure,\" McMullen said.\n\n\"Public hospitals are struggling with a severe logjam crisis, which is pushing more patients towards the private sector.\n\n\"However, runaway insurance premiums, low value offerings and shady tactics like product phoenixing leave customers facing tough choices about the level of cover they can afford.\"\n\nCost of living pressures are seeing people drop gold-tier policies. (Nine)\n\nAustralians are paying more for private health insurance and getting less for their money in return, a new report from the country's top doctors' advocacy group says. (Getty)\n\nThe report card showed that every year since 2008, the growth of private health insurance premiums has outstripped inflation, health sector inflation, average weekly earnings and the indexation of the Medicare Benefits Schedule (MBS).\n\nBetween 2008 and 2024, premiums climbed more than 100 per cent, while MBS indexation – which was frozen for several years from 2013 – increased by less than 20 per cent.\n\nThe report card also shows that over the six years to June 2025, insurers increased benefits paid for in-hospital medical treatment by only 18.1 per cent, while sector profits grew by nearly 50 per cent over the same period.\n\nREAD MORE: Manhunt for prisoner who escaped from police at hospital ﻿\n\nIn 2024-2025, insurers returned 84.2 per cent of premiums to consumers as benefits, below the 2019 level of 88 per cent.\n\nThe AMA is calling on the federal government to mandate a 90 per cent return minimum for insurers.\n\n\"Of course, private health insurers must make a surplus to be sustainable, but it is clear they are holding out on Australians while recording significant profits each year,\" McMullen said.\n\nThe AMA is calling for major reform. (Getty Images/iStockphoto)\n\n\"These insurers have ample capacity to increase the benefits paid to patients.\"\n\nThe report also found gold-tier policies are in decline as consumers face rising premiums and cost-of-living pressures.\n\nSince the start of the COVID-19 pandemic in March 2020, the number of gold-tier policies have dropped by 360,000, despite the overall number of policies growing.\n\n\"These trends show that private health insurance is becoming less affordable for many Australians – and we are already seeing the drastic effects of this, with at least 14 private maternity units closing over the past five years,\" McMullen said.\n\n\"The need for a Private Health System Authority to better regulate the sector and drive long-term reform has never been more crucial. There are too many bodies involved in the regulation of private health – a single, independent authority would provide a unified and coherent approach.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/scorchers-book-finals-spot-with-renegades-wbbl-defence-over/106111830",
    "title": "Scorchers book finals spot with Renegades WBBL defence over",
    "publish_date": "Sun, 07 Dec 2025 00:43:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Beth Mooney has led Perth back into the WBBL finals, executing the perfect chase against Brisbane and ending Melbourne Renegades's title defence in the process.\n\nNeeding 165 for victory in a must-win game at the WACA on Saturday, Mooney hit an unbeaten 94 from 61 to help Perth reach the target with seven wickets and four balls to spare.\n\nThe victory ensured the Scorchers would have a home final, knocked the Renegades out of the top four and handed the Heat the first winless season in WBBL history.\n\nWith one game to play in the season, Hobart is guaranteed top spot and hosting rights for next Saturday night's final at Bellerive Oval.\n\nPerth and the Melbourne Stars are also locked into finals spots, with the winner of the Sydney Sixers and Adelaide at North Sydney Oval on Sunday morning to join them.\n\nThe WBBL's finals system has third and fourth face off in an eliminator on Tuesday, before the winner of that plays against second on Thursday for a spot in the final.\n\nThe Stars could have wrapped up second spot on Saturday morning had they beaten the Sydney Thunder at Junction Oval, only for them to be well beaten.\n\nInstead Perth is now in second, and will stay there if the Strikers beat the Sixers on Sunday.\n\nFacing a tricky chase after Georgia Redmayne's 57 helped the Heat to 7-164, Mooney took control of the game at the WACA.\n\nAustralia's veteran opener regularly picked balls up off her pads and hit them over the legside to the rope, hitting 12 boundaries in a near-flawless knock.\n\nThe Scorchers's chase threatened to wobble late when Maddy Darke (24) and Sophie Devine (13) fell, but Mooney held her nerve and Freya Kemp's late hitting saw Perth home.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe leading run-scorer in WBBL history, Mooney now has scores of 105, 75 and 94 not out for the season and will enter the finals as one of the league's most dangerous players.\n\nEarlier, the Stars were left to rue a miserable morning at Junction Oval when they managed just 6-66 when the match with the Thunder was shortened to 10 overs a side.\n\nPhoebe Litchfield and fellow Australia young gun Georgia Voll made light work of the DLS-revised target of 76, securing the winning runs with 17 balls to spare.\n\nLitchfield hit 37 from 23 balls before being dismissed late in the chase, while Voll was untroubled with an unbeaten 33 off 18 to go with her 2-13 with the ball.\n\nThe win meant the Thunder finished the season in seventh, out of the finals for the first time since 2022.\n\n\"I had a bit of a stinker of a competition so it's nice to be able to finish off with a win with the girls, but to contribute as well right at the end was nice,\" Voll told Fox Cricket.\n\nAAP",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/regional-first-for-all-abilities-nippers-surf-lifesaving/106093904",
    "title": "All-abilities nippers surf lifesaving program extended to regional WA",
    "publish_date": "Sun, 07 Dec 2025 00:00:01 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Rhyzel Benafield's infectious laughter bounces off the water and echoes around the beach as an unexpected wave knocks him off his board and sends him into the icy blue water.\n\nHe and his brother Tairhys are part of Albany Surf Life Saving Club's all-ages, all-abilities nippers program at Binalup/Middleton Beach on Western Australia's south coast.\n\nCatering to children with autism spectrum disorders, it is the first of its kind in regional Western Australia.\n\nVolunteer Debra Aylmore says her water-loving grandchildren are learning vital skills. (ABC Great Southern: Andrew Chounding)\n\nRhyzel and Tairhys' grandmother, Debra Aylmore, said the program changed their lives.\n\n\"The boys are 15 and 10 but they are toddlers, they see things like toddlers, basically,\" she said.\n\n\"They see wonder in everything and dive into everything without thinking, so they need extra guidance and support in everything they do.\n\n\"This program is amazing for them.\"\n\nA lifesaving program\n\nThe all-abilities program aims to introduce neurodivergent children to the water and its challenges, increasing their confidence.\n\nDebra Aylmore said this was vital.\n\n\"When we go to the beach as a family, the boys will dive into the water without fear and creep out and out,\" she said.\n\n\"So now I'll have more confidence in their abilities, and they'll have more knowledge about what the waves are doing, and I won't feel as scared.\"\n\nRhyzel Benafield and Genevieve Bishop are part of the nippers program running in Albany. (ABC Great Southern: Andrew Chounding)\n\nProgram coordinator Paul Bairstow — whose son Harry is a participant — was instrumental in bringing the program to the region.\n\n\"My son's level two autistic and was in the right nippers age group but was falling behind because he's not as quick as the others,\" Paul said.\n\n\" I thought about his mental health and how nervous he was becoming and the effect of coming last all the time, and so I thought: let's change that. \"\n\nBig things to come\n\nSurf Lifesaving WA All Abilities program facilitator Bronwyn Meldrum said Champion Bay Surf Life Saving Club in Geraldton would be next on the list, with a further eight metropolitan clubs also taking up the program.\n\nMs Meldrum said she hoped the expansion would see more WA athletes compete in the Adaptive Aussies, a recent introduction to the Australian Surf Lifesaving Championships.\n\nDigby Stenhouse gets a little help from his father Matt Stenhouse. (ABC Great Southern: Andrew Chounding)\n\n\"This is where participants can compete against each other in adapted surf sports events where anyone in an all-abilities program can go and compete,\" she said.\n\n\"WA currently has two athletes that have participated and we're hoping that in commencing our programs here in WA in the future we'll have more attend that event.\"\n\nFun and confidence the aim of the day\n\nAlbany Surf Life Saving Club president Anna Emery said the club was quick to get on board with the program and focused on getting the basics right.\n\n\"We have to make sure the program is inclusive, it meets the needs of the children, and the safety needs,\" she said.\n\n\" The hope is that the kids will enjoy all abilities and get to a confidence level where they can participate with their peers and engage with everything the club offers. \"\n\nThe all-abilities nippers group (L to R): Tairhys Aylmore, Helen Morris, Genevieve Bishop, Rhyzel Benafield, Paul Bairstow, Digby Stenhouse, Harry Bairstow and Matt Stenhouse. (ABC Great Southern: Andrew Chounding)\n\nPaul Bairstow agreed.\n\n\"They're learning a lot about the ocean and getting fitter and actually enjoying the water more than they used to,\" he said.\n\n\"And kids are fun, they're happy and they love being here and I love putting a smile on their faces.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/wollongong-iconic-lagoon-restaurant-lease-ends/106077292",
    "title": "Illegal seafood and ALP fundraisers etched into iconic restaurant's fame",
    "publish_date": "Sat, 06 Dec 2025 23:44:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Well known for its celebrated seafood platters and stunning views, Wollongong's Lagoon Restaurant is equally remembered by some for questionable political fundraising dinners and a fire that could never be explained.\n\nAfter 40 years occupying a prime parcel of Crown land inside the beachside Stuart Park, the diner has only ever been run by the one family.\n\nWollongong Council, which manages the land, recently announced the current 20 year lease will come to an end in July 2026.\n\nThe restaurant is strategically located in a park near Wollongong's beaches. (ABC Illawarra: Justin Huntsdale)\n\nIt marks the end of a colourful history for one of Wollongong's most iconic and controversial establishments.\n\nGeorge Harrison and his wife Vania began operating the restaurant after signing a lease with the council in 1986 through their company Emibarb Pty Ltd.\n\nIt was a move criticised at the time by parts of the community who opposed Crown land, which is owned by the NSW government, being used for a large commercial restaurant.\n\nThe debate intensified when Mr Harrison became a prominent campaigner for the Labor Party, and then the lord mayor of Wollongong in 1999.\n\nFormer Wollongong ALP lord mayor George Harrison outside his family restaurant. (Supplied: Wollongong City Libraries and the Illawarra Historical Society)\n\nLabor Party connection\n\nOver the years the Lagoon became a favourite of Wollongong's political class.\n\nMr Harrison operated the restaurant while serving as the Labor lord mayor.\n\nThen in January 2001, while he was still lord mayor, a mysterious fire destroyed much of the restaurant and it had to be rebuilt.\n\nIn 2002 Mr Harrison suffered a loss in a long running legal battle with former business partner Delcie Shipp and declared himself bankrupt.\n\nHe was expelled from the Labor Party and was forced to resign as lord mayor, saying he resigned to protect his family.\n\n\"I feel a lot of pressure has been placed upon my family as a result of the personal litigation brought against me by a former business partner,\" he said at the time.\n\nA new 20-year-lease was signed with Wollongong Council in March 2003.\n\nEven after Mr Harrison's resignation the Lagoon remained a popular destination for Labor fundraising events.\n\nAfter one such event in 2005 the then-state MP for Wollongong, Noreen Hay, had to pay back money to Wollongong Council after the council picked up the tab for Labor councillors attending one of her fundraising events.\n\nNoreen Hay was the state member for Wollongong from 2003 to 2016. (ABC Illawarra)\n\n\"They hadn't paid, so due to the events that have arisen since the dinner I decided to cover the costs of those councillors myself,\" Ms Hay said at the time.\n\nMr Harrison died in 2020 from cancer, with the restaurant under the management of his son Andrew Harrison.\n\nRecent woes\n\nThe Lagoon also faced challenges in its later years.\n\nIn August 2023 a group of Illawarra businessmen were fined $2 million for the illegal overfishing of eastern rock lobsters and selling them without the required tags to establishments including the Lagoon.\n\nAs part of the case, head chef Emanuel Efstathiadis was fined $20,000 and handed a suspended jail sentence for acting as the conduit between the fishing company and the restaurant.\n\nIn May the restaurant was slapped with two $880 fines for failing to store food safely and for failing to maintain the required standard of cleanliness, after earlier warnings.\n\nDespite these recent difficulties, Andrew Harrison told ABC Illawarra in August he was very sad to see it coming to an end after working there since his childhood.\n\n\"Because I [started] at such a young age working throughout my childhood it became a part of me and it was in my blood,\" he said.\n\n\"Basically we have had two 20 year leases, so I have always known 2026 was going to be probably the last hurrah. So it's nothing new to me.\n\n\"It doesn't make it easier though because it's still 40 years of my life.\"\n\nAndrew Harrison worked in Lagoon Restaurant from a very young age. (Supplied: Lagoon Restaurant)\n\nQuestions about the lease\n\nWollongong Council's lease with the Lagoon was also scrutinised.\n\nThe council register revealed the lease with Emibarb Pty Ltd for Stuart Park Kiosk Lagoon from July 11, 2006, to July 10, 2026, was for $1 million.\n\nCommunity group Neighbourhood Forum 5 raised concerns at the time when the 1,400 square metre area of the lease was expanded to include an additional 660 square metres.\n\nAndrew Harrison said to the best of his knowledge that figure was just a \"starting point\".\n\n\"Since then the rent has increased in line with the CPI and I can confirm that the current rent being paid today is approximately double the figure shown on the register,\" he said.\n\nStuart Park in Wollongong with Lagoon Restaurant in the foreground. (ABC Illawarra: Justin Huntsdale)\n\nMr Harrison said the deal took into account upwards of $3 million invested by the Harrison family to reconstruct the venue after the fire.\n\nThe ABC sought to confirm the figures with Wollongong City Council but was told they were commercial-in-confidence.\n\nMr Harrison also said \"while the lease may look favourable on paper\" it was extremely challenging to rebuild over the course of almost three years.\n\n\"It took an enormous amount of work, investment, and personal sacrifice to rebuild and reopen,\" he said.\n\n\"I believe the Lagoon has added tremendous value to the site over the past four decades.\n\n\"When the restaurant burnt down and the site sat empty, the area became derelict, attracted antisocial behaviour, and wasn't a place families felt comfortable visiting.\"\n\nWhat's next?\n\nNeighbourhood Forum 5 is seeking assurances the community will be fairly compensated in the new lease and is asking for community oversight.\n\n\"We think it's time for the community to have a bit of input into what they are asking for in the lease,\" co-convenor John Riggall said.\n\n\"We're asking if possible to have some input into the scope of the tender documentation.\n\n\"We want to make sure the council gets fair value for money.\"\n\nA Wollongong City Council spokesperson told the ABC long-term leases provided security of tenure for both tenant and customer, and it is required \"to undertake a competitive tender process\".\n\nTwo companies that have submitted bids are the the inner Sydney restaurant and bar Grounds of Alexandria, which reportedly changed hands in 2023 for $186 million, and Top Pub Mittagong, currently known as the Mittagong Hotel.\n\nA spokesman for Wollongong Council said he was not aware of when the successful tenderer for the site would be announced.\n\nRegardless of who wins the new lease, the restaurant will occupy a key place in the city's culinary and political history.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/pmo-approved-wells-flights/106111598",
    "title": "PM's office approved almost $100k in flights for communications minister",
    "publish_date": "Sat, 06 Dec 2025 23:39:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "The prime minister's office approved last-minute flight changes for Communications Minister Anika Wells and two staffers that cost taxpayers almost $100,000, Anthony Albanese has confirmed amid an ongoing expenses furore.\n\nMs Wells has been under fire since it emerged during Senate estimates she had spent $94,827 on three business-class flights to New York, where she delivered a speech on the incoming social media ban on the sidelines of the United Nations General Assembly.\n\nShe was initially scheduled to travel with the prime minister for the September meeting, but delayed her departure when news of the Optus Triple Zero (000) outage broke.\n\nThe minister has repeatedly defended her spending, insisting it falls within the guidelines, as the Coalition called for an independent review of her expenses.\n\nAnika Wells has come under fire for the cost of flights she took to New York in September. (ABC News: Matt Roberts)\n\nMr Albanese backed her in on Sunday, telling ABC's Insiders Ms Wells was \"doing her job as the communications minister who is in charge of this world-leading legislation\".\n\nHe also confirmed that he spoke to Ms Wells about the decision for her to delay her departure and that his office signed off on the new flights.\n\n\"We make decisions as a government,\" he said.\n\n\"We spoke in the morning, and the minister travelled. It was a very significant event for Australia.\"\n\nOatmeal back on the menu as budget pressures grow It's been a long time coming, but there's a growing sense that budget politics might soon become more spicy.\n\nSince the New York flight revelation, the Brisbane-based minister has also been forced to explain a trip to Adelaide where she attended a friend's birthday party, a ski trip with her family to Thredbo and the cost of meals during the Paris Olympics.\n\nIn all cases, Ms Wells insists she was working and therefore it was within parliamentary guidelines to charge the expenses to the taxpayer.\n\n\"I had to be in two places at once. It was a really tricky situation,\" she told Sky News on Sunday, about the New York flights.\n\n\"I genuinely chose the option where I thought I could discharge my duties in both areas.\"\n\nThe uproar has distracted from Ms Wells's efforts to spruik the government's much-anticipated social media ban for under 16s, which is due to come into force on Wednesday.\n\nThredbo trip under the spotlight\n\nIn the case of the Thredbo trip, Ms Wells said she was invited by Paralympics Australia and she made use of a \"family reunion\" entitlement available to parliamentarians.\n\nNine newspapers on Sunday reported the minister had charged taxpayers almost $3,000 for travel allowances and flights for her family to join her at the snow.\n\nThe Independent Parliamentary Expenses Authority shows Ms Wells claimed $844 for two nights' accommodation at Thredbo on June 20 and 21 and another $318 for a one-night stay in Canberra on June 22, listed as \"official\" duties and \"parliamentary\" duties.\n\nHer partner and children went skiing over the weekend, she said, while she attended the Adaptive Festival for Paralympics Australia, held a press conference and visited the National Training Centre.\n\nShe then attended official meetings in Canberra on Monday.\n\n\"Every parliamentarian has family reunion entitlement, which I follow. I followed the guidelines on this occasion. I followed the guidelines on all of the occasions. I will continue to do that,\" she told Sky News.\n\n\"Entitlements should be scrutinised, I'm happy for mine to be scrutinised, I'm happy for mine to continue to be scrutinised, but at the end of the day, I don't write these rules.\"\n\nThe family reunion entitlement allows MPs travelling within Australia to bring along their spouse, dependent children or other designated people at the government's expense, for the purpose of facilitating \"family life\", according to the Independent Parliamentary Expenses Authority.\n\nPrime Minister Anthony Albanese defended Anika Wells in an interview on Insiders. (ABC News)\n\nMr Albanese said the trip was \"within entitlements\" as Ms Wells was working during it in her capacity as sports minister.\n\nHe did not say, when asked, whether he would have done the same thing.\n\n\"There are rules there, and I'm not going to go through each and every one,\" Mr Albanese said.\n\nSimilar questions were asked of now-Home Affairs Minister Tony Burke almost a decade ago, after he charged taxpayers more than $12,000 for a four-day trip with his family to Uluru, including more than $8,000 for business-class flights.\n\nAt the time, Mr Burke insisted it was within guidelines but eventually conceded the trip was \"beyond community expectations\".\n\nLiberal frontbencher James Paterson called on Ms Wells to refer all her travel expenses to the Independent Parliamentary Expenses Authority for review.\n\n\"Ministers of the Crown are paid very well, hundreds of thousands of dollars. If she wants to take her family on a ski holiday, she can pay for it herself,\" he told reporters on Sunday.\n\n\"Otherwise, she's completely out of touch with thousands of Australians right around the country struggling to make ends meet.\"\n\nSenator Paterson said the Coalition would be \"happy\" to take a look at whether the expenses guidelines were too broad, but added that he did not think the rules were the issue.\n\n\"Rules are not a substitute for judgement. Just because something can be done, doesn't mean it should be done,\" he said.\n\n\"I think this is about Anika Wells, and not about the rules.\"\n\nA government spokesperson said Ms Wells's travel \"was in accordance with the guidelines\".",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/farmer-concerns-as-australian-land-clearing-laws-tighten/106104878",
    "title": "Farmers feel 'forgotten' as environment, land clearing laws tightened",
    "publish_date": "Sat, 06 Dec 2025 23:04:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers are concerned Australia's new environmental laws will restrict their ability to manage their land responsibly.\n\nFollowing a deal between Labor and the Greens last week, the Environmental Protection and Biodiversity Conservation laws have introduced tightened controls for land clearing and larger fines for breaches.\n\nIn Queensland, native trees, including brigalow, mulga, boree, gidgee and eucalypt, are periodically cleared on properties to manage thick regrowth.\n\nJosh Phelps runs cattle on properties near Tambo, Brigalow and Bauhinia, in the heart of Queensland's scrub country.\n\n\"To put a blanket-type ruling over a nation, I just find it hard to grapple with,\" he said.\n\nThe Brigalow Belt runs from northern to Central Queensland and is known for its wide band of acacia-wooded grassland. (ABC Rural: Megan Hughes)\n\nThe Central Queensland producer said clearing was an essential part of land management, provided it was done in a \"sustainable\" way.\n\n\"A lot of that mulga land is actually rotated at 10, 15, 20-year intervals — not just to keep stock alive and healthy through dry times, but also as part of maintaining vegetation on the ground,\" Mr Phelps said.\n\nThe same laws for all sectors\n\nFederal Environment Minister and Queensland Senator Murray Watt faced \"furious\" backlash from sections of Australia's agricultural community after the laws passed parliament last week.\n\nThe laws do not automatically prevent clearing, but federal approval would be needed when clearing could damage nationally protected \"environmental matters\".\n\n\"If that clearing will have a significant impact on, for example, threatened species, then they would need to seek federal environmental approval to do that in the same way that other industries do,\" Senator Watt said.\n\nProducers say clearing is part of regular land maintenance. (ABC Rural: Marty McCarthy)\n\nHe also clarified that land clearing within 50 metres of rivers, creeks and wetlands within the Greater Barrier Reef catchment would need federal approval.\n\nSenator Watt has repeatedly stated that the changes to Australia's environmental laws will bring agricultural approvals in line with other sectors.\n\n\"All this means is that producers need to comply with the same environmental standards and laws that every other industry needs to meet, like mining, housing development, renewable energy and other industries,\" he said.\n\nThe clearing laws don't take into consideration the realities of managing land, Josh Phelps says. (ABC Rural: Maddelin McCosker)\n\nBut Mr Phelps said blanket rules were the fundamental problem with the changes.\n\n\"I think the forgotten element here is there's people involved in this,\" Mr Phelps said.\n\n\"We're not asking to knock down a heap of country, we're just asking to let us do what we do well.\"\n\nAn 'unaffordable' approvals process\n\nThis year, data from Queensland's Statewide Landcover and Trees Study (SLATS) found Queensland livestock producers have cleared fewer trees for pasture, although environmentalists say the new federal laws do n 'o go far enough.\n\nQueensland Primary Industries Minister Tony Perrett said the changes added unnecessary red tape, created economic uncertainty and could render state-approved farming practices illegal.\n\n\"It's bringing farmers into line with multi-billion dollar foreign companies that propose mining projects here in the state,\" he said.\n\n\"This impact on mum-and-dad farmers in this state, to go through the regulatory process that's now required, will drive these people insane.\n\n\"This is never an easy process. It'll be unaffordable.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/socceroos-set-for-wild-west-north-american-world-cup-adventure/106111662",
    "title": "Socceroos set for wild west North American adventure at World Cup 2026",
    "publish_date": "Sat, 06 Dec 2025 23:01:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "FIFA has confirmed the Socceroos will have a west coast tour of North America at next year's World Cup, with a trip to Canada, a journey to California and a marquee match against hosts the United States in Seattle.\n\nThe dates, times and venues for Tony Popovic's team were confirmed on Saturday in Washington DC, the day after the draw for the 2026 event, which has pitted Australia against the USA, Paraguay and the winners of a European play-off — one of Türkiye, Romania, Slovakia or Kosovo.\n\nThat match against European opposition will be first up, on just the third day of the tournament in Vancouver, Canada, at 9pm on Saturday, June 13 — that's a good early-afternoon slot for Australian TV viewers on Sunday, June 14 at 2pm (AEST).\n\nThere will be much hoopla over the match against the co-hosts United States in Seattle Stadium, home of the NFL's Seahawks, at 3pm local time on Friday, June 19.\n\nLoading Instagram content\n\nThat means fans in Australia will have to set their alarms for a 5am AEST kick-off on Saturday, June 20, to watch the glamour tie of Group D.\n\nThe third match has been confirmed against South American side Paraguay for 7pm on Thursday, June 25, at San Francisco Bay Area Stadium in Santa Clara, California, which is a midday (AEST) kick-off on Friday, June 26.\n\nEvening kick-offs in North America dominate the complete schedule, which was released on Saturday, with FIFA having an eye on the expected heat in the US, Mexico and Canada, while also providing most fixtures in prime European evening viewing time.\n\nThe final takes place at 3pm local time, when the heat may play a factor in the open stadium at the Meadowlands in New Jersey on July 19.\n\nThe opener between Mexico and South Africa in the roofless Azteca Stadium, scene of the 1970 and 1986 finals, in Mexico City is also an afternoon kick-off.\n\nThe rundown for all 12 groups in next year's FIFA World Cup, with Australia drawn in Group D. (AP: Chris Carlson)\n\nHolders Argentina start against Algeria in the Kansas City evening and will then face Austria under the Dallas roof at midday (3am AEST) in their next match.\n\nEuropean champions Spain play Cape Verde in a David versus Goliath opener in Atlanta's dome at midday on June 15 (2am AEST), while Portugal, with Cristiano Ronaldo in tow, have two midday games under Houston's cover (3am AEST).\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Netherlands will also benefit twice from the roofs in the Texas stadiums, while Canada uses Vancouver's cover twice.\n\nFIFA said the fixtures aimed \"to ensure the best possible conditions for all teams and spectators while, where possible, enabling fans all over the world to watch their teams play live across different time zones\".\n\nFIFA boss Gianni Infantino on Saturday apologised to Argentina coach Lionel Scaloni after he was told to wear gloves in Friday's draw just to handle the trophy he had won in 2022.\n\nAfter a media backlash, Infantino welcomed Scaloni back on stage on Saturday when the draw was completed to touch it with his hands.\n\nAAP/AP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/heatwaves-fire-live-blog-december-6/106110894",
    "title": "Live: Fire jumps a kilometre over water, disaster declared for NSW regions",
    "publish_date": "Sat, 06 Dec 2025 22:22:45 +0000",
    "category": "finance",
    "authors": [
      "Andrew Thorpe",
      "Isla Evans",
      "Emma Simkin",
      "Lauren Bohane",
      "Bridget Murphy"
    ],
    "text": "Rochelle Doust was on the waterfront at Koolewong yesterday when she noticed the fire was getting worse.\n\nShe drove back up to her house with her dog in the car — and that's when she saw her husband trying to save the house he had built 20 years ago.\n\n(ABC News: Emma Simkin)\n\nThe family was ultimately forced to evacuate.\n\n\"Everything's in it — his grandmother's stuff, his mother's stuff, all my stuff — everything, it's all gone, the whole lot,\" she told the ABC.\n\n\"He wanted to put it out and he's up there barefoot trying to put it out … and I'm screaming at him to come down.\n\n\"I'm trying to put the embers out at the front, until I realised that on the other side of the driveway it was a huge fire, and I've gone 'Oh s***' and I jumped in the car and left.\"\n\nShe said houses on either side of theirs were unscathed.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/careless-documentary-film-aged-care-australia-sue-thomson/106100558",
    "title": "New doco is a clarion call to care more about Australia's aging population",
    "publish_date": "Sat, 06 Dec 2025 21:49:51 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "As I sit down to write up this interview with passionate Melbourne-based filmmaker Sue Thomson about her must-see documentary Careless, which examines the bipartisan mess that's been made of aged residential care via privatisation, a text from her pops up.\n\nThe mighty Margaret, Thomson's mother, whose resistance to going into care is the cornerstone of the film, died over the weekend. I've been given permission to mention this, and I think Margaret's worth saluting.\n\n\"She was funny and outrageous, smoked cigarettes, sewed all my clothes and my dolls', worked full-time as a nurse and was incredible,\" Thomson says.\n\n\"But over the years, I saw another side of her. She was full of grief and pain, residual trauma from her upbringing.\"\n\nFast Facts about Careless What: A funny, frank and fearless family-focused documentary about the state of aged care in Australia Directed by: Sue Thomson Starring: Margaret Thomson, Sue Thomson, Lola Nankervis When: In cinemas December 4 Likely to make you feel: Like the major party politicians have a lot to answer for\n\nLike many older Australians, some doors were best left closed, in Margaret's mind.\n\n\"We were never allowed to talk about her losing her mother at 16 in a very tragic way,\" Thomson says.\n\n\"Her father had a stroke. When my mum and dad divorced, we had family members she never saw again. My mum's armour went up big time, and she and I clashed for years.\"\n\nThomson and Margaret butt heads in the film but there's never any doubt of their deep bond of love and respect. Lola, Thomson's daughter with partner Brian Nankervis (ABC Melbourne host and RocKwiz co-host) eases their sparring.\n\n\"I have three children working in the arts, with Lola particularly interested in making her own documentaries,\" Thomson says. \"So I asked her if she would be interested in working on Careless. If I hadn't had Lola, my mother would have hardly been in the film.\"\n\nSue Thomson's mother Margaret (pictured) was the inspiration behind Careless. (Supplied: Ben Bryan)\n\nCareless features a gorgeous cast of older Australians faced with leaving their beloved homes, including immigrant Italian couple Luciana and Mario and First Nations Elder Professor Linda Payi Ford (Rak Mak Mak Marranunggu) who notes remote communities often have no care home provision, let alone a reliable phone or internet connection.\n\nLola bridged the gap.\n\n\"She did that with all the subjects, who saw her as their grandchild and were much more at ease.\"\n\nOmnishambles\n\nIntergenerational care, and how we've lost sight of that, is at the heart of Careless, which debuted at this year's Melbourne International Film Festival.\n\n\"Capitalism plays a big part, sadly,\" Thomson says. \"In Western society, it became all about home ownership, so you work longer hours and you're not available to care.\"\n\nThe film, co-written and produced by Thomson's regular collaborator, Adam Farrington-Williams, marks the finale of an unofficial trilogy.\n\nThe Coming Back Out Ball Movie explores aging as an LGBTQIA+ person, sometimes having to go back in the closet in care homes.\n\n\"What was incredible was their resilience and positivity, despite what they suffered through,\" Thomson says.\n\nUnder Cover investigates the shocking statistic that women over 50 are the fastest-growing cohort experiencing homelessness in Australia.\n\n\"There are women over 50 living in their cars,\" Thomson says.\n\n\"Loneliness is probably a bit of a through line.\"\n\nProfessor Linda Payi Ford is a senior research fellow at Charles Darwin University, with her research focusing on Indigenous issues. (Supplied: Ben Bryan)\n\nCareless opens with a montage of prime ministerial pratfalls, playing on the word 'careless', then goes on to unpick not just their clumsy footwork, but also how they have let older Australians down.\n\nBob Hawke and Paul Keating made moves towards business, but it was John Howard who turbocharged the privatisation shift. The successive Labor governments of Kevin Rudd, Julia Gillard and Anthony Albanese have done little to course-correct.\n\n\"In 1997, the government very clearly saw it as a way of making lots of money, without thinking clearly about the long-term effects of monetising aging,\" Thomson says.\n\n\"They all talk a lot, we had a royal commission, and very little has changed.\"\n\nEven the food that residents are served is heinous, as ABC TV's Maggie Beer's Big Mission underlined.\n\n\" You're paying thousands of dollars for your parents to be fed slop. \"\n\nNavigating a labyrinth\n\nTechnology can be confounding for older Australians, too, Thomson says.\n\n\"My dad was an intellectual and an academic, and my mum was a nurse, and they were so bloody stoic, they'll be fine,\" she ponders.\n\nBut they're not.\n\n\"They'll say, 'My computer's really bad, it's not working'. But they're not using it properly. Or they've got arthritis in their fingers.\"\n\nCareless attempts to get to the bottom of Australia's failing aged care system. (Supplied: Ben Bryan)\n\nGovernment website My Aged Care is labyrinthine and difficult to navigate for even the most tech-savvy amongst us. Try phoning instead, and the wait time is gargantuan; hold music plays havoc with hearing aids, then the line drops out, so you start again.\n\n\"It's brutal,\" Thomson says.\n\n\"They'd ask mum to type in a number, and she doesn't even know where to find that. So children take over the role of dealing with the enormous amount of technology.\"\n\nChildren at the younger end of the scale also feature in Careless. A Greek chorus of kids narrates it, with a hint of ABC TV's Old People's Home For 4 Year Olds.\n\n\"One of them is trying to do a fundraiser at her school for connecting older people with younger people,\" Thomson says.\n\n\"We need to close the generational gap. Older people shouldn't be locked away by themselves. They have something to offer.\"\n\nWhile Margaret had her daughter Sue as support, many Australians in aged care are without relatives. (Supplied: Ben Bryan)\n\nMany of us have no kids to rely on.\n\n\"If my mum didn't have me, she'd be f**ked,\" Thomson says. \"If you don't have children and you're growing old in Australia, Jesus Christ, I feel for you.\"\n\nPointing to solutions\n\nThomson points to Scandinavian countries with a better model and hopes we can catch up.\n\n\"With empathy, we can affect change in the smallest possible way,\" she says.\n\n\"Governments should take more control, paying for wonderful, beautiful, diverse, inclusive communities where people can age in place, supported.\n\n\"But at the moment, that ain't going to happen.\"\n\nNovember films you need to see November saw the return of two beloved franchises; magic-filled Now You See Me and action classic Predator - but can either live up to their predecessors?\n\nCareless is a cry for change, and a fitting tribute to Margaret Thomson.\n\n\"Mum is quite representative of women that age who have done it tough, who find the humour in it,\" Thomson says.\n\n\"It was really important that this film was angry at the system, but I wanted to show that they're not just maudlin, bemoaning their lives.\n\n\"They're out there doing great things, trying to make the best of it, and often they're hilarious.\"\n\nCareless releases in Australian cinemas on December 4",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/qvmag-launceston-future-reform/106053812",
    "title": "'Treasured' gallery that costs ratepayers millions faces a problem",
    "publish_date": "Sat, 06 Dec 2025 21:34:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "More than three years after Launceston City Council green-lit a \"bold\" plan to ease the financial burden of its flagship cultural asset, stakeholders worry momentum has stalled.\n\nThe historic Queen Victoria Museum and Art Gallery (QVMAG) welcomed a record 162,000 visitors last financial year.\n\nThe council-owned cultural institute is widely regarded as one of the best in regional Australia — but it has long come at a significant cost to ratepayers.\n\nQVMAG is expected to chalk up about $10.17 million in expenses during 2025/26, offset by only $2.8 million in income.\n\nIn a bid to ease the financial burden on ratepayers, an \"ambitious\" plan for a new governance structure and funding model was unanimously approved by the City of Launceston Council in 2022.\n\nThe Queen Victoria Museum and Art Gallery (QVMAG) in Launceston is one of Tasmania's flagship cultural institutions. (ABC News: Hayden Smith)\n\nBy transitioning to a company limited by guarantee, QVMAG would be overseen by an independent board and officially recognised as a charity, unlocking the ability to access myriad other revenue streams.\n\nThe City of Launceston would retain ownership of the buildings and their vast collection.\n\n\"This ambitious Future Directions Plan aims to set the institution on a pathway to a sustainable and secure future,\" said then-Launceston mayor Albert van Zetten in June 2022.\n\n\" The Queen Victoria Museum and Art Gallery is one of Launceston's most treasured and important cultural institutions. \"\n\nBut now, more than three years later, supporters of QVMAG — including one of Australia's most acclaimed painters — say the \"transition of governance\" plan has stalled.\n\nConcern after director departs\n\nA cause for concern among stakeholders is the resignation of QVMAG's general manager, Shane Fitzgerald, who was working towards developing and implementing the Futures Plan.\n\nThe born and raised Tasmanian has worked in museum leadership roles across Australia and was working at QVMAG on the Futures Plan for more than three years.\n\nShane Fitzgerald was the main architect of the QVMAG Futures Plan. (City of Launceston Facebook )\n\nThe president of QVMAG Friends, Vicki Dewsbury, said Mr Fitzgerald was \"hired with the remit to find and implement a solution\" to the financial burden on ratepayers.\n\n\"His deep-dive research and consultation with staff and stakeholders was comprehensive and his findings compelling,\" Ms Dewsbury said.\n\n\" The Futures Plan outlined the options for how QVMAG might reduce its reliance on the City of Launceston. \"\n\nBut Mr Fitzgerald abruptly left his role at QVMAG earlier this year.\n\nIn a July 4 email to council staff — seen by the ABC — City of Launceston chief executive Sam Johnson said Mr Fitzgerald had stepped down \"to pursue new opportunities\".\n\nMr Fitzgerald has been contacted for comment.\n\nIn the latest QVMAG annual report, chair of the council-appointed Museum Governance and Advisory Board James Riggall paid tribute to Mr Fitzgerald's leadership and \"understanding of the role of galleries and museums in society\".\n\nArtist unhappy QVMAG progress 'has now been halted'\n\nEarlier this year, QVMAG hosted a highly successful exhibition featuring the life's work of Tasmanian artist Michael McWilliams.\n\nThe acclaimed painter said he was fully on board with the \"bold and powerful\" Futures Plan, but was concerned by the lack of recent progress towards key benchmarks.\n\nContemporary Tasmanian artist Michael McWilliams is a big supporter of the Futures Plan. (ABC News: Sarah Abbott)\n\nUnder the Futures Plan timeline, QVMAG was supposed to be registered with the Australian Charities and Not-for-profits Commission by November this year.\n\nA new skills-based board was earmarked to be established next month.\n\nNeither of those things have happened.\n\n\"QVMAG would have become a major player in the cultural sector and been able to access funding opportunities that are currently beyond its scope,\" McWilliams said.\n\n\" It is really disappointing to see the process has now been halted. \"\n\nMcWilliams, who won the inaugural Glover Prize in 2004, said the Futures Plan was \"not pie in the sky\" but based on substantial research.\n\nCouncil investigating path forward\n\nLaunceston Council chief executive Sam Johnson said the council was still committed to the Futures Plan and \"currently progressing most of the actions set out\".\n\n\"The decision to move to a company limited by guarantee in 2022 appears to have been made without a sufficient understanding of the legal and financial implications or timing of the transition,\" he said.\n\n\" This crucial investigative work is now being undertaken so we can properly progress all identified actions. \"\n\nSam Johnson, chief executive officer of Launceston City Council, says they are still progressing the Futures Plan. (Supplied: City of Launceston)\n\nTwo of the plan's cornerstones were the creation of an independent board and QVMAG's registration as a charity.\n\nBut the status of these projects remains unclear.\n\n\"The Museum Governance Advisory Board is active and meets regularly — an independent board is not required while the institution is owned and operated by the City of Launceston,\" Mr Johnson said.\n\n\"Local government is not eligible to apply for charitable status.\"\n\nHe said the recruitment process was underway for Mr Fitzgerald's successor following his resignation in July.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/caught-and-bowled-king-neser-feared-his-test-career-was-over/106111568",
    "title": "Caught-and-bowled king Neser feared his Test career was over",
    "publish_date": "Sat, 06 Dec 2025 21:33:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "Michael Neser feared his Test cricket career was over when a frustrating hamstring injury struck him down at the worst possible time last summer.\n\nA year later, the affable bowling all-rounder is \"strong again\" and on the cusp of helping Australia to a 2-0 Ashes series lead.\n\nNeser, 35, went some way to justifying his shock selection ahead of Nathan Lyon in the second Ashes Test with two big wickets — both caught-and-bowled — under lights on day three at the Gabba.\n\nAfter England flew to 0-45 at the dinner break, Neser (2-27) stretched high to catch Ollie Pope (26) from his own bowling before giving Zak Crawley (44) the same treatment.\n\nCrawley played low into Neser's hands amid a collapse of 6-80 that looks to have cruelled England's hopes of levelling the series in Brisbane.\n\nMichael Neser snaring England number three Ollie Pope and opener Zak Crawley (right). (AP: Tertius Pickard)\n\nNeser had dropped Ben Duckett (15) on six earlier in the night so was pleased to have struck back with some valuable scalps in the top order.\n\n\"That first one Duckett hit was a bit harder, he hit that very hard. Those are 50-50s but the other two were pretty regulation. Fortunately enough, I caught them,\" Neser said.\n\nEngland (6-134) went to stumps 43 runs behind Australia, who set a big first-innings total of 511 and appear likely to seal a second win from as many Tests this series.\n\nThis week's home Test felt a world away for Neser last summer after the Queenslander suffered a long-term hamstring injury playing for Australia A in early November.\n\nLoading...\n\nNeser, who had played the second of his two Test matches in 2022, had been in the mix to replace injured Cam Green for the hotly-anticipated Border-Gavaskar Trophy.\n\nInstead, he watched as Mitch Marsh and Beau Webster earned the nod as all-rounders in the famous series win, all the while questioning his own Test future.\n\n\"To be honest, after the last season, when I thought I was bowling superbly and I had my chance and I did my hammy really badly, I thought, 'Bugger, that could've been my chance,'\" Neser said.\n\nHe needed two months to recover from his injury and eventually returned to the pitch for the end of the BBL and Sheffield Shield seasons.\n\nA mainstay of extended Test squads, he skipped out on a possible county cricket stint over the Australian winter to ensure he would be fit if called upon for the Ashes.\n\n\"A big pre-season did me wonders and I feel strong again. I feel like my hammy is back to the way it was,\" Neser said.\n\nThis week marked an end to Neser's three-year wait for a third chance in the Test team, with the quick called into an all-pace attack for depleted Australia at the Gabba.\n\n\"I always dream about playing for Australia. It's something that I live and breathe, cricket. To be given another chance, I'm very honoured,\" he said.\n\nNeser holds the odd distinction among world cricketers of playing all of his first three Test matches in day-night fixtures.\n\nHe was called in for a last-minute debut in the 2021/22 Ashes series before adding a second cap against West Indies in 2022 and then replacing Lyon in Brisbane.\n\nIn a perfect world, Neser would love a crack at red-ball Test cricket, but that may not come this summer with Pat Cummins likely to recover from a back injury for the third Test.\n\n\"I'm very fortunate and privileged that I've been given the chance with the pink-ball Tests,\" he said.\n\n\"But obviously it's a dream to play more Tests and red-ball, pink-ball, I love it all.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-07/breast-cancer-screening-bus-pulled-after-staff-electric-shocks/106090358",
    "title": "Water leaks, electric shocks force 32yo breast cancer unit off road",
    "publish_date": "Sat, 06 Dec 2025 21:05:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Tasmania's two breast cancer screening buses continued operating for 14 months after it was officially declared unroadworthy, until two staff received electric shocks, forcing its withdrawal.\n\nThe public was told that the bus, dubbed 'Luna', sustained water damage that caused technical issues, leading to the cancellation of all future mobile appointments around the south and east coast until further notice.\n\nShould you skip your mammogram? Is the radiation safe? Here's how they work and who should have them We break down everything to do with mammograms and with the help of these experts, bust some myths about them.\n\nDocuments obtained under a Right to Information request reveal in April, the bus \"was affected by water leaks, causing water damage and electrical failures and a subsequent safety event with two staff experiencing minor electric shocks\", leading to the bus being immediately pulled from service and repairs later being quoted at $42,000.\n\nThe department was also told \"there will still be a risk that the vehicle's cladding could detach during transport, creating a further safety hazard,\" leading it to conclude \"continuing to use and maintain (mobile screening unit) Luna is unlikely to be the safest and most cost-effective option\".\n\nThe Breastscreen Tasmania bus was declared unroadworthy, so it was delivered to locations on a flatbed truck. (Supplied: Kristie Johnston)\n\nAnother document shows the department acknowledging that without a replacement for Luna, which screens about 5,500 women for breast cancer every year, \"there is potential for an additional 30 to 50 delayed cancer diagnoses per annum\" for women who do not access screening elsewhere.\n\nWhile the department could not provide the latest figures when asked, a missed locations document shows that as of August 14, only 39 per cent of women whose appointments were cancelled in April had been rebooked.\n\nThe department did say it was \"working hard to ensure affected clients are booked for a screening as soon as possible\".\n\nThe department acknowledged \"any reduction in screening rates increases the risk of women being diagnosed with breast cancer at later stages, when the cancer is more difficult and expensive to treat … which has a subsequent significant negative impact on these women, their families and communities, and the Tasmanian health system\".\n\nLong list of faults\n\nA mechanical inspection invoice from December 2022 shows the department had been aware of serious operational faults with Luna for years, well before it was officially declared unroadworthy.\n\nWomen on 'slightly unhinged' cancer support mission When Carol Smith was diagnosed with breast cancer, she relied on support from strangers on the internet. Now, she's making sure other WA women don't have to struggle alone.\n\nAn invoice contained an extensive list of significant defects with the bus, including coolant leaks and radiator problems, a faulty brake system, worn drive belts, a rusted exhaust system, a chassis at risk of cracking, oil leaks from the transmission, and inoperable wiper washers.\n\nThe invoice also revealed that Luna had no documented history of servicing, oil changes, or wheel bearing maintenance.\n\nInternal emails exchanged between department employees in February 2024 state the bus had \"packed it in\" and was deemed unroadworthy \"due to both excessive steering column movement and chassis rust\".\n\nThe department then arranged for Luna to be transported between screening sites on a flatbed trailer as a temporary measure, so it could legally remain operating while it sought a permanent solution.\n\nRTI documents reveal there had been attempts to replace the bus since 2023, including one proposal to scrap a replacement altogether in favour of a permanent clinic, although this plan never came to fruition.\n\nOne attempt would have delivered a new bus by June 2025, limiting the service gap to less than three months, but it was abandoned after legal concerns were raised about the risks and liability of using two vendors to supply different components of the bus.\n\nBridget Archer has said \"all attempts must be made\" to get the mobile screening program back on track. (ABC News: Jonny McNee)\n\nWhen will a replacement bus arrive?\n\nIn October, Health Minister Bridget Archer confirmed Varley Group had been chosen to deliver a new mobile breast screening bus, after months of scrutiny over the replacement's progress.\n\nAustralia lagging behind on breast density reporting High breast density elevates a woman's cancer risk, but unlike other countries, Australia doesn't routinely report this information.\n\nIn a media release, Ms Archer said the government \"anticipate[s] that it will be operational by September next year\" and aims to expedite its delivery.\n\nHowever, according to a procurement form included in the RTI documents, Varley Group's \"construction contract is 12 months with an estimated start date of November 2025, followed by a 12-month Defect Liability Period.\"\n\nThis could mean completion in November 2026, two months after the government's timeline, potentially leaving Tasmania without a second screening bus for 20 months.\n\nWhen asked to clarify the discrepancy between the contract end date and the publicly stated delivery timeline for the replacement bus, Ms Archer said \"the department's advice, following the selection of Varley Group as the preferred provider in September, was that delivery should occur within the next 12 months\".\n\nShe added, \"however, given the importance of this service to Tasmania's regions, I have made it clear that all attempts must be made to expedite this timeframe\".\n\nKristie Johnston says it was \"very lucky that things weren't a lot worse\" after the mishaps. (ABC News: Ebony ten Broeke)\n\n'The government should hang their heads in shame'\n\nKristie Johnston, independent MP for Clark, said she was deeply disturbed over the run of events.\n\n\"This department is charged with caring for Tasmanians and their healthcare, and yet they failed to act and protect their staff and protect patients who are accessing the service,\" she said.\n\n\"We're just very lucky that things weren't a lot worse.\n\n\"This is not a luxury service, this is a life-saving service and the government should hang their heads in shame.\n\n\"It's simply not good enough that we could have had a replacement bus service earlier this year with only three months of no service, but now we are waiting at least 18 months.\"\n\nWhat options do women have in the interim?\n\nWomen aged 40 and older are able to book free appointments at Tasmania's fixed breast screening clinics by calling 13 20 50.\n\nThese clinics are located in Hobart, Rosny Park, and Launceston.\n\nA temporary subsidy was introduced in October by the department to help women who, in the absence of a screening bus, need to travel to one of these clinics.\n\nThe scheme applies to all women whose mobile screening appointments were cancelled or missed in 2025 and 2026.\n\nDuring this year's state election campaign, the Liberals promised to build four additional permanent clinics, in Kingborough, Devonport, Triabunna and Glenorchy, but a timeframe for their opening has not been provided.\n\nConstruction recently began on a $15 million Public Diagnostic Breast Care Centre at the Royal Hobart Hospital's Liverpool clinics, a previous promise from the 2024 state election, which is expected to be completed in March 2026.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/lifestyle/inside-kates-2025-together-at-christmas-carols-service-20251207-p5nljl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Kate's 2025 Together at Christmas carols service",
    "publish_date": "Sun, 07 Dec 2025 13:16:43 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Inside Kate's 2025 Together at Christmas carols service\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-perfume-genius-20251204-p5nl1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sensuality, swagger and a world first in an unforgettable night at the Forum",
    "publish_date": "Sun, 07 Dec 2025 12:22:48 +1100",
    "category": "entertainment",
    "authors": [
      "Nadia Bailey",
      "Vyshnavee Wijekumar",
      "Thuy On"
    ],
    "text": "MUSIC\n\nNoël! Noël! ★★★★\n\nAustralian Brandenburg Orchestra, Melbourne Recital Centre, December 6 Brimming over with festive cheer, this year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. This musical accent honoured Tommie Andersson, the orchestra’s foundation theorbo and baroque guitar principal, who is making his final appearances with the ABO this tour after delighting audiences for nearly 40 years. This year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. Credit: Laura Manariti Under the irrepressibly energetic direction of Paul Dyer, the orchestra and Brandenburg Choir were joined by guest artists Argentinian mezzo-soprano Maria Eugenia Nieva and Australian classical guitarist Andrew Blanch. Wearing a full-length bright red dress with a side slit, Nieva exuded plenty of Latin sensuality. Her strong, dark-chocolate mezzo voice animated a variety of numbers from the traditional carol Riú Riú Chiú, through Gioia & Amore by Spanish renaissance composer Soto de Langa and Nana from Six Popular Spanish Songs by Manuel de Falla to Santa la noche, an arrangement of Adolphe Adam’s beloved classic O Holy Night.\n\nBlanch, who featured prominently in the program, was especially brilliant in Albéniz’s Leyenda, arranged to showcase the simmering passion of the guitar’s rapid-fire flamenco technique. Once again, the Brandenburg Choir brought sheer delight to the choral aspect of Noël! Noël! with crisp ensemble and crystalline diction. Between the customary bookends, Hark! The Herald Angels Sing, and O Come, All ye Faithful, came some English schmaltz courtesy of John Rutter and Philip Stopford, as well as an intense account of the Kyrie from Palestrina’s Missa Papae Marcelli. In chamber formation, the Brandenburgs themselves were in top form, bringing joyous dynamism to Monn’s Sinfonia in G and whimsy to an arrangement of God Rest ye Merry, Gentlemen. Andersson’s own solos and his poignant accompaniment of Stille Nacht (Silent Night) with its original Austrian lilt mirrored his quiet but impressive dedication. Noël! Noël! continues to be a distinctive but deservedly popular Christmas tradition.\n\nReviewed by Tony Way\n\nMUSIC\n\nParcels: LOVED Tour ★★★★\n\nSidney Myer Music Bowl, December 4 I dare you to stand still at a Parcels show. From the minute they hit the stage, the band’s blend of electro-pop and disco-pop rhythms has the crowd possessed, grooving along to the psychedelic funky beat. The Australian five-piece indie band were formed in Byron Bay in 2014, and make the spontaneous move to Berlin that year. They have played some high-profile gigs in 2025, including Coachella and Glastonbury. This weekend, their national tour concludes in Sydney with two gigs on the steps of the Opera House. It’s hard to stand still at a Parcels show. Credit: ©Martin Philbey The band experiments with many different sounds across the set. Opening with Tobeloved, they show off their signature harmonies, reminiscent of The Beach Boys. It’s clear how Berlin Club culture has influenced their music when they perform Gamesofluck, the stage lit with an electric blue as the keys and guitar pulse. They performed Overnight, a single co-produced and co-written with Daft Punk after they attended Parcel’s first-ever show in Paris in 2016; the duo’s electronic influence is evident in the live sound.\n\nFinallyover, their final song, has a much more mellow, retro rock feel like The Beatles. They perform a lengthy instrumental track, which feels improvised, exerting riffs that resemble the disco energy of Boney M and AC/DC’s ultra-rock Thunderstruck. Parcels in full flight. Credit: ©Martin Philbey “I know we are a lot of people, but we move as one tonight,” says one of the band, indistinguishable in the moody lighting, and that collective feeling carries through, maintaining a chill vibe across the entire set. During Summerinlove, the crowd leans into the sexiness with footage of couples kissing in the front row projected onto a heart-shaped kiss cam on the screen above. It’s clear the band are having just as much fun as the crowd. Patrick Hetherington’s foot pounds the stage as Jules Crommelin’s hips thrust against his guitar and Noah Hill’s neck jerks back and forth like a chicken. The band seemed to have as much fun as their energetic audience. Credit: ©Martin Philbey\n\nThere’s a sense of euphoria that fills the atmosphere at the all-ages concert. Like a rave, the infectious beats travel through your ears and all the way to your feet. The band asks tech staff to light up the crowd, as they peer into the masses extending up the theatre and across the green of the Sidney Myer Music Bowl. As Crommelin perches at the end of the stage, he says: “Just going to take a second to take this all in.” What a start to the summer.\n\nReviewed by Vyshnavee Wijekumar THEATRE\n\nSoul of Possum ★★★\n\nfortyfivedownstairs, until December 13 A few months ago, after nearly 10 years of consultation, parliament passed Treaty legislation for Aboriginal Victorians. It’s the first treaty of its kind in Australia and one that not only acknowledges past injustices but also commits to returning decision-making powers to Aboriginal communities. Presented within this context, this latest staging of Soul of Possum serves as a potent and topical reminder of the past that still needs present reckoning. Soul of Possum is based on the experiences of the playwright’s ancestors. Credit: Darren Gill\n\nBased on the personal histories of playwright Brodie Murray’s ancestors (in particular his father and grandfather), the play is a taut reenactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. With a few cast changes, Soul of Possum’s latest iteration follows on from a successful season at Castlemaine State Festival and Yirramboi Festival in 2021. It’s 1853, in Wamba Wamba Country and Marnuu (Balla Neba) is troubled by his dreams; the voice of Possum predicts wide-scale destruction by a hostile force, a devastation of both people and wildlife. But his fellow warriors Gundi (Wimiya Woodley) and Barru (Murray) are sceptical and mock his warnings. Meanwhile, there’s a steamboat moored at the river, with a military expedition about to disembark to open up the country for “glorious empire”. It’s a story most of us should know; this first contact skirmish between two parties who are completely alien to the other’s customs and cultures, and the resulting and continuing legacy of settler-occupation. The play asks us to imagine what it was actually like in the initial round of invasion and resistance, a pattern that would repeat itself across the land. The play is a taut renactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. Credit: Darren Gill\n\nThe stage is sparse except for a large projection of the riverbank at the back, two platforms on the left that serve as the steamboat and a clump of river reeds, a tree, and a campfire to the right. Preview night brought some rushed dialogue from the trio of warriors that should hopefully settle for the rest of the season. Maybe they feel there’s no time to waste: under Beng Oh’s direction, the 70-minute narrative moves fast, with the plight of both sets of white and blackfellas played out in alternate scenes before they finally meet. Loading What makes Soul of Possum interesting is that it dramatises the internecine in-fighting among each group. The First Nations Australians lose valuable time arguing about what to do with the threat of territorial trespass while the English marauders - Captain Gibbons (Leigh Scully), Lieutenant Bankes (Gabriel Partington), Dr Wilkins (Kevin Dee) and Irish convict Yates (Luke Mason) have their own on-board power conflicts to contend with. All four characters are performed with ease and conviction. There’s an earnestness about this play and some unnecessary repetition in the script. The ending that brings us back to the present day also seems a bit too expository after everything that we’ve witnessed before. Nonetheless, Soul of Possum does manage to take us into the crossfire of colonial violence in its short, sharp stage time.\n\nReviewed by Thuy On\n\nSoul of Possum was reviewed from a preview performance",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/culture/movies/redeem-one-of-25-double-passes-to-see-my-brother-s-band-20251111-p5n9ap.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Redeem one of 25 double passes to see My Brother’s Band*",
    "publish_date": "Sun, 07 Dec 2025 11:59:00 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "Written and directed by Emmanuel Courcol, My Brother’s Band follows two siblings separated by fate and reunited by music. As a Sydney Morning Herald subscriber, you have the opportunity to redeem one of 25 complimentary double passes to see it in cinema.*\n\nSYNOPSIS: Thibaut (the exceptional Benjamin Lavernhe, Delicious, C’est la vie!) is an internationally renowned orchestra conductor who travels the world. When a health crisis and subsequent DNA test inadvertently reveals that he was adopted as an infant, Thibaut discovers the existence of a younger brother, Jimmy (rising star Pierre Lottin), who lives in more modest circumstances; he works in a school cafeteria, cares for his mother and plays the trombone in a community brass band. The pair seem to have little else in common other than a love of performance, but sensing his sibling’s talent, Thibaut decides to remedy the injustice of fate and help nurture his brother’s gifts.\n\nWRITER/ DIRECTOR: Emmanuel Courcol\n\nCAST: Benjamin Lavernhe, Pierre Lottin, Sarah Suco, and Ludmila Mikaël\n\nRUNNING TIME: 103 minutes\n\nRELEASE DATE: December 26, 2025",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/golf/australian-open-golf-2025-live-coverage-cameron-smith-adam-scott-and-rory-mcilroy-battle-at-royal-melbourne-20251207-p5nlh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open golf 2025 Live Coverage: Smith charges to co-leader as McIlroy’s hopes fade",
    "publish_date": "Sun, 07 Dec 2025 11:34:45 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Min Woo Lee just nailed a brilliant four-metre putt to make birdie on the par-3 fifth hole. It repaired the damage of a bogey on the hole prior for Lee, and he’s still in the frame at 10-under.\n\nLee’s putt broke a massive amount to the right but the amazing part of the shot was Lee barely hit the ball. He just tapped it.\n\nIt was a downhill putt but the greens are also very quick at Royal Melbourne today, and the commentators keep mentioning the greens are extremely challenging. The “stimpmeter” reading is 13-feet.\n\nBut what does that mean, you ask?\n\nA stimpmeter. Credit: AP\n\nA stimpmeter is a standard measuring device to ascertain how fast - and far - a ball rolls on a green. On your average public course green, the ball will roll about 8 feet before stopping.\n\nOn the US PGA tour, tournament greens run at about 12, and in major championships, the stimpmeter reading will be between 13 and 14. When combined with slopes, anything more than 14 and the ball will often not even stop.\n\nThe greens at Royal Melbourne are expected to get quicker today, so brace yourself. Putting could decide the winner today.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/federal/anika-wells-charged-taxpayers-to-take-family-to-thredbo-ski-resort-20251206-p5nlep.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I don’t write the rules’: Wells, PM defend using taxpayer funds to bring family to ski resort",
    "publish_date": "Sun, 07 Dec 2025 11:22:34 +1100",
    "category": "sports",
    "authors": [
      "James Massola"
    ],
    "text": "“Anika Wells was working on that trip as sports minister, participating in the lifting up of parasport. That’s been driven by Anika Wells,” he said. “There are rules there, and I’m not going to go through each and every one. I’ve got a big job, David [Insiders host David Speers]. It’s completely within the rules. “There’s family reunion entitlements – all the travel that’s within the guidelines. She was working and there were announcements and there were events there.” Wells is also under pressure over her use of taxpayer entitlements to attend a friend’s birthday party in Adelaide, the sky-high cost of flights to New York for meetings at the United Nations and her use of expenses on trips to France undertaken as Sports minister. Wells faces multiple expenses questions\n\nSports and Communications Minister Anika Wells has been under pressure to justify travel expenses. Credit: Alex Ellinghausen Wells has been under fire since Wednesday after revelations she charged taxpayers more than $100,000 for flights to New York to showcase Australia’s social media ban. Loading This was swiftly followed by reports she had used her travel entitlements for trips to Adelaide, where she attended a friend’s birthday party, and three trips to France in one year in her role as sports minister to attend the Rugby World Cup and the Olympics. The furore over Wells’ use of expenses has overshadowed the minister’s attempts to promote new laws that restrict under 16s’ use of social media, which come into effect this Wednesday.\n\nIndependent Parliamentary Expenses Authority figures show the minister claimed $844 of taxpayer-funded travel allowance to stay at a resort in Thredbo over the two nights, and then claimed another $318 to stay in Canberra on Sunday night citing “parliamentary duties”. Her flights from Brisbane to Canberra, the nearest major airport to the Thredbo resort, cost taxpayers another $294.32. Wells was accompanied by her husband, Finn McCarthy, and two of her three children under “family reunion” rules that allow MPs to reunite with their families when travelling for work. Taxpayers spent another $1389.18 on flights so her family could join her for the weekend at the snow, with Wells’ husband posting pictures of their children on the skiing trip a couple of days later on social media. All told, the two-day trip to the ski fields cost taxpayers $2845.50, but a government spokesman defended the minister’s use of travel and entitlements, saying “the travel was in accordance with the guidelines”.\n\nBut Wells’ use of the family reunion rules is strikingly similar to a trip the current Home Affairs Minister Tony Burke took to Uluru back in April 2012, when he was the environment minister, and claimed $12,000 in allowances and flights so his family could join him on that trip. Details of Burke’s trip emerged in 2015, soon after the Bronwyn Bishop “choppergate” scandal. At the time, Burke insisted, like Wells, that he had not breached the rules but he did admit the trip was “beyond community expectations” of what MPs should be claiming in taxpayer-funded expenses. Burke repaid $8656.48 of that trip – the cost of four airfares – five years later, in 2020. There is no suggestion that Wells contravened the rules on the trip to Thredbo because of her official engagements, but the expenses claims raise fresh questions about her use of entitlements and whether they are in line with “community expectations”.\n\nTreasurer Jim Chalmers was asked last week on the ABC’s 730 program if Wells’ trip to New York passed the pub test, and argued: “That’s for others to judge. But from my point of view, it’s official travel. It’s well within the guidelines.” The rules for what expenses and allowances ministers can claim are governed by the Department of Finance’s “dominant purpose” test. Loading That test states that expense claims can be made for one of four reasons – when an MP or minister is undertaking parliamentary duties, electorate duties, party political duties or official duties. On its website, the department states that “the dominant purpose test asks whether you would have undertaken the activity or incurred or claimed the expense, allowance or other public resource but for your parliamentary business”.\n\nThe rules on reunions allow family members to travel from their home base to Canberra, with a maximum annual cost limit set as the equivalent value of nine business-class return airfares to Canberra for an MP’s partner, plus three economy-class return airfares to Canberra for each dependent child. Parliament’s Senate estimates committee heard last week that Wells, a staffer and a public servant had spent almost $100,000 on flights to attend the United Nations General Assembly and another $70,000 to host an event that spruiked the government’s teen social media ban earlier this year. After a difficult appearance at the National Press Club last week during which Wells avoided directly answering questions about her New York trip, The Australian Financial Review then revealed the under-pressure minister took a three-day taxpayer-funded $3600 trip in June to Adelaide. During that trip, Wells attended a friend’s birthday party as well as official meetings with state ministers.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/as-houses-burned-around-it-the-one-that-steve-built-stood-firm-20251207-p5nli1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As houses burned around it, the one that Steve built stood firm",
    "publish_date": "Sun, 07 Dec 2025 10:50:51 +1100",
    "category": "finance",
    "authors": [
      "Sally Rawsthorne",
      "Sitthixay Ditthavong"
    ],
    "text": "A month ago, Steve Foskett handed his neighbours the keys to their new home.\n\nA builder and resident of the Central Coast suburb of Koolewong, Foskett built a number of homes on Nimbin Road, which was ravaged by an out-of-control bushfire late on Saturday.\n\nSteve Foskett and his dog Cali, who “didn’t do any helping” while they defended his home. Credit: Sitthixay Ditthavong\n\nAt least 12 homes, some of which were built by Foskett, were destroyed by the fire, which had burnt through 120ha and was still active on Sunday despite a cool change that came through overnight.\n\nWhile homes in the block around it were destroyed, Foskett’s latest project survived the inferno that tore through the suburb, thanks, he said, to Bushfire Attack Standard 29.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/world/europe/dispute-over-meghan-s-claim-she-has-contacted-her-estranged-father-after-his-leg-amputation-20251207-p5nlgz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dispute over Meghan’s claim she has contacted her estranged father after his leg amputation",
    "publish_date": "Sun, 07 Dec 2025 10:35:56 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Meghan, Duchess of Sussex has said through her representative she tried to contact her estranged father, Thomas Markle, who reportedly had his leg amputated this week. It is unclear if the attempt was successful.\n\nA spokesperson for the duchess said in a statement on Saturday: “I can confirm she has reached out to her father.” On Sunday, the Daily Mail reported claims from Thomas, 81, that he has not heard from Meghan nor her representatives following his surgery.\n\nMeghan, the Duchess of Sussex in October. Her spokesperson says she has tried to contact her father. Credit: Getty Images For Balenciaga\n\nThe tabloid also claimed he had informed its reporter of his surgery before telling his son and live-in primary carer, Thomas Markle Jr., and daughter Samantha Markle. Meghan’s half-siblings were informed of their father’s surgery by the Daily Mail reporter, the tabloid alleged.\n\nOn Sunday, Samantha took to X (formerly Twitter) criticising the duchess and her alleged “PR bullshit”.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/shopping-make-you-hungry-here-are-brisbane-s-top-food-courts-20251201-p5njy5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shopping make you hungry? Here are Brisbane’s top food courts",
    "publish_date": "Sun, 07 Dec 2025 10:17:26 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Shopping make you hungry? Here are Brisbane’s top food courts Shopping malls might be much better for dining these days, but not all are equal. We rank Brisbane’s largest from one to five. Matt Shea December 7, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe dodgy shopping centre food court is a thing of the past. Or, if it still exists, it’s at least usually complemented by some quality alternative eateries, maybe in one of those la-di-da outdoor dining precincts with a playground, a water feature and those cool timber lounge chairs. Westfield Chermside in Brisbane’s north. Jamila Toderas But not all shopping centres are equal – particularly the big dogs: your Garden Cities, Indooroopillys and Chermsides – which is odd when so much else of the experience tends to be pretty consistent. Which is best? We wanted to find out, so over the past 12 months or so, we’ve spent more time than we probably should hanging around the city’s biggest suburban shopping centres to trial their eateries.\n\nAdvertisement\n\nRelated Article Monster 800-seat brewpub touches down near Brisbane Airport Before you ask: no, food-angled shopping centres like Market Square, Sunny Park et al. don’t count, nor does the CBD. This is the big suburban retail centres with a few anchor tenants like Myer or David Jones. We found you can get something half decent to eat at all these places. Still, there was one clear winner. 5. Westfield Carindale What are you doing, Carindale? This stalwart in the city’s south-east is a good shopping experience as far as malls go, but its food options lag the centres further up this list.\n\nAdvertisement\n\nYou’re not going to go hungry at Westfield Carindale, but it lags some of the other centres around town. Tammy Law You’re never going to eat poorly here, but it’s dominated by what I call “astroturfers” – the chains that have picked up on a trending cuisine and done a certainly passable, very replicable, but not particularly exciting take on it: think Grill’d for burgers, Roll’d for Vietnamese, or Guzman y Gomez for Mexican. But it is getting better. Yes, David’s Noodle & Hotpot is a chain, but it does very good malatang. There’s Foster & Black and Cafe Halo for coffee, or Gong Cha for bubble tea.\n\nAdvertisement\n\nThere’s also a Cinnabon, which hit Australia like a hurricane a couple of years back with cinnamon scrolls that are legitimately better than most independents. Cinnabon’s tightly spiralled buns. So, a pass mark, I guess. But there are better options in Brisbane when you want to shop and feed. 4. Indooroopilly Shopping Centre Despite its fancy expansion in 2014, which added high-end retailers such as Scanlan Theodore, Aquila and Zimmermann, Indooroopilly Shopping Centre’s eating options remained pretty underwhelming for years.\n\nAdvertisement\n\nIndooroopilly lagged behind other shopping centres for dining, but it’s getting better. But it was the first centre outside Sunnybank to get a Hakataya Ramen, and from there, it’s slowly become better and better. Motto Motto, from Sonos owner William Liu, is always worth a shout (it has an outlet in a lot of shopping malls around the south-east) for fast-paced Japanese. And the centre over-represents on specialty coffee, with both Foster & Black and Archer present and correct.\n\nAdvertisement\n\nThe gold, though, is on the ground floor, where there’s a Cinnabon and a David’s Noodle & Hot Pot. Also, check out The Butcher’s Grill: little more than a grill-and-counter setup attached to Andrew’s Meats, its classic Angus beef burger – basically, a gussied up take on an old-school Australian barbecue burger (refreshing, in the face of the American-style onslaught) – has gone up in price recently, but is still one of the better value burgs around town. 3. Westfield North Lakes If you tend to breeze through Westfield North Lakes just to get to Ikea, you’re missing out, because the centre boasts a stack of good food options.\n\nAdvertisement\n\nYes, there’s a TGI Fridays and an El Camino Cantina, and a whole lot of other phone-it-ins, but there are also a bunch of delicious alternatives: see Lanzhou Beef Noodle for hand-pulled Chinese noodle soup, Kinn for fast-paced, fragrant and wallet-friendly Thai, and Chicken Park for fried bird. There’s also Smiling Dumplings and Noodles for, yep, dumplings and noodles, Bapboi for Korean barbecue, and the family run Ka-Chow Asian Kitchen for pan-south-east Asian. No need to resort to Swedish meatballs here.\n\nAdvertisement\n\n2. Westfield Chermside Now we’re getting serious. Chermside is the third-largest shopping mall in Australia and, since the addition of its outdoor dining precinct in 2017, has bulked up its food options to match. Westfield Chermside’s sunny outdoor dining precinct. There’s a bunch of good options here.\n\nAdvertisement\n\nTry Momo for crisply fried Korean chicken, Kinn+Derm for legit Thai, and Hanok for Korean barbecue. Also, Simone Presta and Carmine Guarino recently opened a second instalment of their terrific fast-paced Italian eatery Scugnizzi. Scugnizzi serves quality fast-paced Italian. Morgan Roberts Elsewhere, there’s Archer, Foster & Black and Be Kalii for coffee; Yo-Bar for self-serve frozen yoghurt and acai; Hakataya for ramen; NYC Bagel Deli for stacked bagels; and David’s Noodle & Hotpot for malatang. That’s just a taste of the independents (and smaller, quality chains), and then you have the big-box operators and fast food spots on top.\n\nAdvertisement\n\nTaken altogether, it’s well pitched and impressive in its ambition and utility, particularly when you consider Chermside probably didn’t have to do this – it’s not like the surrounding suburb heaves with restaurants and cafes. 1. Westfield Mt Gravatt Will any Brisbane shopping centre ever top Garden City for food? Probably not. And will anyone ever stop calling it Garden City? Again, probably not. Westfield Mount Gravatt (aka Garden City) is the clear winner when it comes to shopping centre food. Tammy Law\n\nAdvertisement\n\nThis huge shopping mall – the eighth-largest in the country – is the solar plexus of Brisbane’s multicultural southern suburbs, and that’s reflected in the giddy breadth of its food options. It was already reasonably good before the centre opened its outside dining precinct in 2014. Then, on top of that, there’s the 8 Street Asian food precinct downstairs, plus a bunch of good spots scattered in between. Where to start? The atrium at the top of the escalators at the north-western end of the centre is as good as any. Here, your Oportos, McDonalds and KFCs sit alongside operators such as 1919 Lanzhou Beef Noodle, with its unctuous, spicy bowls of hand-pulled Chinese noods; New Shanghai and its lengthy menu of house-made dim sum; and Hokkaido, with its perfectly flaked baked cheese tarts.\n\nAdvertisement\n\nWander down one of the halls to the outside dining precinct and you could eat at Betty’s, Vapiano or Nando’s, or get classy yum cha at Yum Cha Cuisine, killer Malaysian (including one of the best char kway teows in town) at Ya Hoo Kitchen, or well-pitched sushi at Sushi Edo. Hokkaido’s famous cheese tarts. And then there’s 8 Street, a charming facsimile of the kind of food alley you might find in Bangkok or Hong Kong. Here, there’s a bunch of hole-in-the-wall vendors serving malatang, chongqing noodles, ramen, bibimbap and more.\n\nAdvertisement\n\nScattered about other parts of the centre are a Hakataya Ramen, a Foster & Black and a David’s Master Pot malatang joint. If you need to eat while you shop, Garden City is the spot.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/starc-is-super-but-still-human-it-makes-the-return-of-lyon-a-must-20251206-p5nlg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc is super, but still human. It makes the return of Lyon a must",
    "publish_date": "Sun, 07 Dec 2025 09:59:06 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "As if anyone needed a reminder, Mitchell Starc proved once again in Brisbane just how super he was.\n\nBut the champion left-armer is still human, and his opening spell on Saturday perhaps highlighted just how crucial the injection of two veterans will be.\n\nAfter resting for only seven overs out of the Queensland heat – having top scored with 77 in Australia’s 511 first innings at the Gabba – Starc’s first spell with the ball showed signs of fatigue.\n\nMitchell Starc roared to life in the final hour of day three, after his worst opening spell of the series. Credit: Getty Images\n\nEngland opener Zak Crawley attacked the 35-year-old, whose first three overs went 0-25 – the only time this series he had not claimed a wicket in his first over.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/someone-doesn-t-want-me-in-the-club-salah-slams-liverpool-manager-20251207-p5nlhk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Someone doesn’t want me in the club’: Salah slams Liverpool manager",
    "publish_date": "Sun, 07 Dec 2025 09:38:46 +1100",
    "category": "sports",
    "authors": [],
    "text": "Liverpool’s Mohamed Salah said he had been “thrown under the bus” as he tore into the club over his treatment after watching from the bench as his side twice threw away the lead in a 3-3 Premier League draw with Leeds United on Saturday.\n\nThe 33-year-old Egyptian lashed out at the club and manager Arne Slot, telling journalists he felt he had been scapegoated for a poor start to the season and suggesting that he may not have long left at Anfield.\n\nSalah has become an iconic figure in his eight years at Liverpool. He has won two Premier League titles and scored 250 goals for the club.\n\n“I’m very, very disappointed to be fair. I have done so much for this club, everybody can see that during the years and especially last season,” Salah said in the post-match mixed zone.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw15-bournemouth-vs-chelsea-20251207-p5nlhf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Bournemouth vs Chelsea",
    "publish_date": "Sun, 07 Dec 2025 09:07:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Bournemouth vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw15-aston-villa-vs-arsenal-20251207-p5nlhg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Aston Villa vs Arsenal",
    "publish_date": "Sun, 07 Dec 2025 09:07:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Aston Villa vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw15-man-city-vs-sunderland-20251207-p5nlha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Man City vs Sunderland",
    "publish_date": "Sun, 07 Dec 2025 09:06:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Man City vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/article/afghan-embassy-australia-secrecy/0a6rsztq1",
    "title": "Fears for thousands of Afghans in Australia amid 'secrecy' over potential shutdown",
    "publish_date": "Sun, 7 Dec 2025 00:40:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Members of the Afghan Australian community are concerned about the future of Afghanistan's embassy, after reports the federal government has advised the current ambassador his diplomatic credentials won't be renewed in February.\n\n\n\n\n\nAmbassador Wahidullah Waissi, appointed in 2017, has stayed on at the Embassy of the Islamic Republic of Afghanistan since the Taliban took over the country in 2021.\n\n\n\n\n\nIt's considered an embassy-in-exile but has continued to issue official documents such as passports, visas, and verifying IDs to thousands of Afghan citizens living in Australia.\n\n\n\n\n\nBut its services haven't been operating as normal since the Taliban announced in July 2024 that it would no longer recognise consular documents issued by 14 embassies related to the former republic, including the Canberra facility.\n\n\n\n\n\nThe uncertainty has left the diaspora community feeling vulnerable, but crucial questions about the embassy's fate have been left unanswered.\n\n\n\nThe Embassy of the Islamic Republic of Afghanistan in Deakin, Canberra. Source: AAP / Lukas Coch\n\n'The second fall of Afghanistan'\n\nTravel agency Bamyan Air Travels, which has worked with the Afghan embassy for 19 years, said it hasn't been able to obtain a single document through the embassy since the Taliban's announcement.\n\n\n\n\n\n\"Even if they want to provide documents, what is the point if they're not accepted. They can't provide them,\" Bamyan's CEO, Ali Sarwari, said.\n\n\n\n\"They have no relationship or communication with the inside.\"\n\n\n\n\n\nJonathan Muir, chief of protocol at the Department of Foreign Affairs and Trade and a former ambassador to Qatar, told SBS News it's clear the embassy cannot continue to operate as it has been.\n\n\n\n\n\n\"The ambassador was sent and accredited to represent a sending state. In practice, that accreditation requires a subordinate of the sending state,\" he said.\n\n\n\n\n\n\"That state no longer exists and practical risks are accruing around the provision of the services of the embassy.\"\n\n\n\n\n\nHowever, Independent senator Fatima Payman, who was born in Kabul and fled to Australia as a child , said losing the embassy would be like \"the second fall of Afghanistan\".\n\n\n\n\n\n\"This will be the second fall of Afghanistan. We have already lost our country and this is our second home,\" she said.\n\n\n\nIndependent senator Fatima Payman has expressed concerns on behalf of Afghans in Australia. Source: AAP / Lukas Coch \"Under no circumstances, any Afghan across the country will support this idea of letting this happen.\"\n\n\n\nUnanswered questions\n\nOutside the embassy in Canberra's suburb of Deakin, Waissi had little to say about the future of the building he stood in front of.\n\n\n\n\n\nHe shook his head when asked what the Afghan community could expect in the coming months.\n\n\n\n\n\nWhen asked what services the embassy is currently providing, Waissi said: \"I'm not answering that question.\"\n\n\n\n\n\nThe secrecy is only adding to the confusion for the Afghan community in Australia.\n\n\n\n\n\nCurrently, the only way to access document services is through a Taliban delegate.\n\n\n\nHowever, with the Australian government stressing that it does not recognise the Taliban , people from Afghanistan risk being stranded — unless the federal government forms a diplomatic relationship with the Taliban.\n\n\n\n\n\nHowever, Professor William Maley from the Australian National University said forming such a relationship would be a potential security risk for Afghans who have fled the regime.\n\n\n\n\n\n\"Somebody acting in a consular fashion on behalf of the Taliban might then demand access to the personal records of people who have interacted with the embassy in the past,\" he said.\n\n\n\n\n\nOpposition foreign affairs spokesperson Michaelia Cash said a diplomatic relationship with the Taliban should not be on the table.\n\n\n\n\n\n\"The Taliban are a violent and oppressive regime that basically breach human rights on a daily basis,\" she said.\n\n\n\n\"Australia must absolutely maintain constant vigilance in relation to never recognising the Taliban regime.\"\n\n\n\n\n\nWithout clear answers from either the embassy or the federal government, Payman said the community is anxious about the future.\n\n\n\n\n\n\"There has been a void created by the government's secrecy and the department's lack of responses, and as you can imagine, the community is rightfully anxious.\"\n\n\n\n\n\nThis story was produced in collaboration with SBS Pashto.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/anika-wells-defends-taxpayer-funded-trip-costs/kc6e3jizp",
    "title": "'I stand by it': Minister defends taxpayer-funded trip costs",
    "publish_date": "Sun, 7 Dec 2025 00:39:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "A senior federal minister is defending her taxpayer-funded trips as being within government guidelines, as new details emerge about other costs.\n\n\n\n\n\nAnika Wells came under fire for the $100,000 cost of flying herself and three staff to New York to promote Australia's social media age ban, with further details emerging about trips she took to Paris, Thredbo and Adelaide.\n\n\n\n\n\nShe accepted the spending would elicit a \"gut reaction\" in the average Australian, but said it was an independent agency booking flights, rather than her browsing \"Webjet\".\n\n\n\n\n\nWells was supposed to travel to New York on Prime Minister Anthony Albanese's Royal Air Force jet in September, but was delayed because of the fallout from a deadly Optus triple-zero outage.\n\n\n\nLISTEN TO What to expect as the under-16s social media ban begins SBS News 07:06 English\n\n\"People can have an opinion about whether it was worth the money,\" Wells told Sky News on Sunday.\n\n\n\n\n\n\"But for me, the policy imperative that the life-changing work that we are trying to do ... it was really important and I stand by it.\"\n\n\n\nAlbanese defends spending as details emerge about other trips\n\nAlbanese defended the spending as within the guidelines and said the New York trip to promote the social media ban, which will come into effect on Wednesday, was \"very significant\".\n\n\n\n\n\n\"This was an important event that led directly to the European Union taking action,\" he told ABC's Insiders on Sunday.\n\n\n\n\n\n\"One of the comments I heard from various UN officials was ... 'this is the first time I've been to a forum that has changed my mind'.\"\n\n\n\nWells, who is also the sports minister, reportedly took three trips to Paris in 12 months at a cost of $116,000, to attend major sporting events including the Rugby World Cup, Paris Olympics and Paris Paralympics.\n\n\n\n\n\nShe was authorised to spend $6,000 on meals for five days, with one dinner reportedly billed for $600.\n\n\n\n\n\n\"I recall sometimes I was eating a muesli bar in the car. These are big days,\" Wells said.\n\n\n\n\n\n\"I appreciate it looks a certain way because it's Paris, but that is where the Games were.\"\n\n\n\n\n\nOpposition industry spokesperson Alex Hawke said the spending did not pass the pub test, adding the expenses were so high they would \"make the royals blush\".\n\n\n\n\n\n\"It simply doesn't stack up and the minister's defences don't seem to stack up either,\" he told Sky News.\n\n\n\n\n\n\"If the minister is eating a muesli bar ... then why is the taxpayer being charged for expensive dinners ... if she's not partaking of them.\"\n\n\n\nWells was also questioned about using travel entitlements to attend a friend's birthday while on a three-day, $3,600 work trip to Adelaide in June.\n\n\n\n\n\n\"I met with my South Australian counterpart in part about the South Australian Sport Institute, where we opened a para unit,\" she said.\n\n\n\n\n\nThe minister also spent $3,000 on flights and allowances for her husband and children to join her at Thredbo in June 2024 while she attended meetings with Paralympics Australia and Adaptive Festival organisers.\n\n\n\n\n\nWells acknowledged her family went skiing, but said she was there to work and the trip was within the family reunion and travel guidelines.\n\n\n\n\n\nIn 2012, current Home Affairs Minister Tony Burke took a work trip to Uluru and claimed $12,000 so his family could join him.\n\n\n\n\n\nWhile within the rules, he repaid $8,656 of that trip when details emerged in 2015, admitting it was \"beyond community expectations\".\n\n\n\n\n\nWells did not indicate she would be paying any of the money back, and said \"I work really hard\" and that she will keep following the rules \"as I have in every single instance\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 7
  },
  {
    "url": "https://www.sbs.com.au/news/article/palm-scheme-workers-face-modern-slavery-risks/xmy3993hk",
    "title": "Ethel took a job in Australia to support her family. She says she was 'left with nothing'",
    "publish_date": "Sat, 6 Dec 2025 19:31:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ethel used to work long days picking fruit in regional NSW. But after falling off a tractor four months ago, she can barely move.\n\n\n\n\n\nThe 33-year-old first came to Australia from Solomon Islands in 2022 under the federal government's Pacific Australia Labour Mobility (PALM) scheme.\n\n\n\n\n\nThe PALM scheme is a temporary visa program designed to plug Australia's labour shortages by recruiting workers from nine Pacific Island nations and Timor-Leste.\n\n\n\n\n\nEthel — whose name SBS News has changed for privacy reasons — was initially employed under the scheme to work on a farm in northern Queensland but left after just four months.\n\n\n\n\n\nThe take-home pay was more modest than she expected. After deductions, she says there was barely enough left to survive on, let alone support her family in Solomon Islands — the main reason she joined the scheme.\n\n\n\nEthel says $1,100 was deducted from her first pay for reasons that were unclear, leaving her with $500. Then, after paying rent and transport, she had only $200 left over.\n\n\n\n\n\n\"Family at home [were] asking for more money and we would send but we [were] left with nothing and that's why we left the PALM scheme,\" she tells SBS News.\n\n\n\n\n\nShe's among the thousands of workers who have absconded from the scheme , citing poor working conditions, exploitation and, in some instances, abuse. The Department of Home Affairs confirmed in a statement to SBS News that there are more than 7,000 disengaged PALM scheme workers in Australia. Many are living either unlawfully (without a visa) or on a bridging visa awaiting further determination.\n\n\n\n\n\nAs a disengaged worker without a visa, Ethel has no work rights or access to government support, relying instead on the help of the local community, volunteers, and charities.\n\n\n\n\n\nIt's a situation that has left her — and many others — vulnerable to exploitation and injury.\n\n\n\nAustralia's hidden workforce\n\nSince leaving the PALM scheme in 2022, Ethel has been working illegally in regional Australia, receiving cash in hand.\n\n\n\n\n\nIn August this year, while working at a farm in the regional NSW town of Leeton, she fell off a tractor and severely injured her leg.\n\n\n\nEthel has scars on her leg from an injury she sustained while working illegally on a farm in regional NSW. Source: Supplied Ethel spent a week in bed before the president of the volunteer-run Leeton Multicultural Support Group, Paul Maytom, was alerted. He took her to hospital where she spent three weeks and underwent three surgeries.\n\n\n\n\n\nWhen asked what would have happened if Maytom hadn't intervened, Ethel couldn't bring herself to answer, just shaking her head and pursing her lips.\n\n\n\n\n\n\"Paul helped me so much, I thank Paul so much and Red Cross,\" she says.\n\n\n\n\n\nMaytom first arrived in Leeton in 1967 to pick fruit. He served on the local council for 34 years and was mayor for 16 of those. Now retired, the 77-year-old spends his time helping disengaged workers like Ethel, even using his own money to pay for her medication.\n\n\n\n\n\n\"The people that I've worked with over the last 18 months, they're people that either don't have enough money because they've got sick, or they got injured and there's no cover,\" he tells SBS News.\n\n\n\n\n\nHe has dozens of notebooks filled with information about the people he's helped — detailing accounts of underpayment, mistreatment and exploitation. He points to the case of one woman whose employment picking strawberries was terminated because she became pregnant.\n\n\n\nWe have a process that clearly upfront says that you have the same rights as Australian workers but yet that [an unfair dismissal] can happen.\n\nMaytom says he wants Australians to know the hidden plight of these hidden workers.\n\n\n\n\n\n\"I believe if they understand what I know, they would accept and understand that these people are not really causing us any problem but they're caught in a trap and we need to help,\" he says.\n\n\n\nPaul Maytom has been supporting disengaged workers in Leeton in NSW for the past 18 months. Source: SBS News The number of disengaged workers in the PALM scheme ballooned during the COVID-19 pandemic. In response, the Department of Employment and Workplace Relations (DEWR), which, along with the Department of Foreign Affairs and Trade, is jointly responsible for the scheme, set up a disengagement taskforce.\n\n\n\n\n\nA spokesperson for DEWR declined to confirm the total number of disengaged workers but told SBS News in a statement that \"the employer-reported disengagement rate\" among PALM workers has declined \"from 10 per cent in 2020-21 to 3 per cent in 2024-25\".\n\n\n\n\n\n\"Addressing PALM worker disengagement is a priority for the Australian Government. Wherever possible, the Australian Government seeks to support the re-engagement of disengaged PALM workers,\" the spokesperson said, adding that a dedicated response team has been established to implement recommendations from the taskforce,\" they said.\n\n\n\n\n\nThe reasons why PALM workers have left the scheme vary, but many have pointed to problems arising from pay deductions, wage theft, mistreatment, insufficient work and being tied to a single employer.\n\n\n\n\n\nA report by the Immigration Advice and Rights Centre noted employers are allowed to make deductions from the wages of PALM workers, which means they are sometimes left with just $100-$200 per week.\n\n\n\nREAD MORE Labor criticised over worker visa rule backflip that could affect thousands\n\nPALM workers are also not allowed to leave their employer without approval from the DEWR.\n\n\n\n\n\nAs a result, many workers experiencing hardship are faced with three choices: to stick with their employer, leave the scheme and return home, or abscond and seek cash-in-hand work.\n\n\n\n\n\nBut returning home isn't a simple option for many, including Ethel.\n\n\n\n\n\n\"If we go back to Solomon Islands in five months, we have nothing because they give us more deduction,\" she says.\n\n\n\n\n\nFellow Solomon Islands-born PALM worker Constantino Waowao also feels his options are limited. He says mistreatment by his employer in regional NSW caused him to leave the scheme in 2022.\n\n\n\nConstantino Waowao is one of many disengaged workers who cannot return home. Source: SBS News / Apple Photos Clean Up But the 43-year-old says he can't go back to Solomon Islands out of fear.\n\n\n\n\n\n\"I'm gay, I will never go back, if I go back they will kill me, that's why I'm here,\" Waowao tells SBS News.\n\n\n\n\n\nSince January 2023, he has been on a bridging visa, awaiting a decision on his protection status.\n\n\n\n\n\n\"I don't feel happy about this because I need protection now,\" he says.\n\n\n\nIllegal work necessary, but risky\n\nDespite the lack of protections, there is no shortage of work for disengaged workers, especially in agriculture.\n\n\n\n\n\nJustin Davidson is a fifth-generation family farmer who grows oranges in Leeton and regularly employs seasonal workers. He tells SBS News he wants a better model for seasonal work that doesn’t rely on disengaged workers.\n\n\n\n\n\n\"I think everyone can acknowledge it is a problem and we need to address it, it's not sustainable,\"\" he says.\n\n\n\nFarmer Justin Davidson says disengaged PALM workers deserve a second chance. Source: SBS News Davidson says he wants to see better protections and employment opportunities offered to those who have disengaged from the PALM scheme, and that he empathises with those who seek out cash-in-hand jobs.\n\n\n\nThese people need a second chance, they need income.\n\nKen Dachi from not-for-profit multicultural support organisation Welcoming Australia says allowing workers to move more easily between employers signed up to the PALM scheme would lead to fewer disengaged workers.\n\n\n\n\n\n\"The name gives it away, it's the Pacific Australian Mobility Scheme, so the mobility component doesn't exist, it needs to be explicit and activated,\" he says.\n\n\n\n\n\nFar from an issue only affecting the regions or the towns dependent on this shadow workforce, Dachi points out that the fruit picked by disengaged workers ends up in homes across the country.\n\n\n\nWelcoming Australia's Ken Dachi wants to see more flexibility introduced to the scheme. Source: SBS News / Apple Photos Clean Up \"A certain percentage of the food we buy every day is from the hands of a disengaged worker; it's exploited labour that contributed to its coming to the shelf,\" he says.\n\n\n\nModern slavery risks\n\nIssues stemming from the PALM scheme have been well-documented, with corroborated reports of exploitation and work site fatalities prompting the NSW government to establish a parliamentary inquiry into modern slavery in 2024.\n\n\n\n\n\nAccording to a spokesperson for DEWR, there have been 104 deaths among workers participating in the PALM scheme (or its predecessors) dating back to 2012.\n\n\n\n\n\n\"The death of any PALM scheme worker is a tragedy, and the department extends its sympathies to the families, friends, employers and communities,\" the spokesperson said, adding that the majority of fatalities stemmed from \"medical conditions\".\n\n\n\n\n\nThe state's anti-slavery commissioner James Cockayne says disengaged workers are at significant risk of exploitation such as debt bondage, forced labour, deceptive recruitment, sexual harassment and violence and sexual servitude.\n\n\n\n\"At the margins, we see people, particularly when they disengage from the scheme, becoming very, very vulnerable to very serious exploitation, so serious that it rises to the level of modern slavery,\" Cockayne says.\n\n\n\n\n\nHe blames labour hire companies for \"overcharging people for certain services like laundry, transport, access to refrigeration\", which he says pushes people into \"a hamster wheel of debt\".\n\n\n\nSBS News is investigating experiences of modern slavery in Australia. Have you got a story to share?\n\nGet in touch at investigations@sbs.com.au or contact Catalina Florez at catalina.florez@sbs.com.au.\n\nCockayne says there is also no licensing requirement for labour hire companies in NSW, making it attractive for \"dodgy\" companies to move to NSW from states where they are required to get a licence.\n\n\n\n\n\n\"Companies are moving here because the lack of licensing means that it's easier to make more profit, which, of course, is a synonym for exploit more people more easily,\" he says.\n\n\n\nNSW anti-slavery commissioner James Cockayne describes the exploitation faced by some PALM workers as \"serious\". Source: SBS News A NSW government spokesperson told SBS News: \"NSW has been actively engaged with the Commonwealth Government and other jurisdictions with a view to establishing a National Labour Hire Licencing Scheme, as recommended by the 2019 Migrant Workers' Taskforce.\"\n\n\n\n\n\n\"SafeWork takes a proactive approach to addressing safety, including through information provision, engagement with industry, and proactive compliance checks across NSW,\" they said.\n\n\n\n\n\nCalls to a hotline run by Cockayne's office, 1800 Freedom, have increased by 116 per cent since this time last year, says the commissioner, adding that around half the calls received each week are connected to labour hire companies and, in many cases, the PALM scheme.\n\n\n\n\n\nAccording to Welcoming Australia, there are currently more than 30,000 PALM scheme workers in Australia. In the 2024–25 financial year, it's projected that workers participating in the scheme will pay more than $180 million in income tax.\n\n\n\n\n\nThe Australia Institute has found more than 230 Pacific Island workers were seriously injured and 45 died in Australia between 2020 and 2023.\n\n\n\nLISTEN TO 'It broke us, the whole feeling of shame, anger, despair': Modern slavery survivor SBS News 08:25 English\n\nGiven the high percentage of deaths among a relatively small number of participants, Cockayne is alarmed at the lack of political urgency to fix the scheme.\n\n\n\n\n\nHe puts it down to a lack of political pressure.\n\n\n\n\n\n\"Many of the stakeholders don't vote in Australia, the temporary migrant workers don't vote, their governments don't vote,\" he says.\n\n\n\nA history of migrant worker exploitation\n\nMoe Turaga arrived in Australia from Fiji in 1988 to help support his family.\n\n\n\n\n\nHis dad died when he was 13 years old, after which point Turaga says his mum struggled to make ends meet.\n\n\n\n\n\nHis cousin promised him he could study and earn more than $25 a week working in Australia.\n\n\n\n\n\n\"It felt like a good option to come out and help mum out as well and also to develop my young siblings' journey,\" he says.\n\n\n\nUpon arrival, Turaga's passport was confiscated, and he was told he owed a debt for travel and visa costs.\n\n\n\n\n\nHe worked at a regional grape farm in Victoria to earn money to pay off the debt and help his family. His cousin assured him his wages were being sent back to his family.\n\n\n\n\n\nBut after two years, Turaga decided to call his mum from a pay phone.\n\n\n\n\n\n\"That's when the penny dropped, that two years of our hard work, our families have never seen any money, nor did we,\" he says.\n\n\n\nTo this day, that question rings in my ears, when my mum asked me 'are you ever going to send money home?'\n\n\"To think that two years of our hard work — slogging it out in the middle of Victoria, in the winters and the summer — think that our families are not getting the fruits of our labour, we were absolutely devastated,\" Turaga says.\n\n\n\n\n\nHe escaped the farm and found refuge in a local church.\n\n\n\n\n\nTuraga eventually recovered his passport, secured a visa and appropriate work.\n\n\n\n\n\nHe's now a citizen, working as an advocate for others experiencing modern slavery.\n\n\n\nMoe Turaga says Australia has a long history of exploiting migrant workers. Source: SBS News Turaga regularly shares his story to make sure that what happened to him doesn't happen to other migrant workers. But he says he now gets hundreds of calls a week from exploited Pacific workers.\n\n\n\n\n\nHe says it's not easy for workers to just go home when they face hardship in the PALM scheme, largely for cultural and safety reasons.\n\n\n\n\n\n\"They're not going home with a bit of shame because if these guys go home with no money to their families and if they've been debt–bonded — if they've borrowed money to come over — that can be fatal,\" he says.\n\n\n\n\n\nWhile Leeton has a reputation for welcoming newcomers (signs in the town read \"Leeton welcomes refugees, migrants and new settlers\"), Dachi says their support systems aren't designed to manage the scale and complexity associated with widespread worker disengagement.\n\n\n\n\n\n\"Goodwill is not a strategy. Is it sustainable? No, there's donor fatigue, there's volunteer fatigue,\" he says.\n\n\n\n\n\nMaytom agrees more coordinated support is needed. He wants to see safety nets formalised for disengaged workers, such as interim health cover and an amnesty offered to allow the ghost workforce to be re-engaged into the scheme.\n\n\n\nLISTEN TO NSW inquiry finds more than 40,000 people trapped in modern slavery SBS News 00:57 English\n\n\"I have a good network of people around me, from their countries that do their best to support them while they can, but it can't go on forever,\" Maytom says.\n\n\n\n\n\n\"We're sort of getting overloaded at the moment, I'm grateful for whatever support we can get but we can't keep on doing what we're doing, we must find a way forward.\"\n\n\n\n\n\nSBS News also contacted the Department of Foreign Affairs and Trade for this story, but did not receive a response by the deadline.\n\n\n\n\n\nReaders who have concerns about modern slavery can contact 1800 FREEDOM on 1800 3733366 or at antislavery@dcj.nsw.gov.au for confidential support and assistance from the NSW anti-slavery Commissioner.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-fake-indian-wedding-tying-the-knot-between-trend-and-tradition/xiqestc3v",
    "title": "The fake Indian wedding tying the knot between trend and tradition",
    "publish_date": "Sat, 6 Dec 2025 19:31:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a Saturday in mid-November, seven-time bridesmaid Merlyn Romit geared up for another wedding, but one without a happy couple.\n\n\n\n\n\nIt was the first event hosted by the 29-year-old Indian Australian's wedding planning company — and, to her knowledge, the first of its kind in Australia.\n\n\n\n\n\n\"I came up with this idea three months ago , when one of my friends actually showed a similar event that's been done overseas,\" Romit told SBS Spice.\n\n\n\n\n\n\"The concept of immersive weddings and actually enjoying them for what they are, without the fuss of it, was actually done in India first, and then Ireland and London. I wanted to be one of the first to bring it to Australia.\"\n\n\n\n\n\nAfter months of planning, Romit saw her efforts come to life as over a hundred guests arrived at the event's waterfront location on Sydney's North Shore. They'd each paid between $90 and $109 to attend.\n\n\n\nMerlyn Romit, the founder of wedding planning company Desi Wed Australia, dazzled in a blush pink lehenga as she greeted guests at the Big Fat 'Fake' Indian Wedding. Source: Supplied / Sidd Rishi They ranged from engaged couples with pending nuptials to community members keen to experience the colour and vibrancy for which South Asian weddings are known.\n\n\n\n\n\nAttendee Abhijit, 33, said: \"I think for a long time they were like very traditional, family orientated. Now people let loose and actually have a good time.\"\n\n\n\n\n\nShoraye Khatter, co-director of event partner Brown Munde Events, said \"we're at an age right now where people are missing out [on attending weddings]\".\n\n\n\n\n\n\"Those people that don't go to weddings, they really want to experience it,\" he told SBS Spice.\n\n\n\n\n\nWhile marriage rates have now returned to roughly pre-pandemic levels, event vendors are keen to make up for lost time — something Romit also considered when planning her event.\n\n\n\n\"After being a bridesmaid seven times, I found out how difficult it was to plan a South Asian wedding in Australia. And so, I just wanted to create a space that really brings the top vendors in our industry together,\" Romit said.\n\n\n\n\n\nAttendee Nadisha, 36, said: \"I'm in the wedding industry, so I wanted to come along and see what all the vendors were up to ... see them showcasing all their beautiful efforts.\"\n\n\n\n\n\nFrom marigold flower garlands adorning the entrance, to a vibrant mehendi (henna) station and an abundant biryani bar, the fake wedding invited guests to participate in both familiar and new customs.\n\n\n\n\n\nMaree Whitlock from venue partner Zest Waterfront Venues said it's a good opportunity for people to learn about South Asian culture and have some fun.\n\n\n\nOne of the offerings exhibited by a vendor was a giant pavlova that newlyweds can help decorate for their wedding guests. Source: Supplied / Sidd Rishi \"I obviously don't come from [a South Asian] background so, for me culturally, it's so exciting to see something that's a little bit different that I kind of haven't been immersed in before,\" Whitlock told SBS Spice.\n\n\n\nMatrimony and money\n\nAside from the elephant archway framing the event's DJ booth, the buzz of the event was sobered by another elephant in the room — the rampant costs associated with South Asian weddings.\n\n\n\n\n\nIn Australia, the average wedding has been estimated to cost over $36,000.\n\n\n\n\n\nHowever, a South Asian wedding can be anything but average, often spanning over five days with various ceremonies depending on the cultural roots of the betrothed couple.\n\n\n\nAttendees also had the chance to briefly become Vogue cover models. Source: Supplied / Sidd Rishi Earlier this year, SBS Spice spoke to Sydney-based wedding planner Poonam Gururajan about how much her clients regularly shelled out.\n\n\n\n\n\n\"The smallest wedding I've ever worked on, I think it was around $45,000 to $50,000. That was just for the one day,\" Gururajan said.\n\n\n\n\n\n\"When you're looking at multi-day celebrations, it's anywhere from $150,000 to $500,000. When you talk about destination weddings, anywhere up to $800,000.\"\n\n\n\n\n\nThe extravagance of South Asian weddings is no secret — perhaps most clearly demonstrated by the lavish , extensive 2024 nuptial festivities of Indian tycoon Mukesh Ambani's son, Anant Ambani, with Radhika Merchant, which included performances by Rihanna and Justin Bieber.\n\n\n\nThe evening's celebrations included a classic game of musical chairs. Source: Supplied / Sidd Rishi Even before the Ambani wedding, the opulence of matrimonial ceremonies in the diaspora has progressively escalated in line with the rising cost of living, social media trends, and the improved accommodation of South Asian weddings by vendors outside the community.\n\n\n\n\n\nHowever, the core of any South Asian wedding is always community, as shown by the warmth among attendees at Sydney's recent fake wedding, even if they'd come together for different reasons.\n\n\n\n\n\nAnother attendee, 28-year-old Rahul, said: \"It's so rare to meet such a diverse group of people within our own community. And so, for me, that's what's important about it.\"\n\n\n\n\n\n\"We're bold, we're different, we're challenging the norm,\" Romit said.\n\n\n\n\n\nThis story was produced in collaboration with SBS Spice.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-up-against-world-cup-co-hosts-as-the-2026-draw-is-made/ndln6ludy",
    "title": "Australia up against World Cup co-hosts as the 2026 draw is made",
    "publish_date": "Sat, 6 Dec 2025 02:19:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPTS\n\n\n\n\n\n\"I will say this now in American English so everyone understands me, this is like 104 Super Bowls in one month. This is the magnitude of what we organise, ladies and gentlemen.\"\n\n\n\n\n\nFIFA boss Gianni Infantino... and, however you phrase it, the World Cup is the biggest show on earth.\n\n\n\n\n\nNow, we know a lot more about what that show in the US, Canada, and Mexico will look like next year, after the draw in Washington.\n\n\n\n\n\nUS President Donald Trump was there to draw his own country out of the bowl... and a cavalcade of stars of American sport were there, too.\n\n\n\n\n\nEven the Village People made an appearance.\n\n\n\n\n\nBut it was US basketball great Shaquille O'Neal who delivered Australia its moment of truth.\n\n\n\n\n\n\"I think he's getting the hang of it now... he is....Australia! Big noise there! The Socceroos have reached the knockout stage twice in six previous participations... 2006 and 2022.\"\n\n\n\n\n\nAustralia drawn in to Group D, alongside the United States, Paraguay, and a European team to be determined in a playoff next March and April - one of Turkiye, Kosovo, Romania, and Slovakia.\n\n\n\n\n\nPopovic is careful to point out there is no such thing as an easy group.\n\n\n\n\n\nBut it's being characterised as a fairly friendly draw for the Aussies... although not everyone always wants to be in the same group as a host nation at a World Cup.\n\n\n\n\n\nDon't put Socceroos coach Tony Popovic in that category, though.\n\n\n\n\n\n\"I'm actually excited about having that, because it increases the challenge. The focus will obviously be on the US team, the country will be behind them. And we've always punched well above our weight.\"\n\n\n\n\n\nIt's the first time Australia has been drawn in the same group as a host nation since the very first time they were in ever in a World Cup, in West Germany in 1974.\n\n\n\n\n\nAustralia played the US in a friendly in Denver in October, losing two goals to one.\n\n\n\n\n\nThe exact dates, times, and venues for the entire group stage will be confirmed by FIFA tomorrow.\n\n\n\n\n\nBut we have a fair idea of what the Australian World Cup campaign will look like - and the news is good for the Socceroos, as they'll likely be based on the west coast of North America.\n\n\n\n\n\nPopovic says that's a logistical advantage, amongst other things.\n\n\n\n\n\n\"Obviously, the east coast is a lot further for us- we have to land in the west and get another flight to the east. So, I'm sure the fans are a lot happier, and I anticipate they'd be going through their phones, and trying hard to get tickets.\"\n\n\n\n\n\nThe likely schedule - again, FIFA will confirm everything tomorrow - has Australia starting its campaign against the yet-to-be-determined European side in Vancouver on June the 14th.\n\n\n\n\n\nThey'll then play the United States in Seattle on June the 20th, before playing Paraguay in Santa Clara- about an hour's drive south-east of downtown San Francisco- on June the 26th.\n\n\n\n\n\nParaguay are a familiar opponent for Popovic- he played his last-ever game for the Socceroos against them, back in 2006 in Brisbane.\n\n\n\n\n\nAmongst a logjam of teams, they took the last automatic qualifying spot from South America this time around... and Popovic says he knows just how good they are.\n\n\n\n\n\n\"A lot of respect for South American teams. We saw how close they were to even getting second place in the group. So, a very good team. We anticipate a really tough match.\"\n\n\n\n\n\nAnd what of drawing a team from the European playoffs?\n\n\n\n\n\nTurkiye will start favourites to take that spot, but Popovic says he has no preferred opponent out of the four nations involved.\n\n\n\n\n\nHe also says not knowing the opponent until next year won't matter in the long run.\n\n\n\n\n\n\"It is harder. You can scout four teams. But, once March comes around, I'm sure there will be enough time for them, and us, to know the opposition well.\"\n\n\n\n\n\nIn this expanded 48-team men's World Cup, the top two teams in each of the twelve groups, as well as the eight best third-placed teams, go through to the knockout stage.\n\n\n\n\n\nA World Cup appearance - Australia's sixth in a row, and seventh overall - will provide a much-needed boost for the whole of Australian football.\n\n\n\n\n\nFootball Australia interim Chief Executive, Heather Garriock, says it should serve as a reminder of the importance of the domestic A-League competition, where many of the Australian squad started their careers.\n\n\n\n\n\n\"Yeah, it's a credit to Tony. He's obviously bled 13 players that have debuted for Australia in the last twelve months- that is really unheard of. So, to build the depth within Australian football, it's a credit to Tony, but also a credit to the A-Leagues back home. So, it plays a really crucial role. And to see the youth get an opportunity, week in and week out, under pressure, it's really important for us.\"\n\n\n\n\n\nSo, what will Popovic's Socceroos show the world in North America next year?\n\n\n\n\n\nPopovic acknowledges this bunch lack the sort of big names Australia had back in his playing days- but he says that won't hold Australia back, as they try to repeat their heroics in reaching the knockout stage of the last World Cup, in Qatar in 2022.\n\n\n\n\n\n\"We've got a lot of young, good players coming through. Players that I think will have big careers in years to come. And this is a chance for them to be on the world stage. They'll see an exciting group. A confident group. And one that will give their all for our country.\"\n\n\n\n\n\nThe World Cup opens on June the 12th...with a repeat of the 2010 World Cup's opening game...as Mexico hosts South Africa in Mexico City.\n\n\n\n\n\nThe other two teams in Group A are South Korea and a European playoff winner- either Denmark, Czechia, the Republic or Ireland, or North Macedonia.\n\n\n\n\n\nGroup B features co-hosts Canada, Asian champions Qatar, Switzerland, and another European playoff winner... one of Italy, Wales, Bosnia and Herzegovina, or Northern Ireland.\n\n\n\n\n\nGroup C has in it five-time champions Brazil, 2022 semi-finalists Morocco, Haiti, and Scotland.\n\n\n\n\n\nGroup E features heavyweights Germany, Ecuador, African champions the Ivory Coast, and the smallest country to ever make a World Cup,...Curacao... population, 158,000.\n\n\n\n\n\nGroup F shapes up as one of the toughest.... with the Netherlands, Japan, and Tunisia to be joined by whoever emerges from a playoff containing Ukraine, Poland, Albania, and Sweden.\n\n\n\n\n\nGroup G features Belgium, Egypt, Iran, and New Zealand.\n\n\n\n\n\nGroup H contains European champions Spain, Uruguay, Cape Verde, and Saudi Arabia.\n\n\n\n\n\nGroup I comprises France- who came oh-so-close to winning the world title four years ago- Senegal, Norway, and the winner of an intercontinental playoff comprising Iraq, Bolivia, and Suriname.\n\n\n\n\n\nGroup J is the group of defending world champions Argentina.\n\n\n\n\n\nTheir opposition comprises Austria, Algeria, and Jordan.\n\n\n\n\n\nGroup K features Portugal, Colombia, first-time qualifiers Uzbekistan, and the winner of playoff comprising Jamaica, New Caledonia, and the Democratic Republic of Congo.\n\n\n\n\n\nAnd Group L has provided England some tough opposition, as they look for the first world title since 1966.\n\n\n\n\n\nThey must face 2018 runners-up Croatia, African power Ghana, and Panama.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/make-memories-the-tragic-reality-of-childhood-dipg-and-the-new-research-giving-families-hope/2x3x9nh6j",
    "title": "'Make memories’: the tragic reality of childhood DIPG and the new research giving families hope",
    "publish_date": "Fri, 5 Dec 2025 20:30:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPippa Rae was nine years old when she was diagnosed with diffuse intrinsic pontine glioma, or DIPG.\n\n\n\n\n\nHer mother, Virginia, says she was a remarkable child.\n\n\n\n\n\n\"Pippa was a really vibrant personality. She was everybody's friend. She had lots of friends. She was sporty, athletic. She just made the most of life. It was almost like she lived an entire life in 11 years.\"\n\n\n\n\n\nIt's a rare and aggressive type of deadly brain cancer that forms in the brain stem - it mainly affects children.\n\n\n\n\n\nVirginia says Pippa's diagnosis was shattering.\n\n\n\n\n\n\"Your whole world comes crumbling down. At that point, I didn't realise that it was the worst possible tumour that anybody could be delivered, but I'd never had experience with brain tumours. You know that brain tumours are bad but to know the extent of that - I didn't know at the time.\"\n\n\n\n\n\nThe cancer is challenging to treat due to its location and infiltrative nature, making surgical removal impossible - so survival rates are so low.\n\n\n\n\n\nFamilies are often told to spend their time making memories.\n\n\n\n\n\nPippa died 21 months after she was diagnosed.\n\n\n\n\n\nShe was just 11 years old.\n\n\n\n\n\n\"We were very fortunate that we had 21 months and the majority of that time Pippa was relatively well and she was able to travel with us, so one of the best memories was living out her dream and taking her to Paris, and that's just something that remains with our family forever. It was a very beautiful and special time and we spent two weeks there.\"\n\n\n\n\n\nThe Australian Cancer Research Foundation has awarded a $2.5 million grant to the Walter and Eliza Hall Institute of Medical Research in Melbourne.\n\n\n\n\n\nIt will fund a lab dedicated to research treatments for brain cancers like DIPG in children and glioblastoma - another aggressive type of brain cancer - in adults.\n\n\n\n\n\nKerry Strydom is the C-E-O of the Cancer Research Foundation.\n\n\n\n\n\n\"There really isn't a fantastic treatment option at the moment and what we are hoping is that this grant will provide hope to families with children with DIPG.\"\n\n\n\n\n\nThe ACRF Brainstorm Research Lab will use AI and other tools to test thousands of treatment options and determine the best course of action.\n\n\n\n\n\nIt will also fund a clean room to make personalised cell therapies for patients.\n\n\n\n\n\nProfessor Misty Jenkins, the head of the Walter and Eliza Hall Institute, admits it's a challenge.\n\n\n\n\n\n\"Prognosis for DIPG is the most dismal of any other cancer, and in fact, brain cancers kill more children than any other disease. And so the dial hasn't shifted for decades. And unfortunately oncologists are still having the same conversations with patients, which is telling them to go home and make memories with their families, and that there are no options available. And so we really need to start working together and collaborating better and really start to take more of a creative approach to tackling these really insidious, intractable diseases like brain cancer.\"\n\n\n\n\n\nThe Brainstorm project will test new drugs as well as therapies for brain cancers, which they hope will speed up the process from discovering treatment options right through to clinical trials.\n\n\n\n\n\n\"This is an end to end pipeline, so it's going from the drug discovery using AI approaches and liquid handling robots for drug screening all the way through to laboratory based testing all the way through to our patients that are in the operating room, having their tumours removed, and then being able to sequence some quickly and diagnose quickly, and then using that information to inform our drug design.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-is-the-fifa-peace-prize-and-why-was-trump-selected-as-the-inaugural-recipient/48x417rme",
    "title": "What is the FIFA peace prize, and why was Trump selected as the inaugural recipient?",
    "publish_date": "Fri, 5 Dec 2025 20:18:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "The draw for the 2026 World Cup took place in Washington on Saturday morning AEDT, with US President Donald Trump playing a prominent part in a star-studded ceremony that will map the path to glory for contenders at the first ever 48-team finals.\n\n\n\n\n\nBefore the draw began at the Kennedy Center, FIFA chief Gianni Infantino, who has built a close relationship with Trump, awarded the US president FIFA's inaugural peace prize.\n\n\n\n\n\nFIFA says the honour \"recognises the enormous efforts of those individuals who unite people, bringing hope for future generations\".\n\n\n\nA video prior to the presentation celebrated Trump for resolving the war in Gaza and trying to end Russia's war in Ukraine.\n\n\n\n\n\nThe trophy, a gold-plated globe carried by upraised hands, was considerably larger than the Nobel, which is just a simple medal.\n\n\n\n\n\nHe took a moment to congratulate himself. The United States, he said, was \"not doing too well\" before he took office, but now \"we're the hottest country anywhere in the world.\"\n\n\n\n\n\nEarlier, Trump told reporters he did not care about the prize, but noted that he had \"settled eight wars\" in his 10 months in office.\n\n\n\n\n\n\"I don't need prizes. I need to save lives,\" Trump said. \"I saved millions and millions of lives, and that's really what I want to do.\"\n\n\n\nThe most logistically complex World Cup in history will be held across the United States, Mexico and Canada from 11 June to 19 July, with 16 more teams added to the global showpiece, up from the 32 nations involved in Qatar in 2022.\n\n\n\n\n\nThe draw was co-hosted by supermodel Heidi Klum and American actor and comedian Kevin Hart, and featured performances by the Village People, Robbie Williams and Andrea Bocelli.\n\n\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw.\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw. Source: AP / Alex Brandon Trump has made the World Cup a centrepiece event of both his second presidency and the 250th anniversary of US independence next year.\n\n\n\n\n\nBut he has injected domestic politics into the preparations, threatening to move World Cup matches from Democratic-run cities if he deems conditions \"unsafe\".\n\n\n\n\n\n\"I would call Gianni, the head of FIFA, who's phenomenal, and I would say, let's move it to another location. And he would do that,\" Trump said recently.\n\n\n\n\n\nEleven of the 16 World Cup venues are in the United States, with three in Mexico and two in Canada.\n\n\n\n\n\nThe Azteca Stadium in Mexico City will host the opening game and the final will take place at the MetLife Stadium outside New York City.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-6-december-2025/thgghatj1",
    "title": "Socceroos draw co-hosts US for next year's World Cup | Morning News Bulletin 6 December 2025",
    "publish_date": "Fri, 5 Dec 2025 20:09:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has been drawn in the same group as co-hosts in the United States for next year's football World Cup.\n\n\n\n\n\nThe draw for the tournament has been held in Washington in the presence of dignitaries including U-S President Donald Trump.\n\n\n\n\n\nAustralia is in Group D next June alongside the U-S, Paraguay, and the winner of next March's European playoff between Turkiye, Romaania, Slovakia, and Kosovo.\n\n\n\n\n\nFIFA has clarified that exact dates, times, and venues for each match will be confirmed tomorrow.\n\n\n\n\n\nThe top two teams in each of the twelve groups, plus the eight best-ranked third-placed teams, will make it to the knockout stage of the newly-expanded 48-team men's World Cup.\n\n\n\n\n\n+++\n\n\n\n\n\nUS President Donald Trump has become the first ever recipient of FIFA's inaugural peace prize at the 2026 World Cup draw.\n\n\n\n\n\nGianni Infantino, the head of world football's governing body and a close ally of the President, presented Mr Trump with the award during the ceremony.\n\n\n\n\n\nIn accepting the award, Mr Trump said it was one of the great honours of his life.\n\n\n\n\n\n\"We saved millions and millions of lives. The Congo is an example. Over 10 million people killed, and it was heading for another 10 million very quickly. The fact that we could do that, India, Pakistan, so many different wars that we were able to end, in some cases, a little bit before they started, just right before they started. It was going to be late, but we got them done.\"\n\n\n\n\n\nMr Infantino says Trump won the award for exceptional and extraordinary actions to promote peace and unity around the world.\n\n\n\n\n\n+++\n\n\n\n\n\nRussian President Vladimir Putin says he is ready to continue uninterrupted shipments of fuel to India, in spite of heavy pressure from the United States for India to stop buying oil from Moscow.\n\n\n\n\n\nPrime Minister Narendra Modi is hosting Mr Putin at a summit in New Delhi dominated by energy, defence and trade talks.\n\n\n\n\n\nIn his first visit to the country since Russia's full scale invasion of Ukraine, Mr Putin was given a red-carpet welcome with an honour guard and 21-gun salute.\n\n\n\n\n\nHe says the countries pledged to develop multi-faceted relations - and boost trade and the supply of oil and gas.\n\n\n\n\n\n+++\n\n\n\n\n\nDangerous fire conditions are set to continue across parts of eastern Australia with fears dry lightning risks sparking new blazes.\n\n\n\n\n\nIn Tasmania , authorities say it is not yet safe for residents affected by a fire at Dolphin Sands to return home, after more than a dozen buildings and cars were damaged and two firefighters injured.\n\n\n\n\n\nBut cooler temperatures and showers washing across the state [[on Saturday]] will likely bring relief to fire crews.\n\n\n\n\n\nA fire on the New South Wales mid-north coast at Bulahdelah has been downgraded to advice but is not yet under control.\n\n\n\n\n\nTotal fire bans are in place across much of the state, with heatwave conditions set to remain throughout the day.\n\n\n\n\n\nIn Victoria, firefighters are working to contain a bushfire in Markwood, northeast of Melbourne, which has affected at least three properties.\n\n\n\n\n\n+++\n\n\n\n\n\nThe National Commissioner for Aboriginal and Torres Strait Islander Children and Young People has slammed Victoria's new 'adult time for violent crime' laws.\n\n\n\n\n\nThe legislation passed Parliament late Thursday [[041225]], allowing children as young as 14 to face life sentences for a number of violent crimes.\n\n\n\n\n\nThese include home invasion, carjacking and armed robbery, with the legislation mirroring similar tough-on-crime reforms in Queensland.\n\n\n\n\n\nCommissioner Sue-Anne Hunter has told NITV that the laws breach Australia's human rights obligations and won't make communities safer.\n\n\n\n\n\n\"Because we're not addressing the underlying issues of whatever that is for that child, whether it be a health issue, undiagnosed, whether it be family violence at home, you know if we don't intervene early, this will continue to happen. Each time we choose punishment over prevention, we compound their trauma, fuel re-offending, and entrench the very behaviours that we claim we want to stop as a society.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn cricket, Australia is on top after two days of the second Ashes test against England in Brisbane.\n\n\n\n\n\nAfter dismissing England for 334 in their first innings early on day two, Australia is 6 for 378 in their own first innings.\n\n\n\n\n\nThat's a lead of 44 runs, with four wickets in hand entering day three.\n\n\n\n\n\nThe Australians, who scored at more than five runs per over, were helped by England dropping four catches in the final session.\n\n\n\n\n\nOpening batsman Jake Weatherald top-scored for Australia, scoring 72.\n\n\n\n\n\nMarnus Labuschagne was second-top score, getting 65.\n\n\n\n\n\nHe's told Fox Cricket Australia have set themselves up to bowl at England in favourable conditions on the evening of day three.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/for-australian-retailers-christmas-cheer-turns-to-fear-as-theft-soars/13ajosv1c",
    "title": "For Australian retailers, Christmas cheer turns to fear as theft soars",
    "publish_date": "Fri, 5 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nShoplifting has become so relentless at Orange Supermarket in Sydney's south that staff say it now feels like part of the daily routine.\n\n\n\n\n\nLizhen Cai explains.\n\n\n\n\n\n\" Basically, theft happens every day and on average the losses range from $200-300 on smaller days to $500-600.\"\n\n\n\n\n\nAnd the thefts add up.\n\n\n\n\n\nAnnual losses of around $150,000 cut deeply into already-thin margins.\n\n\n\n\n\nMost thefts are small and easily hidden, according to staff member Harry Zhao.\n\n\n\n\n\n\" The most common cases are petty theft, where people quietly slip drinks or snacks into their bags or pockets while browsing.\"\n\n\n\n\n\nStore assistant Ray Huang says offenders come from all ages and backgrounds, though one group stands out.\n\n\n\n\n\n\" Offenders range from young to old, but the majority are young people.\"\n\n\n\n\n\nIt’s a view reinforced by a recent Monash University survey of 1,047 Australian shoppers aged 18 and older, released in October.\n\n\n\n\n\nThe Consumer Deviance Spotlight report ’s lead author is Stephanie Atto:\n\n\n\n\n\n\" Younger people are certainly more accepting of theft. Survey found that 54% of 18-to-34 year olds said that retail theft was justifiable to some degree.\"\n\n\n\n\n\nThe Australian Bureau of Statistics reported 270,000 retail thefts last year, a rise of 7 per cent on the previous year, and the highest in two decades.\n\n\n\n\n\nMs Atto says it’s part of a broader shift in attitudes.\n\n\n\n\n\n\" During an alarming crime rise, Australia is certainly more accepting of retail theft and our survey found that one in four believed it was justifiable to some degree to commit retail theft including taking an item and not paying for it. We do expect an increase in retail crime leading up to Christmas and we do say that retailers need to certainly be vigilant and also that police and law enforcement need to be out there looking after retailers as well.\"\n\n\n\n\n\nOver the past year, Victoria recorded the highest rise in all robberies, up by 16 per cent, followed by Tasmania with 11 per cent. Dr Vincent Hurley is a lecturer in criminology at Macquarie University, and a former police officer.\n\n\n\n\n\n\" There's inflation, there's stagnation of their wages if they're working part time. So even to survive, they would consider stealing to be a way to survive in this cost-of-living crisis.\"\n\n\n\n\n\nHowever, not everyone agrees.\n\n\n\n\n\nUp to 93 per cent of consumers aged 55 years and older view shoplifting as ‘not at all justifiable’.\n\n\n\n\n\nDr Hurley says self-checkouts that depersonalise payments, may be part of the problem.\n\n\n\n\n\n\"They do not see stealing from an individual, from a person. They see the stealing from an organization, a corporation, which has no face, it has no identity.\"\n\n\n\n\n\nSeventy per cent of shop owners report a rise in shoplifting over the past financial year.\n\n\n\n\n\nDespite retailers, police and peak bodies uniting to crack down on repeat offenders, Dr Hurley says the crime surge shows no signs of slowing.\n\n\n\n\n\n\" We should be worried about this trend as a society, absolutely! Low level crime can lead to much wider and more crime.\"\n\n\n\n\n\nCrime Stoppers Victoria reports that nearly 70 per cent of retail theft in that state is committed by repeat offenders, many operating in well-organised networks.\n\n\n\n\n\nIt’s one reason Harry Zhao fears fighting theft is a losing battle.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/australias-fifa-world-cup-2026-opponents-revealed/r064zjm0t",
    "title": "First time since 1974: Australia's FIFA World Cup 2026 opponents revealed",
    "publish_date": "Fri, 5 Dec 2025 19:26:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "The 2026 FIFA World Cup draw was as dramatic as the Andrea Bocelli performance that opened the ceremony — revealing the fate of every nation for football's biggest stage in the US, Canada and Mexico and a new peace prize.\n\n\n\n\n\nThe event was hosted by Comedian Kevin Hart and Heidi Klum, a German-American TV Personality, at the Kennedy Centre in Washington, DC, where FIFA president Gianni Infantino made the opening remarks describing the World Cup as '104 Super Bowls in one month' for the Americans.\n\n\n\n\n\n\"Welcome in all the languages of the world, in the language of football, which is the language of passion. FIFA is the official happiness provider of humanity,\" he said.\n\n\n\n\n\nHere's what happened at the glitzy 2026 FIFA World Cup draw event:\n\n\n\nWho is in Australia's group?\n\nFormer Manchester United and England defender Rio Ferdinand, along with broadcaster Samantha Johnson and sporting icons such as Tom Brady, Wayne Gretzky, Aaron Judge, and Shaquille O'Neal, conducted the draw for 48 national teams, placing them in 12 different groups.\n\n\n\n\n\nO'Neal drew Australia's name for group D, meaning the Socceroos will be playing against one of the hosts, the US (USMNT), and Paraguay.\n\n\n\n\n\nThis will be the first time Australia is facing the host nation since 1974 in Germany.\n\n\n\nNFL legend Tom Brady, ice hockey icon Wayne Gretzky and former NBA superstar Shaquille O'Neal were among the stars helping to conduct the draw. Source: AP / Alex Brandon The other team in the group will be the winner of playoff C, which will be between Turkiye, Romania, Slovakia, and Kosovo.\n\n\n\n\n\nSocceroos Head Coach Tony Popovic, has described the group as \"tough\", but said the team is \"looking forward to the challenge that lies ahead\".\n\n\n\n\n\n\"Finally finding out exactly who we will be playing at the FIFA World Cup 2026™ makes it all feel a lot more real. Now the real planning can begin,\" he said.\n\n\n\n\n\n\"There is still a bit of unknown in drawing a team from UEFA Play-Off C and we play them first — but we're excited.\"\n\n\n\nHow tough is Australia's group?\n\nThe draw means Australia has avoided coming up against the world's top teams in the group stage, including Spain, Argentina, France, and England.\n\n\n\n\n\nPosting on X, a former Australian football player and sports analyst has described Australia's group as \"positive but challenging group for Australia\".\n\n\n\n\n\n\"Playing home nation will be fantastic, great focus and drama, and the US support at a home event will be immense, and exciting,\" he said.\n\n\n\n\n\nThe United States, the world's No.14-ranked team, will be the hardest team Australia is facing. The Socceroos have played the US four times, for one win, one draw and two losses.\n\n\n\n\n\nSpeaking on Fox, the USMNT manager, Mauricio Pochettino, pointed out their previous clash against Australia.\n\n\n\n\n\n\"We need to respect all the opponents. All is going to be difficult. We know Paraguay was doing so well in the South American qualification. Australia, until we played them, were unbeaten in 12 or 13 games,\" he said.\n\n\n\n\n\n\"Full respect, but yes, believing that we can go through. But we need to perform.\"\n\n\n\nThe last time Australia won a match against the US was their first friendly game in 1992.\n\n\n\n\n\nAustralia have not played world No.39 Paraguay since a 1-0 friendly win in 2010 but are unbeaten in five clashes — two wins, three draws — with the South American team.\n\n\n\n\n\nThe Socceroos have never faced Kosovo, they've lost twice to Türkiye, have one defeat against Romania and one draw against Slovakia.\n\n\n\nWhen and where are the Socceroos playing?\n\nTeams will wait for confirmation of the venues and dates for all their group matches on Saturday (Sunday morning AEDT). Since the Socceroos are in the group with one of the hosts, their games are likely to be scheduled on North America's west coast.\n\n\n\n\n\nThe Socceroos' opponent for the first match is still unknown, as the national team will play their first match against the winner of playoff C between Slovakia, Kosovo, or Turkiye, on 13 June in Vancouver.\n\n\n\n\n\nOn 19 June, Australia will be facing the hosts, United States, in Seattle, probably for their most important match in the group stage.\n\n\n\n\n\nSix days later, for their last match, Australia will face Paraguay in Santa Clara.\n\n\n\nWhat if the Socceroos qualify?\n\nBased on the new World Cup rules, the top two teams from each of the 12 groups will qualify to the next stage, along with the eight best third-placed teams.\n\n\n\n\n\nIf the Socceroos win group D, they will face the best third-placed team from groups A, B, C, D or F, and if they get second, they have to play against the runners-up of group G, one of Egypt, Iran or New Zealand.\n\n\n\n\n\nFinishing one of the eight best third-placers will also mean that the Socceroos will face the Group E, I, or K winner.\n\n\n\nFull group draw revealed\n\nGroup A: Mexico, South Africa, South Korea, Play-off D winner (Czechia, Ireland, Denmark or Macedonia\n\nGroup B: Canada, Play-off A winner (Wales, Bosnia and Herzegovinam, Italy or Northern Ireland), Qatar, Switzerland,\n\nGroup C: Brazil, Morocco, Haiti, Scotland\n\nGroup D: The US, Paraguay, Australia, Play-off C winner (Slovakia, Kosovo, Turkiye or Romania)\n\nGroup E: Germany, Curaçao, Ivory Coast, Ecuador\n\nGroup F: Netherlands, Japan, Play-off B winner (Ukraine, Sweden, Poland or Albania) Tunisia\n\nGroup G: Belgium, Egypt, Iran, New Zealand\n\nGroup H: Spain, Cabo Verde, Saudi Arabia, Uruguay\n\nGroup I: France, Senegal, Play-off 2 winner (Bolivia, Suriname or Iraq), Norway\n\nGroup J: Argentina, Algeria, Austria, Jordan\n\nGroup K: Portugal, Play-off 1 winner (New Caledonia, Jamaica or Democratic Republic of the Congo), Uzbekistan, Colombia\n\nGroup L: England, Croatia, Ghana, Panama\n\nWhich is 'the group of death'?\n\nIt looks like for 2026, it will be hard to pick 'the group of death'.\n\n\n\n\n\nHowever, Group I (France, Senegal, playoff 2 winner —Bolivia, Suriname or Iraq — and Norway) can be one to watch, as the French superstar Kylian Mbappe, will be facing the Norwegian goal scorer Erling Haaland.\n\n\n\n\n\nGroup L (England, Croatia, Ghana and Panama) is another one to watch, as England might be looking for revenge from Croatia, who beat them in the 2018 World Cup semifinal, bringing their World Cup streak to an end at that time\n\n\n\nTrump winning the controversial '2025 FIFA peace prize'\n\nThe event, however, was not just about football, as Infantino presented the inaugural FIFA peace prize to the US President Donald Trump.\n\n\n\n\n\nInfantino said the award is presented by \"billions of football lovers\", and they gave the award to Trump for his \"actions to provide peace around the world\".\n\n\n\n\n\nInfantino said: \"This is what we want from a leader, a leader that cares about the people. We want to live in a safe world, in a safe environment … and you definitely deserve the first FIFA peace prize.\"\n\n\n\nFIFA said the peace prize \"recognises the enormous efforts of those individuals who unite people, bringing hope for future generations\". Source: AP / Chris Carlson/AP The prize was announced in early November and has since raised questions about whether Trump will be its first recipient.\n\n\n\n\n\nTrump and Infantino are known to have a close relationship.\n\n\n\n\n\nInfantino has supported Trump’s nomination for this year’s Nobel Peace Prize, and he was the unexpected guest of the Egypt Peace Summit, being invited personally by Trump.\n\n\n\n\n\nAfter receiving the FIFA peace prize, Trump said: \"This is truly one of the great honours of my life and beyond.\"\n\n\n\n\n\n\"The world is a safer place now ... Now I have to say we’re the hottest country anywhere in the world and we’re going to keep it that way,\" he said.\n\n\n\nHow to watch the World Cup?\n\nThe first match will be played between Mexico and South Africa on 11 June, at Estadio Azteca in Mexico City, and the tournament will be determined on 19 July, at MetLife Stadium in New Jersey.\n\n\n\n\n\nYou can watch all 104 games of the FIFA World Cup 26™ Live, free and exclusive on SBS, SBS VICELAND and SBS On Demand , next year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/ulurus-ayers-rock-resort-sold-to-us-company/8k5lb6k93",
    "title": "Uluru's Ayers Rock Resort sold to US-owned tourism company",
    "publish_date": "Fri, 5 Dec 2025 10:49:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Ayers Rock Resort in Uluru will change hands to a US private equity-owned tourism company, as part of a deal that will see the resort's land and buildings returned to Traditional Owners.\n\n\n\n\n\nThe resort, owned by the Indigenous Land and Sea Corporation (ILSC) and operated by the corporation's subsidiary Voyages Indigenous Tourism Australia, is the sole accommodation option for tourists visiting Uluru.\n\n\n\n\n\nThe ILSC struck an agreement with \"experiential tourism\" company Journey Beyond, a firm owned by New York-based Crestview Partners that already operates notable tourism assets across Australia including the Ghan and Indian Pacific railways.\n\n\n\n\n\nJourney Beyond will purchase the operational assets of Voyages Indigenous Tourism Australia, which include the Ayers Rock Resort and the Mossman Gorge Cultural Centre in far north Queensland.\n\n\n\n\n\nLand and buildings at both locations will be transferred to Traditional Owners, the Aṉangu Pitjantjatjara Yankunytjatjara and the Kuku Yalanji, respectively.\n\n\n\nThe ILSC was set up in 1995, a decade after the historic Mabo High Court decision that recognised Torres Strait Islander and Aboriginal traditional title to land.\n\n\n\n\n\nHowever, a government agreement required Aṉangu to lease the park to the Australian National Parks and Wildlife Service for 99 years.\n\n\n\nLand returned after years of work\n\nThe latest partnership deal will see the communities paid rent from Journey Beyond's leasing of the sites on 90 and 10-year leases, respectively.\n\n\n\n\n\nILSC chief executive Joe Morrison said the deal was \"the culmination of years of work\" to transfer the land to Traditional Owners, with more than $500 million in benefits to flow to the First Nations community.\n\n\n\n\n\n\"We are pleased to move closer to fulfilling the ILSC's statutory obligations of returning land to Aboriginal and Torres Strait Islander peoples,\" he said in a statement on Friday.\n\n\n\n\n\nJourney Beyond chief executive Chris Tallent said the company had worked with Indigenous communities across Australia and the agreement aligned with its goal to create \"immersive, authentic and uniquely Australian\" experiences.\n\n\n\nThe transaction is expected to be finalised early in 2026, with the divestment of the Yulara land to Aṉangu also expected to be finalised in 2026.\n\n\n\n\n\nThe Yulara Anangu Corporation board said Traditional Owners were happy with the decision and described the agreement as \"an investment in our future that will bring benefits in employment, education and support for Anangu enterprises\".\n\n\n\n\n\n\"We look forward to working closely with Journey Beyond in the development of world-class Indigenous tourism experiences that will share our language, our culture and our rich landscapes with visitors from all over Australia and around the world,\" the board said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/lifestyle/inside-kates-2025-together-at-christmas-carols-service-20251207-p5nljl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Kate's 2025 Together at Christmas carols service",
    "publish_date": "Sun, 07 Dec 2025 13:16:43 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Inside Kate's 2025 Together at Christmas carols service\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-perfume-genius-20251204-p5nl1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sensuality, swagger and a world first in an unforgettable night at the Forum",
    "publish_date": "Sun, 07 Dec 2025 12:22:48 +1100",
    "category": "entertainment",
    "authors": [
      "Nadia Bailey",
      "Vyshnavee Wijekumar",
      "Thuy On"
    ],
    "text": "MUSIC\n\nNoël! Noël! ★★★★\n\nAustralian Brandenburg Orchestra, Melbourne Recital Centre, December 6 Brimming over with festive cheer, this year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. This musical accent honoured Tommie Andersson, the orchestra’s foundation theorbo and baroque guitar principal, who is making his final appearances with the ABO this tour after delighting audiences for nearly 40 years. This year’s edition of the Australian Brandenburg Orchestra’s Christmas offering took on a Spanish flavour. Credit: Laura Manariti Under the irrepressibly energetic direction of Paul Dyer, the orchestra and Brandenburg Choir were joined by guest artists Argentinian mezzo-soprano Maria Eugenia Nieva and Australian classical guitarist Andrew Blanch. Wearing a full-length bright red dress with a side slit, Nieva exuded plenty of Latin sensuality. Her strong, dark-chocolate mezzo voice animated a variety of numbers from the traditional carol Riú Riú Chiú, through Gioia & Amore by Spanish renaissance composer Soto de Langa and Nana from Six Popular Spanish Songs by Manuel de Falla to Santa la noche, an arrangement of Adolphe Adam’s beloved classic O Holy Night.\n\nBlanch, who featured prominently in the program, was especially brilliant in Albéniz’s Leyenda, arranged to showcase the simmering passion of the guitar’s rapid-fire flamenco technique. Once again, the Brandenburg Choir brought sheer delight to the choral aspect of Noël! Noël! with crisp ensemble and crystalline diction. Between the customary bookends, Hark! The Herald Angels Sing, and O Come, All ye Faithful, came some English schmaltz courtesy of John Rutter and Philip Stopford, as well as an intense account of the Kyrie from Palestrina’s Missa Papae Marcelli. In chamber formation, the Brandenburgs themselves were in top form, bringing joyous dynamism to Monn’s Sinfonia in G and whimsy to an arrangement of God Rest ye Merry, Gentlemen. Andersson’s own solos and his poignant accompaniment of Stille Nacht (Silent Night) with its original Austrian lilt mirrored his quiet but impressive dedication. Noël! Noël! continues to be a distinctive but deservedly popular Christmas tradition.\n\nReviewed by Tony Way\n\nMUSIC\n\nParcels: LOVED Tour ★★★★\n\nSidney Myer Music Bowl, December 4 I dare you to stand still at a Parcels show. From the minute they hit the stage, the band’s blend of electro-pop and disco-pop rhythms has the crowd possessed, grooving along to the psychedelic funky beat. The Australian five-piece indie band were formed in Byron Bay in 2014, and make the spontaneous move to Berlin that year. They have played some high-profile gigs in 2025, including Coachella and Glastonbury. This weekend, their national tour concludes in Sydney with two gigs on the steps of the Opera House. It’s hard to stand still at a Parcels show. Credit: ©Martin Philbey The band experiments with many different sounds across the set. Opening with Tobeloved, they show off their signature harmonies, reminiscent of The Beach Boys. It’s clear how Berlin Club culture has influenced their music when they perform Gamesofluck, the stage lit with an electric blue as the keys and guitar pulse. They performed Overnight, a single co-produced and co-written with Daft Punk after they attended Parcel’s first-ever show in Paris in 2016; the duo’s electronic influence is evident in the live sound.\n\nFinallyover, their final song, has a much more mellow, retro rock feel like The Beatles. They perform a lengthy instrumental track, which feels improvised, exerting riffs that resemble the disco energy of Boney M and AC/DC’s ultra-rock Thunderstruck. Parcels in full flight. Credit: ©Martin Philbey “I know we are a lot of people, but we move as one tonight,” says one of the band, indistinguishable in the moody lighting, and that collective feeling carries through, maintaining a chill vibe across the entire set. During Summerinlove, the crowd leans into the sexiness with footage of couples kissing in the front row projected onto a heart-shaped kiss cam on the screen above. It’s clear the band are having just as much fun as the crowd. Patrick Hetherington’s foot pounds the stage as Jules Crommelin’s hips thrust against his guitar and Noah Hill’s neck jerks back and forth like a chicken. The band seemed to have as much fun as their energetic audience. Credit: ©Martin Philbey\n\nThere’s a sense of euphoria that fills the atmosphere at the all-ages concert. Like a rave, the infectious beats travel through your ears and all the way to your feet. The band asks tech staff to light up the crowd, as they peer into the masses extending up the theatre and across the green of the Sidney Myer Music Bowl. As Crommelin perches at the end of the stage, he says: “Just going to take a second to take this all in.” What a start to the summer.\n\nReviewed by Vyshnavee Wijekumar THEATRE\n\nSoul of Possum ★★★\n\nfortyfivedownstairs, until December 13 A few months ago, after nearly 10 years of consultation, parliament passed Treaty legislation for Aboriginal Victorians. It’s the first treaty of its kind in Australia and one that not only acknowledges past injustices but also commits to returning decision-making powers to Aboriginal communities. Presented within this context, this latest staging of Soul of Possum serves as a potent and topical reminder of the past that still needs present reckoning. Soul of Possum is based on the experiences of the playwright’s ancestors. Credit: Darren Gill\n\nBased on the personal histories of playwright Brodie Murray’s ancestors (in particular his father and grandfather), the play is a taut reenactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. With a few cast changes, Soul of Possum’s latest iteration follows on from a successful season at Castlemaine State Festival and Yirramboi Festival in 2021. It’s 1853, in Wamba Wamba Country and Marnuu (Balla Neba) is troubled by his dreams; the voice of Possum predicts wide-scale destruction by a hostile force, a devastation of both people and wildlife. But his fellow warriors Gundi (Wimiya Woodley) and Barru (Murray) are sceptical and mock his warnings. Meanwhile, there’s a steamboat moored at the river, with a military expedition about to disembark to open up the country for “glorious empire”. It’s a story most of us should know; this first contact skirmish between two parties who are completely alien to the other’s customs and cultures, and the resulting and continuing legacy of settler-occupation. The play asks us to imagine what it was actually like in the initial round of invasion and resistance, a pattern that would repeat itself across the land. The play is a taut renactment of an altercation between colonial soldiers and members of an Indigenous population on the Murray River in Swan Hill. Credit: Darren Gill\n\nThe stage is sparse except for a large projection of the riverbank at the back, two platforms on the left that serve as the steamboat and a clump of river reeds, a tree, and a campfire to the right. Preview night brought some rushed dialogue from the trio of warriors that should hopefully settle for the rest of the season. Maybe they feel there’s no time to waste: under Beng Oh’s direction, the 70-minute narrative moves fast, with the plight of both sets of white and blackfellas played out in alternate scenes before they finally meet. Loading What makes Soul of Possum interesting is that it dramatises the internecine in-fighting among each group. The First Nations Australians lose valuable time arguing about what to do with the threat of territorial trespass while the English marauders - Captain Gibbons (Leigh Scully), Lieutenant Bankes (Gabriel Partington), Dr Wilkins (Kevin Dee) and Irish convict Yates (Luke Mason) have their own on-board power conflicts to contend with. All four characters are performed with ease and conviction. There’s an earnestness about this play and some unnecessary repetition in the script. The ending that brings us back to the present day also seems a bit too expository after everything that we’ve witnessed before. Nonetheless, Soul of Possum does manage to take us into the crossfire of colonial violence in its short, sharp stage time.\n\nReviewed by Thuy On\n\nSoul of Possum was reviewed from a preview performance",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/culture/movies/redeem-one-of-25-double-passes-to-see-my-brother-s-band-20251204-p5nkw7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Redeem one of 25 double passes to see My Brother’s Band*",
    "publish_date": "Sun, 07 Dec 2025 11:59:00 +1100",
    "category": "entertainment",
    "authors": [],
    "text": "Written and directed by Emmanuel Courcol, My Brother’s Band follows two siblings separated by fate and reunited by music. As a subscriber of The Age, you have the opportunity to redeem one of 25 complimentary double passes to see it in cinema.*\n\nSYNOPSIS: Thibaut (the exceptional Benjamin Lavernhe, Delicious, C’est la vie!) is an internationally renowned orchestra conductor who travels the world. When a health crisis and subsequent DNA test inadvertently reveals that he was adopted as an infant, Thibaut discovers the existence of a younger brother, Jimmy (rising star Pierre Lottin), who lives in more modest circumstances; he works in a school cafeteria, cares for his mother and plays the trombone in a community brass band. The pair seem to have little else in common other than a love of performance, but sensing his sibling’s talent, Thibaut decides to remedy the injustice of fate and help nurture his brother’s gifts.\n\nWRITER/ DIRECTOR: Emmanuel Courcol\n\nCAST: Benjamin Lavernhe, Pierre Lottin, Sarah Suco, and Ludmila Mikaël\n\nRUNNING TIME: 103 minutes\n\nRELEASE DATE: December 26, 2025",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/golf/australian-open-golf-2025-live-coverage-cameron-smith-adam-scott-and-rory-mcilroy-battle-at-royal-melbourne-20251207-p5nlh7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open golf 2025 Live Coverage: Smith charges to co-leader as McIlroy’s hopes fade",
    "publish_date": "Sun, 07 Dec 2025 11:34:45 +1100",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "Min Woo Lee just nailed a brilliant four-metre putt to make birdie on the par-3 fifth hole. It repaired the damage of a bogey on the hole prior for Lee, and he’s still in the frame at 10-under.\n\nLee’s putt broke a massive amount to the right but the amazing part of the shot was Lee barely hit the ball. He just tapped it.\n\nIt was a downhill putt but the greens are also very quick at Royal Melbourne today, and the commentators keep mentioning the greens are extremely challenging. The “stimpmeter” reading is 13-feet.\n\nBut what does that mean, you ask?\n\nA stimpmeter. Credit: AP\n\nA stimpmeter is a standard measuring device to ascertain how fast - and far - a ball rolls on a green. On your average public course green, the ball will roll about 8 feet before stopping.\n\nOn the US PGA tour, tournament greens run at about 12, and in major championships, the stimpmeter reading will be between 13 and 14. When combined with slopes, anything more than 14 and the ball will often not even stop.\n\nThe greens at Royal Melbourne are expected to get quicker today, so brace yourself. Putting could decide the winner today.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/federal/anika-wells-charged-taxpayers-to-take-family-to-thredbo-ski-resort-20251206-p5nlep.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I don’t write the rules’: Wells, PM defend using taxpayer funds to bring family to ski resort",
    "publish_date": "Sun, 07 Dec 2025 11:22:34 +1100",
    "category": "sports",
    "authors": [
      "James Massola"
    ],
    "text": "“Anika Wells was working on that trip as sports minister, participating in the lifting up of parasport. That’s been driven by Anika Wells,” he said. “There are rules there, and I’m not going to go through each and every one. I’ve got a big job, David [Insiders host David Speers]. It’s completely within the rules. “There’s family reunion entitlements – all the travel that’s within the guidelines. She was working and there were announcements and there were events there.” Wells is also under pressure over her use of taxpayer entitlements to attend a friend’s birthday party in Adelaide, the sky-high cost of flights to New York for meetings at the United Nations and her use of expenses on trips to France undertaken as Sports minister. Wells faces multiple expenses questions\n\nSports and Communications Minister Anika Wells has been under pressure to justify travel expenses. Credit: Alex Ellinghausen Wells has been under fire since Wednesday after revelations she charged taxpayers more than $100,000 for flights to New York to showcase Australia’s social media ban. Loading This was swiftly followed by reports she had used her travel entitlements for trips to Adelaide, where she attended a friend’s birthday party, and three trips to France in one year in her role as sports minister to attend the Rugby World Cup and the Olympics. The furore over Wells’ use of expenses has overshadowed the minister’s attempts to promote new laws that restrict under 16s’ use of social media, which come into effect this Wednesday.\n\nIndependent Parliamentary Expenses Authority figures show the minister claimed $844 of taxpayer-funded travel allowance to stay at a resort in Thredbo over the two nights, and then claimed another $318 to stay in Canberra on Sunday night citing “parliamentary duties”. Her flights from Brisbane to Canberra, the nearest major airport to the Thredbo resort, cost taxpayers another $294.32. Wells was accompanied by her husband, Finn McCarthy, and two of her three children under “family reunion” rules that allow MPs to reunite with their families when travelling for work. Taxpayers spent another $1389.18 on flights so her family could join her for the weekend at the snow, with Wells’ husband posting pictures of their children on the skiing trip a couple of days later on social media. All told, the two-day trip to the ski fields cost taxpayers $2845.50, but a government spokesman defended the minister’s use of travel and entitlements, saying “the travel was in accordance with the guidelines”.\n\nBut Wells’ use of the family reunion rules is strikingly similar to a trip the current Home Affairs Minister Tony Burke took to Uluru back in April 2012, when he was the environment minister, and claimed $12,000 in allowances and flights so his family could join him on that trip. Details of Burke’s trip emerged in 2015, soon after the Bronwyn Bishop “choppergate” scandal. At the time, Burke insisted, like Wells, that he had not breached the rules but he did admit the trip was “beyond community expectations” of what MPs should be claiming in taxpayer-funded expenses. Burke repaid $8656.48 of that trip – the cost of four airfares – five years later, in 2020. There is no suggestion that Wells contravened the rules on the trip to Thredbo because of her official engagements, but the expenses claims raise fresh questions about her use of entitlements and whether they are in line with “community expectations”.\n\nTreasurer Jim Chalmers was asked last week on the ABC’s 730 program if Wells’ trip to New York passed the pub test, and argued: “That’s for others to judge. But from my point of view, it’s official travel. It’s well within the guidelines.” The rules for what expenses and allowances ministers can claim are governed by the Department of Finance’s “dominant purpose” test. Loading That test states that expense claims can be made for one of four reasons – when an MP or minister is undertaking parliamentary duties, electorate duties, party political duties or official duties. On its website, the department states that “the dominant purpose test asks whether you would have undertaken the activity or incurred or claimed the expense, allowance or other public resource but for your parliamentary business”.\n\nThe rules on reunions allow family members to travel from their home base to Canberra, with a maximum annual cost limit set as the equivalent value of nine business-class return airfares to Canberra for an MP’s partner, plus three economy-class return airfares to Canberra for each dependent child. Parliament’s Senate estimates committee heard last week that Wells, a staffer and a public servant had spent almost $100,000 on flights to attend the United Nations General Assembly and another $70,000 to host an event that spruiked the government’s teen social media ban earlier this year. After a difficult appearance at the National Press Club last week during which Wells avoided directly answering questions about her New York trip, The Australian Financial Review then revealed the under-pressure minister took a three-day taxpayer-funded $3600 trip in June to Adelaide. During that trip, Wells attended a friend’s birthday party as well as official meetings with state ministers.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/as-houses-burned-around-it-the-one-that-steve-built-stood-firm-20251207-p5nli1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As houses burned around it, the one that Steve built stood firm",
    "publish_date": "Sun, 07 Dec 2025 10:50:51 +1100",
    "category": "finance",
    "authors": [
      "Sally Rawsthorne",
      "Sitthixay Ditthavong"
    ],
    "text": "A month ago, Steve Foskett handed his neighbours the keys to their new home.\n\nA builder and resident of the Central Coast suburb of Koolewong, Foskett built a number of homes on Nimbin Road, which was ravaged by an out-of-control bushfire late on Saturday.\n\nSteve Foskett and his dog Cali, who “didn’t do any helping” while they defended his home. Credit: Sitthixay Ditthavong\n\nAt least 12 homes, some of which were built by Foskett, were destroyed by the fire, which had burnt through 120ha and was still active on Sunday despite a cool change that came through overnight.\n\nWhile homes in the block around it were destroyed, Foskett’s latest project survived the inferno that tore through the suburb, thanks, he said, to Bushfire Attack Standard 29.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/world/europe/dispute-over-meghan-s-claim-she-has-contacted-her-estranged-father-after-his-leg-amputation-20251207-p5nlgz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dispute over Meghan’s claim she has contacted her estranged father after his leg amputation",
    "publish_date": "Sun, 07 Dec 2025 10:35:56 +1100",
    "category": "finance",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Meghan, Duchess of Sussex has said through her representative she tried to contact her estranged father, Thomas Markle, who reportedly had his leg amputated this week. It is unclear if the attempt was successful.\n\nA spokesperson for the duchess said in a statement on Saturday: “I can confirm she has reached out to her father.” On Sunday, the Daily Mail reported claims from Thomas, 81, that he has not heard from Meghan nor her representatives following his surgery.\n\nMeghan, the Duchess of Sussex in October. Her spokesperson says she has tried to contact her father. Credit: Getty Images For Balenciaga\n\nThe tabloid also claimed he had informed its reporter of his surgery before telling his son and live-in primary carer, Thomas Markle Jr., and daughter Samantha Markle. Meghan’s half-siblings were informed of their father’s surgery by the Daily Mail reporter, the tabloid alleged.\n\nOn Sunday, Samantha took to X (formerly Twitter) criticising the duchess and her alleged “PR bullshit”.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/shopping-make-you-hungry-here-are-brisbane-s-top-food-courts-20251201-p5njy5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Shopping make you hungry? Here are Brisbane’s top food courts",
    "publish_date": "Sun, 07 Dec 2025 10:17:26 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Shopping make you hungry? Here are Brisbane’s top food courts Shopping malls might be much better for dining these days, but not all are equal. We rank Brisbane’s largest from one to five. Matt Shea December 7, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThe dodgy shopping centre food court is a thing of the past. Or, if it still exists, it’s at least usually complemented by some quality alternative eateries, maybe in one of those la-di-da outdoor dining precincts with a playground, a water feature and those cool timber lounge chairs. Westfield Chermside in Brisbane’s north. Jamila Toderas But not all shopping centres are equal – particularly the big dogs: your Garden Cities, Indooroopillys and Chermsides – which is odd when so much else of the experience tends to be pretty consistent. Which is best? We wanted to find out, so over the past 12 months or so, we’ve spent more time than we probably should hanging around the city’s biggest suburban shopping centres to trial their eateries.\n\nAdvertisement\n\nRelated Article Monster 800-seat brewpub touches down near Brisbane Airport Before you ask: no, food-angled shopping centres like Market Square, Sunny Park et al. don’t count, nor does the CBD. This is the big suburban retail centres with a few anchor tenants like Myer or David Jones. We found you can get something half decent to eat at all these places. Still, there was one clear winner. 5. Westfield Carindale What are you doing, Carindale? This stalwart in the city’s south-east is a good shopping experience as far as malls go, but its food options lag the centres further up this list.\n\nAdvertisement\n\nYou’re not going to go hungry at Westfield Carindale, but it lags some of the other centres around town. Tammy Law You’re never going to eat poorly here, but it’s dominated by what I call “astroturfers” – the chains that have picked up on a trending cuisine and done a certainly passable, very replicable, but not particularly exciting take on it: think Grill’d for burgers, Roll’d for Vietnamese, or Guzman y Gomez for Mexican. But it is getting better. Yes, David’s Noodle & Hotpot is a chain, but it does very good malatang. There’s Foster & Black and Cafe Halo for coffee, or Gong Cha for bubble tea.\n\nAdvertisement\n\nThere’s also a Cinnabon, which hit Australia like a hurricane a couple of years back with cinnamon scrolls that are legitimately better than most independents. Cinnabon’s tightly spiralled buns. So, a pass mark, I guess. But there are better options in Brisbane when you want to shop and feed. 4. Indooroopilly Shopping Centre Despite its fancy expansion in 2014, which added high-end retailers such as Scanlan Theodore, Aquila and Zimmermann, Indooroopilly Shopping Centre’s eating options remained pretty underwhelming for years.\n\nAdvertisement\n\nIndooroopilly lagged behind other shopping centres for dining, but it’s getting better. But it was the first centre outside Sunnybank to get a Hakataya Ramen, and from there, it’s slowly become better and better. Motto Motto, from Sonos owner William Liu, is always worth a shout (it has an outlet in a lot of shopping malls around the south-east) for fast-paced Japanese. And the centre over-represents on specialty coffee, with both Foster & Black and Archer present and correct.\n\nAdvertisement\n\nThe gold, though, is on the ground floor, where there’s a Cinnabon and a David’s Noodle & Hot Pot. Also, check out The Butcher’s Grill: little more than a grill-and-counter setup attached to Andrew’s Meats, its classic Angus beef burger – basically, a gussied up take on an old-school Australian barbecue burger (refreshing, in the face of the American-style onslaught) – has gone up in price recently, but is still one of the better value burgs around town. 3. Westfield North Lakes If you tend to breeze through Westfield North Lakes just to get to Ikea, you’re missing out, because the centre boasts a stack of good food options.\n\nAdvertisement\n\nYes, there’s a TGI Fridays and an El Camino Cantina, and a whole lot of other phone-it-ins, but there are also a bunch of delicious alternatives: see Lanzhou Beef Noodle for hand-pulled Chinese noodle soup, Kinn for fast-paced, fragrant and wallet-friendly Thai, and Chicken Park for fried bird. There’s also Smiling Dumplings and Noodles for, yep, dumplings and noodles, Bapboi for Korean barbecue, and the family run Ka-Chow Asian Kitchen for pan-south-east Asian. No need to resort to Swedish meatballs here.\n\nAdvertisement\n\n2. Westfield Chermside Now we’re getting serious. Chermside is the third-largest shopping mall in Australia and, since the addition of its outdoor dining precinct in 2017, has bulked up its food options to match. Westfield Chermside’s sunny outdoor dining precinct. There’s a bunch of good options here.\n\nAdvertisement\n\nTry Momo for crisply fried Korean chicken, Kinn+Derm for legit Thai, and Hanok for Korean barbecue. Also, Simone Presta and Carmine Guarino recently opened a second instalment of their terrific fast-paced Italian eatery Scugnizzi. Scugnizzi serves quality fast-paced Italian. Morgan Roberts Elsewhere, there’s Archer, Foster & Black and Be Kalii for coffee; Yo-Bar for self-serve frozen yoghurt and acai; Hakataya for ramen; NYC Bagel Deli for stacked bagels; and David’s Noodle & Hotpot for malatang. That’s just a taste of the independents (and smaller, quality chains), and then you have the big-box operators and fast food spots on top.\n\nAdvertisement\n\nTaken altogether, it’s well pitched and impressive in its ambition and utility, particularly when you consider Chermside probably didn’t have to do this – it’s not like the surrounding suburb heaves with restaurants and cafes. 1. Westfield Mt Gravatt Will any Brisbane shopping centre ever top Garden City for food? Probably not. And will anyone ever stop calling it Garden City? Again, probably not. Westfield Mount Gravatt (aka Garden City) is the clear winner when it comes to shopping centre food. Tammy Law\n\nAdvertisement\n\nThis huge shopping mall – the eighth-largest in the country – is the solar plexus of Brisbane’s multicultural southern suburbs, and that’s reflected in the giddy breadth of its food options. It was already reasonably good before the centre opened its outside dining precinct in 2014. Then, on top of that, there’s the 8 Street Asian food precinct downstairs, plus a bunch of good spots scattered in between. Where to start? The atrium at the top of the escalators at the north-western end of the centre is as good as any. Here, your Oportos, McDonalds and KFCs sit alongside operators such as 1919 Lanzhou Beef Noodle, with its unctuous, spicy bowls of hand-pulled Chinese noods; New Shanghai and its lengthy menu of house-made dim sum; and Hokkaido, with its perfectly flaked baked cheese tarts.\n\nAdvertisement\n\nWander down one of the halls to the outside dining precinct and you could eat at Betty’s, Vapiano or Nando’s, or get classy yum cha at Yum Cha Cuisine, killer Malaysian (including one of the best char kway teows in town) at Ya Hoo Kitchen, or well-pitched sushi at Sushi Edo. Hokkaido’s famous cheese tarts. And then there’s 8 Street, a charming facsimile of the kind of food alley you might find in Bangkok or Hong Kong. Here, there’s a bunch of hole-in-the-wall vendors serving malatang, chongqing noodles, ramen, bibimbap and more.\n\nAdvertisement\n\nScattered about other parts of the centre are a Hakataya Ramen, a Foster & Black and a David’s Master Pot malatang joint. If you need to eat while you shop, Garden City is the spot.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/starc-is-super-but-still-human-it-makes-the-return-of-lyon-a-must-20251206-p5nlg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc is super, but still human. It makes the return of Lyon a must",
    "publish_date": "Sun, 07 Dec 2025 09:59:06 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "As if anyone needed a reminder, Mitchell Starc proved once again in Brisbane just how super he was.\n\nBut the champion left-armer is still human, and his opening spell on Saturday perhaps highlighted just how crucial the injection of two veterans will be.\n\nAfter resting for only seven overs out of the Queensland heat – having top scored with 77 in Australia’s 511 first innings at the Gabba – Starc’s first spell with the ball showed signs of fatigue.\n\nMitchell Starc roared to life in the final hour of day three, after his worst opening spell of the series. Credit: Getty Images\n\nEngland opener Zak Crawley attacked the 35-year-old, whose first three overs went 0-25 – the only time this series he had not claimed a wicket in his first over.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/someone-doesn-t-want-me-in-the-club-salah-slams-liverpool-manager-20251207-p5nlhk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Someone doesn’t want me in the club’: Salah slams Liverpool manager",
    "publish_date": "Sun, 07 Dec 2025 09:38:46 +1100",
    "category": "sports",
    "authors": [],
    "text": "Liverpool’s Mohamed Salah said he had been “thrown under the bus” as he tore into the club over his treatment after watching from the bench as his side twice threw away the lead in a 3-3 Premier League draw with Leeds United on Saturday.\n\nThe 33-year-old Egyptian lashed out at the club and manager Arne Slot, telling journalists he felt he had been scapegoated for a poor start to the season and suggesting that he may not have long left at Anfield.\n\nSalah has become an iconic figure in his eight years at Liverpool. He has won two Premier League titles and scored 250 goals for the club.\n\n“I’m very, very disappointed to be fair. I have done so much for this club, everybody can see that during the years and especially last season,” Salah said in the post-match mixed zone.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw15-bournemouth-vs-chelsea-20251207-p5nlhf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Bournemouth vs Chelsea",
    "publish_date": "Sun, 07 Dec 2025 09:07:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Bournemouth vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw15-aston-villa-vs-arsenal-20251207-p5nlhg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Aston Villa vs Arsenal",
    "publish_date": "Sun, 07 Dec 2025 09:07:38 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Aston Villa vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw15-man-city-vs-sunderland-20251207-p5nlha.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW15: Man City vs Sunderland",
    "publish_date": "Sun, 07 Dec 2025 09:06:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW15: Man City vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://au.news.yahoo.com/stand-under-fire-minister-defends-235534467.html",
    "title": "'I stand by it': under-fire minister defends trip costs",
    "publish_date": "2025-12-06T23:55:34Z",
    "category": "sports",
    "authors": [],
    "text": "A senior federal minister is defending her taxpayer-funded trips as being within government guidelines, as new details emerge about other costs.\n\nAnika Wells came under fire for the $100,000 cost of flying herself and three staff to New York to promote Australia's social media age ban, with further details emerging about trips she took to Paris, Thredbo and Adelaide.\n\nShe accepted the spending would elicit a \"gut reaction\" in the average Australian, but said it was an independent agency booking flights, rather than her browsing \"Webjet\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs Wells was supposed to travel to New York on Prime Minister Anthony Albanese's Royal Air Force jet in September, but was delayed because of the fallout from a deadly Optus triple-zero outage.\n\nAnika Wells was initially scheduled to travel to New York on Anthony Albanese's Royal Air Force jet. (Lukas Coch/AAP PHOTOS)\n\n\"People can have an opinion about whether it was worth the money,\" Ms Wells told Sky News on Sunday.\n\n\"But for me, the policy imperative that the life-changing work that we are trying to do ... it was really important and I stand by it.\"\n\nMr Albanese defended the spending as within the guidelines and said the New York trip to promote the social media ban, which will come into effect on Wednesday, was \"very significant\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"This was an important event that led directly to the European Union taking action,\" he told ABC's Insiders on Sunday.\n\n\"One of the comments I heard from various UN officials was ... 'this is the first time I've been to a forum that has changed my mind'.\"\n\nMs Wells, who is also the sports minister, reportedly took three trips to Paris in 12 months at a cost of $116,000, to attend major sporting events including the Rugby World Cup, Paris Olympics and Paris Paralympics.\n\n\"People can have an opinion about whether it was worth the money,\" Anika Wells says of her US trip. (Lukas Coch/AAP PHOTOS)\n\nShe was authorised to spend $6000 on meals for five days, with one dinner reportedly billed for $600.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I recall sometimes I was eating a muesli bar in the car. These are big days,\" Ms Wells said.\n\n\"I appreciate it looks a certain way because it's Paris, but that is where the Games were.\"\n\nOpposition industry spokesman Alex Hawke said the spending did not pass the pub test, adding the expenses were so high they would \"make the royals blush\".\n\n\"It simply doesn't stack up and the minister's defences don't seem to stack up either,\" he told Sky News.\n\n\"If the minister is eating a muesli bar ... then why is the taxpayer being charged for expensive dinners ... if she's not partaking of them.\"\n\nAlex Hawke says Ms Wells' expenses were so high they would \"make the royals blush\". (Mick Tsikas/AAP PHOTOS)\n\nMs Wells was also questioned about using travel entitlements to attend a friend's birthday while on a three-day, $3600 work trip to Adelaide in June.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I met with my South Australian counterpart in part about the South Australian Sport Institute, where we opened a para unit,\" she said.\n\nThe minister also spent $3000 on flights and allowances for her husband and children to join her at Thredbo in June 2024 while she attended meetings with Paralympics Australia and Adaptive Festival organisers.\n\nMs Wells acknowledged her family went skiing, but said she was there to work and the trip was within the family reunion and travel guidelines.\n\nIn 2012, current Home Affairs Minister Tony Burke took a work trip to Uluru and claimed $12,000 so his family could join him.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile within the rules, he repaid $8656 of that trip when details emerged in 2015, admitting it was \"beyond community expectations\".\n\nMs Wells did not indicate she would be paying any of the money back, and said \"I work really hard\" and that she will keep following the rules \"as I have in every single instance\".",
    "source": "Yahoo",
    "cluster_id": 7
  }
]