[
  {
    "url": "https://www.9news.com.au/finance/australia-interest-rates-decision-august-2025/34f2e7b3-ea19-4865-b579-34ea24698815",
    "title": "Rate cut 'highly likely', but inflation scourge lingers",
    "publish_date": "Mon, 11 Aug 2025 22:57:23 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "I﻿t's almost certain the Reserve Bank of Australia will hand mortgage holders an interest rates cut today, but new research shows inflation continues to plague the economy.\n\nEconomists are tipping the central bank will announce at 2.30pm (AEST) a 25 basis point cut, which would bring the official cash rate down to 3.60 per cent.\n\nIf banks pass this on in full, a homeowner with a $500,000 mortgage will save $2884 per year compared with what they were paying at the start of the year before the RBA started cutting the cash rate.\n\nThe Reserve Bank of Australia is tipped to cut the cash rate today. (Getty)\n\nA widely anticipated reduction failed to materialise last month, when the cash rate remained on hold at 3.85 per cent, stunning mortgage owners.﻿\n\nBut economists say the RBA board has no excuses not to make a cut this week, with the latest quarterly data showing inflation is within its target range of between 2 per cent and 3 per cent.\n\nHeadline inflation dropped to 2.1 per cent, the lowest figure in four years.\n\nA softening labour market has also bolstered expectations that the cash rate will come down.\n\nREAD MORE: ﻿ Man arrested after two bodies found in Melbourne home\n\nThe market is even pricing in a roughly fifty-fifty chance of a supersized 50-basis-point cut which would bring the official cash rate down to 3.35 per cent.\n\nBut despite falling inflation, new data reveals that everyday costs remain high for Australians who continue to feel the squeeze.\n\nAn investigation by The Age found that households are cutting back on spending, such as buying coffee out, entertainment and holiday travel.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/explosions-at-us-steel-plant-in-pennsylvania-leave-1-dead-1-missing-10-injured/e5f8101c-1dbf-46ae-9a4b-b4893129fb9a",
    "title": "'Like thunder': Worker dead, one missing after explosions at US Steel plant",
    "publish_date": "Mon, 11 Aug 2025 22:41:15 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Explosions at a US Steel plant that shook the ground near Pittsburgh have left one dead and sent at least 10 to hospitals, with emergency workers still searching the badly charred rubble hours later for a missing worker, officials said.\n\nOne worker was pulled from the wreckage hours after the explosions sent black smoke spiralling into the midday sky in the Mon Valley, a region of the state synonymous with steel for more than a century.\n\nAllegheny County Emergency Services said a fire at the plant started around 10.51am.\n\nIt is not the first time there have been fatalities at the steel plant. (X (@ItsNotFus))\n\nA search and rescue effort was still active on Monday afternoon local time and officials said they had not isolated the cause of the blasts.\n\nThe explosions sent a shock through the community and led to officials asking residents to stay away from the scene so emergency workers could respond.\n\n“It felt like thunder,” Zachary Buday, a construction worker near the scene, told WTAE-TV.\n\n“Shook the scaffold, shook my chest, and shook the building, and then when we saw the dark smoke coming up from the steel mill and put two and two together, and it’s like something bad happened.”\n\nThe search is ongoing for a missing worker\n\nAt a news conference, Scott Buckiso, US Steel’s chief manufacturing officer, did not give details about the damage or casualties, and said they were still trying to determine what happened.\n\nUS Steel employees “did a great job” of going in and rescuing workers, shutting down gases and making sure the site was stable.\n\nBuckiso said the company, now a subsidiary of Japan-based Nippon Steel Corp., is working with authorities.\n\nHe also said search teams were still looking for one person who was missing.\n\nThey think they know the general location of that person, but weren’t sure, he said.\n\n“Obviously, this is a tragedy that we want to understand,” Buckiso said.\n\nAllegheny Health Network said it had treated seven patients from the explosion in its hospitals, and discharged five within a few hours.\n\nUniversity of Pittsburgh Medical Centre said it is treating three patients at UPMC Mercy, the region’s only level one trauma and burn centre.\n\nClairton residents like Amy Sowers, 49, felt an explosion nearby.\n\nSowers, who was sitting on her porch located less than a kilometre from the plant, felt her house shake.\n\n“I could see smoke from my driveway,” she said.\n\n“We heard ambulances and fire trucks from every direction.\"\n\nExplosion reported at US Steel Clairton plant, multiple people injured. (KDKA via CNN Newsource)\n\nSowers decided to leave the area after she said she smelled a faint smell in the air.\n\nSowers, who grew up in Clairton, has seen several incidents at the plant over the years.\n\nDespite health concerns, Sowers said many residents cannot afford to leave.\n\nA maintenance worker was killed in an explosion at the plant in September 2009.\n\nIn July 2010, another explosion injured 14 employees and six contractors.\n\nAccording to online OSHA records of workplace fatalities, the last death at the plant was in 2014, when a worker was burned and died after falling into a trench.\n\nAfter the 2010 explosion, the Occupational Safety and Health Administration fined US Steel and a subcontractor $US175,000 ($268,000) for safety violations.\n\nUS Steel appealed its citations and $US143,500 in fines, which were later reduced under a settlement agreement.\n\n“Lives were lost again,” Sowers said.\n\n“How many more lives are going to have to be lost until something happens?”\n\nThe Clairton coking plant continued to operate after the explosion, although two batteries that were the site of the explosion were shut down, officials said.\n\nAir quality concerns and health warnings\n\nThe plant, a massive industrial facility along the Monongahela River south of Pittsburgh, is considered the largest coking operation in North America and is one of four major US Steel plants in Pennsylvania.\n\nThe plant converts coal to coke, a key component in the steel-making process.\n\nTo make coke, coal is baked in special ovens for hours at high temperatures to remove impurities that could otherwise weaken steel.\n\nThe process creates what’s known as coke gas — made up of a lethal mix of methane, carbon dioxide and carbon monoxide.\n\nClairton Mayor Richard Lattanzi said his heart goes out to the victims of Monday's explosions.\n\n“The mill is such a big part of Clairton,” he said.\n\n“It’s just a sad day for Clairton.”\n\nThe Allegheny County Health Department said it is monitoring the explosions and advised residents within 1.6 kilometres of the plant to remain indoors and close all windows and doors.\n\nIt said its monitors have not detected levels of soot or sulphur dioxide above federal standards.\n\nAccording to the company, the plant has approximately 1400 workers.\n\nThe plant has a long history of pollution concerns\n\nIn recent years, the Clairton plant has been dogged by concerns about pollution.\n\nIn 2019, it agreed to settle a 2017 lawsuit for $US8.5 million.\n\nUnder the settlement, the company agreed to spend $US6.5 million to reduce soot emissions and noxious odours from the Clairton coke-making facility.\n\nThe company also faced other lawsuits over pollution from the Clairton facility, including ones accusing the company of violating clean air laws after a 2018 fire damaged the facility’s sulphur pollution controls.\n\nIn February, a problem with a battery at the plant led to a “buildup of combustible material” that ignited, causing an audible “boom,” officials said.\n\nTwo workers received first aid treatment at a local hospital but were not seriously injured.\n\nEnvironmental group calls for an investigation\n\nDavid Masur, executive director of PennEnvironment, an environmental group that has sued US Steel over pollution, said there needed to be “a full, independent investigation into the causes of this latest catastrophe and a re-evaluation as to whether the Clairton plant is fit to keep operating”.\n\nIn June, US Steel and Nippon Steel announced they had finalised a “historic partnership,” a deal that gives the US government a say in some matters and comes a year and a half after the Japanese company first proposed its nearly $US15 billion buyout of the iconic American steelmaker.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/esta-visa-australian-travellers-returning-from-us-falsely-accused-of-overstaying-exclusive/2c5863d5-658a-48f2-a0ea-511fccaf6431",
    "title": "Aaron was wrongly accused of illegally staying in the US for over 10 years",
    "publish_date": "Tue, 12 Aug 2025 01:19:12 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Exclusive: A﻿ustralian travellers returning from the United States on an ESTA waiver are disputing accusations they have illegally overstayed their visa by months or even years.\n\nUS immigration appears to have failed to record some outbound Australian passengers on cruises and planes after travelling on an Electronic System for Travel Authorisation (ESTA), potentially exposing a hole in the country's exit checks for foreign nationals.\n\nLismore man Aaron Drooger's holiday was ruined in April.\n\nAaron Drooger was told he'd overstayed his visa by over 4000 days. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nHe had flown out of Hawaii in 2011 and didn't realise something was amiss until he returned to the US again this year, 14 years later.\n\nDrooger said he crossed the border on a cruise ship in April, disembarked the ship and entered Canada, before attempting to fly back into the US.\n\nHe was then denied boarding on his flight from Vancouver to Las Vegas.\n\nUS immigration claimed Drooger had been illegally staying in the US for over 10 years.\n\n﻿Drooger thinks his departure wasn't correctly logged with US immigration back in 2011.\n\n\"All of these errors forced me to spend thousands of dollars extra and ruined my holiday,\" he said.﻿\n\nHe was also stuck for days at Vancouver Airport﻿ after being told to wait 72 hours to escalate his issue.\n\nBut there was no solving this visa debacle.\n\n\"I was forced to book a flight from Canada direct to Brisbane, Australia,\" he added.\n\n\"They say my ESTA is again approved, but who knows.\"\n\nDespite having all the correct evidence to prove he has never overstayed his ESTA, ﻿Drooger is still waiting for answers from US immigration.\n\nAn email from the ESTA team cited by 9news.com.au noted ﻿\"we are unable to confirm your departure on what appears to be on 11/14/2011\".\n\nDrooger never recouped the money for the flight he couldn't take to Vegas.﻿\n\nJulie and Phil Lawton were sent emails from US Customs and Border Protection claiming they had overstayed their ESTA. (Supplied)\n\nQueensland couple Julie and Phil Lawton left the US in May this year after a cruise.\n\nThey had safely arrived back in Brisbane when the emails came flooding in.\n\n\"On the 10th of July, we got the first notice that we've got 10 days to leave the country,\" Julie told 9news.com.au , despite the fact they'd been back in Australia for weeks.\n\n\"We almost made it junk mail.\"\n\nJulie said she needed to jump through multiple hoops to try and convince US immigration she and her husband did not overstay their ESTA.\n\nThey also contacted the Department of Home Affairs in Australia to confirm their record of return in Australia but haven't heard back.﻿\n\nThe couple have visited the US around 10 times﻿ but said they have never faced this issue before.\n\nThe Lawtons are now concerned they'll never be able to visit the US again.﻿\n\n\"I have no confidence, and I don't think Julie has either, that unless we actually got written confirmation from the US Border Protection they have made a mistake and we did leave the US on the 21st, that we could ever return to the US,\" Phil said.\n\nThey're still getting regular emails informing them of their so-called visa breach.﻿\n\n\"We check it every day and it's still showing us as still being in the US,\" Julie added.\n\nThe Lawtons are now concerned they'll never be able to visit the US again.﻿ (Supplied)\n\nNSW woman Vicki Robinson﻿ was also due to leave and re-enter the US on a cruise with her husband and friends in April.\n\nShe was told her ESTA had been cancelled due to the same problem.\n\nHer last visit was in 2024, leaving from Florida on a cruise.﻿\n\n\"﻿I was on the Royal Princess with a number of other women who had exactly the same issue. All the husbands were OK but the wives' ESTAs had been cancelled,\" Robinson explained.\n\nAfter sailing to Vancouver in Canada, Robinson had planned to cruise Alaska, take a train to Seattle from Vancouver and then visit Hawaii with her group.\n\nBut the same ESTA error derailed her holiday.﻿\n\n\"This meant that my husband and friends sailed off to Alaska and I boarded a flight home to Australia,\" Robinson said.\n\n\"I think these are scary times for Australians travelling to the USA.\n\n\"We leave home with an approved and valid ESTA just to have the rug pulled out from under us without warning.\"\n\nRobinson attempted to resolve the issue with the Department of Homeland Security Traveller Redress Inquiry Program (DHS TRIP).\n\n﻿In an email, officials told Robinson that complaints often arise because a traveller's personal information is similar to the name and personal information of another person \"which contain information from federal, state, local and foreign sources or because the traveller has been delayed in travel for reasons unrelated to such data, such as by random screening\".\n\nShe was told to provide an ID number to any future flights into or within the US.\n\n﻿\"Despite these positive efforts, we cannot ensure your travel will be delay-free,\" the email noted.\n\n\"I thought of going back to them to ask for clarification but decided that it probably wouldn't achieve anything,\" Robinson said.\n\nShe is still trying to claw back the money she lost with her travel insurance.﻿\n\nVicki Robinson was forced to end her dream holiday early after a visa issue. (Supplied)\n\nIn many cases, money losses aren't covered by travel insurance due to it being considered an avoidable visa issue.\n\nThe fine print of many travel policies ﻿note a claim won't be honoured if there are \"errors, omissions in any booking arrangements, or failure to obtain the relevant visa, passport, or travel documents\".\n\nMelbourne-based immigration lawyer Sherwin Noorian previously told 9news.com.au this issue sometimes impacts non-US citizens attempting to re-enter the US.\n\n\"Customs and Border Protection relies on various data sources such as flight manifests to record departures from the US,\" he said.\n\n\"At times, they fail to record departures for foreign nationals and this may result in an 'overstay' being recorded for the traveller that is not accurate.\"\n\n9news.com.au contacted the US Customs and Border Protection for comment but have yet to receive a reply.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/cancer-young-australians-redkite-coles-dare-to-dream-scholarship/8880b03a-82e3-4726-bd41-0d0515b8441d",
    "title": "One touching detail links these Aussie teens across more than 1600km",
    "publish_date": "Tue, 12 Aug 2025 00:12:57 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "W﻿hen Brandan was diagnosed with Acute Lymphoblastic Leukaemia last year it felt like everything else in his life \"went away in an instant\".\n\nThe 17-year-old was forced to move from Cairns to Brisbane for Leukaemia treatment and being separated from his friends, family and twin sister was devastating.\n\nBut while Brandan's cancer ﻿journey was just starting, Millie's was coming to a close more than 2000km away.\n\nBrandan was diagnosed with Acute Lymphoblastic Leukaemia at just 16. (Supplied)\n\nThe ﻿16-year-old from Sydney was diagnosed with stage 4 Hodgkins Lymphoma in 2023 and wrapped up six months of gruelling treatment earlier this year.\n\nHer cancer journey was made more complex by her ADHD, severe dyslexia, and anxiety diagnoses but Millie faced every challenge head-on.﻿\n\nNow both teens have been recognised for their remarkable journeys and ﻿named the winners of the 2025 Redkite and Coles Dare to Dream Scholarship.\n\nMore than 20,000 Australians live with the ﻿long-term impacts of childhood cancer, with up to 80 per cent experiencing lasting physical, psychological or social challenges.\n\nAbout one in three survivors have to repeat a year of school due to treatment-related interruptions and it can seriously affect their dreams for the future.\n\nThat's where the ﻿Dare to Dream Scholarship comes in, offering Australians aged 13 to 18 up to $5000 in funding to rebuild their futures during or after a cancer journey.\n\nIt's the kind of money that will help Brandan pursue his passion for film, while ﻿Millie kickstarts her own small business.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWhere Australia ranks in countries with the greatest health freedoms View Gallery\n\nForced to move 1600km from home\n\n﻿Brandan was 16 when he received his diagnosis and had to relocate to Brisbane for cancer treatment.\n\nHe's been living almost 16000km from home ever since and is painfully aware of how costly his cancer journey has been for his whole family in the cost of living crisis.\n\n\"It can be very stressful financially, like no matter how much you have saved up, you're gonna lose a lot of money,\" he said.\n\nUnable to go to school and feeling isolated, Brandan has struggled.\n\nBut he's also found ﻿new purpose through his passion for film and photography, which he's really embraced while undergoing treatment.\n\nBrandan found ﻿new purpose through his passion for film and photography. (Supplied)\n\n\"It's good to have a passion when times do get tough,\" he said.\n\nThat passion led to him landing multiple segments on Juiced TV, a hospital entertainment program made by kids, for kids.\n\nIt was also the driving force behind his application for the Dare to Dream Scholarship.\n\nBut he never thought he'd actually win.\n\nNow, with an extra $5000 in his bank account, Brandan has big plans for his future.﻿\n\nHe intends to spend the cash on a \"good laptop for school\" which he'll take with him next year, when he hopes to start a media course at TAFE.\n\n\"I've missed out on a lot, like school and opportunities, and this scholarship just opens up a lot more for me,\" he said.\n\nWith an extra $5000 in his bank account, Brandan has big plans for his future.﻿ (Supplied)\n\nThe 17-year-old is especially excited by the prospect of starting TAFE and getting to socialise with groups of like-minded young people after so many months of isolation.\n\nWith his cancer treatment slated to end in late 2026, Brandan has his sights set on pursuing a film and media career in the near future.\n\nIt's a heartening goal after so many months of taking life one day at a time.﻿\n\n'It's not over when you ring the bell'﻿ ﻿\n\nAcross state lines, Millie is approaching one year cancer-free and looking to the future.\n\nShe ﻿underwent ﻿six months of intense chemotherapy and marked the end of her treatment by ringing a bell at the hospital in Sydney where she was treated.\n\nBut that wasn't the end of her cancer journey.\n\nREAD MORE: Innocent sight in IKEA stores across Australia speaks to harrowing reality of domestic and family violence\n\nMillie's family smiles as she rings the bell to celebrate being cancer-free. (Supplied)\n\n﻿\"It's not over when you ring the bell,\" she told 9news.\n\n\"It's a long, long process of getting better. I'm still not at school full time ... I'm going for tests every few months, it's not like everything's back to normal.\"\n\nThe hardest part is that she looks like a healthy teenager on the outside even though her mind and body are still reeling from intensive cancer treatment.\n\nChemotherapy left Millie with no hair and being isolated for months on end, unable to attend school or see friends, took a toll on her mental health.﻿\n\nEven now, almost a year after finishing treatment, she's struggling to cope.﻿\n\n\"You would think the actual cancer or the treatment part would be the hardest thing, but the recovery has been the hardest thing,\" she said.\n\n\"It's hard when you're a teenager, because you think 'I should be able to do this' ... it's a lot of little steps forward and big leaps back.\"\n\n\"You would think the actual cancer or the treatment part would be the hardest thing.\" (Supplied)\n\nBut the 16-year-old won't let that stop her from planning for the future.\n\n﻿She has big dreams of starting her own clothing line making accessible hoodies for teens going through a cancer journey.\n\nThe $5000 ﻿Dare to Dream Scholarship will help her make those dreams a reality.\n\n\"When I was in the hospital system they had a bunch of accessible clothes for children, for accessing ports and things like that, but none for teenagers,\" she said.\n\n\"I had to get a new wardrobe just so they'd be able to access my collarbone, which is where my port was.\"\n\nMillie has big dreams of starting her own clothing line with the scholarship money. (Supplied)\n\nThey will also feature charms on the hoods' drawstrings so neurodivergent teens like her have something to fidget with when they feel anxious or overstimulated.\n\n﻿It's just one small way Millie hopes to support other young Aussies facing a cancer journey like hers.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/jimboomba-carnival-showgoer-injured-by-fireworks-queensland-news/a316a5ad-ce86-450b-a1b6-52e39526e042",
    "title": "Malfunction sends explosives into crowd at Queensland community fair",
    "publish_date": "Mon, 11 Aug 2025 10:39:01 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Children were struck by shrapnel and a man suffered burns to his leg when fireworks malfunctioned at a community fair south of Brisbane last night.\n\nThe mishap sent explosives rocketing into patrons at the Jimboomba Family Carnival.﻿\n\n﻿The man who suffered burns to his leg received first aid before being taken to hospital.\n\nThe mishap sent explosives rocketing into patrons at the Jimboomba Family Carnival.﻿ (Nine)\n\n\"His trousers got a little bit singed and I think we're buying him a new pair of trousers, probably two,\" ACE Fireworks operator Robert Stevenson said.\n\n\"We're terribly sorry, it never should've happened.\"\n\nStevenson, who has been in the fireworks industry for 50 years, said the malfunction was a first.\n\n\"The fireworks exploded, obviously the item was faulty,\" he said.\n\n\"The fireworks went close to the fence and it scared everyone, I guess, including myself.\"\n\nFair organiser Paul Watkins apologised for the ordeal. (Nine)\n\nThe carnival confirmed on social media that the fireworks show scheduled for tonight would not be going ahead.﻿\n\nFair organiser Paul Watkins hosed down the drama and apologised for the ordeal.\n\n\"It's a misconception, because it was excitement and probably a little bit of scare, but there was no, there was nothing, we've got first aid right there,\" Watkins said.\n\n\"We can only say we're very sorry and hopefully it never happens again.\"\n\nAn investigation is under way by Resources Safety and Health Queensland.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/ansett-australia-news-constantine-frantzeskos-reveals-how-he-brought-nostalgic-airline-back-to-life/c874810c-d5bc-417b-bb08-bec8816c75a7",
    "title": "How Constantine rescued an old Aussie airline brand 24 years after its collapse",
    "publish_date": "Mon, 11 Aug 2025 05:44:27 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A tech entrepreneur with a big dream and a nose for quietly lapsed trademarks has revealed how he revived a nostalgic airline brand.\n\nAnsett Airlines was once the king of Australian skies but its sudden collapse in 2001 took with it thousands of jobs and countless holiday memories.\n\nConstantine Frantzeskos, a Melbourne digital marketing and AI expert, told 9news.com.au his mission to bring Ansett back as The Ansett Travel Platform has already been fairly successful.\n\nConstantine Frantzeskos noticed the trademark for Ansett Airlines has lapsed. (Supplied)\n\n\"Over the last 12 to 14 years, I've compiled a whole series of great digital innovations and had the idea... wouldn't it be great to bring this back to life?\" Frantzeskos said.\n\n\"Colloquially, we'd call it the 'Ansett File' and one day I thought, 'Well, has anyone done anything with it? Who still owns it?' and realised it had lapsed.\"\n\nFrantzeskos said he isn't planning on bringing Ansett back as an airline – not just yet anyway.\n\nInstead, he's transformed the brand into an artificial intelligence (AI) travel agent with the much-loved Ansett name.\n\n\"The sky's the limit,\" Frantzeskos laughed when asked about potentially muscling up to the likes of Qantas and Jetstar.\n\n\"For the moment, I'm just really, really focused on delivering a really wonderful travel concierge experience for everyone.\n\n\"Who knows what the future holds, but you're not the first person who has suggested it or who might want it.\"\n\nFrantzeskos is a keen AI user and found a niche in the travel industry with his new brand The Ansett Travel Platform.\n\nThe old Aussie airline collapsed in 2001. (Dallas Kilponen)\n\nSince its launch last month, Frantzeskos said there was a burst of users signing up for his $99 VIP experience.\n\n\"Interestingly enough, we've actually had a really high number of VIP sign-ups, a lot of VIP sign-ups that haven't yet bought anything,\" he said.\n\n\"That's the classic tourism journey, which is to dream, plan, book, travel, and then remember.\"\n\nAnsett uses AI to create a traveller profile for users, which then creates ideal itineraries and scours the internet for the best deals.\n\nIt also offers flights at \"wholesale prices\".\n\nFrantzeskos has leaned into the 1990s nostalgia with his advertisements for The Ansett Travel Platform. (Supplied)\n\nHe said it's a way to truly personalise a trip without the need for a physical travel agent.\n\n\"Because I don't have gigantic overheads, because I don't have tens of thousands of staff in multiple branches all over the world, I can pass on those savings to travellers,\" Frantzeskos added.\n\n\"It just works for you 24-7 without a complaint.\"\n\nFrantzeskos' hunch that AI will shape the next frontier of travel is on the money.\n\nFresh data from the Adyen 2025 Hospitality and Travel Report﻿ noted a 73 per cent surge in AI usage among travellers in Australia in the past year.\n\nThe Ansett Airlines section of the passenger terminal at Essendon Airport in 1969. (Fairfax Photographic)\n\nAnd the revival of Ansett Airlines attracted a huge wave of nostalgia for former customers and staff.\n\nHe said some ex-Ansett employee said seeing the name brought \"tears to their eyes\".\n\nWill Richards, the grandson of Ansett's founder Sir Reginald Ansett, also got in touch.\n\n\"He's got a helicopter business in Northern Territory, Ansett Aviation, and he said, 'Mate, I just loved seeing it',\" Frantzeskos said.\n\nThe Ansett brand has lived on in some capacity as Richard's helicopter flying school Ansett Aviation since 2003.\n\nAround 16,000 people lost their jobs and a 65-year legacy circled the drain when the axe fell on Ansett in September 2001.\n\nIt flew an estimated 10 million passengers and had a 69-plane fleet before it collapsed.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/mutawintji-festival-brings-first-nations-groups-together/105634238",
    "title": "'Pure joy' as Mutawintji festival brings mob together in dance",
    "publish_date": "Tue, 12 Aug 2025 00:26:03 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The Mutawintji Cultural Festival in far west New South Wales has come to an end for its third year with more than 600 people in attendance and 15 First Nations dance groups performing.\n\nThe event takes place at the Mutawintji National Park, home to 300 recorded Aboriginal sites and located a two-hour drive from Broken Hill.\n\nThe park was handed back to the traditional owners in the late 1990s, with the Barkindji, Malyangapa, and Wilyakalii peoples all holding ties to the land.\n\nThe festival's first iteration was in 2022, and this year received $150,000 in funding from the federal government.\n\nFor those attending the festival the event was about bringing together culture through dance, song and art and looking ahead to the next generation.\n\nMutawintji Cultural Festival 2025 ( ) What are you looking at? (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Dozens of children performed throughout the festival. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Unique tradition, culture and language is weaved into each performance. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) A young girl imitates a kangaroo. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) The Aboriginal flag flew proudly throughout the festival. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Dancers step into the circle to perform. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Two boomerangs are better than one. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) A group of young men wait for their time to perform. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Some final touches of body paint. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) A young boy re-enacts a hunt. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) Embracing culture is at the heart of the festival. (ABC News: Bill Ormonde) Mutawintji Cultural Festival 2025 ( ) A group from Queensland performs at the festival. (ABC News: Bill Ormonde)\n\n'A special feeling'\n\nMalyangapa-Barkindji man Jordan Spencer has been coming out to Mutawintji National Park since he was about 12 years old.\n\nBefore then, generations of his family walked on its red dust practising culture and meeting with others.\n\n\"It didn't happen for a good 130 years until this festival started again,\" he said.\n\n\"It's a very special feeling to have all these different mobs from all over the country come to share their culture with us and we can share ours with them.\"\n\nIt was Barkindji/Ngiyampaa woman Shantelle Thompson and Mildura group Kiilalaana Foundation's third year at the festival. ( )\n\nDancers from as far as Cairns and southern South Australia travelled to attend and perform.\n\nNgarrindjeri elder Major \"Moogy\" Sumner travelled with a group of 25 dancers from near Adelaide to attend.\n\n\"It's an honour to come here and be a part of this. We're having conversations with different groups and being a part of the ceremony itself,\" he said.\n\n\"This is what we have done for thousands of years, getting together and sharing our culture and our dances. Why not do it today?\"\n\nNgarrindjeri elder Moogy Sumner (centre) among a group of performers from NSW. ( )\n\n'Join us when we dance'\n\nMalyangapa man Mark Sutton sits on the Mutawintji National Park Board and spent the weekend conducting tours of the park.\n\nHe says it's hugely important that the next generation take part in the weekend.\n\n\"It's all about cultural enrichment, and particularly trying to get our young people to engage in culture,\" Mr Sutton said.\n\n\"We struggle to get them to engage.\n\n\"They can come to a culturally safe event like this and engage in boomerang making or clapstick making and basket weaving.\"\n\nYoung girls from SA were all smiles before their performance. ( )\n\nMr Sumner agrees, saying the exchange of culture was as much about engaging the younger generation as it was educating others.\n\n\"They're from all different parts of society, they're different nations, and they want to dance,\" he said.\n\n\"A lot of them are growing up learning about Western culture, even some of the dancers are non-Aboriginal, but they want to learn who we are.\n\n\"The best way to learn is to come join us when we dance.\"\n\nMoogy Sumner says participants from all parts of society and different nations come to dance. ( )\n\nDarren Greco, a Nukunu and Barngarla man, travelled with the Tal-Kin-Jeri dance mob from South Australia and was attending the event for the first time.\n\n\"It makes me feel really good to see my children getting involved in culture and to actually perform because they're our future, the next generation of leaders,\" he said.\n\nHe believes events like the Mutawintji Cultural Festival could be the key to rebuilding cultural ties.\n\n\"We all need to look further into culture. Doesn't matter who you are. Whether you're white, black, yellow, green, or purple, it doesn't matter,\" Mr Greco said.\n\n\"We all need to come together to be able to work together, to cleanse and rebuild.\"\n\nDarren Greco and his family danced together for the first time as part of the group. ( )\n\n'A full wrecker' on the cards\n\nAs campers pack up their tents and the travellers get ready to make their journeys back home, organisers are looking ahead to next year's event.\n\nThere's an air of hope that more could be done in the space.\n\n\"There's not a great deal of these Aboriginal cultural festivals down here,\" Mr Sutton said.\n\n\"Of course there's the Barunga and the Garma festivals, there's plenty of those up in the north, but I think we're starved a little bit for cultural festivals.\"\n\nOrganisers are planing for over 1,000 people next year. ( )\n\nNext year's Mutawintji Cultural Festival is set to be even bigger.\n\n\"We're gonna have our hands full with a wrecker,\" Mr Spencer said.\n\n\"There will be up over 1,000 people next year.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/good-things-festival-2025-line-up-tool-weezer-garbage/105640914",
    "title": "One of Australia's biggest and loudest festivals is back",
    "publish_date": "Tue, 12 Aug 2025 00:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Annual touring festival Good Things has become one of summer's biggest and loudest events, bringing the very best in rock, punk, metal, emo and more to the east coast each December.\n\nThis year's sixth edition is no exception. The bill spans a range of genres, as well as international and homegrown stars. Let's take it from the top, shall we?\n\nWho's topping the bill?\n\nProg metal titans Tool sit atop the Good Things line-up, back in Australia for the first time since February 2020, right before the COVID pandemic and off the back of their then-fatefully titled comeback album Fear Inoculum.\n\nOne of the most critically acclaimed heavy acts of their generation, Tool's devilishly complex rhythms, along with the surreal presence and powerful vocals of frontman Maynard James Keenan, has long made them a must-see live act. This marks their first time headlining an Australian festival since the Big Day Out in 2011.\n\nTool's live shows are a spectacle of titanic grooves, hypnotic melodies and high-scale production. (Supplied: Good Things)\n\nIf you missed Weezer joyfully smashing through hits and fan favourites on their 2023 tour, then here's your next chance to enjoy Buddy Holly, Island In The Sun, Hash Pipe, Say It Ain't So, their fan-driven cover of Toto's Africa, and many more.\n\nThe four-piece has evolved over decades, from \"geek rock\" poster boys for Gen X'ers and Millennials everywhere, into an arena-sized concern with all the familiar singalongs and spectacle you'd want.\n\nFresh from Shirley Manson's mental and physical recovery, Garbage will be back in Australia for the first time since 2016.\n\nThis time, they're armed with a new album, Let All That We Imagine Be The Light, as well as the stylishly dark anthems — like Stupid Girl, Cherry Lips, and I Think I'm Paranoid — that made them one of the biggest-selling artists of the 90s and 2000s.\n\nShirley Manson talks new Garbage album Photo shows Garbage 2025 As the band release eighth album Let All That We Imagine Be the Light, frontwoman Shirley Hanson talks about embracing optimism at a dark time.\n\nSwedish trailblazers Refused announced earlier this year that they'd be breaking up for good, which means Good Things is your last chance to farewell the hardcore group.\n\nFrom their prophetic 1998 album The Shape of Punk to Come (which, if anything, you'll know from soundtracking The Bear) through to 2019's War Music, Dennis Lyxzén and co. have never been anything less than visceral. And that includes their live show.\n\nWho else is playing?\n\nHorns will no doubt be thrown up for the inclusion of metal mainstays Machine Head, while pop-punk diehards will flip out at seeing both All Time Low and New Found Glory rubbing shoulders on the same bill.\n\nYou've also got 2000s US rock staples The All-American Rejects, Kentucky act Knocked Loose (known for their rain-soaked late-night talk show performance), the pitch black sonic chaos of Lorna Shore, as well as MySpace-era favourites Cobra Starship and ska-punk heroes Goldfinger.\n\nDecked in outlandish costumes and brandishing gimmicks (hello, staged decapitations), Gwar need to be seen to be believed. They'll fit neatly alongside Vegas glam rockers Palaye Royale, self-styled \"bimbo core\" feminist Scene Queen and Bad Nerves, who call themselves the \"bastard child of a Ramones/Strokes one-night stand.\"\n\nCostumed metal act Gwar fill their live show with gnarly riffs and comical sprays of goo. (Supplied: Good Things)\n\nRepresenting Australia on the bill is acclaimed Perth metalcore crew Make Them Suffer, on-and-off-again pop-punks Tonight Alive, Melbourne post-punk outfit Civic, the progressive sounds of Windwaker, the pop-facing heaviness of Yours Truly and … James Reyne!?\n\nBelieve it. Good Things typically includes a nostalgic surprise each year and Reyne, Australian Crawl frontman and ARIA Hall of Famer, will sure get pipes pumping with pub rock staples like Reckless, The Boys Light Up and Way Out West.\n\nOne of Good Things' most unique additions, Stage 666 makes a wild return to showcase alternative entertainment, including a mix of live music, circus acts, pole dancers, and competitions.\n\nAustin, Texas freak show performer The Lizardman will demonstrate his patented Cranial Corkscrew, Jacqueline Furey shows off her fire-breathing, sword-swallowing burlesque act, alongside punk rock clown Captain Ruin and the karaoke band Kill Your Pop Stars, who'll pay tribute to the late, great metal pioneer Ozzy Osbourne.\n\nHere's the full Good Things line-up:\n\nTool, Weezer, Garbage, All Time Low, Machine Head, The All-American Rejects, Knocked Loose, Lorna Shore, Refused, New Found Glory, Make Them Suffer, Dayseeker, James Reyne, Kublai Khan TX, Cobra Starship, Goldfinger, Tonight Alive, Bad Nerves, Civic, Dead Poet Society, Fever 333, Gwar, High Vis, Inertia, Palaye Royale, Scene Queen, South Arcade, Wargasm, Windwaker, Yours Truly.\n\nHere's the dates, and the festival is once again welcoming younger moshers:\n\nFri 5 December — Flemington Racecourse: Melbourne, Wurundjeri Woi Worrong Land, VIC (15+)\n\nSat 6 December — Sydney Showgrounds: Sydney, Gadigal Land, NSW (16+)\n\nSun 7 December — Brisbane Showgrounds: Brisbane, Turrbal Jagera Land, QLD (16+)\n\nTickets are on sale from Thursday 21 August, 10am AEST. You'll find more info at the Good Things website.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/the-nt-wa-or-canberra-who-should-get-afls-20th-team/105640804",
    "title": "Beyond Tasmania, the race for the AFL's 20th team is heating up",
    "publish_date": "Mon, 11 Aug 2025 23:55:43 +0000",
    "category": "sports",
    "authors": [],
    "text": "As the battle for the 2025 AFL premiership heats up on field, the off-field part of the game is also getting more interesting.\n\nThe increasingly likely confirmation of the entry of the Tasmanian Devils to the AFL in 2028 has caused an increase in speculation and statements about a prospective 20th AFL team.\n\nLast Tuesday, ACT Chief Minister Andrew Barr told local paper the Canberra Times that \"if the AFL decides to expand to 20 teams, Canberra's proven support for the game, including growing membership, sell-out crowds and infrastructure commitments, will speak for itself\".\n\nIn a potentially connected move, AFL head honcho Andrew Dillon made a relatively low-profile trip to the nation's capital to watch the Giants play North Melbourne on Sunday afternoon.\n\nThe change of positioning in the ACT towards a potential new AFL side follows similar moves across the country.\n\nTwo weeks ago it was reported that the West Australian Football Commission (owners of West Coast and Fremantle) had softened their stance about the introduction of a third team from Western Australia.\n\nMeanwhile, the bid for a team from the Northern Territory continues to grab attention nationally.\n\nSo, who will win the licence for the AFL's 20th team, and why do we need one anyway?\n\nThe contenders\n\nSome footy fans might be wondering why there's such a rush to expanding to 20 teams so quickly.\n\nLike most things, the answer lies in the little details and logistics.\n\n\"Nineteen [teams] is an awkward number for a competition. So it's going to get to 20 pretty quickly, I'd reckon, after Tassie come in,\" North Melbourne coach Alastair Clarkson said.\n\nAn odd number of teams like 19 creates a number of fixturing difficulties around constant byes and neutral rounds like Gather Round. It would require a season of either 22 or 24 games, which may cause further scheduling issues for the AFLW.\n\nGiven the apparent need, it's no surprise that cities, territories and states are starting to jostle for position in the battle for inclusion.\n\n\"It'll be paper, scissors, rock which state gets it,\" Clarkson said.\n\nEach potential bid has immediate strengths and weaknesses. All three have strong intangible claims to getting a team as well that go beyond the strict numbers.\n\nPerth\n\nWith a growing population, new state-of-the-art stadium and strong economic outlook, Western Australia and Perth have a strong case on paper for being frontrunners for a third team out west. Introducing a third team in WA would reduce the travel burdens on West Coast and Fremantle, and help serve a footy-mad populace.\n\nWest Coast and Fremantle are both in the top six clubs when looking at off-field financial health. Wooden spooners West Coast have the fifth highest home attendances of any club this year.\n\nA new team in Perth wouldn't grow the game to a new location. This may be mitigated by playing some games in regional areas such as Bunbury. Further concerns exist around whether the members on the West Coast waiting list would shift to a new side, and if there are enough fans who aren't dedicated to either the Dockers or Eagles to make a side viable.\n\nIt's worth noting that the case for a third Perth side appears stronger at face value than a similarly constructed third Adelaide team, despite the historical strength of South Australian football.\n\nNorthern Territory\n\nIt could be argued that no place loves footy as much as the Territory. On per capita terms, no state or territory plays footy as much as the NT. Plenty of footy stars, from the Riolis to Michael Long and Andrew McLeod, hail from the territory.\n\n\"Territorians love their AFL and there's no doubt that having a long-term plan to get a team in the AFL is the best way to ensure success.\" then-NT chief minister Eva Lawler said last year.\n\nThere's also a strong case — as made by the most-recent NT Strategic Business Case for an AFL team — that an AFL team may have a broader societal impact in the territory.\n\nEven a marginal improvement in livability may have significant impacts on improving outcomes for Territorians.\n\nOf the candidates, the NT has the smallest population base and the hardest strict business case to make. The NT case included several scenarios, including a split team with north Queensland or a relocated side.\n\nThe case estimated that there would be a shortfall of about $13 million a year for an NT team that would need to be made up by government or altruistic sponsors.\n\nCanberra\n\nIn many ways, Canberra represents a \"Goldilocks\" option.\n\nIt has a bigger regional population than Tasmania, and has been angling for an expansion side since 1981. The region also has a strong playing history with stars such as Alex Jesaulenko and James Hird hailing from the area.\n\n\"I feel like this is a great football town — AFL town. If it makes financial sense … then I think they'd get great support down here from a membership [and] sponsorship perspective.\" GWS coach Adam Kingsley said last week.\n\nThe underlying finances of Canberra are also strong, with a high level of disposable income. Crowds in Canberra have been stronger than in Darwin or Hobart consistently since 2017, with numerous games declared sellouts.\n\nWorking against Canberra is the presence of teams in other major sporting codes, with the Raiders and Brumbies already present on the national stage. In addition, it may be hard to entice potential fans out in winter, with attendances at sporting events dropping in the bitterly cold winter months.\n\nTo further grow the game, avoid the worst of winter and help the bottom line, a Canberra team might also play games in Albury or the broader Riverina region.\n\nThe cost\n\nIt's not cheap to run a footy team, let alone stand one up from scratch.\n\nAnalysis supplied to prospective expansion parties suggests a club run like the modest operations of North Melbourne, GWS or the Gold Coast would need about $52 million per year.\n\nThe AFL hands out cash to clubs in two different tranches — a baseline payment currently around $14 million and variable funding going to clubs with greater need due to historically smaller fan bases and revenue streams. That additional portion can vary from the $0 handed out to Collingwood and West Coast right up to nearly $15 million to GWS and Gold Coast.\n\nHowever, that generosity will not readily be shared by those current clubs. These clubs, after all, will get the final say on expansion.\n\nThe AFL has informed interested parties such as the NT that it expects future expansion teams to be able to operate on the average amount of distribution given to other clubs. To satisfy this desire, the Tasmanian government agreed to further supplement the Devils with up to $12 million per year.\n\nThat funding appears to be the difference between the Devils being viable without extra AFL support or not.\n\nThis affects potential bids significantly, particularly the NT. It may also have real impacts on a new Perth or Canberra side. Any new team doesn't just need to grow the base of the league, but also leave the financial state in a better place.\n\nBeyond the yearly funding required for a team, there's also the need for a place to play.\n\nThat element is the only remaining road block to Tasmania's entry, with the proposed Macquarie Point stadium still stuck in the Project of State Significance process.\n\nWith a hung parliament, there's no guarantee that the Hobart stadium will sail through smoothly — let alone any clarity on the final price for the stadium if approved.\n\nFor two of these three expansion options, a new stadium might also be a sticking point.\n\nOne of the biggest advantages of a potential Perth bid is Perth Stadium. The government has regularly bought major events to fill the new stadium, from State of Origin NRL to Coldplay. An extra AFL team would likely help fill the often vacant stands in winter.\n\nThe other two bids would either require significant upgrades or a new stadium.\n\nCanberra has recently put an expansion of Manuka Oval out for tender to increase the capacity to almost 20,000. Meanwhile, the business case for the NT team outlines the clear need for a new stadium for entry of a standalone side. That stadium was earmarked as costing $700 million, without a clear source of agreed funding.\n\nGiven the number of variables at play, it might be anyone's guess who is the favourite for the new AFL side. Last year Dillon was coy.\n\n\"We have got interest from the NT, there's interest in north Queensland.\n\n\"People have been talking about a third team out of WA, [or] Canberra, so it's great that there is interest. Long may that debate continue.\"\n\nGiven recent movements, the race is well underway.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/farmers-say-trespassers-turn-livestock-into-safety-hazards/105629294",
    "title": "'Endless' trespassers cost farmers thousands and endanger life",
    "publish_date": "Mon, 11 Aug 2025 22:37:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers in southern Western Australia say trespassers who cut fences to enter private land for hunting and camping are turning livestock into safety hazards, allowing them to escape onto nearby roads.\n\nCattle producer Geoff Pearson said one of his properties, located along a major regional highway, had been targeted for the past three years.\n\n\"They cut [the fences], we patch them, they cut them, we patch them. If they don't cut the fences we've got situations where they just drive straight over the gates,\" he said.\n\n\"We've had instances where cattle have been hit by cars. We've had to compensate the [driver] in write-off situations.\n\n\"Fortunately no-one has been injured … but we have to fit the bill on that.\"\n\nCarl Fjastad says cattle roaming onto roads poses risks at any time of day. (ABC Open contributor vikkikay61)\n\nMr Pearson, who is also the WAFarmers' livestock section president, said an estimated 200 trespass incidents had cost him hundreds of thousands of dollars.\n\n\"It's just endless. We can't control it,\" he said.\n\nBridgetown farmer Lawson Harper said cattle escaped onto the South West Highway after pig hunters cut gate locks at his neighbour's property two months ago.\n\nMr Harper said pig hunters also took their hunting dogs and broke onto his property, which \"distresses\" his cows.\n\n\"It's just blatant disregard. I'm not sure why it's developed but it seems to be the norm now,\" he said.\n\nMr Lawson said it was \"a matter of time\" before someone got hurt as a result of livestock getting out and wandering onto roads.\n\nLivestock wandering onto roads can be a significant safety hazard. (ABC News: Kate Forrester)\n\nSafety risk\n\nCity of Albany ranger Carl Fjastad said there was growing community concern about straying livestock with 88 reports of farm animals on roads in the Great Southern in the past year.\n\nHe said livestock on roads was a \"real hazard to road users\", particularly during hours of darkness.\n\n\"Think about a car colliding with a cow. That can certainly lead to life-threatening injuries, potentially even death,\" he said.\n\nLivestock pose risks to road users when they escape from paddocks and wander onto roads. (ABC Rural: Jane McNaughton)\n\nMr Fjastad said a driver was lucky to escape injury after crashing into a stray cow on the road near Redmond, four hours south of Perth, in May this year.\n\nCattle poisoned\n\nThe problem is not a new one for local farmers.\n\nA decade ago Brunswick dairy and beef farmer Paul Ieraci was out checking his boundaries when he noticed fencing had been cut and vehicles had driven though.\n\n\"You hit panic mode,\" he said.\n\nMr Ieraci said a neighbour then called him and said they had \"come across some dead cattle\" they believed to be his.\n\nPaul Ieraci says at least 20 of his cattle died after hunters cut the fence on his property. (ABC South West WA: Kate Forrester)\n\nMr Ieraci's cattle had escaped through the damaged fence and wandered into bushland filled with heart-leaf poison bush.\n\n\"I came across the dead cattle, which was quite heartbreaking,\" he said.\n\nMr Ieraci said he was able to save some, but more than 20 Friesian steers and mated heifers died.\n\n\"It's not our intent to put our cattle in danger, to have them roaming the roads and highways,\" he said.\n\n\" But that's what happens when you've got these irresponsible people doing what they're doing. \"\n\nWhat can be done?\n\nMr Pearson said when people trespassed onto his property he contacted local police and tried to provide as much information as possible.\n\nHe has since invested in hundreds of cameras around his property to try and deter trespassers or help identify them.\n\nA herd of cattle in WA's south. (Supplied)\n\nDespite there being no easy fix he remained hopeful he will one day get livestock back in his paddock.\n\nA WA Police spokesperson said trespassing or causing damage to a person's property was a criminal offence that \"can impact on a farmer's livelihood\".\n\nThey said it was difficult to ascertain how widespread the problem was in remote agricultural areas.\n\n\"Many of these crimes go undetected and unreported due to the sheer size of the farms and their secluded location,\" the spokesperson said.\n\nAnyone with information about suspicious activity around rural properties is urged to contact Crime Stoppers.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/grace-harris-continues-dominate-hundred-aussies-top-run-charts/105640672",
    "title": "Harris continues to dominate Hundred as Aussies top run charts",
    "publish_date": "Mon, 11 Aug 2025 22:37:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Grace Harris has steered London Spirit to victory in the Hundred Women for the third match in three, maintaining the defending champions' 100 per cent start in the English white-ball franchise competition.\n\nIn the tournament's opening match, she scored an unbeaten 42-ball 89; in Spirit's second she bowled the death over, successfully defending six runs with two to spare; and now she has hit an unbeaten 32-ball 50 to guide Spirit to victory at Old Trafford.\n\nChasing Manchester Originals' 7-122, Spirit won by three wickets with two of their 100 balls remaining, thanks to a late flurry of boundaries by the Queenslander.\n\n\"I'm delighted with how I'm going,\" Harris said.\n\n\"I think a lot of the principles that I've been working on within my game are paying off, and I just keep summing up conditions and whenever I'm injected into the game, I'm seeing what impact I can have.\"\n\nPut in to bat, Originals were 2-10 off 12 balls, including Kathryn Bryce out to a brilliant leg-side catch by wicketkeeper Georgia Redmayne, standing up to pacer Tara Norris.\n\nSkipper Beth Mooney (26 off 20) counter-attacked creating a platform for West Indies' Deandra Dottin (36 off 30) to lift the home side to a potentially defendable total.\n\nKira Chathli got the reply off to a good start with 34 off 30 after Redmayne perished for 11, but Spirit slid to 5-97, needing 26 runs off 16 balls.\n\nHarris brought that down to nine from eight with a pair of sixes but Bryce took two wickets in two only for Sarah Glenn to edge, then drive boundaries to ensure Harris's half-century was not in vain.\n\nHarris is now the highest run-scorer in the competition with 157 followed by fellow Australians Meg Lanning (141) and Mooney (97).\n\nShe also has the highest strike-rate (178.4) followed by another Aussie in Ash Gardner (175), and most sixes (nine) followed by Lanning (six).\n\nMeanwhile in the men's Hundred, David Warner made his second successive half-century but this time failed to take London Spirit to victory.\n\nHaving hit a 45-ball 70 not out on Saturday, the former Test opener went one better at Old Trafford, but his 51-ball 71 could not help his side overhaul Manchester Originals' 6-163, closing on 6-153.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/australia-and-vanuatu-close-to-signing-nakamal-agreement/105640026",
    "title": "Australia close to signing 'ambitious' pact with Vanuatu worth $500m",
    "publish_date": "Mon, 11 Aug 2025 22:28:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia and Vanuatu are close to signing an \"ambitious\" new strategic pact that could see the federal government plough about half a billion dollars into the Pacific island country over the next decade.\n\nVanuatu's government has flagged that its Council of Ministers will consider the Nakamal Agreement today after months of negotiations between the two countries, and says that the pact is set to be signed by both countries next month.\n\nThe critical meeting comes as the Foreign Minister Penny Wong, Defence Minister Richard Marles and Pacific Minister Pat Conroy prepare to join Vanuatu's Prime Minister Jotham Napat and other senior leaders on the island of Tanna tomorrow for more discussions on the pact.\n\nIf both sides can reach agreement then the Nakamal pact is set to be given the initial green light tomorrow, ahead of being signed in September.\n\nMr Napat's office said in a statement the development and security agreement would \"cover a wide range of bilateral issues, including infrastructure planning, economic development, and climate resilience initiatives in light of the devastating December 17 earthquake of 2024\".\n\n\"The partnership between Vanuatu and Australia remains strong, especially as Vanuatu continues its recovery efforts,\" it said.\n\nOne Australian government source said Vanuatu had driven \"quite a hard bargain\", but insisted the pact would boost Vanuatu's development while buttressing Australia's strategic position in the country — which is also being energetically courted by China.\n\nThe agreement follows discussions over visa-free travel to Vanuatu last month. (ABC: Stephen Dziedzic)\n\nTravel and migration under wraps\n\nUnder the pact, Australia is expected to make substantial commitments worth up to $500 million over a decade — or $50 million a year.\n\nFor example, Australia would provide approximately $120 million to help Vanuatu deliver its plan to build two \"large data centres\" in both Port Vila and Santo.\n\nAustralia is also expected to deliver around $100 million in security assistance and budget support worth $55 million, and more than $110 million to help Vanuatu deal with the impacts of climate change.\n\nThe federal government is also expected to make smaller financial contributions to boosting labour mobility, fostering cultural connections and improving digital connectivity.\n\nVanuatu faces challenges rebuilding after last year's earthquake. (ABC News: Hugo Hodge, file)\n\nBut several details in the agreement remain under wraps.\n\nFor example, it is not yet clear whether Australia will offer any concessions to Vanuatu on travel and migration, which is an issue likely to be closely watched by other Pacific nations.\n\nLast month Mr Napat declared he would not sign the Nakamal Agreement unless Australia agreed to offer \"visa-free\" travel to his country, saying the pact had to be \"win-win\" for both countries.\n\nSuccessive Australian governments have been unwilling to relax visa and travel rules for Pacific nationals, partly due to fears a large proportion would remain in Australia illegally.\n\nRelaxing travel restrictions for the Pacific could also be politically contentious.\n\nAustralian officials have previously raised deep concerns about Vanuatu's contentious \"Citizenship By Investment\" scheme — sometimes called the Golden Passport program — which critics say has drawn oligarchs and criminals seeking to evade foreign law enforcement.\n\nSecurity commitments unclear\n\nIt is not yet clear what commitments Vanuatu has made to Australia on the security front.\n\nVanuatu to strip Andrew Tate's 'golden passport' Photo shows Two men wearing black clothing walk through a dark door with concerned looks on tehir faces. Vanuatu runs a controversial yet lucrative citizenship-by-investment scheme that critics say has attracted organised criminals and oligarchs.\n\nThe Pacific island nations of Tuvalu and Nauru have effectively handed Australia the right to veto security agreements with third nations under sweeping treaties they signed with Canberra in 2023 and 2024 respectively.\n\nBut Vanuatu has long maintained a fierce commitment to non-alignment — or \"friends to all, enemies to none\" — and is very unlikely to make a similar commitment to Australia.\n\nIn 2022, Vanuatu's then-Prime Minister Ishmael Kalsakau signed a contentious security agreement with Ms Wong that labelled Australia as Vanuatu's \"principal security partner\" and said both countries would \"consult\" with each other on any \"common security interests.\"\n\nBut Mr Kalsakau's cabinet rebelled in the wake of that agreement, accusing the prime minister of going above the heads of his ministers and parliament — and the security agreement was never ratified by either Australia or Vanuatu.\n\nThe statement from Mr Napat's office suggested the Nakamal Agreement will supersede the 2022 security pact.\n\nVanuatu: From paradise to peril Photo shows A chrome coloured crushed ute abandoned on the street in Port Vila's town centre. After five cyclones, two earthquakes and a volcanic eruption, Vanuatu's biggest challenge isn't recovery — it's survival\n\n\"It is important to note that a security agreement signed in late 2022 between Australia and the former Government of then Prime Minister Ishmael Kalsakau was never approved by COM, let alone parliament!\" it said.\n\nA spokesperson for the Foreign Minister Penny Wong said discussions on the Nakamal Agreement were \"progressing\" but \"there is still work to do on both sides.\"\n\n\"We look forward to continuing our constructive conversations on the ground as we work towards reaching an agreement that delivers shared objectives,\" they said.\n\n\"Our visit to Vanuatu highlights the respect, shared values, and cultural and religious connections that are the platform for deepening the partnership between our countries.\"\n\n\"As we have shown through our Pacific partnerships, Australia is open to ambitious agreements where they advance the prosperity and security of our region.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/gab-pound-keeley-sherar-aflw-brene-brown-quote/105639866",
    "title": "How a quote derived from a US president's speech is inspiring AFLW players",
    "publish_date": "Mon, 11 Aug 2025 22:27:53 +0000",
    "category": "sports",
    "authors": [],
    "text": "There is a quote that AFLW players often come back to by an American academic, which draws from a former US president.\n\nAuthor Brene Brown, in her popular book Daring Greatly, pens: \"If you are not in the arena getting your ass kicked on occasion, I am not interested in or open to your feedback.\"\n\nHere, Brown references Theodore Roosevelt's famous 1910 Man in the Arena speech, in which he argues: \"It is not the critic who counts, not the man who points out how the strong man stumbles … credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood.\"\n\nOr, in this case, women on a sporting field.\n\nIn the last month, players and AFL stakeholders have been forced to publicly back the league's continued investment in the competition after reports clubs were told the AFLW was losing $50 million a year.\n\nIt comes as a condensed fixture last year, which featured midweek games, saw average home-and-away crowds reach just 2,600.\n\nA lot has changed since Gab Pound first took the field back in 2017 for the inaugural game between Collingwood and Carlton. (ABC: Scott Jewell)\n\n\"We talk a lot about the person in the arena,\" Gab Pound, inaugural Carlton player, told ABC Sport.\n\n\"Because feedback is the biggest thing in sports for athletes … [but] how do you take feedback when there can be a lot of noise and things coming from all these different places?\n\n\"We kind of bring ourselves back to the arena. And if you're not in the arena with us, battling it out, your opinion doesn't really matter to us.\"\n\nPlayers have said they welcome performance critiques and have called for greater coverage of their games, including criticism, but argue it is fair game when it comes from people who regularly watch their games and understand the competition's contexts.\n\nGab Pound in action during the 2017 AFLW opener between Carlton and Collingwood. (Getty: AFL Photos)\n\nHowever, for all the recent noise, the competition has come leaps and bounds from when Pound took the field for the very first game between Collingwood and Carlton eight years ago.\n\nPound was 21 when she was drafted, coming from the Darebin Falcons like many inaugural players, including Daisy Pearce, Libby Birch, Darcy Vescio, Jess Dal Pos and Paxy Paxman.\n\nThe step up from VFLW to AFLW, Pound said, was a keenly felt one.\n\n\"Just the fact we got paid a little bit of money, we were kind of just, 'Is this a real kind of thing', because when I grew up, there was just no aspiration there,\" Pound said.\n\n\"I grew up in Albury and country footy where there were no girls playing football.\n\n\"I was really excited when school came around [because] we played those little round robins each year.\"\n\nGab Pound from Carlton celebrates with teammates in the AFLW's 2017 opener. (Getty: AFL Photos)\n\nWhen Pound debuted, her teammate Keeley Sherar, the reigning club best and fairest, did not even play footy yet.\n\nWithout a pathway yet, she played netball in her tween years.\n\n\"I feel like players like Gab really built the foundations for what we get to do now,\" Sherar said.\n\n\"I think I have two little sisters, they're in grade six and year nine, and they've been playing since Aus Kick, so I think it's awesome.\n\n\"I didn't get that opportunity and they've really got this amazing pathway and so much opportunity, which a lot of us didn't have when we were younger.\"\n\nKeeley Shehar was named Carlton's best and fairest in 2024. (Getty: Dylan Burns/AFL Photos)\n\nSherar said a lot of girls in her sister's under 12 team come and watch her play along with her family.\n\nThey recently made a \"hot wheels\" sign for one of her games; her nickname at the club.\n\n\"I see them every Sunday and watch their games and they inspire me because I'm like, 'You guys are 12 years old and you're so good and have just so much energy,'\" Sherar said.\n\n\"That's something that really sticks with me … that's why I love playing, to inspire them.\"\n\nGab Pound says AFLW players often talk about Brene Brown's quotes about being in the arena. (ABC: Scott Jewell)\n\nPound said perceptions of AFLW had changed a lot over her time and she was starting to really see a shift, even in the media, towards appreciating how women could \"play great competitive football\".\n\n\"The more support that we have, such as that investment through all levels of grassroots, all the way up to the pro level, it's only going to improve the product,\" Pound said.\n\n\"And then I think that reflection to the wider society as well, it's only going to do good things for the perception of women.\"\n\nShe said there was such a \"big open space\" for women's sport to take off in Australia.\n\n\"Women's sport can go in such a good direction … you see that in American basketball at the moment, unreal,\" Pound said.\n\n\"The crowds that they get, the hype that they get, it's just incredible, and that's something I want to see in future generations for AFLW.\n\n\"There's such a product [there] waiting to really explode\".",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/science/2025-08-12/dugongs-moreton-bay-species-marine-science-conservation/105449400",
    "title": "Scientists uncover the secret lives of dugongs in Moreton Bay",
    "publish_date": "Mon, 11 Aug 2025 22:00:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Janet Lanyon leaps off a red zodiac into the waters of Moreton Bay and swims towards a group of splashing figures in front of her.\n\nMoments before, four fit people in rugby helmets launched into the water off the moving boat in pursuit of a dark shadow as it came up for air.\n\nBetween them is half a tonne of grey muscle — a big male dugong (Dugong dugon).\n\nThe team monitor the dugong's breathing in the water. ( ) The team monitors the dugong's breathing in the water. (ABC TV: Dr Ann's Secret Lives) Researchers hold dugong up to measure it. ( ) The dugong is held up while researchers measure it. (ABC TV: Dr Ann's Secret Lives)\n\nWetsuit-clad researchers wrap a tape measure around the bull's belly, then stretch it the length of his body to give an accurate reading of the animal's size in the water, while the \"catching team\" prevents the animal from diving.\n\n\"Breath … breath … breath …\" the team calls out each time the bull opens his massive nostrils.\n\nOnce they have his measurements, the team slides his hefty body onto a sling and transfers him to a larger boat for a full health check.\n\nAs the dugong is manoeuvred onto the boat the team pours water over its head to mimic the sensation of surfacing for a breath. ( )\n\nDr Lanyon oversees the action, keeping track of what data is being collected and making sure her team and the dugong are safe.\n\nThe marine biologist from the University of Queensland knows dugongs very well.\n\nShe's been running the world's largest dugong health assessment program at Moreton Bay since it started 16 years ago.\n\nJanet Lanyon has studied dugongs for more than three decades. ( )\n\nAlthough the pursuit and capture looks dramatic, she says monitoring shows the dugongs calm down quickly.\n\n\"They are pretty relaxed animals really,\" Dr Lanyon says.\n\nAnd what we learn from these dugongs is critical for helping conserve the enigmatic marine mammal elsewhere in Australia and other places around the world where numbers are falling.\n\nQuandamooka Country\n\nMoreton Bay is the perfect place to study dugongs.\n\nAbout 800—1,000 dugongs live in the turquoise waters that lie off the Queensland coast near Meanjin/Brisbane.\n\nLoading...\n\nThe large mammals spend up to 20 hours a day digging and hoovering up seagrass, consuming roots, rhizomes and leaves.\n\nOn average, an adult dugong eats 65kg of grass a day — more when they are reproducing.\n\nThey are also picky eaters, preferring to eat a specific species of seagrass.\n\nTheir messy feeding leaves trails, like snails in a rock pool, making them relatively easy to find in the 3,500-square-kilometre bay.\n\nAnd it's safer than some of the other potential study sites in Australia.\n\n\"Up north, you've got crocodiles,\" Dr Lanyon says.\n\nThese dugongs are deeply significant to the Quandamooka people, one of the traditional owner groups of Moreton Bay.\n\n\"Caring for the dugongs is the same as caring for our Country,\" says Justin Ladbrooke-Parkin, who is the ranger in charge for the Quandamooka Marine Rangers, but speaking from his own experience.\n\n\"[Dr Lanyon's] research provides that scientific knowledge … but also, it aligns with the cultural knowledge of the Quandamooka, which has been passed down through our generations.\"\n\nRace on deck\n\nOnce the dugong is on board the boat, a new race is on.\n\nLoading...\n\nTo minimise stress to the animal, the researchers extract as much biological information from it as they can within 30 minutes, before it is released.\n\nThey collect blood, urine, saliva, mucous-laden tears and faecal samples, as well as swabs of skin bacteria that could be used as a \"health biomarker\". If it was a female, it would also have an ultrasound to detect pregnancies.\n\nData from the samples also reveal aspects of their secret lives.\n\nBy measuring stress hormone's the team have been able to ascertain that the dugongs recover quickly from their time on board. ( ) By measuring stress hormones, the team has found that dugongs recover quickly from their time on board. (ABC TV: Dr Ann's Secret Lives) The tears of a dugong are very sticky and provide a wealth of biological information. ( ) The tears of a dugong are very sticky and provide a wealth of biological information. (ABC TV: Dr Ann's Secret Lives) Blood samples are taken from beneath the dugong's pectoral fin. ( ) Blood samples are taken from beneath the dugong's pectoral fin. (ABC TV: Dr Ann's Secret Lives) The plastic plate used to collect a faecal sample is covered in alfoil so the plate does not contaminate the poo and the team can test for microplastic. ( ) The plastic plate used to collect a faecal sample is covered in foil so the plate does not contaminate the poo and the team can test for microplastic. (ABC TV: Dr Ann's Secret Lives)\n\nAdult males start to look a bit rough around the edges towards late winter and early spring when there is less good-quality seagrass in the bay.\n\nThey also often have marks from fighting each other.\n\n\"That time coincides with the mating season so it's a time when the adult males are just thinking about finding females,\" Dr Lanyon says.\n\nSampling shows their testosterone and stress hormones increase during mating season.\n\nAs a result, it's not uncommon for a few dead males to wash up at this time of year, but Dr Lanyon has been able to use this research to calm public fear of mass mortality events.\n\nSeagrass precious for picky eaters\n\nMoreton Bay's dugongs are the most studied in the world.\n\n\"We've now tagged probably 750, or more, different animals in the bay,\" Dr Lanyon says.\n\nOne of the major findings of the research is that this population rarely strays from the bay. If an occasional animal swims north, they are unlikely to breed with other dugongs.\n\nBut their homebody nature, massive appetites and picky eating puts them at risk.\n\nTheir growth rate, reproductive rates, how healthy they are, their whole life history is determined by their food.\n\nDugongs use fine hairs on their nose to detect seagrass and dig it up. ( )\n\nThe underwater meadows they rely on are susceptible to dieback, a disease that is on the rise due primarily to increased extreme weather events.\n\n\"We're concerned because a lot of the species that are good food for dugongs and that dugongs like to feed on are becoming rarer [in Moreton Bay],\" Dr Lanyon says.\n\nThis ties in with traditional knowledge.\n\n\"We've always known that there's these special areas for the dugongs and their feeding grounds,\" Mr Ladbrooke-Parkin says.\n\n\"And this research obviously just supports that these areas should be protected.\"\n\nLife near a big city\n\nSwimming near Australia's third-largest city comes with specific risks for dugongs.\n\nHuman medicine is flushed into the bay, and urban grime washes down the drains.\n\n\"We looked at a panel of 18 different common antibiotics and we found that every dugong that we looked at was resistant to quite a few of the antibiotics,\" Dr Lanyon says.\n\nHer team has also found heavy metals, pesticides, microplastics and herbicides in the tissue and circulating blood of Moreton Bay dugongs.\n\nExtreme weather can compound these urban risks.\n\n\"We know that with every flood event or cyclone there's direct damage to seagrass beds,\" Dr Lanyon says.\n\nEven if there is enough seagrass to eat, dugongs are still affected. They show increased levels of heavy metals, pathogens and microplastics after floods, and \"there is a drop in body condition compared to that time in other years\", Dr Lanyon says.\n\nBut, she adds, this population may be faring better than those further north. They're exposed to agricultural runoff, which could severely affect the dugongs.\n\nIn these northern populations, researchers have not been able to observe calves in the year after major cyclones and floods, suggesting none were born or survived early life.\n\nDugong mothers need plenty of high-quality seagrass to fuel their pregnancies and to nurse their calves. ( )\n\nIt is unclear whether this also happens in Morton Bay.\n\nThere are also other looming threats such as the H5N1 strain of bird flu, which has affected many other species of mammals around the world.\n\nH5N1 hasn't yet arrived in Australia, but Dr Lanyon is monitoring dugongs for any signs of the disease.\n\n\"We want to detect an emerging problem, not wait until there's a mass mortality event,\" she says.\n\nInternational insights\n\nOnboard the floating vet clinic, Chiaki Yamato is busy measuring the width of the bull's head.\n\nThis is her second year studying Moreton Bay's dugongs.\n\nWhile the Moreton Bay population appears to be stable, other populations in waters around Asia and Africa are declining.\n\nBefore joining the University of Queensland team, Dr Yamato studied dugongs in ThailaND.\n\n\"In Thailand, if we could see one dugong in three boating days, I was very happy … but here, on the first day I went on the sea we were having lunch surrounded by a herd of dugongs,\" Dr Yamato says.\n\nBy taking precise measurements on the boat and comparing those measurements to drone footage Dr Yamato can better estimate size from the air. ( ) By taking precise measurements on the boat and comparing those measurements to drone footage, Dr Yamato can better estimate size from the air. (ABC TV: Dr Ann's Secret Lives) Dugong researcher Dr Chiaki Yamato. ( ) Dr Yamato hopes the measurements she takes in Moreton Bay can be used to help develop non-invasive ways of studying the animals elsewhere. (Supplied: Chiaki Yamato) When dugongs come up for breath their body is often bent making them hard to measure. ( ) When dugongs come up for breath, their body is often bent, making them hard to measure. (Supplied: Chiaki Yamato)\n\nIt is too risky to catch and study unhealthy members of declining populations, so Dr Yamato is trying to develop a way to measure the animals using drones.\n\nDrones can be an affordable and low-impact way to study species for researchers who are licensed to use them, making her data invaluable for use on vulnerable populations.\n\nShe'll use the information gathered from measuring the Moreton Bay dugongs in the water and on the boat to help refine measurements taken by drones.\n\nSwabbed, sampled and measured, the healthy male is ready for release, but for Dr Yamato, it is not yet goodbye.\n\nAs the dugong swims free, her drone buzzes in its wake.\n\nCheck out the Dr Ann's Secret Lives episode about dugongs on ABC iview.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/palestinian-authority-welcomes-australia-recognition/105640552",
    "title": "West Bank locals say Australia recognising Palestine is 'amazing'",
    "publish_date": "Mon, 11 Aug 2025 21:53:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Palestinian Authority (PA) in the West Bank says it is prepared to yield to demands from countries including Australia to reform its processes and administration, as part of the process to recognise Palestinian statehood.\n\nOn Monday, the Australian government announced it would shift its policy in the Middle East and recognise a Palestinian state, following similar moves by France, the United Kingdom and Canada.\n\nEach of those nations have attached slightly different conditions to their support, with Prime Minister Anthony Albanese saying the PA needed to commit to measures such as demilitarisation, financial transparency and to hold elections.\n\n\"Reform is a Palestinian demand,\" the PA's foreign minister Varsen Aghabekian told the ABC from her offices in Ramallah.\n\nThe Palestininan Authority's foreign minister Varsen Aghabekian. (ABC News: Hamish Harty)\n\n\"Yes, there were conditions by various countries on reform — but as a start, it's a Palestinian demand.\n\n\"We want to become better in terms of how we govern our institutions, how we deal with our money, how we use best practices.\"\n\nThe last Palestinian presidential election was in 2005, while the last parliamentary election was the following year.\n\nDr Aghabekian blamed Israeli restrictions for making it too difficult to hold a poll.\n\n\"Elections are a must, and as Palestinians, we want democratic processes, we want a democratic country whereby we can elect our leaders and we have been denied that democratic process because we are living under abnormal conditions,\" she said.\n\n\"We are under occupation and that democratic process cannot include the entirety of occupied Palestine today.\"\n\nShe said Palestinians in occupied East Jerusalem were being blocked from taking part, and Gazans also needed to have their say in any ballots.\n\n'Australia is a weighty country'\n\nDespite the Albanese government's insistence it is not a major player in the Middle East, the PA foreign minister argued it was influential in global affairs.\n\n\"Australia is a weighty country, its recognition will make a difference, it will bring others to recognise, hopefully, and it safeguards the two-state solution,\" she said.\n\nLoading...\n\n\"It sends a very clear message that Australia is with international law, it respects international law, it respects the rights of people to self-determination, and it wants to move alongside the Palestinians and the Israelis on the peace track.\"\n\nDr Aghabekian said she had received a call from her Australian counterpart Penny Wong on Sunday night, local time, informing her an announcement was imminent.\n\nBut she revealed she woke to the news on Monday morning with surprise, hours after Senator Wong and Prime Minister Albanese revealed the decision in Canberra.\n\nWhile Australia has joined allies in the move, the biggest player in the debate has not, with the United States remaining opposed.\n\n\"It's not fruitless, it's fruitful,\" Dr Aghabekian said of the Albanese government's decision to act before the US.\n\n\"That will create a critical mass of nearly the whole world saying that there's a consensus on this illegal occupation and the need to dismantle this occupation.\"\n\nNetanyahu defends plan to occupy Gaza Photo shows Benjamin Netanyahu holding his hand to the side of his face at a podium. The Israeli prime minister says the plan, which many countries fear will lead to increased bloodshed, is the fastest way to end the conflict.\n\nA White House official said the US President Donald Trump viewed recognising a Palestinian state now as a reward for Hamas after the deadly October 7, 2023 attacks on Israel.\n\nFifty Israeli hostages are still held captive in Gaza, 20 of whom are believed to be alive.\n\nIt echoes the rhetoric from senior members of the Israeli government, including President Isaac Herzog.\n\n\"These declarations, by Australia and other countries, are a reward for terror, a prize for the enemies of freedom, liberty, and democracy,\" he said on Monday.\n\n\"This is a grave and dangerous mistake, which will not help a single Palestinian and sadly will not bring back a single hostage.\"\n\nAhead of the announcement, Israeli Prime Minister Benjamin Netanyahu said it was \"shameful\" countries such as Australia would consider the issue.\n\nDr Aghabekian rejected the sentiment.\n\n\"It's not a reward for Hamas, it is a reward for the plight of the Palestinian people who have been suffering immensely for seven decades.\n\n\"And non-recognition is a reward to the extremists in Israel, whether in the government or the settler organisations and their leaders.\"\n\nIsrael's occupation of the Palestinian territories was ruled illegal by the International Court of Justice last year.\n\nDecision welcomed by Gazans\n\nNews of the Albanese government's decision had quickly spread through the streets of Ramallah, 15 kilometres and a concrete wall away from Jerusalem.\n\n\"Honestly, it's amazing,\" Saida Shahout told the ABC.\n\n\"We've seen something that we've never seen before, which is more countries are siding with us and seeing the injustice that's happening with our country and with the people of Gaza.\"\n\nSisters Saida and Husseina Shahout welcomed Australia's decision. (ABC News: Hamish Harty)\n\nHer sister Huseina said the move was long overdue.\n\n\"We're at this point in our lives where why does everything have to [come from] war? \" she said.\n\n\"Why is it always a violent action? Why can't we just come to an agreement? You're a person, I'm a person and we can both sit at the same table and have a meal.\n\n\"When you cut me, I bleed the same colour you bleed — there should be no difference between the two.\"\n\nWest Bank resident Amjad Tamimi welcomed the decision.\n\n\"I see the Australian advancement together with many other countries — France which was, to be honest, the first initiator in this direction — this is a good thing and will bring peace to the region and stability,\" he said.\n\nWest Bank resident Amjad Tamimi. (ABC News: Hamish Harty)\n\n\"Naturally this talk, the recognition of these states, the Palestinian state, will have an impact on the Palestinian situation in general — the political situation, the economic situation, the social situation.\"\n\nFellow local Azmi Samah feared symbolism would only go so far, as the Palestinian population was under threat from Israeli forces.\n\n\"The Palestinians have been here for a long time, we are not waiting to be recognised, they recognise us from the outside, but if we are not given a state, then we have not benefited,\" he said.\n\n\"So if the whole world recognises it and we in the reality don't have a state, then we have not benefited from this at all.\"\n\nHis comments point to the concerns around issues such as Israeli settlements being built throughout the West Bank — a practice that is illegal under international law, but which the Israeli government approves and encourages.\n\nAzmi Samah feared symbolism would only go so far. (ABC News: Hamish Harty)\n\n'Glimpse of hope'\n\nThe Albanese Government's push to recognise Palestinian statehood has happened 22 months into the war in Gaza, where local health authorities say more than 60,000 Palestinians have been killed.\n\n\"What we are experiencing is something incomprehensible, something that we have never experienced in the past,\" Dr Aghabekian said.\n\n\"And this recognition brings to the Palestinian people a glimpse of hope, and this is exactly what the Palestinian people would like to feel, especially at this specific moment.\n\n\" Every one of us holds a baggage of trauma, and it's about time that we are relieved, and this recognition gives us that sense of moving forward. \"\n\nThe shift in Australian foreign policy also comes days after Israeli Prime Minister Benjamin Netanyahu announced an expansion of his country's military offensive in Gaza.\n\nWhat will recognition of Palestinian statehood actually change? Photo shows Mahmoud Abbas waves at supporters from a podium. A row of men stand behind him. Momentum is building internationally for the recognition of a Palestinian state, with five new countries declaring they are ready to take the step.\n\nMr Netanyahu has rejected international condemnation of plans to seize control of Gaza City, displacing hundreds of thousands of Palestinians in the process.\n\nHe insisted it was the way to end the war with Hamas quickly, and claimed Arab nations — not the PA — could take over civil governance of the strip in the post-Hamas era.\n\n\"Israel can say whatever it wants, because, frankly, Israel doesn't want to see anybody in the Gaza Strip,\" Dr Aghabekian said.\n\n\"But the only entity that can shoulder that responsibility is the Palestinian Authority, and it can be supported by the Arab, Islamic, and the world at large in terms of the assistance, the security assistance, the technical assistance, the funding that is needed.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/fatal-drug-overdoses-reach-10-year-high-in-victoria/105638016",
    "title": "Victoria records highest number of fatal overdoses in a decade",
    "publish_date": "Mon, 11 Aug 2025 21:42:38 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "More Victorians died of drug overdoses in 2024 compared to any other year in the past decade, a new report shows.\n\nAccording to latest data from the Coroners Court of Victoria, the state recorded 584 fatal overdoses last year, up from 547 the year prior, with illegal drugs remaining the biggest contributor.\n\nWhile Victoria's annual per capita fatal overdose rate remained more or less stable at around 8.1 deaths per 100,000 people between 2015 and 2024, the report noted a significant increase in the involvement of illicit drugs over the same period.\n\nClassed under that category are substances such as heroin, methamphetamine, MDMA, cocaine and GHB.\n\nThose drugs peaked in use last year in both metropolitan Melbourne and regional Victoria, contributing to 65 per cent of the total overdose deaths across the state.\n\nThat represents a 16 per cent increase from 2015, when illegal drugs contributed to 49 per cent of the state's total overdose deaths.\n\n\"The concerning rise in overdose deaths and especially those involving illegal drugs is a stark reminder that we need to keep building on our harm reduction efforts,\" Victorian state coroner John Cain said.\n\nTuesday's data breaks down Victorian overdose deaths by three main categories — illegal, pharmaceutical, and alcohol.\n\nThe report found that pharmaceutical drug use — although over-represented in the overall overdose deaths last year at 69 per cent — has gradually declined over the decade.\n\nMeanwhile, the contribution of alcohol in 2024 was consistent with previous years at a rate of 24 per cent.\n\nJudge Cain told ABC Radio Melbourne more people were turning to illegal drugs due to medical prescribing practices having tightened in recent years, limiting the availability of pharmaceuticals.\n\nMore die from heroin than any other drug\n\nIn the past decade, 5,268 people have died from drug overdoses in Victoria and most of those deaths were from combined drug toxicity.\n\nLast year, the five top contributing drugs to fatal overdoses were heroin (248), diazepam (219), methamphetamine (215), alcohol (141) and pregabalin (92).\n\nHeroin and methamphetamine-related deaths were the highest in the metropolitan local government areas of Yarra and Melbourne city respectively.\n\nIn regional Victoria, where about a quarter of total fatal overdoses occurred, Greater Geelong recorded a substantially higher number of deaths in 2024 than in previous years at 35, all but one of which were a result of heroin and meth use.\n\nHead of policy and practice at the Victorian Alcohol and Drug Association (VAADA), Scott Drummond, said the figures called for increased treatment resources and prevention initiatives in the illicit drug space.\n\n\"These deaths are the result of a continuing low level of action or almost inaction in response to drug use in the community,\" he said.\n\n\"One of the things that was really problematic was the intense debate around the overdose prevention facility, otherwise known as the safe injecting room.\n\n\"And as long as that debate continues, as long as we don't put in place evidence-based, effective harm reduction measures, then we can't expect the overdose rate to diminish much.\"\n\n\n\n\n\nThe data showed men were twice as likely to die from an overdose than women, with those aged between 35 and 54 at most risk. The data showed men were twice as likely to die from an overdose than women, with those aged between 35 and 54 at most risk.\n\nHowever, 95 people aged 55 to 64 also died from an overdose in 2024, compared to 87 the year prior, with numbers fluctuating across the decade.\n\nThe state coroner said many of those deaths could be prevented with programs that provided instant support to drug users seeking help.\n\n\"Somebody in need can't wait two weeks or get in a queue to get access to it. They really need to access it now,\" Judge Cain said.\n\n\"When the opportunity arises and they see a doctor or a health professional, you need to be able to move in very quickly to provide the support and assistance.\"\n\nCall for harm reduction strategies\n\nVictoria first introduced a Medically Supervised Injecting Service (MSIR) trial in North Richmond in 2018.\n\nBut last year the Allan government turned down recommendations for a second such facility to be set up in the Melbourne CBD, despite data at the time pointing to the City of Melbourne as the deadliest council area for drug deaths.\n\nDoes south-west Sydney need a safe injecting facility? Photo shows A woman with short hair in an apartment holding a portrait photo of a man in a suit. As drug deaths grow rapidly in Sydney's south-west, one controversial solution is building a safe injecting facility in the area. But would it work?\n\nIt instead committed to a $95 million Statewide Action Plan.\n\nThat included a new $36.4 community health service, trial of hydromorphone, more naloxone vending machines, expansion of pharmacotherapy — which involves specialist drugs like methadone and counselling — and the appointment of a chief addiction advisor in the Victorian Department of Health.\n\nNaloxone is a medicine that rapidly reverses an opioid overdose and comes in the form of a nasal spray, as well as an injection.\n\nUnder the Take Home Naloxone program launched in 2022, the drug was federally subsidised. But determining which pharmacies or community services can distribute it and how much they are supplied with is up to each state and territory.\n\nAs part of its health plan the Victorian government also started a mobile pill testing service at music festivals last year. This month it is due to open a fixed site service in Fitzroy.\n\nMr Drummond said those initiatives were welcome but also required a well-funded implementation strategy.\n\n\"The drug checking service is a great start, but we need to continue to introduce more initiatives, such as increasing the availability of Naloxone, a drug which is easy to administer and reverses opioid overdoses,\" he said.\n\n\"We need more overdose prevention facilities, such as the supervised injecting rooms, where the harms are occurring — that's place-based intervention.\n\n\"We need more resourcing for peer-support services, where folks of lived and living experience of drug and alcohol use can support those that are in the midst of drug and alcohol use. Their support and wisdom is really helpful and really effective.\n\n\"We need more specialist services responding to misuse of benzodiazepines [a pharmaceutical depressant drug].\"\n\nSimilar measures have also been called for nationally.\n\nThe not-for-profit Penington Institute last year recommended drug education, increasing Naloxone access, medication-assisted treatment, drug checking and supervised consumption.\n\nIt followed data showing there were 2,356 drug-induced deaths across Australia in 2022, 80 per cent of which were unintentional.\n\nVictoria's fatal overdose rate was the second-highest in the country after Western Australia.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/rba-rates-asx-markets-business-live-news-11-august/105639974",
    "title": "Live: Reserve Bank interest rate cut considered a near-certainty",
    "publish_date": "Mon, 11 Aug 2025 21:32:22 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Samuel Yang",
      "Business Correspondent David Taylor",
      "Michael Janda"
    ],
    "text": "A new report into the retirement system has found new middle and low-income retirees in the middle wealth group have been the biggest beneficiaries of compulsory super, with an extra $11,388 to spend each year.\n\nThe report by Super Members Council also found without compulsory super, half a million more Australians would rely on the Age Pension, costing taxpayers $12 billion in 2026-27 and $14 billion in 2028-29.\n\nThe Retirement Revolution: Super’s Coming of Age report is the first sweeping study on Australia’s retirement incomes since the Government’s Retirement Income Review in 2020.\n\nThe modelling by the Council showed the newest retirees in the middle wealth group were receiving an average of $20,800 a year more in super income than similar retirees two decades ago, and $11,388 extra after accounting for lower Age Pension entitlements.\n\nOver the past two decades, super balances have more than tripled for middle wealth retiree households and more than doubled for the second-lowest wealth retiree households.\n\nAs each successive generation retires with super, the evidence shows this money is lasting longer into their retirement years, with the proportion of people in their 70s with super income tripling over the past 20 years.\n\nBefore the introduction of universal super with the Super Guarantee laws in 1992, financial assets were concentrated in the wealthiest 10% of households.\n\nFast forward three decades, and they are spread across every income group, thanks in large part to super.\n\nWhile super is transforming retirement for many, the report has highlighted some groups remain vulnerable.\n\nRetirees who rent, live alone, or retire involuntarily due to health or caregiving responsibilities, face significantly lower incomes and wealth.\n\nWomen, single retirees, and those in insecure work are also more likely to be knocked back by unpaid super, lower lifetime earnings, and less access to tax concessions than higher-income Australians.\n\nThese gaps underscore the need for targeted reforms to ensure super delivers for all Australians. Australia’s ageing population, rising mortgage debt in retirement, and complex system settings will place increasing pressure on the retirement income system.\n\nSuper Members Council CEO Misha Schubert says the super system is doing what it was designed to do to transform incomes and standards of living for everyday people, but there is more work to do.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/maya-joint-cincinnati-open-ekaterina-alexandrova/105640606",
    "title": "Joint beaten in Cincinnati as Aussies continue patchy run to US Open",
    "publish_date": "Mon, 11 Aug 2025 21:31:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's women will head towards the US Open in patchy form after Maya Joint completed their elimination from the last big warm-up event, the Cincinnati Open.\n\nAfter a bright start, the teenager was outgunned by Ekaterina Alexandrova 6-4, 6-3 in 75 minutes on a sweltering day in the midwest city.\n\nOpening play on a sparsely-attended court 3, the 19-year-old gained an early break in the last-32 third-round tie, and was 2-0 and 4-2 up.\n\nBut the 12th-seeded Russian stepped up the power to take the set with two breaks.\n\nThe second stanza was more closely contested, until Alexandrova won the sixth game to take a 4-2 lead and served out, concluding with an ace.\n\nDe Minaur's US Open prep rocked Photo shows Alex De Minaur stretches on the backhand side but the ball is out of reach Alex de Minaur's US Open preparations take a surprise hit as he is knocked out of the Cincinnati Open by giant American Reilly Opelka.\n\nJoint had forced five break points but took only one, while Alexandrova won all three break points she created.\n\nCompatriots Daria Kasatkina, Ajla Tomljanovic and Kimberly Birrell all lost their second-round matches, but being ranked within the top 100, all should be confirmed in the main draw for the US Open, which begins on August 24.\n\nHowever, Joint's chances of joining Kasatkina among the seeds in New York, which might have been achieved with a deep run in Cincinnati, have gone.\n\nJoint, who was born and grew up in the neighbouring state of Michigan, is currently entered for another Ohio event next week, the WTA 250 in Cleveland.\n\nShe will hope to pick up the form that enabled her to defeat 18th-seeded Brazilian Beatriz Haddad Maia in Cincinnati on Saturday.\n\nTwo Aussie men, Adam Walton and Alexei Popyrin, are still in the Cincinnati Open, with both due to play their third-round matches on Wednesday (AEST).\n\nAAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/cricket-ashes-series-australia-vs-england-flaws-analysis/105610184",
    "title": "Australia and England's conspicuous flaws set the table for epic Ashes",
    "publish_date": "Mon, 11 Aug 2025 21:30:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "The most common way to know a sporting event is epic is right in the middle of it, as you're revelling in the action.\n\nOther times it's when the dust settles after the fact that it dawns on you that you watched something really special. England's recent drawn series against India was a great example of this.\n\nLoading...\n\nThen there's the all-timer sporting events, ones that feature a lengthy runway building anticipation before living up to the billing.\n\nEverything suggests the upcoming Ashes series between Australia and England this summer will fall straight into the third category.\n\nThese two teams have spent the past two years sizing each other up after settling for a 2-2 draw in the 2023 Ashes in England.\n\nThe 2023 Ashes was box office to say the least. There were real victories, moral victories, rain delays, fiery confrontations, all the ingredients that make a Test series properly spicy.\n\nAustralia and England had to settle for a 2-2 draw following a thrilling Ashes series in 2023. (Getty Images: Gareth Copley)\n\nThat the reaction to Ben Stokes and India's handshake drama from the fourth Test was loudest from Australia tells you everything you need to know about how hotly contested this summer will be, both on and off the field.\n\nAustralia is keen to end \"BazBall\" for good, while England is looking for its biggest scalp under Brendon McCullum.\n\nFor all of the positivity surrounding the way England has played its cricket since McCullum was named the Test coach, his side is yet to beat either Australia or India in a Test series.\n\nTwo home series against the fellow members of cricket's \"Big Three\" have yielded 2-2 draws, while England was beaten 4-1 in India at the start of 2024. England is yet to tour Australia under McCullum.\n\nBrendon McCullum is still looking for a major scalp away from England after becoming Test coach in 2022. (Getty Images: Ryan Pierse)\n\nEngland will touch down this summer having not won a single Test in Australia since the 2010-11 series. The last three trips Down Under have yielded scorelines reading 0-5, 0-4 and 0-4.\n\nA similarly disappointing result this summer in Australia will suddenly make people wonder whether there has been any progress made at all under McCullum, even if that's not exactly fair.\n\nThis series pits two flawed teams against each other and there is no clear favourite.\n\nWhile both teams have glaring flaws, they've also both got very obvious strengths.\n\nWhich strength shines through and overshadows the flaw will determine the outcome.\n\nThe strengths: England's batting and Australia's pacemen\n\nAssuming England is fully healthy, the batting line-up projects to be the strongest the tourists have brought to Australia since the victorious 2010-11 tour.\n\nThe opening Test of the 2010-11 Ashes saw England roll out Andrew Strauss, Alastair Cook, Jonathan Trott, Kevin Pietersen, Paul Collingwood, Ian Bell and Matt Prior as its top seven at the Gabba.\n\nAlastair Cook scored 766 runs at an average of 127.66 the last time England beat Australia in an Ashes series Down Under. (AP: Matt Dunham)\n\nThat combination arrived in Australian having played a couple of years together and was importantly followed by bowlers that were also serviceable with the bat in Stuart Broad and Graeme Swann.\n\nAll seven of England's top order boasted significant Ashes experience leading into that series. Strauss, Cook, Pietersen, Collingwood and Bell had all played a series in Australia prior to that summer and had won multiple Ashes series' as well.\n\nEngland's current first-choice top seven of Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Ben Stokes and Jamie Smith have also played a significant amount of cricket together over the past couple of years.\n\nLike Cook and Strauss were in 2010, Crawley and Duckett are currently arguably the best opening pair in Test cricket.\n\nZak Crawley and Ben Duckett have become the best opening combination in Test cricket over the last few years. (Getty Images: ECB/Gareth Copley)\n\nIn 55 innings together, England's opening pair has scored 2,511 runs at an average of 46.50, registering five 100-run partnerships for the first wicket in the past three years.\n\nThey currently sit 13th all time on the list of highest opening partnerships in terms of runs scored.\n\nFor reference, Cook and Strauss combined for 4,711 runs at an average of 40.96 in 117 innings together between 2006 and 2012, the third-highest in Test history.\n\nOf England's top seven, Duckett, Brook and Smith will all be making their first Test appearances Down Under. How they handle the increased pace and bounce of Australian pitches will go a long way to determining the outcome of the Ashes.\n\nCrawley and Pope were here last time around and neither found much success, while Root and Stokes will be on their fourth Australian tours.\n\nAustralia's pacemen, led by the ageless Mitchell Starc with the new ball, will test England's aggressive top order. (AP Photo: Ricardo Mazalan)\n\nEngland's batters have been prolific since McCullum took over, but there is no greater test in world cricket than facing Australia's quicks in Australia.\n\nMitchell Starc, Josh Hazlewood, Pat Cummins and Scott Boland figure to be the four first-choice pacemen Australia use during the Ashes, and could potentially be joined by Michael Neser.\n\nCummins is the youngest of the quintet at 32, and is likely to be the only one that will play all five Tests. How Australia chooses to rotate the others will be fascinating.\n\nStarc, Hazlewood and Cummins are the first-choice trio, but England will be wary of slacking off when Boland invariably makes his way into the side, particularly in Melbourne.\n\nScott Boland has terrorised every Test batting line-up he has come up against in Australian conditions. (Getty Images: Darrian Traynor)\n\nEngland handled Boland with ease during the 2023 Ashes in the UK, but the 36-year-old is an entirely different proposition at home, where he has taken 49 wickets in just nine Tests at a stupendous average of 12.63.\n\nIt's going to be well and truly a battle of fire versus fire when it comes to England's top order taking on Australia's pacemen.\n\nThe weaknesses: Australia's top order and England's quicks\n\nBoth of these areas for either side carry significant question marks.\n\nWe are just months out from the first Test, and no-one in Australia seems to know what its best top four is going to look like.\n\nUsman Khawaja and Steve Smith will be there, but the other two spots are a big headache for Australian coach Andrew McDonald.\n\nSam Konstas has been trialled as Khawaja's opening partner with mixed results, which suggest he might not be ready to enter an Ashes cauldron.\n\nSam Konstas has struggled since making a bright half-century in his debut Test innings on Boxing Day last year. (AP: Ricardo Mazalan)\n\nMarnus Labuschagne has been dropped from the side after a treacherous two-year run of form, having been such a reliable number three last time England toured down under.\n\nThe fit again Cameron Green was trialled at number three by Australia in the World Test Championship final and the tour of the West Indies, and managed just one half-century in eight innings.\n\nThe fragility of Australia's top order puts immense pressure on not only Smith, but the middle-to-lower order to deliver, and they've done so time and time again.\n\nAs South Africa showed in the WTC final, if you've got a quality pace attack, then Australia's batting order is ripe for the picking. The question is whether England has that.\n\nEngland's fortunes with the ball will largely be centred around the fitness of Jofra Archer this summer. (Getty Images: Bradley Collyer/PA Images)\n\nEngland has the pace battery required to cause Australia trouble. Whether they're able to all get on the park is the real question.\n\nJofra Archer has been slowly nursed back to red ball cricket with an eye to this tour for the best part of four years, and made a long-awaited return against India.\n\nEngland's attack looked very different in the two Tests Archer played against India compared to the three where he was absent.\n\nRapid pacemen Mark Wood and Olly Stone are both coming off knee surgeries, and will not be able to be relied upon for five straight Tests.\n\nMark Wood is one of a number of England pacemen to have gone under the knife in the past 12 months. (Getty Images: Gareth Copley/ECB)\n\nWood was England's most penetrative bowler last time in Australia, taking 17 wickets in four Tests at 26.64 apiece. Bowlers like Wood, who live in the high-140s, are essential to winning a series in Australia.\n\nGus Atkinson and Josh Tongue, England's leading wicket-taker against India, will also have big roles to play in Australia.\n\nEngland will be fine rotating its out-and-out quicks depending on the venue, but will need to find its workhorse paceman that can front up day after day.\n\nWoakes considering rehab over surgery in race to be fit for Ashes Photo shows Chris Woakes leaves the field injured during England's fifth Test against India. After his heroic batting effort with a dislocated shoulder, England paceman Chris Woakes has set his sights on being healthy for this summer's Ashes in Australia.\n\nChris Woakes played in every Test of the India series, but his record outside of England leaves a lot to be desired.\n\nWoakes has played in seven Tests Down Under and averages 51.68 with the ball, managing just 16 wickets. His gentle low-130s pace rolls perfectly onto the bat in Australia, where there is not a lot of lateral movement like in England.\n\nThe real X-factor with the ball for England is its skipper, Stokes.\n\nLast time England toured Australia, Stokes managed just four wickets in five Tests, as injury issues restricted him to being no more than a bit-part bowler.\n\nBefore injuring his shoulder and missing the final Test against India, Stokes looked as damaging as he ever has with the ball.\n\nIf Stokes is unable to contribute effectively with the ball, there is very little chance of England coming away with the urn in Australia.\n\nThe all-time greats looking for a final statement\n\nThis summer's Ashes pits two of the generation's best Test batters — Australia's Steve Smith and England's Joe Root — against each other for potentially the last time.\n\nSince the 2023 Ashes, the two veteran superstars have gone on divergent paths.\n\nRoot has played 23 Tests since that series, and has scored 2,127 runs at an average of 57.48, well above his career average of 51.29. He has scored nine Test centuries in that time.\n\nSmith has gone through one of the leanest patches of his Test career in that same time period.\n\nSteve Smith has been well below his usually prolific standards in the past 18 months at the Test level. (AP: Ricardo Mazalan)\n\nThe former Australian skipper has scored 1,157 runs in 17 Tests at an average of 41.32 since August 2023, an average that pales in comparison to his career mark of 56.02.\n\nSince Smith really started hitting his straps as a Test batter just over a decade ago, he has rarely been out-batted in a series by a fellow member of batting's \"Big Four\", a group that also features Root, Virat Kohli and Kane Williamson.\n\nDon't let Smith's soft-spoken nature fool you, he is one of the most ruthless competitors this generation has seen.\n\nSmith will no doubt have heard all the chatter about Root being the best in the world over the last few years, and will be hell bent on winning this personal battle.\n\nThere is chatter that this series could be Smith's last. What better way to go out than winning the Ashes and ending the best batter of the generation debate for good?\n\nJoe Root has been in the most prolonged purple patch of his Test career since the 2023 Ashes series. (Getty Images: Alex Davidson)\n\nRoot's incredible two-year run has seen his Test legacy launched into an entirely different stratosphere.\n\nHe is now comfortably England's greatest Test batter, and is likely to overtake Sachin Tendulkar as the highest runscorer in the longest format of the game.\n\nHowever, there is a big gap in Root's Test resume — an Ashes century in Australia.\n\nIf you exclude Bangladesh, where Root has played just two Tests, Australia is where his record is by far the poorest.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRoot has managed just 892 runs in 14 Tests Down Under since making his debut during the 2013-14 Ashes, and has a mediocre average of 35.68.\n\nHe has only been dismissed in single figures five times over that journey, showing his propensity to do the hard work before getting himself out.\n\nBut Australia has not seen this version of Root, the one that possesses an insatiable hunger for runs and lots of them.\n\nSo here we are then, with both England and Australia having no more Tests remaining before the Ashes get underway in Perth on November 21.\n\nThe runway is officially here and the trash talk has begun, as have the wild predictions from both sides.\n\nStrap yourselves in because this is about to be a generational summer of Test cricket.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-12/nat-fyfe-retirement-where-does-he-rank-all-time-greats/105546970",
    "title": "Where Nat Fyfe ranks among WA's AFL greats",
    "publish_date": "Mon, 11 Aug 2025 21:14:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "The retirement of a sporting great always sparks conversation — from reminiscing about the incredible moments they produced, to debate over where they sit in the pantheon of legends.\n\nWill Steve Smith be considered better than Ricky Ponting? Is LeBron James ahead of Kobe Bryant? Are you in the Lionel Messi or Cristiano Ronaldo camp? Serena Williams or Margaret Court?\n\nSo it is that with Nathan Fyfe announcing his retirement, the inevitable conversation commences.\n\nFyfe has won numerous individual accolades, including two Brownlow Medals (AAP: Michael Dodge)\n\nOf the AFL-era players, where does Fyfe sit? Or, to narrow it down further, of the AFL-era players from Western Australia, does he get a spot on our Mount Rushmore?\n\nThe sculpture, in the US state of South Dakota, features four presidents — George Washington, Thomas Jefferson, Theodore Roosevelt and Abraham Lincoln — and is often used as a way of ranking film and sports personalities.\n\nTo make the mountain is to be considered among the very best.\n\nTwo Brownlow Medals speak to Fyfe's individual brilliance, but they don't entirely capture his impact. In 2015, the year of his first medal, he finished the season with a fractured leg, which led to him managing just five games in 2016.\n\nHis second, in 2019, was won as the Dockers lost eight of their last nine games, and won just eight games for the year — and he still accumulated 33 Brownlow votes.\n\nNat Fyfe was a contested beast, almost unstoppable at his best (AAP: Richard Wainwright)\n\nHe sits 13th on the list of all-time vote getters, though just three modern-day players average more votes per game than the kid from Lake Grace — Nick Daicos, Patrick Cripps and Lachie Neale.\n\nAt his best, Fyfe was a complete footballer.\n\nHe started life off as a skinny forward with sticky hands, before morphing into a midfield beast, becoming the prototype for the bulls running around in the AFL today.\n\n\"[He] single-handedly put the club on the map, but he stayed true through the whole time,\" retired teammate Michael Walters said of Fyfe.\n\n\"[He's a] legend of the footy club, legend of the AFL, future hall-of-famer, two-time Brownlow Medallist.\"\n\nRemember when he burst through four Geelong players to kick a goal, or when he took an iconic hanger over Richmond's Anthony Miles at Subiaco Oval?\n\nNat Fyfe and Patrick Dangerfield are among the greatest players of their generation (AAP: Michael Dodge)\n\nOr his epic duel with Patrick Dangerfield at the Adelaide Oval in 2015, where he finished with 40 disposals and a goal?\n\nFyfe is absolutely in the top echelon of WA AFL footballers, but does he get a face on the mountain? And who else is up there?\n\nLance Franklin's 1,000th AFL goal saw thousands of fans run onto the SCG (Getty Images: Cameron Spencer)\n\nLance 'Buddy' Franklin is our George Washington, who occupies the most prominent position on the mountain — 1,066 goals in an era that didn't see big forwards dominate with anywhere near the impact they did in bygone eras is a staggering achievement.\n\nBut it was how he kicked goals that put him at a different level — from raking set shots from outside 50, to astounding athleticism (think Cale Hooker's chase down the wing) — Franklin was a nightmare for defenders, doing the impossible with incredible regularity.\n\nHe was a player who embodied the phrase, \"You just can't do that\", as he did just \"that\" over and over again.\n\nBut the remaining three places are harder to quantify — the candidates are plenty, the spots few.\n\nFremantle Dockers great Michael Walters retires after battling knee injury Photo shows Michael Walters salutes with his right hand during a Fremantle-Melbourne AFL match. Fremantle Dockers forward Michael Walters announces his retirement from the AFL after 239 games.\n\nGlen Jakovich did what almost nobody else could — tame Wayne Carey in his pomp. Their duels have become stuff of legends, and he's in the AFL's Hall of Fame.\n\nHe won two premierships, four Eagles best-and-fairest awards and two All-Australia blazers. He's among the greatest defenders the game has seen.\n\nThe same could be said for the recently retired Jeremy McGovern, whose impact on the game can be summed up in one iconic moment — his mark which triggered West Coast's stunning 2018 premiership.\n\nThe Albany product's intercept marking was a hallmark of his game, and helped him claim five All-Australian selections, as well as an Eagles best and fairest.\n\nPeter Matera produced one of the great Grand Final performances, kicking five goals in the Eagles 1992 flag, while also collecting 18 disposals, as he claimed the Norm Smith Medal.\n\nAdd five All-Australian selections, the 1994 premiership, a club best and fairest, Indigenous Team of the Century spot and WA Football Hall of Fame inductee, and you get a picture of dominance.\n\nHe also finished runner-up in 1994 and 1997 Brownlow Medals (Chris Grant won the latter, but was ineligible, meaning Matera finished second behind Robert Harvey).\n\nBen Cousins, for all his off-field issues, was a phenomenon — an explosive midfielder who could run all day.\n\nA Brownlow Medal, a premiership, six All Australians, four best and fairests. He formed part of one of the best midfields of the modern era, combining with Chris Judd and Daniel Kerr to terrorise oppositions on the way to the 2006 flag.\n\nBen Cousins was a part of the Eagles great midfield, with Chris Judd and Daniel Kerr (Getty Images)\n\nHis ability to kick goals from the midfield was striking — he finished with 217 majors from 270 games.\n\nAnd what of Patrick Cripps? Still playing, the Carlton captain can probably only be considered post-career, but he's going to be putting his hand up.\n\nAnd as always, there are others to consider.\n\nEagles record goal-kicker Josh Kennedy, game-changing ruck Dean Cox, Brownlow Medallist and three-time premiership player for Brisbane Simon Black and dual North Melbourne premiership player Peter Bell, to name just a few.\n\nHow a 'speculative' rookie draft selection became an AFL great Photo shows Jeremy McGovern jumps through the air trying to take a mark. As Jeremy McGovern sat crying in a meeting with his coach Adam Simpson before the 2014 AFL season, few would have predicted the career he would have. What happened next is testament to hard work, courage and an ability to read the play second to none.\n\nRanking players across three decades of football is an impossible challenge, but here is my list.\n\nLance Franlin is, unequivocally, the best modern-day WA player.\n\nPeter Matera slots into the Thomas Jefferson position, while Ben Cousins takes the Theodore Roosevelt spot at three.\n\nFinally, my Abraham Lincoln is Simon Black. The Brisbane great gets the nod ahead of Fyfe due to his brilliance over a long period.\n\nThree premierships, a Brownlow, a Norm Smith, three All Australians and three Lions best and fairests. He also finished second in the 2007 and 2008 Brownlow Medal counts.\n\nAs with the actual Mount Rushmore, people will disagree with the selections, but that's the beauty of sport — everyone has an opinion, and everyone is entitled to one.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/companies/the-photo-that-shows-how-trump-puts-his-ego-ahead-of-america-s-future-20250811-p5mlud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The photo that shows how Trump puts his ego ahead of America’s future",
    "publish_date": "Tue, 12 Aug 2025 11:57:00 +1000",
    "category": "finance",
    "authors": [
      "Matthew Yglesias"
    ],
    "text": "No matter. To Trump, the important thing is announcing these pledges, not enforcing them. During his first term, there was an infamous vaporware investment from Foxconn in Wisconsin that never amounted to anything. The real benefit to the president is the sycophantic photo op, when the chief executive smiles for the cameras and praises Trump’s dealmaking prowess.\n\nIn related news, Apple chief executive Tim Cook went to the White House last week to give President Donald Trump a large piece of gold. In exchange, Trump said that Apple would be exempt from a new 100 per cent tariff the US is imposing on imported microchips. Officially, Apple gets the exemption because it committed to making a $US100 billion ($153.5 billion) investment in the US. Apple had already announced earlier this year a $US500 billion investment program, which itself was a modest expansion of previous plans.\n\nOne of the most provocative items in my wardrobe is a plain dark T-shirt designed by a libertarian economist. In 10 lines across the front, it reads: “Tariffs not only impose immense economic costs but also fail to achieve their primary policy aims and foster political dysfunction along the way.”\n\nA flat tariff instituted for the purpose of raising revenue would, whatever its downsides, basically be just a peculiar form of tax. But tariffs are almost invariably marketed as having strategic or economic-development benefits. And that leads to exemptions. The chip tariffs are supposed to foster the growth of an electronics manufacturing industry in the US. But because chips are an input into other manufactured goods, the tariffs could easily backfire. So if you can convince the president that you are in fact making investments in manufacturing in the US, you can get an exemption from the tariffs.\n\nLoading\n\nThe problem here — and with the dozens of other exemptions and waivers baked into Trump’s various tariff announcements — is that there is no objective criteria or process at work. Who gets exemptions, and who does not, is almost entirely up to the whims of Trump and his appointees. This in turn raises the question of whether his primary policy aim isn’t just to maximise his own power and influence.\n\nCook, for example, used to be a somewhat vocal advocate of LGBT rights. He’s always been, first and foremost, a corporate executive. But he would occasionally take advantage of America’s status as a free country to speak his mind about political issues.\n\nThat could now be a risky business proposition, because the viability of Apple’s business hinges on not just its ability to keep making products people want to buy, but its ability to secure tariff exemptions. Other tech executives, such as Jeff Bezos, have also erred on the side of reticence: While he wants his newspaper to support and defend personal liberties and free markets, the company he founded backed down from a plan to list explicit tariff surcharges after facing pressure from the White House.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/rba-expected-to-hand-down-rate-cut-20250812-p5mmbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "RBA expected to hand down rate cut",
    "publish_date": "Tue, 12 Aug 2025 11:53:12 +1000",
    "category": "finance",
    "authors": [],
    "text": "RBA expected to hand down rate cut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/snoop-dogg-to-headline-afl-grand-final-day-20250812-p5mmbk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Snoop Dogg to headline AFL grand final day",
    "publish_date": "Tue, 12 Aug 2025 11:52:00 +1000",
    "category": "sports",
    "authors": [],
    "text": "Snoop Dogg to headline AFL grand final day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/afl/if-you-want-romance-pay-for-it-why-the-afl-s-father-son-rules-should-change-20250812-p5mm8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you want romance, pay for it: Why the AFL’s father-son rules should change",
    "publish_date": "Tue, 12 Aug 2025 11:50:01 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "St Kilda supporters just have to take it on trust that watching a father-son selection run around for the team their dad played for is enjoyable.\n\nThey haven’t had that luxury since Bailey Rice played the last of his 11 games with the club in 2018, just the second father-son selection to play in a St Kilda jumper.\n\nTheir main memory of father-sons is Geelong’s Gary Ablett jnr and Matthew Scarlett combining in the defining moment of the 2009 grand final to sink the Saints.\n\nSam Darcy looks good in a Bulldogs’ jumper, but should he have cost the club more? Credit: Getty Images\n\nAlthough it’s a much-loved feature of the game and one that could be preserved in some form, the current father-son rules are distorting competitive balance too much to survive.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/environment/sustainability/blue-mountains-residents-could-reduce-pfas-by-donating-blood-gps-told-20250725-p5mhrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "More than 20 new ‘forever chemicals’ found in Sydney tap water",
    "publish_date": "Tue, 12 Aug 2025 11:46:56 +1000",
    "category": "lifestyle",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "PFAS are a family of synthetic chemicals prized for their resistance to heat, grease and water, and used in a wide range of everyday products such as stain-resistant fabrics, cleaning products and firefighting foams. Now found in the blood of almost every Australian, they are often dubbed “forever chemicals” because they don’t break down naturally, and can persist in the environment and human body for decades. In 2024, the US Environmental Protection Agency concluded that PFAS were “an urgent threat to public health and the environment” and exposure to certain PFAS posed “significant risk to human health, including cancer, even at very low levels”. The agency imposed stricter PFAS limits for US drinking water, which have been maintained under the Trump administration, and recommended blood testing for people with occupational exposure or who live in contaminated areas. NASEM has also found that certain PFAS, specifically PFOA, are carcinogenic to humans, while the International Agency for Research on Cancer (IARC) has classified PFOA as carcinogenic to humans and PFOS as possibly carcinogenic. In the webinar, Buckley said the NASEM guidelines on sensible screening for an individual were “pretty terrible” and described IARC as “just some subgroup of the WHO”, not the World Health Organisation itself. Buckley chaired the expert health panel for PFAS for the Australian government in 2018. He told the webinar he had looked over the state of research since then, and “not much” had changed.\n\nLoading Dr Nicholas Chartres, a senior research fellow in the school of pharmacy at the University of Sydney who viewed the webinar, told this masthead it would have been most appropriate for the NSW Health webinar to present the findings of the US EPA and NASEM reviews alongside the IARC evaluations. “Government advice should not rely on individual experts, but rather rigorous, transparent reviews that reflect the most current science, when available,” he said. NASEM’s review was more rigorous and up-to-date than the 2018 Australian panel, Chartres said, taking in the 139 human studies that had been published since then. A NSW Health spokesperson said the webinar was to support local clinicians to provide information and give them a chance to share case studies and ask questions.\n\nSTOP PFAS convener Jon Dee in Leura. Credit: Sitthixay Ditthavong Jon Dee, from Blue Mountains community group STOP PFAS, said: “The PFAS in our drinking water was an Erin Brockovich-level contamination, yet NSW Health is downplaying this and ignoring a huge amount of international evidence about PFAS health risks.” Blood donations Buckley told the webinar about a third of PFAS in a human body would be in the blood stream, and if individuals were concerned about their PFAS levels and wanted to be proactive in lowering it, they could consider donating blood. “If you quietly said ‘you’re welcome to give blood and you will get rid of 3 per cent of the PFAS in your body every time you give blood’, I actually think it’s not a bad idea”, Buckley said. He added that it was “a futile exercise … at one level” because it would not deliver health benefits, and it could cause mixed messages and concerns about the blood supply.\n\nJones told the webinar she disagreed with blood donation to lower PFAS because it could cause persistent anaemia and there was “no proven causality between PFASes and adverse health effects”. Loading A randomised clinical trial of 285 Victorian firefighters in 2019 found donating blood lowered PFAS levels, while the PFAS Health Study at the Australian National University has identified menstruation as one of the reasons why PFAS levels are lower in Australian women than men at population level The expert panel findings released on Tuesday said, “interventions that reduce blood PFAS are of uncertain benefit and may cause harm”. Sydney tap water\n\nResidents in the Blue Mountains have been exposed to high levels of PFAS, especially PFOS from firefighting foam, in drinking water for at least 17 years and probably up to 32 years. Water with PFAS levels above safe limits had been supplying 78,000 residents from Mount Victoria to Glenbrook, according to Sydney Water, until the pipeline to a contaminated dam was disconnected last year. Last week, the NSW Environment Protection Authority put out a warning that people should limit their consumption of fish from Wentworth Falls Lake to one serve of redfin perch per week and all other fish species to two serves a week because of the results of testing of surface water and fish for PFAS. Peter Morse, a master fly casting instructor, was out at Wentworth Falls Lake on Monday honing his skills. He said he never catches fish in the lake mainly because of concerns about urban run-off from nearby houses, but noted the lake was stocked with trout annually and they were always fished out by the end of the season. “It’s a popular spot for kids in the mountains to go fishing, and I suspect if they catch a trout, they’re going to take it home for mum to cook,” Morse said. On Tuesday, University of NSW researchers released their findings of PFAS testing in Sydney tap water in 2024, with an article published in the journal Chemosphere. The samples were analysed per drinking water catchment and found to be highest around North Richmond, potentially because of contamination from the air base.\n\nThey found a total of 31 PFAS types in Sydney tap water, including 21 not previously detected. The detected PFAS included 3:3 FTCA, thought to be only the second global detection in any drinking water supply, and 6:2 diPAP, previously found in bottled water and now detected in tap water for the first time. Lead researcher Professor William Alexander Donald said the health effects of 3:3 FTCA were unknown, but there was some evidence to suggest that 6:2 diPAP caused thyroid and reproductive issues. The National Health and Medical Research Council updated the Australian drinking water standard in June, covering five main types of PFAS. The UNSW team found PFOS in Sydney tap water at 6 parts per trillion, which is below Australian limits but above the US standard. Donald said one of the most interesting findings was that Sydney tap water had high levels of PFBA, a short-chain PFAS that is being used as a replacement for the banned substances, PFOS and PFOA.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-macron-praises-albanese-after-revealing-palestine-recognition-plans-trump-praises-respectful-putin-ahead-of-crucial-meeting-20250812-p5mm75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Macron praises Albanese after revealing Palestine recognition plans; Trump praises ‘respectful’ Putin ahead of crucial meeting",
    "publish_date": "Tue, 12 Aug 2025 11:45:37 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Australians are likely paying more than is needed for domestic travel as airlines fail to provide enough seats, says the nation’s top industry regulator.\n\nThe number of seats flown by major airlines in June was 2.8 per cent lower than in June 2019, even though Qantas, Jetstar and Virgin have all increased capacity since then, the Australian Competition and Consumer Commission said.\n\nQantas and Virgin planes on the tarmac at Sydney Airport. Credit: Oscar Colman\n\nDomestic airlines still haven’t filled the hole left by Tigerair’s exit in 2020, nor made up for capacity loss on major routes caused by Rex Airlines’ fall into administration.\n\n“The lack of growth in seat capacity to meet rising demand has likely meant consumers are paying more than they would have in a more competitive, better-supplied market,” the ACCC said in its Domestic Airline Competition report.\n\nThe average revenue per passenger in June 2025 was 0.8 per cent higher than in June 2024 even with the 12.3 per cent drop in jet fuel prices over the same period.\n\n“Jet fuel is a significant contributor to an airline’s operating costs,” the ACCC said, noting that it usually accounts for between 15 per cent and 25 per cent of an airline’s costs.\n\nThe update from the ACCC comes six weeks after Virgin relisted as a public company – “a development that was important for preserving competition and protecting consumer interests in the Australian aviation market”.\n\nHowever, the ACCC believes Virgin’s return to the stock market “is unlikely to significantly affect the competitive dynamics between major airline groups over the short to medium term”.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/hannah-ferguson-wants-rupert-murdoch-to-know-her-and-hate-her-her-ambition-doesn-t-end-there-20250616-p5m7mx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hannah Ferguson wants Rupert Murdoch to know her (and hate her). Her ambition doesn’t end there",
    "publish_date": "Tue, 12 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Josefine Ganko"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the election cycle just past, social media commentator Hannah Ferguson was everywhere. The 27-year-old interviewed the prime minister, found herself at the centre of media storms, went viral multiple times, and delivered an election post-mortem at the National Press Club. I see her multitasking in action when, halfway through our lunch at A.P. Bread & Wine, a waiter stops to clear Ferguson’s empty plate. I look down to see my barely touched meal and wonder how this is possible, given that Ferguson has been doing almost all the talking. I hadn’t even noticed Ferguson chowing down on her “leftover bread pasta”. She talks quickly and rarely hesitates, even when I push back on her answers or delve into more controversial topics. Admittedly, “The All Purpose” platter I ordered is large, and I am known to eat at a leisurely pace, but I’m still bemused by how Ferguson’s ability to do it all at once is a pleasing metaphor for her last six months. When we meet in mid-June, Ferguson’s finally had some time to breathe after a manic period of work that was bookended by the US election and hosting British author Dolly Alderton at the Sydney Opera House on one end, and the Australian federal election and announcing her plans to run for the Senate on the other. Already beloved among progressive Gen Z women, Ferguson burst into Australia’s broader public consciousness this year. While her loyal left-wing fan base expanded, so did her pool of detractors. She’s reached the milestone of being well-known enough to be the sole target of hit pieces in The Australian and diatribes on Sky News. “It’s actually shocking to me to look back,” Ferguson tells me. “I feel like I’ve cracked through five ceilings in five months.”\n\nAdvertisement\n\nOn October 31, 2022, Ferguson celebrated the second anniversary of her progressive social media platform, Cheek Media, with a message to her followers, posted (of course) to Instagram: “I won’t sleep until I can confirm that Rupert Murdoch knows me and hates me,” it read. Having launched the feminist platform in 2020 with two friends, primarily to call out media reporting of domestic and sexual violence, Ferguson had since taken the project solo. A.P. Bread & Wine’s left-over bread pasta. Credit: Dominic Lorrimer When Cheek hit 50,000 followers in 2023, a book deal emerged that allowed Ferguson to quit her job, move to Sydney and run the platform full-time. The book that resulted is Bite Back, an homage to the promise contained in Cheek’s tagline: “News that bites back.” “The idea is that we can respond and say, ‘No, no, we’re cutting through the noise’. Young people see through this, and we want something different,” Ferguson says. It quickly grew into a platform for Ferguson’s political commentary, delivered in tweet-sized text snippets or vertical video. (While Cheek is a popular Instagram news source, Ferguson’s always insisted she’s not a journalist.)\n\nAdvertisement\n\nCheek is now nearing the 200,000 follower mark on Instagram, after a huge six months that saw more than 50,000 new followers join to hear Ferguson’s commentary in the lead-up to the election. Her podcast, Big Small Talk, co-hosted with Sarah Jane Adams, regularly features in Australia’s top 50 on Spotify, and Ferguson has announced a national tour. A little less than three years after her bold Rupert Murdoch claim, it’s impossible to say if the media mogul knows Ferguson’s name, but she’s certainly caught the attention of the mainstream political establishment and the ire of the mastheads and networks Murdoch owns. On June 6, The Australian ran an opinion piece about Ferguson with the headline “Progressive ‘girlboss’ preaches diversity – but champions conformity”. Days earlier, Sky News presenter Chris Kenny said her address to the National Press Club included “plenty of the usual extreme-left bile”. In that May address, Ferguson articulated the same goal she had in 2022: to be an “antidote” to the “Murdoch media”. Is it overly ambitious for a 26-year-old in Sydney to take on arguably the world’s most powerful media figure (the industry’s biggest “influencer”, one might say)? Maybe, but unbridled ambition and barefaced confidence are Ferguson’s signatures. Ferguson grew up in a working-class conservative household, moving from Orange to south-west Sydney and back again during her childhood. Her dad is a truck driver, now based in Queensland, and her mum still lives in regional NSW, running a small bra fitting business.\n\nAdvertisement\n\nAged 13, Ferguson recalls how her parents’ critique of Julia Gillard’s 2012 misogyny speech didn’t sit right. “I remember thinking, ‘They’re not making fun of her policies. They’re making fun of the way she speaks, and her haircut’.” As Ferguson grew up, she developed political views that were at odds with her parents’, but still credits them with allowing for the robust debate that helped form her point of view. “The reason I am progressive is that my parents always treated me like a small adult. I was allowed to ask any question.” The “All Purpose platter”, which also comes with an A.P Bakery croissant. Credit: Dominic Lorrimer Ferguson received a scholarship to study law at the University of Queensland, where her political perspective was shaped further by the privilege she observed in the “stuffy” law school culture. Early work experiences at Queensland’s Department of Public Prosecutions and the Electrical Trades Union provided a conviction in those beliefs that rears its head again and again through Ferguson’s career. “I was negotiating with BHP, with Rio, with Qantas. That’s a wild thing to be able to say at 23,” Ferguson recalls of her time at the union. “I think that really reflects what I do now in that I don’t really doubt that I’m welcome at these tables and that I can say something.”\n\nAdvertisement\n\nWith Cheek, Ferguson is delivering content for mostly young, mostly female progressives who aren’t necessarily highly engaged in the political process but who agree with her worldview and care about the news. One 24-year-old fan I spoke to said she valued how Ferguson broke down big concepts and explained the impact of the news on society at large. “I came to Hannah because I agree with her, and there aren’t many people that I feel represented by in the media in terms of that worldview,” she told me. Cheek has a squarely political focus, but often uses memes and humour to deliver its message, while Big Small Talk is a hybrid pop culture-politics podcast that gives equal airtime to the top political stories and the latest celebrity news. Hannah Ferguson is the de-factor leader of the “new media” movement, having propelled into the nation’s attention during the 2025 federal election. Credit: Dominic Lorrimer “The joke is putting the dog’s medicine in peanut butter,” Ferguson says, explaining that despite being highly engaged, many Gen Zers are put off by traditional media’s approach to politics. There’s no doubt that their media habits are changing. Over the past year, the number of Australians accessing news via social media overtook online websites, with Instagram being the primary news source for 40 per cent of people aged 18-24, according to the University of Canberra’s latest Digital News Report. Ferguson puts that down to mainstream outlets’ failure to connect with young people, and in her typically confident way, she stood up at the National Press Club and said as much to a room full of newspaper and TV journalists.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/springboks-roll-out-alpha-move-on-wallabies-by-naming-side-three-days-early-20250812-p5mm92.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Springboks roll out alpha move on Wallabies by naming side three days early",
    "publish_date": "Tue, 12 Aug 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "He doesn’t quite know all their names but Springbok coach Rassie Erasmus is wary of the Wallabies’ threats ahead of the Rugby Championship opener in Johannesburg on Sunday morning.\n\nErasmus talked up the Wallabies’ scrum and aerial potency after unveiling a strong team for the Ellis Park showdown, and in an unprecedented sign of confidence, named his side on Monday – three days ahead of the deadline.\n\nMost coaches jealously guard their team until forced to name it 48 hours before the Test, to minimise the preparation time for rivals. But in a sizeable flex, Erasmus is not stressed about the Wallabies knowing what’s coming.\n\nThere is no Cheslin Kolbe, as he returns from injury, and no bomb squad on the bench – yet – but that’s about the extent of the good news for Australia, with Erasmus rolling out 18 World Cup winners in his 23-man match day squad.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/red-alert-rugby-to-use-mouthguards-that-flash-after-heavy-impacts-20250812-p5mm7m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red alert: Rugby to use mouthguards that flash after heavy impacts",
    "publish_date": "Tue, 12 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Charlie Morgan"
    ],
    "text": "Smart mouthguards that flash red to highlight significant head impacts will be used at the Women’s World Cup later this month.\n\nThe initiative from World Rugby is a progression of technology that was first brought to matches in 2021 and has been steadily developed since. LED mouthguards were trialled successfully in Major League Rugby and in the Under-20 World Championship this year, receiving the green light to be rolled out further.\n\nReferees will be asked to immediately stop the match upon seeing these clear mouthguards turn red as soon as a player experiences a certain level of force in a collision. An alert will still be sent to a match-day doctor via Bluetooth to warn of a possible concussion, but the hope is that another further visual cue enhances awareness.\n\nTypically, at the moment, a player will be brought off upon a natural break in play after their mouthguard has been triggered. It is hoped that the flashing LED will both save time and reduce doubt as to which collision caused the head impact.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/divots-fines-and-injuries-why-souths-fans-should-avoid-storming-field-if-johnston-breaks-record-20250812-p5mm8w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Divots, fines … and injuries: Why Souths fans should avoid storming field if Johnston breaks record",
    "publish_date": "Tue, 12 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nSouth Sydney fans are being urged not to storm the pitch if Alex Johnston breaks the game’s try-scoring record this weekend – because they will leave divots on the Allianz Stadium surface and may be fined.\n\nThe regular pooling of water and poor drainage at the Moore Park venue has come under fire from officials and players alike – and now it poses a health hazard for supporters who could be about to witness history when Souths play Parramatta on Saturday night.\n\nJohnston needs three tries to draw level with Ken Irvine’s long-standing record of 212 career tries, and four to set a new mark.\n\nThe winger has scored 16 hat-tricks in his career, including two matches where he scored five tries, and another game earlier this season when he bagged four.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/companies/star-seals-deal-to-sell-queen-s-wharf-casino-to-hk-partners-20250812-p5mmb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star seals deal to sell Queen’s Wharf casino to HK partners",
    "publish_date": "Tue, 12 Aug 2025 11:38:41 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates",
      "Colin Kruger"
    ],
    "text": "Struggling casino operator Star Entertainment has rescued a deal to offload its troubled Brisbane resort to the Hong Kong-based business partners in this venture.\n\nThe publicly listed company has been locked in negotiations over plans to sell its 50 per cent stake in Brisbane’s Queen’s Wharf casino to Chow Tai Fook Enterprises and Far East Consortium, as it scrambles to reduce debt and survive a financial crunch.\n\nStar’s Queen’s Wharf Casino in Brisbane. Credit: Joe Ruckli\n\nStar had been unable reach an agreement with the parties before a key deadline two weeks ago, but on Tuesday it said it had entered into a $53 million binding deal.\n\nThe deal will see Star sell its share of Brisbane’s Queen’s Wharf casino to Chow Tai Fook Enterprises and Far East Consortium and hand Star ownership of properties at the Gold Coast casino.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/not-going-to-force-people-bleijie-ok-with-country-s-worst-flu-jab-rate-20250812-p5mmaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Not going to force people’: Bleijie OK with country’s worst flu jab rate",
    "publish_date": "Tue, 12 Aug 2025 11:34:02 +1000",
    "category": "lifestyle",
    "authors": [
      "Matt Dennien",
      "Courtney Kruk"
    ],
    "text": "The news\n\nQueensland Deputy Premier Jarrod Bleijie has declared he is happy with the state’s nation-trailing flu vaccination rate as hospitals struggle with a wave of infection.\n\nAnd after Premier David Crisafulli on Monday refused to say if he had personally had the vaccine, Bleijie echoed the comments, saying whether he had had a jab was “between me and my GP”.\n\nHe then went further.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/business/companies/seven-west-media-profits-crater-with-just-one-bright-spot-20250812-p5mm8r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven West Media profits crater with just one bright spot",
    "publish_date": "Tue, 12 Aug 2025 11:31:17 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Kerry Stokes-owned Seven West Media’s profits have suffered another steep fall, diving 63 per cent to just $16.6 million for financial year 2025, with its primary television business buckling under pressure.\n\nRevenue for the company, which is majority-owned by the billionaire and controls the Seven Network and The West Australian, dropped four per cent to $1.42 billion after its commercial deal with Meta ended, and because of an ongoing decline in free-to-air television advertising.\n\nKerry Stokes’ Seven continues to slide. Credit: Trevor Collens\n\nIt cut its total operating costs by two per cent and will again not pay a dividend to investors.\n\nSeven West chief Jeff Howard said there was “solid progress” made under the company’s new structure, which included earnings growth in the second half of the fiscal year.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/money/investing/going-through-divorce-don-t-assume-your-family-trust-is-impenetrable-20250723-p5mh60.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Going through divorce? Don’t assume your family trust is impenetrable",
    "publish_date": "Tue, 12 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "James Steel"
    ],
    "text": "If you have a family trust, it’s natural to assume it offers robust protection for the assets of the trust, even in the case of relationship breakdown.\n\nDon’t assume your trust is an impenetrable shield, as family courts in Australia have significant powers to look behind a family trust’s structure.\n\nWhen a relationship breaks down, seemingly protective structures such as family trusts can take centre stage. Credit: Suzanne White\n\nFamily trusts are a common feature in many people’s financial lives, to manage wealth, protect assets and plan for the future across generations.\n\nWhether established long before a relationship began, during it, or by parents and grandparents as part of their estate planning, family trusts are usually designed with deliberate intentions.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Tue, 12 Aug 2025 11:21:36 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/walker-backs-dad-uncle-to-coach-in-nrl-20250812-p5mmb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Walker backs dad, uncle to coach in NRL",
    "publish_date": "Tue, 12 Aug 2025 11:15:35 +1000",
    "category": "sports",
    "authors": [],
    "text": "Walker backs dad, uncle to coach in NRL\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/chikungunya-a-new-mosquito-borne-virus-to-contend-with/0371959dz",
    "title": "Chikungunya: a new mosquito-borne virus to contend with",
    "publish_date": "Mon, 11 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-at-record-levels-ahead-of-rba-rates-decision/tbndk29vc",
    "title": "ASX at record levels ahead of RBA rates decision",
    "publish_date": "Mon, 11 Aug 2025 08:08:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/fires-burn-throughout-europe/dxwe9st4s",
    "title": "Fires burn throughout Europe",
    "publish_date": "Mon, 11 Aug 2025 07:39:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs firefighters across Europe push back against unrelenting fires, emergency crews in Spain have evacuated over 1,400 people from the regions of Castille and Leon.\n\n\n\n\n\nOf the more than 1,000 people evacuated by wildfire in the region, around 400 of those were from and around the town of Carucedo\n\n\n\n\n\nAnother 700 were evacuated near Las Medulas, where fire has extended to the UNESCO World Heritage site.\n\n\n\n\n\nEvacuees, like this person, fear they'll have nothing to return to.\n\n\n\n\n\nSPANISH THEN ENGLISH VO: \"Some of us don't want to leave and we won't leave the area because we know they won't do anything. Helicopters are going to leave, (fire) engines will run out of water and the entire town will be burnt. We've been left without anything.\n\n\n\n\n\nWith high temperatures, low humidity, and strong, unpredictable winds complicating the job of emergency responders, one local official says some of the fires could have been started by arsonists.\n\n\n\n\n\nHigh temperatures are causing havoc across Europe, with fires reaching as far north as the Scottish capital.\n\n\n\n\n\nWildfire broke out on Arthur's Seat, overlooking Edinburgh, with smoke seen for miles in the distance.\n\n\n\n\n\nThe extinct volcano is a popular walking trail and tourist attraction, known for its vantage point overlooking the city, with motorists and pedestrians are being advised to avoid the area.\n\n\n\n\n\nIn Italy, Mount Vesuvius has been closed to tourists.\n\n\n\n\n\nSix aircraft and more than 100 firefighters and volunteers were called in to battle the blaze, which has been tearing through the national park since Friday.\n\n\n\n\n\nFrancesco Ranieri is the mayor of nearby Terzigno.\n\n\n\n\n\nHe says the area is resilient.\n\n\n\n\n\nITALIAN THEN ENGLISH VO: “We hope that today will finally mark the end of this new devastation, this new attack on Vesuvius. Unfortunately, the damage to nature, vegetation and that greatness was already visible this morning, but it will certainly continue to exist because we will rise again in our pine forest. It was truly a ghostly image, but as I have reiterated, we will rise again because we have been reborn many times and we’ll be reborn together with our wonderful pine forest.”\n\n\n\n\n\nEurope's record-breaking weather is catching many by surprise.\n\n\n\n\n\nExperts say European countries are becoming ever more vulnerable to wildfires due to intensifying summer heatwaves linked to global warming.\n\n\n\n\n\nSpain's state meteorological agency has issued a severe, high temperature warning with heatwave conditions expected to last until at least Thursday.\n\n\n\n\n\nTourists, like this one, say they've never experienced heat like this before.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/craig-foster-joins-mohamed-salah-in-criticising-uefa-tribute-to-star-palestinian-footballer/8nfpt5t20",
    "title": "Craig Foster joins Mohamed Salah in criticising UEFA tribute to star Palestinian footballer",
    "publish_date": "Mon, 11 Aug 2025 04:49:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Socceroo captain Craig Foster has added his voice to criticism of European football's governing body UEFA following the death of Palestinian player Suleiman al-Obeid in Gaza.\n\n\n\n\n\nIn a post on Instagram on Monday morning, the former player and human rights activist accused UEFA of \"eating at the finest restaurants\" while Palestinian football players are killed. He also called on UEFA and FIFA, the global football body, to ban Israel from competing at an international level.\n\n\n\n\n\n\"While Suleiman had to beg for food, almost an entire league of Palestinian players have been killed,\" Foster wrote on social media.\n\n\n\n\n\n\"Sport plays an important role in withdrawing legitimacy from any state committing genocide and apartheid, and every player, former player and fan should be speaking out.\"\n\n\n\n\"The ball represents the globe, it is the people's game, and everyone in it must share the same rights\".\n\n\n\n\n\nFoster joins the likes of Egyptian football superstar Mohamed Salah in criticising the football body's tribute to the player, who the Palestinian Football Association said was killed last Wednesday by Israeli forces while waiting near an aid distribution centre in southern Gaza.\n\n\n\n\n\nReuters reported his family said he was killed by a tank shell.\n\n\n\n\n\nThe Israeli government, backed by the United States, fiercely denies the charge and says it is fighting to defeat Hamas and to bring back Israeli hostages still held in Gaza.\n\n\n\n\n\nIn June 2024, the ICJ found that Israel's occupation of Palestinian territories and settlements is illegal and should be withdrawn as soon as possible. Israeli leaders argue the territories are not occupied in legal terms because they are on disputed lands.\n\n\n\nWho was Suleiman al-Obeid?\n\nA star player, al-Obeid scored more than 100 goals in his career, earning him the nickname the 'Pelé of Palestinian football' — in reference to the legendary Brazilian goal-scorer.\n\n\n\n\n\nAccording to Al Jazeera, al-Obeid started his career at the Khadamat al-Shati club in Gaza before joining the Al-Amari Youth Centre Club in the occupied West Bank. He played 24 international matches, and gained international recognition after scoring a scissor kick goal against the Yemeni national team in the 2010 West Asian Football Federation Championship.\n\n\n\nAl-Obeid leaves behind a wife and five children.\n\n\n\nMohamed Salah speaks out\n\nFollowing al-Obeid's death, UEFA posted a tribute on X calling him: \"A talent who gave hope to countless children, even in the darkest of times.\"\n\n\n\n\n\nThis was re-posted by Liverpool star Mohamed Salah, who asked: \"Can you tell us how he died, where, and why?\"\n\n\n\n\n\nSalah, 33, has more than 19 million followers on X. The post received 1.3 million likes and more than 100 million views.\n\n\n\nUEFA has not responded to the post.\n\n\n\n\n\nIsraeli military spokesperson Lieutenant Colonel Nadav Shosain replied to Salah: \"Hey Mohamed, after an initial review, we found no records of any incidents involving Suleiman al-Obeid. In order to take a closer look, we need more details.\"\n\n\n\nFootballers killed in Gaza\n\nAccording to the Palestinian Football Association, 662 athletes and their family members have been killed in Gaza since 7 October 2023. Of those, 421 were footballers, and 103 of those were children.\n\n\n\n\n\nMore than 1,300 Palestinians have been killed at aid distribution points managed by the Gaza Humanitarian Foundation since 27 May, according to the United Nations.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/rba-meeting-why-economists-and-the-major-banks-are-predicting-a-rate-cut/f8zg0d640",
    "title": "RBA meeting: Why economists and the major banks are predicting a rate cut",
    "publish_date": "Mon, 11 Aug 2025 02:45:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "With the Reserve Bank of Australia (RBA) set to announce the new cash rate target on Tuesday, many economists and the big four banks are anticipating a rate cut of 0.25 percentage points.\n\n\n\n\n\nIt could be welcome news for mortgage holders, who were left in limbo after the RBA kept rates on hold at 3.85 per cent at its last meeting.\n\n\n\n\n\nSo why are economists saying a reduction to 3.6 per cent is a done deal, and how much could you save?\n\n\n\n'No reason to wait'\n\nDavid Bassanese, chief economist at fund management firm Betashares, told SBS News he is predicting a rate cut at the RBA's meeting.\n\n\n\n\n\nHe said he would be \"staggered\" if the RBA does not cut the rate, \"given signs of a softening labour market and a good Q1 CPI [quarter one consumer price index] report\".\n\n\n\n\"I expected them to hold off on the cutting rate in July, but I see no reason to wait now,\" Bassanese said.\n\n\n\n\n\nAfter previous rate cuts, the big four banks have passed on reduced rates for mortgage holders with variable loans.\n\n\n\n\n\nFinancial comparison site Canstar predicted an owner-occupier on a $500,000 loan could save around $75 per month following a 0.25 percentage point cut.\n\n\n\n\n\nThe larger the loan, the greater the savings.\n\n\n\nAn owner-occupier on a $500,000 loan could save around $75 per month following a 0.25 per cent rate cut, according to Canstar. Source: SBS News Devika Shivadekar, an economist at financial services firm RSM Australia, told SBS News an official rate cut this week should create optimism, with further relief expected in the coming months.\n\n\n\n\n\n\"Last month's quarterly Consumer Price Index print likely provided the RBA with some comfort leading into this week’s meeting, and we expect to see the cash rate cut by 0.25 per cent to 3.6 per cent,\" she said.\n\n\n\n\n\nThe 'big four' banks are all predicting a rate cut on Tuesday, with Westpac predicting a total of four cuts this financial cycle, in August and November, and again in February and May, taking the cash rate to 2.85 per cent.\n\n\n\nThe 'big four' banks are all predicting a rate cut on Tuesday. Source: SBS News Commonwealth Bank and ANZ are estimating a 0.25 percentage point cut in August and another in November, taking the cash rate to 3.35 per cent, while NAB is forecasting 0.25 percentage point cuts in August and November, and another in February, taking the cash rate to 3.10 per cent.\n\n\n\nWhat does it mean for businesses?\n\nShivadekar said cash rate decisions can have a profound impact on businesses, with large investments and other buying decisions linked closely to RBA movements.\n\n\n\n\n\n\"Uncertainty over US tariffs has left Australian companies, particularly small and medium-sized enterprises, battered and bruised in recent months.\n\n\n\n\n\n\"Data on business performance is mixed, with larger players faring better in this environment than their smaller peers. Overall, though, the global volatility we've seen in the second quarter has weighed on investment decisions.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-expert-says-the-trump-putin-summit-is-an-alarming-development/aag4uwric",
    "title": "INTERVIEW: Expert says the Trump-Putin summit is an 'alarming development'",
    "publish_date": "Sun, 10 Aug 2025 23:28:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/culture/music/judy-bailey-pioneering-woman-of-australian-jazz-dies-at-89-20250811-p5mm34.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Judy Bailey, pioneering woman of Australian jazz, dies at 89",
    "publish_date": "Tue, 12 Aug 2025 12:08:26 +1000",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "As a youngster, Judy Bailey usually heard classical or pop music coming from the cream-coloured Bakelite radio on the Formica kitchen bench of her family’s home in Whangarei, New Zealand. But on this particular afternoon, her 13-year-old ears heard something new. She recognised the song, East of the Sun, yet after the melody the band seemed to be making up the music as they went. In her three years studying classical piano with the local nuns, they’d never mentioned improvising.\n\nBailey, who died on August 8 aged 89, was instantly enthralled, and when what turned out to be the George Shearing Quintet had finished, she dashed to the piano, and worked out that the made-up music was happening over the song’s chords. A week later, the Stan Kenton Orchestra gave her an even bigger thrill, the thought of which still gave her tingles decades later. It was to set the course for the rest of her life.\n\nBailey was born in Auckland on October 3, 1935, forsaking ballet for classical piano at the age of 10. A pioneer of women’s participation in Australian jazz, she was a lyrical, imaginative and swinging jazz pianist, a composer and arranger of note, and an educator with a profound influence on three generations of Sydney Conservatorium students.\n\nJudy Bailey in 2009 at El Rocco Bar, Kings Cross. Credit: Marco Del Grande\n\nAt 14, she began regularly accompanying a singer on Radio Northland, through which she met twins Peter and Paul Newbury. When they weren’t helping out at the family undertakers business, they ran an acrobatic troupe – yes, really – for which Bailey, 10 years their junior, became musical director.",
    "source": "TheAge",
    "cluster_id": 39
  },
  {
    "url": "https://www.theage.com.au/business/companies/the-photo-that-shows-how-trump-puts-his-ego-ahead-of-america-s-future-20250811-p5mlud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The photo that shows how Trump puts his ego ahead of America’s future",
    "publish_date": "Tue, 12 Aug 2025 11:57:00 +1000",
    "category": "finance",
    "authors": [
      "Matthew Yglesias"
    ],
    "text": "No matter. To Trump, the important thing is announcing these pledges, not enforcing them. During his first term, there was an infamous vaporware investment from Foxconn in Wisconsin that never amounted to anything. The real benefit to the president is the sycophantic photo op, when the chief executive smiles for the cameras and praises Trump’s dealmaking prowess.\n\nIn related news, Apple chief executive Tim Cook went to the White House last week to give President Donald Trump a large piece of gold. In exchange, Trump said that Apple would be exempt from a new 100 per cent tariff the US is imposing on imported microchips. Officially, Apple gets the exemption because it committed to making a $US100 billion ($153.5 billion) investment in the US. Apple had already announced earlier this year a $US500 billion investment program, which itself was a modest expansion of previous plans.\n\nOne of the most provocative items in my wardrobe is a plain dark T-shirt designed by a libertarian economist. In 10 lines across the front, it reads: “Tariffs not only impose immense economic costs but also fail to achieve their primary policy aims and foster political dysfunction along the way.”\n\nA flat tariff instituted for the purpose of raising revenue would, whatever its downsides, basically be just a peculiar form of tax. But tariffs are almost invariably marketed as having strategic or economic-development benefits. And that leads to exemptions. The chip tariffs are supposed to foster the growth of an electronics manufacturing industry in the US. But because chips are an input into other manufactured goods, the tariffs could easily backfire. So if you can convince the president that you are in fact making investments in manufacturing in the US, you can get an exemption from the tariffs.\n\nLoading\n\nThe problem here — and with the dozens of other exemptions and waivers baked into Trump’s various tariff announcements — is that there is no objective criteria or process at work. Who gets exemptions, and who does not, is almost entirely up to the whims of Trump and his appointees. This in turn raises the question of whether his primary policy aim isn’t just to maximise his own power and influence.\n\nCook, for example, used to be a somewhat vocal advocate of LGBT rights. He’s always been, first and foremost, a corporate executive. But he would occasionally take advantage of America’s status as a free country to speak his mind about political issues.\n\nThat could now be a risky business proposition, because the viability of Apple’s business hinges on not just its ability to keep making products people want to buy, but its ability to secure tariff exemptions. Other tech executives, such as Jeff Bezos, have also erred on the side of reticence: While he wants his newspaper to support and defend personal liberties and free markets, the company he founded backed down from a plan to list explicit tariff surcharges after facing pressure from the White House.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/rba-expected-to-hand-down-rate-cut-20250812-p5mmbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "RBA expected to hand down rate cut",
    "publish_date": "Tue, 12 Aug 2025 11:53:12 +1000",
    "category": "finance",
    "authors": [],
    "text": "RBA expected to hand down rate cut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/snoop-dogg-to-headline-afl-grand-final-day-20250812-p5mmbk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Snoop Dogg to headline AFL grand final day",
    "publish_date": "Tue, 12 Aug 2025 11:52:00 +1000",
    "category": "sports",
    "authors": [],
    "text": "Snoop Dogg to headline AFL grand final day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/afl/if-you-want-romance-pay-for-it-why-the-afl-s-father-son-rules-should-change-20250812-p5mm8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "If you want romance, pay for it: Why the AFL’s father-son rules should change",
    "publish_date": "Tue, 12 Aug 2025 11:50:01 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "St Kilda supporters just have to take it on trust that watching a father-son selection run around for the team their dad played for is enjoyable.\n\nThey haven’t had that luxury since Bailey Rice played the last of his 11 games with the club in 2018, just the second father-son selection to play in a St Kilda jumper.\n\nTheir main memory of father-sons is Geelong’s Gary Ablett jnr and Matthew Scarlett combining in the defining moment of the 2009 grand final to sink the Saints.\n\nSam Darcy looks good in a Bulldogs’ jumper, but should he have cost the club more? Credit: Getty Images\n\nAlthough it’s a much-loved feature of the game and one that could be preserved in some form, the current father-son rules are distorting competitive balance too much to survive.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/environment/sustainability/blue-mountains-residents-could-reduce-pfas-by-donating-blood-gps-told-20250725-p5mhrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "More than 20 new ‘forever chemicals’ found in Sydney tap water",
    "publish_date": "Tue, 12 Aug 2025 11:46:56 +1000",
    "category": "lifestyle",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "PFAS are a family of synthetic chemicals prized for their resistance to heat, grease and water, and used in a wide range of everyday products such as stain-resistant fabrics, cleaning products and firefighting foams. Now found in the blood of almost every Australian, they are often dubbed “forever chemicals” because they don’t break down naturally, and can persist in the environment and human body for decades. In 2024, the US Environmental Protection Agency concluded that PFAS were “an urgent threat to public health and the environment” and exposure to certain PFAS posed “significant risk to human health, including cancer, even at very low levels”. The agency imposed stricter PFAS limits for US drinking water, which have been maintained under the Trump administration, and recommended blood testing for people with occupational exposure or who live in contaminated areas. NASEM has also found that certain PFAS, specifically PFOA, are carcinogenic to humans, while the International Agency for Research on Cancer (IARC) has classified PFOA as carcinogenic to humans and PFOS as possibly carcinogenic. In the webinar, Buckley said the NASEM guidelines on sensible screening for an individual were “pretty terrible” and described IARC as “just some subgroup of the WHO”, not the World Health Organisation itself. Buckley chaired the expert health panel for PFAS for the Australian government in 2018. He told the webinar he had looked over the state of research since then, and “not much” had changed.\n\nLoading Dr Nicholas Chartres, a senior research fellow in the school of pharmacy at the University of Sydney who viewed the webinar, told this masthead it would have been most appropriate for the NSW Health webinar to present the findings of the US EPA and NASEM reviews alongside the IARC evaluations. “Government advice should not rely on individual experts, but rather rigorous, transparent reviews that reflect the most current science, when available,” he said. NASEM’s review was more rigorous and up-to-date than the 2018 Australian panel, Chartres said, taking in the 139 human studies that had been published since then. A NSW Health spokesperson said the webinar was to support local clinicians to provide information and give them a chance to share case studies and ask questions.\n\nSTOP PFAS convener Jon Dee in Leura. Credit: Sitthixay Ditthavong Jon Dee, from Blue Mountains community group STOP PFAS, said: “The PFAS in our drinking water was an Erin Brockovich-level contamination, yet NSW Health is downplaying this and ignoring a huge amount of international evidence about PFAS health risks.” Blood donations Buckley told the webinar about a third of PFAS in a human body would be in the blood stream, and if individuals were concerned about their PFAS levels and wanted to be proactive in lowering it, they could consider donating blood. “If you quietly said ‘you’re welcome to give blood and you will get rid of 3 per cent of the PFAS in your body every time you give blood’, I actually think it’s not a bad idea”, Buckley said. He added that it was “a futile exercise … at one level” because it would not deliver health benefits, and it could cause mixed messages and concerns about the blood supply.\n\nJones told the webinar she disagreed with blood donation to lower PFAS because it could cause persistent anaemia and there was “no proven causality between PFASes and adverse health effects”. Loading A randomised clinical trial of 285 Victorian firefighters in 2019 found donating blood lowered PFAS levels, while the PFAS Health Study at the Australian National University has identified menstruation as one of the reasons why PFAS levels are lower in Australian women than men at population level The expert panel findings released on Tuesday said, “interventions that reduce blood PFAS are of uncertain benefit and may cause harm”. Sydney tap water\n\nResidents in the Blue Mountains have been exposed to high levels of PFAS, especially PFOS from firefighting foam, in drinking water for at least 17 years and probably up to 32 years. Water with PFAS levels above safe limits had been supplying 78,000 residents from Mount Victoria to Glenbrook, according to Sydney Water, until the pipeline to a contaminated dam was disconnected last year. Last week, the NSW Environment Protection Authority put out a warning that people should limit their consumption of fish from Wentworth Falls Lake to one serve of redfin perch per week and all other fish species to two serves a week because of the results of testing of surface water and fish for PFAS. Peter Morse, a master fly casting instructor, was out at Wentworth Falls Lake on Monday honing his skills. He said he never catches fish in the lake mainly because of concerns about urban run-off from nearby houses, but noted the lake was stocked with trout annually and they were always fished out by the end of the season. “It’s a popular spot for kids in the mountains to go fishing, and I suspect if they catch a trout, they’re going to take it home for mum to cook,” Morse said. On Tuesday, University of NSW researchers released their findings of PFAS testing in Sydney tap water in 2024, with an article published in the journal Chemosphere. The samples were analysed per drinking water catchment and found to be highest around North Richmond, potentially because of contamination from the air base.\n\nThey found a total of 31 PFAS types in Sydney tap water, including 21 not previously detected. The detected PFAS included 3:3 FTCA, thought to be only the second global detection in any drinking water supply, and 6:2 diPAP, previously found in bottled water and now detected in tap water for the first time. Lead researcher Professor William Alexander Donald said the health effects of 3:3 FTCA were unknown, but there was some evidence to suggest that 6:2 diPAP caused thyroid and reproductive issues. The National Health and Medical Research Council updated the Australian drinking water standard in June, covering five main types of PFAS. The UNSW team found PFOS in Sydney tap water at 6 parts per trillion, which is below Australian limits but above the US standard. Donald said one of the most interesting findings was that Sydney tap water had high levels of PFBA, a short-chain PFAS that is being used as a replacement for the banned substances, PFOS and PFOA.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-macron-praises-albanese-after-revealing-palestine-recognition-plans-trump-praises-respectful-putin-ahead-of-crucial-meeting-20250812-p5mm75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Macron praises Albanese after revealing Palestine recognition plans; Trump praises ‘respectful’ Putin ahead of crucial meeting",
    "publish_date": "Tue, 12 Aug 2025 11:45:37 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Australians are likely paying more than is needed for domestic travel as airlines fail to provide enough seats, says the nation’s top industry regulator.\n\nThe number of seats flown by major airlines in June was 2.8 per cent lower than in June 2019, even though Qantas, Jetstar and Virgin have all increased capacity since then, the Australian Competition and Consumer Commission said.\n\nQantas and Virgin planes on the tarmac at Sydney Airport. Credit: Oscar Colman\n\nDomestic airlines still haven’t filled the hole left by Tigerair’s exit in 2020, nor made up for capacity loss on major routes caused by Rex Airlines’ fall into administration.\n\n“The lack of growth in seat capacity to meet rising demand has likely meant consumers are paying more than they would have in a more competitive, better-supplied market,” the ACCC said in its Domestic Airline Competition report.\n\nThe average revenue per passenger in June 2025 was 0.8 per cent higher than in June 2024 even with the 12.3 per cent drop in jet fuel prices over the same period.\n\n“Jet fuel is a significant contributor to an airline’s operating costs,” the ACCC said, noting that it usually accounts for between 15 per cent and 25 per cent of an airline’s costs.\n\nThe update from the ACCC comes six weeks after Virgin relisted as a public company – “a development that was important for preserving competition and protecting consumer interests in the Australian aviation market”.\n\nHowever, the ACCC believes Virgin’s return to the stock market “is unlikely to significantly affect the competitive dynamics between major airline groups over the short to medium term”.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/hannah-ferguson-wants-rupert-murdoch-to-know-her-and-hate-her-her-ambition-doesn-t-end-there-20250616-p5m7mx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hannah Ferguson wants Rupert Murdoch to know her (and hate her). Her ambition doesn’t end there",
    "publish_date": "Tue, 12 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Josefine Ganko"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the election cycle just past, social media commentator Hannah Ferguson was everywhere. The 27-year-old interviewed the prime minister, found herself at the centre of media storms, went viral multiple times, and delivered an election post-mortem at the National Press Club. I see her multitasking in action when, halfway through our lunch at A.P. Bread & Wine, a waiter stops to clear Ferguson’s empty plate. I look down to see my barely touched meal and wonder how this is possible, given that Ferguson has been doing almost all the talking. I hadn’t even noticed Ferguson chowing down on her “leftover bread pasta”. She talks quickly and rarely hesitates, even when I push back on her answers or delve into more controversial topics. Admittedly, “The All Purpose” platter I ordered is large, and I am known to eat at a leisurely pace, but I’m still bemused by how Ferguson’s ability to do it all at once is a pleasing metaphor for her last six months. When we meet in mid-June, Ferguson’s finally had some time to breathe after a manic period of work that was bookended by the US election and hosting British author Dolly Alderton at the Sydney Opera House on one end, and the Australian federal election and announcing her plans to run for the Senate on the other. Already beloved among progressive Gen Z women, Ferguson burst into Australia’s broader public consciousness this year. While her loyal left-wing fan base expanded, so did her pool of detractors. She’s reached the milestone of being well-known enough to be the sole target of hit pieces in The Australian and diatribes on Sky News. “It’s actually shocking to me to look back,” Ferguson tells me. “I feel like I’ve cracked through five ceilings in five months.”\n\nAdvertisement\n\nOn October 31, 2022, Ferguson celebrated the second anniversary of her progressive social media platform, Cheek Media, with a message to her followers, posted (of course) to Instagram: “I won’t sleep until I can confirm that Rupert Murdoch knows me and hates me,” it read. Having launched the feminist platform in 2020 with two friends, primarily to call out media reporting of domestic and sexual violence, Ferguson had since taken the project solo. A.P. Bread & Wine’s left-over bread pasta. Credit: Dominic Lorrimer When Cheek hit 50,000 followers in 2023, a book deal emerged that allowed Ferguson to quit her job, move to Sydney and run the platform full-time. The book that resulted is Bite Back, an homage to the promise contained in Cheek’s tagline: “News that bites back.” “The idea is that we can respond and say, ‘No, no, we’re cutting through the noise’. Young people see through this, and we want something different,” Ferguson says. It quickly grew into a platform for Ferguson’s political commentary, delivered in tweet-sized text snippets or vertical video. (While Cheek is a popular Instagram news source, Ferguson’s always insisted she’s not a journalist.)\n\nAdvertisement\n\nCheek is now nearing the 200,000 follower mark on Instagram, after a huge six months that saw more than 50,000 new followers join to hear Ferguson’s commentary in the lead-up to the election. Her podcast, Big Small Talk, co-hosted with Sarah Jane Adams, regularly features in Australia’s top 50 on Spotify, and Ferguson has announced a national tour. A little less than three years after her bold Rupert Murdoch claim, it’s impossible to say if the media mogul knows Ferguson’s name, but she’s certainly caught the attention of the mainstream political establishment and the ire of the mastheads and networks Murdoch owns. On June 6, The Australian ran an opinion piece about Ferguson with the headline “Progressive ‘girlboss’ preaches diversity – but champions conformity”. Days earlier, Sky News presenter Chris Kenny said her address to the National Press Club included “plenty of the usual extreme-left bile”. In that May address, Ferguson articulated the same goal she had in 2022: to be an “antidote” to the “Murdoch media”. Is it overly ambitious for a 26-year-old in Sydney to take on arguably the world’s most powerful media figure (the industry’s biggest “influencer”, one might say)? Maybe, but unbridled ambition and barefaced confidence are Ferguson’s signatures. Ferguson grew up in a working-class conservative household, moving from Orange to south-west Sydney and back again during her childhood. Her dad is a truck driver, now based in Queensland, and her mum still lives in regional NSW, running a small bra fitting business.\n\nAdvertisement\n\nAged 13, Ferguson recalls how her parents’ critique of Julia Gillard’s 2012 misogyny speech didn’t sit right. “I remember thinking, ‘They’re not making fun of her policies. They’re making fun of the way she speaks, and her haircut’.” As Ferguson grew up, she developed political views that were at odds with her parents’, but still credits them with allowing for the robust debate that helped form her point of view. “The reason I am progressive is that my parents always treated me like a small adult. I was allowed to ask any question.” The “All Purpose platter”, which also comes with an A.P Bakery croissant. Credit: Dominic Lorrimer Ferguson received a scholarship to study law at the University of Queensland, where her political perspective was shaped further by the privilege she observed in the “stuffy” law school culture. Early work experiences at Queensland’s Department of Public Prosecutions and the Electrical Trades Union provided a conviction in those beliefs that rears its head again and again through Ferguson’s career. “I was negotiating with BHP, with Rio, with Qantas. That’s a wild thing to be able to say at 23,” Ferguson recalls of her time at the union. “I think that really reflects what I do now in that I don’t really doubt that I’m welcome at these tables and that I can say something.”\n\nAdvertisement\n\nWith Cheek, Ferguson is delivering content for mostly young, mostly female progressives who aren’t necessarily highly engaged in the political process but who agree with her worldview and care about the news. One 24-year-old fan I spoke to said she valued how Ferguson broke down big concepts and explained the impact of the news on society at large. “I came to Hannah because I agree with her, and there aren’t many people that I feel represented by in the media in terms of that worldview,” she told me. Cheek has a squarely political focus, but often uses memes and humour to deliver its message, while Big Small Talk is a hybrid pop culture-politics podcast that gives equal airtime to the top political stories and the latest celebrity news. Hannah Ferguson is the de-factor leader of the “new media” movement, having propelled into the nation’s attention during the 2025 federal election. Credit: Dominic Lorrimer “The joke is putting the dog’s medicine in peanut butter,” Ferguson says, explaining that despite being highly engaged, many Gen Zers are put off by traditional media’s approach to politics. There’s no doubt that their media habits are changing. Over the past year, the number of Australians accessing news via social media overtook online websites, with Instagram being the primary news source for 40 per cent of people aged 18-24, according to the University of Canberra’s latest Digital News Report. Ferguson puts that down to mainstream outlets’ failure to connect with young people, and in her typically confident way, she stood up at the National Press Club and said as much to a room full of newspaper and TV journalists.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/springboks-roll-out-alpha-move-on-wallabies-by-naming-side-three-days-early-20250812-p5mm92.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Springboks roll out alpha move on Wallabies by naming side three days early",
    "publish_date": "Tue, 12 Aug 2025 11:45:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "He doesn’t quite know all their names but Springbok coach Rassie Erasmus is wary of the Wallabies’ threats ahead of the Rugby Championship opener in Johannesburg on Sunday morning.\n\nErasmus talked up the Wallabies’ scrum and aerial potency after unveiling a strong team for the Ellis Park showdown, and in an unprecedented sign of confidence, named his side on Monday – three days ahead of the deadline.\n\nMost coaches jealously guard their team until forced to name it 48 hours before the Test, to minimise the preparation time for rivals. But in a sizeable flex, Erasmus is not stressed about the Wallabies knowing what’s coming.\n\nThere is no Cheslin Kolbe, as he returns from injury, and no bomb squad on the bench – yet – but that’s about the extent of the good news for Australia, with Erasmus rolling out 18 World Cup winners in his 23-man match day squad.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/red-alert-rugby-to-use-mouthguards-that-flash-after-heavy-impacts-20250812-p5mm7m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Red alert: Rugby to use mouthguards that flash after heavy impacts",
    "publish_date": "Tue, 12 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Charlie Morgan"
    ],
    "text": "Smart mouthguards that flash red to highlight significant head impacts will be used at the Women’s World Cup later this month.\n\nThe initiative from World Rugby is a progression of technology that was first brought to matches in 2021 and has been steadily developed since. LED mouthguards were trialled successfully in Major League Rugby and in the Under-20 World Championship this year, receiving the green light to be rolled out further.\n\nReferees will be asked to immediately stop the match upon seeing these clear mouthguards turn red as soon as a player experiences a certain level of force in a collision. An alert will still be sent to a match-day doctor via Bluetooth to warn of a possible concussion, but the hope is that another further visual cue enhances awareness.\n\nTypically, at the moment, a player will be brought off upon a natural break in play after their mouthguard has been triggered. It is hoped that the flashing LED will both save time and reduce doubt as to which collision caused the head impact.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/divots-fines-and-injuries-why-souths-fans-should-avoid-storming-field-if-johnston-breaks-record-20250812-p5mm8w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Divots, fines … and injuries: Why Souths fans should avoid storming field if Johnston breaks record",
    "publish_date": "Tue, 12 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Loading\n\nSouth Sydney fans are being urged not to storm the pitch if Alex Johnston breaks the game’s try-scoring record this weekend – because they will leave divots on the Allianz Stadium surface and may be fined.\n\nThe regular pooling of water and poor drainage at the Moore Park venue has come under fire from officials and players alike – and now it poses a health hazard for supporters who could be about to witness history when Souths play Parramatta on Saturday night.\n\nJohnston needs three tries to draw level with Ken Irvine’s long-standing record of 212 career tries, and four to set a new mark.\n\nThe winger has scored 16 hat-tricks in his career, including two matches where he scored five tries, and another game earlier this season when he bagged four.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/companies/star-seals-deal-to-sell-queen-s-wharf-casino-to-hk-partners-20250812-p5mmb7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star seals deal to sell Queen’s Wharf casino to HK partners",
    "publish_date": "Tue, 12 Aug 2025 11:38:41 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates",
      "Colin Kruger"
    ],
    "text": "Struggling casino operator Star Entertainment has rescued a deal to offload its troubled Brisbane resort to the Hong Kong-based business partners in this venture.\n\nThe publicly listed company has been locked in negotiations over plans to sell its 50 per cent stake in Brisbane’s Queen’s Wharf casino to Chow Tai Fook Enterprises and Far East Consortium, as it scrambles to reduce debt and survive a financial crunch.\n\nStar’s Queen’s Wharf Casino in Brisbane. Credit: Joe Ruckli\n\nStar had been unable reach an agreement with the parties before a key deadline two weeks ago, but on Tuesday it said it had entered into a $53 million binding deal.\n\nThe deal will see Star sell its share of Brisbane’s Queen’s Wharf casino to Chow Tai Fook Enterprises and Far East Consortium and hand Star ownership of properties at the Gold Coast casino.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/not-going-to-force-people-bleijie-ok-with-country-s-worst-flu-jab-rate-20250812-p5mmaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Not going to force people’: Bleijie OK with country’s worst flu jab rate",
    "publish_date": "Tue, 12 Aug 2025 11:34:02 +1000",
    "category": "lifestyle",
    "authors": [
      "Matt Dennien",
      "Courtney Kruk"
    ],
    "text": "The news\n\nQueensland Deputy Premier Jarrod Bleijie has declared he is happy with the state’s nation-trailing flu vaccination rate as hospitals struggle with a wave of infection.\n\nAnd after Premier David Crisafulli on Monday refused to say if he had personally had the vaccine, Bleijie echoed the comments, saying whether he had had a jab was “between me and my GP”.\n\nHe then went further.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/business/companies/seven-west-media-profits-crater-with-just-one-bright-spot-20250812-p5mm8r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Seven West Media profits crater with just one bright spot",
    "publish_date": "Tue, 12 Aug 2025 11:31:17 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Kerry Stokes-owned Seven West Media’s profits have suffered another steep fall, diving 63 per cent to just $16.6 million for financial year 2025, with its primary television business buckling under pressure.\n\nRevenue for the company, which is majority-owned by the billionaire and controls the Seven Network and The West Australian, dropped four per cent to $1.42 billion after its commercial deal with Meta ended, and because of an ongoing decline in free-to-air television advertising.\n\nKerry Stokes’ Seven continues to slide. Credit: Trevor Collens\n\nIt cut its total operating costs by two per cent and will again not pay a dividend to investors.\n\nSeven West chief Jeff Howard said there was “solid progress” made under the company’s new structure, which included earnings growth in the second half of the fiscal year.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/money/investing/going-through-divorce-don-t-assume-your-family-trust-is-impenetrable-20250723-p5mh60.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Going through divorce? Don’t assume your family trust is impenetrable",
    "publish_date": "Tue, 12 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "James Steel"
    ],
    "text": "If you have a family trust, it’s natural to assume it offers robust protection for the assets of the trust, even in the case of relationship breakdown.\n\nDon’t assume your trust is an impenetrable shield, as family courts in Australia have significant powers to look behind a family trust’s structure.\n\nWhen a relationship breaks down, seemingly protective structures such as family trusts can take centre stage. Credit: Suzanne White\n\nFamily trusts are a common feature in many people’s financial lives, to manage wealth, protect assets and plan for the future across generations.\n\nWhether established long before a relationship began, during it, or by parents and grandparents as part of their estate planning, family trusts are usually designed with deliberate intentions.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-simon-letch-20230608-p5df4g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest illustrations from artist Simon Letch",
    "publish_date": "Tue, 12 Aug 2025 11:21:36 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "The latest illustrations from artist Simon Letch\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  }
]