[
    {
        "url": "https://www.9news.com.au/world/trump-musk-feud-stephen-katie-miller-power-couple-split-by-divide/ec181edc-7994-49fe-9bd7-e37af01efd6b",
        "title": "The Washington power couple straddling the Trump-Musk feud",
        "publish_date": "Sun, 08 Jun 2025 00:59:02 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "They're the Washington couple at the centre of power in the Trump administration. They're also straddling opposing sides of an explosive breakup between US President Donald Trump and billionaire Elon Musk .\n\nCNN reported last week that Katie Miller, the wife of Stephen Miller, Trump's deputy chief of staff, would be departing her senior role at the White House as a top spokesperson and adviser for Elon Musk's Department of Government Efficiency.\n\nShe was on her way to work for Musk as he went back to running his companies, helping the tech titan manage and arrange interviews unrelated to his time in government.\n\nWashington power couple - Katie Miller and her husband Stephen Miller. (Tom Williams/CQ-Roll Call, Inc/Getty/CNN)\n\nBut days later, amid the smoldering ruin of Musk and Trump's epic meltdown on Thursday over social media, that job suddenly took on a whole new layer.\n\nAmong the attacks both men lobbed at each other was Musk endorsing the possibility of impeaching Trump and installing Vice President JD Vance in his place. Trump, in turn, raised the possibility of terminating federal contracts for Musk's companies.\n\nThe episode has left the Millers on conflicting sides of the biggest breakup of Trump's second term, spawning gossip among White House aides and rounds of speculation about how the fallout could impact the political fortunes of one of the most powerful couples in Trump's Washington, where loyalty reigns.\n\nElon Musk, centre, and Stephen Miller, right, during a meeting in the Oval Office in February. (Francis Chung/Politico/Bloomberg/Getty/CNN)\n\n\"Everyone is talking about it,\" a former Trump staffer told CNN.\n\nKatie Miller was in Texas last week for the series of interviews Musk held with space and technology journalists as SpaceX's Starship had its ninth test flight. It was there that Musk first delicately expressed he was \"disappointed\" in the Republican's domestic policy bill in an interview with CBS News.\n\nHer X account is now a steady stream of laudatory posts about Musk and his companies, with a banner photo of a SpaceX rocket launching into space and a biography that says, \"wife of @stephenm.\" Her only social media post on Friday was a reply with laughing emojis to an altered photo of her husband as a Home Depot employee attached to a post about immigration raids on the chain's stores.\n\nElon Musk and his son X Æ accompanied by Katie Miller at the US Capitol Building in May. (Andrew Harnik/Getty Images via CNN)\n\nOne former colleague told CNN that she will ultimately need to make a choice.\n\n\"She has a choice between Elon and Trump, but it can't be both,\" the administration official said.\n\nMusk unfollowed Stephen Miller on X on Thursday, although both Millers continued following Musk on the platform into Friday.\n\nThere are divided views on how the situation will impact Stephen Miller's ascendance.\n\nStephen Miller was a part of Trump's first administration. (AP)\n\nAmong Trump's closest advisers, many believe he is surpassed in power only by Chief of Staff Susie Wiles, fueling speculation among some over whether he could take over should Wiles decide to move on.\n\n\"This whole thing will definitely make that more complicated,\" one senior White House official told CNN.\n\n\"Katie being paid by Elon is not good for Stephen.\"\n\nAnother senior White House official strongly pushed back on the idea that this episode with Musk would impact Miller in any way with the President.\n\n\"Next to Susie, Trump trusts and relies on Stephen the most,\" the official said, adding that the President and top brass were understanding that his wife working for Musk had nothing to do with Stephen or the current state of events.\n\nKatie Miller declined to comment for this story.\n\nThe Millers attend a state dinner in Washington to honour then-Australian Prime Minister Scott Morrison. (Alastair Pike/AFP/Getty Images via CNN)\n\nWhen Stephen met Katie\n\nDeeply connected and influential in Republican circles and at the highest levels of government, Stephen Miller and Katie Miller (née Waldman) met during Trump's first term in 2018. He was a senior adviser and speechwriter at the White House; she was on the Department of Homeland Security's public affairs team and on her way to becoming then-Vice President Mike Pence's communications director.\n\nHe developed a reputation as the architect of some of the administration's most hardline immigration policies, becoming an influential and trusted aide in the Trump orbit.\n\nShe developed her own reputation as a staunch supporter of those policies, once reflecting on a trip to the US-Mexico border as the administration came under fire for its child separation policy.\n\nConservative podcast host named as FBI deputy director under Trump View Gallery\n\n\"My family and colleagues told me that when I have kids I'll think about the separations differently. But I don't think so … DHS sent me to the border to see the separations for myself – to try to make me more compassionate – but it didn't work,\" Miller told NBC News journalist Jacob Soboroff in an interview for his book, \"Separated.\"\n\nThe pair married at Trump's Washington, DC, hotel in February 2020. Trump attended the wedding.\n\nIn the four years after Trump left office, both set their sights on a Trump return to the White House. Stephen Miller launched a conservative nonprofit group, America First Legal Foundation, that served in part as a prelude to the policy of Trump's second term.\n\nKatie Miller headed to the private sector, where she consulted a number of major companies, including Apple. They were also raising three young children.\n\nReturn to the White House\n\nStephen Miller returned to the White House in January with a vast mandate, deeply involved in many of the president's signature policy initiatives and further empowered from the first term. Katie Miller joined the administration as well, working on behalf of DOGE and Musk, who had become a new figure in the Trump orbit after being an active campaign surrogate and 2024 megadonor.\n\nLike Musk, Katie Miller was working at the White House as a \"Special Government Employee\", which limits the number of days one can work within the administration.\n\nAs their professional lives intertwined, the couple also became personally close with Musk, socialising outside of work.\n\nIn the heat of the Thursday afternoon social media showdown, Stephen Miller had been scheduled to appear on Larry Kudlow's show on Fox Business Network – an appearance that was canceled.\n\n\"We lost Mr Miller to a meeting in the Oval Office. Perfectly understandable. When I was in government, it would happen all the time. We'd have to kill a TV show. You're at the president's beck and call,\" Kudlow said during his eponymous broadcast.\n\nThis is not the first time Trump has divided a marital relationship. During his first term, Trump lashed out at the husband of one of his top advisers, Kellyanne Conway. Her husband, George Conway, had been intensely critical of Trump on social media.\n\n\"He's a whack job. There's no question about it. But I really don't know him,\" Trump said at the time of George Conway.\n\n\"I think he's doing a tremendous disservice to a wonderful wife.\"\n\nIn 2023, the couple announced they were filing for divorce.\n\nGeorge Conway, a prolific user of Musk's X platform and ardent anti-Trump figure, posted dozens of times about the Trump-Musk spat.\n\n\"Does anyone have any updates on Katie Miller?\" he asked Thursday evening.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jimmy-barnes-national-tour-kicks-off-adelaide-australian-rocker-reveals-word-not-in-his-vocabulary-exclusive/61979af3-12a5-4199-9260-2eb35125b25c",
        "title": "Jimmy Barnes reveals the word that's not in his vocabulary",
        "publish_date": "Sat, 07 Jun 2025 09:00:03 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "From a humble start to famous rocker, Jimmy Barnes has never been one to slow down.\n\nThe Australian icon will hit stage in Adelaide tonight to kick off a solo national tour in celebration of his 21st studio album Defiant .\n\n\"The name says it all, I've been defiant since I was a young man,\" he told 9News.\n\nThe Australian icon will hit stage in Adelaide tonight to kick off a solo national tour. (9News)\n\nBorn in Scotland and raised in Adelaide's northern suburbs, Barnes left his job with SA Railways at the age of 16 to form iconic Aussie rock band Cold Chisel.\n\nNow with millions of adoring fans around the globe, he has released 10 new songs still true to the working class man the world was introduced to half a century ago.\n\nMuch of his new solo album was written quietly in hospital as the rockstar battled various health complications over the past few years\n\n\"I was trying to write lyrics on my phone and a few melodies and ideas I had,\" he said.\n\n\"When I was singing in my phone, a couple of the nurses thought I was in pain.\n\n\"They wanted to come and calm me down. I was like 'it's ok, it's just the way I sing'.\"\n\nJimmy Barnes has millions of adoring fans around the globe. (Getty)\n\nBarnes has shown that you can't hold the iconic rocker down for long.\n\nThe singer embarked on Cold Chisel's triumphant 50 year anniversary tour last year, with a special final show in front of tens of thousands at the Adelaide 500.\n\nNow, he is back on home soil to shred the stage again.\n\n\"I just think it is really fitting,\" he said.\n\n\"After all that turmoil and health problems to come back and reset and to do it where I started is an incredible thing.\"\n\nBarnes is set to perform ﻿sold-out shows in Adelaide, Sydney and Canberra.\n\nFans can still secure tickets in Perth, Melbourne and Brisbane but the shows are selling fast.\n\n\n\nDespite a busy schedule, Barnes said retirement was not in his vocabulary as long as he had a voice.\n\n\"As long as I can sing, as long as there is an audience who wants to hear me sing and what I'm doing is relevant, I'm happy to do it,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/health-the-real-number-of-steps-you-need-to-do-to-lose-weight/60f5206d-644d-44a9-b237-546d7b0976b9",
        "title": "The real number of steps you need to do to lose weight",
        "publish_date": "Fri, 06 Jun 2025 21:07:57 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "In today's age of smartwatches and Fitbits, it's hard to go for more than a few hours without taking a sneaky peak at your daily step count.\n\nWhether it's the endorphin rush from the celebratory ping to inform you that you've hit 10,000 steps, or the nagging sense of shame that comes with the realisation you've done less than 2,000 – as happens on some of my busier days glued to my desk – step counts have become part of our lives.\n\nBut they're not just a gimmick.\n\nResearch is increasingly showing that your daily step count, especially when averaged out across months and years, makes a huge difference to your disease risk and how long you can expect to live. (Getty)\n\nResearch is increasingly showing that your daily step count, especially when averaged out across months and years, makes a huge difference to your disease risk and how long you can expect to live.\n\nAnd the case for not moving more makes for sober reading: according to the Government's official statistics, physical inactivity is responsible for one in six otherwise preventable deaths.\n\nMonitoring step counts makes it easier to track whether we're being active or not.\n\nBut while 10,000 is often seen as the magic number, it originates from a Japanese marketing campaign ahead of the 1964 Tokyo Olympics, rather than hard science.\n\nSo how can increasing your step count make a difference to your health and how do different thresholds reduce your disease risk?\n\nAnd, perhaps more importantly, what really is the optimal number you should be aiming to hit a day?\n\nWalk 2000-3000 to reduce your risk of heart disease\n\nTwo years ago, an international scientific collaboration published one of the largest studies so far to examine the long-term relationship between step count and health.\n\nCombining data from more than 111,000 individuals from various electronic health records, it indicated that the lower limit for health benefits lies in the range of 2,000 to 3,000 steps per day.\n\nThis equates to just over a mile of total walking from the moment you wake up to when you go to sleep.\n\nThe benefits appear most acute when it comes to heart health.\n\nPublished in the Journal of The American College of Cardiology , it suggested that between 2,517 and 2,735 steps per day already reduces risk of cardiovascular disease by 11 per cent compared to those who did just 2,000 steps.\n\nWhile 10,000 is often seen as the magic number, it originates from a Japanese marketing campaign ahead of the 1964 Tokyo Olympics, rather than hard science. (Getty)\n\nSimilar findings emerged from another study published last year by researchers at the University of Sydney.\n\nBased on data from more than 72,000 British people in their early 60s, it showed that anything beyond 2,200 steps per day will already make some difference to your heart health and even your short-term risk of dying from another cause.\n\nREAD MORE: Huge eruption in Italy leaves tourists fleeing volcano\n\n\"We ideally would want 8,000 to 10,000 steps a day, but for people who are inactive, that amount may seem like a mountain and unachievable,\" says Matthew Ahmadi, a researcher at the University of Sydney.\n\n\"It's about setting initial targets that are achievable, and then gradually working your way up to more daily steps as you build up your capacity to handle more activity.\"\n\nWalk 4000 steps to reduce your risk of dementia\n\nHitting 4,000 steps a day, based on the Sydney research, can reduce your risk of a premature death from any chronic disease by 20 per cent, particularly if you're middle aged.\n\nBut one of the most crucial things about reaching the 4,000-5,000 daily step count is that it starts to reduce your risk of cognitive decline.\n\nMan armed with plastic bags defies world's biggest army View Gallery\n\nThree years ago, a study of more than 78,000 Britons aged 40 to 79, who were regular smartwatch or Fitbit wearers, showed that 3,800 steps appears to be the minimum daily dose of exercise required to preserve your mental faculties.\n\nPeople who averaged this number of steps each day were found to have a 25 per cent lower risk of dementia compared with those who did less.\n\n\"This step count equates to roughly 35-45 minutes of light to moderate intensity walking per day, depending on your pace, which aligns well with [public health] guidelines,\" says Dr Borja del Pozo Cruz, a scientist at the European University of Madrid, who carried out the study.\n\n\"This is likely because of improved blood flow to the brain, reduced brain inflammation, better metabolism of glucose in the brain, and an increase in beneficial brain chemicals which stimulate neuron growth.\"\n\nWalk 7000 steps to lower your risk of depression\n\nThis seems to be the threshold at which the benefits become even more significant.\n\n7,000 steps are equivalent to just over three miles of walking, and it seems to be highly relevant for mental wellbeing.\n\nA new study published in December – which collated research from 33 different studies, comprising around 100,000 people – found that those who take 7,000 steps per day have a 31 per cent lower risk of depression.\n\n\"7,000 steps is starting to be considered a more active lifestyle, while less than 5,000 steps is a sedentary lifestyle,\" says Dr Bruno Bizzozero Peroni, a researcher at the University of Castilla-La Mancha who authored the study.\n\n\"It definitely seems that somewhere between 7,000 and 10,000 steps has a protective effect against depression, while at the moment there doesn't appear to be any evidence of additional benefits for mental health of doing more than 10,000 steps.\"\n\nAn average of 7,126 steps per day has also been shown to reduce risk of cardiovascular disease by 51 per cent, compared with people who did just 2,000 steps.\n\nSo do you really need to reach 10,000 steps per day?\n\nThis target which equates to around five miles of walking, or an hour and 40 minutes, if you were going to do the full amount of steps in one go can seem somewhat daunting. But as so often is the case in health and medicine, the answer is somewhat complex.\n\nAround 9,800 steps per day has been found in some studies to be the 'optimal dose' of exercise to lower risk of dementia.\n\nBut as with depression, it appears that you can still substantially reduce your risk of various chronic diseases, with a little less.\n\nFor example, some have found that approximately 8,800 steps per day reduces risk of premature death from a whole range of diseases by 60 per cent.\n\n\"More steps means better blood vessel function, less inflammation, and enhanced brain plasticity – the formation of new connections in the brain – which are crucial for cognition,\" says Dr Del Pozo Cruz.\n\nAll this means is that 10,000 steps is not necessarily the magic number after all. It appears that 9,000 is more than sufficient.\n\n7,000 steps are equivalent to just over three miles of walking, and it seems to be highly relevant for mental wellbeing. (Getty)\n\nHow many steps should I do a day to lose weight?\n\nLosing weight requires you to be in calorie deficit, so Dr Ahmadi points out that steps alone aren't sufficient, you also need to cut down on the amount you're consuming.\n\n\"However, what we do know is that activity can improve our cardiometabolic health even if you don't lose weight,\" he says.\n\nWhile research has shown that reaching 10,000 steps per day will increase your chances of losing weight, the more important aspect with weight loss is the intensity of exercise, not the number of steps.\n\nResearchers advise more vigorous intensity exercise but it doesn't have to be jogging or playing sport.\n\n\"You can get to vigorous intensity, just with brisk walking,\" says Catrine Tudor-Locke, a professor at the University of North Carolina at Charlotte. \"It doesn't have to be running.\"\n\nHow many calories will you burn while walking?\n\nWeight 2,000 steps 5,000 steps 7,000 steps 10,000 steps 54kg 50-60 calories 125-150 calories 175-210 calories 250-300 calories 70kg 70-80 calories 175-200 calories 245-280 calories 350-400 calories 84kg 80-90 calories 200-225 calories 280-315 calories 400-450 calories\n\nDoes walking burn a lot of calories?\n\nThis largely depends on your weight, as the more body fat you're carrying, the more calories you're likely to burn, as the body uses up more energy when it comes to moving additional weight stored in the form of fat tissue.\n\nHowever, the below represents a rough guide.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weather-cold-snap-to-envelop-southeast-states-this-long-weekend/dfaff66f-447b-408d-90e1-5089e0e53173",
        "title": "Thunderstorms, hail and snow to batter states this long weekend",
        "publish_date": "Fri, 06 Jun 2025 05:17:44 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "An icy combination of thunderstorms, hail and snow is set to envelop the south-eastern states this long weekend.\n\nA low-pressure system is driving a cool blast of air over New South Wales, the ACT, Victoria, South Australia and Tasmania from today through to the King's Birthday public holiday on Monday. ﻿\n\nIt will bring rain and hail ﻿over large parts of the states, according to Weatherzone.\n\nAn icy combination of thunderstorms, hail and snow is set to envelop the south-eastern states this long weekend. (Weatherzone)\n\nThe Bureau of Meteorology forecasts temperatures to fall to sub-zero in Canberra, four degrees in Hobart, six degrees in Adelaide and Melbourne and eight degrees in Sydney.\n\nThe cold weather, coupled with clouds and wind, will leave conditions feeling even cooler than forecast.\n\nIt will lead to some ﻿low-level to heavy snowfall in mainland alpine regions from tomorrow into at least Tuesday, according to Weatherzone.\n\n﻿The system is expected to deliver enough natural snow to start off the ski season in NSW, the ACT and Victoria this winter.\n\nREAD MORE: ﻿ Jury unable to reach verdict for brothers over fatal grand final fight\n\nTourists come across extraordinary sight at Uluru View Gallery\n\nMt Hotham﻿ is forecasting up to 60cm of snow, and Perisher is expecting 2cm.\n\nConditions will pick up in the south-eastern states tomorrow and move north on Sunday before beginning to clear on Monday.\n\nThe remaining states and territories will experience mostly dry conditions over the long weekend.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/playstation-unveils-new-hardware-and-games-at-state-of-play-event/85eadc52-6169-4399-94bb-1c02856bde68",
        "title": "New games and hardware unveiled by PlayStation",
        "publish_date": "Thu, 05 Jun 2025 02:49:55 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "PlayStation has shared their first State of Play since February, offering a fresh look at what's to come from Sony Interactive Entertainment and third-party publishers.\n\nThe showcase shared all things to come for the PlayStation 5, including new games and a surprise new hardware announcement.\n\nHere's the State of Play highlights:\n\nMARVEL Tōkon: Fighting Souls\n\nMARVEL Tōkon: Fighting Souls. (PlayStaion)\n\nMarvel heroes and villains come together for a new tag-team fighter developed by Arc System Works, developers of classic fighting game Guilty Gear . Play as Captain America, Spider-Man, Dr Doom and more. MARVEL Tōkon: Fighting Souls is coming to PlayStation 5 in 2026.\n\n007 First Light\n\n007 First Light. (IOI Interactive)\n\nThe creators of the Hitman series, IO Interactive, are developing a third-person action-adventure game that delves into a reimagined origin story for James Bond, portraying him as a 00-agent in training. 007 First Light is set to release next year.\n\nREAD MORE: New DOOM video game features medieval twist ﻿\n\nNioh 3\n\nKoei Tecmo and Team Ninja announced the latest installment in their dark action RPG series Nioh . There's a free limited-time demo on the PS store now.\n\nThen there there's the surprise hardware announcement — a modern arcade fighting controller:\n\n'Project Defiant' Wireless Fight Stick\n\nArcade wireless fight stick is coming to PS5 in 2026. (PlayStation)\n\nPlayStation unveiled its first wireless fight stick, designed for PS5 and PC, featuring ultra-low latency PlayStation Link technology. There's no pricing available or a release date, but it's expected in 2026.\n\nGhost of Yōtei\n\nA new teaser trailer for the game was shown and we were given news of more details to come. Next month PlayStation is hosting a deep dive in Ghost of Yōtei , with an extended look at gameplay. This hotly anticipated title from Sucker Punch is scheduled to release on October 2.\n\nAstro Bot\n\nAstro Bot is getting 5 new challenge levels. (PlayStation)\n\nFive new challenge levels are coming to Astro Bot , bringing the total number of levels to more than 90! More Astro Bot ? Yes please. An updated Limited Edition DualSense controller will also be released later this year with a \"twist\".\n\nREAD MORE: Astro Bot is a perfect blend of nostalgia and innovation ﻿\n\nBaby Steps\n\nBaby Steps. (Devolver Digital)\n\nWe finally have a release date for Baby Steps , a whacky and wild walking simulator from Devolver Digital. Look out for this one when it steps onto consoles and PC on September 8.\n\nMore from the PlayStation State of Play:\n\nLumines Arise – releasing in Spring this year.\n\nPragmata – coming to PlayStation next year.\n\nRomeo is a Dead Man – releasing next year.\n\nSilent Hill f – releasing on September 25.\n\nBloodstained: The Scarlet Engagement – releasing next year.\n\nDigimon Story Time Stranger – coming to consoles and PC on October 3.\n\nFinal Fantasy Tactics - The Ivalice Chronicles – coming to PlayStation on September 30.\n\nHirogami – releasing on September 3.\n\nEverybody's Golf Hot Shots – swinging onto PlayStation on September 5.\n\nNINJA GAIDEN: Ragebound – coming to consoles and PC on July 31.\n\nCairn – coming to PS5 on November 5.\n\nMortal Kombat: Legacy Kollection – coming after this year.\n\nMetal Gear Solid Delta: Snake Eater – releasing on August 28.\n\nThief VR: Legacy of Shadow – coming later this year to PS VR2.\n\nTides of Tomorrow – coming to PS5 on February 24, 2026.\n\nSea of Remnants – release date TBC\n\nSword of the Sea – coming on August 19 (day one on the PlayStation Plus Game Catalogue)\n\nFBC: Firebreak – coming on June 17 (day one on the PlayStation Plus Game Catalogue)\n\nPlayStation Plus also announced new additions:\n\nDeus Ex (PS2 version) joins the Game Catalogue on June 17, while Twisted Metal 3 and Twisted Metal 4 arrive in the Classics range on July 15.\n\nREAD MORE: Grand Theft Auto VI set to smash records ﻿\n\nThe most anticipated video games of 2025 View Gallery",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/pm-insists-biosecurity-is-first-priority-as-beef-tops-agenda-in-upcoming-us-trade-talks/61f0d34b-0310-497f-9397-3a0b527535c4",
        "title": "PM insists biosecurity is 'first priority' as beef tops agenda in upcoming US trade talks",
        "publish_date": "Fri, 06 Jun 2025 11:31:19 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Prime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are set to top the agenda in crucial talks with US President Donald Trump.\n\nTrump singled out Australia's ban on US beef during a Liberation Day tariff announcement in April , claiming ﻿Australia \"won't take any of our beef\" due to a concern over mad cow disease.\n\nCattle Australia disputes that claim﻿, because a ban on US beef was lifted in 2019, provided the cattle is born, raised and slaughtered in the US.\n\nPrime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are expected to top the agenda in crucial talks with US President Donald Trump. (9News)\n\nBut concerns over \"mixed herds\" mean beef from the US rarely makes it to Australian plates.\n\nUS exporters are currently unable to prove their herds don't include beef that was born in Mexico and Canada, which are still rated a biosecurity risk, then later slaughtered in the US.\n\n\"We haven't been assured there's a system that allows the appropriate tracing of animals﻿, or appropriate traceback of animals,\" Cattle Australia chief executive Dr Chris Parker said.\n\nA review is underway into whether that should change, which could be used as a bargaining chip for Trump to drop all tariffs against Australia.\n\n\"You shouldn't cut a deal at any cost, and particularly the cost of Australian biosecurity,\" Nationals leader David Littleproud said.\n\n\"This will decimate the agricultural sector if we blink and allow President Trump to be able to roll over us and our biosecurity standards.\"\n\nAlbanese today assured the industry he would not jeopardise biosecurity during upcoming negotiations.\n\nPrime Minister Anthony Albanese has vowed not to compromise biosecurity as trade negotiations over beef are expected to top the agenda in crucial talks with US President Donald Trump. (9News)\n\n\"Our first priority is biosecurity and there'll be no compromise on that,\" he said.\n\n\"If things can be sorted out, in a way that protects our biosecurity, of course, we don't just say no.\n\n\"I deal with ﻿people, whoever they are, in the same respectful way. I expect respect back.\n\n\"I'm the prime minister of Australia, we don't have a subservient relationship to any nation.\"\n\nAlbanese is expected to meet Trump face-to-face within the next two weeks, likely on the sidelines of the G7 meeting in Canada.\n\nThat meeting could make or break ﻿trade negotiations concerning several industries.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/coalition-sticks-to-3-per-cent-gdb-defence-spending-target/105390960",
        "title": "Coalition sticks to defence spending pledge but won't say how it'll pay for it",
        "publish_date": "Sun, 08 Jun 2025 01:25:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition remains committed to lifting defence spending to 3 per cent of GDP but won't detail where the money will come from, as the shadow finance minister suggested the opposition would be open to considering broader tax reform.\n\nPrime Minister Anthony Albanese is expected to have his first face-to-face meeting with Donald Trump on the sidelines of G7 summit next week, as the United States ramps up pressure on Australia to increase defence spending from the current level of about 2 per cent to to 3.5.\n\nTrade Minister Don Farrell on Sunday said the government was committed to a \"significant uplift in the amount of defence spending\".\n\n\"We're focused on what Australia needs to do and we'll make our decisions based on what's in our national interest,\" he told Sky News.\n\nTrade Minister Don Farrell says the government is committed to a \"significant uplift in the amount of defence spending\". (ABC News: Matt Roberts)\n\nThe Coalition went to the election promising to earmark an additional $21 billion for the military between now and 2030, almost double what Labor had pledged.\n\nAppearing on Insiders on Sunday, Shadow Finance Minister James Paterson said the Coalition's target of 3 per cent of GDP in a decade had not changed since the party's devastating election loss last month.\n\n\"The exact profiling of that increase is something that we'll determine through the policy process and closer to the next election. We'll be completely up front and transparent about that,\" he said.\n\n\"But yes, we have an objective of reaching the 3 per cent of GDP because we think it is in our national interest.\"\n\nSenator Paterson said the Coalition had three years to outline where that additional funding would go, but listed some potential areas for investment as recruitment and retention, a munitions stockpile, northern military bases, air and missile defence and drones.\n\n\"There is no shortage of good things we could spend on that would increase our ability to defend ourselves and safeguard our sovereignty,\" he said.\n\nBut he would not be drawn on where the money to pay for the increase would come from, saying that work would occur over the coming years.\n\nSenator Paterson did suggest the opposition was open to a discussion about the way superannuation is taxed, despite its rejection of the government's plan to double the tax on super balances above $3 million from 15 to 30 per cent.\n\nHow does Labor's new super tax work and why is it controversial? Photo shows A close-up of Jim Chalmers in front of a black background. The proposal to tax earnings for super balances over $3 million, including on unrealised gains, is the subject of renewed controversy following the federal election.\n\n\"We're happy to contemplate tax reform. We're happy to talk to the government about tax reform. But we are not interested in increasing taxes, because I don't think that that is what the Australian economy needs right now,\" he said.\n\n\"If the government was genuinely serious about a broad-based tax reform process, then we'd be up for that conversation. Now, the government has to take the first steps there.\"\n\nUS Defense Secretary Pete Hegseth asked Defence Minister Richard Marles to increase spending to 3.5 per cent of GDP \"as soon as possible\" on the sidelines of a dialogue in Singapore this week, according to a statement from the US Department of Defense.\n\nMr Hegseth had previously made similar requests, but it was the first time the administration nominated an exact figure.\n\nTrade on the agenda when Albanese meets with Trump\n\nMeanwhile, negotiations with the United States over Mr Trump's 10 per cent tariffs on Australian exports continue, with the subject likely to dominate the anticipated meeting between Mr Albanese and Mr Trump.\n\nAccess to Australia's critical minerals has been put forward as a potential bargaining chip, along with possible regulatory changes to beef imports, as Australia continues to push for an exemption.\n\nWhat purpose do critical minerals serve? Photo shows A person holds a handfull of ground nickel Australia is joining the European Union and the United States in establishing strategic reserves of critical minerals, but what do they actually do, and why are they so important?\n\nThe Coalition had previously said they would oppose Labor's plan to acquire stockpiles of critical minerals from commercial projects, to be held in a national reserve and made available to domestic industry and international partners.\n\nBut Senator Paterson on Sunday said it \"might be necessary\" for the government to support the mining and processing of critical minerals.\n\n\"We're very happy to see what the government is proposing here. I can't commit to it in principle without having seen the details, but we're certainly open to it,\" Senator Paterson said.\n\n\"Any sensible steps that represent an economic opportunity for Australia and an opportunity for us to demonstrate that we are a good alliance partner of the United States is something that we would offer bipartisan support to.\"\n\nMr Farrell said Australia had offered the United States \"an expanded arrangement in regards to critical minerals\" as part of efforts to secure an exemption from the tariffs, which came into force in April.\n\nThe trade minister met with his American counterpart, trade representative Jamieson Greer, in Paris last week, where he said he made clear that Australia wanted \"all of the tariffs removed, not just some of them\".\n\n\"The position I put to Jamieson Greer is that the tariffs the United States has imposed on Australia are unjustified.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/thornlie-cockburn-link-opens-as-part-of-metronet-project/105386618",
        "title": "Perth's first east-west rail connection opens after 18 months of disruption",
        "publish_date": "Sun, 08 Jun 2025 01:17:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 18 months of disruption is coming to an end for some commuters as Perth's first east-west rail connection opens this week to service communities from Mandurah to Armadale.\n\nThe Thornlie-Cockburn link and adjacent rail elevation are part of WA Labor's flagship infrastructure project Metronet.\n\nCommuters test out the new Thornlie-Cockburn train line. (ABC News: Cason Ho)\n\nThe developments, in Perth's south east, feature a $1.3 billion rail extension with two new stations connecting Thornlie to Cockburn Central, and a $1.6 billion elevation of five stations and rail from Carlisle to Beckenham.\n\nThe elevation is hoped to address road congestion — with the state government previously saying boom gates were down for up to six hours a day at some level crossings — and open up public spaces around and under the rail line.\n\nStations and railway were elevated to remove six level crossings along the Armadale Line. (ABC News: Cason Ho)\n\nTransport minister Rita Saffioti said despite cost and time blowouts, the level of infrastructure delivered through the Metronet project was \"unprecedented\".\n\n\"Generational infrastructure is hard,\" Ms Saffioti said.\n\n\"These projects are really for the public. They're about the future and they're about making transport even more affordable and accessible.\"\n\nTransport Minister Rita Saffioti announces the opening of the Thornlie-Cockburn link as part of the Metronet project. (ABC News: Cason Ho)\n\nThe projects were jointly funded by the state and federal governments.\n\nMajor disruption\n\nConstruction of the latest Metronet development did not come without disruption.\n\nThe Armadale line was shut down for 18 months for construction, and that disruption is set to continue for thousands of commuters due to a delay on the opening of the elevated Armadale and Byford stations.\n\nThe Armadale-Thornlie line has been shut since November 2023. ( ABC News: Rick Rifici )\n\nCommuters relying on the Armadale line have been taking longer journeys on replacement bus services, while road closures have left some businesses isolated from their communities.\n\nButcher Matt Budny said at one point, roads on either side of his shop in Carlisle were closed to facilitate the Metronet construction and another roadworks project.\n\nButcher Matt Budny. (ABC News: Cason Ho)\n\n\"We were close to closing up ... after they closed both sides,\" Mr Budny said.\n\nMr Budny said the lack of access caused him to lose more than half of his usual business.\n\n\"Especially if you've got family, who wants to do a 15 minute detour?\" he said.\n\n\"It was devastating [but] I know that things need to be done, the train line is a good thing.\"\n\nRoads were closed while construction was underway to elevate rail and stations. (ABC News: Cason Ho)\n\nA deli on the other side of the Carlisle station also told the ABC it lost about 50 per cent of its usual business when road closures cut off access to their shop.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/tasmanian-political-leaders-stadium-support/105390918",
        "title": "'Not giving it up for anything': Tasmanian Labor leader firm on stadium",
        "publish_date": "Sun, 08 Jun 2025 00:32:24 +0000",
        "category": "sports",
        "authors": [],
        "text": "The leaders of both major Tasmanian political parties remain staunchly committed to a new Hobart stadium, and AFL team, even if it costs them a shot at governing the state.\n\nBoth Labor leader Dean Winter, and Liberal Premier Jeremy Rockliff have re-affirmed their support for the Macquarie Point stadium and Tasmania Devils AFL club, in the midst of political upheaval triggered by a successful no-confidence motion in the premier by Labor.\n\nThe move means the premier will either be replaced, or Tasmanians will be sent to the ballot box for the fourth time in seven years.\n\nThe issue of the proposed stadium, which is slated to cost almost $1 billion to build, has fractured the state and if an election is confirmed, it is set to heavily influence the makeup of the next parliament, such is its prominence as an issue among voters.\n\nThe stadium is unpopular across Tasmania but is a key condition of the licence agreement between the Tasmanian government and the AFL for a team. That team, the Devils, is almost universally popular.\n\nThe stadium proposal has attracted passionate responses for and against it. (ABC News: Loretta Lohberger)\n\nOn Saturday, both leaders refused to waiver on their support for the stadium, and the AFL club that it unlocks, ahead of a likely election that appears destined to result in a hung parliament.\n\nOn ABC Hobart's Grandstand radio program, Labor leader Dean Winter was asked if the stadium could be used as a bargaining chip in exchange for crossbench support, if his party was required to form the first Tasmanian Labor government in more than a decade.\n\nPRESENTER: In the situation where there's a genuine opportunity for you to form government, with crossbenchers, and you're in touching distance of forming government, can you rule out swapping the stadium for support? DEAN WINTER: I'm not giving up this stadium. Let me be clear. I think getting an AFL team would be the biggest thing since Mona. It'll be incredible for our state, and I'm not giving it up for anything. PRESENTER: So the stadium is off the table in any negotiation? DEAN WINTER: We are absolutely committed to the stadium. We wouldn't be negotiating building a stadium for that sort of thing, no. PRESENTER: Even if it could cost you government? DEAN WINTER: I am totally and utterly committed to it.\n\nHobart stadium cost up another $170m Photo shows Sport underway inside proposed stadium. As the state government releases draft legislation to build the proposed Macquarie Point stadium in Hobart, it is revealed the estimated cost has risen again — to $945 million.\n\nIt was a strong commitment to the contentious build in a week when the Labor leader felt the scorn of the Tasmania Devils football club, and of Devils fans who allege his successful no-confidence motion in the premier has placed the stadium, and the team, in jeopardy.\n\nIt comes off the back of a letter to the AFL, which further confirmed his support for a stadium, and continued allegiance to the build despite an unpopular shift in planning processes for the project, rushed special legislation that was due to be voted on next month, and a rising cost to the state to build it.\n\nPremier Jeremy Rockliff has championed the stadium, and the Devils, since signing the controversial team licence agreement with the AFL in early 2023.\n\nJeremy Rockliff says he won't walk away from the proposed Macquarie Point stadium. (ABC News: Luke Bowden)\n\nAt a press conference in Devonport on Saturday, the premier, who has so far refused to resign his post despite Labor's successful no-confidence motion against him, declared similar support:\n\nREPORTER: On the stadium, are you taking it off the table in any negotiations? Is it an absolute rock solid guarantee that stadium is part of your future plans? JEREMY ROCKLIFF: Yes. REPORTER: Even if you can't form government? JEREMY ROCKLIFF: Yes. REPORTER: The stadium is part of your plans? JEREMY ROCKLIFF: Of course it is. I'm passionate about it. We've been waiting for an AFL or AFLW team for over four decades here.\n\nBut it's unknown whether a different Liberal leader would ditch the stadium in order to shore up crossbench support, in a bid to dodge an election and continue to govern.\n\nSo far, Jeremy Rockliff has been unchallenged for the leadership of his party. Whether that changes in the coming days remains to be seen.\n\nIt's expected Jeremy Rockliff will ask for an election after emergency budget bills are dealt with in parliament this week. (ABC News: Ebony ten Broeke)\n\nThe AFL's club presidents, who play a major role in the approval of new team licences, and who rubberstamped the deal between Tasmania and the league, are watching closely.\n\nHawthorn president Andy Gowers told the ABC any changes to the current deal would lead to a reconsideration of the agreement that grants Tasmania its long-awaited team.\n\n\"The presidents voted for the team and the stadium, and the team based on a timeline, and I think that timeline comes up next month,\" Mr Gowers said.\n\n\"If there's any change to that, based on what happens from a government point of view, or any other reason, then we'd have to reconsider.\n\n\"So, at the moment, we've voted for the team and stadium, and if there's any change to what we've agreed to, we will have to consider it.\"\n\nDean Winter says the proposed stadium would be \"incredible for our state\". (Tasmanian government)\n\nMr Gowers will be one of 18 presidents who will speak with Devils chair Grant O'Brien in Melbourne next Tuesday.\n\nWhen asked what questions he would have for Mr O'Brien, he said: \"How can I help?\"\n\nCold water has also been poured on the prospect of a pivot to the alternate, privately backed \"Stadium 2.0\" proposal for a 23,000-seat roofed stadium at nearby Regatta Point, jutting into freshly reclaimed land on the River Derwent.\n\nThe ABC understands no meetings have taken place between project proponents Dean Coleman and former Labor premier Paul Lennon, and the AFL.\n\nIt is also understood there is no desire from the AFL to consider the alternative proposal.\n\nIn a statement to the ABC, an AFL spokesperson said:\n\n\"A clear component of the licence bid from the Tasmanian taskforce was a new roofed stadium at Macquarie Point with a capacity of at least 23,000. \"The AFL's continued position is that this is a condition for the grant of the 19th licence.\"\n\nThe Macquarie Point stadium is a condition of Tasmania's place in the AFL. (Supplied: Macquarie Point Development Coorporation)\n\nThe Liberal government has never supported the 2.0 project, declaring it recently to be \"dead, buried and cremated\".\n\nBut Mr Winter conceded Labor would maintain a level of support for the concept, believing it could come into play should the Macquarie Point project be unable to proceed.\n\n\"Our position hasn't changed since May last year when I said we support a stadium, including the premier's stadium, but we are open to other proposals, too,\" he said.\n\nHe said he met with proponent Dean Coleman in April, but that Macquarie Point remained his priority unless there was no way it could be built.\n\n\"I told him that, as I continue to say, we support the premier's proposal, we are going to support the process, at that stage I think we [referring to the] POSS [Project of State Significance planning process] but since then we have announced support for the [Macquarie Point stadium enabling] legislation.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/farmers-build-own-rice-mill-after-sunrice-monopoly/105379508",
        "title": "How a group of rice growers funded and built their own mill",
        "publish_date": "Sun, 08 Jun 2025 00:25:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "A new $10 million rice mill in southern New South Wales is being hailed as a bold step towards food security and rural sustainability.\n\nBuilt on the outskirts of Jerilderie, the mill opened in the Riverina region, which produces 98 per cent of Australia's rice.\n\nThe proud group of farmers behind the project hope their mill, equipped with cutting-edge Japanese technology, will increase profitability and resilience after a century of domination by a corporate monopoly.\n\n\"It's a red-letter day for the region,\" Murrumbidgee Shire Mayor Ruth McRae said.\n\n\"Out here in rural and regional Australia you don't rely on other people to do it for you.\n\n\"If you think you've got something that's got a good chance of developing … just roll your sleeves up and get it done.\"\n\nThe mill has reduced the transport needed to process rice. (ABC Landline: Peter Healy)\n\nThe impetus for the mill was born during the COVID-19 pandemic in 2021, when many Australian supermarkets ran out of rice, creating panic about food security.\n\n\"They [consumers] got very concerned about their supply of food products into Australia,\" rice grower Mark Robertson said.\n\nHe and other farmers had their own concerns.\n\nThey questioned whether using limited irrigation water to grow conventional rice varieties was delivering the best returns.\n\nBreaking a century-old monopoly\n\nThe group of about 20 growers conducted research that showed consumers wanted a broader range of rice on shelves.\n\nThey saw an opportunity to boost returns by growing and selling niche rice varieties.\n\nThe rice growers were assisted by a change in legislation that ended a century-long monopoly held by corporate giant SunRice, which had exclusive rights to market and sell New South Wales rice domestically and overseas.\n\nMark Robertson and Jack Hawkins have invested in the largely grower-owned mill. (ABC Landline: Tim Lee)\n\nAfter raising capital, they built a small rice mill to get started and later constructed a larger one capable of processing 7 tonnes of rice per hour.\n\n\"We've been challenged by trying to put it together in what you'd call a small regional town, but it's actually the people that have assisted us and the council and everybody else,\" project manager Russell Ford said.\n\nBuilt by farmers, for farmers\n\nA veteran of the rice industry, Mr Ford had previously built his own aeroplane, but never a rice mill.\n\n\"This is not something you buy off the shelf every day,\" he said.\n\n\"It's like a giant Meccano set.\n\nThe $10 million facility can process 7 tonnes of rice per hour. (ABC Landline: Tim Lee)\n\n\" It has been a fantastic journey, so [I] couldn't be happier with the way it has come out. \"\n\nThe growers were successful in getting their Nice Rice brand into all the major supermarket chains.\n\n\"Black rice, purple rice, red rice and some of the more native types, but certainly when it comes to your jasmines and long grains, all rice has different textures and characteristics and slightly different flavour profiles,\" grower George Stevenson said.\n\nBoth facilities are able to process niche rice varieties to cater for different cultural demands or health trends.\n\nAfter the harvested rice crop emerges from the mill, it is hulled and polished ready for packaging.\n\nThe Riverina is one of Australia's key rice-growing regions. (ABC Landline: Tim Lee)\n\n\"Everybody is so heavily emotionally invested. We're really proud of the product,\" Mr Stevenson said.\n\nA colourful future\n\nCounciller McRae was especially impressed the growers funded most of the venture with only a small amount of outside capital.\n\nShe said the mill could be a blueprint for other rural communities and farming groups to process their own produce.\n\n\"There has been no government incentives or … free leg-ups to make this happen,\" she said.\n\n\"It's local people, regional people, taking a huge leap of faith to invest in something they truly believe in.\n\n\"That leap of faith took staunch grit to make it happen.\"\n\nThe growers have been striving to improve their green credentials and were delighted with this year's bountiful rice harvest.\n\nRuth McRae says building the mill required grit and foresight. (ABC Landline: Tim Lee)\n\n\"We've been targeting for years trying to grow a tonne of rice for a megalitre of water, and this is the closest we've ever got,\" rice grower Jack Hawkins said.\n\nAll of the rice trucked to the new mill is harvested within a 100-kilometre radius.\n\nPreviously, it had to be transported more than 1,000km to a mill in northern New South Wales for processing, then brought back for packaging and distribution.\n\nGeorge Stevenson, who is one of the younger growers in the Riverina, said the mill would ensure the rice industry's longer-term viability.\n\nGeorge Stevenson says the future looks bright for New South Wales producers. (ABC Landline: Tim Lee)\n\n\"The sustainability component is paramount, not only for rice but for all of agriculture going forward,\" Mr Stevenson said.\n\n\"I want to keep growing rice for as long as I can and I've got a little boy now and maybe one day he'll be a rice grower.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/wa-role-in-reducing-global-emissions-woodside-karratha-project/105384694",
        "title": "The premier says WA is helping to reduce global emissions. Is there truth to this?",
        "publish_date": "Sun, 08 Jun 2025 00:06:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia’s gas is a golden ticket, a sought-after transition fuel helping to displace coal in Asia and lower global emissions.\n\nAt least that’s the story WA Premier Roger Cook has been selling.\n\nAmid public backlash to the federal government's decision to approve a 40-year extension to Woodside's North West Shelf Karratha gas project, something the WA Government green lit in December, the premier is sticking to his talking points.\n\nThe project's extension is good for the economy, it's good for jobs, it's good for regional WA — and it's good for the energy transition, he says.\n\nHis good friend, Prime Minister Anthony Albanese, was on the same page last week, praising the North West Shelf extension before Tuesday’s federal cabinet meeting in Perth.\n\n\"The people I've met in Karratha support jobs and support economic activity… I went to Karratha during the election campaign,\" Mr Albanese said.\n\n\"I understand that this great state isn't just about Perth, it's about jobs.\"\n\nAnthony Albanese was in Perth last week for a federal cabinet meeting. (ABC News: Courtney Withers )\n\nEnvironment advocates disagree.\n\nThey’re concerned about what the project's emissions will mean for the world, and for WA’s climate targets – a concern dismissed by supporters.\n\n\"I obviously speak to the gas companies and I speak to their customers and their customers have said very clearly to me, for instance Japan… we want to get from 39 per cent profile for coal fire power in our grid down to 19 per cent,\" Mr Cook said last Tuesday.\n\n\"The only way we can do that is by utilising gas.\"\n\nMr Cook says the extension of the North West Shelf will greatly benefit the state. (ABC News: Courtney Withers )\n\nWA's rising emissions\n\nThe WA Greens say the North West Shelf puts the state on the path to becoming Australia's \"climate change capital,\" especially given new data shows WA's greenhouse gas emissions in 2023 were going in the wrong direction.\n\nFigures from the Federal Department of Climate Change, Energy, the Environment and Water found WA's emissions are now almost 17 per cent above 2005 levels and rising, ahead of other mining states like Queensland.\n\nIt means the state is bucking the national trend, with Australia’s overall emissions falling 27 per cent over the same period.\n\n\"The Cook Labor government knows these numbers and they just don't care,\" new Greens MLC Sophie McNeill said at a rally last Wednesday.\n\n\" They know that Western Australia needs to drastically reduce our emissions, that we are the worst climate laggard in the country, and yet they are willing to open new gas projects in the face of this. \"\n\nMs McNeill has slammed the decision to extend the North West Shelf. (ABC News: Courtney Withers)\n\nThe bigger picture\n\nBut WA is planning to bring its emissions down, right?\n\nMaybe – but it might not be any time soon.\n\n\"What's more important is that we bring down global emissions,\" Mr Cook said last Thursday.\n\n\" We have our own role to play as part of the global fight against climate change and we will play that role, but it will be a unique role. \"\n\nPart of that role, the Premier says, is to provide gas to countries moving away from coal but who aren’t replacing it directly with renewables.\n\nIt’s part of the reason why he has pulled back on previous plans to legislate state climate targets, saying it could “shackle” the state from helping the world.\n\n\"If you are introducing green iron into Western Australia, if you're realising our full potential with regard to the global manufacturing battery supply chain, if we're securing renewable energy and exporting it in the forms of ammonia, hydrogen and other forms of stored energy, potentially Western Australia's emissions will increase,\" Mr Cook said this week.\n\nThere are plenty who doubt that position.\n\nWhat Murray Watt's decision means for Woodside's WA operations Photo shows Close up of a collection of jagged red rocks. In the background, two towers spitting flames. The federal government has green lighted the extension of Woodside's Karratha Gas Plant — this is what you need to know.\n\nA report last year by the US Department of Energy — looking at the impacts of increasing America's gas exports — found it could allow for rising demand to be met while reducing greenhouse gas emissions from coal and oil.\n\nBut it also found that upping supply could create an “increased consumption of global services”, which would in turn increase emissions.\n\nA 2019 CSIRO report, commissioned by Woodside and frequently cited by climate advocates, found gas would only reduce greenhouse gas emissions in Asia if a high price on carbon was imposed.\n\n“Gas can assist [greenhouse gas emission] mitigation during the period when carbon prices or equivalent signals are strong enough to force high renewable electricity generation shares,” it found.\n\n“Until the carbon price reaches that level their impact on emissions reduction is either negative or neutral.”\n\nDoubt over Cook's claims\n\nEnergy Finance Analyst at the Institute for Energy Economics and Financial Analysis, Kevin Morrison, also doubts the WA government’s views.\n\nHe said while gas would play a role in the energy transition, “there’s no sign of it replacing coal”, and that it is still emissions-intensive when being exported, as much of WA’s gas is.\n\n“It has got to be frozen, then it's a ship, it burns a lot of fuel as it's going over thousands of kilometres, and then it's reheated at the other end,” he said.\n\n“All that together really adds up to a fair bit of emissions.”\n\nExperts have cast doubt on claims gas is replacing coal. (ABC News: Brendan Esposito)\n\nMr Morrison was particularly doubtful of Cook’s claims Japan needed WA’s gas to decarbonise, pointing to IEEFA research that Japan onsold much of the gas it purchased from Australia.\n\nDisplacing investment in renewables\n\nTensions over the role WA has to play in decarbonising the world are not going away anytime soon.\n\nDemonstrations have continued for the second week as climate activists protest the North West Shelf extension and its impact on rising emissions.\n\nProtesters gathered last week to oppose Woodside's North West Shelf project. (ABC News: Courtney Withers )\n\nConservation Council WA community organiser Victoria Pavy helped organise the snap national day of action event in Perth last Wednesday.\n\n\"We know that from 2026 onwards there's a projected global gas glut, so it's going to be harder and harder for Australia to actually sell our gas and there's a lot more supply than demand,\" she said.\n\n\" We also know that gas is not actually better for our climate than coal and is displacing investments in renewables. \"\n\nAustralian Youth Climate Coalition WA organiser Jordan Rowand agrees.\n\n\"[In] every other state, their emissions have gone down since 2005, so the work that we have to do in Western Australia is a lot… we have some big fights ahead of us,\" they said.\n\nJordan Rowand says the Australian Youth Climate Coalition won't back down on the issue. (ABC News: Courtney Withers )\n\nHistory will judge whether the WA government is chasing a real golden ticket or something closer to fool's gold.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/gold-coast-beach-erosion-management-alfred-cyclone/105381540",
        "title": "'Fringing reef' proposed to save Surfers Paradise from future cyclones",
        "publish_date": "Sun, 08 Jun 2025 00:06:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "It is the last line of defence for properties on the Gold Coast — and high tides keep crashing against it.\n\nThree months after Cyclone Alfred hit the the coast, parts of the city's \"A-Line\" rock wall remain exposed.\n\nBeach walkers and residents on the northern Gold Coast say they cannot see it being fixed in a hurry.\n\n\"It's just ruined the beaches, the high tide comes right up to the wall,\" said Main Beach resident Rod Clutton.\n\nDamage at Narrowneck Beach on the Gold Coast three months after Cyclone Alfred. (ABC News: Nicholas McElroy)\n\nMore than $30 million has been spent on a sand-pumping barge so far, but successive swells and high tides have hurt recovery efforts.\n\n\"I just don't know how it's going to be fixed,\" Mr Clutton said.\n\nDredge works have been ongoing after the storm. (ABC Gold Coast: Steve Keen)\n\nNarrowest beaches in 25 years\n\nThe Gold Coast's beaches could take up to three years to fully recover from the storm, according to the council.\n\nIt said Cyclone Alfred was the worst weather event to hit the city in 50 years, and beaches were the narrowest they had been in 25 years.\n\nBulldozers shifting sand on Surfers Paradise Beach at low tide. (ABC News: Nicholas Mc Elroy)\n\nAlthough it might look bad, the beaches have eroded many times before.\n\nIs the Superbank a natural wonder or human-made miracle? Photo shows Aerial photo of the surf break at Snapper Rocks How did one of Australia's most famous surf breaks come about?\n\nCyclone Alfred ripped an estimated 6 million cubic metres — or 2,000 Olympic swimming pools — of sand from beaches across the city.\n\nBut coastal engineer Angus Jackson said the sand should not be thought of as \"lost\".\n\n\"We know from 60 years of survey data that sand is gradually moving onshore, so nothing is lost,\" said Mr Jackson, chief executive engineer at International Coastal Management.\n\n\" It's just constantly translating offshore [and] onshore. \"\n\nDefences exposed\n\nThe beaches are still vulnerable to future storm events.\n\nWhile there are plenty of spots to pop down a towel on the city's 52 kilometres of beaches, the worst visible impacts are north of Surfers Paradise.\n\nAn artificial reef sits off Narrowneck. (Supplied: City of Gold Coast)\n\nThat includes Narrowneck Beach, which gets its name from the narrow strip of land separating the Nerang River from the Pacific Ocean.\n\n\"We've got to protect all our beaches, especially our vulnerable points,\" Cr Tate said.\n\n\" Because if Mother Nature comes with another [Cyclone] Oswald to Narrowneck right now, it could potentially break through. \"\n\nThe council said it planned to move more than 1 million cubic metres of sand to beaches over the next year.\n\nCr Tate said he would \"work to find a long-term solution to make sure Narrowneck would be safe for the future\".\n\nPalm Beach's artificial reef is made up 60,000 tonnes of underwater boulders. (Supplied: City of Gold Coast)\n\nHe pointed to existing artificial reefs at Narrowneck and Palm Beach, which were built to protect the coastline from extreme weather events.\n\nTwo women inspecting works to manage erosion at what is now known as Narrowneck Beach, circa 1910-1954. (Supplied: Arthur McLeod, State Library of Queensland)\n\nBreakwalls, rock groynes and a network of pipes and sand stockpiles are used to nourish the beaches on the Gold Coast.\n\nSurfers Paradise reef?\n\nThere have been a number of proposals to protect Surfers Paradise beach over the years.\n\nMr Jackson said a fringing reef built offshore could be a solution to protect the coastline.\n\nThe beach separates a lot of real estate from the ocean. (ABC Gold Coast: Dominic Cansdale )\n\nHe said it would minimise the impacts on the beaches by softening the blows of a large storm swell.\n\n\"[The water offshore] would look like it looks now unless we get a storm with over 5-metre waves,\" Mr Jackson said.\n\n\"Suddenly you'd see the waves breaking out towards the horizon and the energy not reaching those upper beaches.\n\n\"Day to day, you wouldn't know it was there,\" he said.\n\nAn artificial fringing reef at C Y O'Connor Beach in Western Australia. (ABC News: Nicholas Martyr)\n\nMr Jackson, whose company has won Gold Coast contracts, said a project could build on lessons learnt from artificial reefs at Narrowneck and Palm Beach.\n\n\"We can have this hidden protection that's below water level,\" he said.\n\n\"With sea-level rise, you gradually increase the height of the reef.\"\n\nHighly managed coastline\n\nAt the end of the day, Mr Jackson said it was important to get sand back onto the shore to soften the blow of any future storms.\n\nAngus Jackson says the sand is not \"lost\". (ABC News: Nicholas Mc Elroy, Glenn Mullane)\n\n\"What we need is a enough buffer zone so when we get that storm hit, instead of it [surf] being in the middle of the Esplanade, it's back [on the sand] and we still have a usable beach,\" Mr Jackson said.\n\nDamage at Narrowneck Beach on the Gold Coast three months after Cyclone Alfred. (ABC News: Nicholas McElroy)\n\nHe said council's recovery timeline seemed conservative, and sand would soon be pushed towards the exposed rock walls.\n\n\"That's the first time we've seen that [Narrowneck] boulder wall in 26 years, it'll recover again, the sand backpassing will bring sand back,\" he said.\n\n\"We've made the beaches much more resilient, they're not natural anymore, they're very much managed.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/justis-huni-fabio-wardley-wba-interim-heavyweight/105390984",
        "title": "Aussie Huni handed shock KO in UK showdown",
        "publish_date": "Sat, 07 Jun 2025 23:48:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian heavyweight Justis Huni's valiant bid for the WBA interim world title has been ended by a devastating 10th-round knockout against rising English star Fabio Wardley.\n\nThe 26-year-old from Brisbane had stepped in at short notice to replace injured American fighter Jarrell Miller.\n\nHuni appeared in complete control for nine rounds in front of a raucous crowd at Portman Road, the home of Wardley's beloved English football team Ipswich Town.\n\nBoasting a glittering amateur career, including a World Championships bronze, Huni looked keen to display his credentials on the big stage.\n\nHe demonstrated his firepower from the beginning of the bout, causing Wardley problems with powerful combinations as he racked up round after round on the judges' scorecards.\n\nJai Opetaia hunting another win to earn potential Las Vegas pay-off Photo shows Jai Opetaia walking onto a stage, wearing boxing gloves, for a public training session The two-way respect earned in an evening with Terence Crawford could pay off in the form of a Las Vegas stadium unification blockbuster for the 29-year-old Australian.\n\nLively footwork and impressive hand speed continued to trouble Wardley, who battled to contain his opponent going into the 10th round.\n\nBut it was at this point Wardley somehow pulled out a stunning right-hand, forcing an astonishing KO and sending his relieved fans into wild celebrations.\n\n\"That's my curse. I even said before this fight it only takes one second to switch off. It happened tonight,\" Hunis told DAZN.\n\n\"I'm grateful to Fabio and his team and to Ipswich to be able to perform in front of you. Get behind him, he's going to do great things.\n\n\"He's just an awesome fighter. He never gave up and he got the win, he deserves it. Thank you Ipswich for the opportunity to perform here, I'm grateful.\"\n\nWardley, whose win will boost his WBA ranking with the sanctioning body, praised the previously unbeaten Australian for his performance.\n\n\"Justis Huni is a great operator,\" Wardley said after the bout.\n\n\"We'd drilled everything over and over again. I should've performed better in some of those rounds.\n\n\"He's a great boxer, has some great skills and he showed me everything he had tonight.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/queensland-mum-sarah-rose-grauf-writes-book-on-baby-loss-grief/105357988",
        "title": "Pixie-Rose only lived for three weeks, but she taught her mum about life",
        "publish_date": "Sat, 07 Jun 2025 23:44:09 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "WARNING: This article includes information and images relating to pregnancy loss and neonatal loss, which some readers may find distressing.\n\nA Queensland mum has channelled the agonising grief of losing her three-week-old daughter into a book she hopes will help other parents grappling with similar grief.\n\nCoolum couple Sarah-Rose and Marcus Grauf are among thousands of Australian parents grieving the loss of their baby — an experience no parent can prepare for.\n\nPixie-Rose was born with a rare congenital disorder that affects about one baby in every 15,000. (Supplied: Sarah-Rose Grauf)\n\nMrs Grauf spent three weeks in South Brisbane's Mater Mothers' Hospital in September 2023 after her daughter Pixie-Rose was born.\n\nWhile pregnant, doctors had discovered the Graufs' unborn baby girl had CHARGE syndrome, meaning Pixie-Rose was at risk of being born with life-threatening defects because of a genetic mutation.\n\nCHARGE syndrome affects one in 15,000 births.\n\nIf you, or someone you know, needs help: Lifeline on 13 11 14\n\nStillbirth Foundation (research and education to prevent stillbirth) on 02 9557 9070\n\nRed Nose 24/7 grief and loss support line on 1300 308 307\n\nMensLine Australia on 1300 789 978\n\nBeyondBlue on 1300 22 46 36\n\nEmergency services on triple-0 if you need immediate care\n\nThe condition CHARGE is an acronym of the most common symptoms — coloboma (missing eye tissue), heart defects, atresia choanae (narrowed nasal passages), restricted growth, genito-urinary problems (affecting urinary organs) and ear abnormalities.\n\nPixie-Rose was born at Mater Mothers' Hospital on September 4, 2023, weighing 2.6 kilograms.\n\nIt was a natural birth, but she was put straight onto life support.\n\n\"The only time I ever heard her cry was when she was born,\" Mrs Grauf said.\n\nLosing her baby girl\n\nThe Sunshine Coast mum said it was \"almost impossible\" to accept her daughter's death.\n\n\"As a mother, that's really hard … she looked chubby, she was cute, she looked healthy,\" Mrs Grauf said.\n\nSarah-Rose Grauf has written a book about coping with the grief of losing a baby. (Supplied: Sarah-Rose Grauf)\n\nThe family was able to spend about three weeks with their much-loved daughter and sister before making the heartbreaking decision to turn off Pixie-Rose's life support.\n\nHer siblings had the chance to say goodbye to their baby sister before she died.\n\nIn a process she's called \"pain to purpose\", Ms Grauf has now released her book, Secrets to Baby Loss, A Guide for the Whole Family.\n\nThe Grauf children saying goodbye to their baby sister in hospital in 2023. (Supplied: Sarah-Rose Grauf)\n\nShe said the idea for a book came through the journal she was writing.\n\n\"When we were stuck in the hospital, I was faced with a lot of different challenges,\" Mrs Grauf said.\n\n\"I spoke about it quite openly so I could heal.\"\n\nWith no guide to help her navigate her grief, Mrs Grauf went searching for answers.\n\n'No handbook for parents'\n\n\"I couldn't find anything [to help] that grabbed my attention, that was visual, that was unique, that was a step-by-step guide,\" Mrs Grauf said.\n\n\" When life left her body, it was almost like I realised what life was. \"\n\nAs she was holding her dying daughter in her arms, and felt her last breath of air leave her tiny body, Mrs Grauf said she was winded by her own grief.\n\nPixie-Rose's life-support treatment was switched off after three weeks. (Supplied: Sarah-Rose Grauf)\n\n\"It was the same breath-work technique I'd used [as an instructor] helping people through trauma,\" she said.\n\n\"It hit me quite hard, and I thought to myself, I need to help others, I need to live for her.\"\n\nMrs Grauf said it was the small things, such as daily breath work, nature walks, Pilates, and swimming in the surf that \"saved her\".\n\n\"I believe she was a gift and here for a purpose,\" she said.\n\n'The gift' of another baby\n\nSince losing Pixie-Rose, the couple has welcomed another baby.\n\nThree-month-old Bear was born on February 13.\n\n\"Nothing is ever going to replace your child,\" Mrs Grauf said.\n\n\" I believe any baby, any child, [who comes] into this world is a gift. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/rural-wa-islamic-communities-celebrate-eid-al-adha/105381768",
        "title": "Western Australia's remote Islamic communities gather for Eid al-Adha",
        "publish_date": "Sat, 07 Jun 2025 23:31:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "\"Eid Mubarak\" may seem a bit different in Western Australia's north-west, where community members gather in unconventional ways to mark one of the most important dates on the Islamic calendar.\n\nIn Karratha and Carnarvon, worshippers, including some donned in high-visibility work uniforms, have no fixed place of prayer for Eid al-Adha.\n\nIt is a far cry from the Cocos (Keeling) Islands, a majority-Muslim external territory, where the Athan or Islamic call to prayer blends with the sound of drums and violins to ring in the holy festival.\n\nCalls for permanent place of prayer\n\nOn Saturday, belated Eid celebrations were held at a hired council venue in Karratha, about 1,500 kilometres north of Perth.\n\nKarratha Muslim Community Association president Imraan Kolia said not having a permanent place of prayer had been a real \"sticking point\" for the community.\n\n\"We are looking for a dedicated space that we could call our home,\" he said.\n\nWork boots are removed and hi-vis shines as the men kneel for prayer. (ABC Pilbara: Alistair Bates)\n\nMr Kolia described the Muslim community in Karratha as small but tight-knit, with people from all walks of life and corners of the globe.\n\nBut he said the transience of the town could make it difficult to cater for all nationalities and cultures.\n\n\"It's very diverse, very multicultural, very traditional as well. We're only a small community,\" he said.\n\n\" No matter where you come from, we're all bound and united by the same thing which is our religion and special days like this. \"\n\nAbout 150 people came together for Eid festivities, which involved prayers, sharing gifts and treats, visiting families, jumping castles and face painting at the Tambrey football oval.\n\nThe Karratha Muslim community hopes to establish a permanent mosque. (ABC Pilbara: Alistair Bates)\n\nMr Kolia described the dissonance of celebrating and feasting as a community while people in Gaza remained under threat and could not enjoy the same freedoms.\n\n\"It's a time for us when we come together as a Muslim community to remember Muslims all around the world, and especially those Muslims in Palestine and in Gaza,\" he said.\n\nA small but supportive community\n\nThe Carnarvon Muslim community is made up of 50 people.\n\nMost have travelled from Malaysia, Indonesia and Pakistan to work in the farming town.\n\nWhen is Eid al-Adha? Photo shows Beef being cooked on a flaming grill. One of the biggest holidays on the Islamic calendar is happening on Friday. Here's how it's different to a feasting day with a similar name structure.\n\nLike Karratha, there is no fixed space for worship.\n\nIn the past, the civic centre has been rented to host Eid prayers.\n\nBut this holiday, no communal prayer was held.\n\nIt is a Sunnah for Muslims, which means it is highly recommended and should be practised, but is not strictly obligatory.\n\nShzahaer Iezayed Abdullah bin Mahalan, who goes by Lang, moved to Carnarvon from Malaysia eight years ago.\n\nHe spent his Eid working at the kebab shop.\n\nLang runs a kebab shop with a halal menu — a rarity in the North West. (ABC Pilbara: Lina Elsaadi)\n\n\"I just talked to my family in Malaysia … I really miss them when Eid comes. But the only the thing I can do is video call them,\" he said.\n\nLang said most people were too busy to organise the prayer.\n\n\"They're working in the plantation, some in the petrol station, everywhere they're working. So we don't have any time,\" he said.\n\nBut that did not entirely squash the festivities.\n\n\"Sunday … we can make Eid party for us. We're just discussing … like who's doing cooking, who's doing the preparation?\"\n\nUsing a WhatsApp group, the community planned gatherings and supported each other.\n\n\"Especially when someone getting sick in hospital, we just give them donation … This is our Muslim and Malaysian community,\" Lang said.\n\nEid on Home Island\n\nMore than 2,300km north-west of Carnarvon, the call to prayer could be heard along tropical beaches and blue lagoons as Eid al-Adha kicked off in Australia's most remote Muslim community.\n\nMany residents of the Indian Ocean territory of the Cocos (Keeling) Islands observe the festival, although their traditions have developed in isolation from the mainland.\n\nHaji Adam arrives at the Home Island Mosque for Friday prayers. (ABC News: Alice Angeloni)\n\nHaji Adam Anthony, the islands' senior imam, said the special variety of Islam practised by the Cocos Malay merged distinct cultures from across the world.\n\n\"That's because a very long, long time ago, our ancestors bring this culture and tradition,\" he said.\n\n\"The Clunies-Ross brought the peoples from different places to Cocos.\"\n\nTamarind drums (left) are thought to have arrived from Indonesia, and today feature in all sorts of celebrations. (Supplied: State Library of WA)\n\nThe islands were discovered by the East India Company's Captain William Keeling in the early 1600s.\n\nBut it was not until the 19th century that trader John Clunies-Ross began populating them with indentured workers from British Malaya, China, India and other places.\n\nHaji Adam said Islam took strong root among these settlers, who congregated on Home Island when the Clunies-Ross fiefdom passed into Australian control.\n\nCultural markers from homelands as distant and diverse as Indonesia to Scotland still feature in contemporary ceremonies.\n\nWorshippers marked Eid with traditional dancing, tamarind drum playing and performances on the Cocos biola, a fiddle the Clunies-Ross family is often credited for bringing to the territory.\n\nMost of the islands' 600 residents practice Islam. (ABC Radio Perth: Emma Wynne)\n\nHaji Adam explained the harmony between disparate traditions and Islam made the Cocos (Keeling) Islands unique.\n\n\"[Without] using drum or violins and so forth … we lost our culture and tradition,\" he said.\n\n\"The elder people still like to keep this.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/classic-100-piano-live-updates/105380978",
        "title": "Live: The Classic 100: Piano countdown has begun but who will be #1?",
        "publish_date": "Sat, 07 Jun 2025 23:23:14 +0000",
        "category": "entertainment",
        "authors": [
            "Velvet Winter"
        ],
        "text": "It's the biggest day on the classical musical calendar. Classic 100 is here!\n\nThis year ABC Classic wanted to know Australia's favourite piece of piano music, with tens of thousands of you sending in your votes.\n\nJoin as we count down the top 45 songs as chosen by ABC Classic listeners.\n\nHow to listen:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/spurs-sacking-ange-postecoglou-son-heung-min/105390928",
        "title": "'Legend forever': Spurs skipper pens emotional tribute to sacked Postecoglou",
        "publish_date": "Sat, 07 Jun 2025 23:20:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tottenham Hotspur captain Son Heung-min has penned an emotional tribute to Ange Postecoglou following the Australian's sacking as the club's manager.\n\nSpurs axed Postecoglou on Saturday morning AEST, just over two weeks after he guided his side to a 1-0 win against Manchester United in the Europa League final.\n\nAnge's Spurs sacking the sad reality for awful league campaign Photo shows Tottenham Hotspur head coach Ange Postecoglou looks on during the post-season friendly match Ange Postecoglou flew into the Spurs job on a wing and a prayer, and surpassed expectations immediately. But long-standing structural issues and Postecoglou's own pigheadedness ensured a reversion to Tottenham's 'Spursy' norm.\n\nThe win in Bilbao last month ended a 17-year trophy drought for Spurs.\n\nThe Australian was \"relieved of his duties\", with Spurs citing the club's poor results in the Premier League as the key reason behind the decision.\n\nThey finished 17th out of 20 teams.\n\nWriting on Instagram, Son said Postecoglou deserved to be remembered as a Spurs great.\n\n\"You've [Postecoglou] changed the trajectory of this club,\" Son wrote.\n\n\"You believed in yourself, and us, since day one and never wavered for a second. Even when others did.\n\n\"You knew what we were capable of all along. You did it your way. And your way brought this club the best night it's had in decades. We will have those memories for life.\n\n\"You trusted me with the captaincy. One of the highest honours of my career. It's been an incredible privilege to learn from your leadership up close, I am a better player and a better person because of you.\n\n\"Ange Postecoglou, you are a Tottenham Hotspur legend forever. Thank you, mate.\"\n\nLoading Instagram content\n\nEngland international James Maddison also praised Postecoglou for the contribution he made to Spurs.\n\nMaddison thanked the former Socceroos head coach for helping shape his career.\n\n\"Your unwavering self-belief and strong mindset is infectious and a massive reason in why you were the man to end this club's 17-year drought for a trophy,\" Maddison wrote on Instagram.\n\n\"A family man with great morals and I have honestly learnt so much from you. More than you will probably ever know. All the very best.\"\n\nSpurs star James Maddison (right) paid tribute to Ange Postecoglou. (Getty Images/Danehose: James Gill)\n\nIn its statement announcing Postecoglou's departure, Spurs said the club could not base the \"decision on emotions aligned\" to the Europa League triumph.\n\n\"It is crucial that we are able to compete on multiple fronts and believe a change of approach will give us the strongest chance for the coming season and beyond,\" the statement read.\n\n\"This has been one of the toughest decisions we have had to make and is not a decision that we have taken lightly, nor one we have rushed to conclude.\n\n\"We have made what we believe is the right decision to give us the best chance of success going forward, not the easy decision.\"\n\nSpurs said a decision on who would replace Postecoglou as manager would be \"announced in due course\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/wa-teen-kobi-jones-thymoma-diagnosis/105379848",
        "title": "'Fit, healthy' 13-year-old's family rocked by rare cancer diagnosis",
        "publish_date": "Sat, 07 Jun 2025 22:30:39 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Almost six weeks ago Kobi Jones's life was turned upside down when he was diagnosed with an extremely rare type of cancer almost unheard of in people his age.\n\nIt was an ordinary day at football training when the 13-year-old from Collie, Western Australia, felt early signs of the thymoma — a tumour that develops on the thymus gland.\n\nKobi's mother Charli Rowden said that was the start of a life-changing and terrifying journey.\n\n\"The coach was concerned because the chest pain came on so randomly — he didn't get any hits or anything like that,\" she said.\n\nInitial check-ups failed to find anything unusual but a couple of days later doctors contacted the family about a mass visible on Kobi's X-ray.\n\nHe was taken to the hospital in Bunbury for additional tests.\n\n\"I just kept telling Kobi, 'Oh it will be nothing, mate — we have to check what it is and make sure everything is OK,\" Ms Rowden said.\n\n\"And then to be told, while I was standing up, that it could be a cancerous tumour on his thymus — it was horrible.\n\n\"[It's] very scary … he was such a fit, healthy kid.\n\n\"The scariest part is that they don't really know [much about it] or where it could go … they have actually gone and contacted doctors in other countries that may have seen this, all over the world.\"\n\nThe family travelled 190 kilometres to Perth for Kobi's treatment. (Supplied: Charli Rowden)\n\nRare but curable\n\nThymomas impact less than 1 per cent of cancer patients each year and are typically detected in people between the ages of 40 and 60.\n\nPeter MacCallum Cancer Centre oncologist Tom John said it was a \"very, very uncommon\" condition that affected the organ responsible for training the immune system.\n\n\"Most medical oncologists wouldn't see a thymoma in their lifetime … and it's very uncommon in young people,\" he said.\n\n\"[It] sits very close to the heart and some of the big vessels in your chest, and that can certainly cause some symptoms like pain and shortness of breath that [it's important] you don't ignore.\"\n\nIt has been a long, hard six weeks for the family. (Supplied: Charli Rowden)\n\nDr John said he had seen a lot of \"success stories\" over the years when it came to treating the condition.\n\n\"If you do find a cancer like this early, it's usually curable,\" he said.\n\n\"We've had many patients who are cured just with surgery or in some cases we've given chemotherapy up front followed by surgery, and in some cases we have given radiation combined with chemotherapy and they have been cured.\n\n\"If they're detected early and can be cut out, they're curable — we've certainly had quite a few success stories with thymoma.\n\nKobi loves the outdoors. (Supplied: Charli Rowden)\n\nLooking ahead\n\nKobi is recovering in hospital after a long but successful surgery this week to remove the mass.\n\nHe has several months of recovery ahead but stepfather Tayler Leadbitter said he was feeling positive and keen to get back home.\n\n\"It's been bloody horrible,\" Mr Leadbitter said.\n\n\"We do a lot of hunting, fishing, four-wheel driving – anything to do with the bush and outdoors – to now the complete opposite, stuck in Perth.\n\n\"There's not a lot of people to talk to — it's quite isolated and quite hard.\"\n\nMr Leadbitter said he was already planning a family trip for when Kobi was healthy again.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/surrogacy-tasmania-calls-for-law-reform/105387582",
        "title": "Calls to change Tasmania's 'unfair' surrogacy law",
        "publish_date": "Sat, 07 Jun 2025 22:18:53 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Maree Arnold has an extra special connection with her three-year-old grandson Winston and his newborn sister Phoebe.\n\nMs Arnold carried and birthed both Winston and Phoebe — or Princess Phoebe as Winston calls her — as a surrogate for her daughter Meagan White and her husband Clayde.\n\n\"You want to trust the surrogate that's carrying your baby with everything and who do you trust more?\" Ms White said, while smiling at her mother.\n\nMs White has a rare condition called Mayer-Rokitansky-Küster-Hauser (MRKH) syndrome, which has prevented her from carrying her own children.\n\n\"I was born without my uterus,\" Ms White said.\n\n\"So [surrogacy] has pretty much been my only option.\"\n\nWhile Ms White has ovaries and produces eggs, she does not have the uterus to carry a baby.\n\nMeagan White says surrogacy was her only option to become a mother. (ABC News: Morgan Timms)\n\nTeacher denied access to surrogacy in WA now awaiting son's birth Photo shows Two men in glasses hold the pregnant tummy of a smiling woman sitting between them surrounded by flowers and greenery. Joel Reeve is eagerly awaiting the birth of his son after a stranger he met online agreed to be a surrogate. But he had to move his entire life to Tasmania to become a father.\n\nShe and her husband, from Lilydale in northern Tasmania, started creating embryos through TasIVF in 2017.\n\nThey also travelled to Canada where they created more embryos and pursued surrogacy.\n\n\"We got to 23 weeks and the baby's kidneys didn't develop,\" Ms White said.\n\nWhen the Whites returned home, they looked into uterus transplants — which at the time was in the very early trial stage in Australia.\n\n\"We were going to look into uterus transplants, as in mum transplanting her uterus to me,\" Ms White said.\n\nMeagan and Clayde White with children Phoebe and Winston. (ABC News: Morgan Timms)\n\nThe mother and daughter flew to Queensland to investigate the transplant option.\n\n\"They said that the operation would be simple for me but reasonably extensive for mum to make sure they removed the uterus with all the vessels intact, and that's when mum said, 'it might be easier if I carried'.\"\n\nMs White and her husband, along with Ms Arnold and her husband Leigh, had to go through the altruistic surrogacy agreement process of counselling, contracts and IVF.\n\nThen on January 13, 2022, Ms Arnold birthed Meagan and Clayde's son Winston.\n\nWhen Meagan White and her husband wanted to grow their family again, Meagan's mother Maree Arnold was their surrogate. (ABC News: Morgan Timms)\n\nWhen three became four\n\nAfter getting settled as a family of three, Ms White began to look again into uterus transplants in the hope of growing her family again. Then surrogate gran stepped back in.\n\n\"Mum was like, 'Well if I did it once, I can do it again',\" Ms White said.\n\nMs Arnold, who has also had five of her own children, said the pregnancy process was different — not only a surrogate, but as a grandmother.\n\n\"I'm a lot more careful,\" she said.\n\n\"And the technology — the scans are different and all the apps that you get — it's different.\n\n\"It's amazing that we could help and carry and make a family.\n\n\"I think it's more common for an auntie or uncle to carry their nephew or their niece because it's that generation younger, but not grandparents so much.\"\n\nPhoebe White was carried and birthed by a surrogate, who is also her grandmother. (ABC News: Morgan Timms)\n\nCalls to change 'archaic' law\n\nThere weren't many surrogate options for Ms White, especially given Tasmania's surrogacy laws.\n\nIn Tasmania, intended parents and their surrogate need to live on the island state at the time the surrogacy agreement is entered into.\n\nAnna McKie, from Surrogacy Australia, described the law as \"archaic\" and a \"form of discrimination\" against intended parents in Tasmania.\n\n\"For a state that's already a bit more isolated, to have that as an extra, is just ridiculous,\" Ms McKie said.\n\n\"You're the only state that says intended parents must have a surrogate in the same state. Whereas if you're a surrogate in Tasmania, you can carry for anyone, anywhere in Australia.\"\n\nTasmania's Births, Deaths and Marriages registry has registered six parentage orders due to surrogacy in the past five years.\n\nIn Tasmania, all parties to a surrogacy agreement must be Tasmanian residents. (ABC News: Morgan Timms)\n\nMs McKie said she believed the state restriction was from decades ago when IVF laws were first set up and the government wanted surrogates and intended parents to be close \"for the best interests of the child\".\n\nBoth Ms White and Ms Arnold agreed the law was \"unfair\" and that it made surrogacy options harder for Tasmanian parents.\n\nA state government spokesperson said the government would continue to work with stakeholders to determine if changes were required.\n\nParents 'not getting any Medicare support'\n\nSurrogacy Australia is also one of three fertility groups calling for changes to Medicare rebate restrictions.\n\nAs the law currently stands, Australians using assisted reproductive technology for surrogacy are excluded from Medicare rebates — even if, like in Ms White's case, it is the only way to have children.\n\nTasIVF medical director Dr Manuela Toledo said it meant those going through surrogacy had to pay thousands more for IVF services than those not using a surrogate.\n\n\"Someone who's using IVF with a Medicare rebate would be paying a third the cost of someone who's going through surrogacy and having to pay for everything,\" Dr Toledo said.\n\nManuela Toledo says people using surrogacy pay thousands more for IVF than those who are not. (ABC News: Ebony ten Broeke)\n\n\" So on top of a very emotional, trying, long fertility journey for these individuals and families, on top of it, they're not getting any Medicare support. \"\n\nDr Toledo said the IVF Group and the Fertility Society of Australia and NewZealand, which she is a board member of, were calling for the Medicare rebate exclusion to be changed.\n\n\"Any Australian person with a Medicare card should be able to access fertility treatment based on their needs, not on their indication of medical treatment,\" Dr Toledo said.\n\n\"We're not producing enough offspring to sustain our growing population and it's self evident that we need to help individuals and couples have families if that's what they'd like to do.\"\n\nManuela Toledo says there should be more support for people who need to use surrogacy. (ABC News: Ebony ten Broeke)\n\nMs White said Medicare rebates were supposed to be there \"to help those that medically need the help\".\n\n\"I was born without a uterus, but there's also people that need to have them removed because of cancer and everything else, they're also not able to get the rebates,\" Ms White said.\n\n\"It would be fair to have it changed.\"\n\nMaree Arnold has twice been a surrogate for her daughter Meagan White. (ABC News: Morgan Timms)\n\nA Senate committee that recently enquired into universal access to reproductive healthcare, recommended the Australian government implement the recommendations of the Medicare Benefits Schedule Review to remove the exclusion of IVF services for altruistic surrogacy purposes.\n\nThe Australian government supported the recommendation in principle in February.\n\nA federal government spokesperson said the regulation of IVF was on the agenda for the next health ministers' meeting, to be held on Friday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-08/table-grape-varieties-change-in-supermarkets/105308252",
        "title": "Why you're seeing new grape varieties at the supermarket",
        "publish_date": "Sat, 07 Jun 2025 21:54:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "The introduction of sweeter table grapes in supermarkets is leaving old staples like Thompson Seedless behind.\n\nThe Thompson green grapes have been a mainstay on the shelves, but new varieties such as Cotton Candy, Fire Crush, and Midnight Beauty are joining them.\n\nEnrique Rossi is overhauling his vineyard at Merbein, near Mildura in Victoria's north-west, moving from Crimson Seedless grapes to the newer proprietary varieties Allison and Ivory.\n\nProprietary grapes refer to a specific name or brand, rather than a single variety, and there are more and more of them hitting the market.\n\n\"The change is something that we've seen coming for the past few years, and this year it has hit the fan,\" Mr Rossi said.\n\nHe said up to 70 per cent of grapes now being grown were new varieties.\n\nEnrique Rossi says the transition to proprietary table grapes is \"high risk, high reward\" for growers. (ABC Mildura: Timu King)\n\nMr Rossi was involved in bringing new grapes from the United States to Australia more than a decade ago.\n\n\"Back then, there were five varieties,\" he said. \"But today we are closer to 150 and still developing new ones.\n\n\"Choosing is the risky part. By the time you get one in the ground and producing fruit, there could be another 51 breeds coming — you'll never be on top of the wave.\"\n\nThe constant cycle of production is something he is worried will disproportionately affect smaller family farms like his own.\n\n\"There will be a decrease in family-operated growers and the smaller to medium ones will disappear or merge,\" he said.\n\nAustralia is a net exporter of table grapes, sending more than 132,000 tonnes overseas. (Supplied: Australian Table Grape Association)\n\nGrowers respond to consumer demand\n\nOn his vineyard at Euston, in south-western New South Wales, Joe Garreffa is transitioning away from Thompson grapes.\n\nHe is the chair of the Robinvale & District Table Grape Growers Association and says growers have to respond to what buyers want.\n\n\"There is increasing demand for these proprietary varieties and they have got a better taste, and that's what the consumer is chasing these days,\" he said.\n\n\"These [new varieties] are a good thing, there is a lot of work involved with them.\n\n\"They're a different vine and grow a little bit differently than the varieties we're used to.\n\n\"The cost to grow these new varieties is higher, but the return on actual sales is also greater,\" Mr Garreffa said.\n\nThe Australian Table Grape Industry is valued at roughly $900 billion. (Supplied: Australian Table Grape Association)\n\nA 'bit sad' to move on\n\nTable Grape Australia Association chief executive Jeff Scott said he had noticed the shift away from traditional grapes.\n\n\"Supermarkets are heading down the pathway of wanting newer varieties over traditional ones like the Thompson and Menindee,\" he said.\n\n\"There are also growers who are now moving to these new varieties because they have a much higher yield and are more robust in terms of travel and presentation.\"\n\nJeff Scott says some new varieties travel better, making them valuable for the export market. (Supplied: Australian Table Grape Association)\n\nMr Scott said the change in the way table grapes were being sold could be seen in supermarkets.\n\n\"If the supermarkets were to get a box of grapes and put them on the shelf they don't normally nominate the variety,\" Mr Scott said.\n\n\"Traditionally, retail chains advertise grapes as reds, greens or blacks, but some of these proprietary varieties are coming in labelled-bunch bags.\"\n\nSupermarket giant Woolworths plans to \"move away from select white and red grape varieties\" from the start of August next year.\n\nA spokesperson for IGA said it sourced produce locally and did not capture overall data.\n\nColes did not respond to questions.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/coco-gauff-defeats-top-ranked-aryna-sabalenka-to-win-her-first-french-open-title-20250608-p5m5pq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coco Gauff wins French Open for ‘people like me in America’",
        "publish_date": "Sun, 08 Jun 2025 12:05:49 +1000",
        "category": "sports",
        "authors": [
            "Eugene Allen",
            "Simon Briggs"
        ],
        "text": "Coco Gauff lifted her maiden French Open title on Saturday afternoon and then told reporters that she hoped to be a “reflection of hope and light” for “people that look like me in America”.\n\nGauff, who also won the US Open in 2023, is the seventh woman of colour to become a major tennis champion. One of the most politically engaged players on the modern tour, she feels a deep responsibility to the African-American community.\n\n“Obviously there’s a lot going on in our country right now,” Gauff said. “I remember after the election, it kind of felt [like a] down period. My mum told me during [November’s WTA Finals in] Riyadh, ‘Just try to win the tournament just to give something for people to smile for’. So that’s what I was thinking about today when holding that [trophy].\n\n“And then seeing the flags in the crowd means a lot. I’m definitely patriotic and proud to be American, and I’m proud to represent the Americans that look like me and people who support the things that I support.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/katy-perry-melbourne-20250604-p5m4vp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If you dream it, you can be it: The Katy Perry ethos takes flight in Melbourne",
        "publish_date": "Sun, 08 Jun 2025 11:22:02 +1000",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "MUSIC\n\nKaty Perry | The Lifetimes Tour ★★★★\n\nRod Laver Arena, until June 14\n\nKaty Perry is pure pop. Her songs promise, and mostly deliver, a good time. And her Lifetimes concert does the same, across two and a half hours, five acts, multiple costume changes and more than 20 songs from a back catalogue stretching to 2008 (the pre-Perry Christian singer Katy Hudson gets a brief acknowledgement but no stage time).\n\nBut this big, spectacular, noisy and surprisingly intimate show also has grander ambitions, in which it has mixed success.\n\nKaty Perry on stage at Rod Laver Arena. Credit: Martin Philbey\n\nIt’s all there in the framing device: a video game in which KP143, an “enhanced” version of Katy Perry, attempts to unseat Mainframe, the AI that has come to rule humanity rather than serve it. To do so, she must free the butterflies that have been captured to power the AI, and to do that she needs to collect love, in the form of glowing hearts that descend from the arena rafters.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/how-a-cringing-austria-came-to-embrace-the-sound-of-music-20250604-p5m4qk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This film used to make Austria cringe. Now it brings in $1.8b",
        "publish_date": "Sun, 08 Jun 2025 10:50:27 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "The film draws more than 350,000 tourists a year, pumping millions into hotels, bus tours, strudel stands and gift shops stocked with marionette goats. It’s estimated to contribute well over €1 billion ($1.8 billion) to the regional economy. But the city’s conversion from reluctant star to musical mecca didn’t happen overnight. It has had to find a balance between preserving its baroque dignity and leaning into the twirling optimism that has defined it for generations of visitors. Rob Harris at Salzburg’s Mirabell Gardens. Credit: Rob Harris On a walking tour through the Old Town, I follow Igor, a whip-smart guide with a dry wit and a bottomless well of trivia. As we pass the fountain in Residenzplatz, where Maria sang I Have Confidence, he hits his stride. “At this point,” he says, pausing for effect, “I must tell you something important. We do not eat schnitzel with noodles, this is not Austria.” He shrugs. “And please no French fries. You have it with erdapfelsalat [potato salad].”\n\nJulie Andrews, who turns 90 this year, remains the brightest star to shine over Salzburg. Her Maria didn’t just conquer the von Trapps – she conquered the world. Still, Salzburg isn’t only Maria’s city. Mozart, of course, still looms – his birthplace lovingly preserved, his likeness on everything from chocolates to shampoo. He may have composed more than 600 works and changed music forever, but in the battle for Salzburg’s most requested soundtrack, Edelweiss is giving Eine kleine Nachtmusik a real run. On the Sound of Music official coach tour, our guide “Big Dave” – a gruff but rather camp Englishman – points to the Alps. “Those mountains they climb at the end?” he says. “They lead to Germany, not Switzerland. You wouldn’t go that way.” He chuckles. “Not unless you were mad … or Maria.”\n\nThe group, a mix of Americans, Brits, Koreans, Australians and Indians, laughs in unison. One of them starts singing Sixteen Going on Seventeen. Another joins in. It’s off-key, unfiltered, unhinged and completely perfect. We end up in Mondsee – a quaint, pastel-painted village a short drive from Salzburg, where the film’s iconic wedding scene was shot. The Basilica of St Michael, where Maria walked down the aisle in her satin gown, is every bit as grand in real life. Local gift shops sell goat marionettes. Credit: Rob Harris Across the square, I wander into a gift shop and give in completely. I buy a marionette goat – a nod to The Lonely Goatherd, obviously – a Julie Andrews postcard and an original copy of The Story of the Trapp Family Singers, Maria von Trapp’s autobiography. The book is more religious and rugged than the film, but somehow just as inspiring. The real Maria was steel wrapped in sincerity. That afternoon, in Salzburg’s famed Marionette Theatre, I watch the entire story play out with tiny wooden figures. It shouldn’t work – and yet it does. There’s something fragile and beautiful about seeing strings lift these little characters skyward as they sing of confidence, courage and farewell.\n\nThe puppets take their final bow. I quietly wipe a tear. The next day by the famous lake where Maria and the children fell out of the boat, I meet Peter Husty, chief curator at the Salzburg Museum. Von Trapp family puppets at the Salzburg Marionette Theatre. Credit: He tells me a new museum will open near Hellbrunn Palace next year, just steps from where the famous gazebo, in which Liesl and Rolf serenaded each other, now stands. “There have been ideas for a museum for 25 years,” he says. “But we’re official and serious – we’re not a private, commercial thing. It’s not going to be an excuse for a gift shop.”\n\nThe museum aims to tell two stories: the Hollywood legend, and the Austrian reality. “People come for Julie Andrews, but they often don’t know there was a real Maria von Trapp,” he explains. “The family’s story is a mirror of 20th-century Austrian history – monarchy, war, loss and emigration.” Husty has spent years buying and begging from extensive private collections, including global film posters, soundtracks and rare memorabilia. “We won’t make it a cinema – we’ll tell stories, show objects, backstage photos. It’s a cultural history.” For Husty, the film’s impact is still striking.\n\n“Every time I see a group rush to the gazebo, singing, I say it’s like a pilgrimage,” he laughs. Aerial view of the historic city of Salzburg with Hohensalzburg Fortress in beautiful evening light in fall, Salzburger Land, Austria. Credit: iStock When he curated the first local exhibition of the film in 2011, he even changed the carillon in Mozart Square to play Edelweiss. Tourists looked up, singing. Salzburgers called the museum asking, “What the hell is that music?” And that, really, is the point. The Sound of Music has never been about historical accuracy. It’s about the refusal to be cynical. It believes that music can heal, that family can triumph, and that confidence can be sung into being. Today, in a world spinning faster and more frantically than ever, The Sound of Music remains a gentle act of resistance. It reminds us that optimism isn’t naive. It’s necessary.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-to-pause-as-ever-20250604-p5m4r1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan to pause As ever",
        "publish_date": "Sun, 08 Jun 2025 09:45:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan to pause As ever\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/la-protesters-clash-with-authorities-20250608-p5m5qm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "LA protesters clash with authorities",
        "publish_date": "Sun, 08 Jun 2025 09:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "LA protesters clash with authorities\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/how-the-ryles-revolution-mirrors-ciraldo-s-bulldogs-rebuild-20250607-p5m5nq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the Ryles revolution mirrors Ciraldo’s Bulldogs rebuild",
        "publish_date": "Sun, 08 Jun 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "“That was the biggest thing for me at the time. It’s an example that I thought was pretty relevant to use at the time.” Both endured baptisms of fire. Ciraldo’s Bulldogs finished above only the Dragons and Tigers on the NRL ladder after his first year in charge. A total of 15 players either left the club or didn’t play in Ciraldo’s first season in charge, as the new coach brought in recruits he knew would buy into his culture and defensive systems. Many of the new signings were dubbed “utilities”; those capable of playing in numerous positions, without having ever made one their own at their past clubs. Belmore wasn’t built in a day: The 2023 season couldn’t end quick enough for Cameron Ciraldo’s Canterbury. Credit: Getty And yet the turnaround was relatively swift. After the tough initiation that was the 2023 season, the Bulldogs made the finals last year, where they were knocked out in a close loss to Manly on the opening weekend. They have improved even further this season, to the point where they are the outright competition leaders at the halfway point. Parramatta powerbrokers hope the club is on a similar upward trajectory. They have given Ryles, whose side currently sits in 16th spot, a mandate for change. It’s a similar position to the one the Bulldogs were in during Ciraldo’s first year in charge.\n\n“They’re sitting on top of the table at the moment, so you’ve got to respect the change that club’s gone through,” Eels chief executive Jim Sarantinos says of the Bulldogs’ resurgence. “They obviously had a number of years where they had some lean periods, but they certainly seem to be moving in the right direction in a lot of areas. Parramatta CEO Jim Sarantinos at the club’s new $70million centre of excellence at Kellyville last month. Credit: Edwina Pickles “We’re on a journey ourselves … I guess some of the parallels are that both coaches serve long apprenticeships as assistants at successful clubs, but this is their first foray into head coaching. “But the other parallel is putting their imprint on the club, on the football team through the style in which they want to play, the principles that they want to instil within the team. There’s how that translates into what they do on the field, but also what they do off the field, in terms of behaviours and standards.\n\n“There’s obviously changes in personnel that need to be made. I think [Ryles] has shown the conviction to make some difficult decisions that he knows are going to benefit the club and the football program in the medium to longer term. That takes some courage to do. He’s got to be applauded for that. “I think in that way there are a lot of similarities to the journey that Cameron’s gone on at the Dogs to where we are, where Jason’s starting out. I do have some confidence that our progression will be reasonably quick.” Ryles hasn’t shied away from making the tough calls. Captain Clint Gutherson, reigning Ken Thornett medalist Reagan Campbell-Gillard and prolific tryscorer Maika Sivo – a trio of cult heroes – were allowed to leave. Dylan Brown will soon follow them after the Eels opted not to engage in a bidding war with Newcastle for his services. Other players on big money, including Ryan Matterson, Shaun Lane and Bryce Cartwright, are no longer automatic first-grade selections. Joe Ofahengaue was allowed to leave early. The result has been the blooding of a slew of youngsters, at a time when the club’s two biggest stars, Mitchell Moses and Zac Lomax, have taken to the field together just twice due to injuries.\n\nThe result has been some tough times, particularly early in the season. In Ryles’ first game in charge, he went head to head against one of his mentors, Melbourne coach Craig Bellamy. The result was a 56-18 hiding. “While it all feels good [announcing a new coach], they then roll the scoreboard out and it starts giving you feedback,” Ryles muses. Joash Papalii, who made his Eels debut last month, is tipped as a star of the future. Credit: Parramatta Eels Like Ciraldo, Ryles didn’t allow a horror initiation to derail his vision. While there have been other tough days in the office, there have also been some positive signs of late. Isaiah Iongi, Ryley Smith, Jordan Samrani, Kitione Kautoga, Joash Papalii, Sam Tuivaiti and Toni Mataele are youngsters showing promise. More junior talent will emerge in coming years after the Eels made the SG Ball grand final. The senior players have also bought into Ryles’ methods.\n\n“There’s been no problem with that from the start,” Ryles says. “Mitchell and Junior [Paulo] have been really big help in that regard. They have embraced the change and the players have followed their lead and helped me enormously. “I haven’t had a lot of pushback and I have been pretty open with them and patient as well. I’ll continue to do that. There’s been no rotten eggs, all the players have bought in and worked really hard. “We’ve seen some younger guys get some opportunities well before they would at any other club. Some have taken to it and some have taken a bit more time, but that’s to be expected.” Even Moses, in a career that has spanned well over 200 NRL games, has had his eyes opened. “You think you know your way around a game or think you know everything you need to know,” Moses said recently. “But the last seven months under Jason Ryles and [assistant] Nathan Brown, I’ve learnt so much about my footy.”\n\nLoading Defence has been Ryles’ strong suit and on this front there has been progress, as evidenced by the concession of just 34 points in Parramatta’s last three games. However, the improvements weren’t enough to sway Lachlan Galvin – earmarked as Dylan Brown’s long-term replacement – to choose the Eels over the Bulldogs. “We’ve moved on from it,” says Ryles, who will take his time in deciding how to spend his war chest. The Eels believe that, if the right player comes onto the market, they will be able to make a compelling case. The club has just opened the world’s biggest rugby league facility, a new $70 million centre of excellence. A slew of youngsters are showing promise and their coach has enhanced his reputation, despite the team’s current lowly standing on the ladder. Their immediate focus, however, is taking on the high-flying Canterbury. Ryles is full of admiration for what the “Family Club” has achieved under Ciraldo.\n\n“Definitely,” Ryles says. “I spoke to Cameron a couple of times along the journey and I like how his teams play. “He’s a good fella and I like how connected the club is at the moment at the Bulldogs. There’s certainly some stuff there to take away. He’s making the most of what he’s got and obviously gone out and recruited really well as well.” Perhaps Parramatta are about to enjoy a similar revival to the Bulldogs? “I don’t really care what any other club has done,” Ryles says. “We’re going on a journey with the challenges that we’re presented with and dealing with them each day, with the foresight of making sure we improve day on day, week on week and hopefully year on year. “That’s my main focus. I’m not too fussed about what any other club has done.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/huni-shocked-by-unbelievable-ko-20250608-p5m5q7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Huni shocked by 'unbelievable' KO",
        "publish_date": "Sun, 08 Jun 2025 08:30:52 +1000",
        "category": "finance",
        "authors": [],
        "text": "Huni shocked by 'unbelievable' KO\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/shots-fired-at-sydney-home-20250608-p5m5q0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shots fired at Sydney home",
        "publish_date": "Sun, 08 Jun 2025 07:20:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shots fired at Sydney home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/gauff-wins-maiden-roland-garros-title-20250608-p5m5pv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gauff wins maiden Roland-Garros title",
        "publish_date": "Sun, 08 Jun 2025 06:50:36 +1000",
        "category": "sports",
        "authors": [],
        "text": "Gauff wins maiden Roland-Garros title\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/haslers-frosty-reply-to-touchy-question-20250608-p5m5pt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hasler's frosty reply to touchy question",
        "publish_date": "Sun, 08 Jun 2025 06:10:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hasler's frosty reply to touchy question\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/conservation/an-outdoor-influencer-rallied-against-higher-camping-fees-23-000-people-responded-20250519-p5m0e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An outdoor influencer rallied against higher camping fees – and 23,000 people responded",
        "publish_date": "Sun, 08 Jun 2025 05:45:00 +1000",
        "category": "finance",
        "authors": [
            "Caitlin Fitzsimmons"
        ],
        "text": "Crook said Parks Victoria had been starved of funding for years, including a $95 million cut last year, and the free booking system imposed a burden on rangers. The NSW government wants to tackle “ghost bookings”, where campers reserve a spot but don’t show up. Credit: Dean Sewell “They’d have to monitor the campsites more than they were, and then sometimes it was turning into fisticuffs, when people didn’t turn up, but people still camped in their spots,” Crook said. “There were a lot of issues, a lot of dumped rubbish, fires left alone, and the potential for bush fires. It looked good on paper, but in action with a park service that’s so degraded and not looked after by the state, it was always going to fall in a heap.” NSW has 360 campsites in national parks, as well as free camping in state forests managed by Forestry Corporation of NSW.\n\nIn NSW, the online backlash has centred on whether the fees for national parks are too high. While the proposal would introduce a free tier for a bare patch of earth, a basic campsite with a pit toilet would be $22 a night in high season, while sites with the most facilities – including a hot shower – would be $89 a night. Atkinson, an outdoor creator whose video posts on Instagram, TikTok, Facebook and YouTube have garnered millions of views, has been campaigning against the price rises. Now that submissions have closed, he has switched to pushing an online petition. Atkinson acknowledged that ghost bookings are a big issue – a video he posted in July last year showed a campground in Kosciuszko National Park that was booked out, yet had four out of five sites empty – but said making camping unaffordable was not the way to fix it.\n\nHe recently posted a video about how the price to pitch a tent at Woody Head campground in Bundjalung National Park was more expensive than renting a three-bedroom house in the nearby town. Atkinson said only about 30 per cent of campgrounds had a booking system before the COVID-19 pandemic, while most were free and first come, first served. NPWS expanded the booking system to cover every campsite as a pandemic measure, though keeping prices for the formerly free locations low. Like in Victoria, the ease of online reservations increased “ghost bookings”. “They didn’t have a ghost booking problem before COVID happened,” Atkinson said. “The only way to make a booking system work is to make it expensive – but, if you do that, you block out anyone below middle income, and young people are just going to be completely discouraged, so that is a very poor solution.”\n\nHe said it would be better for the basic campsites to be free, without a booking system – a proposal NPWS argues would encourage people to physically block out campsites by erecting tents early. Atkinson said the practical hurdles kept this problem in check, and added that NPWS should expand campsite capacity to meet demand anyway. Former NPWS park ranger Louisa Andersen, who posts content online as “Ranger Louie” and is now based in Western Australia, said she had concerns about the prices. “How are people meant to care about the environment and parks and natural places if they can’t afford to experience it?” Andersen said. “Rangers don’t get discounts either … and I just can’t wrap my head around or justify paying that much.”\n\nSergey Kolotsey of Baulkham Hills made a submission proposing to solve the ghost booking problem without raising fees by asking people to pay a deposit that would be refunded if they checked in using a QR code at the campsite. Loading The NSW National Parks Association submission recommended merging the lower pricing tiers, since the costs of managing a wholly unserviced site, sites with pit toilets, and sites with pit toilets and a table were all minimal. The non-government organisation expressed surprise that there was no benchmarking of best practice across the nation, since many bushwalkers and campers travel from state to state. “Queensland and South Australia have simplified their fee structure and remain competitive with regional caravan parks,” the submission says.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/albanese-need-not-shy-away-from-his-catholic-roots-20250606-p5m5lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese need not shy away from his Catholic roots",
        "publish_date": "Sun, 08 Jun 2025 05:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Barney Zwartz"
        ],
        "text": "Australian historian Manning Clark described the Australian attitude to spirituality as “a shy hope in the heart”. We are uncomfortable with overt displays of religiosity or, indeed, strident atheism.\n\nFor most Australians, to be asked by a stranger (as happens in the US) if they know Jesus as saviour would be cringe-making. This is the cultural context in which Prime Minister Anthony Albanese, who visited the newly installed Pope Leo XIV last month, claimed a strong Catholic heritage, then almost immediately repudiated that by telling journalists his faith played no role in his politics.\n\nIt seems that Albo’s faith is not so much shy as painfully introverted. It scarcely figures in his discourse compared with, say, his struggles growing up with a single mother in a council house. This is not to doubt his personal faith, but to suggest that he is constrained in the public arena.\n\nAnthony Albanese and Pope Leo XIV met for about 45 minutes. Credit: Vatican Media\n\nHis papal visit and later counter-balancing remarks were carefully calibrated to please – or, at least, appease – both sides of the divide. Catholics are a quarter of the population, and agnostics probably more than half.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-trouble-in-australias-dairy-industry-could-mean-for-milk-prices/h1j5ly7ju",
        "title": "Australian dairy is in 'a world of pain' — and you might feel it at the checkout",
        "publish_date": "Sun, 8 Jun 2025 01:16:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian dairy farmers have faced increasingly difficult conditions in recent years, and it could mean mounting prices for consumers.\n\n\n\n\n\nConsumer groups have warned prices for milk products are expected to rise in the near future due to product shortages.\n\n\n\n\n\nBut dairy farmers say it might not be enough to save the struggling industry.\n\n\n\nWhy is Australia's dairy industry facing challenges?\n\nAustralian dairy is a $13 billion industry spanning farming, manufacturing and exports, with a farmgate value of $4 billion alone, according to the industry's peak body Dairy Australia.\n\n\n\n\n\nMany dairy farms are in Australia south and south-east. After a hot, dry summer, NSW has faced heavy rain and floods, while Victoria, Tasmania and South Australia have been experiencing drought.\n\n\n\n\n\nIn May, brothers Kevin and Doug Schlenert had their dairy production facilities and 70 per cent of their herd destroyed in floods on the NSW mid-north coast.\n\n\n\nThe brothers said they didn't know whether they would be able to recover.\n\n\n\n\n\n\"I've got no dairy now to keep going. I don't know which way to turn at the current moment,\" Kevin said, speaking with SBS News in the aftermath of the floods.\n\n\n\n\n\n\"I don't know if I can bounce back from this. I really don't know.\"\n\n\n\nAccording to Dairy Australia's 2025 mid-year Situation and Outlook report, wet weather in the north and dry conditions in the south, in addition to tightened farm margins, have weighed on milk production across several dairying regions\n\n\n\n\n\nThe report found a decline in farmer confidence in the future, with only half of respondents in the National Dairy Farmer Survey expressing positive views about the industry's future, compared to two-thirds the previous year.\n\n\n\n\n\nDairy Australia said less than two-thirds of businesses are expecting to make an operating profit, and more than half are anticipating profits will be lower than the previous five-year average.\n\n\n\nBen Bennett, president of the non-profit Australian Dairy Farmers, is concerned about the industry's future. Source: Supplied / Australian Dairy Farmers Ben Bennett, a dairy farmer in south-west Victoria and president of Australian Dairy Farmers, which represents dairy farmers across Australia, said he is extremely concerned about the future of the dairy industry.\n\n\n\n\n\nHe said the combination of rising operating costs and weather challenges has put many farmers in an impossible situation.\n\n\n\n\n\n\"We're in, quite frankly, a world of pain,\" he said.\n\n\n\n\n\n\"And it's going to get a lot worse too as we enter winter.\"\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\nBennett said Australian dairy production has decreased by 25 per cent over the past two decades, while dairy imports from overseas have increased.\n\n\n\n\n\nHe believes Australian dairy production will continue to suffer without government assistance and environmental policies designed to support farmers.\n\n\n\n\n\n\"It would be better for a lot of policies to adhere and listen to local people in that area to maximise environmental opportunity and betterment as opposed to ... people who are somewhat removed from that kind of on-the-ground position,\" he said.\n\n\n\n\n\nDairy companies recently announced their farmgate milk prices for the new financial year — that is, the price paid to farmers per kilogram of milk solids in the raw milk, which is later processed into products.\n\n\n\n\n\nPrices range between $8.60 to $9.20 a kilo, up slightly on last year, but a number of industry groups said farmers were hoping for more.\n\n\n\nAre dairy prices increasing in Australia?\n\nYou may have noticed dairy products are becoming more expensive.\n\n\n\n\n\nMichael Harvey, senior analyst at Rabobank, which focuses on agribusiness, said there was inflation \"across the dairy aisle\" in 2023 and 2024.\n\n\n\n\n\n\"What consumers would realise is they're paying a lot more for their dairy products from the supermarket than they were two years ago ... milk, butter, cheese, yoghurt, anything you can track,\" he said.\n\n\n\n\n\n\"We are at the tail end of a significant price spike for dairy products at a retail level.\"\n\n\n\n\n\nAt the peak of the cycle, Harvey said prices increased by 25 per cent for milk and cheese.\n\n\n\nREAD MORE Are supermarkets being unfairly targeted for price gouging?\n\nDairy Australia's report said despite an increase in milk prices, high operating costs will continue to limit profitability for farmers, especially if weather conditions don't improve.\n\n\n\n\n\nHarvey said while consumers might be hit with some price increases in the coming months, he does not expect them to be as steep as those recorded in recent years.\n\n\n\n\n\n\"That was very unique — it was record-high commodity pricing, it was record-high farm debt pricing, and that's what underpinned the need for companies to pass through high costs to consumers.\n\n\n\n\n\n\"It can be a little bit complex, but ultimately it's about the global price of milk that will ultimately set the direction of pricing for dairy products and farm gate milk price.\"\n\n\n\nIn the aftermath of the NSW floods, Eric Danzi, CEO of EastAusmilk, an industry body representing dairy farmers on the Australian eastern seaboard, warned the destruction could have an impact on supermarket shelves.\n\n\n\n\n\n\"There's certainly going to be a real shortage of milk and products — how that plays through to consumers I don't know,\" he told Sydney radio station 2GB recently.\n\n\n\n\n\n\"Between the massive floods in NSW now, previous [ex-tropical] Cyclone Alfred, and the drought in Victoria and South Australia, you're going to have a massive reduction in milk production across Australia.\"\n\n\n\n\n\nHarvey said while the current conditions are devastating for farmers, he does not expect them to lead to significant price increases in the short term.\n\n\n\n\n\n\"It’s not what’s going to drive the farmgate price higher or commodity prices higher, it’s more global fundamentals that matter,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-stolen-generations-survivor-tony-hansen-on-what-it-means-to-finally-have-a-redress-scheme-in-wa/yqj38i4ns",
        "title": "INTERVIEW: Stolen Generations survivor Tony Hansen on what it means to finally have a redress scheme in WA",
        "publish_date": "Sat, 7 Jun 2025 22:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nA proud Wilman and Noongar man, Tony Hansen was removed from his family when he was just three years old, and placed at Marribank Baptist Mission, almost 300 kilometres south of Perth.\n\n\n\n\n\nHe says it means a lot to him to see a state redress scheme announced for survivors of the forcible child removal policies that began in the early 1900s and lasted into the 1970s.\n\n\n\n\n\nIt comes 28 years after the landmark Bringing Them Home report called for such a measure.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/50-years-of-sbs-the-milestone-moments-as-told-by-the-journalists-and-presenters/z8uaq9m50",
        "title": "50 years of SBS - the milestone moments as told by the journalists and presenters",
        "publish_date": "Sat, 7 Jun 2025 21:30:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nProduced in collaboration with SBS Italian, Maltese and Malay.\n\n\n\n\n\nFormer immigration minister Al Grassby tasked Radio Ethnic Australia with the mission to explain Medibank, the first version of Medicare, to migrants in different languages.\n\n\n\n\n\nAs Australia’s most diverse broadcaster, the Special Broadcasting Service aims to inspire all Australians to explore, respect and celebrate our diverse world and in doing so, promote an inclusive and cohesive society.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Sound of shows on 2EA and 3EA)\n\n\n\n\n\nIt's the year 1975 and two radio stations, then known as 2EA in Sydney and 3EA in Melbourne, went to air for the first time.\n\n\n\n\n\nDomenico Gentile has been a journalist with the Italian programme since 1977.\n\n\n\n\n\n\"All of the prime ministers had been our guests, the ministers for immigrations, where regularly our guests, the premiers, the Ethnic Affairs Commission and so on.\"\n\n\n\n\n\nHe sums up the impact of SBS in one word.\n\n\n\n\n\n\"Immense. Immense. Because we brought together ethnic communities because we didn't create a division with them, but we united them because that was what we had to do. Cohesion.\"\n\n\n\n\n\nJoe Axiaq started with the Maltese program in the late 1980s.\n\n\n\n\n\n\"To switch on the radio and all of a sudden you hear your language, and you hear your music, oh that was out of this world.\"\n\n\n\n\n\nBringing audiences a slice of home, SBS has also long been the champion of football.\n\n\n\n\n\nGentile explains:\n\n\n\n\n\n\"If you would've gone on air without mentioning football, you would've had a riot outside the station. I can guarantee you that. Football has been our lucky charm.\"\n\n\n\n\n\nSBS television launched in 1980. Today, SBS is a multi-platform media organisation with a free-to-air service spanning six channels - as well as its digital offering on SBS On Demand.\n\n\n\n\n\nThis is SBS Managing Director, James Taylor.\n\n\n\n\n\n\"We are Australia's most trusted news service. This is a really important foundation for public broadcasting. We are the podcaster of the year, three years in a row.\"\n\n\n\n\n\nSBS has been telling First Nations stories all along - whether on radio or television in news and current affairs.\n\n\n\n\n\nNITV joined SBS in 2012 - it's first broadcast from Uluru.\n\n\n\n\n\nThis is NITV Presenter and SBS's head of Indigenous News and Current Affairs, Natalie Ahmat.\n\n\n\n\n\n\"Indigenous stories are just so important that we tell them. And this for the first time opened the door to be able to bring broader Australia along the journey with us, particularly multicultural and new Australians who are hungry for these stories and really want to learn more about the First Peoples of the country that they've come to call home.\"\n\n\n\n\n\n50 years on, SBS Audio broadcasts in more than 60 languages, chosen on a needs-basis, which is informed by the census.\n\n\n\n\n\nOne of the new additions, SBS Malay, was introduced in 2023. This is SBS Malay's Zaini Ahmad.\n\n\n\n\n\n\"In the past ten years, there has been an influx of younger semi-skilled and non-skilled Malaysian migrants. They really need SBS Malay to navigate their way through their new homeland.\"\n\n\n\n\n\nIn 2025, SBS holds a unique place in the Australian media landscape.\n\n\n\n\n\nThis is Axiaq again.\n\n\n\n\n\n\"There is this sense of belonging. This is sort of our radio station. This is our program.\"\n\n\n\n\n\nAnd looking to the future, James Taylor indicates a few exciting plans on the horizon.\n\n\n\n\n\n\"Next year, middle of the year, we get to bring the world's largest sporting event to Australians, again, which is the FIFA Men's World Cup. And over the next year we're working on a business case to government to create a production presence and talent incubator in Western Sydney.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/chinese-australian-sex-and-relationship-therapists-debunk-sex-myths/7b16hw7hy",
        "title": "'Shame is a weapon': These therapists are debunking sex for Chinese Australians",
        "publish_date": "Sat, 7 Jun 2025 20:36:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "For a long time, Hailey Lin's job has been a mystery to her extended family.\n\n\n\n\n\nWhenever her mother, who lives in Hong Kong, is asked about Lin by relatives and friends, she tells them she's a social worker \"doing psychotherapy things\" in Australia.\n\n\n\n\n\nBut in fact, the Hong Kong-born 33-year-old does more than just psychotherapy: she works as a clinical psychosexual therapist in Sydney, where she helps people explore sex and relationships.\n\n\n\n\n\nLin says despite her mother's reluctance to disclose her occupation, she is supportive of it.\n\n\n\n\n\n\"She can be open-minded, but also she can be very conservative because it is not the norm in Asian culture [to talk] about sex or intimacy,\" Lin tells SBS Podcast Chinese-ish .\n\n\n\nAs one of the few psychosexual therapists with a Chinese background in Australia, Hailey Lin says she feels it's her responsibility to promote sex education for the community. Source: Supplied / Hailey Lin Ronald Hoang has had a similar experience.\n\n\n\n\n\nGrowing up in a Vietnamese-Chinese Australian household, Hoang watched his cousins become doctors, lawyers and pharmacists — professions his parents enthusiastically endorsed.\n\n\n\n\n\nBut he decided to take a different pathway, specialising as a relationship and family therapist, which involves helping couples navigate love, intimacy and family systems.\n\n\n\nLISTEN TO Sex-ish: The talk our parents never gave us SBS Audio 28/05/2025 23:48 Play\n\nEven after years of practice, Hoang says his mother still feels confused about his work.\n\n\n\n\n\n\"I'm pretty sure she still doesn't know what I do. The way she describes it is that I work with 'crazy people',\" the 36-year-old says.\n\n\n\nBut she's accepting … I think she understands it a bit better nowadays.\n\nDespite mixed reactions from their parents, Hoang and Lin are determined to change the prevailing narratives and taboos around sex and relationships within the Chinese Australian community — and part of a small number of therapists with Chinese backgrounds who offer specialised counselling on the topic.\n\n\n\nFamily and relationship therapist Ronald Hoang decided to pursue a different career pathway from his cousins. Source: Supplied / Ronald Hoang\n\n'Like a foreign language'\n\nAccording to 2021 Census data, there are 4,026 psychotherapists — a category that includes psychosexual therapists — in Australia. Only 80 of them speak Mandarin, Cantonese or other Chinese dialects at home.\n\n\n\n\n\nOf that cohort, 42 were born in China, Hong Kong, Macau or Taiwan, making the pool of sex and relationship therapists with Chinese cultural and linguistic knowledge very small.\n\n\n\n\n\nBecause of this, Lin and Hoang say they find their services particularly popular among Asian clients, who feel they have a cultural shorthand.\n\n\n\n\n\nHoang says he noticed the influx of Asian Australian clients when he started his private practice.\n\n\n\nRonald Hoang says many Asian clients come to him because they feel a connection to his Vietnamese-Chinese background. Source: Supplied / Ronald Hoang \"I do get a lot more Asian clients who specifically come to me because they feel — and they even directly say this to me — that I would 'get them' a bit better,\" Hoang says.\n\n\n\n\n\n\"So they do open up, and they do come [to the counselling sessions] because they feel I can relate to their culture.\"\n\n\n\n\n\nLin says for some of her clients, talking about sex and intimacy can feel like speaking a foreign language.\n\n\n\n\n\n\"Talking about sex [and using that] vocabulary, it can be like an alien or foreign language when you speak about your genital parts or even your intimacy,\" she says.\n\n\n\n\n\nShe also notices that many of her Asian Australian clients are unfamiliar with how therapy works. Sometimes she says they expect her to act more like a GP who can prescribe them medication or expect an immediate result after the therapy.\n\n\n\nHailey Lin (left) says while her mother (right) has been supportive of her career, she rarely mentions her work to their relatives. Source: Supplied / Hailey Lin In Hoang's practice, traditional values around family loyalty are a recurring topic in his conversations with Chinese clients.\n\n\n\n\n\n\"[I think] because a lot of us are migrants and come from various places that there is intergenerational trauma that's probably a little bit more frequent than other different kinds of backgrounds,\" he says.\n\n\n\nTackling shame and lack of education\n\nWhile some Australians may hold the impression that Chinese people tend to be conservative when it comes to intimacy, Lin says it's not the case.\n\n\n\n\n\n\"There's a misconception that only Asian or Chinese people find [conversations about sex] challenging,\" she says.\n\n\n\nThe fact is, even for Western people, they still find it challenging too, because it's against the mainstream culture.\n\nBut for Chinese Australians, there are some cultural barriers that make it harder for them to have candid discussions about sex.\n\n\n\n\n\nLin says the lack of comprehensive sex education in schools in many Asian countries is one of the key factors.\n\n\n\n\n\n\"They just talk about biological stuff, but they don't tell you how to give consent to help your first sexual experience, or they don't talk about pleasure,\" she says.\n\n\n\nAfter working as a social worker and sex educator in Hong Kong, Hailey Lin moved to Sydney to pursue two postgraduate degrees in sexual health and counselling. Source: Supplied / Hailey Lin Even in cases where conversation is encouraged by parents or educators, Lin says many still focus on abstinence, saying things like, \"'don't do this', 'don't fall in pregnancy', 'protect yourself', 'use a condom'\".\n\n\n\n\n\n\"But sex is something we need to learn, we need to build up; a skill we need to practice,\" she says.\n\n\n\n\n\nHoang says shame is a key barrier that many Chinese people encounter when talking about sex.\n\n\n\nShame is a weapon that's often used in Asian culture.\n\n\"Shame is a feeling that we get when we're kind of telling ourselves that we are a bad person,\" Hoang says.\n\n\n\n\n\n\"And the following action [typical for] shame is to hide, to withdraw, because you are such a bad person that you don't want other people to be around you and see you for the 'badness' that you are.\"\n\n\n\nDemystifying sex for the community\n\nAs two of the very few sex and relationship psychotherapists with Chinese heritage who offer services in Australia, Lin and Hoang know they bear an extra responsibility in helping to educate their community about sex.\n\n\n\nHoang says besides stigma and stereotypes, there is also a prevailing myth that sex should \"always be good\", especially with a committed partner, which can cause anxiety among some clients.\n\n\n\n\n\nInstead, he encourages them to think about \"seasons\" when it comes to sex.\n\n\n\n\n\nHoang explains: \"There are times when it's summer and it's hot and heavy, and there are other times when it's winter and cold, and then there are other times when it's spring or autumn when it's kind of lukewarm.\"\n\n\n\n\n\nAbove all, he stresses communication is the key to having a positive sex life and relationships.\n\n\n\n\n\n\"If you want more sex, just talk about it openly. It doesn't have to be something serious,\" he says.\n\n\n\nRonald Hoang (left) says communication with intimate partners is key to having positive experiences of sex and relationships. Source: Supplied / Ronald Hoang Lin agrees, saying it's natural for intimate relationships to ebb and flow and advocates for the 'good-enough sex model' — a psychological concept based on balancing positive experiences of intimacy with realistic expectations.\n\n\n\n\n\n\"You will have frustration in your sex life, in your intimacy, but always it remains 'good enough sex'.\n\n\n\n\n\n\"Sometimes we allow ourselves to have below-average sex, but sometimes also bring some novelty into our sex life, because this is human nature — we all like new stuff.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-australian-city-picking-up-pace-as-house-prices-break-records/oto9he4ic",
        "title": "Home price heat: The city picking up pace as records tumble",
        "publish_date": "Sat, 7 Jun 2025 05:27:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australian home prices have continued to rise, reaching a new record high last month, amid falling interest rates.\n\n\n\n\n\nWhile all capital cities saw prices increase in May — with Sydney, Brisbane, Adelaide, Perth and Darwin all now at price peaks — Melbourne had the strongest monthly rise of 0.79 per cent, according to PropTrack's latest Home Price Index.\n\n\n\n\n\nThe report, released this week, states national home prices lifted 0.39 per cent — the fifth consecutive month of growth — meaning they're up 4.12 per cent year-on-year.\n\n\n\n\n\n\"With interest rates falling, price momentum has increased and broadened, with all capitals seeing prices lift in May,\" REA Group Senior Economist and report author Eleanor Creagh said.\n\n\n\n\n\n“Price growth across the capitals is starting to converge. Melbourne, which previously lagged the other capitals, is now seeing home price growth pick up.\"\n\n\n\nREAD MORE How Australia's slowing economy could affect your mortgage repayments\n\nMelbourne is continuing to recover after a \"prolonged period of softer growth\", the report says, with the median home value sitting at $782,000. However this remains 2.85 per cent below the city's peak. It was also the only capital city to record a drop (-0.38 per cent) in year-on-year home prices in May.\n\n\n\n\n\nMeanwhile, Perth's median home value was $787,000 — representing the first time in a decade that it has overtaken Melbourne. Perth had a monthly rise of 0.27 per cent, while Brisbane lifted 0.24 per cent.\n\n\n\n\n\n\"Cities such as Perth and Brisbane are now seeing growth moderate after strong outperformance. The growth seen in all capital cities is underpinned by improved buyer sentiment and renewed confidence following interest rate cuts,\" Creagh said.\n\n\n\n\n\nAlong with Melbourne, Adelaide and Sydney led the monthly rises, at 0.52 and 0.39 per cent.\n\n\n\nREAD MORE Renting has never been harder in Australia, especially in this state\n\nOutside the capital cities, regional prices rose 0.25 per cent, according to the report, with annual growth of 5.19 per cent outpacing the combined capitals (3.71 per cent).\n\n\n\n\n\nIt comes after interest rates were cut for a second time this year in May , to their lowest since 2023, which Creagh said has \"lifted borrowing capacities and boosted buyer demand\".\n\n\n\n\n\n\"With further price increases and rate cuts expected, prospective buyers are moving off the sidelines and accelerating their purchasing decisions.\"\n\n\n\n\n\nAnalysts say the Reserve Bank of Australia (RBA) could cut rates at its next meeting in July, despite its plan to lower inflation, as GDP figures reveal stagnation in the economy .\n\n\n\nOECD downgrades economic growth forecast\n\nMeanwhile, the Organisation for Economic Cooperation and Development (OECD) warned Australia to boost housing supply and address falling affordability as it revealed a downgrade to its economic growth forecast for 2025.\n\n\n\n\n\nIt said Australia's gross domestic product would grow at 1.8 per cent this year, down 10 basis points from its prediction in March, as United States President Donald Trump's tariffs hit demand for Australian exports — especially if China experiences a marked slowdown.\n\n\n\n\n\nThe organisation downgraded its global growth forecasts from 3.1 per cent to 2.9 per cent this year.\n\n\n\n\n\nBut economic growth is expected to accelerate to 2.2 per cent next year — an increase from its prediction earlier this year and in line with the OECD's estimate of Australia's economic potential.\n\n\n\nThe OECD's forecast for 2025 is lower than the Reserve Bank's estimate of 2.1 per cent but in line with its 2026 prediction.\n\n\n\n\n\nInflation will remain close to target, averaging 2.3 per cent over 2025 and 2026, the OECD projected.\n\n\n\n\n\nThat's below RBA estimates, which predict headline inflation accelerating to 3.1 per cent by the end of the year. The OECD said the central bank would be warranted to continue easing interest rates, but must be nimble to change path in case of unexpected external shocks.\n\n\n\n\n\nLooking ahead, Creagh warned to expect further home price growth throughout the year.\n\n\n\n\n\n\"While stretched affordability will remain a constraint, a chronic lack of new housing supply, population growth, and targeted buyer incentives are expected to keep upward pressure on prices,\" Creagh said.\n\n\n\n\n\n\"In combination with interest rates continuing to move lower, these factors are likely to drive further price growth throughout the remainder of 2025.”\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-coach-ange-postecoglou-sacked-from-tottenham-hotspur/q6j8z16kj",
        "title": "Backlash as Australian coach Ange Postecoglou sacked from Tottenham Hotspur",
        "publish_date": "Fri, 6 Jun 2025 23:58:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou's rollercoaster two-year reign at Tottenham Hotspur is over after the North London club sacked their Australian head coach.\n\n\n\n\n\nIt comes despite Postecoglou guiding Spurs to a 1-0 victory in the Europa League final over fellow Premier League (EPL) side Manchester United in Bilbao last month.\n\n\n\n\n\nIt meant the 59-year-old had delivered on his promise of \"always\" winning a trophy in his second season.\n\n\n\n\n\nBut it also came at the end of a dismal EPL campaign in which the club finished in 17th place, just above the bottom three teams, who are then relegated to a lower league.\n\n\n\nTottenham confirms sacking\n\nTottenham confirmed the sacking in a statement released overnight, which read: \"Following a review of performances and after significant reflection, the Club can announce Ange Postecoglou has been relieved of his duties.\n\n\n\n\n\n\"We have made what we believe is the right decision to give us the best chance of success going forward, not the easy decision.\n\n\n\n\"We have a talented, young squad and Ange has given us a great platform to build upon. We should like to express our gratitude to him. We wish him well for the future — he will always be welcome back at our home.\"\n\n\n\n'Something I will never forget'\n\nPostecoglou also issued a statement, saying: \"When I reflect on my time as manager of Tottenham Hotspur, my overriding emotion is one of pride.\n\n\n\n\n\n\"The opportunity to lead one of England's historic football clubs and bring back the glory it deserves will live with me for a lifetime.\n\n\n\n\n\n\"Sharing that experience with all those who truly love this club and seeing the impact it had on them is something I will never forget.\n\n\n\n\n\n\"That night in Bilbao was the culmination of two years of hard work, dedication and unwavering belief in a dream. There were many challenges to overcome and plenty of noise that comes with trying to accomplish what many said was not possible.\"\n\n\n\nREAD MORE Who is Ange Postecoglou? How a Greek immigrant is conquering the football world\n\nTottenham face backlash\n\nPostecoglou's sacking sparked shock and outrage as the football world digested the news that a man who had ended his club's long search for silverware had been shown the door a fortnight later.\n\n\n\n\n\nEngland manager Thomas Tuchel, himself sacked by Chelsea a year after winning the Champions League in 2021, said: \"It just shows you that it is not only about titles, you can survive seasons without titles if your connection, the support and the belief and the trust between the coach and the club is strong then you can overcome seasons without titles.\n\n\n\n\n\n\"If there is slight disbelief, if there are concerns, if the trust is not there anymore, obviously then it is sometimes not even enough to win a trophy after so many years.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-anne-aly-on-australias-multiculturalism/jgghqxp0c",
        "title": "INTERVIEW: Anne Aly on Australia's multiculturalism",
        "publish_date": "Fri, 6 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nThe establishment of the new office follows concerns about how multicultural issues have been treated by the government, with communities feeling like they're being monitored rather than assisted.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-50-years-of-migrant-history-helped-an-australian-street-to-become-the-worlds-coolest/sbu771z3c",
        "title": "How 50 years of migrant history helped an Australian street to become the world’s coolest",
        "publish_date": "Fri, 6 Jun 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhen it comes to traditional Italian treats, Lucchini Cakes in Melbourne’s Preston is a local favourite.\n\n\n\n\n\nThe High Street dining room remains full most days.\n\n\n\n\n\nFor the past 53 years, customers were welcomed by John Menara and his wife Sonia.\n\n\n\n\n\nSonia: \"Food is our passion and it is our passion has always been.\"\n\n\n\n\n\nJohn: \"The new people that come in can't believe that it's still the same family, in the same business.\"\n\n\n\n\n\nThe shelves are filled with sweet treats, continuing a tradition that began in the 1950’s when John’s uncle, Enzo Lucchini, first started out on Melbourne’s Lygon Street.\n\n\n\n\n\n\"He'd be proud that his name is still going on. He would be very proud of that. And he was a very proud man. He came from a very, very wealthy family.\"\n\n\n\n\n\nCommunity is at the heart of this small business.\n\n\n\n\n\nThe Menaras say it’s a place people come to meet and chat and connect with culture.\n\n\n\n\n\nSonia: \"The customers that have come in, they've made friends with people that they didn't know.\n\n\n\n\n\nJohn: \"Greeks, Italians, everyone. Everyone got really well together.\"\n\n\n\n\n\nSpeaking Italian with customers is also appreciated, says Sonia Menara - especially by one older woman.\n\n\n\n\n\n\"She is lovely, and has been a customer for the last 45 years. I'll go up and I speak to her in Italian and she orders her cake. It does make people feel like home and the connection; that they come in here and there is someone that will understand them.\"\n\n\n\n\n\nIt’s ironic that John Menara was born in Australia and has never been to Italy – yet his family business has a cosy European feel.\n\n\n\n\n\n\"It's how I wanted to connect with my ancestry back in Italy. It was to put Italy on the walls with artwork and everything else. It makes me feel good.\"\n\n\n\n\n\nThat sense of culture and community a few of the reasons High Street holds the honour as the world’s coolest – as voted by Time Out Magazine.\n\n\n\n\n\nMelbourne Editor Leah Glynn explains:\n\n\n\n\n\n\"High Street really ticks all the boxes. It's got really epic restaurants, cute hidden bars, great boutiques, and a really wonderful community spirit. It beat out 30 other streets, which is an amazing achievement for High Street in Melbourne on a global scale. And I think it really just goes to show that Melbourne's offerings are truly world-class.\"\n\n\n\n\n\nLocal Historian Emma Russell agrees:\n\n\n\n\n\n\"Because of the diversity, I think it does represent a lot of what's so fantastic about Melbourne. It's not just retail, it's community organisations, community activities that look after people or that provide cultural activities for people from all ranges of backgrounds.\"\n\n\n\n\n\nAnd perhaps nowhere is the diversity of food and cultures more evident than at Preston Market.\n\n\n\n\n\nVendor Sam Virgona has run his market fruit and vegetable store for more than 50 years, since migrating from Sicily in the '60s.\n\n\n\n\n\nHe says for many customers, it’s a place that feels like home.\n\n\n\n\n\n\"They come here and they like to shop in the market. They like to talk to a friend. They enjoy to come here!\"\n\n\n\n\n\nKey to that is making people from all countries and backgrounds feel welcome, says John Zaccharia.\n\n\n\n\n\n\"We are here. A group of us come in and have a coffee, have a chat, and we had a good time. We are very, very polite people. We welcome everybody. If we get a chair open, we're available. We'll let them stay with us. We're talking about gardening, football and everything else. Two things we don't like to talk about, and this is the rule, no politics and no religion.\"\n\n\n\n\n\nThat inclusive spirit also celebrated by second-generation butcher Mark Tolio.\n\n\n\n\n\n\"I grew up in the market from a young age. I would come in, I got to meet many people, many different characters and it's like one big family. And even the people you work with, you get a good relationship. And I love the market.\"\n\n\n\n\n\nBut there’s much more to High Street than markets and cafes, says historian Emma Russell.\n\n\n\n\n\nAlong the two kilometre stretch from Preston, through Thornbury to Northcote, the heritage shopfronts sell everything from vintage records to clothing - their facades plastered with colourful street art.\n\n\n\n\n\n\"It's very eclectic. It's got representation of most of the migrant communities that have come to Melbourne over the last 100 or so years.\"\n\n\n\n\n\nWaves of migration also brought food and flavours from Europe, the Middle East and more recently Asia.\n\n\n\n\n\nIndonesian restaurant Yuni’s Kitchen is run by Matthew and Yuni Kenwrick.\n\n\n\n\n\nYuni: \"So I come to Melbourne my food adventure is more bigger about Indonesian.\n\n\n\n\n\nMathew: \"It's all done from scratch. So that's the part where if you make the curry base from the beginning, chopping every onion up, every chili up, grinding it up, cooking it, and serving it. We get a lot of overseas people, they're very excited to try something wholly different from what they normally get.\"\n\n\n\n\n\nYuni and Matthew Kenwrick say as the urban landscape evolves, everyone is welcome here.\n\n\n\n\n\n\"Whether you are old, young, dressed like a goth, just arrive from overseas, don't speak much English. There's so much opportunity to shop and eat and let people be what they want to be.\"\n\n\n\n\n\nChange is something the Menaras have also embraced over the years.\n\n\n\n\n\nSonia and John are stepping back now, but their children are proud to keep the family business going, as Gianni Menara explains:\n\n\n\n\n\n\"My sister and I are very proud of our history. Taking over the reins from mum and dad. We're very proud and humble as well. And we put our heart and soul pretty much into everything we do.\"\n\n\n\n\n\nIt's a winning recipe the Menara family – and many others – hope will ensure their success for another 50 years at least!\n\n\n\n\n\n\"It's just been a beautiful ride, I've got to say. In these years that we've been here. We're very proud. I mean, we couldn't have done it without each other - and the kids.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/does-australia-still-need-the-us-as-a-military-ally/g4lolxub3",
        "title": "'Glaring mismatch': Why Australia has few good defence options without the US",
        "publish_date": "Fri, 6 Jun 2025 20:41:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "For decades, the United States has been a reliable ally to Australia, whose protection has helped to ensure peace in the region.\n\n\n\n\n\nBut US President Donald Trump's unpredictable and tough treatment of his nation's allies has raised questions about whether Australia can still afford to lean so heavily on America as a security partner.\n\n\n\n\n\nOn Tuesday, Prime Minister Anthony Albanese told reporters the government will make decisions in Australia's national interest and fund the defence capability it needs .\n\n\n\n\n\nThe comments came after US defence secretary Pete Hegseth requested Australia increase its defence budget to 3.5 per cent of its gross domestic product (GDP) in a conversation with Deputy Prime Minister Richard Marles on the sidelines of the Shangri-La Dialogue in Singapore last weekend.\n\n\n\nREAD MORE Why Xi Jinping is touring Southeast Asia amid rising tariff tensions\n\nAustralia's defence budget makes up roughly 2 per cent of GDP, which the government plans to increase to 2.35 per cent by 2034.\n\n\n\n\n\nWhile most experts do not believe the US will withdraw from the Indo-Pacific, Trump's actions raise questions about whether Australia should be seeking to cooperate more with other nations.\n\n\n\n\n\nIn May, Ursula von der Leyen, President of the European Commission, raised the prospect of a formal defence agreement between the trading bloc and Australia.\n\n\n\n\n\nIn response, Albanese said he would consider the proposal but noted a similar agreement was already in place with other European countries such as Germany.\n\n\n\nThe European Union raised the prospect of a security pact with Australia in May. Source: AAP / Sipa USA Without the US alliance, Peter Dean, director of foreign policy and defence at the United States Studies Centre at The University of Sydney, says Australia would need to massively increase its defence spending or accept it can't defend its own sovereignty.\n\n\n\n\n\n\"If you look at the mismatch between the scale of our territory and the scale of our ability to defend it — it's one of the most glaring mismatches in the world,\" he says.\n\n\n\n\n\n\"[You would] effectively be just hoping for the best.\"\n\n\n\n\n\nDean says Australia needs to work hard to maintain its security and that a \"community of nations\" is necessary to support open and free trade, promote a rules-based international order, and counter the use of coercion, aggression, and military force to achieve political objectives.\n\n\n\n\n\n\"If you don't have that community of nations, the example of what's happening in Ukraine is very poignant to everybody,\" he says.\n\n\n\n[Russia believes] in a 'might is right' world and they believe in a world where they get to shape those rules and that order, and that is not going to be favourable or in Australia's interests ... or for the majority of states in our region.\n\nCan we still rely on America?\n\nDean says Trump is more brutally transactional than previous presidents and an example of the adage in international relations that \"you have no friends, you only have common interests\".\n\n\n\n\n\nAlthough it's not always clear what Trump's interests are, Dean believes there's still a common alignment between Australia and the US, particularly in the Indo-Pacific region, and in the overall aims and objectives of their security policies.\n\n\n\n\n\n\"That simply boils down to — we don't want an Indo-Pacific that's dominated by one particular power — especially China,\" Dean says.\n\n\n\n\n\n\"That is an Australian view clearly articulated in our strategy, and that is a US view, clearly articulated by the US — even under this president.\"\n\n\n\nProfessor Peter Dean says there's a common alignment between Australia and the US, particularly in the Indo-Pacific region, as well as in their overall objectives for security policies. Source: AAP / Tatan Syuflana/AP One of the potential problems with a China-dominated region, Dean says, is its desire to \"rule by law\" and the way in which China would go about setting and enforcing laws.\n\n\n\n\n\n\"China particularly wants a hierarchical order where it sits on top and everyone else sits underneath,\" he says.\n\n\n\nChina has one of the most powerful militaries in the world and is seeking to dominate the Indo-Pacific region. Source: SBS News In contrast, Australia and other like-minded countries support a \"rule of law\" system in which a community of nations jointly sets the rules through treaties, such as the United Nations Convention on the Law of the Sea.\n\n\n\n\n\nBut Sam Roggeveen, the director of the international security program at the Lowy Institute, says the US has done very little to address China's dramatic military modernisation since the end of the Cold War.\n\n\n\nNo matter who's in charge in the US, I don't think that will rescue Australia from having to think much more independently about its security.\n\n\"The harsh truth for Australia and for other allies in the region is that the Americans aren't going to do the heavy lifting for us, and want us to do it ourselves.\"\n\n\n\nDoes Australia need the US?\n\nDean says the alliance with the US is critical for national security, and forming an agreement with other countries would be very difficult.\n\n\n\n\n\nA strategic alliance involves countries committing to help each other out during a crisis, or to act in accord to address a common threat. This would preferably be set out in a treaty.\n\n\n\n\n\nAustralia has an alliance with the US and New Zealand, but despite being part of the British Commonwealth, it does not have a formal agreement with the United Kingdom.\n\n\n\n\n\nGiven the geographical distance, Dean believes military support from the UK would likely depend on what other conflicts are happening in its part of the world.\n\n\n\n\n\nWhen it comes to international alliances, arguably the most important is NATO (North Atlantic Treaty Organization), which commits Europe and North America to protecting each other from any threat.\n\n\n\nLISTEN TO Joe Biden: NATO's time 'has not passed' SBS News 12/07/2024 10:12 Play\n\nRory Medcalf, head of the National Security College at The Australian National University, says there are three crucial elements to establish in alliances. Firstly, there must be clear interests in common. Secondly, the parties must articulate some shared values or political will to provide a foundation for trust.\n\n\n\n\n\n\"If their security is threatened, then you have interests engaged,\" he says.\n\n\n\n\n\nAnd there must also be mutual capability.\n\n\n\n\n\n\"There's not much point being an ally of someone if you bring nothing to the table and they bring everything,\" he says.\n\n\n\n\n\nDean says no other state can replace the size, power and influence of the US, which is the world's number one military power.\n\n\n\nThe US has the most powerful military in the world. Source: SBS News Dean says the US — by partnering with South Korea, Australia, Japan and other states — can aggregate enough power to balance China's influence and there is no \"ready-made state\" that could easily replace it.\n\n\n\n\n\nWithout the US, Medcalf says China would likely seek to dominate countries one by one and break any alliance-like relationships.\n\n\n\n\n\nEven if Australia did more for its own defence, there would still be a good argument for maintaining a close relationship with the US because its military technology is among, if not the best in the world.\n\n\n\n\n\nBut Roggeveen says Australia has to accept the US alliance is going to become less important over time.\n\n\n\n\n\n\"With that in mind, we have to look geographically much closer to home,\" he says.\n\n\n\nBuilding coalitions\n\nWhile forming a new alliance may prove difficult, Medcalf says it would be possible for Australia to build coalitions with other nations to discourage things like coercive behaviour if there was some degree of confidence the US would still back them up.\n\n\n\n\n\n\"It's really about using strategic partnership to make ourselves stronger, rather than building a kind of alliance where we expect to be standing shoulder to shoulder in war,\" he says.\n\n\n\n\n\nAustralia is already part of several small groupings of nations with common interests in the Indo-Pacific, such as The Quad (a diplomatic partnership among the US, India, Japan and Australia) and AJUS (a trilateral partnership among Australia, Japan and the US).\n\n\n\n\n\nDefence cooperation has deepened via AJUS, while the security partnership AUKUS, which exists between Australia, the UK and the US, has laid the groundwork for Australia to acquire nuclear-powered submarines and other advanced capabilities.\n\n\n\nAustralia has also entered into limited bilateral agreements with Indonesia, the Philippines, South Korea, Singapore and others.\n\n\n\n\n\nMedcalf, who is undertaking nationwide consultations to understand Australian attitudes to security, says most of these countries have no prospect of being treaty allies of Australia.\n\n\n\n\n\nBut partnerships with countries like Japan, South Korea, the Philippines and Vietnam may be possible. All of these countries, apart from Vietnam, are already American allies.\n\n\n\n\n\n\"They have different levels of capability that they would bring to the table,\" he says.\n\n\n\n\n\n\"But the ultimate question is how much risk are we all going to take for each other?\"\n\n\n\nAustralian Defence Minister Richard Marles (centre) with Philippine defence secretary Gilberto Teodoro Jr (left) and Australian ambassador to the Philippines Hae Kyong Yu (right) in 2023 prior to a large-scale combined amphibious assault exercise in the Philippines. Source: AAP / Philippine DND Defense Communications Service and AFP Public Affairs Office/AP\n\nShould Australia consider a defence agreement with the European Union?\n\nDue to the number of member states that would need to agree to it, Medcalf suspects an agreement with the EU would likely be quite vague in its language and commitment.\n\n\n\n\n\nIt may focus on increased technology sharing, access to defence industry resources and possibly some intelligence sharing.\n\n\n\n\n\nThere could also be some aspirational statements about the rules-based order, or the intent to discourage and oppose aggressive action.\n\n\n\n\n\n\"But it would fall far short of anything resembling a treaty commitment,\" Medcalf says.\n\n\n\n\n\nDean agrees it's more likely Australia and the EU would support each other diplomatically to uphold rules and standards both in Europe and the Indo-Pacific.\n\n\n\nREAD MORE What is the European Union and what does it do?\n\nMedcalf points out Australia and many northern European countries share common values, including freedom of expression, the rule of law and secularism in politics.\n\n\n\n\n\n\"[Australia's political values] are much closer to countries like Denmark, Sweden and Finland than to any of our neighbours except New Zealand,\" he says.\n\n\n\n\n\nAustralia has previously manufactured a Norwegian-designed naval strike missile and German-designed armoured fighting vehicles. The EU could offer access to other sophisticated capabilities such as warships, drones and sensors.\n\n\n\n\n\n\"The risk is obviously an expectation that Australia becomes more involved in Europe security problems ... obviously that's about confronting Russia,\" he says.\n\n\n\n\n\nWhile Medcalf believes Australia should be helping countries like Ukraine to defend themselves, there are limitations.\n\n\n\nWhat we shouldn't be doing is ever raising the expectation that we could be a frontline military actor on the other side of the world.\n\nMedcalf says Europe is in a different region to Australia, and it would be difficult to deploy troops or aircraft to each other's front lines.\n\n\n\n\n\nBut Europe is highly trade-dependent and large countries like Germany and France, in particular, have an interest in maintaining the security of shipping in the Indian Ocean and the South China Sea, he says, adding that a significant number of shipping companies are also European.\n\n\n\nThe shipping route between Europe and China through the South China Sea. Source: SBS News\n\nIndonesia\n\nRoggeveen says countries in Europe and other parts of Asia are so far away they are never going to share the same vital interests as Australia.\n\n\n\n\n\nBut Indonesia's interests are largely the same as Australia's, given they are neighbours.\n\n\n\n\n\nHe says Indonesia is also predicted to be a great power by the middle of the century and likely the fourth or fifth biggest economy in the world.\n\n\n\n\n\n\"We've never had a great power on our doorstep before, and we want Indonesia to be on our side when that happens,\" he says.\n\n\n\n\n\nPrime Minister Anthony Albanese has already highlighted the importance of the relationship with Indonesia , choosing to travel there for his first overseas visit after winning re-election.\n\n\n\n\n\n\"We have no more important relationship than Indonesia just to our north,\" he told ABC's 7.30 show.\n\n\n\nIndonesia is predicted to be a great power by the middle of the century and it wants to be \"friends to all\". Source: SBS News Other experts are sceptical about the potential for a quasi-alliance with Indonesia.\n\n\n\n\n\nWhile Medcalf agrees Australia should do more with Indonesia — including to help strengthen its navy and air force, and its ability to monitor what's happening in its waters — he notes its policy is to be \"friends to all, enemies to none\".\n\n\n\n\n\n\"Which sounds great but in practice means that Indonesia is working very hard to be as neutral as it can be in future crisis situations.\"\n\n\n\n\n\nHe says Indonesia has not been willing to speak out about China's behaviour in the South China Sea and doesn't have the capability to help Australia build its own defence technology base.\n\n\n\n\n\nAustralia also has to accept that China already has a strong influence in Indonesia, he says.\n\n\n\n\n\n\"If you're looking for a country that can partly fill the gap that the US may leave — I'd be looking to Japan before Indonesia. But if Indonesia ends up getting closer to our point of view, that would be wonderful,\" he says.\n\n\n\nJapan\n\nMedcalf says some experts already characterise Japan's relationship with Australia as a quasi-alliance, and it is the most likely country to form an actual alliance with Australia, although the chances of this happening in the short term remain unlikely.\n\n\n\n\n\nHe says both Japan and Australia share a strong belief in a rules-based system, and have different strengths they could bring to the table.\n\n\n\nThey need the resources that we have. We need their technology, we need their investment.\n\nMedcalf doesn't think Japan's peace constitution — put in place at the end of World War Two to maintain its military for defensive purposes only — would be an impediment because politicians have been reinterpreting it over the last 20 years or so.\n\n\n\n\n\n\"Japan is already moving away from 1 per cent, to 2 per cent of GDP, as its military budget,\" he says, adding that Japanese forces are increasingly training in Australia.\n\n\n\n\n\nHowever, Dean believes legal and cultural barriers still make it unlikely Japan will form an alliance with Australia.\n\n\n\n\n\n\"But I think if the region was to have some type of strategic shock, or it was to really start to deteriorate, that would drive that alignment even closer together,\" he says.\n\n\n\nSome experts consider Japan is already in a quasi-alliance with Australia. Source: SBS News\n\nVietnam\n\nMedcalf says Vietnam is very good at maintaining a balanced relationship with China because it knows how to stand up to China, while also keeping the peace.\n\n\n\n\n\n\"They've been doing both for about 1,000 years,\" he says.\n\n\n\n\n\n\"[Vietnam] can defend itself, but it can also do diplomacy well.\"\n\n\n\n\n\nHowever, Medcalf says the Southeast Asian country would be very reluctant to enter into a treaty-like commitment with Australia, although there is potential for more cooperation in areas such as military training.\n\n\n\nSingapore\n\nSingapore has long been a valuable diplomatic partner for Australia and already cooperates on military training and exchanging information, Medcalf says.\n\n\n\n\n\n\"But Singapore is ultimately a very self-interested and neutral country and I think we would work with them as much as we could without the expectation that either would actually take a risk on the other's behalf.\"\n\n\n\n\n\nHe says he would put Malaysia in a similar camp.\n\n\n\nAustralian and Indonesian army tanks taking part in multi-national military exercises in Indonesia in 2023. Source: AAP / Tatan Syuflana/AP\n\nSouth Korea\n\nSouth Korea is a militarily significant country because it has a lot of capability, Medcalf says.\n\n\n\n\n\n\"They now export defence equipment to Europe,\" he says.\n\n\n\n\n\n\"South Korea is one of the few countries in the world that is genuinely able to do rapid military manufacturing at scale.\"\n\n\n\n\n\nBut the problem is it's overwhelmingly focused on defending itself against North Korea.\n\n\n\n\n\n\"Yes, they're slightly concerned about ensuring that China doesn't dominate the region. Yes, they're a US ally but they would probably be reluctant to project much further beyond the peninsula,\" he says.\n\n\n\n\n\nMedcalf says South Korea also has quite deep-seated political problems domestically, and its politics can be unpredictable.\n\n\n\nIndia\n\nMedcalf says Australia's relationship with India has advanced significantly over the past decade — with each country's navy training together frequently and sharing information. Both countries' air forces jointly monitor the Indian Ocean.\n\n\n\n\n\n\"[India] will probably be — within the next few decades — one of the three biggest powers in the world militarily, alongside the US and China.\"\n\n\n\n\n\nHowever, Medcalf says India is diplomatically very neutral and greatly values its autonomy.\n\n\n\nThey're not going to be forming permanent alliance-like relationships with anyone.\n\nWhile India does not want to witness China dominate the Indian Ocean and would likely align with other countries in the region to balance against China, Medcalf says if it came to war, there would be only very limited circumstances under which it would get involved.\n\n\n\n\n\n\"I guess they would certainly contribute to patrolling the Indian Ocean and potentially limiting China's ability to operate there, but I don't think India is going to be taking a lot of risk on behalf of others,\" he says.\n\n\n\n\n\nIndia may also expect other countries to come to its aid if there were a conflict with China on its border.\n\n\n\n\n\n\"And that would be something that I think would be difficult for other countries to think about.\"\n\n\n\nIndia is expected to be one of the biggest military powers within the next few decades, but it values its neutrality. Source: SBS News\n\nPhilippines\n\nThe Philippines is one of the countries that claim parts of the South China Sea, which has led to clashes with China over issues such as fishing rights, islands and territories, Medcalf says.\n\n\n\n\n\n\"The Philippines has traditionally been quite a weak military power but they're beginning to modernise their forces and their location is strategically very important — they're right at the heart of the sea lanes of Asia.\"\n\n\n\n\n\nWhile the Philippines is an American treaty ally, under former president Rodrigo Duterte, it became closer to China.\n\n\n\n\n\nMedcalf says it would make sense for Australia to have the Philippines as a partner, but caution is needed when considering the limits of its power and whether another change in government could alter dynamics.\n\n\n\nIt's yet another example of how it's a nice idea to try and stitch all of these relationships together into something larger but without the Americans involved somewhere along the line, it still becomes quite flimsy.\n\nThe Philippines has started modernising its military forces. Source: SBS News\n\nCanada\n\nLike Australia, Canada is a middle-sized power but in some ways, it is militarily weaker. It's also a long way away.\n\n\n\n\n\nBut Medcalf points out Canada is technically part of the broader Pacific region as its western coastline borders the Pacific Ocean.\n\n\n\n\n\nIt's also surprisingly active in the region — supporting the UN efforts in East Asia to prevent illegal trade with North Korea and the smuggling of parts or precursors for weapons of mass destruction.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-governments-super-changes-for-high-earners-explained/co8qup372",
        "title": "The government's super changes for high earners, explained",
        "publish_date": "Fri, 6 Jun 2025 09:54:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "The government's super changes for high earners, explained\n\nPublished 6 June 2025, 8:24 am\n\nNew research into the government's plans to increase the tax on high-income earners' superannuation has revealed it could eventually apply to half a million Australians. Labor is moving to pass its contentious plan for 30% taxes on earnings for multi-million dollar balances when parliament returns. SBS Chief political correspondent Anna Henderson explains.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/coco-gauff-defeats-top-ranked-aryna-sabalenka-to-win-her-first-french-open-title-20250608-p5m5pq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coco Gauff wins French Open for ‘people like me in America’",
        "publish_date": "Sun, 08 Jun 2025 12:05:49 +1000",
        "category": "sports",
        "authors": [
            "Eugene Allen",
            "Simon Briggs"
        ],
        "text": "Coco Gauff lifted her maiden French Open title on Saturday afternoon and then told reporters that she hoped to be a “reflection of hope and light” for “people that look like me in America”.\n\nGauff, who also won the US Open in 2023, is the seventh woman of colour to become a major tennis champion. One of the most politically engaged players on the modern tour, she feels a deep responsibility to the African-American community.\n\n“Obviously there’s a lot going on in our country right now,” Gauff said. “I remember after the election, it kind of felt [like a] down period. My mum told me during [November’s WTA Finals in] Riyadh, ‘Just try to win the tournament just to give something for people to smile for’. So that’s what I was thinking about today when holding that [trophy].\n\n“And then seeing the flags in the crowd means a lot. I’m definitely patriotic and proud to be American, and I’m proud to represent the Americans that look like me and people who support the things that I support.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/katy-perry-melbourne-20250604-p5m4vp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "If you dream it, you can be it: The Katy Perry ethos takes flight in Melbourne",
        "publish_date": "Sun, 08 Jun 2025 11:22:02 +1000",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "MUSIC\n\nKaty Perry | The Lifetimes Tour ★★★★\n\nRod Laver Arena, until June 14\n\nKaty Perry is pure pop. Her songs promise, and mostly deliver, a good time. And her Lifetimes concert does the same, across two and a half hours, five acts, multiple costume changes and more than 20 songs from a back catalogue stretching to 2008 (the pre-Perry Christian singer Katy Hudson gets a brief acknowledgement but no stage time).\n\nBut this big, spectacular, noisy and surprisingly intimate show also has grander ambitions, in which it has mixed success.\n\nKaty Perry on stage at Rod Laver Arena. Credit: Martin Philbey\n\nIt’s all there in the framing device: a video game in which KP143, an “enhanced” version of Katy Perry, attempts to unseat Mainframe, the AI that has come to rule humanity rather than serve it. To do so, she must free the butterflies that have been captured to power the AI, and to do that she needs to collect love, in the form of glowing hearts that descend from the arena rafters.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 08 Jun 2025 10:59:39 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "WHERE AM I?\n\nWhere is this museum located? Credit: Richard Cornish\n\nThis Melbourne museum is dedicated to firefighting and fire safety, boasting Australia’s largest collection of fire brigade memorabilia. It houses 10,000 items including vintage fire trucks, helmets, uniforms and other equipment. What is the name of the museum, and where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? The culturally significant Moreton Bay fig tree is located in Carlton Gardens.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/how-a-cringing-austria-came-to-embrace-the-sound-of-music-20250604-p5m4qk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This film used to make Austria cringe. Now it brings in $1.8b",
        "publish_date": "Sun, 08 Jun 2025 10:50:27 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "The film draws more than 350,000 tourists a year, pumping millions into hotels, bus tours, strudel stands and gift shops stocked with marionette goats. It’s estimated to contribute well over €1 billion ($1.8 billion) to the regional economy. But the city’s conversion from reluctant star to musical mecca didn’t happen overnight. It has had to find a balance between preserving its baroque dignity and leaning into the twirling optimism that has defined it for generations of visitors. Rob Harris at Salzburg’s Mirabell Gardens. Credit: Rob Harris On a walking tour through the Old Town, I follow Igor, a whip-smart guide with a dry wit and a bottomless well of trivia. As we pass the fountain in Residenzplatz, where Maria sang I Have Confidence, he hits his stride. “At this point,” he says, pausing for effect, “I must tell you something important. We do not eat schnitzel with noodles, this is not Austria.” He shrugs. “And please no French fries. You have it with erdapfelsalat [potato salad].”\n\nJulie Andrews, who turns 90 this year, remains the brightest star to shine over Salzburg. Her Maria didn’t just conquer the von Trapps – she conquered the world. Still, Salzburg isn’t only Maria’s city. Mozart, of course, still looms – his birthplace lovingly preserved, his likeness on everything from chocolates to shampoo. He may have composed more than 600 works and changed music forever, but in the battle for Salzburg’s most requested soundtrack, Edelweiss is giving Eine kleine Nachtmusik a real run. On the Sound of Music official coach tour, our guide “Big Dave” – a gruff but rather camp Englishman – points to the Alps. “Those mountains they climb at the end?” he says. “They lead to Germany, not Switzerland. You wouldn’t go that way.” He chuckles. “Not unless you were mad … or Maria.”\n\nThe group, a mix of Americans, Brits, Koreans, Australians and Indians, laughs in unison. One of them starts singing Sixteen Going on Seventeen. Another joins in. It’s off-key, unfiltered, unhinged and completely perfect. We end up in Mondsee – a quaint, pastel-painted village a short drive from Salzburg, where the film’s iconic wedding scene was shot. The Basilica of St Michael, where Maria walked down the aisle in her satin gown, is every bit as grand in real life. Local gift shops sell goat marionettes. Credit: Rob Harris Across the square, I wander into a gift shop and give in completely. I buy a marionette goat – a nod to The Lonely Goatherd, obviously – a Julie Andrews postcard and an original copy of The Story of the Trapp Family Singers, Maria von Trapp’s autobiography. The book is more religious and rugged than the film, but somehow just as inspiring. The real Maria was steel wrapped in sincerity. That afternoon, in Salzburg’s famed Marionette Theatre, I watch the entire story play out with tiny wooden figures. It shouldn’t work – and yet it does. There’s something fragile and beautiful about seeing strings lift these little characters skyward as they sing of confidence, courage and farewell.\n\nThe puppets take their final bow. I quietly wipe a tear. The next day by the famous lake where Maria and the children fell out of the boat, I meet Peter Husty, chief curator at the Salzburg Museum. Von Trapp family puppets at the Salzburg Marionette Theatre. Credit: He tells me a new museum will open near Hellbrunn Palace next year, just steps from where the famous gazebo, in which Liesl and Rolf serenaded each other, now stands. “There have been ideas for a museum for 25 years,” he says. “But we’re official and serious – we’re not a private, commercial thing. It’s not going to be an excuse for a gift shop.”\n\nThe museum aims to tell two stories: the Hollywood legend, and the Austrian reality. “People come for Julie Andrews, but they often don’t know there was a real Maria von Trapp,” he explains. “The family’s story is a mirror of 20th-century Austrian history – monarchy, war, loss and emigration.” Husty has spent years buying and begging from extensive private collections, including global film posters, soundtracks and rare memorabilia. “We won’t make it a cinema – we’ll tell stories, show objects, backstage photos. It’s a cultural history.” For Husty, the film’s impact is still striking.\n\n“Every time I see a group rush to the gazebo, singing, I say it’s like a pilgrimage,” he laughs. Aerial view of the historic city of Salzburg with Hohensalzburg Fortress in beautiful evening light in fall, Salzburger Land, Austria. Credit: iStock When he curated the first local exhibition of the film in 2011, he even changed the carillon in Mozart Square to play Edelweiss. Tourists looked up, singing. Salzburgers called the museum asking, “What the hell is that music?” And that, really, is the point. The Sound of Music has never been about historical accuracy. It’s about the refusal to be cynical. It believes that music can heal, that family can triumph, and that confidence can be sung into being. Today, in a world spinning faster and more frantically than ever, The Sound of Music remains a gentle act of resistance. It reminds us that optimism isn’t naive. It’s necessary.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghan-to-pause-as-ever-20250604-p5m4r1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan to pause As ever",
        "publish_date": "Sun, 08 Jun 2025 09:45:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan to pause As ever\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/la-protesters-clash-with-authorities-20250608-p5m5qm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "LA protesters clash with authorities",
        "publish_date": "Sun, 08 Jun 2025 09:41:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "LA protesters clash with authorities\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/how-the-ryles-revolution-mirrors-ciraldo-s-bulldogs-rebuild-20250607-p5m5nq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How the Ryles revolution mirrors Ciraldo’s Bulldogs rebuild",
        "publish_date": "Sun, 08 Jun 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "“That was the biggest thing for me at the time. It’s an example that I thought was pretty relevant to use at the time.” Both endured baptisms of fire. Ciraldo’s Bulldogs finished above only the Dragons and Tigers on the NRL ladder after his first year in charge. A total of 15 players either left the club or didn’t play in Ciraldo’s first season in charge, as the new coach brought in recruits he knew would buy into his culture and defensive systems. Many of the new signings were dubbed “utilities”; those capable of playing in numerous positions, without having ever made one their own at their past clubs. Belmore wasn’t built in a day: The 2023 season couldn’t end quick enough for Cameron Ciraldo’s Canterbury. Credit: Getty And yet the turnaround was relatively swift. After the tough initiation that was the 2023 season, the Bulldogs made the finals last year, where they were knocked out in a close loss to Manly on the opening weekend. They have improved even further this season, to the point where they are the outright competition leaders at the halfway point. Parramatta powerbrokers hope the club is on a similar upward trajectory. They have given Ryles, whose side currently sits in 16th spot, a mandate for change. It’s a similar position to the one the Bulldogs were in during Ciraldo’s first year in charge.\n\n“They’re sitting on top of the table at the moment, so you’ve got to respect the change that club’s gone through,” Eels chief executive Jim Sarantinos says of the Bulldogs’ resurgence. “They obviously had a number of years where they had some lean periods, but they certainly seem to be moving in the right direction in a lot of areas. Parramatta CEO Jim Sarantinos at the club’s new $70million centre of excellence at Kellyville last month. Credit: Edwina Pickles “We’re on a journey ourselves … I guess some of the parallels are that both coaches serve long apprenticeships as assistants at successful clubs, but this is their first foray into head coaching. “But the other parallel is putting their imprint on the club, on the football team through the style in which they want to play, the principles that they want to instil within the team. There’s how that translates into what they do on the field, but also what they do off the field, in terms of behaviours and standards.\n\n“There’s obviously changes in personnel that need to be made. I think [Ryles] has shown the conviction to make some difficult decisions that he knows are going to benefit the club and the football program in the medium to longer term. That takes some courage to do. He’s got to be applauded for that. “I think in that way there are a lot of similarities to the journey that Cameron’s gone on at the Dogs to where we are, where Jason’s starting out. I do have some confidence that our progression will be reasonably quick.” Ryles hasn’t shied away from making the tough calls. Captain Clint Gutherson, reigning Ken Thornett medalist Reagan Campbell-Gillard and prolific tryscorer Maika Sivo – a trio of cult heroes – were allowed to leave. Dylan Brown will soon follow them after the Eels opted not to engage in a bidding war with Newcastle for his services. Other players on big money, including Ryan Matterson, Shaun Lane and Bryce Cartwright, are no longer automatic first-grade selections. Joe Ofahengaue was allowed to leave early. The result has been the blooding of a slew of youngsters, at a time when the club’s two biggest stars, Mitchell Moses and Zac Lomax, have taken to the field together just twice due to injuries.\n\nThe result has been some tough times, particularly early in the season. In Ryles’ first game in charge, he went head to head against one of his mentors, Melbourne coach Craig Bellamy. The result was a 56-18 hiding. “While it all feels good [announcing a new coach], they then roll the scoreboard out and it starts giving you feedback,” Ryles muses. Joash Papalii, who made his Eels debut last month, is tipped as a star of the future. Credit: Parramatta Eels Like Ciraldo, Ryles didn’t allow a horror initiation to derail his vision. While there have been other tough days in the office, there have also been some positive signs of late. Isaiah Iongi, Ryley Smith, Jordan Samrani, Kitione Kautoga, Joash Papalii, Sam Tuivaiti and Toni Mataele are youngsters showing promise. More junior talent will emerge in coming years after the Eels made the SG Ball grand final. The senior players have also bought into Ryles’ methods.\n\n“There’s been no problem with that from the start,” Ryles says. “Mitchell and Junior [Paulo] have been really big help in that regard. They have embraced the change and the players have followed their lead and helped me enormously. “I haven’t had a lot of pushback and I have been pretty open with them and patient as well. I’ll continue to do that. There’s been no rotten eggs, all the players have bought in and worked really hard. “We’ve seen some younger guys get some opportunities well before they would at any other club. Some have taken to it and some have taken a bit more time, but that’s to be expected.” Even Moses, in a career that has spanned well over 200 NRL games, has had his eyes opened. “You think you know your way around a game or think you know everything you need to know,” Moses said recently. “But the last seven months under Jason Ryles and [assistant] Nathan Brown, I’ve learnt so much about my footy.”\n\nLoading Defence has been Ryles’ strong suit and on this front there has been progress, as evidenced by the concession of just 34 points in Parramatta’s last three games. However, the improvements weren’t enough to sway Lachlan Galvin – earmarked as Dylan Brown’s long-term replacement – to choose the Eels over the Bulldogs. “We’ve moved on from it,” says Ryles, who will take his time in deciding how to spend his war chest. The Eels believe that, if the right player comes onto the market, they will be able to make a compelling case. The club has just opened the world’s biggest rugby league facility, a new $70 million centre of excellence. A slew of youngsters are showing promise and their coach has enhanced his reputation, despite the team’s current lowly standing on the ladder. Their immediate focus, however, is taking on the high-flying Canterbury. Ryles is full of admiration for what the “Family Club” has achieved under Ciraldo.\n\n“Definitely,” Ryles says. “I spoke to Cameron a couple of times along the journey and I like how his teams play. “He’s a good fella and I like how connected the club is at the moment at the Bulldogs. There’s certainly some stuff there to take away. He’s making the most of what he’s got and obviously gone out and recruited really well as well.” Perhaps Parramatta are about to enjoy a similar revival to the Bulldogs? “I don’t really care what any other club has done,” Ryles says. “We’re going on a journey with the challenges that we’re presented with and dealing with them each day, with the foresight of making sure we improve day on day, week on week and hopefully year on year. “That’s my main focus. I’m not too fussed about what any other club has done.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/huni-shocked-by-unbelievable-ko-20250608-p5m5q7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Huni shocked by 'unbelievable' KO",
        "publish_date": "Sun, 08 Jun 2025 08:30:52 +1000",
        "category": "finance",
        "authors": [],
        "text": "Huni shocked by 'unbelievable' KO\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/shots-fired-at-sydney-home-20250608-p5m5q0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shots fired at Sydney home",
        "publish_date": "Sun, 08 Jun 2025 07:20:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shots fired at Sydney home\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/gauff-wins-maiden-roland-garros-title-20250608-p5m5pv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gauff wins maiden Roland-Garros title",
        "publish_date": "Sun, 08 Jun 2025 06:50:36 +1000",
        "category": "sports",
        "authors": [],
        "text": "Gauff wins maiden Roland-Garros title\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/haslers-frosty-reply-to-touchy-question-20250608-p5m5pt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hasler's frosty reply to touchy question",
        "publish_date": "Sun, 08 Jun 2025 06:10:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Hasler's frosty reply to touchy question\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/conservation/an-outdoor-influencer-rallied-against-higher-camping-fees-23-000-people-responded-20250519-p5m0e2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An outdoor influencer rallied against higher camping fees – and 23,000 people responded",
        "publish_date": "Sun, 08 Jun 2025 05:45:00 +1000",
        "category": "finance",
        "authors": [
            "Caitlin Fitzsimmons"
        ],
        "text": "Crook said Parks Victoria had been starved of funding for years, including a $95 million cut last year, and the free booking system imposed a burden on rangers. The NSW government wants to tackle “ghost bookings”, where campers reserve a spot but don’t show up. Credit: Dean Sewell “They’d have to monitor the campsites more than they were, and then sometimes it was turning into fisticuffs, when people didn’t turn up, but people still camped in their spots,” Crook said. “There were a lot of issues, a lot of dumped rubbish, fires left alone, and the potential for bush fires. It looked good on paper, but in action with a park service that’s so degraded and not looked after by the state, it was always going to fall in a heap.” NSW has 360 campsites in national parks, as well as free camping in state forests managed by Forestry Corporation of NSW.\n\nIn NSW, the online backlash has centred on whether the fees for national parks are too high. While the proposal would introduce a free tier for a bare patch of earth, a basic campsite with a pit toilet would be $22 a night in high season, while sites with the most facilities – including a hot shower – would be $89 a night. Atkinson, an outdoor creator whose video posts on Instagram, TikTok, Facebook and YouTube have garnered millions of views, has been campaigning against the price rises. Now that submissions have closed, he has switched to pushing an online petition. Atkinson acknowledged that ghost bookings are a big issue – a video he posted in July last year showed a campground in Kosciuszko National Park that was booked out, yet had four out of five sites empty – but said making camping unaffordable was not the way to fix it.\n\nHe recently posted a video about how the price to pitch a tent at Woody Head campground in Bundjalung National Park was more expensive than renting a three-bedroom house in the nearby town. Atkinson said only about 30 per cent of campgrounds had a booking system before the COVID-19 pandemic, while most were free and first come, first served. NPWS expanded the booking system to cover every campsite as a pandemic measure, though keeping prices for the formerly free locations low. Like in Victoria, the ease of online reservations increased “ghost bookings”. “They didn’t have a ghost booking problem before COVID happened,” Atkinson said. “The only way to make a booking system work is to make it expensive – but, if you do that, you block out anyone below middle income, and young people are just going to be completely discouraged, so that is a very poor solution.”\n\nHe said it would be better for the basic campsites to be free, without a booking system – a proposal NPWS argues would encourage people to physically block out campsites by erecting tents early. Atkinson said the practical hurdles kept this problem in check, and added that NPWS should expand campsite capacity to meet demand anyway. Former NPWS park ranger Louisa Andersen, who posts content online as “Ranger Louie” and is now based in Western Australia, said she had concerns about the prices. “How are people meant to care about the environment and parks and natural places if they can’t afford to experience it?” Andersen said. “Rangers don’t get discounts either … and I just can’t wrap my head around or justify paying that much.”\n\nSergey Kolotsey of Baulkham Hills made a submission proposing to solve the ghost booking problem without raising fees by asking people to pay a deposit that would be refunded if they checked in using a QR code at the campsite. Loading The NSW National Parks Association submission recommended merging the lower pricing tiers, since the costs of managing a wholly unserviced site, sites with pit toilets, and sites with pit toilets and a table were all minimal. The non-government organisation expressed surprise that there was no benchmarking of best practice across the nation, since many bushwalkers and campers travel from state to state. “Queensland and South Australia have simplified their fee structure and remain competitive with regional caravan parks,” the submission says.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/albanese-need-not-shy-away-from-his-catholic-roots-20250606-p5m5lt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Albanese need not shy away from his Catholic roots",
        "publish_date": "Sun, 08 Jun 2025 05:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Barney Zwartz"
        ],
        "text": "Australian historian Manning Clark described the Australian attitude to spirituality as “a shy hope in the heart”. We are uncomfortable with overt displays of religiosity or, indeed, strident atheism.\n\nFor most Australians, to be asked by a stranger (as happens in the US) if they know Jesus as saviour would be cringe-making. This is the cultural context in which Prime Minister Anthony Albanese, who visited the newly installed Pope Leo XIV last month, claimed a strong Catholic heritage, then almost immediately repudiated that by telling journalists his faith played no role in his politics.\n\nIt seems that Albo’s faith is not so much shy as painfully introverted. It scarcely figures in his discourse compared with, say, his struggles growing up with a single mother in a council house. This is not to doubt his personal faith, but to suggest that he is constrained in the public arena.\n\nAnthony Albanese and Pope Leo XIV met for about 45 minutes. Credit: Vatican Media\n\nHis papal visit and later counter-balancing remarks were carefully calibrated to please – or, at least, appease – both sides of the divide. Catholics are a quarter of the population, and agnostics probably more than half.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/tradies-cheap-and-easy-solution-to-aussie-housing-problem-064257251.html",
        "title": "Tradie's 'cheap and easy' solution to Aussie housing problem",
        "publish_date": "2025-06-07T06:42:57Z",
        "category": "finance",
        "authors": [],
        "text": "One business owner's clever idea means that Aussies can get a new home in 12 days for less than $70,000.\n\nThe ongoing housing crisis is a topic of conversation on the tip of most Australians' lips, whether you're a renter or a property owner. Many are quick to point to high demand, low supply and skyrocketing prices as causes of the problem, but few can come up with solutions that keep all stakeholders happy.\n\nA former tradie has been quietly working away on an answer to the problem, which costs under $100,000 and takes just 12 days to build. Brad Busuttil, an electrician turned business owner, transforms shipping containers into homes.\n\nThe low-cost alternative to traditional housing won't be right for everyone, but select Aussies are snapping them up to put on their land, and freeing up housing stock elsewhere while doing so.\n\nBrad, from Victoria, told Yahoo News he built his first shipping container home \"for a little bit of fun\" before realising just how \"cheap and quick and easy it was to do\". With a background in affordable housing, he decided to offer the product to the public and has been astounded by their popularity.\n\nBrad walking through one of his tiny homes (left) and one under construction. Source: TikTok/deluxetinyhomes\n\nHe now sells container homes to Aussies around the country through his business, Deluxe Tiny Homes, which cost between $45,000 to $70,000 to buy.\n\nADVERTISEMENT\n\nThis year, he's already delivered 15 tiny homes to clients around the country, with his main customers fitting into three different demographics. \"There are investors, so people who have plots of land they don't know what to do with and don't want to do a half-million-dollar build,\" he explained.\n\n\"There are then people who are about to build a new home, and rather than rent out another property for 12 months, they pop it in the backyard and live there. The third one, which is most common, is people with elderly parents close to retirement age,\" he said.\n\nHow are tiny homes made?\n\nBrad explained that the container homes are built \"exactly like a normal house\", with the same set of standards as a new build house. \"That way we have no issues,\" he said.\n\nADVERTISEMENT\n\nThe shipping containers are brand new, and are \"heavily insulated\" and water sealed before framing, plastering, floorboards, as well as a kitchen, laundry and bathroom are installed. The entire build is done off-site, and delivered, where customers are given instructions on how to connect the electrical and plumbing.\n\nWith the housing crisis an ever-present threat, he believes it's a short-term option for those in need. \"People can't get into houses, this is a good short-term solution,\" he said, explaining that while the homes are \"comfortable\", they're \" not massive\".\n\nDespite admitting they are not going to be a long-term solution for most people, Brad believes his tiny houses will \"outlive any of us\".\n\n\"There's a misconception they'll rust and fall apart, but a lot of people forget these containers are designed to spend their entire life out at sea with corrosive water,\" he said.\n\nTiny houses to serve as 'part of a suite' of solutions\n\nDr Peter Davies, a leading sustainability researcher at Macquarie University, told Yahoo News tiny houses have a place in helping Aussies afford housing. He'd like to see the concept used as \"part of a suite\" of solutions, but not a \"reactive response\" to a lack of housing supply.\n\nADVERTISEMENT\n\nDavies believes that one factor exacerbating the housing problem in Australia is that, for the most part, people want larger homes. But smaller, and even tiny houses, are \"generally something that needs to be explored more fully in the suite of housing solutions\", he said.\n\nDavies said he wouldn't underestimate the value of the low time and financial investment needed to build a tiny home, but what he doesn't want to see is it being used as a \"substitute for poor planning outcomes\", and a longer-term solution is still required.\n\nSo, what would a longer-term solution look like? Dr Heather Shearer, an engineering and built environment academic at Griffith University, believes that this comes as an increase in medium-density zoning in Australia's big cities.\n\n\"It's what they call the missing middle,\" she said. These properties include smaller townhouses and duplexes as opposed to larger family homes or apartment complexes. \"Suburbs need to have higher density but not vertical sprawl high rises,\" she explained.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/controversial-alcohol-alternative-coming-to-woolworths-this-month-impacts-can-vary-044858845.html",
        "title": "Controversial 'alcohol alternative' coming to Woolworths this month: 'Impacts can vary'",
        "publish_date": "2025-06-07T04:48:58Z",
        "category": "lifestyle",
        "authors": [],
        "text": "It's long been used in traditional ceremonies across Polynesia – but it's increasingly being embraced in the commercial world.\n\nThe surprising product line will appear on Woolworths shelves this month. Source: Getty\n\nA plant-based product promising relaxation, mood boosts, and even a safer alternative to alcohol is set to hit Woolworths shelves this month.\n\nA bitter-tasting drink made from the root of a Pacific Island plant, kava has long been used in traditional ceremonies across Polynesia. Now, it's being marketed as a wellness beverage in supermarkets across Australia. But not everyone is convinced.\n\nWhile the plant is often marketed as natural and non-intoxicating, the science behind kava’s safety and efficacy is still emerging, particularly when it comes to modern, concentrated formulations, Dr Blair Aitken from Swinburne’s Centre for Mental Health and Brain Science, told Yahoo News.\n\nSome hail its calming effects and link the substance to lower anxiety, while others warn that these commercialised forms come with poorly understood health risks and little regulation.\n\nADVERTISEMENT\n\n\"Kava contains active compounds called kavalactones, which can have a calming effect by influencing brain chemicals like gamma-aminobutyric acid (GABA) and dopamine,\" Dr Aitken explained. \"It may reduce anxiety and promote relaxation without the intoxicating effects of alcohol, but its impact can vary widely depending on the formulation and dosage.\n\nA plant-based product claiming to be a safer alternative to alcohol is set to launch on Woolworths shelves this month in powder form. Source: Getty/FijiKava\n\n\"Kavalactones increase levels of GABA, a neurotransmitter that helps calm the brain and nervous system. They also enhance dopamine levels, which may improve overall mood and create a mild sense of well-being, and they slow down brain signals by blocking sodium and calcium channels, reducing overactivity in the nervous system.\"\n\nWoolworths is the latest major retailer to introduce kava-based products, joining Coles, which already offers a small range, including powders and capsules.\n\nThe move is part of a broader trend following the federal government's 2021 import pilot program, which eased access to kava across most of the country. Commercial availability has since expanded, with products now found in chemists, health food stores, and increasingly on supermarket shelves.\n\nTraditional kava is drink made from the roots of the kava plant, found in the Pacific Islands, mixed with water. Source: Getty\n\nAre there risks associated with kava?\n\nUnlike alcohol, Dr Aitken said, kava doesn’t typically impair motor skills or reaction time when used in traditional or therapeutic amounts. \"Its effects are more subtle and stabilising rather than intoxicating,\" he said. However there are still concerns, particularly when it comes to modern extracts and non-traditional preparations, he added.\n\nADVERTISEMENT\n\n\"There is no well-established toxic dose for kava,\" Dr Aitken said. \"Most capsule formulations range from 50 to 100 mg of kavalactones, with a recommended maximum daily dose of 250 mg.\"\n\n\"When prepared traditionally and used within recommended amounts, kava is considered safe by both the World Health Organisation and the Australian government. The substance shows few serious side effects when used short-term at recommended doses,” he said. \"However, higher risks may occur with modern extracts, combined use with alcohol or medications, high doses, or use by individuals with underlying liver issues.\"\n\nKava has long been used in traditional ceremonies across Polynesia. Source: Getty\n\nResearch into kava’s use for treating anxiety has yielded mixed results. \"While earlier trials showed promising results in generalised anxiety disorder, a more recent study by the same research group did not replicate those findings,\" Aitken said. \"Kava appears more effective for situational or mild anxiety, rather than as a first-line treatment for diagnosed, clinically relevant anxiety.\"\n\nWhy is kava banned in the NT?\n\nIn Australia, kava is regulated as a food when imported for personal use or through approved programs. The Northern Territory bans personal importation and restricts use under separate legislation due to concerns about misuse and harm. Other states and territories allow limited personal use under federal guidelines. Internationally, the substance has a range of legal classifications — it's listed as a psychoactive substance in New Zealand, for example.\n\nADVERTISEMENT\n\nThe way kava is prepared also plays a key role in its safety. Traditional water-based methods extract kavalactones while leaving behind many of the potentially harmful compounds. In contrast, modern commercial products sometimes use alcohol or acetone as solvents, which can extract flavokavains—compounds that may negatively affect the liver and nervous system. Some also include stems or leaves, which have different and more toxic chemical profiles than the root.\n\nColes offers several kava products, though not all have clear labelling around kavalactone content. For example, FijiKava Noble Root Powder contains an estimated 70–150 mg per 2.5g serving, but the exact amount is not specified. The TakiMai 50mL kava shot also lacks precise dosing information. By contrast, Bioglan Kava capsules sold at Chemist Warehouse offer standardised dosing, with 60 mg per capsule and a recommended daily intake of 60–120 mg — well within safe limits.\n\nThe science behind kava’s safety and efficacy is still emerging, particularly when it comes to modern, concentrated formulations. Source: Getty\n\n\"Transparent labelling is essential,\" Dr Aitken said. \"Consumers should monitor their intake carefully and stay within the recommended daily limit.\"\n\nDr Aitken is also a member of the International Council on Alcohol, Drugs and Traffic Safety (ICADTS) Special Interest Group for 'Driver State Monitoring Systems,' and noted that while kava is not typically associated with impairment, more research is needed around its effects on alertness and driving, especially at higher doses or in combination with other substances.\n\nADVERTISEMENT\n\nWith Woolworths set to join the expanding commercial kava market, health professionals are calling for increased transparency, clearer consumer education and regulatory oversight. \"Just because it’s natural doesn’t mean it’s risk-free,\" he said.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]