[
  {
    "url": "https://www.9news.com.au/national/monash-ivf-independent-review-into-two-separate-embryo-bungles-kept-secret/80eb86ff-c9fb-46b6-aff5-128855bade22",
    "title": "Fertility giant to keep review secret after two IVF bungles",
    "publish_date": "Wed, 20 Aug 2025 01:31:36 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "An Australian fertility giant will keep an independent review into two separate embryo transfer bungles a secret.\n\nMonash IVF previously apologised after a patient's embryo was \"incorrectly transferred\" back to her instead of her partner at a Melbourne clinic.\n\nIn a different incident at the ASX-listed company's Brisbane clinic in 2023, a woman gave birth to a stranger's child following an embryo mix-up.\n\nREAD MORE: Netanyahu launches extraordinary personal attack on Albanese\n\nMonash IVF said it would keep the results of an indpendent review sealed. (9News)\n\nMonash IVF said a review undertaken by barrister Fiona McLeod into the two unrelated cases was now complete but confirmed the full report would remain sealed to protect the privacy of the affected patients.\n\nThe mix-up at the clinic in Clayton in Melbourne's south-east was blamed on a range of factors, including IT system limitations.\n\n\"Those limitations ultimately made subsequent processes more vulnerable to human error,\" Monash IVF said in a statement to the ASX.\n\nThe review concluded the Brisbane incident was a result of human error.\n\nREAD MORE: US destroyers head toward Venezuela as Trump aims to pressure drug cartels\n\nIt was noted the two clinic incidents were \"unrelated, different in nature and occurred some years apart\".\n\n\"Both cases involved non-standard IVF treatments and circumstances that would not arise in the vast majority of IVF procedures,\" the statement continued.\n\nMonash IVF announced in June that a patient's own embryo had been transferred back to her, instead of the treatment plan at the Clayton clinic which had designated the transfer to her partner.\n\n9news.com.au understands that patient had hoped to carry her same-sex partner's baby.\n\nMonash IVF admitted to two embryo-related bungles in Melbourne and Brisbane. (Supplied)\n\nA few months earlier in April, Monash IVF confirmed a woman in Brisbane had been mistakenly implanted with the wrong embryo and given birth to a child she was unrelated to in 2023.\n\nMonash IVF said it has already implemented many of the independent review's recommendations and identified more safeguards following an internal review.\n\n\"To the affected patients and everyone who entrusts Monash IVF with their dreams of building a family, we are deeply sorry for the distress these incidents have caused,\" Monash IVF Group acting chief executive Malik Jainudeen said.\n\n\"We have implemented or will be implementing the recommendations of the independent review and have taken additional measures to reduce the risk of such incidents occurring in the future because the care and safety of our patients is and will always be at the heart of everything we do.\n\n\"For more than 50 years, MVF has been there for patients through more than 50,000 births and we look forward to continuing to support families with their fertility journey.\"\n\nMonash IVF will release its full-year results next week.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/sydney-toddlers-painful-shopping-centre-eye-injury-sparks-call-for-change/ab09e8bd-712a-4e2a-a7b2-8cbe022e5b7e",
    "title": "Sydney toddler's painful shopping centre eye injury sparks call for change",
    "publish_date": "Wed, 20 Aug 2025 01:19:52 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A Western Sydney mother is on a mission to make retail stores safer for children after her daughter came within millimetres of being blinded in one eye by a metal hook.\n\nMaureen Ahluwalia was shopping with her two-year-old daughter, Amaira, at homewares and clothing store Harris Scarfe in Blacktown last month when the scary accident occurred.\n\nAhluwalia said her daughter was not running around, but walking calmly next to her when she suddenly collided with a slat wall hook placed at toddler height.\n\nAmaira's mother has called for retail stores to take the safety of children in their store more seriously. (Supplied)\n\n\"She turned around to do something and when she turned back she hit her eye,\" she said.\n\n\"I just saw her grab her eye and she was crying.\"\n\nAhluwalia said was confronted with how serious the injury was when her daughter opened her eye.\n\n\"She opened her eye, and there was blood starting to pool into it,\" Ahluwalia said.\n\nActing on the advice of a family member, Ahluwalia immediately rushed her daughter to see an optometrist located in the same shopping centre.\n\n\"The optometrist said that she barely missed her cornea,\" Ahluwalia said of her daughter's injury.\n\n\"If it was a millimetre in, she would have lost her vision.\"\n\nAmaira was left with a blood clot on her eye, which has since gone away.\n\nAhluwalia said she was grateful her daughter had fully recovered, but she was left furious when she went online and saw how common it was for metal hooks in shops to cause eye injuries among toddlers.\n\n\"The issue is, why are these hooks being placed at toddler height in the first place?\" she said.\n\n9news.com.au contacted Harris Scarfe owners, the Spotlight Retail Group, however they did not respond to a request for comment before publication.\n\nIn 2020, 9news.com.au reported on a spate of grisly eye injuries toddlers had sustained at Kmart and Target stores.\n\nAmong those injured was six-year-old Cecilia Chen, who was shopping with her grandmother at Kmart's Chatswood store when she collided with an apparel arm hook.\n\nCecilia needed two surgeries to repair her torn eyelid and damage to her eye.\n\nHer mother, Jill Huang, took legal action against Kmart, and the retail giant was ordered to pay the family almost $60,000 in compensation.\n\nIn response to Cecilia's case, and a string of similar accidents, Kmart and Target rolled out safety changes in December 2020, which involved adding soft plastic covers to the ends of apparel arms in stores nationwide.\n\nAhluwalia said she would like to see all retail stores implementing similar safety measures.\n\nThe mother has started a NSW parliamentary petition calling on mandatory safety standards for retail fixtures to be implemented.\n\nThe petition has gained the support of Labor MP for Blacktown, Stephen Bali, who will present the petition to the NSW Legislative Assembly.\n\nVictorian mother Amira Good said changes were needed on a national level after her son Ryder was left with a nasty injury to his face by a metal store hook in June.\n\nGood was shopping with her 2-year-old son in Kmart's Brunswick store when he collided with a metal hook in the cosmetic section.\n\nAlthough Kmart stores typically have plastic price tags covering the ends of the cosmetic rack hooks, many of the plastic slips were missing at the time, leaving pointed metal bars exposed at toddler height, Good said.\n\n\"We were just walking, and there was a metal hook hanging out at Ryder's height and as he walked past, it scraped his face,\" she said.\n\n\"He got a cut millimetres under his eye, and it went all the way from his cheek to his ear,\" Good said.\n\n\"There was so much blood.\"\n\nTwo-year-old Ryder was left with a gash across his cheek after he collided with a metal hook in Kmart's Brunswick store. (Supplied)\n\nA Kmart spokesperson told 9news.com.au the retailer was aware of the incident at its Brunswick store.\n\n\"Our thoughts are with those impacted. We are cooperating with relevant parties as we review the matter and are unable to comment on the specifics,\" the spokesperson said.\n\n\"We want to assure our customers and team members that their safety is our highest priority.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/more-australians-choosing-solo-motherhood-claire-steinke/fe1edbd3-02d3-44c8-bbe4-2cb9a81cc6a8",
    "title": "More Aussies are becoming solo mums by choice. Claire had no other option",
    "publish_date": "Wed, 20 Aug 2025 01:29:37 +0000",
    "category": "lifestyle",
    "authors": [
      "Aug"
    ],
    "text": "Single mothers now they make up more than 12 per cent of the nation's families.﻿\n\nA growing number are solo mums by choice, like Claire Steinke, who decided to have children on her own after being diagnosed with cancer at 29.\n\nBut 20 years after welcoming her first, there's still a lack of transparency around ﻿assisted reproductive technology (ART) options and the lived experience of solo motherhood.\n\nREAD MORE: Netanyahu launches extraordinary personal attack on Albanese\n\nClaire Steinke decided to have children on her own after being diagnosed with cancer at 29. (Supplied/Claire Steinke)\n\n\"I always found it so secretive,\" Steinke told 9news.com.au.\n\n\"There are so many options, so many different treatments ... different procedures, different tests, all those sorts of things, but I feel like it's not openly shared.\"\n\nAnd she's concern it could be holding some women back.﻿\n\nSolo motherhood on the rise\n\nThere were were almost 1 million single mother families in Australia in June 2024 according to the ABS, up from 864,000 in 2021.\n\n﻿It's unclear how many are solo mums by choice.\n\nART has become more accessible to single women and they're one of the largest groups of recipient parents at clinics across the country.﻿\n\nMore than 700 single women underwent IVF in Victoria in 2022 alone.\n\nAustralians are also marrying less and later – the marriage rate is down and the average age of an Aussie bride has risen from 21 in 1975 to 30 in 2023 – prompting some women to embark on motherhood before marriage.\n\nBeing a single mum has become more socially acceptable, making space for women who want to have kids without any intention of ever 'settling down'.\n\nAnd some women, ﻿like Stienke, ﻿find that solo motherhood may be their only choice.\n\n'My biggest fear was not being able to have children'\n\nSteinke was diagnosed with endometrial cancer when she was 29 and single.\n\nShe'd gone to her GP suspecting ovarian cysts but a laparoscopy revealed cancer in her uterus.\n\n\"My biggest fear was that I wouldn't be able to have children,\" Steinke said.\n\n\"Having that diagnosis in particular, right the place where you have your babies, it was my biggest fear coming true.\"\n\nInitially, doctors suggested a hysterectomy but Steinke opted for nine months of hormone therapy instead, hoping to preserve her fertility﻿.\n\nAt 29, Steinke was told she had endometrial cancer and her fertility was at risk. (Supplied/Claire Steinke)\n\nGiving up her dream of being a mum was not an option so during cancer treatment, she researched her options to have a child solo.\n\nUnwilling to date solely to find a father for potential children, ﻿she pursued intrauterine insemination (IUI), a procedure in which donor sperm is placed directly into the uterus around the time of ovulation in the hopes of a pregnancy.﻿\n\nDoctors warned she had less than 20 per cent chance of getting pregnant but she started trying as soon as treatment ended.\n\nSteinke fell pregnant on her third round of IUI and welcomed her son prematurely just 26 weeks later.\n\nHe spent the first weeks of his life in the NICU and Steinke broke down a few weeks into it.\n\nThe realities of going it alone﻿\n\nSteinke admits her pregnancy ﻿was often lonely and it was hard not having someone to share it with, especially when her son was in NICU.\n\n\"All of that emotion had caught up with me after 18 months of stress from a cancer diagnosis, cancer treatment, fertility treatment, horrible pregnancy, and a premature baby,\" Steinke said.\n\n\"I'd been holding all this emotion in and just putting one foot in front of the other to keep going, and it just hit me.\"\n\nREAD MORE: US destroyers head toward Venezuela as Trump aims to pressure drug cartels\n\nSteinke admits her pregnancy ﻿was often lonely, especially when her son was in NICU. (Supplied/Claire Steinke)\n\nBut she wouldn't change her decision to have a child solo.\n\nIn fact, she did it again five years later and welcomed a daughter through IUI.\n\nHer children have brought her so much joy and she can't imagine her life without them.\n\nBut solo motherhood ﻿is not without its challenges, though data on their specific experiences are limited.\n\n﻿A Council of Single Mothers and their Children (CSMC) survey found that 87 per cent of single mothers are concerned about their long-term financial circumstances.\n\nHousing prices and insecurity ﻿are significant challenges and respondents experienced homelessness and marginal housing at almost four times the national average.\n\nThe latest annual Household, Income and Labour Dynamics in Australia ( HILDA ) survey also revealed that poor mental health among single mothers has risen from 22 per cent in 2011 to 38 per cent in 2022, compared to 18 per cent for partnered mothers﻿ in 2022.\n\n\"Sometimes it would be really good to sit down and talk to someone who's got the same level of vested interest as you do and make a joint [parenting] decision, but I had to do those things on my own,\" she said.\n\nFive years after having her son via IUI, Steinke welcomed a baby girl using the same donor sperm. (Supplied/Claire Steinke)\n\nMaking solo motherhood more accessible\n\nBecoming a solo mum has changed a lot since Steinke had her kids, who are now 20 and 15.﻿\n\nART is more accessible for single women, society has become more accepting of solo motherhood, and online communities have helped solo mums connect.\n\nEvents like the upcoming Melbourne Fertility Expo even include speakers ﻿like Alisha Burns of the Solo Mum Society, who will speak to why more women are choosing solo motherhood.\n\nAnd Steinke herself shares her story with other women through her maternity and breastfeeding business, Soul Mothers .\n\nBecoming a solo mum has changed a lot since Steinke had her kids, who are now 20 and 15.﻿ (Supplied/Claire Steinke)\n\nBut there are still barriers she said need addressing.\n\nSingle women deserve more ﻿comprehensive information about ART, including IUI, as well as opportunities to speak honestly about their lived experiences without fear of backlash or discrimination.\n\n﻿\"It's not someone else's decision to make, some pen pusher in an office saying, 'no, just because you're a single you can't have it,' or some religious person going, 'it's not what god wanted,'\" she said.\n\n\"I would have been gutted to not be able to have children.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/tiny-house-on-wheels-evictions-nsw-victoria-calls-or-legislation-change/b7a4f440-a547-499d-b082-3ec62fd3264a",
    "title": "Josh moved to a tiny house to save money. Now he's facing a $25,000 legal battle",
    "publish_date": "Tue, 19 Aug 2025 02:34:08 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Josh Heins and his partner moved into a tiny house to save money.\n\nNow it could cost them a small fortune in legal fees as they fight council eviction orders.\n\nThe NSW couple﻿ were ordered to remove or demolish their home by Bega Valley Shire Council, which deemed it an 'unauthorised structure'.\n\nJosh Heins and Manu Bohn built their tiny house on wheels to escape the housing crisis in Bega Valley. (Supplied/Josh Heins)\n\nFailure to do so could cost them up to $1 million in fines.﻿\n\nBut Heins argues their tiny house on wheels (THOW) falls under vehicle regulations, not building rules.\n\nNow the matter has been escalated to ﻿the Land and Environment Court of NSW, where Heins has been told even \"simple\" case can cost up to $25,000 to resolve.\n\n\"We've had to divert all of our energy to this thing that just honestly feels like a waste of time,\" Heins told 9news.com.au.\n\n\"To be completely honest, it's a shit show.\"\n\nAnd with ﻿no clear rules around how tiny houses fit into the Australia's national, state or local regulations, he fears other vulnerable Aussies could be left homeless.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nThe tiny house grey area﻿\n\nHeins and his partner aren't the only Aussies who moved into a THOW to cope with the ﻿housing crisis.\n\nIn the ﻿ten years to March 2025, median advertised rents in Australia jumped by almost 50 per cent and 1.26 million low-income households were in financial housing stress in 2024-25.\n\nTiny houses – compact, mobile homes typically built on wheels or trailers – seemed to some like the perfect solution.\n\nThey can be relatively cheap to buy or build (compared to a house or unit)﻿ and can be set up on private property in areas where housing is limited.\n\nBut rules for tiny houses differ across states, territories, and local council areas and can be difficult to decode.﻿﻿\n\n9news understands the biggest concern for councils is resident safety, especially in fire and flood prone areas, and they enforce compliance orders with this in mind.﻿\n\nTHOWs don't currently have to be built to the Building Code of Australia (BCA) because they don't fit the building classified in the BCA.\n\nIn NSW, they're not defined in state legislation and may be subject to a number of building or vehicle regulations.\n\nThese rules may be enforced differently from council to council.﻿\n\nRents are dropping in these 10 areas across Australia View Gallery\n\nIn Victoria, current planning and building legislation does not allow THOW to be used as permanent dwellings unless they meet strict requirements.\n\nThey typically need both a building permit and, in many cases, a planning permit (especially if connected to services and infrastructure like electricity).\n\nSome Victorian councils have removed the need for some permits, while others strictly enforce these requirements.\n\n﻿But owners and councils don't always see eye to eye on how these rules should be enforced.\n\nDemolish or face $1 million in fines﻿\n\nHeins and ﻿partner Manu Bohn built their THOW on a friend's property two years ago.\n\nBelieving their home classified as a caravan, they did not seek ﻿council permission or apply for a development approval for it.\n\nThe goal was to save enough money to one day buy property of their own﻿.\n\n﻿\"Living in a tiny home gave us an opportunity to get ahead for the future. It's the classic 'having a go,'\" Heins said.\n\nJosh Heins insists his home should fall under vehicle regulations, not building rules. (Supplied/Josh Heins)\n\nInstead, they were slapped with a ﻿draft order to remove or demolish the home in accordance with NSW Environmental Planning legislation in May 2025.\n\nFailure to comply ﻿would result in legal proceedings and up to $1 million in fines.\n\nBega Valley Council claimed it was an \"unauthorised structure being used as a residential dwelling\" and was subject to the same regulations as any other building.\n\nBega Valley Shire Council's director of Community, Environment and Planning, Emily Harrison told 9news tiny homes on private property in the council area typically require Development Application (DA) approval, as well as s68 approval under the Local Government Act 1993 to be compliant.\n\nBut Heins insists his home is a vehicle (caravan) and the rules the council is trying to enforce don't apply.\n\nHarrison said caravans are typically only exempt from needing a DA if it used by a member of the household in association with the primary dwelling on the property.\n\nAfter months of back and forth trying to resolve the issue, Bega Valley Council issued final orders and the matter was escalated to the Land and Environment Court of NSW.\n\nThe draft order Heins and Bohn received in May this year shocked them. (Facebook/Manu Bohn)\n\nNow Heins is facing a lengthy legal battle he's been told could cost upwards of $25,000.\n\n﻿\"Once a council have issued compliance orders, the only way to challenge [it] is to make an appeal to the court, which is obviously a huge rigmarole,\" he said.\n\n\"We believe that the dwelling is a caravan, so we're really hopeful that we'll have a positive outcome.\"\n\nIf their appeal fails, he and Bohn ﻿will be forced back into NSW's competitive rental market, where the ﻿median ﻿weekly rent has spiked from $480 to $650 in the last six years.\n\nThey'll also be thousands of dollars poorer.\n\nBut theirs is a battle not everyone can afford to fight.\n\n'We realised that we'd lost'\n\n﻿Evrim Sen and her partner lived in a THOW on private property in Victoria's Yarra Ranges for almost three years before being ordered to demolish it.\n\nThey wanted to ﻿\"build a life together and have kids\" there.\n\nInstead, they were ordered to demolish it unless it could be made to meet Victoria's building code – which Sen said would have required them to rebuild from scratch.\n\nErvim Sen and her partner moved into a tiny home on wheels to save money. (Supplied/Evrim Sen)\n\nSen argued her home was a vehicle and therefore not subject to Victoria's building code.\n\n\"[Council] told us that we had until the end of July to leave or they'd take us to court,\" she told 9news.\n\nYarra Ranges Council told 9news it works closely with tiny house owners to explain permit requirements and find pathways to resolve any known breaches.\n\n\"However, if a resident refuses the requests to obtain the necessary permits, given the potential health and safety risks, Council must take action to resolve the breach, it cannot simply ignore it,\" a spokesperson said.\n\n\"Council has a legal responsibility to ensure that the community is safe and that includes the properties they choose to live in.\"\n\nSen's only other option was to ﻿appeal the council's order through the Victorian Civil and Administrative Tribunal (VCAT).\n\nUnable to afford a costly legal journey, she and her partner ﻿abandoned their THOW.\n\n\"It takes a toll on you to just keep fighting endlessly,\" she said.\n\n\"You can't just keep putting resources towards it forever ... we realised that we'd lost the battle.\"﻿\n\nSen dreamed of a quiet, idyllic life in this tiny home. Instead, she was forced to abandon it. (Supplied/Evrim Sen)\n\nThey were thrust back into Victoria's rental market, where the median weekly rent was $520 in April.\n\nThey found housing, but others aren't so fortunate.\n\n\"A lot of people living in tiny houses are much worse off, they have less options financially,\" Sen said.\n\n\"Some are single mums and ﻿if they got found out or dobbed in, they'd be in a terrible situation.\"\n\nDesperate need for change and clarity\n\nTiny house owners around the country are demanding more clarity around the ﻿national, state and local legislation﻿ pertaining to their homes.\n\n﻿For Heins, that means clearer definitions of what is a building and what is a vehicle.\n\n\"There needs to be state government change pretty urgently to stop this unfair, inconsistent compliance action,\" he said.\n\n\"The state government needs to give some guidance that supports these dwellings, because clearly the community support these dwellings.\"\n\nHe ﻿and Bohn started a change.org petition demanding a moratorium on tiny house evictions in NSW until a clear, safe, and legal pathway for tiny home-ownership is established, which attracted almost 30,000 signatures.\n\nTomorrow, Bega Valley Shire Council will vote on the petition﻿.\n\nHeins plans to gather with supporters at the council office to show the petition 'isn't just a piece of paper' but a demand for compassion in the housing crisis.\n\n\"Council keeps saying that they need more clarity from the state government,\" he said.\n\n\"We're saying to them, while we're all waiting for that clarity, how about you don't pursue any compliance orders that would leave residents without a home﻿.\"\n\nHarrison said Council is ﻿advocating to the NSW Government to simplify and modernise the legislative framework around moveable dwellings.\n\n\"While the NSW Government has indicated that modernising current legislation is no longer a priority, we remain committed to advocating for change and ensuring an appropriate supply of housing exists for those in need,\" she said.\n\nSen had to leave her tiny house on wheels and now hopes to sell it. (Supplied/Evrim Sen)\n\nIn Victoria, Sen is advocating for similar change – and Yarra Ranges Council is on board.\n\nA spokesperson told 9news rural ﻿councils across the state are advocating for the State Government to take the lead to address tiny house ownership.\n\n\"We've written to the State Building Surveyor and Minister for Planning, urging each department to consider changes that would allow these housing types to be legally used as permanent dwellings in appropriate circumstances,\" they said.\n\n\"Until State legislation changes, Council is unable to permit these structures as homes unless they comply with current legislation and regulations, and there is no immediate alternative to legislative reform.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/rewards-points-australia-the-future-of-point-spending/3a157734-b350-4c8b-b732-a7b3b73bed71",
    "title": "What could happen to your reward points soon",
    "publish_date": "Tue, 19 Aug 2025 19:35:18 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "R﻿eward point spending is under the microscope following fears a series of landmark Reserve Bank proposals could strip back frequent flyer perks.\n\nMillions of Australians accumulate reward points with dollars spent on their credit cards﻿, but the number of points needed for \"free\" flights or products is slowly climbing.\n\nSo what does the future hold for the tumultuous point economy?\n\nVirgin customers accumulate points through its Velocity Frequent Flyer program. (Virgin Australia)\n\nQantas and Virgin dominate the point industry with Frequent Flyer and Velocity, respectively.\n\nVirgin recently announced it is again shaking up the industry with its 1 Point Rewards store, which will allow members to purchase expensive items with just a single velocity point in a one-time event.\n\nAcross three capital cities, members will be able to buy﻿ an $849 Dyson Airwrap or a pair of $549 Bose headphones with just one point.\n\nVelocity Frequent Flyer chief executive Nick Rohrlach told 9news.com.au Virgin is taking a second bite of the cherry after hosting a similar store in 2023 due to customer demand for more \"achievable\" point spending.\n\n\"We are try to make it much easier to get to that reward rather than saving up for years for something you may or may get,\" Rohrlach said.\n\n\"Our research says that 90 per cent of Aussies are members of a loyalty program.\n\n\"And rather than tying people up with points whispers and all the complexity, we're just trying to make it much simpler and easier to use and that you know that you can get rewards really fast.\"\n\nBunnings is following suit with a program allowing Flybuys members to turn their points into dollars spent at the hardware giant.\n\n﻿It will let customers use as little as $10 in Flybuys points to buy Bunnings products.\n\nVirgin annnounced it is bringin back its 1 Point Rewards store. (Virgin Australia)\n\nPayment Services managing director Brad Kelly is a point guru.\n\nHe doesn't think the future of frequent programs is shaping up to be so peachy.\n\n\"The devaluation is already beginning,\" Kelly explained to 9news.com.au.\n\n\"There's a lot of people sitting on a lot of points post-COVID and they want them to burn those.\n\n\"That's how they dilute the offers.\"\n\nVirgin﻿ last year lowered the amount of points needed for a one-way economy seat to 5900 velocity points.\n\nBut Velocity credit card customers had the number of points earned per dollar dropped in April this year, decreasing from five to four points.\n\nIt was the first time Qantas marked up its classic reward pricing since 2019 and the second time since 2004.\n\n\"A lot has changed in the last six years,\" Qantas loyalty chief executive Andrew Glance said at the time.\n\n\"These adjustments will ensure we can continue to invest in enhancing the program for the long-term and continue to grow the levels of classic and classic plus reward seat availability for members year on year.\"\n\nEarlier this year, Qantas﻿ hiked up the points needed to redeem fares. (Nine)\n\nKelly said it is going to become even harder for point collectors to nab their dream flight on points alone.\n\n\"﻿If you're a bronze member, you're going to see these Classic Plus seats everywhere and the occasional classic, but you're not going to be able to redeem as much as you want or as easily,\" he said.\n\nHe estimated ﻿valuable point earning is a game \"for the top 20 per cent\".\n\n\"Your average Qantas member only spends about $30,000 a year on their credit card,\" Kelly added.\n\n\"That's going to get you 30,000 points if you're lucky, probably more like 20,000 to 25,000. You are going to have a lot of difficulty getting anywhere for 25,000 points.\n\nAnd even then, do you really want to go to Ballina on a Tuesday afternoon in August? That's the reality. You're not going to be able to say, 'Oh, I'd like to fly business class to Bali'.\n\n\"That's just not going to happen.\"\n\nBrad Kelly thinks credit card spend won't be so tied to reward points in the future. (Getty)\n\nRohrlach said Velocity is looking at finding ways to accelerate non-credit card point earning.\n\nHe doesn't want point whisperers to be the only ones who can find the best deals.\n\n\"There's lots of different ways to earn points and it's always nice when people find new ways to do that. But also, it's not hard,\" Rohrlach added.\n\n\"It's not just about the points hacking.\"\n\nQantas Loyalty chief executive Andrew Glance told 9news.com.au that the number of points earned through retailers has doubled in the past five years.\n\n\"We anticipate it will double again by 2030, as we expand our footprint across a growing range of retail categories,\" he said.\n\nKelly's prediction for the industry﻿ is the slow erosion of needing to sign up for a credit card to accumulate points.\n\nHe also said point earning may soon be largely attributed to spend instead of credit.\n\n\"﻿What I mean by that is that a customer will sign up directly with a merchant or a bunch of merchants, and as they spend, those merchants will buy points directly from Qantas [or Virgin] and give them to the customer,\" Kelly added.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/woolworths-product-discount-new-blow-in-price-war-with-coles/696c5899-864b-4a9d-ba0c-e4a881b9dc26",
    "title": "Woolworths delivers fresh blow against Coles in ongoing price war",
    "publish_date": "Tue, 19 Aug 2025 02:03:43 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "W﻿oolworths has announced it is discounting 100 extra products in August, delivering a fresh blow against supermarket rival Coles in the industry's ongoing price war.\n\nThe grocery﻿ giant said it will slash the prices on essential items including pasta sauce, rice, olive oil, cereal and muesli bars as part of its \"lower shelf prices\".\n\nWoolworths claimed the total savings could slash up to $110 on a customer's grocery bill﻿ for a basket of all 100 newly-discounted products.\n\nWoolworths has announced it will slash the prices on essential items. (Getty)\n\nComparing against original shelf prices, Woolworths said the total savings by the end of August would be $50 million since May.﻿\n\nThe supermarket has added 700 products to to its lower shelf prices catalogue so far.\n\n\"This is not about temporary specials, but about long-term shelf price certainty on the products that matter most for families,\" Woolworths Group chief executive Amanda Bardwell said.\n\n\"Since launch we have seen the lower shelf prices resonate with our customers and we're seeing families embrace the savings on key staples such as bread, yoghurt, cheese and baby wipes.\"\n\nThe supermarket said it has added 700 products to to its lower shelf prices catalogue so far. (Woolworths)\n\nSome of the discounted prices are $3.50 for a jar of Sacla Pasta Sauce and $12.50 or a 1.1kg of National Confectionery Co. lollies.\n\nAll the products available on the lower shelf price will be shared online from tomorrow.﻿\n\nBoth Woolworths and Coles have moved to slash prices over the past few months as the supermarket giants scramble to attract budget shoppers following a damning report from the Australian Competition and Consumer Commission (ACCC).\n\nIn a 400-plus-page report , the ACCC called for action on shrinkflation, price transparency and confusing promotions.\n\nColes has also waged an ongoing price war against Woolworths to attract budget shoppers. (Oscar Colman)\n\nThe lower prices will continue until \"at least 2026\", Woolworths said at the time.\n\nThat same month, Coles announced plans to cut the price of 500 items﻿ following the competition watchdog backlash.\n\nColes also introduced a loyalty bonus program in June to give shoppers 10 times the number of points on 800 products.\n\nBoth supermarkets are scheduled to report their full-year results next week.﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/bernard-tomic-turns-back-clock-to-advance-in-us-open-qualifiers/105675540",
    "title": "Bernard Tomic turns back clock to advance in US Open qualifiers",
    "publish_date": "Wed, 20 Aug 2025 01:38:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Bernard Tomic's impressive resurgence has put the Australian two wins away from his first US Open main draw appearance in eight years.\n\nThe 32-year-old offered up moments of his awkward, disruptive best in a comprehensive 6-4, 6-4 defeat of American Patrick Kypson on Wednesday (AEST).\n\nOne of six Australian winners on the day, Tomic next plays Portugal's Henrique Rocha after the world number 168 upset French veteran Pierre-Hugues Herbert in a lengthy three-set battle.\n\nDefending champs trump singles stars to reach US Open mixed doubles semis Photo shows Sara Errani and Andrea Vavassori celebrate winning a point in a mixed doubles tennis match Defending US Open mixed doubles champions Andrea Vavassori and Sara Errani are through to the semifinals of the re-imagined format.\n\nThere are US Open concerns for Australian world number 79 Chris O'Connell, who retired after losing the first set to Roberto Bautista Agut at the lead-up event in Winston-Salem.\n\nTomic, the 2009 US Open junior champion, has not featured in the Flushing Meadows main draw since 2017 and last played qualifying in 2018.\n\nBut Tomic, who climbed as high as world number 17 in 2016, has returned on a mission after aborting last week's delayed ATP Challenger final in Colombia to properly prepare for his main-draw shot.\n\nThe Barranquilla decider, delayed a day because of rain, was Tomic's second final at that level in the month and could have been his first major title since 2018.\n\nOften criticised for a perceived lack of effort and intensity, Tomic has knuckled down in the last two years to surge from a career-low 835 to at least number 167 when the next rankings are calculated.\n\nThe battling Aussie withdrew from last month's Toronto Masters with an oblique injury and then did not play in Cincinnati before attempting a return this week.\n\nIn June, he took two top-100 scalps, including compatriot Rinky Hijikata.\n\nA US Open berth would be Tomic's first grand slam main draw appearance since he qualified for the Australian Open in 2021.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nJason Kubler will meet Kyrian Jacquet in the second round after beating Brit George Loffhagen 6-4, 7-5.\n\nAustralian women Olivia Gadecki, Priscilla Hon and Lizette Cabrera all won their first-round matches, while Destanee Aiava upset eighth seed Sara Bejlek, 6-4, 4-6, 6-4.\n\nBut Alex Bolt and Daria Saville both lost after four Australians had won first-round qualifying matches on Tuesday.\n\nThe qualifiers are hoping to join a dozen Australian direct entrants, led by men's world number 8 Alex de Minaur, and wildcards Tristan Schoolkate and Tahlia Gibson.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/daryl-maguire-jailed-for-giving-misleading-evidence-at-nsw-icac/105657684",
    "title": "Disgraced former MP jailed for giving 'clearly misleading' evidence at ICAC",
    "publish_date": "Wed, 20 Aug 2025 00:18:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Liberal MP Daryl Maguire has been handed a 10-month jail sentence for giving misleading evidence to the NSW corruption watchdog — but has been granted bail pending an appeal.\n\nMaguire was a witness at the Independent Commission Against Corruption (ICAC) in 2018 during an inquiry that focused on the former Canterbury City Council.\n\nThe ex-member for Wagga Wagga was quizzed about whether he expected to benefit financially from a multi-million-dollar property deal.\n\nIn the witness box, he initially denied ever doing business with former councillor Michael Hawatt or seeking payment for brokering a deal on behalf of a Chinese property developer, before intercepted phone calls between the pair were played to him.\n\nMaguire was found guilty in June, after Magistrate Clare Farnan found his initial assertions that there was nothing in the deal for him were \"clearly misleading\".\n\nShe said Maguire had given prior thought to what he was likely to be asked at the inquiry and essentially prepared a \"broad-brush response\" that took into account messages he had retrieved.\n\nMagistrate Farnan was satisfied, beyond reasonable doubt, that he gave the evidence in question \"knowing that it was misleading, and not believing it to be true\".\n\nToday, she handed Maguire a sentence of 10 months with a non-parole period of five months.\n\nMaguire tried to 'protect reputation', magistrate says\n\nMagistrate Farnan said she could not be satisfied his motivation for giving the misleading evidence was an expectation of an ongoing financial benefit.\n\nThere were \"a number of possible motivations\", she said in sentencing, and there is no evidence about his reasons because Maguire pleaded not guilty and still denies the offence.\n\n\"Mr Maguire was clearly trying to protect his reputation, possibly amongst other things,\" she said.\n\nMagistrate Farnan said the community expected a politician who takes an oath or affirmation to give honest evidence, whatever the nature of the proceedings.\n\n\"The community is entitled to expect that those who hold high public office will conduct themselves with integrity,\" she said.\n\nShe accepted Maguire had been a \"diligent\" local member and had been committed to furthering the interests of his electorate, after taking into account character references.\n\nShe considered the seriousness of the offence to be in the \"middle of the range\" and said Maguire, who was assessed as having \"good\" prospects of rehabilitation, did not maintain his position later during his appearance at the ICAC.\n\n'Will of community to eradicate corruption'\n\nAfter the sentence was imposed, Maguire's counsel Rebecca Gall said he would lodge an appeal and sought to be heard on a bail application pending that appeal.\n\nOn Friday, Crown Prosecutor Phil Hogan pushed for Maguire to be sent to prison, saying only a full-time custodial sentence would achieve the goal of expressing \"the will of the community … to eradicate corruption\".\n\nBut Ms Gall said a sentence served in the community with a large community service element would \"send an appropriately strong and public message\".\n\nWhat the ICAC found out about Daryl Maguire Photo shows composite images of Daryl Maguire and a bag and wads of cash spread out on a table. The inquiry into former MP Daryl Maguire has uncovered much more than his secret relationship with Gladys Berejiklian.\n\nShe said he was \"under considerable personal distress\" at the time of the ICAC appearance and that he acknowledged his offending \"has contributed to a loss of trust in the community\".\n\nDuring the hearing, Maguire's lawyers argued the questions asked at ICAC were imprecise, ambiguous and open to a range of interpretations.\n\nBut Magistrate Farnan ultimately did not accept the criticism that it was never put to Maguire what \"doing business\" with Mr Hawatt was referring to specifically and said there was a \"global\" denial of doing business.\n\n\"I do not consider that the questioning bore any ambiguity, and the accused was offered every opportunity to explain answers that he gave by further questioning in relation to them,\" she said in her judgement in June.\n\nOperation on planning proposals\n\nThe ICAC inquiry, Operation Dasha, investigated whether officials including those at the former Canterbury City Council dishonestly exercised official functions in relation to planning proposals between 2013 and 2016.\n\nOne site, opposite Canterbury Hospital and known as Harrisons, was proposed to become a large unit development.\n\nIn the intercepted phone calls, Maguire was recorded saying \"What have you got on your books? What is DA approved?\" — and asking what Mr Hawatt's margin was.\n\nThe two men estimated the development to be worth up to $48 million and Mr Hawatt suggested a margin of between 1.5 and 2 per cent was likely.\n\nMaguire replied: \"1.5 per cent isn't enough divided by two, if you know what I mean.\"\n\nMagistrate Farnan was satisfied that Maguire's prepared response to anticipated questions was that he had \"never asked for a dollar\".",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/monash-ivf-embryo-bungle-review-brisbane-melbourne/105675124",
    "title": "Review into Monash IVF embryo mix-ups to remain secret",
    "publish_date": "Tue, 19 Aug 2025 23:54:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Monash IVF has received an independent review into unrelated cases of embryo mix-ups in Brisbane and Melbourne but the contents will remain secret.\n\nIn an announcement to the ASX today, the fertility giant said the review, undertaken by barrister Fiona McLeod, would not be released publicly to protect the privacy of affected patients.\n\n\"Both cases involved non-standard IVF treatments and circumstances that would not arise in the vast majority of IVF procedures,\" Monash IVF said in the ASX announcement.\n\nThe review concluded the Brisbane incident was the result of human error.\n\nMonash IVF mix-up could spark legal battle over child's parentage Photo shows In vitro fertilisation Monash IVF realised the mistake in February, after the birth parents asked to transfer their remaining frozen embryos to another provider.\n\nIt found the Melbourne incident resulted from a range of factors, including human error at multiple stages and IT system limitations \"in the very limited circumstances of an embryo transfer to a partner\".\n\n\"Those limitations ultimately made subsequent processes more vulnerable to human error,\" the ASX announcement said.\n\nIn April, revelations emerged that one of Monash IVF's Brisbane patients had been mistakenly implanted with another woman's embryo in 2023 and gave birth to a baby who had no genetic links to her later that year.\n\nThen, in June, the fertility company apologised for a second time in as many months after a patient received her own embryo \"contrary to the treatment plan which designated the transfer of an embryo of the patient's partner\".\n\nDo you know more? Contact Janelle Miles and Kate McKenna\n\n'Patchwork' of regulation 'no longer adequate'\n\nFertility educator and IVF patient advocate Lucy Lines agreed the company should protect patient privacy \"100 per cent\", but questioned whether more details could be provided.\n\n\"If we're not going to see the independent review ... then we need to see the root cause analysis and the corrective actions they've taken in order to be able to reassure all IVF patients,\" she said.\n\nIVF mix-ups raise questions about the rapidly growing industry Photo shows A woman with short hair and a blue shirt looks ahead. With more than 100,000 treatment cycles taking place yearly in Australia's growing IVF industry, those with first-hand experience say it's time for changes to increase transparency and simplify regulations.\n\nThe Fertility Society of Australia and New Zealand (FSANZ) used the release of the report to renew calls for nationally consistent regulation in the fertility sector.\n\n\"These events, though rare, are deeply serious and demand a system-wide response,\" FSANZ said in a statement.\n\n\"The current patchwork of state-based regulation is no longer adequate.\n\n\"Only a nationally consistent framework can provide the transparency and accountability the community rightly expects.\"\n\nFertility giant 'deeply sorry'\n\nMonash IVF told the ASX it had already implemented many of the recommendations from the independent review.\n\n'Human error' to blame for Monash IVF embryo mix-up — could it happen again? Photo shows A close up of a baby in white muslin wrap with stars on it, being held by two adults. No faces are visible. While experts say this case is \"unprecedented\" in Australia, it's happened multiple times in the US, as far back as 1999.\n\n\"Following its own internal review, additional safeguards and protocols have already been implemented and the company is committed to implementing the remainder of the recommendations,\" the company said.\n\n\"These additional safeguards and protocols go beyond the recommendations contained in the independent review.\n\n\"The cost involved in implementing the recommendations and additional safeguards and protocols are not anticipated to have a material impact on financial performance.\"\n\nMonash IVF chief executive officer Michael Knaap resigned following revelations of the Melbourne embryo mix-up in June.\n\nChief financial officer and company secretary Malik Jainudeen was appointed as acting CEO.\n\n\"To the affected patients and everyone who entrusts Monash IVF with their dreams of building a family, we are deeply sorry for the distress these incidents have caused,\" he said today.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/fears-clermont-gp-will-leave-town-after-health-service-decision/105654422",
    "title": "Country doctor makes tough decision to cut back appointments",
    "publish_date": "Tue, 19 Aug 2025 23:38:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "When doctor Tim Lane, his partner and young son moved to Clermont in central Queensland 18 months ago, it ended six years of community uncertainty.\n\nAfter years of lobbying, advertising and a few false starts, the town of 3,000 finally had a permanent doctor at the hospital and a promise to open a second GP clinic in town.\n\nHowever, rostering changes implemented by Mackay Hospital and Health Service (MHHS) have locals worried there will be fewer available GP appointments.\n\nDr Lane is now required to work 7am–9am and 4pm–7pm in the hospital.\n\nTim Lane relocated with his partner and young son to Clermont to become the permanent GP at the hospital. (ABC Tropical North: Hannah Walsh)\n\nSam Faint, chair of community advocacy group ClermontCONNECT, said this would mean 10–15 fewer GP appointments a day.\n\nShe said initially an integrated roster system allowed Dr Lane flexibility to run the GP practice \"while prioritising work inside the hospital\".\n\n\"We just got to stability, like we have literally just got there, and we had everything just thrown up in the air,\" she said.\n\n\"It's unlikely that the surgery will be able to continue to be viable if that model doesn't revert back to what it was.\"\n\nDr Lane declined to comment but, in a statement, his practice manager Deb Shore said changes meant the GP clinic would reduce opening hours.\n\n\"[It will] limit the flexibility we've had to support the hospital emergency department and collaborate with the health service when needed,\" the statement read.\n\nThe Clermont Hospital had previously been relying on locum doctors to fill the gap in health care. (ABC Capricornia: Aaron Kelly)\n\nHealth service says 'no change'\n\nIn a statement, MHHS said there had been no change to the medical model that enabled doctors to work in the hospital and in general practice.\n\nIt said under this employment arrangement, there were required hours of attendance at Clermont's Multi-Purpose Health Service (MPHS).\n\nThe health service said it could not comment on opening hours of a privately owned general practice.\n\nA second permanent doctor has started work at the MPHS, a move MHHS said would increase medical coverage.\n\nThe Clermont community has long struggled to maintain sustainable medical services despite significant investment and effort. (ABC Capricornia: Aaron Kelly)\n\nThe new doctor will work five days a fortnight at the hospital and the other five at the GP surgery.\n\nThe second doctor is completing her general practitioner qualifications and will be required to work under Dr Lane's supervision for six months.\n\nA locum doctor is also employed to cover when both permanent doctors are rostered off.\n\nHealth services close\n\nRecruiting doctors to work in the Isaac region is a long-standing issue, and community advocates such as Ms Faint worry what might happen if Dr Lane leaves.\n\nFor a permanent population of 22,500 people and a large itinerant workforce of around 13,000, the region is serviced by six GPs in Moranbah, as well as one each in the smaller towns of Dysart and Middlemount.\n\nAn outreach clinic services Nebo to the east.\n\nClermont has a population of about 3,000 people. (ABC News: Nathan Morris)\n\nIn January, doctor Sarah McLay closed her Clermont Country Practice, the town's only other clinic, with some patients transitioning to telehealth appointments from Emerald, more than 100 kilometres away.\n\nThat same month, the Moranbah Sonic Health Plus practice closed after 10 years, with no reason given.\n\nClermont's history of uncertainty\n\nClermont, a three-hour drive from Mackay and four hours from Rockhampton, has lived with periods of uncertainty in health care before.\n\nThe community has previously fought to attract permanent doctors and reduce its reliance on expensive locums.\n\nSteve Salleras says people living in rural areas in Australia experience poorer health outcomes. (Supplied: Steve Salleras)\n\nSteve Salleras worked as a GP in Clermont from 1998 to 2001 and said health outcomes had been consistently worse for people in rural and remote areas.\n\n\"If you have a chaotic health system, and the whole system is run by short-term locum doctors, the quality of care that's possible drops dramatically,\" Dr Salleras said.\n\nGovernment blame game\n\nIn a statement, Queensland Health Minister Tim Nicholls said primary care was not the state government's responsibility.\n\n\"The Commonwealth government has vacated the field in Clermont and dozens of other rural and remote communities of Queensland, leaving it up to Queensland Health to step in a fill the gap,\" Mr Nichols said.\n\nIn a statement, federal MP for Capricornia Michelle Landry said the appeal of rural health roles had declined over the past few years.\n\nShe described the absence of a permanent GP in any small community as \"dangerous\".\n\n\"A person's postcode should never decide whether they can see a doctor but in Clermont it's a daily reality,\" Ms Landry said.\n\nMichelle Landry (left) with Tim Lane at the Clermont Doctors Surgery. (Supplied)\n\nA spokesperson for the federal health department said under the Workforce Incentive Program a GP in Clermont could receive up to $60,000 annually, while a GP practice could receive up to $215,280 a year.\n\nDr Salleras said small Queensland communities like Theodore and Cloncurry had successfully built sustainable health models to support both emergency and primary care, but it relied on making a doctor's time in a rural area as smooth as possible.\n\n\"[If there are] high levels of trust, that makes it a positive place to attract people and means that there's potential even for a succession plan,\" he said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/tasmanian-labor-leadership-discussions-no-confidence-vote/105674806",
    "title": "Tasmanian Labor MPs meet to discuss new leadership",
    "publish_date": "Tue, 19 Aug 2025 22:29:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Tasmanian Labor Party is meeting this morning to hold nominations for leadership positions after the party's election defeat was confirmed yesterday.\n\nThe dominant left faction of the party met earlier in the morning to discuss potential leadership contenders.\n\nA Labor MP told the ABC Josh Willie and Ella Haddad were considering nominating.\n\nThe wider parliamentary Labor party met later at 9am.\n\nJosh Willie (right) is considering nominating for the position of leader, the ABC understands. (ABC News: Luke Bowden)\n\nDespite only winning 10 seats at the election, the party had been hoping to take government through a motion of no confidence in Premier Jeremy Rockliff and confidence in Labor leader Dean Winter.\n\nBut the party failed to convince a single crossbencher to support it with many saying Labor had shown it was unable to compromise and not ready to govern.\n\nThe motion was defeated last night 24 to 10.\n\nMember for Clark Ella Haddad with Dean Winter. (ABC News: Maren Preuss)\n\nLeadership spill automatic after election defeat\n\nThe confirmation of election defeat now means both leadership positions will be automatically declared vacant. If there are multiple nominations there will be a statewide ballot.\n\nMr Winter, who is from the right faction, has yet to confirm if he will nominate again.\n\nAnalysis: Did Labor just orchestrate a no-confidence motion in itself? Photo shows a man in a suit leans back against his chair Labor leader Dean Winter's much-anticipated motion of no confidence in the premier spectacularly backfired.\n\nThe party was criticised by the crossbench during the debate for refusing to compromise on key policies, contrasted to the Liberals who have now committed to banning greyhound racing and reviewing the sustainability of the salmon industry.\n\nWhile the party faced a resounding loss both at the election and in parliament, a Labor MP told the ABC that backflipping on greyhound racing and the salmon industry at this late stage would be a mistake.\n\nThey said if the party was going to move on such policies, it should have done so over a week ago.\n\n'State of flux', as Labor arrives at Parliament House\n\nOutside Parliament House this morning, Lyons MP Brian Mitchell would not be drawn on who he would vote for as new leader, saying the party would \"be going through our processes today\".\n\n\"We'll make those decisions in the caucus room,\" Mr Mitchell said.\n\nMeanwhile, Member for Pembroke Luke Edmunds said his party had showed Tasmanians at last night's no-confidence vote that Labor MPs \"would stick by our values\".\n\nUpper house MLC Luke Edmunds says his party has stuck by its values.\n\n\"Tasmania has a decades-long problem from what happened in 2010. We've proved that we won't be buckling through trade offs and horse-trading,\" he said.\n\nUnder the microscope Photo shows Tasmanian Greens leader Nick McKim and Greens MHA Cassy O'Connor Tasmania's Labor-Green power-sharing deal of 2010 lasted longer than many expected.\n\nIn 2010, Labor formed government through a deal with the Greens.\n\nMr Edmunds said he did not necessarily think Dean Winter needed replacing as party leader.\n\n\"It is a state of flux, as is what happens after an election,\" he said.\n\n\"So we will talk to each other collaboratively, but the issues I'm concerned about at he issues that matter to my electorate and I will continue to fight for that.\"\n\nLeft-leaning faction is strongest, former leader says\n\nFormer leader Bryan Green says Labor will \"come back\" from the recent poor election result. (ABC News: Maren Preuss)\n\nFormer Labor leader Bryan Green has told ABC Mornings the numbers show \"if the left puts someone forward, that they will get the position\".\n\n\"That's just how the numbers are — but in the end, the caucus makes the decision,\" Mr Green said.\n\n\"The caucus alone, it's not an outside faction that makes that decision.\"\n\nLoading...\n\nHe said either Ella Haddad and Josh Willie, both of the left faction, would make good leaders.\n\nHe said the party's record-low vote at the recent state election worried him.\n\n\"Of course the Labor Party will come back, it's a matter of looking inwards, seeing what we need to do, and then get on and take it up to the government.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/australia-host-womens-softball-world-cup-2027/105674818",
    "title": "Australia announced as 2027 Women's Softball World Cup host",
    "publish_date": "Tue, 19 Aug 2025 22:10:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Queensland has won the right to host the 2027 Women's Softball World Cup finals.\n\nIt will be the first time Australia has hosted the World Baseball Softball Confederation (WSBC) tournament since the inaugural event in 1965 in Melbourne, where the national team won gold.\n\nThe top eight women's teams in the world will battle for the title of World Champions at Talobilla Park in Redcliffe, north of Brisbane, from April 5 to 11, 2027.\n\nThe tournament will be a qualifying event for the Los Angeles 2028 Olympics and will be held five years ahead of the Brisbane 2032 Games.\n\nThe Australian women's softball team won medals at four consecutive Olympics from 1996 to 2008. (ALLSPORT via Getty Images: Darren England)\n\nWBSC President Riccardo Fraccari travelled from Switzerland to Redcliffe to make the announcement on Wednesday and said it was an \"historic moment.\"\n\n\"The best eight teams of the world will be here … the attention of the world will be here,\" Mr Fraccari said.\n\n\"For Australia and for this community, I think it's very important … in the last five Olympics where softball was present, Australia has had four medals.\n\n\"This World Cup is a link from the past to the future.\n\n\"We hope to get softball into Brisbane 2032 [Olympic Games],\" he said.\n\n'Massive global appeal'\n\nSoftball Australia CEO Sarah Loh said it was an important step in the peak body's bid for the sport to be included in the 2032 Brisbane Olympic and Paralympic Games, which is yet to be determined by the Organising Committee.\n\n\"I think we've got an excellent case,\" Ms Loh said.\n\n\"At last year's Women's World Cup in Italy, there was over 64-million views — so, we know we've got big appeal from a corporate perspective for dollars.\n\n\"We, as baseball and softball, have massive global appeal and we're going to help sell a lot of tickets and bring a lot of spectators to our grounds,\" she said.\n\nMs Loh believes there is a strong case to get softball into the 2032 Brisbane Olympic Games. (ABC News)\n\nMoreton Bay Mayor Peter Flannery said securing the hosting rights was a major coup for the city of Redcliffe, which has one of the largest softball clubs in the state with more than 700 members.\n\n\"For people to come here and see some of the best players in the world… this will be the biggest sporting event that's ever happened in the city of Moreton Bay.\"\n\nMr Flannery said he believed the region should host the sport at the 2032 Games over Logan City Council, which has also made a public pitch.\n\nFederal Minister for Sport Anika Wells said the Albanese Government would contribute $750,000 to help deliver the event.\n\n\"It is so important on the runway to Brisbane 2032 to give everybody an ideal launch pad … at LA 2028,\" Ms Wells said.\n\nAustralia won silver in baseball at the Athens 2004 Olympics. (Getty Images: Nick Laham)\n\nShe said Softball Queensland has 6,428 members — the highest membership of any Australian state.\n\nQueensland's Minister for Sport, Racing and the Olympic and Paralympic Games Tim Mander said the tournament will inspire young softballers.\n\n\"100,000 people play softball in Australia, [Queensland] has the highest participation rate, and we want to make sure that keeps going up,\" Mr Mander said.\n\nLast tournament on home soil held 60 years ago\n\nThe first ever Women's Softball World Cup was played at Melbourne's Albert Park in February 1965, with five participating teams: Australia, Japan, Papua New Guinea, New Zealand and USA.\n\nThe Australians emerged with a 1-0 triumph over the USA to claim the inaugural world title.\n\nMs Swann played in the inaugural event hosted in Melbourne in 1965. (ABC News)\n\nIn the years since, it has been hosted across 10 other countries, including the United States, El Salvador, Japan and Italy.\n\nMargaret Swann played in Australia's winning side in 1965 and joined dignitaries and players to be part of the announcement in Redcliffe.\n\n\"We're going to have so many Australians loving softball … it's going to be right up there with everything [other sports], \" Ms Swann said.\n\n\"I think it's wonderful for the girls, they've got so much opportunity [to] fight to get into that [Olympic] team.\"\n\n\"To be an Olympian, that would be lovely.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/red-tape-international-doctor-pathways/105652392",
    "title": "Authorities defend approach on overseas GPs as country vacancies continue",
    "publish_date": "Tue, 19 Aug 2025 21:59:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "General practitioners and clinic owners say red tape and a lack of supervisors are preventing internationally trained doctors from filling the gaps in Australia's healthcare system.\n\nAustralia is short by about 2,400 full-time equivalent GPs, with communities in Western Australia's north among those feeling the consequences.\n\nDr Izhar Hashim was a specialist doctor in Malaysia before deciding to practice in Australia.\n\nIzhar Hashim describes the fellowship process as long and unnecessarily complicated. (ABC Midwest & Wheatbelt: Brianna Mellville)\n\nIt took more than a year for Dr Hashim's working visa to be approved, and now he is undergoing two years of training to be certified as an Australian GP.\n\nCurrently completing his fellowship in Geraldton, 400 kilometres north of Perth, he said the shortage of available doctors was obvious.\n\n\"Even when I'm at the airport the first time, the immigration staff were quite happy that I am a GP,\" he said.\n\nThe fellowship process involved exams and being supervised by a vocationally registered GP.\n\n\"You have to wait for a lot of time to get something done, and it's a bit frustrating,\" he said.\n\nThe Royal Australian College of General Practitioners (RACGP) and the Australian Health Practitioner Regulation Agency (APHRA) maintain and enforce GP standards across the country.\n\nDr Hashim said the overlapping regulatory bodies complicated the process, and he had to provide the same documents to both agencies.\n\nSupervisor shortages\n\nOne aspect limiting internationally trained doctors from becoming fellows has been the lack of supervisors in regional locations.\n\nA local practice in Broome was forced to close due to the lack of an in-person supervisor to monitor training practitioners.\n\nThe only GP clinic in Northampton, in WA's Midwest, also closed earlier this year due to funding and staff issues.\n\nSpectrum Health chief executive Phillip Coelho oversees more than 50 medical centres across WA, including the now-defunct Broome practice.\n\nThe Broome Doctors Practice on Napier Terrace will not be reopening. (ABC Kimberley: Vanessa Mills)\n\nMr Coelho said supervisor incentives were \"non-existent\" and the work was unpaid, time-consuming, and challenging.\n\n\"The only way you can get GPs into rural areas is from overseas and the beloved government of ours keeps interfering in the guidelines, making it more difficult,\" he said.\n\n\" Having a supervisor physically present … sounds good, but in this day and age, with the modern technology, you don't have to have another doctor physically sitting there. \"\n\n'No GP better than an unsafe one'\n\nRACGP rural faculty chair Michael Clements said some practices' desire to remove red tape was motivated by money, rather than making healthcare accessible.\n\nBut he conceded that a lack of supervisors was impacting GP training and availability in some country towns.\n\nMichael Clements says having no GP in a regional town is better than having an unsafe one. (Supplied: Fairfield Central Medical Practice)\n\n\"Some corporate entities look at a doctor as a money-making machine and will happily put a doctor somewhere … without giving that doctor the due respect and time they deserve,\" Dr Clements said.\n\n\" I think there are many politicians [as well] that would prefer to see any doctor in a town because it meets their political needs, than having a safe doctor in the town. \"\n\nHe agreed supervisor shortages posed an issue and \"one of our greatest\" was finding GPs with the capacity to take on trainees.\n\nA solution to the shortage\n\nTrainee GP Nicole Wong has taken advantage of the new program from the RACGP that provides training posts in communities.\n\nDr Wong was in her second term of training and moved to Karratha, 1,530km north of Perth, earlier this month.\n\nShe jumped at the chance to move regionally, particularly for the chance to provide continuous care to locals.\n\nNicole Wong recently moved to Karratha to continue training. (ABC Pilbara: Kimberley Putland )\n\n\"I enjoy camping, I like being out in nature. I'm not fussed that I can't go shopping every weekend, or that if I do go shopping,\" she said.\n\n\" I love the intergenerational care as well, caring for every member of the family. I think that's so special, and I feel really lucky to be able to do that. \"\n\nDr Wong's training supervisor, Dr Keith Figueiredo, is the director of Panaceum Health based in Geraldton, 1,100km south of Karratha.\n\nHe said Karratha was one of the first locations to have a remote registrar.\n\n\"Every week I'll catch up with Nicole to discuss cases or any concerns that she has, plus anytime that she has any queries, she can message me anytime or phone me anytime,\" Dr Figueiredo said.\n\nHe said the lack of housing and childcare remained key obstacles to coaxing doctors away from major cities.\n\nReforming pathways\n\nIn a statement, AHPRA said they were focused on reforming pathways for international medical specialists.\n\nA spokesperson cited the Expedited Specialist Pathway introduced last year, but this was limited to specialist-qualified doctors and only those trained in the UK, Ireland, or New Zealand are eligible.\n\nMeredith Hammat says her department is always looking at ways to support GPs. (ABC Kimberley: Ruby Littler)\n\nWA Health Minister Meredith Hammat said state and federal governments were regularly in talks about getting more GPs into regional communities.\n\nOther colleges, including the Australian College of Rural and Remote Medicine, also offer remote, over-the-phone supervision programs.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/aubrey-plaza-talks-about-grief-around-jeff-baenas-death/105674700",
    "title": "'Daily struggle': Aubrey Plaza speaks about husband's death",
    "publish_date": "Tue, 19 Aug 2025 21:52:49 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Actor Aubrey Plaza has spoken for the first time about the sudden death of her husband earlier this year, calling the grief \"a giant ocean of awfulness\".\n\nWriter and director Jeff Baena was found dead in his Los Angeles home in January, with a medical examiner's report stating he died by suicide.\n\nHe was 47 years old.\n\nPlaza spoke about her grief on Amy Poehler's Good Hang podcast, with the pair having worked together for years on the sitcom Parks and Recreation.\n\nIn the interview, Plaza compared her grief to the horror film The Gorge, starring Miles Teller and Anya Taylor-Joy.\n\n\"In the movie, there's a cliff on one side and a cliff on the other side then there's like a gorge in between and it's filled with all these monster people that are trying to get them,\" she said.\n\n\"I swear when I watched it I was like, that feels like what my grief is like.\n\n\"At all times there's a giant ocean of awfulness that's right there and I can see it.\n\n\" Sometimes I just want to dive into it and just be in it. And then sometimes I just look at it. And then sometimes I just try to get away from it — but it's always there. \"\n\nGrief a 'daily struggle'\n\nPlaza and Baena began dating in 2011 and the pair married in 2021.\n\nIn March, a medical examiner's report confirmed the pair separated four months before Baena's death.\n\nAubrey Plaza featured in multiple Jeff Baena films. (AP: Invision/Willy Sanjuan)\n\nPlaza starred in Baena's directorial debut, the 2014 zombie comedy Life After Beth, and appeared in two of his other films, The Little Hours and Spin Me Round.\n\nIn 2009 she shot to fame on Parks and Recreation, working alongside Poehler as well Nick Offerman, Chris Pratt, and later Adam Scott.\n\nIn 2023, she was nominated for a Golden Globe for her role on the second season of The White Lotus, and then starred in the Marvel television series Agatha All Along.\n\nShe appeared on Poehler's podcast to promote her latest film, Honey Don't!, which also stars Margaret Qualley.\n\n\"Overall, I'm here and I'm functioning. I feel really grateful to be moving through the world,\" Plaza said.\n\n\"But it's like a daily struggle, obviously.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/asx-markets-business-live-news/105674804",
    "title": "Live: CSL shares fall for second day, James Hardie nosedives",
    "publish_date": "Tue, 19 Aug 2025 21:40:06 +0000",
    "category": "finance",
    "authors": [
      "David Chau",
      "Emily Stewart",
      "Stephanie Chalmers",
      "Michael Janda"
    ],
    "text": "US President Donald Trump blasted an appeal court's decision to temporarily block federal officials from completing a land transfer needed for Rio Tinto and BHP to develop Arizona's Resolution Copper project.\n\n\n\nThe San Francisco-based 9th US Circuit Court of Appeals ruled on Monday that the transfer - which had been slated for Tuesday - should be halted while the court weighs a request from the San Carlos Apache tribe to block the project for religious, cultural and environmental reasons.\n\nThe mine's construction would cause a crater that would swallow a site where the Apache worship. That has fueled strong opposition from all but one of the state's 22 Native American tribes, as well as the National Congress of American Indians.\n\nIt was the first time any court has ruled in favour of the Apache or their allies in more than five years of myriad legal manoeuvres against Resolution, slated to become one of the world's largest supplies of a metal used to build nearly every electronic device.\n\nTrump, in a post on his Truth Social platform, called the court a \"radical left court\" and said that those who oppose the mine \"are Anti-American, and representing other copper competitive Countries.\" \"It is so sad that Radical Left Activists can do this, and affect the lives of so many people,\" Trump said in the post. \"We can't continue to allow this to happen to the U.S.A.!\" Trump did not outline any actions he plans to take to sway the court, but said that \"our Country, quite simply, needs Copper — AND NOW!\"\n\nThe court made clear it takes \"no position on the merits\" of the Apache's arguments and would expedite its review. The court asked for filings to be submitted by October 14, but has not yet scheduled a hearing date. Ten of the appeal court's 29 members were appointed by Trump.\n\nRio, which owns 55% of the project to BHP's 45%, declined to comment on Trump's post, but said it was \"confident the court will ultimately affirm\" the land transfer.\n\nTrump's post comes less than a month after he imposed a copper tariff on wiring and pipe, but not the copper concentrate produced by mines themselves, a levy falling far short of what the mining industry had expected. That will allow other countries to import copper into the U.S. without fear of tariff implications.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/lamb-prices-rise-in-butchers-restaurants-supermarkets/105515532",
    "title": "Traditional lamb roast out of reach for many families as prices double",
    "publish_date": "Tue, 19 Aug 2025 21:24:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "The price of a leg of lamb in supermarkets has almost doubled in the past 18 months, as a drought ravaging southern Australia squeezes supply.\n\nSuccessive lamb price records have tumbled at the saleyards since late May, with eye-watering prices driven by frenzied bidding for top-quality fat lambs.\n\nAs the costs are passed on at the retail level, shoppers are choosing cheaper alternatives like chicken and pork.\n\nThe price of lamb has risen since January last year. (ABC Rural: Jane McNaughton)\n\nDrought drives prices higher\n\nA leg of lamb is selling for $13 per kilo at Coles and Woolworths, up from $8 per kilo in the major supermarkets in January 2024.\n\nChops are now $21 per kilo at Coles, up from $12.50 just 18 months ago.\n\nRachael Yeo has cut back on buying lamb for her family. (ABC Rural: Jane McNaughton)\n\nSmeaton mother and community cook Rachael Yeo said despite lamb being her favourite meat, it was no longer a regular staple on her dinner table.\n\n\"We used to have lamb maybe once a week, but now we're probably only having it once a month,\" she said.\n\n\"It's too expensive and chicken is a lot cheaper, we can buy good quality free range chicken for a really good price so we opt for that now.\"\n\nMr Dalgleish says lamb prices will remain high for years to come. (ABC Rural: Jane McNaughton)\n\nMore chicken, pork on the menu\n\nAgricultural market analyst Matt Dalgleish said the retail price of lamb followed the trend at the saleyards.\n\n\"Saleyard pricing of lamb nationally over the last year has gone up by about 32 per cent,\" he said.\n\nBut butcher Justin Cashman, from Colac in south-west Victoria, said it was difficult to pass that cost on to consumers.\n\n\"As a sheep farmer the prices are fantastic … but I don't think we're charging enough in the butcher for it,\" he said.\n\n\"I simply know we're not making enough out of lamb.\n\nJustin Cashman says it is difficult to keep retail lamb prices low. (ABC Rural: Jane McNaughton)\n\n\"Only four or five weeks ago we simply couldn't get enough racks or cutlets but that's stopped, people aren't paying for it anymore.\"\n\nMr Cashman said he was selling a leg of lamb for $15.90 per kilo, but that price was a tough ask for many families.\n\n\"Our poultry sales have probably increased 30 per cent in the past couple of weeks and our pork numbers are also up,\" he said.\n\nMr Cashman said the trend was evident in hospitality as well, with restaurants sourcing alternative meats.\n\n\"[Our customers] in the restaurant trade are putting cheaper things on the menu to try and entice people in the door,\" he said.\n\nLamb prices are expected to remain high until Australia's sheep flock recovers. (ABC Rural: Jane McNaughton)\n\nRed meat 'pricey'\n\nRed meat sales have declined recently at Ritchies IGA stores, according to chief executive Fred Harrison.\n\n\"Red meat is generally perceived as pricey,\" Mr Harrison said.\n\n\"People might be buying more beef mince, which is a cheaper cut of product.\n\n\"At Ritchies we're currently looking at around $15.99 per kilo mark for a leg of lamb, but we also run promotions quite often at about $11 per kilo.\"\n\nHe said lamb as a roast still represented good value.\n\n\"But when you start getting to cutlets, they are quite expensive on a per kilo basis and to try and feed a family you could be up for a lot of money,\" Mr Harrison said.\n\n\" We're seeing people manage the budget by buying a bit differently. \"\n\nFred Harrison says supermarkets' larger supply chains can reduce price fluctuations on shelves. (ABC News: Kyle Harley)\n\nSupermarkets can keep their prices lower than butchers by offsetting losses on certain cuts of meat to other products, because of their larger economies of scale.\n\n\"You have to walk all the way to the back of the store to the meat aisle, and on the way you might pick up five or six other items, so there is a sales strategy there,\" Mr Dalgleish said.\n\n\"It makes it tough for independent butchers.\n\n\"I think we will eventually see this high price [in the saleyards] flow through to the retailers, absolutely.\"\n\nMr Cashman is considering increasing the price of lamb at his butcher store. (ABC Landline: Pip Courtney)\n\nA Coles spokesperson said there was still strong overall demand for lamb with some customers \"looking for value and others opting for more premium cuts rather than eating out\".\n\n\"We're always looking for opportunities to deliver value on top-quality Australian lamb, and other meat, for our customers, while also supporting fair prices for farmers,\" a Woolworths spokesperson said.\n\nWoolworths charges $19 per kilo for lamb chops, or $16 on special in Ballarat in July. (ABC Rural: Jane McNaughton)\n\nPrice increases to continue\n\nAustralia's sheep flock is shrinking, with numbers expected to stay low until at least 2027.\n\nLamb prices are expected to remain high until the flock recovers from the drought.\n\n\"If the drought is to continue for another six or nine months, then it will have a longer-term impact on the quality, but currently the [quality reduction] is only minimal,\" Mr Harrison said.\n\nMr Dalgleish said lamb prices would continue to rise.\n\n\"We're going to keep paying more and more into the next few years just because of that tight supply and very strong offshore demand,\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/us-open-mixed-doubles-champions-through-to-semifinals/105674672",
    "title": "Defending champs trump singles stars to reach US Open mixed doubles semis",
    "publish_date": "Tue, 19 Aug 2025 20:49:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "Veteran doubles experience overcame singles stardom as defending champions Andrea Vavassori and Sara Errani reached the semifinals at the US Open's re-imagined mixed doubles, as the event kicked off with a new format and new fans.\n\nVavassori and Errani downed 2022 Wimbledon singles winner Elena Rybakina and 2024 US Open singles finalist Taylor Fritz 4-2, 4-2, before outlasting Karolina Muchova and Andrey Rublev 4-1, 5-4(4) in the quarterfinals.\n\nThe Italians had earned wildcard entries.\n\nThe pair had added motivation to retain their crown as the year's final major took a new approach to the event beloved by fans but often lost in a schedule that is dominated by singles action, moving the competition to five days before the main draw.\n\nThis year's format saw eight pairings based on the combined singles rankings and eight wildcards, a move that left some doubles competitors fuming — including Vavassori and Errani — but brought a sellout crowd to Arthur Ashe Stadium.\n\n\"The positives are for sure that the stadium was packed in the second match,\" Vavassori said, after downing Fritz and Rybakina.\n\n\"It's a great thing for doubles to be seen by more people. I have to give them credit.\n\n\"We're also playing for all the doubles players that could not be here, so we tried to do our best.\"\n\nThe Italian duo will face Danielle Collins and Christian Harrison after the last-minute tournament additions advanced to the semis with a stunning 4-1, 5-4(2) win over fellow Americans Ben Shelton and Taylor Townsend.\n\nThe 2022 singles champion, Iga Świątek, showed little sign of fatigue a day after clinching the title in Cincinnati, as she and teammate Casper Ruud downed American duo Madison Keys and Frances Tiafoe 4-1, 4-2 in their opener.\n\nThey made easy work of grand slam doubles finalist Caty McNally and partner Lorenzo Musetti 4-1, 4-2 later in the day, to claim another of the semifinal spots.\n\nThe semis and final are set for Thursday, AEST.\n\n\"Last two days felt like one long day but I'm super happy to be here and playing with Casper,\" Świątek said.\n\n\"Didn't have time to play many doubles to practice but I think I can improvise pretty well.\"\n\nŚwiątek and Ruud will face the top-seeded team of American Jessica Pegula and Briton Jack Draper in the semifinals after they crushed the all-Russian duo of Mirra Andreeva and Daniil Medvedev 4-1, 4-1.\n\nDraper and Pegula had earlier dispatched five-time grand slam singles champion Carlos Alcaraz and former women's US Open champion Emma Raducanu in the last 16.\n\nFans turn out in big numbers for the 'Hollywood of mixed doubles'\n\nA logjam of cars waited long into the first round to enter the Flushing Meadows grounds as spectators abandoned their taxis, walking up the Grand Central Parkway to get inside the Billie Jean King National Tennis Center.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt was the earliest sign of business not-as-usual for the US Open's \"fan week\" as ticketholders shelled out to catch the early action just one day after the Cincinnati Open concluded.\n\n\"We're really excited. We heard it was like the Hollywood of mixed doubles,\" said Boston native Krystyna Zaluski, who brought her 13-year-old son to the tournament for the first time.\n\n\"This event made it so simple for us to come out here.\"\n\nThat star power was dented slightly by the last-minute withdrawal of Italian Jannik Sinner, a day after illness forced the world number one to retire five games into his Cincinnati Open final.\n\nAmericans Danielle Collins and Christian Harrison replaced Sinner and partner Kateřina Siniaková in the draw.\n\nReuters",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-20/sa-youth-detention-isolation-increase-50-per-cent/105673036",
    "title": "'Punished like a dog': Report reveals increase in isolations at SA youth detention centre",
    "publish_date": "Tue, 19 Aug 2025 20:48:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "A new report has revealed isolations at South Australia's only youth detention centre increased by 50 per cent during a period last year and has questioned the legality of their use, with one respondent saying they felt they were being \"punished like a dog\".\n\nThe report into the Kurlana Tapa Youth Justice Centre at Cavan, which was tabled in state parliament last Tuesday, found that some children were “in effect” being isolated as “a form of punishment” – despite this being prohibited by the state’s youth justice regulations.\n\nThe report found the number of isolations – both ordered by staff and requested by detainees – increased by 50 per cent over a period in 2024.\n\nThe report looked at detainees held at the youth detention centre north of Adelaide. (ABC News)\n\n“The use of isolation as a routine response to complexity, behavioural risk, or staffing constraints undermines the rehabilitative intent of youth detention and reflects a failure to meet required standards of care,” the report states.\n\n“Children and young people report being locked in their rooms for periods with reduced access to education, exercise, or human connection.\n\n“The psychological impact of being isolated without clear explanation or foreseeable end was raised by children and young people as a source of distress.”\n\nThe Department of Human Services, which manages the facility, was also accused of “under-reporting and misclassification” of isolation orders at the facility.\n\nChildren raised concerns\n\nThe report, which examined records from early and mid-2024, was compiled by Training Centre Visitor Shona Reid, who is legislated to advocate for those detained at Kurlana Tapa.\n\nShona Reid is the legislated advocate for youth detainees in SA. (ABC News)\n\nMs Reid said the investigation was prompted by an increase in requests to her office from children and young people “who felt that they were ‘unfairly’ being ordered to isolate in their rooms”.\n\nThe report found that “in many cases” isolation was used “without clear adherence to the required legal grounds” and “in ways that may be perceived by children and young people as punitive or humiliating”.\n\nIt said isolation in these circumstances was contrary to SA’s Charter of Rights for Youths Detained in Training Centres and had \"the potential to breach multiple provisions of international law”.\n\n“Serious questions remain about the lawful authority for a range of isolation practices,” the report states under a headline titled “unlawful or unregulated use of isolation”.\n\nOne child reportedly described the experience as being “punished like a dog and forgotten”.\n\nAnother reportedly said they feared the system would “never see them as more than their worst moments”.\n\n“These are not isolated accounts,” the report states.\n\n\" They reflected a broader pattern of disconnection, fear, and resignation. \"\n\nAverage isolation time 'brief', minister says\n\nHuman Services Minister Nat Cook, asked about the report’s claim of unlawful or unregulated isolation practices, said she had “every confidence that the law and the regulations are being followed”.\n\n“I don’t believe that the staff are breaching those rules,” she said.\n\n“They’re following procedure and keeping children as safe as they possibly can in this environment where things are often heightened.”\n\nMs Cook said Ms Reid’s report was using “quite a long period of data” during which the state government has made “a range of procedure and staff changes”.\n\nShe added that the time children and young people were spending in isolation was “brief”.\n\nMinister Nat Cook says the amount of time children and young people are spending in isolation is \"brief\". (ABC News: Stephanie Richards)\n\n“When we look at last year’s data for isolation, the average time that a young person or a child spends in an isolation circumstance is 14 minutes,” she said.\n\n“It’s not recurring, it’s as isolated as it can be in terms of the event, but it’s as supported and as comfortable as it can be as well given the feeling and emotion that’s being displayed by a young person.”\n\nAsked whether staff were properly explaining to children why they were being put in isolation, Ms Cook said: “There is absolutely a procedure that’s followed.”\n\n“I am very confident in the youth justice team … that they make every attempt possible to ensure that young people are spoken to and spoken with and listened to,” she said.\n\nNumber of isolation orders rise\n\nKurlana Tapa, also known as the Adelaide Youth Training Centre, is SA's only youth detention centre.\n\nIn 2023-24, it had a daily average population of 32 children and young people.\n\nA new accommodation unit at Adelaide’s Kurlana Tapa Youth Justice Centre, which was opened in 2024. (ABC News: Stephanie Richards)\n\nMs Reid’s report examined the frequency of both “staff-ordered” and “resident requested” isolations.\n\nA resident requested isolation occurs when a young person requests to return to their room outside of scheduled lockdown hours to get away from peers.\n\nFrom the third quarter of 2023-24 to the first quarter of 2024-25, the number of staff ordered isolations increased from 162 to 215.\n\nOver the same period, the number of resident requested isolations rose from 31 to 100.\n\nMs Reid said the 50 per cent increase in total isolations likely reflected “a persistently high reliance on the technique of isolation to create separation from peers, especially during education hours and afternoon shifts”.\n\nMs Reid says the increase in total isolation likely reflected a \"high reliance on the technique of isolation\". (ABC News)\n\nShe said the report found one case where a child had spent six hours in isolation because it overlapped across several different administrative isolation times.\n\n“Whilst administratively they’re not considered by the staff or the centre as isolation, they’re very real experiences for children,” he said.\n\n“We need to be really careful how we use those, and that is why I’m making those very strong claims that we need to be mindful of the law and our international obligations towards children’s rights in these settings.”\n\nIn response to questions about the lawfulness of its isolation practices, a spokesperson for the Department of Human Services said isolation is “considered an acute response to a risk presented by an individual”.\n\n“This may be for example, a proactive response to ensure the safety of one young person from another,” the spokesperson said in a statement.\n\n“Isolation also includes when a young person requests to be in their room, for example if they are unwell and want to sleep.\n\n“Staff must adhere to operational procedures in line with the Regulations when using isolation at Kurlana Tapa, including approval processes, record-keeping and review requirements.\"\n\nThe spokesperson added that staff must also “ensure that young people subject to isolation have access to their rights” under the Charter of Rights for Youths Detained in Training Centres.\n\n“These requirements are reflected in staff training and supervision.”\n\nA young person’s room in an existing Kurlana Tapa Youth Justice Centre building. (Supplied: Training Centre Visitor's office)\n\nMinister says recommendations being addressed\n\nMs Reid’s report makes three recommendations, which include amending legislation to provide “robust guidance” on the use of isolation as well as greater investment in staff training and IT systems.\n\nMs Cook said the government would respond “as quickly as we can” to the recommendations, adding that some suggestions were already in train.\n\n“We’re very confident that we’ve already addressed quite a large percentage of those pieces of work that need to go towards fulfilling the recommendations,” she said.\n\n“In terms of making sure that the policy meet the practice, the practice is being delivered as it should be, and children are at the centre of that.”",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/hunter-valley-s-newly-two-hatted-restaurant-is-hosting-an-anniversary-dinner-of-greatest-hits-20250812-p5mm9q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hunter Valley’s newly two-hatted restaurant is hosting an anniversary dinner of greatest hits",
    "publish_date": "Wed, 20 Aug 2025 12:00:19 +1000",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outGood Food events Hunter Valley’s newly two-hatted restaurant is hosting an anniversary dinner of greatest hits Frank Fawkner of EXP. Restaurant will reimagine 10 of the restaurant’s most iconic dishes for a special anniversary dinner series in September. Erina Starkey August 20, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nTen years ago, Frank Fawkner made the difficult decision to step away from his role as head chef of Muse – which was the Hunter Valley’s most celebrated restaurant at the time – to strike out on his own. A decade on, and his own restaurant, EXP., has just been awarded a second hat by Good Food, with Good Food Guide editor David Mathews calling it “the most exciting restaurant in the region”. EXP. Restaurant chef-owner Frank Fawkner plating up a dish. Dean Sewell To mark the milestone, Fawkner is hosting Ten Years of EXP., a dinner series spread across four nights next month, from Friday, September 19, to Monday, September 22. Each evening will showcase 10 of the restaurant’s most iconic dishes reimagined. On the Friday evening, Good Food app editor Erina Starkey will host a Q&A with Fawkner to explore the decade-long evolution of EXP. and the vision behind it.\n\nAdvertisement\n\nOne of the dishes making a comeback will be EXP.’s Ego, which is Fawkner’s version of the Magnum ice-cream. Introduced to the menu in 2018, the frozen dessert was originally made with a wattleseed parfait filling, lemon myrtle caramel and Daintree chocolate shell. Duck with fermented cabbage and duck-fat hollandaise. Dean Sewell “We’ve done around 10 or 12 versions over the years using similar types of ice-cream or with different layers, or coated in meringue and torched,” Fawkner says. For the dinner, he’ll be updating it with a truffle-infused cream made using local Kanimbla truffles and macadamia praline. Longtime diners at EXP. will also recognise Redgate Farm duck, which is sourced from a free-range farm in nearby Seaham. It’s a fixture of the menu, where you can often find it wood-roasted over iron bark or cherry wood, or cured into salami, chorizo, prosciutto and lardo. The duck will be served two ways: a seven-day dry-aged duck breast with black garlic hollandaise, and a duck and pistachio terrine, wrapped in smoked duck “bacon” made from pressed duck legs.\n\nAdvertisement\n\nWarrigal greens curry tart with pickled cucamelon and desert lime. Dean Sewell Over dinner, Fawkner will share the story of EXP., from its origins at Oakvale Wines to its pivotal move to Pokolbin Village Estate in 2020, where Fawkner added a chef’s counter and shifted to a tasting menu format. What hasn’t changed, though, is the restaurant’s commitment to delivering an immersive experience – not just through the food and wine or the service, but through the furniture, handcrafted by a local wood sculptor, and the knives and forks, custom-forged by a local metal artist. EXP. Restaurant makes its own charcuterie in house. Dean Sewell “One in three of our diners will turn over our brass charger plates to see if there’s a signature or brand on the back,” Fawkner says. “There isn’t one.”\n\nAdvertisement\n\nLooking ahead, Fawkner would like to phase out all standard cutlery in favour of handmade artisan pieces. He’s also exploring a revamp of the dining room layout, and some new tables and chairs. Getting the restaurant to where it is today has been a process of constant refinement, he says. “We’ve just been building and building and building, and trying to give people the best experience we can. To be recognised for that now is amazing.” Ten Years of EXP will be held at EXP. Restaurant at the Pokolbin Village Estate on Friday, September 19, to Monday, September 22, $185 for a six-course menu of 10 dishes. Matched wines are priced at an additional $90 per person, or upgrade to the somm selection for $150. Tickets are available here.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/culture/books/a-lyrical-journey-through-australia-s-interior-20250813-p5mmno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A lyrical journey through Australia’s interior",
    "publish_date": "Wed, 20 Aug 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Declan Fry"
    ],
    "text": "An Australian born in Europe, the narrator seems to be a journalist who has returned, perhaps recently, from the Middle East. We learn that he is travelling west, to Karilwara, Ngaanyatjarra country. He is hoping to see an old friend and man of high degree, Mr Giles, a traditional doctor who is also a famed artist busy navigating the humbug of craven dealers, gallery folk and “a praetorian guard of collectors from down south”.\n\nYilkari offers a vision of the Western Desert filled with drifters and sundowners, vagrants, vagabonds, loners and backpackers and desert specialists. The world through which its unnamed narrator journeys, accompanied by various companions, is one you can hear and smell: desert oak and dunes, burnt mulga plains, ironwoods, sacred sites, conception places, station homesteads, bungalows, Queenslanders, ageing diesel pumps and sorry camps and caravan parks attended by frantic camp dogs.\n\nNicolas Rothwell has written eight books but Yilkari is a first: a collaboration, co-authored with his wife, Alison Nampitjinpa Anderson, a Luritja-Pintupi artist and writer from the Western Desert community of Papunya.\n\nOver the following four chapters – each vignette is linked and works to refract its neighbours – he journeys further across the country. This trip becomes a search for a sense of place. The country is understood as something to be taken in, read and lived and travelled through, loved and feared and complicated by and invested in. A gateway through which the past becomes clearer and the self opens to a kind of unguarded reckoning.\n\nAuthor Nicolas Rothwell.\n\nThe first of the narrator’s travelling companions is Jan Valentin, a Central European composer and “brother spirit” brought up in Siberia. Valentin reads the land as a wilderness. For the narrator, it offers refuge. Valentin’s presence prompts memories of the fall of the Berlin Wall, erected as the narrator is born, toppling by the time he first meets Valentin. Such memories are among the few we learn of the narrator’s past; mostly he serves as a receptive ear for the stories his companions offer.\n\nLike Valentin, the narrator fears having expended or lost touch with the vitality of his art. His practice of listening and conversing mirrors the practice Valentin describes as embodying the ideal approach to music: “Sounds from outside come into you. They crystallise inside you.” The narrator’s relationship with his itinerant father has perhaps encouraged him to seek belonging.\n\nHence the book’s title, a word meaning, among other things, “clarity; everlastingness”. The narrator’s travelling companions are not just interlocutors but “guarding spirits”, each of whom offers a different but connected kind of Yilkari. One companion, Dylan, calls it the “dream of union”: a union that is both metaphysical and tied to place, to the fact of country as a living, charged presence.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-unveils-smile-transformation-20250820-p5moen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "1000-Lb Sisters star Tammy Slaton unveils smile transformation",
    "publish_date": "Wed, 20 Aug 2025 11:59:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "1000-Lb Sisters star Tammy Slaton unveils smile transformation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-police-detail-case-against-story-bridge-protest-20250819-p5mo59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: ‘Broad spell’ of rain hitting SEQ | Olympics venues get $3.4m federal boost | Council’s safety concerns over Palestine protest",
    "publish_date": "Wed, 20 Aug 2025 11:48:09 +1000",
    "category": "sports",
    "authors": [],
    "text": "Transurban’s revenue from Brisbane toll roads increased by 5 per cent to $597 million over the past financial year.\n\nTraffic in Brisbane. Credit: Courtney Kruk\n\nThe results, provided in an ASX release on Wednesday morning, show average workday traffic increased by 1.1 per cent on Brisbane toll roads, while average weekend and public holiday traffic increased by 2.1 per cent.\n\nHowever, total profit for the year slumped to $178 million, from $376 million the previous year.\n\nThe release states the Logan West upgrade project is progressing through the binding upgrade proposal stage, with investigative work and market engagement beginning.\n\n“Key Gateway Motorway connections have been identified to support a successful 2032 Olympic and Paralympic Games,” it says.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/queensland/redcliffe-to-host-softball-world-cup-throwing-curveball-to-logan-s-olympic-hopes-20250817-p5mniu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Redcliffe to host Softball World Cup, throwing curveball to Logan’s Olympic hopes",
    "publish_date": "Wed, 20 Aug 2025 11:32:59 +1000",
    "category": "sports",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "Redcliffe will host the 2027 Softball World Cup, setting up a fierce competition with Logan City Council in the latest gambit for diamond sports’ inclusion in the Brisbane 2032 Olympic Games.\n\nIt will be the first time Australia has hosted the event since it was held in 1965. Among Australia’s championship-winning team in Melbourne was Margaret Swann, who was at a rain-soaked Redcliffe Surf Live Saving Club for the announcement on Wednesday morning.\n\n“I think softball is going to be right up there with everything, so I think it’s wonderful for the girls,” she said.\n\n1965 world champion Margaret Swann at the announcement that Redcliffe will host the 2027 Softball World Cup. Credit: Cameron Atfield\n\n“They’ve got so much opportunity and fighting to get into the team, that’s a big thing.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/sport/afl/adelaide-preparing-response-to-afl-s-rankine-verdict-20250820-p5mobc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adelaide preparing response to AFL’s Rankine verdict",
    "publish_date": "Wed, 20 Aug 2025 11:27:41 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Adelaide are preparing a response after the AFL informed the club of Izak Rankine’s proposed ban late on Tuesday night.\n\nRankine allegedly directed a homophobic slur towards a Magpies opponent during Saturday night’s match at Adelaide Oval, prompting an investigation by the AFL’s integrity unit.\n\nIzak Rankine of the Crows earlier in the season. Credit: Getty Images\n\nThe club is considering its options and is expected to respond on Wednesday.\n\n“We are having ongoing discussions with the AFL as part of the due process,” a Crows spokesperson said.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-for-gains-ai-stocks-weigh-on-wall-street-a-drops-20250820-p5mo9i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher as retailers rise; James Hardie shares plummet",
    "publish_date": "Wed, 20 Aug 2025 11:23:05 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket had a soft start to trading on Wednesday, as a plunge by building materials maker James Hardie and losses by the mining heavyweights and CSL overshadowed solid gains from the wider market.\n\nThe S&P/ASX 200 inched up 0.2 points at 8889.40 as of 11am AEST, having initially dropped when the market opened. Seven of its 11 industry sectors advanced, offsetting losses from miners, energy and healthcare and tech stocks. The local market lost 0.7 per cent in the previous session, its steepest drop since August 1.\n\nThe Australian dollar slipped 0.1 per cent to US64.50¢.\n\nWall Street took a step back overnight, with AI darlings slumping. Credit: AP\n\nJames Hardie shares plummeted 26.6 per cent after the home sidings maker said its full-year net income was down 60 per cent to $US62.6 million ($96.4 million) as sales in its key US market declined, and warned demand in home repairs, renovations and new construction was “challenging,” with “uncertainty [...] a common thread throughout conversations” with customers and contractors.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/movies/is-it-a-thriller-satire-or-nightmare-eddington-will-keep-you-guessing-20250820-p5mocm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Is it a thriller, satire or nightmare? Eddington will keep you guessing",
    "publish_date": "Wed, 20 Aug 2025 11:19:41 +1000",
    "category": "finance",
    "authors": [
      "Jake Wilson"
    ],
    "text": "The difference is that where the hapless Beau stayed trapped in his head, Eddington aims to capture something of the collective reality Americans have been living through over the last few years, or at least the reflection of that reality in the distorted mirror of social media.\n\nJoaquin Phoenix plays Joe Cross, the sheriff of Eddington, New Mexico, whose commitment to upholding the law is tested by COVID directives.\n\nAri Aster may still be best known as a horror filmmaker, but by now it’s clear his real bent is for satire, to whatever degree there’s a difference. Eddington, his fourth feature as writer-director, launches his kindred spirit Joaquin Phoenix on another odyssey through a nightmare America, following their earlier collaboration Beau Is Afraid .\n\nWe’re in May 2020, with the pandemic well under way, the January 6 riots in the immediate past and the summer of Black Lives Matter on the horizon. But only a portion of this impinges directly on the isolated town of Eddington, New Mexico, where the stalwart local sheriff Joe Cross (Phoenix) insists the virus has yet to spread.\n\nJoaquin Phoenix (left) and Pedro Pascal face off in Eddington.\n\nVisually, Eddington is every inch a Western, the desert vistas offering the same scope for deep-focus staging as the grassy plains surrounding the Swedish commune in Aster’s Midsommar. The gag is the contrast with the small screens the terminally online characters keep peering at, implying that the American ideal of rugged self-reliance may have reached its use-by date.\n\nStill, Joe wears a white 10-gallon hat along with his faintly emasculating glasses, and confronts the town’s smooth-talking Hispanic mayor (Pedro Pascal) in the middle of main street as if anticipating a showdown at high noon.\n\nOne immediate issue is the demand that citizens mask up, which Joe, as an asthmatic, has more reason to resist than most.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-next-following-the-ukraine-talks-at-the-white-house/fpxpihd8t",
    "title": "INTERVIEW: What next, following the Ukraine talks at the White House?",
    "publish_date": "Tue, 19 Aug 2025 23:19:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/video/the-governments-economic-reform-roundtable-kicks-off-in-canberra/cz327lbxh",
    "title": "The Government’s economic reform roundtable kicks off in Canberra",
    "publish_date": "Tue, 19 Aug 2025 09:36:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Government’s economic reform roundtable kicks off in Canberra\n\nPublished 19 August 2025, 8:51 am\n\nNuisance tariffs and a levy on businesses to fund worker training are among the proposals debated behind closed doors on the first day of the federal government's three-day economic roundtable. A hand-picked group of business representatives, politicians and unions have gathered in Canberra for the economic talks. The Treasurer says engagement has been \"outstanding\".",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-woodsides-meg-oneill-bhp-cfo-vandita-pant-csl-dumped/7d286j0e2",
    "title": "CEO SERIES: Woodside's Meg O'Neill & BHP CFO Vandita Pant + CSL dumped",
    "publish_date": "Tue, 19 Aug 2025 08:23:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/article/not-mentioned-matt-canavan-to-hold-own-productivity-forum-focusing-on-energy-prices/k402yw044",
    "title": "'Not mentioned': Matt Canavan to hold own productivity forum focusing on energy prices",
    "publish_date": "Tue, 19 Aug 2025 02:49:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nationals senator Matt Canavan has responded to Treasurer Jim Chalmers' productivity roundtable by announcing he will hold an alternative summit at Parliament House, arguing energy prices are a threat to productivity.\n\n\n\n\n\nAnnouncing the upcoming economic meeting, Canavan was wearing a shirt that read: \"Energy prices are the real productivity threat\", while he drank from a mug that read \"I heart fossil fuels\".\n\n\n\n\n\nFormer Productivity Commission chair Gary Banks is set to give a speech, while the guest list includes some conservative-leaning economists.\n\n\n\n\n\nCanavan's forum will be open to the public, unlike the government's closed-door meeting, which is underway.\n\n\n\n\n\nThe Queensland senator said Treasury’s productivity papers didn't mention the cost of electricity.\n\n\n\nREAD MORE What is the economic reform roundtable and what will it achieve?\n\n\"I'm ready for the prime minister to come down or for Jim [Chalmers] … to explain why they won't explain to the Australian people why power prices have surged under their watch,\" Canavan said.\n\n\n\n\n\n\"Up there at groupthink central, they're not even discussing the issue. No-one is discussing the fact energy prices are the biggest hit to our nation's productivity, the biggest hit to our nation's wealth and prosperity, is the fact we've lost control of our energy market.\"\n\n\n\n\n\nElectricity prices rose for almost half a million households in NSW, south-east Queensland, and South Australia on 1 July following an increase to the Default Market Offer — a reference price for electricity set by the Australian Energy Regulator (AER).\n\n\n\n\n\nAt the time, AER said wholesale and network costs rose in most jurisdictions between 1 per cent and 11 per cent, and retail costs between 8 per cent and 35 per cent compared with last year.\n\n\n\nAt Chalmers' summit, around 30 leaders from business, unions, and civil society have convened in Canberra for three days. The meeting is a key part of the government's strategy to build national consensus around economic reform.\n\n\n\n\n\nChalmers has said the ideas discussed at the roundtable will inform \"the next three budgets and beyond\". A number of topical and controversial ideas for reform are on the table, including major tax reform, deregulating artificial intelligence and a four-day work week.\n\n\n\n\n\nPrime Minister Anthony Albanese has promised the government's economic roundtable will deliver long-lasting change through consensus.\n\n\n\n\n\nThe first day of the roundtable focuses on building resilience.\n\n\n\n\n\nFollowing the treasurer and prime minister's opening addresses, Reserve Bank governor Michele Bullock delivered a presentation outlining Australia's declining productivity performance.\n\n\n\n\n\n— With reporting by the Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-this-killer-causes-a-million-deaths-and-gets-a-special-day/aemxpqx19",
    "title": "INTERVIEW: This killer causes a million deaths - and gets a special day?",
    "publish_date": "Mon, 18 Aug 2025 22:56:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/hunter-valley-s-newly-two-hatted-restaurant-is-hosting-an-anniversary-dinner-of-greatest-hits-20250812-p5mm9q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hunter Valley’s newly two-hatted restaurant is hosting an anniversary dinner of greatest hits",
    "publish_date": "Wed, 20 Aug 2025 12:00:19 +1000",
    "category": "finance",
    "authors": [
      "Erina Starkey"
    ],
    "text": "Advertisement\n\nEating outGood Food events Hunter Valley’s newly two-hatted restaurant is hosting an anniversary dinner of greatest hits Frank Fawkner of EXP. Restaurant will reimagine 10 of the restaurant’s most iconic dishes for a special anniversary dinner series in September. Erina Starkey August 20, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nTen years ago, Frank Fawkner made the difficult decision to step away from his role as head chef of Muse – which was the Hunter Valley’s most celebrated restaurant at the time – to strike out on his own. A decade on, and his own restaurant, EXP., has just been awarded a second hat by Good Food, with Good Food Guide editor David Mathews calling it “the most exciting restaurant in the region”. EXP. Restaurant chef-owner Frank Fawkner plating up a dish. Dean Sewell To mark the milestone, Fawkner is hosting Ten Years of EXP., a dinner series spread across four nights next month, from Friday, September 19, to Monday, September 22. Each evening will showcase 10 of the restaurant’s most iconic dishes reimagined. On the Friday evening, Good Food app editor Erina Starkey will host a Q&A with Fawkner to explore the decade-long evolution of EXP. and the vision behind it.\n\nAdvertisement\n\nOne of the dishes making a comeback will be EXP.’s Ego, which is Fawkner’s version of the Magnum ice-cream. Introduced to the menu in 2018, the frozen dessert was originally made with a wattleseed parfait filling, lemon myrtle caramel and Daintree chocolate shell. Duck with fermented cabbage and duck-fat hollandaise. Dean Sewell “We’ve done around 10 or 12 versions over the years using similar types of ice-cream or with different layers, or coated in meringue and torched,” Fawkner says. For the dinner, he’ll be updating it with a truffle-infused cream made using local Kanimbla truffles and macadamia praline. Longtime diners at EXP. will also recognise Redgate Farm duck, which is sourced from a free-range farm in nearby Seaham. It’s a fixture of the menu, where you can often find it wood-roasted over iron bark or cherry wood, or cured into salami, chorizo, prosciutto and lardo. The duck will be served two ways: a seven-day dry-aged duck breast with black garlic hollandaise, and a duck and pistachio terrine, wrapped in smoked duck “bacon” made from pressed duck legs.\n\nAdvertisement\n\nWarrigal greens curry tart with pickled cucamelon and desert lime. Dean Sewell Over dinner, Fawkner will share the story of EXP., from its origins at Oakvale Wines to its pivotal move to Pokolbin Village Estate in 2020, where Fawkner added a chef’s counter and shifted to a tasting menu format. What hasn’t changed, though, is the restaurant’s commitment to delivering an immersive experience – not just through the food and wine or the service, but through the furniture, handcrafted by a local wood sculptor, and the knives and forks, custom-forged by a local metal artist. EXP. Restaurant makes its own charcuterie in house. Dean Sewell “One in three of our diners will turn over our brass charger plates to see if there’s a signature or brand on the back,” Fawkner says. “There isn’t one.”\n\nAdvertisement\n\nLooking ahead, Fawkner would like to phase out all standard cutlery in favour of handmade artisan pieces. He’s also exploring a revamp of the dining room layout, and some new tables and chairs. Getting the restaurant to where it is today has been a process of constant refinement, he says. “We’ve just been building and building and building, and trying to give people the best experience we can. To be recognised for that now is amazing.” Ten Years of EXP will be held at EXP. Restaurant at the Pokolbin Village Estate on Friday, September 19, to Monday, September 22, $185 for a six-course menu of 10 dishes. Matched wines are priced at an additional $90 per person, or upgrade to the somm selection for $150. Tickets are available here.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/culture/books/a-lyrical-journey-through-australia-s-interior-20250813-p5mmno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A lyrical journey through Australia’s interior",
    "publish_date": "Wed, 20 Aug 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Declan Fry"
    ],
    "text": "An Australian born in Europe, the narrator seems to be a journalist who has returned, perhaps recently, from the Middle East. We learn that he is travelling west, to Karilwara, Ngaanyatjarra country. He is hoping to see an old friend and man of high degree, Mr Giles, a traditional doctor who is also a famed artist busy navigating the humbug of craven dealers, gallery folk and “a praetorian guard of collectors from down south”.\n\nYilkari offers a vision of the Western Desert filled with drifters and sundowners, vagrants, vagabonds, loners and backpackers and desert specialists. The world through which its unnamed narrator journeys, accompanied by various companions, is one you can hear and smell: desert oak and dunes, burnt mulga plains, ironwoods, sacred sites, conception places, station homesteads, bungalows, Queenslanders, ageing diesel pumps and sorry camps and caravan parks attended by frantic camp dogs.\n\nNicolas Rothwell has written eight books but Yilkari is a first: a collaboration, co-authored with his wife, Alison Nampitjinpa Anderson, a Luritja-Pintupi artist and writer from the Western Desert community of Papunya.\n\nOver the following four chapters – each vignette is linked and works to refract its neighbours – he journeys further across the country. This trip becomes a search for a sense of place. The country is understood as something to be taken in, read and lived and travelled through, loved and feared and complicated by and invested in. A gateway through which the past becomes clearer and the self opens to a kind of unguarded reckoning.\n\nAuthor Nicolas Rothwell.\n\nThe first of the narrator’s travelling companions is Jan Valentin, a Central European composer and “brother spirit” brought up in Siberia. Valentin reads the land as a wilderness. For the narrator, it offers refuge. Valentin’s presence prompts memories of the fall of the Berlin Wall, erected as the narrator is born, toppling by the time he first meets Valentin. Such memories are among the few we learn of the narrator’s past; mostly he serves as a receptive ear for the stories his companions offer.\n\nLike Valentin, the narrator fears having expended or lost touch with the vitality of his art. His practice of listening and conversing mirrors the practice Valentin describes as embodying the ideal approach to music: “Sounds from outside come into you. They crystallise inside you.” The narrator’s relationship with his itinerant father has perhaps encouraged him to seek belonging.\n\nHence the book’s title, a word meaning, among other things, “clarity; everlastingness”. The narrator’s travelling companions are not just interlocutors but “guarding spirits”, each of whom offers a different but connected kind of Yilkari. One companion, Dylan, calls it the “dream of union”: a union that is both metaphysical and tied to place, to the fact of country as a living, charged presence.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-unveils-smile-transformation-20250820-p5moen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "1000-Lb Sisters star Tammy Slaton unveils smile transformation",
    "publish_date": "Wed, 20 Aug 2025 11:59:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "1000-Lb Sisters star Tammy Slaton unveils smile transformation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-police-detail-case-against-story-bridge-protest-20250819-p5mo59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: ‘Broad spell’ of rain hitting SEQ | Olympics venues get $3.4m federal boost | Council’s safety concerns over Palestine protest",
    "publish_date": "Wed, 20 Aug 2025 11:48:09 +1000",
    "category": "sports",
    "authors": [],
    "text": "Transurban’s revenue from Brisbane toll roads increased by 5 per cent to $597 million over the past financial year.\n\nTraffic in Brisbane. Credit: Courtney Kruk\n\nThe results, provided in an ASX release on Wednesday morning, show average workday traffic increased by 1.1 per cent on Brisbane toll roads, while average weekend and public holiday traffic increased by 2.1 per cent.\n\nHowever, total profit for the year slumped to $178 million, from $376 million the previous year.\n\nThe release states the Logan West upgrade project is progressing through the binding upgrade proposal stage, with investigative work and market engagement beginning.\n\n“Key Gateway Motorway connections have been identified to support a successful 2032 Olympic and Paralympic Games,” it says.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/queensland/redcliffe-to-host-softball-world-cup-throwing-curveball-to-logan-s-olympic-hopes-20250817-p5mniu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Redcliffe to host Softball World Cup, throwing curveball to Logan’s Olympic hopes",
    "publish_date": "Wed, 20 Aug 2025 11:32:59 +1000",
    "category": "sports",
    "authors": [
      "Cameron Atfield"
    ],
    "text": "Redcliffe will host the 2027 Softball World Cup, setting up a fierce competition with Logan City Council in the latest gambit for diamond sports’ inclusion in the Brisbane 2032 Olympic Games.\n\nIt will be the first time Australia has hosted the event since it was held in 1965. Among Australia’s championship-winning team in Melbourne was Margaret Swann, who was at a rain-soaked Redcliffe Surf Live Saving Club for the announcement on Wednesday morning.\n\n“I think softball is going to be right up there with everything, so I think it’s wonderful for the girls,” she said.\n\n1965 world champion Margaret Swann at the announcement that Redcliffe will host the 2027 Softball World Cup. Credit: Cameron Atfield\n\n“They’ve got so much opportunity and fighting to get into the team, that’s a big thing.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/sport/afl/adelaide-preparing-response-to-afl-s-rankine-verdict-20250820-p5mobc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adelaide preparing response to AFL’s Rankine verdict",
    "publish_date": "Wed, 20 Aug 2025 11:27:41 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Adelaide are preparing a response after the AFL informed the club of Izak Rankine’s proposed ban late on Tuesday night.\n\nRankine allegedly directed a homophobic slur towards a Magpies opponent during Saturday night’s match at Adelaide Oval, prompting an investigation by the AFL’s integrity unit.\n\nIzak Rankine of the Crows earlier in the season. Credit: Getty Images\n\nThe club is considering its options and is expected to respond on Wednesday.\n\n“We are having ongoing discussions with the AFL as part of the due process,” a Crows spokesperson said.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-for-gains-ai-stocks-weigh-on-wall-street-a-drops-20250820-p5mo9i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX edges higher as retailers rise; James Hardie shares plummet",
    "publish_date": "Wed, 20 Aug 2025 11:23:05 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket had a soft start to trading on Wednesday, as a plunge by building materials maker James Hardie and losses by the mining heavyweights and CSL overshadowed solid gains from the wider market.\n\nThe S&P/ASX 200 inched up 0.2 points at 8889.40 as of 11am AEST, having initially dropped when the market opened. Seven of its 11 industry sectors advanced, offsetting losses from miners, energy and healthcare and tech stocks. The local market lost 0.7 per cent in the previous session, its steepest drop since August 1.\n\nThe Australian dollar slipped 0.1 per cent to US64.50¢.\n\nWall Street took a step back overnight, with AI darlings slumping. Credit: AP\n\nJames Hardie shares plummeted 26.6 per cent after the home sidings maker said its full-year net income was down 60 per cent to $US62.6 million ($96.4 million) as sales in its key US market declined, and warned demand in home repairs, renovations and new construction was “challenging,” with “uncertainty [...] a common thread throughout conversations” with customers and contractors.",
    "source": "TheAge",
    "cluster_id": 22
  }
]