[
    {
        "url": "https://www.9news.com.au/finance/gold-price-tumbles-on-back-of-trump-pick-for-fed-reserve/4a8ddc97-6017-4973-b55c-700510dd1811",
        "title": "Gold price tumbles after Trump names pick to lead US Federal Reserve",
        "publish_date": "Mon, 02 Feb 2026 00:56:05 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "The slide in the price of gold bullion has continued, with the rare metal fetching $US4738 an ounce at 10.30am AEDT, a drop of 2.5 per cent.\n\nLate week's rally ran out of steam after US President Donald Trump picked Kevin Warsh to become the new Federal Reserve chair.\n\nGold reached about $US5600 during last Thursday after climbing to a then-record $US5000 on Monday.\n\nThe price of gold bullion has fallen since last week's record jump.. (Getty Images/iStockphoto)\n\nCapital.com senior market analyst Kyle Rodda told The Australian Financial Review today the sell-off was the biggest since the 1920s.\n\n\"Ultimately, the markets have welcomed the Warsh nomination. He's seen as experienced, competent and representing a respect by the Trump administration of merit and aptitude over loyalty and servility,\" Rodda said.\n\n\"The apparent respect for institutional integrity from the Trump administration helped spark a recovery in the US dollar and the collapse in precious metals on the basis that the central bank will be guided by a credible person.\"\n\nWarsh could bring about sweeping changes at a central bank that dominates the global economy and markets like no other.\n\nHe would replace current Fed Reserve chair Jerome Powell when his term expires in May.\n\nTrump chose Powell to lead the Fed in 2017 but this year has relentlessly assailed him for not cutting interest rates quickly enough.\n\nThe retreat from gold has also spurred falls in the prices of other precious metals.\n\nSilver has crashed by more than 36 per cent from its peak last week.﻿\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/south-african-dual-citizenship-australians-2026-travel-rules-passport-requirements-legal-updates-explained/204bcec8-363c-4714-9e0d-7f6a46dcdb1b",
        "title": "'Confusion, anxiety': Expats from one country urged to check citizenship status",
        "publish_date": "Sat, 31 Jan 2026 19:05:09 +0000",
        "category": "finance",
        "authors": [
            "Feb"
        ],
        "text": "An \"unconstitutional\"﻿ law that stripped citizenship from South African dual nationals has been reversed – and the implications have sent a ripple of confusion and alarm throughout the expat community.\n\nThe South African Citizenship Act (Act 88 of 1995) previously required South Africans to seek ministerial permission to retain their citizenship before becoming citizens of another country, including Australia.\n\nAnyone who failed to do so would lose their citizenship – until now.\n\nSouth Africans who became citizens of another country without ministerial permission after 1995 automatically lost their SA citizenship. (Getty)\n\nCitizenship restoration is now in full swing after a court ruled this provision was unconstitutional and invalid in May 2025.\n\nIt is not automatic and eligible expats need to use the reinstatement portal.\n\nIt only applies to those who have lost their citizenship on or after 6 October 1995, according to the South African High Commission.\n\nThere were 214,790 South African-born people living in Australia as of 2023, according to the Australian Department of Home Affairs.\n\nREAD MORE: Residents in fear after teenagers invited to planned mass bike rideout in Sydney\n\nWhat is the dual citizenship law in South Africa?\n\nReinstated citizens – including those who retained their citizenship prior to the rule change – are required to enter and exit South Africa using a South African passport﻿, a rule similar to the ETA scheme soon coming into effect in Britain.\n\nThis has been the entry and exit requirement in South Africa since 2004.﻿\n\nIt may impact thousands﻿ of Australian-South African dual citizens who wish to resume their citizenship after their SA passports expired.\n\nThe Australian government's Smartraveller advice﻿ states that \"if you hold Australian-South African dual nationality, by law you must enter and exit on your South African passport\".\n\n\"We recommend all possible dual nationals consult the South African Department of Home Affairs website to verify your citizenship status,\" Smartraveller noted.\n\nThe SA High Commission also states the same on its website.﻿\n\nMost other visitors, including those from Australia, the US, UK, Canada and New Zealand, don't need a visa for tourist or business stays under 90 days.\n\nHayley Reichert, a South African-born expat and advocate living in London, initiated the \"Loss of Citizenship Campaign\" in 2014, which eventually led to last year's court ruling.\n\nReichert told nine.com.au there is now \"significant confusion\" around South African expats hoping to return home on foreign passports after the resumption of their citizenship.\n\nHayley Reichert is a passionate advocate for South Africans living abroad. (Supplied)\n\nShe runs a voluntary initiative supporting South Africans abroad named Operation Watershed and has been working to help expats with this constitutional change.\n\n\"Many now fear the issuance of fines, detention, refusal of travel, and even the threat of imprisonment,\" Reichert said.\n\n\"This climate of anxiety is disproportionate to the actual legal and practical reality.\"\n\nWhat happens if my South African passport has expired?\n\nThe law states that citizens must have a valid South African passport or proof of renunciation of citizenship to enter or exit.\n\nHowever, Reichert has called for calm among expats.\n\nShe said South African border control has a \"degree of institutional understanding\" over the challenges now faced by dual nationals.\n\n﻿There may not be blanket punitive enforcement of this rule, she explained.\n\n\"In theory, repeat non-compliance can result in fines or prosecution (up to 12 months' imprisonment), but in practice this is extremely rare,\" Reichert said.\n\n\"Most individuals resolve their documentation after a first warning.\"\n\nThe Embassy of the Republic of South Africa said the department acknowledges that many dual citizens may not be aware of the amendment to the act and the implications for their travel.\n\n\"We have therefore decided that affected South Africans departing or arriving through our ports of entry, attempting to use a foreign passport, will be issued with a warning giving them three months to obtain a South African passport,\" it stated in a notice.\n\n\"They will be allowed to depart or enter South Africa.\"\n\nYou don't need a visa if you're visiting South Africa for tourism purposes for up to 90 days. (Getty Images/iStockphoto)\n\n\"In many cases, travellers receive a formal warning and stamp in their foreign passport noting that South African citizens are not permitted to enter or exit on foreign passports and are instructed to regularise their South African documents,\" Reichert added.\n\nReichert encouraged South Africans living abroad﻿ to do their research and contact the relevant authorities before booking or cancelling trips over this entry requirement.\n\nShe said dual citizens had a responsibility to comply with the law ﻿– but called for calm amid \"confusion, anxiety and misinformation\".\n\nCan Australian-born children get South African citizenship?\n\nThe SA High Commission states that a child born outside of South Africa to at least one parent with South African citizenship has a claim to citizenship by descent.\n\nThey must register the birth in South Africa to obtain citizenship.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/call-for-action-to-help-youth-homelessness-hidden-population/106292964",
        "title": "Caitlan was homeless at 11. School was both a safe haven and a source of humiliation",
        "publish_date": "Mon, 02 Feb 2026 02:26:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Caitlan was just 11 years old and in her last year of primary school when she became homeless.\n\nIt is almost impossible to comprehend, especially in a country like Australia — a child, homeless and preparing to begin high school.\n\n\"After losing my home, school was something that was like a stable place for me and a constant,\" the now 18-year-old said.\n\n\"That was really all I had.\"\n\nThe safety that school provided Caitlan soon disappeared, drowned out by the stress associated with not having access to basic amenities most take for granted.\n\nChild poverty hits WA high Rates of child poverty in WA have doubled in a decade, but there is a severe lack of crisis accommodation, prompting experts to call on governments to do more.\n\n\"I would beg to sleep on friends' couches and try to keep myself invisible and not draw any attention to myself,\" Caitlan said.\n\n\"I was ashamed.\n\n\"Even there [school] as my only place of stability and the only place where I felt like I was safe or I belonged … I still didn't feel safe to tell anybody what was happening to me.\"\n\nMore young people need help\n\nAccording to the Australian Institute of Health and Welfare, on any given day in 2025, 11,900 unaccompanied children and young people (between the age of 12-24) were assisted by specialist homelessness services across Australia.\n\nWA has the highest number of people turned away from homelessness services in the country. (AAP Image: Dave Hunt)\n\nIn Western Australia, 830 children and young people receive support on any given day — a 17 per cent increase from the year before.\n\nWA also has the highest number of people turned away from homelessness services in the country, with an average of 96 requests for assistance unable to be met on a daily basis.\n\nHomeless battle poor sleep, bad diets and stress Western Australian research is showing a strong link between homelessness and poor health, with life expectancy more than 30 years lower for people without secure housing.\n\nFor Caitlan, who has just finished her final year of high school and is a member of WA's Youth Homelessness Advisory Council, knowing there are hundreds of children and young people experiencing homelessness and trying to keep up with school is devastating.\n\n\"I experienced homelessness in Melbourne for four years, three of which I did not attend school,\" she said.\n\n\"I was very lucky that I was able to get support and stable housing [with family in WA].\n\n\"There are still so many young people out there experiencing what I had to experience … and there isn't that support accessible to them.\n\n\"Seeing the numbers and seeing the reality of the crisis here in WA is not shocking because I know that there are gaps in the system that need to be fixed.\"\n\nCoalition calls for action\n\nA coalition of peak bodies, frontline services and young people is hoping to persuade the WA government to prioritise ending youth homelessness, calling for $150 million to be spent on the issue in the upcoming WA state budget.\n\nYouth Affairs Council of WA CEO Kylie Wallace is calling for more action to address youth homelessness. (ABC News: Briana Shepherd )\n\n\"We shouldn't have a huge hidden population of hundreds of school students experiencing rough sleeping and homelessness in the wealthiest state in Australia,\" Youth Affairs Council of WA CEO Kylie Wallace said.\n\n\"For every crisis bed that becomes available each night [in Perth], 69 children and young people are competing for that one bed.\n\n\"Housing stability is foundational to education, wellbeing and future opportunity.\n\n\"[We're] calling on the state government to acknowledge this is a crisis and respond via a targeted investment in the upcoming state budget.\"\n\nKylie Wallace and Caitlin want the government to prioritise ending youth homelessness. (ABC News: Briana Shepherd )\n\nWhile Ms Wallace acknowledged the state government had boosted funding towards homelessness services, including a record investment into new social housing, she said there had been little investment directly targeted towards children and young people.\n\n\"We shouldn't have a huge hidden population of hundreds of school students experiencing rough sleeping and homelessness in the wealthiest state in Australia,\" she said.\n\n\"Commitments made in the next state budget could solve it.\"\n\nGovernment backs strategy\n\nWA's Minister for Homelessness Matthew Swinbourn said the state government had supported homelessness services like no other government had.\n\n\"We don't accept young people not being able to get a home or to be facing homelessness,\" he said.\n\n\"We're in the middle of the 10-year homelessness strategy and very soon I'll be releasing the next five-year action plan inside of that.\n\nMatthew Swinbourn says the state government is committed to supporting homelessness services. (ABC News: Keane Bourke)\n\n\"What we find when young people experience homelessness, if we are able to get the supports around them, then typically they don't necessarily experience homelessness in later life.\"\n\nThat was a sentiment the government and those working in the sector agreed on.\n\n\"If we don't do this, WA's youth homelessness crisis will deepen,\" Ms Wallace said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/2026-grammys-winners-list-kendrick-lamar-olivia-dean/106294398",
        "title": "Grammy winners 2026: Kendrick Lamar claims first award of main ceremony",
        "publish_date": "Mon, 02 Feb 2026 01:54:49 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The 68th Grammy Awards have kicked off and artists have claimed accolades in 95 categories.\n\nMany were handed out prior to the main show, including Best Duo/Group Performance, Best Dance Pop Recording and Best Rock Performance.\n\nAustralian act Tame Impala has taken home Best Dance/Electronica Recording.\n\nYou can find the full list of winners here.\n\nHere is the list of winners and nominees from today's main ceremony.\n\nBest Pop Vocal Album\n\nJustin Bieber — Swag\n\nSabrina Carpenter — Man's Best Friend\n\nMiley Cyrus — Something Beautiful\n\nWINNER: Lady Gaga — Mayhem\n\nTeddy Swims — I've Tried Everything But Therapy Pt 2\n\nBest Contemporary Country Album\n\nKelsea Ballerini — Patterns\n\nTyler Childers — Snipe Hunter\n\nEric Church — Evangeline vs The Machine\n\nWINNER: Jelly Roll — Beautifully Broken\n\nMiranda Lambert — Postcards From Texas\n\nBest Música Urbana Album\n\nWINNER: Bad Bunny — DeBÍ TiRAR MáS FOToS\n\nJ Balvin — Mixteip\n\nFeid — Ferxxo Vol X: Sagrado\n\nNicki Nicole — Naiki\n\nTrueno — Eub Deluxe\n\nYandel — Sinfónico (En Vivo)\n\nBest New Artist\n\nOlivia Dean won Best New Artist at the 68th annual Grammy awards. (Reuters: Mike Blake )\n\nWINNER: Olivia Dean\n\nKatseye\n\nThe Marias\n\nAddison Rae\n\nSombr\n\nLeon Thomas\n\nAlex Warren\n\nLola Young\n\nBest Rap Album\n\nClipse, Pusha T & Malice — Let God Sort Em Out\n\nGloRilla — Glorious\n\nJID — God Does Like Ugly\n\nWINNER: Kendrick Lamar — GNX\n\nTyler, the Creator — Chromakopia\n\nSong of the Year\n\nLady Gaga — Abracadabra\n\nDoechii — Anxiety\n\nRosé & Bruno Mars — APT\n\nBad Bunny — DtMF\n\nHUNTR/X — Golden\n\nKendrick Lamar feat SZA — Luther\n\nSabrina Carpenter — Manchild\n\nBillie Eilish — Wildflower\n\nRecord of the Year\n\nBad Bunny — DtMF\n\nSabrina Carpenter — Manchild\n\nDoechii — Anxiety\n\nBillie Eilish — Wildflower\n\nLady Gaga — Abracadabra\n\nKendrick Lamar feat SZA — Luther\n\nChappell Roan — The Subway\n\nRosé & Bruno Mars — APT\n\nAlbum of the Year\n\nBad Bunny — Debí Tirar Más Fotos\n\nJustin Bieber — Swag\n\nSabrina Carpenter — Man's Best Friend\n\nClipse, Pusha T & Malice — Let God Sort Em Out\n\nLady Gaga — Mayhem\n\nKendrick Lamar — GNX\n\nLeon Thomas — Mutt\n\nTyler, the Creator — Chromakopia\n\nBest Pop Solo Performance\n\nJustin Bieber — Daisies\n\nSabrina Carpenter — Manchild\n\nLady Gaga — Disease\n\nChappell Roan — The Subway\n\nLola Young — Messy",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/australian-monobob-star-bree-walker-2026-winter-olympic-games/106294878",
        "title": "Bree Walker wants the pressure of competing for Olympic gold",
        "publish_date": "Mon, 02 Feb 2026 01:43:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "The g-force felt hurtling down the bobsleigh track is the only pressure Bree Walker is feeling despite the Australian speed demon entering the Winter Olympics as one of the gold-medal favourites.\n\nSliders in the newly-rebuilt Cortina d'Ampezzo circuit will hit speeds of 125 kilometres per hour, often reaching five gs — which is similar to a F1 driver or a fighter jet pilot.\n\nRanked number two after three wins this season among five podium finishes from seven world cup starts, Walker could not be better placed to claim a historic Olympic monobob medal for Australia at the 2026 Games.\n\nLoading Instagram content\n\nRather than feel burdened by expectation, the 33-year-old told AAP she was embracing it.\n\n\"I don't feel pressure in a negative way at all — it's what I wanted,\" Walker, who finished fifth in the inaugural monobob event held at the Beijing Games in 2022, said.\n\n\"I wanted to become one of the best in the world, I wanted to be winning medals for Australia and what comes with that is, obviously, the pressure to compete against the best.\n\n\"And so I use that energy to put towards my racing because I get excited by that — I get excited by tight races, by competing with the best and striving for medals.\n\n\"So, no, it's not a negative thing at all — I use that as positive energy and I put it towards my races because, really I'm just a true racer at heart.\"\n\nAussie Olympic preparations continue after COVID-19 positive tests Australia's Winter Olympics preparations will continue with minimal fuss in northern Italy despite two members of staff testing positive for COVID-19.\n\nA former track athlete who transitioned to bobsleigh 10 years ago, Walker says she is so competitive it is almost embarrassing.\n\n\"I'm competitive in everything that I do, whether it's a card game with the team at night — I'm really bad at snap — it's the worst and I'm highly embarrassed by that,\" said the Melbourne-raised, Cairns-based star.\n\n\"But it's what sets my soul on fire … I love bobsleigh because of the speed, because I've always loved just going fast.\n\n\"I love races where I'm out in front and people are hunting me down, I love chasing people.\n\n\"That's what I'm really looking forward to at these Games, and it's what I've loved throughout this whole season.\"\n\nBree Walker (left) and Kiara Reddingius will team up in the two-woman bobsleigh event. (Getty Images: AOC/Marco M. Mantovani)\n\nThe Eugenio Monti Sliding Centre opened last March and has 16 curves over a distance of 1,749 metres.\n\nWalker finished third at the Olympic test event late last year and said it suited her strengths, which included her explosive power starts.\n\n\"I really love the track, it's a bobsleigh pilot's dream,\" Walker said.\n\n\"You have to be really fast at the start because it's a very steep start ramp but the top section of the track is where you build a lot of your speed.\n\n\"There's lots of twists and turns, so as a pilot, you really have to get to work in order to be able to execute those corners and then as you're going down the track, it gets flowier and faster, and that's when you can really let the sled fly.\"\n\nWalker will also team up with Kiara Reddingius, who grew up in Kalgoorlie, with the pair looking to improve on their 16th-placed finish in the two-woman bobsleigh in Beijing.\n\nThe women's monobob will begin on February 15 at 8pm, AEDT, with the medal round held on February 17 from 7am.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/australian-open-2026-best-quotes/106291648",
        "title": "An old man and animals in the zoo — the best quotes from the Australian Open",
        "publish_date": "Mon, 02 Feb 2026 01:22:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2026 Australian Open has provided some remarkable tennis across the board, but it has also seen some memorable quotes — both good and bad.\n\nDespite world number one and this year's runner-up Aryna Sabalenka saying \"I don't want to talk about tennis\", we do, so here are some of the best quotes of the tournament.\n\n'Animals in the zoo?'\n\nAmerican star Coco Gauff suggested players do not have enough privacy at the AO after vision of her smashing a racquet was broadcast on television.\n\nGauff had just lost her quarterfinal in straight sets to Ukraine's Elina Svitolina and journeyed down the tunnels to smash her racquet away from cameras, or so she thought.\n\nCoco Gauff smashes her racquet after losing an Australian Open quarterfinal. (Supplied: Channel 9)\n\n\"I tried to go somewhere where they wouldn't broadcast it, but obviously they did,\" she said.\n\n\"Maybe some conversations can be had because I feel like at this tournament, the only private place we have is the locker room.\"\n\nOther players came out in support of Gauff's sentiments, including Iga Świątek.\n\n\"The question is, are we tennis players or are we animals in the zoo, where they are observed even when they poop?\" Swiatek said.\n\n\"It's not our job [to] be a meme when you forget your accreditation. Oh, it's funny, for sure. People have something to talk about, but for us I don't think it's necessary.\"\n\nNovak Djokovic added to the debate, saying, \"I'm surprised that we have no cameras while we are taking a shower. That's probably the next step.\"\n\n'Old man' wants a cut of ticket sales\n\nWhile we're talking about Djokovic, remember what he said after his insane five-set win over defending champion Jannik Sinner in the semifinal?\n\n\"I'm an old man, I need to go earlier to sleep,\" he said after the semifinal ended way past his self-prescribed bedtime.\n\nDjokovic also made a cheeky joke that he wanted \"10 per cent of tonight's tickets sold\" because of the entertaining match he and Sinner put on. We're not sure that's how it works, though.\n\nNovak Djokovic played in his 11th Australian Open title. (Getty Images: Darrian Traynor)\n\nAfter the other semifinal between Alexander Zverev and Carlos Alcaraz, the German said he wasn't a fan of how the Spaniard utilised murky medical timeout rules.\n\n\"I didn't like it, but it's not my decision. I just said it was bulls***, basically,\" he said.\n\nAlcaraz was allowed a medical timeout late in the third set of the intense match for what he said was an adductor issue, but what many believe looked more like cramp.\n\nHe said the injury was very painful but it wasn't going to force him to retire because he \"hates giving up\".\n\n\"I always say you have to believe in yourself no matter what,\" Alcaraz said. That's a nice motivational quote!\n\nLegends say thanks\n\nStan Wawrinka has long been a favourite here at Melbourne Park, probably even before his breakthrough grand slam title at the 2014 Australian Open.\n\nBut he bid farewell to the slam after losing to ninth seed Taylor Fritz in the third round.\n\nWawrinka fought back tears as he sat on his bench after the match, before joining tournament director Craig Tiley on the court to thank an adoring crowd and sign off his Open career in the most Australian way possible.\n\n\"First of all, thank you to Craig for the wildcard invitation, not the first time,\" he said.\n\n\"For me it was a lot of emotion when you called me to give me this opportunity for one last chance to say goodbye to the people here in Melbourne.\n\n\"I'm sad to leave, but it's been an amazing journey.\"\n\nTo sign off for good, he grabbed two beers from his bag, gave one to Tiley and cracked the other himself.\n\n\"Cheers everybody, and thank you so much.\"\n\nThe 2026 Open even marked a goodbye for Frenchman Gael Monfils, who lost in the first round to Aussie Dane Sweeny.\n\n\"For me, my journey here with you guys started in 2003, when I came here for the first time,\" Monfils said.\n\n\"Now we are in 2026 and somehow it is the finish line but thank you so much for this amazing ride.\"\n\nMonfils has played his last Australian Open. (Getty: Morgan Hancock)\n\nDe Minaur's wedding confession\n\nThe trouble with being part of a tennis power couple is keeping the personal and professional separate, as Alex de Minaur found out after his win over America's Frances Tiafoe during the third round.\n\nA relieved de Minaur spoke to Jim Courier on court post-match, and after taking a few questions about his win and his opponent, talk soon turned to planning for his wedding to English tennis player Katie Boulter, which will take place this year.\n\n\"This is a 50-50 relationship, so honestly the fact that we're both tennis players [means] we are both doing as much as we can together,\" he said.\n\n\"And yeah, I've been involved so far with some of the decisions.\n\n\" I'm sure when it comes to like, the details of napkins and flowers and, you know, decoration purposes, that's not my forte. I'll leave that to Katie. \"\n\nCue a puzzled face from Boulter in the crowd …\n\nOsaka feels like a Barbie\n\n\"I almost feel like I'm a Barbie that dresses up and goes on the court and does something,\" Naomi Osaka said following her fashion statement at the tournament.\n\nAhead of facing Antonia Ružić in the first round, Osaka wore a white hat and veil, matched by flowing pants and an umbrella in the same colour.\n\n\"It's modelled after a jellyfish. I am so grateful to be able to get to do the things I love,\" she said.\n\n\"It's really beautiful.\"\n\nNaomi Osaka got the crowd talking with her outfit. (Getty Images: Quinn Rooney)\n\nHonourable mentions\n\nThe best of the rest starts with the statistical best men's player of all time reminding people of just that.\n\nAfter his quarterfinal win, Djokovic said he found it \"disrespectful\" that he was asked if he felt like he has always been the chaser, chasing Roger Federer and Rafael Nadal to Jannik Sinner and Carlos Alcaraz.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"There's probably about a 15-year period in between where I was dominating the grand slams,\" he said.\n\n\"I don't feel like I'm chasing, to be honest.\"\n\nCanada's Felix Auger-Aliassime said he was sick of feeling \"like a punching bag\" in reference to his recent torrid injury record.\n\nAustralia's Taylah Preston said she felt it wouldn't be long until we had a local winner at the Open.\n\n\"I think there's a lot of us that are really pushing and getting super close at having really good results at these tournaments,\" she said.\n\nThanasi Kokkinakis admitted after he and Nick Kyrgios lost their men's doubles first-round match that the crowd \"saw probably a couple of shadows of our former selves\".\n\nKyrgios made an error when he said he and Kokkinakis were playing for \"millions of dollars\". (AAP: Joel Carrett)\n\nKyrgios was more focused on a controversial decision in that match, though.\n\n\"It doesn't make any f***ing sense. I'm pissed off,\" he said.\n\n\"We're playing for millions of dollars, we've been both injured, both trying to get to this stage, and then some of these rules are just so, so, so dumb.\"\n\nThe men's doubles prize money is in fact $900,000, not quite millions, but we take your point, Nick.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/68th-grammy-awards-live-updates-winners/106288902",
        "title": "Grammys 2026 live: Hottest 100 winner Olivia Dean wins Best New Artist",
        "publish_date": "Sun, 01 Feb 2026 23:55:45 +0000",
        "category": "entertainment",
        "authors": [
            "Al Newstead",
            "Velvet Winter"
        ],
        "text": "The music world's biggest award ceremony, the Grammys, is taking place in Los Angeles today, hosted by Trevor Noah for the sixth time running.\n\nRapper Kendrick Lamar leads today with nine nominations, off the back of his album GNX and single Luther.\n\nAustralia's Tame Impala has already secured a golden gramophone for Best Dance/Electronica Recording at the Grammy Awards Premiere Ceremony.\n\nFollow along with our live updates.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/will-the-rba-lift-interest-rates/106286450",
        "title": "What are the chances the RBA will raise interest rates?",
        "publish_date": "Sun, 01 Feb 2026 23:03:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "The market thinks the likelihood of the RBA lifting interest rates tomorrow is 72 per cent.\n\nBut here's a very important caveat — the market has been wrong before and at some point it will be wrong again.\n\nYou don't even have to look very far back to find a glaring example.\n\nIn July last year, the market was 96 per cent confident the RBA was about to cut rates. It was wrong.\n\nIndependent economist Nicki Hutley says the market's predictions are normally pretty good but forecasting is harder when the data on inflation is less clear.\n\n\"I think the market has overreacted to the December inflation data,\" she said. \"There is something that we need to be watching closely but it feels like it's a bit of a 'henny penny, the sky is falling' over-reaction to me.\"\n\nWhat do economists predict?\n\nWe consulted five leading economists. Here's what they think in a nutshell:\n\nNicki Hutley: Rate rise\n\nRichard Holden: Rate rise\n\nCassandra Winzar: Rate rise\n\nBesa Deda: Rate rise\n\nRobert Brooks: On the fence\n\nMs Hutley says the central bank will be feeling cautious about data showing inflation has ticked up.\n\n\"Their language has been quite hawkish in more recent months, and I think they'll feel that a precautionary tiny tweak is worthwhile,\" she said.\n\n\"I don't necessarily think it's the start of a longer cycle of tightening though.\"\n\nMonash University economist Robert Brooks is less definitive.\n\n\"There is sort of a post-pandemic concern that perhaps central banks waited a bit too long to move rates up and therefore let a bit more inflation get into the system,\" he said.\n\n\"But there is a question around timing and that timing has got a balance. So at one level, if rates increased, I don't think that would be a surprise.\n\n\"If rates stayed on hold, that wouldn't be a surprise either. I think you could make that case.\"\n\nBut Cassandra Winzar, chief economist at the Committee for Economic Development of Australia, says the argument for an increase is stronger than the case for keeping rates steady.\n\n\"[The RBA has] had quite a few months now of inflation being that bit higher than we'd like. So it's not just a one-off,\" she said.\n\n\"There's a fairly strong case that now is the time to take a bit more action and get inflation under control sooner rather than later.\"\n\nWhy would the RBA increase interest rates?\n\nMs Hutley says the case for a rate rise is due to inflation creeping above the Reserve Bank of Australia's target, which is between 2 per cent and 3 per cent.\n\n\"It's not out of hand, but it's certainly not heading in the right direction at the moment,\" she said. \"They are very concerned to make sure that inflation is heading back towards the centre of the target band, not away from it.\"\n\nUniversity of New South Wales economist Richard Holden says an increase in \"trimmed mean\" inflation will be of particular concern.\n\nIt rose in December to 3.3 per cent from 3.2 per cent in November.\n\n\"[That] is a sort of measure of underlying inflation to which the RBA pays attention, it has ticked up,\" he said. \"That's the most compelling argument [for a rate rise].\"\n\nMs Winzar says the fact that unemployment has remained low at 4.1 per cent will also give the RBA confidence to raise the cash rate.\n\n\"That gives the RBA little bit more leeway to raise interest rates to try and bring inflation back down into the [target] range without having too much of an effect on labour markets,\" she said.\n\nWhy would the RBA keep interest rates on hold?\n\nProfessor Brooks says low unemployment and moderate wage growth mean it would be safe for the RBA to keep rates where they are.\n\nHe says the RBA has in the past been concerned that high inflation could feed wage increases, which would then see a rise in prices.\n\n\"So that concern of a wage price interaction hasn't manifested itself,\" he said.\n\n\"The second reason why I think you could make a case potentially for rates staying on hold is that even in the face of recent data, inflation expectations have remained stable.\"\n\nBesa Deda, chief economist at William Buck, says the RBA will also be looking at the resilience of the global economy over the year, despite increasing uncertainty.\n\nShe says those risks have seen a sell-off of the US dollar, and a rise in the value of the Australian dollar.\n\n\"[It is] higher including in trade-weighted terms, which is the value of our currency against the currencies of the countries that we trade with the most,\" she said.\n\n\"That will help tradables inflation be restrained.\"\n\nProfessor Holden is less convinced, saying there are not many compelling arguments to hold rates.\n\nBut he says there is a chance the RBA may want to see more data before making the call to raise.\n\n\"You don't just sort of put rates up and down like yo-yos,\" he said.\n\n\"That would be the best argument I think one could muster, which is, maybe it's an anomaly, wait and see.\n\n\"But I don't think it's a very persuasive argument.\"\n\nHow high are interest rates anyway?\n\nThe Reserve Bank of Australia's official cash rate is 3.6 per cent.\n\nBanks use the cash rate to set their interest rates — new home loan borrowers will currently pay about 5.5 per cent.\n\nWhat should I read next?",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/winter-olympics-2026-australia-staff-covid-19/106294228",
        "title": "Aussie Olympic preparations continue after COVID-19 positive tests",
        "publish_date": "Sun, 01 Feb 2026 22:04:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Winter Olympics preparations will continue with minimal fuss in northern Italy despite two members of staff testing positive for COVID-19.\n\nThe team, building towards of the Milano Cortina Games which begins this week, received the news at the Australian Institute of Sport's European Training Centre (ETC) in Gavirate, about an hour's drive from Milan, on Sunday.\n\nThe individuals, who will not be competing at the 25th edition of the Olympic Winter Games, were symptomatic and tested positive on January 28 and 31, with measures in place to contain any possible spread of infection.\n\n\"The Australian Winter Olympic team has medical protocols in place for any infectious disease or illness and are standard operating procedures for high-performance environments which are being followed,\" chef de mission and former aerial skier Alisa Camplin said.\n\n\"Such protocols have been in place for past Olympics, including the Beijing 2022 Olympic Winter Games and Paris 2024 Olympic Games.\n\n\"Alternative plans have been put into place for those scheduled to arrive into the ETC over the next 48 hours.\"\n\nClose contacts of the two positive cases were immediately tested. They returned negative results and were administered anti-virals.\n\nFifty-three men and women will compete in green and gold, the second-largest Australian team ever and the largest for 12 years.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/arsenal-wins-fifa-women-champions-cup/106294178",
        "title": "Matildas trio help Arsenal to become first-ever club world champions",
        "publish_date": "Sun, 01 Feb 2026 21:52:26 +0000",
        "category": "sports",
        "authors": [],
        "text": "Arsenal have become the first women's world soccer champions, with Matildas star Caitlin Foord clinching the title for the Gunners in extra time.\n\nFoord scored the Gunners' third in a dramatic 3-2 win over Brazil's Corinthians to seal the FIFA Women's Champions Cup final.\n\nFellow Matildas Steph Catley and Kyra Cooney-Cross were also celebrating as Arsenal lifted the trophy at their own Emirates Stadium in north London.\n\nThe three become the first Australian women to be crowned soccer world champions.\n\nWhile Foord played her starring role off the bench, Catley played the full 120 minutes of a gripping final in which the South American champions twice levelled, with the second equaliser coming from a last-gasp penalty to force extra time.\n\nCooney-Cross, still returning to full fitness after a period of compassionate leave in Australia to be with her cancer-stricken mother, was an unused substitute.\n\nShe did play in Arsenal's successful UEFA Champions League campaign, which earned them their place in this competition.\n\nArsenal, who beat African champions AS FAR, the team of the Moroccan military, 6-0 in Wednesday's semi-final, controlled possession for much of the match.\n\nBut Corinthians, who beat US champs FC Gotham in their semi, were always a threat, roared on by a large contingent of fans who brought the passion of Sao Paulo to the English capital.\n\nArsenal opened the scoring after 14 minutes through Canadian striker Olivia Smith, who followed up after Lele had saved a Stina Blackstenius shot.\n\nBut seven minutes later Corinthians stunned their hosts. After Duda Sampaio had a drive tipped over the bar 40-year-old veteran Gabi Zanotti headed in from the resultant corner, skimming in off an unfortunate Catley.\n\nAs Arsenal pressed, Lele made a string of saves but was finally beaten by Lotte Wubben-Moy's 59th-minute header.\n\nFoord thought she had settled the final with a goal-bound 75th-minute shot, but a defender's desperate lunge turned it against the bar.\n\nInstead, Vic Albuquerque scored a last-gasp penalty awarded on a VAR review to force extra time.\n\nBut Foord would not be denied her moment. Late in the first period of extra time, Frida Maanum stole midfield possession and Arsenal broke. Foord stayed onside, received the Norwegian's pass, and drove her shot inside Lele's near post.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe only previous Australian to attain soccer world champion status is Mark Bosnich, who kept goal for Manchester United when they won the Intercontinental Cup, an annual competition between the European and South American champions, in 1999.\n\nHowever, that event was not recognised by FIFA at the time and only featured clubs from two continents. In 2016, the world governing body retrospectively designated the winners as world champions.\n\nThe new competition features the six continental champions and will run annually, except in years involving the quadrennial 16-club Women's Club World Cup, which is due to launch in 2028.\n\nAustralian champions Melbourne City, who were a penalty shoot-out loss from qualifying for this event via last year's Asian Champions League, are at the quarterfinal stage of this season's ACL.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/regional-parents-warn-of-schools-closing-without-consultation/106282754",
        "title": "Small towns fight to keep their schools open amid low enrolments",
        "publish_date": "Sun, 01 Feb 2026 21:16:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Ellie Egan heard her daughter's primary school was set to be temporarily closed due to low student numbers, she decided to take matters into her own hands.\n\nShe worked with other parents to find families interested in enrolling in Penrose Public School in the New South Wales Southern Highlands.\n\nEllie Egan says her young daughter is terrified by the prospect of having to go to another school in the next town. (ABC Illawarra: Sarah Moss)\n\nDespite their efforts, the NSW Department of Education confirmed the school would be put into \"recess\", with less than three months' notice.\n\n\"My daughter still asks me almost daily why her school is closing,\" Ms Egan said.\n\n\" She says if they knew how much she loves her school, they never would've done this. \"\n\nParents fight shutdown\n\nThe Education Department can decide to place a school in recess when there are \"questions about the school's ongoing viability\", according to department protocols.\n\nA school in recess does not enrol students, and staff and equipment are redeployed to nearby schools on an as-needs basis.\n\nPenrose is one of five regional public schools across NSW mothballed from the end of 2025 due to low enrolment numbers.\n\nKids in Penrose love their little school. (ABC Illawarra: Sarah Moss)\n\nThe school was expecting five students in 2026.\n\nBut parents argued their school's dip in enrolments was temporary and that the decision to put it in recess was premature.\n\n\"We managed to get a number of new families interested in coming to the school, but ultimately, it counted for nothing because the department didn't listen to us,\" Ms Egan said.\n\n\" We think it was basically just lip service, rather than a true consultation. \"\n\nMs Egan, on behalf of the school parents and citizens association (P&C), submitted a 25-page objection to the Department of Education.\n\nThe submission pointed to the department's own data, which showed Penrose could reach 16 enrolments by 2031.\n\nThe P&C canvassed the community for potential enrolments and claimed the figure could be higher.\n\nConcerns from the Penrose community have since been escalated to both the NSW Ombudsman and the Secretary of the Department of Education, Murat Dizdar.\n\nThe Department of Education declined the ABC's request for an interview.\n\nCapertee was one of five small regional schools put into recess at the end of 2025. (ABC Western Plains: Jonathan Hawes)\n\nConsultation 'didn't happen'\n\nSchools in Ben Lomond, Black Springs, Goolma and Capertee will also be shut down this year.\n\nIt brings the number of schools in recess across the state to 19.\n\nSchools in recess are reviewed by the department at least every two years, with sites maintained so they can be reopened if viable, or repurposed if not.\n\nWhen Shane Adams moved his family to the rural locality of Capertee, the public school was a major drawcard.\n\n\"We chose to live here because of the school. We need to think of our kids and their future,\" he said.\n\nFor spread-out farming and mining communities such as Capertee, having a centrally located school is seen as essential for growth. (ABC Western Plains: Jonathan Hawes)\n\nAcross the five schools placed into recess at the end of 2025, consultation periods ranged from as little as one month to about eight months.\n\nIn 2015, a parliamentary inquiry into NSW public school closures found a \"strong pattern\" of heavy-handed decision-making that lacked genuine community consultation, particularly in rural and primary school settings.\n\nMore than a decade on, parents said little had changed.\n\n\"The school my kids will have to go to is 4 kilometres further away, and towards nothing. This one was on my wife's way to work,\" Mr Adams said.\n\n\" The community consultation wasn't just lacking — it didn't happen at all. \"\n\nIs 'recess' different from 'closure'?\n\nUnder the 1990 Education Act, the NSW education minister must formally propose any school closure by June 15 each year, with schools forbidden from closing until the end of the following year.\n\nThis means there is at least an 18-month period to potentially reverse course on a closure.\n\nBut the legislation does not mention schools being placed in recess.\n\nGraeme Pike and Shane Adams say the department's consultation should include the broader community. (ABC Western Plains: Jonathan Hawes)\n\nThat decision is instead guided by the department's in-house procedures and guidelines, which do not set timeframes for consultation.\n\nThe guidelines list key stakeholders to be consulted, including school staff, the P&C, a NSW Teachers Federation organiser and the local MP.\n\nCapertee and District Progress Association president Graeme Pike argued that list was too narrow.\n\n\"If the Department of Education had chosen to consult with us, like they should've, then we would've told them how necessary the school is to the growth of the community,\" Mr Pike said.\n\n\" They consulted with people in Bathurst and Orange, but not with people just down the road. \"\n\nThe department said recess was preferable to closure, as the two-year review period allowed more time for enrolments to recover, compared to the 18-month process for closures mandated by the Education Act.\n\nIn the past decade, only one school has reopened after a period of recess — Premer Public School in the Liverpool Plains.\n\nFor former Goolma Public School bus driver Jean Ellis, that record offered little reassurance.\n\nJean Ellis says she is still coming to terms with the idea that Goolma Public School will not open this year. (ABC Western Plains: Jonathan Hawes)\n\nShe said she worried losing the school, however temporary, would be another nail in the Central Western community's coffin.\n\n\"When we first came here, there were multiple sports organisations, two churches, a shop, the pub, a fire shed, a village hall and the school. [Goolma] was thriving,\" she said.\n\n\"In recent years, the school became the only place left that was open and available to everyone.\n\n\"It was the only place to make community.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/nightcliff-tigers-premiership-player-sues-afl-over-concussion/106283472",
        "title": "Premiership-winning player sues AFL over 'catastrophic' concussion",
        "publish_date": "Sun, 01 Feb 2026 20:57:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "A former Northern Territory Football League premiership player is suing his club, the league and the AFL for negligence after suffering \"catastrophic injuries\" in a head clash with another player in 2022.\n\nFormer Nightcliff Tigers forward Trent Melville says the concussion left him suicidal and suffering from chronic headaches, \"post-concussion syndrome\", hearing loss, pain, insomnia and memory loss, among a list of other symptoms.\n\nIn documents filed with the NT Supreme Court, the now 33-year-old dual-premiership player and Chaney Medal winner says he suffered up to seven concussions \"and numerous sub-concussive blows to the head\" during his football career.\n\nAs a result, Mr Melville says he \"suffered ongoing memory problems from about 2017\" and \"was susceptible to serious injury from a further significant blow to the head\".\n\nTrent Melville won his second NTFL premiership with the Nightcliff Tigers in 2021. (ABC News: Amy Culpitt)\n\nDuring a match on October 15, 2022, the documents state Mr Melville \"suffered a head clash with another player whilst going for the ball and was concussed resulting in catastrophic injuries\".\n\nMr Melville claims he would not have suffered the injuries if Nightcliff FC, AFLNT and the AFL had kept records of his previous concussions and \"warned him that he risked catastrophic injury from a further head knock and prevented him from playing whilst experiencing memory loss\".\n\nMr Melville says the AFL owed him a duty of care to ensure his safety, including by passing on information to leagues and clubs about head injuries and warning players \"of the dangers associated with repetitive head injuries\".\n\nMr Melville claims AFLNT in turn should have passed that information on to NTFL clubs and players, while Nightcliff FC should have then passed it on to Tigers players while keeping records of injuries sustained on the field.\n\nAFLNT declined to comment while the case remains before the Supreme Court. (ABC News: Che Chorley)\n\nThe documents state all three defendants should also have prevented players \"who had ongoing symptoms from previous concussions (such as memory loss) from playing\".\n\n\"By reason of the breach of duty and/or negligence by the first, second and third defendants, the plaintiff has suffered injury, loss and damage,\" the documents read.\n\nThe Nightcliff Football Club, the NTFL and the AFL are each yet to file a defence with the court.\n\nMr Melville is seeking damages, interest and costs, with the case due to return to court for a directions hearing in Darwin on March 18.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/ex-shincheonji-member-says-religion-cult-recruiting-pastors/106257352",
        "title": "The 'apocalyptic Christian cult' attempting to convert pastors",
        "publish_date": "Sun, 01 Feb 2026 20:31:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "A South Korean fringe religious organisation, accused of brainwashing members, is targeting pastors in order to recruit entire Australian congregations, a former member says.\n\nShincheonji, which has been described as an \"apocalyptic Christian cult\" whose members will be saved from an imminent apocalypse, featured prominently in the Victorian parliamentary inquiry into cults and fringe groups.\n\nThe ABC has previously reported that the church is using \"special force teams\" and aggressive tactics to expand its recruitment outside of Melbourne in an effort to grow its flock.\n\nMatthew, whose name has been changed to protect his identity, spent nearly five years inside Shincheonji, and said the organisation was also targeting the pastors of other churches in an effort to recruit entire existing congregations through a \"Pastor Evangelism Team\".\n\nMatthew was a member of that team until he left the church last year.\n\n\"Our goal was to evangelise pastors and through them bring the whole church to Shincheonji,\" he said.\n\nMatthew said at the time he left, there were 10 to 15 pastors who were in ongoing conversations with Shincheonji and about five who were \"eager to join\".\n\nLee Man-hee founded Shincheonji in South Korea in 1984. (ABC News: Coco Veldkamp)\n\nHe said at least three Australian pastors were flown to South Korea for Shincheonji's graduation ceremony.\n\n\"It's a very, very slow process, and we have been in contact with them for years,\" Matthew said.\n\n\"We started off by emailing them or the church … we would cold call them and try to set up meetings.\n\n\"Slowly, we change their minds on certain topics, and that just builds up into accepting the Shincheonji doctrine.\"\n\nMatthew said the Pastor Evangelism Team was operating under the name Zion Christian Mission Centre, so pastors did not immediately recognise it as Shincheonji.\n\nShincheonji's Australian Charities and Not-for-profits Commission page confirms it is affiliated with the Zion Christian Mission Centre.\n\nFormer Shincheonji members say people with religious backgrounds are targeted for recruitment. (ABC News: Coco Veldkamp)\n\nHe said the team explained Shincheonji in a positive way if pastors identified them and raised concerns about widely reported allegations of psychological abuse against the church.\n\n\"We sort of twist a lot of words … it wasn't really great what I did,\" Matthew said.\n\n\"We told pastors, 'You shouldn't believe what is online, but come listen to us.'\"\n\nThe ABC has made numerous attempts to contact Shincheonji, but has not received a response.\n\nDo you know more? Contact Coco Veldkamp on email cocoveldkamp@proton.me.\n\nRecruitment records show outreach\n\nThe group's leader and founder is 94-year-old Lee Man-hee, a self-proclaimed Messiah, who claims to work together with the spirit of Jesus.\n\nHe has previously been found guilty of embezzling 5.6 billion won ($5.5 million), which was partly used to build a luxury \"palace of peace\" in Seoul.\n\nShincheonji has been accused of brainwashing its recruits, turning them against their families and friends, and manipulating them to devote their entire lives to the church and recruit new members, even to the point of sleep deprivation.\n\nShincheonji's South Korean website states that as of June 5th, 2024, the organisation had signed memorandums of understanding \"with 12,538 churches in 83 countries\".\n\n\"Additionally, 1,341 churches in 41 countries have joined Shincheonji Church of Jesus and replaced their signage,\" the statement said.\n\nShincheonji members rallying in front of Gyeonggi Provincial Office in 2024. (Supplied: Shincheonji)\n\nA spreadsheet dated from early 2025 and leaked to the ABC shows Shincheonji tracking its attempts to convert 1,157 churches around the country.\n\nIn the spreadsheet, the targeted church, its denomination, pastor, contact details, and opening times are all listed.\n\nThe stage of communication with each church is also described, along with information obtained on pastors, including whether they are \"poisoned\" against the group.\n\nThe Church of Scientology of Melbourne, among a handful of others, is marked in the document as \"unproceedable (cult)\".\n\nAnother is marked \"unproceedable due to belief in reincarnation\", while many are marked \"poisoned\" or \"poisoned hard\", indicating that they believed Shincheonji was a cult or that they were opposed to Shincheonji.\n\nHowever, the spreadsheet indicates a large number of pastors agreed to meet for coffee or invited them to their church.\n\nMembers of Shincheonji pay a tithe of 10 per cent of their earnings to the church, and are also pressured to make further donations regularly.\n\nReverend Frank Rasenberger says other church leaders had warned him about Shincheonji. (ABC News: Coco Veldkamp)\n\nRecruiting large pre-existing congregations would dramatically boost the organisation's earnings, some of which go back to its headquarters in South Korea.\n\nMatthew said the Pastor Evangelism Team attempted to discuss the bible and teach Shincheonji's interpretation during meetings to slowly indoctrinate pastors.\n\nThe ABC has also seen a chat group where members of the Pastor Evangelism Team post their progress with pastors in these lessons, including details gathered about the pastor's personal life and screenshots from Zoom meetings.\n\n\"We did get some results, mostly through non-denominational pastors … they don't really have people overseeing what they do,\" Matthew said.\n\nReverend rejects recruitment\n\nThe spreadsheet includes details from a phone call with a pastor at a St Albans church, who told the recruiter \"you are in a cult and to get out\".\n\nReverend Frank Rasenberger was the pastor of that church at that time.\n\nReverend Frank Rasenberger says Shincheonji recruiters approached him on multiple occasions. (ABC News: Coco Veldkamp)\n\n\"I was contacted several times … at least three times, I'd say, in various ways,\" Reverend Rasenberger said.\n\n\"One was an invitation to a big ecumenical event … under the guise of, 'this is going to be a great way for churches to come together'.\n\n\" But when I looked into it, I could see what it was. \"\n\nHe said the recruiters were relentless.\n\n\"I turned that down … it didn't seem to stop them from contacting me,\" he said.\n\nReverend Rasenberger said he also had young people, inside and outside his church, confide to him that Shincheonji was pursuing them.\n\nA Victorian parliamentary report on cults and fringe groups is due to be tabled in September 2026. (ABC News: Coco Veldkamp)\n\n'Letter of oath'\n\nThe ABC has obtained a \"letter of oath\" signed by a pastor at a church in Western Australia.\n\nThe document includes a \"pledge to God and Zion Christian Mission Centre\".\n\nA 'Pledge to God and Zion Christian Mission Centre' obtained by the ABC. (ABC News: Coco Veldkamp)\n\n\"I will obey and adhere to the order and instruction given by Zion Christian Mission Centre,\" it reads.\n\n\" If the terms and conditions are not followed, I will accept any consequential actions taken by the Zion Christian Mission Centre. \"\n\nIn the \"terms and conditions\" section, members are sworn to secrecy.\n\n\"I will never leak the contents obtained by attending Zion Christian Mission Centre,\" it reads.\n\n\"I will never use the materials and lectures of Zion Christian Mission Centre for any other purpose than for studying at the Zion Christian Mission Centre.\"\n\n'Abusive faith'\n\nTore Klevjir spent 11 years in Children of God, a Christian cult founded in the United States.\n\nTore Klevjer with two other disciples during his time in a Christian cult. (Supplied: Tore Klevjer)\n\nNow, he is part of Cult Information and Family Support (CIFS), which offers help to cult survivors and their loved ones.\n\nHe said Shincheonji was the most prolific group CIFS dealt with.\n\n\"A rough estimate would be 50 to 60 inquiries over the last year from different families, ex-members and a couple from current members,\" Mr Klevjir said.\n\n\"It's by far the most influential group … they are very focused on recruiting, which is why they are really on our radar\".\n\nA Shincheonji bible seminar in Gwangju, South Korea, in 2025. (Supplied: Shincheonji)\n\nShincheonji claims to have churches in more than 100 countries and a congregation of more than 300,000 members, however some ex-members have told the ABC those numbers are inflated.\n\nShincheonji's Melbourne chapter is a registered charity on the Australian Charities and Not-for-profit Commission and is a recognised religious group, allowing it special legal protections and tax advantages.\n\nMr Klevjir said there needed to be stricter criteria for what can be considered a religion.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/choice-says-retailers-using-initiative-or-product-safety-washing/106288558",
        "title": "Consumers warned online retailers are relisting unsafe products",
        "publish_date": "Sun, 01 Feb 2026 20:30:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "A baby beach tent that posed a drowning hazard and a car stand that could not support its advertised weight were among the nearly 3,000 unsafe products recently removed by online retailers.\n\nBut some businesses resumed selling the potentially fatal products, or took too long to remove them from their websites, according to a report from the Australian Competition and Consumer Commission (ACCC).\n\nConsumer watchdog Choice said the report reveals \"product safety washing\" could be taking place in Australia's $60 billion online retail market.\n\nA baby beach tent that posed a drowning hazard was recalled by the ACCC in January 2025. (Supplied: Australian Competition and Consumer Commission)\n\nWhile some of Australia's largest retail platforms have signed up to a voluntary federal government \"safety pledge\", Choice campaign director Andy Kelly says it could instead be putting shoppers at risk.\n\nMr Kelly said safety washing happened when platforms gave the impression of upholding high safety standards without taking any meaningful action to keep consumers safe.\n\n\"The majority of Australians don't even really know that this is a problem,\" Mr Kelly said.\n\nAustralian Product Safety Pledge\n\nAmazon Australia, eBay Australia and Chinese retailer AliExpress are the current signatories to the pledge run by the ACCC, with Catch and myDeal leaving the scheme when they shut down in 2025.\n\nTemu's big Aussie ad spend infuriates mum of 9yo burnt in jumper fire Experts say Temu's strategy is causing a deluge of unsafe products to flood directly into Australian households.\n\nHowever, last year's Australian Product Safety Pledge annual report, which did not name operational retailers, said one business resumed selling unsafe products after they had been taken down.\n\nIn another case, it said a platform removed unsafe products within the required two-day timeframe in only 69 per cent of cases.\n\nAn ACCC spokesperson said the regulator was working with signatories to introduce more stringent requirements.\n\nThe Australian Product Safety Pledge is a voluntary initiative established by the ACCC in 2020. (ABC News: John Gunn)\n\nSpokespeople for Amazon Australia and eBay Australia said the companies had a strong commitment to product safety and used automated technology and human investigators to proactively detect and remove unsafe products.\n\nAlibaba, the owner of AliExpress, did not respond to requests for comment.\n\n'Product safety washing'\n\nChoice has been calling for Australia to prohibit the sale of unsafe goods in line with the European Union, Canada and the US since 2020.\n\nCurrently, Australian laws are reactive and fines are given to companies found to have breached safety standards, with 18 companies fined since 2016.\n\nIt comes as a survey in 2024 found that most people mistakenly believe businesses are legally required to ensure products are safe.\n\nSome of Australia's largest retail platforms have signed up to a voluntary federal government \"safety pledge\". (ABC News: Yasmine Wright Gittins)\n\n\"There's a risk that certain businesses use [the pledge] to engage in product safety washing without actually taking meaningful action,\" Mr Kelly said.\n\nHe said the \"disappointing\" performance of some signatories showed the need for reform of Australian consumer law to prohibit the sale of unsafe goods.\n\nHe said online operators needed to take meaningful action on safety and not use the ACCC pledge as a \"marketing badge while falling short in practice\".\n\nTemu applies to join\n\nOne omission from the pledge is Temu, which has emerged as Australia's biggest online retailer.\n\nThe Chinese business said it would join the pledge in March 2024 after an eight-year-old girl was badly burnt while wearing a hoodie purchased from its platform.\n\nDaniella Jacobs-Herd sustained burns to 13 per cent of her body while wearing a hoodie her grandmother bought from Temu. (Supplied: Hannah Jacobs-Herd)\n\nBut last month, the company and the ACCC said its application was still in process.\n\nThe girl's mother, Hannah Jacobs-Herd, said she felt Temu's commitment to join the pledge was an example of the \"product safety washing\" referred to by Mr Kelly.\n\n\"I feel that it's just words they said to try and prolong the process and hoping this would all just be swept under the rug,\" she said.\n\nShine lawyers say Temu has deferred liability for the recalled hoodie to its Chinese supplier. (Reuters: Dado Ruvic/Illustration)\n\nMs Jacobs-Herd launched a lawsuit against Temu, which she said had stalled because the platform deferred liability for the hoodie to its Chinese supplier.\n\nTemu has banned that seller from selling children's products on its platform.\n\nA spokesperson for Shine Lawyers, the law firm handling the lawsuit, said attempts to contact the supplier directly had been unsuccessful.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/mary-fowler-returns-for-manchester-city-wsl/106294082",
        "title": "Matildas star Mary Fowler returns from injury ahead of Asian Cup",
        "publish_date": "Sun, 01 Feb 2026 20:23:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas star Mary Fowler has made her return to action in the Women's Super League, on a day of huge celebration for Manchester City.\n\nAfter nine-and-a-half months on the sidelines with an anterior cruciate ligament injury she suffered in last season's Women's FA Cup semifinal, Fowler came on as a substitute in the 75th minute of City's fabulous 5-1 victory over champions Chelsea at the Etihad Stadium on Sunday.\n\nShe was left beaming as she made her return with her side coasting at 5-1. City's two superstars Vivianne Miedema and Khadija Shaw, who'd both scored earlier in the game, both embraced with the 22-year-old on the touchline as they were replaced in the 76th minute.\n\nThe home crowd also rose as one to celebrate on what proved a landmark day, with City handing the ailing champions one of their worst ever WSL defeats. It felt like a changing-of-the-guard moment, with Chelsea now looking sure to be dethroned after six successive titles.\n\nFowler, inevitably, had to shake off some rustiness during her cameo but slotted in to her centre forward role comfortably enough as City eased to a win that puts them 11 points clear of neighbours Manchester United and 12 clear of Chelsea.\n\nSouth Korea boycott would be 'devastating' for Asian Cup Asian Cup organisers say they are hopeful the South Korean women's team will partake in next month's tournament despite threats of a boycott.\n\nThe visitors brought Fowler's Matildas captain Sam Kerr on early in the second half, but she proved largely ineffective with Chelsea already 3-0 down and being outclassed.\n\nTheir only consolation came from an Alyssa Thompson strike when they were 4-0 down.\n\nThe great news for Australia's Women's Asian Cup hopes is that both their key attacking threats should now be back in harness for the home tournament that begins on March 1 with a fixture against Philippines in Perth.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-02-02/asx-markets-business-news-live-updates/106293384",
        "title": "Live: ASX down as gold miners tumble on precious metals rout",
        "publish_date": "Sun, 01 Feb 2026 20:05:39 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Daniel Ziffer",
            "Stephanie Chalmers",
            "Ben Butler",
            "David Taylor"
        ],
        "text": "One of the enduring mysteries of last year was: what's going on at Housing Australia?\n\nThe inadvertent leak of the incoming government brief for Treasurer Jim Chalmers and Housing Minster Clare O'Neil laid out lots of challenges for the pair.\n\nThe advice suggested taxes needed to be raised, spending cut and that the government's key election promise - to build 1.2 million homes over five years - \"would not be met\".\n\nBuried in the brief, it identified \"challenges\" with the \"responsiveness … capability … [and] speed\" of key housing agency Housing Australia and suggested \"steps to improve oversight and reset the relationship with the CEO and board\" of the body.\n\nWhat did that mean?\n\nThe departure of the Housing Australia chair Carol Austin in October might have been part of that picture.\n\nToday the Financial Review's Michael Bleby has more.\n\nA secret review commissioned by the government found it had a \"high risk approach\" and the chair would attend meetings held by an independent audit committee.\n\nThe Fin reports the review by consulting firm Deloitte was handed to the agency's board and found the organisation had not developed “an overarching, or individual program plan(s)” for its key funding schemes, despite those programs having already been open to proposals for six months.\n\nAdditionally, as Austin had attended meetings of the board’s independent audit and risk committee, there was “a risk that the ARC meetings may not be operating with a sufficient level of independence from the board”.\n\nThe paper attempted to contact Ms Austin but was unsuccessful.\n\nAt the time of the leak of the Treasury papers, both the Treasurer and Housing Minister reiterated the 1.2 million figure was \"ambitious\".\n\nIn a recent media release, Ms O'Neil called the target aspirational, while noting that ABS data on new home starts was at its highest level in three years.\n\n“These are encouraging figures that show that the reforms federal Labor is leading with our state and territory government partners, are starting to bear fruit,\" she said in a statement in January.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/a-peek-inside-the-long-overdue-glasshouse-theatre-20260202-p5nyu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A peek inside the long-overdue Glasshouse theatre",
        "publish_date": "Mon, 02 Feb 2026 13:45:40 +1100",
        "category": "entertainment",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Advertisement\n\nNationalQueenslandPerforming arts A peek inside the long-overdue Glasshouse theatre Julius Dennis February 2, 2026 — 1:45pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBrisbane’s long-awaited new performing arts centre has opened its doors for the first time, revealing a sleek and high-tech arena designed to slip into the existing precinct. Behind the giant curved-class exterior on the second level, golden carpets lead to long, black bars where theatre-goers will order drinks in little plastic cups. Inside, 1500 “rainforest green” seats stretch in front of a wide stage. The room feels intimate despite the scale of the building, which required more than 6300 cubic metres of concrete and 1500 tonnes of steel, along with all that glass. The visually stunning building was four years behind schedule. David Kelly On the stage, automated fly lines and sound shells hover at the ready, replacing hand-run systems at QPAC’s older theatres. Backstage, 79 mirror spaces mean the theatre can easily accommodate larger performances.\n\nAdvertisement\n\nAccording to architect Jayson Blight, who gave a tour to media on Monday, the mission of the building was to blend into the existing centre, not cast a shadow over it. He also said the complex structure of the 217 undulating panes meant they supported themselves. On stage at The Glasshouse. Julius Dennis “There is actually no structure holding up that glass,” he told the crowd, some of whom laughing nervously. Named The Glasshouse after a public survey to choose a moniker, the theatre was meant to open its doors in 2022, but flooding and COVID-19 pushed it back four years.\n\nAdvertisement\n\nStill, Arts Minister John-Paul Langbroek said there was no cost blowout to match, thanks to a $184 million guaranteed construction sum contract with the builder, Lendlease. The Queensland Performing Arts Centre contributed $25 million, with the rest provided by the state, he said. The level foyer behind the bending glass. Julius Dennis “It certainly has taken a long time, but it’s really important to acknowledge that we’re here now, and it’s a wonderful theatre,” Langbroek said. Public Works Minister Sam O’Connor described the issues faced during the project as biblical.\n\nAdvertisement\n\n“We had the floods here in 2022; we had the COVID pandemic prior to that,” he said, as well as laying blame at how “the former Labor government handled the CFMEU”, who had a strong presence on the site throughout the project. Despite that dig, both ministers thanked the more than 2500 workers who brought the theatre to life. “They should all be proud of their efforts to produce what is truly one of the most beautiful buildings in our state,” O’Connor said. QPAC chief executive Rachel Healy said the new 1500-seat theatre — to go along with the 2000-seat Lyric — would attract an extra 300,000 visitors to the arts precinct annually. “The opening of the Glasshouse Theatre will also see us build on our reputation as one of Australia’s most dynamic and popular cultural destinations,” she said.\n\nAdvertisement\n\nAmong the first shows to be performed at The Glasshouse is the April opening of musical The Last Ship, written and performed by Sting, the story of a British community losing their shipyard. The theatre will officially open to the public on March 3. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/grammys-2026-full-list-of-nominees-and-what-to-expect-at-this-year-s-awards-20260130-p5ny7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grammys 2026: Full list of winners and nominees",
        "publish_date": "Mon, 02 Feb 2026 13:42:52 +1100",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTrevor Noah’s opening monologue had not even started when Australia’s own Tame Impala, aka Kevin Parker, took home a golden gramophone at the 68th Annual Grammy Awards.\n\nEnd of Summer’s victory in the best dance/electronic recording category was awarded during the pre-telecast Grammys ceremony, and is Parker’s second consecutive Grammy win after his victory in the same category last year for Neverender.\n\nJustin Bieber, Amyl and The Sniffers and Ye will all be part of the 2026 Grammy Awards on Monday, broadcasting live from 12pm AEDT. Sydney Morning Herald\n\nMeanwhile, Melbourne pub rock band Amyl and the Sniffers – who won album of the year during a total domination of the 2025 ARIA Awards – were nominated for best rock performance thanks to U Should Not Be Doing That but lost out to the late Ozzy Osbourne’s protege, Yungblud.\n\nSydney’s Rufus Du Sol’s album Inhale/Exhale also lost out in the best dance/electronic album category, while FKA Twigs emerged victorious with Eusexua.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/grammys-2026-live-updates-kendrick-lamar-chappell-roan-sabrina-carpenter-highlight-nominations-awards-to-start-at-11am-local-time-20260129-p5ny3z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grammys 2026 LIVE updates: Justin Bieber performs in silk boxers and socks after four-year hiatus",
        "publish_date": "Mon, 02 Feb 2026 13:42:13 +1100",
        "category": "entertainment",
        "authors": [
            "Bronte Gossling",
            "Nell Geraets",
            "Robert Moran",
            "Damien Woolnough",
            "Lauren Ironmonger"
        ],
        "text": "Melbourne’s own Rosé and Bruno Mars, in rock-star mode, open the show with a particularly Blues Brothers-ish take on their smash APT (I guess Bruno is the Belushi?). At least Billie Eilish is bouncing around in the front row.\n\nRosé, left, and Bruno Mars perform APT. Chris Pizzello/Invision/AP\n\nComedian Trevor Noah, somehow back to host his sixth consecutive (and, he promises, final) Grammys, gets the ceremony going with a gag comparing APT, the Korean drinking game, with its US equivalent. “Every time we turn on the news, we take a drink,” he jokes.\n\nHe takes a walk through the audience, shouting out stars including Pharrell and Tyler, The Creator. “I feel like I’m at Jeff Bezos’ wedding, but with way more black people,” he says.\n\nLoading\n\nJustin Bieber, at his first Grammys since 2022, looks nervous when Noah heads his way. But he keeps the jokes mild, congratulating Bieber and partner Hailey on their child and requesting a discount voucher for her make-up line Rhode.\n\nHis monologue is political-lite. He shouts out Olivia Dean for fighting Ticketmaster’s ticket prizes, and calls Doechii’s Anxiety the US’ new national anthem.\n\nHe even gets an applause when he announces that Nicki Minaj, who’s been recently red-pilled, isn’t at the show. “She is still at the White House with Donald Trump,” he says, doing an impression of them comparing their arse sizes. I feel Trump would love that one.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/olivia-dean-speaks-out-about-immigrants-in-grammy-speech-20260202-p5nyvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olivia Dean speaks out about immigrants in Grammy speech",
        "publish_date": "Mon, 02 Feb 2026 13:39:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/trevor-noah-roasts-celebrities-at-the-grammys-20260202-p5nyv8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trevor Noah roasts celebrities at the Grammys",
        "publish_date": "Mon, 02 Feb 2026 13:35:15 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Trevor Noah roasts celebrities at the Grammys\n\nTrevor Noah did not hold back as host of the Grammys with his opening monologue poking fun at Jeff Bezos, the Beibers and Nicky Minaj.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/moment-that-decided-one-of-the-all-time-great-super-bowls-20260202-p5nyvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Moment that decided one of the all-time great Super Bowls",
        "publish_date": "Mon, 02 Feb 2026 13:33:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Moment that decided one of the all-time great Super Bowls\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-fall-as-wall-street-retreats-20260202-p5nypf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slumps as gold, silver miners tumble; CBA rises",
        "publish_date": "Mon, 02 Feb 2026 13:25:16 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX slumps as gold, silver miners tumble; CBA rises Staff reporter Updated February 2, 2026 — 1:25pm ,first published February 2, 2026 — 5:20am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has extended its opening losses to be sharply lower at lunchtime, with shares exposed to gold and silver tumbling after the prices of the precious metals plunged over the weekend. Wall Street had an unsteady session on Friday. AP The S&P/ASX 200 was down 81.5 points or 0.9 per cent at 8787.6 in early trading, with six of 11 industry sectors lower. The Australian dollar lost ground as the US dollar rallied following President Donald Trump’s nomination of Kevin Warsh to be the next Federal Reserve chair. The Aussie was trading at US69.57¢ at 12.33pm AEDT. Also on the agenda for local investors is the Reserve Bank’s interest rates decision on Tuesday, with markets expecting the central bank to unveil its first rise in more than two years. In early trade, precious metal miners were battered with gold giants Northern Star (down 7.9 per cent), Evolution Mining (down 6.3 per cent) and Newmont (down 8.4 per cent) tumbling. Silver players also fell sharply with South32 losing 4.2 per cent. The falls came after the price of gold dropped 11.4 per cent to settle at $US4745.10 per ounce on Saturday. Gold’s price suddenly lost momentum following a tremendous rally where it roughly doubled over 12 months. It topped $US5000 for the first time last week and was trading at around $US5600 at one point. Silver, which had been on a similar, jaw-dropping tear, fell even more. It plunged 31.4 per cent.\n\nAdvertisement\n\nRelated Article US politics Trump taps former Federal Reserve insider to replace Powell “The total collapse in precious metals prices shows that any market can become gripped by mania,” Kyle Rodda, a senior analyst at Capital.com, wrote in a note. “Given the build-up of positioning and leverage involved, the sell-off is bleeding into other markets. Effectively, a deleveraging is happening.” Other mining stocks retreated. BHP lost 2 per cent, Rio Tinto fell 0.4 per cent and Fortescue dipped 0.1 per cent. Financial stocks are mixed, having shed some of their early gains. Commonwealth Bank led the way with a 1 per cent gain, while ANZ Bank added 0.8 per cent and Westpac advanced 0.6 per cent, but National Australia Bank fell 0.5 per cent. Energy stocks slid as oil prices retreated. Woodside Energy lost 0.8 per cent, Santos shed 2.2 per cent and Ampol dipped 0.1 per cent in early afternoon trade.\n\nAdvertisement\n\nElsewhere, the founder and managing director of the embattled Corporate Travel Management, Jamie Pherous, is stepping down with immediate effect, months after trading in its shares was halted and following a scandal over alleged over-charging of government clients. Over the weekend, financial markets churned as investors tried to figure out what Trump’s new nominee to lead the Federal Reserve would mean for interest rates. US stocks fell, with the S&P 500 down 0.4 per cent after sinking as much as 1.1 per cent earlier in the day. The Dow Jones dropped 179 points, or 0.4 per cent, and the Nasdaq composite lost 0.9 per cent. Whoever leads the Fed has a big influence on the economy and markets worldwide by helping to dictate where the US central bank moves interest rates. Such decisions lift or weigh on prices for all kinds of investments, as the Fed tries to keep the US job market humming without letting inflation get out of control. Trump has been pushing for lower interest rates, which usually help goose the economy but can also cause higher inflation.\n\nAdvertisement\n\nThe longtime assumption has been that the Fed should operate separately from the rest of Washington so that it can make moves that are painful in the short term but necessary for the long term. To get inflation down to the Fed’s goal of 2 per cent, for example, may require the unpopular choice to keep interest rates high and grind down on the economy for a while. Kevin Warsh has been a supporter of lowering interest rates. Bloomberg The big question is what Warsh’s nomination, which still requires approval from the Senate, means for the Fed’s independence. Warsh used to be a governor on the Fed’s board, so investors are familiar with him. That could also mean Warsh is familiar with and hopes to continue the institution of the Fed as an independent operator. And while with the Fed, Warsh criticised the central bank’s buying of bonds to keep interest rates low. Some on Wall Street took Warsh’s nomination as an encouraging signal for a still-independent Fed that will keep rates high, if necessary. Besides slowing the economy, higher interest rates would push downward on stock prices.\n\nAdvertisement\n\nBut Warsh has also recently been critical of the Fed’s current chair, Jerome Powell, and has voiced support for lower rates. Helping to limit the market’s losses was Tesla, which rose 3.3 per cent. It bounced back after dropping on Thursday despite delivering better profit reports for the latest quarter than analysts expected. Related Article Opinion\n\nFederal Reserve Trump will be seeing red as the Fed refuses to bow down Stephen Bartholomeusz Senior business columnist Apple added 0.5 per cent after the iPhone maker reported a stronger profit for the latest quarter than analysts expected. With AP, Bloomberg The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/dalaroo-sharpens-greenland-critical-minerals-play-20260202-p5nyvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dalaroo sharpens Greenland critical minerals play",
        "publish_date": "Mon, 02 Feb 2026 13:24:05 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nBusinessCompaniesBulls N' Bears Dalaroo sharpens Greenland critical minerals play Rowena Duckworth February 2, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDalaroo Metals has moved a step closer to de-risking its Blue Lagoon critical minerals project in southern Greenland after confirming the discovery of a zircon-dominated heavy mineral system, just as Western governments are scrambling to secure alternative supply chains outside China. Geochemical analysis results from surface and shallow auger sampling obtained during the company’s maiden 2025 field program have landed in Dalaroo’s inbox, and have confirmed a strong, consistent correlation between zirconium and hafnium - a textbook signature of zircon-hosted mineralisation. Lagoon and shoreline sediments at Dalaroo Metals’ Blue Lagoon critical minerals project in south-west Greenland. The tight relationship suggests the heavy minerals are being naturally concentrated within lagoonal and shoreline sediments, pointing to a laterally continuous system that has already been upgraded by nature through mechanical processes. Dalaroo believes natural sedimentary and hydraulic processes have done much of the beneficiation work upfront. Wave action and shoreline sorting have concentrated dense, chemically resistant minerals into near-surface traps.\n\nAdvertisement\n\n‘These results represent an important step in systematically de-risking the Blue Lagoon project.’ Dalaroo Metals chief executive officer John Morgan The strong zirconium–hafnium correlation also delivers a practical exploration advantage. The zirconium mineralisation is proving to be a practical pathfinder element, enabling handheld X-ray Fluorescence (XRF) surveys for rapid, real-time targeting in the field. This geological simplicity could be the key to future development. Heavy mineral sands systems are typically shallow, flat-lying and amenable to straightforward gravity separation. These factors can lead to shorter, cheaper development timelines, coupled with reduced technical risk compared to many hard-rock critical minerals projects. Notably, the zirconium–hafnium relationship shows up across multiple sample types and locations, supporting the company’s view of a broad, sedimentary heavy mineral system rather than isolated or structurally controlled occurrences - a level of consistency that materially de-risks the project at an early stage. Recent surface samples have thrown up 0.81 per cent total rare earth oxides (TREO), alongside consistently high-grade zirconium oxide reaching up to 4.42 per cent. The project has also returned substantial hafnium grades up to 99 parts per million (ppm) hafnium oxide.\n\nAdvertisement\n\nThe project was secured by Dalaroo Metals Limited just a month ago and its initial work — the first systematic exploration since the late 1970s — has outlined a 2.7km strike zone with standout critical mineral grades, pointing to a potential district-scale rare earth elements and zirconium discovery. Zirconium and hafnium are both listed as critical minerals due to their roles in advanced manufacturing, aerospace, defence technologies and nuclear applications. Hafnium, in particular, is prized for its use in semiconductors, nuclear control rods and high-temperature alloys, and currently trades at a whopping AU$17,000 per kilogram. Zirconium, meanwhile, is essential in ceramics, refractories and nuclear fuel cladding. Blue Lagoon also holds a promising rare earths inventory, dominated by the prized elements dysprosium and terbium - critical for the manufacturing of strong, permanent magnets used in electric vehicle motors, wind turbine generators, and other renewable technologies. Crucially, uranium and thorium analyses have remained low and are well below Greenland’s mandated 100ppm threshold, smoothing the regulatory path to any future development. Greenland has emerged as a focal point for Western critical minerals strategy, sitting within NATO territory and increasingly viewed as a stable, transparent jurisdiction capable of supplying zirconium, hafnium and rare earth elements into allied markets.\n\nAdvertisement\n\nDalaroo’s wholly owned Blue Lagoon project sits in the south-west corner of Greenland, well below the Arctic Circle and within the Gardar Alkaline Province, which is a globally recognised belt prospective for zirconium, niobium, hafnium and rare earth elements. Dalaroo Metals chief executive officer John Morgan said: “These results represent an important step in systematically de-risking the Blue Lagoon project. Confirming zircon as the dominant host mineral provides confidence that heavy mineral concentrations are laterally continuous and potentially amenable to simple gravity processing methods. Heavy mineral systems globally are typically associated with shallow mining, low strip ratios and straightforward beneficiation flowsheets.” Next up, Dalaroo plans to bring in specialist consultants to run detailed mineralogical, metallurgical and process characterisation test work. The program will include heavy mineral separation, automated mineralogical microanalysis (QEMSCAN) and gravity recovery testing. Expanded shoreline sampling, handheld XRF mapping and additional shallow drilling are also on the to-do list. With critical minerals now front-and-centre in Western industrial and defence policy and Greenland firmly in the geopolitical spotlight, Dalaroo’s Blue Lagoon project appears to be shaping up as a strategically located, technically simple and potentially scalable source of minerals the world is increasingly desperate to secure. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/moira-cookie-and-kevin-s-mum-where-to-watch-catherine-o-hara-s-memorable-roles-20260202-p5nyt4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Moira, Cookie and Kevin’s mum: Where to watch Catherine O’Hara’s memorable roles",
        "publish_date": "Mon, 02 Feb 2026 13:14:57 +1100",
        "category": "entertainment",
        "authors": [
            "Jocelyn Noveck"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nNow is certainly not the time for pettifogging. But can we confabulate about the comic brilliance of Catherine O’Hara? These radically arcane words, like so many others, dripped off the gifted comedian’s tongue so silkily as Moira, her singularly eccentric matriarch in Schitt’s Creek, that you laughed well before you wondered what the heck they meant. (For the record: “pettifogging” means to emphasise petty details, and “confabulate” simply means to talk.) But conversely, O’Hara, who died on Friday at 71, could make a ho-hum phrase utterly hilarious. As when she desperately declared, trying a bit of line-cutting in the crowded Beetlejuice Beetlejuice afterlife waiting room, “I have global entry!” And for something even more concise, how about her simple, one-word line reading of “KEVIN!!!” – the child she kept leaving behind in the Home Alone movies? In any case, as Moira would say, don’t be a dewdropper (a lazybones.) Here are some indelible O’Hara roles to catch up on. In Moira, Catherine found \"a character who didn't have to be the same character all the time\". AP Moira in Schitt’s Creek (2015-2020) The commercial Moira Rose films for local vintner Herb Ertlinger’s fruit wine start reasonably well. Until she tries to pronounce the product’s name. “Herb Ervlinger. Erv Herblinger. Bing Liveheinger,” she intones, inebriated, in a virtuosic scene that recalls Lucille Ball in her Vitameatavegamin ad.\n\nAdvertisement\n\nMoira, a career-capping (and Emmy-winning) role in the comedy created by Eugene and son Dan Levy, brought O’Hara legions of new fans – and elevated a new vocabulary. She discovered much of it in obscure wordbooks, she said. O’Hara said she’d created the character by thinking of women married to wealthy men – women who wanted to be seen as special, in their own right. Her unique look included a series of eccentric wigs. “I knew a woman who would have dinner parties at her house and she would keep disappearing and coming back with different wigs. And she would appear like, ‘Tada’ – whatever Moira was feeling on a particular day would dictate what kind of wig she would wear.” Streaming now on Binge. Catherine O’Hara in 2024’s Beetlejuice Beetlejuice, directed by Tim Burton. Delia in Beetlejuice (1988) and Beetlejuice Beetlejuice (2024) Thirty-six years after the first Beetlejuice, Tim Burton returned with a 2024 sequel. Why, you ask? Well, here’s one really good reason: O’Hara. Her Delia Deetz, the narcissistic artist stepmum of Winona Ryder’s Lydia Deetz, was a supporting character who stole the whole show. To sample her comic timing, just take the quick scene where Delia, mounting a gallery show where she herself is the canvas, notifies Lydia: “Your father has left me.” “He’s divorcing you?” Lydia asks.\n\nAdvertisement\n\n“What a horrible thought!” replies a shocked Delia. (Beat). “No, he’s dead.” Stream Beetlejuice on *Stan and HBO Max; and Beetlejuice Beetlejuice on HBO Max. Catherine O’Hara and Macaulay Culkin in Home Alone. Kate McAllister in Home Alone (1990) and Home Alone 2: Lost in New York (1992) OK, motherhood is chaotic. It’s hard to keep track of everything. Things can mistakenly be left at home. A child, even. Once. But, twice? That’s iconic. Editor's pick Review What to stream this week: A delightful Mel Brooks documentary and five more picks On the plane in that first Home Alone movie, Kate tells her husband she has a terrible feeling she’s forgotten something. “Did I turn off the coffee?” “Did you lock up?” And then, the awful realisation: “KEVIN!” Kate had changed her hair into a stylish bob – but apparently hadn’t updated her mothering skills – two years later when, in the sequel, Kevin was again discovered missing, at the Miami airport. This time, O’Hara’s “KEVIN!” was squealed at a high pitch – accompanied by her falling backwards, unconscious.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/ctm-ran-asylum-seeker-barges-for-the-uk-now-its-ceo-has-quit-20260202-p5nys9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CTM ran asylum seeker barges for the UK. Now its CEO has quit",
        "publish_date": "Mon, 02 Feb 2026 13:07:12 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "Advertisement\n\nUpdated BusinessCompaniesExecutive shake-up CTM ran asylum seeker barges for the UK. Now its CEO has quit Colin Kruger Updated February 2, 2026 — 1:07pm ,first published February 2, 2026 — 10:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe founder of the embattled Corporate Travel Management (CTM), Jamie Pherous, is stepping down with immediate effect with the company’s shares remaining suspended after the group admitted overcharging clients, including the UK government, as much as $160 million. CTM told the ASX on Monday morning that Pherous would retire as chief executive and board member, with chief commercial officer Ana Pedersen to act as chief executive of the travel agency while a permanent replacement is found. Pherous, also the group’s second-largest shareholder, will move to an “advisory role” under a six-month consulting agreement with the company. CTM boss Jamie Pherous is retiring amid a long-term suspension of the company’s shares. Attila Csaszar Chairman Ewen Crouch said the board had determined now was the “appropriate time to accelerate the transition to a refreshed corporate structure”, while acknowledging the problems the company had faced. Crouch acknowledged the need for change given the scale of the scandal, which will cost investors dearly, but avoided laying any blame at the feet of CTM’s charismatic founder, who started the business more than three decades ago.\n\nAdvertisement\n\n“We recognise his impact, but as a board, must also focus on the evolution of the business,” Crouch said. “Clearly, we have let shareholders down over recent months. We understand that, and we’ve heard first-hand their deep frustration. It’s important that we learn from these events and create a strong and sustainable structure that can help us restore trust in the business.” CTM chairman Ewen Crouch, pictured in 2016. Louie Douvis Crouch would not give speculate on whether CTM would be in a position to release the 2025 financial year accounts before the current financial year ends on June 30. “There is confidence that we will complete the process to enable the company to relist. I cannot give you a specific date,” Crouch said.\n\nAdvertisement\n\nCTM shares have been suspended for months, after the company last year flagged minor accounting issues that then ballooned into massively overcharging the UK government for services including housing asylum seekers on large-scale barges including the controversial Bibby Stockholm. Related Article Opinion\n\nScandal The pitchforks are out for this Aussie travel company Elizabeth Knight Business columnist The company had previously told the ASX that these asylum seeker contracts would be worth $3 billion over several years, but the controversy over asylum seekers in the UK, and a change of government, led to abrupt changes to the deal. CTM’s woes have raised concerns it was charging too much to house the asylum seekers in hotels across the UK under contracts arranged by the former Conservative government. According to UK reports, CTM has won £3.9 billion ($7.7 billion) in public sector contracts over the past decade. The company also holds the contract for managing Australian government travel until 2027. Finance Minister Katy Gallagher confirmed that CTM agreed to an independent audit of its business in the light of the overcharging claims.\n\nAdvertisement\n\nPedersen, CTM’s acting chief executive, said: “It’s been made public what the Australian government is intending on doing, and we’re working very closely with them, and that process will commence very shortly.” That deal to manage Australian government travel has not been implicated in the overcharging scandal and there is no suggestion Pherous was involved in the broader issues. CTM had a market valuation of $2.35 billion when shares last traded, but some analysts have halved their value of the stock and one investor has written off its valuation entirely. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/myers-claims-mile-victory-in-nyc-20260202-p5nyvg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Myers claims mile victory in NYC",
        "publish_date": "Mon, 02 Feb 2026 12:58:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Myers claims mile victory in NYC\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/trevor-noahs-joke-with-kendrick-lamar-20260202-p5nyve.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trevor Noah's joke with Kendrick Lamar",
        "publish_date": "Mon, 02 Feb 2026 12:56:24 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-confirms-closure-of-afghan-embassy-amid-taliban-pressure/ute0yp0dz",
        "title": "Australia confirms closure of Afghan embassy amid Taliban pressure",
        "publish_date": "Mon, 2 Feb 2026 02:18:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nThe closure of the Afghan embassy in Canberra, in the pipeline for some time, has now been confirmed with a timeline.\n\nThe embassy will officially shut on the 30th of June this year.\n\nThe decision comes after reports late last year that the Australian government advised the embassy's ambassador, Wahidullah Waissi, that his diplomatic credentials would not be renewed.\n\nCEO of the Afghan Women on the Move organisation, Maryam Zahid, says it's a substantial loss for the Afghan diaspora in Australia.\n\n\"This announcement has created a lot of fear, confusion and disappointment. because this embassy for Afghan diaspora here in Australia, it was more than a diplomatic platform, especially for women and elders, it was a place of connection, identity. They could have or they should have worked with Afghan diaspora and ask us what we need and they didn't do that.\"\n\nThe Afghan embassy has served as a diplomatic, cultural and community bridge between Afghan Australians, civil society organisations, schools and universities, plus local, state and federal government.\n\nMs Zahid says the closure leaves a gap the government is yet to explain how it will fill.\n\n\"Because our government here in Australia hasn't offered us something to replace it in terms of having a community platform outside of religious views, community politics, and fights about who is who in the community, that hasn't been given to us, and it hasn't been invested in the Afghan community.\"]]\n\nThe diplomatic mission had been operating as an embassy-in-exile following the Taliban's takeover of Afghanistan in 2021.\n\nIt continued to issue official documents such as passports and visas, and to verify IDs for thousands of Afghan citizens living in Australia.\n\nHowever, its services haven't been operating normally since the Taliban announced in July 2024 that it would no longer recognise consular documents issued by 14 embassies related to the former republic, including the Canberra facility.\n\nDirector of the Afghan Cultural Association of Newcastle Sami Zakhil told SBS Pashto for this reason, he doesn't expect the closure to have a significant impact.\n\n\"The embassy has largely operated in a symbolic capacity and, by its own admission, has not been in contact with the current government in Kabul. As a result, it has not been able to meaningfully assist Afghans with consular or official matters.\"\n\nProfessor of Diplomacy at Australian National University, William Maley, says the decision to close the embassy follows a demand from the Taliban that all embassies under the control of an anti-Taliban ambassador be closed.\n\n\"Even though Australia might deny a connection between the letter and the decision, this really dents, if not fatally, Australia's credibility when complaining about the human rights performance of the Taliban. It's a terrible blow not only to the Afghan community, but also to Australian service personnel who served in Afghanistan, they really would feel like the government has spat in their faces.\"\n\nThe Department of Foreign Affairs and Trade said the government doesn't intend to accept a Taliban-appointed representative in a statement which in part reads:\n\n\"We do not recognise the Taliban as the legitimate representatives of the Afghan people. We strongly condemn the Taliban’s persistent systematic abuses of human rights, particularly against women and girls, and voices of dissent. We reaffirm our shared commitment to human rights and the dignity of the people of Afghanistan.\"\n\nA spokesperson for the foreign minister told SBS the Albanese government \"will not accept a Taliban representative.\"\n\nBut Professor Maley says DFAT's official statement doesn't rule it out as an option in future .\n\n\"If one looks at the statement that was put out of the Foreign Affairs Department, it's rather slippery on that particular point. It didn't say that Australia will never accept a Taliban diplomat representative or honorary consulate, it said Australia has no intention of doing so. And of course that's the kind of wording that people use if they want later to be able to say, oh, well we didn't intend it at the time, but we changed our minds.\"\n\nMs Zahid says she's firmly against the prospect of Australia accepting a Taliban representative as a diplomatic figurehead.\n\n“I'd be more than upset and women like me in communities that are very much against having that kind of mind-set and ideologies to represent us. That would be a big no for us. And I'm sure we can at least rust this promise from our government, that our embassy will not be controlled or represented by those views.\"\n\nHowever, not everyone is opposed to the idea.\n\nFazal Katawazai, a former Afghan diplomat in Australia, says a relationship should be established to avoid further practical issues for Afghan Australians.\n\n\"The closure will create significant practical hurdles for Afghan Australians planning to visit Afghanistan. And also the travel documents, passport problems. In some extent, I think Australia need to have some kind of consular relationship as an honorary consular in Australia with the existing Taliban government.\"\n\nNeither the Australian government nor the embassy have outlined how Afghan citizens will receive essential consular services.\n\nErfan Abidi is the founder of an underground network of schools for girls in Afghanistan, and an active member of the Afghan community in Adelaide.\n\nHe told SBS Pashto for his community, the decision to close the embassy is about much more than being able to travel back to Afghanistan.\n\n\"For many Afghans in Australia, the Afghanistan embassy is more than an office. It is a wider symbol of identity, dignity, and connection to your homeland. It has also been the only official space where Afghans, particularly Afghan women, could raise their voices, share their concerns, and advocate for their rights. The panned closure feels like another fall of Afghanistan, but this time in exile, not in Afghanistan.\"",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/when-and-where-you-can-watch-the-grammy-awards/48br2i1jx",
        "title": "Tame Impala secures Australia's sole Grammys win",
        "publish_date": "Sun, 1 Feb 2026 21:23:26 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Australian band Tame Impala nabbed Australia's only award at the 68th annual Grammy Awards, which kicked off on Monday morning.\n\nThe psychedelic act, led by Perth-raised Kevin Parker, won Best Dance/Electronic Recording with the song End of Summer.\n\nThe artist claimed the same honour last year thanks to a collaboration with French electronic duo Justice on the song Neverender.\n\nMelbourne punk group Amyl and the Sniffers missed out in the Best Rock performance category, won by Yungblud. Sydney electronic trio Rüfüs Du Sol was up for Best Dance/Electronic Album but lost out to FKA Twigs.\n\nMeanwhile, British singer Olivia Dean, who recently topped Australia's triple j Hottest 100 countdown with her hit Man I Need, won the Grammy for Best New Artist.\n\n\"I’m up here as a granddaughter of an immigrant,” Dean said while accepting the award. \"I'm a product of bravery, and I think those people deserve to be celebrated.\"\n\nThe Grammys are being hosted this year by comedian Trevor Noah, featuring performances by Lady Gaga, Justin Bieber, Sabrina Carpenter and more.\n\nWho is up for the top awards?\n\nThere are 95 different categories at this year's awards show, including Record of the Year, Song of the Year and Album of the Year.\n\nKendrick Lamar, Bad Bunny and Lady Gaga each won awards as music's biggest night got underway in Los Angeles with dozens of prizes handed out before the televised marquee event.\n\nLamar jumped out to an early lead with three trophies in the rap categories, while Lady Gaga won for best dance pop recording and Bad Bunny snapped up a gramophone for best global music performance.\n\nAll three are angling to make history by taking home the gala's most coveted award, Album of the Year, for the first time.\n\nRecord Of The Year nominees:\n\nDtMF — Bad Bunny\n\nManchild — Sabrina Carpenter\n\nAnxiety — Doechii\n\nWILDFLOWER — Billie Eilish\n\nAbracadabra — Lady Gaga\n\nluther — Kendrick Lamar with SZA\n\nThe Subway — Chappell Roan\n\nAPT. ROSÉ — Bruno Mars\n\nSong Of The Year nominees:\n\nAbracadabra — Lady Gaga\n\nAnxiety — Doechii\n\nAPT ROSÉ — Bruno Mars\n\nGolden — Huntr/x\n\nluther — Kendrick Lamar\n\nManchild — Sabrina Carpenter\n\nWILDFLOWER — Billie Eilish\n\nAlbum Of The Year nominees:\n\nDeBÍ TiRAR MáS FOToS — Bad Bunny\n\nSWAG — Justin Bieber\n\nMan's Best Friend — Sabrina Carpenter\n\nLet God Sort Em Out — Clipse, Pusha T & Malice\n\nMAYHEM — Lady Gaga\n\nGNX — Kendrick Lamar\n\nMUTT — Leon Thomas\n\nCHROMAKOPIA — Tyler, The Creator\n\nLamar has the most nominations this year, up for nine categories, while Lady Gaga has the second-highest number with seven.\n\n— With additional reporting from Agence France-Presse\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/alcaraz-defeats-djokovic-securing-historic-grand-slam/tlpuaocf2",
        "title": "'Dream come true': Carlos Alcaraz secures historic career Grand Slam",
        "publish_date": "Sun, 1 Feb 2026 19:39:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tennis has crowned a new king, with Carlos Alcaraz out-duelling living legend Novak Djokovic in the pair's heavyweight Australian Open title match to become the youngest man to complete a career Grand Slam.\n\nThe world No. 1 rallied from a set down to deny Djokovic an unprecedented 25th major singles triumph with a rousing 2-6 6-2 6-3 7-5 victory on Rod Laver Arena on Sunday night.\n\nIn inflicting a first defeat on Djokovic in 11 finals at Melbourne Park, Alcaraz added a maiden Australian Open title to his two trophies each from the French Open, Wimbledon and US Open.\n\nThe Spanish sensation joins Don Budge, Fred Perry, Roy Emerson, Rod Laver, Andre Agassi, Roger Federer, Rafael Nadal and Djokovic as the ninth man to win all four of the sport's annual majors.\n\nAnd at just 22 years and 272 days old, he is the youngest to achieve the rare feat.\n\nBudge, an American, was 91 days older when he completed the full set at the 1938 French Open.\n\nAlcaraz paid tribute to his vanquished opponent, hailing Djokovic as an \"inspiration\". Source: AAP / Patrick Hamilton\n\nAlcaraz has now won seven slams — surpassing stars including Stefan Edberg and Boris Becker and drawing level with fellow all-time greats John McEnroe, John Newcombe and Mats Wilander — in just 20 major appearances.\n\n'It feels crazy'\n\nFittingly, Nadal enjoyed a front-row view as Mark Edmondson, on the 50th anniversary of his 1976 Open triumph, presented the Norman Brookes Challenge Cup to his countryman.\n\n\"It's a little bit weird seeing Rafael in the stands. It's the first time, I think, if I'm not wrong,\" Alcaraz said.\n\n\"You were watching me when I was like 15, 14 years old, so it's been a long time but, yeah, it's such an honour playing in front of you.\n\nREAD MORE Australian Open 2026: Rybakina beats Sabalenka to claim maiden Australian Open title\n\n\"It feels a dream come true. I dreamt about getting the Australian Open to complete the career Grand Slam, so I'm lost now. I don't even know what what to say.\n\n\"But it feels crazy, to be honest.\"\n\nAlcaraz also paid tribute to his vanquished opponent, hailing Djokovic as an \"inspiration\".\n\n\"He deserves an ovation, for sure,\" the champion said. \"For doing the amazing things he's doing.\"\n\nDjokovic, though, accepted the night belonged to Alcaraz.\n\nDjokovic had been bidding to become the oldest player in the open era stretching back to 1968 to win a grand slam men's singles title. Source: AAP / Patrick Hamilton\n\n\"What you've been doing, I think the best word to describe it is historic, legendary,\" he said.\n\nWith both coming off epic, marathon semi-final victories on Friday night, intrigue surrounded how the two gladiators would shape up physically for the blockbuster final.\n\nAt 38 years and 255 days, Djokovic had been bidding to become the oldest player in the open era stretching back to 1968 to win a grand slam men's singles title.\n\nInstead the former world No.1 suffered his first final loss on his RLA battleground.\n\nHaving also won last year's French and US Open titles, Alcaraz now holds three of the four grand slam trophies.\n\nAnd, continuing their domination, Alcaraz and Jannik Sinner join Djokovic and Nadal as only the second pair ever to share nine consecutive grand slam titles.\n\nOnly Nadal and Federer, with 11 straight slams between 2005 and 2007, have enjoyed a longer stranglehold on the men's majors.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/reyna-and-her-family-are-facing-deportation-from-australia-her-community-is-fighting-back/3yn3td8ht",
        "title": "Reyna and her family are facing deportation from Australia. Her community is fighting back",
        "publish_date": "Sun, 1 Feb 2026 06:38:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "After building a life here for over a decade, all Reyna Nangan dreams for her family — especially her eight-year-old daughter, Kaia — is to call Australia home.\n\n\"Kaia did have a lot of opportunity here in Australia,\" Reyna told SBS News. \"She did thrive really well.\n\n\"That's the one thing that I don't want to be taken from her, that opportunity ... I know that she can be something, someday.\"\n\nReyna and her partner, Karin Yechoku, from the Philippines and Thailand, have lived in Australia for over 14 years. They own a restaurant in Toowoomba, where their daughter was born and has spent her entire life.\n\nNow, they are at risk of deportation.\n\n'It's not Australia that doesn't want you'\n\nReyna said their bid for permanent residency fell through after a past employer failed to follow through on a visa application, leaving them in bureaucratic limbo.\n\n\"A lot of times I questioned myself, why? Why even I'm here if Australia doesn't want me?\" she said.\n\n\"But then ... I correct myself, 'it's not Australia that doesn't want you, okay? It's just the system ... and especially it's not the people of Australia that [don't] want you. You are loved by them.'\"\n\nNangan said Kaia is \"pretty aware of what is going on ... I always keep telling her that, we do what we can, and then God will do the rest\". Credit: SBS\n\nThe family's application for ministerial intervention was denied at the end of last year, when it was found not to be a substantiative public interest case.\n\nWhile the Department of Home Affairs said it cannot comment on individual cases for privacy reasons, a spokesperson said in a statement that \"Visa applicants remain legally responsible for meeting visa criteria even where they suffer disadvantage due to employer misconduct, negligence, or failure\".\n\nThe minister does not generally intervene to \"fix\" individual visa outcomes, except in very limited, exceptional circumstances, the spokesperson said.\n\nReyna, however, has not given up and has filed a second request with the immigration minister for consideration. The family has been approved for a bridging visa while they await a decision.\n\n\"I'm the one in the family making sure that this fight will carry through,\" she said.\n\n'They are just so kind to us'\n\nReyna and her family are not alone in the fight, with community members who greet them at their restaurant with a smile and a hug telling them they support them.\n\nAlmost 4,000 people signed a petition calling for the immigration minister to intervene in the case and allow the family to stay in Australia\n\nDale Hockey, a customer of their restaurant for many years, said he was \"heartbroken\" when he heard about the family's visa situation.\n\n\"It broke my heart, it really did. They are just so kind to us ... I'll do anything I can for them,\" he told SBS News.\n\n\"They've always been the genuine kind people that they have been ... They treat you like family, and I do feel like they are family.\"\n\nToowoomba has a diverse community, according to the last census, with about 14 per cent of residents here born overseas, and many proud of the area's rich mix of cultures.\n\nJane Schuller, another customer of the family's restaurant, said the family \"deserves to be Australian\".\n\n\"They're to me what Australia wants ... These are good-hearted, honest, hardworking people and I know that they've worked all the time since they've been here,\" she told SBS News.\n\n'Finally called home'\n\nGarth Hamilton, the local Federal MP of Groom, has also joined calls for the family to be allowed to stay.\n\n\"The amount of people in my community who have reached out and said, 'We have to do something about this, this can't be right.' It's been across the board, from some of our most prominent business people to people passing me in the street,\" he told SBS News.\n\n\"I am gonna be as optimistic as possible all the way through, and I think that's what they need around them.\n\n\"Anyone in this situation needs people just to consider no other option, but that they're gonna stay and continue to contribute, be a part of our community.\"\n\nHamilton said his team is engaged with Home Affairs and they are \"working through it\".\n\nDespite the anxious wait, Reyna has been overwhelmed with the support she's received.\n\n\"I'm grateful to all of them ... We are far away from our families, but then God make sure that we have families here, too,\" she said.\n\nShe also has a message for Home Affairs Minister Tony Burke.\n\n\"We are a family that just wanted what is good for our child,\" she said.\n\n\"We just want ... Australia to be finally called our home, [so] that we don't have to think of our visa all the time.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/paddle-out-at-bondi-for-nico-antic-killed-in-sydney-shark-attack/4dqpojl98",
        "title": "'We love this kid so much': Paddle-out at Bondi for young shark attack victim",
        "publish_date": "Sun, 1 Feb 2026 02:03:49 +0000",
        "category": "sports",
        "authors": [],
        "text": "The heartbroken parents of a shark attack victim have remembered him as a boy who \"loved life\" as friends and supporters took part in a mass paddle-out to mourn the young surfer.\n\nHolding boards and surrounding the family of 12-year-old Nico Antic, more than 100 people joined the early morning memorial at Sydney's Bondi Beach on Sunday.\n\nLocals lined the sand at the famous beach for the event, held more than a week after the keen rugby player died from injuries sustained in the mauling.\n\nNico, a nipper at North Bondi Surf Lifesaving Club, was critically injured while swimming with friends near a popular beach at Vaucluse, in Sydney's east, earlier in January.\n\nDressed in a yellow and red surf lifesaving uniform, his father Juan addressed the crowd on the shores of North Bondi with Nico's mother, Lorena.\n\nAntic's parents, Juan and Lorena, paid tribute to their son. Source: AAP / Sarah Wilson\n\n\"We love this kid so much, our Nico. I'm going to miss him forever,\" Antic said while wiping away tears.\n\n\"He loved his mates, he loved life. I'm sure he's watching all of us so thanks to all of you for being part of this for Nico.\"\n\nThe 12-year-old was one of four people attacked by sharks off NSW beaches in two days in January.\n\nHis death marked the first fatal shark attack inside Sydney Harbour in more than 60 years.\n\nAntic was attacked by a suspected bull shark at Nielsen Park, also known as Shark Beach, in Sydney. Source: Supplied / Antic Family / AAP / Sitthixay Ditthavong\n\nSurfer Mercury Psillakis, 57, was fatally bitten by a shark at Sydney's Long Reef beach in September.\n\nPablo Bardon, who has known the Argentine-Australian Antic family for two decades, said it had been a very tough period for the tight-knit community in which ties were forged through people's connection to the water and surfing.\n\n\"When you have kids, it's really hard. It's been an emotional process,\" the father-of-three said.\n\nBondi Beach had dramatically changed since the nearby shark attack and the terrorist attack of 14 December that left 15 dead.\n\n\"When driving down, it didn't feel great. It's not the same place,\" Bardon said.\n\nREAD MORE Nightmares and PTSD: The reality of surviving a shark attack\n\nThe paddle-out was organised by Nico's school, Rose Bay Secondary College, which remembered him as \"deeply loved by a large network of friends\".\n\n\"He brought warmth, energy and kindness to those around him and will be remembered for the joy he shared so freely,\" the school said previously.\n\nFor Gus De Notto, it was a tough moment paddling out on his surfboard.\n\n\"I feel like a really heavy atmosphere and of course, it was nice to see people but unfortunately, that won't bring back Nico's life,\" he said.\n\n\"He was a super-happy child.\"\n\nExtra funding for shark attack prevention\n\nAfter the spate of incidents, an extra $4.2 million was added to NSW beach safety programs, including shark tagging and monitoring and the installation of listening stations in the harbour.\n\nDrone patrols will be extended to seven days a week through to the end of the April school holidays, covering 30 more beaches in Sydney and along the NSW coast.\n\nAustralia's largest ocean swim, the Cole Classic, was due to take place across the harbour in Manly on Sunday, but the event was postponed until 22 February to \"keep participants safe\".\n\n\"Conditions are trending positively and allowing additional time will further support a safe and enjoyable swim,\" organisers said.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-very-long-way-in-100-years-television-hits-a-century/w0f4opzp7",
        "title": "A very long way in 100 years: television hits a century",
        "publish_date": "Sat, 31 Jan 2026 21:30:48 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nToday, human beings spend a great deal of time in front of their televisions.\n\nAustralians spend between two and a half and three hours watching broadcast and on-delay TV every day.\n\nIf you add in streaming services, some studies suggest that figure could be as high as six hours a day.\n\nWhich is quite an impact when you consider that it's only a hundred years since TV was invented.\n\nThe name John Logie Baird is synonymous with the history of television.\n\nHe was a businessman, but above all an inventor and he gave the first public demonstration of what would become known as television in January 1926 at his Soho Laboratory in Frith Street in London.\n\nUnlike the electronic systems that would follow, Baird's Televisor was mechanical.\n\nLewis Pollard is the Curator of Television and Broadcast, Science and Media Museum in the United Kingdom.\n\nHe says it was a breakthrough but extremely difficult to operate.\n\n\"It was very technical, very complicated and because Baird was such a pioneer in what he was doing, he had to be essentially making a lot of his equipment from scratch or using whatever you might have had around the lab. So the apparatus we have on site in the museum has parts of an old hatbox, a bicycle lamp, and it was very DIY because you couldn't just go to a shop and buy the pieces you needed because television didn't exist.\"\n\nThe BBC launched the world’s first regularly scheduled TV service in 1936 in the UK, but as this newsreel footage suggests, it was viewed as a bit of a novelty, and a distraction from the serious work of radio.\n\n\"The BBC's first regular television broadcasts began on the 2nd November 1936, introduced by Leslie Mitchell. There was no colour of course, pictures were strictly black and white or, as some cynics suggested, black and dark grey. But definition improved with usage. Transmission was limited to two hours a day.\"\n\nIn 1938 Logie Baird spoke to British Movietone newsreel audiences in Australia and New Zealand, where television did not start until 1956, nearly two decades later.\n\n\"It is now 12 years ago since I produced the first little flickering television image. Today we have in London a regular television service twice daily with thousands of lookers-in (viewers). Television has grown from a scientific novelty to a commercial service. At present the range is limited to 30 miles in and about London. In this connection it is interesting to note that as far back as 1928 I spanned the Atlantic with television. That was of course purely experimental but who can foretell the future.\"\n\nCertainly there had been huge improvements since those early days.\n\nLogie Baird had to use a ventriloquist's dummy as a subject for that first broadcast as the lighting employed was so intense, anything being lit had a tendency to catch fire.\n\nBy 1953, the technology had improved so much that the BBC felt confident enough to launch its biggest outside broadcast to date - the coronation of Queen Elizabeth the second, with their program being recorded on film as it was broadcast, and sent around the world.\n\nLewis Pollard again.\n\n\"Any TV camera in the UK that could be mobilised was mobilised for use during the coronation. It was such a large media event that's why so many people remember it. We talk, here the museum about, the millions of people who watched, but one thing that people might not be so familiar with is the televisions in the 1950s were larger than Baird's Televisor, but still very small and the records say something like 17 people watched each television set, which would be half the size of a contemporary TV, maybe even smaller than that. So, for people watching at home, you know, it was such a big moment that it really helped, I'd say it really helped cement television as part of people's everyday lives. It went from this novelty that some people might have to, oh, I should have this in my home as well. And that's what really made television go as big as it did in the UK.\"\n\nThe next revolution came with the ability to record television programs in high quality for later broadcast.\n\nThe first broadcast quality video recorder was the Ampex VRX-1000, a gigantic machine which American broadcaster CBS first used in earnest in 1956.\n\nIt was the size of a piano, and cost $50,000 US - the equivalent of 900,000 Australian dollars today.\n\nLogie Baird had already foreseen the importance of being able to record video, and had come up with his own system many years earlier.\n\n\"He was also really, experimenting with the idea of being able to record television signals, because in those days, all television as it went out was live. There was no way of recording such vast amounts of data in any way, shape or form. And Baird was working with a system he called Phonovision, which was recording both the image and sound components of a television broadcast onto essentially like a vinyl disc and the really interesting story behind that is we have some of those discs in our collection, and they weren't essentially translated until much, much later, until after Baird had passed away, because he had a way of encoding the information onto a disc. We had no way of decoding it. So as far as he was aware, that system may or may not have worked. And it was until much later that we proved that actually, yes, it did work.\"\n\nFrom a flickering black-and-white novelty to cinema-quality colour in the palm of our hand, visual media has come a very long way in a hundred years.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/exhibition-described-as-a-milestone-for-inclusion-and-representation/sf6aazuh0",
        "title": "Exhibition described as a milestone for inclusion and representation",
        "publish_date": "Sat, 31 Jan 2026 20:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nLooking at his own portrait, hung at the Australian Museum in Sydney, proud Nurungga, Nakanoo, Latji Latji and Elder, Uncle John Baxter, hopes this exhibition - called 'Unfinished Business' - is a conversation starter and a catalyst for change.\n\n“We don't want to be left in the background. We don't want to be left as a second thought or an inconvenience in this ever-changing world. We want to be there in the forefront with you standing by you, not standing behind you.”\n\nUncle John Baxter was deeply involved in the exhibition's creation from the planning stage.\n\nHis installation 'Not Fit For Purpose' also telling an important story.\n\n“Sometimes when we receive this equipment, they're not fit for purpose. We think that they may be, or somebody else has thought on our behalf that, oh yes, uncle needs a wheelchair, so we'll give them a wheelchair. They may not realize that Uncle lives in a remote community. There are no footpaths. There are no sealed roads. You're going down dirt tracks. Uncle wants to be a part of his culture.”\n\nAccessibility is woven into the exhibition's design, including elements such as tactile panels, audio descriptions, Auslan interpretation and large print materials.\n\nThis is Trevor Ahearn, the major projects lead in the First Nations department at the Australian Museum.\n\n“We also wanted to create a design language that sort of made access prominent, a prominent theme, not just for people with access needs, but for people who able bodied people, people who don't have access needs to come in and be aware of what it takes to make a thing accessible.”\n\nAccording to the Australian Bureau of Statistics, about one quarter of Aboriginal and Torres Strait Islander people report having a disability.\n\nThis exhibition also highlighting the intersection of ableism and racism.\n\nThis is Gayle Kennedy, a Wongaiibon Clan member.\n\n“If you really want to know us, look at our eyes, see the power in them, see the strength. And not only as Aboriginal people, but as people with disabilities, because as far as I'm concerned, we are the most marginalized people in any society worldwide.”\n\nA vessel for truth telling - each of the 30 participants told their story on their own terms.\n\n“I think that you could see that in all of these photographs. We choose how we are photographed and what you see up there. It's accessible, it's brilliant, it's in your face, and it's much needed and long overdue.”",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/japan-work-culture-sanae-takaichi/1a9ts1qxt",
        "title": "Working no longer 'number one': How this country is trying to break its overwork habit",
        "publish_date": "Sat, 31 Jan 2026 19:39:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Kazuyo Kitada used to work seven days a week — 9am to midnight on weekdays, and 9am to 5pm on weekends.\n\nOn one occasion, a client called the office at 2am. The following day, Kitada’s employer asked her why she wasn't there.\n\n\"I need sleep,\" she recalls thinking.\n\nIt was the 1990s, and Kitada was working in Japan for an IT company where she would ultimately spend two decades. At the time, she was putting in long hours on a tough project for a difficult customer, she tells SBS News.\n\nSince moving to Australia 16 years ago, she's observed a workforce culture that she says focuses much more on the individual than the company.\n\n\"If someone is ill, of course, that project would be delayed,\" she says, contrasting the relative flexibility in Australian workplaces with the unmoving project deadlines she previously experienced.\n\n\"Twenty years ago, in Japan, if something happened on the first day of a family trip, you have to [go] back to the company, right?\n\nIt's company: number one. Working: number one.\n\nThose expectations weren't unusual in Japan, which has long struggled with a notoriously punishing work culture marked by long hours and untenable workloads, driving a host of work-related health problems.\n\nDeath by overwork became so familiar in Japan that it has a name: karoshi.\n\nBut like many countries, Japan has seen a significant shift in attitudes towards work over the past decade, particularly among younger people and notably since the COVID-19 pandemic.\n\nThe issue was thrust back into the spotlight in October with the appointment of a new prime minister, whose personal attitude to work has fuelled controversy at home and abroad.\n\nA leader who will 'work, work, work, work, work'\n\nWhile the extreme work culture of decades past has been on its way out for some time, overwork remains a major social flashpoint.\n\nThat's why it sparked such debate when Japan's new leader, conservative Sanae Takaichi, made a personal commitment to abandon work-life balance, vowing to \"work, work, work, work, work\" and encouraging her party's members to do the same.\n\nShe made international headlines again in November last year, when she called a 3am meeting with aides, claiming she sleeps as little as two to four hours a night.\n\nIt stirred concerns that she is modelling a work ethic that many Japanese people are striving to move away from.\n\nJapan's National Defense Counsel for Victims of Karoshi said her comments \"could force workers, including government employees, to overwork and work long hours and could revive an outdated mentality\".\n\nIt also drew backlash from labour unions and some members of parliament.\n\nYoshihiko Noda, a former prime minister and leader of the main opposition party, called the 3am meeting \"crazy\" in an interview with the New York Times.\n\n\"It’s a very sad attitude for the top leader of the country to show,\" he said.\n\nTakaichi's \"work, work, work\" remark earned the title of Japan's 2025 buzzword of the year, awarded by publishing house Jiyū Kokumin Sha, and sparked further backlash from the families of karoshi victims.\n\nSanae Takaichi, leader of the conservative Liberal Democratic Party, was elected prime minister by Japan’s parliament last October. Source: Getty / Rodrigo Reyes Marin/Pool/Anadolu\n\nAt the award ceremony, Takaichi emphasised that she did not intend to suggest that long working hours are a virtue, nor to encourage them among the public.\n\nStill, Hiroshi Ono, a professor of human resources at Tokyo's Hitotsubashi University, tells SBS News the prime minister's original messaging sent the \"wrong signal\".\n\n\"That's exactly what we're not supposed to do,\" he says.\n\n\"If that was not Takaichi [and] that was a private company, they'd be blacklisted.\n\nCalling a meeting at three in the morning — no, you can't do that.\n\nIn Japan, \"black companies\" refer to employers known for exploitative labour practices and excessive working hours. Since 2017, the government has published lists of companies that violate employment laws.\n\nTakaichi is also looking to relax Japan's overtime restrictions, currently capped at 45 hours a month, as employers contend with significant labour shortages and a shrinking working-age population.\n\nThat overtime cap was introduced as part of work-style reforms passed in 2019, which were intended to \"correct this work culture of excessive work hours, karoshi\", Ono says.\n\nTakaichi's approval rating sky high\n\nDespite her controversial remarks about work, Takaichi has received exceptionally high approval ratings — north of 70 per cent in some polls — with very strong support from younger voters.\n\nIn December, her approval stood at more than 92 per cent among voters aged 18 to 29 and 83 per cent among those aged 30 to 39, according to a joint poll by the Sankei Shimbun newspaper and Fuji News Network, a television network.\n\nA small survey of 100 Japanese working women aged 20 to 49 last year found that more than half took Takaichi's remarks about work positively, with many viewing it as a personal declaration of her resolve.\n\nAnother survey, conducted by the Shufu JOB Research Institute, found that respondents had \"high expectations\" for the new administration regarding the promotion of women's workforce participation.\n\nYounger generations, particularly those raising children, appeared to hold high hopes that the appointment of the first female prime minister would lead to improvements in working conditions.\n\nREAD MORE Japanese PM Sanae Takaichi dissolves parliament after three months in office\n\nRyoko Yoshida is a 38-year-old who works in Japan's automotive industry.\n\nShe tells SBS News that while Japan is growing out of the \"work, work, work\" mentality, she suspects Takaichi felt compelled to aggressively promote her own work ethic as the first woman in the role.\n\nBut Yoshida doesn't read the prime minister's rhetoric as a call for the working population to mirror it.\n\n\"It's still a society where women [are] quite looked down upon,\" she says.\n\n\"You can see how motivated she is as a PM. I think it worked for younger people.\"\n\nThis month, Takaichi, who took on the premier role after her predecessor resigned, called a snap election for 8 February. She told reporters she wanted \"the people to decide directly whether they can entrust the management of the country to me\".\n\nUnwinding a deeply-embedded culture\n\nIn the decades following World War Two, Japan's rapid economic rebuild entrenched a work-first culture that prioritised output, endurance and company loyalty.\n\n\"There was no upper bound to your work hours. And so literally, we had people that were working to death,\" Ono says.\n\nMore than five decades since the first documented case of karoshi, Japan records thousands of compensation claims for death and illness linked to excessive work each year, according to government data, including cases involving stroke, heart disease, mental health issues and suicide.\n\nRecognised cases of karoshi linked to heart or brain failure have declined over the past decade, according to data from Japan’s health ministry, but a record number of people applied for mental health-related compensation in 2024.\n\nAlong with cost of living pressures, stagnant wages and entrenched gender roles, Japan's strenuous work culture is widely blamed for making it difficult for young people to raise families, exacerbating the country's perennially low birthrate.\n\nIn a bid to remedy that, the Tokyo Metropolitan Government introduced a flexible work system in April that gives employees the option to work four days a week while maintaining the same total working hours over a four-week period.\n\nGovernment figures show that working hours for full-time employees declined sharply in 2019, the year that work reforms were legislated, while uptake of paid leave started to rise.\n\n\"The work-style reform act of 2019 seems to have had some impact in improving the quality of life and quality of work in Japan,\" Ono says.\n\nFull-time employees in Japan receive a legal minimum of 10 to 20 days of annual leave, depending on length of service. The 2019 reforms stipulated that employers ensure workers take at least five days of paid leave a year.\n\nA generational shift\n\nOno, who is in his 50s, says his generation \"didn't ask questions\" and stuck to the status quo when it came to work.\n\n\"There is definitely a significant generational divide,\" he says. \"Younger people these days definitely value their personal time, and they're very much against this long-working-hour culture.\"\n\nSimilarly, Kitada, 57, who now works as a producer for SBS Japanese, says young people in Japan have the courage to \"speak up more than my era\".\n\nReflecting on how she used to work, she says it's \"really crazy\" to think about.\n\n\"But at that time, it's normal, because everybody worked the same way.\"\n\nYoshida, a millennial working in supply chain management, says her work hours are pretty flexible, and she's rarely expected to do overtime.\n\nShe believes younger generations are more broadly aware of their entitlements and prioritise work-life balance.\n\n\"I think younger people are not afraid to speak up to their bosses, and they don't mind being judged for [it],\" she says.\n\nThis is our boundary.\n\nThis story was produced in collaboration with SBS Japanese, with additional reporting from Kate Onomichi.\n\nReaders seeking crisis support can contact Lifeline on 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25).\n\nMore information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/big-thirsty-and-willing-to-do-anything-for-water-australias-camel-chaos/z2m228vl8",
        "title": "Big, thirsty, and 'willing to do anything' for water: Australia's camel chaos",
        "publish_date": "Sat, 31 Jan 2026 19:36:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Around 600 feral camels in central Australia have been culled this week following an emergency meeting to overcome the animals wreaking 'havoc' in remote communities.\n\nA dry spell has led to large herds coming into Indigenous communities as they search for water, damaging mains and fences in their path.\n\nWorking as an area manager for MacDonnell Regional Council, Damien Ryan has experienced the issue firsthand.\n\n\"One morning last week, there was a leak off one of the buildings ... there were 80 camels clambering to get that little bit of water,\" he said.\n\n\"They just walk through six-foot-high security fences and they knock the taps off the outside walls ... they will break water mains a metre underground just to get to water.\"\n\nDamien Ryan says the camels are very destructive and a large cleanup will be required. Source: Facebook\n\nThis month, a dozen homes in the community of Mount Liebig — about 320km west of Alice Springs — were left without a water supply due to the damage, on days over 40C.\n\n\"There's a big cleanup operation,\" Ryan said.\n\nAs many as 800-1000 camels travelling in one direction — known as a 'camel train' — have been reported by residents, spanning 5km in length near Mount Liebig and Papunya.\n\nAccording to government assessments, this can happen in summer or during droughts, when herds congregate.\n\nWe're talking about large bull camels weighing hundreds of kilos that just want water and they're willing to do anything. NT Environment Minister Josh Burgoyne\n\nBurgoyne said the issue has caused \"absolute havoc\".\n\n\"Imagine waking up one morning and seeing hundreds of camels in your local community, and they can get quite aggressive\", he said.\n\nRyan said when water sources dry up, the camels \"smell water\" and find what they can.\n\n\"I've lived in central Australia all my life. They're some of the biggest camels I've ever seen,\" he said.\n\nThe Arabian camel, which is the only species found feral in Australia, weighs between 450 and 650kg. Source: Supplied / Damien Ryan\n\nA joint taskforce has been set up between the NT government, MacDonnell Regional Council and the Central Land Council (CLC), which approved a three-day aerial cull this week to assist.\n\nThe CLC says around 150 camels are being killed each day once they're moved from exclusion zones such as communities, outstations and roads.\n\nWhen rain returns, they disappear 'like fairy floss'\n\nCamels were first introduced to Australia in 1840, and by 2008, around one million of them were roaming the arid lands of Western Australia, the Northern Territory, South Australia and Queensland.\n\nAccording to a State of the Environment report by the federal government, the Australian Feral Camel Management Project between 2008 and 2013 removed more than 160,000 camels, at a cost of $19 million.\n\nThe project also supported the development of a commercial feral camel industry and contributed to a reduction of the feral population to around 300,000.\n\nThe distribution of feral camels in Australia in 2008. (Sourced: Australia State of Environment Report 2016) Source: Supplied\n\nExperts say a severely dehydrated camel can drink 100 litres of water in ten minutes.\n\nAs soon as rain returns, Ryan said the camels move on.\n\n\"Saturday night we got a little rain and Sunday night we got a good storm, and next morning the camels had disappeared like fairy floss,\" he said.\n\n\"The issue still stands, there are thousands of camels now, the camel experts say between seven and nine years, the herd doubles.\"\n\nLarge herds of camels in Mount Liebig have caused damage to fencing and water infrastructure. Source: Supplied / NT Government\n\nCalls for federal support\n\nBurgoyne says the NT government is doing what it can, but thinks \"the emphasis has really gone off\" solving the problem, calling for more money to undertake larger-scale culls.\n\n\"Local councils are quite literally having to hunt these camels out in the morning so that the communities can be safe,\" he said.\n\nYou imagine in Sydney or Melbourne, if a mob of feral camels came in, dug up the local water supply and residents were without water for a week or two, I think we would see absolute outrage.\n\nThe federal government said states and territories have primary responsibility for the management of invasive species.\n\nA Department of Climate Change, Energy, the Environment and Water spokesperson said in a statement: \"Through the Saving Native Species program, the Australian Government has invested over $4.9 million in two projects delivered by the Northern Territory Government and Central Land Council.\"\n\n\"These projects aim to improve the habitat and help threatened species recover in the MacDonnell Ranges and include activities such as feral camel control.\"\n\nSafety and looking after animal welfare\n\nThe Central Land Council (CLC), which represents 90 elected Aboriginal men and women across southern NT, said there's a need to protect threatened species and country while keeping people safe.\n\nCLC representative Mischa Cartwright told SBS News the council culled more than 1,400 camels in 2025.\n\n\"There's really no other options than to go through a humane culling process,\" she said.\n\n\"I think communities, as long as they're consulted properly as part of that project, they're quite comfortable ... because it is about protecting our certain species in our country and the safety of our communities as well.\"\n\nConcerns have also been raised about the animals' welfare as local governments can't turn on water for huge numbers of camels.\n\n\"There maybe needs to be some outlying water points in the future for camels in that situation. And when I say outlying, they need to be a fair way away from communities,\" Ryan said.\n\nRyan has seen camels get stuck, as damaged water taps leak and make the ground muddy.\n\nDamien Ryan says camels are often found bogged in muddy ground after water taps are damaged. Source: Facebook / Tash Hughes\n\n\"They're perishing because of no water,\" he said.\n\n\"No matter what amount of pulling and tugging, we are not always successfully getting them out alive. They're stuck in the mud and it's very dangerous. They'll swing their head around, they'll give you a good old bite, they can damage you.\n\n\"Camel populations are not going to disappear and hopefully there's a business opportunity for somebody, but you can't create a business opportunity when the crisis starts. You need to do that well before.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-open-2026-rybakina-beats-sabalenka-to-claim-maiden-australian-open-title/gp86h754e",
        "title": "Australian Open 2026: Rybakina beats Sabalenka to claim maiden Australian Open title",
        "publish_date": "Sat, 31 Jan 2026 11:53:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Elena Rybakina has upstaged two-time champion Aryna Sabalenka to shed her tag as a one-slam wonder with a high-octane Australian Open final triumph in Melbourne.\n\nAvenging her lost to the Belarusian in the 2023 title decider, Rybakina roared from a service break down in the deciding set to deny Sabalenka in three sets on Saturday night to add the Open crown to her 2022 Wimbledon trophy.\n\nThe fighting victory completed a rare golden double after the big-hitting Kazakh also defeated the top-ranked Sabalenka in last year's prestigious season-ending championship in Saudi Arabia.\n\nAfter taking out world No.2 Iga Swiatek and the sixth-ranked Jessica Pegula on her charge to the final, Rybakina is the first woman since Naomi Osaka in 2019 to claim the Daphne Akhurst Memorial Cup with three consecutive wins over top-10 rivals.\n\nRunner up Aryna Sabalenka of Belarus holds her trophy after losing the women’s singles final against Elena Rybakina of Kazakhstan. Source: AAP / Joel Carrett\n\nWith rain hitting Melbourne for the first time all tournament, the match was played under a closed roof on Rod Laver Arena, creating perfect indoor conditions for the women's game's two heaviest hitters.\n\nSabalenka and Rybakina were the first duo to joust for the title after contesting the season-ending final showpiece since Martina Hingis beat Lindsay Davenport in 1999.\n\nThe championship climax shaped as an intriguing showdown, with neither powerhouse combatant dropping a set en route to the final and Sabalenka shading their head-to-head record 8-6 and boasting a phenomenal 26 wins from her past 27 matches at the Open.\n\nBut the queen of Melbourne Park was taking on a fearsome foe who had won 19 of her past 20 matches herself and, among active players, only veteran former world No.1 Venus Williams boasts more wins over Sabalenka than Rybakina.\n\nUnder seige\n\nAnd the world No.1 was quickly under siege.\n\nWith booming groundstrokes, fifth-seeded Rybakina broke Sabalenka in the opening game of the match, then held to love in a clear early statement.\n\nRybakina was in trouble at 15-40 in the eighth game but fired down four huge serves to hold for 5-3 before coolly closing out the set.\n\nThe first woman since Hingis in 2002 to appear in at least four straight AO finals, Sabalenka had several opportunities to hit back early in the second set but squandered three break points in a 10-minute second game.\n\nSabalenka finally nabbed her first break of the match with Rybakina serving to stay in the second set at 4-5, the top seed levelling the contest after an hour and 25 minutes.\n\nFittingly, the first two women to clash in the final without having lost a set in the tournament since Kim Clijsters and Justine Henin in 2008 headed into a decider.\n\nSabalenka appeared on course for victory after surging to a 3-0 lead, only to dump a backhand into the net to allow Rybakina back on serve.\n\nThe lapse led to the world No.1 mentally unravelling as the Kazakh reeled off four straight games and sealed victory with an ace on her first match point after two hours and 18 minutes.\n\nWhile the 26-year-old rejoiced in becoming a dual grand slam champion, Sabalenka was left to digest suffering back-to-back finals defeats after also losing last year's title decider to Madison Keys.\n\nAs well as walking off with the trophy, Rybakina pocketed a monster cheque for $4.15 million and can look forward to a rankings rise to world No.3 on Monday.\n\nNo luck for Aussie doubles pair\n\nEarlier on Saturday, the Australian pair, Jason Kubler and Marc Polmans lost the Australian Open men's doubles final.\n\nKubler, partnering with fellow Australian Marc Polmans as plucky wildcards, went down against sixth seeds Christian Harrison and Neal Skupski in two sets in Saturday's tournament decider.\n\nBetter luck next time for Australian Open men's doubles runner-up, homegrown heroes Jason Kubler and Marc Polmans. Source: AAP / Joel Carrett\n\nBecoming the fifth British man to win multiple major doubles titles, former No.1 Skupski defied nerves to serve out the match.\n\nIt ends an unforgettable fortnight for newly engaged pair Kubler and Inglis, who between them have pocketed a life-changing $902,350.\n\nIf Kubler and Polmans had won the doubles final, that figure would have ballooned to a combined $1.27 million.\n\nKubler was vying for his second Australian Open men's doubles crown after teaming up with Rinky Hijikata to win the 2023 final.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/first-tuvaluans-arrive-in-australia-under-the-new-falepili-treaty/fzy0g06j7",
        "title": "Thousands applied for this world-first visa. Now the first have arrived in Australia",
        "publish_date": "Sat, 31 Jan 2026 08:12:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Manuellas are one of the first families to arrive in Australia under a new treaty with Tuvalu, as rising sea levels threaten their homeland.\n\nHailed as a global first, each year 280 people from the Pacific Island nation can now relocate to Australia thanks to a special visa program, created under the terms of the Falepili Union treaty between the two countries.\n\nThe visa was partially designed to assist those on the front-line of climate change and rising sea levels.\n\nHowever, with a small Tuvaluan diaspora here, those like the Manuella family will face challenges to settle while maintaining a connection to their community and culture.\n\nTwo weeks ago, Telieta and Kaumaile arrived in Melbourne with their four children.\n\nLISTEN TO First cohort of migrants under Tuvalu deal arrive in Australia SBS News 05:48 English\n\n\"It’s a new home and it’s a new journey ... Tuvalu will always be in our heart and our home, but Australia is another new chapter to our family journey,\" Telieta said.\n\nShe worked for Tuvalu's department of labour, while her husband Kaumaile was in the government's public works department with a background in architecture.\n\nThe couple are among the more than 8,700 people to apply for the Falepili Mobility Pathway visa, which grants permanent residency to those chosen.\n\n\"We came to the conclusion that in case we were selected, it would be a good opportunity in terms of better life, better education for our children, better job opportunities,\" Telieta said.\n\nThe prospect of being chosen was a one in more than 30 chance.\n\nREAD MORE Why over a third of this nation's citizens want to migrate to Australia\n\nKaumaile recalled the moment he heard the news that his family had been successful.\n\n\"It was funny, I was in the shower and then came out of the room, and my wife was on the phone. I saw her face was like changing, it was like surprised. So I said 'oh, what happened?' and I thought something happened to her family or relative. But actually she just told me that we got an email saying that we'd been selected.\"\n\nPermanent residency granted\n\nProfessor Jane McAdam, director of the University of New South Wales' Evacuations Research Hub, explains the visa doesn't require applicants to have work or study plans already arranged.\n\n\"It provides opportunities for what we call livelihood diversification, it enables kids to go to school in Australia, for people to acquire further skills and training which they might want to use here, but equally might want to take back to Tuvalu,\" McAdam told SBS News.\n\n\"I think that's why this is something that the Tuvaluan government actually requested from Australia, because it sees it as embedding that skills diversification, that broader opportunity for remittances to be sent back to Tuvalu to support the economy there, rather than this being a one-way street for people to leave Tuvalu.\"\n\nThe Tuvaluan diaspora in Melbourne is small but tight-knit, and the Manuellas consider themselves lucky to be staying with their relative, Niuelesolo Boland, who is deeply involved with the community.\n\nBoland believes the government could do more to help new arrivals settle in Australia.\n\n\"I think it's falling back on the Tuvaluan diaspora in Australia to pick up the burden,\" he said.\n\n\"Like a lot of them are looking at forms like 'what is this?' you know? Coming from Tuvalu, where we don't even have tax file numbers, you know? Or a Medicare scheme. So to them it's totally foreign.\"\n\nIs random selection a concern?\n\nWhile the Falepili Mobility Pathway has proven hugely popular in Tuvalu, some experts have taken issue with the random nature of the visa ballot system.\n\nDr Yvonne Su, from Harvard University's School of Public Health, points out that the visa was partially designed to assist those on the front-line of climate change and rising sea levels.\n\n\"Climate change is not random. Climate change doesn't just happen to anybody, unfortunately,\" she told SBS News.\n\n\"So, because climate change is not by chance, it frightens me that we've allowed the people on this visa, that I have to say has been branded with climate change resilience as a big part of it, and saying climate mobility and saying you're protecting them from climate change as a big part of it, you're saying that could be by chance.\"\n\nFederal Minister for Pacific Affairs, Pat Conroy, said the random selection of the ballot was critical to ensure Tuvalu avoided brain drain, the large-scale emigration of highly skilled and educated individuals.\n\n\"If you didn't have a ballot system that introduced an element of random selection, in the end the people who would qualify first for this visa would be the people with the highest educational and professional qualifications within Tuvalu, and that would lead to a brain drain,\" he said.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/a-peek-inside-the-long-overdue-glasshouse-theatre-20260202-p5nyu1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A peek inside the long-overdue Glasshouse theatre",
        "publish_date": "Mon, 02 Feb 2026 13:45:40 +1100",
        "category": "entertainment",
        "authors": [
            "Julius Dennis"
        ],
        "text": "Advertisement\n\nNationalQueenslandPerforming arts A peek inside the long-overdue Glasshouse theatre Julius Dennis February 2, 2026 — 1:45pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nBrisbane’s long-awaited new performing arts centre has opened its doors for the first time, revealing a sleek and high-tech arena designed to slip into the existing precinct. Behind the giant curved-class exterior on the second level, golden carpets lead to long, black bars where theatre-goers will order drinks in little plastic cups. Inside, 1500 “rainforest green” seats stretch in front of a wide stage. The room feels intimate despite the scale of the building, which required more than 6300 cubic metres of concrete and 1500 tonnes of steel, along with all that glass. The visually stunning building was four years behind schedule. David Kelly On the stage, automated fly lines and sound shells hover at the ready, replacing hand-run systems at QPAC’s older theatres. Backstage, 79 mirror spaces mean the theatre can easily accommodate larger performances.\n\nAdvertisement\n\nAccording to architect Jayson Blight, who gave a tour to media on Monday, the mission of the building was to blend into the existing centre, not cast a shadow over it. He also said the complex structure of the 217 undulating panes meant they supported themselves. On stage at The Glasshouse. Julius Dennis “There is actually no structure holding up that glass,” he told the crowd, some of whom laughing nervously. Named The Glasshouse after a public survey to choose a moniker, the theatre was meant to open its doors in 2022, but flooding and COVID-19 pushed it back four years.\n\nAdvertisement\n\nStill, Arts Minister John-Paul Langbroek said there was no cost blowout to match, thanks to a $184 million guaranteed construction sum contract with the builder, Lendlease. The Queensland Performing Arts Centre contributed $25 million, with the rest provided by the state, he said. The level foyer behind the bending glass. Julius Dennis “It certainly has taken a long time, but it’s really important to acknowledge that we’re here now, and it’s a wonderful theatre,” Langbroek said. Public Works Minister Sam O’Connor described the issues faced during the project as biblical.\n\nAdvertisement\n\n“We had the floods here in 2022; we had the COVID pandemic prior to that,” he said, as well as laying blame at how “the former Labor government handled the CFMEU”, who had a strong presence on the site throughout the project. Despite that dig, both ministers thanked the more than 2500 workers who brought the theatre to life. “They should all be proud of their efforts to produce what is truly one of the most beautiful buildings in our state,” O’Connor said. QPAC chief executive Rachel Healy said the new 1500-seat theatre — to go along with the 2000-seat Lyric — would attract an extra 300,000 visitors to the arts precinct annually. “The opening of the Glasshouse Theatre will also see us build on our reputation as one of Australia’s most dynamic and popular cultural destinations,” she said.\n\nAdvertisement\n\nAmong the first shows to be performed at The Glasshouse is the April opening of musical The Last Ship, written and performed by Sting, the story of a British community losing their shipyard. The theatre will officially open to the public on March 3. Get alerts on significant breaking news as happens. Sign up for our Breaking News Alert.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/grammys-2026-full-list-of-nominees-and-what-to-expect-at-this-year-s-awards-20260130-p5ny7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grammys 2026: Full list of winners and nominees",
        "publish_date": "Mon, 02 Feb 2026 13:42:52 +1100",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nTrevor Noah’s opening monologue had not even started when Australia’s own Tame Impala, aka Kevin Parker, took home a golden gramophone at the 68th Annual Grammy Awards.\n\nEnd of Summer’s victory in the best dance/electronic recording category was awarded during the pre-telecast Grammys ceremony, and is Parker’s second consecutive Grammy win after his victory in the same category last year for Neverender.\n\nJustin Bieber, Amyl and The Sniffers and Ye will all be part of the 2026 Grammy Awards on Monday, broadcasting live from 12pm AEDT. Sydney Morning Herald\n\nMeanwhile, Melbourne pub rock band Amyl and the Sniffers – who won album of the year during a total domination of the 2025 ARIA Awards – were nominated for best rock performance thanks to U Should Not Be Doing That but lost out to the late Ozzy Osbourne’s protege, Yungblud.\n\nSydney’s Rufus Du Sol’s album Inhale/Exhale also lost out in the best dance/electronic album category, while FKA Twigs emerged victorious with Eusexua.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/grammys-2026-live-updates-kendrick-lamar-chappell-roan-sabrina-carpenter-highlight-nominations-awards-to-start-at-11am-local-time-20260129-p5ny3z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Grammys 2026 LIVE updates: Justin Bieber performs in silk boxers and socks after four-year hiatus",
        "publish_date": "Mon, 02 Feb 2026 13:42:13 +1100",
        "category": "entertainment",
        "authors": [
            "Bronte Gossling",
            "Nell Geraets",
            "Robert Moran",
            "Damien Woolnough",
            "Lauren Ironmonger"
        ],
        "text": "Melbourne’s own Rosé and Bruno Mars, in rock-star mode, open the show with a particularly Blues Brothers-ish take on their smash APT (I guess Bruno is the Belushi?). At least Billie Eilish is bouncing around in the front row.\n\nRosé, left, and Bruno Mars perform APT. Chris Pizzello/Invision/AP\n\nComedian Trevor Noah, somehow back to host his sixth consecutive (and, he promises, final) Grammys, gets the ceremony going with a gag comparing APT, the Korean drinking game, with its US equivalent. “Every time we turn on the news, we take a drink,” he jokes.\n\nHe takes a walk through the audience, shouting out stars including Pharrell and Tyler, The Creator. “I feel like I’m at Jeff Bezos’ wedding, but with way more black people,” he says.\n\nLoading\n\nJustin Bieber, at his first Grammys since 2022, looks nervous when Noah heads his way. But he keeps the jokes mild, congratulating Bieber and partner Hailey on their child and requesting a discount voucher for her make-up line Rhode.\n\nHis monologue is political-lite. He shouts out Olivia Dean for fighting Ticketmaster’s ticket prizes, and calls Doechii’s Anxiety the US’ new national anthem.\n\nHe even gets an applause when he announces that Nicki Minaj, who’s been recently red-pilled, isn’t at the show. “She is still at the White House with Donald Trump,” he says, doing an impression of them comparing their arse sizes. I feel Trump would love that one.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/olivia-dean-speaks-out-about-immigrants-in-grammy-speech-20260202-p5nyvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Olivia Dean speaks out about immigrants in Grammy speech",
        "publish_date": "Mon, 02 Feb 2026 13:39:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/trevor-noah-roasts-celebrities-at-the-grammys-20260202-p5nyv8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trevor Noah roasts celebrities at the Grammys",
        "publish_date": "Mon, 02 Feb 2026 13:35:15 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Trevor Noah roasts celebrities at the Grammys\n\nTrevor Noah did not hold back as host of the Grammys with his opening monologue poking fun at Jeff Bezos, the Beibers and Nicky Minaj.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/moment-that-decided-one-of-the-all-time-great-super-bowls-20260202-p5nyvw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Moment that decided one of the all-time great Super Bowls",
        "publish_date": "Mon, 02 Feb 2026 13:33:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Moment that decided one of the all-time great Super Bowls\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-fall-as-wall-street-retreats-20260202-p5nypf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX slumps as gold, silver miners tumble; CBA rises",
        "publish_date": "Mon, 02 Feb 2026 13:25:16 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporter"
        ],
        "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX slumps as gold, silver miners tumble; CBA rises Staff reporter Updated February 2, 2026 — 1:25pm ,first published February 2, 2026 — 5:20am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has extended its opening losses to be sharply lower at lunchtime, with shares exposed to gold and silver tumbling after the prices of the precious metals plunged over the weekend. Wall Street had an unsteady session on Friday. AP The S&P/ASX 200 was down 81.5 points or 0.9 per cent at 8787.6 in early trading, with six of 11 industry sectors lower. The Australian dollar lost ground as the US dollar rallied following President Donald Trump’s nomination of Kevin Warsh to be the next Federal Reserve chair. The Aussie was trading at US69.57¢ at 12.33pm AEDT. Also on the agenda for local investors is the Reserve Bank’s interest rates decision on Tuesday, with markets expecting the central bank to unveil its first rise in more than two years. In early trade, precious metal miners were battered with gold giants Northern Star (down 7.9 per cent), Evolution Mining (down 6.3 per cent) and Newmont (down 8.4 per cent) tumbling. Silver players also fell sharply with South32 losing 4.2 per cent. The falls came after the price of gold dropped 11.4 per cent to settle at $US4745.10 per ounce on Saturday. Gold’s price suddenly lost momentum following a tremendous rally where it roughly doubled over 12 months. It topped $US5000 for the first time last week and was trading at around $US5600 at one point. Silver, which had been on a similar, jaw-dropping tear, fell even more. It plunged 31.4 per cent.\n\nAdvertisement\n\nRelated Article US politics Trump taps former Federal Reserve insider to replace Powell “The total collapse in precious metals prices shows that any market can become gripped by mania,” Kyle Rodda, a senior analyst at Capital.com, wrote in a note. “Given the build-up of positioning and leverage involved, the sell-off is bleeding into other markets. Effectively, a deleveraging is happening.” Other mining stocks retreated. BHP lost 2 per cent, Rio Tinto fell 0.4 per cent and Fortescue dipped 0.1 per cent. Financial stocks are mixed, having shed some of their early gains. Commonwealth Bank led the way with a 1 per cent gain, while ANZ Bank added 0.8 per cent and Westpac advanced 0.6 per cent, but National Australia Bank fell 0.5 per cent. Energy stocks slid as oil prices retreated. Woodside Energy lost 0.8 per cent, Santos shed 2.2 per cent and Ampol dipped 0.1 per cent in early afternoon trade.\n\nAdvertisement\n\nElsewhere, the founder and managing director of the embattled Corporate Travel Management, Jamie Pherous, is stepping down with immediate effect, months after trading in its shares was halted and following a scandal over alleged over-charging of government clients. Over the weekend, financial markets churned as investors tried to figure out what Trump’s new nominee to lead the Federal Reserve would mean for interest rates. US stocks fell, with the S&P 500 down 0.4 per cent after sinking as much as 1.1 per cent earlier in the day. The Dow Jones dropped 179 points, or 0.4 per cent, and the Nasdaq composite lost 0.9 per cent. Whoever leads the Fed has a big influence on the economy and markets worldwide by helping to dictate where the US central bank moves interest rates. Such decisions lift or weigh on prices for all kinds of investments, as the Fed tries to keep the US job market humming without letting inflation get out of control. Trump has been pushing for lower interest rates, which usually help goose the economy but can also cause higher inflation.\n\nAdvertisement\n\nThe longtime assumption has been that the Fed should operate separately from the rest of Washington so that it can make moves that are painful in the short term but necessary for the long term. To get inflation down to the Fed’s goal of 2 per cent, for example, may require the unpopular choice to keep interest rates high and grind down on the economy for a while. Kevin Warsh has been a supporter of lowering interest rates. Bloomberg The big question is what Warsh’s nomination, which still requires approval from the Senate, means for the Fed’s independence. Warsh used to be a governor on the Fed’s board, so investors are familiar with him. That could also mean Warsh is familiar with and hopes to continue the institution of the Fed as an independent operator. And while with the Fed, Warsh criticised the central bank’s buying of bonds to keep interest rates low. Some on Wall Street took Warsh’s nomination as an encouraging signal for a still-independent Fed that will keep rates high, if necessary. Besides slowing the economy, higher interest rates would push downward on stock prices.\n\nAdvertisement\n\nBut Warsh has also recently been critical of the Fed’s current chair, Jerome Powell, and has voiced support for lower rates. Helping to limit the market’s losses was Tesla, which rose 3.3 per cent. It bounced back after dropping on Thursday despite delivering better profit reports for the latest quarter than analysts expected. Related Article Opinion\n\nFederal Reserve Trump will be seeing red as the Fed refuses to bow down Stephen Bartholomeusz Senior business columnist Apple added 0.5 per cent after the iPhone maker reported a stronger profit for the latest quarter than analysts expected. With AP, Bloomberg The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/dalaroo-sharpens-greenland-critical-minerals-play-20260202-p5nyvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dalaroo sharpens Greenland critical minerals play",
        "publish_date": "Mon, 02 Feb 2026 13:24:05 +1100",
        "category": "finance",
        "authors": [
            "Rowena Duckworth"
        ],
        "text": "Advertisement\n\nBusinessCompaniesBulls N' Bears Dalaroo sharpens Greenland critical minerals play Rowena Duckworth February 2, 2026 — 1:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDalaroo Metals has moved a step closer to de-risking its Blue Lagoon critical minerals project in southern Greenland after confirming the discovery of a zircon-dominated heavy mineral system, just as Western governments are scrambling to secure alternative supply chains outside China. Geochemical analysis results from surface and shallow auger sampling obtained during the company’s maiden 2025 field program have landed in Dalaroo’s inbox, and have confirmed a strong, consistent correlation between zirconium and hafnium - a textbook signature of zircon-hosted mineralisation. Lagoon and shoreline sediments at Dalaroo Metals’ Blue Lagoon critical minerals project in south-west Greenland. The tight relationship suggests the heavy minerals are being naturally concentrated within lagoonal and shoreline sediments, pointing to a laterally continuous system that has already been upgraded by nature through mechanical processes. Dalaroo believes natural sedimentary and hydraulic processes have done much of the beneficiation work upfront. Wave action and shoreline sorting have concentrated dense, chemically resistant minerals into near-surface traps.\n\nAdvertisement\n\n‘These results represent an important step in systematically de-risking the Blue Lagoon project.’ Dalaroo Metals chief executive officer John Morgan The strong zirconium–hafnium correlation also delivers a practical exploration advantage. The zirconium mineralisation is proving to be a practical pathfinder element, enabling handheld X-ray Fluorescence (XRF) surveys for rapid, real-time targeting in the field. This geological simplicity could be the key to future development. Heavy mineral sands systems are typically shallow, flat-lying and amenable to straightforward gravity separation. These factors can lead to shorter, cheaper development timelines, coupled with reduced technical risk compared to many hard-rock critical minerals projects. Notably, the zirconium–hafnium relationship shows up across multiple sample types and locations, supporting the company’s view of a broad, sedimentary heavy mineral system rather than isolated or structurally controlled occurrences - a level of consistency that materially de-risks the project at an early stage. Recent surface samples have thrown up 0.81 per cent total rare earth oxides (TREO), alongside consistently high-grade zirconium oxide reaching up to 4.42 per cent. The project has also returned substantial hafnium grades up to 99 parts per million (ppm) hafnium oxide.\n\nAdvertisement\n\nThe project was secured by Dalaroo Metals Limited just a month ago and its initial work — the first systematic exploration since the late 1970s — has outlined a 2.7km strike zone with standout critical mineral grades, pointing to a potential district-scale rare earth elements and zirconium discovery. Zirconium and hafnium are both listed as critical minerals due to their roles in advanced manufacturing, aerospace, defence technologies and nuclear applications. Hafnium, in particular, is prized for its use in semiconductors, nuclear control rods and high-temperature alloys, and currently trades at a whopping AU$17,000 per kilogram. Zirconium, meanwhile, is essential in ceramics, refractories and nuclear fuel cladding. Blue Lagoon also holds a promising rare earths inventory, dominated by the prized elements dysprosium and terbium - critical for the manufacturing of strong, permanent magnets used in electric vehicle motors, wind turbine generators, and other renewable technologies. Crucially, uranium and thorium analyses have remained low and are well below Greenland’s mandated 100ppm threshold, smoothing the regulatory path to any future development. Greenland has emerged as a focal point for Western critical minerals strategy, sitting within NATO territory and increasingly viewed as a stable, transparent jurisdiction capable of supplying zirconium, hafnium and rare earth elements into allied markets.\n\nAdvertisement\n\nDalaroo’s wholly owned Blue Lagoon project sits in the south-west corner of Greenland, well below the Arctic Circle and within the Gardar Alkaline Province, which is a globally recognised belt prospective for zirconium, niobium, hafnium and rare earth elements. Dalaroo Metals chief executive officer John Morgan said: “These results represent an important step in systematically de-risking the Blue Lagoon project. Confirming zircon as the dominant host mineral provides confidence that heavy mineral concentrations are laterally continuous and potentially amenable to simple gravity processing methods. Heavy mineral systems globally are typically associated with shallow mining, low strip ratios and straightforward beneficiation flowsheets.” Next up, Dalaroo plans to bring in specialist consultants to run detailed mineralogical, metallurgical and process characterisation test work. The program will include heavy mineral separation, automated mineralogical microanalysis (QEMSCAN) and gravity recovery testing. Expanded shoreline sampling, handheld XRF mapping and additional shallow drilling are also on the to-do list. With critical minerals now front-and-centre in Western industrial and defence policy and Greenland firmly in the geopolitical spotlight, Dalaroo’s Blue Lagoon project appears to be shaping up as a strategically located, technically simple and potentially scalable source of minerals the world is increasingly desperate to secure. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/moira-cookie-and-kevin-s-mum-where-to-watch-catherine-o-hara-s-memorable-roles-20260202-p5nyt4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Moira, Cookie and Kevin’s mum: Where to watch Catherine O’Hara’s memorable roles",
        "publish_date": "Mon, 02 Feb 2026 13:14:57 +1100",
        "category": "entertainment",
        "authors": [
            "Jocelyn Noveck"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nNow is certainly not the time for pettifogging. But can we confabulate about the comic brilliance of Catherine O’Hara? These radically arcane words, like so many others, dripped off the gifted comedian’s tongue so silkily as Moira, her singularly eccentric matriarch in Schitt’s Creek, that you laughed well before you wondered what the heck they meant. (For the record: “pettifogging” means to emphasise petty details, and “confabulate” simply means to talk.) But conversely, O’Hara, who died on Friday at 71, could make a ho-hum phrase utterly hilarious. As when she desperately declared, trying a bit of line-cutting in the crowded Beetlejuice Beetlejuice afterlife waiting room, “I have global entry!” And for something even more concise, how about her simple, one-word line reading of “KEVIN!!!” – the child she kept leaving behind in the Home Alone movies? In any case, as Moira would say, don’t be a dewdropper (a lazybones.) Here are some indelible O’Hara roles to catch up on. In Moira, Catherine found \"a character who didn't have to be the same character all the time\". AP Moira in Schitt’s Creek (2015-2020) The commercial Moira Rose films for local vintner Herb Ertlinger’s fruit wine start reasonably well. Until she tries to pronounce the product’s name. “Herb Ervlinger. Erv Herblinger. Bing Liveheinger,” she intones, inebriated, in a virtuosic scene that recalls Lucille Ball in her Vitameatavegamin ad.\n\nAdvertisement\n\nMoira, a career-capping (and Emmy-winning) role in the comedy created by Eugene and son Dan Levy, brought O’Hara legions of new fans – and elevated a new vocabulary. She discovered much of it in obscure wordbooks, she said. O’Hara said she’d created the character by thinking of women married to wealthy men – women who wanted to be seen as special, in their own right. Her unique look included a series of eccentric wigs. “I knew a woman who would have dinner parties at her house and she would keep disappearing and coming back with different wigs. And she would appear like, ‘Tada’ – whatever Moira was feeling on a particular day would dictate what kind of wig she would wear.” Streaming now on Binge. Catherine O’Hara in 2024’s Beetlejuice Beetlejuice, directed by Tim Burton. Delia in Beetlejuice (1988) and Beetlejuice Beetlejuice (2024) Thirty-six years after the first Beetlejuice, Tim Burton returned with a 2024 sequel. Why, you ask? Well, here’s one really good reason: O’Hara. Her Delia Deetz, the narcissistic artist stepmum of Winona Ryder’s Lydia Deetz, was a supporting character who stole the whole show. To sample her comic timing, just take the quick scene where Delia, mounting a gallery show where she herself is the canvas, notifies Lydia: “Your father has left me.” “He’s divorcing you?” Lydia asks.\n\nAdvertisement\n\n“What a horrible thought!” replies a shocked Delia. (Beat). “No, he’s dead.” Stream Beetlejuice on *Stan and HBO Max; and Beetlejuice Beetlejuice on HBO Max. Catherine O’Hara and Macaulay Culkin in Home Alone. Kate McAllister in Home Alone (1990) and Home Alone 2: Lost in New York (1992) OK, motherhood is chaotic. It’s hard to keep track of everything. Things can mistakenly be left at home. A child, even. Once. But, twice? That’s iconic. Editor's pick Review What to stream this week: A delightful Mel Brooks documentary and five more picks On the plane in that first Home Alone movie, Kate tells her husband she has a terrible feeling she’s forgotten something. “Did I turn off the coffee?” “Did you lock up?” And then, the awful realisation: “KEVIN!” Kate had changed her hair into a stylish bob – but apparently hadn’t updated her mothering skills – two years later when, in the sequel, Kevin was again discovered missing, at the Miami airport. This time, O’Hara’s “KEVIN!” was squealed at a high pitch – accompanied by her falling backwards, unconscious.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/ctm-ran-asylum-seeker-barges-for-the-uk-now-its-ceo-has-quit-20260202-p5nys9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CTM ran asylum seeker barges for the UK. Now its CEO has quit",
        "publish_date": "Mon, 02 Feb 2026 13:07:12 +1100",
        "category": "finance",
        "authors": [
            "Colin Kruger"
        ],
        "text": "Advertisement\n\nUpdated BusinessCompaniesExecutive shake-up CTM ran asylum seeker barges for the UK. Now its CEO has quit Colin Kruger Updated February 2, 2026 — 1:07pm ,first published February 2, 2026 — 10:19am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe founder of the embattled Corporate Travel Management (CTM), Jamie Pherous, is stepping down with immediate effect with the company’s shares remaining suspended after the group admitted overcharging clients, including the UK government, as much as $160 million. CTM told the ASX on Monday morning that Pherous would retire as chief executive and board member, with chief commercial officer Ana Pedersen to act as chief executive of the travel agency while a permanent replacement is found. Pherous, also the group’s second-largest shareholder, will move to an “advisory role” under a six-month consulting agreement with the company. CTM boss Jamie Pherous is retiring amid a long-term suspension of the company’s shares. Attila Csaszar Chairman Ewen Crouch said the board had determined now was the “appropriate time to accelerate the transition to a refreshed corporate structure”, while acknowledging the problems the company had faced. Crouch acknowledged the need for change given the scale of the scandal, which will cost investors dearly, but avoided laying any blame at the feet of CTM’s charismatic founder, who started the business more than three decades ago.\n\nAdvertisement\n\n“We recognise his impact, but as a board, must also focus on the evolution of the business,” Crouch said. “Clearly, we have let shareholders down over recent months. We understand that, and we’ve heard first-hand their deep frustration. It’s important that we learn from these events and create a strong and sustainable structure that can help us restore trust in the business.” CTM chairman Ewen Crouch, pictured in 2016. Louie Douvis Crouch would not give speculate on whether CTM would be in a position to release the 2025 financial year accounts before the current financial year ends on June 30. “There is confidence that we will complete the process to enable the company to relist. I cannot give you a specific date,” Crouch said.\n\nAdvertisement\n\nCTM shares have been suspended for months, after the company last year flagged minor accounting issues that then ballooned into massively overcharging the UK government for services including housing asylum seekers on large-scale barges including the controversial Bibby Stockholm. Related Article Opinion\n\nScandal The pitchforks are out for this Aussie travel company Elizabeth Knight Business columnist The company had previously told the ASX that these asylum seeker contracts would be worth $3 billion over several years, but the controversy over asylum seekers in the UK, and a change of government, led to abrupt changes to the deal. CTM’s woes have raised concerns it was charging too much to house the asylum seekers in hotels across the UK under contracts arranged by the former Conservative government. According to UK reports, CTM has won £3.9 billion ($7.7 billion) in public sector contracts over the past decade. The company also holds the contract for managing Australian government travel until 2027. Finance Minister Katy Gallagher confirmed that CTM agreed to an independent audit of its business in the light of the overcharging claims.\n\nAdvertisement\n\nPedersen, CTM’s acting chief executive, said: “It’s been made public what the Australian government is intending on doing, and we’re working very closely with them, and that process will commence very shortly.” That deal to manage Australian government travel has not been implicated in the overcharging scandal and there is no suggestion Pherous was involved in the broader issues. CTM had a market valuation of $2.35 billion when shares last traded, but some analysts have halved their value of the stock and one investor has written off its valuation entirely. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/myers-claims-mile-victory-in-nyc-20260202-p5nyvg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Myers claims mile victory in NYC",
        "publish_date": "Mon, 02 Feb 2026 12:58:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Myers claims mile victory in NYC\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/trevor-noahs-joke-with-kendrick-lamar-20260202-p5nyve.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trevor Noah's joke with Kendrick Lamar",
        "publish_date": "Mon, 02 Feb 2026 12:56:24 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/brutal-warning-ahead-nats-spill-231034074.html",
        "title": "‘So be it’: Brutal warning ahead of Nats spill",
        "publish_date": "2026-02-02T02:35:19Z",
        "category": "finance",
        "authors": [],
        "text": "A senior Nationals MP expects David Littleproud will survive an impending leadership spill, as it is confirmed Coalition reunification is on the agenda ahead of a crucial party room meeting.\n\nSlated for this afternoon, the leadership challenge has been brought on by Liberal National Party MP Colin Boyce to protest Mr Littleproud’s decision to walk the minor party away from the Coalition.\n\nBut to successfully move the spill motion, Mr Boyce requires it to be seconded by another MP or senator in the party room, and this will be part of the Flynn MP’s biggest roadblock to ousting Mr Littleproud.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn the days since the move was announced, several high-profile Nationals members – including deputy leader Kevin Hogan, senator Bridget McKenzie, and leadership rival Matt Canavan – confirmed they would back the leader on a ballot against Mr Boyce.\n\nFormer Nationals leader Michael McCormack also told the ABC on Monday the leader ‘has the numbers’ to survive a spill.\n\nDavid Littleproud’s leadership is secure, Michael McCormack says. Picture: NewsWire / Martin Ollman\n\nAside from the spill, another item on the meeting’s agenda is restoration of the Coalition, with a motion due to be brought by Gippsland MP Darren Chester, he confirmed in an online statement.\n\n“It will take a united Coalition team to develop the sensible policies which respect individual choice in Australian families and deliver a safer, stronger, fairer Australia, where everyone can get ahead,” he wrote.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nReunifiying the Coalition is also a key driver of Mr Boyce’s leadership threat, having earlier claimed the reason behind the spill was not a desire for the top job but an urgent need for the Liberals and Nationals to reconcile.\n\nThe two parties broke the historic alliance in January for the second time under Mr Littleproud’s watch.\n\nAhead of the vote on Monday, Mr McCormack was hesitant to predict whether the spill motion would proceed.\n\nMr Littleproud walked his party away from the Coalition over a dispute on Labor’s hate speech laws. Picture: NewsWire / Sarah Marshall\n\n“That I’m not sure … but if it goes ahead, then so be it. That’s democracy. Anybody’s entitled to put their hands up and we’ll have to see how it plays out,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I know that Colin (Boyce) is a bit unhappy at the moment with how things are going.\n\n“I think David Littleproud has the numbers. I think he’s got the security there, so we’ll just have to see what transpires.”\n\nMr McCormack also believed the Coalition should unify within the next two days but said he did not know what the chances were of that happening.\n\nLater, he added the Liberals and Nationals could not continue the toxic infighting that had ultimately led them to this predicament.\n\n“People need to know that we’ve got their back, and we do have. We absolutely do have. But we need to listen to their concerns … and stop talking about ourselves and get back together and keep this government, this bad government, to account,” he said.\n\nLNP MP Colin Boyce claimed the Nationals are ‘committing political suicide by removing itself from the Coalition’. Picture: NewsWire / Gary Ramage\n\nHis comments come ahead of the first sitting week of the year where the divided Liberals and Nationals will be forced to reconcile a troubling new political reality.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen the House of Representatives and Senate resume this week, the Nationals will sit on the cross bench, separate from the Liberal Party for the first time since the 1980s, as they are no longer part of the opposition.\n\nBoth the Nationals and the Liberals have been engulfed in chaos after Mr Littleproud walked the junior Coalition partner away from the alliance earlier this month.\n\nThe relationship shattered after Mr Littleproud, along with 10 other National Party frontbenchers, resigned from Opposition Leader Sussan Ley’s shadow ministry and branded a Liberals-Nationals alliance “untenable”.\n\nThe move is proving to be increasingly catastrophic for both parties, as polls find conservative voters are instead flocking to populist party One Nation amid the rampant instability of the Liberals and Nationals.\n\nWhile One Nation is not a party of government – it only holds one seat in the House of Representatives, won by Barnaby Joyce during his time with the Nationals – its surge in polling popularity raises troubling signs for the former Coalition partners.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/grace-tame-abuser-unlikely-face-012500673.html",
        "title": "Grace Tame abuser unlikely to face cybercrime trial",
        "publish_date": "2026-02-02T02:12:34Z",
        "category": "lifestyle",
        "authors": [],
        "text": "The notorious pedophile who abused former Australian of the Year Grace Tame when she was a student will likely be declared unfit to face trial on harassment charges.\n\nNicolaas Ockert Bester, a former teacher at Hobart private schools, was found guilty of sexually abusing Ms Tame - later named Australian of the Year - when she was his student in 2011.\n\nHe was also convicted over child exploitation material in 2016 and in 2022 was accused of three counts of using a carriage service to menace, harass or cause offence.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe former teacher allegedly made public posts on social media about and directed at Ms Tame in April, July and August of 2022.\n\nBester's deteriorating health, delays to health assessments and the slow-moving court system has delayed the matter for over three years.\n\nOn Monday, the frail 73-year-old returned to Hobart Magistrates Court, arriving and leaving with the help of a walking frame.\n\nBoth his lawyers and prosecutors agreed there was insufficient evidence to show Bester was fit to stand trial, and that his health was unlikely to improve.\n\nLa Trobe University professor Simon Crowe, enlisted to provide assessments of the abuser's condition, told the court he was previously a \"high-functioning individual\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, he had suffered at least three strokes, a number of falls, a brain clot and other issues in recent months.\n\nFormer Australian of the Year Grace Tame was allegedly subjected to social media harassment in 2022. (Ethan James/AAP PHOTOS)\n\n\"Mr Bester has vascular dementia in my view as a consequence of the cumulative effect of the ... strokes as well as the falls,\" Prof Crowe told the court under questioning from prosecutor Ruth Champion.\n\n\"The likelihood that he could ever come back from this very profound set of brain-impacting events is very, very low indeed.\"\n\nBester's lawyer Todd Kovacic told the court his client was \"not really following\" proceedings.\n\nMagistrate Andrew McKee deferred the matter to February 24, which he said would be \"formalising what I think we all know is going to occur\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile his condition means he is unlikely to have to enter pleas or face trial, the matter is still listed to proceed with a further directions hearing listed for April 8.\n\nNicolaas Bester had two further court dates set despite being unlikely to plead or face trial. (Ben McKay/AAP PHOTOS)\n\nIf the charges are proved beyond reasonable doubt, the magistrate could still impose punishments, such as restraining orders.\n\nBester was released from prison in 2013 after serving one year and nine months for grooming and abusing Ms Tame, then 15, while a teacher at St Michael's Collegiate school.\n\nPrior to his 2022 charges, the 2021 Australian of the Year called out Bester's alleged public and private online harassment on the X social media platform.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"This has been the reality for 12 years now, behind closed doors for my family and me,\" Ms Tame said.\n\nBester, who previously managed The Hutchins School boarding house, also studied for a PhD at the University of Tasmania after his jail term.\n\n1800 RESPECT (1800 737 732)\n\nNational Sexual Abuse and Redress Support Service 1800 211 028",
        "source": "Yahoo"
    }
]