[
  {
    "url": "https://www.9news.com.au/world/study-links-golf-course-pesticides-to-parkinsons-disease-us/b236849a-ec39-4e3d-b443-977a73425243",
    "title": "New study links golf courses to devastating disease",
    "publish_date": "Mon, 12 May 2025 01:07:57 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "A﻿ new study in the US has found a potential link between golf courses and Parkinson's disease.\n\nThe research, published in JAMA Network Open , ﻿found that people living within five kilometres of golf courses are more than twice as likely to develop the devastating neurological illness.\n\nResearchers suspected it was linked to pesticide use across those courses, with the toxic chemicals leaching into the drinking water.\n\nA new study has suggested a link between golf courses and Parkinson's disease. (Getty)\n\n\"﻿This case-control study found the greatest risk of (Parkinson's) within one to three miles (1.6km to 4.8km) of a golf course, and that this risk generally decreased with distance,\" the researchers said.\n\n\"Effect sizes were largest in water service areas with a golf course in vulnerable groundwater regions.\"\n\nHowever, other Parkinson's experts quoted by the UK Science Media Centre said many other factors needed to be ruled out before the disease could be clearly linked to the pesticides.﻿\n\nREAD MORE: Thousands of protected hermit crabs found smuggled in suitcases ﻿\n\nParkinson's is a devastating illness. (Getty)\n\nParkinson's UK research director Dr David Dexter said multiple factors of the study had not been controlled.\n\n\"Firstly, Parkinson's starts in the brain 10 to 15 years before diagnosis and the study didn't only use subjects who permanently lived in the area,\" he said.\n\n\"This would not only affect participants' exposure, but also suggests their Parkinson's could have started before they moved around a golf course.﻿\"\n\nHe also pointed out the study had not analysed the drinking water in the affected areas for pesticide levels.\n\nDeranged priest takes feud with pope to shocking level View Gallery\n\nParkinson's UK research lead Dr Katherine Fletcher said many studies had investigated a potential link to pesticides.\n\n\"The results have been varied, but overall suggest that exposure to pesticides may increase the risk of the condition,\" she said.\n\n\"However, the evidence is not strong enough to show that pesticide exposure directly causes Parkinson's.﻿\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/trump-announces-hell-sign-executive-order-that-aims-to-cut-drug-prices/e460c622-35b9-4d29-a28c-a988c1a5d8c6",
    "title": "Trump announces he'll sign executive order that aims to cut drug prices",
    "publish_date": "Mon, 12 May 2025 01:15:17 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "US President Donald Trump has announced he plans to resurrect a controversial policy from his first term that aims to reduce drug costs by basing payments for certain medicines on their prices in other countries.\n\nHis prior rule, called \"Most Favoured Nation\", was finalised in late 2020 but blocked by federal courts and rescinded by then-President Joe Biden in 2021.\n\nIt would have applied to Medicare payments for certain drugs administered in doctors' offices.\n\nPresident Donald Trump announced on Sunday (local time) that he plans to resurrect a controversial policy from his first term. (Bloomberg)\n\nHowever, it is unclear what payments or drugs the new directive would apply to.\n\nIn a Truth Social post, Trump said he plans to sign an executive order on Monday morning that he argues would drastically lower drug prices.\n\n\"I will be signing one of the most consequential Executive Orders in our Country's history. Prescription Drug and Pharmaceutical prices will be REDUCED, almost immediately, by 30% to 80%,\" he wrote.\n\n\"I will be instituting a MOST FAVORED NATION'S POLICY whereby the United States will pay the same price as the Nation that pays the lowest price anywhere in the World.\"\n\nThe directive comes as the Trump administration is also looking to impose tariffs on pharmaceutical imports, which had been exempted from such levies enacted during the president's first term.\n\nThe tariffs could exacerbate shortages of certain drugs, particularly generic medicines, and eventually raise prices.\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\nIf the new executive order is comparable to the 2020 rule, both Medicare and its beneficiaries could see savings.\n\nBut it could also limit patients' access to medications, experts said.\n\nMuch depends on how the policy is structured.\n\nAlthough lowering drug prices was a major talking point of his first administration, Trump has not focused on the topic as much this term.\n\nAnd his campaign told Politico last year that he had moved away from the \"Most Favored Nation\" model, which many Republicans strongly oppose.\n\nBut the administration revived the idea recently as a potential way to meet deep spending cut targets for Medicaid in the House GOP's sweeping tax and spending cuts package.\n\nThe directive comes as the Trump administration is also looking to impose tariffs on pharmaceutical imports. (AP)\n\nHowever, it's unclear whether the proposal will be included in the legislation, the details of which should be announced shortly, or whether it would be covered by the executive order.\n\nThe initiative will likely face stiff opposition from the pharmaceutical industry, which successfully halted the first iteration.\n\nThe Trump administration introduced the idea of tying Medicare's drug reimbursements to the prices in other countries in 2018 and finalised the rule just after the 2020 election.\n\nThe seven-year model would have allowed the US to piggyback on discounts negotiated by other peer countries, which typically pay far less for medications in large part because their governments often determine the cost.\n\nUnder the 2020 initiative, Medicare would have paid the lowest price available among those peer countries for 50 Part B drugs that are administered in doctors' offices.\n\nThe administration estimated it would have saved about US$86 billion ($133.8 billion).\n\nAt the time, Medicare was barred from negotiating drug prices, but that changed with the 2022 passage of the Democrats' Inflation Reduction Act, which gave Medicare the historic power to bargain over prices for a small number of drugs annually.\n\nA \"Most Favored Nation\" proposal could save beneficiaries' money in their out-of-pocket costs and their premiums, which are both affected by the price of drugs, experts said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/technology/overseas-call-centres-using-ai-to-modify-accents-report-2gb-australia-national-technology-news/18e4c902-2c64-4818-a9c2-1e641e699a30",
    "title": "Overseas call centres using AI to modify accents",
    "publish_date": "Mon, 12 May 2025 01:01:06 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Australian companies are using artificial intelligence ﻿to neutralise the accents of overseas call centre representatives, 2GB has confirmed.\n\nThe technology, developed by US tech start-up Sanas﻿, is being used by call centres to modify accents in real-time to improve communication and minimise complaints.\n\n2GB has confirmed the technology is now being rolled out in Australia after being used in the UK and USA for several months.\n\n﻿\"We shouldn't be surprised that it's proving to be popular because when there's a language barrier or a tricky accent it makes the conversation more challenging,\" 2GB presenter Ben Fordham said on his Sydney breakfast radio show this morning.\n\n\"﻿Now mind you this tech only solves half the problem because the people in the overseas call centres still have to understand us and that Aussie accent can't be the easiest to understand I reckon.\n\n\"Of course we would all prefer if they just had Aussie-based call centre sbut I must say I think it's a smart move, I think it's smart technology, if it makes the conversation easier to understand it's got to be a good thing.\"\n\nFordham said Teleperformance had declined a request for an interview with their chief executive and have not confirmed which Australian companies are using the technology.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/liberals-to-vote-for-new-leader-as-tim-wilson-weighs-up-challenge/bb67be78-60a3-405b-b193-8966626fb368",
    "title": "Tim Wilson considers tilt at Liberal leadership as contest shapes into a three-way battle",
    "publish_date": "Sun, 11 May 2025 22:16:02 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": "But Wilson, who is claiming victory in the Melbourne seat of Goldstein, is shaping as an outside contender after he told\n\nThe Age\n\nhe is considering a tilt for the leader's job.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/meteor-perth-western-australia/4d782e7c-95ce-4701-8e6c-df2ffbaebb9b",
    "title": "'One hell of a meteor' spotted shooting across sky in WA",
    "publish_date": "Sun, 11 May 2025 09:39:31 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": "A blazing meteor has lit up the early morning sky in Perth and across Western Australia .\n\nExperts are now searching to find out if - or where - the meteor landed.\n\nThe spectacle left residents stunned about 6am today.\n\nREAD MORE: Mother held at knifepoint in her home as teens steal car\n\nA blazing meteor has lit up the early morning sky in Perth and across Western Australia. (9News)\n\n﻿It was seen across the state from Kalgoorlie to Mandurah.\n\nMatt Woods from Perth Observatory said it was \"one hell of a meteor\".\n\n\"That was very nice, nice little surprise for Mother's Day,\" he said.\n\nPredictions show the meteor was between the size of a cricket ball and a basketball.\n\n\"It's going anywhere between 16 to 60 kilometres per second, that friction builds up, it melts and that's how we see that lovely green,\" Woods said.\n\nScientists say the meteor seems to have passed over the central wheatbelt but they're not entirely sure where it may have landed.\n\nThat's something they'll work to figure out over the coming days.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/matthew-haylett-recovery-teenager-broke-his-neck-dive-beach-gone-wrong/10c208a0-8445-4c9e-9c5d-d1c4f06f8d9c",
    "title": "Paralysed teen gets inspirational visit after beach dive gone wrong",
    "publish_date": "Sat, 10 May 2025 13:23:41 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A Mindarie teen paralysed in a tragic accident has found new hope through someone who's walked the same path.\n\nSix weeks after the accident at a Perth beach , Matthew Haylett is making a slow but steady recovery, confined to a hospital bed and unable to walk.\n\nToday, Thomas Davison gave him a glimpse of what could be.\n\nREAD MORE: Australian dies after jumping off boat while holidaying in Thailand\n\nParalysed teen Matthew Haylett met Thomas Davison, who has gone through the same situation after accidentally diving into a sandbank at a WA beach. (9News)\n\nHaylett was left in a critical condition after diving into the water at Mullaloo beach, unaware there was a sandbank. (9News)\n\nHaylett was left in a critical condition after diving into the water at Mullaloo beach, unaware there was a sandbank.\n\nNow out of intensive care, the 17-year-old is at Fiona Stanley's State Rehabilitation Centre and learning to move again.\n\n\"He's pushing through no matter what,\" Haylett's mum Megan Larson told 9News.\n\n\"He's still convinced he's gonna walk out of here in six months.\"\n\nToday he met Davison, who's suffered the same fate and given him what he needs most - hope.\n\n\"That's the most I've seen Matthew really laugh and interact,\" Larson said.\n\nDavison broke his spine plunging into a sandbank at Mandurah's Town Beach in 2023.\n\nDavison broke his spine plunging into a sandbank at Mandurah's Town Beach in 2023. (9News)\n\nTwo years on from his own accident, the 17-year-old has defied the odds and is now learning to drive. (9News)\n\nThe incident paralysed him from the neck down.\n\n\"Talking to people in a similar situation to me when I had my accident really helped boost my confidence and give me that hope that I needed,\" Davison told 9News.\n\nTwo years on from his own accident, the 17-year-old has defied the odds and is now learning to drive.\n\n\"I had one goal for myself and that was just to get out of that wheelchair. I've succeeded [with] that now,\" Davison said.\n\nIt's a goal Haylett also wants to reach.\n\nHaylett will stay at Fiona Stanley Hospital for at least the next six months.\n\nHaylett is making a slow but steady recovery, confined to a hospital bed and unable to walk, but Davison's given him much-needed hope. (9News)\n\nAfter that, his family are unsure where they'll live, as their current rental in Mindarie isn't wheelchair friendly.\n\n\"We have to find a new home because my son needs to come home, where he can live a semi-independent or functional life,\" Larson said.\n\nA fundraiser has been set up to help Haylett get back on his feet.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/montacute-road-crash-adelaide-family-demand-answers-after-woman-hit-by-van-while-walking-dog/92f93989-a5d9-4cd7-ad6a-23455b40bc44",
    "title": "Adelaide family demand answers after woman hit by van",
    "publish_date": "Sat, 10 May 2025 10:46:21 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel.\n\nThe victim's distraught husband has been at his wife's bedside at the Royal Adelaide hospital for most of today.\n\nHe told 9News they were walking the family dog yesterday morning, when they were hit by a van.\n\nThe family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel. (Nine)\n\nThe couple had a green light to cross Montacute Road.\n\nFootage from a nearby traffic camera appears to show the 91-year-old driver turning into their path.\n\nThe woman's husband told 9News he put his arms up to try and get the driver's attention.\n\nThe driver didn't see him, knocking him over and then hitting his wife.\n\nShe was rushed to hospital with life-threatening injuries.\n\nShe was in emergency surgery for several hours yesterday and has now been transferred to the intensive care unit.\n\nThe 48-year-old has several head injuries and a number of broken bones.\n\nREAD MORE: Australian dies after jumping off boat in Thailand ﻿\n\nThe family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel. (Nine)\n\nMeanwhile, the elderly driver, a 91-year-old man from Rostrevor, has been reported for dangerous driving and had his licence taken away.\n\nThe husband and his teenage son say he shouldn't have been behind the wheel, and the tragic accident could have been avoided.\n\nThe woman tonight remains in a critical but stable condition.\n\nThe 91-year-old will be summoned to appear in court at a later date.﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/matildas-four-matches-perth-bunbury/105281328",
    "title": "Matildas confirmed for landmark match in regional WA",
    "publish_date": "Mon, 12 May 2025 01:37:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Matildas will play four international matches in Western Australia in June and July, with three in Perth and one in the state's South West.\n\nFootball Australia has announced the women's national team will face Slovenia twice at Perth Rectangular Stadium on June 26 and 29, before hosting Panama at Hands Oval in Bunbury on July 5, and again at Perth Rectangular Stadium on July 8.\n\nIt is one of a number of historic events taking place at Hands Oval, which will host its first AFL home and away season match on June 8 between West Coast and North Melbourne, as part of a three-year deal for the Kangaroos to host matches at the Bunbury venue.\n\nThe ground also held an AFL pre-season clash between the Eagles and North Melbourne earlier this year in front of a sold out crowd of 7,000 people.\n\nThe announcement comes off the back of the Matildas riding a wave of popularity after their run to the semifinals of the 2023 FIFA Women's World Cup.\n\nThey have captured the attention of the nation, regularly selling out matches, and smashing TV viewer records during their World Cup campaign.\n\nThe team will play at Hands Oval in Bunbury, normally home to Australian Rules Football in WA's South West. (ABC South West WA: Sam Tomlin)\n\nWomen's game booming\n\nDunsborough Town Football Club president Tash Blefari is an advocate for women's and girls' soccer in the South West.\n\nThe club launched a girls-only junior competition early last year in response to a huge increase in interest.\n\nSince 2023, the club has seen a 330 per cent increase in female participation in soccer.\n\nMs Blefari said the Matildas coming to Bunbury was an incredible opportunity.\n\n\"It's a real celebration of the dedication we've seen in female football across the South West,\" she said.\n\n\"This isn't just about hosting a match. It's really great for recognising the countless volunteers, the coaches, all those young girls who have poured their hearts into the game.\n\n\" To see the Matildas play right here in Bunbury, it shows them what's possible and certainly will inspire that next generation to dream big. \"\n\nSport Minister Rita Saffioti said confirmation of four Matildas matches in WA was exciting for soccer enthusiasts in the state.\n\n\"We know the game is growing exponentially across the nation and we're seeing in particular more and more girls and women participate in the sport,\" she said.\n\n\"That's why we're so passionate about having more Matildas content inspiring the next generation.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/the-benefits-of-having-a-mundane-job/105223588",
    "title": "'We are so much more than our work': The positives of a mundane job",
    "publish_date": "Mon, 12 May 2025 01:17:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Meg is not fulfilled by her job.\n\nThe 40-year-old from Brisbane/Meanjin works in administration and has been in her current gig for seven years.\n\n\"It's far beneath my capability level … I'm not very challenged,\" Meg, who asked we keep her surname private, says.\n\nBut she isn't complaining. Meg has never had a \"dream job\" and says mundane works brings her financial security, peace, and flexibility.\n\n\"I have very specifically chosen to work in a job that has very little stress. I just don't want stress in my life.\n\n\"I get to work from home most of the time. I would take a pay cut to keep that going.\"\n\nNew research involving RMIT University shows while pursuing more meaningful careers often brings personal growth and fulfilment, it often requires financial, mental and physical sacrifice.\n\nJustine Alter is an organisational psychologist and co-director at Transitioning Well, a consultancy firm specialising in workplace wellbeing. She says there's nothing wrong with having a job that's \"just a job\".\n\nAnd there are ways to make it more enjoyable.\n\nWorkplace boredom Photo shows A woman slumps in front a laptop. What causes chronic work boredom? And what are some practical things you can do to make work more bearable if leaving isn't an option?\n\nThe pressure to have a dream job\n\nZena Burgess, CEO of the Australian Psychological Society, says the pressure to pursue a dream job can begin when we are children.\n\n\"At school people often ask young folks 'What will you do when you grow up?' as if there is some single thing that will define them as a person.\"\n\nIt's also the case that what someone might consider a dream job, another might see as a nightmare.\n\n\"For some people their dream job might be working with people they really like … for others it might be flexibility, like working close to home.\n\n\" Nobody has the perfect package all of the time. \"\n\nMundane job sometimes a 'trade-off'\n\nSometimes a job that allows you time to think about other things can be beneficial. (Pexels)\n\nFor many people, obtaining a dream job is just not possible, says Ms Alter.\n\n\"It's often about the season of life you are in, the financial pressure you might have, and emotional pressure,\" adding you might be raising young children, as one example.\n\nMum-of-three Tayla works in furniture sales on the Gold Coast/Yugambeh language region and says it's \"mind-numbingly boring\".\n\n\"I will go four hours without talking to someone sometimes,\" says Talya, who asked we don't use her real name.\n\n\"But it's not lost on me how privileged I am; I have friends … [whose] whole lives become their job. They are completely depleted when they come home.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nTayla says she will often put her hand up for extra tasks such as furniture assembly to keep busy, but mostly, a boring job means she can focus her energy on life outside of work — including the needs of her family.\n\n\" I can call in sick if I need to and not feel any guilt. \"\n\nA victim-survivor of domestic violence, Tayla says she'd love to work in community support, helping women and children.\n\nBut she says undertaking study while working and caring for three kids feels unachievable — for now.\n\n\"That's what I want to do at TAFE next, a Certificate IV in Community Services.\"\n\nDr Burgess says there are times in life where we have to make \"trade-offs\" to support those we care about.\n\nA job that allows you to \"think about other parts of your life\", she says, can alleviate mental load pressures.\n\nWhy Patricia swapped heels for steelcaps Photo shows Patricia Santiago, a young woman of Filipino appearance, wears high-visibility clothes and drives a tram When Patricia's father suggested she drive a tram, she was a \"corporate girl\". Now she's embraced having a route of her own.\n\nHowever, there is a risk of being \"too bored\", says Ms Alter.\n\n\"A term that has become popular is bore-out, instead of burn-out.\n\n\"[It's when] the mundaneness leads to your stress levels being too low.\"\n\nWhen we are under-stimulated, she says that isn't good for our physical or mental health.\n\nGetting more out of a boring job\n\nFinding community at work is one way to improve engagement, says Ms Alter.\n\n\"Sometimes it's not about the actual tasks you are doing, it's looking around in the workplace [and finding] what else you can get involved in; social groups, mentoring younger colleagues, volunteering for projects,\n\n\"That is often what is missing in the mundaneness.\"\n\nShe says thinking about how you can make a positive difference in the workplace can also help.\n\n\"If you care about fairness, maybe you can push for better team process to make sure it aligns with your values,\" she says as one example.\n\nDo you have a unique job you often get questions about? We'd love to hear about it lifestyle@abc.net.au\n\nDr Burgess says job crafting is a strategic way of achieving more job satisfaction.\n\nTask crafting, relation crafting, and cognitive crafting are different ways you can approach this.\n\nFor example, if you work in customer service, you could look at your role as not just about resolving issues but also helping people.\n\nUltimately, making sure we don't align too much of our identity with work can help us separate work from our purpose.\n\n\"We are so much more than [our work],\" Ms Alter says.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/china-us-hail-constructive-geneva-trade-talks/105280784",
    "title": "US and China hail 'constructive' Geneva trade talks",
    "publish_date": "Mon, 12 May 2025 00:49:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "The US and China have ended high-stakes trade talks on a positive note, with US officials touting a \"deal\" to reduce the US trade deficit.\n\nChinese officials said the sides had reached \"important consensus\" and agreed to launch another new economic dialogue forum.\n\nNeither side released details after they wrapped up two days of talks on Sunday in Switzerland.\n\nChinese Vice-Premier He Lifeng said a joint statement would be released in Geneva on Monday.\n\nVice-Commerce Minister Li Chenggang said it would contain \"good news for the world\".\n\nMembers of the Chinese delegation leave a Geneva residence where trade talks between Chinese and US delegations were held. (Reuters: Denis Balibouse)\n\nUS Treasury Secretary Scott Bessent and Trade Representative Jamieson Greer described \"substantial progress\" and also said details would be announced on Monday.\n\nIn separate briefings with reporters, neither side mentioned any agreement to cut US tariffs of 145 per cent on Chinese goods and China's 125 per cent tariffs on US goods.\n\nMr Greer and Mr Bessent took no questions from reporters.\n\nThe US Treasury chief has said previously that these duties amount to a trade embargo between the world's two largest economies and need to be \"de-escalated.\"\n\nFinancial markets have been on edge for signs of a thaw in a bitter US-China trade war that has already begun to disrupt supply chains, prompt layoffs and raise wholesale prices.\n\nUS Treasury Secretary Scott Bessent says trade talks with Chinese officials were \"very productive\".\n\nMr Greer described the Geneva meetings' conclusion as \"a deal we struck with our Chinese partners\" that would help reduce the $US1.2 trillion ($1.9 trillion) US global goods trade deficit.\n\n\"And this was, as the secretary pointed out, a very constructive two days,\" Mr Greer said.\n\n\" It's important to understand how quickly we were able to come to agreement, which reflects that perhaps the differences were not so large as maybe thought. \"\n\nThe US trade chief called Mr He, Mr Li and Vice-Finance Minister Liao Min \"tough negotiators\".\n\nMr He, speaking to reporters at China's mission to the World Trade Organization, described the talks as \"candid, in-depth and constructive\" on issues of concern to both countries.\n\nChinese Vice-Premier He Lifeng, the country's top economic official, says the talks were candid. (Getty images: Linato Zhang)\n\n\"The meeting achieved substantial progress, and reached important consensus,\" Mr He said, drawing applause from a large audience of Chinese officials present at the WTO office.\n\nHe also met with WTO Director-General Ngozi Okonjo-Iweala, who said she was \"pleased with the positive outcome\" of the talks and urged the two countries to build on momentum to mitigate trade tensions.\n\nThe WTO has ruled against Mr Trump's past tariffs on Chinese goods, but the cases have been stalled in the WTO's paralysed appellate body due to the US blocking judge appointments.\n\nNew consultation platform\n\nThe US and China agreed to establish a new consultation mechanism for trade and economic issues, with relevant details to be finalised as soon as possible, Mr He added.\n\nChina and the US have convened numerous consultation bodies to try to resolve trade and economic differences in recent decades, including the Economic Working Group that former president Joe Biden's Treasury secretary Janet Yellen established with Mr He in 2023.\n\nThese dialogues have provided forums for airing bilateral grievances, but have done little to advance Washington's longstanding goal to shift China's state-dominated, export-driven economic model toward one driven by consumer spending.\n\nFirst meeting\n\nThe meeting was the first face-to-face interaction between senior US and Chinese economic officials since Mr Trump took office and launched a global tariff blitz, declaring a national emergency over the US fentanyl crisis and imposing a 20 per cent tariff on Chinese goods in February.\n\nMr Trump followed with a 34 per cent \"reciprocal\" duty on Chinese imports in April, and subsequent rounds pushed the rates into triple digits, bringing nearly $US600 billion ($935 billion) in two-way trade to a standstill.\n\nThe talks were the first face-to-face interaction between senior US and Chinese economic officials since US President Donald Trump took office.\n\nChina had insisted that tariffs be lowered in any talks.\n\nMr Trump said on Friday that an 80 per cent tariff on Chinese goods \"seems right\", suggesting for the first time a specific reduction target.\n\nMr Greer said there was a lot of groundwork done before the Geneva meetings on Saturday and Sunday, and that the result would address the national emergency that Mr Trump declared over growing US trade deficits.\n\n\"We're confident that the deal we struck with our Chinese partners will help us to work toward resolving that national emergency,\" Mr Greer said.\n\nA White House press release that simply repeated Mr Bessent's and Mr Greer's brief comments with no details ran the headline: \"US announces China trade deal in Geneva.\"\n\nMore tariff deals\n\nEarlier on Sunday, White House economic adviser Kevin Hassett said the Chinese were \"very, very eager\" to engage in discussions and rebalance trade relations with the US.\n\nMr Hassett also told Fox News's Sunday Morning Futures program that more foreign trade deals could be coming with other countries as soon as this week.\n\nLast week's limited trade deal with Britain left 10 per cent US duties in place on many UK products.\n\nOvernight, Mr Trump gave a positive reading of the talks, saying on his Truth Social media platform that the two sides had negotiated \"a total reset … in a friendly, but constructive, manner.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/italian-open-alexei-popyrin-daniil-medvedev-alex-de-minaur/105280972",
    "title": "Popyrin's rapid Rome exit leaves de Minaur flying the flag solo once again",
    "publish_date": "Mon, 12 May 2025 00:40:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "With the Italian Open only now getting to its business end in Rome, the Australian singles interest has once again been left resting solely on the shoulders of Alex de Minaur.\n\nDe Minaur was left to fly the flag alone after the tame exit of Alexei Popyrin against former winner Daniil Medvedev on the SuperTennis Arena on Sunday, which continues the Canadian Open winner's difficult 2025 campaign.\n\nMedvedev marched to a comfortable 6-4, 6-1 victory in 1 hour and 26 minutes, with Popyrin frustrated by his failings as he clocked up 28 unforced errors to take his season's record to 6-10, a disappointing follow-up to his breakthrough 2024 campaign.\n\nWith the French Open just a fortnight away, the Australian contingent's recent struggles on clay have been striking.\n\nThe 11 who started in the men's and women's singles draws in Rome have all departed before the second week, except for de Minaur.\n\nHe battled past Luca Nardi and will be a warm favourite to make the last 16 when he faces Bolivian lucky loser Hugo Dellien, with the South American gifted his second chance after being defeated in qualifying by Felix Auger-Aliassime's injury.\n\nElsewhere in the men's draw, the big guns began to fire with title holder Alexander Zverev strolling into the last 16 with a 6-4, 6-0 win over Lithuanian qualifier Vilius Gaubas.\n\nThird seed Carlos Alcaraz then continued his impressive return from injury with a 7-6 (7/2), 6-2 victory over Serbian Laslo Djere on the main Campo Centrale arena.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nEarlier, Stefanos Tsitsipas had ended up in a heated and lengthy discussion with his conqueror Arthur Fils after his 2-6, 6-4, 6-2 defeat, with the umpire having to come down off his chair and keep a close eye on the pair as supporters in the SuperTennis Arena jeered and whistled.\n\nThe animated head-to-head centred on a moment when Tsitsipas tagged Fils with a booming backhand during the second set, with the 20-year-old Frenchman apparently using it as his fuel for victory.\n\nBut there appeared to be no bad blood between the pair as they left the arena following the discussion.\n\nBritish star Jack Draper recorded his 100th tour win but admitted his frustration had boiled over as he smashed a racquet en route to beating Czech qualifier Vit Kopria 6-4, 6-3.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/china-embassy-solomon-islands-embroiled-foreign-interference/105280538",
    "title": "Claims Beijing issued 'shocking challenge' to Solomon Islands sovereignty",
    "publish_date": "Mon, 12 May 2025 00:01:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "China's Embassy in Solomon Islands has become embroiled in a foreign interference controversy after allegedly forcing a newly appointed minister in the Pacific island nation to quit an international group pushing back against Beijing's growing global influence.\n\nRural Development Minister Daniel Waneoroa announced yesterday he had left the Inter-Parliamentary Alliance on China (IPAC) — which draws in politicians from more than three dozen countries — saying he made the decision \"in the interest of fostering stability and aligning with a collective national vision\" under Solomon Islands Prime Minister Jeremiah Manele.\n\nSolomon Islands Prime Minister Jeremiah Manele is balancing ties with China. (AP: Mark Schiefelbein)\n\nThat drew a furious response from IPAC, which accused China of \"bullying behaviour\", saying Beijing had issued a \"direct and shocking challenge\" to the sovereignty of Solomon Islands.\n\nMr Waneoroa was only appointed Rural Development Minister 10 days ago.\n\nMr Manele offered him the position to coax him away from a broad coalition of MPs — including both government defectors and opposition MPs — which had coalesced to challenge the prime minister's hold on power.\n\nIn the end Mr Manele warded off the challenge by cobbling together a new majority in parliament, forcing his political opponents to abandon a motion of no confidence they were planning to issue in parliament last week.\n\nLoading...\n\nBut the flurry of horse trading also created a diplomatic headache for Mr Manele, because of Mr Waneoroa's position as one of two Solomon Islands \"co-chairs\" for IPAC.\n\nThe ABC has been told China was angered by Mr Waneoroa's position with IPAC, which maintains strong links with Taiwan and which has tried to build international pressure on Beijing over human rights abuses, including in Hong Kong and Xinjiang.\n\nThe group has previously accused China of resorting to threats and blackmail to stop MPs from several developing countries joining an international IPAC conference hosted in Taiwan in June last year.\n\nMr Manele recently formed a new majority in parliament, forcing his political opponents to abandon a motion of no confidence. (AAP: Ben McKay)\n\nOver the weekend a prominent civil society group in Solomon Islands said the Chinese embassy had demanded to meet Mr Waneoroa, and suggested embassy officials had threatened to withdraw development funding from development programs because of his links to IPAC.\n\nIn a stinging statement, Transparency Solomon Islands said on Saturday that China's actions risked destabilising Mr Manele's government, and demanded the embassy stop \"interfering\" in local politics.\n\n\"The People's Republic of China must understand: Solomon Islands is not a satellite state like Hong Kong,\" it said.\n\n\"No embassy has the right to issue political demands or threats to our sovereign nation.\"\n\nThe other IPAC co-chair in Solomon Islands, prominent MP Peter Kenilorea Jr, also told the ABC that he was \"aware that Hon. Waneoroa had been pressured by the Chinese embassy here in Solomon Islands to quit IPAC for some time now\".\n\nAnd on Sunday afternoon Mr Waneoroa revealed he had resigned from the group on Thursday last week.\n\nChina has denied interfering in the Solomon Islands and said the allegations are false. (AP: Mark Schiefelbein, file photo)\n\nHe said while he \"acknowledged the value\" of his IPAC experience, \"the current political landscape demands leadership that is responsive and united.\"\n\n\"I believe that aligning with [Mr Manele's coalition] GNUT is not only about policies, but about building a just, equitable, and prosperous Solomon Islands,\" he said.\n\nIn the wake of his announcement, IPAC accused China of using its investments in Solomon Islands as \"leverage\" against Mr Waneoroa and the government.\n\n\"For a country that boasts of not having imperial ambitions, China's actions in the Solomons have the hallmarks of neo-colonialism,\" said IPAC executive director Luke de Pulford.\n\n\"What China fails to realise is that this bullying behaviour is fomenting deep resentment in the Solomons and everywhere else they do it. It will backfire eventually.\n\n\"In the meantime, the world is watching to see if the Solomon Islands government responds to this direct and shocking challenge to their sovereignty.\"\n\nChina's embassy in Solomon Islands did not say whether it had made any demands of the minister, but in a statement said the foreign interference allegations were \"baseless\".\n\n\"China will never interfere in Solomon Islands' internal affairs, and also firmly oppose any other countries' interference in Solomon Islands' internal affairs,\" it said.\n\n\"[The] Chinese embassy firmly opposes such baseless allegation, and reiterates its support to the political stability of Solomon Islands.\"\n\nChina has strengthened ties in the Solomon Islands and other countries in the Pacific. (Xinhua / Liu Bin/EPA)\n\nLike his predecessor Manasseh Sogavare, Mr Manele has been intent on building closer ties with China in the wake of Solomon Islands' decision to switch diplomatic recognition from Taiwan to Beijing in 2019.\n\nSince then China has made significant investments in Solomon Islands infrastructure — including a massive new stadium for the Pacific Games and a large new medical centre opened this year — as well as signing contentious security and policing pacts with the Pacific nation.\n\nMeanwhile, Solomon Islands has been a vocal supporter of China's claims over Taiwan, with Mr Manele signing a joint statement last year that said it \"firmly supports all efforts by Chinese government to realise national reunification\".\n\nSolomon Islands officials have also pushed to stop Taiwanese officials from attending this year's Pacific Islands Forum leaders meeting in Honiara, risking fresh division with Taipei's remaining allies in the region.\n\nLast year Mr Kenilorea Jr told IPAC's conference in Taiwan that he would personally like to see Solomon Islands re-establish ties with Taipei, drawing condemnation from Mr Manele's government.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/moses-rock-development-resisted-by-south-west-locals/105273360",
    "title": "Third multi-million-dollar tourism project planned for WA's South West",
    "publish_date": "Sun, 11 May 2025 23:59:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "A tourism operator in Western Australia's South West has joined a campaign against plans to build a luxury eco-retreat along the iconic Cape to Cape walking track.\n\nThe $15 million development in Wilyabrup, 255 kilometres south of Perth, would include 10 chalets, a holiday house and a wedding venue, catering to tens of thousands of hikers visiting the trail each year.\n\nCape to Cape Explorer Tours manager Gene Hardy said the development could undermine the \"wild and untouched\" character that made the Cape to Cape one of WA's most popular eco-tourism experiences.\n\nThe track is a 123km stretch along the coastline between the Cape Naturaliste and Cape Leeuwin lighthouses.\n\nSugarloaf Rock near Cape Naturaliste along the Cape to Cape track. (ABC Open contributor Matt Deakin)\n\n\"Tourism in Australia and Western Australia's whole appeal is that it's wild, it's unique, it's open and it's untouched,\" Mr Hardy said.\n\n\"I'm just into doing everything I can to keep it looking as wild and as special as we can.\n\n\"It really boils back down to the wrong thing in the wrong place.\"\n\nMr Hardy is among dozens of locals and several conservation groups opposing the project in public submissions to the WA Department of Planning, Lands and Heritage.\n\nGene Hardy is among the locals who oppose the project. (Supplied)\n\n'Outrageous for the area'\n\nAt the forefront of the local resistance is a residents' group called Save Moses Rock, which is concerned about the ecological damage and bushfire risk of the proposal.\n\nGroup member Max Mueller lives a few kilometres from the site and is also a volunteer with the Wilyabrup Bushfire Brigade.\n\n\"I think the biggest thing is the scope and the scale are quite outrageous for the area,\" he said.\n\n\"We'd like to see it get knocked back in its current form.\"\n\nMr Mueller said the development's single access road was insufficient to manage the evacuation of more than 100 guests in case of an emergency.\n\nThe proposal stated the bushfire risks were adequately mitigated in an \"extensive\" bushfire management plan, which included an on-site fire refuge within its events venue.\n\nThe view from Conto Cliff along the Cape to Cape track. (Flickr: Kevin Yank, CC BY-NC 2.0)\n\nTraditional owners back the plan\n\nThe project espouses eco-consciousness by careful management of vegetation clearance and construction of self-sufficient water and electricity supply, and is the brainchild of Perth developer Troy Hall.\n\n\"We firmly believe that our project emphasises minimal visual impact, native species reintroduction and the maintenance of the site's natural character, demonstrating a range of ecological considerations,\" Mr Hall said in a statement.\n\nHis proposal has the backing of the Undalup Association, representing the local traditional custodians, the Wadandi people.\n\nThe project is the brainchild of Perth developer Troy Hall. (Supplied: Clarity Communications)\n\nUndalup Association chair Zac Webb said the proposal had set a positive precedent for future developers in the South West.\n\n\"This is the kind of standard that you'd want to set,\" Mr Webb said.\n\nThe Undalup Association had been engaged with since the early stages of the proposal, he added.\n\n\"I think that's really what it's all about, is that really working together and those genuine partnerships or collaborations, or what I like to say is just like friendships really,\" Mr Webb said.\n\nZac Webb has been involved since the early stages of the proposal. (Supplied)\n\nThe proposal was first submitted in 2021 through the WA Planning Commission's State Development Assessment Unit, which was set up to streamline reviews and approvals of major projects during the COVID-19 pandemic.\n\nThere are two other large development applications also going through the approval process, at Gnarabup and Smith's Beach.\n\nA Department of Planning, Lands and Heritage spokesperson said the Planning Commission would review the Moses Rock proposal alongside public submissions.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/financial-counsellors-warn-of-private-advice-services/105276382",
    "title": "Financial counsellors sound alarm over private assistance fees",
    "publish_date": "Sun, 11 May 2025 22:51:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Financial Counsellors Association of WA has warned that services that charge fees to lodge complaints with banks and the financial ombudsman on behalf of customers are not necessary.\n\nMelanie Hopkinson, the association's chief executive, said services had sprung up that work on a \"no win, no fee\" basis, taking up to 40 per cent of any payout a complainant might receive.\n\n\"They offer to take the fight to the ombudsman for you,\" Ms Hopkinson told Nadia Mitsopoulos on ABC Radio Perth.\n\n\"That could be for a complaint against a financial provider for junk insurance.\n\n\" They're going to do some of the legwork, but they're going to want at least up to 40 per cent of the compensation you may get. \"\n\nMs Hopkinson said she wanted the public to understand that financial counsellors will do the same for the clients — free of charge.\n\nShe said the complaint process to the Australian Financial Complaints Authority (AFCA) was designed to make it easy for people to lodge complaints on their own.\n\n\"What we want people to focus on is that there are free alternatives out there,\" she said.\n\n\"Financial counsellors can assist you to do exactly the same work and walk alongside you and advocate for you.\n\n\"And then if you do get your compensation, 100 per cent of it will go to you.\"\n\nCommissions could take bite out of compensation\n\nIn a statement, a spokesperson for AFCA said it was free to use, and the service was designed so that people did not need to engage a paid representative.\n\nAFCA also said that any compensation awarded would not take into account whether a consumer had used a paid service to lodge their complaint.\n\n\"By coming directly to us, you get to keep every cent of any compensation you are owed,\" the spokesperson said.\n\n\"That said, if someone decides to use a paid representative, we'd encourage them to ensure the paid representative makes a detailed submission to the financial firm first, through the firm's own complaints process — more formally known as internal dispute resolution.\n\n\"This can be the fastest way of achieving an early resolution.\"\n\nServices offer to do 'heavy lifting'\n\nOne of these paid services is Perth-based website EquiClaim, which offers to help consumers with complaints against banks and takes 40 per cent of any compensation awarded.\n\n\"We're addressing the gaps in the system for those who are left behind,\" EquiClaim director Ronald Ng said.\n\n\"We're a private sector solution to consumer complaints, in particular the banks.\n\n\"And we fully understand that there are other pathways so that you can do it yourself. If you do qualify, you can go and talk to financial counsellors, or you can talk to legal aid, or you can talk to other advisers.\"\n\nMr Ng defended the 40 per cent fee, saying his company did the \"heavy lifting\" for its customers.\n\n\"We've looked at the marketplace … and [the fee] mirrors the litigation funding [model], which has been in place for a fair while,\" he said.\n\n\"We're a private organisation, so we don't get the funding that some of the other organisations will get that are government-funded or some of the not-for-profits.\"\n\nStigma in asking for help\n\nMs Hopkinson said many people were unaware that free financial counselling services existed, and for some, there might be an element of shame in asking for help with money problems.\n\n\"I think for some people, there is no awareness that the free services exist,\" Ms Hopkinson said.\n\n\"There's a real stigma about talking to someone about finances and about issues.\n\n\"And I also think people get overwhelmed by the prospect of thinking there's going to be an awful lot involved.\"\n\nMs Hopkinson said there were about 150 counsellors in Western Australia, and people could contact the National Debt Helpline to be connected to one.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/camogie-final-postponed-over-skorts/105280532",
    "title": "Major Irish final postponed because camogie stars refuse to wear skorts",
    "publish_date": "Sun, 11 May 2025 22:13:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "A major final in the Irish sport of camogie has been called off after the women playing in the game refused to wear skorts.\n\nThe Munster final between Cork and Waterford was postponed as the stars of camogie, the women's version of hurling, made it clear they wanted the option to play in shorts.\n\nThe Camogie Association of Ireland broke its silence eight days after player protests began, with the governing body's president saying he wants and expects a motion to change the rule to be successful.\n\nThe rules governing camogie state that playing gear must include a skirt, skort or divided skirt.\n\nA recent survey found 83 per cent of players feel they should not be forced to wear skorts or skirts. (Getty Images: Ray McManus/Sportsfile)\n\nLast Saturday, Dublin and Kilkenny entered the pitch wearing shorts before changing into skorts to avoid their Leinster Championship semifinal being abandoned, but after Cork and Waterford announced their intention to play in shorts, the Munster final was postponed.\n\nThe Munster Council postponed the game giving less than 24 hours' notice and the teams issued a statement saying the decision showed \"scant regard\" for the players.\n\n\"We feel completely let down,\" the statement from Waterford and Cork read.\n\nAFL ditches white shorts for female players Photo shows Geelong AFLW players line up for the national anthem during a 2019 premiership match. The uniform change is designed to eliminate performance anxiety faced by players during their menstrual cycles.\n\n\"Both panels had meticulously planned to peak for today. Training schedules and workload will now have to be readjusted, while not even knowing when the game will take place.\n\n\"There was an opportunity to take a step forward from the recent controversy. Instead, a provincial final has been postponed because we took control of what we would wear.\n\n\" To us, that feels like a massive step backwards. \"\n\nCamogie Association president Brian Molloy told local radio he \"empathised with where the players are coming from\".\n\n\"From Munster Council's perspective, I 100 per cent support their decision,\" he said.\n\n\"The key here is that we were working right up to the wire to try and resolve the issue and we thought we had.\"\n\nDublin captain Aisling Maher had been vocal about the issue, saying the skorts were \"uncomfortable and unfit for purpose\", but stressing the issue is more about the lack of choice.\n\nLoading Instagram content\n\n\"How are female players still having to push for permission to wear shorts while they compete at the highest level of their sport,\" she wrote on Instagram, describing the scenes before the Leinster semifinal as a \"career low\".\n\n\"In no other facet of my life does someone dictate that I have to wear something resembling a skirt because I am a girl. Why is it happening in my sport?\"\n\nThe Gaelic Players' Association (GPA) released research saying 83 per cent of players would prefer to wear shorts or believe players should have the option.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nIt also showed 70 per cent of players reported discomfort while wearing skorts, 65 per cent were concerned about exposure in photographs and video content, and half said they had experienced anxiety around period leaks.\n\nTwo motions to change the rule were defeated last year, and player pressure has seen the association call a special congress for May 22 to vote on a new motion to introduce shorts as an option.\n\n\"We proposed to the GPA that we would bring forward the congress decision to 2026, and I had a very detailed conversation with the GPA chief executive who welcomed that proposal,\" Molloy said.\n\n\"Then 24 hours later, and I have no issue with this whatsoever, the players indicated, no, that wasn't enough. They wanted it faster than that.\"\n\nLouth and Wicklow also joined the protest movement, saying the rule was \"outdated\" and urging the sport's governing bodies to get with the times.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nThe All-Ireland championship is scheduled to begin two days after the congress, and another vote against shorts would put the sport's premier competition at serious risk.\n\n\"I have to be careful not to be seen to be telling anybody how to vote. I am saying unequivocally that I want to see choice. That's my personal view,\" Molloy said.\n\n\"I've spoken to a lot of delegates and the consistent feedback is that they are 100 per cent behind keeping the skort but giving the option for shorts.\n\n\"I'm very comfortable that we will get the support to get it across the line.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/afl-round-9-analysis-wrap-zach-reid-tom-de-koning-collingwood/105279848",
    "title": "This Bomber has finally arrived and can supercharge club's stuttering build",
    "publish_date": "Sun, 11 May 2025 21:35:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "Zach Reid continues to announce himself as one of the best young defenders in the AFL, a fascinating ruck battle leaves questions for St Kilda, and Collingwood proves why its system is the best in the competition.\n\nHere's what we learned from round nine of the AFL season.\n\nAfter years of false starts, Zach Reid has arrived\n\nAny discussions around drafts are usually a touchy subject for Essendon fans due to the staggering number of misses over the past two decades.\n\nOne class in particular, that of 2020, is a polarising topic. The Bombers had three top 10 picks in that draft and walked away with three players — Nik Cox, Archie Perkins and Zach Reid.\n\nWhile other players from that class, namely Riley Thilthorpe (pick 2), Max Holmes (pick 20) and Errol Gulden (pick 32) have kicked on and become stars of the competition, the Bombers have been waiting for their trio to hit their straps.\n\nCox started the brightest and Perkins has played the most games of the trio, but many around the club have long believed Reid, who has played the least, will end up being the best player.\n\nZach Reid has spent more time in injury recovery than on the field during his first four years, but is now making a big impact in the Bombers' defence. (Getty Images: Dylan Burns)\n\nIt has been a hard graft for Reid, whose career has been halted by multiple injuries, but he is finally putting together some football and quickly showing why Essendon has been willing to play the long game with him.\n\nReid has played eight straight games to start this season, incredibly the longest stretch of games in his four-year career to date. Saturday's 27-disposal, 14-mark effort against the Swans was by far the best of the lot.\n\nThe Bombers stopped in their tracks for the second straight week after a bright first half, and as the Swans pushed in the final quarter, Reid stood up tall.\n\nReid took five intercept marks throughout the contest, all with varying degrees of difficulty. There were the easy ones where he gobbled up haphazard kicks inside 50 from Sydney, tougher ones where he withstood heavy contact to take a big pack mark.\n\nBut one stood out in which he ran back with the flight of the ball to take it over his shoulder. It was so special that the master of running back with the flight of the ball — Brisbane great Jonathan Brown — stopped commentating the live action as it happened on Fox Footy so he could talk about the mark itself.\n\nReid looked like someone who hadn't played AFL football in a long time in his first two matches this season, but in the weeks that have followed, not only is he getting acclimatised to the pace of the game, but he is growing more confidence in his body with every crunching hit he withstands in a marking contest.\n\nReid isn't just an intercept threat either. He racked up 451 metres against the Swans, mostly using incisive kicks out of Essendon's back 50. In a side that is largely devoid of elite ball users by foot, he sticks out like a sore thumb.\n\nLoading...\n\nThere has been great debate over what exactly constitutes a pass mark for the Bombers this season, Brad Scott's third in charge. Getting 20 or more games into Reid will go a long way to making it a positive season.\n\nEssendon is still ages away, but players like Reid can shorten the timeline in a hurry, particularly when paired with an equally exciting tall at the other end of the ground in Nate Caddy.\n\nAll the great sides have strong spines, and the Bombers are building theirs with Caddy and Reid as the bookends.\n\nThe Saints might not really need TDK\n\nFriday night's clash between St Kilda and Carlton was dubbed by some as the TDK Cup due to the two clubs' bidding war over Blues ruckman Tom De Koning.\n\nDe Koning is out of contract with the Blues at the end of the year, and the Saints have reportedly handed him the football equivalent of a blank cheque to pledge his future to Moorabbin. Carlton wants him to stay, but is well aware he could walk, given the Blues have their own cap constraints.\n\nThere is only one problem, the Saints already have a really good ruckman in Rowan Marshall, who is signed through the end of the 2027 season.\n\nDe Koning is four years younger than Marshall and is an upgrade, he is arguably the best ruckman in the competition in the non-Max Gawn division, but the duel between the two men begged the question as to whether the Saints really needed an upgrade in the ruck stocks.\n\nRowan Marshall showed that the difference between he and Carlton ruckman Tom De Koning may not be all that much. (Getty Images: Josh Chadwick)\n\nThe Saints are quite clearly big game hunting, and have been for the best part of 12 months. They attempted to turn Essendon skipper Zach Merrett's head with an offer so big that Merrett, the most loyal of players, needed to sit down with his partner to talk about it.\n\nThey chased Finn Callaghan, who said no and signed a monster deal to stay with the Giants himself.\n\nDe Koning is seemingly the next cab off the rank.\n\nIf De Koning says yes to the Saints, he'll walk in as the club's highest-paid player. A look at the ruckmen in recent premiership sides, sans Gawn with Melbourne in 2021, suggests blowing large portions of your salary cap on rucks isn't really all that wise.\n\nCollingwood realised this barely 12 months after giving Brodie Grundy, an excellent two-time All-Australian big man, a monster seven-year, $7 million deal. They flipped Grundy to use the cap space elsewhere, filled the ruck spot with Darcy Cameron, a less sexy ruck option, and won a premiership 12 months later.\n\nThe Saints will have to fork out big money to retain the services of the silky Nasiah Wanganeen-Milera. (Getty Images: Josh Chadwick)\n\nIt was interesting to watch Marshall play with an extra layer of meanness than usual against De Koning. Every contest between the two had an air of \"good luck taking my job\" about it from the Saints ruckman. De Koning had the better game, but Marshall wasn't too far behind at all, and the game was a microcosm of where the two ruckmen's careers currently stand.\n\nThe Saints have a big contract call pending with Nasiah Wanganeen-Milera as well, who is also out of contract and wants to be remunerated in a way that reflects his status as one of the best players on the team.\n\nIs it worth pricing yourself out of the Wanganeen-Milera business because you finally got a big fish to say yes? That's the question Saints bosses must ask themselves.\n\nCollingwood has the best system in the competition\n\nA sensational first couple of months has Collingwood deservedly sitting among the league's premiership favourites, but Thursday's win over Fremantle in Perth might have been the biggest statement yet.\n\nHow many other clubs would boldly decide to go to Perth, still the most daunting road trip in the AFL, while choosing to rest four first-choice players? Yes, Craig McRae suggested Brayden Maynard and Brody Mihocek were dealing with a few ailments, but had this match been a final, they would have played. So too would Jordan De Goey and Scott Pendlebury.\n\nNot only were the Pies undermanned, they came up against a Fremantle side in dire need of a response at home. What ensued was another reminder that Collingwood will be incredibly hard to beat at the pointy end of the year.\n\nCraig McRae put on a coaching masterclass as an undermanned Collingwood escaped Perth with the four points against Fremantle. (Getty Images: James Wiltshire)\n\nAustralian rules football isn't like basketball or the world game, it is harder to plug and play due to the sheer number of players there are on the field. With a larger amount of players comes a larger chance for things to go wrong if guys aren't on the same page.\n\nWhat Collingwood did against Fremantle was the finest example of plug-and-play that you're ever likely to see.\n\nPendlebury and De Goey are two of the Magpies' top six centre bounce players so far this season. With the pair out, Craig McRae put ironman Jack Crisp into the coalface and it yielded instant positive results.\n\nLoading YouTube content\n\nCrisp attended 61 per cent of the Pies' centre bounces against Fremantle, by far his highest of the season (his previous high was 13 per cent against the Swans in round five), and responded with 29 disposals and seven clearances, the most by any Collingwood player.\n\nThe Magpies are now in year four of the McRae era and clearly have supreme confidence in what he preaches. They are able to adjust on the fly, pardon the pun, better than any other team in the competition.\n\nEach player not only knows their own role, but their teammate's role as well, allowing the Pies to shapeshift throughout a contest as much as the game deems necessary. It is why they regularly prevail in close games.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/former-liverpool-player-adam-lallana-tribute-to-grieving-family/105272904",
    "title": "21yo man's dying wish for his father fulfilled by English football player",
    "publish_date": "Sun, 11 May 2025 21:34:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tasmanian Ken Fleming is a passionate Liverpool FC fan, but there's a piece of memorabilia in his footy collection that evokes bittersweet memories.\n\nOn the wall of his home gym in Tranmere near Hobart is a signed edition of former Liverpool footballer Adam Lallana's playing shirt, framed with a letter penned by the footballer in honour of Mr Fleming's son Jack, who died aged 21 of an incurable brain tumour.\n\nJack was diagnosed with glioblastoma multiforme (GBM) in 2016, after complaining of a headache and experiencing a seizure. He died 22 months later.\n\nLallana's letter and signed shirt were in response to an email Jack had partially written to the player, his father's idol, before his death in 2018.\n\nAdam Lallana's signed player's top was framed with a letter he wrote to Mr Fleming about Jack's death. (Supplied)\n\nMr Fleming discovered it after his son had died and posted it to Lallana with his own letter to honour his son's wishes.\n\n\"When I got onto his computer after he died, I found this very poorly written letter to Adam Lallana just saying that my father's doing so much for me,\" Mr Fleming told ABC Hobart.\n\nJack had been studying commerce/law at the University of Tasmania when he was diagnosed with glioblastoma multiforme, the most aggressive and deadly form of brain cancer.\n\nIn his letter to Lallana, Jack asks the football player for some signed memorabilia for his father, who, he writes \"has been helping me tremendously since I got diagnosed\".\n\n\"I can honestly say that the only reason I have survived over 12 months is because of him.\"\n\nJack Fleming died of brain cancer at the age of 21. (Supplied)\n\nHe told Lallana the memorabilia would be a surprise for his dad, though Mr Fleming learned later that his wife and brothers knew about it.\n\n\"Jack was an extremely bright kid at uni and doing extremely well. But towards the end as the cancer took over, it scrambled his brain,\" Mr Fleming said.\n\n\"The letter was very poorly constructed. But clearly, I could see the set-up and what he was trying to do.\n\n\"I sent it to Adam, added my context and Adam sent back the shirt which I've since framed with the most beautiful letter saying that he would keep the letter in his locker, you know, just to remind him he had two boys, and he knew what I was going through.\n\n\"So it meant a lot.\"\n\nLallana's letter\n\nIn his return letter, Lallana tells Mr Fleming how deeply Jack's letter had affected him and promises \"to keep Jack's letter in my locker at the training ground for the entire season\".\n\nLallana wrote back to say that he would keep Jack's letter in his locker. (AP: Peter Byrne)\n\n\"I am a father of two young boys — so my immediate thoughts are those of a fellow parent,\" he writes.\n\n\"His inspirational words will provide me with an ongoing reminder of his courage, but also the responsibility we have as professional footballers to give everything always, because of the love and support of people like your Jack.\n\n\"With love and compassion, You'll Never Walk Alone.\"\n\nMr Fleming said he was moved to tears by Lallana's words.\n\n\"I didn't know if I would get a response, but I wanted to honour Jack's wishes. Then Adam wrote back with this beautiful letter; it was a very cathartic moment.\"\n\nConnecting through grief\n\nIn the months following his son's death, Mr Fleming reached out to other public figures including former US president Joe Biden whose son Beau had died of a glioblastoma brain tumour a few years earlier, and US senator John McCain before he likewise died in 2018 from the disease.\n\nHe also shared his son and family's experience in the book, Jack's Story: The life and death of Jack Fleming, and has advocated for new brain cancer treatments and research.\n\n\"Both Joe Biden and senator John McCain wrote back to me,\" Mr Fleming said.\n\n\"It's about connecting with like souls and understanding their grief and pain. It's about trying to find sanity in a world that's gone mad.\n\n\"I never thought this would happen to any of my children. Our life changed; there were no more rules after Jack died.\"\n\nFormer US president Joe Biden wrote to Mr Fleming about the death of Jack. (Supplied)\n\nOn June 5, 2018, Senator McCain thanked Mr Fleming for sending him a copy of Jack's Story, and in December that year Joe Biden also replied.\n\n\"As you know glioblastoma cancer has touched my life and those that I love dearly,\" Mr Biden wrote.\n\n\"Our sons gave us so much more than they knew, so much for us to cherish.\"\n\nSenator McCain said he appreciated \"the bravery it took to write this book about what it is really like inside a life with a glioblastoma multiforme\".\n\nGlioblastoma multiforme\n\nAlso known as GBM, glioblastoma multiforme is the deadliest form of brain cancer; it is fast growing and can strike at any age.\n\nProfessor Richard Scolyer shares health update as he wins major prize at book awards Photo shows Scolyer profile professor Former Australian of the Year Professor Richard Scolyer says he may only have a few months to live as he faces his brain cancer diagnosis.\n\nFormer Australian of the Year Richard Scolyer was diagnosed with an aggressive glioblastoma in 2023 and took part in experimental immunotherapy treatment, but recently revealed his brain cancer had returned and he had only months to live.\n\nMr Fleming said the correspondence he had with others affected by GBM, including Adam Lallana, provide some solace during moments of intense grief, \"when all hell breaks out\".\n\n\"That was the outcome [of connecting with Lallana], that beautiful shirt and beautiful memories,\" he said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/asx-markets-business-news-live-updates/105278180",
    "title": "Live: ASX and Wall Street futures rise on US-China trade talk positivity",
    "publish_date": "Sun, 11 May 2025 21:25:59 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Stephanie Chalmers",
      "Daniel Ziffer"
    ],
    "text": "To paraphrase Sir John Falstaff, Wall Street investors saw discretion as the better part of value ahead of the start of trade talks with China over the weekend.\n\nAt the close of business on Friday, the Dow had slipped 0.3%, the S & P 500 was marginally down, and the Nasdaq ended the week flat.\n\nWhile the sentiment around global trade tensions has improved in recent weeks, traders paused the recent rally, waiting for something more concrete than \"vibes\" to come out the meeting in Geneva between US Treasury Secretary Scott Bessent and Chinese Vice Premier He Lifeng.\n\nThe vibes, at least from the US point of view is that \"substantial progress\" has been made, while the Chinese delegation says an \"important consensus has been reached.\"\n\nThe easing of UK tariffs hardly moved the dial late last week, given the UK already runs a deficit with US, but it does show that the Trump administration is keen to be seen to be doing deals.\n\nIndia is also keen to cut its tariff gap with the US - it's not surprising to want friendly relations with the US when the missiles start whizzing across the border with Pakistan.\n\nBut progress with China is the main game, and by a long way, and President Trump's gut feeling that an 80% tariff on Chinese goods is arguably better than 145% but still isn't going to get a deal done.\n\nRosenblatt Securities managing director Michael James told Reuters that the market is wary of anything potentially negative coming from the US/China meetings.\n\n\"With the Geneva meeting this weekend, there's a little bit of anxiety and certainly a fair amount of profit taking given the strength we've had,\" Mr James said. \"We've all become accustomed in the last month to the impact negative and positive from any social media headlines coming from the White House. \"While it's certainly been more pleasant the last few weeks with the market trending higher … there's still a fair amount of uncertainty.\"\n\nThe global MSCI share index rose 0.1% on Friday, largely due to solid buying across Europe, with Germany's Dax (+0.6%) ending the day at a record high.\n\nThe US dollar index fell 0.3%.\n\nThe Australian dollar (+0.2%) was one of many currencies gaining against the greenback.\n\nOil traders had a more positive view of the Geneva talks.\n\nThe global benchmark Brent crude rose 1.7% to $US 63.91/barrel, to be more than 4% higher over the week.\n\nGold traders, on the other hand, took the President's gut feeling at face value, seeing it more as negative than a positive, so bid the price of gold up 1.1% to $US3,340/ounce.\n\nBitcoin's resurgence continued and was holding well above $US100,000 over the weekend.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/cash-only-versus-card-only-businesses-sydney-cost-for-consumers/105159204",
    "title": "Cash v card-only debate ahead of government mandate on businesses",
    "publish_date": "Sun, 11 May 2025 21:23:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Notes and coins aren't just favoured at this inner west Sydney restaurant — they're king.\n\nNestled near the gelato booth lies an ATM machine inside the Leichhardt venue, with \"cash only\" signs on display.\n\nCash has been the primary source of payment here since 1952.\n\n\"We're just continuing a legacy,\" Bar Italia owner Con Damouras said.\n\nThere's no chance of skim, light or soy milk in your coffee either. Mr Damouras prefers the \"old school trattoria\" approach.\n\nCon Damouras says the majority of his customers are happy to pay for their meals in cash. (ABC News: Greg Bigelow)\n\nThe business doesn't take credit cards. Instead, an in-house ATM is available, which has a $2.50 withdrawal fee, or there are other outlets along Leichhardt's main strip.\n\nPost-pandemic, Mr Damouras installed an online payment form customers can use instore, though cash remains the predominant payment method.\n\n\"Some days people come in and say to you, 'Oh you're a tax thief, you're not paying the right tax'. It doesn't work that way when you've got a high-profile business like this … we always have done the right thing,\" he said.\n\n\"We keep our prices low, and we don't want to pay bank fees.\"\n\nCash only signs are on display in the trattoria. (ABC News: Greg Bigelow)\n\nGoing cashless not 'political' but 'pragmatic', says cafe\n\nSince 2017, Pablo & Rusty's Sydney CBD venue has been cashless.\n\n\"Initially there was some curiosity around it … questions around our motivation,\" operations manager and co-owner Chris Tate said.\n\n\"I think the majority of customers understood there was a degree of speed and convenience that resulted in us going cashless.\"\n\nChris Tate says his business has been card-only since 2017. (ABC News: Greg Bigelow)\n\n\"Efficient service\", no awkward cash handling and counting at the till and hygiene influenced the decision as well as operational challenges associated with holding cash, Mr Tate said.\n\n\"It's safer for our staff … we're not having to hold cash on site and send staff to the banks at the end of the shift.\"\n\nWhile visitors can use cash on their first visit if unaware of the rule, it's ultimately a card-only business model.\n\nSurcharges aren't passed onto takeaway orders, but for those who dine in, there are \"small fees attached\" for using the table ordering app service, Mr Tate said.\n\n\"We understand this can be a sensitive issue for some customers. It's not about making a political statement. It's a practical and pragmatic one.\"\n\n\"Efficient service\", no awkward cash handling at the till and hygeine were key reasons for this cafe going cashless. (ABC News: Greg Bigelow)\n\nSurcharges versus convenience, says economist\n\nLyla Zhang, associate professor in Macquarie University's Department of Economics, said while cash use had decreased, it still served a critical purpose.\n\n\"Cash use has declined to about 10 per cent of transactions in Australia — especially for older Australians or people living in remote areas,\" she said.\n\n\"It all comes to people's preferences and their circumstances.\n\n\" Both of them have pros and cons. \"\n\nWhen it comes to cash benefits, Dr Zhang said it helped people stick to a budget and avoid withdrawal transaction fees.\n\nLyla Zhang says it is up to consumers to choose whether convenience or avoiding surcharges is a higher priority for them. (ABC News: Marcus Stimson)\n\nConvenience wise though, card payments are the more streamlined option — but come with a catch.\n\n\"The card offers convenience, transparent transactions, rewards programs but it exposes people to overspending and surcharge fees,\" Dr Zhang said.\n\n\"Let's say the average household spending in Australia is around $3,000 per month. If the surcharge is only 1 per cent, this still means $30 per month for the family.\n\n\"This sounds very small, but over time they can accumulate.\"\n\nThe Reserve Bank of Australia estimated Australians lose nearly $1 billion in surcharges a year.\n\nConsumers urged to make 'informed decisions'\n\nAlthough the use of digital-only payments is likely to lead to paying more fees, Dr Zhang said consumers should simply \"be aware\" of surcharges.\n\n\"As an experimental and behavioural economist, I think we should all make informed decisions about which type of payment we want to to choose.\n\n\" We need to be aware of the benefits and cons of our choices. \"\n\nAustralians lose nearly $1 billion in surcharges a year, according to the RBA. (Unsplash: Blake Wisz)\n\nFor Mr Damouras, he carries both card and cash when shopping or dining, aware that \"if that's their policy\" either way, he will follow it.\n\nMr Tate added that it should continue to be up to individual businesses to choose what currency they primarily accept.\n\nAs Ms Zhang said: \"There's no one-size-fits-all solution.\"\n\nConfusion about future of cash\n\nIn November , the federal government announced it would mandate that businesses must accept cash when selling essential items from 2026 onwards.\n\nWhile details are to be ironed out post-election, Mr Tate remained unsure if his cafe would be deemed \"essential\" and therefore subject to the rule.\n\n\"If we're having to cover the additional cost of handling cash … that poses significant challenges for small businesses,\" he said.\n\nThe federal government plans to require some businesses to accept cash. But is there still a need for it? Photo shows Close up of a hand holding cash money and coins over images of fruit and cup of coffee The federal government plans to require businesses to accept cash as payment. But as its use continues to decline, the role of cash is becoming more niche.\n\nIn a statement an Australian Competition and Consumer Commission (ACCC) spokesperson said that currently \"businesses can choose which payment types they accept\" though transparency is key.\n\n\"Businesses should be clear and up-front about the types of payments they accept, any applicable payment surcharges, and the total minimum price payable for their goods and services.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-12/giro-d-italia-stage-three-dogs-goats-mads-pedersen/105280436",
    "title": "Goat almost takes out NZ rider as animals interrupt third stage of Giro",
    "publish_date": "Sun, 11 May 2025 21:09:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Even goats and dogs could not distract Mads Pedersen from reclaiming the leader's jersey on the third stage of the Giro d'Italia.\n\nIt all went to plan for Pedersen, who won a bunch sprint to snatch back the pink jersey with his second victory in this year's race.\n\nPedersen, who rides for Lidl-Trek, edged Corbin Strong by half a wheel at the end of the hilly 160-kilometre leg that started and finished in the Albanian coastal city of Vlorë.\n\nHow this understated Aussie could upset the Giro favourites Photo shows Michael Storer competes at Paris Nice in the snow There are 14 Australian riders riding this year's Giro d'Italia, but Michael Storer is coming in with red-hot form and a dream of usurping the long list of favourites, who will have their own Aussie riders in support.\n\nPedersen also won the opening stage but pre-race favourite Primož Roglič took the pink jersey from him after the time trial.\n\nPedersen has moved back into pink, ahead of two more sprint stages back in Italy. The Danish cyclist has a nine-second lead over Roglič and is 14 seconds ahead of Czech rider Mathias Vacek.\n\n\"Wow, to have two stage victories already and now back in the pink, that's exactly what we wanted today. This was the plan,\" Pedersen said.\n\nPedersen's plan almost did not come off, though, as a dog raced across the road in the finale, narrowly avoiding the surging peloton with just over 2 kilometres remaining.\n\nEarlier, several goats scampered across the road, with riders having to swerve to avoid them and New Zealand cyclist Dion Smith almost ending up in a ditch as one jumped at him.\n\n\"First time for a goat for me,\" Smith said with a laugh.\n\n\"I didn't have too much time to think but I could see it 10 seconds before, the policeman trying to keep them all in and then one or two started coming across and I don't know which way I was going to go, but luckily I stayed up.\"\n\nSmith said the peloton's sojourn to Albania had been \"great\", with one exception.\n\n\"They've done really well, I've definitely enjoyed it and it was a different experience, but … just watch out for the goats,\" he said.\n\nAfter Jay Vine had crashed on stage one and Luke Plapp in the time trial, there were no further calamities for the 14-strong Australian contingent, but Plapp looked to be still feeling the effects of his spill as he trekked home nearly six-and-a-half minutes off the pace.\n\nBut Michael Storer, the Tudor Pro team leader who is the best hope for Australian success, was in sprightly mood in the mountains and finished among the main bunch to still lie ninth overall, 36 seconds behind as the race prepares to move to the Italian mainland after its Albanian adventure.\n\nAmong the Australians, Chris Hamilton (Team Picnic PostNL) climbed strongly in an early breakaway and came home safely in the main bunch, as did 2022 winner Jai Hindley (Red Bull-BORA-hansgrohe), who leaves Albania only 48 seconds down in 15th overall.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nVine, third in the time trial, again looked to be well recovered from opening day crash as he finished among the main peloton.\n\nIt was the last of three stages in Albania before the peloton makes the short transfer across the Adriatic to the Italian region of Puglia, where the race will resume after a rest day.\n\nThe fourth stage travels through much of the heel of Italy along a mostly flat, 189km route from the UNESCO World Heritage site of Alberobello to Lecce.\n\nThe race ends in Rome on June 1.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/AAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/just-not-business-robbo-rips-knights-as-young-talks-stall-20250512-p5lyfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Just not business': Robbo rips Knights as Young talks stall",
    "publish_date": "Mon, 12 May 2025 12:03:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Just not business': Robbo rips Knights as Young talks stall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-needs-to-make-a-nothingburger-deal-with-china-20250512-p5lydb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump needs to make a ‘nothingburger’ deal with China",
    "publish_date": "Mon, 12 May 2025 11:57:55 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "China would be aware that it only has to give Trump the appearance of a win for him to move on. It also believes that the US is in a weaker negotiating position today than it was in 2020. The flight of capital from the US since Liberation Day, the volatility in markets, the implications of the Trump tariffs for US inflation, interest rates and economic growth and the shock to US consumers as shelves are emptied and prices soar mean that the pressure on Trump can only intensify the longer his trade war on everyone continues. Xi Jinping will be very aware that Trump will need to save face in a deal between the US and China. Credit: AP China’s restrictions on exports of rare earths, magnets and strategic metals to the US will also be extremely damaging to a range of American industries, including those supplying its military. There are few alternate suppliers of those strategic minerals, with China holding near-monopoly positions in them.\n\nChina will also hurt if the US tariff rate remains at current levels, but it has diversified its export destinations since 2020 and is now less exposed to the US and Trump’s tariffs. The International Monetary Fund has concluded that the damage will be greater for the US than for China –it says the hit to US GDP will be 90 basis points against China’s 60 basis points. Loading With China’s shipments to the US having almost completely stopped – already the West Coast ports are reporting container volumes have dropped by at least a third – the impact of Trump’s tariffs are going to show up imminently in higher prices for US consumers, lower margins for US companies, empty shelves in retail outlets and rising stress and bankruptcy rates for small businesses. So, how does Trump extricate himself from the worst element of his trade wars, the 145 per cent tariff on imports from China and China’s 125 per cent “tit-for-tat” response? It’s not by suggesting, as he did in a post on Truth Social on Friday, that an 80 per cent rate “seems right.” At 80 per cent (a rate the White House press secretary later said was simply one that Trump “threw out there”) there’d still be little, if any, trade between the countries.\n\nThe US Commerce Secretary, Howard Lutnick, has suggested the “reciprocal” element of the tariff might settle around 34 per cent. With the tariffs left in place after the 2018-19 trade confrontation, that would produce a rate just above 50 per cent, which would still be very damaging but probably allow some limited trade between the economies to continue. In exchange for the reduced tariffs, the US would want China to agree to choke off the supply of the precursor chemicals used in fentanyl production, to lift its effective embargo on exports of critical minerals and open up its markets to US companies. US Treasury Secretary, Scott Bessent, and US trade representative Jamieson Greer left the talks in a bullish mood. Credit: AP If there is to be an eventual deal, Bessent and He Lifeng might have to come up with a formula within a press release that makes it look like Trump has gained something, without making it appear Xi Jinping has lost. What they need is another “nothingburger” deal. On Friday, China’s April trade data was released. It showed its exports, rather than being battered by the trade war, rose 8.1 per cent year-on-year. While that growth was more subdued than the rate experienced in March, where exports were growing at 12.4 per cent, it was massively above consensus expectations.\n\nExports to the US, however, which were growing at a rate of more than 9 per cent in March, slumped by more than 21 per cent in April. That says two things. One is that the tariffs have already, within weeks, resulted in a very significant drop in the volume of goods being shipped to the US and the other is that China has quickly redirected those goods to other markets, mainly within South-East Asia and potentially for transshipment to the US via countries with lower tariffs. China would be aware that it only has to give Trump the appearance of a win for him to move on. Trump’s ill-conceived reciprocal tariffs will, because countries will have different tariff rates, force the US to play an endless game of “whack-a-mole” with Chinese exports that are already showing how dynamic and opportunistic they are. Whatever the final outcome of the talks between the US and China might be, while Trump’s 10 per cent universal baseline tariff remains in place and China and others face reciprocal tariffs -- even if reduced from their original punitive levels -- the effective average US tariff will be many multiples of the 2.5 per cent or so level before Trump began this trade war.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/property/news/half-a-million-dollars-in-two-years-vendors-make-tidy-profit-from-hawthorne-home-20250512-p5lydv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Half a million dollars in two years: Vendors make tidy profit from Hawthorne home",
    "publish_date": "Mon, 12 May 2025 11:53:31 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "In nearby Camp Hill, a knockdown house on a rare 809-square-metre block at 43 Melbourne Avenue fetched an eye-watering $2.275 million – almost $400,000 over the reserve. A local builder nabbed the keys with a final $1000 bid and plans to knock down the home, split the block and build two luxury homes. The knockdown house at 43 Melbourne Avenue, Camp Hill. Credit: Place Estate Agents Selling agent Shane Hicks, of Place Estate Agents, said demand for new-builds in the suburb fuelled the runaway price, combined with the block’s subdividable potential. “The campaign itself was never about the home, and we didn’t even have the power turned on during the open home inspections,” he said.\n\n“In fact, the final three bidders didn’t even walk through it. “The buyer came right at the end of the auction and at one stage it was just going up in $1000 bids. It came down to three different developers … and this shows how strong demand is for new homes.” 43 Melbourne Avenue, Camp Hill, sold for $2.275 million to a local builder. Credit: Place Estate Agents They were two of 93 scheduled auctions in Brisbane over the past week. An old one-bedroom East Brisbane worker’s cottage fetched a jaw-dropping $1.58 million after drawing one of the largest fields of bidders seen at an auction in years.\n\nIn front of a packed crowd, a near-record 32 registered bidders battled it out for 23 Kennedy Street. A local buyers’ agent kicked off the auction with a bold $1.25 million bid that whittled the field down to 10 active bidders. From there the price climbed in cautious increments, with three determined punters fighting it out over the final $100,000 . The low-set, post-war home sits on a 506-square-metre corner block in one of the city’s fastest-evolving pockets, luring a mix of owner-occupiers, developers and builders chasing a rare slice of versatility. In the end, a local builder outlasted a developer and a family to secure the keys. He plans to rent the property in the short term while exploring town planning options.\n\nSelling agent Brandon Wortley, of Ray White Bulimba, said the home had remained in the same family for 45 years – a fact he said fuelled the sheer level of buyer interest and intrigue. “East Brisbane has been earmarked as a big development precinct and it’s so topical right now. And this block in particular has so much versatility,” Wortley said. “I think East Brisbane will really go places in the next few years and while it’s hard to say how much growth it has collected in the past year, I know that homes I appraised 12 months ago for $1.5 million are being appraised for $1.8 million now.” While he was unable to disclose the reserve, Wortley confirmed the sale price was “well above” the figure set. In Belmont, an unpolished four-bedroom home on a 580-square-metre block at 2 Lychee Place sold for $1.48 million to a local family following a long, drawn-out auction.\n\nBidding opened at $1.3 million, with three of the four registered bidders fighting to take it home. “There were so many bids we ran out of paper,” said selling agent Gaby McEwan, of McGrath Wynnum/Manly. “I think the proximity to the park, and the fact the home was in such a nice pocket with great bones and a great floor plan made it so appealing. “The eventual buyer materialised early on in the campaign. She lives locally and actually grew up here.”",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-nine-seats-still-too-close-to-call-with-brisbane-division-on-knife-edge-20250509-p5lxyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Ryan, Longman still too close to call; Suncorp Stadium to host Royal Edinburgh Military Tattoo; Police probe alleged assault at prestigious club",
    "publish_date": "Mon, 12 May 2025 11:47:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "The world-famous Royal Edinburgh Military Tattoo is coming to Brisbane next year after the Queensland government pursued the hosting rights for the stadium spectacular.\n\nBrisbane will host the Australian leg of the Tattoo’s 75th anniversary tour at Suncorp Stadium from February 12 to 15.\n\nThe Royal Edinburgh Military Tattoo will perform exclusively at Suncorp Stadium in Brisbane in February 2026. Credit: Royal Edinburgh Military Tattoo\n\nThe performances are expected to generate $39 million in economic benefits for the state, according to Queensland Tourism Minister Andrew Powell.\n\nHe said the state had “pursued” hosting the event, but would not be drawn on the specific funding arrangements.\n\nThe Tattoo’s creative director Alan Lane told ABC Radio this morning the event was “working with our Australian partners to make sure that we honour the right people and we honour the right cultures” for its Brisbane shows.\n\n“Some of the best pipers and dancers that we have in our show come from Australia and come from Brisbane and Queensland,” he said.\n\nThe event is held annually in Scotland’s Edinburgh castle and is famous for its mass bagpipe players, marching bands, Highland dancers, and military displays.\n\nIt is the first time the Tattoo, which has grown over seven decades to become a stadium spectacular, has come to Australia since 2019.\n\nTickets for the shows will go on sale on May 21.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/nine-entertainment-secures-broadcast-rights-for-three-more-rugby-world-cups-20250512-p5lyed.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nine Entertainment secures broadcast rights for three more Rugby World Cups",
    "publish_date": "Mon, 12 May 2025 11:46:33 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Nine Entertainment has solidified its standing as the home of rugby by landing broadcast rights to three more World Cups, including a blockbuster home men’s tournament in Australia in 2027.\n\nWorld Rugby chairman Brett Robinson confirmed the new broadcast deal with Nine and Stan Sport at a media conference at Allianz Stadium in Sydney on Monday morning.\n\nNine Entertainment is partnering with World Rugby to broadcast the 2025, 2027 and 2029 World Cups. Pictured (from left): Rugby Australia CEO Phil Waugh, Nine Entertainment CEO Matt Stanton, Wallaroo Piper Duck, Wallaby Max Jorgensen, cross-code star Sonny-Bill Williams, Wallaby great Tim Horan and World Rugby chairman Brett Robinson. Credit: Oscar Colman\n\nNine and Stan Sport, Rugby Australia’s broadcast partners until 2030, will show the men’s 2027 World Cup in Australia, as well as the two women’s showpiece events in 2025 and 2029.\n\nAustralia hasn’t hosted a men’s World Cup since 2003, a tournament where England star Jonny Wilkinson kicked a drop goal to sink the Wallabies in the final.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/property/news/pretty-surprised-young-couple-spends-1-58m-on-stylish-flemington-reno-20250512-p5lycw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Pretty surprised’: Young couple spends $1.58m on stylish Flemington renovation",
    "publish_date": "Mon, 12 May 2025 11:45:52 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A young couple paid $1,585,000 for a recently renovated three-bedroom Victorian home in Flemington under the hammer on Saturday.\n\nThe home at 44 Brighton Street, positioned on a prestige, tree-lined pocket of Flemington, was listed with a price range of $1.3 million to $1.4 million and had a reserve of $1.42 million.\n\n“The well-considered, quality renovation that included installation of solar panels and double-glazed windows was definitely one of the factors that attracted the bidders,” said lead agent and auctioneer from Jellis Craig Kensington, Jerome Feery.\n\nThe tightly held pocket and convenient location near public transport, markets, and restaurants also generated interest.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/world/pope-leo-xiv-sings-the-regina-caeli-to-a-massive-crowd-20250512-p5lyeg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pope Leo XIV sings the Regina Caeli to a massive crowd",
    "publish_date": "Mon, 12 May 2025 11:42:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Pope Leo XIV sings the Regina Caeli to a massive crowd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/getting-sacked-is-not-a-bad-thing-for-ange-postecoglou-20250512-p5lybr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Getting sacked is not a bad thing for Ange Postecoglou",
    "publish_date": "Mon, 12 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Sam Wallace"
    ],
    "text": "Is getting sacked as manager of Tottenham Hotspur necessarily a bad thing for the career of a coach?\n\nBeing martyred by Spurs chairman Daniel Levy certainly has its benefits at a club where successive incumbents, and indeed players themselves, have argued that the point of Spurs is something other than winning.\n\nWhat is that? That Levy gets to run the club his way, and all else takes its place accordingly. All Spurs managers come up against the intractable problems of a fanbase at odds with Levy and whoever might now control what was the Joe Lewis stake in Enic, the investment company that holds an 86.58 per cent stake in the club.\n\nAll of which renders supporter patience paper-thin. While they might be up against better-resourced clubs with wealthier owners, Spurs might reasonably have expected to have won more trophies than just three in more than four decades, and only one under Enic.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/property/news/sydney-family-splashes-23-5m-on-showstopper-oceanfront-bronte-home-20250512-p5lycv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney family splashes $23.5m on showstopper oceanfront Bronte home",
    "publish_date": "Mon, 12 May 2025 11:38:50 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "An eastern suburbs family paid $23.5 million for an award-winning, north-facing Bronte property that had been guided at $23 million at auction on Saturday after four buyers competed for it.\n\nThe three-storey home, at 31a Yanko Avenue, holds a commanding oceanfront position and offers water views from nearly every room.\n\nBidding began at $21 million and rose in increments of $500,000 and $250,000. Smaller, slightly erratic bids of $50,000, $10,000 and $5000 followed until the home sold under the hammer for $23.5 million, the highest price fetched at auction by a house in Bronte.\n\nFour families, all from the eastern suburbs who were looking to upsize, had registered and took part in bidding on the day, with a strong crowd of about 300 people admiring the afternoon vista.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Ryan likely to hold Kooyong after weekend count; Daniel yet to concede Goldstein; Peter Khalil, Julian Hill join ALP colleagues in Canberra",
    "publish_date": "Mon, 12 May 2025 11:37:36 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "It didn’t feel like a defining moment at the time. But looking back, it probably was.\n\nAs week two of the campaign for Wills drew to a close, Labor’s Peter Khalil stood on an outdoor basketball court in North Fitzroy, announcing $3.7 million to rebuild Linear Park, which includes one of the busiest bike paths in the country.\n\nOnce an old rail line, it became green space under former Wills MP and prime minister Bob Hawke. Now, here Khalil was with Yarra Council’s socialist mayor Steve Jolly promising to help rebuild it.\n\nAbout 100 people were gathered, far more than the few dozen at a debate in Fawkner the day before that Khalil had skipped. But this time, he’d shown up – in the heart of Greens territory, flanked by Boomers who’d ventured out from their multi-million-dollar homes on this sunny Sunday afternoon. Some were familiar from when I covered this area for The Melbourne Times 20 years ago.\n\nThe spending pledges didn’t stop at Linear Park: Gillon Oval, Fawkner Netball Club, Merri Creek – all were promised serious money. Khalil was offering a powerful marginal seat message: “I’m in government, I can bring home the goods.”\n\nFormer state Labor MP Carlo Carli put it plainly: “This was a masterful campaign based around this idea that ‘A Labor government can deliver, and here I am, ready to deliver’.”\n\nLabor MP Peter Khalil has won re-election in Wills. Credit: Gus McCubbing\n\nIt worked in the richer southern end of the electorate, where voters who long ago came over to the Greens could be persuaded back to Labor with two key messages: don’t risk Dutton, and keep the good stuff flowing.\n\nBut in the north of the seat – where many voters are Muslim, rent, or have grown tired of Labor taking them for granted – it was a different story.\n\nHere, Greens candidate Samantha Ratnam – who quit state parliament to run for the federal seat – made a strong pitch, promising to address rent hikes, the climate catastrophe, soaring costs and Gaza.\n\nIn a campaign where three Greens including leader Adam Bandt – and even Liberal leader Peter Dutton – were swept aside by Labor, Ratnam drove a 7 per cent swing against the party, pushing this once-safe seat to the brink. Against the national tide and a flat Labor incumbent, she turned Wills into a key contest.\n\nFor months, alongside her campaign, a group called Muslim Votes Matter had been urging voters to punish Labor explicitly over Gaza – at mosques, markets and community events.\n\nGreens candidate Samantha Ratnam, pictured with outgoing Greens leader Adam Bandt, at Brunswick East Primary School during the campaign. Credit: Getty\n\nTheir effort boiled over in week one of pre-polling, when a Labor staffer and a Palestinian activist clashed over a protest sign. Police were called.\n\nThe Greens picked up big swings in the Muslim-majority north. They even won a booth – John Fawkner Secondary College – for the first time, with a stunning 28 per cent swing on the two-party vote.\n\nWas it Gaza? Was it housing affordability pushing younger Greens voters into the outer north? Was it climate inaction? Probably all three and more. And yet, it wasn’t enough. Like all the times before that the Greens said they might win it, Wills didn’t flip.\n\nLabor’s showing in Wills though was notably weak compared to neighbouring Melbourne where the party notched a nine per cent swing and toppled Bandt. In Wills, Labor hung on by its fingernails, relying on incumbency, funding promises and fear of Peter Dutton to scrape over the line.\n\nOne of the most insightful interviews of this campaign was with Phil Cleary, who knows Wills as well as anyone. He believed Gaza could influence the vote. The former independent MP and Coburg football legend held the seat from 1992 to 1996 after Hawke resigned. He remains the only non-Labor MP ever to do so.\n\nKhalil, Cleary said, “is a victim of a party that won’t use words like genocide and won’t talk strongly about the killing of women and children in Gaza”. But Cleary wasn’t sure it would cost Labor the seat; he lost to the machine himself and knows how ruthless and effective ALP campaigning can be.\n\nFormer independent MP for Wills Phil Cleary. Credit: Luis Enrique Ascui\n\nBy the final week, Labor’s message came into focus as it used its financial might to blitz the seat with letterboxing and direct mail. One penned by Julia Gillard stuck tightly to the script: every seat lost helped Dutton become PM. Khalil still had PTSD from 2019, he said, when the ALP expected to win government and was beaten by Scott Morrison and his “miracle”.\n\nPre-polling was relentless. I was at the Brunswick booth every day bar one, and Khalil and Ratnam were both there each day that I visited.\n\nAnd while pre-poll in Brunswick was always a theatre of democracy, sometimes it was also farce.\n\nTake Romeo – a One Nation volunteer whose surname I never learned – wandering the line with an Australian flag and sometimes, inexplicably, an Italian one too.\n\nHe would chant “One flag, One Nation”. Could there be a suburb in Australia less welcoming to such sentiment than Brunswick? A man in a Collingwood jumper – notably Indigenous player Bobby Hill’s number 23 – pelted him with eggs.\n\nRomeo shrugged it off, but a couple of days later when he told me someone had threatened to shoot him, he went home, fashioned two metal plates into an ad hoc bulletproof jacket he placed over his shirt, then returned to the booth.\n\nOne Nation volunteer, Romeo, with his armour.\n\nOne Nation’s candidate got a 1 per cent swing, reaching 3.5 per cent of the primary vote. So it appears there’s room for everyone in Australian democracy it seems – even in Brunswick.\n\nThis is the third time I’ve covered one seat for an entire campaign like this. By the final days, it gives you clarity you don’t expect when you start. You come to understand the jostling, the ground game, and how broader issues – war, climate, housing, the cost of a cup of coffee – land differently from one suburb to the next.\n\nIn the end, that moment in North Fitzroy – a Labor MP promising money for a bike path – was more than a local funding pledge. It was a case study in how politics still works here: tangible, transactional, and attentive to who turns up.\n\nThe Greens harnessed fury over Gaza. They tapped disillusionment on climate. They tried to create a wave to surf home – only to find Labor knew Dutton was a tsunami. And Labor, when threatened, can still marshall money, endorsements and machine-like discipline.\n\nWills didn’t fall. But it shifted. Gaza cracked something open in the north where Labor’s hold can no longer be assumed. The Greens are now within 2 per cent of taking this seat. If their candidate in the next election is weaker, maybe the margin returns to Labor. But in a seat named after a failed explorer, I suspect this electorate is ready to chart a new course – even if, this time, it decided to wait a little longer.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/chad-michael-murray-on-reuniting-with-lindsay-lohan-20250512-p5lyfa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chad Michael Murray on reuniting with Lindsay Lohan",
    "publish_date": "Mon, 12 May 2025 11:18:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chad Michael Murray on reuniting with Lindsay Lohan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-small-but-experimental-granny-flat-that-provides-a-perfect-escape-20250423-p5ltq4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The small but experimental granny flat that provides a perfect escape",
    "publish_date": "Mon, 12 May 2025 11:13:04 +1000",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "The Love Shack in Bondi is designed to serve several purposes: It could be a guest room for a friend or grandparent, an office, or a living room for teenagers to escape from adults – or vice versa.\n\nDesigned by a young architectural practice, Second Edition, the one-room backyard pavilion with an en suite bathroom is getting a lot of love in this year’s awards from the NSW chapter of the Australian Institute of Architects. The 30 sq m standalone addition was shortlisted on Monday in three categories, including sustainability.\n\nJulia Danger at the Love Shack, an extension to her Bondi home. The Love Shack is a prototype built to minimise the massive amount of construction and demolition waste ending up in landfill. Credit: Louise Kennerley\n\nMade from salvaged materials and designed so most of it can be dismantled and reused, Love Shack was a prototype for how to reduce waste in the construction industry, said Second Edition director Shahar Cohen. “The easiest way to reduce waste, and to reduce carbon, is to build less,” she said.\n\nIt may be beautiful and experimental, but owners Will Dangar and wife Julia, founders of the landscape architect company Dangar Barin Smith, still call it a granny flat, or the shed.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/business/companies/backlash-against-net-zero-is-manna-from-heaven-for-fortescue-forrest-20250511-p5ly7k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Backlash against net zero is ‘manna from heaven’ for Fortescue: Forrest",
    "publish_date": "Mon, 12 May 2025 10:59:30 +1000",
    "category": "finance",
    "authors": [
      "Matt Oliver"
    ],
    "text": "The entrepreneur took on more established mining giants including Rio Tinto, BHP and Anglo American to make his fortune, supplying huge amounts of iron ore to China following a giant discovery in the Pilbara, Western Australia. Today, Fortescue is the fourth-largest iron ore producer in the world, and its founder is estimated to command a personal fortune of nearly $US15 billion ($23.4 billion). ‘I don’t talk about decarbonisation, OK? I just talk hard economics.’ Andrew Forrest Forrest has pledged to give all his riches to charity within his lifetime, and founded the philanthropic Minderoo Foundation with his wife, Nicola. They separated in 2023 and both stepped down from running the foundation last year, although they remain on the board. His Damascene conversion to the climate cause came after he nearly died in a 2016 hiking accident and spent his recovery studying marine ecology, and learning how global warming was ravaging the oceans.\n\nBy 2020, Forrest had declared that Fortescue would kick its own fossil fuel habit and instead become a pioneer of solutions to the problem “through invention”. Loading His overarching plan is for the company to slash costs by generating green energy and then profit by supplying the surplus to others. His biggest bet has been on developing electrolysers that can break down water into green hydrogen or reduce iron ore to “green iron” suitable for steelmaking. The plan for green metal production amounts to another bet on insatiable demand from China, while Forrest believes green hydrogen can become a “superfuel” that will replace natural gas and be burnt in power stations as a back-up for intermittent wind and solar farms everywhere.\n\nThrough his acquisition of UK-based Williams Advanced Engineering, the technology arm of the Formula 1 racing team, the billionaire is also pushing the development of high-tech batteries that will soon power Fortescue’s mining trucks and trains in the Pilbara. And he has been lobbying European governments, including Sir Keir Starmer’s administration in Britain, to back an ambitious proposal for a series of subsea cables that would carry abundant clean power to Europe from North Africa. Clean energy, hard economics Yet for Forrest, all this is about his balance sheet as much as it is about the planet. Fortescue is today valued at about $50 billion by the Australian sharemarket, with its shares having increased by about 600 per cent in the past decade. And Forrest believes switching to green energy is essential to its future.\n\n“I don’t talk about decarbonisation, OK? I just talk hard economics,” he insists. “That’s my driving interest as chairman of a super high-performing industrial group. And I’m on very safe ground.” He reels off statistics about the tens of millions of litres of diesel fuel the company burns through, costing it more than a billion dollars each year. By switching to mining equipment powered by electricity from wind and solar farms, he argues he can deploy the savings more productively elsewhere. The company is already using hydrogen-fuelled electric hybrid vehicles out in WA. And Forrest recently signed a $US2.8 billion ($4.4 billion) deal with Liebherr, the German-Swiss manufacturer, to buy 360 autonomous, battery-powered trucks, along with 55 electric excavators and 60 battery-powered bulldozers. The trucks will enter service from next year – a testament to Forrest’s stubbornness.\n\nHe says he originally approached US giant Caterpillar about a potential deal but was told it wasn’t possible before the 2030s at the earliest. So instead, his company partnered with Liebherr, a rival to Caterpillar, and is now providing the battery and drivetrain technology for the new trucks itself. “We said to Caterpillar, ‘We’ve gone into industries which refuse to have us before and replaced them, so maybe don’t do that,’ ” he says. “Now, the biggest order which has ever been placed in mining history got placed with a competitor – using our drive tracks.” ‘I’m a global investor, so I’m only going to go where I feel I’m loved.’ Andrew Forrest Lobbying Trump\n\nBut in other parts of the world, Forrest’s plans are suffering setbacks. Many experts remain sceptical about the economics of green hydrogen, due to the large amount of energy required to produce it and the difficulty of storing and transporting the notoriously leaky gas. In the US, Trump’s attempts to defund green energy tax credits introduced under former president Joe Biden may also spell disaster for a string of Fortescue-backed projects, from a proposed battery plant in Detroit to a hydrogen production plant in Phoenix, Arizona. For now, Forrest says all of these are “on hold” until the situation is clarified. But he has appealed to Trump’s business acumen, arguing that scrapping the Biden-era subsidies would be disastrous for investment in American manufacturing. Andrew Forrest with John Kerry (left) at the premiere of Ocean with David Attenborough in London. Credit: Jenny Magee “I’m a global investor, so I’m only going to go where I feel I’m loved,” he warns. “We’ll just press cancel. So it’s a really dangerous game. And if I was the US president, I’d be backing every single horse in the race.”\n\nStill, outside the US, the billionaire can count on some high-profile friends for support. Last week, friends including the King and John Kerry, Biden’s former climate envoy, joined Forrest at London’s Royal Festival Hall for a special screening of Sir David Attenborough’s latest documentary, Ocean with David Attenborough, which was half-funded by his foundation. His support for green causes has also won him the ear of other world leaders, including French President Emmanuel Macron and Indian leader Narendra Modi. Yet, while Forrest is an advocate for green energy, he has a surprising take on net zero. He detests corporate wheezes such as “carbon credits”, which he says will let companies carry on burning fossil fuels while patting themselves on the back. And he is equally scornful of climate activists who want the public to fly less or eat less meat.\n\n“That is a really crap argument,” he says. “We’re not asking for sacrifice. We’re not asking for de-growth. That’s so stupid.” Loading Instead, Forrest says companies such as his must stop climate change through sheer innovation. He wants Fortescue to reach what he calls “real zero” by 2040 – where fossil fuels are no longer used because there are better alternatives. “I believe net zero is a f---ing con,” he says. “Real zero is serious. Just stop burning fossil fuel.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/us-and-china-strike-a-deal-in-high-stakes-trade-talks/culb4xauc",
    "title": "US and China strike a deal in high-stakes trade talks",
    "publish_date": "Sun, 11 May 2025 22:09:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "US treasury secretary Scott Bessent and trade representative Jamieson Greer said they struck a deal with China to cut the US trade deficit at high-stakes talks.\n\n\n\n\n\nDescribing \"substantial progress\" in talks with Chinese officials on Sunday, the trade representatives say details will be announced today after two days of negotiations conclude in Geneva.\n\n\n\n\n\nBessent and Greer did not mention any plans to slash US tariffs of 145 per cent on Chinese goods and China's 125 per cent tariffs on US goods .\n\n\n\nWhat are the goals for these negotiations?\n\nThe meeting was the first face-to-face interaction between senior US and Chinese economic officials since US President Donald Trump's sweeping global tariffs aimed at tackling a national emergency he declared over growing US trade deficits.\n\n\n\n\n\n\"We're confident that the deal we struck with our Chinese partners will help us to work toward resolving that national emergency,\" Greer said.\n\n\n\n\n\nThe mutual US-China tariffs have brought nearly $600 billion in two-way trade to a standstill. China had insisted that tariffs be lowered in any talks.\n\n\n\nWhat has Trump said about the deal?\n\n\"A total reset negotiated in a friendly, but constructive, manner. We want to see, for the good of both China and the US, an opening up of China to American business. GREAT PROGRESS MADE!!!\" — Donald Trump, US President wrote on Truth Social.\n\n\n\nCould this be the end to the trade war?\n\nWith distrust running high, both sides have been keen not to appear weak, and economic analysts had low expectations of a breakthrough.\n\n\n\n\n\nTrade Representative Jamieson Greer called Chinese vice premier He Lifeng, vice commerce minister Li Chenggang and vice finance minister Liao Min \"tough negotiators\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 9
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/a-story-of-love-resilience-and-achievement-on-international-nurses-day/70pj3wzy1",
    "title": "A story of love, resilience, and achievement on International Nurses Day",
    "publish_date": "Sun, 11 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"My name is Narges, I am your nurse for this morning. If you don't mind, I'll just check your blood pressure.\"\n\n\n\n\n\nFor Narges Rezai, nursing was never just a job — it was a dream, a calling... and her way out.\n\n\n\n\n\nBorn in Iran to a Hazara-Afghan family, she grew up in a world where girls were not allowed to pursue higher education.\n\n\n\n\n\n\"Here... I am daddy's girl, still I am daddy's girl, he is watching me. Look at the family!\"\n\n\n\n\n\nNarges' father was her guiding light.\n\n\n\n\n\nHer dad was no longer in the picture, after he died in a car crash when she was just a child.\n\n\n\n\n\nHer mother — only 37 at the time — was left to raise seven kids on her own.\n\n\n\n\n\n\"When I lost my dad I said I feel like I lost everything, because he was my dad. But then again, I could see my mum and my little brothers and sisters, everyone, we were in a terrible situation.\"\n\n\n\n\n\nNarges put her schooling on hold to learn how to weave and sell silk rugs — to support her family.\n\n\n\n\n\nShe moved to Australia in 2009, arriving with no English and no qualifications.\n\n\n\n\n\nToday, after years of hard work, Narges is a trauma nurse at Royal Perth Hospital — caring for some of the most critical patients.\n\n\n\n\n\n\"It is a challenging place, and it can be stressful, but at the end of the day, you are looking after the patient who are very sick. And you can see them from the day they were really sick, and until the day they are getting better, that is so rewarding.\"\n\n\n\n\n\nShe's one of many migrant nurses filling urgent workforce gaps in Australia's healthcare system.\n\n\n\n\n\nBut for internationally trained nurses, accreditation has long been a slow and complex process.\n\n\n\n\n\nNow, Australia's main nursing union is welcoming long-overdue reforms.\n\n\n\n\n\nAnnie Butler is from the Australian Nursing and Midwifery Association.\n\n\n\n\n\n\"So often people would come, and they can't get one part of the process fixed before their visas run out so they have to leave the country.\"\n\n\n\n\n\nFollowing an independent review, the Federal Government has expanded fast-track registration pathways.\n\n\n\n\n\nSince March, nurses from Singapore, the UK, Ireland, the US, Spain, and parts of Canada have been eligible for fast-tracked registration.\n\n\n\n\n\nIt reduces application times by up to 6 to 12 months... provided they’ve worked at least 18-hundred hours since 2017.\n\n\n\n\n\nHealth Minister Mark Butler says the workforce is changing.\n\n\n\n\n\n\"We've got three times as many overseas trained nurses now coming into the country, as was happening before the COVID pandemic.\"\n\n\n\n\n\nThe union’s Annie Butler says while it is a step in the right direction, the focus should be on retention.\n\n\n\n\n\n\"While immigration is a part of the issue, increasing nursing training numbers is a part of the issue, once they are there, we got to keep them. We got to make sure we've got decent wages, decent conditions.\"\n\n\n\n\n\nFor Narges, the chance to give back to the country that gave her a second chance... is deeply personal.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-to-ask-for-a-pay-rise/3vj1wezbz",
    "title": "Six tips for asking for a pay rise 'the right way'",
    "publish_date": "Sun, 11 May 2025 19:42:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "While asking for a pay rise can be awkward, one researcher says there are tactics to help improve your likelihood of success.\n\n\n\n\n\nAustralian wages have stagnated in recent years and rising inflation combined with increased cost of living pressures have left workers worse off .\n\n\n\n\n\nAustralians are still living with the consequences of pronounced wage stagnation from 2012 to 2022, according to think tank Per Capita.\n\n\n\n\n\nA Per Capita report published in March found Australian workers experienced a \"lost decade\" of wage growth and the average yearly wage today is almost $12,000 lower than it would have been if wage growth had kept up with its historical average over that period.\n\n\n\n\n\nAnalysis from the Australia Institute published in November said Australian workers' living standards had dropped by roughly $8,000 over the last three years.\n\n\n\nREAD MORE Over a million Australians are too afraid to ask their employer this question\n\nFor those thinking about asking for a pay rise, David Cawley from recruitment company Hays told SBS News podcast Cost of Living Secrets that there are key considerations to make before broaching the topic.\n\n\n\nBring it up\n\nAccording to a Finder report published in April, one in five Australians requested a salary raise in the last year, with men more likely to ask than women (24 per cent of men compared to 14 per cent of women).\n\n\n\n\n\nWhile Cawley acknowledged that many people are uncomfortable speaking about money and workers may fear rejection, it's usually up to employees to raise the topic of raises.\n\n\n\n\n\n\"There's definitely some forward-thinking employers out there who will potentially broach that topic, typically [via] annual reviews, performance reviews. But generally I would suggest that needs to come from the employee,\" he said.\n\n\n\nLISTEN TO Could a flexible work arrangement work for you - and if so, how do you get one? SBS News 17/01/2025 08:49 Play\n\nWhile many businesses have been hit by the same economic stressors that workers are facing and salaries are a significant cost to businesses, Cawley said there's a \"right way\" to approach the topic.\n\n\n\nDo your research\n\nCawley said it's important for employees to substantiate why they're asking for pay rises and ensure they have the research to support their case for a pay rise.\n\n\n\n\n\nUnderstanding salary benchmarks in your industry, reviewing your contributions to the business and being able to articulate your perspective may increase your likelihood of success, he said.\n\n\n\n\n\n\"I think ultimately, for me, it's being able to substantiate: 'Why am I indispensable to my organisation?'\" he said.\n\n\n\nREAD MORE How to make work more flexible in 2025\n\nConsider what you're asking for\n\nCawley said the need for research also applies to the request itself and workers should have a clear idea of what they're asking for before they enter a meeting.\n\n\n\n\n\nWorkers should have a clear figure or percentage in mind, Cawley said.\n\n\n\n\n\nIn the case that a pay rise isn't possible, it may also be helpful to have a back-up request.\n\n\n\n\n\n\"Salary's not everything. Actually, a lot of the research we conduct and a lot of the feedback we get is salary is important, but time back is more important, and that's worth more than dollars,\" he said.\n\n\n\nREAD MORE The $3.8 billion reason Australian workers would leave their jobs\n\n\"So, if a salary is not forthcoming, what's your backup plan that you can negotiate on that may well compensate for not getting dollars?\"\n\n\n\nTiming\n\nTiming is also an important consideration for conversations about pay, Cawley said.\n\n\n\n\n\nFor larger organisations, annual review processes may be an ideal time to ask for a pay rise, while for smaller businesses it's advisable to think about the time of the year that could be easiest for the business.\n\n\n\n\n\n\"If the cafe's been closed through December and January because it's the holidays season, your timing's probably not going to be right if you bowl up on the first of February and say 'Right, we're reopening — I'd like a raise,\" Cawley said.\n\n\n\nIt's also important to consider that businesses that have performed poorly in the past financial year may be less open to these conversations.\n\n\n\nRaise other offers\n\nIf you've been offered a role at another organisation, this information can be included in the pay-rise conversation, but it has to be raised tactfully, Crawley said.\n\n\n\n\n\n\"My advice would be that you have been approached by other opportunities and at this stage, you're really happy, you're comfortable in the organisation that you're in and in your position — but it has obviously made you think because one of the components of those jobs is a higher salary,\" he said.\n\n\n\nSpeak to trusted sources\n\nWhile there are many courses or online platforms that can help to improve negotiation skills, Cawley said it is also advisable to get feedback from a trusted colleague or family member to help run through a pay rise request.\n\n\n\n\n\n\"There's a lot of content out there that's going to help you from a 'how to structure' — that sort of thing. But actually it's probably the emotion, in terms of how you deliver and broach that conversation that's gonna help you improve on the negotiation,\" he said.\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/when-will-albanese-key-policies-take-effect/pnkn4f1te",
    "title": "From tax changes to bulk billing, here's when Albanese's key policies are set to begin",
    "publish_date": "Sun, 11 May 2025 01:18:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese and Labor have entered a second term of government after winning the federal election in a landslide — but when will their key policy promises kick in?\n\n\n\n\n\nLabor has secured a majority in the House of Representatives and is currently predicted to hold at least 92 seats, compared to the Coalition's 40.\n\n\n\n\n\nThe party made a series of sweeping policy promises in the run-up to the election across a number of different sectors, including health care, education, and energy.\n\n\n\n\n\nHere's when those changes are due to come into effect.\n\n\n\nREAD MORE The many ways Australia will change under Anthony Albanese's second term\n\nHECS cut\n\nLabor has promised it will cut 20 per cent of all student loan debts, wiping around $16 billion in debt for around three million Australians.\n\n\n\n\n\nThis includes all HELP, VET Student Loan, Australian Apprenticeship Support Loans and other income-contingent student support loan accounts.\n\n\n\n\n\nWhen the government announced the policy in November, they said the cuts would come into effect by 1 June 2025, and Albanese recently said he will make it his first priority once parliament resumes .\n\n\n\nTax cuts\n\nAs part of their budget announcement, the Albanese government promised to introduce new tax cuts for every Australian taxpayer. The legislation for the cuts passed parliament in March.\n\n\n\n\n\nThe staggered cuts include an initial reduction in income tax rates from 16 per cent to 15 per cent from 1 July 2026.\n\n\n\n\n\nFrom 1 July 2027, the rate will be cut from 15 per cent to 14 per cent.\n\n\n\n\n\nFor workers who earn above $45,000, this will mean a further tax cut of $268 in 2026-27 and $536 from 2027-28.\n\n\n\nWorking from home tax deduction\n\nThe Albanese government has promised Australians working from home will be able to claim an instant $1,000 tax deduction to cover work expenses.\n\n\n\n\n\nAlbanese said this will provide \"permanent cost of living relief and make tax time quicker and easier for 5.7 million taxpayers\".\n\n\n\n\n\nThe government has said the tax deduction will come into effect for the 2026-27 financial year.\n\n\n\nInternational student visa fees\n\nTo fund some of their election promises, Labor announced in April that it would raise visa fees for international students from $1,600 to $2,000.\n\n\n\n\n\nThe increased fees are expected to deliver $760 million to the budget over the forward estimates and will come into place from 1 July.\n\n\n\nBulk billing\n\nA key pillar of Labor's campaign was a promise to introduce reforms to bulk billing , including expanding the bulk-billing incentive to all Australians and introducing a new incentive payment for practices that bulk bill every patient.\n\n\n\n\n\nLabor said these changes will mean that nine out of 10 GP visits will be bulk billed by 2030.\n\n\n\n\n\nThe changes to bulk billing incentives and the Bulk Billing Practice Incentive Program are both expected to come into effect on 1 November.\n\n\n\nLISTEN TO Labor's new frontbench confirmed; leadership contests underway for Greens, Liberals and Nationals SBS News 09/05/2025 04:11 Play\n\nSolar batteries\n\nThe government has promised to make renewable energy storage cheaper for households and small businesses by cutting the cost of home batteries.\n\n\n\n\n\nThe Cheaper Home Batteries Program will cut the cost of an installed battery by 30 per cent and come into effect from 1 July.\n\n\n\nSubsidised childcare\n\nIn February, the government passed legislation allowing families to access three days of subsidised child care .\n\n\n\n\n\nThe government said families earning between $50,000 to $100,000 are expected to save an average of $1,460 per year, and Labor considers it a stepping stone towards universal child care.\n\n\n\n\n\nActivity tests will be scrapped, meaning parents won't have to work or study to be eligible for childcare subsidies.\n\n\n\n\n\nThe changes will be in place from January 2026.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-mothers-day-but-are-you-your-mums-favourite-child/ilmybhrs7",
    "title": "It's Mother's Day - but are you your Mum's favourite child?",
    "publish_date": "Sat, 10 May 2025 22:26:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/palliative-care-in-multicultural-australia/qd3zu543s",
    "title": "Palliative care in multicultural Australia",
    "publish_date": "Sat, 10 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "This story has been produced in collaboration with SBS Greek.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFrances Davey's mother Virginia migrated to Australia from Greece about 70 years ago.\n\n\n\n\n\nNow 96 years old, she is receiving Palliative Care at Fronditha Care - an aged-care provider which specialises in assisting Australians from a Greek cultural background.\n\n\n\n\n\nMy mother speaks two languages [[butt]] Now that she's got dementia, she's gone back to her native language, and her early years in a little village, she doesn't live in Australia anymore, she's lost the last forty years. It's really important the cultural palliative care has been established.\n\n\n\n\n\nFrances says understanding and supporting her mother's cultural and spiritual needs is an important aspect to sensitive and dignified care.\n\n\n\n\n\nShe still would like all the religious ceremonies, the religious beliefs and the religious days, name days and Easter in particular, because she had lots of fond memories, that's good for her.\n\n\n\n\n\nCulturally Appropriate Palliative Care is addressed in a new online module launched this week ((launched Sunday)) by Dementia Australia in its 'Ask Annie App' in collaboration with the Fronditha Care Foundation.\n\n\n\n\n\nThis is Doctor David Sykes, Director at the Centre for Dementia Learning at Dementia Australia.\n\n\n\n\n\nThis new module on palliative care is really aimed at providing real life scenarios to workers to give them some valuable tips and strategies on how they can really provide valuable care and support.\n\n\n\n\n\nFaye Spiteri is Fronditha Care's CEO.\n\n\n\n\n\nAs people prefer to age in place, by the time they reach residential care, they are usually in a more advanced stage of an illness such as living with dementia, so it was very important to combine the palliative care module with dementia education so that our team members are better able to understand these issues that are inter-related.]]\n\n\n\n\n\nAccording to Palliative Care Australia, 400 people of all ages die of a terminal illness in Australia each day and could benefit from palliative care.\n\n\n\n\n\nCamilla Rowland, the CEO at Palliative Care Australia, says palliative care is a human right that can offer people support in their final days.\n\n\n\n\n\nOver 37% of older Australians over 65 come from other countries. So we have a multicultural society, so we need to ensure that everybody has an individualized person-centered care plan.]]\n\n\n\n\n\nIt's something registered nurse Waruni Garusingha feels passionate about.\n\n\n\n\n\nIn Greek Orthodox Traditions, they place a high importance on spiritual support, involving a priest to provide prayers and blessings, and also most of the Greek families prefer to be with their loved ones in their final moments, and also we usual put Greek icons in the room, soft music, they were also highlighted in the module.\n\n\n\n\n\nEncouraging a compassionate approach, to empower and respect the choices of those in their last years, months and days of life.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-environmental-footprint-of-ai/c02q43kiv",
    "title": "The environmental footprint of AI",
    "publish_date": "Sat, 10 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMore than 400 million weekly users making a total of one billion requests every single day - that's the estimated reach of ChatGPT.\n\n\n\n\n\nAnd it's just one company.\n\n\n\n\n\nThere are thousands of AI chatbots fielding an increasing number of queries.\n\n\n\n\n\nAnd while the technology may seem invisible to the average user, the environmental toll is significant, explains Dr Ascelin Gordon, a Senior Lecturer in Sustainability at Melbourne's RMIT University.\n\n\n\n\n\n\"When the big AI boom happened a few years ago, I became really interested in the environmental footprint that was resulting from our intense, growing AI usage. And so I began doing some research around looking at AI use and data centres and what the impacts were that resulted from those.\"\n\n\n\n\n\nDr Gordon explains that AI requires a lot of computer power both to train and deploy the technology.\n\n\n\n\n\n\"So AI basically runs in data centres. And when we have these AI models, they need to be first trained, which uses a lot of energy and resources. And so the training occurs running in these big data centres and then they need to be deployed where users can interact with them. The problem is you can have millions of users using an AI model every single day. And so the resources quickly add up. \"\n\n\n\n\n\nData centres, which house computing infrastructure, have been around for decades.\n\n\n\n\n\nUp until now, they've maintained a fairly stable appetite for power, but the AI boom is driving a surge in energy demands.\n\n\n\n\n\nResearch carried out by investment bank Goldman Sachs in 2024 suggests a single ChatGPT query uses nearly 10 times as much energy as a typical Google search.\n\n\n\n\n\nAnalysts at the time stated that AI could drive the kind of electricity growth which hasn’t been seen in a generation.\n\n\n\n\n\nEarlier this year, U-S President Donald Trump issued executive orders to allow some coal-fired power plants set for retirement to keep running, in part, to meet the rising demand of data centres .\n\n\n\n\n\nDr Gordon says data centres across the globe are expanding both by numbers and in size, as the technology becomes even more sophisticated.\n\n\n\n\n\n\"There's probably around up to 7,000 data centres all around the world and the number is rapidly growing. Now people are starting to do things like generate images and generate audio and even generate video. And doing those sorts of activities can use hundreds and thousands of times more electricity and water compared to just doing simple text queries.\"\n\n\n\n\n\nThe International Energy Agency, or the I-E-A, estimates that a single data AI focused centre consumes as much electricity as 100,000 households.\n\n\n\n\n\nAnd the largest ones under construction today will consume 20 times as much.\n\n\n\n\n\nFor context, however, these sprawling warehouses - located in almost every corner of the world - accounted for just 1.5 percent of global electricity consumption in 2024.\n\n\n\n\n\nBut the figure is expected to double by the end of the decade, according to the IEA research published in April.\n\n\n\n\n\nPower-hungry, and water-thirsty too.\n\n\n\n\n\nBy some estimates, between 20 and 50 prompts to an AI chatbot can require up to half a litre of water.\n\n\n\n\n\nProfessor Seyedali Mirjalili founded the Centre for Artificial Intelligence Research and Optimisation at Adelaide's Torrens University.\n\n\n\n\n\nHe says while the exact toll is difficult to quantify, data centres use vast amounts of water for cooling purposes.\n\n\n\n\n\n\"It depends on obviously the model that you use. Some of them are quite small, some of them are quite large. The data centre is where the data is stored, it's racks of servers so it requires a large amount of electric electricity to run those servers. And also you need a lot of waters to cool it down and that's where the water consumption comes in.\"\n\n\n\n\n\nAnd then, Dr Gordon says there's the issue of e-waste.\n\n\n\n\n\n\"As these data centres proliferate around the world, the amount of e-waste that the discarded computers that are used every time they're replaced is growing massively. So it's really important that we get on top of this e-waste problem.\"\n\n\n\n\n\nThere are growing calls for tech companies to be required to monitor the environmental costs of AI and for governments to implement sustainability standards.\n\n\n\n\n\nProfessor Mirjalili again.\n\n\n\n\n\n\"Other things that should be mandated and should be prioritised as well, like energy efficiency, water efficiency, or making sure that AI is aligned with human values. And I believe that this should be on the agenda for governments and large corporates.\"\n\n\n\n\n\nThere have been some improvements in efficiency, as well as investments in cleaner energy.\n\n\n\n\n\nIf done right, Professor Mirjalili says, AI has the potential to help drive down emissions.\n\n\n\n\n\n\"If you think about the emerging technology that have been able and will be able to help us to combat the challenges that global challenges, AI is definitely one of them. Forecasting, modelling of the emissions of different companies. So I would say those are good examples of where AI can help us to better understand and model climate change.\"\n\n\n\n\n\nThere's the potential to create a future where AI is tool in solving, rather than helping cause, the climate crisis.\n\n\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-fashion-week-2025-juanita-page-joseph-and-james/s405u0bwq",
    "title": "'Permission to play': How this designer is rethinking fashion for Australian men",
    "publish_date": "Sat, 10 May 2025 20:30:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "From her sunlit hotel suite in Darling Harbour, Juanita Page is putting the final touches on her debut solo runway show.\n\n\n\n\n\nThe collection features 25 lofty streetwear looks and draws inspiration from Page's playful and lively family gatherings.\n\n\n\n\n\nThe 33-year-old designer is a proud Gooreng Gooreng and South Sea Islander woman and one of a relatively small pool of women designing menswear in Australia. Her label, Joseph & James, blends streetwear ease with refined tailoring.\n\n\n\n\n\nIt's a signature that's earned her a place on this year's Australian Fashion Week (AFW) stage.\n\n\n\n\n\n\"It's definitely a massive milestone,\" Page says.\n\n\n\n\n\n\"We have no-one else to hide behind. It's just us.\"\n\n\n\nJuanita Page says she hopes her designs will spark conversation around men's fashion. Source: Supplied\n\nMenswear: A 'blank canvas'\n\nSpeaking with SBS News ahead of her AFW debut, Page admits the moment is both daunting and an honour.\n\n\n\n\n\nBut what excites her most is the chance to challenge how Australians think about menswear: Who gets to define it and the conversations around masculinity and risk-taking.\n\n\n\n\n\n\"We don't call women eccentric or attention-seeking when they go bold or take risks with fashion. We call it 'a look',\" she says.\n\n\n\nWe need to give men that same freedom.\n\nPage's desire to push the boundaries of traditional menswear was seeded early in her career while studying fashion design technology at RMIT.\n\n\n\n\n\n\"When I first started studying fashion, everyone instinctively gravitated toward women's wear,\" she says.\n\n\n\n\n\n\"That made me wonder: who is designing for anybody else? It became this creative blank canvas for me.\"\n\n\n\n\n\nThat instinctive curiosity led her to explore silhouettes, fabrics and stories often overlooked in men's fashion in Australia — and a sense of play that is now central to her label's identity.\n\n\n\nREAD MORE The Indigenous fashion designer making swimwear from recycled plastic\n\nEach collection is rooted in an overarching narrative, which Page says is shaped in part by her Indigenous heritage and connection to her community.\n\n\n\n\n\n\"Storytelling is a big part of culture for me, and every collection starts there,\" she says.\n\n\n\n\n\n\"For this collection, I thought about what values I learned growing up, and what we loved doing as a family. It always came back to food, gathering, sharing, making people feel welcome.\"\n\n\n\n\n\nHer AFW show is infused with those moments of connection: Kick-ons after a night out and backyard meals with family.\n\n\n\n\n\nPage says the clothes are designed to embody those memories of feeling relaxed, elevated and joyful.\n\n\n\n\n\n\"There's something about gathering over food that breaks down walls,\" she says.\n\n\n\n\n\n\"I wanted the clothes to reflect that feeling of ease and confidence, like when you're really yourself with the people you love.\"\n\n\n\nJoseph & James will debut their solo collection at Australian Fashion Week 2025. Source: Supplied\n\nPermission to play\n\nBeyond the AFW runway, that sense of ease and playfulness is also something Page hopes to bring to Australian menswear more broadly.\n\n\n\n\n\n\"I think men here tend to dress very understated, very functional,\" she says.\n\n\n\nBut what if dressing could be expressive too? What if we gave men permission to play?\n\nFor Page, moving away from functionality and towards expression doesn't have to come at the expense of sustainability.\n\n\n\n\n\nWhile she doesn't loudly promote Joseph & James as a sustainable brand, ethics are embedded in every stitch.\n\n\n\n\n\nFrom limited production runs that often fall below manufacturer minimums to her strict adherence to natural fibre use, Page says sustainability is foundational to the brand.\n\n\n\n\n\n\"We just think this should be the standard,\" she says.\n\n\n\n\n\n\"It costs more; it's harder as a small brand. But it matters.\"\n\n\n\nREAD MORE Country couture showcases First Nations fashions\n\nQuiet confidence\n\nOn the eve of AFW, which opens this week at Sydney's Carriageworks, Page says she's feeling reflective.\n\n\n\n\n\nThe runway might be her debut solo show, but she says it represents much more: A quiet reshaping of who menswear is for, how it feels and what it can become.\n\n\n\n\n\n\"If someone wears something they wouldn't normally try, and they feel good in it, then that's the win.\n\n\n\n\n\n\"Confidence builds in those moments. That's what I want our clothes to do.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/just-not-business-robbo-rips-knights-as-young-talks-stall-20250512-p5lyfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Just not business': Robbo rips Knights as Young talks stall",
    "publish_date": "Mon, 12 May 2025 12:03:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Just not business': Robbo rips Knights as Young talks stall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-needs-to-make-a-nothingburger-deal-with-china-20250512-p5lydb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump needs to make a ‘nothingburger’ deal with China",
    "publish_date": "Mon, 12 May 2025 11:57:55 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "China would be aware that it only has to give Trump the appearance of a win for him to move on. It also believes that the US is in a weaker negotiating position today than it was in 2020. The flight of capital from the US since Liberation Day, the volatility in markets, the implications of the Trump tariffs for US inflation, interest rates and economic growth and the shock to US consumers as shelves are emptied and prices soar mean that the pressure on Trump can only intensify the longer his trade war on everyone continues. Xi Jinping will be very aware that Trump will need to save face in a deal between the US and China. Credit: AP China’s restrictions on exports of rare earths, magnets and strategic metals to the US will also be extremely damaging to a range of American industries, including those supplying its military. There are few alternate suppliers of those strategic minerals, with China holding near-monopoly positions in them.\n\nChina will also hurt if the US tariff rate remains at current levels, but it has diversified its export destinations since 2020 and is now less exposed to the US and Trump’s tariffs. The International Monetary Fund has concluded that the damage will be greater for the US than for China –it says the hit to US GDP will be 90 basis points against China’s 60 basis points. Loading With China’s shipments to the US having almost completely stopped – already the West Coast ports are reporting container volumes have dropped by at least a third – the impact of Trump’s tariffs are going to show up imminently in higher prices for US consumers, lower margins for US companies, empty shelves in retail outlets and rising stress and bankruptcy rates for small businesses. So, how does Trump extricate himself from the worst element of his trade wars, the 145 per cent tariff on imports from China and China’s 125 per cent “tit-for-tat” response? It’s not by suggesting, as he did in a post on Truth Social on Friday, that an 80 per cent rate “seems right.” At 80 per cent (a rate the White House press secretary later said was simply one that Trump “threw out there”) there’d still be little, if any, trade between the countries.\n\nThe US Commerce Secretary, Howard Lutnick, has suggested the “reciprocal” element of the tariff might settle around 34 per cent. With the tariffs left in place after the 2018-19 trade confrontation, that would produce a rate just above 50 per cent, which would still be very damaging but probably allow some limited trade between the economies to continue. In exchange for the reduced tariffs, the US would want China to agree to choke off the supply of the precursor chemicals used in fentanyl production, to lift its effective embargo on exports of critical minerals and open up its markets to US companies. US Treasury Secretary, Scott Bessent, and US trade representative Jamieson Greer left the talks in a bullish mood. Credit: AP If there is to be an eventual deal, Bessent and He Lifeng might have to come up with a formula within a press release that makes it look like Trump has gained something, without making it appear Xi Jinping has lost. What they need is another “nothingburger” deal. On Friday, China’s April trade data was released. It showed its exports, rather than being battered by the trade war, rose 8.1 per cent year-on-year. While that growth was more subdued than the rate experienced in March, where exports were growing at 12.4 per cent, it was massively above consensus expectations.\n\nExports to the US, however, which were growing at a rate of more than 9 per cent in March, slumped by more than 21 per cent in April. That says two things. One is that the tariffs have already, within weeks, resulted in a very significant drop in the volume of goods being shipped to the US and the other is that China has quickly redirected those goods to other markets, mainly within South-East Asia and potentially for transshipment to the US via countries with lower tariffs. China would be aware that it only has to give Trump the appearance of a win for him to move on. Trump’s ill-conceived reciprocal tariffs will, because countries will have different tariff rates, force the US to play an endless game of “whack-a-mole” with Chinese exports that are already showing how dynamic and opportunistic they are. Whatever the final outcome of the talks between the US and China might be, while Trump’s 10 per cent universal baseline tariff remains in place and China and others face reciprocal tariffs -- even if reduced from their original punitive levels -- the effective average US tariff will be many multiples of the 2.5 per cent or so level before Trump began this trade war.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/property/news/half-a-million-dollars-in-two-years-vendors-make-tidy-profit-from-hawthorne-home-20250512-p5lydv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Half a million dollars in two years: Vendors make tidy profit from Hawthorne home",
    "publish_date": "Mon, 12 May 2025 11:53:31 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "In nearby Camp Hill, a knockdown house on a rare 809-square-metre block at 43 Melbourne Avenue fetched an eye-watering $2.275 million – almost $400,000 over the reserve. A local builder nabbed the keys with a final $1000 bid and plans to knock down the home, split the block and build two luxury homes. The knockdown house at 43 Melbourne Avenue, Camp Hill. Credit: Place Estate Agents Selling agent Shane Hicks, of Place Estate Agents, said demand for new-builds in the suburb fuelled the runaway price, combined with the block’s subdividable potential. “The campaign itself was never about the home, and we didn’t even have the power turned on during the open home inspections,” he said.\n\n“In fact, the final three bidders didn’t even walk through it. “The buyer came right at the end of the auction and at one stage it was just going up in $1000 bids. It came down to three different developers … and this shows how strong demand is for new homes.” 43 Melbourne Avenue, Camp Hill, sold for $2.275 million to a local builder. Credit: Place Estate Agents They were two of 93 scheduled auctions in Brisbane over the past week. An old one-bedroom East Brisbane worker’s cottage fetched a jaw-dropping $1.58 million after drawing one of the largest fields of bidders seen at an auction in years.\n\nIn front of a packed crowd, a near-record 32 registered bidders battled it out for 23 Kennedy Street. A local buyers’ agent kicked off the auction with a bold $1.25 million bid that whittled the field down to 10 active bidders. From there the price climbed in cautious increments, with three determined punters fighting it out over the final $100,000 . The low-set, post-war home sits on a 506-square-metre corner block in one of the city’s fastest-evolving pockets, luring a mix of owner-occupiers, developers and builders chasing a rare slice of versatility. In the end, a local builder outlasted a developer and a family to secure the keys. He plans to rent the property in the short term while exploring town planning options.\n\nSelling agent Brandon Wortley, of Ray White Bulimba, said the home had remained in the same family for 45 years – a fact he said fuelled the sheer level of buyer interest and intrigue. “East Brisbane has been earmarked as a big development precinct and it’s so topical right now. And this block in particular has so much versatility,” Wortley said. “I think East Brisbane will really go places in the next few years and while it’s hard to say how much growth it has collected in the past year, I know that homes I appraised 12 months ago for $1.5 million are being appraised for $1.8 million now.” While he was unable to disclose the reserve, Wortley confirmed the sale price was “well above” the figure set. In Belmont, an unpolished four-bedroom home on a 580-square-metre block at 2 Lychee Place sold for $1.48 million to a local family following a long, drawn-out auction.\n\nBidding opened at $1.3 million, with three of the four registered bidders fighting to take it home. “There were so many bids we ran out of paper,” said selling agent Gaby McEwan, of McGrath Wynnum/Manly. “I think the proximity to the park, and the fact the home was in such a nice pocket with great bones and a great floor plan made it so appealing. “The eventual buyer materialised early on in the campaign. She lives locally and actually grew up here.”",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-nine-seats-still-too-close-to-call-with-brisbane-division-on-knife-edge-20250509-p5lxyt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Ryan, Longman still too close to call; Suncorp Stadium to host Royal Edinburgh Military Tattoo; Police probe alleged assault at prestigious club",
    "publish_date": "Mon, 12 May 2025 11:47:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "The world-famous Royal Edinburgh Military Tattoo is coming to Brisbane next year after the Queensland government pursued the hosting rights for the stadium spectacular.\n\nBrisbane will host the Australian leg of the Tattoo’s 75th anniversary tour at Suncorp Stadium from February 12 to 15.\n\nThe Royal Edinburgh Military Tattoo will perform exclusively at Suncorp Stadium in Brisbane in February 2026. Credit: Royal Edinburgh Military Tattoo\n\nThe performances are expected to generate $39 million in economic benefits for the state, according to Queensland Tourism Minister Andrew Powell.\n\nHe said the state had “pursued” hosting the event, but would not be drawn on the specific funding arrangements.\n\nThe Tattoo’s creative director Alan Lane told ABC Radio this morning the event was “working with our Australian partners to make sure that we honour the right people and we honour the right cultures” for its Brisbane shows.\n\n“Some of the best pipers and dancers that we have in our show come from Australia and come from Brisbane and Queensland,” he said.\n\nThe event is held annually in Scotland’s Edinburgh castle and is famous for its mass bagpipe players, marching bands, Highland dancers, and military displays.\n\nIt is the first time the Tattoo, which has grown over seven decades to become a stadium spectacular, has come to Australia since 2019.\n\nTickets for the shows will go on sale on May 21.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/nine-entertainment-secures-broadcast-rights-for-three-more-rugby-world-cups-20250512-p5lyed.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nine Entertainment secures broadcast rights for three more Rugby World Cups",
    "publish_date": "Mon, 12 May 2025 11:46:33 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Nine Entertainment has solidified its standing as the home of rugby by landing broadcast rights to three more World Cups, including a blockbuster home men’s tournament in Australia in 2027.\n\nWorld Rugby chairman Brett Robinson confirmed the new broadcast deal with Nine and Stan Sport at a media conference at Allianz Stadium in Sydney on Monday morning.\n\nNine Entertainment is partnering with World Rugby to broadcast the 2025, 2027 and 2029 World Cups. Pictured (from left): Rugby Australia CEO Phil Waugh, Nine Entertainment CEO Matt Stanton, Wallaroo Piper Duck, Wallaby Max Jorgensen, cross-code star Sonny-Bill Williams, Wallaby great Tim Horan and World Rugby chairman Brett Robinson. Credit: Oscar Colman\n\nNine and Stan Sport, Rugby Australia’s broadcast partners until 2030, will show the men’s 2027 World Cup in Australia, as well as the two women’s showpiece events in 2025 and 2029.\n\nAustralia hasn’t hosted a men’s World Cup since 2003, a tournament in which England star Jonny Wilkinson kicked a drop goal to sink the Wallabies in the final.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/property/news/pretty-surprised-young-couple-spends-1-58m-on-stylish-flemington-reno-20250512-p5lycw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Pretty surprised’: Young couple spends $1.58m on stylish Flemington renovation",
    "publish_date": "Mon, 12 May 2025 11:45:52 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "A young couple paid $1,585,000 for a recently renovated three-bedroom Victorian home in Flemington under the hammer on Saturday.\n\nThe home at 44 Brighton Street, positioned on a prestige, tree-lined pocket of Flemington, was listed with a price range of $1.3 million to $1.4 million and had a reserve of $1.42 million.\n\n“The well-considered, quality renovation that included installation of solar panels and double-glazed windows was definitely one of the factors that attracted the bidders,” said lead agent and auctioneer from Jellis Craig Kensington, Jerome Feery.\n\nThe tightly held pocket and convenient location near public transport, markets, and restaurants also generated interest.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/world/pope-leo-xiv-sings-the-regina-caeli-to-a-massive-crowd-20250512-p5lyeg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pope Leo XIV sings the Regina Caeli to a massive crowd",
    "publish_date": "Mon, 12 May 2025 11:42:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Pope Leo XIV sings the Regina Caeli to a massive crowd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/getting-sacked-is-not-a-bad-thing-for-ange-postecoglou-20250512-p5lybr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Getting sacked is not a bad thing for Ange Postecoglou",
    "publish_date": "Mon, 12 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Sam Wallace"
    ],
    "text": "Is getting sacked as manager of Tottenham Hotspur necessarily a bad thing for the career of a coach?\n\nBeing martyred by Spurs chairman Daniel Levy certainly has its benefits at a club where successive incumbents, and indeed players themselves, have argued that the point of Spurs is something other than winning.\n\nWhat is that? That Levy gets to run the club his way, and all else takes its place accordingly. All Spurs managers come up against the intractable problems of a fanbase at odds with Levy and whoever might now control what was the Joe Lewis stake in Enic, the investment company that holds an 86.58 per cent stake in the club.\n\nAll of which renders supporter patience paper-thin. While they might be up against better-resourced clubs with wealthier owners, Spurs might reasonably have expected to have won more trophies than just three in more than four decades, and only one under Enic.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/property/news/sydney-family-splashes-23-5m-on-showstopper-oceanfront-bronte-home-20250512-p5lycv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney family splashes $23.5m on showstopper oceanfront Bronte home",
    "publish_date": "Mon, 12 May 2025 11:38:50 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "An eastern suburbs family paid $23.5 million for an award-winning, north-facing Bronte property that had been guided at $23 million at auction on Saturday after four buyers competed for it.\n\nThe three-storey home, at 31a Yanko Avenue, holds a commanding oceanfront position and offers water views from nearly every room.\n\nBidding began at $21 million and rose in increments of $500,000 and $250,000. Smaller, slightly erratic bids of $50,000, $10,000 and $5000 followed until the home sold under the hammer for $23.5 million, the highest price fetched at auction by a house in Bronte.\n\nFour families, all from the eastern suburbs who were looking to upsize, had registered and took part in bidding on the day, with a strong crowd of about 300 people admiring the afternoon vista.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/politics/federal/australian-federal-election-2025-live-results-victoria-key-swing-seats-news-updates-start-time-liberal-labor-independent-teal-kooyong-goldstein-wills-bruce-zoe-daniel-tim-wilson-peter-khalil-samantha-ratnam-julian-hill-zahid-safi-monique-ryan-amelia-hamer-20250502-p5lw46.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Victoria hot seats LIVE results: Ryan likely to hold Kooyong after weekend count; Daniel yet to concede Goldstein; Peter Khalil, Julian Hill join ALP colleagues in Canberra",
    "publish_date": "Mon, 12 May 2025 11:37:36 +1000",
    "category": "finance",
    "authors": [
      "Rachael Dexter",
      "Charlotte Grieve",
      "Clay Lucas",
      "Cara Waters"
    ],
    "text": "It didn’t feel like a defining moment at the time. But looking back, it probably was.\n\nAs week two of the campaign for Wills drew to a close, Labor’s Peter Khalil stood on an outdoor basketball court in North Fitzroy, announcing $3.7 million to rebuild Linear Park, which includes one of the busiest bike paths in the country.\n\nOnce an old rail line, it became green space under former Wills MP and prime minister Bob Hawke. Now, here Khalil was with Yarra Council’s socialist mayor Steve Jolly promising to help rebuild it.\n\nAbout 100 people were gathered, far more than the few dozen at a debate in Fawkner the day before that Khalil had skipped. But this time, he’d shown up – in the heart of Greens territory, flanked by Boomers who’d ventured out from their multi-million-dollar homes on this sunny Sunday afternoon. Some were familiar from when I covered this area for The Melbourne Times 20 years ago.\n\nThe spending pledges didn’t stop at Linear Park: Gillon Oval, Fawkner Netball Club, Merri Creek – all were promised serious money. Khalil was offering a powerful marginal seat message: “I’m in government, I can bring home the goods.”\n\nFormer state Labor MP Carlo Carli put it plainly: “This was a masterful campaign based around this idea that ‘A Labor government can deliver, and here I am, ready to deliver’.”\n\nLabor MP Peter Khalil has won re-election in Wills. Credit: Gus McCubbing\n\nIt worked in the richer southern end of the electorate, where voters who long ago came over to the Greens could be persuaded back to Labor with two key messages: don’t risk Dutton, and keep the good stuff flowing.\n\nBut in the north of the seat – where many voters are Muslim, rent, or have grown tired of Labor taking them for granted – it was a different story.\n\nHere, Greens candidate Samantha Ratnam – who quit state parliament to run for the federal seat – made a strong pitch, promising to address rent hikes, the climate catastrophe, soaring costs and Gaza.\n\nIn a campaign where three Greens including leader Adam Bandt – and even Liberal leader Peter Dutton – were swept aside by Labor, Ratnam drove a 7 per cent swing against the party, pushing this once-safe seat to the brink. Against the national tide and a flat Labor incumbent, she turned Wills into a key contest.\n\nFor months, alongside her campaign, a group called Muslim Votes Matter had been urging voters to punish Labor explicitly over Gaza – at mosques, markets and community events.\n\nGreens candidate Samantha Ratnam, pictured with outgoing Greens leader Adam Bandt, at Brunswick East Primary School during the campaign. Credit: Getty\n\nTheir effort boiled over in week one of pre-polling, when a Labor staffer and a Palestinian activist clashed over a protest sign. Police were called.\n\nThe Greens picked up big swings in the Muslim-majority north. They even won a booth – John Fawkner Secondary College – for the first time, with a stunning 28 per cent swing on the two-party vote.\n\nWas it Gaza? Was it housing affordability pushing younger Greens voters into the outer north? Was it climate inaction? Probably all three and more. And yet, it wasn’t enough. Like all the times before that the Greens said they might win it, Wills didn’t flip.\n\nLabor’s showing in Wills though was notably weak compared to neighbouring Melbourne where the party notched a nine per cent swing and toppled Bandt. In Wills, Labor hung on by its fingernails, relying on incumbency, funding promises and fear of Peter Dutton to scrape over the line.\n\nOne of the most insightful interviews of this campaign was with Phil Cleary, who knows Wills as well as anyone. He believed Gaza could influence the vote. The former independent MP and Coburg football legend held the seat from 1992 to 1996 after Hawke resigned. He remains the only non-Labor MP ever to do so.\n\nKhalil, Cleary said, “is a victim of a party that won’t use words like genocide and won’t talk strongly about the killing of women and children in Gaza”. But Cleary wasn’t sure it would cost Labor the seat; he lost to the machine himself and knows how ruthless and effective ALP campaigning can be.\n\nFormer independent MP for Wills Phil Cleary. Credit: Luis Enrique Ascui\n\nBy the final week, Labor’s message came into focus as it used its financial might to blitz the seat with letterboxing and direct mail. One penned by Julia Gillard stuck tightly to the script: every seat lost helped Dutton become PM. Khalil still had PTSD from 2019, he said, when the ALP expected to win government and was beaten by Scott Morrison and his “miracle”.\n\nPre-polling was relentless. I was at the Brunswick booth every day bar one, and Khalil and Ratnam were both there each day that I visited.\n\nAnd while pre-poll in Brunswick was always a theatre of democracy, sometimes it was also farce.\n\nTake Romeo – a One Nation volunteer whose surname I never learned – wandering the line with an Australian flag and sometimes, inexplicably, an Italian one too.\n\nHe would chant “One flag, One Nation”. Could there be a suburb in Australia less welcoming to such sentiment than Brunswick? A man in a Collingwood jumper – notably Indigenous player Bobby Hill’s number 23 – pelted him with eggs.\n\nRomeo shrugged it off, but a couple of days later when he told me someone had threatened to shoot him, he went home, fashioned two metal plates into an ad hoc bulletproof jacket he placed over his shirt, then returned to the booth.\n\nOne Nation volunteer, Romeo, with his armour.\n\nOne Nation’s candidate got a 1 per cent swing, reaching 3.5 per cent of the primary vote. So it appears there’s room for everyone in Australian democracy it seems – even in Brunswick.\n\nThis is the third time I’ve covered one seat for an entire campaign like this. By the final days, it gives you clarity you don’t expect when you start. You come to understand the jostling, the ground game, and how broader issues – war, climate, housing, the cost of a cup of coffee – land differently from one suburb to the next.\n\nIn the end, that moment in North Fitzroy – a Labor MP promising money for a bike path – was more than a local funding pledge. It was a case study in how politics still works here: tangible, transactional, and attentive to who turns up.\n\nThe Greens harnessed fury over Gaza. They tapped disillusionment on climate. They tried to create a wave to surf home – only to find Labor knew Dutton was a tsunami. And Labor, when threatened, can still marshall money, endorsements and machine-like discipline.\n\nWills didn’t fall. But it shifted. Gaza cracked something open in the north where Labor’s hold can no longer be assumed. The Greens are now within 2 per cent of taking this seat. If their candidate in the next election is weaker, maybe the margin returns to Labor. But in a seat named after a failed explorer, I suspect this electorate is ready to chart a new course – even if, this time, it decided to wait a little longer.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/chad-michael-murray-on-reuniting-with-lindsay-lohan-20250512-p5lyfa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chad Michael Murray on reuniting with Lindsay Lohan",
    "publish_date": "Mon, 12 May 2025 11:18:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chad Michael Murray on reuniting with Lindsay Lohan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-small-but-experimental-granny-flat-that-provides-a-perfect-escape-20250423-p5ltq4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The small but experimental granny flat that provides a perfect escape",
    "publish_date": "Mon, 12 May 2025 11:13:04 +1000",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "The Love Shack in Bondi is designed to serve several purposes: It could be a guest room for a friend or grandparent, an office, or a living room for teenagers to escape from adults – or vice versa.\n\nDesigned by a young architectural practice, Second Edition, the one-room backyard pavilion with an en suite bathroom is getting a lot of love in this year’s awards from the NSW chapter of the Australian Institute of Architects. The 30 sq m standalone addition was shortlisted on Monday in three categories, including sustainability.\n\nJulia Danger at the Love Shack, an extension to her Bondi home. The Love Shack is a prototype built to minimise the massive amount of construction and demolition waste ending up in landfill. Credit: Louise Kennerley\n\nMade from salvaged materials and designed so most of it can be dismantled and reused, Love Shack was a prototype for how to reduce waste in the construction industry, said Second Edition director Shahar Cohen. “The easiest way to reduce waste, and to reduce carbon, is to build less,” she said.\n\nIt may be beautiful and experimental, but owners Will Dangar and wife Julia, founders of the landscape architect company Dangar Barin Smith, still call it a granny flat, or the shed.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/business/companies/backlash-against-net-zero-is-manna-from-heaven-for-fortescue-forrest-20250511-p5ly7k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Backlash against net zero is ‘manna from heaven’ for Fortescue: Forrest",
    "publish_date": "Mon, 12 May 2025 10:59:30 +1000",
    "category": "finance",
    "authors": [
      "Matt Oliver"
    ],
    "text": "The entrepreneur took on more established mining giants including Rio Tinto, BHP and Anglo American to make his fortune, supplying huge amounts of iron ore to China following a giant discovery in the Pilbara, Western Australia. Today, Fortescue is the fourth-largest iron ore producer in the world, and its founder is estimated to command a personal fortune of nearly $US15 billion ($23.4 billion). ‘I don’t talk about decarbonisation, OK? I just talk hard economics.’ Andrew Forrest Forrest has pledged to give all his riches to charity within his lifetime, and founded the philanthropic Minderoo Foundation with his wife, Nicola. They separated in 2023 and both stepped down from running the foundation last year, although they remain on the board. His Damascene conversion to the climate cause came after he nearly died in a 2016 hiking accident and spent his recovery studying marine ecology, and learning how global warming was ravaging the oceans.\n\nBy 2020, Forrest had declared that Fortescue would kick its own fossil fuel habit and instead become a pioneer of solutions to the problem “through invention”. Loading His overarching plan is for the company to slash costs by generating green energy and then profit by supplying the surplus to others. His biggest bet has been on developing electrolysers that can break down water into green hydrogen or reduce iron ore to “green iron” suitable for steelmaking. The plan for green metal production amounts to another bet on insatiable demand from China, while Forrest believes green hydrogen can become a “superfuel” that will replace natural gas and be burnt in power stations as a back-up for intermittent wind and solar farms everywhere.\n\nThrough his acquisition of UK-based Williams Advanced Engineering, the technology arm of the Formula 1 racing team, the billionaire is also pushing the development of high-tech batteries that will soon power Fortescue’s mining trucks and trains in the Pilbara. And he has been lobbying European governments, including Sir Keir Starmer’s administration in Britain, to back an ambitious proposal for a series of subsea cables that would carry abundant clean power to Europe from North Africa. Clean energy, hard economics Yet for Forrest, all this is about his balance sheet as much as it is about the planet. Fortescue is today valued at about $50 billion by the Australian sharemarket, with its shares having increased by about 600 per cent in the past decade. And Forrest believes switching to green energy is essential to its future.\n\n“I don’t talk about decarbonisation, OK? I just talk hard economics,” he insists. “That’s my driving interest as chairman of a super high-performing industrial group. And I’m on very safe ground.” He reels off statistics about the tens of millions of litres of diesel fuel the company burns through, costing it more than a billion dollars each year. By switching to mining equipment powered by electricity from wind and solar farms, he argues he can deploy the savings more productively elsewhere. The company is already using hydrogen-fuelled electric hybrid vehicles out in WA. And Forrest recently signed a $US2.8 billion ($4.4 billion) deal with Liebherr, the German-Swiss manufacturer, to buy 360 autonomous, battery-powered trucks, along with 55 electric excavators and 60 battery-powered bulldozers. The trucks will enter service from next year – a testament to Forrest’s stubbornness.\n\nHe says he originally approached US giant Caterpillar about a potential deal but was told it wasn’t possible before the 2030s at the earliest. So instead, his company partnered with Liebherr, a rival to Caterpillar, and is now providing the battery and drivetrain technology for the new trucks itself. “We said to Caterpillar, ‘We’ve gone into industries which refuse to have us before and replaced them, so maybe don’t do that,’ ” he says. “Now, the biggest order which has ever been placed in mining history got placed with a competitor – using our drive tracks.” ‘I’m a global investor, so I’m only going to go where I feel I’m loved.’ Andrew Forrest Lobbying Trump\n\nBut in other parts of the world, Forrest’s plans are suffering setbacks. Many experts remain sceptical about the economics of green hydrogen, due to the large amount of energy required to produce it and the difficulty of storing and transporting the notoriously leaky gas. In the US, Trump’s attempts to defund green energy tax credits introduced under former president Joe Biden may also spell disaster for a string of Fortescue-backed projects, from a proposed battery plant in Detroit to a hydrogen production plant in Phoenix, Arizona. For now, Forrest says all of these are “on hold” until the situation is clarified. But he has appealed to Trump’s business acumen, arguing that scrapping the Biden-era subsidies would be disastrous for investment in American manufacturing. Andrew Forrest with John Kerry (left) at the premiere of Ocean with David Attenborough in London. Credit: Jenny Magee “I’m a global investor, so I’m only going to go where I feel I’m loved,” he warns. “We’ll just press cancel. So it’s a really dangerous game. And if I was the US president, I’d be backing every single horse in the race.”\n\nStill, outside the US, the billionaire can count on some high-profile friends for support. Last week, friends including the King and John Kerry, Biden’s former climate envoy, joined Forrest at London’s Royal Festival Hall for a special screening of Sir David Attenborough’s latest documentary, Ocean with David Attenborough, which was half-funded by his foundation. His support for green causes has also won him the ear of other world leaders, including French President Emmanuel Macron and Indian leader Narendra Modi. Yet, while Forrest is an advocate for green energy, he has a surprising take on net zero. He detests corporate wheezes such as “carbon credits”, which he says will let companies carry on burning fossil fuels while patting themselves on the back. And he is equally scornful of climate activists who want the public to fly less or eat less meat.\n\n“That is a really crap argument,” he says. “We’re not asking for sacrifice. We’re not asking for de-growth. That’s so stupid.” Loading Instead, Forrest says companies such as his must stop climate change through sheer innovation. He wants Fortescue to reach what he calls “real zero” by 2040 – where fossil fuels are no longer used because there are better alternatives. “I believe net zero is a f---ing con,” he says. “Real zero is serious. Just stop burning fossil fuel.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/bunnings-accused-of-misleading-customers-with-illusionary-price-tactic-on-shelves-230442484.html",
    "title": "Bunnings accused of misleading customers with 'illusionary' price tactic on shelves",
    "publish_date": "2025-05-11T23:04:42Z",
    "category": "finance",
    "authors": [],
    "text": "The hardware heavyweight has a much higher profit margin than both Woolworths and Coles, but has it flown under the radar?\n\nA sign hangs above a Bunnings ladder, with a promise to beat the price if it's found cheaper by a competitor. But that would never happen because Bunnings manufactures it. Source: ABC\n\nBunnings is among the nation's most trusted and recognisable brands. With over 55,000 staff across more than 300 stores around the country, it's up there with businesses like Qantas and Woolworths in terms of recognition and everyday presence in Australian life.\n\nWe've all heard its slogan, a commitment to beat any competitor’s price on the same stocked item by 10 per cent. But the offer might not be as good a deal as it appears, with the retailer being accused of being \"misleading\" and even \"illusionary\" when it comes to the famous promise.\n\nWhile it's true, Bunnings will beat a competitor's price should an individual customer find a better deal, it might be harder than most people think to actually do so.\n\nThat's because it stocks more than 9,000 homebrand products, which means those items are made for Bunnings, by Bunnings and are not stocked in other stores. For instance, the store's Citeco 0.9m 150kg ladder is priced at $115, and in one store recently visited by the ABC, a sign hanging above it boasted of the 10 per cent price beat \"guarantee\".\n\nADVERTISEMENT\n\nHowever shoppers will have a very hard time finding the item (or the Citeco brand) in any other retailer because no competitors stock it. Citeco is Bunnings' own brand, manufactured for and trademarked by the company, making the price promise effectively meaningless for that product.\n\nExperts say this practice extends to many other items as well, something that has been highlighted as part of an investigation into the market dominance of Bunnings by the ABC's 4 Corners program set to air on Monday night.\n\nBunnings has been accused of 'miseadling' its customers with its 10 per cent price guarantee. Source: Getty\n\nIs Bunnings misleading customers?\n\nCompetition lawyer and former chairman of Woolworths John Dahlsen, who now chairs his family's hardware store and building business, branded the concept deceptive. \"I think it's misleading,\" he told the ABC. \"The 10 per cent beat thing is illusionary.\"\n\nADVERTISEMENT\n\nBunnings doesn’t clearly disclose which products come from its lineup of home brands. Ownership of brands like Citeco isn’t visible on packaging, in-store, or online, and can only be confirmed through trademark registers or parent company, Wesfarmers' annual report. This is also the case with Bunnings' other home brands, including Jumbuck, Craftright, Marquee, Mondella, and Happy Tails.\n\nBunnings responds to ABC criticism of price policy\n\nFor its part, Bunnings insisted it uses a mix of owned brands and exclusive brands to differentiate its offer and give customers a choice, adding that its lowest prices policy applies across like-for-like products found in other stores with team members empowered to use a common sense approach when applying the policy.\n\nThe company said it stocks around 9,000 Bunnings-owned brands out of 300,000 home, commercial, and lifestyle products in-store and online.\n\nBunnings Managing Director Mike Schneider said the company strives to \"deliver the best possible value\" to customers. \"Every day we work hard to earn the trust of our customers, suppliers and communities through a genuine commitment to value, service and fairness, and we don’t take that trust for granted,\" he said in a statement shared with Yahoo on Monday.\n\nADVERTISEMENT\n\n\"We are committed to delivering the best possible value for Australian and New Zealand households, with a mix of owned and well-known brands, underpinned by our everyday lowest prices policy and a strong focus on trust, transparency and fairness.\n\n\"Our portfolio of more than 40 Bunnings-owned brands – such as Mimosa, Matador and Trojan - allow us to complement the many supplier-owned leading brands that we offer across our range, by delivering exclusive market-leading product innovation at compelling price points.\"\n\nNext on Four Corners: Hammered pic.twitter.com/xpv1ZQKBfo — ABC News (@abcnews) May 7, 2025\n\nBranding experts like Camey O'Keefe said shopping at Bunnings may lose its appeal if there's doubt about whether you're truly getting the best deal. She thinks the price guarantee is more about Bunnings wanting to control customer perceptions.\n\n\"What I think it does do is add a layer of reassurance that perhaps subconsciously people are like, 'Oh, I can trust that Bunnings will offer me the best price in the market for any given product,\" she told the national broadcaster.\n\nADVERTISEMENT\n\nWith a profit margin of 16.8 per cent, compared to Woolworths' 9.9 per cent and Coles' 8.9 per cent, questions have been raised as to whether the mega retailer has \"flown under the radar\" during the recent cost-of-living crisis.\n\nAccording to the ACCC, retailers are not legally obligated to label home-brand products explicitly. However, if a product is marketed in a way that suggests it is made by a third party when it is not, it could be considered misleading or deceptive conduct. It's a tactic Coles and Woolworths owner Endeavour Group has faced heated criticism on as the supermarket giants sell alcoholic beverages ostensibly marketed to appear they're brewed by smaller, independent breweries.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  },
  {
    "url": "https://au.news.yahoo.com/300kg-find-in-aussie-river-exposes-growing-nationwide-crisis-significant-increase-064016206.html",
    "title": "300kg find in Aussie river exposes growing nationwide crisis: 'Significant increase'",
    "publish_date": "2025-05-11T06:40:16Z",
    "category": "finance",
    "authors": [],
    "text": "Councils across the country are bracing for a major rise in illegal dumping in 2025.\n\nA volunteer on his hands and knees searching for litter in mangroves on the NSW coast. Source: Clean4shore\n\nThe discovery of 300kg of rubbish in a 100-metre stretch of Aussie river has exposed a major crisis taking place all across the country, damaging ecosystems and putting the health of humans and wildlife at risk.\n\nVolunteers found thousands of pieces of plastic in just 40 minutes scouring a small stretch of mangroves in Erina Bay, part of Brisbane Water, an estuary on New South Wales' Central Coast.\n\nIt's an issue that leaves environmentalists daunted by the huge task of overcoming the problem of littering — and council reporting app Snap Send Solve predicting a \"significant increase\" in illegal dumping in 2025.\n\n\"It was just overwhelming,\" Graham Johnston, founder of not-for-profit environmental group Clean4shore, told Yahoo News.\n\nADVERTISEMENT\n\nThe worrying discovery comes after weeks of rain in the state, which have caused soft plastic litter to wash into waterways. \"A lot of it was food wrappings, what I call gutter rubbish, where people have been littering,\" he explained. \"That's the biggest cause of this.\"\n\nAmong the mangroves, the group of volunteers also found industrial products, and an entire boat — an ever-present battle in NSW waterways. Sadly, volunteers will need to return to the \"terrible\" spot, which is still filled with rubbish.\n\nA pile of plastic cleared from a small patch of mangrove. Source: Clean4shore\n\nA boat was among the rubbish found in mangroves. Source: Clean4shore\n\nMangroves are critical to coastal ecosystems and play a key role in environmental stability, biodiversity, and climate resilience. Leaving the mangroves \"full of\" microplastics has significant ecological consequences. \"It's pretty disappointing,\" Johnston said.\n\nADVERTISEMENT\n\nAustralia is seeing escalating concerns about microplastics damaging habitats, affecting wildlife, and entering the food chain.\n\nAs a result, Johnston urged members of the public to dispose of their rubbish correctly by placing it in the bin first and foremost. He also suggested looking for alternatives to plastic waste.\n\n\"Let's find an alternative to plastic packaging. Can we find it in biodegradable plastic, or in a cardboard box? We've got to look for alternatives to reduce the plastic we are using,\" he said.\n\nLast year, the volunteer group took 99 trips into the field, with 40.85 tonnes of waste removed. 909 volunteers contributed by collecting 88,704 individual items from NSW waterways.\n\nVolunteers found thousands of pieces of tiny plastic washed into the waterway. Source: Clean4shore\n\n'Significant increase' in illegal dumping predicted in 2025\n\nDanny Gorog, CEO & Founder of Snap Send Solve told Yahoo the problem Central Coast residents face with litter and dumping is part of a wider trend taking place across the nation.\n\nADVERTISEMENT\n\n\"Illegal dumping is on the rise, and it’s taking a real toll on our environment and local communities,\" Gorog said. In 2024, there were nearly 40,000 reports of dumped rubbish in NSW alone, with 19,000 reported already this year.\n\n'We’re on track for a significant year-on-year increase,' he warned. Gorog said that the best way to help solve the problem is to report any issues.\n\n\"Whether it’s household waste, illegal dumping, or abandoned furniture, litter harms our parks, waterways and shared spaces,\" he said. \"Tackling it starts with each of us, and Snap Send Solve makes it simple to take action.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 40
  }
]