[
    {
        "url": "https://www.9news.com.au/national/oasis-concert-melbourne-flares-thrown-marvel-stadium/c2fc30bc-df3b-4c52-a75f-226bb1343069",
        "title": "'Morons': Flares thrown into crowd at first Oasis gig in Melbourne",
        "publish_date": "Sat, 01 Nov 2025 00:20:26 +0000",
        "category": "sports",
        "authors": [
            "Nov"
        ],
        "text": "The flare was thrown into the crowd at Marvel Stadium during hit song\n\nChampagne Supernov\n\na, with Liam saying \"that's naughty, naughty, naughty,\" according to fans.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/medicare-bulk-billing-changes-australia-november-explained/0d3f161a-0dec-4861-aff4-7f440fb43984",
        "title": "Trips to the doctor just got cheaper thanks to $7.9 billion overhaul",
        "publish_date": "Fri, 31 Oct 2025 20:03:20 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Many Australians now have access to cheaper visits to the doctor , after a $7.9 billion overhaul of the bulk billing system came into effect.\n\nBut not everyone gets to benefit from right away, with the government projecting it will take years for most GP practices to sign on to the scheme.\n\nSo what's actually changed, and what does it mean for you? This is what you need to know.\n\nMedicare is getting a $7.9 billion overhaul. (Justin McManus/The Age)\n\nWhat has changed for bulk billing incentives?\n\nUnder the previous system, the federal government incentivised doctors to provide bulk-billed consultations to children under 16 or patients who have a Commonwealth concession card.\n\nHowever, from Saturday, November 1, the scheme has been expanded so the incentive now covers anyone with a Medicare card.\n\nThe government has also introduced the Bulk Billing Practice Incentive Program (BBPIP) – an extra 12.5 per cent incentive payment to be split between doctors and practices that sign up for the program.\n\nThe changes aim to increase the proportion of GP appointments that are bulk billed. (Wolter Peeters/SMH)\n\nWhy have these changes been made?\n\nThe changes were announced in the lead-up to this year's federal election campaign .\n\nWhile it was partly a political move from the Labor government aimed at exploiting a perceived weakness of then-opposition leader Peter Dutton due to his stint as health minister, it's also aimed at addressing the declining bulk billing rate.\n\nIn 2020, the figure was sitting at a record high of 89 per cent. In 2024, it had fallen to 78 per cent (admittedly up fractionally from 77 per cent the year before).\n\nThe government says the overhaul will drive the bulk billing rate up to 90 per cent by 2030.\n\nThe policy was announced in the lead-up to this year's federal election. (Alex Ellinghausen)\n\nSo does this mean free GP visits for (almost) everyone?\n\nThat's the idea – the government wants as many Australians as possible to access free doctor appointments.\n\nIn practice, it's going to take a while for GPs across the country to sign on to the new scheme , although the government insists it's happy with the uptake so far.\n\nA few days out from its introduction, more than 1000 practices had indicated they would move to full bulk billing from November 1.\n\nTo hit its 90 per cent bulk billing rate target, the government in February said it needs 4800 practices on board (although about 1600 were already fully bulk billing before the changes came into effect).\n\nThat leaves a shortfall of about 2200 to close over the next few years.﻿\n\nHealth Minister Mark Butler is confident, though, that more providers are going to join.\n\n\"They're going through those numbers, obviously making their own assessment about whether the practice will be better off and whether general practitioners, the GPs that work in their practice, will be better off,\" he told reporters the Monday before the scheme started.\n\n\"Already a couple of thousand of them have indicated that they're going to do that.\n\nHealth Minister Mark Butler says doctors will be better off under the changes. (Alex Ellinghausen)\n\n\"Now, a number of them are already bulk-billing practices but… almost a thousand of them are practices that this week are charging gap fees, but they've indicated next week they'll be fully bulk billing.\n\n\"I expect there to be a significant number of practices that make that same communication to us over the course of this week before Saturday as well.\"\n\nHe also said he expects the numbers to rise over the coming years and that he was \"delighted\" at the initial level of support.\n\nREAD MORE: Australia Post reveals deadline for mailing Christmas parcels ﻿\n\nWhat does it mean for doctors?\n\nGPs weren't particularly happy with the 12.5 per cent BBPIP payment being split between doctors and practices, claiming it favours larger corporate clinics and could be a barrier to some providers signing up.\n\nHowever, the government says doctors will be financially far better off under the new system.\n\n\"Two years ago, a full-time, fully bulk-billing GP would have been earning about $280,000 a year after they paid their practice costs,\" Butler said.\n\n\"From this weekend, they'll be earning $405,000 a year, a $125,000 increase.\n\n\"This investment is obviously good for the Medicare system, good for patients, but it's also good for GPs themselves.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/shaken-baby-syndrome-podcast-diagnosing-murder-exclusive/2777d443-e4ee-4d01-975a-e772ed5172b2",
        "title": "Aussie parents facing jail time over diagnosis based on shaky science",
        "publish_date": "Fri, 31 Oct 2025 22:07:57 +0000",
        "category": "lifestyle",
        "authors": [
            "Nov"
        ],
        "text": "Around the world, questions are being asked about shaken baby syndrome and the validity of the science behind it.\n\nDoctors, scientists, and lawyers across the UK and parts of the US have challenged the diagnosis, which has been used to separate children from their parents and put people behind bars.﻿\n\nBut here in Australia, ﻿there's been \"no conversation about it at all\" – until now.\n\nShaken baby syndrome and the science behind it has come under scrutiny around the world - but not here in Australia. (Getty Images/iStockphoto)\n\nAward-winning journalist Michael Bachelard admitted he was hesitant to be the one to start the conversation.\n\nThat changed when he heard the stories of real Australian families torn apart by allegations of child abuse based on shaken baby syndrome diagnoses that, according to the parents, just weren't true.\n\n\"It just seemed to me such a clear example of where the medical diagnosis had run ahead of all of the other evidence,\" Bachelard told 9news.com.au.\n\n\"The injustice of it made it seem like I couldn't ignore this.﻿\"\n\nWhat is shaken baby syndrome?\n\n﻿Shaken baby syndrome, also known as abusive or inflicted head trauma, is a medical diagnosis based on research that dates back to the 1970s.\n\nThe original theory was that there may be a link between babies being shaken by their parents and developing subdural haematomas, or bleeding on the brain.\n\nIn the '90s, that theory shifted into a new hypothesis; that parents were knowingly or intentionally harming babies by violently shaking them.\n\n﻿Shaken baby syndrome, also known as abusive or inflicted head trauma, is intrinsically linked to child abuse accusations. (Getty)\n\nThis formed the basis for shaken baby syndrome, which was diagnosed based on three key clinical findings formally known as \"the triad\":\n\n﻿subdural haemorrhage - a specific kind of bleeding on the brain\n\nretinal haemorrhage - bleeding in the tissue behind the eye\n\nbrain swelling﻿\n\nThe diagnosis based on the triad became widely accepted ﻿and even came to be used as evidence of abuse in court cases.\n\n'There are questions being asked'﻿ ﻿\n\nChild abuse is abhorrent and perpetrators should face justice.\n\nBut the science behind shaken baby syndrome and the triad is shaky and unproven, prompting a growing number of ﻿experts to question how it is diagnosed and used as evidence in court.\n\n\"We talk about the cost, as we rightly should, of child abuse,\" Bachelard said.\n\n\"But there's also a cost in getting it wrong the other way, in falsely accusing parents or carers of abuse ... and that's a cost we don't often look at.\"\n\nHe explores that cost in ﻿ Diagnosing Murder , a four-part investigative podcast series from The Age and The Sydney Morning Herald.\n\nDiagnosing Murder is a four-part investigative podcast series from The Age and The Sydney Morning Herald. (SMH/The Age)\n\nIn it, he interviews families, lawyers, doctors, and other experts to understand why shaken baby syndrome has faced scrutiny abroad but not in Australia.\n\nEspecially when it can take such a devastating toll on Australian families.\n\n\"﻿It surprised me how the science of shaken baby syndrome, or as people now call it, abusive or inflicted head trauma, began and how it then evolved,\" Bachelard said.\n\n\"And the difficulty of making any firm proof that there is an association between shaking and the medical symptoms and signs that are attributed to it.\"\n\nIt's especially concerning when you consider the number of Australian parents who have found themselves in children's court or facing prosecution over allegations of abuse based on a shaken baby syndrome diagnosis that may not be scientifically sound.﻿\n\nThe people who diagnose it or adhere to the current orthodoxy around it are usually well-intentioned.\n\nBut when the science behind these diagnoses isn't accurate, the outcomes can be devastating.﻿\n\nMichael Bachelard said the questions arising around shaken baby syndrome are \"something we should all worry about\". (Eddie Jim)\n\n﻿\"We should be questioning the science that we rely on in court, particularly when people are either having their children taken away in the children's court, or going on and being prosecuted,\" Bachelard said.\n\n\"We should be open to questions and some of those questions are difficult, but if people are being sent to prison or having their children removed wrongly on a diagnosis that doesn't stack up scientifically, that's terrible.\n\n\"That's something we should all worry about.\"\n\nThe human cost\n\nKabir, Dipika, and their daughter Dua are one such family.\n\nIn 2021, the Melbourne couple rushed their daughter to hospital after she went limp at home and though she recovered, clinical findings led ﻿forensic doctors to believe she was a victim of shaken baby syndrome.\n\nAs the last person who had held her, Kabir became their prime suspect.\n\nHe was accused of child abuse and Dua was removed from her parents' care despite Kabir's insistence that he was innocent.﻿\n\n\"The fact that they were prepared to sit down with me and tell me their stories also shows me how how deep they felt the injustice has been,\" Bachelard said.\n\n\"And the fact that they're prepared to risk exposure and backlash to tell their stories, you know, I was really impressed by their courage.\"\n\nREAD MORE: Searchers draining dam today in renewed search for missing boy Gus\n\nAustralian families have been torn apart by accusations of abuse based on shaken baby syndrome diagnoses. (Getty)\n\nKabir and Dipika aren't alone.\n\nBachelard spoke to other parents accused of harming their children based on shaken baby syndrome diagnoses ﻿and has been contacted by more since the podcast started airing.\n\nIt's not the response he expected.\n\n﻿\"I expected a pretty large backlash,\" Bachelard confessed.\n\n\"But ﻿a number of responses we've had have been, 'this has happened to me,' or 'this is happening to me'.\n\n\"That response has really encouraged me to think this is worthwhile, this is something worth raising and hoping that we can prompt the discussion.\"\n\nWhat comes next?﻿\n\n﻿Dissenting voices are still emerging in Australia and Bachelard is hopeful that in the near future, conversation will turn into action.\n\nWhat form that action takes remains to be seen.\n\n﻿There have been calls for an inquiry into convictions based on shaken baby syndrome diagnoses and the questionable triad of clinical symptoms behind them.\n\n\"If we're interested in avoiding wrongful convictions, and if we're interested in trying to avoid the pain and suffering that these accusations can cause, then I think we do need, as a system and as a country, to take a closer look at it,\" Bachelard said.\n\n\"And I do hope that this podcast helps prompt that conversation.\"\n\nListen to Diagnosing Murder on ﻿ Apple Podcasts , Spotify or wherever you get your podcasts.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/is-christmas-getting-earlier-each-year-xmas-ads-shopping-sales-presents/a1f4dcf9-3855-4953-8ff4-b7df75a565ef",
        "title": "Are Christmas advertising and promotions getting earlier each year?",
        "publish_date": "Fri, 31 Oct 2025 20:03:43 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "It's beginning to look a lot like Christmas earlier and earlier every year.\n\nOr at least that's how it seems.\n\nIn every ad break on TV and on shop shelves around the country, there will be all the hallmarks of the season.\n\nChristmas decorations line a supermarket. (Adobe Stock)\n\nBut is Christmas getting earlier every year, or does it just seem that way?\n\nAccording to Professor Gary Mortimer of the Queensland University of Technology Business School, it is.\n\nWe see Christmas stuff on shelves as early as August or September for operational reasons, Mortimer said.\n\n\"What happens is our warehouses are under pressure so much they need to get that inventory into stores,\" he told 9news.com.au .\n\n\"That then frees up space in warehouses for summer apparel and all the other stuff that happens after Christmas.\"\n\nBut in the next few days, we'll be seeing Christmas decorations and food taking up a lot of space in supermarkets and department stores.\n\nThere's a simple reason for that, Mortimer said.\n\nThere is a lot of space in stores set aside for promotional events.\n\nChristmas hams for sale in IGA in October. (IGA)\n\nAnd with nothing major on the calendar between Halloween and December 25, Christmas fills that void.\n\nThe space filled with Christmas promotions is often the same space used to display Easter eggs, Mother's Day merchandise and Halloween decorations.\n\nBut there's also a psychological reason for early Christmas promotions.\n\n\"Shoppers will walk past toys, Christmas decorations and Christmas cards four months before they're willing to purchase,\" Mortimer said.\n\n\"You're not necessarily buying them in September or October, but when you're ready to buy you know exactly where to go.\"\n\nMince pies for sale in Aldi in September. (Nine.com.au)\n\nAnd people genuinely are buying Christmas stuff earlier.\n\nRetail figures show people are buying more in November than they are in December.\n\nThat's in large part to the Black Friday and Click Frenzy sales.\n\nBut many people are using those sales to buy their presents early for a discount.\n\n\"As we move into December, a lot of the Christmas shopping is done, and then December becomes more about food and parties,\" Mortimer said.\n\nChristmas trees at a Woolworths supermarket. (Adobe Stock)\n\nBut the major supermarkets say Christmas marketing and sales aren't any earlier in 2025 than in previous years.\n\n\"Consistent with previous years, we offered a select range of longer-life Christmas essentials starting in August,\" a Woolworths spokesperson said.\n\n\"We've just started rolling out a larger selection this month - including our seasonal hams and many desserts - but rest assured, there are plenty more products still to come.\n\n\"We haven't started any earlier this year; we simply want every customer to have the choice to shop at the pace that suits their budget and matches their enthusiasm for Christmas.\"\n\nMeanwhile, a Coles spokesperson said the launch of their Christmas advertising is in line with previous years.\n\n\"We've already seen strong demand for our festive products,\" they said.\n\n\"Our first batch of puddings arrived in stores in August, and they've proven to be incredibly popular - last year, half our stock was snapped up before December even began.\"\n\n\"Our customers love indulging in festive treats well before Christmas and more than 50 per cent of our fruit mince pies were sold before December last year.\"﻿\n\nREAD MORE: Mum claims she used recalled sunscreen for two years before skin cancer",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bom-new-rain-radar-changes-removed-public-complaints/0a836c87-e04d-499e-b279-47edf440a0d5",
        "title": "BoM backflips on controversial rain radar on new website",
        "publish_date": "Fri, 31 Oct 2025 07:55:28 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "The Bureau of Meteorology has backflipped on one of the more contentious elements of its controversial new $4.1 million website, announcing it will revert the default display for its rain radar.\n\nThe weather bureau has faced criticism from some users, as well as Queensland Premier David Crisafulli and federal Environment Minister Murray Watt, over the redesigned website.\n\nThe BoM's ﻿new \"rain rate\" radar (left) and the older \"rain reflectivity\" (right):\n\nThe BoM's rain rate radar. / The BoM's rain reflectivity radar. (Bureau of Meteorology)\n\nREAD MORE: Australian YouTube family moves to UK to avoid upcoming social media ban ﻿\n\nAfter previously pledging to take that feedback on board and tweak the new design, acting chief executive Peter Stone announced this afternoon that the BoM has changed the default display of its new-look radar, which has been a particular target of public displeasure.\n\nInstead of showing the \"rain rate\" in millimetres per hour, the radar will now go back to showing \"rain reflectivity\", which was what was standard on the old website.\n\n\"We've listened to your feedback, and have restored the previous radar colour scheme,\" Stone said.\n\n\"We will continue to assess options for further updates and improvements at the same time as pushing on with our efforts to help the community become more familiar with the new website.\"\n\nMurray Watt issued the BoM with a please explain early this week. (Alex Ellinghausen)\n\nHe added that further adjustments would be rolled out soon.\n\n\"More changes are in the pipeline,\" Stone said.\n\nThe change to the radar went live this morning, although users can choose to change the view to rain rate if they prefer.\n\nThe move comes after Watt met with Stone earlier this week to tell him to improve the site .\n\n\"I made clear my expectations that the BOM needed to consider this feedback and, where appropriate, adjust the website's settings as soon as possible,\" the environment minister said in a statement.\n\nThe new Bureau of Meteorology website was launched last week. (Bureau of Meteorology)\n\n\"This includes urgent consideration of improvements to the website's functionality and usability…\n\n\"Australians deserve to have confidence in these important services.\"\n\nNew websites often face criticism from users who are used to the previous layout, and matters were complicated for the BoM by the fact its relaunch went live on October 22, days before severe storms hit Brisbane.\n\nOn Wednesday, Scott insisted the new site was \"specifically designed to enhance access to public safety information\".\n\n\"The Bureau's forecasts and warnings are now more prominent, easily accessible and relevant to your location,\" he added.\n\nHowever, he also acknowledged the public criticism and apologised for the challenges some users had faced.\n\n\"It's clear we need to do more to help people through the change, both by making adjustments to the website and by helping users to understand its new features,\" Stone said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/anz-1-1-billion-significant-costs-half-year-results/4288142a-a00e-4dd4-88a7-f3c41f633f0b",
        "title": "Bank that sacked thousands of Aussies hit by $1.1 billion blow",
        "publish_date": "Fri, 31 Oct 2025 05:55:47 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "A large proportion of that is associated with the\n\ndecision taken last month to slash 4500 jobs\n\n– 1000 of which were contractors, while the remaining 3500 were full-time employees.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/riverina-leg-of-national-fuse-cup-esport-competition/105935520",
        "title": "Esports expand rural students' chance for professional career",
        "publish_date": "Sat, 01 Nov 2025 01:17:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "The crowd goes wild as Fergus Steers rounds the final bend and heads for the home straight; the chequered flag flashes as he crosses the line.\n\nExcept 14-year-old Fergus is not driving a car, he is playing a video game.\n\nFergus Steers was one of 80 students competing at the Riverina FUSE Cup championships. (ABC Riverina: Nicola Ceccato)\n\n\"I qualified for the quarterfinals, so I was pretty happy about that since I was a little bit rusty,\" Fergus said.\n\nThe Yanco Agricultural High School student was among 80 students from eight schools and 11 teams who competed at the inaugural Riverina FUSE Cup competition in the south-west NSW town of Leeton earlier this month.\n\nIt was the first time an esports event had been held in rural New South Wales.\n\n\"It feels good to prove to people in the city that the bush kids can play. It's not always the city kids [that] are the best,\" Fergus said.\n\nMore than a race\n\nStudents battled it out at the Leeton Roxy Theatre for the Riverina FUSE Cup title. (ABC Riverina: Nicola Ceccato)\n\nThe competition is part of a push to promote a safe online environment and strategies for young people to navigate the online world.\n\n\"A lot of the digital wellbeing we are talking about can be anything based around cyberbullying — if a stranger approaches you online … [or] image-based abuse — and making sure that everybody is aware of what is going on online,\" said FUSE Cup operations coordinator Kristen Cummins.\n\nKristen Cummins is pleased with the level of skill shown by Riverina school students. (ABC Riverina: Nicola Ceccato)\n\nMs Cummins said opportunities for gaming careers were growing, and it was important the FUSE Cup reached out to regional and rural areas to include them in this growth.\n\n\"It doesn't matter where you come from; you can always have the ability to represent the country if you have the time, dedication and skill,\" she said.\n\nGaming industry revenue has increased by 200 per cent in Australia since 2016, according to a 2024 Australia Game Development Industry snapshot report.\n\nThe number of game development employees in Australia had also increased by over 192 per cent during that time.\n\nOpportunities for esports and gaming professions continue to grow globally. (ABC Riverina: Nicola Ceccato)\n\nMs Cummins said that with the addition of more worldwide competitions and the inaugural 2027 Esports World Cup in Saudi Arabia, there could be opportunities to play professionally.\n\n\"Esports is just growing bigger and bigger every day, I would say, globally,\" she said.\n\nIt is a career 16-year-old Jack Curry hoped could be an option.\n\nJack Curry hopes to go on to win the state and then the national champs. (ABC Riverina: Nicola Ceccato)\n\nThe Leeton High School student won the Riverina FUSE Cup and will compete in the state finals on the Gold Coast next month.\n\n\"I think it's a pretty good way, at least for me, to try and find other competitors,\" Jack said.\n\n\"If I lose to them I will try and strive to get better than them. So that's the kind of relationship I get from a lot of these tournaments.\n\n\"This is the first time I've made it so far in a tournament, and I'm really stoked to follow through.\n\n\"If I'm going to nationals, I need to at least make it past the first round.\"\n\nShaiila Ogilvie says the positive camaraderie is good to see in the competition. (ABC Riverina: Nicola Ceccato)\n\nBut like any good sporting event, there was more to the competition than winning.\n\n\"Everyone's kept their temper, or if they don't win, they're not sad about it, not angry or anything,\" said Shaiila Ogilvie from St Francis College.\n\n\"They're just happy and understanding for the [winning] team.\n\n\"No-one's yelled at anyone. They've all fist bumped and said 'good job'.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/nationals-ditch-net-zero-support-in-party-platform/105959532",
        "title": "Nationals ditch net zero support in party platform",
        "publish_date": "Sat, 01 Nov 2025 01:04:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Nationals have removed support for net zero from their federal platform amid mounting expectations their federal MPs are poised to do the same.\n\nA meeting of the party’s Federal Council in Canberra on Saturday cemented the change, which was widely regarded as a formality, given that every state branch of the party had already passed similar motions.\n\nWhile the federal platform does not bind the Nationals’ federal party room, its members appear close to landing on a similar position, with some speculation that could happen as early as this week.\n\nThe motion called on the parliamentary party to “abandon” support for achieving net zero emissions but retains support for “emissions reductions”, which it says should be balanced with “growing and protecting key industries such as the mining, agriculture and manufacturing sectors”.\n\nIt calls for a “balanced energy mix, including coal, gas and renewable energy sources” and an end to the federal moratorium on nuclear energy.\n\nDivisions between Coalition parties and within them\n\nAbout 35 Liberals gathered in Canberra on Friday to discuss energy policy, with sources inside the meeting telling the ABC they were cautiously optimistic about reaching a consensus position.\n\nBut Liberals are nervous their Coalition colleagues could use this motion as a pretext to front-run their joint process and take a Nationals-only stance on net zero as soon as their Monday party room meeting.\n\nThe issue has split moderates and conservatives within Liberal ranks and has also created frustrations among Nationals.\n\nBarnaby Joyce has described himself as a “free agent” and is taking time away from the Nationals party room, in part due to a deterioration in relation with leader David Littleproud but also motivated by his strident opposition to net zero.\n\nSpeaking from South Korea, where he is attending the APEC Summit, Prime Minister Anthony Albanese described the Coalition’s net zero process as a “circus” and out of step with global developments.\n\n“The world is getting on with the transition to net zero,\" he said.\n\n\"Overwhelmingly, the world sees that the transition to net zero [and] climate change is real.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-11-01/tick-borne-illnesses-chronic-symptoms-lyme-disease-bite-allergy/105889572",
        "title": "Scientists work to unravel mystery tick illness hitting Australians",
        "publish_date": "Sat, 01 Nov 2025 01:01:21 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Over three decades as a GP in northern Sydney, Richard Schloeffel saw thousands of patients with complex chronic diseases.\n\nMany lived with myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS), while others struggled with long COVID.\n\nBut it was a group of patients with debilitating, ongoing symptoms linked to tick bites that prompted the now-retired GP to undertake further research.\n\n\"I think tick-borne illness can be treated,\" Dr Schloeffel, now a researcher at Macquarie University, said.\n\n\" It's just that you have to believe the patient is sick in the first place. \"\n\nMost common DSCATT symptoms: fatigue\n\ndisordered thinking\n\nsensory disturbance\n\njoint pain\n\nheadache. Source: Department of Health, Disability and Ageing\n\nOnce described as \"Lyme-like illness\", thousands of Australians have reported suffering persistent symptoms, including fatigue, joint pain and neurological problems, they believe to be the result of a tick bite.\n\nIn 2018, the federal Department of Health coined the term DSCATT — debilitating symptom complexes attributed to ticks — to recognise these patients, and established clinical recommendations to help doctors manage them.\n\nBut the cause of their symptoms, and how best to treat them, remains highly contested in the medical and scientific community.\n\nEarlier this year, a Senate inquiry found many patients struggled to access care and sometimes spent thousands of dollars, including on unproven testing and treatment, to find answers.\n\n\"Most people in Australia who get a tick bite don't get sick. We're talking about the tip of the iceberg,\" Dr Schloeffel, who has long advocated for patients with tick-bite associated illnesses, said.\n\nBut for those who do report illness, many struggle to feel believed or seen.\n\n\"People bankrupt themselves to find treatment and get diagnosed,\" Dr Schloeffel said.\n\nTicks are parasites that feed on blood from animals and humans. (Pexels: Erik Karits)\n\nFollowing an earlier Senate inquiry in 2016, the federal government awarded funding to Australian researchers to investigate the causes of DSCATT and potential treatments.\n\nScientists have been slowly making inroads, but many questions remain unanswered.\n\nTick-borne diseases in Australia\n\nThere are around 70 species of ticks in Australia, 17 of which bite humans, Peter Irwin, a veterinary scientist and tick researcher at Murdoch University, said.\n\nWhile usually harmless, tick bites can cause a range of illnesses, including allergic reactions, bacterial infections and, less commonly, paralysis.\n\n\"On the east coast of Australia, the main tick is the Australian paralysis tick (Ixodes holocyclus),\" Professor Irwin said.\n\n\"The other main tick of medical importance is the kangaroo tick (Amblyomma triguttatum), which lives almost all over Australia.\"\n\nBitten by a tick? Here's what to do Ticks can make you really sick, so how do you remove them safely?\n\nAllergies are the most common adverse reaction to tick bites, and range from mild (lasting a few days) to severe (including life-threatening anaphylaxis).\n\nIn some cases, people develop mammalian meat allergy (also known as alpha-gal syndrome) after a tick bite, which results in them no longer being able to eat red meat and other products derived from mammals.\n\nTicks can also carry Rickettsia bacteria, which cause infections including Queensland tick typhus, Flinders Island spotted fever, and Australian spotted fever.\n\nThese infections are most commonly seen in people who live in high-risk areas such as northern Sydney, and are usually treated with a short course of antibiotics.\n\nIs Lyme disease in Australia?\n\nIn recent years, a growing number of Australians have reported suffering debilitating, ongoing symptoms they believe to be the consequence of a tick bite — but their illnesses cannot be easily diagnosed or treated.\n\nIn some cases, people believe they have contracted Lyme disease, a tick-borne infection commonly found in parts of the US, Europe and Asia, which can sometimes lead to persistent symptoms like severe fatigue, muscle pain and cognitive problems.\n\nBut according to Professor Irwin, there is no evidence that the infection can be acquired in Australia as no Australian ticks have been found to carry Borrelia burdorferi, the bacterium responsible for Lyme disease.\n\n\"There's nothing difficult about finding Borrelia bacteria overseas, and of course, there is Lyme disease overseas,\" Professor Irwin said.\n\n\"But in Australia … no-one has ever been able to find Borrelia burgorferi.\"\n\nWhat to know about Justin Timberlake's Lyme disease diagnosis Singer Justin Timberlake reveals his struggle with the disease during his recent world tour.\n\nOther Borrelia species have been identified in Australia, but it is not known whether they can be transmitted to humans by ticks.\n\nWithout local evidence of Borrelia burgdorferi, the diagnosis of locally acquired Lyme disease is not supported by Australian health authorities.\n\nAdding to the challenge is the fact DSCATT symptoms can overlap with other infectious and chronic diseases, and not everyone affected has a clear history of a tick bite.\n\nSymptoms of patients with lingering health issues who do not meet the criteria for a recognised disease or infection are usually deemed \"medically unexplained\" — and treatment options are limited.\n\n\"What DSCATT guidelines do is … basically stop any further investigation or treatment being available,\" Dr Schloeffel said.\n\nOne of the recommendations of this year's Senate inquiry was to replace the current DSCATT clinical pathway with new guidelines.\n\n\"That patients continue to experience debilitating and severe symptoms and that patients are left without a diagnosis or treatment plan is of serious concern,\" the final report noted.\n\nSearching for an answer\n\nTo understand what might be causing some people to experience ongoing, \"medically unexplained\" symptoms, Professor Irwin and his colleagues at Murdoch University received funding in 2019 to closely track Australians after they received a tick bite.\n\n\"The idea was to perhaps find which of the Australian microorganisms could be the equivalent of Lyme Borrelia bacteria overseas,\" Professor Irwin said.\n\nThe research team followed 118 people over 12 months, taking blood samples and skin biopsies, and studying the ticks responsible for the bites.\n\n\"We sampled people within 72 hours of a tick bite … and then again at one week, three months, and 12 months, with the idea we would monitor them for all sorts of things to try to detect patterns, biological processes, infections and so on.\"\n\nDSCATT symptoms include fatigue, headaches, disordered thinking and joint pain. (Pexels: Shivansh Sharma)\n\nThe results of the study, which was delayed by COVID, are due to be peer-reviewed and published in the coming months. But preliminary findings suggest a small number of participants experienced symptoms \"similar to those reported by DSCATT patients\" at 12 months, Professor Irwin said.\n\n\"[They had] migraines, headaches, dizziness — the sorts of signs that have been attributed to ticks.\"\n\nIn addition to looking for new pathogens, Professor Irwin said the research team was investigating whether known bacteria, viruses and parasites could be causing long-term illness.\n\n\"Some of our patients developed evidence of rickettsial infection, as you'd expect, and we're looking very hard to see whether any of those patients went on to develop DSCATT symptoms,\" he said.\n\n\"The question is: could [an infection] have caused an acute localised or even systematic reaction, and has that triggered — in some people — the propensity to develop DSCATT symptoms?\n\n\"That's what we're trying to unravel.\"\n\nDiagnosing and treating an invisible illness\n\nThe question of if — and how — tick-borne diseases cause chronic infection, inflammation or other ongoing biological changes is something scientists overseas are also investigating.\n\nThe current uncertainty, and lack of scientific evidence, is why \"chronic Lyme disease\" is a disputed and controversial diagnosis. Instead, health authorities, including the US Centers for Disease Control (CDC), use the term \"post-treatment Lyme disease syndrome\" to describe people who experience prolonged symptoms.\n\n\"Chronic Lyme disease … implies that prolonged symptoms are caused by an ongoing bacterial infection when, in fact, the cause is not currently known,\" the agency noted.\n\nABC Health in your Instagram feed Follow @abchealth on Instagram, where we're busting myths and sharing practical, smart health advice.\n\nIn Australia, patients with unexplained chronic symptoms linked to tick bites generally do not show any evidence of infection or irregularities in standard blood tests, Dr Schloeffel said.\n\n\"There's this general belief that if you can't measure something, they look alright and they've tested normal, there is nothing wrong with them.\"\n\nThe former GP believes the lack of pathological evidence is a reflection of inadequate diagnostic testing, not the absence of disease, and is something he is working on trying to improve.\n\n\"The gap in the patient being sick and the doctor's belief that they're sick is the blood test. We don't have to diagnose them,\" he said.\n\nAccording to Dr Schloeffel, possible mechanisms driving the persistence of symptoms — which would be missed in standard blood tests — include infection-induced immune dysfunction and chronic inflammation inside cells.\n\nThrough a privately funded clinical trial at Royal North Shore Hospital in Sydney, Dr Schloeffel and his colleagues are monitoring a range of biomarkers in 60 DCSATT patients in the hope of establishing new diagnostic markers and tests.\n\nThey are also evaluating the benefits of treating some patients with low-dose, long-term antibiotics — a treatment that is not recommended by health authorities in Australia, and described as having \"known harm and no benefit\" in current treatment guidelines.\n\nIn its submission to the 2024 Senate inquiry, the Royal Australian College of General Practitioners (RACGP) noted that \"negotiating diagnostic uncertainty\" could be challenging and frustrating for patients, but there was \"little or no evidence to support specific treatments for tick-borne diseases\".\n\n\"We need to be mindful that unnecessary medications, testing or procedures are low-value care and can cause more harm than benefit.\"\n\nFocus on improving quality of life\n\nIn 2019, alongside funding the Murdoch University study, the government also awarded University of Melbourne researchers a grant to investigate whether a psychology-based intervention could help people with DSCATT manage their illness.\n\nRichard Kanaan, a professor of psychiatry and research leader, said the nine-month therapy — designed to be given in addition to other treatments or supportive care — was developed with a goal to improve patients' quality of life.\n\nThe intervention was adapted from existing approaches used to help treat other chronic and complex illnesses where the cause was unclear.\n\nPeople with chronic symptoms attributed to ticks are often living in turmoil because their illness cannot be easily diagnosed and treated. (Getty Images: wenjin chen)\n\n\"The treatment is one that has been tried successfully with a number of similar diseases … where people get an infection, think of the infection itself as being short-lasting, but the after-effects can go on for a long time and be very debilitating,\" Professor Kanaan said.\n\n\"We're not necessarily talking about a cure, because people … may go on having the illness. But we're talking about improvement.\"\n\nIn coming months, the researchers will assess the feasibility of the intervention they have developed — which is based on acceptance and commitment therapy — and evaluate whether it has any therapeutic effects.\n\nProfessor Kanaan said the research team had received some criticism from people with DSCATT concerned about the psychological nature of the treatment — and implication their illness was being viewed as a \"disease of the mind\", not the body.\n\n\"People are concerned it's being considered a psychiatric illness, and by extension, it's 'all in the head' — that the illness is being hallucinated or people are making it up,\" he said.\n\n\"I absolutely do not believe that.\"\n\nThe term DSCATT itself has been widely criticised by patients, in part because it defines symptoms as being \"attributed\" to — rather than caused by — ticks. This year's Senate inquiry also recommended the term be replaced.\n\nProfessor Kanaan said investigating the benefits of psychological therapy in no way reduced the seriousness of the illness.\n\n\"Why psychiatry is involved is because understanding a complex problem — it needs a holistic approach,\" Professor Kanaan said.\n\n\"As much as we'd like there to be a very simple explanation … it doesn't seem to be that kind of problem.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/wolgan-valley-road-fix-investigated-three-years-after-it-closed/105957830",
        "title": "Road to isolated community considered for repair after three years",
        "publish_date": "Sat, 01 Nov 2025 00:11:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "After spending millions of dollars in disaster recovery money investigating a new road into a largely cut-off community near the Blue Mountains, a council is now reconsidering fixing the old one.\n\nThe Lithgow City Council (LCC) closed the only road into the Wolgan Valley in late 2022 due to the \"high risk of harm\" it said was posed by several landslides caused by wet weather.\n\nA steep, four-wheel-drive route known as the Donkey Steps was created as an emergency access route for more than $4 million and has been the only way into the valley since.\n\nAndrew Chalk says it is a \"monumental waste of money\" to keep investigating new road options. (Supplied: Andrew Chalk)\n\nWolgan Valley Association president Andrew Chalk said the community was immensely frustrated that it took years before fixing the existing road was taken seriously.\n\n\"We're back at the point we were three years ago,\" he said.\n\n\"The community has lost all confidence in the council's ability to manage this problem.\"\n\nA billion-dollar fix\n\nEngineering firm WSP Golder initially found it would cost more than $60 million to repair the 2.7-kilometre stretch of road to a level of \"marginally acceptable\" risk.\n\nA $436,350 study, conducted by the firm and funded by disaster money, recommended that the council consider building a new route that would provide a more \"resilient\" and \"cost-effective\" solution.\n\nAfter further investigations, the company increased the estimate to repair the section to $1 billion, or roughly $370,000 a metre.\n\nLCC director of infrastructure Jonathon Edgecombe said more thorough investigations of the impacts of the landslides had bumped up the price.\n\nThe same engineering firm was contracted for more than $7 million to investigate new routes into the valley, which led to the approval of up to $385 million in disaster funding to restore access to the community.\n\nWolgan Road damage after rain in November 2022. (Supplied: Ask Roz Blue Mountains)\n\nMeanwhile, a peer review of WSP's original findings was conducted by the company GHD, which found some of its assessments to be \"unusual,\" and recommended a \"comprehensive revision\" of the road's landslide risk.\n\nA subsequent investigation by GHD found the risk to be mostly \"tolerable\", and similar to other slopes on the NSW state road network.\n\nGHD was contracted to complete a study that investigated temporarily reopening the road, which is forecast to be delivered in 12 weeks.\n\nRoad forward\n\nThe council had started discussions with both engineering firms about another study to look at how to reconstruct the old road.\n\nThe Wolgan Road was permanently closed in late 2022 after multiple landslides. (Supplied: Ask Roz Blue Mountains)\n\nDespite acknowledging that the original WSP report was a \"product of its time,\" Mr Edgecombe said the council would continue with its recommendation to progress new route investigations.\n\n\"We don't have mature enough data and design work in front of us to say that the old Wolgan Road or the new design option is the most cost effective, resilient, long-term and quickest possible pathway to see access restored to this community,\" he said.\n\n\"At some point in the very near future, we will have absolute certainty which of those options is most viable.\"\n\n'Waste of money'\n\nIndependent geologist Marc Hendrickx said the GHD findings demonstrated new road options were redundant.\n\nThe emergency access road known as the Donkey Steps is the only way into the valley. (Supplied: Wolgan Valley Association)\n\n\"It says that the existing road is of a similar risk to many other slopes in the state … there are management procedures we can put in place to maintain that risk at a reasonable level,\" he said.\n\n\" There seems to be no justification at all for continuing any work on the new routes, and it is just going to be a complete waste of public money to continue to do so. \"\n\nMr Chalk also believed pushing ahead with the new routes was a \"monumental waste of money\".\n\n\"The council still wants to go back and use the same consultants, WSP, that have led us into this great mess,\" he said.\n\nBut Mr Edgecombe said he had \"absolute\" confidence in the company to deliver good work.\n\n\"WSP has been assisting the council in the management of the Wolgan Road for nearly two decades,\" he said.\n\n\"[Its report] was authored at a time when the Wolgan Valley had been subject to several years of prolonged and sustained rainfall, and those slopes were actively moving at the time.\"\n\nThe luxury Emirates resort has been mothballed since June 2023 due to the closed road. (Supplied: Emirates Wolgan Valley)\n\nWSP declined to comment.\n\nMeanwhile, a spokesperson for NSW Minister for Roads Jenny Aitchison said she was \"very sympathetic\" to the local community.\n\n\"GHD's independent advice that far less funding will be required and that the road can be reopened more quickly is positive news,\" they said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/federal-government-buy-local-campaign-food-shoppers/105947768",
        "title": "Government tells shoppers to buy Australian to save dwindling food industries",
        "publish_date": "Fri, 31 Oct 2025 23:39:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Supermarket freezers are packed with more options than ever when it comes to frozen vegetables and chips.\n\nBut the colourful array of brands to suit different budgets hides a growing truth — Australian food manufacturing is under threat, and many customers are struggling to pay.\n\nWhen it comes to food, national pride has become less of a priority, according to University of Tasmania associate professor Louise Grimmer.\n\nLouise Grimmer has been observing the rise in supermarket private label brands. (ABC News: Maren Preuss)\n\n\"If someone says to us, do you look for Australian products and for local products? Of course, it's really important to support farmers,\" Dr Grimmer said.\n\n\"But when you've got households that are struggling and you might have two products and really there's not a lot of difference between them, but one is a lot cheaper … that's going to be the product that households select.\n\n\"And that might not be a locally grown or Australian product.\"\n\nThe federal government has pledged to spend $20 million on a campaign encouraging people to buy Australian.\n\nIt said it was part of a wider plan to use buying power to help businesses deliver better value and strengthen domestic industry and manufacturing.\n\nThe federal government is urging shoppers to support local producers by buying local. (ABC News: Laurissa Smith)\n\nTasmanian potato grower Matt Ryan said it could not come soon enough.\n\n\"You can walk around with a pair of worn-out socks or undies for a couple of weeks, and put up with it, but you can't go without food and the processed food industry is a big part of that,\" he said.\n\nHe admitted farmers and food manufacturers were struggling to deal with mounting costs and competition from cheaper imports, including potato chips.\n\nThese Coles branded chips are packed in Belgium from imported ingredients. (ABC News: Laurissa Smith)\n\nFrozen imports growing\n\nLast year, more than 218,000 tonnes of frozen cooked potatoes were imported into Australia.\n\nThat is a 25 per cent increase on 2023 levels, with frozen chips ending up in supermarkets, fast food outlets and takeaway shops.\n\nIt has been a case of deja vu for farmers in Australia's largest potato-growing state.\n\nA tractor pulls a potato planter across a paddock near Thirlstane in Tasmania's north west. (ABC News: Laurissa Smith)\n\nBack in 2005, farmers in Tasmania took aim at fast food chain McDonald's for cutting French fry contracts worth $10 million and importing product from New Zealand.\n\nIt led to one of Australia's largest agricultural protests from the apple isle to Canberra.\n\nExperts say consumers hold a lot of power when it comes to keeping industries in Australia. (ABC Ballarat: Jarrod Watt)\n\nThe tractor-powered Fair Dinkum Food Campaign kicked off a national conversation about clearer country of origin labelling.\n\nThe major supermarkets were put on notice — and Mr Ryan said it paid off for a while.\n\n\"They chose to engage with the processors to have private label offerings with Australian-grown and actively promoted that,\" Mr Ryan said.\n\n\"Unfortunately, that's dissipated in recent years.\"\n\nSupermarket private labels increase\n\nThe major supermarkets are stocking more of their own brands now.\n\nDr Grimmer has been tracking this trend.\n\n\"They're investing millions into private label or home brand products,\" she said.\n\n\"Part of that is to raise revenue, but the other aspect of it is all about getting loyal customers.\n\n\" A lot of the time we think especially frozen food is made in Australia, but what we're discovering more and more is these products are coming in from overseas. \"\n\nFrozen potato chips sold by the major supermarkets are increasingly processed overseas. (ABC News: Laurissa Smith)\n\nSo what percentage of their private label brands for frozen vegetables are Australian?\n\nWoolworths said the majority of its frozen vegetable Own Brand range was locally sourced and had been for some time, while its tinned vegetable Own Brand range was sourced globally to help meet customer demand.\n\nFor frozen and canned vegetables, Coles said it worked with a mix of Australian and international suppliers to ensure consistent, year-round availability.\n\nIt also said geographic diversification helped protect customers from seasonal weather impacts and other supply chain disruptions.\n\nFarmer advocate and former vegetable grower Richard Bovill. (ABC News: Laurissa Smith)\n\nRichard Bovill knows a thing or two about retail buying strategies.\n\nHe was a distribution manager with Woolworths for 20 years before he switched to growing vegetables full-time in Tasmania's north west.\n\n\"It's only Australian consumers by their behaviour that can make these industries stay in Australia and exist,\" he said.\n\n\" If they are not buying the product, these factories disappear and when they're gone, they're gone for good. \"\n\nFarmers want shoppers to think about the origins of the food they buy. (ABC Ballarat: Jarrod Watt)\n\nVegetable processor Simplot said it worked with 300 growers across several states and was \"proud to be the last Australian-grown frozen and shelf-stable vegetable provider of scale in the country\".\n\nRichard Bovill has leased out his vegetable farms and is now semi-retired.\n\nHe remains passionate about local food production.\n\n\"The federal government is talking about creating a manufacturing industry in Australia,\" he said.\n\n\"The first thing they need to look at is the ones we've got already and make sure we don't lose them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/australia-electric-trucks-decarbonise-road-freight/105955870",
        "title": "Australia's biggest electric truck depot planned for busy freight route",
        "publish_date": "Fri, 31 Oct 2025 23:16:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Transport is shaping up as one of Australia's biggest carbon challenges, and one of the hardest to solve.\n\nAlready the nation's third-largest source of greenhouse emissions, it is on track to become the highest-emitting sector by 2030 as electricity generation continues to clean up.\n\nDepartment of Climate Change, Energy, the Environment and Water 2023 projections show transport emissions will continue to rise slightly to 2030 while other sectors are expected to decline.\n\nWithin that, heavy road freight looms large.\n\n\"Australia is an extremely road freight-dependent country,\" said Daniel Bleakley, co-chief executive and co-founder of New Energy Transport.\n\n\"We're the second-most road-freight-dependent country in the world after the United States, and we also have the heaviest trucks in the world.\n\nDaniel Bleakley and Fredrik Pehrsson are co-founders of New Energy Transport. (Supplied: New Energy Transport)\n\n\" If we can decarbonise heavy freight, we can make a huge impact on reducing transport emissions overall. \"\n\nNew Energy Transport plans to establish a pilot fleet of heavy electric trucks in Wilton, south-west of Sydney, by the middle of 2026.\n\nThe company says it will be Australia's largest electric trucking depot.\n\nThe site will initially house up to 50 heavy electric prime movers, with plans to grow the fleet to 200 vehicles by 2031.\n\nWilton hub\n\nThe depot will be set up alongside Australia's busiest freight route — the Hume Highway.\n\nA driver inspects a truck before the trial. (Supplied: New Energy Transport)\n\n\"It's a fantastic location because we've got good access to the Hume Highway and down to the Illawarra,\" Mr Bleakley said.\n\n\"There are around 5,000 trucks going up and down Picton Road to the Illawarra every day, and about 3,800 heavy trucks on the Hume Highway.\n\n\" We're positioning ourselves right in the middle of this extremely dense freight corridor. \"\n\nThe depot will be powered by a mix of grid electricity and on-site solar, about 3 to 5 megawatts, with high-powered chargers capable of fully recharging the 600 to 700 kilowatt-hour truck batteries in under an hour.\n\n\"If we can run these electric trucks on low-cost renewable energy, we can reduce both emissions and the cost of heavy road freight,\" Mr Bleakley said.\n\nElectric trucks 'light years ahead'\n\nThe concept was put to the test recently in what New Energy Transport believed was the longest single-charge electric truck delivery ever completed in Australia.\n\nWilton has been chosen as the site for Australia's largest heavy electric trucking depot. (Supplied: New Energy Transport)\n\nPartnering with Multiquip, a major poultry transport and logistics company based in Liverpool, the team ran a 36-tonne electric prime mover from Picton to Beresfield in the Hunter and back again, about 480 kilometres on a single charge.\n\nMultiquip national compliance manager David Muir, whose company supplied the chicken, said the test was a revelation.\n\n\"I was sceptical at the start. I still love proper diesel trucks,\" he said.\n\n\"But this thing was light-years ahead.\n\n\" It was significantly faster uphill, kept up with traffic easily, and the torque delivery was immediate. Each direction we saved about 20 minutes compared to our diesel trucks. \"\n\nMultiquip, which operates a fleet of about 500 trucks nationwide, found the electric truck not only matched diesel for range and cost, but offered surprising advantages.\n\n\"It was extremely quiet, [and] the driver said it was just so easy to drive,\" Mr Muir said.\n\n\"Less noise, less vibration, no exhaust fumes, it's a far better environment for drivers.\n\n\"They were able to arrive at their destination still feeling pretty fresh.\"\n\nHe said the trial showed that for hub-to-hub freight within a few hundred kilometres, electric trucks could already compete.\n\n\"The electricity it used compared to diesel was a fraction,\" Mr Muir said.\n\nThe company says the truck completed a 480-kilometre return trip between Picton and Beresfield on a single charge. (Supplied: New Energy Transport )\n\n\"It's early days, and infrastructure is the big challenge, but what we've seen so far is very promising.\"\n\nMr Bleakley believed those challenges were surmountable and that regional Australia could be at the forefront of powering a zero-emission freight future.\n\n\"If we transition the entire truck fleet to electric, we'll need about 20 per cent more electricity nationally,\" he said.\n\n\"But unlike diesel, that energy can be produced locally from renewables.\n\n\"That means we can make our freight network more resilient, cut costs, and keep food and goods moving even if global fuel supplies are disrupted.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/future-of-gove-tennis-centre-in-doubt-as-mining-winds-down/105917060",
        "title": "Sporting clubs fear the worst as mining giant withdraws from Nhulunbuy",
        "publish_date": "Fri, 31 Oct 2025 22:46:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "As the remote Northern Territory town of Nhulunbuy prepares for the anticipated departure of mining giant Rio Tinto, long-standing local institutions such as the Gove Peninsula Tennis Club face an uncertain future.\n\nRio Tinto currently holds the lease to Nhulunbuy but will soon relinquish its control back to traditional owners and fully withdraw from the region by 2030.\n\nThe picturesque coastal town of Nhulunbuy, about 1,000 kilometres away east of Darwin, is home to more than 30 different sporting clubs serving its 3,200 residents.\n\nOnce thriving on the back of the mining sector, the tennis club and others like it now fear for their survival.\n\nPushed beyond breaking points\n\nNicky Mayers grew up with a tennis racket and wants to give young Territorians the same opportunities. (ABC News: Pete Garnish)\n\nLong-term resident Nicky Mayers moved to the Gove Peninsula in the early 90s after meeting her Nhulunbuy-based husband during an overseas holiday.\n\nShe described it as \"love at first sight\", and as someone who grew up in regional Victoria with a tennis racket, she wanted to provide young people with the same opportunities she had.\n\nMs Mayers is the president of the 53-year-old Gove Peninsula Tennis Club which she describes as \"struggling\" despite its legacy of recognition.\n\n\"We currently have no running water and power for the clubhouse,\" she said.\n\nThe Arnhem Club is currently closed to patrons. (ABC News)\n\nThe tennis club is connected to the Arnhem Club, a venue which had recently been sold to new owners.\n\n\"We have an agreement with them [new owners] until 2032 to keep the courts… what the future holds after that, I don't think tennis courts will exist at all,\" Ms Mayers said.\n\nTennis Australia have previously awarded the club top honours, including two Newcombe Medals for outstanding contributions to tennis and the community.\n\nGove Peninsula Tennis Club has no running water or power in its clubhouse and its court is damaged. (Supplied: Nicky Mayer)\n\nMs Mayer said the uncertainty and lack of transparency had impacted their club with participation numbers falling from 600 people in 2013 to 280 today.\n\nEast Arnhem Land looks to develop tourism economy With the upcoming departure of Rio Tinto, communities on the Gove Peninsula are hoping yacht and cruise tourism could be the region's saving grace.\n\nOther sporting club presidents, such as the BMX club, told the ABC the town's complex ownership and development rights meant different sports faced different challenges, with some likely to fold once their leases expired, while others faced an exodus of volunteers and decline in participation numbers.\n\nRio Tinto, in a statement, acknowledged the stress and anxiety their departure was causing to the community but said they were working with key stakeholders including the Gove Peninsula Future Reference Group and the Northern Land Council to ensure a smooth transition.\n\n\"This collaborative effort involves detailed consideration of asset and infrastructure transfers, future governance of the town, and arrangements for asset ownership,\" a spokesperson said.\n\nMore needs to be done\n\nTennis NT chief executive Tania Tandora says they are considering short, medium and long-term fixes. (ABC News: Dane Hirst)\n\nTennis Northern Territory chief executive Tania Tandora urged for patience but conceded there was little they could do.\n\n\"What we are doing … is providing feedback and engaging with the government around the master plan for the community as it changes over time and providing advice… [about] potential locations for a future public access tennis facility,\" she said.\n\nGlobal mining group Rio Tinto has a refinery wharf in East Arnhem Land. (ABC News: Dane Hirst)\n\nBack in Nhulunbuy, Ms Mayers says the impact of a sporting club stretches far beyond the court.\n\n\"Unfortunately, I think tennis is one component for the sport in town … if there's no sport … it will have a massive impact on why would anybody would want to move here,\" she said.\n\n\"Sports is also often used as a tool to keep people busy meaning less anti-social behaviour.\"\n\nGove Peninsula Tennis Club has no running water or power in its clubhouse and its court is damaged. (Supplied: Nicky Mayer)\n\nMs Mayers is urging the NT government and Tennis NT to invest more funding in remote and regional communities.\n\nMs Mayers said \"one of the biggest hurdles\" clubs in Nhulunbuy faced was trying to get an NT community benefit grant to fix up facilities as many were privately owned and therefore ineligible.\n\n\"Clubs can't apply for grants in that situation so its kind like feeling the town is neglected or listening or caring from a government perspective,\" she said.\n\nNT Sports Minister Jinson Charls has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/what-aged-care-recipients-will-pay-under-government-proposal/105958056",
        "title": "What will aged care fee changes mean for you? Here are the details",
        "publish_date": "Fri, 31 Oct 2025 22:15:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Today marks the first day of the new fee structure for aged care.\n\nA lot is changing. Self-funded retirees and some pensioners will be expected to pay more, saving the government $12.6 billion over the next 11 years.\n\nResidential care and in-home care will both change.\n\nThe key principle is that the government will continue to pay for health-related costs, but people with financial means will pay more for other costs.\n\nThe changes apply to future recipients only, not to anybody currently receiving care.\n\nThis is how the reform will affect you.\n\nIn-home care\n\nCare in the home will continue to be assessed on the basis of need.\n\nThere will be eight levels of support (instead of four currently), each with a different level of government funding, up to a maximum of $78,000 a year (instead of $60,000 currently).\n\nThat money can be thought of as an annual budget, which can be used to purchase services from an approved list.\n\nWhat your budget can be spent on, versus what you will have to pay out of pocket, depends on your financial means and on the category of service.\n\nThe in-home care changes would see recipients pay more for independence supports and everyday living supports. (ABC News: Hugh Sando)\n\nThere are three categories:\n\nClinical care, such as nursing and occupational therapy\n\nIndependence supports, such as help with showering, dressing and medications\n\nEveryday living supports, such as help with cleaning, gardening and meals\n\nFor clinical care, the government-funded budget can pay for the whole cost.\n\nFor independence supports and everyday living supports, you will be expected to pay some of the cost out of your own pocket, depending on your means (see table below).\n\nYour situation What you will pay for Clinical care Independence support Everyday living Full pensioner 0% 5% 17.5% Part pensioner or health card holder 0% 5-50% 17.5-80% Self-funded retiree 0% 50% 80%\n\nFor the first time, the maximum price of home care services will be set by a government regulator to prevent over-charging.\n\nIn examples provided by the government, a full pensioner approved for level five support would end up paying for 6 per cent of their care, whereas a self-funded retiree who has no Commonwealth Seniors Health Card would pay 42 per cent.\n\nA $25,000 payment will also be available to help recipients spend their final three months at home, and there will be a new 12-week program for help when recovering from an illness or injury.\n\nExisting home care recipients, and those who are already approved, will switch to the new system but have a guarantee that they will not pay any more than they would under the old system.\n\nThe government has also lowered the maximum amount that home care recipients can be required to pay in administrative fees, leaving up to 27 per cent more leftover to spend on care. However, there are fears that providers will increase care prices by even more than 27 per cent.\n\nAdvocates for older Australians have also expressed concern about the way \"non-clinical\" care has been defined, with care recipients expected to make a partial contribution out of their own pockets towards showering and help taking medication, in some instances.\n\nResidential care\n\nThe payment structure for residential care will stay the same, but the amounts will change.\n\nResidents pay in three ways:\n\nA basic daily fee paid by everyone\n\nAn additional daily fee paid by those with financial means\n\nAn accommodation charge, which can be paid daily or as a lump sum deposit\n\nThe basic daily fee, set at 85 per cent of the Age Pension, will not change.\n\nThe means-tested fee will be renamed the \"non-clinical care\" fee, reflecting the fact that the government covers clinical costs.\n\nWhile the government will continue to cover clinical costs, a renamed \"non-clinical\" fee will see some residents pay for food and other amenities. (ABC News: Nance Haxton)\n\nIt will be paid by those with more than $500,000 in assets, or more than about $130,000 in income, or a combination.\n\nIt is a maximum of $101.16 a day and is paid for the first four years of care only.\n\nThe maximum accommodation charge will increase from $550,000 a room to $750,000 a room. Now, providers can seek government approval to charge more.\n\nThis can still be paid as a lump sum deposit, but providers will now be able to hold onto a portion of the deposit: 2 per cent of it each year for five years.\n\nFinally, a $12.55 per day \"hotelling\" supplement, currently paid to providers by the government, will instead be paid by residents with more than $238,000 in assets, $95,400 in income, or a combination.\n\nJust as before, the family home only counts towards the asset assessment up to the value of about $200,000.\n\nIn examples provided by the government, a full pensioner with few savings will continue to pay 17 per cent of the cost of his care, deducted from his pension. A self-funded retiree will pay 45 per cent.\n\nOverall, three in 10 full pensioners will contribute more, and three in four part pensioners.\n\nThis will only apply to those who enter aged care from today.\n\nLifetime cap on fees\n\nNobody will be able to pay more than $130,000 in non-clinical care costs over their lifetime, covering both in-home care and residential care. That is higher than the current cap of about $80,000.\n\nWhy is the government doing this?\n\nAged care is one of the largest and fastest-growing areas of government spending, and the demand for aged care will keep increasing as the large baby boomer cohort gets older.\n\nAt the same time, both sides of politics and the aged care sector agree that existing levels of funding have not been sufficient to deliver the quality of care Australians expect.\n\nIn 2021, the Royal Commission into Aged Care Quality and Safety recommended a taxpayer-funded levy to boost funding.\n\nBut the government rejected that idea and has argued that residents should pay more if they can afford to do so. The government currently pays about $4 for every $1 paid by aged care residents, and $19 for every $1 paid by in-home care recipients.\n\nThese reforms would see the government pay $3.30 for every $1 paid by residents and $7.80 for every $1 paid by in-home care recipients.\n\nThe government also hopes that by charging more for in-home care, it can afford to provide support to more people and reduce waiting times. According to the most recent figures, 68,000 people are currently on the waitlist for an in-home care package.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/pen-pals-for-60-years-joy-doevendans-diane-hatt-friendship/105893420",
        "title": "Pen pals for 60 years, Joy and Diane live on opposite sides of the world",
        "publish_date": "Fri, 31 Oct 2025 22:05:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Joy Doevendans and Diane Hatt are an unlikely pair of best friends, having lived their entire lives on opposite sides of the world.\n\nDespite being separated by almost 12,000 kilometres — Ms Doevendans in Renmark, South Australia, and Ms Hatt in Enderby, Canada — the pair have maintained a friendship that has lasted for more than half a century.\n\n\"I think Diane knows more about me than my family,\" Ms Doevendans said.\n\n\"We consider each other family. If we don't hear from each other in a couple of days, we write and say, 'is everything OK?'\" Ms Hatt said.\n\nDiane and Joy inspect the first letter Diane ever sent, more than 50 years ago. (ABC Riverland: Matt Stephens)\n\nThe pair's connection began when, at the age of 12, Ms Hatt reached out to a friend of Ms Doevendans's, in search of an Australian pen pal.\n\n\"There was a newspaper called the Vancouver Sun and they had [an ad] where people could write in and just ask for pen pals,\" Ms Hatt said.\n\nAt the time, Ms Doevendans's friend had \"too many pen pals\" and decided to pass Ms Hatt's letter on to her instead.\n\n\"She said, 'I've got too many, would you like one?' and I said, 'Sure!' And I just happened to get Diane's,\" Ms Doevendans said.\n\nWhat began as a letter sent on a whim in 1965 sparked the beginning of a 60-year friendship.\n\nBut it would take 15 years before the pair would meet the person on the other end of the pen.\n\nJoy met Diane, and her husband Roger, for the first time in 1980, 15 years after Joy and Diane first began writing to each other. (Supplied: Diane Hatt)\n\nMulti-generation affair\n\nAlways fascinated by Australia, Ms Hatt's mother, Ina, wanted to learn more about the country and decided to write to Ms Doevendans's mother, Florence.\n\nFlorence, a prolific letter writer in her own right, was thrilled to have someone to write to.\n\nThe mothers also went on to become long-time pen pals, creating a generational connection between the two families.\n\n\"I think if [our mothers] hadn't become pen pals, we would've lost touch,\" Ms Hatt said.\n\nDiane and her mother, Ina, first met Joy and her mother, Florence, in Australia in 1980. (Supplied: Diane Hatt)\n\n\"I had seven pen pals, and I've only kept in contact with two.\"\n\nThe two families met in 1980 in the South Australian town of Renmark, marking a turning point in their relationship.\n\n\"My mum, my husband and I came over here to meet Joy and the rest of the family, and I remember thinking, 'I'm really nervous about meeting her,'\" Ms Hatt said.\n\n\" The visit cemented our relationship again. \"\n\nJoy Doevendans and Diane Hatt have been best friends for 60 years. (ABC Riverland: Matt Stephens)\n\nTechnological advancements\n\nWhile Ms Doevendans and Ms Hatt initially bonded over a shared love of writing, their mode of communicating eventually had to change with the times.\n\nWhen they began writing to each other, they had to wait two weeks for a response, which made keeping up-to-date difficult.\n\n\"We would write at Christmas and maybe one other time, but we weren't really communicating all that much,\" Ms Hatt recalls.\n\nBut innovation in technology over the past 60 years has made things a lot easier, from email to messaging and even FaceTime.\n\nMs Doevendans and her husband have also visited Canada three times, including a trip in 2000. (Supplied: Diane Hatt)\n\n\"One time I got confused with the time zone and I phoned her at two in the morning,\" Ms Hatt said.\n\nMs Doevendans still has every letter Ms Hatt has written her, but had no choice but to switch from hard copy to online records as they switched to the digital world.\n\n\"I was actually printing [the letters] but then I had folders and folders full and I thought, 'nah, I've got to stop,'\" she said.\n\nJoy has kept every letter Diane has ever written to her. (ABC Riverland: Matt Stephens)\n\nFinal farewell\n\nOne of the benefits of living so far away from each other is the discretion that comes with it, something Ms Hatt cannot always rely on back home.\n\n\"You can tell each other secrets and know very well they're not going to get out in the community,\" she said.\n\nMs Hatt and her husband, Roger, just spent the past month visiting Ms Doevendans's family in South Australia.\n\nDiane and Roger have visited much of South Australia, including Kangaroo Island. (Supplied: Diane Hatt)\n\nWhile the pair made magical memories, Ms Hatt decided it was the last time they would visit Down Under.\n\n\"In an ideal world we would live six months here and six months in Canada,\" Ms Hatt said.\n\n\"How many people can say they have one of their best friends on the other side of the world?\n\n\"I do consider Joy one of my best friends … I consider her a sister.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/carnarvon-heritage-tourism-opportunities/105868342",
        "title": "'Cowboy town' divided over keeping its heritage assets",
        "publish_date": "Fri, 31 Oct 2025 21:46:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "It was once the lifeblood of Carnarvon, but today, the One Mile Jetty sits crumbling at the heart of the heritage precinct that was built to celebrate it.\n\nBuilt in 1897, it connected the town, 890 kilometres north of Perth, to the outside world before the first roads were built. It later became a popular fishing spot for generations of Carnarvon locals and visitors.\n\nBut in 2017, the aging timber structure was declared a safety risk and shut off to the public.\n\nA refurbishment is expected to begin next year, with plans for part of the jetty to be publicly accessible by 2027 — a decade after it was closed.\n\nWith federal funding going towards a glitzy new waterfront development, locals are disappointed about the jetty's future, but they are not yet giving up on seeing their treasured heirloom shine again.\n\nMemories of sunny days and manta rays\n\nWhen Jamie Venner was growing up, he spent much of his childhood at the jetty.\n\n\"It was an institution for kids growing up in Carnarvon for sure and was a bit of a pretty big tourism draw,\" he said.\n\nJamie Venner says the town's One Mile Jetty was \"an institution\". (Supplied: Jamie Venner)\n\n\"Carnarvon's got a long history — it goes back to like a western era, it was a cowboy kind of a town.\n\n\"We don't need anything new and flash, we just need to preserve the things that we've got and I think tourists appreciate that — they don't want to go sit in a flash cafe or a wine bar or something, they've got that where they come from.\"\n\nOptions for full restoration\n\nIn 2021, the state government allocated $8.7 million to repair — rather than rebuild — the jetty after it was lashed by Cyclone Seroja.\n\nIn stage 1, $4.2 million went to an emergency deconstruction of the intertidal and waterside parts and salvaging of fallen timbers to avoid navigational hazards.\n\nIt left only 700 metres of the once mighty 1,450-metre structure standing.\n\nThe One Mile Jetty has been closed since 2017. (ABC News: Kelsey Reid)\n\nThe long-awaited stage 2 will see up to 200m of the jetty restored – but it will not extend beyond marshland to reach the water.\n\nA business report by Acil Allen in 2022 weighed up 10 potential options for a stage 3, concluding that none of the options were financially viable.\n\n\"The deterioration in the asset condition of the Carnarvon One Mile Jetty, leading to the eventual removal of the majority of the structure for community safety reasons, is the outcome of a series of decisions over more than 30 years,\" the report stated.\n\nThe Department of Transport confirmed it did not intend to pursue any further rebuild or restoration past stage 2.\n\nHeritage assets left to decay\n\nWith the jetty’s fate all but sealed, the Shire of Carnarvon is not pursuing further state government funding.\n\n\"Given the significant whole-of-life costs and risks, we are not seeking to take on the ongoing management and maintenance of the jetty,\" said Shire CEO Mandy Dexter.\n\nMandy Dexter says the shire requires state government support to restore its heritage attractions. (ABC News: Kelsey Reid)\n\n\"Our focus is completing the Tramway Bridge — a key town asset that connects directly to the Jetty’s heritage story.\"\n\nAnother aging heritage asset, the Tramway Bridge was built in 1899 to connect the jetty to the centre of town.\n\nIt is now closed to the public after also falling into disrepair.\n\nStage 1 works on the Tramway Bridge have been federally funded. (ABC News: Kelsey Reid)\n\nRecently, the Shire of Carnarvon was awarded $15.5 million in funding from the federal government under the regional Precincts and Partnerships Program (rPPP).\n\nWhile most will go to new developments, $3.7 million was allocated for bridge repairs, but not enough to complete the project.\n\nCarnarvon's Tramway Bridge connected the town to the One Mile Jetty. (ABC News: Kelsey Reid)\n\nIn the hope that one of its heritage assets could once again open to the public, the shire attempted to transfer the jetty repair money to the Tramway Bridge repair.\n\nThe motion failed to pass the council.\n\nCarnarvon Heritage Group chair and shire councillor Dudley Maslen said he was frustrated by the situation.\n\n\"We're not building the Sydney Harbour Bridge, but they're doing their best to make it look that way,\" he said.\n\nDudley Maslen is frustrated at the lack of progress to fix the One Mile Jetty. (ABC News: Kelsey Reid)\n\nThe ripple effect\n\nCarnarvon has about 6,500 residents and some locals say the combination of having few attractions, tough liquor laws and high crime have marred the town's reputation.\n\nIt has left tourism operators and caravan parks reporting numbers down from previous years.\n\nCarnarvon is located 890km north of Perth in the Gascoyne region. (ABC News: Kelsey Reid)\n\nJo Bumbak has spent the past 26 years running her business, which is targeted towards tourists.\n\nThis summer will be her last.\n\nA decline in visitor numbers over the past few years left her car park empty last school holidays, and she said the business was no longer viable.\n\nJo Bumbak will close her preserves shop and cafe at the end of January. (ABC News: Kelsey Reid)\n\n\"Carnarvon doesn't have a lot of experiences, which is what the new tourist is chasing,\" she said.\n\n\" The tourism dollars are just driving past every hour of the day and night, and Carnarvon is really missing out, and we need state help. \"\n\nMs Bumbak has been a passionate advocate for the jetty and fundraised $10,000 last year through her business.\n\nShe aims to start a fundraiser involving making and selling one mile of rocky road that will be packaged up and sold to raise more money for the jetty.\n\nJo Bumbak has repurposed seconds produce in Carnarvon for more than two decades. (ABC News: Kelsey Reid)\n\nShe would like to see the jetty restored to its former glory.\n\n\"It is the greatest tourism asset that Carnarvon has and yet we can't get the support to fully fix this jetty,\" Ms Bumbak said.\n\n\"It's the one thing that people love to come and fish off, they love to swim off it, jump off it, walk on it, kite surf off it.\n\n\"The stories that people share today bring back all those memories and people want to experience that.\n\n\"And to me that is extremely valuable for tourism.\"\n\nLooking to the future\n\nDG Corp's Pier Development received more than half of a recent $15.5 million funding pool for Carnarvon. (Supplied: DG Corp)\n\nInstead of putting all of the federal government's $15.5 million funding to the town's heritage assets, the lion's share will go towards a brand new development dubbed \"The Pier\".\n\nThe development proposes to build permanent housing, resort-style accommodation and a bar/bistro.\n\nPrivate developer DG Corp has been awarded the tender, but state government approvals have not been made yet.\n\n\"It's going to happen and I'm pretty excited about it because we need that housing, both holiday and workforce housing,\" Shire President Eddie Smith said.\n\n\"It's probably the best piece of land in Carnarvon.\"\n\nEddie Smith is hopeful a new development in the town will attract more tourism. (ABC News: Kelsey Reid)\n\nRegional tourism body Australia's Coral Coast chief executive David O'Malley agreed accommodation was an issue and more luxurious options could lure in visitors.\n\n\"We need to attract the high value travellers and that basically means the people who spend more money,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/the-art-of-magic-wg-alma-collection/105925202",
        "title": "Why are women always the ones being sawn in half in magic shows?",
        "publish_date": "Fri, 31 Oct 2025 21:39:58 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Most Melburnians are fondly familiar with State Library Victoria's iconic domed reading room, where students study in creaky wooden chairs under green bankers' lamps and tourists circle in the galleries above.\n\nBut hidden in the maze of corridors, electronic security doors, and tunnels below is an unexpected archive of magical treasures.\n\nThe WG Alma Conjuring Collection is home to thousands of books, magazines, posters, memorabilia, scale models and photographs — all about magic and magicians.\n\n\"It is a bit different to our normal library collections,\" says librarian Jodi Kok.\n\n\"It has books, journals, stuff that you'd expect to find here. But it also has things like posters, tricks, scale models, and [prop] skulls.\"\n\nThe Conjuring Collection contains about 2,000 books on magic, 1,500 photographs, 300 posters and more than 400 detailed research files on individual magicians. ( )\n\nMelbourne-born magic man\n\nWill Alma was a stage magician born in Malvern, Victoria, in 1904. Both his parents were magicians, but after his father left his mother and moved to Hawaii to start a new family, Alma's mother was not keen for her son to follow in his father's footsteps.\n\nBut the boy had already caught the magic bug, and performed his first show at just 15 years of age in the local church.\n\nOriginally named Oswald George William Bishop, the magician changed his name to Will Alma by deed poll in 1949. ( ) Will took after his father, who performed as Alma, the Court Magician. ( ) Will Alma, around 1956, performing his signature trick of swallowing razor blades. ( )\n\nAlma became one of Australia's most well-known magicians of the 20th century, having particular success as a designer and manufacturer of magic tricks, props and devices. The most famous of his customers was \"The Great Levante\" — a world-renowned illusionist who Alma toured with in the 1940s.\n\nWill Alma was also a certified magic fanboy and prolific collector of conjuring memorabilia.\n\nStream The Art Of... on ABC iview Hosted by Namila Benson, the ABC's bold and vibrant arts and culture show The Art Of… returns for another season, taking you into the studios, brains and hearts of some of Australia's most exciting creators.\n\nThe book that started it all for Alma was Magic Made Easy by London-born international superstar magician David Devant, published in 1909. This magic manual is among the treasures that Alma accumulated over his life, but many of the items in the collection tell stories from closer to home.\n\nAlma compiled detailed files on hundreds of local magicians, providing invaluable details of the lives and careers of many magicians whose stories may otherwise have gone unrecorded — his collection now acts as a kind of history of the Australian magic scene.\n\nWomen in magic\n\nFor Australian theatre-goers in the 1900s, The Incomparable Sloggetts would have been a familiar name.\n\nFounded by patriarch Charles Sloggett in 1911, the magic troupe travelled all over the country.\n\n\"Charles toured for about 60 years and during that time he had a number of wives — not at once!\" says Kok.\n\nThe Sloggetts toured Australia for decades under the slogan, \"everything new except the name!\". ( )\n\n\"And one of his signature tricks was actually decapitating a wife, and the head would roll into the crowd, but would be a cabbage by the time it appeared.\"\n\nHowever, Charles Sloggett's second wife, Athena Pallas, was not content to just be decapitated on stage night after night.\n\nThree of Sloggett's four wives were magicians in their own right, and Pallas was possibly the first professional solo female magician in Australian history. She was skilled at conjuring, mind reading, snake charming and even ventriloquism.\n\nAlma had noticed that most of the Sloggett material didn't mention Pallas, so he wrote to her directly to create a file on her; their correspondence is part of the collection.\n\n\"She talks about having a really hard life touring with Charles,\" explains Kok.\n\n\"She had two children with him; he had other children. So she was looking after children, she was baking bread for them, she was making butter, she was driving everywhere, looking after the animals.\n\n\"She even made the tents that they would sometimes take with them if they performed in a place that didn't have a town hall.\"\n\nPallas left Sloggett in 1941 and went on to pursue her own career.\n\nAthena Pallas was a skilled conjurer, ventriloquist and snake charmer. ( )\n\nBut the lives and careers of 20th-century female magicians and assistants are often sidelined in what has traditionally been a male-dominated profession.\n\nIndeed, as Jodi Kok explains, many tricks and tropes of traditional stage conjuring take a decidedly gendered tone.\n\nThe famous \"buzz saw illusion\" — in which a male magician saws a glamorous assistant in half live on stage — is a particularly enduring trope.\n\nFirst staged by English magician PT Selbit in 1921, the trick appeared to become political in the years after women won the right to vote.\n\n\"One of his gimmicks was he actually offered to pay the suffragette Christabel Pankhurst to appear on stage and be sawn in half. She did not agree,\" says Kok.\n\nPT Selbit performing his \"sawing a woman in half trick\". ( )\n\n\" There was something around the culture there that I think was maybe a little misogynistic … It always seems to be a woman who's sawn in half. \"\n\nThe bequest\n\nWhen Will Alma died at the age of 89 in 1993, his vast collection was bequeathed to State Library Victoria — but not without several stipulations.\n\nOne is that the collection always be referred to as a \"conjuring\" collection, rather than a \"magic\" collection.\n\n\"I think the word conjuring is really important,\" says Jodi Kok.\n\n\"It's not occult stuff, even though some tricks sort of use that spiritual language, that's not what it's about.\"\n\nThe sawing in half trick was a turning point in the history of magic, heralding a more sensational and shocking style. ( )\n\nAnother stipulation of the bequest was that whenever items are exhibited, the library must do so in a way that does not give away trade secrets to the public en masse.\n\n\"But the great thing about this collection is, if you wanted to know how [a trick] was done, you could come in, look at the books, the journals […] and you could study up and find out,\" she says.\n\n\"But then you'd need to find a woman who was willing to be sawn in half.\"\n\nWatch the new season of The Art of... free on ABC TV and ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/canberra-liberals-internal-feud-distracting-from-job-opposition/105959904",
        "title": "Silence from Canberra Liberals leader only making a bad situation worse",
        "publish_date": "Fri, 31 Oct 2025 21:32:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "It was the subtlest of changes that few noticed — the appearance of two new microphones on the crossbench of the ACT Legislative Assembly.\n\nThey emerged in the hours after Elizabeth Lee and Peter Cain were suspended from the Canberra Liberals party room.\n\nWhen it became clear Ms Lee and Mr Cain remained committed to their party, albeit on the outer, the microphones were promptly removed after just a day.\n\nBut it was a stark reminder; anything can happen in politics.\n\nAnd after the events of this week, Ms Lee, the party's former leader, and Mr Cain, a former shadow minister, feel closer to the crossbench than ever before.\n\nThe unlikely vote that caused tensions to boil over\n\nThere's been simmering tensions within the Canberra Liberals for some time.\n\nLiberal party room indefinitely suspends former leader, backbencher Two backbenches have been suspended indefinitely from the Canberra Liberals party room.\n\nThe decision to suspend the two backbenchers came almost exactly a year to the day from Leanne Castley's successful tilt for the party's leadership — despite previously having assured Ms Lee of her support.\n\nIt also came just months after Mr Cain quit shadow cabinet, citing concerns over the party's leadership and alluding to issues around workplace culture.\n\nIt's been a matter of when, not if, the tensions were going to come to a head.\n\nBut it was an unlikely, largely procedural vote on the assembly's sitting calendar for next year that was the final straw.\n\nThe long-held Liberal principle?\n\nMs Lee and Mr Cain voted differently to their party colleagues — wanting to preserve the number of sitting weeks for next year at 13, rather than dropping to 12.\n\nAnd, in so doing, exercised a long Liberal tradition of being able to cross the floor.\n\nPeter Cain said he was incredibly surprised to be suspended from the party room. (ABC News: Toby Hunt)\n\nIn the words of Liberal senator Sarah Henderson: \"Being able to cross the floor is a very important principle in the Liberal Party\".\n\nBut it appears, on the face of it, doing just that saw Ms Castley banish Ms Lee and Mr Cain from her party room.\n\nWhat makes this situation more perplexing is Ms Castley's past comments saying backbenchers were indeed allowed to cross the floor.\n\n\"Well, as backbenchers, they have that opportunity of course,\" she told ABC's Stateline in September.\n\nThe missing leader\n\nLeanne Castley has so far refused to explain why the backbenchers were suspended. (ABC News: Stuart Carnegie)\n\nOther than two brief written statements, Ms Castley has been silent on the matter.\n\nThe ABC attempted to get answers from her as she arrived at the assembly on Thursday morning — almost 48 hours on from her decision.\n\n\"I will not talk about party room stuff with you today,\" Ms Castley said.\n\nBut when asked if the custom of allowing Liberal backbenchers to cross the floor was not the case in the Canberra Liberals, she responded: \"Of course it is the case in the Canberra Liberals.\"\n\nIt's a response that raises far more questions.\n\nIt also alludes, rather strongly, that there is something much greater at play here.\n\nLoading...\n\nThe longer Ms Castley stays silent, the more attention the feud gathers.\n\nAnd while she is silent, the space is being filled by Ms Lee and Mr Cain's side of the story — they've fronted the media several times to explain their version of events.\n\nMs Castley insists she won't be making any public comments, saying \"litigating these issues publicly is not helpful in showing a commitment to restoring trust.\"\n\nBut it's hard to see how staying silent is helping Canberrans build trust in her party and her as the ACT's alternative chief minister.\n\nLabor's bad day overshadowed\n\nLabor's Chris Steel was also not having a good day on Thursday. (ABC News: Matt Roberts)\n\nIn Ms Castley's statement on Thursday, she noted herself: \"The events of this week have, unfortunately, diverted attention from the issues that matter most to the people of the ACT.\"\n\nAnd, in an own goal for the Liberals, a perfect example of attention being diverted from where it should have been was presented that same day.\n\nCanberrans already knew the launch of the government's MyWay+ ticketing system was plagued by software bugs and hardware issues, but a scathing report by an assembly committee laid bare the shortcomings.\n\nTransport Minister Chris Steel was censured by the assembly over the part he played in the rollout.\n\nIt was the first time the assembly had censured an MLA since 2011.\n\nThe censure carries no ongoing consequences aside from reputational damage, but the damage done this week felt like a bit of a blip amongst the implosion of the opposition.\n\nHowever, with the Greens out of a formal coalition with Labor, Mr Steel's censure is evidence of the new makeup of the assembly at play.\n\nWe can expect to see more of this.\n\nUnknown path ahead\n\nThere's a whole month before the assembly next sits — the last sitting week of the year.\n\nBut before then, Liberal MLAs are due to meet to attempt to resolve their internal issues.\n\nElizabeth Lee says she still remains faithful to the Liberal Party. (ABC News: Ian Cutmore)\n\nIt's hard to know what happens from there — even if Ms Lee and Mr Cain are allowed back into the party room, it would be an extremely awkward environment.\n\nSo awkward it would almost certainly be unworkable.\n\nBut if the Canberra Liberals ever want to be seen as a viable alternative to Labor in the ACT, they'll want to quickly put this saga behind them.\n\nRight now, it's hard to see how they'll do that.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/abc-quote-quiz-november-1/105956502",
        "title": "ABC Quote Quiz: Brutal weather, a prince evicted, gen alpha slang and nature being weird … again",
        "publish_date": "Fri, 31 Oct 2025 21:30:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "See if you can decipher what's going on in these quotes from the past week in the news.\n\nLoading\n\nWhere to find all the ABC's quizzes\n\nWant to test yourself even further?\n\nTake a squiz at the ABC's New Quiz topic page and see if you're a whiz at our previous quizzes.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/tas-heritage-open-homes-southern-midlands-lonsdale-homestead/105953226",
        "title": "Open House southern midlands allows glimpse into farmer's life in 1800s",
        "publish_date": "Fri, 31 Oct 2025 21:21:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "On the rolling plains of southern Tasmania, historian Alan Townsend is working hard to preserve what was once a grand homestead on a sprawling agricultural farm in the 1800s.\n\nThe Lonsdale Homestead, near Kempton, was built in 1821 and sold to the Johnson family in 1854.\n\nJane Johnson was the matriarch of the homestead, and her diaries are helping Alan Townsend document the property's history. (ABC News: Scout Wallen)\n\nHistory traced through account books\n\nCracks are beginning to show at Tasmania's Woolmers Estate In northern Tasmania, Woolmers Estate is recognised for its heritage charm. But buckets to catch drips and cracks in walls show how that could change.\n\nUsing the diaries of the matriarch Jane Johnson, the farm's account books and original photographs, Mr Townsend has pieced together what life was like at Lonsdale.\n\n\"One thing that really comes across clearly is this lady likes hard work … up at 4am, washing, making jam, just crazy hard work,\" he said.\n\nMr Townsend said the Lonsdale farm had sheep, cropped hay and a working orchard.\n\nAlan Townsend has been restoring Lonsdale Homestead in Kempton, Tasmania, since 2003. (ABC News: Scout Wallen)\n\n\"Farms like this were essentially small towns in their own right, entirely aimed at producing food, not just for the family, but for the farm labourers,\" he said.\n\nMr Townsend said the accounting books showed workers were paid in both cash and goods.\n\n\"When you look at each week, when the men were getting paid, it'll be things like two shillings cash and one bottle of gin, one ounce tobacco, sugar, flour,\" he said.\n\nMr Townsend said if a maid dropped a saucer, a record would be kept, and it would be deducted from her pay.\n\nHe said the property, which he now owns, was a lot smaller than the original Lonsdale farm.\n\nLonsdale Homestead carriage works are still intact. (ABC News: Scout Wallen)\n\n\"A lot of ex-convicts were given grants of 50 acres or so, and they could not only feed their family off that, but they could make a profit,\" Mr Townsend said.\n\nHe said the last Johnson to farm here was in the 1980s.\n\n\"Basically, 700 acres just wasn't enough to make a living off anymore,\" Mr Townsend said.\n\n\" You could feed yourself and your family, but that's about it, so inevitably farms like this ended up being subsumed into larger farms. \"\n\nThe homestead is also still home to the original coach house and stables, which once held up to six horses at a time.\n\nThe original coach house and stables once held up to six horses. (ABC News: Scout Wallen)\n\nMr Townsend said Ms Johnson's diaries were full of tidbits — including recounting a story of a horse losing a shoe at Bridgewater, north of Hobart.\n\n\"It's the equivalent of like puncturing a tyre,\" Mr Townsend said.\n\nChance find helps bring house to life\n\nAlan Townsend said there was \"about a gazillion to one\" chance of the clock belonging to the Johnson farm when he bought it at auction. (ABC News: Scout Wallen)\n\nMr Townsend, who is the history projects officer at the Southern Midlands Council, has been restoring the property since he purchased it in 2003 for $146,000.\n\nOne of his favourite features is in the dining room.\n\nIt is a framed clock, sitting boldly on a mantelpiece.\n\nColonial-era solitary cells unearthed below council pool Tiny cells unearthed below an old swimming pool in the Tasmanian town of Oatlands shine a light on the \"miserable existence\" endured by inmates who were once imprisoned at the site.\n\n\"I came across it at auction during COVID times … I couldn't actually look at it in person, but I just took a chance because I recognised it,\" he said.\n\nWhen the clock arrived, it had \"Johnson Lonsdale\" written on the back.\n\nThe odds were \"about a gazillion to one\", Mr Townsend said.\n\nThe kitchen, with its original large fireplace and ceilings, paints a portrait of the segregation between the family and the servants at the time.\n\nIt leads to the back of the homestead, which is a stark contrast to the grandeur of the front of the home, which is led to by a winding driveway lined with elk trees.\n\nThe homestead has its original large fireplace in the kitchen. (ABC News: Scout Wallen)\n\n\"It is kind of about showing off, about saying, 'we've arrived and we're solid, respectable people', which you know is not entirely the case, but it was a good pitch,\" he said.\n\nHistorical buildings open to public\n\nOver the first weekend of November, homes across the southern midlands, including Lonsdale Homestead, will be open for the public to explore.\n\nThe Open House program runs across the world, but in a collaboration with the Southern Midlands Council and Australian Institute of Architects, it is opening up buildings outside of Hobart in southern Tasmania for the first time.\n\nMr Townsend said there were some \"pretty amazing properties there\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-01/working-holiday-makers-face-higher-risk-of-injury/105876542",
        "title": "Holiday workers risking injury so Australians can get meat",
        "publish_date": "Fri, 31 Oct 2025 21:21:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Read the story in Bahasa Indonesia\n\nJaya Daud Munthe had only just returned to work in a NSW abattoir after fracturing his hand when he had another accident that left him with a broken leg.\n\nA heavy box of lamb meat fell on the Indonesian working holiday visa holder as he was shifting a storage unit.\n\n\"I wanted to run, but it was too late,\" he said.\n\n\" I tried holding it [the box] with my hands … my left leg got twisted and I could hear the sound of it breaking. \"\n\nJaya Daud Munthe was injured twice at a job he took to extend his working holiday visa. (Supplied)\n\nAustralia's work and holiday visa (WHV) scheme is designed to bring young people into Australia to fill workplace shortages in critical sectors, like meat processing.\n\nHowever, advocates have raised concerns about the working conditions for participants such as Mr Munthe.\n\nAnd incidents discovered by the ABC have raised questions about whether employers are taking advantage of foreign workers' ignorance to skirt safety regulations.\n\nA report titled Backpacker Dispatches released earlier this month from the Migrant Workers Centre said the WHV scheme was functioning as a \"de facto low-wage migration stream\".\n\nIt lacked the safeguards, employment pathways and oversight that typically accompany formal labour migration programs, the report said.\n\nReport author Lea Knopf, who was herself on the visa for more than two years, said WHV holders were exposed to \"a higher risk of an injury\" due to the kinds of jobs they tended to fill.\n\nShe said they were also not given enough information on work safety and training.\n\nJaya Munthe broke his leg on his first day back at work after recovering from another injury. (Supplied)\n\nMr Munthe moved from Indonesia to NSW at the end of 2024 to try to earn a better wage and save money for later in life.\n\nHe found work at the Southern Meats abattoir in Goulburn, but just a few months later, in March, he fractured his left hand while lifting a heavy box of lamb meat in the abattoir's cold room.\n\n\"My co-worker pushed the box too hard from the other side, causing the corner of the box to hit my hand,\" he said.\n\n\"It was very painful.\"\n\nHe took two weeks off and then had the second accident the day he returned.\n\nHe had to undergo surgery on his leg and was off work for another three months.\n\nMr Munthe, who worked in industrial engineering in Indonesia, said equipment at the abattoir was not properly maintained.\n\nHowever, the true cause of the accident remains unknown because, according to the authorities, it was never investigated.\n\nReport author Lea Knopf says working holiday-makers face a greater risk of injury at work. (Supplied)\n\nWHV holders reluctant to report issues\n\nAny serious injury, illness or death that occurs while at work is supposed to be reported to the workplace health and safety authority — SafeWork NSW.\n\nBut a spokesperson told the ABC it \"has not received notification of an alleged incident\" relating to Mr Munthe.\n\nCompanies can be fined up to $50,000 for not notifying SafeWork NSW of incidents involving serious injury, illness or death.\n\nMr Munthe said he told his manager at the agency through which he had found the job, and they helped arrange an insurance claim that covered his medical treatment and wages — but they never informed the authorities.\n\nSouthern Meats was contacted by the ABC about Mr Munthe's case, but declined to comment.\n\nMr Munthe was surprised to find out his former employer had not reported his case to the safety authority.\n\n\"Maybe they want to maintain a good track record, but if there are already too many accidents, I think they should report them in accordance with the law,\" he said.\n\nHowever, Mr Munthe said he was not planning to take the matter further.\n\nAfter suffering two injuries, he decided the workload and risks of working at the abattoir were not worth it.\n\nHe now works at a supermarket in Goulburn.\n\n\"I don't think I will report this case because I have resigned,\" he said.\n\n\" But the company is still in the wrong. \"\n\nA spokesperson for NSW Minister for Work Health and Safety Sophie Cotsis told the ABC that Mr Munthe would have to report the incident before SafeWork NSW would be able to look into it.\n\n\"Every worker has the right to go to work and return home safely at the end of the day,\" the spokesperson said.\n\nDo you know more? If you have any information about a story, contact Natasya Salim or Erwin Renaldi.\n\nThe Department of Home Affairs granted 321,116 working holiday-maker visas from July 2024 to the end of June 2025.\n\nTypically, the visas last for up to three years and can be renewed every 12 months.\n\nTo extend the visa for another year, holders are required to work within the farming, hospitality, mining or construction sectors in regional areas for at least three months.\n\nAustralian employers deliberately taking advantage of their vulnerability, UN official says Temporary migrant workers in Australia are facing \"disturbing\" patterns of exploitation from some employers, the United Nations Special Rapporteur on contemporary forms of slavery, has warned after touring Australia.\n\nIt was established in 1975 for young participants — especially for eligible individuals from Canada, Ireland and the United Kingdom.\n\nSince then, the list of countries under the WHV program has grown to at least 40.\n\nYoung participants often seek a WHV for financial reasons, Ms Knopf said.\n\nShe said many WHV participants were reluctant to report incidents of harassment or any workplace rights violations because they feared their employers could cancel their visas.\n\nUnions NSW assistant secretary Thomas Costa told the ABC \"it's very common for employers of migrant workers\" not to report injuries in their workplace.\n\nThomas Costa says it is common for companies that employ migrants not to report injury cases. (Supplied)\n\nHe said that could be because they were trying \"to avoid inspections from the regulator because they are engaging in unsafe work practices\".\n\n\"It's very, very sad that there are some employers out there that are willing to put profits before people's safety,\" he said.\n\nWhen a relevant injury case was not reported, Mr Costa said the regulators, who were there to ensure that workplaces met safety standards, were not able to investigate and inspect the company.\n\nAccording to a Department of Home Affairs spokesperson, another visa was being trialled that allowed workers to extend their stay in Australia while they \"pursue workplace justice\" to help WHV holders who fear the consequences of reporting unsafe practices.\n\nWorking holiday-makers can extend visas by working in farming, hospitality, mining, or construction in regional areas. (ABC News: Maren Preuss)\n\nLack of proper training\n\nWith Australia increasing the WHV quota for young Indonesians to 5,000 per year, the visa has become popular among the country's gen Z workers, especially amid a shortage of decent job opportunities and fair wages back home.\n\nAini Rodianto is a WHV holder from Indonesia who worked in an abattoir in Victoria for about a year.\n\nShe said in April 2024, her co-worker accidentally poured nearly boiling water on her while they were cleaning.\n\nAini Rodianto was injured while working in an abattoir. (Supplied)\n\n\"When I realised they were standing too close to me, I shouted,\" she said.\n\n\"They didn't notice, and before I knew it, the boiling water had entered my boots, which went up to my calves.\"\n\nShe was hospitalised for a week and had surgery on her legs to replace the skin, especially on the most injured parts — her ankle and heel.\n\nMs Rodianto said that her monthly pay and the treatment costs were covered by her work agency, but she has had to live with permanent burn scars.\n\nMs Rodianto was injured by boiling water at her workplace. (Supplied)\n\nShe said the work safety in her company \"was not 100 per cent good\" due to the lack of facilities and staff, which often forced people to overwork.\n\nThe co-worker who injured her had not been properly trained to clean the floor as it was not in their job description, Ms Rodianto said.\n\nIt remains unclear whether the authorities were properly notified about Ms Rodianto's accident.\n\nA WorkSafe Victoria spokesperson said they were unable to comment on individual cases.\n\nMs Rodianto said she had heard of other WHV participants being injured at her former workplace.\n\n\"No matter how much we try to stay safe, there is always that risk … because our job is a bit dangerous,\" she said.\n\nMs Rodianto quit in September and moved to Queensland to study.\n\nHowever, she requested that the ABC not name the company to avoid any future repercussions.\n\nOther WHV holders working in Melbourne meat factories have told the ABC similar stories.\n\nOne abattoir worker, who wanted to stay anonymous, said they were made to work at a dangerously high pace, but during inspections, management would lower the machine's speed to normal to avoid being caught breaking the rules.\n\nThey also said machines were outdated and \"rusty\", and that workers were not properly trained on how to use knives.\n\nOne abattoir worker said they were made to work at a dangerously high pace. (ABC News: Erwin Renaldi)\n\nNo data collected on WHV incidents\n\nFederal statutory agency Safe Work Australia told ABC they did not have specific information on work-related injuries suffered by working holiday visa holders or migrants.\n\n\"Data on the claimant's visa status, or their country of birth or year of arrival in Australia, is not collected as part of the claims process,\" a Safe Work Australia spokesperson said.\n\nMs Knopf said this needed to change.\n\nShe also suggested the government introduce a more regulated labour program to replace the current model of the WHV.\n\nAssociate professor in Public Policy at the University of Sydney Anna Boucher said visa holders should be given training in their home countries.\n\n\"Because then people are aware of these basic rights before they come into the country and can negotiate with the employer,\" Dr Boucher said.\n\nAnna Boucher says migrants may not be aware of their rights. (Supplied)\n\nShe also suggested more involvement of unions for WHV workers.\n\nMs Rodianto emphasised the \"enormous\" contributions working holiday-makers made to Australia's economy.\n\n\"We work selflessly,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/derby-day-live-updates-punters-descend-on-flemington-racecourse-as-melbourne-weather-finally-shines-20251031-p5n6u9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Derby Day LIVE updates: Daicos, Dalins shine on Derby Day as Waller wins first up",
        "publish_date": "Sat, 01 Nov 2025 13:03:48 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Danny Russell",
            "Andrew Wu",
            "Cara Waters",
            "Damien Woolnough",
            "Nell Geraets"
        ],
        "text": "The marquees are open in the Birdcage with a flurry of guests arriving just in time for the first race.\n\nEach year the Victoria Racing Club sponsors try to outdo themselves with Lexus, Crown and Kirin all constructing three storey marquees this year.\n\nJosh Daicos and Annalise Dalins rriving at The Birdcage on Victoria Derby Day at Flemington. Credit: Penny Stephens\n\nThe interiors are lavishly decorated with Lexus sporting three balconies with sweeping views of the track this year while Crown has deployed a 500 glass tower of champagne at its entrance.\n\nCollingwood footballer Josh Daicos and fiancee Analise Dalins were early arrivals headed for the Mumm marquee.\n\nDalins was in an all white ensemble with a strapless mini dress by Olia Couture and Embellish Atelier millinery with her outfit styled by Paul Versace.\n\nLoading\n\n“It’s the day that kicks off the Melbourne racing carnival,” she said.\n\n“I’m just excited to be here to see everyone to be a part of the atmosphere.\n\nThe couple attended the Everest races in Sydney last month but Dalins diplomatically would not be drawn into any comparison between the two events.\n\nDaicos said he was looking forward to spending the day with friends and expected to see a few footballers around the marquees.\n\n“We have friends coming here which is really nice to be able to socialise with them,” he said. “I’m looking forward to seeing a few teammates I just ran into Jack Crisp.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/this-massive-tip-stinks-and-is-home-to-a-plague-of-seagulls-owners-want-to-triple-its-size-20251029-p5n64k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This massive tip stinks and is home to a plague of seagulls. Owners want to triple its size",
        "publish_date": "Sat, 01 Nov 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "During busy times of the day, council rubbish trucks experience congestion at the Ravenhall tipping face, which jeopardises their ability to complete bin pick-up cycles across the city, Cleanaway argues. The company says the cap also gives the tip’s operators less time to compact piles of waste, which means the landfill is filling up more quickly. “The landfill cells have a shorter lifespan than planned,” the company said in its latest proposal, adding that the density of waste in each landfill cell has reduced by 12 per cent since 2019 because machine operators are getting less time to compact it. The expanded tipping face would only be used at times of high demand, when there is a logjam of council waste trucks, the company argues. It claims the expansion will bring environmental benefits because the landfill will be able to accept more rubbish and trucks will not have to idle for long periods. The EPA has twice refused to give Cleanaway’s proposed two-year pilot project a green light. An EPA assessment submitted to VCAT as part of the hearing details the environmental watchdog’s opposition to Cleanaway’s proposal, including its rejection of the company’s claim that a two-year tipping face expansion could credibly be called a trial.\n\n“The concept proposed by the applicant does not seek to engage in a genuine activity of research, demonstration or development as it is not seeking to assess a new concept,” the EPA says in its statement of claims. Instead, Cleanaway hopes to expand its tip operation “without providing any system to determine an optimum tipping face size that adequately mitigates against environmental risks”. The EPA argues that there are “four tangible risks to human health and the environment” if Cleanaway expands its operation: more litter; more vermin and disease vectors; more risk of landfill fires; and increased odour. First in the line of impact from an expanded landfill operation would be inmates of the Dame Phyllis Frost remand centre, just 200 metres away. The EPA argues inmates’ human rights could be breached due to impacts from odour, litter and vermin.\n\n“The neighbouring correctional facility may be impacted due to close proximity and the inability for inmates to be removed from the facility if impacted by odour. Vermin fouling roofs may also compromise security monitoring equipment,” it said. The EPA also argues the bigger tipping face would cause a spike in the local seagull population. The Ravenhall tip is already home to thousands of silver gulls, and the EPA says a surge in their numbers would damage nearby property and threaten the survival of other bird species. “EPA considers the trial will increase the quantity of exposed waste on site due to the larger tipping faces which will increase the availability of food for vermin, in turn attracting more vermin to the site.” Site inspections by EPA officers suggest the company already struggles to control litter escaping from the landfill or to manage the seagull population, the authority said.\n\nCleanaway breached its tipping face cap 24 times between June 2021 and April 2025, according to EPA records. The EPA’s stance drew fire from Peter Anderson, chief executive of industry group the Victorian Waste Management Alliance, who accused it of being obstructionist, instead of helping Cleanaway solve the problem. Anderson said Melbourne was running low on landfill capacity and Cleanaway was trying to find answers. “Melbourne is getting bigger, and it’s producing more waste, and we are getting less holes in the ground. Why doesn’t the EPA work with Cleanaway for a better solution, rather than just building walls?” he said.\n\n“It’s the community in the end that will suffer because they won’t be able to get rid of their rubbish, or it’s going to cost more and more to move it somewhere else.” Melton Mayor Steve Abboushi said residents in nearby Mt Atkinson had already complained to the council about landfill odour. “The community is deeply concerned about what this application means in terms of the environmental effects, especially given this tip is very close to a number of our housing estates,” Abboushi said. “We hold concerns about what this means in real terms for our residents.” Loading",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/derby-day-flemington-2025-20251101-p5n6yu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Derby Day Flemington 2025",
        "publish_date": "Sat, 01 Nov 2025 11:59:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Derby Day Flemington 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/flares-thrown-at-oasis-concert-in-melbourne-20251101-p5n6yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flares thrown at Oasis concert in Melbourne",
        "publish_date": "Sat, 01 Nov 2025 11:11:57 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Flares thrown at Oasis concert in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/you-will-get-yours-liam-gallagher-tees-off-after-flare-set-off-in-melbourne-oasis-crowd-20251101-p5n6yh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You will get yours’: Liam Gallagher hits out after flare lit in Melbourne Oasis crowd",
        "publish_date": "Sat, 01 Nov 2025 11:10:25 +1100",
        "category": "entertainment",
        "authors": [
            "Ashleigh Mcmillan"
        ],
        "text": "Oasis singer Liam Gallagher has hit out at people who threw a flare into the crowd at the band’s Friday night Melbourne show – the first concert of its Australian tour – warning them “you will get yours”.\n\nIn videos posted online, a flare can be seen being thrown high into the air from the general admission area of Marvel Stadium during the band’s final song, Champagne Supernova, before arching back into the crowd while still aflame.\n\nVision from another angle near where the flare was thrown shows a man passing the burning flare to another man, before he launches it overhead.\n\nSmoke can be seen emanating from the place where it lands in the packed crowd.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/ground-control-to-kim-kardashian-we-ve-been-to-the-moon-six-times-20251101-p5n6yi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ground control to Kim Kardashian: We’ve been to the moon six times",
        "publish_date": "Sat, 01 Nov 2025 10:58:23 +1100",
        "category": "entertainment",
        "authors": [
            "Rich Mckay"
        ],
        "text": "Atlanta: In a testament to Kim Kardashian’s power to grab the spotlight, the head of NASA felt compelled this week to set the record straight when the reality TV queen said she believed a well-worn conspiracy theory that the 1969 Apollo 11 moon landing was a fake.\n\nIn a new episode of Hulu’s long-running family saga The Kardashians, the show’s star said she thought the lunar landing by astronauts Neil Armstrong and Buzz Aldrin was fiction.\n\nKim Kardashian expressed doubt about the moon landings in a recent TV episode. Credit: Invision\n\nWhat convinced her, she said during the segment, was a video she saw online of an Aldrin interview. She said she interpreted his comments in that interview to mean the moon landing never occurred.\n\nSince the 1970s, sceptics have floated the notion that the mission – viewed live by tens of millions of people around the world – was actually staged.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/you-should-play-a-back-five-i-used-chatgpt-for-advice-on-tactics-soccer-coach-admits-20251101-p5n6yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You should play a back five’: I used ChatGPT for advice on tactics, soccer coach admits",
        "publish_date": "Sat, 01 Nov 2025 10:01:24 +1100",
        "category": "sports",
        "authors": [
            "Kathryn Batte"
        ],
        "text": "A coach in America’s top women’s league has admitted to using ChatGPT to determine her team’s tactics.\n\nLaura Harvey, the head coach at National Women’s Soccer League club Seattle Reign, said she asked the AI chatbot questions about strategy and tactics, then implemented what it advised.\n\n“One day in the off season, I was writing things into ChatGPT like, ‘What is Seattle Reign’s identity?’ And it would spurt it out,” Harvey told the Soccerish podcast.\n\n“And I was like, ‘I don’t know if that’s true or not.’",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/the-ashes-are-here-and-australia-still-haven-t-found-an-opener-but-mess-isn-t-all-of-selectors-making-20251031-p5n6ry.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Ashes are here and Australia still haven’t found an opener. But mess isn’t all of selectors’ making",
        "publish_date": "Sat, 01 Nov 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "The evidence, unfortunately for Australia, supports both arguments. Neither one matters now. The Ashes has arrived and the top-order will consist of a 38-year-old converted first-drop and … and who?\n\nEqually, letting Warner go on and on when Australia could have been cultivating new top-order batsmen might have been the selectorial chicken that was always going to come home to roost in the 2025-26 Ashes.\n\nMaybe David Warner was right, and the Australian selectors really did have to put up with the mediocrity of his declining years because there was no-one better.\n\nIn the 15 Test matches since Warner took his chosen bow, Usman Khawaja has changed partners like a square dancer: six swapsies. He took four turns around the floor with Steve Smith (average partnership 21.75), three with Nathan McSweeney (19.8), two with Sam Konstas (39.25), two with Travis Head (54, when Head was a horse for a Sri Lankan course), one with Marnus Labuschagne (20) and finally back with Konstas for another three (18.3). During that time, Australia has lost its first wicket, on average, with 26 runs on the board.\n\nFor what it’s worth, the average opening stand in Warner’s last 15 Test matches was 34.2. There were days when Australia being none for 100 at lunch on the first day of an Ashes series felt a bit boring. This summer, only optimists are forecasting one for 34 by drinks.\n\nCredit: Simon Letch\n\nThe names of Khawaja’s dance partners, post-Warner, say as much as their figures. Smith, McSweeney, Head and Labuschagne were all playing out of position (as was Khawaja when he returned to the Test team four years ago). Only Konstas was an opener, though he did everything possible not to look like one. He was lumped with the unrealistic expectations of Australian magical thinking. If Bradman, Ponting, Walters and Steve Waugh were good enough for Test cricket when barely drinking age … yup.\n\nSince they started watching the Sheffield Shield again around 2024, the selectors must have been wondering what kind of game this was and where all the openers had gone. They awarded Marcus Harris a central contract just before his batting position, and his stats, dropped down the Victorian order. Jake Weatherald has been consistent, but his career average is, like his age, in the 30s. At his big audition this week he made a third-ball duck and 12. The urgers keep saying Konstas is one innings away when he looks more like he’s three years away. Henry Hunt, Campbell Kellaway, McSweeney – one of them is looking great one week, out cheaply to a Jackson Bird or a Matthew Kelly the next.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/why-england-have-stacked-their-bench-and-given-the-wallabies-an-opportunity-20251031-p5n6us.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why England have stacked their bench – and given the Wallabies an opportunity",
        "publish_date": "Sat, 01 Nov 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "Here is a statistic that might comfort Wallabies fans looking ahead to the Twickenham clash against England with a degree of anxiety given the amount of good players who are unavailable.\n\nEngland have not won the opening Test of their November campaign since 2021, when they beat Tonga.\n\nSince then, they have suffered opening-night losses to Argentina (2022) and New Zealand (2024), and their coach Steve Borthwick seemed painfully aware of their slow November starts as he talked up their lack of preparation time this week.\n\nBut the biggest giveaway that England are searching for an answer to that problem came from their team selection.\n\nSuperficially, it’s a strange-looking team – almost lightweight up front, with baby-faced loosehead prop Fin Baxter joining Joe Heyes of Leicester in the front row, with British and Irish Lions props Ellis Genge and Will Stuart biding their time on the bench.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/billionaire-portelli-backs-out-of-derrimut-gym-deal-20251101-p5n6xz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Portelli backs out of Derrimut gym deal",
        "publish_date": "Sat, 01 Nov 2025 09:25:13 +1100",
        "category": "finance",
        "authors": [
            "Ashleigh Mcmillan",
            "Sophie Aubrey",
            "Sarah Danckert"
        ],
        "text": "Billionaire businessman Adrian Portelli will no longer purchase a stake in the floundering Derrimut 24:7 Gym empire, saying he could not see “eye to eye” with the owners to make the deal work.\n\nThe gym’s founder, Nick Solomos, is now fighting to save the company from liquidation by the Australian Tax Office.\n\nPortelli’s announcement came only hours after a controversial adjournment in the Federal Court as the company’s creditors chase millions in late payments.\n\nNick Solomos with Adrian Portelli during an auction on The Block. Credit: Nine\n\nAn investigation by The Age revealed in September that the rapidly expanding Melbourne gym empire had been failing to pay taxes, staff superannuation, and hundreds of businesses and landlords.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/flemington-spring-carnival-kicks-off-today-20251101-p5n6y6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flemington Spring Carnival kicks off today",
        "publish_date": "Sat, 01 Nov 2025 07:37:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flemington Spring Carnival kicks off today\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/ex-prince-andrew-may-not-leave-the-royal-lodge-for-months-20251101-p5n6y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-Prince Andrew may not leave the royal lodge for months",
        "publish_date": "Sat, 01 Nov 2025 07:36:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Ex-Prince Andrew may not leave the royal lodge for months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/reporter-slammed-after-confrontation-with-missing-four-year-old-s-grandmother-20251101-p5n6y5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reporter slammed after confrontation with missing four-year-old’s grandmother",
        "publish_date": "Sat, 01 Nov 2025 07:36:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Reporter slammed after confrontation with missing four-year-old’s grandmother\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/tributes-pour-in-for-boy-who-died-during-cricket-training-20251101-p5n6y3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tributes pour in for boy who died during cricket training",
        "publish_date": "Sat, 01 Nov 2025 07:36:29 +1100",
        "category": "sports",
        "authors": [],
        "text": "Tributes pour in for boy who died during cricket training\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/a-little-bit-nerve-racking-how-students-think-they-fared-in-qce-s-largest-exam-20251024-p5n544.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A little bit nerve-racking’: How students think they fared in QCE’s largest exam",
        "publish_date": "Sat, 01 Nov 2025 07:00:00 +1100",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "In the week of a Caesar switch-up that devastated ancient history students and wild weather that knocked out half a dozen campuses for a day, students across Queensland also faced the state’s biggest exam.\n\nAlmost 28,000 year 12 students sat their external English exams on Tuesday, with a passing grade in the subject mandatory for their Queensland Certificate of Education.\n\nIn Brisbane’s west, students at The Gap State High School said they felt well-prepared for the test, even finding the questions “not too hard”.\n\nThe Gap State High School Students Ella Gjerek (left) and Amelia Lynch (right). Credit: Catherine Strohfeldt\n\n“We’d studied Macbeth for the past term, [and] they’ve been using Macbeth for a long time, so it’s a little bit nerve-racking to see what questions they’ve come up with, but I knew it would work out,” school captain Amelia Lynch said.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-1-november-2025/ze67sxp34",
        "title": "Midday News Bulletin 1 November 2025",
        "publish_date": "Sat, 1 Nov 2025 01:02:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nGovernment announces the biggest overhaul of aged care in a generation...\n\nUnited Nations urges safe passage for Darfur civilians as fighting intensifies...\n\nJamie-Lee Price crowned Australian netball's top player.\n\n\n\n\n\nThe Albanese Government has unveiled the biggest overhaul of aged care in a generation, with the Aged Care Act 2024 and a new Support at Home program now in place.\n\n\n\n\n\nThe reforms, responding to the Royal Commission into Aged Care, aim to give older Australians more control, stronger rights and higher standards of care.\n\n\n\n\n\nThe $4.3 billion home-care scheme will help people stay at home longer, adding 83,000 new support places this year.\n\n\n\n\n\nResidential care spots will now be assigned directly to individuals, giving greater choice and flexibility.\n\n\n\n\n\nProviders face tougher standards, with stronger oversight from the Aged Care Commission.\n\n\n\n\n\nAged Care Minister Sam Rae says the changes mark the start of a new era, one built on dignity, respect and genuine choice for older Australians.\n\n\n\n\n\nTreasurer Jim Chalmers says Australia will make it easier for trusted foreign investors to put money into the country, while tightening scrutiny on riskier deals.\n\n\n\n\n\nUnder the new plan, low-risk investors from friendly nations could soon receive automatic approval for certain projects, speeding up the process and encouraging more overseas capital.\n\n\n\n\n\nMr Chalmers says the goal is to strike a balance attracting reliable partners like Canadian pension funds, while keeping a closer watch on those posing potential national-security or economic risks.\n\n\n\n\n\n\"Our vision is for Australia to be the destination where global investment flows first and grows fastest. When you reconsider and redeploy the capital that you manage, our objective is for Australia to be the most obvious and the most compelling place to put it to work. When you run the numbers, when you test risk, return and reliability, our goal is for Australia to be at the very top of your models.\"\n\n\n\n\n\nQueenslanders are being warned to brace for a volatile weekend, with forecasters predicting severe thunderstorms, destructive winds, and giant hail across much of the state’s south-east.\n\n\n\n\n\nThe Bureau of Meteorology says conditions are likely to worsen today [[Saturday]], which is shaping up to be the most dangerous day of the current weather system.\n\n\n\n\n\nAreas stretching from Charters Towers down to the New South Wales border and as far west as Charleville are expected to be hit, with widespread rainfall of 40 to 100 millimetres and the risk of flash flooding.\n\n\n\n\n\nMeteorologist Jonathan How.\n\n\n\n\n\n\"So Saturday, we see the area of severity very much expands all the way from the mid north-coast of New South Wales and up into the central highlands of Queensland and inland to many communities through there. Importantly, we have a very large area where severe thunderstorms are likely. This includes Brisbane, parts of the Gold Coast, Sunshine coast and inland communities like Toowoomba, Dalby and Kingaoy and down towards Glen Innes and Moree in northern parts of New South Wales.\"\n\n\n\n\n\nThe warning comes as the family of 21-year-old Finlay Bones, struck by lightning on the Sunshine Coast earlier this week, remembered her as a beautiful, kind and caring young woman taken in the prime of her life.\n\n\n\n\n\nThe United Nations has urged safe passage for civilians fleeing Sudan’s paramilitary forces in Darfur and protection for those still trapped in El-Fasher.\n\n\n\n\n\nRefugees arriving at a nearby camp after days on foot told aid workers that roads were strewn with bodies, amid reports of hundreds killed.\n\n\n\n\n\nThe Rapid Support Forces had besieged El-Fasher, the army’s last stronghold in Darfur, for 500 days before seizing control.\n\n\n\n\n\nThe UN migration agency says more than 36,000 people have fled since Sunday many at night on foot.\n\n\n\n\n\nSatellite images suggest an earthen wall built by the R-S-F now traps residents inside what observers call a kill box.\n\n\n\n\n\nSawsan Mukhtar, a Sudanese-Australian journalist based in Adelaide and originally from Al-Fashir, spoke to SBS Arabic and describes the dire conditions there.\n\n\n\n\n\n\"The Rapid Support Forces control the entrances to the city, so it’s difficult to bring in food. People are living in famine conditions and have been forced to eat animal feed. Al-Fashir was once a wealthy city, and today people can’t find anything to eat.\"\n\n\n\n\n\nMidcourt star Jamie-Lee Price has been crowned the nation's best netballer, taking out the 2025 Liz Ellis Diamond award.\n\n\n\n\n\nPrice's individual honour comes after a successful year with the Giants in the Super Netball competition and the Diamonds and winning the Constellation Cup back from New Zealand this week.\n\n\n\n\n\nWhile she has signed with the Melbourne Mavericks for 2026, the 29-year-old is the first Giants player to claim the award, named after goal-keeping great Liz Ellis, who is now the chair of Netball Australia.\n\n\n\n\n\nPrice finished the Super season with 444 feeds, 217 goal assists, 19 deflections and eight intercepts.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/multicultural-communities-report-a-greater-sense-of-belonging-new-sbs-report-reveals/66w4wujfz",
        "title": "Multicultural communities report a greater sense of belonging, new SBS report reveals",
        "publish_date": "Fri, 31 Oct 2025 21:32:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAccording to the 2021 census, almost one in four Australians speak a language other than English at home.\n\n\n\n\n\nA new report by SBS and the University of Canberra that looks into sense of belonging and media representation among multilingual Australia has found the majority of them feel like they belonged to Australia, but less than half of them feel they can have influence over Australian society.\n\n\n\n\n\nThu Nguyen is a co-author of the report.\n\n\n\n\n\nShe has told SBS Vietnamese that factors such as residency status, media representation and English proficiency can contribute to the overall sense of belonging.\n\n\n\n\n\n\"There are variation and nuances across different language community because of their status in Australia, because of their dynamics in terms of demographics, and time of settlement in Australia, however the most consistent factor that has influence on community sense of belonging is probably English proficiency, or their confidence in their English language. We found people that are more fluent in English are more likely to feel they belonged, feel at home.\"\n\n\n\n\n\nThe report is a follow-up on the same survey in 2023, but this time it interviewed over 1,800 respondents across seven languages, including Arabic, Cantonese, Italian, Mandarin, Punjabi, Vietnamese and English.\n\n\n\n\n\nIt shows that while compared to the same survey done in 2023, there's an increased sense of belonging as more people feel their needs being met and their community members caring each other - there are still challenges to overcome.\n\n\n\n\n\nThe report also indicates a generational divide, showing younger multilingual respondents are more likely to engage in national and global issues compared to older generation, but also less likely to agree that their cultural communities are fairly represented by media.\n\n\n\n\n\nPunjabi speakers were interviewed for the first time in this series of surveys - and the report has they have the highest sense of belonging across other cohorts, while Mandarin speakers feels the least connected.\n\n\n\n\n\nThu Nguyen says one of them is media representation of multicultural communities.\n\n\n\n\n\n\"In terms of representation in the media and in the news, they are however more critical about feeling fairly represented, covered in the media. And we know, from the previous research, again, the finding this time confirm there's such a strong connection between feeling represented in the media in the news and feeling that they belong in Australia.\"\n\n\n\n\n\nThe report also sheds light on a concept known as collective efficacy, which refers to the belief on the impacts of people's own cultural or language community can have on Australian society.\n\n\n\n\n\nIt shows those who have stronger belief in their own collectives are more likely to engage in civic participation, such as volunteering, joining protests, and voting in elections.\n\n\n\n\n\nBut while two-third of multilingual Australians have at least one civic engagement, their participation can be uneven.\n\n\n\n\n\nThe report finds Mandarin and Punjabi speakers reported the highest civic participation rates, while Cantonese speakers reported the lowest, at 49 per cent.\n\n\n\n\n\nCo-author Rebecca Griffiths, who's also the Audience Research Lead at SBS, has told SBS Arabic there is still a lot to do.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/aged-care-reforms-who-will-pay-more-under-the-new-system/8aqjfk7wy",
        "title": "Aged care reforms: Who will pay more under the new system?",
        "publish_date": "Fri, 31 Oct 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUntil her mid-eighties, Lee Hodgson was fit, healthy and engaged with the community through the Older Women's Network.\n\n\n\n\n\n\"I was State President of Queensland for six years. I ran a branch in Gympie for 13 years.\"\n\n\n\n\n\nBut last year, aged 85, she underwent radiotherapy for a cancer affecting her nose - and this year she suffered a heart attack requiring a series of operations, from which she is still recovering.\n\n\n\n\n\nWith her husband Andrew also suffering from chronic health conditions, she says, everyday tasks like cleaning the house, or even having a shower, have become difficult.\n\n\n\n\n\n\"It really puts a lot of stress on your mental health, on your, what you're dealing with - your health, the problem you're dealing with. You get anxious. You get irritable.\"\n\n\n\n\n\nLee and Andrew were first assessed for in-home support at the start of last year before she fell ill.\n\n\n\n\n\nShe was assessed again after her cancer treatment - and yet again recently.\n\n\n\n\n\nBut she says the two hours a fortnight of cleaning services she eventually received not enough, and even that support is irregular.\n\n\n\n\n\n\"You pay your taxes all your life. And when you get to this age here I am needing some help for the first time in my life and we can't get it.\"\n\n\n\n\n\nWith an ageing population, Australia is facing skyrocketing demand for aged care services.\n\n\n\n\n\nAccording to the Treasury, within 40 years, the number of people over the age of 65 is expected double, and the number of people aged over 85 will triple.\n\n\n\n\n\nCraig Gear, the CEO of the Older Persons Advocacy Network or OPAN [[o-pan]], says that presents governments with a challenge.\n\n\n\n\n\n\"It's fantastic in Australia that we have an aging population and we have more older people around. But we need to make sure that we've provided a financial system and a financially viable aged care system that some of the levers in this new act help contribute to that.\"\n\n\n\n\n\nFrom Saturday the 1st of November, sweeping reforms to aged care will come into effect, under the new Aged Care Act which passed parliament a year ago.\n\n\n\n\n\nThey're the long-awaited result of the Royal Commission into Aged Care Safety and Quality, which delivered its final report in 2021, to repair a system which many saw as broken.\n\n\n\n\n\nThe government has already acted on some recommendations of the Royal Commission - such as increasing wages for aged care workers, and boosting supervision of residents in nursing homes.\n\n\n\n\n\nCraig Gear says the changes represent an new approach to aged care.\n\n\n\n\n\n\"What the New Aged Care Act does is one, it does bring in improved quality standards, which the Royal Commission said was way needed into the aged care system. It also provides greater protections for older people through greater powers of the regulator. It brings a statement of rights that providers have a positive duty to actually uphold the human rights of older people, and it also allows older people to continue to make the decisions for themselves through the supported decision-making framework.\"\n\n\n\n\n\nBut, there is much anxiety in the community, the sector and among advocates about the new funding model.\n\n\n\n\n\nUnder the new Aged Care Act, the current system of Home Care Packages will be replaced by the new Support at Home program, which will require users to fund more of their services.\n\n\n\n\n\nThe Green party's spokesperson for older people, Senator Penny Allman-Payne, says the system will benefit private providers.\n\n\n\n\n\n\"This week the [[Aged Care]] Minister was out saying how the profits of Aged Care Providers are up. The Minister is celebrating increasing profits for aged care providers, while older people are going to pay the cost.\"\n\n\n\n\n\nUnder the new system, clinical services such as nursing and physiotherapy will be covered by the government.\n\n\n\n\n\nBut recipients will need to make co-payments for non-clinical services, at a rate determined by their income and assets.\n\n\n\n\n\nFor personal care such as showering, help with medication, transport, or home modifications, a full pensioner will pay 5 per cent of the cost of the services.\n\n\n\n\n\nPart pensioners and self-funded retirees could pay up to 50 per cent.\n\n\n\n\n\nIn September, the independent Aged Care Inspector-General Natalie Siegel-Brown reported that older people could forgo having a shower or washing clothes because they couldn't afford to pay for it.\n\n\n\n\n\nMany advocates, like Older Women’s Network National President Beverly Baker, say older people should not be charged for help with showering.\n\n\n\n\n\n\"If you are an older woman, you know that showers are really vital for your personal health wellbeing and basically your capacity to look after yourself. But if you are in danger of falling over in the shower or having an accident in the shower and you need support to have a shower that's viewed as personal. That's not personal, that's medical, it should be under clinical care.\"\n\n\n\n\n\nFor what's considered everyday living services - such as cleaning, gardening and meal preparation - older people will have to pay even more - 17.5 per cent for a full pensioner and up to 80 per cent for part pensioners and self-funded retirees.\n\n\n\n\n\nThose already assessed for or receiving Home Care Packages before the 12th of September 2024, will not have to pay more - and contributions for non-clinical services will be capped at $130,000 over a lifetime for everybody.\n\n\n\n\n\nBeverly Baker says many older people cannot afford those costs.\n\n\n\n\n\n\"This will be a major impact, especially if those women are renting - how on earth? - they're already struggling to pay rent. How on earth are they going to pay extra for services? User-pay is not a good approach, and baby boomers aren't all rich.\"\n\n\n\n\n\nThere is also concern the changes will not meet growing demand by people like Lee, who want to age at home, so they can stay connected and contribute to the community.\n\n\n\n\n\nAcross Australia, there are some 200,000 people either waiting to be assessed or to receive aged care support in their homes.\n\n\n\n\n\nThe government has committed to release 83,000 new funded Support at Home places, by the middle of next year - and has already brought forward funding for 20,000 new places.\n\n\n\n\n\nIt's also promised to bring wait times for Support at Home packages down to an average of three months - by 2027.\n\n\n\n\n\nPatrick Reid is the Chief Operating Officer of Uniting NSW.ACT, which provides residential and home care aged services.\n\n\n\n\n\nHe is calling for the government to release twice as many new Support at Home places, saying long wait times for at-home care creates pressures on hospitals and residential aged care systems.\n\n\n\n\n\n\"What we're seeing is pressure on residential aged care. We know our occupancy in that sector is very high, but also to on our hospitals, we know that there are a number of hospitals around the country which are experiencing delayed discharge, where people are languishing in hospitals for long periods of time and do not have access to either residential aged care or to return home.\"\n\n\n\n\n\nAnd that leads to the issue of availability and funding for Residential Aged Care.\n\n\n\n\n\nA government review of the current pricing system for residential aged care, such as nursing homes, is underway; looking at the government subsidy for people entering care who can't afford to pay a large refundable lump sum to aged care providers for non-clinical costs.\n\n\n\n\n\nUnder the new Aged Care Act, providers will be able to charge more for the refundable accommodation deposit - to those who can afford it, putting those who can't at a potential disadvantage, in a system that's nearly at full capacity.\n\n\n\n\n\nCraig Gear - from OPAN - says people with complex needs - or lower means - can find it difficult to find residential care.\n\n\n\n\n\nAnd he says, that's not good enough.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-graeme-samuel-tells-sbs-why-he-endorses-the-governments-environmental-bill/24u0totta",
        "title": "INTERVIEW: Graeme Samuel tells SBS why he endorses the government's environmental bill",
        "publish_date": "Fri, 31 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ghb-use-overdoses-young-australian-women/xqajkwio0",
        "title": "'No idea how much they're having': The party drug on the rise among young women",
        "publish_date": "Fri, 31 Oct 2025 19:33:34 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Mel and her friends were in their 20s, they would experiment with recreational drug use , including Gamma hydroxybutyrate — or GHB.\n\n\n\n\n\nAcross long weekends of music and partying in the early to mid-2000s, the depressant became a drug of choice.\n\n\n\n\n\nWhile GHB's potential to produce strong sedative effects cemented its reputation as a 'date rape drug' in the early 2000s, Mel says she would adhere to strict rules around it to avoid these effects: she would not drink alcohol while taking GHB, she would use a precise dropper for dosages and always make a note on her phone to clock the time and the amount taken.\n\n\n\n\n\n\"I was always a trepidatious person when it came to recreational drug taking, any risk-taking behaviour — that might sound silly, given the risks — but I always dipped a toe before doing anything,\" Mel says.\n\n\n\n\n\n\"The crew I partied with, for the most part, were really responsible with it.\"\n\n\n\nREAD MORE Dead before 50: The Australians dying young at the edge of the system\n\nThe popularity of taking GHB recreationally is growing in Australia at the moment. However, the experience varies heavily depending on the dose.\n\n\n\n\n\nIn small amounts, the illicit drug can produce feelings of euphoria, disinhibition and increased libido.\n\n\n\n\n\nBut differences of as little as 0.5ml can lead to overdose, including loss of consciousness, respiratory depression (slowed or shallow breathing that can stop entirely), muscle twitching and seizures.\n\n\n\n\n\nMixing GHB with alcohol also significantly increases the likelihood of these serious side effects.\n\n\n\nLISTEN TO Victoria to open Australia's second permanent pill testing site SBS News 04:38 English\n\nAn overdose of GHB is commonly referred to as a 'blow-out', and Mel says she witnessed them frequently during her partying years from around 2011 to 2015.\n\n\n\n\n\n\"I remember partying with it in house settings and then going out and hearing about guys putting it in their beer and sharing the drink, and then people would blow out because they have no idea how much they're having,\" she says.\n\n\n\nI think people party with it really unsafely — push it, don't track how much they're taking — and it's just a mess and isn't fun and is dangerous.\n\nWhile she never had a serious overdose experience, Mel says she once had an unsettling experience with GHB at a music festival.\n\n\n\n\n\n\"I had been taking it throughout the night moderately and then we went to bed,\" she says.\n\n\n\n\n\n\"I went to sleep and woke up like 10 hours later. It was steaming hot; I'd been moved into a different tent [by friends]. The people I was sharing a tent with had napped and left, moved me around and I woke up sweating, under blankets and out cold until like midday.\"\n\n\n\nMel says the experience \"spooked\" her because she could not recall what had happened.\n\n\n\n\n\nDespite now being in her early 30s and a world away from the party scene of her 20s, Mel says she's still open to taking GHB.\n\n\n\n\n\n\"I know how to do it safely and what company you need to keep. I also didn't do it in public settings, really [bar a festival] because I didn't like the lack of comfort or safety if things tipped over a little,\" she says.\n\n\n\nGHB use on the rise\n\nWhile it is still relatively uncommon compared to cocaine and marijuana, the recreational use of GHB — sometimes known as 'G', 'juice', 'Gina' or 'fantasy' — is on an upward trend in Australia right now.\n\n\n\n\n\nData from the National Drug Strategy Household survey produced by the Australian Institute of Health and Welfare shows the number of people aged 14 and over who had used GHB in the previous 12 months doubled from 0.1 per cent in 2019 to 0.2 per cent in 2022-23.\n\n\n\nREAD MORE Australians are using 'ice', cocaine and heroin at record levels\n\nEleanor Costello, evidence manager at the Alcohol and Drug Foundation, says changing trends in illicit drug use are normal and can come down to cultural shifts.\n\n\n\n\n\n\"They may be more featured in the media and things move out of popularity ... it does go through phases,\" Costello says.\n\n\n\n\n\nThe current low price of GHB relative to other illicit drugs and its availability may also be driving interest.\n\n\n\n\n\nPolice say they have made significant border seizures of GHB and related substances in recent years.\n\n\n\n\n\nThe Australian Federal Police (AFP) announced in May it had observed a \"tidal wave\" of imports of the chemical solvent 1,4-Butanediol and seized more than 3.8 tonnes in the first four months of this year.\n\n\n\nKnown as 'bute', the solvent has industrial applications but was listed as a border-controlled drug last year as it converts to GHB in the body almost immediately once ingested.\n\n\n\n\n\nAFP acting assistant commissioner Paula Hudson said in a statement at the time that by importing the substance into Australia, \"criminal networks are creating a demand and appetite for this illicit drug\".\n\n\n\nThe bigger the appetite, the bigger the profits.\n\nYoung women and GHB\n\nThere is also evidence GHB is starting to gain popularity among groups that have not traditionally used it much before.\n\n\n\n\n\nGHB use has been relatively common among the LGBTIQ+ community for a long time — nearly 20 per cent of gay and bisexual men report having used it at least once in their lives.\n\n\n\n\n\nHowever, recent research has found that a growing number of young women are ending up in hospitals in Australia after using GHB.\n\n\n\nKrista Siefried, the clinical research lead at the National Centre for Clinical Research on Emerging Drugs, says she became interested in studying trends in the drug after seeing more young women presenting with GHB withdrawal symptoms firsthand while working at St Vincent's Hospital in Sydney.\n\n\n\n\n\nUsers can develop dependence on GHB easily and Siefried says when people try to stop, there can be severe reactions.\n\n\n\n\n\n\"What you can see is that it can be quite complicated by things like seizures or delirium. So, we really recommend that people do seek medical advice when they're trying to either cut back or stop their GHB use,\" she says.\n\n\n\n\n\nSiefried led research that looked at more than 9,600 emergency department visits due to GHB overdose across 88 hospitals from 2015 to 2024.\n\n\n\nGHB has long been associated with criminal behaviour, including drink spiking, sexual assault, rape and theft. Credit: Henglein and Steets/Getty Images The number of visits for GHB rose from 24.9 per 100,000 emergency department visits in 2015-16 to 101 per 100,000 from July 2023 to January 2024 — a threefold increase.\n\n\n\n\n\nThe research also found young women aged 16 to 24 accounted for more hospitalisations over time.\n\n\n\n\n\nIn 2015-17, women accounted for around 30 per cent of hospitalisations, and by 2023-24, that figure had increased to around 40 per cent.\n\n\n\n\n\n\"Traditionally, GHB was known to be used amongst party-going men who have sex with men, particularly, and so that was kind of the area that was most predominantly researched,\" Siefried says.\n\n\n\n\"We started to see that GHB use is sort of proliferating to other areas and so what we wanted to do was sort of explore who else is using,\" Siefried says.\n\n\n\n\n\nWhile the report was not able to infer whether those hospitalisations were due to voluntary or involuntary GHB ingestion, Siefried says other smaller studies have found young women self-reporting more GHB use in recent years.\n\n\n\nDrink spiking\n\nGHB has long been associated with criminal behaviour, including drink spiking, sexual assault, rape and theft.\n\n\n\n\n\nThe AFP has referred to it as an \"instrument of crime\", and research literature on young women and GHB has largely focused on its use as a 'date rape' drug.\n\n\n\nLISTEN TO Australians are testing illicit drugs before taking them says study SBS News 01:20 English\n\nHowever, Costello says the use of GHB in drink spiking is actually uncommon compared to spiking with alcohol.\n\n\n\n\n\n\"There is a perception that [GHB] is used, but in many cases it's actually not,\" she says.\n\n\n\nI mean, other depressant drugs may be used as well, but most often the main one that we do see presented is alcohol.\n\nSiefried says it's important to maintain \"perspective\" about GHB and spiking, given alcohol is \"far more likely to be associated with sexual violence, arguably, than any other drug\".\n\n\n\n\n\nHowever, research notes that determining whether GHB has been used in a drink spiking case can be difficult as it has a short 'half-life', which is the time it takes for the amount of a drug's active substance in the body to reduce by half.\n\n\n\n\n\nBecause of this, GHB becomes undetectable through a urine test after around 12 hours, before some victims will have made it to an emergency department or reported to police.\n\n\n\nHarm reduction\n\nFor those using GHB recreationally, Siefried stresses a need for broader education around the drug as it becomes more popular.\n\n\n\n\n\nWhile overdoses caused by opioids can be treated quickly with naloxone (opioid antagonist), there is no such drug that can reverse the effects of GHB and deaths associated with the drug have risen markedly in recent years.\n\n\n\nBetween 2000 and 2015, 51 GHB-related deaths were recorded in Australia.\n\n\n\n\n\nBetween 2016 and 2023 — a period half as long — there were 166 deaths.\n\n\n\n\n\nSiefried recommends that anybody who chooses to use the drug should \"go low and go slow\" by taking a small dose, avoiding repeating doses and ensuring use with somebody who is not taking GHB.\n\n\n\n\n\nWhen a person's breathing becomes shallow, they start to show signs of blue lips or they are vomiting and not waking up, it's necessary to call an ambulance for their safety, she says.\n\n\n\n\n\n\"What we need to take from this is that we need to make sure that people who are new to GHB and communities that are new to GHB use are aware of those harm reduction strategies to make sure they can use GHB safely.\"\n\n\n\n\n\nReaders struggling with their use of alcohol and other substances can contact the National Alcohol and Other Drug Hotline on 1800 250 015 for free and confidential support 24 hours a day, 7 days a week. More information is available via Lifeline .\n\n\n\n\n\nDisclaimer: The information in this article is for general information purposes only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/small-businesses-quietly-thrive-in-uncertain-economy/q3zcuqzk5",
        "title": "Small businesses quietly thrive in uncertain economy",
        "publish_date": "Fri, 31 Oct 2025 09:27:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Small businesses quietly thrive in uncertain economy\n\nPublished 31 October 2025, 7:45 am\n\nSmall businesses are seeing some of their strongest sales in two years as three interest rate cuts flowed through to consumers. With shoppers loosening their purse strings, some businesses have been able to pass on higher power and labour costs after holding back for some time.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/investors-consider-rate-pause-and-ai-investment-costs/p56jho150",
        "title": "Investors consider rate pause and AI investment costs",
        "publish_date": "Fri, 31 Oct 2025 06:45:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/gender-pay-gap-age-hits-hardest/4jxzii4dc",
        "title": "The Australians facing a $53k pay problem — and the age it hits hardest",
        "publish_date": "Fri, 31 Oct 2025 06:07:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "By the time a woman is in her 50s, she is more than $50,000 behind men the same age, according to the Workplace Gender Equality Agency (WGEA).\n\n\n\n\n\nThe new data, from more than 5.1 million working Australians, shows that while men and women roughly earn the same in their teens and early 20s, the gender pay gap hits its stride when a woman is in her 30s. At this age, a woman earns $15,276 less than a man the same age.\n\n\n\n\n\nThe figure peaks between ages 55-59, where the pay gap is $52,992.\n\n\n\n\n\nWGEA, which publishes annual gender pay gap reports , only started collecting age information alongside pay data last year, meaning these latest figures show for the first time the full extent to which the gender pay gap grows throughout a woman's career.\n\n\n\nSource: SBS News WGEA CEO Mary Wooldridge said the findings show that steps need to be taken early to make sure women get a fair go in the workplace.\n\n\n\n\n\n\"Interventions at critical times could reduce the gender pay gap and improve women's ability to earn and save for retirement,\" she said.\n\n\n\n\n\nIn a release accompanying the report, the WGEA said: \"To consider the cumulative financial impact, adding the earnings difference for every age from 15-67, women earn, on average, about $1.5 million less than men.\"\n\n\n\nWhy are women paid less as they age?\n\nThere are a few ways this happens.\n\n\n\n\n\nFirst, as women age, they are more likely to work part-time. The number of women in full-time employment sits at around 50 per cent.\n\n\n\n\n\nFor men, the percentage in full-time employment is anywhere from 60 to 80 per cent, depending on age.\n\n\n\n\n\nNext, a reliable way to earn a higher salary is to move into a management role. However, the data found that by age 34, managers are more likely to be men.\n\n\n\nREAD MORE The Australian employers reducing their gender pay gap — and those falling short\n\nWomen who do become managers still earn less, with women managers between 55 and 50 earning an average of $85,662 less than male managers of the same age.\n\n\n\n\n\nThe choice of profession could be another factor. The gender pay gap is smallest for workers under 20, who tend to be working in retail or food services.\n\n\n\n\n\nAfter age 20, more women are employed in lower-paid sectors such as healthcare, social services, and education, and these professions stay dominant until retirement.\n\n\n\n\n\nThese sectors have seen recent wage growth , with childcare workers now earning $2800 more on average per year, but not enough to close the gap.\n\n\n\nHow can we fix it?\n\nWooldridge called on employers to take early action.\n\n\n\n\n\n\"We're asking employers to change the story and shape the future,\" she said.\n\n\n\nWGEA CEO Mary Wooldridge says that fixing the gender pay gap benefits both men and women in the workplace. Source: AAP / Lukas Coch Actions like offering equal parental leave to women and men can help lift the burden of unpaid care work that women experience as they age.\n\n\n\n\n\nWoolridge also said employers should be open to making more manager roles part-time, or job share. This would require shifting attitudes around part-time workers being perceived as less productive or committed to their jobs.\n\n\n\n\n\nUltimately, WGEA said fixing this gap will make workplaces better for both men and women by offering more flexibility and fair access to leave for everyone.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-jill-gallagher-vaccho-on-the-new-victorian-treaty/rcrciwjve",
        "title": "INTERVIEW: Jill Gallagher, VACCHO, on the new Victorian treaty",
        "publish_date": "Fri, 31 Oct 2025 05:04:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-halloween-ghost-craze-in-englands-spookiest-city/tgvj8m7ix",
        "title": "The Halloween ghost craze in England's spookiest city",
        "publish_date": "Fri, 31 Oct 2025 03:28:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nYork in the northeast of England has long been considered one of England's most beautiful cities, with its famous cathedral and narrow medieval lanes.\n\n\n\n\n\nIt attracts tourists from all over the world who want to soak in the atmosphere of this historic place.\n\n\n\n\n\nAnd for some residents, like one Mr Kelly, that means looking at what lies beneath.\n\n\n\n\n\n\"York has an incredibly rich history, very diverse coming from Romans, Vikings, Tudors, Victorians, even right through to the modern times as well. And whenever there's work going on within the city walls, you can guarantee that they're going to unearth some things. I think ghosts kind of sprung up from that sort of idea that as soon as some work goes on, we're going to find some new Roman remains or something.\"\n\n\n\n\n\nHalloween, which means All Hallows Eve, marks All Souls Day in Christian calendars - a night when the souls of the dead return to their former homes.\n\n\n\n\n\nThe day's origins go back before the arrival of Christianity in the British Isles to the ancient Celtic festival of Samhain, marking the transition to winter.\n\n\n\n\n\nIn York, many locals claim their city is the most haunted city in Europe - but of course that's a claim that can't be measured.\n\n\n\n\n\nStill, it certainly has a strong tradition of ghostly hauntings and spooky sightings.\n\n\n\n\n\nDown the Shambles, York's famous medieval street, there are lots of shops selling wands, potions, brooms and, of course, ghosts.\n\n\n\n\n\nThe most popular shop is the York Ghost Merchants, with queues stretching down the narrow lane, run by the same Mr Kelly.\n\n\n\n\n\n\"The York Ghost Merchants was born about York having an incredible history of storytelling, hauntings, ghosts.\"\n\n\n\n\n\nInside this curious old building are handmade ghosts - the recipe is a secret but the ghosts are tough like stone and each one is handmade in the city and no two are ever exactly alike.\n\n\n\n\n\nThere's a lot of theatre in the store, with secret merchandise hidden behind spooky portraits and all of the staff wear Victorian-era outfits.\n\n\n\n\n\nBut if those cute little ghosts aren't sweet enough for you then how about a chocolate replica from Bettys Tea Rooms, an institution in York that has been serving tea and cakes in the city since 1937.\n\n\n\n\n\nBranch manager Carol Hanson says this Halloween Bettys have created their own chocolate ghosts.\n\n\n\n\n\n\"When they add the white chocolate, and spin around the moulds and then add the milk, every little ghost is different... They're all handmade, all hand decorated.\"\n\n\n\n\n\nBettys in York even has its own ghost story.\n\n\n\n\n\nThere is a legend that the ghost of Bettys' founder, Frederick Belmont, a Swiss emigrant who established the first Bettys tea room in 1919, walks the corridors of the branch.\n\n\n\n\n\nMeanwhile, hidden around town are spectral sculptures of ghostly hauntings.\n\n\n\n\n\nSome eerie wire frame installations appear around York where you least expect them, representing ghostly images from York's history with monks in the graveyard, nuns in the museum garden, even a bear.\n\n\n\n\n\nThe story goes that a bear escaped from York museum and chased the curator around the garden - though both survived the incident.\n\n\n\n\n\nCarl Alsop is the operations manager for the York BID.\n\n\n\n\n\n\"You can see behind me a Victorian penny farthing rider. He's one of our new ghosts for 2025, making it a total of 60 ghosts in total as part of the York BIDs Ghosts in the Gardens project.\"\n\n\n\n\n\nAnother way to get into the Halloween spirit is to take a ghost walk.\n\n\n\n\n\nFor 44 years, Mark Graham has been treading the streets of York telling spooky tales and scaring visitors on his ghost walk.\n\n\n\n\n\nOver the years, Mark has acquired a number of terrifying tales to chill the spines of his clients.\n\n\n\n\n\nAnd it seems there isn't a street in town without a haunting.\n\n\n\n\n\n\"It was in there in 1953 that my friend was working. He was up a ladder, working on a pipe - he was a plumber - but from out of the wall in front of him stepped a Roman soldier. He screamed, fell off his ladder, scampered into a corner and watched as at least 20 Roman soldiers walked through this wall. One of them laid on a horse, fast asleep. You could see them in fine detail: round shields, swords, spears. You can only see them though from the knees upwards. You couldn't see the lower leg, the foot.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/derby-day-live-updates-punters-descend-on-flemington-racecourse-as-melbourne-weather-finally-shines-20251031-p5n6u9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Derby Day LIVE updates: Daicos, Dalins shine on Derby Day as Waller wins first up",
        "publish_date": "Sat, 01 Nov 2025 13:03:48 +1100",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Danny Russell",
            "Andrew Wu",
            "Cara Waters",
            "Damien Woolnough",
            "Nell Geraets"
        ],
        "text": "The marquees are open in the Birdcage with a flurry of guests arriving just in time for the first race.\n\nEach year the Victoria Racing Club sponsors try to outdo themselves with Lexus, Crown and Kirin all constructing three storey marquees this year.\n\nJosh Daicos and Annalise Dalins rriving at The Birdcage on Victoria Derby Day at Flemington. Credit: Penny Stephens\n\nThe interiors are lavishly decorated with Lexus sporting three balconies with sweeping views of the track this year while Crown has deployed a 500 glass tower of champagne at its entrance.\n\nCollingwood footballer Josh Daicos and fiancee Analise Dalins were early arrivals headed for the Mumm marquee.\n\nDalins was in an all white ensemble with a strapless mini dress by Olia Couture and Embellish Atelier millinery with her outfit styled by Paul Versace.\n\nLoading\n\n“It’s the day that kicks off the Melbourne racing carnival,” she said.\n\n“I’m just excited to be here to see everyone to be a part of the atmosphere.\n\nThe couple attended the Everest races in Sydney last month but Dalins diplomatically would not be drawn into any comparison between the two events.\n\nDaicos said he was looking forward to spending the day with friends and expected to see a few footballers around the marquees.\n\n“We have friends coming here which is really nice to be able to socialise with them,” he said. “I’m looking forward to seeing a few teammates I just ran into Jack Crisp.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/this-massive-tip-stinks-and-is-home-to-a-plague-of-seagulls-owners-want-to-triple-its-size-20251029-p5n64k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This massive tip stinks and is home to a plague of seagulls. Owners want to triple its size",
        "publish_date": "Sat, 01 Nov 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "During busy times of the day, council rubbish trucks experience congestion at the Ravenhall tipping face, which jeopardises their ability to complete bin pick-up cycles across the city, Cleanaway argues. The company says the cap also gives the tip’s operators less time to compact piles of waste, which means the landfill is filling up more quickly. “The landfill cells have a shorter lifespan than planned,” the company said in its latest proposal, adding that the density of waste in each landfill cell has reduced by 12 per cent since 2019 because machine operators are getting less time to compact it. The expanded tipping face would only be used at times of high demand, when there is a logjam of council waste trucks, the company argues. It claims the expansion will bring environmental benefits because the landfill will be able to accept more rubbish and trucks will not have to idle for long periods. The EPA has twice refused to give Cleanaway’s proposed two-year pilot project a green light. An EPA assessment submitted to VCAT as part of the hearing details the environmental watchdog’s opposition to Cleanaway’s proposal, including its rejection of the company’s claim that a two-year tipping face expansion could credibly be called a trial.\n\n“The concept proposed by the applicant does not seek to engage in a genuine activity of research, demonstration or development as it is not seeking to assess a new concept,” the EPA says in its statement of claims. Instead, Cleanaway hopes to expand its tip operation “without providing any system to determine an optimum tipping face size that adequately mitigates against environmental risks”. The EPA argues that there are “four tangible risks to human health and the environment” if Cleanaway expands its operation: more litter; more vermin and disease vectors; more risk of landfill fires; and increased odour. First in the line of impact from an expanded landfill operation would be inmates of the Dame Phyllis Frost remand centre, just 200 metres away. The EPA argues inmates’ human rights could be breached due to impacts from odour, litter and vermin.\n\n“The neighbouring correctional facility may be impacted due to close proximity and the inability for inmates to be removed from the facility if impacted by odour. Vermin fouling roofs may also compromise security monitoring equipment,” it said. The EPA also argues the bigger tipping face would cause a spike in the local seagull population. The Ravenhall tip is already home to thousands of silver gulls, and the EPA says a surge in their numbers would damage nearby property and threaten the survival of other bird species. “EPA considers the trial will increase the quantity of exposed waste on site due to the larger tipping faces which will increase the availability of food for vermin, in turn attracting more vermin to the site.” Site inspections by EPA officers suggest the company already struggles to control litter escaping from the landfill or to manage the seagull population, the authority said.\n\nCleanaway breached its tipping face cap 24 times between June 2021 and April 2025, according to EPA records. The EPA’s stance drew fire from Peter Anderson, chief executive of industry group the Victorian Waste Management Alliance, who accused it of being obstructionist, instead of helping Cleanaway solve the problem. Anderson said Melbourne was running low on landfill capacity and Cleanaway was trying to find answers. “Melbourne is getting bigger, and it’s producing more waste, and we are getting less holes in the ground. Why doesn’t the EPA work with Cleanaway for a better solution, rather than just building walls?” he said.\n\n“It’s the community in the end that will suffer because they won’t be able to get rid of their rubbish, or it’s going to cost more and more to move it somewhere else.” Melton Mayor Steve Abboushi said residents in nearby Mt Atkinson had already complained to the council about landfill odour. “The community is deeply concerned about what this application means in terms of the environmental effects, especially given this tip is very close to a number of our housing estates,” Abboushi said. “We hold concerns about what this means in real terms for our residents.” Loading",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/derby-day-flemington-2025-20251101-p5n6yu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Derby Day Flemington 2025",
        "publish_date": "Sat, 01 Nov 2025 11:59:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Derby Day Flemington 2025\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/flares-thrown-at-oasis-concert-in-melbourne-20251101-p5n6yn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flares thrown at Oasis concert in Melbourne",
        "publish_date": "Sat, 01 Nov 2025 11:11:57 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Flares thrown at Oasis concert in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/you-will-get-yours-liam-gallagher-tees-off-after-flare-set-off-in-melbourne-oasis-crowd-20251101-p5n6yh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You will get yours’: Liam Gallagher hits out after flare lit in Melbourne Oasis crowd",
        "publish_date": "Sat, 01 Nov 2025 11:10:25 +1100",
        "category": "entertainment",
        "authors": [
            "Ashleigh Mcmillan"
        ],
        "text": "Oasis singer Liam Gallagher has hit out at people who threw a flare into the crowd at the band’s Friday night Melbourne show – the first concert of its Australian tour – warning them “you will get yours”.\n\nIn videos posted online, a flare can be seen being thrown high into the air from the general admission area of Marvel Stadium during the band’s final song, Champagne Supernova, before arching back into the crowd while still aflame.\n\nVision from another angle near where the flare was thrown shows a man passing the burning flare to another man, before he launches it overhead.\n\nSmoke can be seen emanating from the place where it lands in the packed crowd.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/ground-control-to-kim-kardashian-we-ve-been-to-the-moon-six-times-20251101-p5n6yi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ground control to Kim Kardashian: We’ve been to the moon six times",
        "publish_date": "Sat, 01 Nov 2025 10:58:23 +1100",
        "category": "entertainment",
        "authors": [
            "Rich Mckay"
        ],
        "text": "Atlanta: In a testament to Kim Kardashian’s power to grab the spotlight, the head of NASA felt compelled this week to set the record straight when the reality TV queen said she believed a well-worn conspiracy theory that the 1969 Apollo 11 moon landing was a fake.\n\nIn a new episode of Hulu’s long-running family saga The Kardashians, the show’s star said she thought the lunar landing by astronauts Neil Armstrong and Buzz Aldrin was fiction.\n\nKim Kardashian expressed doubt about the moon landings in a recent TV episode. Credit: Invision\n\nWhat convinced her, she said during the segment, was a video she saw online of an Aldrin interview. She said she interpreted his comments in that interview to mean the moon landing never occurred.\n\nSince the 1970s, sceptics have floated the notion that the mission – viewed live by tens of millions of people around the world – was actually staged.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/you-should-play-a-back-five-i-used-chatgpt-for-advice-on-tactics-soccer-coach-admits-20251101-p5n6yf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You should play a back five’: I used ChatGPT for advice on tactics, soccer coach admits",
        "publish_date": "Sat, 01 Nov 2025 10:01:24 +1100",
        "category": "sports",
        "authors": [
            "Kathryn Batte"
        ],
        "text": "A coach in America’s top women’s league has admitted to using ChatGPT to determine her team’s tactics.\n\nLaura Harvey, the head coach at National Women’s Soccer League club Seattle Reign, said she asked the AI chatbot questions about strategy and tactics, then implemented what it advised.\n\n“One day in the off season, I was writing things into ChatGPT like, ‘What is Seattle Reign’s identity?’ And it would spurt it out,” Harvey told the Soccerish podcast.\n\n“And I was like, ‘I don’t know if that’s true or not.’",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/the-ashes-are-here-and-australia-still-haven-t-found-an-opener-but-mess-isn-t-all-of-selectors-making-20251031-p5n6ry.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Ashes are here and Australia still haven’t found an opener. But mess isn’t all of selectors’ making",
        "publish_date": "Sat, 01 Nov 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "The evidence, unfortunately for Australia, supports both arguments. Neither one matters now. The Ashes has arrived and the top-order will consist of a 38-year-old converted first-drop and … and who?\n\nEqually, letting Warner go on and on when Australia could have been cultivating new top-order batsmen might have been the selectorial chicken that was always going to come home to roost in the 2025-26 Ashes.\n\nMaybe David Warner was right, and the Australian selectors really did have to put up with the mediocrity of his declining years because there was no-one better.\n\nIn the 15 Test matches since Warner took his chosen bow, Usman Khawaja has changed partners like a square dancer: six swapsies. He took four turns around the floor with Steve Smith (average partnership 21.75), three with Nathan McSweeney (19.8), two with Sam Konstas (39.25), two with Travis Head (54, when Head was a horse for a Sri Lankan course), one with Marnus Labuschagne (20) and finally back with Konstas for another three (18.3). During that time, Australia has lost its first wicket, on average, with 26 runs on the board.\n\nFor what it’s worth, the average opening stand in Warner’s last 15 Test matches was 34.2. There were days when Australia being none for 100 at lunch on the first day of an Ashes series felt a bit boring. This summer, only optimists are forecasting one for 34 by drinks.\n\nCredit: Simon Letch\n\nThe names of Khawaja’s dance partners, post-Warner, say as much as their figures. Smith, McSweeney, Head and Labuschagne were all playing out of position (as was Khawaja when he returned to the Test team four years ago). Only Konstas was an opener, though he did everything possible not to look like one. He was lumped with the unrealistic expectations of Australian magical thinking. If Bradman, Ponting, Walters and Steve Waugh were good enough for Test cricket when barely drinking age … yup.\n\nSince they started watching the Sheffield Shield again around 2024, the selectors must have been wondering what kind of game this was and where all the openers had gone. They awarded Marcus Harris a central contract just before his batting position, and his stats, dropped down the Victorian order. Jake Weatherald has been consistent, but his career average is, like his age, in the 30s. At his big audition this week he made a third-ball duck and 12. The urgers keep saying Konstas is one innings away when he looks more like he’s three years away. Henry Hunt, Campbell Kellaway, McSweeney – one of them is looking great one week, out cheaply to a Jackson Bird or a Matthew Kelly the next.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/why-england-have-stacked-their-bench-and-given-the-wallabies-an-opportunity-20251031-p5n6us.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why England have stacked their bench – and given the Wallabies an opportunity",
        "publish_date": "Sat, 01 Nov 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "Here is a statistic that might comfort Wallabies fans looking ahead to the Twickenham clash against England with a degree of anxiety given the amount of good players who are unavailable.\n\nEngland have not won the opening Test of their November campaign since 2021, when they beat Tonga.\n\nSince then, they have suffered opening-night losses to Argentina (2022) and New Zealand (2024), and their coach Steve Borthwick seemed painfully aware of their slow November starts as he talked up their lack of preparation time this week.\n\nBut the biggest giveaway that England are searching for an answer to that problem came from their team selection.\n\nSuperficially, it’s a strange-looking team – almost lightweight up front, with baby-faced loosehead prop Fin Baxter joining Joe Heyes of Leicester in the front row, with British and Irish Lions props Ellis Genge and Will Stuart biding their time on the bench.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/billionaire-portelli-backs-out-of-derrimut-gym-deal-20251101-p5n6xz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Billionaire Portelli backs out of Derrimut gym deal",
        "publish_date": "Sat, 01 Nov 2025 09:25:13 +1100",
        "category": "finance",
        "authors": [
            "Ashleigh Mcmillan",
            "Sophie Aubrey",
            "Sarah Danckert"
        ],
        "text": "Billionaire businessman Adrian Portelli will no longer purchase a stake in the floundering Derrimut 24:7 Gym empire, saying he could not see “eye to eye” with the owners to make the deal work.\n\nThe gym’s founder, Nick Solomos, is now fighting to save the company from liquidation by the Australian Tax Office.\n\nPortelli’s announcement came only hours after a controversial adjournment in the Federal Court as the company’s creditors chase millions in late payments.\n\nNick Solomos with Adrian Portelli during an auction on The Block. Credit: Nine\n\nAn investigation by The Age revealed in September that the rapidly expanding Melbourne gym empire had been failing to pay taxes, staff superannuation, and hundreds of businesses and landlords.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/flemington-spring-carnival-kicks-off-today-20251101-p5n6y6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flemington Spring Carnival kicks off today",
        "publish_date": "Sat, 01 Nov 2025 07:37:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "Flemington Spring Carnival kicks off today\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/ex-prince-andrew-may-not-leave-the-royal-lodge-for-months-20251101-p5n6y4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-Prince Andrew may not leave the royal lodge for months",
        "publish_date": "Sat, 01 Nov 2025 07:36:52 +1100",
        "category": "finance",
        "authors": [],
        "text": "Ex-Prince Andrew may not leave the royal lodge for months\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/reporter-slammed-after-confrontation-with-missing-four-year-old-s-grandmother-20251101-p5n6y5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Reporter slammed after confrontation with missing four-year-old’s grandmother",
        "publish_date": "Sat, 01 Nov 2025 07:36:30 +1100",
        "category": "finance",
        "authors": [],
        "text": "Reporter slammed after confrontation with missing four-year-old’s grandmother\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/tributes-pour-in-for-boy-who-died-during-cricket-training-20251101-p5n6y3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tributes pour in for boy who died during cricket training",
        "publish_date": "Sat, 01 Nov 2025 07:36:29 +1100",
        "category": "sports",
        "authors": [],
        "text": "Tributes pour in for boy who died during cricket training\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/a-little-bit-nerve-racking-how-students-think-they-fared-in-qce-s-largest-exam-20251024-p5n544.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A little bit nerve-racking’: How students think they fared in QCE’s largest exam",
        "publish_date": "Sat, 01 Nov 2025 07:00:00 +1100",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "In the week of a Caesar switch-up that devastated ancient history students and wild weather that knocked out half a dozen campuses for a day, students across Queensland also faced the state’s biggest exam.\n\nAlmost 28,000 year 12 students sat their external English exams on Tuesday, with a passing grade in the subject mandatory for their Queensland Certificate of Education.\n\nIn Brisbane’s west, students at The Gap State High School said they felt well-prepared for the test, even finding the questions “not too hard”.\n\nThe Gap State High School Students Ella Gjerek (left) and Amelia Lynch (right). Credit: Catherine Strohfeldt\n\n“We’d studied Macbeth for the past term, [and] they’ve been using Macbeth for a long time, so it’s a little bit nerve-racking to see what questions they’ve come up with, but I knew it would work out,” school captain Amelia Lynch said.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/nationals-move-scrap-net-zero-014221329.html",
        "title": "Nationals move to scrap Net Zero",
        "publish_date": "2025-11-01T01:47:59Z",
        "category": "finance",
        "authors": [],
        "text": "The Nationals have voted to scrap net zero from their policy platform, with federal MPs expected to do the same on Sunday ahead of wider Coalition talks on energy policy.\n\nThe motion to “abandon support for a net zero mandate” was passed at the party’s Federal Council meeting in Canberra on Saturday.\n\nIts passing does not bind the party’s federal MPs to do the same, however the outcome is expected to be similar when the group meets on Sunday morning.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSaturday’s motion does not vanquish all support for emissions reductions, with the party voting to support a “flexible policy framework that caters for emissions reductions, while growing and protecting key industries”.\n\nAhead of the vote, Nationals leader David Littleproud told members the resolution was “eminently sensible”.\n\n“Today you’ll debate a resolution, an eminently sensible resolution, around making sure we have a commonsense solution to our energy, to our climate. We believe in maintaining and protecting our climate and our environment. There are practical ways,” he said.\n\n“We’re not walking away from reducing emissions, but we can do it a better, fairer, cheaper way. We can align ourselves with the world as the world pivots from an arbitrary target to using common sense, making sure that they don’t destroy their economies.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We can do that, calm and considered, and we work with our coalition partners.\n\n“And I’ve made it clear with Sussan Ley that while we respect the sovereignty of their room, we’ve asked her to respect the sovereignty of our room. And we’ve come together in a considered way to work together. And that is the endeavour that we will start tomorrow morning at 9am.”\n\nNet Zero has been a growing sore point within the broader Coalition, as well as within the two parties.\n\nSince becoming opposition leader, Ms Ley has refused to take a concrete stance on whether Australia should strive to reach net zero emissions by 2050.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nInstead, she has committed to a blanket policy review, arguing it is needed after the Coalition’s decimation at the federal election in May.\n\nWhile some moderates within the Liberal Party are reportedly happy to keep a watered-down version of the policy, many high profile MPs, including now-backbencher Andrew Hastie, have taken a public stance in firm opposition.\n\nBarnaby Joyce flagged the Nationals’ support of Net Zero as a major reason behind his decision to take a break from the party room.\n\n“Our position in continuing to support net zero with the massive schism and hurt to my electorate, to small businesses, to the environment, to the poor, to the defence of Australia and creating hate between lifelong friends in my community makes continuing in the Nationals’ Party Room in Canberra under this policy untenable,” he said last month.\n\nMore to come",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/caravan-couples-grim-moment-shows-secret-truth-about-life-on-the-road-010015907.html",
        "title": "Caravan couple's grim moment shows secret truth about life on the road",
        "publish_date": "2025-11-01T01:00:15Z",
        "category": "finance",
        "authors": [],
        "text": "Caravanning is becoming increasingly popular as Aussies hit the open road and document their seemingly glamorous holidays travelling around our vast country. Images of spectacular landscapes and exciting wildlife encounters flood social media, leaving many to wonder if they should also jump on the caravanning bandwagon.\n\nBut if you needed a little shade from the light shining on caravanning holidays right now, this video might provide a reality check.\n\nA truckie from Grafton in northern NSW captured the moment his wife Korrine was dumping the family's caravan toilet, lovingly referred to as the 'devil's suitcase', into a campground dump point, and the experience was so horrendous, she was left \"dry heaving\" by the side of the road.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I was towing the caravan out and my wife said we'd better call in and empty the toilet on the way out,\" Brenton Smith told Yahoo News. \"She jumped out, and that's when I could see her heaving... The smell from the pit got her, and I think some splashed up on her hand. Me and the two kids were just in the car laughing.\n\n\"She's got a bit of a weak stomach at the best of times... It can't be that bad.\"\n\nNotably, Brenton admitted he hasn't yet done the toilet emptying task.\n\nHave you had a gross experience emptying your caravan toilet? Contact sophie.coghill@yahooinc.com\n\nTruckie claims dumping the caravan toilet is 'as bad as it gets'\n\nBrenton and his family, who travelled over 260 kilometres on their maiden journey in their new caravan, were excited about the prospect of exploring more of Australia. Despite it being his first caravan journey with his family, Brenton has been \"camping all his life\" and said the dumping of the caravan toilet is \"as bad as it gets\".\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Being able to just have a shower and everything in our own little house on wheels, it's awesome,\" he said. \"I'd say the toilet dumping is the worst of it. It's usually very comfortable.\"\n\nKorrine isn't the first to be filmed tackling the horrendous task, with Sydney woman Brooke Goosen caught on camera dumping her family's toilet into a designated dump site last year. She told Yahoo News, \"it was foul\" and found the whole system \"outdated\".\n\n\"If we're getting rockets into space, surely there's a better way,\" she said.\n\nCampers frequently say how horrendous it is to dump the waste from their caravan. Source: Instagram/goosens_are_trippin & Moysoutdoors\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAshley Moy, a dad who was staying in Alice Springs with his family in June, had to go one step further and put his hand down the dumping site after the cap of his caravan toilet fell in along with the waste. A video captured him armed with a pair of tongs standing by the dump site as he tightly wound up his sleeves and plunged his arm down to retrieve the cap.\n\nHe told Yahoo News it was too \"important\" to leave behind. He managed to grab it, but was left gagging from his efforts.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]