[
    {
        "url": "https://www.9news.com.au/world/donald-trump-trade-war-updates-threatens-50-per-cent-tariffs-on-eu-and-25-per-cent-on-apple/94245911-d677-467e-b962-550a090bca18",
        "title": "Trump's trade war intensifies with threats against EU and Apple",
        "publish_date": "Fri, 23 May 2025 17:57:09 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "US President Donald Trump on Friday threatened a 50 per cent tax on all imports from the European Union as well a 25 per cent tariff on Apple products, unless iPhones are made in America .\n\nThe threats, delivered over social media , reflect Trump's ability to disrupt the global economy with a burst of typing as well as the reality that his tariffs have yet to produce the trade deals he is seeking or the return of domestic manufacturing he has promised voters.\n\nThe Republican president said he wants to charge higher import taxes on goods from the EU, a long-standing US ally, than from China , a geopolitical rival that had its tariffs cut to 30 per cent this month so Washington and Beijing could hold negotiations.\n\nREAD MORE: Young girl hit by car as she attempts to dash across Adelaide road ﻿\n\nUS President Donald Trump on Friday threatened a 50 per cent tax on all imports from the European Union (AP Photo/Jacquelyn Martin)\n\nTrump was upset by the lack of progress in trade talks with the EU, which has proposed mutually cutting tariffs to zero even as the president has publicly insisted on preserving a baseline 10 per cent tax on most imports.\n\n\"Our discussions with them are going nowhere!\" Trump posted on Truth Social.\n\n\"Therefore, I am recommending a straight 50 per cent Tariff on the European Union, starting on June 1, 2025. There is no Tariff if the product is built or manufactured in the United States.\"\n\nThat post had been preceded by a threat of import taxes against Apple for its plans to continue making its iPhone in Asia.\n\nApple now joins Amazon, Walmart and other major US companies in the White House's crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by his tariffs.\n\nAs well a 25 per cent tariff on Apple products, unless iPhones are made in America. (Supplied)\n\n\"I have long ago informed Tim Cook of Apple that I expect their iPhone's that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,\" Trump wrote.\n\n\"If that is not the case, a Tariff of at least 25 per cent must be paid by Apple to the US.\"\n\nIn response to Trump's tariffs on China, Apple CEO Tim Cook said earlier this month that most iPhones solid in the US during the current fiscal quarter would come from India, with iPads and other devices being imported from Vietnam.\n\nAfter Trump rolled out tariffs in April, bank analysts estimated that a $US1200 ($1859) iPhone would, if made in America, jump in price anywhere from $US1500 to $US3500 ($2325 - $5425).\n\nStocks sold off after Trump's postings, with the S&P 500 index down roughly 0.5 per cent in early Friday afternoon trading.\n\nThe markets have developed a hair trigger sensitivity to the US president's statements, often slumping when he announces high tariffs and rallying when he retreats from those threats.\n\nApple now joins Amazon, Walmart and other major US companies in the White House's crosshairs as they try to respond to the uncertainty (Mark Lennihan/AP)\n\nUS Treasury Secretary Scott Bessent tried to provide some clarity on Trump's postings in a Friday interview on the Fox News show America's Newsroom .\n\nBessent said the EU has a \"collective action problem\" because its 27 member states are being represented by \"this one group in Brussels,\" such that the \"underlying countries don't even know what the EU is negotiating on their behalf.\"\n\nThe Treasury secretary said he was not in a White House meeting this week that Cook attended, but he also spoke with the Apple CEO this week. Bessent said the goal was to have Apple bring more of its computer chip supply chain into the US.\n\nThe core of Trump's argument against the EU is that America runs a \"totally unacceptable\" trade deficit with the 27 member states. Countries run trade deficits when they import more goods than they export.\n\nFrom the vantage point of the EU's executive commission, trade with the US is roughly in balance if both goods and services are included. As a global centre for finance and technology, the US runs a trade surplus in services with Europe. That offsets some of the trade gap in goods and puts the imbalance at €48 billion ($84.2 billion).\n\nGerman Foreign Minister Johann Wadephul said the EU's executive commission has his country's full support in working to \"preserve our access to the American market\".\n\n\"I think such tariffs help no one, but would just lead to economic development in both markets suffering,\" Wadephul said in Berlin.\n\n\"So we are still counting on negotiations, and support the European Commission in defending Europe and the European market while at the same time working on persuasion in America.\"\n\nTrump aides have said the goal of his tariffs was to isolate China and strike new agreements with allies, but the president's tariff threats undermine the logic of those claims.\n\nNot only could the EU face higher tariffs than China, but the bloc of member states might have been better off by establishing a broad front with China and other countries against Trump's trade policy, said German economist Marcel Fratscher.\n\n\"The strategy of the EU Commission and Germany in the trade conflict with Trump is a total failure,\" Fratscher, the head of the German Institute for Economic Research, said on X.\n\n\"This was a failure you could see coming — Trump sees Europe's wavering, hesitation and concessions as the weaknesses that they are.\"\n\nMary Lovely, a senior fellow at the Peterson Institute for International Economics, said the 50 per cent tariffs on Europe are most likely a \"negotiating ploy\" by Trump.\n\nShe said Trump seems to believe that negotiations operate by going to a \"threat point\" that could risk self-harm just to demonstrate how serious he is, in hopes that doing so would produce an agreement.\n\nBut Lovely said that in the long-run Trump's approach \"suggests that the US is an unreliable trading partner, that it operates on whim, not on rule of law.\"\n\nTrump has run hot and cold on his relationship with Apple, a sign that carrying favour with him might not necessarily shield a company from his anger.\n\nTim Cook, CEO of Apple, looks on from the field prior to Super Bowl LIX between the Kansas City Chiefs and the Philadelphia Eagles at Caesars Superdome on February 09, 2025 in New Orleans, Louisiana. (Jamie Squire/Getty )\n\nHe has essentially told companies such as Walmart to \"eat\" the costs of his tariffs instead of raising prices, even though doing so could squeeze profits and cause layoffs.\n\nHe now appears to deploying a similar degree of pressure to force Apple to accept the higher costs of relocating its supply chains.\n\nTrump had previously created an exemption on electronics imported from China to help companies such as Apple, something he could now remove. He also threatened separate 25 per cent import taxes on computer chips and could have the tariffs schedule rewritten in ways that could expose Apple products to the taxes.\n\nUntil recently, the US president repeatedly bragged about the $US500 billion ($775 billion) that Apple in February pledged to invest domestically. But he publicly turned against the company last week while speaking in Qatar.\n\n\"I had a little problem with Tim Cook yesterday,\" Trump told the audience.\n\n\"I said to him, 'My friend, I treated you very good. You're coming here with $500 billion, but now I hear you're building all over India. I don't want you building in India.'\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/a-norwegian-man-awoke-to-find-a-grounded-cargo-ship-had-narrowly-missed-his-home/794c8746-ada5-427e-9d21-de9eb92e64be",
        "title": "A Norwegian man awoke to find a grounded cargo ship had narrowly missed his home",
        "publish_date": "Fri, 23 May 2025 22:45:36 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A Norwegian man managed to sleep through an enormous container ship running aground on his front lawn.\n\nJohan Helberg, who lives in Byneset, on the Trondheim Fjord, was woken by his neighbour on Thursday morning asking if he had noticed a boat outside, TV2 Norway reported.\n\nWhen he looked out his door, he saw a 135m-long container ship parked up in his front yard.\n\nBystanders look at the grounded ship. (Jan Langhaug/AFP/Getty Images)\n\n\"If the ship had hit the rocky outcrop right next to it, it would have lifted up and hit the house hard. It only missed by a few metres,\" Helberg told TV2.\n\nHis neighbor, Jostein Jørgensen, who lives about 40m from the beach, told TV2 he was woken around 5 a.m. by the sound of a boat approaching.\n\n\"When I looked out the window, I saw a boat speeding toward the shore,\" he told the local TV network, adding that he ran outside and shouted to raise the alarm.\n\nJørgensen said the boat, the NCL Salten, got closer and closer until it ran aground about eight metres from the wall of his neighbour's house.\n\n\"He was lying asleep and surprised he had a visitor,\" Jørgensen told TV2.\n\nThe vessel was reportedly bound for Orkanger, at the southern end of the fjord, and had 16 people aboard when it ran aground.\n\nThis aerial view shows the 443-foot NCL Salten grounded in the Trondheim Fjord. (Jan Langhaug/AFP/Getty Images)\n\nBente Hetland, managing director of the shipping company NCL, called it a \"serious incident\" and said the company was \"grateful that nobody was injured in the grounding.\"\n\n\"At present time, we do not know what caused the incident and are awaiting the conclusion of the ongoing investigation by the relevant authorities,\" Hetland said in a statement. \"We are currently assessing the damage to the ship.\"\n\nA tugboat was initially sent to try to pull the vessel free, to no avail.\n\nOn Thursday evening, a salvage company tried to mount an attempt to refloat the ship at high tide, but it was later decided it was not possible, the Norwegian Coastal Administration said in a statement.\n\nIt said geotechnical investigations were now needed before another attempt could be made.\n\nWhile there have been no signs of oil leaking from the vessel, the authority said it had an oil response vessel on standby to respond, if needed.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-rental-reforms-aussie-dad-arafath-mannan-handed-no-grounds-eviction-notice-that-would-be-illegal-today/25a4db1d-8ea4-47b2-843e-62c219d3f308",
        "title": "'What have I done?': Aussie dad handed notice that would be illegal today",
        "publish_date": "Fri, 23 May 2025 21:07:11 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Arafath Mannan was blindsided to receive a notice that would be illegal in NSW today.\n\nThe now 38-year-old moved into a home in Riverwood, in south-west Sydney, in 2017.\n\nHe remained there through several full-time jobs, surgeries, the COVID-19 pandemic, being made redundant, getting married and the birth of his daughter. ﻿\n\nArafath Mannan was blindsided to receive a notice that would be illegal in NSW today. (Supplied)\n\nThe father renewed his lease in August last year and copped a rent hike, which brought the weekly total up from $650 to $720.﻿\n\nMannan struggled to keep up, but his situation deteriorated after he was hit with a no-grounds eviction notice just two months later.\n\nThe no-grounds eviction notice, seen by 9news.com.au, ﻿meant that Mannan was not given a reason why he had to leave, but had 90 days to do so.\n\nMannan said he was blindsided.\n\n\"I just didn't know what to do, literally, because I know how the market is,\" he said.\n\n\"I just was thinking that I was secure, because my rent went up two months ago... the lease period just started.\"\n\nThe surprising housing markets tipped for growth this year View Gallery\n\nMannan was told the owner planned to move in and renovate the home.\n\nBut, in the months after the eviction, he discovered the Riverwood property was back on the market at the same price.\n\n\"They kicked me out, the owner did not move in, and they tried to put the property back in the market, exactly the same price,\" he said.\n\n\"What have I done wrong?﻿ I was actually hurt. It just felt personal. They just kicked me out for no reason whatsoever.\" ﻿\n\nAfter some time on the market, the property's rent was reduced to $700 per week.\n\nMannan luckily found another rental just 150 metres down the road from his former address.\n\nIn the end, he lost about $630 of his bond to repairs and over $300 for moving fees.\n\nNew rental reforms that ended no-grounds evictions came into effect in NSW this week.\n\nNow, agents and landlords are required to ﻿provide a specific reason for eviction, including a tenant breaching their lease, damaging the property or not paying rent, the landlord wanting to sell the property or the property no longer being used as a rental.\n\nAgents and landlords who fail to comply will be dealt with under the Rental Taskforce. ﻿\n\n\"For too long, renters have lived with the fear of being kicked out for no reason. That ends today,\" Housing and Homelessness Minister Rose Jackson said earlier this week.\n\nWhile the changes were welcomed by some, Mannan ﻿said he did not believe they would have much material change because landlords could still decide to increase the rent, effectively evicting tenants who cannot afford the hike, or sell the property.\n\n\"I﻿ know, in the paper and in the books, it looks really nice... but it doesn't secure us. We need more property to be built, it's a simple solution. There's no supply,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/kermit-the-frog-commencement-speech-university-of-maryland/19e73249-8c7a-46d8-bad5-f4a482635c51",
        "title": "Kermit the Frog tells university graduates to 'leap together'",
        "publish_date": "Fri, 23 May 2025 15:35:13 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Kermit the Frog knows it's not easy being green — or graduating from college and entering the real world, especially during a time of economic uncertainty and political turmoil.\n\nMembers of the University of Maryland's class of 2025 received their diplomas on Thursday evening (Friday AEST) with sage advice from the amphibious Muppet ringing in their ears.\n\n\"As you prepare to take this big leap into real life, here's a little advice — if you're willing to listen to a frog,\" the beloved Muppet said.\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md. (Riley Sims/University of Maryland via AP)\n\n\"Rather than jumping over someone to get what you want, consider reaching out your hand and taking the leap side-by-side, because life is better when we leap together.\"\n\nThe university announced in March that Kermit, who was created in 1955 and became the centerpiece of the Muppets franchise, would be this year's commencement speaker.\n\nHe is also no stranger to the school.\n\nMuppets creator Jim Henson graduated from Maryland in 1960. A home economics major, he fashioned the original frog puppet from one of his mother's coats and a Ping-Pong ball cut in half, according to a statement from the university. Henson died in 1990.\n\nA bronze statue of Henson and Kermit sitting on a bench is a well-known feature of the College Park campus.\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md (Stephanie S. Cordle/University of Maryland via AP)\n\nKermit the Frog speaks during University of Maryland's commencement ceremony on Thursday, May 22, 2025, in College Park, Md. (John T. Consoli/University of Maryland via AP)\n\nIn a video announcing the speaker pick, Kermit is described as an environmental advocate, a bestselling author, an international superstar and a champion of creativity, kindness and believing in the impossible.\n\nHis speaker bio calls him \"a star of stage, screen and swamp\" whose simple mission is to \"sing and dance and make people happy\".\n\n\"I am thrilled that our graduates and their families will experience the optimism and insight of the world-renowned Kermit the Frog at such a meaningful time in their lives,\" university President Darryll J. Pines said in a statement.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/titan-submersible-implosion-sound-captured-on-footage/75bba8ca-ffcc-49a7-9581-da48c7f41f8d",
        "title": "'What was that bang?': Sound of Titan implosion captured in footage",
        "publish_date": "Fri, 23 May 2025 02:12:31 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "T﻿he moment disaster hit the Titan submersible has been captured in footage recorded on the sub's mother ship.\n\nDuring an expedition to the Titanic shipwreck that lies 3800 metres below the Atlantic Ocean, the OceanGate Titan imploded on June 18, 2023.\n\nThe five passengers aboard, who included OceanGate's chief executive Stockton Rush, were all confirmed dead following the discovery of the wreckage.\n\nDebris from the Titan submersible, recovered in 2023 from the ocean floor near the wreck of the Titanic. (AP)\n\nA new BBC documentary into the disaster gained access to material from the US Coast Guard's (USCG) investigation.\n\nFootage obtained by the USCG shows Wendy Rush, the wife of Rush, listening to the sound of the implosion while watching on from the sub's support vessel and asking: \"What was that bang?\"\n\nShe is shown sitting in front of a computer that was sending and receiving text messages from Titan about 90 minutes in from when it started its dive.\n\nA noise sounding like a door slamming is heard when the submersible reaches a depth of 3300 metres, prompting her to look up and ask other OceanGate crew what the noise was.\n\nMoments later, Wendy Rush receives a text message from the sub saying it had dropped two weights, which apparently caused her to mistakenly believe the dive was proceeding safely.\n\nBut the USCG says the noise was in fact the sound of Titan imploding.\n\nOfficials say the text message, which must have been sent just before the sub hit disaster, took longer to reach the ship than the sound of the implosion.\n\nThe five aboard were, from left, pilot Stockton Rush, the CEO of OceanGate; French explorer and Titanic expert Paul-Henry Nargeolet﻿; British adventurer and billionaire Hamish Harding; and Pakistani businessman Shahzada Dawood and his son Suleman. (9News)\n\nStockton Rush and the four other people aboard - businessman Shahzada Dawood and his 19-year-old son, Suleman Dawood; businessman Hamish Harding; and French diver Paul-Henri Nargeolet - died instantly.\n\nEarlier this year at the USCG hearings into the disaster, a damning portrait of the Washington-based company that developed and operated the submersible as well as its founder – who charged passengers about $US250,000 (nearly $400,000) per dive - emerged from testimonies.\n\nAfter the submersible lost contact with its mother ship and failed to resurface, a dramatic international search and rescue mission unfolded in the remote waters several hundred kilometres south-east of Newfoundland.\n\nAuthorities concluded the vessel had suffered a \"catastrophic implosion,\" a sudden inward collapse caused by immense pressure.\n\nThe USGC investigation has centred on the design of the Titan, built from carbon fibre, an unusual material for deep sea submersible crafts.\n\nRemains of the Titan submersible on the floor of the Atlantic Ocean. (US Coast Guard Video via Pelagic Research Services)\n\nA known problem is that carbon fibre layers can separate under pressure, a process called delamination.\n\nUSGC investigators believe the Titan's structure showed signs of weakening in 2022 after the craft completed its 80th expedition.\n\nPassengers reported hearing a loud bang as the sub returned to the surface.\n\nThey were told by Stockton Rush that this noise was the sub shifting in its frame.\n\nBut the USCG says the data collected from sensors fitted to Titan shows that the bang was caused by delamination.\n\nThe US Coast Guard will publish a final report bout its investigation later this year.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .\n\n﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/coles-woolworths-debate-how-many-products-should-be-included-in-fake-discount-trial/dc065e30-49e1-42f5-8a24-c8965bf97bb2",
        "title": "Coles, Woolworths debate how many products should be included in fake discount trial",
        "publish_date": "Fri, 23 May 2025 06:32:38 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The nation's supermarket giants will barter with the competition watchdog on the number of items to be interrogated in court over allegations they misled customers with fake discounts.\n\nThe Australian Competition and Consumer Commission (ACCC) has launched court actions against Coles and Woolworths, alleging they broke consumer law by bumping up prices on certain products for brief periods before lowering them again as part of Woolworths' \"Prices Dropped\" and Coles' \"Down Down\" promotions.\n\nThose promotional prices - including dairy, pet food, personal care, coffee, medicine, lollies, cereal and household cleaning products - were lower than during the price bump, but higher than or the same as the regular price, it alleges.\n\nThe nation's supermarket giants will barter with the competition watchdog on the number of items to be interrogated in court. (Getty)\n\nA Federal Court hearing in Melbourne today heard disagreements over the number of sample products from both supermarkets that would be included as evidence in the trial.\n\nColes had agreed with 12 products - six chosen by the ACCC, three class products and three of their choosing, barrister Nicholas De Young told the court.\n\n\"We submitted and believe that was a reasonable proposal, but a minute before court, we heard they want to add an additional four,\" he said.\n\nDe Young said the additional products could mean three or four more witnesses who will need to talk in detail about the price increase and promotional discussion journeys those items had.\n\nHe questioned what attributes the four items have that the existing 12 don't.\n\nWoolworths had proposed six products, but barrister Ruth Higgins told the court the ACCC had submitted 20 yesterday morning before reducing the number to 12 by that night.\n\nREAD MORE: ﻿ Woman fined for riding motorbike with dog harnessed to her chest\n\n\"What we've been doing this morning is trying to work out why those additional products are proposed and what difference those products make,\" Higgins said.\n\nBarrister Michael Hodge said the ACCC had proposed a compromised position of 12 products for both companies, which would ensure everything could be captured.\n\nJustice Michael O'Bryan urged the parties to compromise, giving them until June 13 to finalise a list of agreed items.\n\n\"If we're south of 20, or even better, south of 15, then we're in what I regard as sensible territory for conducting an efficient trial,\" he said.\n\nThe consumer watchdog is seeking a significant penalty for the alleged breaches, which they say took place over 15 months.\n\nColes and Woolworths, which control a combined two-thirds market share, deny the allegations and say the legal cases are misconceived.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/tiny-patch-of-concrete-sold-for-600000-in-sydney-cbd/469b8cda-897a-46d2-b826-f476ff9d1d36",
        "title": "Buyer coughs up $3.6 million for six car spots in Sydney CBD",
        "publish_date": "Fri, 23 May 2025 02:30:46 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "One lucky buyer has just spent a jaw-dropping amount of money on six car spaces in Sydney CBD.\n\nA group of six car spaces, combined into one lot, with unrivalled access to Circular Quay have sold for a record $3.6 million.\n\nThe 85 square metre plot works out to a total of $600,000 for each car park, or $42,857 per square metre.\n\nREAD MORE: ﻿ Disastrous launch of warship revealed from space\n\nThe 85 square metre plot works out to a total of $600,000 for each car park, or $42,857 per square metre. (Colliers)\n\nThe site is just 150 metres from the Circular Quay Ferry Terminal, and is nestled under The Quay residential tower on Phillip Street. (Colliers)\n\nThe site is just 150 metres from the Circular Quay Ferry Terminal and is nestled under The Quay residential tower on Phillip Street.\n\nLot 51, 2 Phillip Street was described as \"ideal for nearby office and residential owners, corporate institutions, or savvy investors,\" in the listing by Colliers Real Estate Agents.\n\nREAD MORE: Metal drummer dies after private jet crashes into US home ﻿\n\nA group of six car spaces, combined into one lot, with unrivalled access to Circular Quay have sold for a record $3.6 million. (Colliers)\n\nThe sale price smashed the agent's expectations and is believed to be double the previous biggest car park sale at Notts Avenue in Bondi.\n\nAgents James Cowan and Cameron Colquhoun handled the sale.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-wild-weather-heavy-rain-storms-lash-state-coast/479a95d4-8143-4e66-8faa-b85b901a578b",
        "title": "Locals help with rescue efforts as parts of NSW still underwater",
        "publish_date": "Sat, 24 May 2025 01:04:17 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "7 of 63 Attribution: Layla Philipson/Facebook\n\nIn some good news, a cow has been found alive on Old Bar beach on the Mid North Coast.\n\nThe cow was swept up in floodwaters before it was found by local Layla Philipson on the beach.\n\nTaree sits 18 kilometres inland from Old Bar, and although it's not known where the cow was washed in - it's lived through a near-miraculous tale.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/shanghai-expo-during-trump-tariffs-puts-aussie-beef-centre-stage/105326724",
        "title": "Trump's trade war puts Aussie beef centre stage in Shanghai",
        "publish_date": "Sat, 24 May 2025 01:14:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "At one of the world's largest food trade shows in Shanghai this week, Australia's beef industry was having a moment.\n\nBeef exports to China have been surging this year and, according to Meat and Livestock Australia's regional manager for greater China Murray Davis, the orders for grain-fed beef are running hot.\n\n\"Australia is absolutely centre stage [here in China] and we are dominating the premium end of the beef market,\" he said.\n\n\"Our major competitor over the last few years has been the United States, but with the trade disputes between China and the US, the US is effectively out of the market at the moment.\n\n\" So Australia is absolutely in a prime position to supply premium-grade meats to Chinese consumers. \"\n\nChina has ramped up its imports of Australian grain-fed beef. (ABC Landline)\n\nWhile the US and China have walked back from the trade war precipice in recent weeks with a 90-day pause on tariffs, Mr Davis said the friction between the two nations was on show at the SIAL food trade show in Shanghai.\n\n\"Our pavilion at SIAL, we had 300 square metres of space and we were swamped with buyers the whole time,\" he said.\n\n\"Right next to it was the United States pavilion which was very quiet, very subdued, and most of the US exhibitors didn't send people over from the United States.\n\n\" So it was a very stark difference between the Australian and Unites States' pavilions on this occasion. \"\n\nSIAL Shanghai is one of the world's biggest food and beverage trade shows. (Supplied: MLA)\n\nMr Davis, who is based in Shanghai, said the fundamentals for Australia's beef trade with China were strong.\n\n\"There are some economic headwinds here, in that consumer sentiment is a little bit subdued, the stock market is down, property prices are down, but it still remains a 200,000-tonne-a-year [beef] market for us,\" he said.\n\n\"I think no matter what, it's going to remain a very significant market for us in the future.\"\n\nAACo beef sales strong\n\nMeanwhile, Australia's largest cattle company's financial year results, released this week, included plenty of green shoots.\n\nAustralian Agricultural Company (AACo) posted an operating profit of $58.4 million, up 14 per cent year-on-year and its total revenue increased 15 per cent to $389.9 million.\n\nChief executive David Harris said it was a positive outcome during a period of global uncertainty.\n\nLoading...\n\nHe said despite Trump's 10 per cent tariff, North America remained AACo's second-biggest market for its branded beef.\n\n\"Business has been good [with the United States],\" he said.\n\n\"There is no doubting there's been lots of conversations between importers, distributors, customers and ourselves in relation to the tariff.\n\n\" But demand over there is strong, local supply in the US is very short, and I think the opportunities in the US are really good [in the] short-to-medium term. \"\n\nMr Harris said while AACo did export some beef to China, it was not a major customer for its brands.\n\n\"We're not over-leveraged into China, but because it moves volumes of beef out of other markets, that certainly helps us in other global markets.\"\n\nCattle have been pouring into southern saleyards this year because of drought. (ABC Rural: Annie Brown)\n\nAustralia is on track to produce a record amount of beef in 2025.\n\nData from the Australian Bureau of Statistics (ABS) this week showed 2.2 million head of cattle were killed in the first quarter of 2025, up an incredible 20 per cent on the same period last year.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/dave-shapiro-parkway-drive-dies-in-san-diego-plane-crash/105332184",
        "title": "US music executive Dave Shapiro killed in plane crash",
        "publish_date": "Sat, 24 May 2025 01:07:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dave Shapiro, a heavy metal music executive who was the US talent representative for a slew of Australian musicians, has died in a San Diego plane crash.\n\nThe 42-year-old was listed as the owner of the plane that crashed, according to the Federal Aviation Administration.\n\nHis agency website said he managed Australian bands including Parkway Drive, Amity Affliction and Northlane.\n\nThe music agency Sound Talent Group confirmed Shapiro, as well as two employees and the former drummer for metal band The Devil Wears Prada, died in the crash on Thursday morning, local time.\n\n\"We are devastated by the loss of our co-founder, colleagues and friends,\" the agency said in a statement.\n\nShapiro co-founded Sound Talent Group with Tim Borror and Matt Andersen in 2018.\n\nA vehicle left damaged by the San Diego plane crash. (AP: Gregory Bull)\n\nThe agency's roster focuses on alternative bands but has included pop acts such as Hanson and Vanessa Carlton.\n\nThe members of Byron Bay band Parkway Drive paid tribute to Shapiro, saying they were \"heartbroken\" over the loss of their \"good friend\" and US booking agent.\n\nLoading Instagram content\n\n\"We send all our love and support to Dave's family, friends, and the team at Sound Talent Group during this extremely difficult time,\" they wrote in an Instagram statement.\n\n\"Our thoughts and condolences are also with the live ones of Daniel Williams and the extended music community.\"\n\nFellow Australian band Yours Truly, which Shapiro also represented, reposted a triple j post, writing: \"Thank you for everything, rest in peace.\"\n\nShapiro owned flight school\n\nShapiro was included in Billboard's 2012 30 Under 30 list recognising rising stars in entertainment.\n\nIndustry veterans said Shapiro paved the way for the formation of other independent agencies and helped many alternative bands find audiences in the mainstream.\n\nHe was also a flight enthusiast, at one point opening an office of his talent agency at a hangar in San Diego.\n\nFlying \"helps me focus and helps me not be distracted by all the nonsense in the world, and whatever's going on outside the plane kind of doesn't matter in those moments,\" Shapiro said in a 2020 podcast interview.\n\nDave Shapiro was listed as the owner of the plane that crashed into a San Diego neighbourhood. (AP: Gregory Bull)\n\nShapiro owned a flight school called Velocity Aviation and a record label named Velocity Records.\n\nSum 41 singer Deryck Whibley credited Shapiro with helping build the rock band back up during a \"low point\" in its career.\n\nAhead of their last conversation, Shapiro flew in his new plane to see Sum 41's induction into the Canadian Music Hall of Fame in March.\n\nLoading Instagram content\n\nHe promised Whibley he would come back.\n\n\"Me and my wife, we're going to fly to you,\" Whibley recalled Shapiro saying to him.\n\n\"We're going to pick you up and we're going to go somewhere crazy for lunch.\"\n\nFog a factor in crash\n\nNational Transportation Safety Board investigator Dan Baker said officials would work over the next year to determine what caused Shapiro's Cessna 550 Citation to crash.\n\nEarly investigations show that the runway lights had been out at the airport where the aircraft planned to land.\n\nA weather alert system that should have warned of heavy fog was also not working.\n\nThe pilot reportedly acknowledged the weather conditions for landing at the small airport were not ideal and debated diverting to a different airport while discussing the visibility with an air traffic controller, according to audio of the conversation posted by LiveATC.net.\n\nEarly investigations show the runway lights at the San Diego airport were out. (AP: Gregory Bull)\n\nUltimately, the pilot is heard saying that he will stick with the plan to land at Montgomery-Gibbs Executive Airport.\n\n\"Doesn't sound great but we'll give it a go,\" he tells the air traffic controller.\n\nThe plane crashed into a US Navy housing neighbourhood about 3.22 kilometres from the airport.\n\nNo-one in the neighbourhood was killed but eight people were treated for smoke inhalation and non-life-threatening injuries.\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/grain-growers-face-costly-nightmare-of-clumped-fertiliser-/105313964",
        "title": "Silos smashed as grain growers face costly nightmare of 'clumped' fertiliser",
        "publish_date": "Sat, 24 May 2025 00:44:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "A farmer in Victoria's north-west has taken extreme measures to salvage his stored fertiliser by smashing six silos worth $150,000 to the ground so that he can use it.\n\nTerry Kiley had hundreds of tonnes of fertiliser stored in silos on his farm in the Mallee ready to go for this year's winter crops.\n\nBut when he went to use it, it was stuck together.\n\n\"We just couldn't shift it,\" he said.\n\n\"We tried vibrating (the silo) and drilling holes in the cones of the silos but it wouldn't run out, so we've pushed three [silos] over to get it out, and we've got another three we're deciding what to do with.\n\n\" It is desperate, but what do you do? \"\n\nFertiliser has set solid in some silos this season, forcing farmers to take extreme measures to extricate it. (Supplied: Terry Kiley)\n\nPeak grower organisation Grain Producers Australia (GPA) said it had received numerous reports of fertiliser quality problems this season.\n\n\"Our members have certainly raised concerns about the quality of product,\" said GPA chief executive Colin Bettles.\n\n\"We're looking at what options we have to take action on it and we're engaging with [industry group] Fertilizer Australia.\"\n\nMr Bettles urged affected farmers to document the problems and speak to their suppliers.\n\n\"The main thing is to record, take pictures, and go back to your supplier and raise the issue with them,\" he said.\n\nMr Bettles said farmers have reported problems with fertiliser this season. (Supplied: Colin Bettles)\n\nSuppliers warn farmers against storing fertiliser in silos, given the risk it can set hard, instead advising them to store it in sheds.\n\nBut manufacturers still market fertiliser-specific silos, and many farmers buy them because they are cheaper and more practical.\n\nMr Kiley's fertiliser was imported by Koch Fertiliser Australia.\n\nHe contacted the company to report the problems but said he was frustrated by their response.\n\n\"The blend we ran into issues with we've been using [without problems] for probably 25 years,\" Mr Kiley said.\n\n\"It's got to be a quality issue, but they just cover their arse by telling you not to store it in silos.\"\n\n'A one-off case'\n\nIn the NSW central west at Forbes, grain grower Jarrod Amery has had endless headaches handling fertiliser this sowing season.\n\n\"We had one particular load that was a shocker,\" he said.\n\n\"We had to get professionals in from 500 kilometres away with pneumatic vibrators to vibrate the base of the silo and try and get the fertiliser out,\" he said.\n\nHe said he believed the underlying issues were twofold — high moisture and a lot of fine particles.\n\nNot only has the fertiliser destroyed his silo it's also blocking up his air seeder.\n\n\"We're only getting three or four hectares of sowing done and the rollers are starting to block up, so it's been a challenge,\" he said.\n\nJarrod Amery's silo has buckled under the weight of fertiliser that clumped together and would not run out. (Supplied: Jarrod Amery)\n\nMr Amery's fertiliser was also imported by Koch Fertiliser Australia.\n\nWhen he first went to the company about the problems, he said he was told his issues were isolated.\n\n\"Well I pushed pretty hard on that,\" he said.\n\nKoch Fertiliser Australia declined ABC Rural's request for an interview to discuss the concerns.\n\nIn a statement, managing director Ross York confirmed it had received reports about issues with its products.\n\nBut he reiterated that farmers were advised not to use silos for fertiliser.\n\n\"As stated on our label and our website we encourage farmers not to store bulk fertilisers in field bins or silos,\" he said.\n\n\"The hygroscopic nature of these products can prevent their free-flowing and may lead to the collapse of the field bin or silo.\"\n\nFertiliser has formed a cliff face inside Jarrod Amery's silo. (Supplied: Jarrod Amery)\n\nSilos used at farmers 'own risk'\n\nAccording to Fertilizer Australia about 5.4 million tonnes of fertiliser is used in Australia each year.\n\nSome is manufactured in Australia and the rest is imported from overseas including China, the Middle East, Morocco and South America.\n\nFertilizer Australia's executive manager Stephen Annells backed Koch's position about on-farm storage for fertiliser.\n\n\"We've always held a very strong position that we recommend fertiliser shouldn't be placed in silos and really that growers do that at their own risk,\" he said.\n\n\" Fertiliser is very different to grain, it risks compacting. So we say it is just safer to not store it in a silo. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/koorooinya-races-not-renewing-racing-queensland-licence/105299414",
        "title": "Outback club ditches Racing Qld over $100k horse shelter demand",
        "publish_date": "Sat, 24 May 2025 00:20:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "An outback horse racing meet is running as an independent event after Racing Queensland demanded it build a $100,000 horse shelter to qualify for a licence renewal.\n\nEach May, people from all over north-west Queensland make the trek to Koorooinya Reserve, 400km south-west of Townsville, for the annual event.\n\nBut this year, Oakley Amateur Picnic Race Club vice president Steven Larkin said licence conditions from the governing body put the 108-year-old tradition at risk.\n\n\"Our club has decided to step away from Racing Queensland because it's just getting a little bit too hard to race the way we have been racing for 100-plus years,\" he said.\n\nThe annual Oakley Amateur Picnic Races attract crowds from all over rural Queensland. (ABC News: Brooke Tindall)\n\nIn a statement, Racing Queensland said Oakley and the Tower Hill Amateur Race Club, which hosts a sister-event in April, had opted not to renew their licences due to Licensed Venue Standards that came into effect in May last year.\n\nThe standards dictate what facilities are required for race meetings to be conducted under a Racing Queensland licence.\n\nThey include the condition of the track, car parks, horse stalls, mounting yards, veterinary facilities, steward and jockey rooms, and race calling towers.\n\n\"Following the expiration of their licences … RQ met with representatives of both clubs to discuss their future direction,\" the Racing Queensland spokesperson said.\n\n\"Both clubs subsequently advised RQ that in order to preserve the nature of their grassroots racing, rather than change their operations and upgrade facilities to comply with the Licensed Venue Standards, they would not elect to be re-licensed.\"\n\nTower Hill Amateur Race Club, which hosts the other grass-fed horseracing meet in Queensland, has also given up its licence. (Supplied)\n\nAnnouncing their decision on social media, the Tower Hill Amateur Race Club said it was not made lightly.\n\n\"We are so incredibly passionate about our bush racing, it's a love many of us have been born into,\" the club said in a statement.\n\n\"Others have come to a race meeting and have never left because they love what we represent.\"\n\nWithout a licence, the clubs can no longer access funding and public liability insurance provided by Racing Queensland.\n\nThe Tower Hill Picnic Amateur Races have been held in western Queensland since 1909. (Supplied: Ruth Bode)\n\nFor the Oakley club, the decision not to renew means they had to pay a $30,000 insurance bill themselves, but Mr Larkin said keeping the tradition alive outweighed the cost.\n\n\"We're grass fed, these horses live out in the paddock, we're not like other clubs on the coast,\" he said.\n\n\"It's why we are different, and we want to keep it that way.\"\n\nFeeding tradition\n\nGrass-fed racing horses are often older rejects from the main racing competitions, that graze in paddocks on nearby farms.\n\n\"These horses are getting rehomed to us, where we can give them another four or five years of just good living and good racing,\" Mr Larkin said.\n\nThey also don't use barriers to start the race — instead, they use a flag start, where the horses trot up to the line together, a flag is lowered, and the race begins.\n\nThe day is filled with a lot of excitement for children. (ABC News: Brooke Tindall)\n\nAlong with the horse shelters, Mr Larkin said the conditions to renew their licence with Racing Queensland included removing the flag start, which he said would completely change the competition.\n\nRacing Queensland said it provided $3 million a year through its Country Club Asset Funding program to assist country racing clubs to repair, maintain and replace facilities.\n\nDespite severing ties with the governing body, the club said it would maintain the racing standards set when it held a licence.\n\nAmong those determined to keep the tradition alive is jockey Cameron Creevey.\n\nJockey Cameron Creevey is cheered on by his Mum. (ABC News: Brooke Tindall)\n\nHe said small country race meets gave him the chance to fulfil his passion for horse racing.\n\n\"It's the going fast bit for me, it's a good adrenaline rush and I just love it,\" Mr Creevey said.\n\nA much-loved social event, he said the country race meet was about much more than just horses.\n\n\"It's great just to meet people and have a few beers together,\" he said.\n\nCam Tindall's parents became involved with the club in the 1950s, and he's continuing the family legacy. (ABC News: Brooke Tindall)\n\nMore than just horses\n\nMr Larkin said the Koorooinya races provided a wonderful opportunity for remote farming communities to get together.\n\n\"It's all about having three days off in a bush area,\" Mr Larkin said.\n\n\"It's just something we look forward to year in, year out.\n\n\"Our kids love it, and if we were going to miss one, I tell you what, we wouldn't have a very happy family in our household.\"\n\nMinister for Racing Tim Mander says it's important to maintain the viability of country race meets. (ABC Western Qld: Grace Nakamura )\n\nIn March, the Queensland Government announced a \"landmark review\" of the state's racing industry, covering thoroughbred, harness and greyhound racing.\n\nIt appointed former chair of the Australian Turf Club Matthew McGrath as the chair.\n\n“From our biggest cities to our smallest and most remote towns, racing brings our communities together,\" Minister for Sport and Racing Tim Mander said at the time.\n\n\"We want to ensure the long-term financial stability, viability, and integrity of racing in the state.\"\n\nMore than 1,200 submissions were made on the discussion paper, which included looking at the need for \"fit-for-purpose infrastructure\" statewide and safeguarding country racing.\n\n\"It's important that we get this right, so racing will continue to flourish and grow for decades to come,\" Mr Mander said.\n\nThe final review is expected to be delivered in late 2025.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/ange-postecoglou-tottenham-spurs-europa-league-win/105332202",
        "title": "'Season three is better than season two': Ange makes bold Spurs prediction",
        "publish_date": "Sat, 24 May 2025 00:12:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou has predicted Tottenham Hotspur can build on their stunning Europa League victory despite a disappointing domestic season.\n\nAnge's rise from the failed dream of the NSL to European glory Photo shows Ange Postecoglou holds a trophy In 2008, Ange Postecoglou was a Fox Sports pundit who felt unemployable. Now he's the first Australian football manager to win a major European club trophy.\n\nPostecoglou and his Spurs players were welcomed home in style as they travelled in an open-air bus during a street parade in North London.\n\nThe celebrations followed their 1-0 triumph over Manchester United in the Europa League final in Bilbao on Thursday AEST.\n\nThe result means Spurs have qualified for next season's Champions League.\n\nSpurs' victory, their first trophy in almost 20 years, comes as they limp to the end of the Premier League season in 17th place with one match remaining.\n\nAs thousands of Spurs fans greeted Postecoglou and his players with chants and cheers, the Australian suggested the club would perform better in the 2025/26 season.\n\n\"I'll tell you something, I'll leave you with this. [In] All the best television series, season three is better than season two,\" Postecoglou told the excited crowd.\n\nPostecoglou expressed pride in what his players had achieved.\n\n\"I'm super pleased our boys could deliver and this is why we delivered for the supporters,\" he said.\n\nAnge Postecoglou says he is proud of what the Spurs achieved in Europe this season. (Reuters: Matthew Childs)\n\nPostecoglou has been under immense pressure to keep his job throughout the season.\n\nLast September, he predicted Spurs would claim silverware under his watch.\n\n\"I always win things in my second year. Nothing has changed. I don't say things unless I believe them,\" Postecoglou said.\n\nSpurs will finish their Premier League campaign at home against Brighton and Hove Albion on Monday morning AEST.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/lilo-and-stitch-2025-live-action-review/105320016",
        "title": "Disney once again serves up a sanitised and unnecessary live-action remake",
        "publish_date": "Sat, 24 May 2025 00:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Disney's 2002 animation Lilo & Stitch became an instant classic for one reason: its originality.\n\nFast Facts about Lilo & Stitch What: A live-action remake of Disney's 2002 animation about a cheeky blue alien who befriends a lonely Hawaiian girl. Directed by: Chris Sanders Starring: Sydney Agudong, Maia Kealoha, Zach Galifianakis, Billy Magnussen, Tia Carrere, Hannah Waddingham Released: In cinemas now Likely to make you feel: Like watching the original — or hugging your sister\n\nFor Disney, it was a step away from its usual style. It took a sci-fi alien story and transported it to modern Hawai'i, where it explored the everyday struggles of the people who lived there.\n\nWith hand-drawn 2D animation in the distinctive style of Chris Sanders (who last year directed the Oscar-nominated film The Wild Robot), it had a fresh look that was new for the studio, including round faces and larger bodies.\n\nIt was also one of the first mainstream films to platform and celebrate Hawaiian culture, putting locals at the forefront rather than using the archipelago as a cheap backdrop.\n\nAnd, critically, it subtly criticised the ways in which mass over-tourism has affected native Hawaiians.\n\nA live-action remake, set in our time, was a chance to take the elements that made the original so groundbreaking, and add layers of modernity to them.\n\nMaybe Lilo and Nani are surrounded by Airbnbs now? Or perhaps Stitch can attempt his dream of destroying a large city, given how built-up modern Honolulu is? Could Pleakley do a drag rendition of a Chappell Roan song?\n\nBut instead of adding to the original's cultural commentary, the new film completely cuts this element out.\n\nIt's the latest release to follow the apparent new recipe for a modern kids' movie: sanitise everything that could possibly offend anyone, replace the personalised hand-drawn animation with expensive, photo-realistic CGI, add in a little slapstick and a Bruno Mars song, and you've got yourself a hit.\n\nWhat is Lilo & Stitch about?\n\nBoth films follow the same initial plot: Nani has been her sister Lilo's guardian since their parents died, but is struggling with the responsibility. Repeated visits from a social worker are not going well, and separation seems imminent.\n\nMeanwhile, far from earth, experiment 626 — who was made in a lab by Jumba the mad scientist/evil genius — has escaped.\n\nExperiment 626 — dangerous escapee or cuddly pet? (Supplied: Disney)\n\nHe soon lands on the sisters' Hawaiian island, and Jumba is tasked with re-capturing his monster, aided by Pleakley, a self-proclaimed \"Earth expert\".\n\nWhen Lilo adopts experiment 626 — and names him Stitch — the real mayhem begins.\n\nWhat made Lilo & Stitch so significant?\n\nWe first met Nani and Lilo in 2002, trying their best on their island home overrun by an invasive species: tourists — and then, also, aliens.\n\nIn the original's opening scene, Lilo snaps a photo of a sunburnt tourist, and we later discover she keeps an extensive series of these on her bedroom wall.\n\nThis was well ahead of the public discourse condemning western holiday-makers who make a habit of photographing foreign children.\n\nTourists are poked fun at throughout the 2002 film. (Disney)\n\nWe also see Nani and Lilo's rundown house, and how Nani's only employment options are in the service and tourism industry; \"I just love to answer phones!\" she enthusiastically tells a hotel manager.\n\nBut where the original criticised, the remake glorifies.\n\nPleakley soaks in a lavish hotel bubble bath overlooking the ocean, while Lilo frequently enjoys the beachside hot tub, with the resort's portrayal closer to advertisement than critique.\n\nThe new Lilo & Stitch doesn't seem to have an issue with the impact of tourism on Hawai'i. (Disney)\n\nWhile Hawaiian culture is still respected — with a local behind the script — none of that cultural commentary remains, and the movie has less impact without it.\n\nAre there songs in the live-action Lilo & Stitch?\n\nThe music of the original film has become iconic, with clips of Mark Kealiʻi Hoʻomalu and the Kamehameha Schools Children's Chorus in the recording studio regularly going viral online.\n\nLoading TikTok content\n\nAnd rather than reducing the hula to women in coconut bikinis swaying their hips, the production team took care to reflect the cultural and spiritual significance of the traditional dance, with animators recreating it frame by frame.\n\nThe new film brings these elements back, with audiences treated to a real on-screen hula, as well as the bright young voices of today's Kamehameha Schools Children's Chorus choir.\n\nThe youth chorus's conductor, Lynell Bright, returned 25 years later too, and in a full-circle moment, her son Chris Kekaniokalani Bright is one of the screenwriters behind the adaptation.\n\nActress and musician Sydney Agudong gives a beautiful rendition of Aloha 'Oe. (Disney)\n\nThankfully, they kept in a rendition of 'Aloha 'Oe', which Nani sings to Lilo when they think they might be separated.\n\nThis legendary folk song was written in 1878 by Queen Liliʻuokalani, the last sovereign monarch of Hawaii, who dedicated her life to the restoration of rights for Hawaiian people after the illegal US takeover of the territory.\n\nA positive addition to the live-action is the expansion of Ohana, a memorable theme of the original: \"Ohana means family. Family means nobody gets left behind or forgotten.\"\n\nWith added characters in the new film, Ohana is expanded to not just include direct blood relatives, but also a community, which does serve the film's focus on non-traditional families.\n\nWhat does the live-action Lilo & Stitch change?\n\nThe film's key change is, of course, its lack of animation. The CGI version of Stitch looks perfect, while Jumba and Pleakley disguise themselves as humans for the majority of the piece. Jumba is portrayed as a generic evil villain, rather than a screwball scientist, which doesn't quite work.\n\nJumba (right) and Pleakley (left) wear slightly more convincing human disguises in the live-action version. (Disney)\n\nThe setting has been shifted from the original's natural oasis of Kauai, and now takes place on the more built-up Oahu, focusing on locations like Waikiki Beach and Honolulu. The fact that this seemingly contradicts Stitch's struggle to find a big city to destroy on a remote island is glossed over.\n\nNani's experience as Lilo's carer is explored in greater detail, with dreams of going to study marine biology quashed by her new-found responsibility.\n\nWhile there's a lot added in detail, there's not a great deal more depth or humour. The softened language of the script means much of the raw emotion of the original is lost, too.\n\nThe best new addition to the film is probably Jumba and Pleakley's portal gun, which creates gateways anywhere you shoot it, and soon becomes a fun, non-violent plot device.\n\nLoading TikTok content\n\nBut sorely missed by audiences is Pleakley's obsession with wigs, women's clothes and make-up.\n\nThis infatuation — which continued throughout the animated franchise's sequels and TV spin-offs — made him a favourite among audiences, with some fans calling the character \"a gender-fluid icon\".\n\nThe closest director Dean Fleischer Camp got to Pleakley in drag was Pleakley in a flowered shirt. (TikTok: @marceltheshellwshoeson)\n\nQueer-coded or otherwise, Pleakley's love for cross-dressing was a key element of the character, and the film's director has hinted at pushback from Disney against its inclusion, responding to criticism with: \"I tried.\"\n\nHow long is the Lilo & Stitch movie, and is it worth watching?\n\nWhile the original's run time was just under 90 minutes, the additional characters and plot in the live-action remake put it closer to two hours.\n\nDespite being made for a generation with the attention span of a YouTube video, the film does feel slow in parts, and younger or more energetic children may find it difficult to sit through.\n\nLike many recent live-action remakes of a beloved classic, the new Lilo & Stitch is wholly OK — if a little uninspired — and isn't a difficult watch for parents. It's devoid of annoying characters with high-pitched voices, and would make for a decent outing on a rainy weekend.\n\nPerhaps unavoidably, devout fans are furious at the changes. But, overall, it's an inoffensive film, in every sense of the word.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/nannup-rallies-to-help-stranded-french-backpackers/105320052",
        "title": "Country hospitality helps stranded French travellers get back on the road",
        "publish_date": "Fri, 23 May 2025 23:39:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Just hours after starting their West Australian road trip, Melina Gitton and Florian Crepinior's journey came to a halt when they hit a kangaroo and found themselves stranded on the side of a dark road.\n\nThe French backpackers did not know then that Nannup, 270 kilometres south of Perth, would become their home for the next 23 days.\n\nOr that locals would rally behind them by offering support, shelter, and even fixing their damaged car.\n\n\"It was four hours [into our trip] and it was dark already and we hit a roo,\" Ms Gitton said.\n\n\"The kangaroo crossed the road and that was it. It was really scary.\"\n\nTheir newly-purchased car was wrecked, underinsured, and the couple had nowhere to go.\n\nThe car was badly damaged and underinsured. (Supplied: Melina Gitton )\n\nFortunately, help was not too far away.\n\nThe pair were taken to the home of Kate and Craig Jenkins who lived a couple of kilometres away.\n\n\"We were thinking we were spending one night, just to sleep a bit. But we stayed, as you know, 23 days,\" Ms Gitton said.\n\nLoading...\n\nThe couple spent Easter with the Jenkins family, attended local sport and became fast friends with their Australian host family.\n\nIn a town of about 1,500 people it did not take long for word to spread about the stranded \"Frenchies\".\n\nThe community spirit from Nannup locals was not something the Parisian couple had ever experienced before.\n\n\"It was crazy to see how many people wanted to help us with donations,\" Ms Gitton said.\n\n\"When we went to the town and the church a lot of people were just like 'oh, you're the French people'. It was really nice to see. We got a lot of love messages and a lot of help.\"\n\n'I will never forget'\n\nMr Crepinior said he was blown away by the kindness of strangers.\n\n\"We have never met those people and they're just helping us,\" he said.\n\n\"I think without this kangaroo we would never know about Nannup. We were unlucky, but in this unlucky we were lucky.\n\n\"Until the end of my life, for sure, I will never forget that.\"\n\nThe French backpackers became good friends with the Jenkins family after staying with them for three weeks. (Supplied: Kate Jenkins)\n\nWhile a three-week homestay was not what Kate and Craig Jenkins had expected, they were more than happy to help.\n\n\"The car was not drivable, the whole front was smashed in,\" Ms Jenkins said.\n\n\"They were in a bit of a pickle really and they were stranded at our place. They had used most of their money buying this car.\n\n\" They were literally driving to pick up a roo bar. \"\n\nThe town of Nannup, where kangaroos and emus are a common site, became the travellers' second home. (ABC South West WA: Anthony Pancia)\n\nShe said her husband, despite not being a mechanic or a panelbeater, helped Mr Crepinior fix the car.\n\n\"Neither of them had done it before but they worked it out together. Then what they couldn't figure out our local mechanic in Nannup fixed up the last few bits,\" Ms Jenkins said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/billy-joel-annouces-brain-diagnosis-disorder-cancels-tour/105332092",
        "title": "Billy Joel reveals brain disorder and cancels tour",
        "publish_date": "Fri, 23 May 2025 23:29:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Muscian Billy Joel has cancelled his upcoming concerts across North America and England after being diagnosed with fluid build-up in his brain that has affected his hearing, vision and balance.\n\nJoel revealed on Instagram he had normal pressure hydrocephalus.\n\nNormal pressure hydrocephalus is a a \"brain disorder that can affect brain-related abilities, including thinking and concentrating, memory, movement and more\", the Cleveland Clinic says.\n\nA statement from Joel's team said the musician's condition had been \"exacerbated by recent concert performances, leading to problems with hearing, vision and balance\".\n\n\"Under his doctor's instructions, Billy is undergoing specific physical therapy and has been advised to refrain from performing during this recovery period,\" it said.\n\nLoading Instagram content\n\nIn an accompanying statement, Joel said: \"I'm sincerely sorry to disappoint our audience, and thank you for understanding.\"\n\nIn March, The Piano Man and Uptown Girl singer announced that he underwent surgery and had to undergo physical therapy.\n\nA statement at the time said doctors expected him to make a full recovery.\n\nIt is unclear if his medical issues at the time were related to normal pressure hydrocephalus.\n\nThe condition can cause problems with walking, bladder control and thinking, and the symptoms can worsen if the illness is left untreated.\n\nIt is relatively rare and can be hard to diagnose.\n\nBilly Joel recently revealed he had undergone surgery. (Supplied: Facebook)\n\nIt can be treated successfully with surgery to install a tube to drain excess fluid. Patients may need physical therapy in addition to surgery.\n\nJoel, 76, wrapped up his decade-long residency at Madison Square Garden in July 2024. However he had continued to tour.\n\nTickets for his scheduled shows will be refunded.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/illawarra-named-urban-rez-renewable-energy-shift/105330122",
        "title": "NSW has its first 'urban renewable energy zone'. So, how does it work?",
        "publish_date": "Fri, 23 May 2025 23:17:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The NSW government has launched a new approach to renewable energy in the Illawarra, pitching the region as the state's first \"urban renewable energy zone\".\n\nThe model leans heavily on local solar, community batteries, and existing infrastructure rather than large-scale projects.\n\nEnergy Minister Penny Sharpe said the plan marked a shift from traditional renewable energy zones (REZs) in places like the Orana and South West.\n\n\"It's not about big generation and transmission,\" she said.\n\n\"It's about how we support the infrastructure that's already here, how we prepare for green manufacturing, and how we make the most of the solar and storage potential across homes, businesses and communities.\"\n\nThe announcement in Port Kembla at the BlueScope steel terminal — where renewable energy research is underway — included a memorandum of understanding with Endeavour Energy.\n\nIt set the groundwork for trials of new grid technologies and incentives for solar uptake.\n\nEndeavour's Colin Crisafulli said the goal was to make the most of the infrastructure already in place.\n\n\"We're looking at how we can store more energy, share it locally, and avoid rebuilding the grid where we don't need to,\" he said.\n\n'Bigger mix' of renewables needed\n\nAt the University of Wollongong, energy researcher Ty Christopher said the consumer focus in the REZ could deliver 300 megawatts of local energy.\n\nThe Illawarra REZ Roundtable met at the University of Wollongong with energy experts, business leaders and community representatives to map out the next steps. (ABC Illawarra: Kelly Fuller)\n\n\"An urban REZ could certainly get it into the hundreds of megawatts of capacity,\" he said.\n\n\"With more generation on homes and businesses, and in particular with the ability to store and time shift all of that clean energy so that it's available in the evening .\"\n\nHe said leaning into the local support for renewables with an urban REZ would \"really play to the strengths of the region\".\n\nEven with the local consumer energy contributions, the government is still a way off its commitment of 1 gigawatt of energy creation for the Illawarra zone.\n\nProfessor Christopher said the local REZ would still require bigger solutions like offshore wind to power heavy industry like BlueScope.\n\n\"You can't run a steelworks on rooftop solar,\" he said.\n\n\"This needs to be part of a bigger mix, but this is something we can start now.\n\n\"One of the big challenges from a political perspective with the Urban REZ concept is it's not going to create one big thing that you can string a ribbon in front of and just cut.\n\n\" It's lots of small initiatives happening in our daily lives. \"\n\nThe announcement came just days after the federal government lifted a pause on consultation for offshore wind off the Illawarra coast.\n\nThe applicant, BlueFloat, told the ABC it was not discussing the Illawarra project but focused on its plans for the Gippsland offshore wind zone.\n\n'Thrilled' with announcement\n\nHi Neighbour founder Yael Stone, who earlier this year criticised the lack of visible progress since the Illawarra REZ was first announced, welcomed the urban REZ approach as a smart and community-led next step.\n\nPush for better renewable engagement Photo shows A row of solar panels are stood in the ground above red dirt Locals in renewable energy hotspots say they have been forced to create their own information groups to address concerns about the rapid energy transition and want the government to pitch in.\n\n\"I'm thrilled at the announcement,\" she said.\n\n\"It reflects what groups like Electrify 2515 and Hi Neighbour have been working toward — small-scale, local energy projects that create jobs and cut bills.\"\n\nShe said Illawarra residents were already tuned in to the benefits of household solar, batteries and smarter grid interaction.\n\n\"People understand their bills, they understand how a battery helps them save, and they're ready to be part of this,\" she said.\n\nStone saw the urban REZ concept as a \"companion piece\" to the federal move to resume offshore wind planning and said her group had already helped install solar on local manufacturing rooftops, using the returns to fund training scholarships.\n\n\"There's a kind of circularity that feeds itself — these projects create economic benefit and they enrich communities,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/reserve-bank-alert-economic-event-us-bond/105330200",
        "title": "Trump's 'Big Beautiful Bill' has investors worried",
        "publish_date": "Fri, 23 May 2025 23:13:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "US 10-year Treasury bonds have long been considered \"risk-free\" — until now.\n\nThat's put the usually circumspect Reserve Bank of Australia \"on alert\" for a potentially \"cataclysmic\" economic event.\n\nUp until now, if you gave the US government money over a 10-year period, you were, essentially, certain to get your money back with interest, on average, 4.25 per cent.\n\nThat's known as the yield or interest rate.\n\nThe return on this debt security is so stable and secure, many other securities are priced off it, including US mortgage securities.\n\nSo, what happens if US bonds, or debt, become riskier, and investors demand a higher return?\n\nThe answer is that the global financial system fundamentally changes, and that affects every Australian.\n\nTrump's 'Big Beautiful Bill' has investors worried about the US\n\nThe bond market is now regularly questioning the value and stability of US government debt.\n\nThat has not happened in the post-World War II era.\n\nThis week's Donald Trump's so-called Big Beautiful Bill is the latest catalyst to rile bond markets.\n\nIn the lead-up to the passage of the bill through the US House of Representatives, the US Treasury Department tried to secure $16 billion of funding through the sale of 20-year bonds.\n\nIt found the auction harder than usual to execute due to a lack of demand from investors.\n\nInvestors are wary because President Donald Trump's tax bill is projected to add $3 trillion to $5 trillion to the US debt over the next 10 years.\n\nLoading...\n\nThe passing of the bill through the US House of Representatives, by just one vote, saw bond yields soar on Thursday night (Australian time).\n\n\"Over the last few years … we've gone through one of the biggest inflation periods and rate hiking cycles in decades,\" Jamieson Coote Bonds senior portfolio manager James Wilson said.\n\nThe bond market is flashing red and market turbulence is far from over Photo shows A close up of Donald Trump's face as he looks over his shoulder with a casual expression. US Treasury bond yields are surging again because investors are selling bonds and using the cash to buy stocks, with a renewed sense of optimism about the future.\n\n\"Since the 1990s, in all that time, if we think back, there's been a shocking narrative about higher yields.\n\n\"In reality, the 10-year US Treasury yield has] traded above 5 per cent only once and that was back in October 2023 and it lasted there for about 5 to 6 hours,\" he said.\n\nThe 10-year US Treasury yield is yet to trade above 5 per cent this year. It's currently above 4.5 per cent.\n\nBut when the passage of Trump's bill hit trading terminals across the globe, the 30-year Treasury bond yield touched a level not seen since 2007, of 5.13 per cent.\n\nThe catalyst for the latest round of selling was Moody's downgrade of US debt from Aaa to Aa1.\n\nMoody's downgrade said, ever-so-subtly, US debt had become riskier for the lender.\n\nIt clearly has.\n\nGlobal increase in yields hurts economic activity\n\nBut how does it affect you?\n\nThe problem is that many assets and securities across the globe use US Treasury bonds as a reference rate.\n\nPut simply, the more yields rise for US bonds, the higher the borrowing costs for US businesses and households.\n\nThis makes it increasingly difficult for big US corporations to raise funds and grow their profits and may lead to US consumers pulling back on their spending.\n\n\"So, if we think about the global cost of capital, the 10-year US Treasury is the benchmark,\" James Wilson said.\n\n\"It gets used for corporate lending, it gets used for sovereign lending — so where the government can borrow money, and it gets used for mortgages.\"\n\nIn short, if US government bond yields continue to rise, it risks pushing the US into recession.\n\nDonald Trump's \"One Big Beautiful Bill Act\" is part of his grand plan for extensive tax cuts. (Reuters: Nathan Howard)\n\nThis would affect both Chinese and Australian economic growth, and therefore employment.\n\nThis would be compounded if both bond and share markets fell together. Given that shares are valued, in part, against the \"risk-free\" return that can be obtained from US Treasuries, rising yields tend to put downward pressure on share prices because investors demand a higher return.\n\n\"So, especially when both bonds and equities are both falling in price, this is tightening funding conditions,\" Barrenjoey's interest rate strategist Andrew Lilley said.\n\n\"And also [it's going to cost more] if you then go to the debt market while you're paying more.\n\n\"That's the way in which this kind of reinforces itself.\"\n\nHe says, \"at the margin\", higher US bond yields \"could push the Reserve Bank to cut the cash rate, if long-dated yields keep climbing.\"\n\nThis would be to support Australian businesses borrowing from the US, and the economy more broadly.\n\n\"Basically, the higher long-term funding costs are the lower the RBA needs to make [the cash rate].\n\n\"That's the simplest way of putting it.\"\n\nLoading\n\nRBA 'paid to worry' about 'cataclysmic' events\n\nThe Reserve Bank is known for its understated commentary.\n\nNot so this week.\n\nIt made it clear to everyone that the Monetary Policy Board's decision to cut the cash rate from 4.1 per cent to 3.85 per cent was due in some part to the small but rising risk of a \"severe downside scenario\".\n\nGovernor Michele Bullock was asked if that included a \"cataclysmic\" financial markets event, and a recession.\n\n\"Well, yes,\" she responded, \"we are on the alert for that, and we're paid to worry about that sort of thing.\"\n\nThe Reserve Bank is watching and 'worrying' about a cataclysmic economic event. (ABC News: Matt Roberts)\n\n\"And we have been watching that very closely as have other central banks all around the world.\n\n\"I'm not putting a strong possibility on a really, really bad outcome, but I think we have to be alert that there might be [one].\n\n\"[And] if you look at our scenario analysis, it does suggest that in a really bad outcome there could possibly be an [Australian] recession, yes, but that's in the very extreme,\" Bullock said.\n\nThe Reserve Bank has already shifted its unemployment rate forecast up slightly to peak at 4.3 per cent. It's currently 4.1 per cent.\n\n\"Look, without a doubt that the Reserve Bank is quite worried about the global growth story,\" James Wilson said.\n\nIt all comes back to Trump, how his tariff policy will play out, the future credibility of US sovereign debt, and how financial markets ultimately respond to ongoing confusion about the global economic outlook.\n\n\"If we are in the middle of a government debt crisis, it's something that's been brewing for 25 years,\" Barrenjoey's Andrew Lilley said.\n\n\"And nothing in the last week has really accelerated that.\n\n\"But the attention [on ballooning US government debt] just becomes salient to everybody at the same time and everybody starts saying well these government bond yields need to be higher and it's not because of the news, but it's because of the new attention.\"\n\nThe suggestion is that US government borrowing has been on an unsustainable path now for decades.\n\nEnter Donald Trump, and the true scale of the fiscal crisis is being realised.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/australian-designer-takes-paper-clothing-to-catwalk/105319424",
        "title": "Paper clothes are turning heads and they're more durable than you think",
        "publish_date": "Fri, 23 May 2025 22:37:10 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Each year, the average Australian throws out about 11 kilograms of clothing, according to the latest National Waste Report.\n\nBut what if some of that could be composted?\n\nIt might sound surprising, but paper fashion has been around for centuries and while it remains far from the mainstream, interest is growing, according to Australian designer Anzara Clark.\n\nShe holds sold-out workshops to overcome people's misconceptions about the power of paper.\n\nMs Clark wants to see paper cloth used more widely. (Supplied: Rose Kudlicki)\n\n\"I think in the West we see paper as something that's fragile … that we wrap things in and we write on,\" Ms Clark said.\n\n\"I've got a paper vest that I made as a prototype last year, and I've worn it 60 times and it's still in fantastic condition.\"\n\n\" Traditionally … in Japan, with certain processes, they made armour out of paper as well. \"\n\nNot your usual paper\n\nIt's a long process to turn paper into a cloth that is not only durable, but also washable.\n\nMs Clark works with Japanese washi paper, made from the bark of the mulberry tree.\n\nMs Clark's collection at Eco Fashion Week has been picked up at shows in Italy and Canada. (Supplied: Eco Fashion Week Australia/BarboutFotograf)\n\nIt takes her four to six days to process and dye each sheet.\n\nMassaging products into the material is an intensive workout.\n\n\"I've got really strong hands … I often feel it in my shoulders and neck if I do too much in a day,\" Ms Clark said.\n\nFresh from Eco Fashion Week in Western Australia and Craft Lab in Ballarat, Victoria, where she lives, Ms Clark is fundraising in the hope of being able to accept an invitation to one of fashion's most prestigious Big Four events: London Fashion Week.\n\nPaper trials\n\nMs Clark's international recognition seems a far cry from her early days experimenting with paper fashion.\n\nThe process uses natural ingredients like bark, water and wood ash. (Supplied: Rose Kudlicki)\n\n\"I was just messing around post-surgery in recovery from an operation … weaving some old Japanese account book pages together,\" Ms Clark said.\n\n\" Sometimes the biggest discoveries happen in the most mundane places. \"\n\nShe went on to study traditional techniques in Korea and Japan, developing her own practice to make accessories and garments.\n\nMelbourne-based designer and RMIT sessional academic Jake Nakashima-Edwards also works in the niche field.\n\nHe has researched the long history of paper fashion in Japan, where it spread from China around the 9th century.\n\nJake-Nakashima Edwards with design partner Daphne Mohajer va Pesaran. (Supplied: Charlie Hawks)\n\n\"It was first worn [in Japan] by Buddhist monks who were kind of recycling or re-wearing the paper materials they were using to practise a calligraphy for Buddhist sutras,\" he explained.\n\nFast forward 800 years to the Edo period and paper was ubiquitous, forming products from farming wear to furniture.\n\n\"It's really, really different from the kinds of paper that you and I would interact with every day, like copy paper or printing paper,\" Mr Nakashima-Edwards said.\n\n\"It's very, very strong, very durable, and was often coated with oils and starches that would increase that strength and durability or add … water resistant or waterproof properties.\"\n\nA garment produced by Mr Nakashima-Edwards' company DNJ Paper. (Supplied: Henry Trumble)\n\nMulberry cloth traditions developed across the Asia-Pacific region, including in the Pacific Islands (tapa).\n\nIn the West, paper clothing rose in popularity in times of scarcity — such as post-war Germany ersatz (replacement) cloth.\n\nMr Nakashima-Edwards orders paper from Japan to turn into cloth. (Supplied: Henry Trumble)\n\nIn the 1960s, disposable paper garments were briefly taken up by celebrities like Andy Warhol.\n\nBut Mr Nakashima-Edwards says paper fashion fell out of favour in Japan with the rise of industrialisation, and it is now practised by few designers worldwide.\n\nDNJ Paper started with baseball caps as a product familiar to consumers. (Supplied: Henry Trumble)\n\n'Unexpectedly wearable'\n\nAs a labour-intensive and therefore expensive product, neither Ms Clark nor Mr Nakashima-Edwards see it as a silver bullet to the problems of the fashion industry.\n\nHowever, Mr Nakashima-Edwards says it provides a more sustainable alternative, both for its materials and for encouraging slow fashion.\n\n\"It also helps to … make you reassess: should I be buying all these clothes and just throwing them away?\n\n\"Or should I be repairing them and mending them and treating them with the care and the respect that they deserve?\"\n\nStudio assistant Rose Kudlicki agrees.\n\nShe modelled for Ms Clark ahead of Eco Fashion Week, and was terrified she would rip the garments when she needed to go to the bathroom.\n\nMs Clark says paper garments remain exclusive items produced on a small scale. (Supplied: Eco Fashion Week Australia/BarboutFotograf)\n\nInstead, she found the material much stronger and more flexible than she expected.\n\n\"It was so comfortable and it just is unexpectedly … very wearable.\"\n\nShe was so taken with the practice, she now works with Ms Clark as an intern.\n\n\"I think that the fashion industry is going a little bit into a dark, horrible, cavernous space,\" Ms Kudlicki said.\n\n\"I really like that Anzara works with tradition and resourcefulness and it's something that you don't see so much of at the moment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/giro-d-italia-mads-pedersen-isaac-del-toro/105332048",
        "title": "Unstoppable Pedersen wins Giro stage 13, Del Toro extends lead",
        "publish_date": "Fri, 23 May 2025 22:25:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mads Pedersen has won his fourth stage of this year's Giro d'Italia after beating Wout van Aert to the line, while Isaac del Toro has marginally extended his overall lead to retain the pink jersey.\n\nAs the riders neared the finish of the 180-kilometre ride from Rovigo to Vicenza, Pedersen (Lidl–Trek) was fourth when he launched his bid for victory in the 13th stage on the uphill sprint, squeezing his way past as Van Aert stayed close on his wheel.\n\nDel Toro had done well to earn bonus seconds in the intermediate sprint, but the 21-year-old did not have the legs to challenge the sprint heavyweights as he settled for third, leaving Pedersen and Van Aert to battle it out for victory.\n\nUltimately, it was Pedersen who powered through to the finish to take the win by less than a bike length, even as Van Aert — riding for Visma—Lease a Bike — tried his best to make a last-ditch lunge.\n\n\"What an incredible Giro this is,\" Pedersen said.\n\n\"Timing my effort was dictated by instinct. I had to open up on the right side close to the barriers. So I went a bit earlier than I wanted to.\n\n\"On such a hard day and a finale like this, everyone has burning legs in the finale. It was definitely nice to have seen it before.\n\n\"I'm happy with this win and adding another 50 points for the Maglia Ciclamino [purple jersey]. I'm overwhelmed with winning again.\"\n\nDel Toro leads his UAE Team Emirates teammate Juan Ayuso by 38 seconds in the general classification.\n\nAntonio Tiberi of Bahrain Victorious is 1:18 behind in third place.\n\nMichael Storer (Tudor Pro Cycling Team), who was 20th in stage 13, is the best-placed Australian in the general classification.\n\nHe holds down 14th position, 3:37 adrift of del Toro.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/tas-glenorchy-cwa-looks-towards-modern-multicultural-update/104994234",
        "title": "Not just baking scones: Re-formed CWA undergoes multicultural update",
        "publish_date": "Fri, 23 May 2025 22:20:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Adriana Taylor has been a proud member of the Country Women's Association (CWA) in Tasmania since the 1970s.\n\nHaving just moved to a new area and with small children, she did not know anyone and craved a sense of community.\n\n\"It was sort of a no-brainer to join an organisation like CWA where there were like-minded women,\" Ms Taylor said.\n\n\" They taught me so much. \"\n\nCWA Tasmania president Adriana Taylor says it's important organisations reflect the community they live in. (ABC News: Morgan Timms)\n\nThe organisation operates across Australia, and is focused on supporting the lives of women, their families and communities through social activities, advocacy and fundraising.\n\nBut the CWA has had its challenges.\n\nThe Glenorchy branch, in northern Hobart, shut about four years ago due to dwindling membership.\n\nBut now, as CWA state president, Ms Taylor is helping to resurrect it — but this time, members are doing things a little differently.\n\nThe branch has reached out to the migrant community to recruit new members and has held several meetings under the new direction.\n\nThe CWA has long had a strong reputation for its baked good and community fundraising. (ABC News: Morgan Timms)\n\n\"One of the reasons that we really want to restart a Glenorchy branch, is because of our involvement with migrant and refugee women,\" she said.\n\n\"We haven't done that very well in the past in CWA and this is particularly an area where there are big concentrations of migrant and refugee women.\n\n\"It doesn't matter if you're a woman from the city or from the country, whether you're from a poor country or a rich county. We all want the same things.\"\n\nShifting the perception of who gets to be a member\n\nChanging the membership means shifting perceptions of who gets to be a part of the CWA.\n\nMember Una Lalagavesi, who is from the Pacific Islands, said over the years she had enjoyed a baked good from the CWA here and there.\n\nUna Lalagavesi says she never expected to be a part of a CWA branch. (ABC News: Meg Whitfield)\n\nBut, \"never for a day in her life,\" had she expected she would ever be a member herself.\n\n\"There was always that understanding that CWA was a community of females that had to be living, born and brought up [in Australia] and be of a colour and a descent,\" she said.\n\nAs a childcare worker, Ms Lalagavesi said every day she saw the diverse community she lived in reflected back at her — and it was encouraging to see organisations like the CWA embracing that.\n\nBut, she said it was about more than words — with the branch's efforts in supporting Pacifika, a community event to celebrate Pacific Islander communities and seasonal workers earlier in the year, proving to her that members meant what they said.\n\nMembers of the branch say creating an inclusive space is about more than just words. (ABC News: Morgan Timms)\n\n\"It's an opportunity for us to have a voice, to empower our young females, our elderly and our generation that's coming to know that there is going to be a safe place for them to come to,\" Ms Lalagevesi said.\n\n\"In my role where I work, you see a lot of families that need a sense of network, a sense of home — and if this is what the CWA can offer them, then this is just amazing.\"\n\nNot just baking scones\n\nMasina Robinson says she's passionate about giving back to the community, with the CWA a way to do that. (ABC News: Morgan Timms)\n\nHeading into the first branch meeting, friends Masina Robinson and Finau Roberts, both from the Pacific Islands, shared Ms Lalagavesi's perception of what the CWA was about.\n\n\"I thought well, maybe they're just making scones,\" Ms Robinson said.\n\n\"But I've learned a lot in the past few months.\"\n\nShe said she was happy to be a part of an organisation so focused on giving back to the community.\n\nMasina Robinson and Finau Roberts say they previously had an image in their mind of who was in the CWA — and they're excited to see that expand. (ABC News)\n\n\"I think it's very important as generations get older, and the new ones come along … for them to be a part of it, and especially from multicultural backgrounds, that they feel included in this organisation.\"\n\nMs Roberts echoed the sentiment.\n\n\"I'm so glad I came,\" she said.\n\n\" We're building a new foundation for diverse and multicultural people. \"\n\nAnd, the pair said, while they now know scones are not the only feature of the CWA — they do bring their own recipes to the table.\n\n\"We also do a doughnut version of the scones, so we can have a competition,\" Ms Robinson said.\n\nRachel Valentyne from the Multicultural Council of Tasmania says there are real opportunities for collaboration with the CWA. (ABC News: Ebony ten Broeke)\n\nRachel Valentyne, from the Multicultural Council of Tasmania, said it was important the branch took a proactive approach to engaging Glenorchy's multicultural community.\n\n\"A lot of these people are newly arriving to Tassie and they are quite unaware of the services that are available, and some of the time they feel as though they're not accepted,\" she said.\n\n\"It's really important to start those conversations and get the word out there in a really inclusive manner. It needs to come from the source.\n\n\"...We can really learn from all these really amazing women and the things they can offer to the CWA.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/act-emergency-department-neurodivergent-sensory-friendly-room/105329868",
        "title": "Max gets overwhelmed in hospital. A sensory-friendly room hopes to help",
        "publish_date": "Fri, 23 May 2025 22:06:36 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A quiet room with mood lighting, bean bags, lollipops and fidget toys may seem antithetical to emergency medical treatment — but for some patients in Canberra, it's non-negotiable.\n\nThat's the case for autistic 13-year-old Max Fenton, a regular at the Canberra Hospital's Emergency Department (ED) who has a list of sensory aids he brings along to each visit.\n\n\"I get to have something to fidget in my hand, which helps me focus,\" Max said.\n\n\"And [sensory stuffed toy] Jerry — he is mostly just moral support.\"\n\nMax Fenton has been bringing sensory aids to Canberra Hospital for years. (Supplied: Annabell Fenton)\n\nBorn with multiple organ failure, including an enlarged heart requiring specialist care in the Neonatal Intensive Care Unit, Max said he's \"nearly been raised\" at the Canberra Hospital.\n\n\"I've had to have so many check-ups, I've lost count of how many,\" Max said.\n\n\"Max experienced complications with intra-uterine growth restriction, which is when a baby in the womb does not grow as expected,\" Max's mother, Annabell Fenton, said.\n\nNeurotypical 'attitudes, practices and structures' create barriers for autistic people\n\nMax was first diagnosed as autistic at four, and was assessed as having relatively low support needs, but three years later — when the presentation of his traits changed as he got older — he was re-evaluated and rediagnosed as having higher support needs.\n\nIt's thought 290,000 Australians have an autism diagnosis, though the true number is estimated to be much higher.\n\nA national autism strategy, launched in January, notes \"attitudes, practices and structures in a neurotypical world can create barriers that impact on autistic people being able to participate fully and equally in the community\".\n\nThe government has pledged $42.3 million to implement the first phase of the seven-year strategy, which includes the provision of more accessible and sensory-friendly public places.\n\nMax Fenton says he often found attending Canberra Hospital to be a noisy, awkward, and uncomfortable experience. (ABC News: Callum Flinn)\n\nAutism exists on a spectrum, and autistic people experience sensory inputs differently, but many are highly sensitive — and anywhere with unfamiliar people, loud noises, bright lights, and strong smells can be overwhelming.\n\n\"I hear every single noise,\" Max said.\n\n\" And I mean, like, every single little, tiny noise. \"\n\nWithout noise-cancelling headphones, \"all the noises just come rushing in at once\".\n\n\"Then it's just all loud and … it's just … overwhelming,\" Max said.\n\n\"It's very difficult for me to pay attention sometimes and listen. I get tired easily.\"\n\nSensory differences can make hospital environment overwhelming\n\nDr Alison Lally of the Canberra Hospital says overstimulation or hypersensitivity can be clinically risky on top of a patient's reason for presenting to the ED. (ABC News: Callum Flinn)\n\nDr Alison Lally, a Canberra Hospital emergency consultant, said a hospital setting can often turn up the volume on this kind of discomfort.\n\n\"You have different people, dressed in different colours, coming to do things,\" Dr Lally said.\n\n\"[They're] checking blood pressure, get a little prick on the finger to check blood sugar, ask you to step on some scales, and give you some medicine.\"\n\nSuch overstimulation or hypersensitivity, on top of a patient's reason for presenting to the ED, can also be clinically risky.\n\n\"Autistic kids … get dysregulated or start to become quite heightened,\" Dr Lally said.\n\n\"That results in things like a high heart rate, they start pacing, they start getting really anxious.\"\n\nMax Fenton sometimes experiences shutdowns after having surgery. (ABC News: Tobias Hunt)\n\nMs Fenton said Max will often \"go into shutdown\" post-surgery.\n\n\"He may have a period of being, basically, non-responsive for quite a number of days,\" she said.\n\n\"A shutdown is when I [give] no response,\" Max said.\n\n\"I'm just, like, on the desk face-first.\n\n\"You try to shake me — does not work. You try everything — does not work. I'm just out cold.\"\n\n'We have to do better' for neurodivergent kids\n\nThe Canberra Hospital's Neurodiversity Distraction Trolley has tools to help patients with both tactile and oral sensory needs, and acts as a distraction tool. (ABC News: Callum Flinn)\n\nDoctor Lally said her experience taking her now-10-year-old autistic son to the ED inspired advocacy \"for improved care for all kids but, in particular, our complex care kids and also neurodivergent kids\".\n\n\"Even though I know people here [and] I came prepared with headphones and an iPad [for my son], just the whole environment was really overwhelming,\" Dr Lally said.\n\n\"The lights are really bright, the procedure room was really small. We also have a lot of noise.\n\n\"It's quite unpredictable … lots of people coming and going, doors opening and closing. From there, I went, 'We have to do better'.\"\n\nInitial efforts involved staff education and environmental adjustments.\n\nThat included things like minimising noise where possible and reducing the lights, because many neurodivergent people are hypersensitive to light — in particular fluorescent lights.\n\nDr Alison Lally says dimming the lights, turning off unnecessary monitors, and minimising the number of staff was helpful.. (ABC News)\n\nA medical supply trolley was re-purposed, stocked with sensory tools and toys that could help staff provide inclusive care anytime, anywhere.\n\nDr Lally said the trolley includes aids based on each sense, with things like noise-cancelling earmuffs, colouring books, and Play-Doh.\n\n\"Just that ongoing squeezing of something [like Play-Doh] really helps. We also got iPads [and] some distraction tools, and little fidget toys,\" she said.\n\n\"It's not for all kids, but some kids do actually respond quite well to that [combination].\n\n\"Usually, just dimming the lights, turning off [unnecessary] monitors, and as minimal staff as clinically required was actually helping a lot.\"\n\nChanges see reduced dysregulation, stay length, and parental stress\n\nDr Alison Lally says the hospital has seen less neurodivergent children experiencing dysregulation since the sensory-friendly room's introduction. (ABC News: Callum Flinn)\n\nThe Canberra Hospital's new Critical Services Building, which opened last August, included a separate children's emergency area with a sensory-friendly room.\n\nDr Lally said changes have also been made in paediatric procedure and treatment rooms, and some strategies can be applied in the resuscitation area.\n\nShe said since the sensory-friendly room's introduction, the ED has seen a lot less neurodivergent children experiencing dysregulation.\n\n\"We've got some mood lighting [and] beanbags, which might not seem like much but it's a low stimulus [environment],\" Dr Lally said.\n\n\"[That] means there's not much light, there's not much noise, and the colours are quite calming for neurodivergent kids.\n\n\"There's a reduced length of stay, parents aren't feeling so stressed and overwhelmed.\"\n\nAnnabell Fenton (right) says the Canberra Hospital's new sensory-friendly room is a \"game changer\" for Max. (ABC News: Callum Flinn)\n\nMs Fenton said for Max the sensory-friendly room has been a \"game changer\".\n\n\"You can close that door and all sound disappears,\" she said.\n\nFor Ms Fenton, the improvement of sensory-friendly spaces in the ED is an important part of helping neurodivergent children learn how to advocate for their accessibility needs to be met.\n\n\"We're teaching young people that, 'This is okay: to ask for the things that I need',\" Ms Fenton said.\n\n\"And they're skills that they'll take through the health system with them, until they're older.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/monaco-f1-grand-prix-piastri-second-behind-leclerc-in-practice/105332014",
        "title": "Piastri second fastest after 'messy' Monaco F1 practice",
        "publish_date": "Fri, 23 May 2025 22:01:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's championship leader Oscar Piastri has gone into the tyre wall nose first at Sainte Devote, but still ended the day second fastest in practice at the Monaco Formula 1 Grand Prix.\n\nPiastri was 0.038 of a second slower than last year's winner Charles Leclerc, who thrilled his home fans by setting the pace in both practice sessions.\n\nLeclerc's fellow Ferrari driver, seven-time world champion Lewis Hamilton, was third fastest across the day.\n\nHaving been on pole three times in the last four Monaco races, Leclerc lapped the tight and twisty street circuit with a best time of 1 minute, 11.355 seconds in the late-afternoon sunshine.\n\nHe produced a lap of 1:11.964 in the opening practice session, a surprise after neither Ferrari qualified in the top 10 at Imola last weekend.\n\nWhen Australian F1 drivers won the Monaco Grand Prix Photo shows Daniel Ricciardo driving during the Monaco Grand Prix past the harbour in 2018. Glitz, glamour and prestige have long been associated with Formula 1, and no race embodies that more than the Monaco Grand Prix.\n\nPiastri, who leads McLaren teammate Lando Norris by 13 points on the championship standings, said it had been a tricky day.\n\n\"When we get everything together, the pace is quite good,\" said Piastri, who was third in Imola after starting on pole.\n\n\"Ferrari look a lot stronger than they have done. But today was more on my side being quite messy.\"\n\nLance Stroll collected a one-place grid drop for Sunday's race after stewards ruled the Canadian was to blame for a collision with Leclerc.\n\nThe session was stopped for debris to be cleared, with Stroll's Aston Martin requiring repairs to the rear suspension and a gearbox change.\n\nStewards ruled Stroll had cut across Leclerc's path, with the Canadian saying he had not heard the team's warning over the radio.\n\nLeclerc broke his car's front wing in the incident but returned after a brief red flag period to go 0.163 quicker than Red Bull's four-time world champion and Imola winner Max Verstappen.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/australia-farm-productivity-collapses/105322602",
        "title": "The quiet Australian farming crisis you may not have heard about",
        "publish_date": "Fri, 23 May 2025 21:46:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Collapsing productivity on Australian farms has left a once world-leading sector at risk of being left behind by international competitors.\n\nAnnual farm productivity today is just a quarter of what it was decades ago, prompting the national farming lobby to ring the alarm for a government-led policy overhaul, including changes to competition and workplace laws.\n\nProductivity measures how efficiently inputs such as feed, fertiliser, fuel, labour, land and water are used to produce outputs like beef, grain, milk or wool.\n\nExecutive director at the Australian Bureau of Agricultural and Resource Economics and Sciences (ABARES), Jared Greenville, said the rate had fallen around 75 per cent from an annual rate of 2.2 per cent in the 1980s and 1990s.\n\n\"Farm productivity has slowed and the average rate's about 0.6 per cent,\" Dr Greenville told Landline.\n\nJared Greenville says increased mechanisation and deregulation supercharged Australian farm productivity before 2000. (ABC Landline)\n\n\"That's put us back in relative terms to international competitors as they're getting stronger productivity growth.\n\n\" They're [just] starting from a lower base than we are. \"\n\nAs the federal government's commodity forecaster, ABARES has estimated the Australian farm sector will produce $91 billion of food, cotton and wool this year.\n\nAustralia has fallen behind its international competitors when it comes to making more from less. (Supplied: ABARES)\n\nIf that eventuated it would be one of the most valuable years for the farm sector, likely further driven by a big winter crop forecast to harvest almost 60 million tonnes.\n\nThe National Farmers' Federation said despite the high forecast it expected the productivity slump would worsen.\n\nNFF president David Jochinke claimed farmers were at the cutting edge of technology and \"clever sustainable practices\" but had been hampered by \"poor policy, administrative burden, and green tape\".\n\nThe NFF used the productivity announcement to again call on the federal government to overturn a ban on live sheep exports, change competition laws, improve access to workers, and restrict transmission lines on farm land.\n\nCall for wider implications to be considered\n\nKatie McRobert from the Australian Farm Institute said innovation typically drove productivity.\n\nThat could include technological advances, increased research spending and improved infrastructure.\n\n\"Often our productivity is held back by a lack of really good infrastructure that can just enable the good flow of goods around a trading system,\" Ms McRobert said.\n\nShe cited a 2017 study that found if farmers had adequate phone and internet access they would contribute an extra $20 billion to the economy.\n\nKatie McRobert says changes to farm policy should consider social and environmental impacts, not just productivity. (ABC Landline)\n\nMs McRobert said policy changes to drive productivity should also consider social, animal welfare and environmental impacts.\n\n\"Maybe a regional community doesn't want to see all the farms in the region consolidate and become one big farm,\" she said.\n\n\"As a society we need to step back a little bit from pure productivity measures and think about what it is we want to incentivise and what the goals are that we're seeking.\"\n\nMechanisation drove productivity before 2000\n\nDr Greenville said Australian farming's high productivity rate before the year 2000 was the envy of not only global competitors, but also other parts of the Australian economy.\n\nIt was driven by increased mechanisation — such as switching to larger tractors and rotary dairies — and major changes to trade rules such as deregulation.\n\nSimon Scowen's NSW dairy farm milks 800 cows a day. (ABC Landline)\n\n\"We saw producers shift out of wool production and we saw the sheep flock fall from over 120 million to about 70 million that we see today, and a massive shift of those operations into cropping,\" Dr Greenville said.\n\n\"The cropping industry became more productive as it could grow in terms of the scale of production.\"\n\nAs a mixed farmer from north-east Victoria, the productivity slump prompted a mixed response from fifth-generation farmer James Russell.\n\n\"It does surprise me a little bit as a grain grower. It doesn't surprise me as much as a sheep producer,\" Mr Russell said.\n\nVictorian farmer James Russell says the cost of growing crops and raising sheep means farmers rely on high returns. (ABC Landline)\n\n\"We've seen huge upticks in technology [in] our ability to grow a crop bigger and better.\n\n\"In the sheep industry, we still farm sheep in a very similar way than we did 20 years ago.\n\n\"We don't actually get a return, it costs us money to get sheep shorn [this year].\"\n\nCropping's annual productivity rate is sitting at 1.2 per cent, compared to 0.5 per cent for sheep, which has been plagued by low production and prices.\n\nDairy productivity shows two-speed industry\n\nDespite an annual productivity rate of almost 2 per cent in the 40 years before 2010, dairying's productivity rate has dropped away to basically zero.\n\nBut ABARES said the sector is largely a two-speed industry, with some dairy farmers faring much better than others.\n\nSimon Scowen started farming 30 years ago, milking 80 cows on a farm near Bega. (Supplied)\n\nOne of those driving up the sector's productivity is Simon Scowen, who farms on the New South Wales Mid North Coast.\n\nThis year Mr Scowen has built a large shed for his 800 milking cows.\n\nWith easy access to mixed feed rations, shelter, fans and sprinklers, in the first few months since moving into the shed he said milk production jumped by 20 per cent.\n\n\"Those that have been doing it for a couple of years in Australia, that we've gone and had a look at, they range from a 30 to 40 per cent increase in cow production by putting them in this facility,\" Mr Scowen said.\n\nDairy Australia says seven per cent of the milk produced in Australia comes from cows housed in a shed.\n\nThat figure is expected to increase.\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/ndisp-specialist-disability-accommodation-investor-allegations/105324876",
        "title": "Retiree 'forced back to work' after investing in disability accommodation",
        "publish_date": "Fri, 23 May 2025 21:19:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Leanne Crumpton's daughter Sally was only three when she died with cerebral palsy.\n\nSo when the 64-year-old learned about investing in specialty homes suited for people with disability — and the potential windfalls on offer for such NDIS-approved housing — it struck a chord.\n\n\"I just thought about what it would've been like for her to grow up and be able to have her own home,\" Ms Crumpton said.\n\nShe said it sounded like a \"great thing\" to do with her superannuation that would earn her extra income in retirement.\n\nLeanne Crumpton’s daughter Sally died at the age of three with cerebral palsy. (ABC News: Emma Rennie)\n\nBut instead of paying her retirement income, the former nurse said she was forced back to work.\n\n\"There were so many sleepless nights, waking in the middle of the night thinking there has to be an answer … what can I do?\" she said.\n\n\"It's quite devastating to think that you've been taken for a ride.\"\n\nLeanne Crumpton says investing in accommodation for people with a disability struck a chord with her after she lost her daughter, who had cerebral palsy. (ABC News: Emma Rennie)\n\nMs Crumpton is one of eight investors with a company called NDISP who have spoken to the ABC about fears they've been ripped off.\n\nThe company, which rejected claims of misconduct and said most investors are happy, managed a $200 million portfolio of more than 140 homes for people with disabilities in Queensland.\n\nAsked about investor complaints, sector watchdog the NDIS Commission said it was \"looking into concerns raised about this provider\".\n\nInvestor says scheme offered potential high rental returns\n\nBack in 2016, the National Disability Insurance Agency, which oversees the NDIS, began encouraging investors to build specialist disability accommodation (SDA), suited for people with disability.\n\nThe modifications include things like hoists to help people take showers, wider doorframes for better accessibility and voice-activated lighting.\n\nIn return, if the homes are tenanted, landlords receive high government-subsidised rent, as much as $50,000 per participant per year according to the NDIA. But it can be a risky investment if the homes are not filled.\n\nLeanne Crumpton's Townsville property was managed by NDIS-approved accommodation provider NDISP. (Supplied: Leanne Crumpton)\n\nUnder government rules, SDA properties must be managed by a NDIS-registered SDA company, providing a conduit between investor landlords and NDIS participants — with the latter paying rent via their taxpayer-funded plans as well as monthly personal contributions.\n\nIn Ms Crumpton's case, she used her self-managed superannuation fund to buy land and build a three-bedroom SDA house for $600,000 in Townsville in 2021, and signed on NDISP to manage the property.\n\nEmails seen by the ABC show NDISP told Ms Crumpton it \"expected\" the property would get two tenants, and she could receive an annual income of $83,000.\n\nMs Crumpton thought the estimates were best-case scenarios, but that she could count on about half of that.\n\nInstead, the house sat empty for a year and there was no money coming in.\n\nLeanne Crumpton was told she could make $83,000 a year in rent with her SDA home. (ABC News: Emma Rennie)\n\n\"By the middle of the year I was thinking, are these people corrupt or just incompetent? I couldn't quite work it out,\" Ms Crumpton said.\n\n\"It was really difficult to get them on the phone, really difficult to get them to answer emails.\"\n\nShe, like several other investors the ABC has spoken to, has alleged the company did not adequately look for people to tenant the home, but kept sending bills for services including those provided by other companies also controlled by NDISP's owners — from mowing the lawns to providing electricity.\n\nInvestors have also told the ABC the company was frequently late with rent and often did not respond when landlords tried to find out what was going on with their homes.\n\nAfter a year of no rental income, and outgoings that included more than $4,000 to NDISP-related entities in the first financial year, Ms Crumpton was forced back to work.\n\n\"I couldn't stay retired … lucky I was a nurse that I could pick up casual work,\" she said.\n\nRetiree Leanne Crumpton, pictured with her grandkids, says she was forced back to work due to her SDA property. (ABC News: Emma Rennie)\n\nBut NDISP has rejected claims anyone was ripped off.\n\nRisks, such as homes going vacant, and inter-company dealings were fully disclosed and most investors were \"completely satisfied\", it told the ABC, adding the sector also faced compliance costs and lumpy cash flows from the NDIA.\n\n\"NDISP was a mission led, profit for purpose company that tried and in many ways succeeded in making the world a better place for people with a disability,\" the company said.\n\nMs Crumpton managed to break her lease with NDISP and sell her property.\n\nBut investors still with NDISP now face further uncertainty.\n\nLast week, the company announced it was shutting down operations after the Australian Tax Office took legal action to wind the company up over debts that in February this year stood at more than $600,000.\n\nNDISP said it would transfer the leases it manages to a new company.\n\nDisability accommodation sector plagued with issues\n\nThe events at NDISP come amid increased scrutiny on the activities of businesses that aim to make money from the multi-billion-dollar NDIS scheme.\n\nThe NDIS Commission has suspended SDA provider Cocoon, which is under investigation by the NDIA over allegations of fraud.\n\nA court has heard the investigation is the largest fraud probe currently on foot at the NDIA.\n\nLast month, the ABC revealed Melbourne businessman Khawaja Haroon was under criminal investigation over allegations of fraud in his NDIS empire.\n\nThe ABC also uncovered evidence of participants being allegedly mistreated. Mr Haroon denies doing anything wrong and says he is cooperating with authorities.\n\nUnlike Cocoon or Mr Khawaja's companies, NDISP only provided housing to NDIS participants and was not responsible for their care.\n\nJessica Walker, head of policy at the Summer Foundation, which advocates for better housing for people with disability, said the SDA sector was also plagued with problems.\n\n\"I think the NDIA could have done a much better job of stewarding the SDA market,\" Ms Walker said.\n\n\"There was a big need [for housing] and people have responded to that without always understanding some of the risks associated with investing.\"\n\nProvider denies any wrongdoing\n\nNDISP is run by former lawyer Darryl Richards and his business partner Jon Johnson.\n\nThe \"head lease\" signed between NDISP and landlords allowed NDISP to manage the properties for up to 20 years.\n\nThree investors the ABC has spoken to have said NDISP would not budge from the agreement when they tried to break leases for their properties.\n\nThe head leases also allow NDISP to use some companies of which Mr Richards and Mr Johnson are shareholders for maintenance, electricity and gardening.\n\nDarryl Richards and Jon Johnson both deny any wrongdoing. (Supplied)\n\nInvestors also paid up to $5,200 each year into a fund purportedly for residents to pay for extra services, until the NDIS Commission told the company to cease the practice, according to court documents.\n\nMr Richards and Mr Johnson deny any wrongdoing.\n\nMr Johnson said NDISP never promised investors they would make particular rental returns and always emphasised risks including that properties might stay empty.\n\nHe said NDISP created related companies — such as for utilities or services — out of necessity given stringent compliance obligations.\n\n\"The companies actually made losses,\" he added.\n\nHe said complaints came from a small number of investors and \"reflect a misalignment of expectations, not misconduct\".\n\nHe argued that dissatisfied investors represented four or five homes out of 150 homes.\n\nMr Johnson admitted that \"communication, cash flow, and reporting were affected during periods of high operational strain and technology failure, but [these issues were] never concealed.\"\n\nCouple takes legal action over lease dispute\n\nInvestors Russell and Judy Dunning resorted to pursuing NDISP in court to try and regain control of their four-bedroom SDA property in Cairns.\n\nThe Brisbane couple say they've struggled to understand how they've received so little information about a house they own.\n\n\"From the very beginning there was a distinct lack of communication [and] a lack of answering any questions we had,\" Mr Dunning said.\n\n\" There was an inability to include us in anything, literally anything, to do with the property. \"\n\nThey now know it has two tenants because of the court action they've taken, but say before that they weren't sure because NDISP would not give them details.\n\nJudy and Russell Dunning took legal action after struggling to get information about their own property. (ABC News: Lucas Hill)\n\nThey also allege they have no idea how much money they are entitled to through rent each month.\n\nSome months they've received nothing. Other months it's a few hundred dollars. On a good month, $9,000. The payments weren't accompanied by statements, so they don't know how it's calculated.\n\nThe income is meant to help the financial security of their four kids, two of whom have disabilities.\n\n\"We're always at sea about what's supposed to be coming in, what to expect and when to expect it,\" Ms Dunning said.\n\n\"It leaves you in a serious situation of thinking, 'Well, do we actually own it? Is it actually our property,'\" Mr Dunning said.\n\nThe Dunnings have struggled to understand communication from NDISP. (ABC News: Lucas Hill)\n\nNDISP said it limits the amount of information landlords can see about tenants due to strict privacy provisions under the NDIS, but disputed the Dunnings' claim they weren't told the number of tenants.\n\nNDISP said the NDIS was sometimes late with SDA payments and this impacted when payments could be made to landlords.\n\nWhen the Dunnings tried to get out of their lease, NDISP refused to dissolve the contract, prompting them to spend tens of thousands of dollars in legal fees to take them to the Queensland Magistrates Court.\n\nIn the end, the magistrate dismissed the application, saying the dispute might be heard in a different court.\n\nJon Johnson denies his company owes the Dunnings any money. (Supplied: Jon Johnson)\n\nIn a statement, NDISP's Mr Johnson rejected the Dunnings' allegations they had not received monthly statements or that NDISP owed them money.\n\nHe said the 20-year leases were in place so NDIS participants had certainty about their tenancies, and that NDISP fought the couple in court out of concern for their tenant who they feared would be forced to move out.\n\nMr Dunning says he's happy for the tenants to stay, he just wanted to get rid of NDISP.\n\nAustralian Taxation Office takes NDISP to court\n\nLast week, NDISP got out of the NDIS game after the tax office launched Federal Court action seeking to wind it up over the unpaid tax bill.\n\nIt's been a long-running struggle. Court documents filed by the ATO in a separate matter complain that NDISP was behind on some tax payments even in August 2021.\n\nThe ATO has issued director penalty notices holding both Mr Richards and Mr Johnson personally liable for the tax debts run up by NDISP.\n\nThe amount the ATO is now pursuing NDISP for was not available from the Federal Court. But the company told the ABC a debt was accumulated \"following significant cash flow disruptions\" including more than $1 million owed by the NDIA.\n\nNDISP said it was cooperating with the ATO.\n\n\"This [winding up] action came as a surprise and did not reflect the cooperative tone of previous engagements,\" the company said.\n\nAnother company where Mr Richards was a director, Yellow Card Builders, collapsed in March owing more than $240,000 to the ATO, company documents show.\n\nMr Richards was previously a lawyer who ran his own firm.\n\nHe did not renew his practising certificate in 2021 after a run-in with Queensland's Legal Services Commissioner.\n\nThe commissioner made a finding of unsatisfactory professional conduct for giving the wrong date in an affidavit, and later dropped an investigation involving Mr Richards after he agreed to see a therapist.\n\nIn 2023, when he was no longer a lawyer, Mr Richards nonetheless signed a letter to an NDISP investor in his capacity as \"in-house legal counsel\" of NDISP.\n\n\"I have not practised legal work since not renewing my certificate,\" Mr Richards told the ABC.\n\nInvestors wary as new entity takes over\n\nInvestors worry about what the future holds now that a new company has taken over from NDISP.\n\n\"This new company declares that there's no ties with NDISP, but my feeling is there still is,\" Judy Dunning said.\n\nShe said she was involved in a positive dialogue with new operator Sigma SDA Management, led by chief executive Paul Brunyee.\n\nJudy and Russell Dunning feel unsure about the new company that took over from NDISP. (ABC News: Lucas Hill)\n\nWhile Sigma said it had \"no ties to the former NDISP directors or registration\", its chief operating officer, James Brooker, has managed investment funds that channelled money into NDISP's properties.\n\nMr Brunyee said Mr Brooker's role at the funds \"was confined to investment management with no operational or governance involvement in NDISP\".\n\nSigma has promised its \"next steps\" will include giving investors a briefing as well as producing a \"Q&A resource addressing common concerns from participants, families, SILs and owners\".\n\nMr Brunyee said Sigma had bought leasehold interests from companies owned by Mr Richards and Mr Johnson for a confidential sum.\n\n\"There are no ongoing financial, operational or governance ties to NDISP or its former principals,\" he said.\n\nHe said Sigma will not be taking on NDISP's existing debts because it would \"undermine SIGMA's financial stability and disadvantage both participants and investors\".\n\nCalls for authorities to do better\n\nWhile the NDIS Commission has told the ABC it is looking into NDISP, the Dunnings and Ms Crumpton said nothing ever came of their multiple complaints to authorities.\n\n\"There was a reluctance of … government agencies to get behind us and back us in the situation against NDISP,\" Mr Dunning said.\n\nThey have called on the NDIA and NDIS commission to do better to help people trying to navigate the SDA sector, which they believe needs better regulation.\n\nThey know other NDISP investors who've been under enormous stress because of the situation — and are close to the brink.\n\n\"It's had dreadful mental health impacts on all of us,\" Ms Crumpton said.\n\nIn a statement, The NDIS Commission said it will take strong regulatory action where necessary and all SDA providers are subject to regular audits.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-24/community-effort-nsw-flood-rescues-tinny-evacuation-clean-up/105328270",
        "title": "Mates in tinny rescue dozens from flood in 'forgotten' NSW community",
        "publish_date": "Fri, 23 May 2025 21:15:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Flynn Holman's trusty tinny turned from fishing companion to lifesaving vessel this week, as he helped rescue dozens of residents from floodwaters on the NSW Mid North Coast.\n\nThe 21-year-old decided to help after his community of Cundletown was blind-sighted by record-breaking floods.\n\nThe small town is located 8 kilometres east of Taree in one of the regions most impacted by this week's wild weather.\n\n\"We knew it was going to be bad but we didn't expect this, it happened too fast,\" Mr Holman said.\n\n\"We didn't really have a choice [but to help].\n\n\"You deal with the hand you're dealt.\"\n\nFloodwaters in Taree on Wednesday, 8 kilometres from Cundletown. (ABC News: Victoria Pengilley)\n\n'Rely on the locals'\n\nMr Holman, an electrician, along with friends Tyson Lewis and John Dyball, began helping isolated residents move out of the floodwaters on Wednesday.\n\nHe said it had been \"non-stop\" since then.\n\n\"They have lost everything, absolutely everything,\" Mr Holman said.\n\n\" The people I have been picking up, they've just had one garbage bag with their belongings and they're leaving life-long homes behind. \"\n\nOn Friday, the group accessed a commercial fishing boat to make travel easier, as they helped people assess damage to their properties.\n\n\"We were battling a pretty heavy current in Ghinni Ghinni Creek and [were] just trying to dodge silage bales, fences … gates, all sorts of stuff,\" he said.\n\nFlooding near Cundletown this week cut off some residents. (Supplied: Flynn Holman)\n\nMr Holman also helped set up an unofficial evacuation centre in the local church, where hot meals were being made for isolated residents and displaced truck drivers.\n\n\"I hate to say it, we've kind of been forgotten,\" he said.\n\n\"I understand it's a stressful time but we can't just turn our back on people.\n\n\"You've got to rely on the locals.\"\n\nLoading...\n\nChallenging conditions\n\nNSW State Emergency Service Chief Superintendent Dallas Burnes said conditions had proved challenging, especially east of Taree in areas like Cundletown.\n\n\"Once the road network gets cut there, everything turns into an island,\" he said.\n\n\" The strength of the water in some of the narrower parts of the catchment, just meant you can't put boats in. \"\n\nSuperintendent Burnes said the \"dangerous\" conditions delayed some rescues.\n\n\"[We had] incredibly strong currents in the river … it's raining locally, the winds are blowing at 70 kilometres per hour and they're asking to be rescued,\" he said.\n\n\"We physically can't get teams to do that. The aviation efforts in many cases can't fly.\"\n\nSupplies being loaded for delivery. (ABC News: Emma Siossian)\n\nMeanwhile, residents in Port Macquarie rallied to drop supplies by boat to isolated residents in the town's flooded North Shore community, on the northern side of the Hastings River.\n\nNorth Shore residents were without power on Friday, and the car ferries connecting the area were out of action.\n\nDale Jordan and his wife helped buy groceries and deliver them to a local barge doing a supply run on Friday morning.\n\n\"My brother Rodney has been there for 40 years, right on the river,\" he said.\n\n\"They are used to it, but this one is a bit different to the 2021 floods — the water is staying around for a lot longer.\"\n\nDale Jordan says local oyster farmers and boaters distributed food to North Shore residents. (ABC News: Emma Siossian)\n\nResident rescues\n\nOyster farmers in Coopernook, including Ian Crisp, picked up more than a dozen people across Wednesday and Thursday.\n\n\"We've got the gear, we know the lay of the land pretty well. Why not go and help?\" Mr Crisp said.\n\nIan Crisp has experienced a lot of floods but would \"rather forget\" this one. (ABC News: Victoria Pengilley)\n\nChief Superintendent Burnes said it was \"amazing\" to see communities rally together, but encouraged residents to stay safe while assisting others.\n\n\"Spontaneous volunteers are something we need to embrace … if people can get out there and help communities in that crisis period,\" he said.\n\nLoading YouTube content\n\nCoopernook Rural Fire Service Captain Sherrie Gaul received phone calls from people isolated and in need of rescue this week.\n\nHer brigade banded together and commandeered an SES boat to rescue 17 people and 10 dogs.\n\nSherrie Gaul and her RFS brigade also performed flood rescues this week. (ABC News: Victoria Pengilley)\n\n\"They were cold, they were wet, they were just so grateful that we got them the help they needed,\" Ms Gaul said.\n\n\"It's multi-agency disaster relief right now and there is never going to be enough RFS, SES, police to help every single person.\"\n\nThe flood clean-up in Coopernook is just beginning. (ABC News: Victoria Pengilley)\n\nClean-up starts\n\nAs the flood threat began moving south on Friday, Flynn Holman said the Cundletown community had cautiously begun the clean-up process.\n\nKids were doing their bit by cleaning up mud and debris in Cundletown on Friday. (Supplied: Flynn Holman)\n\nHe expressed his pride in his local community and how they banded together.\n\n\"They say that home is the people and I think everybody here has really solidified that,\" Mr Holman said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/world/europe/it-was-quite-absurd-man-awakes-to-find-container-ship-wedged-in-his-yard-20250524-p5m1uu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It was quite absurd’: Man awakes to find container ship wedged in his yard",
        "publish_date": "Sat, 24 May 2025 11:02:06 +1000",
        "category": "finance",
        "authors": [
            "Vivian Ho"
        ],
        "text": "A man in Norway woke this week to find a 135-metre container ship towering over his home after it ran aground in his yard.\n\nJohan Helberg slept through the initial impact of the NCL Salten as it sailed into his yard in Byneset, Norway, early on Thursday morning, Helberg told Norwegian broadcaster NRK. But after being woken by his neighbours ringing his doorbell, he looked out of the window to find the ship’s bright-green bow – quite a different sight from his usual picturesque views of the Trondheim Fjord.\n\nJohan Helberg stands next to his house with its new garden feature – the container vessel NCL Salten. Credit: AP\n\n“It was quite absurd,” Helberg said, noting that it had stopped just metres from his house.\n\n“If it had hit five metres further to the right, it would have slid up the rocky cliff, and then my house would probably look quite different.” Helberg told NRK that the ship had cut a wire to his heating pump.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/losing-learning-lunching-winning-six-days-in-the-life-of-zach-merrett-20250523-p5m1tj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five Essendon captains went to lunch together. This is what they spoke about",
        "publish_date": "Sat, 24 May 2025 10:55:03 +1000",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "“It was about us getting back to the intent to the tackling and with our ball movement being a bit more exciting and generating a bit more excitment for the fans even. Not a lot changed.” Against Richmond, Essendon’s better players were around the ball. Nic Martin, voted best afield, combined with Merrett for 72 disposals. Jye Caldwell had 29, the enterprising Archie Roberts 34 and while hard nut Sam Durham had a modest 26, his impact was equal to that of Martin. Essendon’s Nic Martin is announced as the Yiooken Trophy winner. Credit: AFL Photos via Getty Images Angus Clarke thrived in his debut, booting three goals from the wing and showing sharp footy IQ. Merrett’s Bombers aren’t striving for glory and fame in 2025 so much as desperately seeking improvement. It was this desire to soak up the wisdom of elders that prompted Merrett to converse with “a dozen or two dozen” coaches and champions across the competition.\n\nThis week, he ventured closer to home by organising a meeting with four past Essendon captains. In chronological order: James Hird, Matthew Lloyd, Jobe Watson and Dyson Heppell. It is an initiative that he wants to cement with the current players. “I got a free lunch. So I’ll say thanks Hirdy for that. He’s the big dog, he can pay for lunches. It was incredible. I mean, we’re trying to bridge that connection and the fabric of generations of Essendon players and captains and trying to bring our fans along for the journey as well. Obviously, moving away from Windy Hill 12, 13 years ago. “Those guys are very good with their time as well. So I’m fortunate to have such good people mentoring me ... to me, it’s more about just discussing what they’ve learned. “I’ve been very lucky to meet a dozen or two dozen coaches, Brownlow medallists – you name it – across the journey. But it’s hard to go past champions of your own footy club and the fabric they have; to bring Hirdy and Lloyd back into the fold in some way I think should excite fans as well.”\n\nLoading Lloyd, speaking on 3AW on Friday night, said of the meeting: “It was more that I listened to him around the areas of the club that need to get better. “Which I don’t want to go into, but I gave him some responses that have worked for me or us in the past that have helped us get to the highest level and how to challenge some of his teammates to drive standards harder. “He was really honest, which is why I want to be careful of what I say here because we were all there to support him and help him. Merrett wants the current Bombers to form bonds with the past greats he’s cultivated.\n\nLoading “I think internally we’ve moved on from all those scars. But externally, I think there’s a number of people still hurting a little bit. If we can try and bridge that gap as quickly as we can with a bit of urgency, I think those sort of meetings with Hirdy and Lloydy and Jobe of that era hopefully fast track that with that generation. “There was so much success with the ’90s and 2000s and ’80s for me and our players and our current generation of young talent want to immerse themselves with those guys and if I can try and facilitate that as much as possible. “I know Brad’s very open to those guys coming in and being part of our fabric as well.” While disappointed to see Reid injured in the Dreamtime game on Friday night, Merrett said the key defender now knew what he can achieve.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/piastri-error-causes-red-flag-in-practice-20250524-p5m1ut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri error causes red flag in practice",
        "publish_date": "Sat, 24 May 2025 10:27:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Piastri error causes red flag in practice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/trump-threatens-tariffs-on-european-union-apple-as-his-trade-war-intensifies-20250524-p5m1tu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump threatens tariffs on European Union, Apple as his trade war intensifies",
        "publish_date": "Sat, 24 May 2025 09:50:57 +1000",
        "category": "finance",
        "authors": [
            "Josh Boak"
        ],
        "text": "Analysts have been sceptical that Apple could quickly shift device manufacturing to the US, mainly because it has spent decades embedding complex supply chains in China. Credit: Bloomberg “The EU’s fully engaged, committed to securing a deal that works for both,” Sefcovic said. “EU-US trade is unmatched & must be guided by mutual respect, not threats. We stand ready to defend our interests.” Trump has also threatened import taxes against Apple for its plans to continue making its iPhone in Asia. The tech giant now joins Amazon, Walmart and other major US companies in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by his tariffs. “I have long ago informed Tim Cook of Apple that I expect their iPhones that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,” Trump wrote. “If that is not the case, a Tariff of at least 25 per cent must be paid by Apple to the US”.\n\n‘I think such tariffs help no one, but would just lead to economic development in both markets suffering’ Johann Wadephul, German foreign minister The statement by Trump is critical in that he suggests the company itself would bear the price of tariffs, contradicting his earlier claims, as he rolled out a series of aggressive tariffs on foreign countries over the past several months. In general, importers pay the tariffs and the costs are often passed along to consumers in the form of higher prices. In response to Trump’s China tariffs, Apple’s Tim Cook said earlier this month that most iPhones sold in the US during the current fiscal quarter would come from India, with iPads and other devices being imported from Vietnam. After Trump rolled out tariffs in April, bank analysts estimated that a $US1200 iPhone would, if made in America, jump in price anywhere from $US1500 to $3500. ‘This one group in Brussels’ US Treasury Secretary Scott Bessent tried to provide some clarity on Trump’s postings in a Friday interview on Fox News.\n\nBessent said the EU has a “collective action problem” because its 27 member states are being represented by “this one group in Brussels,” such that the “underlying countries don’t even know what the EU is negotiating on their behalf”. Treasury Secretary Scott Bessent wants Apple to bring more of its computer chip supply chain into the US. Credit: Bloomberg The Treasury secretary said he was not in a White House meeting this week that Cook attended, but he also spoke with the Apple chief executive this week. Bessent said the goal was to have Apple bring more of its computer chip supply chain into the US. The core of Trump’s argument against the EU is that America runs a “totally unacceptable” trade deficit with the 27 member states. Countries run trade deficits when they import more goods than they export. From the vantage point of the EU’s executive commission, trade with the US is roughly in balance if both goods and services are included. As a global centre for finance and technology, the US runs a trade surplus in services with Europe, offsetting some of the trade gap in goods and leaving the imbalance at €48 billion ($84 billion).\n\nGerman Foreign Minister Johann Wadephul said the EU’s executive commission has his country’s full support in working to “preserve our access to the American market”. “I think such tariffs help no one, but would just lead to economic development in both markets suffering,” Wadephul said in Berlin. “So we are still counting on negotiations and support the European Commission in defending Europe and the European market while at the same time working on persuasion in America.” Trump aides have previously said the goal of his tariffs was to isolate China and strike new agreements with allies, but the president’s tariff threats undermine the logic of those claims. Trump has run hot and cold on his relationship with Apple, a sign that currying favour with him might not necessarily shield a company from his anger. He has essentially told companies such as Walmart to “eat” the costs of his tariffs instead of raising prices, even though doing so could squeeze profits and cause layoffs. He now appears to be deploying a similar degree of pressure on Apple.\n\nLoading Trump had previously created an exemption on electronics imported from China to help companies such as Apple, something he could now remove. He also threatened to impose separate 25 per cent import taxes on computer chips and could have the tariffs schedule rewritten in ways that could expose Apple products to the taxes. Until recently, the US president repeatedly bragged about the $500 billion that Apple pledged in February to invest domestically as part of its development of artificial intelligence technologies. But he publicly turned against the company last week while speaking in Qatar. “I had a little problem with Tim Cook yesterday,” Trump told the audience. “I said to him, ‘My friend, I treated you very good. You’re coming here with $US500 billion, but now I hear you’re building all over India. I don’t want you building in India.’” Analysts have been sceptical that Apple could quickly shift manufacturing to the US, mainly because it has spent decades embedding complex supply chains in China to feed the factories.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/kellaway-needs-some-magic-dust-to-fend-off-harry-potter-and-friends-20250523-p5m1lj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kellaway needs some magic dust to fend off Harry Potter and friends",
        "publish_date": "Sat, 24 May 2025 09:33:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "Things could get worse before they get better for the Waratahs with tough trips to Perth and Auckland over the next two Saturdays to face the Western Force and Blues.\n\nMathematically, the Waratahs are still a chance of making the playoffs, but in reality they are battling to avoid losing the last six games of their Super Rugby campaign.\n\nOn paper, the trip to Perth presents the best chance of doing this, although for senior Waratahs such as Andrew Kellaway, it also presents a chance to show some Wallabies form in the face of opposition in the west.\n\nKellaway has some capital in the bank after a good end-of-season tour during which he wore the Wallabies No.14 jersey in all four grand slam Tests, but he was already under serious pressure from the Force’s Harry Potter even before it was confirmed this week that Dylan Pietsch would be making his comeback for the Force on the left wing and that the Reds’ Filipo Daugunu had re-signed with Rugby Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/littleproud-s-trumpian-tactics-only-showcased-ley-s-strength-20250522-p5m1fi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Littleproud’s Trumpian tactics only showcased Ley’s strength",
        "publish_date": "Sat, 24 May 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jacqueline Maley"
        ],
        "text": "In 2003, the forthright British broadcaster Jeremy Paxman published a book called The Political Animal: An Anatomy in which he dissected the character and psyche of his journalistic prey: politicians.\n\nThe central thesis of the book was that politicians are not just another breed, they are an entirely different species. In the introduction, Paxman recounts being bailed up by Cherie Booth, wife of former British Labour prime minister Tony Blair, who asserted that journalists were not interested in the truth and were “only in it for the money” (I wish the latter were true).\n\nShe accused Paxman of believing “we’re all crooks”. As he pointed out, the “we” was interesting, given Booth was not, herself, a politician. Anyway, she was wrong, Paxman said. “I most emphatically do not believe that they are all crooks. Or even that they are all, always dishonest,” he wrote. “But they are different from us.”\n\nSussan Ley showed fortitude under pressure from National Party leader David Littleproud. Credit: Marija Ercegovac\n\nI was inspired to go back to Paxman’s book this week as I pondered the absolute nerves of steel of new Liberal leader Sussan Ley who, in the first weeks of her new job, navigated a Coalition split while nursing her dying mother and then planning a funeral.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/flight-attendant-says-duchess-of-sussex-gave-her-a-handwritten-note-20250524-p5m1uk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flight attendant says Duchess of Sussex gave her a handwritten note",
        "publish_date": "Sat, 24 May 2025 09:12:35 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Flight attendant says Duchess of Sussex gave her a handwritten note\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/emergency-crews-begin-water-land-and-aerial-search-for-pheobe-bishop-20250524-p5m1uh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Emergency crews begin water, land and aerial search for Pheobe Bishop",
        "publish_date": "Sat, 24 May 2025 08:57:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Emergency crews begin water, land and aerial search for Pheobe Bishop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-markle-shares-behind-the-scenes-of-confessions-of-a-female-founder-shoot-20250524-p5m1ue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan Markle shares behind the scenes of Confessions of a Female Founder shoot",
        "publish_date": "Sat, 24 May 2025 08:37:21 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan Markle shares behind the scenes of Confessions of a Female Founder shoot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/fans-go-off-after-anges-mic-drop-moment-20250524-p5m1ud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fans go off after Ange's 'mic drop' moment",
        "publish_date": "Sat, 24 May 2025 08:12:12 +1000",
        "category": "sports",
        "authors": [],
        "text": "Fans go off after Ange's 'mic drop' moment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/new-docu-series-to-be-released-by-prince-william-20250524-p5m1uc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New docu-series to be released by Prince William",
        "publish_date": "Sat, 24 May 2025 07:58:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "New docu-series to be released by Prince William\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/trophy-parade-20250524-p5m1u8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trophy parade",
        "publish_date": "Sat, 24 May 2025 07:38:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Trophy parade\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/flood-cleanup-efforts-begin-while-some-parts-of-nsw-still-underwater-20250524-p5m1u7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flood cleanup efforts begin while some parts of NSW still underwater",
        "publish_date": "Sat, 24 May 2025 07:33:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Flood cleanup efforts begin while some parts of NSW still underwater\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/trophy-in-hand-future-in-doubt-ange-s-joyful-uncertain-triumph-in-london-20250524-p5m1u0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trophy in hand, future in doubt: Ange’s joyful, uncertain triumph in London",
        "publish_date": "Sat, 24 May 2025 06:59:24 +1000",
        "category": "sports",
        "authors": [
            "Rob Harris"
        ],
        "text": "London: The crowd sang as if summoning something sacred. “When the Spurs go marching in,” they chanted – an old gospel melody reimagined for a modern football miracle.\n\nFlags whipped in the breeze, faces were painted in navy and white, and the High Road trembled with movement. From the fried chicken shops of Edmonton Green to the sleek facade of the new stadium, Tottenham was a city unto itself for one golden afternoon – a community momentarily suspended in joy.\n\nIt wasn’t just noise. It was release. After 17 years of waiting, Spurs had finally won a trophy. And the people who had waited – with crossed fingers, broken hearts, and half-muttered curses – spilled onto the streets to see it raised.\n\nAn open-top bus crawled along a route soaked in history and local pride. The players, medals gleaming in the light, waved down to a crowd that surged around them like a tide. They passed betting shops and nail salons, Victorian terraces and housing estates, kebab joints, boarded-up pubs, and ambitious new cafes. Tottenham – gritty, diverse, gentrifying and proud – was on parade alongside its team. This wasn’t just about soccer. It was about place, and pain, and perseverance.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/australia-s-italians-out-in-the-cold-as-rome-rewrites-citizenship-rules-20250515-p5lzbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia’s Italians out in the cold as Rome rewrites citizenship rules",
        "publish_date": "Sat, 24 May 2025 06:00:00 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "Rome: For decades, Australians with Italian heritage – some named after a nonna they never met, others raised on Sunday sugo and stories of the old country – have proudly clung to the idea of becoming citizens.\n\nFor many, it was more than nostalgia. It meant opportunity – to live, work and travel freely across Europe. But that door, for thousands, has now slammed shut.\n\nItalian senator Francesco Giacobbe, from Sydney, in his office in Rome this week. Credit: Flavio Brancaleone\n\nRome had long allowed direct descendants of citizens who lived in Italy as far back as 1861 to apply for a passport. But Giorgia Meloni’s right-wing government, elected in 2022 on a platform of national pride and conservative revivalism, has redrawn the boundaries of who gets to belong.\n\nIn March, Meloni’s cabinet issued an emergency decree that dramatically tightened eligibility and this week, the law was formally approved by parliament. The change restricts automatic citizenship rights to only those with at least one parent or grandparent born in Italy.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/young-girl-hit-by-car-at-pedestrian-crossing-20250523-p5m1sx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young girl hit by car at pedestrian crossing",
        "publish_date": "Sat, 24 May 2025 05:59:07 +1000",
        "category": "finance",
        "authors": [],
        "text": "Young girl hit by car at pedestrian crossing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-experiencing-the-hajj/1nov3u8vk",
        "title": "INTERVIEW: Experiencing the Hajj",
        "publish_date": "Fri, 23 May 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cows-dead-on-beaches-beehives-destroyed-locals-numb-after-nsw-flood-devastation/kh34rxr6x",
        "title": "Cows dead on beaches, beehives destroyed: Locals 'numb' after NSW flood devastation",
        "publish_date": "Fri, 23 May 2025 21:19:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in parts of the NSW mid-north coast were met with a shocking scene as dead cattle beneath debris washed up on beaches after being swept away in raging floodwaters.\n\n\n\n\n\nHeavy machinery is removing them from the sand, in a heartbreaking picture of what’s been lost in floods that have decimated the region this week.\n\n\n\n\n\nIt’s expected many more dead animals will be discovered as floodwaters recede further and the true toll is laid bare.\n\n\n\nREAD MORE NSW expected to face 'powerful' cold front with damaging winds after rain and floods\n\nFifth-generation dairy farmer James Neal from Oxley Island, just east of Taree, told SBS he knew of nearly a hundred local dairy farmers impacted.\n\n\n\n\n\n\"It's such a desperate situation, unprecedented in that any plan you had just went straight out the window,\" said.\n\n\n\n\n\n\"It’s been really stressful for everyone involved.\n\n\n\n\n\n\"This is going to take a huge mental toll on farmers for sure. It's upsetting.\"\n\n\n\nFarmers tried to move cattle to higher ground through raging floodwaters by foot and canoe. Source: Supplied / Laura Polson Emotions are still raw as the community grapples with the distressing loss of both animals and property.\n\n\n\n\n\nNeal was one of hundreds who also had to be rescued when water rose rapidly on Tuesday night, catching many off guard.\n\n\n\n\n\n\"I had to get rescued at our own house and there were so many calls, SES was so under the pump,\" he said.\n\n\n\n\n\n\"We had a friend rescue us and some other people up to their waist in water sitting on a table.\n\n\n\n\n\n\"All our houses for our staff went under water as well.\"\n\n\n\nDairy farmer James Neal spoke to SBS over Zoom as he remained cut off by floodwaters on Oxley Island. Source: SBS News Neal said many farmers in the area made contingency plans for moving stock to higher ground after major flooding in 2021, but those areas were under water by half a metre this week.\n\n\n\n\n\n\"In 2021, we had a flood that was recognised as one in 100. This year they're saying this is a one-in-500-year flood because all those areas that were normally flood-free are not flood-free anymore,\" Neal said.\n\n\n\n\n\n\"Cows just got washed away and basically got caught on fences. I've got heaps of photos of stock that has washed up and they're not even local ones, they've come from upriver where obviously people thought they were on flood free paddocks and they just weren't.\"\n\n\n\nAccording to WeatherZone, Oxley Island received 279 millimetres of rain on Tuesday alone, 500 millimetres over three days — equivalent to eight months’ worth of rain.\n\n\n\n\n\nNeal said they weren’t warned of the severity of the weather event, and modelling didn’t reflect how much rain ultimately came.\n\n\n\n\n\nHe and many more on the island have been isolated for days without power and struggling to tend to their livestock that have survived with feed washed away and equipment destroyed.\n\n\n\nLaura Polson feeding a calf as she stayed with her isolated property during flooding on Oxley Island. Source: Supplied / Laura Polson According to Neal, dairy cows also need to be milked every 24 hours, but that is proving a nearly impossible task in current conditions.\n\n\n\n\n\nLaura Polson, part of one of Oxley Island’s biggest dairy farming families, has also been isolated on her property, trying to keep animals alive.\n\n\n\n\n\n\"Sadly, a lot of calves have been lost but we were able to hoist this white calf up out of the water and have been feeding it bread, milk and weet-bix,\" she told SBS on Thursday.\n\n\n\n\n\n\"My dad, brother and sister have made huge efforts to protect our cows and calves on other parts of the island but it’s unknown how those cows are doing.\"\n\n\n\nA calf taking shelter on the veranda of Laura Polson's home as floodwaters raged around it on Thursday. Source: Supplied / Laura Polson\n\n'A few bad years now'\n\nCommercial beekeeper Colin Broos keeps hundreds of hives on Oxley Island and says he’s lost most of them in the flood.\n\n\n\n\n\n\"Pretty devastating. I've lost 40 to 50 per cent of my income. Just like that, gone.\"\n\n\n\n\n\n\"We had the droughts in 2019, we were all affected by bushfires, lost hives there, a lot of people did. Then we had the floods in ‘21, then we had Varroa Mite, and now we've got this. It's pretty tough.\"\n\n\n\nHe was ferried across flooded pastures on a friend’s boat to assess the damage to his hives.\n\n\n\n\n\n\"This is next level. We did not expect this. There were no warnings … nobody knew how bad this was going to get. It’s taken us by completely by surprise.\"\n\n\n\n\n\n\"We’re a bit numb at the moment actually.\"\n\n\n\nCommercial beekeeper Colin Broos says he doesn't know how his business will bounce back after more than 120 of his hives are washed away in the flood. Source: SBS News Other Oxley Island farmers like Lee Fieldhouse say it’s going to be a “tough winter” for everyone in the area.\n\n\n\n\n\n\"From an animal perspective, the pastures are in trouble and a lot of hay has been lost, the soil has been lost as well,\" Fieldhouse said.\n\n\n\n\n\n\"Because [the flood] is so late, it'll take a very long time to dry out this time of year.\n\n\n\n\n\n\"There's going to be a lot of people that have lost everything.\"\n\n\n\nLee Fieldhouse among locals using boats to get to their friends and neighbours, for rescues and to deliver supplies. Source: SBS News He has been reaching isolated friends by canoe, delivering supplies to keep spirits up.\n\n\n\n\n\n\"I've done the bread and milk run and beer and ciggies. All the essentials.\"\n\n\n\nLocals 'cut off' from medical care\n\nSherinah Peck is one of likely hundreds of people whose homes have been completely flooded and who have lost nearly everything.\n\n\n\n\n\nAlready facing the challenge of rebuilding a destroyed home, Peck was injured by a distressed cow while searching the beach for missing belongings that washed away during the flood.\n\n\n\nShe had to travel two hours south to hospital in Newcastle with a suspected broken leg, because the nearest public hospital in Taree was still cut off by floodwater.\n\n\n\n\n\n\"Taree is only 15 minutes away from where I live but I couldn’t get to that hospital,\" Peck said.\n\n\n\n\n\n\"I have to have surgery… for them to put in a plate and screws.\"\n\n\n\n\n\nThe lack of a public hospital in Forster-Tuncurry has been the subject of debate for several years.\n\n\n\nOn Friday, locals on Oxley Island continued using boats to rescue and assist residents still stranded by floodwaters. Source: SBS News On Tuesday, local member Tanya Thompson told SBS it was a serious problem.\n\n\n\n\n\n\"I called on the premier to do a stand up hospital in Forster because people in that area don’t have access to public health at the moment, that’s a concern,\" Thompson said.\n\n\n\n\n\n\"If something happens, where do they go? Our paramedics are stretched. We’re in a whole world of pain here.\n\n\n\n\n\n\"We don’t want any further trauma here; we are already traumatised enough.\"\n\n\n\nSherinah Peck suffered a leg injury after an encounter with a distressed cow on the beach. Source: Supplied\n\nSearching for lost items\n\nPeck has appealed to her community to look out for things that have been washed from her home, including one with deep sentimental value.\n\n\n\n\n\n\"I am after one particular item, that means the world to me and that’s my mum’s bike if anyone finds that I’ll be so grateful,\" she said.\n\n\n\n\n\n\"Her bike – Betsy – was everything.\"\n\n\n\n\n\nMany others have lost everything, and donations have begun to pour in to support those in need.\n\n\n\n\n\nFour people have died in the flooding disaster.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/could-australia-become-a-coffee-growing-nation/c65q6j5sk",
        "title": "Could Australia become a coffee-growing nation?",
        "publish_date": "Fri, 23 May 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe coffee’s steaming hot at the Happy Frog café in Coffs Harbour in northern NSW.\n\n\n\n\n\nThis cup is one of six billion consumed nationwide each year, according to Agrifutures Australia.\n\n\n\n\n\nUnlike most, this one is made with locally grown beans.\n\n\n\n\n\nThe cafe’s owner is Kim Towner:\n\n\n\n\n\n“That's been a real passion of mine since I first went into the cafe business, was to buy as close to home as I could. And it's just a win-win all round for everybody, I think. It's beautiful coffee. We get to know the people that have grown it. And that has been probably my biggest, favouritest thing. But of course it's got the low food miles, so it's good for the environment. I know its story.”\n\n\n\n\n\nAustralia grows less than half a percent of all the coffee we drink.\n\n\n\n\n\nProducing more sounds a great idea, but is it worth the effort?\n\n\n\n\n\nAt Southern Cross University in Lismore, Professor Tobias Kretzschmar is finding out by trialling new trees.\n\n\n\n\n\n“So we're part of a larger project with the World Coffee Research. They're interested in trialling 20 to 30 coffee varieties all around the globe. So we piggybacked on that global project to be able to trial those varieties in Australia. And our aim for Australia is to find new varieties that are better suited for this environment and better suited for the mechanized conditions of coffee farming in Australia.”\n\n\n\n\n\nMost Australian coffee grows in Queensland or northern New South Wales where farmers face climate challenges.\n\n\n\n\n\n“They put their money on a variety that's much too vigorous for this environment. So we're looking at something that's semi-dwarf, easy to be machine harvested. So the next stage would be to take the two to three varieties that we're thinking will out-compete the current varieties and trial them at scale.”\n\n\n\n\n\nGlobally, coffee exports spiked recently after a run of falls and prices remained volatile due to trade tensions and fears of economic slowdown.\n\n\n\n\n\nPaul Joules is a research analyst with Rabobank.\n\n\n\n\n\n“In April we did see Arabica prices ease slightly but nonetheless on a year-on-year basis we're still around 100% higher.”\n\n\n\n\n\nAnd that means ever-rising prices at the coffee shop. So could Australia ever compete with Brazil or Colombia?\n\n\n\n\n\nProfessor Tobias Kretzschmar again:\n\n\n\n\n\n“We’re covering around half a percent of what the Australian consumer is drinking at the moment. If we can double that, that'd be fantastic. If we can triple or quadruple that, we'd be punching above our weight.”\n\n\n\n\n\nIt’s also about finding a coffee style with broad appeal. For clues, scientists have turned to a unique taste wheel which helps analyse the makeup of a particular taste.\n\n\n\n\n\nDr Ben Liu is behind the taste wheel.\n\n\n\n\n\n“First we actually have this coffee tasting by different professionals. They work in the coffee industry for decades. And then we actually collect a different type of data from them and from description from them. And then we summarise them with also some of the score for the taste and the flavour of the coffee. And then we bring the exact same sample they taste back to our lab and do carry out analysis. And so we can associate the data from the chemistry also to the taste and the smell of the coffee.”\n\n\n\n\n\nThe taste wheel doesn’t just identify the flavour of the coffee, but its character as well and uses words as diverse as ‘yoghurty’, ‘apple like’ and even dirty.\n\n\n\n\n\n“ So this coffee character wheel basically helps the panel members to actually get an idea of what they think, what could be used to describe the taste, the flavour, or a different mouthfeel they actually feel. But saying that there are some bad words there because there are also some bad taste coffee there. Unfortunately, during our coffee research, (we not just taste the best coffee, we also taste bad coffee as well.”\n\n\n\n\n\nBut Dr Liu says Australian grown coffee does have some common characteristics:\n\n\n\n\n\n“We collect 100 single-origin coffee around Australian farmers. And when we run this tasting panel, the words that keep coming out for Australian coffee are they are sweet and they are fruity and they are nutty and roasty. So that's the thing that's coming up the most for Australian coffee.”\n\n\n\n\n\nFor Kim Towner, the decision to use locally grown coffee was simple.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-search-for-australias-stillborn-babies/6e2a7dj5c",
        "title": "No death certificate, no funeral: Why some families can't find their deceased children",
        "publish_date": "Fri, 23 May 2025 20:34:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "When a woman knocked on Geoffrey Horlock's door and told him that her baby brother had been buried in the same grave plot as his own brother, he was more than a little surprised.\n\n\n\n\n\n\"I was not sure what to say at first,\" Horlock says.\n\n\n\n\n\nHis brother Andrew had been stillborn in 1960. Horlock was around nine at the time.\n\n\n\n\n\nHe recalls his mother telling him about how his brother was taken out of the delivery room in a white sheet and buried in the local cemetery while she was still recovering in hospital.\n\n\n\n\n\nThis is how infant loss was often dealt with in the 1960s.\n\n\n\n\"Mum never got over it,\" Horlock says.\n\n\n\nRight until the day she died, she always used to say: 'I wonder which side of the family he looked like.'\n\nThe family was issued a birth certificate and told about the burial site.\n\n\n\n\n\nBut this was not always the case.\n\n\n\n\n\nFor the Harding family, whose baby died less than three weeks after the Horlocks' in the same regional Western Australian town, no birth certificate was issued.\n\n\n\n\n\nUnlike baby Horlock, baby Harding was live-born but arrived prematurely and tragically did not survive.\n\n\n\n\n\nUnbeknownst to both families, he was buried alongside baby Horlock in the lower part of his grave plot in August 1960.\n\n\n\n\n\nIt wasn’t until baby Harding’s older sister, Susan Mead, showed up on Geoffrey Horlock's doorstep some 65 years later that the connection was finally made.\n\n\n\nSusan Mead tracked down one of the siblings of Andrew Horlock, whose grave her baby brother shares, to another small town near where she lives. Source: Supplied She had come to ask whether she could place a marking on the grave to recognise her brother.\n\n\n\n\n\nHorlock says once the initial shock passed, he realised there was only one answer.\n\n\n\nFinding Baby Harding\n\nMead lives on a property in the south-west of WA, about 65km east of the small town of Bridgetown where her mother gave birth to baby Harding. Mead and her siblings had spent decades hoping to find their baby brother’s resting place.\n\n\n\n\n\nBut without formal documentation, such as a birth or death certificate, their efforts to find him were continually stymied.\n\n\n\n\n\nFinally, in March, they reached a turning point.\n\n\n\n\n\nMead's sister-in-law spotted a Facebook post from the Shire of Bridgetown-Greenbushes, about records for the nearby Bridgetown Cemetery having been uploaded to its website.\n\n\n\n\n\nLooking over the shire's list of people buried there, Mead came across a mention of a 'Baby Harding'. That name had not been included in previous searchable listings for the cemetery.\n\n\n\n\n\nIt identified the exact location of the grave, too, but when family members went to visit, they found a gravestone for baby Horlock instead.\n\n\n\n\n\nConfused, the family contacted Bridgetown-Greenbushes Shire, which manages the cemetery. They confirmed that baby Harding is also buried in the plot, which, according to records, had been divided in two — a practice that the local government has since ceased.\n\n\n\nIn a statement to SBS News, a spokesperson for the shire acknowledged the challenges with historical burial records for stillbirths and neonatal deaths, noting it is \"currently completing an audit and correlation of hardcopy documents, current headstones and electronic records\" to ensure it has a fully digitised and accurate record of all listings.\n\n\n\n\n\nThe spokesperson says the shire is aware of one other case in which two unrelated babies were buried in the same plot, dating back to 1954. In that case, two stillborn babies were buried in the same plot eight weeks apart, despite records showing it was not listed as a 'half plot'.\n\n\n\n\n\n\"The Shire is committed to ensuring this information is researched and updated so that descendant family members can search for and locate loved ones,\" the spokesperson says.\n\n\n\nA taboo subject\n\nMany families who lost babies as a result of stillbirth or neonatal death before the 1980s in Australia remain in the dark about their loved one’s final resting place.\n\n\n\n\n\nJoan Noonan is a volunteer co-leader with a group set up by Red Nose Australia, which seeks to prevent the sudden and unexpected death of babies and young children and gives bereavement support for those affected by death of a baby or young child. Its 'Older Loss Group' supports mothers who are still processing the grief of stillbirth years after losing a child.\n\n\n\n\n\nOne of the key aims of the group, which is based in Victoria, is to help families in tracking down burial sites.\n\n\n\n\n\nNoonan says many families search for the final resting place of their stillborn family members in the hope of finding some peace.\n\n\n\n\n\nThe 78-year-old became part of the Older Loss Group about 30 years ago, having lost two infant daughters of her own in the 1970s.\n\n\n\nJoan Noonan, (pictured far right) has helped many women, including Lee (second from left), to find their baby's burial site, years after their loss. Source: Supplied / Red Nose Australia \"In most cases, you weren't given a chance to have a funeral,\" she says.\n\n\n\n\n\n\"The hospital staff would say they were 'looking after these babies', and the hospital would arrange burial and families weren't even told where they were buried.\"\n\n\n\n\n\nNoonan says at that time, it was not the \"done thing\" to question the process. Stillbirth was treated as taboo.\n\n\n\nNobody talked about the death of a baby.\n\n\"In the majority of cases, they were buried in communal graves, they often waited for about 10 babies at a time and there's some places in Melbourne where there's hundreds of babies buried in mass graves.\"\n\n\n\n\n\nNoonan’s volunteer co-lead, Fotini Koklas, says given most babies they have located via the Older Loss Group are in mass graves, the situation involving the Hardings and the Horlocks appears to be \"extremely rare\".\n\n\n\n\n\nKoklas has come across one similar case in which a baby was buried in a grave with an unrelated adult, with no clear explanation as to why this happened.\n\n\n\n\n\n\"It's possible that it was a space issue, or perhaps the cemetery simply didn't know where to place the baby,\" she says.\n\n\n\nCo-leader of Red Nose Australia's Older Loss Group, Fotini Koklas, says while the process of finding a baby’s final resting place should be a healing journey, unnecessary obstacles can make it more emotionally draining than it should be. Source: Supplied\n\nIn search of lost babies\n\nUntil this year, baby Harding's name would have only have been traceable via handwritten records stored in a very specific location by the Bridgetown-Greenbushes shire.\n\n\n\n\n\nKoklas says because of state-based variations in laws, record systems and how stillbirths are handled, it can be incredibly challenging for families to track down accurate information.\n\n\n\n\n\n\"Every cemetery is different, and the level of detail they have in their historical records varies greatly,\" she says.\n\n\n\nHistorically, different stakeholders that may have details that could help families were very siloed from one another.\n\n\n\n\n\n\"There's often a breakdown in communication between cemeteries, stonemasons, and families, in some cases, critical details aren't shared — either because of incomplete records or administrative oversights.\"\n\n\n\n\n\nKoklas says the passage of time complicates the process further.\n\n\n\n\n\n\"Over the decades, cemetery management has often changed hands, record-keeping systems have evolved, and unfortunately, some older records have been lost, damaged, or simply never kept in the first place — especially for babies born before the 1980s.\"\n\n\n\nInconsistent records\n\nInaccurate and inconsistent historical records present an added hurdle for those searching for answers.\n\n\n\n\n\nKoklas explains that naming stillborn babies was subject to variation: they could be recorded with their mother's maiden name or married name, or referred to as names such as: \"Baby Smith,\" \"Stillborn Smith,\" or \"Baby of Kate Smith\".\n\n\n\nLISTEN TO \"I found it to be really lonely': Data show parents often silent after miscarriage or stillbirth SBS News 13/10/2023 04:38 Play\n\n\"While families can sometimes search online for burial records, the transition from handwritten paper records to digital systems has introduced a number of issues,\" she says.\n\n\n\n\n\n\"Dates are often misrecorded due to difficulties in reading old handwriting.\n\n\n\n\n\n\"In one case, a baby who passed away in April 1966 was entered into the system as April 1968.\"\n\n\n\n\n\nNoonan says despite such challenges, it's often still possible to piece information together by cross-referencing available records, contacting multiple sources and a bit of compassionate persistence.\n\n\n\n\n\n\"We've developed some records now that show in Victoria what hospitals used what undertakers and then what cemeteries they used and things like that,\" she says.\n\n\n\n'Something to be forgotten'\n\nIn years gone by, a birth may not have even been considered a birth if the baby was stillborn, so no birth or death certificate was issued. This also meant that protocols around burial fell outside of legal requirements.\n\n\n\nSource: SBS News The statutory instruments and registration practices related to births and perinatal deaths — which include stillbirths and neonatal deaths — have varied between Australian states and territories over the years.\n\n\n\n\n\nFor example, in Queensland and Victoria, legislation around the registration of stillbirths came into place in 1989, while in NSW it was a 1995 Act that recognised stillbirth as a birth and therefore required formal registration.\n\n\n\n\n\nAssociate professor Fran Boyle from the University of Queensland's Institute for Social Science Research and Stillbirth Centre of Research Excellence says it was not until the mid-1980s that social attitudes toward perinatal deaths began to change.\n\n\n\n\n\n\"This was largely due to the voices of bereaved parents,\" she explains.\n\n\n\n\n\nParent advocacy groups under the banner of Stillbirth and Neonatal Death Society (SANDS) — now part of Red Nose — were formed.\n\n\n\n\n\n\"One of their many important achievements was the successful campaign for government to recognise stillborn babies through birth and death certificates,\" Boyle says.\n\n\n\n\n\nToday, across Australia, a stillborn baby at 20 weeks gestation or more is required to be registered, in most states and territories that will warrant a birth certificate, noting stillbirth.\n\n\n\nSource: SBS News Boyle says burial practices tend to reflect the \"prevailing social norm\" of the time, and before the 80s \"the loss of a baby was something to be forgotten\".\n\n\n\n\n\n\"[It was] not something to be discussed or memorialised.\"\n\n\n\nLiving with the trauma\n\nBoyle says such sentiment informed the practice of withholding stillborn babies from their mothers.\n\n\n\n\n\nMany were never given the chance to look at or hold their children.\n\n\n\n\n\n\"The widely held view was that parents needed to be protected, that seeing their baby, having contact with their baby, creating memories of any kind would be harmful, and intensify and prolong their grief,\" Boyle says.\n\n\n\n\n\nHorlock still remembers his mother returning from hospital after giving birth without his baby brother.\n\n\n\nGeoffrey Horlock's recalls how his mother was deeply impacted by not only the loss of her baby, but by the process around the loss in not being able to hold her baby or say goodbye. Source: Supplied He says she spent days sitting by the wood fire stove in their kitchen, just staring at the fire.\n\n\n\n\n\n\"Mum was distressed about it and it troubled her her whole life,\" he says.\n\n\n\n\n\nMuch has changed since laws recognising the births of stillborn babies were strengthened.\n\n\n\n\n\nThe national Care Around Stillbirth and Neonatal Death guidelines, updated in 2024, cover best practice for stillbirth and recommend offering all parents the opportunity to see and hold their baby immediately after birth and allowing them to interact with their baby through activities such as bathing and dressing them.\n\n\n\n\n\nKoklas has seen the benefit of these changes firsthand. As well as being involved in helping to find baby graves, she is a bereaved mum. Her two baby boys died in 2011 and 2016.\n\n\n\n\n\n\"I am so grateful I got to hold my babies, name them and make funeral arrangements for them,\" she says.\n\n\n\nA healing process\n\nFor those who lost children in decades gone by, the hope of finding their graves remains.\n\n\n\n\n\nKoklas says every family she has supported to locate their baby has shared a similar feeling: a deep sense of peace and closure.\n\n\n\n\n\n\"Finding a baby's final resting place is one of the most healing and powerful experiences … it's something that goes beyond words, like a heavy weight being lifted.\n\n\n\nIt doesn't mean they've 'moved on' — because grief doesn't work that way — but they feel like they can now live again, just a little bit lighter.\n\nSimilarly, Noonan attests to the importance of finding burial sites. She says while the Older Loss Group has helped to locate hundreds of babies, there are still so many more Australian families out there wishing they knew where their babies were.\n\n\n\n\n\nShe encourages anyone needing help in their search to reach out, saying: \"it's never too late\".\n\n\n\nREAD MORE Australia is running out of space to bury people. This may be the alternative\n\nAn investigation of historical practices associated with stillborn babies and perinatal infant loss in Australia before the 1980s has never been undertaken.\n\n\n\n\n\nThe federal attorney-general's department did not respond to questions put by SBS News about whether the government plans to conduct a national investigation or apology into the matter.\n\n\n\n\n\nAt least for Mead and the Harding siblings, there is some long-awaited closure — and the chance to place a commemorative plaque on the plot their baby brother shares with baby Horlock.\n\n\n\n\n\nGeoffrey Horlock says he and his siblings decided to place a headstone on the grave a number of years ago after both their parents had died as a way to honour their mother.\n\n\n\nArrangements are being made to have a plaque placed on the lower part of Andrew Horlock's grave to acknowledge it is also the grave of 'Baby Harding.' Source: Supplied He says his mother would have loved for that to have happened in her lifetime.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/fernwoods-biologically-born-females-policy-and-trans-women/dc2gpvpeb",
        "title": "Elara wanted a safe space to work out. Fernwood said it was for 'biologically born females'",
        "publish_date": "Fri, 23 May 2025 20:34:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Elara was \"caught off guard\" and \"hurt\" when she was denied entry to the women-only gym Fernwood Fitness for not being a \"biologically born female\".\n\n\n\n\n\nA Melbourne-based transgender woman, Elara was drawn to a club owned by the national gym network because her wife and friends had recommended it. She also generally found women's spaces to be more inclusive and accepting of trans women than mixed spaces.\n\n\n\n\n\n\"I think it's a lot easier for trans women in women's spaces, fundamentally,\" Elara told SBS News. \"My experience has been that women's spaces are more accepting.\"\n\n\n\n\n\nBut when she enquired via text message about whether she would be permitted access as a transgender woman, she was told by a manager at Fernwood Fitness in Melbourne that \"the Fernwood company policy is not inclusive of transgender women\".\n\n\n\nElara received a message from a manager at a Melbourne Fernwood Fitness gym, who said only \"biologically born females who identify as female\" could join the women-only gym. Source: Supplied Fernwood Fitness is one of the leading women-only gym chains in Australia. They have over 70 clubs across Australia and over 90,000 members.\n\n\n\n\n\n\"Fernwood offers membership only to biologically born females who identify as female,\" the message, which has been verified by SBS News, read.\n\n\n\n\n\nElara later shared her experience on Reddit, prompting an outpouring of support — and several anonymous accounts from other transgender women who claim they too were turned away by Fernwood.\n\n\n\n\n\n\"I found this out last year when I tried to join,\" one user wrote.\n\n\n\n\n\nAfter the text exchange, Elara said she was phoned by the national CEO of Fernwood, which the company has confirmed.\n\n\n\n\n\n\"I was just flabbergasted,\" Elara said. \"My experience of being a trans woman so far in Melbourne has been that the level of vitriol and pushback and rejection that we expect from watching the news isn't there.\"\n\n\n\n\"I guess I got a little bit forgetful that the world is still like that,\" Elara said.\n\n\n\n\n\n\"It really took me aback and made me think about all the rights that we think we have here ... to just find out that some people can be like, 'nah,' that company policy is to just say no.\"\n\n\n\nIs it legal to exclude trans women from women-only spaces?\n\nThe federal Sex Discrimination Act 1984 makes it unlawful to treat someone unfairly because of their sex, sexual orientation, intersex status, or gender identity.\n\n\n\n\n\nAccording to the Australian Human Rights Commission (AHRC), gender identity includes \"the way people express or present their gender and recognises that a person's gender may be an identity other than male or female\".\n\n\n\n\n\n\"Terms commonly used to describe a person's gender identity include trans, transgender and gender diverse,' AHRC's website reads. \"It does not matter what sex a person was assigned at birth or whether the person has undergone any medical intervention.\"\n\n\n\n\n\nProfessor Paula Gerber, an expert in human rights law at Monash University, said while women-only gyms are lawful both in Victoria and nationwide, excluding trans women is not.\n\n\n\n\n\n\"Fernwood is perfectly entitled to have a women-only gym,\" she told SBS News. \"But women include trans women in Australia.\"\n\n\n\nPaula Gerber, a professor in human rights law at Monash University, said that while women-only gyms are lawful in Australia, excluding trans women from them is not. Source: Getty / Kazuma Seki \"It is not lawful to have a women's only venue and say that's only for people who were described as female on their birth certificate,\" Gerber said.\n\n\n\n\n\n\"The law says trans women are women.\"\n\n\n\n\n\nEvery Australian state and territory has its own anti-discrimination laws that operate alongside federal legislation.\n\n\n\n\n\nIn Victoria, where Elara lives, it's against the law to discriminate against people based on gender identity \"that may or may not be the same as the sex you were designated with at birth\", under the Equal Opportunity Act 2010.\n\n\n\n\n\nBut organisations are permitted to apply for temporary exemptions to the Act, which allows discrimination of any protected characteristics — which include gender identity — to be lawful, provided it would help the Act's goal of promoting equal opportunity.\n\n\n\n\n\n\"For example, some clubs may provide benefits for members of particular age groups or single sex,\" according to the Victorian Equal Opportunity and Human Rights Commission's website.\n\n\n\nFernwood is perfectly entitled to have a women-only gym. But women include trans women in Australia. Paula Gerber, human rights law expert\n\nIn 2021, Fernwood sought an exemption from Queensland's Anti-Discrimination Act 1991, concerned about members' religious freedom and psychological safety, as well as fears that their women-only fitness model \"could give rise to a complaint by a man that Fernwood is directly discriminating against men\".\n\n\n\n\n\nThe commission granted the exemption for five years, saying female-only fitness clubs were a \"welfare\" and \"equal opportunity\" measure.\n\n\n\nIt's unclear on what grounds Fernwood Fitness is excluding trans women, but at present, their publicly available 11-page membership terms and conditions do not reference sex or gender eligibility criteria.\n\n\n\n\n\nAdditionally, they operate under a franchise model, making it difficult to ascertain how widespread their policy is.\n\n\n\n\n\nSBS News has contacted Fernwood for clarification on this issue but has not received a response.\n\n\n\nFernwood defends policy as necessary for 'emotional and physical safety'\n\nIn a statement provided to both SBS News and Elara, Fernwood Fitness said they had \"a responsibility to consider the needs of its broader member community\", adding that female-only spaces \"based on sex\" were necessary to protect members' \"emotional and physical safety\".\n\n\n\n\n\n\"Fernwood Fitness proactively reached out to Elara to acknowledge her as an individual and to talk about her experience,\" the statement provided to SBS News read.\n\n\n\nREAD MORE Government announces federal review into gender-affirming healthcare for young people\n\n\"This outreach was made with genuine care, recognising the personal nature of her enquiry,\" the statement read.\n\n\n\n\n\n\"Fernwood appreciates the courage it can take to enquire about a membership as a transgender woman and acknowledges that the experience may have been hurtful or disappointing. Fernwood Fitness extends its sincere empathy in response.\n\n\n\n\n\n\"At the same time, Fernwood Fitness has a responsibility to consider the needs of its broader member community.\n\n\n\n\n\n\"A significant number of Fernwood Fitness members come from backgrounds where experiences of domestic violence, sexual assault, cultural beliefs, or religious practices necessitate access to female-only spaces based on sex.\n\n\n\n\n\n\"For many of these women, such spaces are not a preference but a requirement for their emotional and physical safety and for accessing the health and fitness services they need.\n\n\n\n\n\n\"This is not a reflection on personal identity, but rather a commitment to maintaining the integrity of a space that many women rely on. Fernwood is currently reviewing all relevant legal requirements.\"\n\n\n\n'Trans women are women', legal expert says\n\nGerber said these arguments may not hold legal weight when used to exclude trans women.\n\n\n\nPaula Gerber, a professor of human rights law at Monash University, said Fernwood's argument may not hold legal weight when used to exclude transgender women. Credit: Paula Gerber \"Women include trans women in Australia — that's very clear from the decision in Tickle and Giggle and the Lesbian Action Group,\" Gerber said.\n\n\n\n\n\nTickle v Giggle was a case centred on transgender woman Roxanne Tickle being denied access to a women-only app, Giggle for Girls. The Federal Court found the app had indirectly discriminated against Tickle based on her gender identity, a breach of the Sex Discrimination Act 1984.\n\n\n\n\n\nThe Federal Court ruled: \"The acceptance that Ms Tickle is correctly described as a woman, reinforcing her gender identity status for the purposes of this proceeding, and therefore for the purposes of bringing her present claim of gender identity discrimination, is legally unimpeachable.\"\n\n\n\nSupporters of Roxanne Tickle hold a sign outside the Federal Court of Australia in April 2024. TERF stands for 'trans-exclusionary radical feminist'. Source: AAP / Bianca De Marchi In 2023, the Lesbian Action Group applied for an exemption from the Sex Discrimination Act to host regular publicly advertised 'lesbians born female only events'.\n\n\n\n\n\nGerber, who acted as an expert witness for the AHRC, said the group argued they needed to be protected from, as she puts it, \"men pretending to be women\".\n\n\n\n\n\nThe commission rejected the application for exemption, saying: \"The commission is not persuaded it is appropriate and reasonable to make distinctions between women based on their biological sex at birth or transgender experience, and to exclude transgender lesbians, from a community event of this kind.\"\n\n\n\n\n\nGerber said: \"The response from the Human Rights Commission and the [Federal Court] tribunal is that the threat is not from trans women. The threat is from men.\"\n\n\n\n\n\nShe said these cases may influence what the law says about Fernwood's exclusion of trans women: \"That's contrary to what the law says — the law says trans women are women.\"\n\n\n\nTrans safety in women's spaces\n\nElara said one of the most upsetting parts of the conversation was the implication that she, as a trans woman, might pose a safety threat.\n\n\n\n\n\n\"People who are saying that we need to exclude trans women for safety aren't really talking about women's safety. They're talking about an ideological position about whether or not trans women are women,\" she said.\n\n\n\n\n\nA spokesperson from Zoe Belle Gender Collective (ZBGC), a trans and gender diverse-led advocacy organisation based in Victoria, told SBS News: \"Trans women and cis women have much in common, including being disproportionately impacted by men's violence.\"\n\n\n\n\n\n\"The same drivers of violence that impact cis women equally drive violence against trans women, including rigid gender norms and dominant forms of masculinity,\" a ZBGC spokesperson said.\n\n\n\nA La Trobe University study found transgender and non-binary people were more likely to experience high psychological distress than cisgender people. Source: SBS News Trans women, trans men and non-binary people were also more likely to experience very high psychological distress compared to cisgender women and men, according to La Trobe University's Private Lives 3 report from 2021.\n\n\n\n\n\nA 2023 survey of 3,099 transgender people conducted by the Trans Justice Project and the Victorian Pride Lobby found one in two participants had experienced anti-trans hate. One in ten had experienced anti-trans violence, and nine in ten had witnessed online anti-trans abuse.\n\n\n\nTrans women and cis women have much in common, including being disproportionately impacted by men's violence. Spokesperson, Zoe Belle Gender Collective\n\nInternationally, a 2021 study by the Williams Institute at the University of California, Los Angeles School of Law found transgender people were over four times more likely to experience violent victimisation than cisgender people, or those whose gender identity corresponds with the sex assigned to them at birth. This included higher rates of violence than both cisgender men and women.\n\n\n\n\n\nMeanwhile, analysis by the Australian Bureau of Statistics found 97 per cent of all sexual assault offenders were male, according to data recorded by police agencies in Australia.\n\n\n\n\n\n\"When incidents of trans exclusion occur, it can reinforce the ideas that we don't belong, that we are not worthy of support, or that the violence perpetuated against our community does not matter,\" a ZBGC spokesperson said.\n\n\n\n\n\n\"These incidents may also contribute to some trans women feeling unsafe to access the services our society has created to support victims of violence.\"\n\n\n\nLISTEN TO 'A really dark place': Chantel is among LGBTIQ+ users fearful of Meta's changes SBS News 22/02/2025 06:45 Play\n\n'Trans women are not a threat'\n\nGerber also warned policies excluding trans women can lead to harmful \"policing\" of women's bodies.\n\n\n\n\n\n\"The privacy that's being violated is trans women having to prove their gender,\" she said.\n\n\n\n\n\n\"We're seeing situations where complete strangers feel entitled to challenge someone's right to be in a space, based solely on how they look.\n\n\n\n\n\n\"This is what we need to avoid.\n\n\n\n\n\n\"If somebody says they’re a woman, then they are a woman.\"\n\n\n\n\n\nShe also questioned traditional narratives that trans women were threats to women's safety.\n\n\n\n\n\n\"Men pretending to be women so that they can get into a women's only gym and assault someone … that's not what trans women are doing,\" Gerber said. \"Trans women are just trying to be themselves and live their authentic life. They're not a threat.\"\n\n\n\n'We thought we were better protected'\n\nGerber said while Australia has some of the strongest legal protections for trans rights in the world, enforcing these laws can involve making an individual complaint to your state's commission.\n\n\n\n\n\n\"It takes a huge toll to take on a big company like Fernwood,\" she said.\n\n\n\n\n\n\"But that's the only way the law gets enforced in these situations where there are breaches of the anti-discrimination provisions.\"\n\n\n\n\n\nFor Elara, the experience has left her feeling disillusioned with the protections she thought were in place.\n\n\n\n\n\n\"I did think we were better protected in Australia … we thought our legal protections were stronger than apparently they are.\n\n\n\n\n\n\"It feels strange when the discrimination paraded in the news contaminates my own life so directly. I wandered into someone's culture war because I wanted to try yoga.\"\n\n\n\n\n\nLGBTIQ+ Australians seeking support with mental health can contact QLife on 1800 184 527 or visit qlife.org.au . ReachOut.com also has a list of support services.\n\n\n\n\n\nIntersex Australians seeking support can visit Intersex Peer Support Australia at isupport.org.au.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/reconciliation-week-is-bridging-the-past-and-future-for-first-nations-australians/el62a1gwd",
        "title": "Reconciliation Week is bridging the past and future for First Nations Australians",
        "publish_date": "Fri, 23 May 2025 08:10:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA celebration of strength and resilience, aimed to foster understanding and respect for Aboriginal and Torres Strait Islander people.\n\n\n\n\n\nEvery year, from 27 May to 3 June, Australians are presented with the opportunity to learn more about the nation’s shared histories, cultures and achievements.\n\n\n\n\n\nThese dates commemorate two significant milestones in the reconciliation journey and the nation's history.\n\n\n\n\n\nJohn Paul Janke is NITV's National Indigenous Affairs Editor and host of NITV's flagship program, The Point.\n\n\n\n\n\n\"One of course is the successful 1967 referendum, which for the first time included voted to include Aboriginal people within our senses. And the second one is the High Courts Mabo decision on June the third, which ended the legal fiction of Terra Nullius that when the British arrived here, that this land belonged to no one. So there two key dates that mark Reconciliation Week, and I encourage as many people as I know and everyone who's listening to learn more about those two dates.\"\n\n\n\n\n\nNational Reconciliation Week started as the Week of Prayer for Reconciliation in 1993 - which also happens to be the International Year of the World’s Indigenous Peoples.\n\n\n\n\n\nThis was supported by Australia’s major faith communities.\n\n\n\n\n\nIn 1996, the Council for Aboriginal Reconciliation launched Australia’s first National Reconciliation Week.\n\n\n\n\n\nIn 2001, Reconciliation Australia was established to continue to provide national leadership on reconciliation.\n\n\n\n\n\nIn the same year, approximately 300,000 people walked across Sydney Harbour Bridge as part of National Reconciliation Week - and subsequently across bridges in cities and towns - to show their support for reconciliation.\n\n\n\n\n\nToday, National Reconciliation Week is celebrated in workplaces, schools and early learning services, community organisations and groups, and by individuals Australia-wide.\n\n\n\n\n\nProfessor Jackie Huggins is a prominent historian, academic and Bidjara and Birri Gubba woman with the University of Queensland.\n\n\n\n\n\nHer mother Auntie Rita Huggins was a key campaigner in the 1967 referendum, of which the Aboriginal and Torres Strait Islander people received an overwhelming vote of over 90 per cent from the Australian public in favor of being included in the census.\n\n\n\n\n\n\"National Reconciliation Week is always a week to really feel excited about, but at the same time we know that there's a long way to go. While we see all these very positive things happening in our communities, there's still a lot of negatives that we have to fight against and we have to be vigilant of to get justice for our people.\"\n\n\n\n\n\nProfessor Huggins says the dial hasn't moved in terms of closing the gap, and is taking a very, very long time.\n\n\n\n\n\n\"It will take hundreds of years to reach any kind of parity with non-Indigenous Australians across all those levels. There's been here in Queensland, the tried treaty and truth telling programs that we've had and they've been dismissed by governments.\"\n\n\n\n\n\nBut she says First Nations people are still making sure that they continue their long overdue and hard fought justice programs.\n\n\n\n\n\n\"There hasn't been a let up in children going into care, foster homes or other care. It also, particularly around criminal justice system and with our young folk in jail. So there's a continuum of what needs to be done - housing, education, employment, the usual things that plague Aboriginal and Torres Strait Islander people's lifestyle.\"\n\n\n\n\n\nShe says the theme this year Bridging Now to Next is very significant because it's the 25th anniversary of the bridge walk around Australia.\n\n\n\n\n\n\"Here in Brisbane it was about 80,000 people that walked and people who've walked in localised their localised areas for reconciliation. So that's been massive support for us. Right now we have a lot of young people who still have fire in their belly.\"\n\n\n\n\n\nProfessor Huggins says they want to see big changes come within their own lifetime as well.\n\n\n\n\n\n\"For those of us have been in a struggle for a long time over decades. For me it's 45 years. We do want to hand over the baton and make sure young people step up to become the next because we have long endured massive changes. But also with that we've had some good political gain, but not nearly enough to close any gap in our country.\"\n\n\n\n\n\nThis year, the Australian National Maritime Museum will mark Reconciliation Week 2025 with an installation of the 12 turtle shells hand-painted by Torres Strait artist Gail Mabo around the deck of the Endeavour.\n\n\n\n\n\nOn June 11th, 1770, Lieutenant James Cook's ship, the Endeavour, ran aground on a coral reef in Far North Queensland.\n\n\n\n\n\nIt happened in a part of the Sea Country that the Guugu Yimithirr people have ancestral kinship responsibility to oversee. The reef is also a part of the traditional Sea Country of several Eastern Yalanji Aboriginal clans ((including the Wyamburr, Yuki Baja-Muliku, Kuku Bididji, Kuku Yalanji, and Kuku Nyungkul)).\n\n\n\n\n\nMatt Poll is the Manager of Indigenous Programs at the museum.\n\n\n\n\n\n\"They ended up spending about six weeks there, and there was all these different sorts of interactions that happened. But one of the most significant that Cook and Banks and the other people in the Endeavour talk about is when some people from the Guugu Yimithirr people came onto the boat one day and when they looked around the boat, they were horrified because they saw that there was all these turtles, full size turtles, which had been taken at the wrong time of the year and taken from a sacred breeding ground for turtles.\"\n\n\n\n\n\nHe says the Indigenous group saw this as a huge transgression.\n\n\n\n\n\n\"It's literally like walking into a supermarket, not paying for anything. So they were confronted by the local community for breaking the law and that was the catalyst for this, a series of events which happened when they went ashore next time Cook and his men, the Guugu Yimithirr people, they burnt some ground and Cook fired at one of the local people as well in that incident.\"\n\n\n\n\n\nAs someone who prioritises contemporary First Nations voices across collections and exhibitions, Mr Poll is really proud to be able to have an installation from Gail Mabo - the daughter of land rights activist Eddie Mabo.\n\n\n\n\n\nHe says they have virtual excursions available for school students who can't make it in person.\n\n\n\n\n\n\"On Monday, we have our virtual excursions for school students. Any school student around the state can dial in. You can find about this on our webpage. And we're doing a big presentation. Usually we get several hundred students and this virtual excursion will be about the history of Reconciliation week in Australia and practical stories of reconciliation around the country.\"\n\n\n\n\n\nThey will also have a rooftop projection as part of the Vivid Festival.\n\n\n\n\n\nJohn Paul Janke says the history of National Reconciliation Week goes back to the early 1990s.\n\n\n\n\n\n\"Around 1991, there was a Royal Commission into Aboriginal deaths in custody. And one of the recommendations was that from that was that there needs to be a sort of reconciliation to address Indigenous advantage in Australia. So from that recommendation came a 10 year process working towards reconciliation, working towards repairing the relationship between Indigenous and non-Indigenous people of this country, move now ahead to 2025, and that idea of reconciliation and really finishing the unfinished business.\"\n\n\n\n\n\nHe says they hoped that they would achieve reconciliation by 2001, which was the centenary of Federation here in Australia.\n\n\n\n\n\n\"It's taken a bit longer, but that theme is still current, that they're looking for a united Australia that respects this land for everyone, but also values Aboriginal and Torres Strait heritage and history and people as part of the Australian nation.\"\n\n\n\n\n\nHe says this year's theme really builds on a keystone anniversary for the reconciliation movement.\n\n\n\n\n\n\"It's 25 years since the famous Sydney Harbour Bridge Walk for Reconciliation. 2000 was a pinnacle year for that 10 year process from 1991 to really build a people's momentum towards reconciliation. And that colonised in a walk of over 250,000 people across Sydney Harbour Bridge and really highlighted that people had prioritised the need for reconciliation in this country.\"\n\n\n\n\n\nHe believes this year's National Reconciliation Week wants to build on that momentum, to recapture that spirit of the people's movement.\n\n\n\n\n\n\"Post the 2023 referendum, the voice referendum, people are saying, look, we need reconciliation more than ever and we need to actually finish what we call the unfinished business of this country.\"\n\n\n\n\n\nProfessor Huggins' calls for non-Indigenous people to join the push for change.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/job-ad-scams-rising-donald-trumps-market-influence/y18msfu8v",
        "title": "Job ad scams rising & Donald Trump's market influence",
        "publish_date": "Fri, 23 May 2025 07:20:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/gazans-devastated-and-desperate-us-senate-showdown-and-a-massive-rice-fail/8djcekpdt",
        "title": "Gazans 'devastated and desperate', US Senate showdown and a massive rice fail",
        "publish_date": "Fri, 23 May 2025 06:49:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/food-aid-trickles-into-gaza/cafwwfegz",
        "title": "Food aid trickles into Gaza",
        "publish_date": "Fri, 23 May 2025 05:00:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nStarvation and desperation is gripping the Gaza Strip.\n\n\n\n\n\nPalestinian health minister Majed Abu Ramadan says children and elderly have been the most affected by the severe deprivation of food aid in recent days.\n\n\n\n\n\n\"We have info that more than 29 young children, infants and elderly lost their lives because of starvation-related issues.\"\n\n\n\n\n\nThe United Nations says a quarter of Gaza's 2.3 million people are currently at risk of famine.\n\n\n\n\n\nAfter an 11-week total blockade, Israel has finally allowed some aid deliveries to resume into the desperate region.\n\n\n\n\n\nUN spokesman Stephane Dujarric says about 90 trucks have now delivered critical humanitarian aid to multiple destinations within Gaza.\n\n\n\n\n\n“Yesterday about 90 loaded trucks left the Kerem Shalom crossing to multiple destinations inside Gaza. They carried nutrition supplies, flour, medicines and other critical stocks that were allowed in. They continue to face huge challenges in getting goods out of the crossings to where they are needed in Gaza. The shipment from yesterday is limited in quantity and nowhere near sufficient to meet the scale and scope of Gaza's 2.1 million people. Other supplies such as fresh food, hygiene items, water purification agents and fuel to power hospitals have not been let in for 80 days.”\n\n\n\n\n\nFlour and other aid began reaching some of Gaza's most vulnerable areas, with Palestinians in the southern city of Khan Younis, including children, scrambling to gather supplies that were being distributed.\n\n\n\n\n\nAnd, for the first time in over a month, the Bana bakery in Gaza's central city of Deir al-Balah has opened its doors after the UN's World Food Program was able to bring in flour to bake flatbread, a local staple.\n\n\n\n\n\nThe Program's Vladimir Jovcev says the supplies are insufficient but he hopes the borders can stay open and more food can flow in.\n\n\n\n\n\n\"Symbolically you know, the smell of fresh bread is the smell of hope. So we hope that you know, the borders remain open, the crossings remain open and then we’re able to bring more humanitarian aid to assist everyone in here. The bread produced in this bakery will not be sold at the moment on the counters in the bakeries. It is going to be distributed through our existing network of partners, mainly the ones operating the hot meals kitchen, and given to the ones that are mostly in need.\"\n\n\n\n\n\nBut as aid trickles in, a new, intensified Israeli ground offensive into Gaza has begun with local health authorities saying more than 500 Palestinians have been killed in the past week.\n\n\n\n\n\nIsraeli Prime Minister Benjamin Netanyahu says his military intends to seize all of the Gaza Strip, destroy Hamas, free Israeli hostages and displace the Palestinian population.\n\n\n\n\n\nTom Fletcher, the UN's humanitarian chief, has issued a dire warning.\n\n\n\n\n\n\"The scaffolding built last century to protect us from inhumanity is crumbling. Those who will die as a result need us to act. Some parties to conflict have committed flagrant violations of the rules of law. Some have justified immense civilian harm through permissive interpretations of the law, loosely defining who is a lawful target, what constitutes a military objective, or what level of civilian harm is proportional.\"\n\n\n\n\n\nThe comments come two days after British Prime Minister Keir Starmer, along with the leaders of France and Canada, demanded a ceasefire and an end to the Israeli blockade.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-23-may-2025/0c4da3z2v",
        "title": "Clean up begins after deadly storms | Midday News Bulletin 23 May 2025",
        "publish_date": "Fri, 23 May 2025 02:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points A fourth death in northern New South Wales floods\n\nAustralia consults the US over Harvard deportations\n\nChallenges ahead for top seeds at the French Open\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\nA man in his 70s has been found dead in a submerged car near Coffs Harbour, bringing the flood death toll in New South Wales to four, with several people missing.\n\n\n\n\n\nHis vehicle was spotted by a passing motorist about 30 kilometres northwest of the town this morning.\n\n\n\n\n\nAuthorities have yet to confirm his identity.\n\n\n\n\n\nSince Thursday, severe flooding has triggered 1,535 calls for help and 177 rescues, according to the SES Deputy Commissioner, Damien Johnson, who gave this update this morning.\n\n\n\n\n\n\"Sadly, there's a number of people that have lost their lives as a result of this severe weather event, and our condolences go out to friends and family of those that have lost their lives. There are a number that are still missing as well, and that search continues. And our thoughts are for those communities out there that have been affected by this major and significant weather event. It's going to take some time. As we know, Australians and New South Wales people are resilient, we will get through this, and we will be there to support you.\"\n\n\n\n\n\nPrime Minister Anthony Albanese is travelling to flood-affected areas today.\n\n\n\n---\n\n\n\n\n\nLiberal MPs have expressed broad support for reuniting with the Nationals, though concerns linger over the latter’s policy demands.\n\n\n\n\n\nBoth parties have delayed announcing their shadow cabinet line-ups as talks continue.\n\n\n\n\n\nDuring a virtual party room meeting last night, Liberal leader Sussan Ley said there was strong backing to remain in coalition, but not at any cost.\n\n\n\n\n\nThe Nationals are pushing for commitments to nuclear energy, divestiture laws, a regional investment fund, and improved phone coverage.\n\n\n\n\n\nOne Liberal source says that none of the proposals were deal breakers, but M-Ps remain cautious about unclear costings and the risk of signing what they call, a blank cheque.\n\n\n\n---\n\n\n\n\n\nIsrael has allowed limited aid into Gaza for the first time in weeks, but shortages remain severe.\n\n\n\n\n\nPalestinian officials say just 100 trucks carrying food and medical supplies entered on Wednesday local time, far below what's needed.\n\n\n\n\n\nSome southern bakeries have reopened using U-N-supplied flour, but many trucks remain stuck at the border.\n\n\n\n\n\nThe Palestinian Red Crescent fears crowds may loot incoming aid.\n\n\n\n\n\nIsraeli Prime Minister Netanyahu says a new distribution zone will soon allow U-S companies to deliver food safely in military-controlled areas.\n\n\n\n\n\n\"Ultimately, we intend to have large safe zones in the south of Gaza. The Palestinian population will move there for their own safety, while we conduct combat in other zones, and receive humanitarian aid there without Hamas interference. In the meantime, we authorised letting trucks enter Gaza to provide for immediate needs. Yesterday, I think 100, more than 100 trucks went in. More will come in today.\"\n\n\n\n\n\nIsrael imposed the blockade in March, accusing Hamas of diverting aid, claims Hamas denies.\n\n\n\n\n\nThe UN says a quarter of Gaza’s population faces famine.\n\n\n\n\n\nAccording to health officials, at least 29 people, including children, have died from starvation in recent days.\n\n\n\n---\n\n\n\n\n\nOfficials are working to understand how the ban on international student enrolments at Harvard University will impact Australians studying there.\n\n\n\n\n\nThe Trump administration revoked the university's ability to enrol international students and is forcing existing students to transfer to other schools or lose their legal status.\n\n\n\n\n\nAustralian Ambassador to the United States Kevin Rudd posted on X [[former Twitter]] that the Embassy is working to obtain further details from the U-S government.\n\n\n\n\n\n\"We are monitoring closely developments at Harvard University in relation to the administration’s statement this afternoon on the future enrolment of international students. I know this will be distressing for Harvard’s many Australian students. The Embassy is working with the United States Government to obtain the details of this decision so that Australian students can receive appropriate advice.\"\n\n\n\n\n\nMr Rudd adds that he intends to engage with the U-S administration on the impact this decision will have on Australian students and their families both at Harvard and at other campuses across the United States.\n\n\n\n---\n\n\n\n\n\nAccording to a University of Queensland study, Australians are swearing less online than expected, ranking below the U-S and UK in global profanity use.\n\n\n\n\n\nResearchers analysed over 1.7 billion words from online content across 20 English-speaking countries, tracking 597 vulgar words using computational linguistics.\n\n\n\n\n\nDespite Australia’s reputation for colourful language, lead researcher Martin Schweinberger suggests Aussies may reserve swearing for in-person conversations.\n\n\n\n\n\nHe notes many might find the findings surprising, as profanity and slang are often embraced as part of Australian culture, even in tourism slogans like “so where the bloody hell are you?” asked by model Lara Bingle.\n\n\n\n---\n\n\n\nTo tennis, and Alex de Minaur faces a challenging first week at the French Open, with a potential quarter-final clash against rival Jannik Sinner looming, if he can get that far.\n\n\n\n\n\nThe draw has offered little relief for Australia’s 15-strong contingent.\n\n\n\n\n\nIn the women’s bracket, Maya Joint and Ajla Tomljanovic will meet in a first-round clash dubbed a 'battle of the generations'.\n\n\n\n\n\nIt comes just days after the two face off in the Morocco Open semi-final on Friday, Joint's first W-T-A semi-final and Tomljanovic’s 10th French Open campaign.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/liberals-back-in-principle-deal-to-reunite-coalition/am86bh28p",
        "title": "New move in Coalition reunion push as Nationals MP says split 'wasn't the smartest'",
        "publish_date": "Fri, 23 May 2025 01:35:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "An in-principle agreement to four key policies has paved the way for the Coalition to reunite after their recent split.\n\n\n\n\n\nThe Liberal party room met virtually on Friday, ticking off the demands the Nationals had made before breaking up their political arrangement for the first time in nearly 40 years.\n\n\n\n\n\nThe policies were removing a federal moratorium on nuclear energy, boosting rural phone connectivity, divestiture powers to keep big supermarkets in check and keeping a regional investment fund.\n\n\n\n\n\nThere have been reservations about the policies, including from Liberal free-marketeers who argue divestiture powers represent too much government intervention.\n\n\n\nPolicy details will still be the subject of negotiations given the Liberals only agreed to in-principle support.\n\n\n\n\n\nThere was a broad consensus a united Opposition was more important than infighting, despite anger at how the Nationals acted when they announced their exit from the Coalition on Tuesday.\n\n\n\n\n\nThe regional party insists it was a policy-driven split and not a power play.\n\n\n\n\n\n\"No matter how they want to dress it up, when our people in the regions are suffering way more than the people in the cities, a few polices that would help them being left on the table isn't a big ask,\" Nationals senator Ross Cadell told the Australian Associated Press.\n\n\n\n'Tongue in cheek'\n\nLiberal leader Sussan Ley and Nationals leader David Littleproud will now need to bury the hatchet to form a shadow cabinet, which is made up on a proportional basis of MPs from both sides.\n\n\n\n\n\nThe portfolio division is negotiated by the leaders, who then choose their respective representatives.\n\n\n\n\n\nFiner details of a coalition agreement will also need to be hammered out.\n\n\n\n\n\nLittleproud's handling of the saga has led to rumblings about his leadership, but Nationals sources insist only a small cabal is agitating against him.\n\n\n\n\n\nAsked if he believed Littleproud's future as leader would be tenable if the Coalition reunited, Nationals MP Michael McCormack — who led the party from 2018 to 2021 — told ABC Canberra on Friday morning: \"That would be up to the party room.\"\n\n\n\n\n\nAnd when questioned if Littleproud would have his full support, McCormack said: \"I'm ambitious for him.\"\n\n\n\n\n\nIt was the same comment former prime minister Scott Morrison used before he replaced Malcolm Turnbull as Liberal leader in 2018.\n\n\n\n\n\nLater, McCormack sought to cast it as a \"tongue in cheek\" remark in an interview with SBS News, saying he supported Littlepround but reiterated that his tenure would be up to the party room.\n\n\n\n\n\nHe didn’t rule out a future leadership tilt, altough added that both he and the majority of the party room supported the Nationals leader \"at the moment\".\n\n\n\nNationals MP Michael McCormack (left) and David Littleproud. Source: AAP But McCormack was critical of Littleproud's handling of the split, saying he didn't \"think it was the smartest thing to do\" while acknowledging the move was backed by the majority of the party room.\n\n\n\n\n\nHe said it \"became messy\", coming soon after the death of Ley's mother and amid heavy rain and floods in NSW .\n\n\n\n\n\n\"And the way it's been gone about in such haste, with such speed, was unfortunate,\" he said. \"But ... in hindsight I'm sure, given the circumstances and what we know now, David might have done things differently.\"\n\n\n\n\n\nEarlier on Friday, Nationals deputy leader Kevin Hogan backed how Littleproud has handled the situation.\n\n\n\n\n\n\"I think he's done an exceptional job as a leader throughout this process,\" he said.\n\n\n\n\n\n\"He brought it to the party room. It was the party room's decision to do this.\"\n\n\n\n\n\nWhen asked if he thought Littleproud would remain as leader until the next election, Hogan said: \"I have no doubt he will be.\"\n\n\n\n\n\n— With the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/world/europe/it-was-quite-absurd-man-awakes-to-find-container-ship-wedged-in-his-yard-20250524-p5m1uu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It was quite absurd’: Man awakes to find container ship wedged in his yard",
        "publish_date": "Sat, 24 May 2025 11:02:06 +1000",
        "category": "finance",
        "authors": [
            "Vivian Ho"
        ],
        "text": "A man in Norway woke this week to find a 135-metre container ship towering over his home after it ran aground in his yard.\n\nJohan Helberg slept through the initial impact of the NCL Salten as it sailed into his yard in Byneset, Norway, early on Thursday morning, Helberg told Norwegian broadcaster NRK. But after being woken by his neighbours ringing his doorbell, he looked out of the window to find the ship’s bright-green bow – quite a different sight from his usual picturesque views of the Trondheim Fjord.\n\nJohan Helberg stands next to his house with its new garden feature – the container vessel NCL Salten. Credit: AP\n\n“It was quite absurd,” Helberg said, noting that it had stopped just metres from his house.\n\n“If it had hit five metres further to the right, it would have slid up the rocky cliff, and then my house would probably look quite different.” Helberg told NRK that the ship had cut a wire to his heating pump.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/losing-learning-lunching-winning-six-days-in-the-life-of-zach-merrett-20250523-p5m1tj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five Essendon captains went to lunch together. This is what they spoke about",
        "publish_date": "Sat, 24 May 2025 10:55:03 +1000",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "“It was about us getting back to the intent to the tackling and with our ball movement being a bit more exciting and generating a bit more excitment for the fans even. Not a lot changed.” Against Richmond, Essendon’s better players were around the ball. Nic Martin, voted best afield, combined with Merrett for 72 disposals. Jye Caldwell had 29, the enterprising Archie Roberts 34 and while hard nut Sam Durham had a modest 26, his impact was equal to that of Martin. Essendon’s Nic Martin is announced as the Yiooken Trophy winner. Credit: AFL Photos via Getty Images Angus Clarke thrived in his debut, booting three goals from the wing and showing sharp footy IQ. Merrett’s Bombers aren’t striving for glory and fame in 2025 so much as desperately seeking improvement. It was this desire to soak up the wisdom of elders that prompted Merrett to converse with “a dozen or two dozen” coaches and champions across the competition.\n\nThis week, he ventured closer to home by organising a meeting with four past Essendon captains. In chronological order: James Hird, Matthew Lloyd, Jobe Watson and Dyson Heppell. It is an initiative that he wants to cement with the current players. “I got a free lunch. So I’ll say thanks Hirdy for that. He’s the big dog, he can pay for lunches. It was incredible. I mean, we’re trying to bridge that connection and the fabric of generations of Essendon players and captains and trying to bring our fans along for the journey as well. Obviously, moving away from Windy Hill 12, 13 years ago. “Those guys are very good with their time as well. So I’m fortunate to have such good people mentoring me ... to me, it’s more about just discussing what they’ve learned. “I’ve been very lucky to meet a dozen or two dozen coaches, Brownlow medallists – you name it – across the journey. But it’s hard to go past champions of your own footy club and the fabric they have; to bring Hirdy and Lloyd back into the fold in some way I think should excite fans as well.”\n\nLoading Lloyd, speaking on 3AW on Friday night, said of the meeting: “It was more that I listened to him around the areas of the club that need to get better. “Which I don’t want to go into, but I gave him some responses that have worked for me or us in the past that have helped us get to the highest level and how to challenge some of his teammates to drive standards harder. “He was really honest, which is why I want to be careful of what I say here because we were all there to support him and help him. Merrett wants the current Bombers to form bonds with the past greats he’s cultivated.\n\nLoading “I think internally we’ve moved on from all those scars. But externally, I think there’s a number of people still hurting a little bit. If we can try and bridge that gap as quickly as we can with a bit of urgency, I think those sort of meetings with Hirdy and Lloydy and Jobe of that era hopefully fast track that with that generation. “There was so much success with the ’90s and 2000s and ’80s for me and our players and our current generation of young talent want to immerse themselves with those guys and if I can try and facilitate that as much as possible. “I know Brad’s very open to those guys coming in and being part of our fabric as well.” While disappointed to see Reid injured in the Dreamtime game on Friday night, Merrett said the key defender now knew what he can achieve.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/piastri-error-causes-red-flag-in-practice-20250524-p5m1ut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri error causes red flag in practice",
        "publish_date": "Sat, 24 May 2025 10:27:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Piastri error causes red flag in practice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-threatens-tariffs-on-european-union-apple-as-his-trade-war-intensifies-20250524-p5m1tu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump threatens tariffs on European Union, Apple as his trade war intensifies",
        "publish_date": "Sat, 24 May 2025 09:50:57 +1000",
        "category": "finance",
        "authors": [
            "Josh Boak"
        ],
        "text": "Analysts have been sceptical that Apple could quickly shift device manufacturing to the US, mainly because it has spent decades embedding complex supply chains in China. Credit: Bloomberg “The EU’s fully engaged, committed to securing a deal that works for both,” Sefcovic said. “EU-US trade is unmatched & must be guided by mutual respect, not threats. We stand ready to defend our interests.” Trump has also threatened import taxes against Apple for its plans to continue making its iPhone in Asia. The tech giant now joins Amazon, Walmart and other major US companies in the White House’s crosshairs as they try to respond to the uncertainty and inflationary pressures unleashed by his tariffs. “I have long ago informed Tim Cook of Apple that I expect their iPhones that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,” Trump wrote. “If that is not the case, a Tariff of at least 25 per cent must be paid by Apple to the US”.\n\n‘I think such tariffs help no one, but would just lead to economic development in both markets suffering’ Johann Wadephul, German foreign minister The statement by Trump is critical in that he suggests the company itself would bear the price of tariffs, contradicting his earlier claims, as he rolled out a series of aggressive tariffs on foreign countries over the past several months. In general, importers pay the tariffs and the costs are often passed along to consumers in the form of higher prices. In response to Trump’s China tariffs, Apple’s Tim Cook said earlier this month that most iPhones sold in the US during the current fiscal quarter would come from India, with iPads and other devices being imported from Vietnam. After Trump rolled out tariffs in April, bank analysts estimated that a $US1200 iPhone would, if made in America, jump in price anywhere from $US1500 to $3500. ‘This one group in Brussels’ US Treasury Secretary Scott Bessent tried to provide some clarity on Trump’s postings in a Friday interview on Fox News.\n\nBessent said the EU has a “collective action problem” because its 27 member states are being represented by “this one group in Brussels,” such that the “underlying countries don’t even know what the EU is negotiating on their behalf”. Treasury Secretary Scott Bessent wants Apple to bring more of its computer chip supply chain into the US. Credit: Bloomberg The Treasury secretary said he was not in a White House meeting this week that Cook attended, but he also spoke with the Apple chief executive this week. Bessent said the goal was to have Apple bring more of its computer chip supply chain into the US. The core of Trump’s argument against the EU is that America runs a “totally unacceptable” trade deficit with the 27 member states. Countries run trade deficits when they import more goods than they export. From the vantage point of the EU’s executive commission, trade with the US is roughly in balance if both goods and services are included. As a global centre for finance and technology, the US runs a trade surplus in services with Europe, offsetting some of the trade gap in goods and leaving the imbalance at €48 billion ($84 billion).\n\nGerman Foreign Minister Johann Wadephul said the EU’s executive commission has his country’s full support in working to “preserve our access to the American market”. “I think such tariffs help no one, but would just lead to economic development in both markets suffering,” Wadephul said in Berlin. “So we are still counting on negotiations and support the European Commission in defending Europe and the European market while at the same time working on persuasion in America.” Trump aides have previously said the goal of his tariffs was to isolate China and strike new agreements with allies, but the president’s tariff threats undermine the logic of those claims. Trump has run hot and cold on his relationship with Apple, a sign that currying favour with him might not necessarily shield a company from his anger. He has essentially told companies such as Walmart to “eat” the costs of his tariffs instead of raising prices, even though doing so could squeeze profits and cause layoffs. He now appears to be deploying a similar degree of pressure on Apple.\n\nLoading Trump had previously created an exemption on electronics imported from China to help companies such as Apple, something he could now remove. He also threatened to impose separate 25 per cent import taxes on computer chips and could have the tariffs schedule rewritten in ways that could expose Apple products to the taxes. Until recently, the US president repeatedly bragged about the $500 billion that Apple pledged in February to invest domestically as part of its development of artificial intelligence technologies. But he publicly turned against the company last week while speaking in Qatar. “I had a little problem with Tim Cook yesterday,” Trump told the audience. “I said to him, ‘My friend, I treated you very good. You’re coming here with $US500 billion, but now I hear you’re building all over India. I don’t want you building in India.’” Analysts have been sceptical that Apple could quickly shift manufacturing to the US, mainly because it has spent decades embedding complex supply chains in China to feed the factories.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/kellaway-needs-some-magic-dust-to-fend-off-harry-potter-and-friends-20250523-p5m1lj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kellaway needs some magic dust to fend off Harry Potter and friends",
        "publish_date": "Sat, 24 May 2025 09:33:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "Things could get worse before they get better for the Waratahs with tough trips to Perth and Auckland over the next two Saturdays to face the Western Force and Blues.\n\nMathematically, the Waratahs are still a chance of making the playoffs, but in reality they are battling to avoid losing the last six games of their Super Rugby campaign.\n\nOn paper, the trip to Perth presents the best chance of doing this, although for senior Waratahs such as Andrew Kellaway, it also presents a chance to show some Wallabies form in the face of opposition in the west.\n\nKellaway has some capital in the bank after a good end-of-season tour during which he wore the Wallabies No.14 jersey in all four grand slam Tests, but he was already under serious pressure from the Force’s Harry Potter even before it was confirmed this week that Dylan Pietsch would be making his comeback for the Force on the left wing and that the Reds’ Filipo Daugunu had re-signed with Rugby Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/littleproud-s-trumpian-tactics-only-showcased-ley-s-strength-20250522-p5m1fi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Littleproud’s Trumpian tactics only showcased Ley’s strength",
        "publish_date": "Sat, 24 May 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jacqueline Maley"
        ],
        "text": "In 2003, the forthright British broadcaster Jeremy Paxman published a book called The Political Animal: An Anatomy in which he dissected the character and psyche of his journalistic prey: politicians.\n\nThe central thesis of the book was that politicians are not just another breed, they are an entirely different species. In the introduction, Paxman recounts being bailed up by Cherie Booth, wife of former British Labour prime minister Tony Blair, who asserted that journalists were not interested in the truth and were “only in it for the money” (I wish the latter were true).\n\nShe accused Paxman of believing “we’re all crooks”. As he pointed out, the “we” was interesting, given Booth was not, herself, a politician. Anyway, she was wrong, Paxman said. “I most emphatically do not believe that they are all crooks. Or even that they are all, always dishonest,” he wrote. “But they are different from us.”\n\nSussan Ley showed fortitude under pressure from National Party leader David Littleproud. Credit: Marija Ercegovac\n\nI was inspired to go back to Paxman’s book this week as I pondered the absolute nerves of steel of new Liberal leader Sussan Ley who, in the first weeks of her new job, navigated a Coalition split while nursing her dying mother and then planning a funeral.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/flight-attendant-says-duchess-of-sussex-gave-her-a-handwritten-note-20250524-p5m1uk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flight attendant says Duchess of Sussex gave her a handwritten note",
        "publish_date": "Sat, 24 May 2025 09:12:35 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Flight attendant says Duchess of Sussex gave her a handwritten note\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/emergency-crews-begin-water-land-and-aerial-search-for-pheobe-bishop-20250524-p5m1uh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Emergency crews begin water, land and aerial search for Pheobe Bishop",
        "publish_date": "Sat, 24 May 2025 08:57:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Emergency crews begin water, land and aerial search for Pheobe Bishop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghan-markle-shares-behind-the-scenes-of-confessions-of-a-female-founder-shoot-20250524-p5m1ue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan Markle shares behind the scenes of Confessions of a Female Founder shoot",
        "publish_date": "Sat, 24 May 2025 08:37:21 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan Markle shares behind the scenes of Confessions of a Female Founder shoot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/fans-go-off-after-anges-mic-drop-moment-20250524-p5m1ud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fans go off after Ange's 'mic drop' moment",
        "publish_date": "Sat, 24 May 2025 08:12:12 +1000",
        "category": "sports",
        "authors": [],
        "text": "Fans go off after Ange's 'mic drop' moment\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/new-docu-series-to-be-released-by-prince-william-20250524-p5m1uc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New docu-series to be released by Prince William",
        "publish_date": "Sat, 24 May 2025 07:58:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "New docu-series to be released by Prince William\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/trophy-parade-20250524-p5m1u8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trophy parade",
        "publish_date": "Sat, 24 May 2025 07:38:59 +1000",
        "category": "finance",
        "authors": [],
        "text": "Trophy parade\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/flood-cleanup-efforts-begin-while-some-parts-of-nsw-still-underwater-20250524-p5m1u7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Flood cleanup efforts begin while some parts of NSW still underwater",
        "publish_date": "Sat, 24 May 2025 07:33:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Flood cleanup efforts begin while some parts of NSW still underwater\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/trophy-in-hand-future-in-doubt-ange-s-joyful-uncertain-triumph-in-london-20250524-p5m1u0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trophy in hand, future in doubt: Ange’s joyful, uncertain triumph in London",
        "publish_date": "Sat, 24 May 2025 06:59:24 +1000",
        "category": "sports",
        "authors": [
            "Rob Harris"
        ],
        "text": "London: The crowd sang as if summoning something sacred. “When the Spurs go marching in,” they chanted – an old gospel melody reimagined for a modern football miracle.\n\nFlags whipped in the breeze, faces were painted in navy and white, and the High Road trembled with movement. From the fried chicken shops of Edmonton Green to the sleek facade of the new stadium, Tottenham was a city unto itself for one golden afternoon – a community momentarily suspended in joy.\n\nIt wasn’t just noise. It was release. After 17 years of waiting, Spurs had finally won a trophy. And the people who had waited – with crossed fingers, broken hearts, and half-muttered curses – spilled onto the streets to see it raised.\n\nAn open-top bus crawled along a route soaked in history and local pride. The players, medals gleaming in the light, waved down to a crowd that surged around them like a tide. They passed betting shops and nail salons, Victorian terraces and housing estates, kebab joints, boarded-up pubs, and ambitious new cafes. Tottenham – gritty, diverse, gentrifying and proud – was on parade alongside its team. This wasn’t just about soccer. It was about place, and pain, and perseverance.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/australia-s-italians-out-in-the-cold-as-rome-rewrites-citizenship-rules-20250515-p5lzbi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia’s Italians out in the cold as Rome rewrites citizenship rules",
        "publish_date": "Sat, 24 May 2025 06:00:00 +1000",
        "category": "finance",
        "authors": [
            "Rob Harris"
        ],
        "text": "Rome: For decades, Australians with Italian heritage – some named after a nonna they never met, others raised on Sunday sugo and stories of the old country – have proudly clung to the idea of becoming citizens.\n\nFor many, it was more than nostalgia. It meant opportunity – to live, work and travel freely across Europe. But that door, for thousands, has now slammed shut.\n\nItalian senator Francesco Giacobbe, from Sydney, in his office in Rome this week. Credit: Flavio Brancaleone\n\nRome had long allowed direct descendants of citizens who lived in Italy as far back as 1861 to apply for a passport. But Giorgia Meloni’s right-wing government, elected in 2022 on a platform of national pride and conservative revivalism, has redrawn the boundaries of who gets to belong.\n\nIn March, Meloni’s cabinet issued an emergency decree that dramatically tightened eligibility and this week, the law was formally approved by parliament. The change restricts automatic citizenship rights to only those with at least one parent or grandparent born in Italy.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/young-girl-hit-by-car-at-pedestrian-crossing-20250523-p5m1sx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young girl hit by car at pedestrian crossing",
        "publish_date": "Sat, 24 May 2025 05:59:07 +1000",
        "category": "finance",
        "authors": [],
        "text": "Young girl hit by car at pedestrian crossing\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/calls-to-end-major-250-million-loophole-amid-destructive-trend-on-australias-roads-003634270.html",
        "title": "Calls to end major $250 million loophole amid destructive trend on Australia's roads",
        "publish_date": "2025-05-24T00:36:34Z",
        "category": "finance",
        "authors": [],
        "text": "The current system of incentivising Aussie to buy oversized cars instead of making them pay more has been described as an \"outrage\". Should it change?\n\nAussies are shifting to larger cars, but there's one reason that should end, critics argue. Source: Reddit/Facebook\n\nThere are growing calls for Australian state governments to rethink their approach to how much drivers pay to use the roads and for the federal government to end a perverse incentive pushing Aussies to embrace oversized utes and trucks. As bigger and bigger cars proliferate on our roads, the massively accelerating trend is costing taxpayers, worsening congestion and polluting the environment, critics say.\n\nThe luxury car tax means Aussies who are buying a car worth more than $80,576 (this financial year) will pay an extra tax on the cost of the vehicle above that amount. However a loopholes means most utes and SUVs are exempt because they are classified as light commercial vehicles regardless of whether they are bought for private or commercial use.\n\nAssociate Professor Milad Haghani, an expert in urban resilience at the University of Melbourne, is among those who continue to question why the exemption is still in place.\n\n\"The luxury car tax exception has been one of the biggest incentives for people to go big and buy big cars,\" he told Yahoo News Australia.\n\nADVERTISEMENT\n\n\"Because if somebody is looking at a price range of $80,000 and above, there's really an incentive to buy a pick-up truck or big car because then they get exempted from the whopping 30 per cent luxury tax and it becomes quite attractive to the buyer.\n\n\"And a lot of the buyers don't use it for commercial purposes,\" he added.\n\nThe status quo means every tax payer is \"effectively subsidising\" the purchase of such mega utes Prof Haghani said. The Australian Institute recently calculated that comes at a cost of about $250 million a year.\n\nAnd that's before other externalities that impose a cost on society are considered with research showing the larger vehicles have an outsized impact on worsening congestion, polluting the environment and degrading our roads.\n\nSome imported vehicles have become seriously large. Source: Facebook\n\nAccording to Prof Haghani, a large ute that is twice the size of a smaller car will have 16 times the impact when it comes to road damage. That's because of something called the fourth powered law \"which is a very known thing in pavement engineering that says the amount of damage is proportional to the fourth power of its axle weight. So if the axle weight is doubled, the impact is 16 times bigger.\"\n\nADVERTISEMENT\n\nLess than 25 years ago, Australian buyers overwhelmingly bought small passenger vehicles like sedans and hatchbacks. But according to Prof Haghani, their percentage of new sales has plummeted in recent years, now making up just 17 per cent of new car sales. Instead, 80 per cent of cars bought in Australia are either an SUV, ute, van or light truck.\n\nWhile Aussie consumers appear to be embracing them, certain local politicians, like city councillors in Melbourne, have been pushing back against their adoption. Last year the Yarra City Council unanimously voted to investigate the potential to raise parking fees for large vehicles — following a policy adopted in Paris which has seen larger SUVs slugged a $30 per hour rate to park in the inner city.\n\nGreens Councillor Sophie Wade who led the push told Yahoo News the city's streets simply \"weren't designed for this kind of vehicle.\" Such a reality is clearly evidenced by the fact Standards Australia has been mulling whether to increase the size of standard carpark spaces due to the trend.\n\nShould bigger cars pay more for rego?\n\nProf Haghani would also like to see state registrations overhauled to put emphasise on the size of the vehicle and make the owners of American style large utes and trucks pay more.\n\nADVERTISEMENT\n\nCurrently, only NSW and WA consider the weight of the vehicle when charing for registration. Queensland and Tasmania use the number of engine cylinders, which is a proxy while Victoria set fees based on location.\n\n\"What would a truly equitable registration fee model look like? Based on the evidence, it would not only account for vehicle size and weight, but also how often the vehicle is driven,\" he wrote this week in The Conversation.\n\nAs it stands in most jurisdictions, \"the registration fee system is just not a fair and equitable one,\" he told Yahoo.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/tradie-goes-viral-for-incredibly-bold-weekend-project-most-australian-boat-ever-231445675.html",
        "title": "Tradie goes viral for incredibly bold weekend project: 'Most Australian boat ever'",
        "publish_date": "2025-05-23T23:14:45Z",
        "category": "finance",
        "authors": [],
        "text": "As you do, a group of six mates jumped onto a modified picnic table and set off down the river.\n\nTradie Kurt and his mates made a 'picnic boat' to enjoy a few beers on the water. Source: TikTok/proj3ct_lift\n\nA tradie and his mates have gone viral online for making a boat out of a picnic table, large olive oil drums and an esky to go cruising in on the weekend.\n\nKurt, 34, who opted to only tell Yahoo News his first name, said the idea started as a joke until one of his friends bought heaps of olive oil barrels on Facebook Marketplace, informing the group they really ought to make their dream a reality.\n\n\"We thought, alright, we're going to have to do it then... it only took us about five hours in the end,\" the mechanic told Yahoo. \"It's basically a picnic table fastened to the olive barrels — they're used as floats... we made sure to make the backend quite strong to hold all the weight and clamped on the small engine.\"\n\nFootage of the \"picnic boat\" in action shows Kurt and five mates heading down the Swan River in Perth before cruising along the coast once they hit the ocean.\n\nADVERTISEMENT\n\n\"We had lifejackets strapped underneath to the 'boat'... and it did have an esky built in it. Carlton Drys were pretty popular so it was an all-round decision to enjoy a few.\"\n\n\"There were plenty of memorable moments, as you can imagine it's not every day you see a bunch of lads floating down the river on a picnic table. Plenty of people on the water got a good laugh,\" he said.\n\nTradie continues to make whacky inventions inspired by 'boat'\n\nThe group of mates enjoyed the \"picnic boat\" on several occasions but Kurt admitted it's now \"pretty destroyed\" and the vessel has been retired for years. The footage was captured over six years ago, with Kurt only deciding to share it online now he's started to build other whacky inventions, explaining the 'boat' sparked his imagination.\n\nADVERTISEMENT\n\nHe recently made a \"gas powered hot water dog wash on wheels\" as well as other practical guides to help Aussies update their home and yard.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/big-change-looms-for-camping-in-national-parks-with-major-deadline-from-tomorrow-210328969.html",
        "title": "Big change looms for camping in national parks with major deadline from tomorrow",
        "publish_date": "2025-05-23T21:03:28Z",
        "category": "finance",
        "authors": [],
        "text": "A majority of campgrounds in NSW are set to become more expensive with authorities looking to streamline reservation systems and thwart ghost bookings.\n\nAvid campers and lovers of the great outdoors have only hours left to have their say about controversial changes to how camping grounds are managed by authorities in NSW as a proposed overhaul to booking systems is set to see travellers pay more to stay in public national parks.\n\nThe NSW National Parks and Wildlife Service (NPWS) has invited community feedback on the comprehensive overhaul with the deadline for public consultation ending on Sunday, May 25.\n\nThe proposal includes pegging fees to increases in the consumer price index, meaning prices would rise each year. It will also categorise all campsites into a hierarchy, with each tier being more expensive.\n\nA simple clearing with no facilities will remain free while campgrounds from tier 2 to tier 5 (which make up 85 per cent of sites) will range from $22 per night in high season for the most basic campground to $65 for sites that have water and access to a flushable toilet. The top campsites, tier 6, which have hot showers and BBQ facilities, will cost $89 per night.\n\nADVERTISEMENT\n\nThe proposal has seen critics take to social media with many worrying about the disappearance of an \"affordable way to have a holiday\".\n\nAmong those who have voiced concerns about the changes is Mike Atkinson, who appeared on the popular survivalist TV show Alone Australia and produces content about life in Australia's outdoors.\n\n\"The really serious thing is that they are introducing camping fees to an enormous percentage of campgrounds that never had them before,\" he told Yahoo News earlier this month.\n\n\"Never in the history of parks has there ever been a camping fee there... and now my guess is 60 to 70 per cent of campgrounds will have fees for the first time ever. I feel that the executives in NSW National Parks are running it like a business, and it's not, it's a public service.\"\n\nIt could soon cost nine times more for a camper to sleep overnight at Thredbo Diggings campground. Source: TikTok/ExplorOz/OutbackMike\n\nThe higher costs are needed due to record investment in campground infrastructure, increased park management costs and changing community expectations, the National Parks and Wildlife Service says.\n\nADVERTISEMENT\n\nThe NSW parks service manages 895 parks and reserves which make up roughly 10 per cent of the state's total land mass. According to the consultation paper, visitation has grown 49 per cent over the last decade, and there are now more than 50 million visits to national parks every year, including 1.8 million overnight campground stays.\n\nIn a recent video, Mike highlighted the Thredbo Diggings Campground in the Kosciuszko National Park which he believes will go from $6 to as much as $54 under the proposed system.\n\nPart of the justification is to tackle the issue of ghost bookings, which has been a problem in campsites across the country where booking systems have been introduced. The perception of ghost bookings is a big part of the reason Victoria is not renewing its free camping initiate from July.\n\nAnother keen camper, Jay from CampingMates, highlighted the same site in a video discussing the overhaul and calling on people to provide feedback, and shared his own anecdote of ghost booking.\n\n\"Out of 41 campsites at Thredbo Diggings, when I was there 30 campsites were booked but I was the only person for the entire campsite,\" he said.\n\nThose opposed to the changes say there is other ways to tackle the problem without raising prices on campers, such as automatic reminders and prompts to ensure cancellations are made.\n\nADVERTISEMENT\n\nWith hours left to provide feedback, the NSW National Parks and Wildlife Service says all public input will still be considered. You can do so here.\n\n\"All feedback on the proposal, which aims to introduce more consistent and simplified state-wide camping fees and bookings for NSW national parks and reserves will be carefully considered,\" a spokesperson told Yahoo News.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]