[
    {
        "url": "https://www.9news.com.au/national/explosion-lidcombe-western-sydney-rescue-operation-underway/f885fc4f-6a56-4b50-b8be-59f74b588d63",
        "title": "One hospitalised after explosion blows wall apart in Sydney apartment block",
        "publish_date": "Thu, 12 Jun 2025 22:31:35 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "A major rescue operation is underway in western Sydney after a possible gas explosion blew the wall of a unit apart.\n\nThe explosion knocked out the wall of a second-storey unit on Clarence Street at about 6.30am.\n\nNSW Fire and Rescue Superintendent Adam Dewberry said there had been \"significant damage\".\n\nOne person has been taken to hospital after an explosion blew out the wall of a second-storey flat in Lidcombe, Sydney. (9News)\n\n\"The wall, a double or triple brick wall, has literally blown out of the building off that second level,\" Dewberry told Today.\n\n\"Now, that explosion also causes a significant pressure wave, which is where the neighbouring properties and buildings have also felt that shockwave.\"\n\nFalling rubble destroyed a car parked below.\n\nREAD MORE: More than 290 feared dead after plane crashes outside airport in Indian city of Ahmedabad ﻿\n\nA car was destroyed by falling rubble (9News)\n\nFirefighters carried one male out of the wreckage, and that person has since been taken to hospital.\n\n\"Our focus at the moment is continuing to do a search to make sure we get an all-clear, good, everyone accounted for, which we haven't got at this stage, but we're working through it,\" Dewberry said.\n\n\"But it is still a very precarious and dangerous situation for our firefighters to move in and around.\"\n\nREAD MORE: How the Air India disaster unfolded minute to minute ﻿\n\nRoom full of people watch spiritual medium levitate View Gallery\n\nNearby resident Charlton said he was having \"a nice cup of coffee\" when the explosion happened.\n\n﻿\"And then I heard these two loud bangs, and then I said, 'my god, it's like an earthquake going on somewhere',\" he said.\n\n\"So I went down and I saw this whole building come down ... very scary.\"﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mick-fanning-charity-golf-day-shark-attack-northern-rivers-floods/5e324c17-ceab-44bf-b87a-29320ac05570",
        "title": "For Mick Fanning, the shark attack 'was just something that happened'",
        "publish_date": "Thu, 12 Jun 2025 19:19:12 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": "When live broadcasters on the eastern cape of South Africa captured the terrifying moment a shark trailed Australian surf icon Mick Fanning just minutes into the 2015 J-Bay Open Final﻿, viewers across the world gripped their couches and braced for the worst.\n\nBut as the 10th anniversary of the champion wave rider's brush with death looms, Fanning is remarkably relaxed about his miraculous escape from harm.\n\n\"﻿It was just something that happened,\" he told 9news.com.au .\n\nREAD MORE: Whale freed from shark net off Gold Coast\n\nThe infamous shark incident during the 2015 J-Bay Open Final was broadcast around the world. (World Surf League via Getty Imag)\n\n\"To be honest, it wasn't like a flick of the switch moment where I was gonna change my whole life.\n\n\"I just had to do work on myself to get myself back to, you know, surfing and stuff like that.\"\n\nAfter the near-attack in July 2015, Fanning returned to Jeffreys Bay the following year where he took out the competition, before retiring from WSL competition in 2018 as a three-time world champion.\n\nSince then, the Ballina-bred surfer has turned his focus - and perhaps his broader legacy - to ﻿charity.\n\nIn March 2022, TV cameras were again fixed on Fanning, who again donned his signature wetsuit as he traversed deadly flood waters on his jet ski , carrying essential supplies and helping dozens of locals in the Northern Rivers to safe ground.\n\nMick Fanning has used his jet ski to help flood impacted victims in Murwillumbah. (9News)\n\n\"﻿I know that area really well,\" Fanning said.\n\nThe 43-year-old learned to surf in Ballina before honing his skills after moving to the Gold Coast as a teenager.\n\n\"It's a place that I love and I got plenty of friends down there so I had a lot of friends that were affected by it all.\"\n\nFrom there, Mick Fanning's Charity Golf Day was born.\n\nThe inaugural event ﻿raised hundreds of thousands of dollars for the flood recovery.\n\nThree years on, that figure is approaching $2 million, but the circumstances across the region are devastatingly similar.\n\n\"It seems like it's just happening every other year now,\" Fanning said.\n\n\"I guess on the ground and in doing all the rescue work and helping people get back on their feet, you build relationships and ... we've just found that a lot of people are still really struggling.\n\n\"It's been three years on now and ... people are just finding out that the grants they thought they were going to get are not coming through.\n\n\"Some people are just, you know, losing that hope.\"\n\nFanning will be joined by celebrity mates and supporters today for his fourth annual Charity Golf Day. (Supplied)\n\nThe golf day has helped raise almost $2 million for charities supporting the flood recovery effort. (Supplied)\n\nFanning hopes some of the community's faith can be restored when a star-studded lineup of Aussie sporting legends and celebrities converge on the green at Coolangatta and Tweed Heads Golf Club today for the fourth annual Charity Golf Day.\n\n\"We're just here to let them know that we're still here we're still thinking of them and still trying to help where we can,\" he said.\n\n\"There's some incredible people that are all coming out to support and yeah, we're very thankful for all their support and donating their time.\"\n\nFamous faces such as Dylan Alcott, Ellyse Perry, Hamish Blake, Sally Pearson, Karl Stefanovic and Shannon Noll will be swinging their drivers alongside generous supporters to raise vital funds for on-the-ground charities including Givit, Human Nature, and Hands On Hearts.\n\nThis year, $1 million and a Mercedes-Benz are on the line if players can snag a hole-in-one.﻿\n\n\"It keeps getting bigger and bigger and bigger and you know we try and add something new and exciting each and every year﻿,\" Fanning said.\n\n\"It's pretty massive that we can do things like that and just keep making the day bigger and better and hopefully raise more money for those in need, and actually raise more awareness.\"\n\nFans who want a chance to win a year's supply of Balter beer, or would like to make a donation or purchase merch designed by street artist Sid Tapia, can visit the Mick Fanning Charity Golf Day website .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/cosmetic-procedure-pressures-on-australian-brides-to-be/5b5bd1ab-9fd4-4291-9869-675f739d1f7f",
        "title": "Ashley's algorithm changed when she got engaged. It almost cost her $1700",
        "publish_date": "Thu, 12 Jun 2025 19:17:19 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "﻿Ashley Brooks-Garrett﻿ never really considered Botox until she got engaged and her social media algorithm changed.\n\nSuddenly, her TikTok and Instagram feeds were full of photos of perfect brides and posts about cosmetic procedures, from affordable skin treatments to pricey Botox and filler.\n\nCosmetic procedures – especially nonsurgical ones – are becoming a popular part of wedding preparation, with ﻿US aesthetics company RealSelf reporting that wedding-related cosmetic procedure reviews rose by 30 per cent in 2019 alone.\n\nREAD MORE: Bank staff catch red flags that nearly cost woman her life savings\n\nAshley Brooks-Garrett﻿ didn't consider cosmetic procedures like Botox until she got engaged and her social media algorithm changed. (Supplied)\n\nWedding websites provide \"beauty timelines\" instructing brides on when to undergo specific procedures, cosmetic clinics promote bridal packages, and social media is awash with brides-to-be showing off their before and after photos.\n\nThe result is an intense pressure to join in, one that almost cost Brooks-Garrett $1700.\n\n\"Being bombarded with images of perfect brides constantly on social media definitely played a part in the pressure I felt to look a certain way,\" she told 9news.com.au.\n\n\"Society expects you to be absolutely perfect for one whole day and it's absolutely impossible ... it left me in a huge state of panic.\"﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nSo she traded her Aldi cleanser for a $250 skincare routine, spent $900 on facials and booked $600 worth of Botox.\n\nClinical psychologist and co-founder of ReadyMind Cosmetic Psychology Dr Toni Pikoos said Brooks-Garrett isn't the first bride to be sucked in by social media pressure to look perfect and she won't be the last.\n\nThese days, influencers and everyday women publicise their cosmetic procedures on social media, ﻿normalising what used to be a taboo experience.\n\nWhile that's not necessarily a bad thing, it can have a huge impact on brides.﻿\n\n\"The narrative around cosmetic procedures in society is really shifting towards this view of them being part of self-care and empowerment,\" Pikoos said.\n\n\"When you're bombarded with that sort of messaging, you start to feel like, 'That's what I'm supposed to be doing for the big day as well.'\"\n\nSpecialist medical practitioner Dr Imaan Joshi said pressure may prompt brides to undergo procedures they don't need or may regret.\n\n\"I do think that it's a little bit predatory, for lack of a better word, to start suggesting all these things to young women who don't actually need anything,\" she said.\n\n\"But social media presents it as just another thing you do on your path to getting married.\"\n\nBrooks-Garrett admits she almost fell into that trap but ended up cancelling her $600 Botox less than 24 hours beforehand.\n\n\"I panicked,\" she said, adding that she wanted to \"look like herself\" in wedding photos.\n\nREAD MORE: Death toll of horrific Austrian school shooting rises to 11\n\nBrooks-Garrett﻿ cancelled her Botox appointment because she wanted to \"look like herself\" on her wedding day. (Supplied)\n\nShe also \"couldn't justify the expense\" on top of all her other wedding costs but some Australian brides get around that by travelling overseas for cheaper cosmetic procedures in a practice known as medical tourism.\n\nDavid Allen, chief executive of medical tourism operator Asthetica, said business is booming in Australia and brides-to-be are interested in travelling to Turkey for eyebrow transplants, dental veneers and teeth whitening on a budget.\n\nSome have also inquired about more invasive procedures, including ﻿liposuction, abdominoplasty (tummy tuck), gastric sleeve surgery, and rhinoplasty.\n\nAllen said ﻿Asthetica, which only works with JCI and ISO accredited hospitals, will service \"a minimum\" of 15 Australian brides by the end of the year.\n\n\"Historically, women would purchase a wedding dress a size or two too small and use it as their motivation to be their best on the big day,\" he said.\n\nNow they're \"seeking something with longevity\" in the form of cosmetic procedures, with some brides- and grooms-to-be even booking \"couples surgery\" together.\n\nJoshi said that social media has ﻿\"trivialised\" medical tourism, as users sharing their positive experiences ﻿on TikTok and Instagram often leave out the risks.\n\n\"It's normalised to the extent where people think that it's no different to getting your hair done or your nails done, but it's not,\" she said.\n\n\"You have no idea about the qualifications of the person that you see in a foreign country. You have no idea about the system [or] what they can and can't safely do.\"\n\nPikoos added that ﻿Australian brides need to be educated about the potential of undergoing cosmetic procedures overseas, especially in countries that don't have the same standards or regulations as Australia.\n\n\"You hear terrible horror stories,\" she said.\n\nSocial media has put more pressure than ever on brides to look a certain way and while some may be happy with the results of cosmetic procedures performed in Australia or abroad, Pikoos wants all brides to examine why they want these procedures.\n\n﻿If it's due to shame, embarrassment or anxiety, she suggested addressing those emotions before forking out for a procedure they may regret or be disappointed by.\n\nJoshi added that while investing in skincare can boost brides' confidence, they need to understand the risks and long-term implications of more invasive procedures.\n\nBrooks-Garrett﻿ is glad she invested $1150 in her skin but cancelled her Botox appointment. (Supplied)\n\nLooking at her wedding photos now, Brooks-Garrett﻿ is glad she invested $1150 in skincare and facials but cancelled her $600 Botox appointment.\n\n\"As women, we are made to feel that so much of our worth is tied up in our looks, as if our appearance is central to our value,\" she said.\n\n\"But my face is so expressive and you can see exactly what I was feeling ... love and pure joy.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/new-research-reveals-the-average-bank-balance-of-australians/672b6c8c-496c-4254-9978-e024eb370b1d",
        "title": "New research reveals millions of Australians have less than $1000 in savings",
        "publish_date": "Thu, 12 Jun 2025 04:45:00 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "New research has revealed millions of Australians ﻿would feel financially stressed by an unexpected expense.\n\nComparison website Finder's ﻿Consumer Sentiment Tracker found 43 per cent of respondents, equivalent to 9.2 million people, have less than $1000 in savings.\n\nFor those with less than $1000 on hand, the average bank balance is $215.\n\nAustralians are being encouraged to put money aside to build an emergency fund. (iStock)\n\nThis is a slight improvement on Finder ﻿figures released in 2024, which revealed Australians in this group had $210 saved up.\n\nMeanwhile 18 per cent of people, equivalent to 4.3 million, had nothing to fall back on.\n\nThis is creating financial stress, with three-in-four of respondents sharing they are feeling concerned about their current financial situation﻿ and more than half say they are living paycheck to paycheck.\n\nThe top 10 jobs actually making money in cost-of-living crisis View Gallery\n\nIn contrast, the research also found the average Australian has $43,007 in the bank.\n\nFinder money expert ﻿Richard Whitten said Australians should aim to have three months of earnings saved.\n\n\"Find what savings you can create in your everyday expenses,\" Whitten said\n\n\"$50 shaved off your monthly health insurance bill could equate to an extra $600 by the end of the year.\"\n\nWhitten is encouraging people to find ways to increase their earnings to get closer to their savings goals.\n\n\"A high-interest savings account can help grow your balance faster by offering better returns than a standard transaction account,\" he said.\n\n\"A recurring investment of $150 a month into a high interest savings account paying five per cent interest would amount to $5813 in three years.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/indiana-jones-whip-kanes-rosebud-sled-and-culkins-home-alone-snow-cap-are-going-up-for-auction/ae132249-d566-4ef4-9501-569779b9285d",
        "title": "Some of Hollywood's most sought-after props going up for auction",
        "publish_date": "Thu, 12 Jun 2025 05:05:39 +0000",
        "category": "finance",
        "authors": [
            "June"
        ],
        "text": "1 of 11 Attribution: Nine\n\nMany of movies' most sought-after props are going up for sale in the Summer Entertainment Auction being held by Heritage Auctions from July 15 to 19.\n\nClick through to see what's up for grabs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/whale-stuck-in-net-off-gold-coast-beach-rescue-operation-underway/6d2fd5b0-4d65-4bbb-8a3a-7db78c29e0db",
        "title": "Whale freed from shark net off Gold Coast",
        "publish_date": "Thu, 12 Jun 2025 12:20:24 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A whale has been freed from a shark net after a rescue operation off the\n\nIt's understood the whale was caught in the net off Greenmount Beach at Coolangatta.\n\nIt's understood the whale was caught in the net off Greenmount Beach at Coolangatta.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/rare-labubu-sells-for-more-than-230000-at-auction/d9b6f33d-397b-496e-901b-b5370a83dc47",
        "title": "Rare Labubu sells for more than $230,000 at auction",
        "publish_date": "Thu, 12 Jun 2025 01:17:11 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "A rare, first-generation Labubu figure has sold for $US150,000 ($230,000) in Beijing at an auction held exclusively for the toys that have taken the world by storm.\n\nThe 131-centimetre mint green figurine with a gremlin-like appearance, sharp teeth and puckish grin went for 1.08 million yuan at the Yongle International Auction house that normally specialises in selling jewellery and modern art.\n\n\"Congratulations to the online buyer on collecting the world's only such one,\" said the auctioneer at an exhibition centre in downtown Beijing on Tuesday afternoon.\n\nA rare, first-generation Labubu figure has sold for $150,000 in Beijing at an auction held exclusively for the toys that have taken the world by storm. (Nine)\n\nLabubus are currently the trendiest plush toys on the planet, created by Hong Kong-born illustrator Kasing Lung and retailed by the Chinese toy giant Pop Mart.\n\nIn recent months, the bunny-bodied, elf-faced creatures — equal parts grotesque and adorable — have surged in popularity, sparking buying frenzies around the world, and in some cases, brawls among fans outside shops selling them.\n\nEven in China, where Pop Mart is based and most of its toys are made, people are struggling to get their hands on Labubus.\n\nA total of 48 Labubus were auctioned at the special event, billed as the \"world's first\" auction of first-generation collectible Labubus.\n\nA brown, 160-centimetre Labubu figure sold for $175,331, the second highest hammer price at the event.\n\nA brown, 160-centimetre (63-inch) Labubu figure, sold for A$175,331, the second highest hammer price at the event. (Today)\n\nThe company said only 15 such figures exist around the world.\n\nOther figures went for more than $1500 each.\n\n\"As a trendy toy in China, Labubu is now becoming a global artwork as it has truly sparked a craze around the world,\" Zhao Xu, the founder of Yongle Auction, told state-owned outlet The Beijing News .\n\nZhao said the company planned to hold monthly livestream auctions for Labubu and other trendy artworks.\n\nA pair of Minion-like Labubus sold at auction for $2137.\n\nBuyers at the auction also had to pay an additional 15 per cent brokerage fee on top of the hammer prices.\n\nLabubu's viral popularity has been a booster for Pop Mart. (Edward Berthelot/Getty )\n\nAnd it is not rare to see a price inflation of Labubus due to the crazy demand in China.\n\nFor instance, a blind box from the latest Labubu 3.0 series, originally priced at about $121.50, has been selling for up to $417 on the second-hand market, state-owned outlet Cover News reported.\n\nLabubu's viral popularity has been a booster for Pop Mart.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/xavier-duursma-importance-of-afl-country-game/105404662",
        "title": "'Chip on your shoulder': Players from the country carry a special pride",
        "publish_date": "Fri, 13 Jun 2025 02:02:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Essendon winger Xavier Duursma says growing up in the country builds grit and character in AFL players, who often carry a deep sense of pride in where they hail from.\n\nNow 24, and having played 100 games in the AFL, Duursma said one of his best footy memories is still when he was 15 and got to run around with his brother Zane, then 10, at Foster Football Netball Club.\n\n\"That was fantastic. It was a really cool experience,\" Duursma told ABC Sport.\n\n\"I didn't quite understand at the time just how cool that was.\"\n\nZane now plays for North Melbourne, while their sister, Yasmin, 21, plays for Carlton in the AFLW, and youngest brother Willem, 17, is touted to go as high as number one in the next national draft.\n\nIf Willem is to be selected, the quartet will follow famous footy families in the Selwoods and Danihers with four siblings to play the game.\n\nLoading Instagram content\n\n'Bush to the Burbs'\n\nIt's memories from growing up in Foster - with a population of just over 2,000 located 175 kilometres outside of Melbourne - that makes this weekend's Country Game so special for Duursma.\n\n\"It's giving us the opportunity to show what can happen if you work hard as a country kid and a country footballer,\" Duursma said.\n\n\"And what you can achieve potentially, if you put your mind to it and you work hard.\"\n\nThe Country Game recognises the impact of the regions on the game.\n\nThis Saturday will be Essendon and Geelong's 10th edition of the annual Country Game clash at the MCG, which aims to recognise the impact of country footy on the game, and acknowledge the contribution of regional communities to Australian society.\n\nThis year's theme is \"Bush to the Burbs\".\n\nLast year, participation in Australian Rules Football exceeded more than 520,000, breaking the AFL's all-time registered participation record set the year prior. There was growth in many markets around the country, including regional areas.\n\nThe locations with the best AFL talent Photo shows RegionsCodySean Which region has provided the league with the best players? Cody Atkinson and Sean Lawson investigate.\n\nMelbourne metropolitan areas still produce the largest amount of AFL talent anywhere in Australia. As of 2024, about a third of the league's player output, measured via Player Approximate Value, is from the Victorian capital.\n\nOutside the major cities — where Adelaide, Perth, Darwin, Brisbane and Sydney are increasingly productive, particularly with Academy players — the Gippsland and Shepparton regions figure strongly.\n\nTasmania has also been the home to footy legends over the years, particularly defenders, with Hobart and the North West being the strongest breeding grounds of talent.\n\nGeelong and Essendon will run out for the 10th Country Game this weekend. (Getty: Michael Dodge)\n\nThe country builds character\n\nDuursma said the main challenge that country kids face in pursuing a footy career is travel, with many important games for pathways being in major cities.\n\n\"Then also sometimes there's facilities and things like that,\" Duursma said.\n\n\"But at the same time, I think that builds part of the character and the grit (that country kids have). That sometimes you go without, so you just kind of make do with what you got.\"\n\nYasmin (left), Xavier and Zane Duursma all grew up in Foster and now play at the top level. (Supplied)\n\nDuursma said there's pride that comes with being a country kid \"out in the middle of the sticks\", without access to all the things people in the city areas might have.\n\n\"So there is a bit of a chip on your shoulder,\" he said.\n\n\"And I think that to be able to come through (the system), and as a family with a number of brothers and sister (that) have done really well with themselves, we wear that kind of as a badge of honour.\n\n\"So I'm really, really proud of that. I think our families and communities are pretty proud of that too.\"\n\nHailing from the country, Xavier Duursma reached 100 games this weekend in the AFL. (Getty: Michael Willson/AFL Photos)\n\nWithout their parents, Dean and Susie, driving countless hours to get them to training or games, Duursma said he and his siblings would never have made it to the AFL.\n\n\"Sometimes, when you're a kid, you don't fully understand it, you don't fully grasp it, but when looking back at it now, it's incredible the amount of love, care and time that they put into us,\" he said.\n\nAnd country footy does have one advantage on the city.\n\n\"Don't tell my high performance staff but I don't mind the pies down there at Foster. They go pretty well - also the strawberry donuts,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/coronial-inquiry-into-orroral-valley-bushfire-outside-act/105412176",
        "title": "Breaking: Inquiry into Orroral Valley fire finds helicopter crew made 'error of judgement'",
        "publish_date": "Fri, 13 Jun 2025 01:24:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "An inquiry into the devastating Orroral Valley fire near Canberra in 2020 has found the crew of a helicopter who accidentally started the blaze during a toilet stop made an \"error of judgement\" in not notifying authorities of the fire.\n\nACT Chief Coroner Lorraine Walker found it was not plausible the crew of the helicopter did not appreciate the need to tell someone immediately about the location of the fire after they started it in remote bushland.\n\nThe fire burned for five weeks, destroying 80 per cent of the ACT's Namadgi National Park at the height of the Black Summer bushfires.\n\nIt also burned into New South Wales, destroying homes and farms in its path, including at Bumbalong.\n\nToday the Chief Coroner said the delay was a significant error of judgement and delivered recommendations which included better lines of communication with local authorities and better training.\n\n\"The failure of anyone on board ANGEL 21 [the helicopter] to report the OVF [the fire] at the earliest opportunity was an error of judgement,\" she said.\n\nA photograph taken from the Defence helicopter that began the Orroral Valley fire, just moments after it was accidentally set. (Supplied: Department of Defence)\n\n'We started a fire'\n\nIn handing down the findings, the Chief Coroner released a transcript of a conversation between members of the helicopter crew which occurred about 50 seconds after landing, and which was captured on the flight recording.\n\nUnidentified male: We started the fire. We started a fire. Unidentified male: Turn the searchlight off now. Unidentified male: Come up. Come up. Come up. Unidentified male: Come up. Come up. Unidentified male: Just-just wait, wait, wait, wait guys. Just wait. Unidentified male: We have got a fire under the aircraft Unidentified male: We have got a fire. Unidentified male: Are you-are you set? Take it over. All right. Control. Are you set in the back? Are you set in the back? Unidentified male: Yes. Unidentified male: (indistinct) set the back. Clear up. come up straight … Unidentified male: And that is quite large. Unidentified male: Yep f*****g searchlight. Dammit.\n\nSomeone identified that the fire was directly under the aircraft and \"spreading fast under the fuselage\".\n\nThe Chief Coroner said the aircrew did the correct thing by assessing the state of the aircraft and determining whether to attempt to return to Canberra Airport.\n\n\"They are both to be commended for their professionalism in doing so,\" she said.\n\n\"However, just as one would expect any ordinary citizen to report a significant fire to the relevant authorities, particularly in a time of heightened risk, as participants in Operation Bushfire Assist it was incumbent on all ADF personnel to do so.\n\n\"It is not plausible, despite the highly stressful situation, that no consideration was given to the significance of the fact that the actions of this crew, inadvertent and unanticipated though they were, had just caused a major fire.\"\n\nChief Coroner Walker made eight recommendations around risk assessments, communications and systems.\n\n\"This matter has taken far too long to be finalised,\" she said.\n\n\" Without demur, I offer my apologies to those affected by the fire and its aftermath, in the various ways in which that has occurred. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-13/farm-plastic-waste-recycling-repurpose-bags-twine/105035950",
        "title": "Farm plastic recycling to deal with thousands of tonnes of waste",
        "publish_date": "Fri, 13 Jun 2025 01:01:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tonnes of plastic farm waste is being turned into new products with the development of recycling techniques by the agricultural industry and engineering researchers.\n\nEach year, Australian farms go through an estimated 110,000 tonnes of plastic waste, but recycling options for soft plastics and twine in particular are limited.\n\nKey players in Australia's grain industry unveiled a plan earlier this year to stop 45,000 tonnes of agricultural bags from going to landfill or being illegally incinerated.\n\nResearchers at a regional Victorian university have also helped to develop a machine to melt down synthetic hay binding twine and repurpose it into building products and furniture.\n\nA pile of synthetic hay bale twine that will be repurposed into furniture and building materials. (Supplied: La Trobe University)\n\n'Leap forward for sustainability'\n\nAn industry-led, not-for-profit program to collect and recycle plastic agricultural bags is underway in Victoria with plans to expand it in the coming years.\n\nThe bagMUSTER scheme is similar to the program used for chemical drums, allowing farmers to return their used soft plastic bags to stores for recycling.\n\nCropLife Australia chief executive Matthew Cossey helped develop the program and said the bags used for fertilisers, seeds, grain, stock feed, and pet food are turned into new agricultural products.\n\n\"It's a huge leap forward for farm recycling,\" he said.\n\nUnder the bagMUSTER program, farmers can return their agricultural bags for recycling. (ABC Rural: Jane McNaughton)\n\n\"When a farmer buys a product in the bagMUSTER program, they'll be able to return it to the retailer, and then it will be collected and fully recycled. It's as simple as that.\n\n\" It's critical for farming sustainability, for protecting our environment, improving recycling and it absolutely makes economic sense. \"\n\nTwine trouble\n\nPlastic cords used to bind hay, straw and other crops are often seen piling up in farmers' sheds, contaminated with soil, animal waste and other residues.\n\nMost of the twine ends up in landfill or is burnt on farms.\n\nLa Trobe University researchers in Bendigo have helped develop a machine to melt and re-form the twine into useful, durable products.\n\nEngineering Associate Professor Ing Kong said the twine could be turned into garden planters, outdoor furniture, and construction materials such as decking or fence posts.\n\n\"There has been no incentive to recycle bale twine because it is a single-use, bulky and contaminated product with dirt, small rocks and such,\" Dr Kong said.\n\n\"But this particular machine, invented by Rtech, can actually take a significant amount of contaminate and still process it.\"\n\nIng Kong says the melting machine is a cost-effective way to recycle plastic twine. (Supplied: La Trobe University)\n\nDr Kong said the melting machine was much more cost-effective than comparable machines and was designed so it could be used on-farm.\n\n\"It can be owned and installed easily by anyone, it's economical, and takes up a small space,\" she said.\n\n\"If a farmer has a constant amount of plastic waste, they can recycle it on site into 1-metre cubes, and have the waste ready to be manufactured either locally or exported.\"\n\nPlastic disposal a pain\n\nAustralian Seed Federation chief executive Katherine Delbridge said the disposal of plastic waste had long been a pain for farmers.\n\n\"We have plastic for a reason. It protects products. But we know we have a responsibility to do something with that plastic,\" she said.\n\nAgsafe's Matthew Cossey (middle) and Alicia Garden (left) with Australian Seed Federation's Katherine Delbridge. (ABC Rural: Jane McNaughton)\n\nMs Delbridge said the cost of disposing seed bags into landfill was prohibitive for many farmers.\n\n\"Because there hasn't been a supply chain for this plastic before the frank matter is people have been burying and burning this plastic on-farm.\"\n\nAgsafe general manager Alicia Garden welcomed the advancements in recycling but said there was still a long way to go.\n\n\"About 15,000 tonnes of soft plastic recycling is available across all industries per year — consumer, mining, agriculture. It's a really constrained bottleneck,\" she said.\n\nWoven polypropylene bags are often used to keep seed, feed and fertiliser fresh, but have limited disposal options. (ABC Mid West Wheatbelt: Jo Prendergast)\n\n\"Regulatory change about 18 months ago means that we can't use recycling facilities overseas; we have to recycle here in Australia.\n\n\" I've heard estimates that 30–35 per cent of [some] regional landfill is full of bulka bags, woven polypropylene bags. That's why we chose this kind of plastic to go after. \"\n\nMs Garden said developers were now looking at ways to recycle other plastic waste on farms, such as silage wrap.\n\n\"There is a dedicated facility [for that] being built in Albury, which we expect will be online late this year or early next year,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/us-open-golf-adam-scott-leads-australian-charge/105412188",
        "title": "Late lapses cost Scott, as American hits fourth albatross in US Open histroy",
        "publish_date": "Fri, 13 Jun 2025 00:06:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian veteran Adam Scott has suffered another dispiriting late lapse in his opening round at the US Open after a rousing early first-day effort at the fearsome Oakmont course.\n\nScott, leading the Aussie charge at the testing Pennsylvanian course, was right in the thick of the early hunt for the clubhouse lead overnight as, starting from the 10th hole, he reached the turn in two-under.\n\nBut dropped shots at the third and eighth holes — his 12th and 17th — dragged the 44-year-old back to level par, four shots adrift of the early pacesetter, American JJ Spaun, who recorded a superb bogey-free 66.\n\nAmong the early wave, Scott, competing in a remarkable 96th consecutive major championship dating back to the 2001 British Open, was still in a top-10 position as Oakmont began to bare its teeth.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nScott's round was a topsy-turvy affair from the start, as he recorded three bogeys and five birdies in his first nine holes, but as often has been the case in recent years, he was unable to prevent an accident-prone finale.\n\nYet the 2013 Masters champion still enjoyed a much better start than the current green jacket holder Rory McIlroy, who ended up eight shots back after a four-over 74.\n\nAustralia's \"two Cams\" both suffered disappointing starts, with Cameron Davis also shooting a 74, while Cameron Smith couldn't muster a single birdie in a 75 that featured five bogeys.\n\nMarc Leishman was the final Australian to play on Thursday, local time, starting from the 10th tee. Leishman struggled off the tee, hitting just three fairways in his round.\n\nTwo bogeys in his first five holes were then followed by birdies at the 15th (sixth hole played), second (11th hole played) and fourth (13th hole played) holes to be one-under.\n\nBut two bogeys and three pars to finish the round left Leishman with a one-over, 71.\n\nThe pre-tournament talk had been all about how challenging the Oakmont Country Club course would be but Spaun produced a remarkable effort, only the eighth bogey-free round ever in a US Open there.\n\nThe 34-year-old Spaun, who lost to McIlroy in a play-off at The Players Championship in March, recorded his lowest-ever round in a major in stifling early conditions.\n\nSouth Korean Kim Si-woo, whose birdie attempt at his final hole just missed, finished two shots off the pace while American Ben Griffin was a further shot adrift after mixing three birdies with two bogeys.\n\nSpaun, who started on the back nine, had a spectacular start reaching the turn with four birdies to become the first player ever to cover the first nine in the opening round of an Oakmont US Open in 31 strokes or fewer.\n\nThe most dramatic shot of the day was Patrick Reed's amazing second on the 621-yard fourth hole, which the former Masters champ holed from 286 yards for only the fourth albatross in US Open history, since records were kept from 1983.\n\nOthers to have recorded an albatross at the US Open were T.C. Chen (1985 at Oakland Hills), Shaun Micheel (2010 at Pebble Beach) and Nick Watney (2012 at Olympic).\n\nDefending champion Bryson DeChambeau, looking to become the first repeat US Open winner since Brooks Koepka in 2018, struggled in the penal rough to go around in 73.\n\nBut McIlroy's bright start, as he made two early birdies, ended up giving way to a wayward second nine as he made four bogeys over a seven-hole stretch.\n\nTournament favourite Scottie Scheffler was going out with the late starters alongside two-time major winner Collin Morikawa and European star Viktor Hovland.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/gippsaero-new-aircraft-production-airvan-plane-latrobe-valley/105267742",
        "title": "Family aviation firm promises more jobs after taking back control",
        "publish_date": "Thu, 12 Jun 2025 23:46:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Manufacturers of a new aircraft say it will boost jobs in Victoria's Latrobe Valley after a founding family of the airline business reclaimed it from foreign hands.\n\nGippsAero was established by self-described \"air nut\" George Morgan and Peter Furlong in Gippsland in 1984.\n\nIn the beginning, they altered existing crop-dusting planes to suit customer needs and requests.\n\nThey went on to design, manufacture and sell more than 300 aircraft from their Gippsland base to customers around the world.\n\nA ceremony was held on Thursday to mark a return to local production by laying the keel of the company's new-model plane, a GA8 airvan.\n\nThe plane, which is set to take flight in 2026, will be used in tourism, skydiving, surveillance, and humanitarian and freight operations.\n\n\"It is a bit emotional, after a lifetime's effort of getting it all back together again after the global financial crisis and COVID, and to be supported as we are by the operators worldwide, it is quite amazing really,\" GippsAero chief executive George Morgan said.\n\nGeorge Morgan helps lay the keel for the official relaunch of production. (ABC Gippsland: Danielle Pope)\n\nAustralian-made aero\n\nGippsAero, which was formerly Gippsland Aeronautics, started work in 1993 designing the eight-seater GA8 airvan.\n\nIt was eventually certified in 2000.\n\nThere are now more than 260 of the airvans operating in 43 countries around the world.\n\nThe company's other design, the GA200, is flown in Australia, New Zealand and China.\n\nThe company employed up to 180 local people to send one GA8 airvan out the factory door every two weeks.\n\nLatrobe City councillor Darren Howe said the promise of new local jobs had created a buzz as the region transitioned away from a coal-fired power industry on which it had been so heavily reliant.\n\n\"It's good for our unemployed to see that there's new industry coming to Latrobe City, and for those who are thinking of moving here, we've got great livability, we've got great facilities, and this is the next piece of the puzzle,\" he said.\n\n\"Let's get some jobs.\"\n\nThe GippsAero GA200 light agricultural aircraft was designed in the Latrobe Valley. (ABC Gippsland: Danielle Pope)\n\nTurbulent time\n\nThe path has not been smooth for George Morgan and his GippsAero team.\n\nThe global financial crisis of 2008 hit the company hard and, in 2009, all the forward orders for its aircraft were cancelled by customers as they grappled with economic uncertainty.\n\nWith investors wanting to pull out of the company, Gippsland Aeronautics was sold to Indian multinational company, Mahindra Aerospace.\n\nGippsland Aeronautics co-founder Peter Furlong stepped back from the business at the time due to ill health.\n\nHe died in 2017.\n\nMahindra kept on many of the existing staff and changed the company name from Gippsland Aeronautics to GippsAero.\n\nIn 2012, GippsAero launched the GA10 airvan, its first 10-seater aircraft.\n\nBut in 2020, it halted production and scaled back to a parts supply outfit for existing customers.\n\nSo when Mr Morgan bought back his company from Mahindra in November 2023, it represented much more than a business transaction.\n\n\"A lot of people were watching, could we manage to get back into production?\" he said.\n\nSpeaking at Thursday's launch, Mr Morgan described rebuilding the company with fewer than a dozen original employees left on the books.\n\n\"We had a plan and we always had faith we could do it,\" he said.\n\n\" I never had any doubt that we could get back to this. \"\n\nKristy How and Lorraine MacGillivray were at the GippsAero launch. (ABC Gippsland: Danielle Pope)\n\nEdge Aviation founder and pilot, Lorraine MacGillivray, said the revival was good news for the region and the airline industry overall.\n\nHer husband, Bob MacGillivray, was the chief design engineer for the original GA8 design.\n\n\"The people involved in this production have been through a lot, and for manufacturing in Australia it's very important,\" she said.\n\n\"It's quite emotional for a lot of people who have been around this aircraft for its lifetime.\n\n\"I'm sure Peter [Furlong] is watching over all of this and is very happy.\"\n\nAt the launch are (from left) George Morgan, Danny O'Brien, Martin Cameron, David Morgan, Darren Howe, Bruce Connolly and Leanne Potter. (ABC Gippsland: Danielle Pope)\n\nSky is the limit\n\nThe company is employing 43 full-time staff and seven apprentices.\n\nMr Morgan said the new GA8 airvans should be operational next year, but the company only had a third of the workforce needed to get the planes off the ground.\n\n\"It means jobs, jobs, jobs for the valley,\" Mr Morgan said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/air-india-plane-crash-live-updates/105412530",
        "title": "Live: Air India crash kills 229 passengers, 12 crew with one survivor",
        "publish_date": "Thu, 12 Jun 2025 23:41:30 +0000",
        "category": "finance",
        "authors": [
            "Louise Miolin",
            "Gemma Ferguson",
            "Georgie Hewson",
            "Liana Walker"
        ],
        "text": "James Nixon is an aviation industry analyst.\n\nHe thinks footage of the crash indicates a pilot error.\n\n\"This isn't a bird strike, and it's not even an engine failure — there's no popping, and there's no smoke pouring out the back.\n\n\"This appears very much to be a pilot ... crash, not an aeroplane problem,\" he told Kathryn Robinson on ABC Sydney Mornings.\n\nAuthorities are still looking for the plane's black box to help figure out what caused the crash.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/olympian-heath-ryan-suspended-by-equestrian-australia/105412338",
        "title": "Equestrian Australia suspends Olympian who was filmed whipping a horse",
        "publish_date": "Thu, 12 Jun 2025 23:21:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Olympian Heath Ryan has been suspended by Equestrian Australia after a video emerged that appeared to show him repeatedly whipping a horse.\n\nRyan, 66, represented Australia in dressage at the Beijing Olympic Games in 2008.\n\nThe video — reportedly about two years old — shows a man striking a horse around 40 times. Ryan issued a statement saying he was acting in \"the horse's best interest\".\n\nRyan said the horse, named Nico, came to him after an accident that resulted in a female rider needing hospital treatment.\n\nThe Australian said Nico \"had always been a problem child and would just not stop\" and after the video he was able to rehome the horse.\n\n\"I am so sad this was caught on video. If I had been thinking of myself I would have immediately just gotten off and sent Nico to the knackery,\" Ryan said.\n\n\"That video was a life or death moment for Nico and I genuinely had to try my very hardest to see if Nico would consider other options.\n\n\"All of this transpired sincerely with the horse's best interests the sole consideration. Unbelievably it was so successful for everyone except me with the release of this video.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBritain's three-time Olympic champion Charlotte Dujardin missed the Paris Games last year after a video emerged of her repeatedly striking a horse around its legs with a long whip. She was subsequently banned for a year by the FEI, equestrian sport's world governing body.\n\nAfter the Ryan video drew attention, Equestrian Australia said it had received a formal complaint about one of its members and had imposed a provisional suspension from all competitions and events.\n\n\"Equestrian Australia is extremely alarmed and concerned by the treatment of the horse shown in this footage,\" a statement read.\n\n\"Our policies include high standards to protect all participants and their horses against any adverse physical, social, and emotional conditions.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/amy-wang-slanted-sydney-film-festival/105374194",
        "title": "The Australian behind the Crazy Rich Asians sequel on her debut feature",
        "publish_date": "Thu, 12 Jun 2025 23:17:24 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Growing up, Amy Wang's father lovingly packed her lunch for school. And each day, she'd throw that lunch in the bin.\n\nThroughout her primary years, and even into high school, she remembers being embarrassed by the intricate Chinese meals.\n\n\"I'd get teased,\" the now 34-year-old says.\n\n\"I would beg for like, white bread, ham, cheese, Vegemite, just simple ingredients — like, give me spam!\n\n\"It sounds so weird but it was what I wanted because every other white kid had that.\"\n\nJoan Chen dreams of being just like cool-girl Olivia Hammond, who's played by real-life influencer Amelie Zilber. (Supplied: Sydney Film Festival)\n\nThe memory serves as the jumping-off point for her feature film debut, Slanted, which premiered at the Sydney Film Festival this week after winning the Narrative Jury Award at South by South West (SXSW) in Austin earlier this year.\n\nWang's now based in LA after moving to the States at 19, and is behind a string of projects, including the upcoming Crazy Rich Asians 2. But while she's set her satirical body horror in the US — with a notable cast of up-and-comers to boot — it's rooted in the racism and the struggle to belong that plagued her throughout her childhood in Sydney.\n\n\"In my early teens, I would think a lot about: 'Wouldn't life just be easier if I was white?'\n\n\"So, the concept [for the film] came from, 'OK, what if she gets what she wants? Then what happens?'\"\n\nFrom Duolingo to nose pegs\n\nSlanted sees Wang's morbid teenage dream come true, as aspiring prom queen Joan Huang (Shirley Chen) signs up for a radical surgery to change her race.\n\nSlanted takes racial transformation a step further than a peg on the nose. (Supplied: Sydney Film Festival)\n\nLike her protagonist, Wang moved to the West from China at seven years old, without speaking a word of English.\n\nShe moved primary schools five times, forced to make friends and fit in at each new school.\n\nShifting these experiences to an all-American setting was \"very entertaining\", and puts her debut in the realm of Hollywood classics like Mean Girls.\n\n\"It was fascinating as an outsider. I didn't know about [how US students] say the Pledge of Allegiance every morning. It's like: 'Are you guys in a cult?'\"\n\nPart body horror, part teen comedy, Slanted takes its satire to sci-fi extremes.\n\nPre-surgery, Joan tries everything to fit into the beauty standards of blonde idols like Taylor Swift and Sabrina Carpenter — using race-altering Instagram filters (which really do exist) and pegging her nose in an attempt to look less Chinese.\n\n\"The peg on the nose — I used to do it when I was in high school, trying to make it smaller and pointier, like a white person's nose,\" Wang says.\n\n\"I've had Asian girls or even African-American girls come up to me [after screenings] being like: 'I used to do that too!'\"\n\nSlanted's protagonist Joan soon becomes Jo, with the cast and director taking home the SXSW Narrative Jury Award. (Getty: Gilbert Flores)\n\nJoan gets the nose she's always dreamed of post-surgery when she transforms into another (white) person entirely: Jo Hunt. This new Joan is played by the increasingly noteworthy McKenna Grace, who spent months on Duolingo to nail the tonal intricacies of Mandarin.\n\nAs Jo distances herself from her old life, she soon discovers all the privileges of no longer being a minority: \"I don't have to be Asian-American, I can just be American.\"\n\nSatirising stereotypes\n\nWang didn't actually meet her dad, who emigrated ahead of her and her mum, until she moved to Australia at seven.\n\nBut the paternal role is central in the film as Joan is spoiled by her sweet, gentle father and showers him with affection in return, but pushes back against her mother's attempts to connect, in a show of peak teen angst.\n\n\"I feel like there are a lot of media portrayals of Asian men who are toxic gamblers and drunks,\" Wang says, adding that Asian women are often stereotyped as tiger mums.\n\n\" I think for me, what was important was to portray an Asian family who was supportive. \"\n\nAnd it's this familial bond that makes Joan's transformation — which her parents take as a rejection — all the more heartbreaking.\n\nAmy Wang has made her directorial debut with Slanted, a deeply personal satire based on her experiences of racism growing up in Australia. (Getty: Robby Klein)\n\nAs technology, plastic surgery, social media and AI move well beyond the nose peg of Wang's own teen years, she's fascinated by the way attitudes towards race are changing.\n\nFilm with no script wins major Berlin prize Photo shows Two young women sit under an iridescent sheet Fwends is a uniquely Australian story that follows two 20-somethings who travel interstate to revive their long-distance friendship.\n\n\"Nowadays, more than ever, a lot of Western beauty standards are actually imitating Asian beauty standards; cat-eye make-up, tanning and all of those things.\n\n\"It's really interesting to think about what that means, when you're rejecting the actual person of a Chinese Australian girl, but you're white and you're trying to emulate pieces of what she represents, getting the best of both worlds.\"\n\nWhile Slanted's transformative \"ethnic-modification surgery\" is hopefully still a long way off, TikTok is full of Asian influencers getting nose jobs, opting for a more Western look.\n\n\"When I was growing up, you had people like Britney Spears, but none of them had much work done, compared to today's role models,\" Wang says.\n\n\"There are so many more ways for girls to compare themselves to each other now.\"\n\nSlanted will screen on June 15 as part of the Sydney Film Festival, with an Australia-wide cinematic release yet to be confirmed.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/bayswater-coal-fired-power-station-at-40-years/105403800",
        "title": "Workers at 40yo power station excited for 'transition out of coal'",
        "publish_date": "Thu, 12 Jun 2025 23:08:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "It has been 40 years since Bayswater Power Station near Muswellbrook first roared to life.\n\nAt its peak, Bayswater was the largest energy supplier to the New South Wales grid.\n\nThis week, past and present employees gathered to celebrate the past 40 years while staring down a future beyond coal-fired power.\n\nBayswater will not make it to 50, with the site scheduled to power down in 2033.\n\nAGL's transformation lead Shaun Green said it could be daunting looking towards an unknown future.\n\nShaun Green says there are exciting times ahead for the site. (ABC Upper Hunter: Sean Murphy)\n\n\"If you go back a decade, we had no idea that it would look like this,\" he said.\n\n\" We thought that Bayswater would probably be here forever. \"\n\nBut he remained optimistic about the industry's future.\n\n\"It is very exciting what we've got planned with our future and the transition out of coal,\" Mr Green said.\n\nChris D'Hotman started at Bayswater as a mechanical engineer and is now the head of generation and revenue.\n\nChris D'Hotman is proud of his role in powering the state. (ABC Upper Hunter: Sean Murphy)\n\nHe said, despite the move away from coal-fired power, the staff had immense pride in their work.\n\n\"We do it because we know what we're doing is powering the economy,\" Mr D'Hotman said.\n\n\" We're keeping those defibrillators going in the hospitals, we're keeping people warm at night. \"\n\nAgeing infrastructure\n\nBayswater Power Station supplied 20 per cent of the state's electricity across 40 years. (ABC Upper Hunter: Sean Murphy)\n\nAs the 2033 closure date looms, maintenance costs continue to rise and planned and unplanned outages increase at Bayswater.\n\nIt is part of a wider trend that contributes to rising power bills.\n\nAGL will spend more than $130 million and switch off one of four units for planned maintenance at Bayswater this September, which it does on a four-year cycle.\n\nBayswater-Liddell general manager, Len McLachlan, said costs inevitably increased as infrastructure aged.\n\nLen McLachlan says Bayswater requires more maintenance as it ages. (ABC Upper Hunter: Sean Murphy)\n\n\"Most of the equipment was built [in the 1980s] and mainly stays the same … so we do need to fine-tune it,\" he said.\n\n\"Definitely, ageing plants can contribute to [higher prices], but I think it's more so just the fact that the energy industry is changing so much.\n\n\" There's a combination of things leading to higher prices, there's a necessary transition taking place. \"\n\nCase against extending 'expensive, improbable' coal-fired power Photo shows An aerial view of poweer station with two large smoke stacks Coal-fired power stations are unreliable and driving up electricity prices, according to a new report on the eve of a federal election campaign in which the viability of keeping plants going longer will be a key focus.\n\nBill hike\n\nA report from Reliability Watch using data supplied by power station operators to the Australian Energy Market Operator (AEMO) revealed how unreliable the power station was.\n\nOne of Bayswater's four units was completely offline from October 1, 2024, until February 19, 2025.\n\nMeanwhile, there were nine other outages across the site's other three units between October and March.\n\nThe Australian Energy Regulator has warned NSW customers they are in for a hefty increase to their power bills of between 7.9 to 9.7 per cent from July 1.\n\nAEMO has linked increasing outages at ageing coal-fired power stations in the final quarter of 2024 to record-high wholesale prices.\n\nInstitute for Energy Economics and Financial Analysis lead Australian electricity analyst Johanna Bowyer said that when power stations went offline for repairs and maintenance, more expensive forms of power, such as gas, were used to fill the gaps.\n\nJohanna Bowyer says the reliability of coal-fired power stations decreases significantly by the 40-year mark. (Supplied: IEEFA)\n\nShe said this pushed up wholesale electricity prices.\n\n\"In these periods of time when you have coal outages, that is often coinciding with higher wholesale power prices,\" she said.\n\nShift to renewables\n\nBayswater has provided about 20 per cent of NSW's electricity over the past four decades.\n\nBut at Bayswater's age, Ms Bowyer said its days were numbered.\n\n\"We've seen coal generators over the age of 40 years decline to have an average availability of 65 per cent, so only 65 per cent of their capacity available to market,\" she said.\n\nLabor's $1 billion to launch Australia solar panel production Photo shows Several rows of solar panels with a wind turbine in the background. One in three Australian households have solar panels, but only 1 per cent are made here. There are hopes a new federal government program will change that.\n\nWith coal-fired power stations set to close, renewable projects have been emerging to take their place, including plans for a solar panel manufacturing site at nearby Liddell Power Station.\n\nMeanwhile, AGL is also pushing forward with its Hunter Energy Hub, which includes solar and wind projects as well as battery storage.\n\nChris D'Hotman said he \"often considers\" if he will need to change careers by moving into the renewable industry.\n\n\"Renewables are expanding at such a rapid rate,\" he said.\n\n\"It's something that we in the coal-fired sector ought to know more about.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/nt-prison-lockdowns-police-watch-houses-budget-estimates/105409586",
        "title": "Lockdowns 'all of the time' across NT prisons, as inmate numbers soar",
        "publish_date": "Thu, 12 Jun 2025 22:48:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory corrections commissioner says lockdowns are occurring \"all of the time\" at every NT prison, as inmate numbers continue to soar.\n\nMore than 1 per cent of the Northern Territory's population is incarcerated, with Department of Corrections (DOC) figures showing 2,834 people were behind bars as of Thursday.\n\nHalf of the people in jail are on remand, with the total prison population rising by 600 since the Country Liberal Party (CLP) was elected last August.\n\nDue to the rising prisoner numbers and staff shortages, lockdowns have been frequently implemented by the DOC.\n\nMore than 1 per cent of the NT's population is in prison. (Supplied)\n\nResponding to a question at budget estimates in NT parliament on Thursday, Corrections Commissioner Matthew Varley said he could not provide a specific figure on the number of lockdowns at adult prisons since September.\n\nInstead, he said there were \"lockdowns across all of the facilities all of the time\".\n\n\"[The number of lockdowns has] been substantial in the last number of months because of the rate of prisoner growth and the stretch that we have experienced,\" Commissioner Varley said.\n\n\" I would expect there would be some version of lockdown in most facilities most days. \"\n\n$460k repair works at Alice Springs jail Photo shows A tall fence with razor wire attached at the bottom and top. Blue sky and some jail buildings in the background. Overcrowding in the Alice Springs jail has contributed to a $460,000 repair bill at the facility.\n\nCommissioner Varley said it was difficult for the DOC to provide specific lockdown data, because they occurred \"in a range of scenarios\".\n\n\"From a cell or block or wing being locked down, to entire facilities,\" he said.\n\n\"It is relatively rare for a lockdown of an entire facility to occur because of the nature of staff shortages.\n\n\"What is more likely to occur is that the entire facility is locked down for short periods of time, depending on operational events.\n\n\"But [it is] more likely that various parts of the prison, various wings and cells are locked down … what we call rolling unlocks, which are staged locks and unlocks throughout the day.\"\n\nDuring the budget estimates session, the DOC did provide data on lockdowns in youth detention facilities.\n\nActing Deputy Commissioner Sasha Dennis said there were 25 \"rotational lockdowns\" between July 2024 and the end of March this year.\n\n\"They are due to operational requirements, such as low staffing or high levels of escorts, including court, medical, and leave of absences — requiring transport of young people outside of the facility,\" she said.\n\nThere were 55 youths in detention on Thursday, according to the DOC.\n\nPrisoners continue to be held in watch houses\n\nThe territory's three adult jails and two work camps cannot accommodate the entire prison population.\n\nPrisoners who cannot fit into those facilities are being held in police watch houses, where DOC staff have not been present since March.\n\nDuring budget estimates, Corrections Minister Gerard Maley said there were 70 prisoners in police watch houses as of Thursday.\n\nOf the 70 prisoners, 51 were being held at Palmerston watch house, 10 at Katherine watch house and nine at the watch house in Alice Springs.\n\nGerard Maley says there were 70 prisoners in police watch houses as of Thursday. (ABC News: Dane Hirst)\n\nMr Maley said 20 prisoners at the Palmerston watch house had been held there for more than a week, with one prisoner's stint stretching to 14 days as of Thursday.\n\nWhile in a watch house, prisoners do not leave their cell and lights remain on 24 hours a day, Mr Maley confirmed.\n\nMore than $19 million spent on overtime\n\nIn February, the NT government passed legislation allowing it to hire private and interstate guards to work in the corrections system.\n\nThe government subsequently contracted private security firm G4S to manage prisoner transfers in Darwin, in a bid to boost the overall workforce and reduce overtime payments.\n\nDuring budget estimates, Commissioner Varley said the overtime bill \"for custodial operations\" between July 2024 and the end of March this year reached $19.23 million, for 266,000 extra hours worked.\n\n\"That's an average of 355 hours per prisoner,\" he said.\n\n\"By the time we get to June 30, we'll probably end up with an overtime bill similar to what we did last year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/sheepdog-trials-welcome-young-women-in-male-dominated-sport/105348994",
        "title": "Young women and canine sidekicks take the lead in once male-dominated sport",
        "publish_date": "Thu, 12 Jun 2025 22:31:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Annie Doecke's connection with her five-year-old border collie, Mini, is growing stronger every day.\n\nThe pair share a love of sheepdog trialling, and travel from their home base in Point Sturt around South Australia to compete and improve their skills.\n\nNow in her third year of trialling, Ms Doecke entered Mini — known as Andrina Jenny in competitions — in the Barmera Sheepdog Trials over the June long weekend.\n\nIn the Trans-Tasman trial, Ms Doecke and Mini placed 14th with a score of 53 among 39 finishers.\n\nMs Doecke was one of a dozen women entrants — five more than last year — in the five-day event in South Australia's Riverland.\n\nBorder collies are one of the most common breeds for working livestock in Australia. (ABC Riverland: Elyse Armanini)\n\nShe is part of a growing number of young women joining their older counterparts in the once male-dominated sport.\n\n\"As women, we're often a little bit hesitant to put ourselves out there,\" Ms Doecke said.\n\n\"It's really encouraging to see women out there succeeding and just smashing it.\n\n\"Quite a few younger girls [are] getting into it, and it's really cool being able to encourage them as well.\"\n\nThe field's changing diversity has been noticed and welcomed by many in the trialling community who say it is a positive sign for the future of the sport.\n\nThree sheep are randomly selected to be herded through the trial obstacles by the competitor and their dog. (ABC Riverland: Elyse Armanini)\n\nLove of the sport\n\nSA Working Sheepdog Association's former president Milton Cross has been involved in sheepdog trials for more than 40 years.\n\nA grain and livestock farmer in the Strathalbyn area, Mr Cross spends his \"spare time\" running a sheepdog training school, which Ms Doecke attended.\n\nAnnie Doecke says Milton Cross has been encouraging and supportive while helping her prepare for sheepdog trials. (ABC Riverland: Elyse Armanini)\n\n\"Women are getting out there and they're doing the stock work, the hard work, alongside the guys,\" Mr Cross said.\n\n\"They quite often have a better way with livestock and more patience with training dogs.\n\n\"We're seeing that now coming through in trialling, possibly half of the trial is now women, and at training school, that's definitely at least half.\n\n\"They get to work with their best mate every day and they're good at it.\"\n\nOf his three children, only 18-year-old Charlotte Cross has followed in the sheepdog trialling footsteps of her father.\n\nShe entered the Royal Adelaide Show last year and placed fourth in her first attempt at an open trial with the family's dog Rivercoe Roy.\n\nCharlotte Cross says she has been travelling to sheep dog trials with her dad, Milton, her whole life. (ABC Riverland: Elyse Armanini)\n\n\"We've been going to trials my whole life … I've always loved being around the dogs,\" Ms Cross said.\n\n\"I've got two of my own dogs. I'm hoping to get at least one of them trained up to continue trialling because I find it fun.\n\n\" It's often just been old men at the top level, so it's really inspiring to see women get there. \"\n\nMini the border collie working sheep during the 2025 Barmera Sheepdog Trials. (ABC Riverland: Elyse Armanini)\n\nThe right dog for the job\n\nSheepdog triallers do not just go from farm to field — a lot of training and bonding between dog and handler is required.\n\n\"When I first started, I had this little kelpie who's a really good farm dog, but she just doesn't have the head for trialling,\" Ms Doecke said.\n\n\"The dog I got from Milton, Mini, she just instantly kept the connection and it's really strong.\n\n\"Unfortunately, she lost her eye a couple of years ago, got a grass seed in there, but she does pretty well considering.\"\n\nMini is laser-focused on herding sheep and acting on Annie Doecke's commands. (ABC Riverland: Elyse Armanini)\n\nMs Doecke said Mini \"often knows best\" while training and competing.\n\n\"I'll tell her one thing and she'll notice that the sheep are drifting this way, and she'll just go and do the right thing,\" she said.\n\nHow to train a muster dog champ Photo shows Happy border collie pup runs in lush paddock towards camera If you're new to sheepdog trials, let's take a few steps back and revisit the basics with Muster Dog breeder Mick Hudson.\n\nMs Cross said popular culture, like the ABC's Muster Dogs, had contributed to the sport's growing popularity.\n\n\"I think people are seeing that and getting inspired with their working dogs, like collies and kelpies, and going, 'Maybe I could do that,'\" she said.\n\n\" Sheepdog trialling is a great way for them to be able to do that. \"\n\nBright future ahead\n\nThe National Sheepdog Trial Association has developed a scholarship program designed to assist and encourage young sheepdog triallers to continue competing across the country.\n\nAnnie Doecke travels with several dogs to trials around SA, but often competes with Mini. (ABC Riverland: Elyse Armanini)\n\nMs Doecke was awarded the inaugural scholarship in May.\n\nWith Mini by her side, she is hopeful for their future in trials together.\n\n\"[It] gives us support for travelling around to different trials so we can … just learn from some of the top triallers, and see them work their dogs,\" Ms Doecke said.\n\n\"Every time you go out there, you learn something new.\n\n\"I'm really looking forward to being able to use that, travel a bit more, and gain that experience.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/lidcombe-apartment-block-explosion-western-sydney/105412244",
        "title": "Wall of unit 'blown out' by explosion at Western Sydney apartment block",
        "publish_date": "Thu, 12 Jun 2025 22:22:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Emergency services have responded to an explosion at an apartment block in Western Sydney, which left one man unconscious.\n\nThe explosion occurred at an apartment block on Clarence Street in Lidcombe on Friday morning.\n\n\"What we've had is an explosion in a second-level unit of a three-level complex,\" Fire and Rescue NSW (FRNSW) Superintendent Adam Dewberry said.\n\n\"The wall of that unit and adjoining unit has been blown out.\"\n\nCar covered by bricks and debris. (ABC News)\n\nPart of the badly-damaged brick wall partially collapsed onto a car parked on the ground below.\n\nFRNSW was informed of the incident just before 6:30am, and at least 10 residents \"self-evacuated\" before help arrived, Superintendent Dewberry said.\n\nEmergency services arrived at the scene shortly after the explosion. (ABC News)\n\nAn unconscious man was located at the scene by emergency services, and he was rescued from the building and assessed by paramedics.\n\nThe 40-year-old man, was taken to Westmead Hospital in a serious condition with burns to his hands and face.\n\nHe has since regained consciousness, is in a stable condition and is assisting authorities.\n\nAnother man in his 60s was taken to Auburn Hospital for smoke inhalation.\n\nThe structural damage is being assessed by authorities. (ABC News: Danuta Kozaki)\n\nAll other residents in the building, approximately 40 to 50 people, have been accounted for.\n\n\"Our efforts will start to commence soon about getting some of their essential stuff such as medications ... there are some pets left in the building,\" Superintendent Dewberry said of evacuated residents.\n\n\" A number of these people will be displaced and not able to go back into their accommodation due to the damage. \"\n\nApproximately 40 to 50 residents were evacuated. (ABC News: Patrick Thomas)\n\nResidents describe 'shock' at explosion\n\n\"It was like 'boom', something blasted,\" resident Puja Shrestha told the ABC.\n\n\"Everyone was shouting, 'Let's go, out, out, out.' We looked around, grabbed our phones and laptops.\n\n\"We were shocked ... how could it happen?\"\n\nMs Shrestha wasn't yet sure when she would be allowed to re-enter her apartment.\n\nPuja Shrestha was awoken by the explosion noise. (ABC News)\n\nMs Shrestha said she believed she smelt gas following the explosion.\n\n\"The gas was leaking ... it was smelling like gas.\"\n\nInvestigations into explosion cause continue\n\nSuperintendent Robert Toynton from the Auburn Police Area Command said the specific type of explosion was still under investigation.\n\n\"We'll try and get the people back into their apartments as quick as we can,\" he said.\n\n\"We're looking at activating an emergency centre for those who need it. at the moment, most of our residents are looking after their own arrangements, but we're here to support them.\"\n\nSuperintendent Toynton said impacted residents were being assisted by police. (ABC News: Patrick Thomas)\n\nSuperintendent Toynton confirmed there was \"not a laboratory set up\" in the apartment, with police looking closely into whether the explosion was gas-related.\n\n\"There appears to be some sort of cause from within the apartment. One of the concerns is was there some type of gas in there.\"\n\nUtilities such as gas and power have since been isolated, and there was no fire.\n\nExperts remained on scene to monitor any movement of the apartment block, which appeared stable.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/preston-lions-racism-investigation-national-premier-league/105408738",
        "title": "Racist chant at soccer match referred to Football Victoria, police",
        "publish_date": "Thu, 12 Jun 2025 22:19:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "An investigation is underway after allegations some spectators racially vilified players at a soccer match in Victoria's highest-ranked football league.\n\nTwo spectators present at last Friday's match between Preston Lions FC and Heidelberg United FC told the ABC they heard fans in the Preston supporter area making \"monkey\" noises or a \"monkey-type\" chant, apparently directed to opposing team players of African descent.\n\nThe home soccer club, Preston Lions FC, said it was aware of the matter.\n\nIt said it had referred the incident to Football Victoria and Victoria Police, and an investigation was underway.\n\nFootball Victoria has confirmed it is investigating the incident.\n\nVictoria Police said it was aware of an incident at a soccer match in Reservoir on June 6, but had not received an official report.\n\nThe match was played in Reservoir in Melbourne's northern suburbs, as part of Victoria's National Premier League competition, which is Victoria's top-level football league and the second highest tier of soccer in Australia, below the A-league.\n\nIt was attended by hundreds of people, including families.\n\nAlleged chants came from Preston fan area, witnesses say\n\nTwo spectators, who were supporting Preston, told the ABC they heard the racist chants and believed they were coming from a small number of supporters of their own team.\n\nThe spectators, who did not want to be named, were sitting in an area designated for home club (Preston) fans only.\n\nThey believed the chants were being directed at Heidelberg FC players.\n\nThe ABC understands at least two people contacted the club to report the alleged abuse after Friday night's game.\n\nHeidelberg United FC players celebrate in front of Preston Lions fans at the NPL Vic game in Reservoir last Friday. (Facebook: Heidelberg United Alexander FC)\n\nPreston Lions FC general manager Jason Goldsmith told the ABC the club was aware of the issue and had referred it to relevant authorities but could not make further comment while it was being investigated.\n\nOn social media, the club released a statement saying it was \"concerned to learn of anti-social behaviour\" at the recent home game.\n\nIt said it was committed to implementing Football Victoria's Spectator Code of Behaviour, which explicitly bans \"racist chanting\".\n\n\"Football is for everyone … Any individual or group found to be in breach of these codes will face serious disciplinary action, including being banned from the club,\" the statement said.\n\nThe club would also create a phone number to allow spectators to immediately report anti-social behaviour during future games.\n\nHeidelberg United FC general manager Chris Pavlidis said he was surprised and disappointed to hear the reports but had not heard any complaints from his players or coaching staff of anything beyond \"stock-standard jeering\".\n\n\"If anything like that was brought to our attention we would have followed up with [football authorities] immediately,\" he said.\n\n\"None of the boys have approached us with a complaint.\"\n\nAlleged abuse occurred in context of already vocal, active crowd\n\nBoth clubs at the match, as with many suburban soccer clubs, have a proud history of active support and fierce rivalries amongst spectators, which is why fans of both teams were physically separated and sat in different areas.\n\nFormed by Greek migrants, the Heidelberg United Football club was formerly known as Alexander the Great, continues to feature him on the club crest and has ongoing ties to the Greek community.\n\nPreston Lions FC fans fill the stands at the game against Heidelberg United FC in Reservoir last Friday. (Facebook: Preston Lions Football Club)\n\nFormerly known as the Preston Makedonia, The Preston Lions Football Club was established by Macedonian migrants and continues to have strong links to Melbourne's Macedonian community.\n\nIn recent years, Preston has made efforts to attract players and fans from across the diverse community in Melbourne's northern suburbs.\n\n\"The reason we go to Preston is it's a very lively crowd, it's a great atmosphere,\" one of the attendees who heard the alleged abuse told the ABC.\n\nThe other spectator who spoke with ABC about the incident said he was a regular attendee at Preston games.\n\nHe said he was aware of the typical culture of active support within football, with booing and chants common at high-level suburban games — but this was different.\n\n\"When you step over the line into this overt racism, and specifically targeting black players, which it clearly was, it's just utterly and clearly unacceptable,\" he said.\n\nBoth spectators said the chant began in a context of a lot of booing that seemed to be disproportionately directed at Heidelberg's black players.\n\nBul Juach, number 9, in action during the match against the Preston Lions on Friday, June 6. (Facebook: Preston Lions FC)\n\nAmong those players was Heidelberg United forward Bul Juach, who was born in South Sudan and migrated to Australia aged 12.\n\nJuach scored the game's winning goal for the away team and celebrated the goal with teammates in front of the Preston supporter stand.\n\nIn a video broadcast of the game, the commentator noted Juach's celebration attracted \"a chorus of boos,\" which can be heard on the recording.\n\nWhile the alleged vilification cannot be heard on the video broadcast, the pair who spoke to the ABC, who were attending the game together, said it was clearly audible from within the stand.\n\nThe video broadcast shows goalscorer Bul Juach and teammates celebrating and being loudly booed by Preston Lions FC fans. (Youtube: Heidelberg United)\n\nThey said they heard other fans near them commenting on it too.\n\n\"Me and my friend could hear it, and we sort of looked at each other … like, 'is that what I think it is?' And then it was like, 'yeah, that is,'\" said one of the people who spoke to the ABC.\n\n\"My mates and I were talking about it and like, that's appalling.\n\n\" I've been to a lot of football matches and I have actually never experienced something like that. \"\n\nThe other spectator, who was attending the match with his 11-year-old son, said it was confronting especially for his son, who was not aware of the high-profile history of racial vilification in sports, like the booing of AFL great Adam Goodes.\n\nHe said he was glad the club was investigating the reports and hoped it would take action.\n\n\"Whether or not we can support this club moving forward really depends on how they respond,\" he said.\n\nBoth Preston Lions FC and Football Victoria said they could not provide further details on the incident while the investigation was underway.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-13/national-swimming-champs-lani-pallister-breaks-800m-record/105412110",
        "title": "Pallister breaks 800m record and embraces Aussie legend in emotional scenes",
        "publish_date": "Thu, 12 Jun 2025 21:46:42 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lani Pallister has smashed Ariarne Titmus's Australian women's 800m freestyle record set at last year's Olympic Games.\n\nPallister's time of 8:10.84 was more than a second faster than the old mark and five seconds under her previous personal best.\n\nIt also ranks as the third-fastest swim of the year.\n\n\"I'm pretty happy with that time,\" Pallister said, after sharing an emotional hug with godmother and Australian swimming champ Dawn Fraser poolside.\n\n\"I would have liked just under eight-ten, but I think it's a big three years coming up, so to do that on eight weeks, 10 weeks of work with everyone at St Peters is huge.\"\n\nThis year Pallister, who was previously coached by her mother Janelle Elford, moved to the St Peters squad in Queensland under Titmus's coach, Dean Boxall.\n\n\"I didn't know what time I was going [during the race],\" she said.\n\n\"Usually, I have a little look to see if I could see the scoreboard or not, but all I could see was Dean doing these ones [mimicking fast kicking], kicking his legs on the last 50 and I was like OK 'it's either going to be real close to my best time or close to the time we spoke about'. So yeah, I'm really happy.\"\n\nPallister said she was keen to get back to work to prepare for the World Championships in Singapore next month, but said the result doesn't change her goals.\n\n\"It doesn't really change much, I think I'm using this year just to race, have fun,\" Pallister said.\n\nHannah Fredericks and Kaylee McKeown hug it out after the women's 200m backstroke final. (Getty Images: Mark Brake)\n\nMultiple Olympic gold medallist Kaylee McKeown won her third title at the national swimming trials in Adelaide, taking out the 200m backstroke.\n\n\"I'm not going to be harsh on myself, I am happy with that,\" McKeown said.\n\n\"If I look back on my preparation for this year, I had four months, spent four months in a group where I wasn't finding myself really happy and made the decision a week before the national to move to Sunny [Sunshine] Coast.\n\n\"I still haven't got a house to live in, I'm in Airbnb's and it has been really a hard transition.\n\n\"It's just the things that people don't really see when you come in and race.\"\n\nLoading...\n\nDespite winning three out of three races at the nationals, McKeown has been either critical of her times, or lukewarm at best as she was on Thursday.\n\nHer time in the 200m was the fastest in the world this year, but she said it would count for nothing once the World Championships begin in Singapore next month.\n\n\"No, it doesn't matter what you do here, it depends what you do on the day in an international meet,\" she said.\n\n\"I could be doing world records here, get to an international meet and come last.\n\nCampbell says lack of pay behind swimmers' mental health struggles Photo shows Cate Campbell Cate Campbell believes Australia's swimmers would be in a better mental state if they were paid better and could afford time off as a result.\n\n\"So, it really doesn't matter what I do here, what form I'm in, I've just got to get my mind right and see what I can do in a few weeks' time.\n\nAsked what was motivating her to go on, she said: \"I want to go to a third Olympics.\"\n\n\"I want to be on American soil and show them what the Aussies have,\" she said.\n\nSecond place-getter Hannah Fredericks, who has made her first Australian team, said it was difficult to see the likes of McKeown and Mollie O'Callaghan criticise their own times.\n\n\"I idolised Kaylee for example, and Mol and it's always hard to see them be so hard on themselves,\" she said.\n\nShe said McKeown congratulated her after the swim.\n\n\"She just said like, 'I'm so, so happy for you',\" Fredericks said.\n\nRio gold medallist Kyle Chalmers won the men's 100m freestyle in a time that was faster than he swam to win the silver medal at the Paris Olympics.\n\nKyle Chalmers celebrates after winning the men's 100m freestyle. (Getty Images: Mark Brake)\n\nHe said his state of mind outside the pool was translating to fast times in it.\n\n\"Now, I'm really happy and content,\" he said.\n\n\"Like I've got a fantastic new coach, physiologists who are working with me every single day who believe in me 100 per cent, a fiancée who's incredible and I'm preparing to be a dad, living on a farm.\n\n\"Like there's so many amazing things going on outside of the pool that I think it allows me to come here and have fun.\n\n\"I'm not here with pressure and expectation, like anything I kind of achieve from this point on is just the icing on the cake in my career.\n\n\"I'm physically, mentally, and emotionally in a great place and I think when all of those buckets are topped up, I can swim well in the pool.\"\n\nReflecting on McKeown and O'Callaghan, who have both said during the meet that they're struggling to enjoy swimming, Chalmers said athletes had to find the right attitude to get the most out of their sport.\n\n\"I mean, everyone's probably very different, like you've got to enjoy what you're doing,\" Chalmers said.\n\n\"This is my 10th year on the Australian swimming team now and my 14th trials, like it goes so quickly.\n\n\"It doesn't feel like it was that long ago when I was arriving here for, you know, London 2012 trials.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It goes so quickly, and I think it's just you've got to slow down and enjoy it.\"\n\nIn other results, Brittany Castelluzzo made her first Australian team by winning the women's 200m butterfly final.\n\nParalympic stars, Alexa Leary and Rohan Crothers both won their 100m freestyle events.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-06-13/flood-drought-hit-farmers-urge-consumers-shop-australian/105403520",
        "title": "Fixing fences and buying local — you can help farmers doing it tough",
        "publish_date": "Thu, 12 Jun 2025 21:42:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are being urged to shop local and lend a hand to support farmers hit hard this past year by severe drought and floods.\n\nMany have been left wondering how they can help farmers after seeing the devastating impact of drought in South Australia and Victoria and flooding in Queensland and New South Wales.\n\nShopping local is one way, but there are also opportunities for everyday Australians to roll up their sleeves to work on farms, or even offer farmers a holiday.\n\nAgricultural groups say farmers and regional communities feel direct benefits if shoppers buy local produce. (ABC Rural: Selina Green)\n\nAustralian Made chief executive Ben Lazzaro said buying local generated direct income and jobs, particularly in regional areas.\n\n\"We should be looking for Aussie products and produce 365 days a year,\" Mr Lazzaro said.\n\n\" But when [producers] are doing it tough, it makes sense for us all to put a little bit more in our shopping baskets. \"\n\nRecent rain not enough\n\nWhile parts of SA and Victoria have recently received some rain, it is not enough to break the prolonged drought and farms could take years to recover.\n\nBuy Local Buy SA marketing manager Penny Reidy encouraged shoppers to buy SA-grown citrus, which had been impacted by an extraordinarily hot, dry summer.\n\nPenny Reidy and Citrus SA chair Mark Doecke launching a citrus campaign at the SA Produce Market. (Supplied: Penny Reidy)\n\nWhile fruit size was down, quality and yields were still high.\n\n\"If you're buying oranges in the height of summer, chances are they're probably coming from the US … but if you buy in-season then you know that it's grown here in South Australia,\" Ms Reidy said.\n\n\"If you buy from a local fruit and vegetable store, and buy in-season, then you're supporting the local economy through the whole supply chain as well.\"\n\nDairy, wine battling multiple challenges\n\nAlong with taking a hit from drought and floods, South Australian Dairyfarmers Association's Rob Brokenshire said the dairy industry was also competing with cheaper imports.\n\nThe dairy industry wants supermarkets to clearly label Australian-made products. (ABC Rural: Selina Green)\n\n\"This is a time when we need to push back on imports and we need to become parochial as South Australian and Australian, and buying locally absolutely makes a difference,\" Mr Brokenshire said.\n\nThe Australian wine industry has been battling on many fronts — from drought to reduced consumer demand and low grape prices.\n\nPaxton Wines head winemaker Ashleigh Seymour said small and medium-sized producers were doing it especially tough.\n\n\"Next time you're in the bottle shop trying to choose some wine for dinner, or take to a friend's house, try and buy Australian … especially as we go through these tough times,\" she said.\n\nAshleigh Seymour says the wine industry is battling on many fronts. (Supplied: Ben Kelly)\n\n\"Whether it's grape or lamb or grain production, it's not just that specific industry that is affected.\n\n\" It's all the other businesses that are around that and support that farming community, and that stretches way further than you can really imagine. \"\n\nVolunteers also needed\n\nFor those with some spare time or money, there are also charities collecting donations and volunteers to help farmers directly.\n\nBlazeAid relaunched its Give a Farmer a Break program, which \"matchmakes\" farmers and volunteers with help such as fence building, livestock agistment, and holidays.\n\nBlazeAid volunteers replacing a damaged farm fence in south-west Queensland. (Supplied: BlazeAid)\n\nBlazeAid founder Kevin Butler said city dwellers were reaching out wanting to help.\n\n\"If they can help avoid just one suicide or marriage break-up, or depression coming back to farmers going through hell, I think it's worth it,\" Mr Butler said.\n\n\"The idea is [volunteers] can come to your farm, you teach them how to feed the sheep or the dogs, water the garden, or whatever, and give you a break. Or give you a chance to do something else. Or even go on a holiday.\"\n\nRegional charity Rural Aid provides services such as free mental health programs, counselling, and water tank and hay deliveries to farmers directly.\n\nChief executive John Warlters said it had experienced a huge increase in demand and relied on public generosity to keep up — either as a monetary donation or volunteering.\n\nFloods have damaged farming infrastructure. (ABC Southern Qld: Jon Daly)\n\n\"It's donations from mums and dads, community groups and sporting clubs, but it's also from businesses big and small,\" Mr Warlters said.\n\n\"The more the situation is shared with the broader public, and the more people understand how tough it is at the moment, they definitely want to be part of the solution.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/kaprica-customer-abused-by-restaurant-owner-20250613-p5m77m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kaprica customer abused by restaurant owner",
        "publish_date": "Fri, 13 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kaprica customer abused by restaurant owner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/our-incomes-don-t-match-housing-meet-the-people-in-nsw-s-missing-middle-20250613-p5m75s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Our incomes don’t match housing’: Meet the people in NSW’s missing middle",
        "publish_date": "Fri, 13 Jun 2025 11:58:43 +1000",
        "category": "finance",
        "authors": [
            "Alexandra Smith"
        ],
        "text": "Housing is so scarce in parts of NSW that employers are renting properties on behalf of hospitality staff while some public health workers resort to sleeping in cars to avoid long commutes, prompting MPs to urge the Minns government to act urgently on essential workers’ access to housing.\n\nA parliamentary select committee inquiry into essential worker housing, chaired by Sydney MP Alex Greenwich, found that these workers – who are broadly defined as someone who works face-to-face providing key services – are the forgotten group in the government’s housing policies.\n\nGlenda Walker, a pyschologist in the public health system, gave evidence at a parliamentary inquiry into essential worker housing.\n\nThe committee’s report said essential workers ensure NSW’s cities and regions can function, “yet, without adequate access to safe housing that is affordable, many of these workers are forced to sacrifice their wellbeing in order to deliver the services our state needs”.\n\nA key finding in the report was that no single government agency is responsible for co-ordinating essential worker housing. Housing NSW should take over control, the report recommends.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/you-and-your-phone-video-staff-expose-unhinged-pietro-barbagallo-20250528-p5m2sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You and your phone!’ Video, staff expose ‘unhinged’ Pietro Barbagallo",
        "publish_date": "Fri, 13 Jun 2025 11:58:10 +1000",
        "category": "finance",
        "authors": [
            "Charlotte Grieve"
        ],
        "text": "“Turn that f---ing phone off! You and your f---ing phone!” Barbagallo shouted at customers, as they screamed and exited the venue. “Get out of my f---ing restaurant!”\n\nHe stands over the customer, admonishing him, before shouting profanities at the group, pulling their tablecloth, smashing the remaining plates and glasses.\n\nFootage obtained by this masthead shows one of the customers recording a video message to his partner complaining about the spice of the food before celebrated chef Pietro Barbagallo looms in the corner of the clip.\n\nThey ordered wine and starters, but when the prawn pasta arrived, it was simply too spicy and the waitress agreed to replace the dish. The nasty turn the night then took was caught on camera.\n\nIt was a bustling Thursday evening at the heritage-listed terrace, with almost every white-clothed table filled as the trio took their seats. They were excited to try the Carlton restaurant that had recently gone viral on social media.\n\nDimmed lights, soft music and the smell of fresh sugo greeted the friends as they entered popular Italian eatery Kaprica for dinner.\n\nAdd articles to your saved list and come back to them any time.\n\nShe described two incidents as particularly memorable. She alleges Barbagallo once threw a pizza shovel at her head, then on a separate occasion exposed his genitals to her at his house after offering her cocaine and champagne.\n\n“It was relentless,” she said. “He smashed plates on peoples’ tables. He would shout all the time, throw things, smash glasses and plates.”\n\nCarly Lauder worked for the celebrated chef in the early 2000s at his former restaurant, I Carusi in Brunswick. Having built a career in hospitality – where she still works today – Lauder said Barbagallo was by far the worst person she has ever worked for.\n\nCarly Lauder says Barbagallo exposed his genitals to her and threw a pizza shovel at her. Credit: Simon Schluter\n\nBarbagallo did not respond to repeated requests for comment or to a detailed list of emailed questions. When this masthead approached him at his restaurant this week again asking him to respond to the allegations, particularly of indecent exposure, he said, “no, no, no” before closing and locking the door.\n\nBarbagallo, who was credited by The Age in 2005 with kick-starting Melbourne’s “pizza revolution”, also stands accused of indecent exposure, inappropriate sexual comments towards staff and financial mismanagement across his venues.\n\nInterviews with 19 current and former employees at Barbagallo’s restaurants suggest this incident was not isolated, with allegations of aggressive outbursts stretching back decades. The claims come as the wider industry is struggling to overcome a historic work-hard-play-hard culture that critics say enabled poor conduct by those in positions of power.\n\n“I’ve seen him throw cutlery when he’s mad, throw plates and smash them against the wall,” she said. “It’s quite scary and dehumanising.”\n\nIn recent months, several waitstaff have resigned from Kaprica citing Barbagallo’s aggressive behaviour, including Petrea James, who said his outbursts were frequent.\n\n“He’s been doing this the whole time, and he’s still being held up on a pedestal,” she said.\n\nLauder decided to tell her story after The Age’s Good Food published a positive review of Kaprica last month .\n\nThis account was corroborated through interviews with three people Lauder told at the time.\n\n“He disappeared then returned shaking his dick in everyone’s face,” Lauder said. “That was the only time he took his clothes off, but he made lewd disgusting sexual gestures towards all of us all the time. It was way before #MeToo. None of us ever thought to push back.”\n\nOne customer was later filming a video message to send to his partner about his “burnt lips”, when Barbagallo confronted the table.\n\nKaprica in Carlton has seen a wave of new bookings after a viral TikTok campaign. Credit: Photograph by Chris Hopkins\n\n“All the pasta was running down the wall,” said one witness.\n\nWhen the waitress returned to the kitchen to deliver the news, Barbagallo became enraged. He accused the customers of having eaten some of the pasta and smashed the ceramic plate against a kitchen wall.\n\nOne of the affected customers said the intensity of the chilli on the pasta made it “inedible” and that the waitress agreed to replace the dish as the complaint was not new – customers had complained about the spice before.\n\nThis masthead interviewed five eyewitnesses to Barbagallo’s plate-smashing incident in April. They said he had appeared under a “cloud” throughout his shift.\n\nShe said his aggression quickly crossed a line, describing regular “outbursts” where he was “shaking, pacing, throwing his arms around” as he allegedly berated staff.\n\nWhile the incident came as a shock to customers, staff were not surprised. James joined Kaprica in mid-2024 and says she was warned Barbagallo had a “temper”. She had worked with unpredictable bosses before in hospitality, and needed the money, so took the job.\n\n“The workers told us it was definitely not the customers’ fault,” one witness told this masthead. “I was like, surely it wasn’t the owner. The place is so well-known. We were like, ‘What the hell?’”\n\nFrom outside the restaurant, two witnesses saw a chair fly out the front door towards the customer. Two waitresses were seen exiting the venue, one in tears.\n\n“It was incredibly awkward,” one witness said. “The music was playing but everyone was shocked and disturbed.”\n\nHis “yelling and screaming” was heard from the street. One witness thought “a homeless person was in there attacking someone”. Inside, the usually bustling restaurant fell silent.\n\n“He would say things like ‘you’re all f---ing idiots and I’m the biggest idiot for hiring you all’. Your blood would run cold,” she said.\n\nAccounts of Barbagallo’s volatile behaviour were supported by almost all staff interviewed by this masthead, who separately claimed he would have “melt-downs”, “screaming matches” and “explosions” of anger.\n\nA dozen women who worked in various roles around Barbagallo backed these claims but declined to be identified for fear of repercussions.\n\nOne woman alleged he threw plates or “pans of hot food” every couple of weeks.\n\nAnother woman said she “literally had a plate thrown at me” by Barbagallo.\n\n“There’s definitely some severe personality issues there,” the woman said. “He’s totally unhinged, totally.”\n\nA third woman described an incident where Barbagallo allegedly held a plate above a customer’s head and screamed: “I’m going to smash your head in if you don’t f---ing leave my restaurant” after the customer complained about slow service. “And then he kind of switched back, was like, ‘Are you OK?’”\n\nAnother employee described feeling “frozen” by his aggression. The staff taught each other to “just nod and look down” until he stopped yelling, in episodes that appeared “manic” and like he was “stuck in a loop”.\n\n“If you apologise or even God forbid try to explain the mistake, he just gets angrier and angrier and angrier and angrier and reiterates the same point over and over and over again.”\n\nJames said the outbursts made her feel anxious, as Barbagallo switched between abusive and friendly. “I got the shakes,” she said. “To be honest, you get goosebumps. It’s hard.”\n\nWhen James quit earlier this year, she sent a text message to Barbagallo, citing his “serious aggression and conflict”.\n\n“I find the way you speak to your staff extremely inappropriate,” she wrote.\n\nBarbagallo responded: “No problem.”\n\nAnother staff member, who did not want to be named, sent a similar resignation text message this year, calling out Barbagallo’s “unacceptable behaviour” and prior “outbursts”.\n\nHe responded: “Sorry you feel that way”.\n\nComplaints about Barbagallo’s aggressive behaviour date back to the early 2000s. Credit: Marina Oliphant\n\nFourteen former staff members alleged varying levels of sexually inappropriate behaviour from Barbagallo, ranging from comments about their appearances and over-sharing about his own sexual experiences.\n\nIn the early 2000s, Lauder alleged Barbagallo “always spoke about sex”, had sexual relationships with his employees, and openly talked about plans to hire attractive young women.\n\nOne former staff member, who quit last month after she was reduced to tears by Barbagallo multiple times, was critical of this language.\n\n“That was kind of sickening to me, even still, just because of how sexualised I know all the service staff are in the way that is almost like an active decision when they’re hired.”\n\nThe employee said Barbagallo would “look you up and down” before hiring staff and often turned away men with experienced resumes.\n\nJames supported this position, saying Barbagallo often hired women in their early 20s who worked part-time while studying nearby at Melbourne University.\n\nShe said Barbagallo routinely commented on the appearance of customers and waitstaff, including herself when she dyed her hair a darker red colour.\n\n“He told me I looked goth, really good. He wouldn’t stop commenting on it. It was just classic creepy boss vibes,” James said.\n\n“Then he would always point out other people who dressed goth to me, and then tell me he wanted to do bad things to them. That he knew he shouldn’t like them but he does and that just makes it all the more enticing.”\n\nAnother former waitress alleged Barbagallo also made sexualised comments to her, including telling her she could work fewer shifts because “essentially men would pay for my company … And I could sell my body”.\n\n“It was surprising at the time but not infrequent,” she said.\n\nThe same woman recalled him saying “she’s so hot I would f--- her” about a customer, and sharing stories about his sexual experiences and drug-taking.\n\n“It became common knowledge to know his ex-lovers’ full names because he would talk about it,” she said.\n\nBarbagallo in 2004 at his first Melbourne restaurant, I Carusi. Credit: John Woudstra\n\nThree employees who worked with Barbagallo at I Carusi in the early 2000s said Barbagallo had sexual relationships with much younger staff.\n\n“I remember at the time being like why the f--- are her parents not stepping in here?” one former employee said, noting the staff, though younger, were still consenting adults.\n\n“He was so inappropriate with all the young staff, myself included. He’d touch your back when you walked past him. He was so creepy. It was such a gnarly vibe.”\n\nBarbagallo came onto Melbourne’s culinary scene in 1998, opening a no-frills pizza restaurant in Brunswick East, I Carusi.\n\nHe expanded over the years to open venues in St Kilda and Melbourne’s CBD, where complaints of aggressive and inappropriate behaviour continued to mount.\n\nBarbagallo was declared bankrupt in 2011, according to corporate documents, and shut his Lonsdale Street restaurant and ended his involvement with all I Carusi restaurants.\n\nPublic bankruptcy documents obtained by this masthead that were signed in June 2011 show Barbagallo had $500 to his name and debts of $1,223,631, including $267,000 to Carusi and $40,000 to Mercedes-Benz Finance.\n\nWhen he opened Kaprica in Carlton soon after, Barbagallo reportedly “slaved away solo in the kitchen” for the first six months “almost like he was doing penance”.\n\nBut staff claim there was a haphazard approach to managing the restaurant’s finances.\n\n“The entire business was in cash,” said one person who worked as Barbagallo’s informal assistant in 2015. “So we were paid in cash, payments from customers were in cash. I would drive my bike to deposit like $15,000 worth of cash and he would pay his rent and children’s lessons out of that money.”\n\nKaprica has long been popular with locals, and moved to a two-storey venue on Grattan Street as demand expanded over the years. However, bookings from new customers have rocketed in the past 18 months after Kaprica engaged marketing firm Einwick and social media producer Hano Lokman to advertise the venue.\n\nLokman’s videos used off-beat scripts and dim lighting to create short fictional narratives to promote the restaurant, clocking up hundreds of thousands of views on TikTok. He did not respond to requests for comment.\n\nMultiple current and former staff said the social media craze strained the business as Barbagallo would over-book, causing long waits for tables or service.\n\n“When it started getting busy, it [aggression] was more frequent because he literally couldn’t manage the restaurant and manage himself,” alleged one former employee.\n\nWhile Kaprica paid an hourly rate higher than average, more than a dozen employees said Barbagallo does not provide payslips and transfers wages directly to bank accounts using calculations from paper time sheets.\n\nTwo employees became worried about Barbagallo’s failure to pay superannuation and tax on their wages last year, and were given access to his books for a day in an attempt to solve their issues.\n\n“It was sheets of random bits of paper strewn around the place, and there were things like where there would be a month missing from this person’s pay.”\n\n“Then it took months for it to go to the accountant and be in the accounts. It was just an incredible level of procrastination.”\n\nScreenshots from a WhatsApp group of Kaprica staff show conversations about payment irregularities were common.\n\n“Sorry to keep asking but does anyone have news on tax?” one employee wrote last September.\n\n“No,” another responded. “Last I heard he messaged his accountant and he never got a response … Not really a good enough reason, it’s his responsibility.”\n\nText messages show another employee was sacked this month after they told Barbagallo they were underpaid for public holiday shifts and pushed for their full entitlements.\n\n“Yep there is a mistake on my behalf which I’ll fix tonight,” Barbagallo responded. “Also you should learn some manners. And finally I think it best you found employment elsewhere.”\n\nThe employee responded: “Manners?? Why am I being fired?”\n\nIt took weeks of messages for Barbagallo to pay the employee, who followed up multiple times.\n\nAnother former employee said she saw text messages on the restaurant phone from a former staff member begging for superannuation payments months after they had left.\n\n“We would get text after text from this employee who was like, ‘Come on Pietro … It’s been six months. How are you still not replying to me? Please.’ He was ignoring her.”\n\nLauder said these were longstanding practices and behaviours that Barbagallo needed to be held accountable for.\n\n“I’ve been in the industry for 31 years. I’ve worked as a chef, front-of-house, late-night cocktail bars.\n\n“I don’t think there is ever any reason for anyone to lose their shit, shout at people, throw things. Nothing is ever that stressful.\n\n“It’s dinner. He’s not saving lives. If you can’t handle it, you’re in the wrong job.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/i-was-winning-races-the-link-between-eating-disorders-and-elite-athletes-20250325-p5lmao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I was winning races’: The link between eating disorders and elite athletes",
        "publish_date": "Fri, 13 Jun 2025 11:55:25 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Loading Associate professor in clinical psychology at The University of Melbourne, Isabel Krug, whose research focuses on eating disorders, says while anyone in any sport can develop an eating disorder, certain “aesthetic-based” sports like figure skating and gymnastics, which privilege thinness, pose a greater risk factor for athletes. “These can reinforce disordered eating behaviours, especially, restricting food and orthorexic tendencies [obsession with healthy food], and body dissatisfaction.” The environment of high-performance sports – in which athletes’ bodies are their tools – can also contribute. “The way we measure athletes’ bodies, the way we talk about their bodies, the language we use, are all really important factors,” she says.\n\n“Sport can add fuel to the fire.” Still, Jeacocke says work is being done to better understand the complex relationship between high-performance sport and eating disorders. In 2020, the AIS and National Eating Disorders Collaboration published a statement on the topic, outlining guidelines for athletes, coaches, support staff, clinicians and sporting organisations. Jeacocke, who co-authored the statement, says preventing and identifying eating disorders in athletes requires a multipronged approach. “It’s taking a really holistic view of athletes, looking at their mental and physical health. So, how do we optimise health and well-being to maximise performance?”\n\n“We want to win gold medals, we want to break world records, yes, but how we do that is super important,” she says. Three athletes – current and former – share their thoughts on why elite sport can be such a breeding ground for disordered eating, and what finally set them on the path to recovery. ‘I just needed someone to sit and listen’ Gorry with daughter Harper. She says pregnancy and motherhood played a role in overcoming her eating disorder. Credit: FIFA via Getty Images While football is not a weight-based sport, Gorry says the culture of regular weigh-ins, body fat checks and density scans contributed to a creeping obsession over food and the way she looked.\n\n“There’s just so much pressure every day to perform, to be a certain body shape and to be at our peak,” she says. Gorry, who became a Butterfly Foundation ambassador in 2024, would like to see less focus on weight and a more nuanced understanding of women’s health. “As footballers, it doesn’t make sense to be weighing in. Everyone’s going to weigh differently, being female athletes, you could put on 3 kilograms while you’ve got your period, and we don’t talk about the reasons why,” she says. “It’s just a number at the end of the day, it should be how you feel in your body and how you’re performing.” So, what was the turning point that set her on the path to recovery?\n\nAlongside clinical treatment and pregnancy, which gave her a newfound appreciation for her body, support from teammates helped. “A big part of it was actually my roommate in the Matildas at the time, Michelle [Heyman]. She noticed and asked, ‘I can see that you’re struggling. Are you okay? I’m here for you’.” “That’s all I needed. I didn’t need someone to try and help me. I just needed someone to sit there and listen and point me in the right direction without pushing me.” Now a mother to Harper and Koby, she says her experience with an eating disorder has shaped how she parents, too. “It’s a conversation Clara [Markstedt, Gorry’s wife] and I both have all the time around food, or even when Harper’s looking at herself in the mirror, just making sure we’re validating her in the right way.”\n\n‘My self-worth was attached to football’ In 2010, Brock McLean, now 39, had just moved from Melbourne Football Club to Carlton. Having recently suffered injuries, he had lost speed on the field. His coaches recommended he lose weight. “Against the advice of nutritionists and doctors, I agreed to do it because I was so desperate to get back to playing footy. My mental health issues at the time was that my self-worth was attached to football,” he says. Former AFL footballer Brock McLean. Credit: Lus Enrique Ascui “I was at the very apex of professional football. You couldn’t go any higher than that. So I developed a really unhealthy way of viewing myself.”\n\nMcLean embarked on a restrictive meal plan. He would suppress cravings for certain foods for weeks on end before giving in and bingeing, then overtraining and eventually using laxatives. Loading These behaviours dovetailed with anxiety, depression and addiction, and he developed bulimia nervosa. Young men and boys are often underrepresented in conversations about body image and eating disorders, despite the fact around one-third of those who suffer from an eating disorder are male. McLean says the stigma around eating disorders and mental illness in men’s sport meant he was afraid to seek help.\n\n“I was really uncomfortable opening up to people. I just couldn’t do it because I felt like it was emasculating, particularly for an eating disorder.” After retiring in 2014 and moving into the corporate world, the self-worth he had derived from football transferred to climbing the corporate ladder. But through seeing a psychologist, the tide has slowly started to turn. “It doesn’t matter what you look like, what your job title is, how much money you make. You’re a good person, you treat people well, you’re a great dad and husband,” he says. ‘I only can imagine what I could have achieved’\n\nDr Jennifer Hamer was diagnosed with anorexia at age 12. A promising endurance runner in her home country of England who represented Great Britain at the European Championships, her eating disordered progressed with her sporting career. “I was always carrying my eating disorder with me, which I believe held me back a lot,” she says, explaining she was frequently getting injured and spending time at the physio in rehab. Dr Jennifer Hamer, a former endurance runner, now works with athletes to prevent eating disorders. Credit: Steven Siewert “My pure love for the sport became really, really scarred by the fact that it was now being controlled by an eating disorder.” While Hamer says it’s difficult to say whether she would have developed an eating disorder had she not been involved in sports, she feels her coaches were ill-equipped to support her and her family.\n\nLoading “There’s a point in your eating disorder in the early stages where it doesn’t affect you negatively … I was winning races, so they were like, ‘Oh, she’s winning. But let’s keep pushing her harder.’” “And I wasn’t going to say anything because I was loving it because I was abiding by the eating disorder rules, and I was getting away with all the things that I wanted to do.” At 22, Hamer’s eating disorder meant she was so weak she could no longer run, and she was admitted to an inpatient clinic. There, she was given a career-ending diagnosis: she had osteoporosis from years of disordered eating. But for Hamer, now 33, it’s only in the past four to five years she’s really entered a space of recovery. She’s also discovered a love for ocean swimming which allows her to indulge her love for endurance sports.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/wtc-waste-of-time-championship-20250612-p5m725.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WTC? Waste of Time Championship",
        "publish_date": "Fri, 13 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "Those who have blamed the Lord’s pitch for the helter-skelter World Test Championship final might have picked the wrong target. The Australia-South Africa Test match has been played by 22 cricketers re-acquainting themselves with red balls and the concept of a game going for five days.\n\nIt’s not their fault that they’re not ready: a lack of readiness has been built into its design, as if the powers of international cricket want to look like they’re saving the Test format while doing everything they can to undermine it. Imagine if a football World Cup final were played as a one-off, out-of-season friendly for the benefit of Jeff Bezos. Not even FIFA could screw up that badly.\n\nNone of South Africa’s players had taken part in a first-class game of cricket in the past five months. One, Lungi Ngidi, last bowled a red ball in a match in August 2024. (He looked a tad rusty.) Three of the Australians had played some county cricket in England last month, but for the rest, their last first-class cricket was three to six months ago.\n\nRusty? Just a bit. Australian viewers might be a bit rusty too. Those who wanted to watch the game had to pinch their noses, hold their breath and submerge themselves in the swamp that is Amazon. For the Test match not to be protected by anti-siphoning laws gives a pretty good idea of how Australian regulatory and broadcasting interests rate it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/hollywood-studios-sue-ai-company-over-unauthorised-darth-vader-and-minions-copies-20250613-p5m766.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hollywood studios sue AI company over ‘unauthorised’ Darth Vader and Minions copies",
        "publish_date": "Fri, 13 Jun 2025 11:34:58 +1000",
        "category": "finance",
        "authors": [
            "Shawn Chen",
            "Matt O'Brien"
        ],
        "text": "New York: Disney and Universal are suing popular artificial intelligence image-generator Midjourney, marking the first time major Hollywood companies have taken legal action against a maker of generative AI technology that could upend the entertainment industry.\n\nThe copyright lawsuit in a Los Angeles federal court claims Midjourney pirated the libraries of the two Hollywood studios to generate and distribute “endless unauthorised copies” of their famed characters, such as Darth Vader from the Star Wars franchise and the Minions from Despicable Me.\n\nThe lawsuit claims “endless unauthorised copies” of famed characters like the Minions have been distributed. Credit: AP\n\n“Midjourney is the quintessential copyright free-rider and a bottomless pit of plagiarism. Piracy is piracy, and whether an infringing image or video is made with AI or another technology does not make it any less infringing,” the companies state in the complaint.\n\nThe studios also say the San Francisco-based AI company ignored their requests to stop infringing on their copyrighted works and to take technological measures to halt such image generation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/netanyahu-says-israel-is-targeting-nuclear-scientists-working-on-the-iranian-bomb-20250613-p5m77h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Netanyahu says Israel is targeting ‘nuclear scientists working on the Iranian bomb’",
        "publish_date": "Fri, 13 Jun 2025 11:32:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Netanyahu says Israel is targeting ‘nuclear scientists working on the Iranian bomb’\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/this-suburban-club-has-produced-seven-afl-players-in-18-months-but-that-s-not-what-it-s-most-proud-of-20250611-p5m6mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This suburban club has produced seven AFL players in 18 months, but that’s not what it’s most proud of",
        "publish_date": "Fri, 13 Jun 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Hanlon"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In its past 31 games since the 2023 VFL grand final, Werribee have had seven players drafted to the AFL. It’s a staggering strike rate, born of the most basic principles. “This is like a country local footy club that plays at a higher level,” says coach Jimmy Allan, who hails from down the road at Lara and played for Werribee in the early 2000s before a storied SANFL career. His assistant Kyle Hartigan hits another note. “We’re a community club – we wouldn’t have this without them,” he says, crediting not just the people of Werribee but sprawling Wyndham City, the fastest-growing municipality in Australia. Werribee CEO Mark Penaluna with senior players (L-R) Jesse Clark, Renee Tierney, Maddie Di Cosmo and Dom Brew. Credit: Paul Jeffers Michael Barlow, poster boy for late-bloomers who was drafted to Fremantle from Werribee in 2010, needs no prompting to join the chorus. “The Werribee Football Club has been the most important organisation in my life.” If community, connection and care underpin Werribee, the product of the 1965 amalgamation of four local clubs also boasts an asset almost as constant as the ancient river red gums that flank its Chirnside Park home. Mark Penaluna, in his 22nd year as CEO, is the heartbeat of the club. “Anyone who has been associated with local footy, we’re just an extension of that, we’re just talking bigger numbers,” Penaluna says. To be a community club, he reckons, means leaving your ego at the door. “We understand we’re not just here to win a game of footy, this is something people look forward to each week – training, games, sharing the wins and losses.”\n\nAdvertisement\n\nEvery footballer starts at a local club, where much is done by few. When they arrive at Werribee, it’s made clear that everyone – from the office to maintenance to the property steward – makes up the club. “If you see a broom and the floor’s dirty, the expectation is you pick the broom up, give it a sweep, and make it clean for the next person.” Many people whose lives are enriched here never lace a football boot. Wyndham Community Education runs eight English classes each week, making the club an early connection point for new arrivals to the area. On Sundays, Anglican followers of Sojourners Church gather for services held by pastor Andrew Seedhom, who is also club chaplain. Loading On game days, Penaluna spends half an hour on the gate before Seedhom relieves him, greeting players’ families and Werribee’s fans. Everyone is included in successes little and large, from office staff to sponsors to the volunteers who keep the wheels of community clubs turning. For Penaluna, football and its importance to community are ingrained. His father captain-coached Port Melbourne Colts. As a five-year-old, he had two game-day jobs: listen to the opposition coach’s address and report back; and in quarters played with no added time, stand behind the goals and get the ball back to the umpires ASAP if the Colts were trailing. “And if we were in front, kick the hell out of it the other way.”\n\nAdvertisement\n\nHe ran the Western Region league for five years before arriving at Werribee in 2003. His first game-day task was helping volunteers George and Jimmy drag the barbecue out of the showers under the old grandstand, so the umpires could get changed. There was no canteen; the barbie was a major source of income. “We had one desktop computer, and if it rained we had to put bubble wrap over it because there was a hole in the roof and possums living up there.” CEO Mark Penaluna and community development manager Majok Ngong at Chirnside Park. Credit: Luis Enrique Ascui His staff consisted of one part-time venue manager. The club’s 2025 season guide lists Penaluna as one of 28 employees. More people work in community roles than once worked for the entire club. Welfare manager Damien Frankling has been around since 2008, chaplain Seedhom for the past four years. “Having those constants helps enormously, honest conversations and all that stuff,” Penaluna says. Facilities help. In 2008, the club went to council with a proposed upgrade that had cost close to $12 million upon completion a decade later. Income is drawn from Wyndham entertainment venues, with $300,000 put back into the community annually, including sponsoring every football club in the municipality. “We agreed with council that we’ll continue to provide these programs and extend them, and make sure we only charge community organisation rates not commercial,” Penaluna says.\n\nAdvertisement\n\nWerribee has been a “standalone” VFL club since 2018, after affiliations with Western Bulldogs and North Melbourne. The latter endures through the North Melbourne Werribee Kangaroos in the VFLW and “The Huddle”, which has delivered programs to more than 50,000 young people since 2016 to strengthen education and employment outcomes. The club hosts English language classes for new migrants. Credit: Luis Enrique Ascui For Barlow, who coached the Bees to runners-up in 2023 before Allan brought home the club’s second premiership last year, being standalone is crucial to success. In training together throughout summer, bonds and trust are built and players improve by challenging each other. Playing every home game at a different venue – from Wangaratta to Torquay – during the 2017 renovations fostered an “anyone, anywhere, anytime” zeal. “If they weren’t standalone, some of the guys I played with just wouldn’t play,” Barlow says. “They’d go and try and find connection and community and togetherness at a local club.” He regards Shaun Mannagh, drafted by Geelong in 2023 aged 25, as “the most club-oriented person I’ve met in football”. Loading With VFL rivals Williamstown and Port Melbourne to the east and Geelong to the west, Werribee must be creative in their recruiting. There are enough Geelong-based players to warrant a van (they spin a key to see who drives), while leagues to the north like Ballarat, Ovens and Murray and Goulburn Valley produce players who fuel the country vibe. Allan chuckles at the notion that developing footballers so well surely equates to a queue of Werribee wannabes stretching along Watton St. Even in a competitive market, he doesn’t use recent draft success as a carrot.\n\nAdvertisement\n\n“I would never say, ‘Come here and we’ll get you drafted.’ If a club thinks they need them on their list they’ll find a way. Our job is to help them be the best player and best person they can be. I know it’s a cliche, but we’re genuinely invested in doing that. “With the five who’ve gone [to AFL clubs] in my time here, not once did they ask, ‘What do I need to do to get drafted?’ Their questions were around, ‘What can I do to help our team be the best we can be?’ It’s about playing your role and doing it better than anybody else. That’s why these guys are getting a chance.” Zac Banch, picked up by North in the mid-season draft. Credit: AFL Photos via Getty Images Smiling again, Allan adds, “We’re big on cliches.” Hartigan’s story offers a compelling blueprint. Overlooked as an 18-year-old after trying to be something he wasn’t, he spent three years at Werribee “and just went back to what I was good at, which was nullifying opponents”. Eventually, Adelaide identified a need in defence, “and I was in the right place, right time, playing my role”. He played 135 games for the Crows and Hawthorn. The cliche won out. Fans at a Werribee VFL match. Credit: via Getty Images\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/eating-out/this-regional-post-office-may-be-home-to-the-best-burger-in-australia-20250612-p5m710.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This regional post office may be home to the best burger in Australia",
        "publish_date": "Fri, 13 Jun 2025 11:25:15 +1000",
        "category": "finance",
        "authors": [
            "Callan Boys"
        ],
        "text": "Advertisement\n\nEating outBurgers This regional post office may be home to the best burger in Australia It’s a very bold claim, but this country-comfort burger is a tower of fresh taste where each bite is underlined by a different ingredient. Callan Boys June 13, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 6 Wingello Village Store in the Southern Highlands. Jennifer Soo 2 / 6 Wingello’s $18 burger with the lot. Jennifer Soo 3 / 6 Wingello Village Store and Post Office owner David Bruggeman. Jennifer Soo 4 / 6 Wingello Village Store and Post Office. Jennifer Soo 5 / 6 James Bruggeman on barista duties. Jennifer Soo 6 / 6 (From left) Martin, Zach, James, David and Peter Bruggeman. Jennifer Soo Previous Slide Next Slide We don’t celebrate the works burger enough. Beetroot-stained roll. Pre-sliced “tasty” cheese. Shredded iceberg. Pineapple. Egg. Your choice of sauce. Although there’s no clear consensus as to how or why the burger came about (although a surplus of tinned goods created by the opening of Edgell and Golden Circle canneries in the 1940s might have had something to do with it), its unknown creator is up there with Peter Russell-Clarke and Grandma Poss in terms of their influence on everyday Australian food. I’m quite serious about this – the “Aussie” burger is one of the few culinary creations we can claim as legitimately unique. Try finding beetroot, pineapple and barbecue sauce between bread on any other continent. I bring all this up because I may have found the best works burger in Australia. Wingello’s $18 burger with the lot. Jennifer Soo I say “may” because it’s an impossible claim to confirm without visiting every fish and chip shop. Who knows what takeaway lurks near Beechworth or Kalgoorlie or the industrial sheds of Croydon Park? (I’m also conscious of Paul’s Famous Hamburgers and its faithful in Sylvania.) But gee, Wingello Village Store and Post Office knows its way around a spatula.\n\nAdvertisement\n\nAccording to David Bruggeman, who runs the one-stop Southern Highlands shop with his family, the general store’s dates back to 1865. Wingello is home to about 600 people, and Bruggeman and his wife Lana took over its only shop 16 years ago, extending the mail, newspaper and basic grocery services to include a cafe with “simply good food”. “You won’t find avocado or Turkish bread or any of that stuff here,” he tells me. Wingello Village Store and Post Office owner David Bruggeman. Jennifer Soo You will, however, find a formidable selection of milk bottles, caramel buds and chocolate freckles along the counter, and a menu heavy with truck-stop classics plus a whipped cream-topped sundae. If the indoor fire is going, marshmallow roasting is encouraged. I suspect the BLT is a paragon of the form, and the cinnamon toast is a super-duper breakfast, but the $18 works burger is the headline act. The soft, flat bun comes from Bryant’s Bakery in Goulburn. Local butchers supply the beef and house-cured bacon. Lettuce, tomato and free-range eggs come from nearby farmers; the pineapple and beetroot comes from a can. Sauce is from a bottle, unless you ask for the house-made mayonnaise, but that’s better saved for chips. Tomato sauce on an Aussie burger, forever and ever, amen. (The only good thing about ETA Original Barbecue is the bottle design. Yes, yes, I’ll begin the process of revoking my citizenship now.) (From left) Martin, Zach, James, David and Peter Bruggeman. Jennifer Soo\n\nAdvertisement\n\nAnyway, all this adds up to a tower of fresh flavour where each bite is underlined by a different ingredient. The bacon is generous. The onions, translucent but not browned. It may take a few bites until you hit pineapple. The 130-gram patty is lean on fat, which some burger purists will hate, but I don’t mind finishing the thing and still feeling human. The perfect trinity of salty, sweet and lightly pickled. I brought a second burger back to Moss Vale for my partner, who was less keen to leave the throw-rug of our Airbnb for the half-hour trip to Wingello. By this time, all the components have had more time to mingle and develop in their white paper bag. Brilliant with half a glass of last night’s gamay at 11:30am. A one-stop Southern Highlands shop. Jennifer Soo Thanks go to two-time Golden Spurtle World Porridge Making Championship finalist, and taco chef, Toby Wilson for alerting me to the burger three weeks ago. Wilson only discovered it after seeing an ad for the cafe before The Penguin Lessons at Bowral’s Empire Cinema. (NB: The Bruggeman family has a YouTube channel where you can watch all their house-made cinema ads, dating back to 2020. It is absolutely worth your time.) Related Article An ode to the Aussie burger with the lot\n\nAdvertisement\n\nLike our regional Chinese restaurants, agricultural shows and vanilla slice-famous bakeries, Wingello Village Store is one of those great “only in Australia” spots that tourism boards could spend more time promoting – especially to city-dwellers who would increasingly rather jump on a Disney Wonder cruise than explore their own backyard. The burger doesn’t taste like cheap thrills and corporate grease. It tastes like Paul Kelly singalongs and sunsets and Sunday drives. It tastes like a kitchen that gives a damn. Related Article RecipeTin Eats on how to make a classic Aussie burger with the lot\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/like-being-in-bed-with-richard-burton-how-alcohol-became-the-third-wheel-in-our-marriage-20250612-p5m70z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Like being in bed with Richard Burton’: how alcohol became the third wheel in our marriage",
        "publish_date": "Fri, 13 Jun 2025 11:22:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "When we discovered a shared love for Barry Manilow and vodka on our first date, I knew Chris was the one. Our courtship was fuelled by post-work rieslings, boozy beach getaways, splashing each other a glass while making dinner.\n\nWe were endlessly drunk on each other and endlessly actually drunk. Friday nights meant pinball and bourbon, Saturday was about cocktails. Sunday, we’d get on the sauce after lunch. Holidays? Find us a tropical swim-up bar and a happy hour and extra points for a souvenir swizzle stick.\n\nAlcohol went from something that brought us together to something that was dividing us. Credit: Getty\n\nAlcohol was the fabulous third wheel in our marriage. Then Chris stopped drinking.\n\nLong story short, but a year or two back he realised booze was creating not just hangovers but fights over stupid things, feelings of isolation, slow treacly chaos. And he thought he might die.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/onefour-s-message-to-the-police-we-re-different-now-we-re-good-people-20250609-p5m5z7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "OneFour’s message to the police: ‘We’re different now. We’re good people’",
        "publish_date": "Fri, 13 Jun 2025 11:14:54 +1000",
        "category": "entertainment",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It seems fitting that the opening number on OneFour’s debut album, Look At Me Now, is titled Change. A pulsing track that sees the group reckoning with the past and thinking about the future: “And now the question is: will you remain the same?” raps Jerome ‘J Emz’ Misa over a heavy beat. “Or are you willing to do whatever it takes to change?” Change has been the one constant in OneFour’s turbulent 10-year history as Australia’s most prominent hip-hop outfit, a period defined by upheaval, controversy, prison time and hype – anything but stability. Since forming in 2014, the all-Pasifika rap crew from Mount Druitt in Western Sydney have experienced a decade of turbulence. Credit: Mridula Amin Formed in 2014, the all-Pasifika rap crew from Mount Druitt in Western Sydney was initially composed of five members – brothers Jerome and Pio ‘YP’ Misa, Salec ‘Lekks’ Su’a, Dahcell ‘Celly’ Ramos, and Spencer ‘Spenny’ Magalogo. They quickly became the face of Australia’s drill movement, a sub-genre of hip-hop that emerged from Chicago a decade ago. It is known for its faster, heavier sound and raw lyrics, often depicting gang culture. Adopting this style, OneFour infused it with a uniquely Western Sydney flavour, references to ‘eshays’ and ‘lads’ speaking to a subculture born from the very same streets they grew up in. It didn’t take long for the group to tap into viral success, with songs like 2018’s What You Know and 2019’s Spot The Difference going platinum on the ARIA charts and racking up hundreds of millions of streams.\n\nAdvertisement\n\nAs the buzz grew, so too did the accolades. ARIA nominations followed, while hip-hop superstars, including Skepta, Dave, A$AP Ferg, and the Kid Laroi, voiced their support for OneFour’s warts-and-all portrait of street life in Mount Druitt. “My district has too much drillers, like who wants it? Like who wants war with Sydney’s realest?” Spot The Difference, OneFour But their meteoric rise was halted in 2019 when Lekks, Celly and YP were jailed for a pub brawl. That same year, a national tour was cancelled after venues began pulling out, something OneFour attributed to pressure from the police and confirmation that the group was being monitored by two elite police units – Strike Force Raptor, created to hunt underground criminal networks, and Strike Force Imbara, which investigates gang feuds. In a widely circulated voice memo supplied to the ABC, Sergeant Nathan Trueman from the Raptor squad promised, “I’m going to use everything in my power to make your life miserable until you stop doing what you’re doing.” The constant noise around OneFour only seemed to boost their infamy. Their shows continued to be cancelled while their streaming numbers skyrocketed (they have an impressive 2.4 million monthly listeners on Spotify). OneFour have regularly been targeted by police and prevented from performing. Credit: YouTube The release of a 2024 Netflix documentary, Against All Odds, broadened their reach yet reinforced the idea that the story of OneFour had become more important than the music they produced. “Exactly right,” says J Emz. “And that’s why we needed a change. We’re about the music, and we want people to know that.”\n\nAdvertisement\n\nI’m sitting with J Emz, Celly and Spenny in a back room of Sony Music’s headquarters in Sydney’s CBD. There are bowls of lollies on the table and slabs of soft drinks, but no one eats or drinks anything. This is the new look OneFour after a lineup change. YP left the group last year after becoming ordained as a Christian priest, while Lekks remains part of OneFour but was deported to New Zealand following his four-year prison sentence. ONEFOUR performing at the band’s album launch event on Thursday night. Credit: Mridula Amin J Emz sits opposite me, the group’s elder statesman who does most of the talking. Alongside him is Celly, who was recently released after serving five years of his 10-year sentence for the brawl. Next to me is Spenny, who is softly spoken and polite but visibly uncomfortable with being interviewed. I ask them about that first track, Change, and whether the lyrics were born out of a challenge they set themselves. “For sure, I don’t think any of us can pretend we haven’t made mistakes,” says J Emz. “But we’ve grown up a lot. So much has happened in our career to knock us off track – some of that is our fault, some of it isn’t, but we’ve gotten much better at holding each other accountable.” What does that look like? “There have been some heated chats for sure,” admits J Emz, while Celly and Spenny nod in agreement. “Sometimes I got to remind the boys what they’re going back to if this doesn’t work out.”\n\nAdvertisement\n\nRapping about Sydney gang subcultures, OneFour’s focus on the grittiness of the streets – violence, drug-dealing and run-ins with the police – blurred the lines between their art and life. Credit: Michael Candrick No one knows that better than Celly, whose incarceration meant he missed much of the album’s development. Instead, he worked on his lyrics in prison and recorded once he got out. “The journey for me was different [with this album] being in jail; you can either sit there and waste your days or try to use the time wisely, so I started writing a lot,” he says. “All you have is time to think about what you’ve done to end up there and what you’ll do not to go back, so the minute I got out, I was straight into it.” “I dropped that ball, time out, they threw me inside, I’m back on the bench.” Celly on Look At Me Now’s Family The result is Look At Me Now, a sprawling 15-track album on which the group collaborates with several high-profile UK drill rappers, including Nemzzz, Headie One, and Abra Cadabra. The record also sees OneFour collaborate for the second time with the Kid Laroi on Distant Strangers. Laroi and OneFour first crossed paths when they were both coming up and have remained close throughout Laroi’s success, with OneFour the opening act on his most recent tour of Australia. “I get inspired by Laroi every time, any opportunity we get to be around him is a learning for us,” says Spenny. “This is a guy on top, and he’s still the same kid we knew from back in the day.” OneFour with a young The Kid Laroi (third from the right) in Redfern. Credit: Screengrab\n\nAdvertisement\n\nThe release of Look At Me Now comes ahead of a nationwide tour in July and August that presents a familiar problem: they will play in every major city except Sydney. According to the group, NSW police continue to pressure venues by demanding extra user-pays-police (where officers are hired to police a private event paid for by the venue), leaving venues unwilling to host the band in their hometown. Police walk past a mock Mt Druitt sign At ONEFOUR’s album launch event at Sydney Dragway in Eastern Creek, in Sydney’s west. Credit: Mridula Amin “We don’t blame the venues when they have to take a dive, but it’s frustrating; our management has tried everything,” says J Emz. “The police make it difficult for the shows to go ahead, so the venues have no option but to pull out.” In a statement , NSW Police said: “We provide safety and security advice to venues, promoters, and other stakeholders ahead of major events. However, the decision as to whether an event will proceed lies with the relevant venue.” Loading J Emz admits that, for the first time, he’d encourage NSW Police to listen to their music. “The message is: we’re different now, we’re good people,” he says. “I don’t want to be defined by what I did,” adds Celly. “I served my time, suffered the consequences, and this is the next chapter.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/aviation-expert-gives-potential-reason-air-india-flight-crash-20250613-p5m775.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aviation expert gives potential reason Air India flight crash",
        "publish_date": "Fri, 13 Jun 2025 11:09:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Aviation expert gives potential reason Air India flight crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/declining-vaccination-rates-and-what-the-australian-government-is-doing-about-it/j7i2jrupg",
        "title": "Australia's 'very distressing' vaccination rates and what the government is doing about it",
        "publish_date": "Thu, 12 Jun 2025 19:43:21 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The declining rates of vaccination in Australia are \"very distressing\", according to one immunologist, as the federal government looks to tackle declining immunity.\n\n\n\n\n\nHealth Minister Mark Butler launched the national immunisation strategy on Thursday, which aims to increase vaccine uptake and foster community trust.\n\n\n\n\n\nIt's the kind of program that experts have told SBS News is vital in protecting vulnerable communities and children from diseases.\n\n\n\n\n\nJohn Dwyer, an immunologist and emeritus professor of medicine at the University of NSW, told SBS News there has been an erosion of trust in vaccines.\n\n\n\n\"Declining rates of vaccination, especially among children in Australia, are very distressing,\" he said.\n\n\n\n\n\n\"When you look at what's happening in the US, with the dismissal of top vaccine officials, it's a worry. Misinformation can be spreading not only there but here as well,\" Dwyer said.\n\n\n\n\n\nUnited States health secretary Robert F Kennedy Jr announced on Monday he is removing all 17 sitting members of the Centers for Disease Control and Prevention's vaccine advisory committee and replacing them with new members.\n\n\n\n\n\nDwyer said it's necessary for the Australian government to take a proactive approach to improve vaccination rates.\n\n\n\n\n\n\"We've got to counter this misinformation, which is far outweighing the good information that's available through social media,\" he said.\n\n\n\nWhat are the current childhood vaccination rates?\n\nData from 2020 to 2024 shows a decline in the vaccination rate among children under the age of five, according to Australia's National Centre for Immunisation Research and Surveillance.\n\n\n\n\n\nThe majority of children in Australia are vaccinated, but the government and experts say the goal is to reach 95 per cent coverage to ensure strong community protection.\n\n\n\nAccording to the National Centre for Immunisation Research and Surveillance, vaccination rates among children under the age of five have declined between 2020 and 2024. Source: SBS News In 2024, 91.6 per cent of one-year-olds were fully vaccinated, a drop from 94.8 per cent in 2020.\n\n\n\n\n\nTwo-year-olds were less likely to be fully vaccinated, with 89.4 per cent in 2024, a 2.7 per cent drop from 2020.\n\n\n\n\n\nBy age five, 92.7 per cent of children were vaccinated in 2024, compared to 94.9 per cent in 2020.\n\n\n\n\n\nFully vaccinated coverage for Aboriginal and Torres Strait Islander children continued to decrease in 2024 at all three age milestones.\n\n\n\n\n\nBut the largest drop was recorded at 24 months of age, with coverage declining by 4.5 per cent since 2020.\n\n\n\nVaccination coverage for Aboriginal and Torres Strait Islander children continued to decline in 2024 across all three milestone ages — one, two and 5 years. Source: SBS News \"Australia has high vaccination rates when you look globally, but our rates have fallen alarmingly,\" Dwyer said.\n\n\n\n\n\n\"This requires a positive campaign that makes people feel comfortable and yes, makes them feel a little guilty if they haven't done the best by their child by vaccinating them.\"\n\n\n\nWhat's the government's plan?\n\nThe national immunisation strategy aims to increase vaccination uptake across Australia over the next five years by reducing vaccine hesitancy and improving access.\n\n\n\n\n\nThe plan outlines priority areas, including enhancing vaccine access in First Nations communities, strengthening the immunisation workforce, and building trust.\n\n\n\nThe government's national immunisation strategy aims to improve vaccination uptake across Australia over the next five years by reducing vaccine hesitancy and improving access. Source: SBS News It also lists priority groups with conditions that put them at a greater risk of contracting or experiencing severe outcomes from vaccine-preventable diseases.\n\n\n\n\n\nThis includes the elderly, pregnant women and children.\n\n\n\n\n\nJames Trauer, the head of epidemiological modelling at Monash University's School of Public Health and Preventive Medicine, told SBS News these communities, especially those who may not be eligible for certain vaccines, are the most vulnerable.\n\n\n\n\n\n\"For some infectious diseases, you are really looking to rely on vaccination coverage to totally eliminate the disease or reduce its severity,\" he said.\n\n\n\n\n\n\"If your vaccination coverage falls below a certain level, you get outbreaks.\"\n\n\n\n\n\n\"For lots of infectious diseases, you get substantial immunity against infection through the vaccine, and you can totally control them and even reach elimination for many infectious diseases just by reaching high enough coverage,\" Trauer said.\n\n\n\nWhile 'herd immunity' cannot \"totally protect\" people from some viruses, such as COVID-19, he said others, like measles, can be \"eliminated\" from the population.\n\n\n\nWhat if your child has missed a vaccine?\n\nTrauer said each vaccine has specific guidelines for the optimal age at which it should be given to a child.\n\n\n\n\n\nHe said it's essential to consult a specialist about your options.\n\n\n\n\n\n\"I would absolutely recommend that anyone in that situation go and see somebody with expertise in that area.\n\n\n\n\n\n\"It is often possible and advisable to get some sort of catch-up schedule, particularly for the most important infectious diseases.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/jafar-panahi-it-was-just-an-accident-at-sydney-film-festival/my5n90c2f",
        "title": "'They will be happy in prison': The banned film screening in Australia this week",
        "publish_date": "Thu, 12 Jun 2025 19:41:40 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Jafar Panahi is one of Iran's most acclaimed filmmakers, yet most of the films he has produced over his 30-year career are banned in his home country.\n\n\n\n\n\nHe has been accused of \"propaganda against the regime\" and imprisoned twice by Iranian authorities since 2010. But that hasn't stopped the 65-year-old director from making work; instead, he has taken his filmmaking underground.\n\n\n\n\n\nHis latest film, It Was Just an Accident, draws inspiration from his time in prison, particularly his experience of solitary confinement at Tehran's notorious Evin prison in 2010.\n\n\n\nJafar Panahi made an unexpected appearance at the opening night of the Sydney Film Festival. Source: Supplied / SFF/Tim Levy Speaking with SBS News ahead of the film's Australian premiere, Panahi recounts being locked in a cell barely big enough to lie down and forced to sit blindfolded for weeks on end.\n\n\n\n\n\nHis only contact during this time was with a faceless interrogator, whose identity remains a mystery to this day.\n\n\n\n\n\n\"I only talked when they took me to interrogation … I would have sat on a chair facing the wall, with my eyes closed, blindfolded, and behind me was the interrogator. He would talk or write something, and give it to me,\" he says.\n\n\n\nOnly then did my sense of hearing work. It means that all your senses will fade, and you just become curious to see who you are dealing with and [try to] understand their personality from their voice.\n\n\"At that time, I tried to keep all the details of this voice in mind … How much of that voice is with me now, I don't really know. Whether I would remember it if the same person came and spoke behind me, I don't really know,\" Panahi says.\n\n\n\nLISTEN TO Iranian director wins top prize at Cannes, urging 'unity' and 'freedom' SBS News 25/05/2025 08:27 Play\n\nPanahi's lingering curiosity about his interrogator and whether he would recognise him if they encountered each other again forms the basis for the film, although he stresses it’s not autobiographical.\n\n\n\n\n\nIt tells the story of a group of former political prisoners in Iran who stumble across and subsequently kidnap a man they believe to be their former torturer while on a road trip. They then wrestle with the dilemma of what to do: show mercy or exact revenge.\n\n\n\n\n\n\"Some of it was my experience, and the rest of it was the experience of other friends in prison … I definitely didn't have the experience those friends had in prison,\" he says.\n\n\n\n\n\n\"When I came out [of prison], after a while, the things I had heard would come to my mind and they would live with me, and I realised that I had to express them somehow, and eventually, when they were outpoured, it became 'It Was Just an Accident'.\n\n\n\n\n\n\"This film starts with the voice at the beginning, and then it follows with those stories.\"\n\n\n\nFrom persecution to innovation\n\nPanahi first started exploring experiences of imprisonment under Iran's regime in 2000 with his film The Circle, which is a critical analysis of the treatment of women in Iran from the perspective of two prison escapees.\n\n\n\n\n\nLittle did he know he would be arrested and sentenced to time in prison just ten years later during Iran's Green Movement protests.\n\n\n\n\n\nThe then-50-year-old had been working on a film set amid the protests, which rose in response to the 2009 presidential election of Mahmoud Ahmadinejad — a result many believed was rigged.\n\n\n\nREAD MORE Iran's Panahi winner at Berlin film fest\n\nHundreds, including Panahi, were arrested, and several were killed during the movement. He was subsequently banned from filmmaking, giving interviews and travelling outside of Iran for 20 years and sentenced to six years in prison.\n\n\n\n\n\nPanahi managed to remain free, and it was at that point that he took his filmmaking underground.\n\n\n\n\n\nOver the coming decade, he would produce some of the most notable films of his career, including 2011's This is Not a Film, which he co-directed with Mojtaba Mirtahmasb and famously smuggled out of the country on a USB wedged into a cake.\n\n\n\n\n\n\"When I was first given a 20-year ban from working, I was thinking about what I should do now,\" Panahi says.\n\n\n\nShould I say goodbye to the cinema? Should I be sidelined? Or should I look for a solution to how to work?\n\nRather than act as a deterrent, the ban propelled Panahi into a period of innovation. Along with This is Not a Film, he produced Closed Curtain in 2013 and Taxi in 2015, which round out a trilogy of films shot covertly while Panahi was under house arrest in northern Iran.\n\n\n\n\n\nIn Taxi, which won the Golden Bear — the top prize at the Berlin International Film Festival — Panahi took his renegade cinema to the streets.\n\n\n\n\n\nThe film is shot entirely from the inside of a car, using a camera attached to the windshield, which mimics an \"anti-theft device\" typically placed on car dashboards. The actors each enter and exit the scenes as Panahi, who is driving, picks them up and drops them off.\n\n\n\nTaxi was filmed secretly in Tehran, with Jafar Panahi posing as a taxi driver and using a camera disguised as a security device. Credit: Supplied \"We slowly found a solution to come out of the house and film on the street ... I found a solution to go into a village and even to the border. I could even send my group across the border,\" Panahi says.\n\n\n\n\n\n\"We found ways to do all of this. Of course, it had its own difficulties.\"\n\n\n\n\n\nJust over a decade after his filmmaking ban was first enforced, in July 2022, Panahi was arrested when he went to the prosecutor's office in support of his fellow filmmakers, Mohammad Rasoulof and Mostafa Aleahmad, who were being held in detention.\n\n\n\nPanahi would spend the next seven months in prison, listening to stories from inmates — stories that would lay the groundwork for It Was Just an Accident.\n\n\n\n\n\n\"I had a lot of time and every time I talked to one of these people. They wanted to talk all the time, and I was an attentive listener; I sat and listened to what they had to say,\" he says.\n\n\n\n\n\nPanahi was released in February 2023, just days after he started a hunger strike in protest against the behaviour of the security and judicial apparatus in Iran.\n\n\n\n\n\nHe quickly set about working on his next film.\n\n\n\nIn Iran, all films must first get a production permit before filming begins, and then a separate screening permit after the film is completed. The country's culture and Islamic guidance ministry is responsible for the permits. Credit: Supplied\n\n'Film is valuable work'\n\nAs with his other films over the last 15 years, Panahi shot and produced It Was Just an Accident without obtaining the usual permissions required by Iran's culture and Islamic guidance ministry, which strictly regulates film production in the country. It was filmed in secret, and the female actors didn't wear the country's compulsory hijab.\n\n\n\n\n\n\"In countries that have totalitarian governments, they try to create conditions in any way possible that they are not united with each other,\" he says.\n\n\n\n\n\n\"When we live inside Iran, we can feel this very well.\"\n\n\n\n\n\nDespite the challenges of making films and the constant threat of imprisonment, Panahi remains resolute in his commitment to the art form.\n\n\n\n\"I'm a filmmaker who is focused on social issues. I get inspiration from the society I live in and I create my own film,\" he says.\n\n\n\n\n\n\"First, I have to accept that that film is a valuable work that I can put my signature on.\"\n\n\n\nI really hope my film gets shown in Iran and that Iranians get to see it. I've worked very hard for it.\n\nInternational acclaim\n\nIt Was Just an Accident made its world premiere at the Cannes Film Festival in May, where it received the Palme d'Or, one of the most prestigious film awards, given to the director of the Best Feature Film of the Official Competition.\n\n\n\n\n\nPanahi travelled to France for the ceremony, marking his first trip outside of Iran in 14 years. The moment he was announced as the winner, he appeared emotional, smiled, and remained seated for a few seconds.\n\n\n\n\n\nReflecting on the moment, he says he was thinking about a phone call he had received from prison in Iran just a day earlier.\n\n\n\nAfter his mentor Abbas Kiarostami, Jafar Panahi is the second Iranian filmmaker to win the Palme d'Or award. Source: Getty / Stephane Cardinale / Corbis \"This friend who contacted me said that 'we had found a sense of hope inside the prison and that we wanted to do something here after you succeeded',\" Panahi says.\n\n\n\n\n\nHe was moved by the call and says he felt a responsibility to live up to their hopes.\n\n\n\n\n\n\"I was constantly feeling responsible. I was constantly feeling anxious. I don't know what the right word would be to describe it. I was starting to think that there was a heavy burden on my shoulders. I didn't sleep that night,\" he says.\n\n\n\n\n\n\"When they announced it [the Palme d’Or], I just breathed a sigh of relief … I didn't have the strength to get up from my chair at all.\"\n\n\n\nI said to myself, 'this burden has been lifted off my shoulders and I won't disappoint those friends again. Now, they will be happy in prison.'\n\nThe film will screen for the first time in Australia this weekend at the 72nd Sydney Film Festival, which is also screening a retrospective of his feature films titled Cinema in Rebellion.\n\n\n\n\n\nPanahi made a surprise guest appearance at the festival's opening gala, which was kept under wraps for his safety.\n\n\n\n\n\nHis trip to Australia is his second time leaving Iran since 2010.\n\n\n\nIranian filmmaker Jafar Panahi's It Was Just an Accident will be screened at the Sydney Film Festival. Credit: Belinda Rolland Photography/Belinda Rolland\n\n'I cannot live outside Iran'\n\nSince the 1979 Islamic Revolution, many Iranian artists, such as Panahi, have turned to the underground mode of filmmaking to continue creating their artworks in secret, while others have decided to leave.\n\n\n\n\n\n\"I'm also one of those people who can't live anywhere except Iran. This may be my weakness, that I can't adapt to another place,\" Panahi says.\n\n\n\n\n\n\"Knowing myself, on the very first day I arrived [in Cannes] … I announced that I would come back [to Iran] under any circumstances, and I did what I believed in.\n\n\n\n\n\n\"I'm not a brave person at all. I just announced this because I'm not able to live outside of Iran. What danger could there be? Is it more dangerous than a woman going out in Iran without wearing a hijab?\"\n\n\n\nDespite the heartfelt support of the world cinema community, Panahi's Palme d'Or win was not welcomed by Iranian officials, who summoned France's chargé d'affaires after the French foreign minister called the film \"a gesture of resistance\".\n\n\n\n\n\nThey also publicly condemned the French government, citing its \"misuse of its role as host of a film event to advance its political agenda against the Islamic Republic of Iran\".\n\n\n\n\n\nBut despite the criticism and ongoing concerns for Panahi's safety, the filmmaker returned home after the Cannes Film Festival, where he was greeted by fans at the airport, clapping and chanting \"Woman, Life, Freedom\" — the rallying cry of the women's rights movement sparked after the death of Mahsa Amini in 2022 .\n\n\n\n\n\n\"As soon as you feel that hope has been created — that moment of receiving an award and that phone call that was in prison — as soon as you see these in the people who have come to welcome you, you feel happy.\"\n\n\n\nYou feel that you have created a sense of hope, especially in young filmmakers, that their films will finally pay off.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-study-reveals-some-popular-australian-sunscreens-are-not-meeting-their-sun-protection-claims/4cb4w1g3e",
        "title": "New study reveals some popular Australian sunscreens are not meeting their sun protection claims",
        "publish_date": "Thu, 12 Jun 2025 10:36:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "New study reveals some popular Australian sunscreens are not meeting their sun protection claims\n\nPublished 12 June 2025, 9:45 am\n\nA new study has found some of Australia’s most popular sunscreens are failing to meet their sun protection claims. Independent testing by consumer group Choice has revealed a large proportion of sunscreens they tested did not have the advertised protection level. Several sunscreen manufacturers have disputed the findings.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australia-says-theres-no-plan-b-as-trump-admin-puts-aukus-under-review/2lz9hlxe0",
        "title": "Australia says there's no Plan B as Trump admin puts AUKUS under review",
        "publish_date": "Thu, 12 Jun 2025 08:26:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia's Defence Minister Richard Marles is downplaying concerns over news the United States government has placed the AUKUS defence agreement under review, threatening Australia's access to nuclear-powered submarines.\n\n\n\n\n\n\"We've known about the review for some time. We welcome it.\"\n\n\n\n\n\nHe's being interviewed here on Sky News.\n\n\n\n\n\n\"I do have a sense of confidence about the way in which AUKUS is playing out under the Trump administration, and that we will meet the pathway that we have committed to and that we've committed to in a treaty between our three nations, but in the context of that I think it's totally understandable that an incoming government will want to undertake a review.\"\n\n\n\n\n\nThe third party to the AUKUS is the United Kingdom - and they are also reviewing the $368 billion defence pact.\n\n\n\n\n\nBut it's the US review of this massive submarine deal that has caused alarm in some quarters.\n\n\n\n\n\nIt falls against a backdrop of doubts about Donald Trump's stance.\n\n\n\n\n\nREPORTER: \"Will you be discussing AUKUS with the prime minister, sir?\"\n\n\n\n\n\nTRUMP: \"What does that mean?\"\n\n\n\n\n\nREPORTER: \"AUKUS, the Australia-US defence alliance.\"\n\n\n\n\n\nThat exchange took place in February, and although Mr Trump later clarified that he does know what AUKUS is, it left lingering questions about whether it's seen as a priority.\n\n\n\n\n\nThe purpose of the US review is to assess whether the agreement aligns with the Trump administration's 'America first' agenda.\n\n\n\n\n\nAustralia has already invested $800 million dollars as a down payment to secure three Virginia class nuclear submarines from 2032.\n\n\n\n\n\nThe US defence bureaucrat conducting the review, according to reporting from the Financial Times, is Elbridge Colby.\n\n\n\n\n\nHe's expressed scepticism about AUKUS before.\n\n\n\n\n\n\"If we can produce the attack submarines in sufficient number and sufficient speed, then great but if we can't that becomes a very difficult problem because we don't want our servicemen and women to be in a weaker position and more vulnerable. \"\n\n\n\n\n\nThe US submarine building program is lagging years behind its production schedule, prompting concerns Australia's submarines could be delayed or simply not delivered at all.\n\n\n\n\n\nSpeaking with Sky, Richard Marles concedes that, on this front, there is work to do.\n\n\n\n\n\n\"There is a big challenge, in getting those sustainment and production rates up. We knew that when we signed, when we reached the optimal pathway agreement back in March of 2023.”\n\n\n\n\n\nNews of the review comes as the Trump administration pressures Australia to hike defence spending to 3.5 per cent of GDP, with US Defence Secretary Pete Hegseth highlighting what he called \"a real and potentially imminent\" threat from China.\n\n\n\n\n\nEarlier this month, Prime Minister Anthony Albanese pushed back against that pressure.\n\n\n\n\n\n\"Ah, no, what we'll do is we'll determine our defence policy, and we've invested - just across the forwards - an additional ten billion dollars in defence. What we'll do is continue to provide for investing in our capability, but also investing in our relationships in the region.\"\n\n\n\n\n\nAustralia currently spends around 2 per cent of GDP on defence, with a goal to raise that to 2.3 per cent within ten years.\n\n\n\n\n\nThe Coalition has pushed for a higher target of 2.5 per cent within 5 years, and 3 per cent inside the next decade.\n\n\n\n\n\nDefence spokesperson Angus Taylor has sought to highlight this difference in light of today's news.\n\n\n\n\n\n\"We need to know to what extent was the review triggered by Labor's failure to fund defence in this country.\"\n\n\n\n\n\nThe Coalition has also been critical of Australia's decision to level sanctions this week against two far-right Israeli ministers for inciting violence against Palestinians in the occupied West Bank.\n\n\n\n\n\nAustralia's other AUKUS partner, the UK, applied the same sanctions, along with Canada, New Zealand, and the Netherlands.\n\n\n\n\n\nBut the US, a close ally and arms supplier to Israel, says the sanctions undermine its efforts to advance a ceasefire in Gaza.\n\n\n\n\n\nMr Taylor also questioned whether the decision to sanction Israel was a factor behind the US review.\n\n\n\n\n\nMeanwhile, others suggest the US review points to a need for Australia to conduct its own.\n\n\n\n\n\n\"There is literally a denial of reality in Canberra. I don't think we're going to get any submarines from the Americans.\"\n\n\n\n\n\nThat was former Liberal Prime Minister Malcolm Turnbull speaking this morning to the ABC.\n\n\n\n\n\nAnother outspoken former PM, Paul Keating, says in a statement that this \"might be the moment Washington saves Australia from itself\".\n\n\n\n\n\nThe Greens have also been critical of the AUKUS agreement.\n\n\n\n\n\nHere's defence spokesperson, Senator David Shoebridge.\n\n\n\n\n\n\"If you wanted to be reckless with Australia's defence, you would continue down the AUKUS path. Yet that is exactly what Labor and the Coalition are proposing to do, without any review. Right now, we need an urgent parliamentary review into AUKUS, which can't just be populated by the noddies in Labor and the coalition, but which must have critics of AUKUS on that parliamentary review. The Australian public deserves at least that.\"\n\n\n\n\n\nRichard Marles has dismissed calls to dump AUKUS or develop a Plan B, saying there can be no more alterations after years of indecisive policy on defence acquisition.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/finfluencers-put-on-notice-oil-prices-soar-on-supply-fears/wty6qu9m5",
        "title": "Finfluencers put on notice & oil prices soar on supply fears",
        "publish_date": "Thu, 12 Jun 2025 08:16:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/choice-study-doesnt-diminish-sunscreens-importance-in-melanoma-capital-of-the-world-advocates-say/qz0fo7bb8",
        "title": "CHOICE study doesn't diminish sunscreen's importance in melanoma capital of the world, advocates say",
        "publish_date": "Thu, 12 Jun 2025 07:49:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIn 2008, Jay Allan was diagnosed with stage 3 melanoma.\n\n\n\n\n\nOver a decade later, after recovering, he founded the Australian Skin Cancer Foundation, hoping to support patients who have similar experiences, and promote sun safety messages.\n\n\n\n\n\n\"Often people don't think (you need to apply sunscreen), especially in winter. But in many parts of Australia, U-V levels are 3 or above, right through the winter months. So really important when you go outside and even you think, 'oh it's cloudy today', we definitely recommend that (you) look at the U-V rating on your phone and often as I mentioned, the levels are 3 and above each day, you should follow the five sun safe rules including applying sunscreens.\"\n\n\n\n\n\nAustralia has the highest melanoma rates in the world, and is the third most common cancer in the country.\n\n\n\n\n\nSunscreen has been at the heart of sun safety messaging for decades - but a new report has raised concerns.\n\n\n\n\n\nThe report from consumer advocacy group CHOICE has found that only four out of the 20 popular sunscreen products in Australia they tested actually match the rating of Sun Protection Factor - or S-P-F - they claimed to have.\n\n\n\n\n\nThe testing DOESN'T mean the sunscreen products are NOT working, but they might just not be as effective.\n\n\n\n\n\nBut CHOICE's chief executive Ashley De Silva says the issue here is that some products aren't aligned with what they HAVE claimed.\n\n\n\n\n\n\"We picked a whole range of brands, many products I think people would be familiar with across the country, and one thing it stands out is that it's not aligned to the brand, so you saw brands like Cancer Council and Neutrogena, they were both one of the four sunscreen that worked, but both of them have products that didn't make their claims as well, so it's not necessarily brand related, it's very specific to the product, and in one instance we had a product that scored as low as four when it was advertised as 50+, it was so low we re-tested it in a separate lab with a different batch of that product, and it came back with a five.\"\n\n\n\n\n\nAccording to the Therapeutic Goods Administration, sunscreen products with an SPF of 30 are already effective to use, while those in the range of 30 to 59 provide HIGH protection.\n\n\n\n\n\nThe TGA says that regardless their brands and SPF levels, sunscreens need to be re-applied frequently.\n\n\n\n\n\nAccording to the CHOICE report, half of the 16 products still fall into the SPF range between 30 and 50.\n\n\n\n\n\nSix of them are between 20 and 30 - which could be less effective if you often go outdoors.\n\n\n\n\n\nCHOICE contacted the brands following their reports, and while all the brands say they stand by their products, Ashley De Silva says the T-G-A need to take action.\n\n\n\n\n\n\"The TGA needs to kind of look at the fact that this is so far apart and what we are asking them to do is at least for the compliance testing on the 16 products that we've tested that didn't meet their claims.\"\n\n\n\n\n\nIn a statement to SBS News, the T-G-A has said they are investigating the findings from CHOICE, and will take regulatory action as required.\n\n\n\n\n\nMeanwhile, experts and advocates say the sun safety message remains the same - and the importance of sunscreen is unchanged.\n\n\n\n\n\nJay Allan again.\n\n\n\n\n\n\"You know, if you're using sunscreen at the moment and it's working, you're not getting burnt, then continue to do that. But I guess we'll wait for the second round of the testing to be done, but we just stick to what the scientists and the research points to and that is that sunscreen, you know, can prevent skin cancers, including basal cell carcinomas, squamous cell carcinomas, and in a particular deadly melanoma. So until researchers and you know, come out and say that sunscreen is no good for you, then we can run with that message, but we just got to stick to the science at the moment.\"\n\n\n\n\n\nProfessor David Whiteman from the QIMR Berghofer Medical Research Institute says other approaches for sun safety are also important.\n\n\n\n\n\nThe Professor says sunscreen should only be the last line of defence.\n\n\n\n\n\n\"We advise people to seek shade from the sun, to protect their skin using hats and sunscreens, and adopt protective clothing, but sunscreen is really the last line of defence for skin that is unprotected to other measures, so it should never be the first line of defence, it's always something we apply to skin that we can't protect in other ways.\"\n\n\n\n\n\nTamara Dawson is the founder of the Melanoma and Skin Cancer Advocacy Network.\n\n\n\n\n\nShe suggests checking the ultraviolet radiation - or U-V - before people head outdoors.\n\n\n\n\n\n\"It's important for all Australians to really understand what the U-V index is where they live, and what the U-V levels are, so in Melbourne, we can be a bit more careful with out sun protection over winter, but certainly in Queensland and other parts of Australia, there's a real opportunity for all Australians what their U-V exposure is.\"\n\n\n\n\n\nSince the 1980s, Australia has adopted the famous \"Slip, Slop, Slap\" public health campaign for sun safety.\n\n\n\n\n\nProfessor Whiteman says sun protection measures can have different impacts on people with different skin tones.\n\n\n\n\n\nWith the growth of immigration in Australia, he says authorities therefore need to rethink its public messaging.\n\n\n\n\n\n\"Look it certainly introduces new communication challenges, because no longer there's one-size-fits-all strategy work, so we need to make sure people at higher risks maintain their very high level of sun protection, and maintain vigilant against excessive sun exposure. But equally, there are other people who are at much lower risks, in fact have a risk of Vitamin D deficiency, so we must ensure that those people get the right message about how to protect themselves against low Vitamin Ds.\"\n\n\n\n\n\nTamara Dawson has stressed the importance of including sun protection into daily routines.\n\n\n\n\n\n\"So we have really high and harsh U-V levels in Australia. In the middle of summer, our U-V index reach 12, 13, 14, and the maximum in the UK or Europe at the peak of their summer is about 6. So there's so much we could all kind of implement our daily routine that can protect us from some of these harsh UV levels. The experts often tell us that incidental exposure, it's walking to the shops or food pick up. So it's not just the day that we are sitting on the beach that we need to think about our U-V exposure.\"\n\n\n\n\n\nFor Jay Allan, his experience of melanoma is never far from his mind.\n\n\n\n\n\nHe says sunscreen is at the heart of his sun safe routine.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-says-rare-earths-deal-reached-with-china/117r7q4of",
        "title": "'A great deal': Donald Trump says rare earths agreement reached with China",
        "publish_date": "Thu, 12 Jun 2025 06:53:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has said talks aimed at cooling trade tensions between the world's two largest economies have ended in \"a great deal\", which will result in China supplying rare earths to the US, in exchange for the Trump administration walking back threats to revoke Chinese student visas.\n\n\n\n\n\n\"Our deal with China is done, subject to final approval from President Xi [Jinping] and me,\" Trump wrote on his Truth Social platform.\n\n\n\n\n\n\"Full magnets, and any necessary rare earths, will be supplied, up front, by China. Likewise, we will provide to China what was agreed to, including Chinese students using our colleges and universities [which has always been good with me!].\"\n\n\n\n\n\nThe announcement came after days of talks between US and Chinese officials in London, aimed at resolving the trade dispute that had led to reciprocal tariffs earlier this year.\n\n\n\n\n\n\"We are getting a total of 55 per cent tariffs, China is getting 10 per cent,\" Trump wrote, celebrating the agreement.\n\n\n\nREAD MORE Trump accuses China of violating temporary trade truce\n\nWhite House officials later explained the 55 per cent figure being cited included tariffs put in place during Trump's first term in office.\n\n\n\n\n\nApart from Trump's public comments, many of the specifics of the deal and its implementation details remain unclear.\n\n\n\n\n\nThe market reaction to the news was limited, with some analysts citing the \"unfinished\" nature of the agreement as the reason.\n\n\n\n\n\nThe two countries had gathered in London for the talks, which started earlier this week, to address gaps in a temporary trade truce agreed upon in Geneva last month.\n\n\n\n\n\nThe Geneva deal had faltered due to China's continued curbs on critical minerals exports, prompting the Trump administration to respond with export controls that prevented shipments of semiconductor design software, chemicals and other technology goods to China.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-12-june-2025/ffn9nfzmy",
        "title": "SBS News in Easy English 12 June 2025",
        "publish_date": "Thu, 12 Jun 2025 04:09:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Welcome to SBS News in Easy English. I'm Biwa Kwan.\n\n\n\n\n\nThe future of the AUKUS security alliance between Australia, the US and the UK is uncertain, after the US announced a review into the deal.\n\n\n\n\n\nThe Pentagon has launched a review of the agreement to ensure it aligns with President Donald Trump's policy agenda.\n\n\n\n\n\nDefence Minister Richard Marles has dismissed speculation the United States may back out of the deal, saying it is important to stick to the plan to ensure the defence capability is acquired.\n\n\n\n\n\nThe Opposition's spokesman for defence, Angus Taylor says actions must be taken to ensure the AUKUS deal is maintained.\n\n\n\n\n\n\"We have been consistent in providing bipartisan support to AUKUS. And we will continue. It is hugely important that it succeed for peace in our part of the world. This US review came out of the blue. We need to know to what extent was the review triggered by Labor's failure to fund defence in this country to a level that the US and other partners think is appropriate.\"\n\n\n\n\n\nGreens defence spokesperson David Shoebridge says the US review shows the AUKUS deal makes Australia a junior partner in America's military strategy, not an equal ally.\n\n\n\n\n\n+++\n\n\n\n\n\nSome of Australia’s most popular sunscreens - including some made by Bondi Sands, Banana Boat and the Cancer Council - are not delivering on the claims made on the level of skin protection.\n\n\n\n\n\nIndependent testing by consumer group Choice found more than three-quarters of SPF 50+ sunscreens did not have the advertised protection\n\n\n\n\n\nChoice CEO Ashley de Silva says only four of the 20 sunscreens tested in an accredited sunscreen lab actually met their claims of SPF 50 or 50+ protection.\n\n\n\n\n\nThe Cancer Council says its test results shows their sunscreens meet their SPF ratings, but they have submitted the products for further testing.\n\n\n\n\n\nSeveral other popular brands have indicated they plan to do additional testing, following the findings.\n\n\n\n\n\n+++\n\n\n\n\n\nThe chief executive of Monash IVF has resigned, after the fertility clinic revealed a second instance of an error involving an embryo transfer - two months after the first mix-up.\n\n\n\n\n\nMichael Knaap, who had been the chief executive since 2019 has resigned.\n\n\n\n\n\nEarlier this week, in a statement to the stock exchange, Monash IVF revealed the mix-up took place on June 5 at its Melbourne laboratory.\n\n\n\n\n\n+++\n\n\n\n\n\nAn Australian sperm donor, caught up in a cyber security data breach, has told S-B-S he is unsure how he and his donor-conceived child will be affected.\n\n\n\n\n\nIsaac chose to use Genea Fertility, which was later hacked by cyber criminals in a data breach.\n\n\n\n\n\nThe family histories of medication and mental illness of some of the clinic's donors are now being shared on the dark web.\n\n\n\n\n\nIsaac says he is worried his own sensitive medical information could be weaponised.\n\n\n\n\n\nHis response has been voiced up by a journalist to protect his privacy:\n\n\n\n\n\n\"What happens if I get a job which is relatively high profile or dealing with sensitive activity, could this open me up to not getting employed because an employer might've found my internet history, and maybe they have had ethical concerns or concerns with my health record. It's taken away my agency and my choice to disclose that information if I want to. That's only compounded further by the lack of information that I've been provided about this investigation and the data breach.\"\n\n\n\n\n\nIn a statement, Genea told SBS its cyber teams are working hard to understand the nature and extent of the data that has been published, and to identify affected individuals.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Filipino community in Australia is marking Philippines Independence Day, with festivities to showcase the country's heritage, culture and community spirit.\n\n\n\n\n\nJune 12th commemorates the declaration of Philippine independence from Spain in 18-98, and has been the country's National Day since 1978.\n\n\n\n\n\nFilipino-Australian Siegfrid Bacani was born in the Philippines and came to Australia as a teenager.\n\n\n\n\n\nHe told SBS Filipino it is important that his son knows his heritage.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/summers-dreams-heartbreak-and-hope-beach-boys-co-founder-brian-wilson-dies/w507y71qy",
        "title": "Summers, dreams, heartbreak and hope: Beach Boys co-founder Brian Wilson dies",
        "publish_date": "Thu, 12 Jun 2025 04:08:58 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nBrian Wilson, the visionary force behind The Beach Boys and architect of the California sound, has died at the age of 82.\n\n\n\n\n\nFor millions, his music defined summers, dreams, heartbreak and hope.\n\n\n\n\n\nBut behind those shimmering harmonies was a man who spent a lifetime balancing brilliance with pain.\n\n\n\n\n\nBorn in Hawthorne, California, Mr Wilson grew up in a household filled with music, pressure, and abuse.\n\n\n\n\n\nWith his brothers Carl and Dennis, cousin Mike Love and friend Al Jardine, he formed a band that would soundtrack a generation.\n\n\n\n\n\nBut even in their earliest hits, about surfing, cars, and high school romance, there were hints of something deeper - yearning, fragility, a search for meaning.\n\n\n\n\n\nChris Willman is chief music critic at Variety magazine.\n\n\n\n\n\nHe says Wilson was so much more than a pop hitmaker.\n\n\n\n\n\n“When we think of the great California acts of all time, the great LA bands of all time, we think of just a handful, the Beach Boys, the Doors, the Birds, not very many others. And the Beach Boys arguably are at the top of that heap and representing a California dream that may have been a little bit of an illusion. I think the world grew up thinking that everyone in California surfed because of the Beach Boys.”\n\n\n\n\n\nBrian Wilson's masterpiece, Pet Sounds, released in 1966, remains a towering achievement in modern music.\n\n\n\n\n\nIt’s a record that inspired Sergeant Pepper, moved the Beatles' Paul McCartney to tears, and gave us one of the most tender love songs ever written.\n\n\n\n\n\nMr Willman says Wilson's ability to marry the simple with the symphonic set him apart from everyone.\n\n\n\n\n\n“I think Brian was the most talented musician in pop music of the 20th century, if we had to pick one. I'm not sure there's even competition for that; as much as we all love The Beatles, people like that, just in terms of being innately gifted, not as a lyricist, certainly not as a raconteur, he was not a particularly verbal person even in his best periods, but the sophistication of that music.”\n\n\n\n\n\nBut Brian Wilson's genius didn’t come without cost.\n\n\n\n\n\nHe was tormented by mental illness, fuelled in part by an abusive father, drug addiction, and the unbearable pressure of perfection.\n\n\n\n\n\nHe spent years in seclusion before reuniting with his daughters Carnie and Wendy.\n\n\n\n\n\nHe later found love with Melinda Ledbetter, and although she died in 2024, their union helped him find late-life joy, and peace.\n\n\n\n\n\nWith characteristic humility, Wilson reflected on being called an icon.\n\n\n\n\n\n\"It means that I'm... I don't know exactly what it means. Do you know what it means? It just means that I’m an icon. An icon.”\n\n\n\n\n\nInducting Wilson into the Songwriters Hall of Fame, Paul McCartney said his music had the power to make him cry.\n\n\n\n\n\n\"Thank you sir, for everything that you've done for me, for making me cry, for having that thing that you can do with your music, you just put those notes, those harmonies together, stick a couple of words over the top of it and you've got me any day, ladies and gentlemen, Brian Wilson.\"\n\n\n\n\n\nFrom the sunny rebellion of Fun, Fun, Fun to the existential ache of I Just Wasn’t Made for These Times, Brian Wilson’s music was a diary of innocence lost.\n\n\n\n\n\nOn one occasion he reflected on his relationship with his fellow Beach Boys and problems during the original recordings.\n\n\n\n\n\n\"I don't know - it's such a rough kind of memory for me because I had a lot of difficulty with the boys and they didn't want to cooperate with me so we just...we shelved 'Smile' in other words and I guess they probably said 'Oh that's good, I'm glad you shelved it.' I'm sure they were happy about that but you know. Sorry folks.\"\n\n\n\n\n\nIn his final years, Brian Wilson struggled with dementia and after his wife's death, his family placed him under conservatorship.\n\n\n\n\n\nAnd yet, his music - still playing from radios and turntables and headphones around the world - remains ageless.\n\n\n\n\n\nVariety magazine's Chris Willman sums up his legacy.\n\n\n\n\n\n\"I mean, a year or two ago they put out a Dolby Atmos version of the ‘Pet Sounds’ album, which is widely considered one of the greatest albums of all time, and it's really like listening to this incredible symphony when you're able to hear all those different parts. It just bowls you over. On top of just having very simple melodies, obviously, ‘Fun, Fun Fun,’ ‘California Girls,’ it's not that deep. So he could do the simple and the most complex music in the world, and there was nobody on his level in pop music.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/kaprica-customer-abused-by-restaurant-owner-20250613-p5m77m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Kaprica customer abused by restaurant owner",
        "publish_date": "Fri, 13 Jun 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Kaprica customer abused by restaurant owner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/our-incomes-don-t-match-housing-meet-the-people-in-nsw-s-missing-middle-20250613-p5m75s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Our incomes don’t match housing’: Meet the people in NSW’s missing middle",
        "publish_date": "Fri, 13 Jun 2025 11:58:43 +1000",
        "category": "finance",
        "authors": [
            "Alexandra Smith"
        ],
        "text": "Housing is so scarce in parts of NSW that employers are renting properties on behalf of hospitality staff while some public health workers resort to sleeping in cars to avoid long commutes, prompting MPs to urge the Minns government to act urgently on essential workers’ access to housing.\n\nA parliamentary select committee inquiry into essential worker housing, chaired by Sydney MP Alex Greenwich, found that these workers – who are broadly defined as someone who works face-to-face providing key services – are the forgotten group in the government’s housing policies.\n\nGlenda Walker, a pyschologist in the public health system, gave evidence at a parliamentary inquiry into essential worker housing.\n\nThe committee’s report said essential workers ensure NSW’s cities and regions can function, “yet, without adequate access to safe housing that is affordable, many of these workers are forced to sacrifice their wellbeing in order to deliver the services our state needs”.\n\nA key finding in the report was that no single government agency is responsible for co-ordinating essential worker housing. Housing NSW should take over control, the report recommends.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/you-and-your-phone-video-staff-expose-unhinged-pietro-barbagallo-20250528-p5m2sz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You and your phone!’ Video, staff expose ‘unhinged’ Pietro Barbagallo",
        "publish_date": "Fri, 13 Jun 2025 11:58:10 +1000",
        "category": "finance",
        "authors": [
            "Charlotte Grieve"
        ],
        "text": "“Turn that f---ing phone off! You and your f---ing phone!” Barbagallo shouted at customers, as they screamed and exited the venue. “Get out of my f---ing restaurant!”\n\nHe stands over the customer, admonishing him, before shouting profanities at the group, pulling their tablecloth, smashing the remaining plates and glasses.\n\nFootage obtained by this masthead shows one of the customers recording a video message to his partner complaining about the spice of the food before celebrated chef Pietro Barbagallo looms in the corner of the clip.\n\nThey ordered wine and starters, but when the prawn pasta arrived, it was simply too spicy and the waitress agreed to replace the dish. The nasty turn the night then took was caught on camera.\n\nIt was a bustling Thursday evening at the heritage-listed terrace, with almost every white-clothed table filled as the trio took their seats. They were excited to try the Carlton restaurant that had recently gone viral on social media.\n\nDimmed lights, soft music and the smell of fresh sugo greeted the friends as they entered popular Italian eatery Kaprica for dinner.\n\nAdd articles to your saved list and come back to them any time.\n\nShe described two incidents as particularly memorable. She alleges Barbagallo once threw a pizza shovel at her head, then on a separate occasion exposed his genitals to her at his house after offering her cocaine and champagne.\n\n“It was relentless,” she said. “He smashed plates on peoples’ tables. He would shout all the time, throw things, smash glasses and plates.”\n\nCarly Lauder worked for the celebrated chef in the early 2000s at his former restaurant, I Carusi in Brunswick. Having built a career in hospitality – where she still works today – Lauder said Barbagallo was by far the worst person she has ever worked for.\n\nCarly Lauder says Barbagallo exposed his genitals to her and threw a pizza shovel at her. Credit: Simon Schluter\n\nBarbagallo did not respond to repeated requests for comment or to a detailed list of emailed questions. When this masthead approached him at his restaurant this week again asking him to respond to the allegations, particularly of indecent exposure, he said, “no, no, no” before closing and locking the door.\n\nBarbagallo, who was credited by The Age in 2005 with kick-starting Melbourne’s “pizza revolution”, also stands accused of indecent exposure, inappropriate sexual comments towards staff and financial mismanagement across his venues.\n\nInterviews with 19 current and former employees at Barbagallo’s restaurants suggest this incident was not isolated, with allegations of aggressive outbursts stretching back decades. The claims come as the wider industry is struggling to overcome a historic work-hard-play-hard culture that critics say enabled poor conduct by those in positions of power.\n\n“I’ve seen him throw cutlery when he’s mad, throw plates and smash them against the wall,” she said. “It’s quite scary and dehumanising.”\n\nIn recent months, several waitstaff have resigned from Kaprica citing Barbagallo’s aggressive behaviour, including Petrea James, who said his outbursts were frequent.\n\n“He’s been doing this the whole time, and he’s still being held up on a pedestal,” she said.\n\nLauder decided to tell her story after The Age’s Good Food published a positive review of Kaprica last month .\n\nThis account was corroborated through interviews with three people Lauder told at the time.\n\n“He disappeared then returned shaking his dick in everyone’s face,” Lauder said. “That was the only time he took his clothes off, but he made lewd disgusting sexual gestures towards all of us all the time. It was way before #MeToo. None of us ever thought to push back.”\n\nOne customer was later filming a video message to send to his partner about his “burnt lips”, when Barbagallo confronted the table.\n\nKaprica in Carlton has seen a wave of new bookings after a viral TikTok campaign. Credit: Photograph by Chris Hopkins\n\n“All the pasta was running down the wall,” said one witness.\n\nWhen the waitress returned to the kitchen to deliver the news, Barbagallo became enraged. He accused the customers of having eaten some of the pasta and smashed the ceramic plate against a kitchen wall.\n\nOne of the affected customers said the intensity of the chilli on the pasta made it “inedible” and that the waitress agreed to replace the dish as the complaint was not new – customers had complained about the spice before.\n\nThis masthead interviewed five eyewitnesses to Barbagallo’s plate-smashing incident in April. They said he had appeared under a “cloud” throughout his shift.\n\nShe said his aggression quickly crossed a line, describing regular “outbursts” where he was “shaking, pacing, throwing his arms around” as he allegedly berated staff.\n\nWhile the incident came as a shock to customers, staff were not surprised. James joined Kaprica in mid-2024 and says she was warned Barbagallo had a “temper”. She had worked with unpredictable bosses before in hospitality, and needed the money, so took the job.\n\n“The workers told us it was definitely not the customers’ fault,” one witness told this masthead. “I was like, surely it wasn’t the owner. The place is so well-known. We were like, ‘What the hell?’”\n\nFrom outside the restaurant, two witnesses saw a chair fly out the front door towards the customer. Two waitresses were seen exiting the venue, one in tears.\n\n“It was incredibly awkward,” one witness said. “The music was playing but everyone was shocked and disturbed.”\n\nHis “yelling and screaming” was heard from the street. One witness thought “a homeless person was in there attacking someone”. Inside, the usually bustling restaurant fell silent.\n\n“He would say things like ‘you’re all f---ing idiots and I’m the biggest idiot for hiring you all’. Your blood would run cold,” she said.\n\nAccounts of Barbagallo’s volatile behaviour were supported by almost all staff interviewed by this masthead, who separately claimed he would have “melt-downs”, “screaming matches” and “explosions” of anger.\n\nA dozen women who worked in various roles around Barbagallo backed these claims but declined to be identified for fear of repercussions.\n\nOne woman alleged he threw plates or “pans of hot food” every couple of weeks.\n\nAnother woman said she “literally had a plate thrown at me” by Barbagallo.\n\n“There’s definitely some severe personality issues there,” the woman said. “He’s totally unhinged, totally.”\n\nA third woman described an incident where Barbagallo allegedly held a plate above a customer’s head and screamed: “I’m going to smash your head in if you don’t f---ing leave my restaurant” after the customer complained about slow service. “And then he kind of switched back, was like, ‘Are you OK?’”\n\nAnother employee described feeling “frozen” by his aggression. The staff taught each other to “just nod and look down” until he stopped yelling, in episodes that appeared “manic” and like he was “stuck in a loop”.\n\n“If you apologise or even God forbid try to explain the mistake, he just gets angrier and angrier and angrier and angrier and reiterates the same point over and over and over again.”\n\nJames said the outbursts made her feel anxious, as Barbagallo switched between abusive and friendly. “I got the shakes,” she said. “To be honest, you get goosebumps. It’s hard.”\n\nWhen James quit earlier this year, she sent a text message to Barbagallo, citing his “serious aggression and conflict”.\n\n“I find the way you speak to your staff extremely inappropriate,” she wrote.\n\nBarbagallo responded: “No problem.”\n\nAnother staff member, who did not want to be named, sent a similar resignation text message this year, calling out Barbagallo’s “unacceptable behaviour” and prior “outbursts”.\n\nHe responded: “Sorry you feel that way”.\n\nComplaints about Barbagallo’s aggressive behaviour date back to the early 2000s. Credit: Marina Oliphant\n\nFourteen former staff members alleged varying levels of sexually inappropriate behaviour from Barbagallo, ranging from comments about their appearances and over-sharing about his own sexual experiences.\n\nIn the early 2000s, Lauder alleged Barbagallo “always spoke about sex”, had sexual relationships with his employees, and openly talked about plans to hire attractive young women.\n\nOne former staff member, who quit last month after she was reduced to tears by Barbagallo multiple times, was critical of this language.\n\n“That was kind of sickening to me, even still, just because of how sexualised I know all the service staff are in the way that is almost like an active decision when they’re hired.”\n\nThe employee said Barbagallo would “look you up and down” before hiring staff and often turned away men with experienced resumes.\n\nJames supported this position, saying Barbagallo often hired women in their early 20s who worked part-time while studying nearby at Melbourne University.\n\nShe said Barbagallo routinely commented on the appearance of customers and waitstaff, including herself when she dyed her hair a darker red colour.\n\n“He told me I looked goth, really good. He wouldn’t stop commenting on it. It was just classic creepy boss vibes,” James said.\n\n“Then he would always point out other people who dressed goth to me, and then tell me he wanted to do bad things to them. That he knew he shouldn’t like them but he does and that just makes it all the more enticing.”\n\nAnother former waitress alleged Barbagallo also made sexualised comments to her, including telling her she could work fewer shifts because “essentially men would pay for my company … And I could sell my body”.\n\n“It was surprising at the time but not infrequent,” she said.\n\nThe same woman recalled him saying “she’s so hot I would f--- her” about a customer, and sharing stories about his sexual experiences and drug-taking.\n\n“It became common knowledge to know his ex-lovers’ full names because he would talk about it,” she said.\n\nBarbagallo in 2004 at his first Melbourne restaurant, I Carusi. Credit: John Woudstra\n\nThree employees who worked with Barbagallo at I Carusi in the early 2000s said Barbagallo had sexual relationships with much younger staff.\n\n“I remember at the time being like why the f--- are her parents not stepping in here?” one former employee said, noting the staff, though younger, were still consenting adults.\n\n“He was so inappropriate with all the young staff, myself included. He’d touch your back when you walked past him. He was so creepy. It was such a gnarly vibe.”\n\nBarbagallo came onto Melbourne’s culinary scene in 1998, opening a no-frills pizza restaurant in Brunswick East, I Carusi.\n\nHe expanded over the years to open venues in St Kilda and Melbourne’s CBD, where complaints of aggressive and inappropriate behaviour continued to mount.\n\nBarbagallo was declared bankrupt in 2011, according to corporate documents, and shut his Lonsdale Street restaurant and ended his involvement with all I Carusi restaurants.\n\nPublic bankruptcy documents obtained by this masthead that were signed in June 2011 show Barbagallo had $500 to his name and debts of $1,223,631, including $267,000 to Carusi and $40,000 to Mercedes-Benz Finance.\n\nWhen he opened Kaprica in Carlton soon after, Barbagallo reportedly “slaved away solo in the kitchen” for the first six months “almost like he was doing penance”.\n\nBut staff claim there was a haphazard approach to managing the restaurant’s finances.\n\n“The entire business was in cash,” said one person who worked as Barbagallo’s informal assistant in 2015. “So we were paid in cash, payments from customers were in cash. I would drive my bike to deposit like $15,000 worth of cash and he would pay his rent and children’s lessons out of that money.”\n\nKaprica has long been popular with locals, and moved to a two-storey venue on Grattan Street as demand expanded over the years. However, bookings from new customers have rocketed in the past 18 months after Kaprica engaged marketing firm Einwick and social media producer Hano Lokman to advertise the venue.\n\nLokman’s videos used off-beat scripts and dim lighting to create short fictional narratives to promote the restaurant, clocking up hundreds of thousands of views on TikTok. He did not respond to requests for comment.\n\nMultiple current and former staff said the social media craze strained the business as Barbagallo would over-book, causing long waits for tables or service.\n\n“When it started getting busy, it [aggression] was more frequent because he literally couldn’t manage the restaurant and manage himself,” alleged one former employee.\n\nWhile Kaprica paid an hourly rate higher than average, more than a dozen employees said Barbagallo does not provide payslips and transfers wages directly to bank accounts using calculations from paper time sheets.\n\nTwo employees became worried about Barbagallo’s failure to pay superannuation and tax on their wages last year, and were given access to his books for a day in an attempt to solve their issues.\n\n“It was sheets of random bits of paper strewn around the place, and there were things like where there would be a month missing from this person’s pay.”\n\n“Then it took months for it to go to the accountant and be in the accounts. It was just an incredible level of procrastination.”\n\nScreenshots from a WhatsApp group of Kaprica staff show conversations about payment irregularities were common.\n\n“Sorry to keep asking but does anyone have news on tax?” one employee wrote last September.\n\n“No,” another responded. “Last I heard he messaged his accountant and he never got a response … Not really a good enough reason, it’s his responsibility.”\n\nText messages show another employee was sacked this month after they told Barbagallo they were underpaid for public holiday shifts and pushed for their full entitlements.\n\n“Yep there is a mistake on my behalf which I’ll fix tonight,” Barbagallo responded. “Also you should learn some manners. And finally I think it best you found employment elsewhere.”\n\nThe employee responded: “Manners?? Why am I being fired?”\n\nIt took weeks of messages for Barbagallo to pay the employee, who followed up multiple times.\n\nAnother former employee said she saw text messages on the restaurant phone from a former staff member begging for superannuation payments months after they had left.\n\n“We would get text after text from this employee who was like, ‘Come on Pietro … It’s been six months. How are you still not replying to me? Please.’ He was ignoring her.”\n\nLauder said these were longstanding practices and behaviours that Barbagallo needed to be held accountable for.\n\n“I’ve been in the industry for 31 years. I’ve worked as a chef, front-of-house, late-night cocktail bars.\n\n“I don’t think there is ever any reason for anyone to lose their shit, shout at people, throw things. Nothing is ever that stressful.\n\n“It’s dinner. He’s not saving lives. If you can’t handle it, you’re in the wrong job.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/i-was-winning-races-the-link-between-eating-disorders-and-elite-athletes-20250325-p5lmao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I was winning races’: The link between eating disorders and elite athletes",
        "publish_date": "Fri, 13 Jun 2025 11:55:25 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Loading Associate professor in clinical psychology at The University of Melbourne, Isabel Krug, whose research focuses on eating disorders, says while anyone in any sport can develop an eating disorder, certain “aesthetic-based” sports like figure skating and gymnastics, which privilege thinness, pose a greater risk factor for athletes. “These can reinforce disordered eating behaviours, especially, restricting food and orthorexic tendencies [obsession with healthy food], and body dissatisfaction.” The environment of high-performance sports – in which athletes’ bodies are their tools – can also contribute. “The way we measure athletes’ bodies, the way we talk about their bodies, the language we use, are all really important factors,” she says.\n\n“Sport can add fuel to the fire.” Still, Jeacocke says work is being done to better understand the complex relationship between high-performance sport and eating disorders. In 2020, the AIS and National Eating Disorders Collaboration published a statement on the topic, outlining guidelines for athletes, coaches, support staff, clinicians and sporting organisations. Jeacocke, who co-authored the statement, says preventing and identifying eating disorders in athletes requires a multipronged approach. “It’s taking a really holistic view of athletes, looking at their mental and physical health. So, how do we optimise health and well-being to maximise performance?”\n\n“We want to win gold medals, we want to break world records, yes, but how we do that is super important,” she says. Three athletes – current and former – share their thoughts on why elite sport can be such a breeding ground for disordered eating, and what finally set them on the path to recovery. ‘I just needed someone to sit and listen’ Gorry with daughter Harper. She says pregnancy and motherhood played a role in overcoming her eating disorder. Credit: FIFA via Getty Images While football is not a weight-based sport, Gorry says the culture of regular weigh-ins, body fat checks and density scans contributed to a creeping obsession over food and the way she looked.\n\n“There’s just so much pressure every day to perform, to be a certain body shape and to be at our peak,” she says. Gorry, who became a Butterfly Foundation ambassador in 2024, would like to see less focus on weight and a more nuanced understanding of women’s health. “As footballers, it doesn’t make sense to be weighing in. Everyone’s going to weigh differently, being female athletes, you could put on 3 kilograms while you’ve got your period, and we don’t talk about the reasons why,” she says. “It’s just a number at the end of the day, it should be how you feel in your body and how you’re performing.” So, what was the turning point that set her on the path to recovery?\n\nAlongside clinical treatment and pregnancy, which gave her a newfound appreciation for her body, support from teammates helped. “A big part of it was actually my roommate in the Matildas at the time, Michelle [Heyman]. She noticed and asked, ‘I can see that you’re struggling. Are you okay? I’m here for you’.” “That’s all I needed. I didn’t need someone to try and help me. I just needed someone to sit there and listen and point me in the right direction without pushing me.” Now a mother to Harper and Koby, she says her experience with an eating disorder has shaped how she parents, too. “It’s a conversation Clara [Markstedt, Gorry’s wife] and I both have all the time around food, or even when Harper’s looking at herself in the mirror, just making sure we’re validating her in the right way.”\n\n‘My self-worth was attached to football’ In 2010, Brock McLean, now 39, had just moved from Melbourne Football Club to Carlton. Having recently suffered injuries, he had lost speed on the field. His coaches recommended he lose weight. “Against the advice of nutritionists and doctors, I agreed to do it because I was so desperate to get back to playing footy. My mental health issues at the time was that my self-worth was attached to football,” he says. Former AFL footballer Brock McLean. Credit: Lus Enrique Ascui “I was at the very apex of professional football. You couldn’t go any higher than that. So I developed a really unhealthy way of viewing myself.”\n\nMcLean embarked on a restrictive meal plan. He would suppress cravings for certain foods for weeks on end before giving in and bingeing, then overtraining and eventually using laxatives. Loading These behaviours dovetailed with anxiety, depression and addiction, and he developed bulimia nervosa. Young men and boys are often underrepresented in conversations about body image and eating disorders, despite the fact around one-third of those who suffer from an eating disorder are male. McLean says the stigma around eating disorders and mental illness in men’s sport meant he was afraid to seek help.\n\n“I was really uncomfortable opening up to people. I just couldn’t do it because I felt like it was emasculating, particularly for an eating disorder.” After retiring in 2014 and moving into the corporate world, the self-worth he had derived from football transferred to climbing the corporate ladder. But through seeing a psychologist, the tide has slowly started to turn. “It doesn’t matter what you look like, what your job title is, how much money you make. You’re a good person, you treat people well, you’re a great dad and husband,” he says. ‘I only can imagine what I could have achieved’\n\nDr Jennifer Hamer was diagnosed with anorexia at age 12. A promising endurance runner in her home country of England who represented Great Britain at the European Championships, her eating disordered progressed with her sporting career. “I was always carrying my eating disorder with me, which I believe held me back a lot,” she says, explaining she was frequently getting injured and spending time at the physio in rehab. Dr Jennifer Hamer, a former endurance runner, now works with athletes to prevent eating disorders. Credit: Steven Siewert “My pure love for the sport became really, really scarred by the fact that it was now being controlled by an eating disorder.” While Hamer says it’s difficult to say whether she would have developed an eating disorder had she not been involved in sports, she feels her coaches were ill-equipped to support her and her family.\n\nLoading “There’s a point in your eating disorder in the early stages where it doesn’t affect you negatively … I was winning races, so they were like, ‘Oh, she’s winning. But let’s keep pushing her harder.’” “And I wasn’t going to say anything because I was loving it because I was abiding by the eating disorder rules, and I was getting away with all the things that I wanted to do.” At 22, Hamer’s eating disorder meant she was so weak she could no longer run, and she was admitted to an inpatient clinic. There, she was given a career-ending diagnosis: she had osteoporosis from years of disordered eating. But for Hamer, now 33, it’s only in the past four to five years she’s really entered a space of recovery. She’s also discovered a love for ocean swimming which allows her to indulge her love for endurance sports.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/wtc-waste-of-time-championship-20250612-p5m725.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WTC? Waste of Time Championship",
        "publish_date": "Fri, 13 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "Those who have blamed the Lord’s pitch for the helter-skelter World Test Championship final might have picked the wrong target. The Australia-South Africa Test match has been played by 22 cricketers re-acquainting themselves with red balls and the concept of a game going for five days.\n\nIt’s not their fault that they’re not ready: a lack of readiness has been built into its design, as if the powers of international cricket want to look like they’re saving the Test format while doing everything they can to undermine it. Imagine if a football World Cup final were played as a one-off, out-of-season friendly for the benefit of Jeff Bezos. Not even FIFA could screw up that badly.\n\nNone of South Africa’s players had taken part in a first-class game of cricket in the past five months. One, Lungi Ngidi, last bowled a red ball in a match in August 2024. (He looked a tad rusty.) Three of the Australians had played some county cricket in England last month, but for the rest, their last first-class cricket was three to six months ago.\n\nRusty? Just a bit. Australian viewers might be a bit rusty too. Those who wanted to watch the game had to pinch their noses, hold their breath and submerge themselves in the swamp that is Amazon. For the Test match not to be protected by anti-siphoning laws gives a pretty good idea of how Australian regulatory and broadcasting interests rate it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/hollywood-studios-sue-ai-company-over-unauthorised-darth-vader-and-minions-copies-20250613-p5m766.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hollywood studios sue AI company over ‘unauthorised’ Darth Vader and Minions copies",
        "publish_date": "Fri, 13 Jun 2025 11:34:58 +1000",
        "category": "finance",
        "authors": [
            "Shawn Chen",
            "Matt O'Brien"
        ],
        "text": "New York: Disney and Universal are suing popular artificial intelligence image-generator Midjourney, marking the first time major Hollywood companies have taken legal action against a maker of generative AI technology that could upend the entertainment industry.\n\nThe copyright lawsuit in a Los Angeles federal court claims Midjourney pirated the libraries of the two Hollywood studios to generate and distribute “endless unauthorised copies” of their famed characters, such as Darth Vader from the Star Wars franchise and the Minions from Despicable Me.\n\nThe lawsuit claims “endless unauthorised copies” of famed characters like the Minions have been distributed. Credit: AP\n\n“Midjourney is the quintessential copyright free-rider and a bottomless pit of plagiarism. Piracy is piracy, and whether an infringing image or video is made with AI or another technology does not make it any less infringing,” the companies state in the complaint.\n\nThe studios also say the San Francisco-based AI company ignored their requests to stop infringing on their copyrighted works and to take technological measures to halt such image generation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/netanyahu-says-israel-is-targeting-nuclear-scientists-working-on-the-iranian-bomb-20250613-p5m77h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Netanyahu says Israel is targeting ‘nuclear scientists working on the Iranian bomb’",
        "publish_date": "Fri, 13 Jun 2025 11:32:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Netanyahu says Israel is targeting ‘nuclear scientists working on the Iranian bomb’\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/this-suburban-club-has-produced-seven-afl-players-in-18-months-but-that-s-not-what-it-s-most-proud-of-20250611-p5m6mw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This suburban club has produced seven AFL players in 18 months, but that’s not what it’s most proud of",
        "publish_date": "Fri, 13 Jun 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Hanlon"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In its past 31 games since the 2023 VFL grand final, Werribee have had seven players drafted to the AFL. It’s a staggering strike rate, born of the most basic principles. “This is like a country local footy club that plays at a higher level,” says coach Jimmy Allan, who hails from down the road at Lara and played for Werribee in the early 2000s before a storied SANFL career. His assistant Kyle Hartigan hits another note. “We’re a community club – we wouldn’t have this without them,” he says, crediting not just the people of Werribee but sprawling Wyndham City, the fastest-growing municipality in Australia. Werribee CEO Mark Penaluna with senior players (L-R) Jesse Clark, Renee Tierney, Maddie Di Cosmo and Dom Brew. Credit: Paul Jeffers Michael Barlow, poster boy for late-bloomers who was drafted to Fremantle from Werribee in 2010, needs no prompting to join the chorus. “The Werribee Football Club has been the most important organisation in my life.” If community, connection and care underpin Werribee, the product of the 1965 amalgamation of four local clubs also boasts an asset almost as constant as the ancient river red gums that flank its Chirnside Park home. Mark Penaluna, in his 22nd year as CEO, is the heartbeat of the club. “Anyone who has been associated with local footy, we’re just an extension of that, we’re just talking bigger numbers,” Penaluna says. To be a community club, he reckons, means leaving your ego at the door. “We understand we’re not just here to win a game of footy, this is something people look forward to each week – training, games, sharing the wins and losses.”\n\nAdvertisement\n\nEvery footballer starts at a local club, where much is done by few. When they arrive at Werribee, it’s made clear that everyone – from the office to maintenance to the property steward – makes up the club. “If you see a broom and the floor’s dirty, the expectation is you pick the broom up, give it a sweep, and make it clean for the next person.” Many people whose lives are enriched here never lace a football boot. Wyndham Community Education runs eight English classes each week, making the club an early connection point for new arrivals to the area. On Sundays, Anglican followers of Sojourners Church gather for services held by pastor Andrew Seedhom, who is also club chaplain. Loading On game days, Penaluna spends half an hour on the gate before Seedhom relieves him, greeting players’ families and Werribee’s fans. Everyone is included in successes little and large, from office staff to sponsors to the volunteers who keep the wheels of community clubs turning. For Penaluna, football and its importance to community are ingrained. His father captain-coached Port Melbourne Colts. As a five-year-old, he had two game-day jobs: listen to the opposition coach’s address and report back; and in quarters played with no added time, stand behind the goals and get the ball back to the umpires ASAP if the Colts were trailing. “And if we were in front, kick the hell out of it the other way.”\n\nAdvertisement\n\nHe ran the Western Region league for five years before arriving at Werribee in 2003. His first game-day task was helping volunteers George and Jimmy drag the barbecue out of the showers under the old grandstand, so the umpires could get changed. There was no canteen; the barbie was a major source of income. “We had one desktop computer, and if it rained we had to put bubble wrap over it because there was a hole in the roof and possums living up there.” CEO Mark Penaluna and community development manager Majok Ngong at Chirnside Park. Credit: Luis Enrique Ascui His staff consisted of one part-time venue manager. The club’s 2025 season guide lists Penaluna as one of 28 employees. More people work in community roles than once worked for the entire club. Welfare manager Damien Frankling has been around since 2008, chaplain Seedhom for the past four years. “Having those constants helps enormously, honest conversations and all that stuff,” Penaluna says. Facilities help. In 2008, the club went to council with a proposed upgrade that had cost close to $12 million upon completion a decade later. Income is drawn from Wyndham entertainment venues, with $300,000 put back into the community annually, including sponsoring every football club in the municipality. “We agreed with council that we’ll continue to provide these programs and extend them, and make sure we only charge community organisation rates not commercial,” Penaluna says.\n\nAdvertisement\n\nWerribee has been a “standalone” VFL club since 2018, after affiliations with Western Bulldogs and North Melbourne. The latter endures through the North Melbourne Werribee Kangaroos in the VFLW and “The Huddle”, which has delivered programs to more than 50,000 young people since 2016 to strengthen education and employment outcomes. The club hosts English language classes for new migrants. Credit: Luis Enrique Ascui For Barlow, who coached the Bees to runners-up in 2023 before Allan brought home the club’s second premiership last year, being standalone is crucial to success. In training together throughout summer, bonds and trust are built and players improve by challenging each other. Playing every home game at a different venue – from Wangaratta to Torquay – during the 2017 renovations fostered an “anyone, anywhere, anytime” zeal. “If they weren’t standalone, some of the guys I played with just wouldn’t play,” Barlow says. “They’d go and try and find connection and community and togetherness at a local club.” He regards Shaun Mannagh, drafted by Geelong in 2023 aged 25, as “the most club-oriented person I’ve met in football”. Loading With VFL rivals Williamstown and Port Melbourne to the east and Geelong to the west, Werribee must be creative in their recruiting. There are enough Geelong-based players to warrant a van (they spin a key to see who drives), while leagues to the north like Ballarat, Ovens and Murray and Goulburn Valley produce players who fuel the country vibe. Allan chuckles at the notion that developing footballers so well surely equates to a queue of Werribee wannabes stretching along Watton St. Even in a competitive market, he doesn’t use recent draft success as a carrot.\n\nAdvertisement\n\n“I would never say, ‘Come here and we’ll get you drafted.’ If a club thinks they need them on their list they’ll find a way. Our job is to help them be the best player and best person they can be. I know it’s a cliche, but we’re genuinely invested in doing that. “With the five who’ve gone [to AFL clubs] in my time here, not once did they ask, ‘What do I need to do to get drafted?’ Their questions were around, ‘What can I do to help our team be the best we can be?’ It’s about playing your role and doing it better than anybody else. That’s why these guys are getting a chance.” Zac Banch, picked up by North in the mid-season draft. Credit: AFL Photos via Getty Images Smiling again, Allan adds, “We’re big on cliches.” Hartigan’s story offers a compelling blueprint. Overlooked as an 18-year-old after trying to be something he wasn’t, he spent three years at Werribee “and just went back to what I was good at, which was nullifying opponents”. Eventually, Adelaide identified a need in defence, “and I was in the right place, right time, playing my role”. He played 135 games for the Crows and Hawthorn. The cliche won out. Fans at a Werribee VFL match. Credit: via Getty Images\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/eating-out/this-regional-post-office-may-be-home-to-the-best-burger-in-australia-20250612-p5m710.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This regional post office may be home to the best burger in Australia",
        "publish_date": "Fri, 13 Jun 2025 11:25:15 +1000",
        "category": "finance",
        "authors": [
            "Callan Boys"
        ],
        "text": "Advertisement\n\nEating outBurgers This regional post office may be home to the best burger in Australia It’s a very bold claim, but this country-comfort burger is a tower of fresh taste where each bite is underlined by a different ingredient. Callan Boys June 13, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 6 Wingello Village Store in the Southern Highlands. Jennifer Soo 2 / 6 Wingello’s $18 burger with the lot. Jennifer Soo 3 / 6 Wingello Village Store and Post Office owner David Bruggeman. Jennifer Soo 4 / 6 Wingello Village Store and Post Office. Jennifer Soo 5 / 6 James Bruggeman on barista duties. Jennifer Soo 6 / 6 (From left) Martin, Zach, James, David and Peter Bruggeman. Jennifer Soo Previous Slide Next Slide We don’t celebrate the works burger enough. Beetroot-stained roll. Pre-sliced “tasty” cheese. Shredded iceberg. Pineapple. Egg. Your choice of sauce. Although there’s no clear consensus as to how or why the burger came about (although a surplus of tinned goods created by the opening of Edgell and Golden Circle canneries in the 1940s might have had something to do with it), its unknown creator is up there with Peter Russell-Clarke and Grandma Poss in terms of their influence on everyday Australian food. I’m quite serious about this – the “Aussie” burger is one of the few culinary creations we can claim as legitimately unique. Try finding beetroot, pineapple and barbecue sauce between bread on any other continent. I bring all this up because I may have found the best works burger in Australia. Wingello’s $18 burger with the lot. Jennifer Soo I say “may” because it’s an impossible claim to confirm without visiting every fish and chip shop. Who knows what takeaway lurks near Beechworth or Kalgoorlie or the industrial sheds of Croydon Park? (I’m also conscious of Paul’s Famous Hamburgers and its faithful in Sylvania.) But gee, Wingello Village Store and Post Office knows its way around a spatula.\n\nAdvertisement\n\nAccording to David Bruggeman, who runs the one-stop Southern Highlands shop with his family, the general store’s dates back to 1865. Wingello is home to about 600 people, and Bruggeman and his wife Lana took over its only shop 16 years ago, extending the mail, newspaper and basic grocery services to include a cafe with “simply good food”. “You won’t find avocado or Turkish bread or any of that stuff here,” he tells me. Wingello Village Store and Post Office owner David Bruggeman. Jennifer Soo You will, however, find a formidable selection of milk bottles, caramel buds and chocolate freckles along the counter, and a menu heavy with truck-stop classics plus a whipped cream-topped sundae. If the indoor fire is going, marshmallow roasting is encouraged. I suspect the BLT is a paragon of the form, and the cinnamon toast is a super-duper breakfast, but the $18 works burger is the headline act. The soft, flat bun comes from Bryant’s Bakery in Goulburn. Local butchers supply the beef and house-cured bacon. Lettuce, tomato and free-range eggs come from nearby farmers; the pineapple and beetroot comes from a can. Sauce is from a bottle, unless you ask for the house-made mayonnaise, but that’s better saved for chips. Tomato sauce on an Aussie burger, forever and ever, amen. (The only good thing about ETA Original Barbecue is the bottle design. Yes, yes, I’ll begin the process of revoking my citizenship now.) (From left) Martin, Zach, James, David and Peter Bruggeman. Jennifer Soo\n\nAdvertisement\n\nAnyway, all this adds up to a tower of fresh flavour where each bite is underlined by a different ingredient. The bacon is generous. The onions, translucent but not browned. It may take a few bites until you hit pineapple. The 130-gram patty is lean on fat, which some burger purists will hate, but I don’t mind finishing the thing and still feeling human. The perfect trinity of salty, sweet and lightly pickled. I brought a second burger back to Moss Vale for my partner, who was less keen to leave the throw-rug of our Airbnb for the half-hour trip to Wingello. By this time, all the components have had more time to mingle and develop in their white paper bag. Brilliant with half a glass of last night’s gamay at 11:30am. A one-stop Southern Highlands shop. Jennifer Soo Thanks go to two-time Golden Spurtle World Porridge Making Championship finalist, and taco chef, Toby Wilson for alerting me to the burger three weeks ago. Wilson only discovered it after seeing an ad for the cafe before The Penguin Lessons at Bowral’s Empire Cinema. (NB: The Bruggeman family has a YouTube channel where you can watch all their house-made cinema ads, dating back to 2020. It is absolutely worth your time.) Related Article An ode to the Aussie burger with the lot\n\nAdvertisement\n\nLike our regional Chinese restaurants, agricultural shows and vanilla slice-famous bakeries, Wingello Village Store is one of those great “only in Australia” spots that tourism boards could spend more time promoting – especially to city-dwellers who would increasingly rather jump on a Disney Wonder cruise than explore their own backyard. The burger doesn’t taste like cheap thrills and corporate grease. It tastes like Paul Kelly singalongs and sunsets and Sunday drives. It tastes like a kitchen that gives a damn. Related Article RecipeTin Eats on how to make a classic Aussie burger with the lot\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/like-being-in-bed-with-richard-burton-how-alcohol-became-the-third-wheel-in-our-marriage-20250612-p5m70z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Like being in bed with Richard Burton’: how alcohol became the third wheel in our marriage",
        "publish_date": "Fri, 13 Jun 2025 11:22:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "When we discovered a shared love for Barry Manilow and vodka on our first date, I knew Chris was the one. Our courtship was fuelled by post-work rieslings, boozy beach getaways, splashing each other a glass while making dinner.\n\nWe were endlessly drunk on each other and endlessly actually drunk. Friday nights meant pinball and bourbon, Saturday was about cocktails. Sunday, we’d get on the sauce after lunch. Holidays? Find us a tropical swim-up bar and a happy hour and extra points for a souvenir swizzle stick.\n\nAlcohol went from something that brought us together to something that was dividing us. Credit: Getty\n\nAlcohol was the fabulous third wheel in our marriage. Then Chris stopped drinking.\n\nLong story short, but a year or two back he realised booze was creating not just hangovers but fights over stupid things, feelings of isolation, slow treacly chaos. And he thought he might die.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/onefour-s-message-to-the-police-we-re-different-now-we-re-good-people-20250609-p5m5z7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "OneFour’s message to the police: ‘We’re different now. We’re good people’",
        "publish_date": "Fri, 13 Jun 2025 11:14:54 +1000",
        "category": "entertainment",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size It seems fitting that the opening number on OneFour’s debut album, Look At Me Now, is titled Change. A pulsing track that sees the group reckoning with the past and thinking about the future: “And now the question is: will you remain the same?” raps Jerome ‘J Emz’ Misa over a heavy beat. “Or are you willing to do whatever it takes to change?” Change has been the one constant in OneFour’s turbulent 10-year history as Australia’s most prominent hip-hop outfit, a period defined by upheaval, controversy, prison time and hype – anything but stability. Since forming in 2014, the all-Pasifika rap crew from Mount Druitt in Western Sydney have experienced a decade of turbulence. Credit: Mridula Amin Formed in 2014, the all-Pasifika rap crew from Mount Druitt in Western Sydney was initially composed of five members – brothers Jerome and Pio ‘YP’ Misa, Salec ‘Lekks’ Su’a, Dahcell ‘Celly’ Ramos, and Spencer ‘Spenny’ Magalogo. They quickly became the face of Australia’s drill movement, a sub-genre of hip-hop that emerged from Chicago a decade ago. It is known for its faster, heavier sound and raw lyrics, often depicting gang culture. Adopting this style, OneFour infused it with a uniquely Western Sydney flavour, references to ‘eshays’ and ‘lads’ speaking to a subculture born from the very same streets they grew up in. It didn’t take long for the group to tap into viral success, with songs like 2018’s What You Know and 2019’s Spot The Difference going platinum on the ARIA charts and racking up hundreds of millions of streams.\n\nAdvertisement\n\nAs the buzz grew, so too did the accolades. ARIA nominations followed, while hip-hop superstars, including Skepta, Dave, A$AP Ferg, and the Kid Laroi, voiced their support for OneFour’s warts-and-all portrait of street life in Mount Druitt. “My district has too much drillers, like who wants it? Like who wants war with Sydney’s realest?” Spot The Difference, OneFour But their meteoric rise was halted in 2019 when Lekks, Celly and YP were jailed for a pub brawl. That same year, a national tour was cancelled after venues began pulling out, something OneFour attributed to pressure from the police and confirmation that the group was being monitored by two elite police units – Strike Force Raptor, created to hunt underground criminal networks, and Strike Force Imbara, which investigates gang feuds. In a widely circulated voice memo supplied to the ABC, Sergeant Nathan Trueman from the Raptor squad promised, “I’m going to use everything in my power to make your life miserable until you stop doing what you’re doing.” The constant noise around OneFour only seemed to boost their infamy. Their shows continued to be cancelled while their streaming numbers skyrocketed (they have an impressive 2.4 million monthly listeners on Spotify). OneFour have regularly been targeted by police and prevented from performing. Credit: YouTube The release of a 2024 Netflix documentary, Against All Odds, broadened their reach yet reinforced the idea that the story of OneFour had become more important than the music they produced. “Exactly right,” says J Emz. “And that’s why we needed a change. We’re about the music, and we want people to know that.”\n\nAdvertisement\n\nI’m sitting with J Emz, Celly and Spenny in a back room of Sony Music’s headquarters in Sydney’s CBD. There are bowls of lollies on the table and slabs of soft drinks, but no one eats or drinks anything. This is the new look OneFour after a lineup change. YP left the group last year after becoming ordained as a Christian priest, while Lekks remains part of OneFour but was deported to New Zealand following his four-year prison sentence. ONEFOUR performing at the band’s album launch event on Thursday night. Credit: Mridula Amin J Emz sits opposite me, the group’s elder statesman who does most of the talking. Alongside him is Celly, who was recently released after serving five years of his 10-year sentence for the brawl. Next to me is Spenny, who is softly spoken and polite but visibly uncomfortable with being interviewed. I ask them about that first track, Change, and whether the lyrics were born out of a challenge they set themselves. “For sure, I don’t think any of us can pretend we haven’t made mistakes,” says J Emz. “But we’ve grown up a lot. So much has happened in our career to knock us off track – some of that is our fault, some of it isn’t, but we’ve gotten much better at holding each other accountable.” What does that look like? “There have been some heated chats for sure,” admits J Emz, while Celly and Spenny nod in agreement. “Sometimes I got to remind the boys what they’re going back to if this doesn’t work out.”\n\nAdvertisement\n\nRapping about Sydney gang subcultures, OneFour’s focus on the grittiness of the streets – violence, drug-dealing and run-ins with the police – blurred the lines between their art and life. Credit: Michael Candrick No one knows that better than Celly, whose incarceration meant he missed much of the album’s development. Instead, he worked on his lyrics in prison and recorded once he got out. “The journey for me was different [with this album] being in jail; you can either sit there and waste your days or try to use the time wisely, so I started writing a lot,” he says. “All you have is time to think about what you’ve done to end up there and what you’ll do not to go back, so the minute I got out, I was straight into it.” “I dropped that ball, time out, they threw me inside, I’m back on the bench.” Celly on Look At Me Now’s Family The result is Look At Me Now, a sprawling 15-track album on which the group collaborates with several high-profile UK drill rappers, including Nemzzz, Headie One, and Abra Cadabra. The record also sees OneFour collaborate for the second time with the Kid Laroi on Distant Strangers. Laroi and OneFour first crossed paths when they were both coming up and have remained close throughout Laroi’s success, with OneFour the opening act on his most recent tour of Australia. “I get inspired by Laroi every time, any opportunity we get to be around him is a learning for us,” says Spenny. “This is a guy on top, and he’s still the same kid we knew from back in the day.” OneFour with a young The Kid Laroi (third from the right) in Redfern. Credit: Screengrab\n\nAdvertisement\n\nThe release of Look At Me Now comes ahead of a nationwide tour in July and August that presents a familiar problem: they will play in every major city except Sydney. According to the group, NSW police continue to pressure venues by demanding extra user-pays-police (where officers are hired to police a private event paid for by the venue), leaving venues unwilling to host the band in their hometown. Police walk past a mock Mt Druitt sign At ONEFOUR’s album launch event at Sydney Dragway in Eastern Creek, in Sydney’s west. Credit: Mridula Amin “We don’t blame the venues when they have to take a dive, but it’s frustrating; our management has tried everything,” says J Emz. “The police make it difficult for the shows to go ahead, so the venues have no option but to pull out.” In a statement , NSW Police said: “We provide safety and security advice to venues, promoters, and other stakeholders ahead of major events. However, the decision as to whether an event will proceed lies with the relevant venue.” Loading J Emz admits that, for the first time, he’d encourage NSW Police to listen to their music. “The message is: we’re different now, we’re good people,” he says. “I don’t want to be defined by what I did,” adds Celly. “I served my time, suffered the consequences, and this is the next chapter.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/aviation-expert-gives-potential-reason-air-india-flight-crash-20250613-p5m775.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Aviation expert gives potential reason Air India flight crash",
        "publish_date": "Fri, 13 Jun 2025 11:09:51 +1000",
        "category": "finance",
        "authors": [],
        "text": "Aviation expert gives potential reason Air India flight crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/powerball-draw-1517-lucky-aussie-wins-entire-100-million-jackpot-102402719.html",
        "title": "Powerball draw 1517: Lucky Aussie wins ENTIRE $100 million jackpot",
        "publish_date": "2025-06-12T10:24:02Z",
        "category": "finance",
        "authors": [],
        "text": "The winner has automatically earned the shared title of Australia's third-highest lotto winner ever.\n\nThe winner of tonight's jackpot could see themselves become a member of a very exclusive club – only six other Aussies have ever won a $100m jackpot. Source: The Lott/Supplied\n\nOne lucky Aussie’s life has just changed forever after taking out Powerball’s incredible $100 million jackpot. Australia’s newest multi-millionaire was the only winner in tonight’s draw, which was Powerball’s biggest jackpot of the year.\n\nThe jackpot doubled after last week's $50m draw failed to be won. While not many details are known about the winner yet, they now officially share the title of Australia’s third-highest lottery winner.\n\nWhat is known is that the ticket was purchased in either NSW or the ACT.\n\nWith this week's massive offering, officials from The Lott anticipated up to half of all adults in the country would be purchasing a ticket.\n\nADVERTISEMENT\n\nTonight's winning numbers are: 28, 10, 3, 16, 31, 14 and 21, with the all-important Powerball number 6.\n\nPowerball’s last big winner took home $30 million\n\nThe last big win was back in early May, when a man from Cessnock in NSW became an instant multi-millionaire with an incredible $30m win.\n\nHe burst into uncontrollable laughter when he heard the good news, and said he saw the win as a sign of good things to come after having a \"rough trot\" lately.\n\n“I just had this ticket on the fridge. I was looking at it this afternoon and thought, ‘wouldn’t it be lovely to win’,\" he told The Lott.\n\n“The ticket was there with all the bills. There will be no more worrying about bills now. I don’t care if I get a bill now!\"\n\nLast $100m winner shares how life has changed\n\nOnly six Aussies know what it's like to win $100m. One of those lucky winners was a Queensland woman who took home half of the record-breaking $200m Powerball jackpot last February.\n\nADVERTISEMENT\n\nReflecting on her win more than a year on, the new millionaire revealed she's since embraced a sea change, relocating from the suburb of Hawthorne in Brisbane to a serene coastal home.\n\n\"I often speak with my partner about the version of us from last year to now, and if only we knew what was to come,\" she said.\n\n\"On a day-to-day basis, not a huge amount has changed. I still get up for the 6am gym session, and the dog still needs to be walked and fed. The longer-term vision we have for our life is slowly coming together.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]