[
  {
    "url": "https://www.9news.com.au/national/product-recall-alert-tasti-smooshed-flavours-taken-off-australian-shelves/d3caa1da-fde4-4466-a56e-e4c90f266112",
    "title": "Popular health food taken off shelves over 'very fine metal wire'",
    "publish_date": "Sat, 20 Sep 2025 22:52:33 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "T﻿he potential presence of \"very fine metal wire\" has forced a popular health food company to recall batches of its products.\n\nTubs of Tasti Smooshed﻿ wholefood balls in several flavours are affected in the recall.\n\nThe flavours are peanut butter and caramel (69g), peanut caramel (207g), berry cashew and cacao (69g), cacao brownie (69g), cacao brownie tub (207g), protein dark cacao brownie tub (174g) and protein raspberry brownie tub (174g).\n\nTasti Smooshed products have been recalled in Australia on September 21, 2025, over concerns of metal in the product. (Supplied)\n\nThe products have been sold in Woolworths and Coles in-store and online.\n\nThe best-before dates of the affected products are:\n\n﻿peanut butter and caramel (69g) - 21/05/2026, 26/05/2026, 26/06/2026, 1/07/2026;\n\nPeanut caramel (207g) - 4/08/2026;\n\nBerry cashew and cacao (69g) - 7/07/2026;\n\ncacao brownie (69g) - 17/07/2026;\n\ncacao brownie tub (207g) - 11/08/2026;\n\nprotein dark cacao brownie tub (174g) - 14/05/2026;\n\nprotein raspberry brownie tub (174g) - 22/05/2026\n\nIn a statement, Tasti said it discovered the potential presence of the \"exceptionally thin metal wire originating from imported raw materials\".\n\n\"Tasti products undergo metal detection checks before being released to market in this particular case the metal wire detected is extremely fine, and therefore not always detectable,\" the statement said.\n\n\"If you have consumed the product and are concerned for your health, please call your nearest medical centre.﻿\"\n\nCustomers who bought the affected product have been told to dispose it if it falls in the best before date range.\n\nThose customers have been told to take a photo of the product showing the b﻿est before date and send it to tasti@tasti.co.nz to receive a replacement voucher.\n\nTasti said the rest of its product range was safe.﻿\n\n\"We apologise for the inconvenience this may cause and thank our customers for their understanding as we act with caution and transparency.﻿\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/airport-cyberattack-disrupts-check-in-systems-at-major-european-airports/9d6f498d-7f8d-4888-9716-85af0de5f9bf",
    "title": "Cyberattack disrupts check-in systems at major European airports",
    "publish_date": "Sat, 20 Sep 2025 09:33:24 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A cyberattack targeting check-in and boarding systems has snarled air traffic and caused delays at some of Europe's top airports, officials said on Saturday.\n\nThe Brussels airport says the attack means that only manual check-in and boarding was possible there, and the incident was having a \"large impact\" on flight schedules.\n\n\"There was a cyberattack on Friday night 19 September against the service provider for the check-in and boarding systems affecting several European airports including Brussels Airport,\" it said in a statement.\n\nPeople at BER airport as a cyber attack has caused delays, in Berlin, Germany, Saturday, Sept. 20, 2025. (Carsten Koall/dpa via AP)\n\nAuthorities at Berlin's Brandenburg Airport said a service provider for passenger handling systems was attacked on Friday evening, prompting airport operators to cut off connections to the systems.\n\nLondon Heathrow Airport, Europe's busiest, said \"a technical issue\" affected a service provider for check-in and boarding systems.\n\n\"Collins Aerospace, which provides check-in and boarding systems for several airlines across multiple airports globally, is experiencing a technical issue that may cause delays for departing passengers,\" Heathrow said in a statement.\n\nQantas ﻿check in terminals at Heathrow Airport are impacted by the outage but the airline tells 9News they anticipate the issue will be resolved ahead of their next departure, so don't believe there'll be any impact to customers.\n\nPeople at BER airport as a cyber attack has caused delays, in Berlin, Germany, Saturday, Sept. 20, 2025. (Carsten Koall/dpa via AP)\n\nHowever, they've deployed backup iPads to counters just in case and are advising customers to check in online beforehand.\n\nQantas say there's no impact in Australia.\n\nVirgin Australia has also told 9News its not currently affected by the Collins Aerospace outage.\n\nAll affected airports have advised travellers to check their flight status and apologised for any inconvenience.\n\nFormed in 2018, Collins is a US aviation and defense technology company and a subsidiary of RTX Corp., which was formerly Raytheon Technologies.\n\nCollins provides the technology that allows passengers to check themselves in, print boarding passes and bag tags, and dispatch their own luggage, all from a kiosk.\n\nCollins said it was \"aware of a cyber-related disruption\" to its MUSE (Multi-User System Environment) software at \"select airports\" but that manual check-in operations could still be used.\n\n\"We are actively working to resolve the issue and restore full functionality to our customers as quickly as possible,\" it said in a statement.\n\n\"The impact is limited to electronic customer check-in and baggage drop and can be mitigated with manual check-in operations.\"\n\nThe impact was felt only at some airports: the Roissy, Orly and Le Bourget airports in the Paris area reported no disruptions.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/centrelink-payments-changes-2025-new-rates-september-20-everything-to-know-explained/7ad1411a-7f1e-4e0d-b1dd-c1dd45803dd6",
    "title": "Millions of Aussies to get a cash boost today as Centrelink payments jump",
    "publish_date": "Fri, 19 Sep 2025 21:10:31 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Millions of Australians will get a cash boost today as Centrelink payments increase under indexation changes, offering relief in the cost-of-living crisis.﻿\n\nThese changes are made every year in March and September and are designed to ensure that payments keep up with inflation.﻿\n\nHere's everything you need to know about the Centrelink payment changes.﻿\n\nREAD MORE: Aussie staples under threat of being wiped out in just decades\n\nA number of Centrelink payments will increase this week, offering relief to many struggling in the cost of living crisis.﻿ (Dylan Coker / The Sydney Morning Herald)\n\nWhich Centrelink payments are getting the increase?\n\nA number of payments will increase today, including the age pension, carer payment, and disability support pension.\n\nFederal rent assistance, youth allowance and JobSeeker payments will also jump to keep up with inflation.\n\nThe income limits for some payments will also increase, ﻿meaning more Aussies may be eligible to receive them.\n\nWhen do the new Centrelink payment rates start?\n\nThe changes will come into effect today, Saturday, September 20.﻿\n\nRecipients will ﻿see the first increased payment in their bank account from that date onwards.\n\nREAD MORE: Father and son face fate over car chase murder\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nHow much are payments increasing in September 2025?\n\nThe dollar amount each payment will increase by varies.\n\nThe age pension will jump by $29.70 for singles, increasing the total fortnightly payment from $1149.00 to $1178.70 $29.70.\n\nFor couples it will increase by $22.40﻿ each, resulting in a total fornightly payment of $888.50 per person.\n\nSingle parents will receive a $16.20 boost and partnered parents will get an extra $11.40.\n\nThat will bring total fortnightly payments to ﻿$1039.70 and $734.40 respectively.\n\nRental assistance will go up by just $3.40 for singles and $3.20 for couples, with fortnightly payments to sit at $215.40 and $203.﻿\n\nRental assistance for families will increase by up to $4.48.\n\n﻿JobSeeker payments will jump by $12.50 for singles over 22 with no children, bringing the fortnightly total up from $781.10 to $793.60.\n\nCouples will receive an extra ﻿$11.40 each.\n\nYouth allowance will increase by $16.20, jumping from $1011.50 per fortnight to $1027.70.﻿\n\nSome payments will increase by just a few dollars per fortnight. (Getty Images/iStockphoto)\n\nDo you need to do anything to get the new rate?\n\nNo. These rate changes will automatically be applied to any payments made after today.﻿\n\nWhy are Centrelink payments indexed twice a year?\n\nCentrelink payments are indexed twice a year to ensure payments keep up with inflation and the rising cost of living.\n\nThese changes are based on a number of factors, including the consumer price index, weekly wage changes, and the pensioner and beneficiary living cost index.﻿\n\nThe next change will be in March 2026.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/aussies-have-fewer-friends-and-higher-tax-bills-major-survey-reveals/9da041ee-614f-4610-b239-d10673fec89a",
    "title": "Aussies have fewer friends and higher tax bills, major survey reveals",
    "publish_date": "Fri, 19 Sep 2025 21:12:47 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A new report has painted a grim picture of life in Australia, revealing a nation where people are feeling lonelier than ever, pay more tax and are delaying their dreams.\n\nThe Melbourne Institute's annual Household, Income and Labour Dynamics in Australia (HILDA) Survey, which has tracked the lives of thousands of Australians since 2001, released its 2025 report today.\n\nIt highlights how everything from rising living costs to the erosion of social networks is taking a toll on the nation's well-being.\n\nAustralians are lonelier than ever, paying more tax and wanting fewer children, a new survey has found. (iStock)\n\nWe have fewer friends\n\nThe survey found that our social connections are weakening, a trend exacerbated by the COVID-19 pandemic.\n\nAustralians are reporting fewer friends and less frequent socialising than at the turn of the century.\n\n\"Not only do we feel like we have fewer friends, but we're also socialising less frequently than in 2001,\" senior research fellow and report co-author Dr Inga Lass said.\n\nThe proportion of people meeting friends or relatives several times a week or more has dropped by over 12 percentage points, from about 32 per cent to just 20 per cent.\n\nThis decline in social connection has potential implications for our overall well-being.\n\nThe survey also found that a majority of Australians now report experiencing bodily pain, a trend that has worsened since 2001, even when accounting for the nation's ageing population.\n\nPeople in lower-income households were also more likely to report experiencing pain, co-author Dr Ferdi Botha said.\n\n\"The less money you make, the more pain you're likely putting up with,\" Botha said.\n\nThe hidden tax of inflation\n\nThe survey revealed that Australians are paying the highest average income tax rate since the study began in 2001.\n\nThis is not due to a change in policy but rather to \"bracket creep\".\n\nAs wages have risen to keep pace with inflation, many workers have been pushed into higher tax brackets, effectively reducing their real purchasing power.\n\nProfessor Roger Wilkins explained that while wage growth is normally a good thing, a combination of bracket creep and rapidly rising prices has contributed to a decline in workers' living standards in recent years.\n\nSydney's Hyde Park at dusk. Life in Australia is becoming more expensive and we are paying more tax. (iStock)\n\nThis phenomenon affects middle-income earners more significantly than high-income earners.\n\nWilkins also highlighted a reversal in household spending patterns.\n\nPrior to 2021, Australians were spending less on necessities.\n\nHowever, the recent cost-of-living crisis undid that progress, with the total proportion of income spent on necessities jumping by 4.5 per cent between 2021 and 2023.\n\nEconomic pressures reshape family and work\n\nThe report also sheds light on how economic pressures are influencing our biggest life decisions.\n\nFor the first time, the average number of children men want has fallen below two.\n\nWhile having two children remained the most common wish, there's a notable increase in the number of people, both men and women, who now want only one child, or none at all.\n\nLass attributed this to potential parents growing \"more concerned about their financial security and the costs of raising a child.\"\n\nFinally, the notion of retiring in your early 60s is fast becoming a thing of the past.\n\nThe proportion of women aged 60-64 who are retired has plunged from 70 per cent in 2003 to just 41 per cent in 2023.\n\nFor men in the same age bracket, the retirement rate has fallen from 49 per cent to a low of 27 per cent.\n\nWhile some are choosing to work longer, the survey points to a more unsettling trend for many.\n\nThe number of retirees living in private rentals has doubled in two decades, facing significant financial strain as average annual rent payments have surged by 37 per cent in real terms.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/perth-weather-update-wa-city-sets-rainfall-streak-not-seen-for-18-years/d6dfb930-cf98-445a-9625-1e584087ad09",
    "title": "Australian city shatters weather record",
    "publish_date": "Fri, 19 Sep 2025 00:35:53 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Perth has recorded a four-month soaking, the first time this has happened in the spring-winter period for 18 years.\n\nThe WA capital ﻿reached its September average of 79.3mm during light showers on Tuesday and Wednesday, reports Weatherzone .\n\nWhen more rain fell during the 24 hours to yesterday morning, this month's total in Perth hit the 93mm mark.\n\nThe downpours over Perth this week were heaviest late on Wednesday, September 17, 2025, shown here on radar. (Weatherzone)\n\nIt came after the winter months all recorded above average falls, with August totalling 203mm, July 174mm and June 129mm.\n\nThe rainy winter weather was also accompanied by storms and lightning strikes over much of WA.﻿\n\nThe last time Perth had a run of similar wet conditions was in 2007.﻿\n\nThe soaking has been a welcome break in a long stretch of below-average falls, stretching from last November to May.\n\nWeather forecasters say the state's south-west, including Perth, has recorded ongoing rainfall shortfalls, beginning from September 2021 and ending only last month.\n\nIt explains why water storage in Perth currently sits at only 48 per cent of capacity.\n\nLooking ahead, the city is forecast to have dry weather over the next week, with maximum temperatures next Wednesday shaping to hit 30 degrees. ﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/jimmy-kimmel-update-late-night-talk-show-suspended-indefinitely/17a54932-180a-491a-b4db-d2defaf7ca63",
    "title": "Jimmy Kimmel spotted at lawyer's office as Trump calls for more cancellations",
    "publish_date": "Fri, 19 Sep 2025 09:45:43 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Jimmy Kimmel has been spotted at what appears to be a lawyer's office 24 hours after ABC canned his late-night show over comments made about Charlie Kirk's death.\n\nThe Jimmy Kimmel Live! host, 57, was photographed driving from his Los Angeles home to a building complex that is home to multiple legal offices.\n\nKimmel is reportedly also set to meet with Disney executives to discuss the future of his show, according to Bloomberg News.\n\nREAD MORE: Doctor who blew whistle on mushroom murderer sanctioned\n\nJimmy Kimmel emerged from his LA home and drove to a building housing multiple lawyers' offices. (PG/Bauer-Griffin/GC)\n\nKimmel is also reportedly set to meet with Disney executives to discuss the future of his show. (PG/Bauer-Griffin/GC)\n\nMeanwhile, Federal Communications Commission (FCC) Chairman Brendan Carr has made it clear that this isn't over.\n\n\"I don't think this is the last shoe to drop,\" he said in an interview with Fox News.\n\n\"This is a massive shift that's taking place in the media ecosystem the consequences will continue to flow.\"\n\nCarr added that complaints from ABC-affiliate local news stations ﻿in Utah and Pennsylvania played a key role in Kimmel's cancellation and suggested that it could happen again.\n\n\"We're going to back to that era when local TV stations, judging the public interest, get to decide what the American people think,\" he said.\n\nTop Democrats have called for Carr's resignation, but he appears to have the wholehearted support of ﻿US President Donald Trump.\n\n\"I don't think this is the last shoe to drop,\" Brendan Carr announced. (Jonathan Newton/The Washington Post via AP)\n\nYesterday, Trump called Carr \"outstanding\", \"a patriot,\" and \"a tough guy\" while speaking with reporters on Air Force One.\n\nHe also ﻿floated the idea of revoking the licenses of TV networks that air programs \"against\" him, a decision he said will be \"up to\" Carr.\n\n\"They give me only bad publicity, press. I mean, they're getting a license ... I would think maybe their license should be taken away,\" Trump said.\n\nUS TV networks do not have to be licensed by the government to operate.\n\nHe also claimed that licensed TV networks are \"not allowed\" to \"hit Trump\", calling those \"against\" him \"an arm of the Democrat party\".\n\nTrump also publicly celebrated Kimmel's axing and called for \"losers\" Seth Meyers and Jimmy Fallon ﻿to face the same fate.\n\nREAD MORE: Tsunami warnings after huge Russian quake\n\nTrump floated the idea of revoking the licenses of TV networks that air programs \"against\" him. (Anna Moneymaker/Getty)\n\nBut a growing number of TV personalities, critics and even a former US president ﻿have thrown their support behind Kimmel in the face of his politically charged cancellation.\n\nFormer US President Barack Obama wrote on social media: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\n\n\"This is precisely the kind of government coercion that the First Amendment was designed to prevent — and media companies need to start standing up rather than capitulating to it.\"﻿\n\nFormer Vice President Kamala Harris called Kimmel's cancellation an \"outright abuse of power\".\n\n\"This administration is attacking critics and using fear as a weapon to silence anyone who would speak out. Media corporations — from television networks to newspapers — are capitulating to these threats,\" she wrote on social media.\n\n\"We cannot dare to be silent or complacent in the face of this frontal assault on free speech.\"\n\nFormer Vice President Kamala Harris called Kimmel's axeing a 'frontal assault on free speech'. (Brandon Bell/Getty Images via CNN Newsource)\n\nUSA Today's TV Critic Kelly Lawler questioned what Kimmel's axing could mean for the future of late-night TV in the US.\n\n\"How did we get to a place where the president of the United States is potentially influencing who gets to crack what jokes at 11:35 p.m. on weeknights?\" she wrote.\n\n\"And what does it mean for the ability of comedians and entertainers to exercise their right to free speech and to speak truth to power?\"\n\nKimmel's show was \"indefinitely preempted\" by ABC and its affiliates, including Sinclair Broadcast Group, over his comments about Kirk's death earlier this week.\n\nNow ﻿Sinclair has issued a list of \"demands\" Kimmel must meet if he wants the suspension on his long-running show lifted.\n\nOne of the demands is that Kimmel \"issue a direct apology to the Kirk family\".\n\nAnother would require him to make a \"meaningful personal donation to the Kirk Family and Turning Point USA,\" Kirk's nonprofit that advocates conservative politics at schools across the US.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/government-yet-to-set-2035-renewables-target/105798906",
    "title": "Government has not set 2035 renewables target, downplays 90pc",
    "publish_date": "Sun, 21 Sep 2025 00:39:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia has not set a renewable energy target to match its 2035 climate goal, with minister Chris Bowen distancing himself from the suggestion a near-complete renewables rollout would be needed.\n\nLast week the federal government announced it would target an emissions reduction of 62 to 70 per cent on 2005 levels by 2035, as recommended by the independent Climate Change Authority.\n\nThe CCA and Treasury projected Australia would need to exceed 90 per cent renewable coverage to achieve that reduction, while also quadrupling wind power and doubling rooftop solar rates.\n\nBut Mr Bowen said that was \"commentary on the sorts of things that might happen\" and did not constitute a formal target.\n\nAustralia vows to cut emissions 62 to 70 per cent by 2035 Photo shows Anthony Albanese, with Matt Kean and Chris Bowen behind him. Australia will vow to cut its emissions by 62 to 70 per cent by 2035, lifting its sights further as the world strives to reach net zero emissions by 2050.\n\n\"We haven't set a particular target,\" the energy minister told the ABC's Insiders.\n\n\"What we have done is set our emissions reduction target.\"\n\nAustralia does have a renewables target of 82 per cent by 2030, which would require a major quickening of pace to achieve.\n\nMr Bowen said he was \"confident\" the earlier target could be met but acknowledged it was an \"ongoing challenge\".\n\n\"Once we get to 82 per cent renewable energy in 2030, which I am working towards achieving, and have some confidence we will achieve, then we'll keep going,\" he said.\n\n\"Obviously, 82 is a high number … When you get to a number like 82, and then to continue to go after that, you've got to keep working. The low-hanging fruit disappears.\"\n\nEnvironment Minister Murray Watt on Sunday said the Albanese government had approved its 100th renewables project, as it continues to seek to land a deal on approval laws it acknowledges are slow and outdated.\n\n\"Our country needs to continue supporting the rapid rollout of renewables to meet our ambitious and achievable 2035 target,\" Senator Watt said.\n\nMr Bowen also declined to sign up to the CCA's suggestions that a quadrupling of wind power and a doubling of rooftop solar would be needed, saying these figures were \"a possibility\", not a policy.\n\n\"What [the CCA] did in their report to me, quite rightly, is ran through some of the possibilities as to what achieving [the emissions target] might look like.\n\n\"Now of course, there is an opportunity to over-achieve on some things, underachieve on others … That will play out.\"\n\nTarget 'ambitious' but 'doable', Bowen says\n\nMr Bowen is in New York this week with Prime Minister Anthony Albanese for a UN summit, where Australia will present its new target.\n\nAmid criticism from environmental groups that Australia's target is insufficient, the energy minister said it was aligned with the global aspiration of limiting global warming to 1.5 degrees.\n\nThe mammoth task ahead to reach the 2035 target Photo shows Anthony Albanese close up, with Chris Bowen in background. Getting to even the bottom end of the government's 62 to 70 per cent emissions reduction target by 2035 will require drastic increases to solar and wind power capacity, electric vehicle take-up and an extension of the safeguard mechanism, according to the Climate Change Authority.\n\n\"Maximum possible effort is what's required. You can look at the IPCC, over the last few reports, which said 68 per cent from the world is what's required. That's well within our target range,\" he said.\n\n\"This target is very much focused on results. And the results involved in this, even at 72, would be a halving of our ambitions today … This is very ambitious [and] it's doable, it's achievable.\"\n\nMr Bowen said the government would not set a target for electric vehicle sales, with the CCA also projecting a 20-fold increase would be needed inside a decade.\n\nAustralia will continue to negotiate with Türkiye this week as the two countries jostle over hosting rights for next year's climate summit.\n\nMr Bowen said Australia had \"overwhelming support for its bid\" but the process remained stuck because the UN rules required \"consensus\".\n\n\"We have discussions with our Turkish friends this week … This situation hasn't really changed for a while.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/cockchafer-pest-costing-wa-grain-farmers-thousands/105783068",
    "title": "Tiny worm devastating farmers across Western Australia's south east",
    "publish_date": "Sun, 21 Sep 2025 00:30:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers and researchers are scrambling to find a way to combat a tiny worm devastating crops in Western Australia's south-east.\n\nThe scarab beetle larvae, better known as the cockchafer, have caused tens of thousands of dollars' worth of crop damage.\n\nAshton Gray, a former agronomist who farms near Lake Grace, says the pest ruined his 2024 season.\n\nAshton Gray said the cockchafer caused significant damage last season. (Supplied: Joseph Goy)\n\n\"Last year was a real eye-opener of the devastation the [cockchafer] can do. We ended up having 30 to 40 hectares of entire wipe-out in an area,\" he said.\n\n\"To start with, the crop germinated as normal.\n\n\"During some crop inspections, we saw a few plants that were yellow, but as the season progressed, those areas grew bigger.\n\n\" That was nearly 100 tonne of grain missing out of that paddock. \"\n\nThe pest is known to feed on roots beneath the soil, causing damage that often goes unnoticed until it's too late. (ABC Great Southern: Andrew Chounding)\n\nLocalised threat\n\nThe pest was first detected in the region a decade ago on the property of Lake Grace farmer Tom Dunham.\n\nA different species of cockchafer was also identified in the 1990s in Harrismith, about 65 kilometres north-east of the town.\n\nDespite his best efforts to control the outbreak, Mr Dunham said the pest had devastated a wide range of his crops.\n\n\"We've tried various things over the years such as chemicals, reefinating and looking at our seeding rate,\" Mr Dunham said.\n\n\"But it was getting to a point for us where we were having to suck it up and deal with it, because nothing works.\"\n\nThe pest was detected on Tom Dunham's farm 10 years ago. (ABC Great Southern: Andrew Chounding)\n\nThe spread of the cockchafer and the growing number of affected farmers have sparked a growing push for a management solution.\n\n\"It's costing us every year to varying degrees and we're losing a fair bit at the moment,\" Mr Dunham said.\n\n\"So it's good that more people are looking at it and realising it is a problem, rather than just [in] an isolated area.\"\n\nTom Dunham's crops have taken a significant hit once again. (ABC Great Southern: Andrew Chounding)\n\nResearch underway\n\nThe cockchafer has only impacted certain areas, but research has begun to help farmers like Mr Gray and Mr Dunham manage the growing populations on their properties.\n\nField trials funded by the Council of Grain Grower Organisations (COGGO) are underway on three affected farms to identify practical, on-ground solutions.\n\nBen Whisson says the goal is to find solutions that can be immediately put into practice. (ABC Great Southern: Andrew Chounding)\n\n\"We're trying to find grower-ready strategies that can be used instantly,\" agronomist Ben Whisson said.\n\n\" We're looking at insecticide options, different placements of products [and] combinations of things to see what is going to be the best scenario. \"\n\nThe Department of Primary Industries (DPIRD) and the Grains Research and Development Corporation have also teamed up in the fight against the pest.\n\nDusty Severtson says work is underway to identify the species at a molecular level. (ABC Great Southern: Andrew Chounding)\n\nDPIRD research scientist Dusty Severtson said the species' DNA was being investigated and urged farmers to report detections.\n\n\"Department researchers are working with Murdoch University to DNA-sequence samples to identify the species, or perhaps multiple species, at a molecular level,\" he said.\n\n\"This will give us a better understanding of the number of species we are dealing with and to characterise or barcode new or unknown species being found in crops.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/ninga-mia-kalgoorlie-mining-aboriginal-reserve-homelessness-gold/105774862",
    "title": "An eerie look inside the decay of a town next to the city of gold",
    "publish_date": "Sun, 21 Sep 2025 00:15:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "There's an eerie silence in Ninga Mia. It's palpable, like a heavy fog.\n\nThe paint on the playground in the centre of the village has started to fade — the overgrown grass gives an indication of how much it's used.\n\nWrecked cars, stripped to their bones, litter the landscape.\n\nWrecked and overturned cars at Ninga Mia. (ABC News: Cason Ho)\n\nFront porch lights and fresh tyre tracks suggest some people still live here.\n\nBut it feels hollow compared to what was once a thriving place, according to those who once called Ninga Mia home.\n\n\"There was a lot of people living here — over 100 people — we had vegetables growing here, we had about 50, 60, 70 houses here,\" Geoffrey Stokes says.\n\nGeoffrey Stokes in an abandoned home in Ninga Mia. (ABC News: Cason Ho)\n\nThe Wongutha-Ngadju-Mirning Elder speaks with a sense of longing.\n\nNinga Mia is an Aboriginal reserve in Western Australia's Goldfields region established in the 1980s as a government-sanctioned settlement for Aboriginal communities.\n\nIt was initially created to provide temporary housing for First Nations people, but has also served as permanent accommodation over the years.\n\nAll levels of government have invested in the village to build infrastructure and services for its community.\n\nBut a shift in policy saw Ninga Mia rapidly decay.\n\nA wrecked home in Ninga Mia. (ABC News: Cason Ho)\n\nA broken ceiling fan droops from the ceiling of a squalid house. (ABC News: Cason Ho)\n\nMost of the homes have been torn down. Many of the remaining buildings are squalid and unlivable, in part due to damage by the tenants themselves.\n\nA WA government-commissioned audit in 2018 found no major refurbishments had been made to properties here in decades.\n\nGeoffrey Stokes stands in the hallway of a dilapidated home in Ninga Mia. (ABC News: Cason Ho)\n\nAn old mattress inside what used to be someone's bedroom. (ABC News: Cason Ho)\n\nIn 2019, then-WA Aboriginal affairs minister Ben Wyatt said Aboriginal reserves were no longer appropriate.\n\n\"I'm determined to ensure that Aboriginal people who have now for decades lived on the edge of major towns, which produce a lot of wealth and have lived in substandard conditions, move to better housing in town,\" he said.\n\nThe WA Department of Housing and Works says there are 19 tenants living in seven properties at Ninga Mia, as of September 15.\n\nGeoffrey Stokes in a house in Ninga MIa. (ABC News: Cason Ho)\n\nIt indicates the government has been successful in the first step — moving people out of the reserve — but Mr Stokes says the second step, of providing alternative housing, has fallen woefully short.\n\n\"[The government] started stripping and knocking down buildings, now we're homeless and our people are living on the streets,\" Mr Stokes says.\n\n\" Again, displacing the people. \"\n\n\"We're nothing — that's how they treat us, like nothing, nobody, just a waste of time and space.\"\n\nLetterboxes at the entrance to Ninga Mia. (ABC News: Cason Ho)\n\nThe WA Department of Housing and Works is responsible for Ninga Mia's tenants and property maintenance, but has contracted these services out to Aboriginal Community Housing Ltd (ACHL).\n\nRepairs and maintenance are an ongoing issue, with tenants saying some requests for service have previously been ignored for months or years.\n\n\"The people pay bills … they [ACHL] take the money, but they don't send anybody to do the work,\" Mr Stokes says.\n\nACHL did not respond to the ABC's questions, and directed the enquiry back to the department.\n\n\"During 2024-25, 18 individual maintenance service requests were lodged, resulting in 24 Work Orders being issued at Ninga Mia,\" a department spokesperson said.\n\n\"Tenants at Ninga Mia also have access to a 24/7 service where they can self-report any maintenance needs.\"\n\nNinga Mia and the Super Pit gold mine lie on the edge of Kalgoorlie. (ABC News: Cason Ho)\n\nNinga Mia is a microcosm of the cycle of displacement endured by many First Nations people.\n\nNuclear weapon tests in Western Australia in the 1940s and 50s displaced the Spinifex or Anangu people from the central and western desert, forcing many to move towards the large regional hub of Kalgoorlie.\n\nBut at the time, the state's prohibition laws — which aimed to restrict Aboriginal people's movements — barred them from entering town, which meant many struggled to find safe accommodation, and had limited access to services like healthcare.\n\nMany ended up living in missions or reserves, similar to Ninga Mia.\n\nCity of gold\n\nNinga Mia sits in the shadow of the Super Pit — one of Australia's largest open-pit gold mines — about a kilometre from the edge of the City of Kalgoorlie-Boulder.\n\nKalgoorlie was founded on gold in the 1890s, and its development has been linked to mining ever since.\n\nKalgoorlie Consolidated Gold Mine operates the Super Pit on the edge of Kalgoorlie. (ABC News: Cason Ho)\n\nThe city's mines have produced more than 65 million ounces of gold — that's worth about $325 billion at today's prices.\n\nThe Super Pit is Kalgoorlie's biggest tourism attraction. (ABC News: Cason Ho)\n\nIn a testament to the city's historic and ongoing importance to the industry, the state's largest annual mining conference, Diggers & Dealers, is hosted in Kalgoorlie.\n\nBut even with the gold price at record highs, the city's riches don't necessarily flow on to those who live in it.\n\nThe Exchange Hotel in the centre of Kalgoorlie's main strip. (ABC News: Cason Ho)\n\nTrucks and utes dusted with red dirt zoom through the city's central boulevard.\n\nFor some people, their cars are home.\n\nKalgoorlie's homelessness rate, recorded during the latest Census in 2021, was almost twice the national average.\n\nMayor Glenn Wilson says, amid the national housing shortage, things are worse now than he's ever seen.\n\nA parked ute with red dirt in Kalgoorlie. (ABC News: Cason Ho)\n\n\"There's people sleeping in cars, there's people from all walks of life … people have got jobs too and they're actually on the streets,\" Mr Wilson says.\n\n\" We're seeing people camp in our town for the first time in a long time, if ever. \"\n\nLocals say some rough sleepers find refuge in abandoned buildings, like the train yard on the edge of town.\n\nAn abandoned train yard in Kalgoorlie where some homeless people stay. (ABC News: Cason Ho)\n\nA dimly lit old train yard with tin walls boarded up with wood. (ABC News: Cason Ho)\n\nAustralia's housing crisis is exacerbated in regional areas, and even more so in mining cities like Kalgoorlie according to Mr Wilson, who's lobbying the state government for help.\n\n\"Homelessness is not a city [local government] issue,\" Mr Wilson says.\n\n\"We've seen in the metro area the old apartment building that was bought by the state government to house people.\n\n\"We've got some glorious old hotels that are around the city that are no longer being used — can the state government look at those options?\"\n\nKalgoorlie's main street. (ABC News: Cason Ho)\n\nJust a couple of kilometres out of town, a $65 million mining camp has been approved after one of the country's largest gold miners, Northern Star Resources, said it had exhausted all available accommodation in town.\n\nThe camp was approved by a state government panel despite objections from the local government, and from residents who argue the town's services are in decline.\n\nNorthern Star says the camp and its construction would ultimately lead to positive economic impacts on the community.\n\nMining rubble on the edge of Kalgoorlie. (ABC News: Cason Ho)\n\nBut Kalgoorlie's history throws into question how much benefit local residents and the region's First Nations people will actually receive.\n\nUnlike most of Western Australia, native title has not been determined in large areas in and around Kalgoorlie, leaving little opportunity for mining royalties for Aboriginal communities.\n\nVicious cycle of homelessness\n\nJust off the town's main street, the sound of playful laughter drifts from one of the local churches.\n\nInside a fenced-off yard, children are zipping around on scooters. One child's climbing a basketball stand. Another grins, ear to ear, with toast crumbs on his face.\n\nKids play in the yard of a church which is holding a free community breakfast. (ABC News: Cason Ho)\n\nMen are waiting with baskets full of laundry next to a demountable where loads of washing tumble around.\n\nA truck with a shower inside sits in the corner of the yard. Words plastered on the side say, \"for people experiencing homelessness\".\n\nDemountable laundry at Church of Christ Kalgoorlie. (ABC News: Cason Ho)\n\nThe smell of toast wafts out from a large shed, where a woman with a black cap walks around hurriedly.\n\nOne moment she has a clipboard in her hands, the next moment a child.\n\nTracey McCartney coordinates the community breakfast. (ABC News: Cason Ho)\n\nTracey McCartney runs her church's community program for people in need.\n\n\"We just provide a service for them to do their washing, have a shower, have some breakfast, charge their phones — things we don't think of that we need, when we have a house,\" she says.\n\n\"Being a hub in the Goldfields, a lot of people come from outlying communities or towns for medical reasons, or for shopping, or family, funerals, a lot of different reasons.\"\n\nA group of people sitting around eating breakfast inside the centre. (ABC News: Cason Ho)\n\nKalgoorlie, like many other regional centres around the country, is grappling with both insufficient temporary accommodation for communities that drift in and out of town, and housing for permanent residents.\n\n\"There's definitely not enough housing. The wait list for public housing can be years,\" Ms McCartney says.\n\n\"Then you have people on the streets longer, you have their health affected because, like now with the cold weather coming in hospital admissions go up because of people's health — it's just a vicious cycle.\"\n\nA girl at a community breakfast in Church of Christ Kalgoorlie. (ABC News: Cason Ho)\n\nAs of March, there were 458 applications for social housing in Kalgoorlie, according to the Department of Communities.\n\nThe number of applications has grown 45 per cent since March 2020.\n\n\"The state government is doing all it can to boost social housing, including working to retain ageing social housing properties and investing in alternative construction methods,\" a Communities spokesperson said.\n\n\" Since July 2021, the state government has delivered a record $5.1 billion in homeless and housing measures. \"\n\nThe department says it has also helped fund a range of homelessness services in Kalgoorlie including emergency accommodation and health services, and that planning is underway for wrap-around support services.\n\nThe bigger story\n\nThe City of Kalgoorlie-Boulder published a research report in April titled \"Antisocial Behaviour and Transitional Aboriginal Homelessness\".\n\nA cloudy day, sunlight shines through the Kalgoorlie clocktower. (ABC News: Cason Ho)\n\nThe city's chief executive Andrew Brien said the community's \"number one issue\" was the perception of antisocial behaviour due to the presence of people on the street who appear homeless.\n\n\"If you get a group of people congregating in a park, for example, the rest of the community don't feel safe using that park,\" Mr Brien says.\n\n\"It's predominantly the people who are coming in from the lands … so they're staying in overcrowded housing or they're staying on the streets.\n\n\" It's not done to intimidate or anything else, it's simply a group of people sitting around … they meet, they talk, and that is part of the culture that people don't always see or understand. \"\n\nThe city did not consult any First Nations stakeholders for its report, but Mr Brien says they will be included in a \"think-tank\" later this year.\n\nTracey McCartney from Church of Christ Kalgoorlie. (ABC News: Cason Ho)\n\n\"Not everybody who's homeless and rough sleeping, and even possibly drinking or intoxicated, are going to be involved in antisocial behaviour,\" Ms McCartney says.\n\n\"We need to look at people and see that there's a big story behind what they're going through, and that story is different for every person, and taking the time just to hear that story and try and walk in people's shoes can be really valuable for us.\"\n\n'Listen to the local': Elder\n\nNoongar-Gija Elder Bill Ring, who has worked for decades to improve things for First Nations people, has a simple message: \"Listen\".\n\nBill Ring has lived with family members, in a pub and in a caravan park while looking for permanent accommodation. (ABC News: Macey Turner)\n\n\"For 40 years I've seen it, and there's still no improvement … there's little bits and pieces, but it hasn't changed much,\" Mr Ring says.\n\nThe former Indigenous special police officer, now a mental health worker, is potentially facing homelessness himself.\n\n\"We all drive around Kalgoorlie and look around … a blind man could see that problem,\" he says.\n\nA house at Ninga Mia. (ABC News: Cason Ho)\n\nThe elder helped form the Eastern Goldfields First Nations Council in 2021, which aims to hold organisations to account on Closing the Gap targets, including homelessness.\n\n\"That's local government, the police, other organisations that get Aboriginal funding for Closing the Gap,\" Mr Ring says.\n\n\"People say they get funding for this and that program ... but what do you have to show for it?\"\n\nA dilapidated house in Ninga Mia. (ABC News: Cason Ho)\n\nDespite Ninga Mia's condition, Mr Ring says its remaining residents won't give up on their homes.\n\nA window looking out of a house in Ninga Mia. (ABC News: Cason Ho)\n\n\"They're going to stay because their mothers, their forefathers, they lived out here,\" Mr Ring says.\n\n\"If they want to address the homelessness, then they've got to look at the places where the people feel comfortable in staying.\"\n\nHe's urging all levels of government to consult with First Nations communities when addressing issues affecting them.\n\nA playground in Ninga Mia. (ABC News: Cason Ho)\n\n\"Listen to the local person, the local elder, a local bloke who's been there done that,\" Mr Ring says.\n\n\" You want something? You come to us. \"\n\n\"We're ready to work, we're ready to talk — but it's up to them.\"\n\nLoading...",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/aflws-rapid-evolution-has-been-a-double-edged-sword-for-crows/105798110",
    "title": "Powerhouse AFLW side being challenged as comp evolves",
    "publish_date": "Sat, 20 Sep 2025 23:32:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "The AFLW's rapid evolution has been a double-edged sword for Adelaide, which is the most successful club in competition history, having won three of the eight premierships.\n\nWhile just five inaugural Crows remain since their premiership-winning 2017 side, they have been in half of all the competition's grand finals and made it to at least a preliminary final every year since 2021.\n\nRoos claim 18th straight win Photo shows Four Kangaroos AFLw players celebrate a goal. Reigning premiers North Melbourne thrashes Carlton by 53 points, while Port Adelaide is stunned by an umpiring decision in its narrow loss to Geelong.\n\nYet in round one, they were shocked with a 22-point defeat to St Kilda after scoring just two goals.\n\nOriginal Crow and now star player Anne Hatchard said it was a defeat that was hard to take.\n\n\"[It] kind of just really hit because, I guess we didn't go in too confident, but I don't think we really expected what happened out in the field. We weren't, I guess, prepared for it. So that kind of hit hard,\" Hatchard told ABC Sport.\n\nAdelaide currently sits sixth after a 3-2 start and will face Gold Coast on Sunday afternoon.\n\nAdelaide were shocked with a 22-point defeat to St Kilda in round one after scoring just two goals (Getty: Daniel Pockett)\n\nAfter the Saints, the Crows immediately bounced back the following weekend with a 38-point win against Geelong, thanks to a fourth-quarter seven-goal blitz.\n\nThey then beat GWS by 32 points after a four-goal opening quarter - they only kicked three goals over the next three quarters.\n\nThen ending the winning run, they suffered their second loss of the season to the reigning grand finalists Brisbane by three points in round four.\n\nIt wasn't until they defeated Hawthorn by 21 points last weekend that Hatchard said they had a complete four-quarter performance.\n\n\"Whenever you get a loss, it's like, 'OK, what can we do now? What do we need to do?' Everyone gets a bit frantic,\" Hatchard said.\n\n\"So it's nice having that win against the Hawks, who are a very, very strong team.\n\n\"They started four and zip. To come out and get that win just gave our girls a lot of confidence and that belief that we can do it when we play our footy.\"\n\nAnne Hatchard said the Crows' victory against the Hawks was her side's most-complete four-quarter performance this year. (Getty: Morgan Hancock)\n\nThe AFLW season runs from August to November, with preseason practice matches the month prior, meaning teams don't get to see or play each other for seven months of the year.\n\nTop sides like the Crows can often come out of preseason and be struck by how much the competition has evolved.\n\nLast season it was Melbourne - currently third after a 4-1 start - who finished ninth and missed finals. They had only dropped two games for the entire 2023 season.\n\n\"These teams just keep coming and coming. Especially the Saints. I was super impressed with how they came out and played. They were such a unit … We just have to keep trying to get better and better,\" Hatchard said.\n\nCollingwood is righting the ship this AFLW season Photo shows Collingwood AFLW players celebrate a goal. A year after finishing dead last in the AFLW, the Magpies have started making moves up the ladder thanks to a new approach at both ends of the field.\n\nThe 27-year-old three-time premiership player and three-time club best and fairest is also aware that dynasties in sport are rare as it's hard to stay at top for long periods of time.\n\n\"I'm so grateful that we've been in a very successful team, and it's heartbreaking losing prelim finals, we just want to keep pushing to make those grand finals,\" Hatchard said.\n\n\"I know a lot of girls go through [the competition] and they don't even get to play finals. Let alone, I've got three premiership medals.\n\n\"It has been amazing to be part of this talented group and talented program.\"\n\nIt's a group that Hatchard assures is aiming for another grand final appearance this year.\n\n\"I love that the competition is getting better and better, because you go on out there and you know the game's going to be hard. No game is easy going into this season,\" Hatchard said.\n\n\"It's awesome for the competition and I love it, as much as I hate losing.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/housing-human-right-law-act-analysis-what-does-that-mean/105797726",
    "title": "Solving the housing crisis is a marathon but a new law could be the first step",
    "publish_date": "Sat, 20 Sep 2025 22:13:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's never been done in Australia before — enshrining housing as a human right.\n\nBut it's a concept that will soon become a reality in the ACT.\n\nThe territory's Legislative Assembly unanimously passed legislation this week that will require the government to consider access to adequate housing in all of its decisions and policymaking.\n\nIt's a move that might bring hope to the more than 3,400 approved applicants on the ACT's public housing waitlist, who are waiting about five years on average.\n\nIt might also spark hope among those struggling to find an affordable rental — over five years, Canberra's median rent prices increased 18 per cent for houses and 20 per cent for units.\n\nAnd for those still chasing the Australian dream, making housing a human right might make them feel like home ownership is within their grasp.\n\nCanberra's rents have increased signficantly over the past five years. (ABC News: Matt Roberts)\n\nBut will Canberrans actually feel a tangible benefit when this change comes in?\n\nThe answer for the vast majority: no. At least, not immediately.\n\nTime for change\n\nThere's consensus, even from the community organisations that have advocated for the change for years, that the new law won't solve the housing crisis overnight.\n\n\"When this legislation comes into effect, it won't mean everything is solved straight away,\" ACT Shelter CEO Corinne Dobson said.\n\n\"But over time, the government will need to show that it is moving in the direction of ensuring that everyone has the right to adequate housing.\"\n\nAnd to be clear: it doesn't mean the government has to provide a house for everybody.\n\nShane Rattenbury hopes the bill will start reshaping the way housing is thought about in the city. (ABC News: Ian Cutmore)\n\nIn the words of ACT Greens leader Shane Rattenbury, who authored the bill, \"it will start the process of reshaping the way we think about housing in this city\".\n\n\"It will create a new requirement, by law, for the government to treat housing not as a private asset for wealth creation, but as a foundational social good,\" he said.\n\nThough not everyone is convinced that lofty goal can be achieved.\n\nShould others states follow?\n\nChris Martin, a senior research fellow at the City Futures Research Centre at UNSW said the legislation was not \"a radical change in thinking\".\n\n\"But it's definitely a step in the right direction and something that other jurisdictions should be looking at to better organise the way we think about and do housing,\" he said.\n\nDr Martin said the legislation had some limitations — it doesn't impact decisions made by private landlords, for example.\n\n\"It doesn't mean ACT citizens suddenly have a whole lot of new rights,\" he said.\n\n\"But it does signal that the ACT government will consider the right to housing when they make laws and also when they make decisions about individual people interacting with them.\"\n\nChris Martin said the legislation doesn't impact decisions made by private landlords. (ABC News: Ian Cutmore)\n\nImportantly, the legislation also opens the government up to possible legal challenges, providing a mechanism for Canberrans to hold decision-makers to account.\n\nHuman Rights Minister Tara Cheyne said the bill \"recognises that access to adequate housing must be progressively realised over time\".\n\nBut she also confirmed that certain protections must be guaranteed sooner — including protection against unlawful and arbitrary eviction.\n\n\"It won't solve all of our housing challenges overnight but [it's a] pretty powerful building block to our legal foundation,\" she said.\n\nA first step\n\nTiana affords rent by having her landlords live in her backyard Photo shows A woman with red hair in a navy shirt staring at the camera. There is a widening housing divide in a city that boasts the highest weekly median income in the country.\n\nThe Australian-first laws will take effect in January 2027.\n\nBut there's a delayed start, allowing additional time for the government to prepare during a two-year implementation period.\n\nThat means the broad scope of including the right to housing in the Human Rights Act won't commence until January 2029.\n\nWhile many agree enshrining housing as a human right is a good first step, to solve some of the housing issues in the territory, this feels like the first step in a marathon.\n\nAnd the government will need plenty of focus to make it to the finish line.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/golf-prodigy-anna-huang-eyes-historic-win-with-three-shot-lead/105798862",
    "title": "Golf prodigy Anna Huang eyes historic European Tour win with three-shot lead",
    "publish_date": "Sat, 20 Sep 2025 21:47:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Canadian golf sensation Anna Huang is on the brink of making history, taking a three-shot lead into the final round of the 2025 La Sella Open in Spain.\n\nThe 16-year-old shot a third-round 69 (3-under) to sit at 17-under-par, continuing her stellar rookie season on the Ladies European Tour (LET).\n\nHuang, who has led the field since day one, broke her streak of 62 bogey-free holes on the par-3 15th but remained composed.\n\n\"It's kind of crazy to have only one bogey all week,\" she said.\n\n\"I was really in the zone. Hopefully, I can keep that momentum tomorrow.\"\n\nIf victorious, Huang would become one of the youngest winners in LET history, joining an elite group of players under 17 to claim a title.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nSince earning her LET card at 15, the Vancouver native has dazzled in a whirlwind season spanning countless countries and courses.\n\nHuang sits 50th on the LET Order of Merit for the season, and she is coming off a seventh-placed finish in Switzerland last week.\n\n\"Pressure is a privilege,\" Huang said after her third round.\n\n\"I'm more excited than nervous. I've learned to stay patient and focus on each shot.\"\n\nEBU/ABC",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/wagga-wagga-young-tennis-stars-chase-grand-slam-dreams/105782764",
    "title": "Tennis dreams come at a cost as you lose money even when you win",
    "publish_date": "Sat, 20 Sep 2025 21:38:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Cara Korhonen walked onto Rod Laver Arena at the age of 10 to have a hit with one of her tennis heroes, it sparked a dream that has taken her all over the world.\n\n\"I had Alicia Molik playing right next to me and she gave me a high-five,\" the now 19-year-old said.\n\n\"[She] was telling me how well I was playing and that's a memory that has really stuck with me.\"\n\nCara Korhonen has been playing tennis since she was 4 years old. (ABC Riverina: Jess Scully)\n\nThe Gold Coaster is number 1,463 on the Women's Tennis Association rankings and has been playing since she first picked up a racquet at age four.\n\nHer dream of grand slam stardom has taken her to Thailand, Taiwan, Hong Kong, the US, Finland — and Wagga Wagga.\n\nPlaying for love, not money\n\nCompetitors in the Women's 35 ITF World Tennis Tournament at Wagga Wagga are slugging it out for a share of $30,000 in prize money.\n\nBy comparison, the Australian Open offers a prize pool of more than $33 million across the men's and women's singles divisions and another $5 million for doubles.\n\nPlayers at Wagga Wagga's world tour tennis event are competing for a prize pool of $30,000. (Supplied: Tennis NSW)\n\nBut for players like Korhonen, the real prize on offer at Wagga is ranking points.\n\n\"Trying to get as many points as possible so it's much surer getting into these tournaments,\" she said.\n\n\"A lot of what I'm doing has to be on my own.\"\n\nThat means she has to be as quick to spot a bargain as she is across the court.\n\n\"[I] go to Coles or Woollies and look at those quick sale items and just try and pick up any of those as much as possible,\" she said.\n\nMum along for the ride\n\nKorhonen's mother Annelie has taken on the role of coach and support crew.\n\n\"Every single tournament you're more likely to be a couple thousand [dollars] out of pocket,\" she said.\n\n\"A first round on the main draw, that pays you about two nights' accommodation.\n\n\" It's always you go home more or less on a minus, you've paid more than what you got back. \"\n\nAspiring tennis star Cara Korhonen (left) with her mother Annelie at Wagga Wagga's world tour event. (ABC Riverina: Jess Scully)\n\nGabriella Da Silva-Fick has been playing tennis for 15 years and is number 515 in the WTA singles rankings.\n\n\"People see those bigger tournaments and think it's all glamorous, but there's a lot of work that goes into it,\" she said.\n\n\"We book pretty much all our own accommodation, travel, flights. It's pretty much all out of our bank accounts, so there is a lot of pressure on results.\"\n\nThe Collaroy local has competed in Europe and played in the Australian Open in 2019.\n\n\"What people don't realise is if we're sick or we're injured, we're not getting paid, so it's up to us to take care of our bodies,\" Da Silva-Fick said.\n\nAustralian tennis player Gabriella Da Silva-Fick is chasing her dreams at Wagga Wagga's world tour event. (Supplied: Tennis NSW)\n\nKorhonen at least has a secret weapon when it comes to dealing with the mental stress of chasing her dreams of sporting stardom.\n\n\"I'm about to finish [a psychology] degree. I've done that in under a year and a half,\" she said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/couples-stressed-after-kurrajong-hills-wedding-venue-burnt-down/105780958",
    "title": "Hopeful newlyweds fear debt and anxiety after wedding venue fire",
    "publish_date": "Sat, 20 Sep 2025 21:22:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Lisa Perry booked her dream wedding venue in the Hawkesbury region, she never expected it to go up in flames two weeks before her special day.\n\nShe had also not planned to take out a $23,000 loan in the days leading up to the nuptials.\n\nThe 43-year-old and her partner Mitch were among the couples left scrambling to find a replacement venue after a fire tore through the Loxley on Bellbird Hill at Kurrajong Hills on September 5.\n\nFirefighters battled the blaze at the historic wedding venue in the Hawkesbury. (Supplied: NSW Rural Fire Service)\n\nMore than 80 firefighters with 25 trucks worked to battle the flames, but the venue's historic main building was completely destroyed.\n\nWith the invoice paid in full and only a fortnight left to salvage their wedding plans, Lisa said she made dozens of calls to the Loxley that went unanswered.\n\n\"We would have thought that they'd have solicitors, or that they would have somebody on their part that would have contacted us,\" she said.\n\nAn interior shot of the building before the fire. (Supplied)\n\nThe only correspondence she claimed she received was a text from the wedding coordinator on the night of the fire telling her the best course of action would be to email the venue.\n\n\"We understand that the owners are obviously going through a horrible time themselves, what we don't understand is why we're getting married this week and we still haven't heard anything,\" she said.\n\nThe couple have spent more than a year planning and saving for their wedding. (Supplied)\n\nThe Loxley told the ABC in a statement that staff were \"continuing their communication with our valued customers who had bookings at our venue\".\n\n\"As we navigate this challenging time, we thank everyone for their compassion and understanding while we work through this process.\"\n\nThe venue encouraged enquiries to be made via email.\n\nThe cabins at Loxley on Bellbird Hill in the months before the blaze.\n\nA last-minute bank loan\n\nDespite being more than $20,000 out of pocket, Lisa said it was not as straightforward as cancelling the wedding altogether.\n\nFor Lisa, the Loxley held strong sentimental value, having chosen the venue with her late-father who passed away only three weeks ago.\n\n\"We have family that chose not to make dad's funeral, to come for a happier time,\" she said.\n\n\"It was an absolutely beautiful venue, so to lose him and to lose that wedding venue as well it's just all daggers.\"\n\nThe fire completely destroyed the Loxley's main building. (ABC News)\n\nThe couple were approved for a $23,000 loan and have managed to book another venue in time.\n\nBut Lisa felt sorry for the couples who were unable to afford a second deposit up-front and unsure of what to do next.\n\n\"It's their [Loxley's] job to at least give us an outlay of 'OK we're going through insurances, this is what's happening'. I think we deserve that at least,\" she said.\n\nCouples left feeling 'very anxious'\n\nAnother bride, Emily Perry, estimated she made \"close to 60 calls\" to Loxley before she received an email that was sent 12 days after the fire.\n\nThe email, as seen by the ABC, said Loxley would be \"progressively offering a full refund\" for events booked until the venue is able to operate \"to the standard which was promised\".\n\nIt said an insurance claim was submitted the Monday following the fire and Loxley had been \"working closely with our insurer to provide all required information\".\n\n\"The wording of the email was very vague,\" Emily said.\n\nRhys and Emily are paying off the invoice on another wedding venue after their original venue burnt down. (Supplied)\n\n\"They haven't really indicated as to whether we need to wait for the insurance to be approved, whether we're going to be contacted in the coming days or week.\n\n\"We've heard literally nothing else on when we're getting that [money back], we might not even be getting it for all we know, until next year.\"\n\nEmily and her fiance Rhys were due to marry in April and had paid off $20,000 on their invoice.\n\nShe has been trying to find out how soon their money will be returned, with the couple opting for another venue to save their planned wedding date.\n\n\"The date of my wedding is the anniversary of my grandmother's passing,\" she said.\n\n\"I was very close with her so having that date was super important to me by making sure that she's connected to the day.\"\n\nSo far Rhys and Emily have put down $8,000 towards another venue. (Supplied)\n\nSo far the couple has been able to put down $8,000 towards another venue, but Emily said the lack of correspondence surrounding the refund process \"makes us very anxious\".\n\n\"On top of the fire I did also get made redundant from work so obviously financially it's been a bit of a struggle,\" she said.\n\nShe said her fiance was also unable to work as he lived with multiple sclerosis (MS) and they would only scrape by on their next instalment.\n\nEmily said finding a new venue that aligned with her budget and date \"was an absolute miracle\".\n\n\"But knowing that dream wedding we had been planning shattered right in front of us was just devastating.\"\n\nIs wedding insurance worth considering?\n\nThere are only a handful of insurers in NSW that offer wedding insurance in the event of an unexpected disaster.\n\nSpecial Counsel at BlackBay Lawyers Dragan Gasic, who specialises in complex commercial disputes, said wedding insurance can cover anything from last-minute cancellations to damaged photographs.\n\n\"Wedding insurance protects people from financial losses due to events such as fires. It covers aspects like cancellation, postponement and even supply, for example photographers or caterers who don't turn up, damage to dresses from loss of rings,\" he said.\n\nMr Gasic said weddings carried a higher risk of financial loss as couples tended to spend a large amount of money.\n\n\"Read your contracts carefully and understand the terms and conditions,\" he said.\n\n\"If there's any questions or queries raise it with the venue and the insurer and find out what the limitations and exclusions are. More importantly, shop around.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/qld-skateboarding-becomes-family-single-dad/105774582",
    "title": "Four-year-old tearing up the skate park with dad, sister in tow",
    "publish_date": "Sat, 20 Sep 2025 21:13:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Skylah MacAskill isn't your typical skateboarder.\n\n\n\nFor one thing, she's four years old – and, when she hits the park, she wears a dinosaur onesie or a tutu.\n\nWith her dad Jay and older sister Ava in-tow, the family has found a new way of connecting — as a \"skate family\".\n\n\n\n\n\nFour-year-old Skylah prepares to drop in on a quarter pipe. (ABC News: Baz Ruddick) A long-time skater who had drifted away from the sport for the last eight years or so, Mr MacAskill dusted off his old board after a park was built near his daughter's daycare.\n\n\"I put Skylah on the board. She was scared at first, but once she rolled down the ramp she didn't want to stop,\" he said.\n\n\"Within a week I was buying her a proper skateboard. That's where it all began,\" he said.\n\nSoon, his eldest daughter Ava swapped her scooter for a skateboard, and the family discovered Skate Mates – also known as Sk8 M8s. Now both girls are hooked — and so is their dad.\n\n\"Somehow I ended up with two skater girls I didn't [have to] push into it,\" he laughed.\n\n\n\n\n\nTownsville's Sk8 M8s group meets every week. (ABC News: Baz Ruddick) \"It's definitely a great feeling skating together. We've got something in common, something to talk about ... it's a really good bonding experience.\"\n\nWhile Mr MacKaskill is known around Townsville for his signature backflips, the girls are getting the hang of dropping in.\n\nA drop in is when a skater balances their board on the edge of a ramp using their back foot and then pushes their weight on the front of the board to roll down onto it.\n\nAva said her first time dropping in on a ramp was daunting but with a bit of support from her dad she now feels comfortable. (ABC News: Baz Ruddick)\n\nDaughter Ava said her first attempt at one was terrifying, but her dad helped her.\n\n\"I thought I was going to fall backwards, but Dad helped me and I didn't,\" she said.\n\n\"I love learning new tricks and big drop-ins.\"\n\nMore than tricks\n\n\n\n\n\nLeonie Johnson co-founded the Townsville skateboarding community Sk8 M8s which meets every week at different parks around the city. (ABC News: Baz Ruddick) In 2019, Leonie Johnson saw a need for more support for skaters in Townsville and co-founded a weekly meet up group called Sk8 M8s.\n\nShe said all too often, skaters were seen as loiterers or troublemakers, and skate parks were perceived as intimidating and off-limits.\n\n\"We formed Sk8 M8s as a way of creating a safe space for skateboarders of all abilities [and] all ages, so they can come down and try it out and give it a go with support,\" Ms Johnson said.\n\n\n\n\"Some of the skaters we got to know in the community said they wanted to have more of a social [element] in skateboarding, because they felt it had some negative connotations.\"\n\n\n\n\n\nSk8 M8s co-founder Leonie Johnson said a strong and supportive Townsville skate community has developed in recent years. (ABC News: Baz Ruddick) Four years on, Tuesday night Sk8 M8s sessions draw in toddlers, teenagers and adults to the city's major skate parks.\n\nFar from being banished, parents pull up camping chairs with a thermos to watch and cheer their kids on at the ramp.\n\n\"We're involving parents in some of that community aspect and we're starting our little ones younger,\" Ms Johnson said.\n\n\"I think it's really important ... we need parents to understand what the culture is like at a skate park, and not to be afraid of the skate park.\"\n\nShe said a lot of the more experienced skateboarders had become mentors, which helped the community develop.\n\n\n\n\n\nTownsville's Sk8 M8s group helps parents get involved with their kid's skateboarding progress. (ABC News: Baz Ruddick) \"More experienced skateboarders will step in in a really gentle way to give prompts to the younger and newer skaters,\" she said.\n\n\"It means they're learning exactly the way that skateboarding is always meant to be: it's grassroots and it's community and about learning from your peers.\"\n\nFor Ms Johnson, the lessons taught at the park go beyond landing a trick. Sk8 M8s places a strong emphasis on etiquette; getting back up after a fall, waiting your turn, respecting others, and sharing space with BMX and scooter riders, and even the occasional roller skater.\n\n\"Practice brings progress, not perfection. Not even Olympic skaters rock a perfect line every time,\" she said.\n\n\"You get knocked down and you stand back up and you give it another go. It's really important with our everyday life and what happens outside of the skate park as well.\"\n\nEvery week the MacAskill family joins other families at one of Townsville's skate parks for the Sk8 M8s meetup. (ABC News: Baz Ruddick)\n\nAs Townsville's skate scene grows, Ms Johnson said the community she's helped foster is as rewarding as any medal or trophy.\n\n\"When our kids are at school, [parents] don't always get to see the kids achieving and learning ... whereas here they get to sit, to walk alongside them,\" she said.\n\n\"Seeing their own children start to really blossom and thrive … there's a real sense of pride and connection.\"\n\nA little push (with love)\n\nMr MacAskill said skateboarding was helping his daughters leave their comfort zones.\n\nSkylah became hooked on skateboarding when she discovered the skate park around the corner from her home. (ABC News: Baz Ruddick)\n\n\"They're going to be scared no matter what before they do a trick, so it's just about holding their hand and sort of pushing them,\" he said.\n\n\n\n\"Once they have had that little thrill they'll go back to it again and they'll start to pick it up.\"\n\nAva recently made the switch from scooters to skateboards. (ABC News: Baz Ruddick)\n\nHe said his daughters have started looking up to young female Olympic skateboarders like Sky Brown and Chloe Covell for inspiration.\n\n\"It'd definitely be cool if they pursue [competitive skateboarding], but if not we're still having good fun anyway,\" he said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/tyrone-rone-wright-new-mural-captures-geelong-faces/105762354",
    "title": "Renowned street artist paints a 90-metre love letter to Geelong",
    "publish_date": "Sat, 20 Sep 2025 21:10:14 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Georgia Gordon Rock never thought she'd have her face painted on the side of a building.\n\nBut after her dad sent her a link to an appeal for mural subjects in May, she became one of about 80 people to apply.\n\nNow, the 26-year-old's image is one of 14 being painted on the soon-to-be opened Nyaal Banyul Geelong Convention Centre.\n\nThe image of Ms Gordon Rock is about 6 metres wide and 6.5 metres high.\n\nIt's part of an 88-metre mural painted by globally recognised street artist Tyrone \"Rone\" Wright who grew up at Curlewis, near Geelong.\n\nStreet artist Rone wih Georgia Gordon Rock, one of 14 subjects of his latest mural. (Supplied)\n\n\"It's incredibly humbling. It's overwhelming in a really, really good way,\" Ms Gordon Rock said.\n\n\"My parents have lots of Rone's paintings all over their house so for them, it is quite a cool thing to have their daughter painted by him.\"\n\nThe subjects range from a one-year-old baby to a 96-year-old with the aim of representing Geelong's cultural and social history.\n\n\"I'm trying to have that transition from birth to death — that evolution of people living in Geelong and evolving here and growing,\" Rone said.\n\nAbout 80 people applied to be featured in the convention centre's mural. (ABC News: Jonathon Kendall)\n\nGlobal artist's local link\n\nThe subjects were chosen because of their links to the Geelong region.\n\nRone too has close links to Geelong. He grew up 20 kilometres away on the Bellarine Peninsula and has built an international career.\n\nExploring themes of beauty and decay, he has created public art in New York, Los Angeles, Paris, Berlin, London and Tokyo.\n\nThis portrait of 'Emma', a local chef, was painted in Gotthenburg, Sweden. (Supplied: Rone)\n\nHis work often includes images of female faces in urban areas, but this commission has been a bit different.\n\nThe first subject revealed was 88-year-old Ken Mansfield, who has been a member of the local Highton Rotary club for more than 50 years.\n\n\"It's quite surprising. I didn't expect to see my face as big as it is — something I've already had comments about,\" Mr Mansfield said.\n\n\"All in all, there are a fair few folks who have seen it and I would imagine there will be a few more yet.\"\n\nKen Mansfield was surprised by the scale of the work. (Supplied)\n\nHe is grateful to his daughter, Lisa Cunningham, who nominated him and is impressed with the progress.\n\n\"Until it's finished, we won't get a full appreciation of what it's like but it's looking very good,\" he said.\n\n'Representing something so much bigger'\n\nProject managers Plenary Conventions say Nyaal Banyul, meaning \"open your eyes to the hills\" in the Wadawurrung language, is the first convention centre in Australia designed from inception with traditional owners.\n\nThe centre is intended to encourage visitors to \"look deeply and appreciate the landscapes and history of Wadawurrung Country\".\n\nHalf of the 14 faces on the mural will be representatives of the seven Wadawurrung family lines, whose country stretches between Ballarat, Beaufort, Geelong, Torquay, Aireys inlet and Werribee.\n\nThe mural is on the back of Geelong's new convention centre on Smythe Street. (ABC News: Jonathon Kendall)\n\nOne of the Wadawurrung people featured is Danae Coots, who hasn't had her portrait painted on the wall yet.\n\nShe describes herself as shy and daunted by the prospect of being immortalised on a massive mural in the heart of Geelong.\n\n\"It took a lot for me to get to this stage. I'm doing this not as an individual — yes [it] will be my face up there, but my face is up there representing something so much bigger,\" Ms Coots said.\n\n\"I have a large and proud family right behind me. I'm here representing my family of the past, my family who are here with me today, and my family of the future.\"\n\nThe Indigenous influence extends to the colours being used. Rone was inspired by blue ochre used by Wadawurrung people.\n\nWadawurrung woman Danae Coots says the painting will represent her past, present and future family. (ABC News: Jonathon Kendall)\n\n\"We had to mix something like 126 colours to begin with and then just keep reducing them down to have seven tones for each portrait,\" the artist said.\n\n\"We ended up with a palette reduced down to 56 colours but if you look at the wall it feels like it's two tones,\" he said.\n\nThe mural is due to be finished next month and the convention centre is scheduled to open in July next year. It's something Ms Coots is excited about.\n\n\"I'll be looking forward to coming down here with my family, my children in particular,\" she said.\n\n\"I'm not sure how they are going to feel about their mum's face being so large, but hopefully it's something they'll take some pride in.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/jacinta-allan-victorian-premier-china-trade-talks-rail-tunnel/105795186",
    "title": "Premier Jacinta Allan has just been to China. What did her trip achieve?",
    "publish_date": "Sat, 20 Sep 2025 21:06:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Nearly 9000 kilometres is a long way to travel for a high-vis photo opportunity in front of a giant infrastructure project.\n\nBut on the final day of Jacinta Allan's whistle stop-tour of China, the premier did just that, standing in front of tunnel being dug under the city of Deyang in Sichuan province in the south-west of the country.\n\nIt had many of the hallmarks of a suburban press event in Melbourne.\n\nIn China, Ms Allan proudly announced her pet project back home, the Suburban Rail Loop (SRL), had ordered four more tunnel boring machines from a Chinese manufacturer whose machines have also been digging in Sichuan.\n\nThe SRL authority has purchased four new tunnel boring machines in China. (Supplied: Victoria government)\n\nBut it is unlikely the Victorian government would have enjoyed the cost comparison between the Chengdu SRL and Melbourne's rail project.\n\nThe 40-kilometre section of the Chinese rail project is being built for $US1.2 billion ($AUD1.8 billion) in under four years.\n\nMeanwhile, the first stage of Melbourne's SRL is estimated to cost $34.5 billion for 26 kilometres of twin tunnels, and is projected to be operational by 2035 — 13 years of construction. That price tag includes new stations, fit out and trains. China's $1.8bn is just the line construction but it's still remarkably cheaper.\n\n\"It tells us we have so much that we can learn,\" Ms Allan told reporters.\n\nAside from the tunnel photo opportunity, the premier's week in China revealed some of state's strategic ambitions with its largest trading partner.\n\nThe entrance to a rail tunnel in Deyang, Sichuan province, China. (Supplied: Victorian government)\n\nA week of high-level networking\n\nThroughout the week-long trip Ms Allan met with province governors and China's national education minister.\n\nIt is important access and a sign of respect which will help businesses and government strike future deals.\n\nJacinta Allan has spent a week in China meeting government and business authorities. (Supplied: Victorian government)\n\nMuch of the operation was about facilitating trade opportunities, and the state has a series of trade officers throughout China with full-time staff working to get Victorian products and businesses into China's vast market.\n\nThe China strategy Ms Allan launched on Monday night does not have a lot of concrete policy outcomes but it set the tone for ongoing trade talks.\n\nWhere it does make explicit its ambitions is to increase Chinese students numbers in Victoria — a challenge given the federal government's student cap.\n\nBut experts say fixing Victoria's problems are more pressing.\n\nPremier Jacinta Allan has been accompanied by several other Labor MPs and a travelling press pack from Melbourne. (Supplied: Victorian government)\n\nSwinburne University China expert John Fitzgerald told The Australian newspaper that reducing Victoria's rising crime rate would help boost Melbourne's credentials as a destination.\n\n\"Victoria has quality [education] providers, but the state's falling reputation for personal safety and security of property is under close critical scrutiny in Chinese-language media, much as it is in mainstream media,\" he told the newspaper.\n\n\"Any Victorian government planning to sell Victoria as the education state will have to deal first with its growing reputation as the crime state. The answer to that lies at home, not touring China.\"\n\nTackling that problem will also help her ambitions to double Chinese tourism to Victoria over the next five years.\n\nThe government is throwing plenty of promotional cash at the plan and has recruited popular local social media influencers.\n\nPremier Jacinta Allan was joined by singer Wu Chun, who is partnering with the Victorian government to promote tourism. (Instagram)\n\nWu Chun, a Bruneian singer who attended a Visit Victoria event and took a photo with the Ms Allan, declared himself \"Mr Melbourne\" to his nearly 13 million followers.\n\nAllan pursues China amid complexity\n\nMaking Melbourne attractive in advertising is one thing, but making it attractive in reality is another.\n\nThe week-long mission was full of positive news, and was a great opportunity for Ms Allan and a small caucus of backbenchers to take selfies and photos to show off to Chinese Victorian constituents.\n\nVoters struggling with cost-of-living and crime fears are unlikely to be thrilled with the pictures or the price tag.\n\nA trip for Allan, her staff and a team of government officials would have cost taxpayers ten of thousands of dollars. The ABC and other travelling media paid their own way.\n\nJacinta Allan has visited a zoo in Sichuan province, south-western China. (Supplied: Victorian government)\n\nThere are also outstanding questions about whether Ms Allan's affinity with China will mean voters continue to associate her with the former premier Daniel Andrews, whose legacy has damaged by his recent trip to the superpower.\n\nMr Andrews was always supportive of China, and his relationship and status has clearly been valued in Beijing, given he was invited to President Xi Jinping's big parade earlier this month.\n\nPandas were on the itinerary on day 5 of the premier's trip. (Supplied: Victorian government)\n\nMr Andrew's foray back into the spotlight was problematic for Australia's foreign policy, which walks a narrow path between economic co-operation and security concerns.\n\nMs Allan won't comment on foreign policy, because that's Canberra's job, but by visiting China she is stepping into a very complex relationship.\n\nOne that she believes, and hopes, will continue to be good for the state.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/chronic-pain-in-children-parent-carer-productivity-impacts/105789208",
    "title": "How a playground injury changed a family's entire life",
    "publish_date": "Sat, 20 Sep 2025 21:04:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Six years ago, nine-year-old Cooper Smylie tripped and fell in the school playground.\n\nAs far as he can recall he did not draw blood or graze his knee, so he got up, dusted himself off and kept running.\n\nThree days later, Cooper woke up with what his mum, Melinda Smylie, described as \"screaming pain\" in his foot.\n\n\"[It was] a burning pain … where you get real stabbing shocks,\" Cooper, now 15, said.\n\n\"It just sort of doesn't really go away ever.\n\n\" My foot always feels like outrageously warm or like it's on fire. \"\n\nIt took years of appointments and scans for Cooper to be diagnosed. (Supplied: Melinda Smylie)\n\nIt would take years of appointments and tests before Cooper, then living in Newcastle, was diagnosed with complex regional pain syndrome (CRPS).\n\nIt was a chance meeting with an orthopaedic surgeon who walked into the wrong room that led to the diagnosis.\n\nMelinda and Cooper with Frankie the therapy cat. (Supplied: Melinda Smylie)\n\nThere has never been a clear explanation as to why Cooper developed the condition, which is caused by a malfunction in the nervous system.\n\n\"When your child's in so much pain and there's no clear answers, that's really awful and heartbreaking as a parent,\" Ms Smylie said.\n\nThe Smylie family made the decision to pack up their lives and travel the country after Cooper's diagnosis. (Supplied: Melinda Smylie)\n\nMs Smylie reduced her hours at work to be by Cooper's side for many hours of occupational and speech therapy, physiotherapy and scans.\n\nWhen managing appointments, homeschooling Cooper – who could no longer go to school – and caring for his younger brother got too much, she quit work and gave up her \"career aspirations\".\n\nMs Smylie's husband, Robert, extended his hours as a construction supervisor to make up the difference.\n\nThe family sold their home, downsizing substantially in order to be able to afford to keep up with the cost of a private paediatric pain specialist.\n\nMs Smylie said she would do it all again in a heartbeat, but acknowledged the financial and emotional toll.\n\nThe impact of pain on Cooper's leg. (Supplied: Melinda Smylie)\n\n'A full-time job'\n\nAccording to the latest survey from Chronic Pain Australia, which will publicly release its first report focused specifically on children on Monday, about 20 per cent of parents caring for a child with chronic pain resign from work entirely and 5 per cent lose their jobs.\n\nThe survey heard from 229 families across the country and found that nearly half of parents adjusted their working hours.\n\nThirty per cent reduced their working hours or took unpaid leave.\n\nNicolette Ellis says caring responsibilities disproportionately fall to women. (ABC News: Curtis Rodda)\n\nThe advocacy group's chair, Nicolette Ellis, said caring responsibilities disproportionately fell to women and cost, according to \"conservative estimates\", as much as $15.8 billion a year in productivity.\n\nThat figure was based on an average annual wage of $50,000 and the findings of the survey.\n\nProfessor Fabrizio Carmignani from the University of Southern Queensland's business school said other studies had shown chronic pain cost between 3 and 5 per cent of the gross domestic product per year.\n\n\"We are talking about, really, billions of dollars and a large share of these costs are effectively related to productivity loss,\" he said.\n\nProfessor Carmignani said chronic pain impacted the economy at the macro and micro levels, with household budgets also under pressure from paying for medications and healthcare.\n\nHe said the cost was anticipated to grow because more people were expected to experience chronic pain over time.\n\nWhat life with chronic pain is really like Photo shows A woman with long black hair standing expressionless in front of a curtain Chronic pain is the norm for millions of Australians, but sufferers and advocates say misconceptions are rife. This is what their lives are really like.\n\nMs Ellis said finding out that 5 per cent of people reported losing their jobs due to their caring responsibilities was \"really scary\".\n\n\"Many of the parents we're talking to are saying [that] trying to navigate the healthcare system, the education system, is just completely overwhelming and becomes a full-time job,\" she said.\n\n\" This highlights the urgent need for service planning and investment that matches the prevalence of chronic pain in children. \"\n\nMs Ellis said that was particularly true given that it took three years on average to get a diagnosis, along with the difficulty of accessing services and support.\n\nChronic pain has impacted all aspects of Eliza Lawrence's life, including her education. (Supplied: Eliza Lawrence)\n\nDriven to the brink\n\nUniversity student Eliza Lawrence, 19, has been managing chronic pain for about half a decade.\n\nHer journey began with a knock during a soccer game and it took three years for the Brisbane teenager to be diagnosed with scoliosis and Scheurmann’s disease.\n\nThat led to her withdrawing almost entirely from school, losing friends and feeling she was not believed or understood, which severely impacted her mental health.\n\nAn admission to a complex pain program a few years ago helped enormously, but the pain has remained is something Eliza has to manage and speak up about.\n\nKim Lawrence says it has been frustrating to watch her daughter struggle. (Supplied: Eliza Lawrence)\n\n\"To this day there are some points in time where I can't sit up and study,\" she said.\n\n\"I'm physically in so much pain that my brain stops working and my body stops functioning.\n\n\"I'm angry and upset.\"\n\nHer mum, Kim Lawrence, said watching her daughter suffer and struggle for answers was \"tedious and traumatic\".\n\nAfter Eliza's diagnosis, Kim switched to part-time work, taking a day off each week to take Eliza to her appointments.\n\n\"I had to be available to take her to those … she was so distressed,\" Kim said.\n\n\"She was at a place where she was thinking about suicide and all sorts of terrible things at the age of 13 or 14.\n\n\" We're lucky we were in the position to be able to do that for her. \"\n\nNow studying business management and design at the University of Queensland and holding down a part-time job, Eliza is looking to the future, albeit with some trepidation about finding an inclusive workplace.\n\nWorking for the first time has proven \"challenging\" as the long hours on her feet can exacerbate her condition.\n\nEliza is also worried about being able hold down an office job because sitting for long periods can increase her pain.\n\n\"I've come to the conclusion that the only way I can do that is by working for myself and creating my own business,\" she said.\n\nLoading YouTube content\n\nMoving forward on the road\n\nFor the Smylies, life looks very different now than it did when they were spending all their time in hospitals looking for answers.\n\nYoung fisherman with a painful incurable condition Photo shows A boy sits and looks into the distance Cooper Symlie is an angler at heart. Despite a rare condition which causes painful reactions to stimuli like water and air, he's relentless in his pursuit of the catch of the day.\n\nThey have downsized even more and are in their third year of travelling the country in a caravan, seeking out warmer climates where Cooper's pain is less severe.\n\n\"We needed to reconnect as a family, because the pain took such an emotional toll on all of us that we needed to find a way to move forward again,\" Ms Smylie said.\n\nShe runs her own business from the road, which she says gives her her own sense of purpose while juggling family life and appointments.\n\nMs Smylie says her son's \"strength and willingness to never give up\" are crucial for managing the pain he is in.\n\nCooper says fishing helps him relax and manage his pain. (Supplied: Melinda Smylie)\n\nPain medication has never helped Cooper, but he finds solace in his cat and fishing, which has also catapulted him to online fame.\n\n\"It's kind of like my sport,\" he said.\n\n\"It's a therapeutic thing that I can just go out and [do] and relax.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-21/scrubs-reboot-the-pitt-cheat-sheet/105793612",
    "title": "Scrubs is getting a reboot just in time for the hospital procedural revival",
    "publish_date": "Sat, 20 Sep 2025 21:02:49 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Welcome to Cheat Sheet, where we give you all the intel you need about iconic shows your friends have been bugging you to watch! In honour of the recent announcement of its imminent reboot and the hospital procedural being back in fashion after The Pitt's Emmy wins, this month we're looking at beloved medical sitcom Scrubs.\n\nIt was at the inception of Scrubs that creator and show runner Bill Lawrence solidified his \"no assholes\" rule on set.\n\nFast facts about Scrubs What: A hospital procedural show with the right mix of realism, narrative and surreal comedy Starring: Zach Braff, Donald Faison, Sarah Chalk, Ken Jenkins, John C McGinley, Judy Reyes, Neil Flynn Created by: Bill Lawrence (Ted Lasso, Shrinking) Where: Available to stream on Stan and Disney+ (but if you can get your hands on DVDs that's even better) Likely to make you feel: Like you're part of a hilarious family\n\n\"[It's] one thing that got burned into my head from personal experience,\" he said in a 2009 interview.\n\n\"I am not going to ever work with or promote the careers of people that act shitty to people who are beneath them on the totem pole.\"\n\nHe didn't want the people he made TV with walking on eggshells; rather, he simply wanted everyone to come to work and be nice to each other.\n\nIt's an ethos that spilled into his then-new medical comedy — Scrubs, which was about to reinvigorate the hospital sitcom with undeniable proof that you can balance realistic medical drama with surreal humour and genuine heart.\n\nLawrence's future shows, too, would become known for their cockle-warming abilities.\n\nEverything you need to know about Ted Lasso, the charming sports comedy with 20 Emmy nominations Photo shows A 40-something man with a moustache smiles while seated at a press conference in front of one red and one green microphone. With 20 Emmy nominations, this is the heartfelt comedy you need to catch up on.\n\nHis kindness-first attitude shone the brightest in soccer comedy Ted Lasso, which was universally praised for its undeniable niceness in every episode. It garnered 20 Emmy nominations in its first season — more than any new show in the awards' history, at the time — and walked away with seven statues.\n\nShrinking, Lawrence's examination of grief and humour through the eyes of a therapist enjoyed a similar critical reception and a swathe of awards.\n\nBut Scrubs, despite being off-air now for 15 years, takes up a particularly special space in the minds of fans.\n\nCreator Bill Lawrence (left) at the 2018 Scrubs cast reunion. (Getty: Joe Scarnici)\n\nFrom 2001 to 2010, Scrubs navigated a changing sitcom landscape, being turfed by its network, enduring the 2007 writers strikes and an ill-fated ninth season with a brand new cast. In 2025, it still has a firm grip on a loyal fanbase — just look at Zach Braff and Donald Faison's hugely popular Scrubs rewatch podcast.\n\nThis year, fans' prayers have been answered with US network ABC announcing a Scrubs reboot. Most of the show's core cast — including Braff and Faison — are confirmed to be returning to a season that's slated for 2025-2026 US TV season.\n\nHere's what you need to know before we re-enter the world of Scrubs.\n\nWhat is Scrubs about?\n\nScrubs follows the lives of the medical staff at Sacred Heart Hospital.\n\nProtagonist JD (Braff) is a 20-something intern terrified to enter the workforce, alongside his long-time best friend and surgeon-in-training, Turk (Faison), and neurotic internal medicine intern Elliot (Sarah Chalk).\n\nNeil Flynn's janitor character (centre) became a main cast member because Lawrence loved his work so much. (Getty: Chris Haston/Disney General Entertainment Content)\n\nRounding out the main cast are belaboured nurse Carla (Judy Reyes), hardened resident Dr Cox (a terrifying John C. McGinley), checked-out Chief of Medicine Dr Kelso (Ken Jenkins) and Janitor (Neil Flynn), the hospital's delightfully unhinged custodian who never reveals his name.\n\nJD's internal monologue runs throughout the show. It serves as both narration and a portal to the more surreal comedy of Scrubs; his absurd daydreams frequently puncture the real world action, as the core characters navigate the demands of a public hospital (the show was filmed in a real abandoned hospital, giving it a grimy realism).\n\nAdding colour to Sacred Heart is a revolving cast of supporting characters from sad sack lawyer Ted (Sam Lloyd, RIP) and his ever-present acapella band, to Dr Mickhead (Frank Cameron), who began life as a throwaway punchline (you'll never guess what the interns call him).\n\nAlthough superficially a sitcom, Lawrence reinforces his comedic foundations with poignant, but never sappy, ruminations on the fragility of life, the importance of community and the impossible tasks asked of healthcare professionals.\n\nThe Impact of Scrubs\n\nIn a sea of dramas, comedies and reality shows set in hospitals, Scrubs often rises to the top in terms of accuracy. Although Scrubs ended in 2010 after nine seasons, a 2006 episode titled My Cabbage went viral during the COVID-19 pandemic for its simple, visual explanation of how infections spread.\n\nDuring its run, Scrubs writers were praised for not just seeking the consultation of real doctors, but because the show accurately represented the heartbreaking reality for those working within America's strained healthcare system.\n\nThe Pitt, Adolescence and The Studio win big at the Emmys Photo shows A woman and two men pose with Emmy awards The Pitt wins Best Drama at the 77th Annual Primetime Emmy Awards, with The Studio, Adolescence and even Stephen Colbert walking away as the biggest winners of the night.\n\nPatients are bumped from medical trials in favour of hospital donors, best efforts are thwarted by death's power, colleagues break under pressure and then come back to do it all again tomorrow.\n\nThrough it all, Lawrence made sure to shine a spotlight on the invaluable relationships formed within hospitals in order to deal with it all.\n\nThe real situations, real relationship formula echoes in television even to this day in more dramatic fare like The Pitt, which just picked up the Emmy for Best Drama — and paved the way for a Scrubs reference.\n\nScrubs was also responsible for elevating numerous musical artists with their deft music supervision. Lawrence encouraged cast and crew to submit their favourite songs, with Braff and cast member Christa Miller selecting a number of tracks.\n\nWhen Scrubs moved to streaming platforms fans were quick to notice that much of the music had changed from the original broadcast.\n\nBraff confirmed in a now-deleted Tweet that this was due to the broadcast music licences not extending to streaming services, highlighting the ongoing issues with streamers and music licensing.\n\nIn a 2024 interview with LA Times, Lawrence said he was committed to having the original music restored.\n\nFive essential Scrubs episodes\n\nMy Old Lady (Season 1, Episode 4)\n\nThis early series episode opens with a shocking statistic: one in every three patients admitted to a hospital will die. Then we cap cut to Turk, JD and Elliot welcoming three new patients to Sacred Heart.\n\nAs wobbly interns, our core three try to do best by their patents, but they make some misguided decisions, all while the spectre of death hangs over the audience. With My Old Lady, Scrubs established itself early as a sitcom that was going to rip your heart out.\n\nMy Screw Up (Season 3, Episode 14)\n\nScrubs had its fair share of A-List guest stars, including Colin Farrell, Elizabeth Banks and Michael J Fox. But ask any fan their favourite and good chances they'll tell you it was a peak early-career Brendan Fraser as Dr Cox's brother in law/best friend, Ben.\n\nMy Screw Up is not Fraser’s first time guest starring but it contains some of his most brilliant work as goofy, stubborn, immature, loveable Ben. Just be careful how deeply you fall in love with him. Let’s just say, you’ll never hear Winter by Joshua Radin the same way again.\n\nMy Life in Four Cameras (Season 4, Episode 17)\n\nScrubs is not a traditional sitcom, which is why it's so delicious to see it be treated as one in this very special episode. Sitcom mega-fans Turk and JD freak out when (fake) Cheers writer Charles James is admitted to the hospital.\n\nAfter finding out his diagnosis is more serious than first thought, the dull realism is flipped to a colourful, multi-camera set up where all the women are in skimpy skirts and the biggest problem is winning $27,000 at the big hospital talent quest. Scrubs cheekily ribs the cheery optimism of the TV of yore, while reminding the audience that it's because life can be unfair and depressing that we need happy-ending sitcoms.\n\nMy Lunch (Season 5, Episode 20)\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\nThroughout the whole series, Dr Cox is established as not just JD's mentor (as much as he denies it) but as the paternal figure that watches over Sacred Heart's workers. Yes, he constantly berates those around him and is stubborn to a fault, but he is also fiercely protective of his underlings, and always ready with an answer that serves the ultimate good.\n\nMy Lunch deals with the sticky conundrum of what happens when the infallible make an honest mistake. The first two acts of the episode are stuffed with Scrubs' regular humour but it's the final act, with a stunning performance from John C. McGinley, that elevates the episode to must-see.\n\nMy Musical (Season 6, Episode 6)\n\nMany shows have attempted musical episodes. Many have failed. Scrubs is not one of these shows. Already so sharp when it came to music supervision, the show one-upped itself by pulling off a full Broadway-style musical with the help of Avenue Q luminaries Jeff Marx and Robert Lopez. Through the eyes of a patient with a mysterious neurological condition that causes her to see everything in song, Scrubs rolls out banger after banger on everything from stool samples to maternity leave to guy love.\n\nTender, hilarious and an opportunity for the more musically-inclined cast members to show off their talents, there is a reason this episode was nominated for five Emmys.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/inside-atlassian-s-revolutionary-habitat-tower-built-for-the-future-of-work-20250911-p5mubw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Atlassian’s revolutionary ‘habitat’ tower, built for the future of work",
    "publish_date": "Sun, 21 Sep 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Linda Morris"
    ],
    "text": "Behind scaffolding and cranes, the new $1.45 billion futuristic headquarters of the homegrown tech giant Atlassian is fast rising high above Central Station.\n\nBuilt of green concrete, timber and structural steel to cement its world leading climate-friendly credentials, Atlassian Central is also revolutionary for its vision of what high-rise office work might look like in the future.\n\n“We’re not just putting up another office tower,” Atlassian’s chief executive and co-founder, Mike Cannon Brookes said. “We’re rethinking what a workplace can be. It’s sustainable design at global scale, right here in Sydney. One that’s greener, smarter, and built for how teams actually work today.”\n\nCo-owners Dexus and Atlassian unveiled on Friday the first worker-friendly timber “habitat” within what will become the world’s tallest hybrid commercial tower, the tallest high rise in the city’s southern precinct and the anchor of Sydney’s newest technology precinct, known as Tech Central.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/rugby-championship-to-be-turfed-under-massive-sanzaar-tours-shake-up-20250921-p5mwpm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby Championship to be turfed under massive SANZAAR tours shake-up",
    "publish_date": "Sun, 21 Sep 2025 11:51:42 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "New tours era set to replace Rugby Championship\n\nThe Rugby Championship will not take place next year, and the current format of the competition is unlikely to be played again until 2029, the Herald understands. As has been well signposted, the All Blacks are heading to South Africa next year for a seven-game tour featuring matches against the Bulls, Stormers, Sharks and Lions, as well as three Tests – with a fourth Test to be tacked on at the end in Europe.\n\nThat will replace the Rugby Championship in 2026, but plans are also afoot for tours involving all four SANZAAR nations in 2028. The Wallabies are set to play two three-Test series in 2028, meaning they could either head to New Zealand for three Tests or host the All Blacks, followed by a similar arrangement with either South Africa or Argentina.\n\nThat would mean no Rugby Championship in 2026, a shortened version in 2027 (a Rugby World Cup year), and again no Rugby Championship in 2028 – before a resumption of the current format in 2029.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/australian-slams-57-ball-ton-against-india-as-records-tumble-in-crazy-runfest-20250921-p5mwp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian slams 57-ball ton against India as records tumble in crazy runfest",
    "publish_date": "Sun, 21 Sep 2025 11:23:42 +1000",
    "category": "sports",
    "authors": [],
    "text": "Australia’s Beth Mooney crunched a century in 57 balls, only to be outdone by Indian opener Smriti Mandhana who hammered her own hundred from just 50 balls.\n\nBut Mooney’s 75-ball innings of 138 set the platform for a mammoth total of 412, and a 43-run victory in the third ODI, sealing a series win for Australia.\n\nBeth Mooney slammed a 57-ball ton. Credit: Getty Images\n\nThe match was one of the craziest in women’s ODI history - if anything Australia left some runs out there after failing to bat out their 50 overs in setting a target that was ultimately too great for India.\n\nHere are some of the remarkable achievements in Delhi, which set an intriguing tone for the women’s world cup, which begins in India on September 30.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/afl/star-magpies-the-club-should-move-on-from-according-to-lloyd-20250921-p5mwpr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star Magpies the club should move on from according to Lloyd",
    "publish_date": "Sun, 21 Sep 2025 11:19:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "Star Magpies the club should move on from according to Lloyd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/only-get-respect-with-a-premiership-mulitalo-says-one-way-to-silence-sharks-doubters-20250921-p5mwns.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Only get respect with a premiership: Mulitalo says one way to silence Sharks doubters",
    "publish_date": "Sun, 21 Sep 2025 11:02:41 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "The Sharks are through to their second straight preliminary final and have finally earned the respect they have craved from the outside world.\n\nBut Cronulla winger Ronaldo Mulitalo said the doubts about Cronulla’s title credentials will remain until they win a premiership, which is now only 160 minutes away from becoming a reality.\n\nMulitalo was one of the many standouts for the Sharks as they trounced Canberra 32-12 in their own backyard to set up a preliminary-final showdown with Melbourne on Friday night.\n\nThe Sharks have played finals footy for the last four seasons but with only one win from five games prior to this season, never made it past the preliminary final; a 26-6 loss to Penrith last year. It led to star Nicho Hynes saying last week the Sharks don’t “get any respect – ever”.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/europe/duchess-of-york-wrote-to-supreme-friend-epstein-after-vow-to-cut-contact-20250921-p5mwpf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Duchess of York wrote to ‘supreme friend’ Epstein after vow to cut contact",
    "publish_date": "Sun, 21 Sep 2025 10:59:30 +1000",
    "category": "finance",
    "authors": [
      "Hannah Furness"
    ],
    "text": "London: Sarah, Duchess of York, wrote to disgraced financier Jeffrey Epstein, calling him a “steadfast, generous and supreme friend” after claiming she had cut ties with him, according to an email obtained by newspapers.\n\nThe email, published by the Sun on Sunday and Mail on Sunday, shows the duchess contacting Epstein in 2011, after he was convicted of procuring a child for prostitution.\n\nThe duchess had given an interview in March that year, apologising for the “terrible, terrible error of judgment” in associating with him and accepting his money, promising she would have “nothing ever to do” with him again. But in April, according to the emails, she sent Epstein a message “from the truth of my heart”, saying she must “humbly apologise”.\n\nSarah, Duchess of York, and Prince Andrew, Duke of York, at a requiem mass for Katharine, Duchess of Kent, last week. Credit: Getty Images\n\n“I know you feel hellaciously let down by me,” she wrote, insisting that she had not used the “P word” [paedophilia] in her interview condemning him. “You have always been a steadfast, generous and supreme friend to me and my family.”",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/not-your-typical-running-club-the-nudity-is-the-giveaway-20250921-p5mwp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not your typical running club (the nudity is the giveaway)",
    "publish_date": "Sun, 21 Sep 2025 10:53:05 +1000",
    "category": "entertainment",
    "authors": [
      "Chantal Nguyen",
      "Peter Mccallum"
    ],
    "text": "Runnicles brought forth the gently surging pulsations of the opening with quiet buoyancy, and the ensuing woodwind idea entered brightly but at a distance. The violins, under concertmaster Andrew Haveron introduced more urgent animation and captured a point of vertiginous intensity at the climactic point of the phrase, as though arriving at a breathtaking panorama.\n\nDonald Runnicles and the Sydney Symphony Orchestra gave a glowing performance of Sibelius’s Symphony No. 2, shaping its abundant melodic riches with warmth and an astute understanding of the way its lapidary structure unfolds. This is a work whose revelations creep up on you, like an unexpected tree or vista on a walk, only to recede just as quickly.\n\nThe slow movement was dark but never self-indulgent. The portentous bassoon solo (Matthew Wilkie) emerged over the top of an almost inaudible plucked tread from cellos and basses as though a thought had suddenly crystallised. But perhaps the symphony’s most beautiful moment was the oboe theme (Shefali Pryor) ushered into the middle section of the third movement, which, up to this point had bristled with scurrying energy from the strings.\n\nThis melody is of such disarmingly simple beauty, one scarcely notices that it is built on themes of the first movement, including the symphony’s opening notes. This is perhaps the kind of integration Sibelius was referring to when he later remarked to Gustav Mahler that what he liked about symphonic works was the profound logic that created an inner connection between its motives (Mahler famously answered, “No, the symphony must be like the world”).\n\nFor the finale, Sibelius conceived two imposing but contrasting ideas, the first of surging exaltation, the second of implacable sternness and quiet resolve that grows to become overwhelming. Runnicles guided both so that the expressiveness was exhilarating, but never over-inflated.\n\nThe danger of arriving at the closing passages with the feeling that all the fireworks have already been let off, which is sometimes a problem with this work in less experienced hands, was avoided here and the performance closed in radiant magnificence.\n\nBefore this, Runnicles and the SSO articulated the tempestuous outer textures and tender contrasting cor anglais melody (Alexandre Oguey) of Wagner’s Overture to the Flying Dutchman with musicianly care, moulding brass chords carefully so the turbulence was incisive but not allowed to unbalance the texture or run amok. The program is repeated on Friday and Saturday with the added bonus of mezzo-soprano Sasha Cook in Elgar’s Sea Pictures.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/welch-unpacks-where-it-went-wrong-for-canberra-20250921-p5mwpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Welch unpacks where it went wrong for Canberra",
    "publish_date": "Sun, 21 Sep 2025 10:08:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "Welch unpacks where it went wrong for Canberra\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/a-dedicated-window-how-indian-premier-league-investors-would-seek-to-transform-australian-cricket-20250827-p5mq9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A dedicated window’: How Indian Premier League owners would seek to transform Australian cricket",
    "publish_date": "Sun, 21 Sep 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "However, KKR group boss Mysore explained in an exclusive interview with this masthead that he and other potential investors would want an exclusive window for all players to appear in the entire BBL tournament, plus the right to rename and rebrand teams to give them higher visibility in India. Loading He said any overlap between Test cricket and the T20 league would be a red line for many potential investors. This would leave Cricket Australia with a huge challenge around how to structure the summer while preserving the things that matter to Australian cricket fans; the Boxing Day and New Year’s Tests. Mysore said it was unlikely that Indian investors with IPL teams in their stables would be content to buy into the BBL as passive participants. They would want a say in the name and branding of the teams, player availability, match timeslots and calendar windows.\n\n“Sustained interest in the league will depend on the availability of all local and foreign players,” Mysore said. “The two key components are a dedicated window, without any clashes with other leagues, and full availability of local players.” However, there is a contrast between investors, like KKR group or Mumbai Indians group – owned by the multi-billionaire Ambani family – and so-called “tech titans” based in the United States. A group of these tech moguls recently paid $300 million for a 49 per cent stake in the London Spirit franchise based at Lord’s. Some investors may be content simply to buy in because of the prestige. But already, the Hundred has been criticised by new franchise owners because the ECB rested some Test players from the early rounds following their exhausting drawn Test series against India.\n\nAt the same time, franchises are in the process of being renamed. BBL clubs, such as the Melbourne Stars and Sydney Sixers, have been described as “trophy assets” that investors will want to buy into simply to be associated with legendary venues, such as the MCG, SCG or Adelaide Oval. The continued appeal of the BBL was on show at Ninja Stadium in January when Mitch Owen powered the Hobart Hurricanes to victory over Sydney Thunder to claim the title. Credit: Getty Images But Mysore says investors expecting a return will be looking for ways to be actively involved. That is certainly the case for KKR, who would want to have a team named Melbourne or Sydney Knight Riders, branded in the group’s purple and gold colours, and involving players like Sunil Narine, who already have year-round deals with KKR.\n\n“Knight Riders were the first to conceive of and execute on a global brand strategy,” Mysore said. “It has become a genuine global brand that has also globalised our fan base.” CA says the Big Bash League is in good health, though still down on its peak season in 2016, when more than 80,000 people turned up for a Stars-Renegades derby at the MCG. AT the peak of its popularity, the BBL drew 80,000 fans to the MCG for a Melbourne derby in January 2016. Credit: Daniel Pockett - CA/Cricket Australia via Getty Images In those days, the BBL was seen as the world’s second-best T20 league behind the IPL, but since then, the franchise market has exploded. There are now major leagues in South Africa and the UAE competing for players at the same time as the BBL, in addition to those in India, the West Indies, England and the United States.\n\nThis growth has provided unprecedented opportunities for players to make millions, and demonstrated how much private capital is potentially available to cricket in Australia, should CA and the states finally decide to take the plunge. CA says the windfall would help supercharge the Big Bash, including a handsome increase to the salary cap to keep the best players from absconding to other leagues, and flow through to the grassroots. “My experience with privately owned teams is, if done right, it’s a really good thing for the sport,” said Australian Test captain Pat Cummins, who was purchased by Sunrisers Hyderabad at the 2024 IPL auction $3.7 million. “You look at an IPL team that’s privately funded, and the amount they put into the team and programs, they do their own development camps and their own talent pathway and academies.\n\n“Our IPL team we have a social media team of about 30 people who travel around, so there’s things that can get unlocked that make the experience better for fans. Then the big question is how do you use those funds to make sure that cricket’s in a really good spot and supporting community cricket as well as professional cricket.” But these leagues are not without their problems. The SAT20 is the third attempt by Cricket South Africa to grow a healthy franchise competition, jointly owned by pay TV service Supersport and a conglomerate of Indian investors. South Africa’s wider economic struggles, particularly in terms of the value of the Rand, is costing millions for team owners each year. Mysore was not shy in saying that there is something of a bubble about the growth of franchise leagues, up to and including the lofty sums paid for teams in the Hundred. “The financial viability in the medium to long term is a very important component,” Mysore said. “In the event that leagues are not financially viable, the future of those leagues will be questioned.”\n\nThe BBL is an attractive proposition for investors, given its history of relative financial success and the fact it is underpinned by Cricket Australia’s place as one of the “big three” nations alongside India and England. But much of the BBL’s strength has derived from taking a very different approach to the franchise model. The tournament co-exists with Test cricket, especially around Boxing Day and New Year, and does not rely on the presence of Cummins, Travis Head or Mitchell Starc playing its full duration. Mysore with established Knight Riders player Sunil Narine. Credit: NurPhoto via Getty Images In turn, that has allowed the Australian Test team to perform at a consistently high level with minimal disruption from the T20 circuit. It’s a dynamic that relies upon a shared sense of purpose between Cricket Australia and the states, who control the BBL teams. CA’s chief executive Todd Greenberg and chair Mike Baird have met with their state association counterparts over the past two weeks in attempts to thrash out details of a potential sale, but are yet to reach consensus. The states hold 30-year licences to the clubs, with a 15-year review clause that comes into effect next year.\n\n“That’s what we’re considering,” Baird told this masthead. “If you did consider private investment, what are the key criteria we would keep. “To individual teams and owners and what they might want, any sort of criteria, that is for us to consider and set the criteria. If we want to make the decision to consider private investment, it would be done on our terms, and done collectively. “The risks and challenges we’ve seen across the world. The beauty is we can take the best of that and put in the terms and conditions that are important to Australian cricket.” Mysore has fond memories of watching Test matches in his hometown of Chennai every January, and respects the traditions of Boxing Day and New Year Tests in Australia.\n\nBut that respect will not stop Mysore and others from asking questions before they decide whether to buy a franchise. In the UK, team owners have pushed for the separate sale of broadcast rights for the Hundred, away from international cricket, so that the value of the tournament is more clearly known. While the big broadcast numbers attracted by the Boxing Day and New Year’s Tests are widely thought to aid the audiences for BBL games in the evenings, franchise owners will want to know which is helping which. Baird has stressed that CA and the states must retain control of whatever privatisation model is ultimately agreed. A decision is expected before the end of the year.\n\n“Certainly, we’d want to control the schedule,” Baird said. “So that Test cricket remains an essential part of the Australian summer.” Cummins said other nations would love to have the commercially successful Test series seen here. “It is a different model to a lot of other countries, but I think it’s a better model,” he said. “They wish they could have five Test matches sold out and everyone watched as well as the BBL. “It’s great we’ve got two tournaments that can run concurrently and there’s a place for both of them.” The global strategy becomes still more attractive if Indian players are available to play outside the IPL. So far, the BCCI has rebuffed inquiries by franchise owners about allowing more freedom of movement, but the recent decision of champion off-spinner Ravichandran Ashwin to quit the IPL and go “global”, potentially to the BBL this summer, shows that the mood is gradually shifting.\n\nMysore declined to comment on whether Indian players would be more freely available to play in overseas leagues in the future, but Baird said this week he was in constant discussions about the matter with Indian authorities. Loading The BBL was effectively bankrolled in its first two years by CA’s slice of the cash from the short-lived T20 Champions League. But in 2013 CA signed a deal with Ten for the tournament for about $100 million over five years. That figure grew again as part of a $1.18 billion overall deal with Foxtel and Seven in 2018, before the current $1.5 billion agreement was signed in 2023. Franchise owners will want a percentage of the broadcast rights value from any future deals. In the meantime, plenty have conveyed their interest to Cummins, over numerous seasons of the IPL. “Three or four of the IPL owners have been like, ‘oh we’d love to get involved’,” Cummins said. “A lot of Indian fans, they’ve grown up watching Australian cricket teams, and they hold Australian cricket in such high regard that the BBL is, in their eyes, a really attractive league they want to be a part of, and they want to be linked to Australian cricket.”",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/afl/lions-young-core-inspires-grand-final-hat-trick-and-they-just-gained-another-member-20250920-p5mwme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lions’ young core inspires grand final hat-trick – and they just gained another member",
    "publish_date": "Sun, 21 Sep 2025 09:53:52 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "For all the superstars who litter the Brisbane Lions’ ranks, at the heart of their charge to last year’s premiership was their quintet of emerging sensations.\n\nWill Ashcroft, Kai Lohmann, Logan Morris, Jaspa Fletcher and Darcy Wilmot triggered a season turnaround in 2024 to break a 21-year title drought. Levi Ashcroft then joined them this year as a star on the rise.\n\nBy Saturday’s preliminary final clash with Collingwood, the sextet had become a seven-man band.\n\nThe Lions’ Ty Gallop celebrates a goal during the preliminary final between Collingwood and the Lions at the MCG. Credit: AFL Photos via Getty Images\n\nTy Gallop was fresh off kicking his maiden AFL goal against the Suns when his vice-captain, Josh Dunkley, hinted that the 19-year-old was on the brink of a breakout performance.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/emma-s-insurance-costs-have-soared-fivefold-it-s-part-of-a-wider-problem-20250916-p5mvhb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Emma’s insurance costs have soared fivefold. It’s part of a wider problem",
    "publish_date": "Sun, 21 Sep 2025 09:40:20 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Insurance premiums have shot up around Australia in the past few years, but for Emma Jordan, the increase has been particularly severe.\n\nAfter her house was damaged in severe flooding of 2022, the 27-year-old says the annual cost of insuring her house in the Victorian town of Echuca skyrocketed from about $2000 three years ago to about $10,000 today, according to quotes she’s received.\n\nEmma Jordan’s insurance costs have surged roughly five-fold since flooding in 2022. Credit: Jason South\n\nThe cost is so high that Jordan’s biggest asset is currently uninsured, although she plans to reassess in the future and could instead take out partial cover for the house.\n\n“I haven’t taken up any insurance at this point because $10,000 a year on insurance isn’t really feasible,” Jordan says.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/optus-ceo-must-fall-on-his-sword-20250921-p5mwov.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Optus CEO 'must fall on his sword'",
    "publish_date": "Sun, 21 Sep 2025 09:20:09 +1000",
    "category": "finance",
    "authors": [],
    "text": "Optus CEO 'must fall on his sword'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw5-liverpool-vs-everton-20250921-p5mwop.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Liverpool vs Everton",
    "publish_date": "Sun, 21 Sep 2025 09:07:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW5: Liverpool vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw5-burnley-vs-nottm-forest-20250921-p5mwoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Burnley vs Nott'm Forest",
    "publish_date": "Sun, 21 Sep 2025 09:06:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW5: Burnley vs Nott'm Forest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw5-wolves-vs-leeds-20250921-p5mwor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Wolves vs Leeds",
    "publish_date": "Sun, 21 Sep 2025 09:06:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW5: Wolves vs Leeds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw5-west-ham-vs-crystal-palace-20250921-p5mwon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: West Ham vs Crystal Palace",
    "publish_date": "Sun, 21 Sep 2025 09:05:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW5: West Ham vs Crystal Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/cyberattack-on-european-airports/fr7ztrpmh",
    "title": "A cyber attack has hit some of Europe's busiest airports. Here's what you need to know",
    "publish_date": "Sun, 21 Sep 2025 00:55:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some of Europe's busiest airports including London's Heathrow have been affected by a cyber attack against a provider of check-in and boarding systems, causing flight delays and cancellations.\n\n\n\n\n\nBrussels Airport, Berlin Airport were both affected while Dublin Airport said it was also facing minor impact from the issue, along with Cork Airport, Ireland's second biggest after Dublin.\n\n\n\n\n\nAt Heathrow, Berlin and Brussels, dozens of flight departures and arrivals were cancelled, aviation data provider Cirium said. Officials in Brussels said there had been four flight diversions, as well as \"delays on most of the departing flights.\"\n\n\n\n\n\nBrussels Airport said it had asked airlines to cancel half of their scheduled departing flights on Sunday to avoid long queues and late cancellations, signalling that the disruption would continue through the weekend.\n\n\n\n\n\nThe disruption is the latest in a string of hacks targeting governments and companies across the world, hitting sectors from healthcare and defence to retail and autos. A recent breach at luxury carmaker Jaguar Land Rover brought its production to a halt.\n\n\n\nWhat was impacted in the cyberattack?\n\nThe attack affected the MUSE software made by Collins Aerospace, which provides systems for several airlines at airports globally.\n\n\n\n\n\nThe aviation tech company, which specialises in digital and data processing services, is a subsidiary of the American aerospace and defence group RTX, formerly known as Raytheon.\n\n\n\n\n\nRTX said it was aware of a \"cyber-related disruption\" to the software at selected airports, without naming them.\n\n\n\n\n\n\"The impact is limited to electronic customer check-in and baggage drop and can be mitigated with manual check-in operations,\" RTX said in a statement, adding that it was working to fix the issue as quickly as possible.\n\n\n\nPeople stand in a line to check in after the attack caused delays at Brussels International Airport. Source: AP / Harry Nakos A European Commission spokesperson said there were currently no indications of a \"widespread or severe attack\" and that the origin of the incident was still under investigation.\n\n\n\nWho was behind the attack?\n\nRTX did not give any information on who might be behind the attack.\n\n\n\n\n\nThese kinds of sweeping outages are typically the result either of ransomware attacks, where online extortionists paralyse corporate networks in the hope of payment, or deliberate digital sabotage.\n\n\n\n\n\nRafe Pilling, director of threat intelligence at cybersecurity company Sophos, said the impact of the incident highlighted \"the fragile and interdependent nature of the digital ecosystem underpinning air travel\".\n\n\n\n\"We've seen huge impact across retail and currently automotive in the UK this year,\" he said.\n\n\n\n\n\n\"The threat is significant and very real.\"\n\n\n\n\n\nSeveral breach-tracking websites have previously said that Collins Aerospace was hit by ransom-seeking hackers in 2023.\n\n\n\nAviation industry 'prime target' for cyber attacks\n\nCyber attacks and tech outages have disrupted airports around the world in recent years, from Japan to Germany, as air travel increasingly relies on online, interconnected systems.\n\n\n\n\n\nThe aviation sector saw a 600 per cent increase in cyber attacks from 2024 to 2025, according to a report by French aerospace company Thales released in June.\n\n\n\n\n\n\"From airlines and airports to navigation systems and suppliers, every link in the chain is vulnerable to attack,\" the report warned, pointing out that the strategically and economically important sector had become a \"prime target\" for cyber attacks.\n\n\n\nREAD MORE Fed up with flight delays? Passengers could soon get refunds under new scheme\n\nAviation expert Anita Mendiratta, who is also a special adviser to the secretary general of UN tourism, told Agence France-Presse it was difficult to know who was behind the attack.\n\n\n\n\n\nBut she stressed it was \"a disruption caused to a software not a specific airport\" and it was important to try to \"contain the contagion\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/heres-the-tea-global-shortage-means-steep-prices-for-matcha-lovers/mo2j9gaqg",
    "title": "Here's the tea: Global shortage means steep prices for matcha lovers",
    "publish_date": "Sat, 20 Sep 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"I have matcha every morning. It's actually my go-to drink. It is kind of how I start the day.\"\n\n\n\n\n\nMelissa Lindsay is a customer of Asha Tea House in San Francisco.\n\n\n\n\n\nThe owner is David Lau.\n\n\n\n\n\n\"So matcha is a stone milled green tea. It's actually a tea powder and instead of drinking an infusion of the tea leaf with hot water, you're consuming the entire leaf.\"\n\n\n\n\n\nThe GS Haly Company is one of the organisations that supplies matcha to shops like this.\n\n\n\n\n\nSenior Tea Buyer Aaron Vick says matcha has traditionally been used in Japanese tea ceremonies, but now is being mass-consumed in drinks and desserts across the globe.\n\n\n\n\n\n\"Matcha has long been an important ingredient for baked goods, for confectionary, candies.\"\n\n\n\n\n\nIn fact, matcha has been hailed as a superfood, splashed across social media in bright green lattes, and embraced by cafes from Tokyo to Los Angeles.\n\n\n\n\n\nRecently however, Aaron Vick says there have been issues brewing on the horizon: because this year’s harvest simply can’t keep up with the global craze.\n\n\n\n\n\n\"There is limited supply, not due to lack of innovation or ambition, but simply there's only so much tea grown in Japan.\"\n\n\n\n\n\nAaron says these supply issues, coupled with the popularity of matcha itself, has seen prices spike.\n\n\n\n\n\nIn fact, prices for matcha are surging worldwide, with Japanese matcha, known for its quality, set to jump by up to 70 percent this year.\n\n\n\n\n\n\"We've always been saying matcha is growing, but certainly within the last one or two years there has been exponential unprecedented growth in demand.\"\n\n\n\n\n\nDavid Lau can attest to that.\n\n\n\n\n\n\"The price has skyrocketed. For us it's more than doubled; and we weren't expecting that at all. Our matcha drinks, we sell them in the hundreds every day. And we go through many hundreds of kilograms every month or two. Yeah, it's a lot of matcha.\"\n\n\n\n\n\nLarry Tiscornia teaches traditional Japanese tea service lessons - and he has also seen a change.\n\n\n\n\n\n\"My wife and I teach privately weekly and we have students that come and learn how to do the tea ceremony. People are going at these tea stores and they're limited to like one small 20-gram can. But one year ago you could go in and buy hundreds of grams of tea. So it's very bizarre.\"\n\n\n\n\n\nThe spike in pricing is being fuelled by poor weather in Japan, as well as labour shortages in both Japan and China.\n\n\n\n\n\nThe Japanese government has been trying to help, offering support to tea growers through funding, equipment - and even counselling - to encourage a shift from regular sencha tea to matcha.\n\n\n\n\n\nSince 2008, production of tencha, the leaf used to make matcha, has nearly tripled - and exports to the US now account for about a third of Japan’s total tea exports.\n\n\n\n\n\nBut whether that's enough remains to be seen.\n\n\n\n\n\nAaron Vick says says US tariffs are adding even more pressure: there's 15 percent duties now on Japanese matcha and nearly 38 percent on matcha from China.\n\n\n\n\n\n\"The cost increases that we have been discussing up to now have been purely derived from supply and demand situation and the shortage of available leaf against the sudden extreme popularity of matcha. Additional to that, we will also certainly see an increase in price due to tariffs.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/john-santi-lays-his-brothers-remains-to-rest-after-finding-out-museum-displayed-specimens-without-consent/hl1qtneb3",
    "title": "John Santi lays his brother's remains to rest after finding out museum displayed specimens without consent",
    "publish_date": "Sat, 20 Sep 2025 21:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"The good memory was that he was my best friend. Not only a brother, he was my best friend when he died. I was only 13 when he died but he used to be more a confidant and I would go everywhere with him.\"\n\n\n\n\n\nMemories of a much-loved brother.\n\n\n\n\n\n\"We had some good times, even though I was so young. We used to go tenpin bowling, to the movies and that together. Even with his girlfriend he would take me along.\"\n\n\n\n\n\nDecades later the pain is still raw for John Santi.\n\n\n\n\n\n\"Because he was only 19 when he died...yeah, I miss him so much.\"\n\n\n\n\n\nJohn's brother Tony Santi died in a motorcycle accident in Tasmania in the 1970s.\n\n\n\n\n\nBut raw grief has come up again this year for John and his family.\n\n\n\n\n\nThat's when they found out his brother's brain had been removed without consent at an autopsy after his death, and kept as part of a collection at the Rodda Museum at the University of Tasmania.\n\n\n\n\n\n\"One of the hardest parts is having to rebury him, so he's been burried twice. After 50 years I had to rebury his body part. That happened about three weeks ago. We went and laid that to rest with him. That's something we should never have had to do.\"\n\n\n\n\n\nJohn Santi's brother wasn't the only person treated in this way.\n\n\n\n\n\nA Tasmanian coronial investigation recently released its final report, confirming 177 samples had been kept by the museum without permission.\n\n\n\n\n\nThe report stated that human specimens were collected, and in some cases publicly displayed, by the University of Tasmania for decades without the knowledge or consent of families.\n\n\n\n\n\nThe museum collected the remains from coronial autopsies from 1966 to 1991 for teaching and research purposes.\n\n\n\n\n\nMeg Webb is the Independent Member for Nelson in Tasmania.\n\n\n\n\n\nShe says her office has been contacted by a number of Tasmanian families affected by this situation.\n\n\n\n\n\n\"They've been re-traumatised because often the circumstances of their loved ones death was very traumatic and unpleasant in the first place and this has bought all that back to them. Then to have to go through a formal process of perhaps identifying that they are the correct relatives and then also having to make arrangements of what's going to happen with their loved ones remains, has been really gruelling. I really feel for those Tasmanian families and I don't think we've arrived at the end of the process yet because I don't think we've achieved appropriate accountability for how and why this happened.\"\n\n\n\n\n\nThe investigation, led by coroner Simon Cooper, found the handling of the remains was not in accordance with national standards, which he said were set up in 2002 but not acted upon by the Tasmanian government.\n\n\n\n\n\nIt appeared previous coroners were unaware the specimens had been distributed to the museum, coroner Simon Cooper said.\n\n\n\n\n\nHe added that the belated discovery that human remains were removed at autopsy and not returned to the body had been a source of pain and anger for many families.\n\n\n\n\n\nIt appeared one now-deceased forensic pathologist, Dr Royal Cummings, provided most of the specimens to the museum, with some of his predecessors and successors also engaged in the practice.\n\n\n\n\n\nIn the conclusion of his report Coroner Cooper said:\n\n\n\n\n\n\"The retention of human remains without family or coronial approval, or even knowledge, is an historic practice out of keeping with, and offensive to, contemporary standards and values. It is inconceivable to my mind that it would ever happen again although the fact that the practice continued for as long as it did and ended only comparatively recently is also almost equally inconceivable.\"\n\n\n\n\n\nMs Webb says she has written to the Tasmanian Attorney General asking for two specific things.\n\n\n\n\n\n\"One is a state apology to the Tasmanian families that have been impacted by this situation, and also a commitment to continue an investigation into any breach of law that occurred during this process, so that we can know about any individuals or institutions that need to be held accountable for breaking the law here. I think that that's something that the families affected deserve to know and would provide appropriate closure to this situation.\"\n\n\n\n\n\nThe remains in question were removed from public display in 2018.\n\n\n\n\n\nThe coroner's office had spent years reconciling records to determine their origin.\n\n\n\n\n\nIn January, the names of 126 people whose specimens had been identified were published online and family members urged to come forward.\n\n\n\n\n\nThe coroner said 100 specimens had been identified and disposed of in line with the wishes of families.\n\n\n\n\n\nDr Sally Wasef is a forensic research fellow in Paleogenetics at the Queensland University of Technology.\n\n\n\n\n\nShe says institutions now need ethical clearance and clear permission to obtain human remains, but this hasn't always been the case.\n\n\n\n\n\n\"I think it was common practice in the olden days that people would think that they can keep some of the remains because they are either colonial or unidentified. That would give them the rights to keep them for research on scientific purposes. I think they can justify to themselves that you know they are benefiting the community and they're not doing any harm basically and allowing medical students or other researchers to have a go to advance a cure, or look more into diseases or cause of death. Even if it's good intentions, it's not the right way of doing things, it's unethical.\"\n\n\n\n\n\nDr Wasef says there are now clear national standards introduced in 2001 about how human remains can be obtained for medical research.\n\n\n\n\n\n\"Most of the universities now have what is called body farms which is basically a specific location inside the universities where there are bodies that have been donated by the person before their death to research. And they do all of the research based on those remains that have been donated for the purpose.\"\n\n\n\n\n\nDr Wasef also works closely with Indigenous communites helping them to identify human remains that were stolen in previous decades and centuries - when such practices were widespread.\n\n\n\n\n\nLike John Santi, Dr Wasef says the Indigenous communities affected want to see their ancestors laid to rest once and for all.\n\n\n\n\n\nMany of those remains are still being held in museums in Australia and other parts of the world.\n\n\n\n\n\n\"Indigenous Australians believe that the remains are not going to rest if they are in the wrong country which means you have to specifically identify the right community that you return those remains to.\"\n\n\n\n\n\nDr Wasef says the unauthorised collection of human remains - whether those of close relatives or those of people who have been dead for thousands of years - is not only a legal and ethical issue.\n\n\n\n\n\nShe believes for some individuals and cultures it's also a spiritual one.\n\n\n\n\n\n\"I am originally Egyptian and it hurts me every time I see a mummy displayed because this defeats the purpose of mummification. Mummification was meant to give those people an afterlife and we take them off place and display them. That's how I feel every time I see those mummies displayed.\"\n\n\n\n\n\nCloser to home, Meg Webb wants says the Coroner's report is really just a starting point for investigating further what has occurred in Australia.\n\n\n\n\n\n\"There's probably a need here for a wholesale review in every state of Australia to look at whether there are still instances where there's been inappropriate handling and storage and perhaps display of people's remains without consent and to really dig out how that's occurred and put measures in place to ensure it cannot happen again.\"\n\n\n\n\n\nJohn Santi also wants to see more done to make sure people don't have to go through what has happened to his family.\n\n\n\n\n\n\"I'm just glad my mum and dad have passed (died) so they didn't have to go through all this\"\n\n\n\n\n\nThe University of Tasmania’s Deputy Vice-Chancellor for Health Professor Graeme Zosky, has said in a statement the University is deeply sorry for the sadness and hurt felt by family members affected.\n\n\n\n\n\nUniversity staff had also met personally with many families seeking further information, and the university is also carefully considering the Coroner’s report to determine any further actions.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-quite-simple-way-this-group-of-australians-could-save-lives/dx9i8syah",
    "title": "The 'quite simple' way this group of Australians could save lives",
    "publish_date": "Sat, 20 Sep 2025 05:39:43 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Australia is facing a critical shortage of registered stem cell donors — and the solution lies with younger Australians, according to the Leukaemia Foundation.\n\n\n\n\n\nThe group estimates that around 1,000 people in the country are \"urgently\" waiting for a suitable donor match to help treat diseases like blood cancer.\n\n\n\n\n\nBill Stavreski, the head of research at the Leukaemia Foundation, said stem cells can be the sole option for many people with serious illnesses.\n\n\n\n\n\n\"They have a critical and urgent disease, whether it is leukaemia or lymphoma, and for many, this is the only treatment possible,\" he told SBS Macedonian.\n\n\n\nRelying on overseas donors\n\nStavreski said that people spending long times on waitlists face \"detrimental\" health outcomes.\n\n\n\n\n\n\"The majority of unrelated donors for Australians who are having a stem cell transplant or waiting for a stem cell transplant are relying on overseas donors. Now, that is quite critical for many who are on the wait list or about to have a stem cell transplant,\" he said.\n\n\n\n\n\n\"The current number of people registered, at approximately 65,000, is just not enough.\"\n\n\n\nREAD MORE Melanie was sceptical of this underutilised cancer treatment. It saved her life\n\nWhile other countries have stem cell donation programs in schools, hospitals and workplaces, that's lacking in Australia, Stavreski said.\n\n\n\n\n\n\"Each year, more than 2000 stem cell transplants are undertaken, and unfortunately, we're relying too much on overseas donors. And there are also those where donors cannot be found.\"\n\n\n\n\n\nHe encouraged all Australians to donate, and emphasised that one group could be particularly helpful.\n\n\n\n\n\n\"Young Australians are really the key part here in terms of stem cells, the healthiest and the most populous stem cells are when you are between 18 to 35,\" he said.\n\n\n\nWhat's it like donating stem cells?\n\nStavreski said there are misconceptions about donating stem cells, as some people may have an outdated understanding of how the procedure works.\n\n\n\n\n\n\"In the past, the stem cells were taken from the hip bone. That's no longer the case; there isn't the pain that comes along with it,\" he said.\n\n\n\nLISTEN TO Engineered stem cells breakthrough could save lives SBS News 03:20 English\n\nHe explained that stem cell donations are not as invasive as they used to be and are now \"quite simple\".\n\n\n\n\n\n\"It is like donating blood from one arm. The blood will come out, a machine will separate the cells, and the remaining blood will go through to the other arm. It only takes 30 minutes to 60 minutes for the entire process,\" he said.\n\n\n\n\n\n\"You don't need any other needles or any anaesthetic.\"\n\n\n\nDiverse donors needed\n\nWhen determining which stem cells will be most effective in treatment, ancestry plays an important role.\n\n\n\n\n\nCurrently, most donors are of Western European descent, which could mean patients from other nationalities and First Nations backgrounds miss out.\n\n\n\n\n\n\"What is important, and to really reflect what the population is in Australia, is that we need donors from all ancestries,\" Stavreski said.\n\n\n\n\n\n\"It's important that the stem cells are a match. So in terms of using stem cells from other donors, if it's not a perfect match, well then the transplant just cannot happen.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-some-australian-parents-are-giving-their-kids-as-much-as-200k/3ljc87ncz",
    "title": "Why some Australian parents are giving their kids as much as $200k",
    "publish_date": "Sat, 20 Sep 2025 01:22:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Young Australians are asking relatives for financial assistance more often to help get onto the property ladder and tackle \"front of mind\" cost-of-living pressures.\n\n\n\n\n\nNew data from economists at UBS found 20 per cent of Australians gave money to a family member over the last 12 months, the highest number since the research survey began six years ago.\n\n\n\n\n\nOf those tapping the bank of mum and dad for cash, just over half received $5,000 for general expenses, while one in four asked for as much as $200,000 to buy property.\n\n\n\n\n\nThe surge in family lending follows new first-home buyer assistance from the federal government , as UBS predicts a rise in house prices of around 3 per cent over the next year.\n\n\n\nIntergenerational wealth\n\nUBS economist Stephen Wu said family help has been pretty key for younger Australians hoping to get a leg up in the property market.\n\n\n\n\n\n\"Australia is a very wealthy country by some metrics, amongst the wealthiest in the world and we know that a lot of that wealth is tied up in housing,\" he told SBS World News.\n\n\n\n\n\n\"A lot of these older Australians, so parents and grandparents are actually moving some of this wealth and providing it to their family and members, their children and their grandchildren, such that they are able to meet cost of living pressures and also to get a foot in the housing market.\"\n\n\n\n\n\nWu explained that this intergenerational wealth transfer is becoming more common.\n\n\n\n\n\nIn the meantime, the cost of living has become less of a concern for Australians.\n\n\n\n\n\n\"We know that income growth has been quite strong. We know that inflation is easing and it's within the RBA's inflation target band,\" Wu said.\n\n\n\n\n\n\"That means that real wages are growing again. So I think there is quite a good sign that the worst is behind us and we're going to see for those younger Australians, this boost to real incomes helping to alleviate cost of living pressures.\"\n\n\n\nLISTEN TO The bank of mum and dad helping first home buyers, & investors look to US Federal Reserve SBS News 14:22 English\n\nHowever, with property prices predicted to rise, there could be economic angst for some.\n\n\n\n\n\n\"Obviously, there is a lot of wealth in the country and those who are lucky enough to actually get that [family] support are going to be quite grateful. But not everyone is going to be quite so lucky,\" Wu said.\n\n\n\nFirst home buyer scheme\n\nThe federal government will expand its Home Guarantee Scheme in October , which allows eligible buyers to purchase with a five per cent deposit and no lender's mortgage insurance.\n\n\n\n\n\nThe scheme will also remove income and place limits and raise property price caps across most regions.\n\n\n\n\n\nBut as more first-home buyers take advantage of the boosted scheme, demand will also rise, pushing about 100 suburbs outside the scheme's caps by the end of the year.\n\n\n\n\n\nPrice caps in Sydney will lift from $900,000 to $1.5 million, Melbourne from $800,000 to $950,000 and Brisbane from $700,000 to $1 million.\n\n\n\n\n\nAdelaide, Perth and Hobart's caps will increase from $600,000 to $900,000, $850,000 and $700,000, respectively.\n\n\n\n\n\nDarwin's cap will remain unchanged at $600,000, while the ACT will have its cap increased from $750,000 to $1 million.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/jess-hull-breaks-australian-record-and-qualifies-for-800m-final-at-world-athletics-championships/8ypl2tj37",
    "title": "Jess Hull breaks Australian record and qualifies for 800m final at World Athletics Championships",
    "publish_date": "Sat, 20 Sep 2025 00:58:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jess Hull has made history by breaking the Oceania record and becoming the first Australian woman to qualify for the 800m final at the World Athletics Championships.\n\n\n\n\n\nHaving already picked up a bronze in her favoured 1500m, the 28-year-old recorded a time of 1:57.15 and placed third in her semi-final heat in Tokyo on Friday night.\n\n\n\n\n\n\"I've known that time was in there since April,\" she said after the race.\n\n\n\n\n\n\"When I ran 1:58 in Jamaica and we hadn't done a ton of 800m specific work I thought I could get something like that out there.\"\n\n\n\n\n\nThe 1500m Olympic silver medallist only made the semis of the two-lap race after successfully appealing when she was shoved over in the opening lap of her heat.\n\n\n\n\n\nShe was drawn in a loaded semi against Kenyan Lilian Odira and Swiss runner Audrey Werro.\n\n\n\n\n\nOdira won the semi in 1:56.85 and Hull was third in 1:57.17 — enough to claim one of the two non-automatic qualifying spots.\n\n\n\n\n\n\n\nShe beat the Australian record of 1:57.67 set by Claudia Hollingsworth last month in Poland.\n\n\n\n\n\nHull is the first Australian woman to hold both the 1500m and 800m national records at the same time.\n\n\n\n\n\nYoung gun Hollingsworth and 2022 Commonwealth Games bronze medallist Abbey Caldwell were both eliminated in the semi-finals.\n\n\n\n\n\n— With additional reporting by Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-80th-general-assembly-of-the-un-is-meeting-in-new-york-how-does-it-work-and-why/0kzy3p06v",
    "title": "The 80th General Assembly of the UN is meeting in New York. How does it work - and why?",
    "publish_date": "Fri, 19 Sep 2025 22:00:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n“At the beginning of the opening of the 80th session last week, I spoke on the theme that will be guiding my Presidency: Better Together. This theme reflects the reality that no single nation, regardless of its size, might, or wealth, can confront the challenges that we face all alone.”\n\n\n\n\n\nThat's Annalena Baerbock, the former Foreign Minister of Germany who is now the newest President of the United Nations General Assembly, sometimes referred to as UNGA.\n\n\n\n\n\nWorld leaders will gather in New York for the Assembly, an event that consists essentially of several days of speeches.\n\n\n\n\n\nThis year it's attracting significant attention because multiple leaders have announced their intention to recognise Palestine as a state during the proceedings, like British Prime Minister Keir Starmer.\n\n\n\n\n\n\"With that (two-state) solution now under threat, this is the moment to act. So today as part of this process towards peace, I can confirm the UK will recognise a state of Palestine by the United Nations General Assembly in September unless the Israeli government takes substantive steps to end the appalling situation in Gaza, agree to a ceasefire and commit to a long-term sustainable peace.\"\n\n\n\n\n\nIt is tradition for Brazil to always be the first member state to speak when the General Assembly comes together - because they were the country to step up in the early years of the world body, when other countries were reluctant to do so.\n\n\n\n\n\nThe United States comes second because it hosts the UN headquarters in New York.\n\n\n\n\n\nFrom there the list of nations to give speeches is based on hierarchy and generally a first come, first served basis.\n\n\n\n\n\nBut UN Secretary General Antonio Guterres says it's not a time for grandstanding.\n\n\n\n\n\n\"Some call it the World Cup of Diplomacy, but this cannot be about scoring points, it must be about solving problems. There is too much at stake. We are gathering in turbulent, even uncharted waters.\"\n\n\n\n\n\nThis year's General Assembly is significant for another reason.\n\n\n\n\n\nIt's also the 80th anniversary of the founding of the UN - and that history is key to understanding just what the UNGA is and what its powers are.\n\n\n\n\n\n\"Hostilities will end officially at one minute after midnight tonight, Tuesday the 8th of May. We may allow ourselves a brief period of rejoicing. Today is Victory in Europe Day.\"\n\n\n\n\n\nBritish Prime Minister Winston Churchill announced the end of World War Two in Europe in the middle of 1945, and the war in the Pacific was in its dying stages, with the Japanese destined to sign the instrument of surrender at Tokyo Bay in September of that same year.\n\n\n\n\n\nBut representatives from 50 countries had already been meeting in San Francisco from April 1945 to draft a new agreement they hoped would avoid more bloodshed.\n\n\n\n\n\nThey were welcomed by the US Secretary of State Edward Stettinius.\n\n\n\n\n\n\"The conference of the United Nations on International Organisation is now convened.\"\n\n\n\n\n\nAfter two months of debate, it was the chairman of the conference - British ambassador to the US Lord Halifax - who ultimately brought the proceedings to an end in June.\n\n\n\n\n\n\"It is now my duty, my honour and my privilege in the Chair to call for a vote on the approval of the charter of the United Nations.\"\n\n\n\n\n\nNewsreel organisations like United News captured the moment of that vote.\n\n\n\n\n\n\"And the heads of the 50 United Nations delegations rise to be counted. The vote is unanimous.\"\n\n\n\n\n\nThe Charter they approved set out four major parts of the new organisation to be called the United Nations.\n\n\n\n\n\nThere would be a security council to address military problems, an organisation to solve social issues that might ultimately become the cause of future wars, a court to solve disputes, and a general assembly.\n\n\n\n\n\nAnd after starting with 51 members, there are now 193 countries who are part of the Assembly - with the Holy See and Palestine having observer status.\n\n\n\n\n\nDr Imogen Saunders is the director of the Centre for International and Public Law at the Australian National University in Canberra.\n\n\n\n\n\n\"Yeah. So the UN General Assembly is the primary representative organ of the United Nations. Unlike the Security Council, every member of the UN has a seat on the General Assembly. It's the forum in which UN members can get together to discuss issues, but also to issue resolutions in terms of matters that are going on in the world, calling on states to do things, commenting on various matters. It also plays really important roles in various elections to the UN: elections of International Court of Justice judges, elections of Security Council members. And recently it's been playing an increasingly important role in directing advisory opinion requests to the International Court of Justice.\"\n\n\n\n\n\nDr Saunders says a major feature of the assembly is that its resolutions are recommendations - not binding directives.\n\n\n\n\n\nThat essentially means member states cannot be forced to follow certain courses of action, because the idea is to cooperate.\n\n\n\n\n\n\"Nonetheless, UN General Assembly resolutions do play an important role because the way international law works is - customary international law, which is binding on all states in the world, is formed of state practice and opinio juris, which is what states do, and a belief that law is binding upon them. And General Assembly resolutions can be used as evidence of both state practice and opinio juris. So although they're not binding in and of themselves, if you have enough General Assembly resolutions that build up over a period of time, they can actually contribute to the development of binding norms of international law.\"\n\n\n\n\n\nBack in 1945, US President Harry Truman believed the United Nations had the potential to avoid a significant amount of bloodshed if it adopted that spirit.\n\n\n\n\n\n\"If we had had this charter a few years ago, then above all, millions now dead would be alive.\"\n\n\n\n\n\nHistorian Stephen Schlesinger told the United Nations network earlier this year that the desire for peace has not always been realised through the General Assembly.\n\n\n\n\n\n\"They created a charter which reflected the aspirations of humanity... The spirit was very enthusiastic at that time. Of course we now know today that the UN has survived for 80 years through many different crises, ones that sometimes it helped settle, and others it was not able to able to help settle.\"\n\n\n\n\n\nStill, Dr Saunders says the General Assembly has significant influence through a range of agencies which carry out the UN's mandates - and it also has vast moral authority.\n\n\n\n\n\n\"Absolutely. Because it is the only body where every UN member has a say. And so when you have a resolution that is either unanimous or near unanimous, then that means that you'll essentially have a plebiscite of all the countries in the world and that carries significant moral weight.\"\n\n\n\n\n\nIt's that authority the new UNGA President hopes will carry some weight as the 80th Assembly proceeds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/healing-land-and-spirit-through-noongar-knowledge-and-regenerative-land-management/p1p5026u4",
    "title": "Healing land and spirit through Noongar knowledge and regenerative land management",
    "publish_date": "Fri, 19 Sep 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nOut in the Wheatbelt of Western Australia, something is happening ...\n\n\n\n\n\nIt’s a movement to heal Country - and community.\n\n\n\n\n\n\"And you can see the soil, how degraded it is.\"\n\n\n\n\n\nFor generations, acres of land in the Wheatbelt was stripped by clearing, cropping and overgrazing.\n\n\n\n\n\nBallardong Noongar man Oral McGuire says settlement and colonisation left scars on both soil and spirit.\n\n\n\n\n\n\"All of these activities are very extractive activities that for 170 odd years this little piece of land here, the whole landscape through this region, has suffered that abuse from, you know, settlement colonisation.\"\n\n\n\n\n\nToday, Mr McGuire works as a regenerative land manager, guided not by commodity farming, but by cultural law.\n\n\n\n\n\n\"Slow burning, or our cool burning that we do as Noongars, and we do it to replenish country. The season we are in now is the right season for us to be doing it.\"\n\n\n\n\n\nFire, water, native plants - all are central to reviving ecosystems that once thrived here.\n\n\n\n\n\n\"So they are indicators that the soil, the balance and the health of the soil is returning, because they haven't been here.\"\n\n\n\n\n\nIt’s a vision stretching beyond agriculture — into healing Country itself.\n\n\n\n\n\n\"Healing country heals people and healing the spirit of the land itself, is the most powerful thing that any human can participate in and contribute back to nature itself, or back to boojar as we say.\"\n\n\n\n\n\nOral McGuire was born in Western Australia's Wheatbelt in Beverley, on Ballardong land, and says his family’s connection here goes back thousands of years.\n\n\n\n\n\n\"One of our first trees - this area here was planted out in 2008.\"\n\n\n\n\n\nSince acquiring Yaraguia farm nearly two decades ago, more than a million trees have been planted.\n\n\n\n\n\nFrom bush honey to wattle seed, bush tucker is now thriving again.\n\n\n\n\n\nBut Mr McGuire insists he and his family are not farmers because he is working with Country, not against it.\n\n\n\n\n\nFor him, restoring land also means restoring identity.\n\n\n\n\n\nAnd it is knowledge being recognised nationally.\n\n\n\n\n\n\"Oral's vision is for the promotion of an entrepreneurial culture within and among the Noongar people of Western Australia. Please welcome Oral McGuire.\"\n\n\n\n\n\nAt this year’s Regenerative Food Systems Conference, Yaraguia farm was held up as a model of Indigenous-led restoration.\n\n\n\n\n\nSoil biodiversity expert Dr Jacob Parnell was at the conference and travelled from the United States.\n\n\n\n\n\n\"A lot of the global issues that we are facing today, really the foundation of those is the soil. So if we protect the soils and we regenerate, grow those soils then we improve a lot of these other problems we are facing today.\"\n\n\n\n\n\nDr Parnell says Indigenous knowledge is critical to the future of farming.\n\n\n\n\n\n\"Indigenous people were farming for thousands of years and so going back to saying what were they doing that was right, and understanding that interaction with the soil is very important. And so there is that, and then we also have the science to back that up.\"\n\n\n\n\n\nNoongar academic and Impact Dream director Heidi Mippy agrees.\n\n\n\n\n\nShe’s researching new ways of reimagining landscapes, restoration and food systems.\n\n\n\n\n\n\"There's many reasons why we have to have Noongar knowledge at front and centre to these conversations. I think one is around land access, so if we don't have our knowledge brought to the system, we are not reconnecting back to country. And part of that is this reconciliation journey that Australia keeps talking about for the past 20 odd years.\"\n\n\n\n\n\nShe says regenerative farmers are more open to First Nations perspectives.\n\n\n\n\n\n\"My best relationships here at the moment have been with the regenerative farmers. I think this is because they are more open to thinking about things like soil health, biodiversity, water and all of those key issues that it is a little bit harder to have those conversations with mainstream farmers.\"\n\n\n\n\n\nBack on Country, Oral McGuire says this work is about creating a future where his children and the next generation can live on and with the land.\n\n\n\n\n\n\"The benefit that we have done here as particularly Noongars is, we've put ourselves in a very strong position, where in 10 years’ time we will absolutely exist. And some of our neighbours will be absolutely gone.\"\n\n\n\n\n\nHealing Country and, in turn, healing people.\n\n\n\n\n\n\"The healing of country becomes, you know, your own healing. And so I think I've been on a healing, my own healing journey because of this.\"\n\n\n\n\n\nFor Ballardong Noongar man Oral McGuire this is not just regenerative farming.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/ivf-patients-demand-justice-after-medical-data-exposed-in-cyberattack/ih7slpxfh",
    "title": "'Really angry': Isabel is one of hundreds considering class action against this IVF provider",
    "publish_date": "Fri, 19 Sep 2025 20:35:13 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Isabel Lewis wanted to have children so badly that her friends nicknamed her \"clucky\".\n\n\n\n\n\nShe would write letters to the child she dreamed of having, but there was a stumbling block for Lewis.\n\n\n\n\n\n\"I was 38 and single,\" she tells SBS News.\n\n\n\n\n\n\"It was hard to date when you are single, but you are desperate to have children.\"\n\n\n\n\n\nIt was then that Lewis made a big life decision: to pursue motherhood without a partner.\n\n\n\n\n\nIsabel Lewis had her twin boys through IVF eight years ago. Source: Supplied After months of appointments and counselling, she had her first cycle of in vitro fertilisation — or IVF as it is commonly known — with a sperm donor.\n\n\n\n\n\n\"In that process, I was like, 'Well, clearly then I'll be single forever. No-one will ever want to date somebody with children,'\" she says.\n\n\n\n\n\n\"But then I met Chris.\"\n\n\n\n\n\nThe pair clicked, and for her next cycle, Lewis put her initial donor on hold and used her new partner Chris Lewis's sperm instead.\n\n\n\n\n\nA few cycles later, they were trying for a fifth time, a cost that put the pair into debt.\n\n\n\n\n\nLewis says this was going to be their last try, but to her amazement, not one but two of her embryos were successful.\n\n\n\n\n\n\"We had twins, baby boys, and they're Chris's biological children,\" she says.\n\n\n\nThey're the jackpot babies.\n\nEight years on, her boys are happy and healthy, and she and Chris are married.\n\n\n\n\n\nThe now 46-year-old holds her journey to motherhood close to her chest, but since a data breach targeted the fertility clinic she used, she's become concerned it could be exploited for malicious purposes.\n\n\n\n\n\nIn February, Genea Fertility informed clients, including Lewis, via email that personal data had been breached by cybercriminals and posted to the dark web.\n\n\n\nLISTEN TO I feel like privacy is dead: IVF data breach triggers interest in class action lawsuit SBS News 07:56 English\n\nThe exposed data includes the medical histories, diagnoses, treatments, and prescription medications of those clients, as well as pathology and diagnostic test results.\n\n\n\n\n\nIn July, the clinic confirmed it had concluded its investigation and was \"starting to communicate directly with individuals about the findings … relevant to them\".\n\n\n\n\n\nIt's been hard for Lewis to come to terms with the data breach.\n\n\n\n\n\n\"This is how I built my family. It's so deeply emotional and deeply personal. It's our family story. And to have it on the dark web? How do you even process that?\" she says.\n\n\n\n'Rageful': Personal data on the dark web\n\nGenea has created a page on its website to communicate updates with impacted clients.\n\n\n\n\n\n\"We thank our community for their patience and understanding during our investigation into this cyber incident. We deeply regret that personal information was accessed and published and sincerely apologise for any concern this incident may have caused,\" Genea's website reads.\n\n\n\n\n\n\"The protection of our patients, staff and partners' information remains our utmost priority.\"\n\n\n\nIsabel Lewis says the Genea data breach has shaken her confidence in the fertility industry. Credit: Supplied Lewis says the data breach has shaken her confidence in the industry, and some of Genea's other clients appear to feel the same way.\n\n\n\n\n\nSBS News has contacted dozens of people who claim to be victims of the Genea data breach. While a few agreed to speak anonymously, Lewis was happy to talk openly about her experience with the clinic.\n\n\n\n\n\nHer candour and good humour are striking. She recounts everything from the discomfort of invasive procedures to the financial toll of multiple rounds of IVF, each costing around $10,000.\n\n\n\n\n\n\"The fertility treatment is probably the most invasive and emotional medical treatment you can have,\" she says.\n\n\n\n\n\n\"I've had treatment for mental health stuff, and I'd probably be less concerned about that being on the dark web.\"\n\n\n\nREAD MORE How a fertility clinic hack turned Isaac’s good deed into a privacy disaster\n\n\"You have an internal ultrasound on the third day of your period, which is not something any woman wants to go through, let alone have a report about it on the dark web,\" Lewis says.\n\n\n\n\n\nWhen asked if Genea's apologies for the breach go far enough to make amends, her voice takes on a new tone.\n\n\n\n\n\n\"I'm rageful, which I laugh about because that's a protection mechanism,\" she says.\n\n\n\nI'm really angry at these for-profit businesses having no consequences.\n\n\"I want new legislation and IT fines that are proportionate to the company's size and financial capacity and the size and impact of the breach,\" Lewis says.\n\n\n\nHundreds interested in class action\n\nLewis has signed on to a class action investigation being conducted by specialist litigation law firm Phi Finney McDonald.\n\n\n\n\n\nShe feels it's too late to reclaim her privacy, so seeking justice through a class action is \"all she can do\".\n\n\n\n\n\nThe firm's principal lawyer, Tania Noonan, confirmed the group is looking into \"potential redress\" for those impacted by the breach.\n\n\n\n\n\n\"Patients at Genea are entitled to the highest levels of privacy and safety to ensure their personal details and medical histories remain secure,\" Noonan says.\n\n\n\nSBS News understands hundreds of people have contacted the firm in relation to the Genea data breach, along with Lewis.\n\n\n\n\n\n\"I think change comes from remittance,\" she says.\n\n\n\n\n\n\"I'm not doing it for the money, although money is fine and all, but if there are damages that are significantly painful, hopefully — and maybe I'm deluded — the business will change their practices so that they don't have damages like that again.\"\n\n\n\n'Tumultuous' few years for fertility\n\nAustralia's IVF sector has been subject to intense scrutiny following a series of high-profile incidents and systemic failures that have prompted calls for reform.\n\n\n\n\n\nEarlier this year, Monash IVF disclosed it had transferred the wrong embryo to a patient, two months after a patient was mistakenly implanted with another client's embryo, prompting its CEO to step down.\n\n\n\n\n\nFamily creation lawyer Sarah Jefford says it's time to look at how the fertility industry is regulated.\n\n\n\n\n\n\"The fertility industry is in a place where there's a lack of community trust and particularly when we have had a tumultuous few years with fertility,\" she says.\n\n\n\nThings need to change so that we can rebuild that trust for the community.\n\nJefford explains that the fertility industry is essentially self-regulated, with \"patchwork\" laws in each state and territory around assisted reproductive treatment.\n\n\n\n\n\n\"They don't really have clear legislation on regulating their day-to-day practices of fertility treatment,\" she says.\n\n\n\n\n\n\"That's worked really well up until a point, but I think now we need to look at a different framework to really bring it into line with community expectations about what we expect from the fertility industry.\"\n\n\n\n\n\nShe echoes Lewis's sentiment that a financial penalty could lead to a change in how fertility clinics operate.\n\n\n\n\"I know that the fertility industry is worth over $700 million a year. I do think that money talks, so perhaps a financial incentive or penalty could make change in the industry that's otherwise not very well regulated,\" Jefford says.\n\n\n\n\n\n\"It may not be about getting financial compensation … but it should set that standard for fertility clinics to know that this is protected information, and they need to be very careful about what they do with it.\"\n\n\n\n\n\nIn Australia, the annual revenue from the fertility and IVF industry exceeds $800 million.\n\n\n\nWhat could a class action over the data breach look like?\n\nDavid Vaile, former chair of the Australian Privacy Foundation, says Australia doesn't have a \"vigorous privacy data protection litigation process\".\n\n\n\n\n\nUntil recently, the Privacy Act didn't include provisions for Australians to sue to enforce their rights after a privacy breach. But in February, a landmark reform took effect, allowing individuals to pursue civil action for significant breaches of personal privacy.\n\n\n\n\n\nVaile says a class action against Genea could be the first and perhaps soon-to-be-famous test of the new privacy tort.\n\n\n\n\n\n\" It may well be that it'll only be through something like a class action that would justify enough legal effort being put into that to actually test [the news laws] out,\" he says.\n\n\n\n\n\nIf successful, a class action of this kind could compel Genea to pay millions in damages to impacted clients of the data breach, and air allegations in court regarding the company's conduct.\n\n\n\n\n\nClass actions differ from other types of lawsuits, as they involve seven or more persons with claims against the same defendant.\n\n\n\nStream free On Demand Class Actions episode • Insight • Current Affairs • 52m episode • Insight • Current Affairs • 52m\n\nA class action against Genea could also fall under several types of law, such as consumer, human rights and health law, and its scope would be determined by the law firm working on the case in consultation with the plaintiffs.\n\n\n\n\n\nPrevious consumer law class actions have addressed losses resulting from scams and unfair business practices.\n\n\n\n\n\nHuman rights class actions have investigated alleged abuses and breaches of human rights, such as an individual's right to privacy.\n\n\n\n\n\nMedical class actions have typically addressed defective operations and treatments.\n\n\n\n\n\nVaile says it will be interesting to see how a legal firm tackles a class action relating to IVF data. He suggests one approach could be to apply equity law to the medical sector.\n\n\n\n\n\n\"Equity isn't about whether you have breached this law or that law, but [asking] 'is your relationship with these people [the patients] so special that you have a special obligation to them?'\" he says.\n\n\n\n\n\n\"When there's a vulnerable patient who doesn't really have much choice and a very powerful professional — whether a nurse or doctor in a position of power over them — that creates what's known as an equitable obligation. So, if there are confidential matters, like medical history, involved, that could be relevant.\"\n\n\n\nData retention\n\nAfter discovering she'd been affected by the data breach, Lewis has been troubled by a niggling question.\n\n\n\n\n\nWhy, eight years after the birth of her children, did Genea keep her data?\n\n\n\n\n\n\"I understand that my medical information and success rate can be useful for the clinic and other women, but why do my name and personal details need to be attached to it? They could have de-identified me,\" she says.\n\n\n\n\n\nSBS News put this question to the fertility group, and a Genea spokesperson said maintaining patient records is mandated by law.\n\n\n\nLISTEN TO INTERVIEW: Record numbers of malicious data breaches recorded - how do you protect yourself? SBS News 08:39 English\n\n\"The regulations that govern healthcare operations in Australia and other legal requirements mandate that we maintain patient records for certain time frames,\" the spokesperson said.\n\n\n\n\n\n\"There are also additional record retention requirements that depend on variables such as type of treatment, the outcome of the treatment and the state or territory in which the services were provided.\"\n\n\n\n\n\nWhile data retention policies vary state by state, Vaile says groups that retain data have a responsibility to protect it.\n\n\n\n\n\nHowever, it can be nearly impossible to totally prevent malicious actors from hacking data, so the best thing to do is to decrease what can be stolen.\n\n\n\n\n\nOne way can be through data minimisation, where companies reduce the amount of data they store.\n\n\n\n\n\nVaile says a common school of thought is that data is a \"toxic asset\".\n\n\n\n\n\n\"The more you have of it, the higher the risk. The longer you hold it, the longer the data retention period; the higher the risk. The more intensively you use it and enable access to it, the higher the risk,\" he says.\n\n\n\nOnce it's held online, it's just a ticking time bomb.\n\nVaile says if a class action found that health workers have a \"special equitable obligation\" to patients, it could make the entire medical profession \"go nuts\", adding that the way Genea stores clients' data could be a key factor in potential future litigation.\n\n\n\nCalls for an IVF watchdog\n\nAdvocates have been calling for reform in the IVF sector and for the establishment of a national regulator or watchdog.\n\n\n\n\n\n\"It's time that we had an Australian Assisted Reproductive Commission that could actually regulate the entire fertility industry, including donor conception and surrogacy,\" Jefford says.\n\n\n\n\n\n\"Their job could be setting standards for fertility treatments, fertility clinics and licencing and making sure that there is accountability for fertility treatment in Australia, as well as keeping records for donor treatment and surrogacy to make sure that people have access to information about their conception and birth heritage.\"\n\n\n\nREAD MORE Melanie had to reimagine her family when she discovered there were no Indigenous sperm donors\n\nEvie Kendal, a bioethicist and public health scientist at Swinburne University of Technology, says the checks and balances for the IVF industry aren't up to standard.\n\n\n\n\n\n\"If we are in a situation where people are having the incorrect embryo transferred, then something has clearly gone wrong,\" she tells SBS News.\n\n\n\n\n\n\"And because the stakes are so high when it comes to making families, we really can't afford to have any errors, or we need to make sure we have as few as humanly possible.\"\n\n\n\n\n\nNot only could regulatory reform lead to better health outcomes and data security, but it could also rebuild trust in the IVF sector, Kendal says.\n\n\n\n\n\n\"We are seeing mistakes and human errors that are actually having massive ramifications for families. An independent watchdog or a federal regulatory body would actually bring back a lot of trust with the community,\" she says.\n\n\n\n\n\n\"The fact that we have inconsistent state legislation when it comes to assisted reproduction and the fact that the rules are different depending on where you are in the country really does undermine that public trust.\"\n\n\n\nLISTEN TO When a good deed becomes a privacy disaster: a sperm donor speaks out SBS News 08:01 English\n\nA federal watchdog could also regulate how much profit an IVF clinic is allowed to make for its services, Kendal says.\n\n\n\n\n\nEarlier this month, federal Health Minister Mark Butler announced the establishment of an independent accreditation system for fertility providers.\n\n\n\n\n\nAccreditation for services will be provided by the Australian Commission on Safety and Quality in Health Care and will be in place by January 2027.\n\n\n\n\n\nThe body would develop nationwide guidelines, performance monitoring metrics, workforce and staffing guidance and clearer complaint pathways.\n\n\n\n\n\nHowever, the government has not committed to legal reform or national laws regulating the industry.\n\n\n\n\n\nLewis is hopeful the class action could lead to changes in the \"lucrative\" IVF space and make it a better and more secure process for Australians wanting to start a family.\n\n\n\n\n\n\"For some people wanting to have kids, the level of desperation and the money that has gone into it is staggering.\n\n\n\n\n\n\"There needs to be something in place to protect people, and there have to be some serious consequences for commercial organisations not taking that responsibility seriously.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/video/hilda-report-reveals-people-in-australia-are-retiring-later/y1zfowbvj",
    "title": "HILDA report reveals people in Australia are retiring later",
    "publish_date": "Fri, 19 Sep 2025 11:47:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "HILDA report reveals people in Australia are retiring later\n\nPublished 19 September 2025, 9:47 am\n\nHome ownership appears to be the key to retiring with more money, with the average super balance for a retiree who owned their home outright at more than $500,000 in 2023. That's according to the annual Household, Income and Labour Dynamics in Australia Survey, which also found Australians are working longer, having fewer children, and spending more as loneliness continues to rise.",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/video/a-new-home-for-melbournes-electronic-sound-studio/psjtpbwre",
    "title": "A new home for Melbourne’s Electronic Sound Studio",
    "publish_date": "Fri, 19 Sep 2025 11:43:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "A new home for Melbourne’s Electronic Sound Studio\n\nPublished 19 September 2025, 9:48 am\n\nThe Melbourne Electronic Sound Studio has officially opened the doors at its new home in Federation Square. It's one of the largest publicly accessible collections of electronic instruments in the Southern Hemisphere and hopes to attract music lovers from around the world.",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.theage.com.au/sport/afl/matthew-lloyds-early-premiership-prediction-20250921-p5mwq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Matthew Lloyd's early premiership prediction",
    "publish_date": "Sun, 21 Sep 2025 12:03:22 +1000",
    "category": "finance",
    "authors": [],
    "text": "Matthew Lloyd's early premiership prediction\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 45
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/inside-atlassian-s-revolutionary-habitat-tower-built-for-the-future-of-work-20250911-p5mubw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Atlassian’s revolutionary ‘habitat’ tower, built for the future of work",
    "publish_date": "Sun, 21 Sep 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Linda Morris"
    ],
    "text": "Behind scaffolding and cranes, the new $1.45 billion futuristic headquarters of the homegrown tech giant Atlassian is fast rising high above Central Station.\n\nBuilt of green concrete, timber and structural steel to cement its world leading climate-friendly credentials, Atlassian Central is also revolutionary for its vision of what high-rise office work might look like in the future.\n\n“We’re not just putting up another office tower,” Atlassian’s chief executive and co-founder, Mike Cannon Brookes said. “We’re rethinking what a workplace can be. It’s sustainable design at global scale, right here in Sydney. One that’s greener, smarter, and built for how teams actually work today.”\n\nCo-owners Dexus and Atlassian unveiled on Friday the first worker-friendly timber “habitat” within what will become the world’s tallest hybrid commercial tower, the tallest high rise in the city’s southern precinct and the anchor of Sydney’s newest technology precinct, known as Tech Central.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/rugby-championship-to-be-turfed-under-massive-sanzaar-tours-shake-up-20250921-p5mwpm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby Championship to be turfed under massive SANZAAR tours shake-up",
    "publish_date": "Sun, 21 Sep 2025 11:51:42 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "New tours era set to replace Rugby Championship\n\nThe Rugby Championship will not take place next year, and the current format of the competition is unlikely to be played again until 2029, the Herald understands. As has been well signposted, the All Blacks are heading to South Africa next year for a seven-game tour featuring matches against the Bulls, Stormers, Sharks and Lions, as well as three Tests – with a fourth Test to be tacked on at the end in Europe.\n\nThat will replace the Rugby Championship in 2026, but plans are also afoot for tours involving all four SANZAAR nations in 2028. The Wallabies are set to play two three-Test series in 2028, meaning they could either head to New Zealand for three Tests or host the All Blacks, followed by a similar arrangement with either South Africa or Argentina.\n\nThat would mean no Rugby Championship in 2026, a shortened version in 2027 (a Rugby World Cup year), and again no Rugby Championship in 2028 – before a resumption of the current format in 2029.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/australian-slams-57-ball-ton-against-india-as-records-tumble-in-crazy-runfest-20250921-p5mwp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian slams 57-ball ton against India as records tumble in crazy runfest",
    "publish_date": "Sun, 21 Sep 2025 11:23:42 +1000",
    "category": "sports",
    "authors": [],
    "text": "Australia’s Beth Mooney crunched a century in 57 balls, only to be outdone by Indian opener Smriti Mandhana who hammered her own hundred from just 50 balls.\n\nBut Mooney’s 75-ball innings of 138 set the platform for a mammoth total of 412, and a 43-run victory in the third ODI, sealing a series win for Australia.\n\nBeth Mooney slammed a 57-ball ton. Credit: Getty Images\n\nThe match was one of the craziest in women’s ODI history - if anything Australia left some runs out there after failing to bat out their 50 overs in setting a target that was ultimately too great for India.\n\nHere are some of the remarkable achievements in Delhi, which set an intriguing tone for the women’s world cup, which begins in India on September 30.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/afl/star-magpies-the-club-should-move-on-from-according-to-lloyd-20250921-p5mwpr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star Magpies the club should move on from according to Lloyd",
    "publish_date": "Sun, 21 Sep 2025 11:19:03 +1000",
    "category": "sports",
    "authors": [],
    "text": "Star Magpies the club should move on from according to Lloyd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/only-get-respect-with-a-premiership-mulitalo-says-one-way-to-silence-sharks-doubters-20250921-p5mwns.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Only get respect with a premiership: Mulitalo says one way to silence Sharks doubters",
    "publish_date": "Sun, 21 Sep 2025 11:02:41 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "The Sharks are through to their second straight preliminary final and have finally earned the respect they have craved from the outside world.\n\nBut Cronulla winger Ronaldo Mulitalo said the doubts about Cronulla’s title credentials will remain until they win a premiership, which is now only 160 minutes away from becoming a reality.\n\nMulitalo was one of the many standouts for the Sharks as they trounced Canberra 32-12 in their own backyard to set up a preliminary-final showdown with Melbourne on Friday night.\n\nThe Sharks have played finals footy for the last four seasons but with only one win from five games prior to this season, never made it past the preliminary final; a 26-6 loss to Penrith last year. It led to star Nicho Hynes saying last week the Sharks don’t “get any respect – ever”.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/europe/duchess-of-york-wrote-to-supreme-friend-epstein-after-vow-to-cut-contact-20250921-p5mwpf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Duchess of York wrote to ‘supreme friend’ Epstein after vow to cut contact",
    "publish_date": "Sun, 21 Sep 2025 10:59:30 +1000",
    "category": "finance",
    "authors": [
      "Hannah Furness"
    ],
    "text": "London: Sarah, Duchess of York, wrote to disgraced financier Jeffrey Epstein, calling him a “steadfast, generous and supreme friend” after claiming she had cut ties with him, according to an email obtained by newspapers.\n\nThe email, published by the Sun on Sunday and Mail on Sunday, shows the duchess contacting Epstein in 2011, after he was convicted of procuring a child for prostitution.\n\nThe duchess had given an interview in March that year, apologising for the “terrible, terrible error of judgment” in associating with him and accepting his money, promising she would have “nothing ever to do” with him again. But in April, according to the emails, she sent Epstein a message “from the truth of my heart”, saying she must “humbly apologise”.\n\nSarah, Duchess of York, and Prince Andrew, Duke of York, at a requiem mass for Katharine, Duchess of Kent, last week. Credit: Getty Images\n\n“I know you feel hellaciously let down by me,” she wrote, insisting that she had not used the “P word” [paedophilia] in her interview condemning him. “You have always been a steadfast, generous and supreme friend to me and my family.”",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/not-your-typical-running-club-the-nudity-is-the-giveaway-20250921-p5mwp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Not your typical running club (the nudity is the giveaway)",
    "publish_date": "Sun, 21 Sep 2025 10:53:05 +1000",
    "category": "entertainment",
    "authors": [
      "Chantal Nguyen",
      "Peter Mccallum"
    ],
    "text": "Runnicles brought forth the gently surging pulsations of the opening with quiet buoyancy, and the ensuing woodwind idea entered brightly but at a distance. The violins, under concertmaster Andrew Haveron introduced more urgent animation and captured a point of vertiginous intensity at the climactic point of the phrase, as though arriving at a breathtaking panorama.\n\nDonald Runnicles and the Sydney Symphony Orchestra gave a glowing performance of Sibelius’s Symphony No. 2, shaping its abundant melodic riches with warmth and an astute understanding of the way its lapidary structure unfolds. This is a work whose revelations creep up on you, like an unexpected tree or vista on a walk, only to recede just as quickly.\n\nThe slow movement was dark but never self-indulgent. The portentous bassoon solo (Matthew Wilkie) emerged over the top of an almost inaudible plucked tread from cellos and basses as though a thought had suddenly crystallised. But perhaps the symphony’s most beautiful moment was the oboe theme (Shefali Pryor) ushered into the middle section of the third movement, which, up to this point had bristled with scurrying energy from the strings.\n\nThis melody is of such disarmingly simple beauty, one scarcely notices that it is built on themes of the first movement, including the symphony’s opening notes. This is perhaps the kind of integration Sibelius was referring to when he later remarked to Gustav Mahler that what he liked about symphonic works was the profound logic that created an inner connection between its motives (Mahler famously answered, “No, the symphony must be like the world”).\n\nFor the finale, Sibelius conceived two imposing but contrasting ideas, the first of surging exaltation, the second of implacable sternness and quiet resolve that grows to become overwhelming. Runnicles guided both so that the expressiveness was exhilarating, but never over-inflated.\n\nThe danger of arriving at the closing passages with the feeling that all the fireworks have already been let off, which is sometimes a problem with this work in less experienced hands, was avoided here and the performance closed in radiant magnificence.\n\nBefore this, Runnicles and the SSO articulated the tempestuous outer textures and tender contrasting cor anglais melody (Alexandre Oguey) of Wagner’s Overture to the Flying Dutchman with musicianly care, moulding brass chords carefully so the turbulence was incisive but not allowed to unbalance the texture or run amok. The program is repeated on Friday and Saturday with the added bonus of mezzo-soprano Sasha Cook in Elgar’s Sea Pictures.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/welch-unpacks-where-it-went-wrong-for-canberra-20250921-p5mwpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Welch unpacks where it went wrong for Canberra",
    "publish_date": "Sun, 21 Sep 2025 10:08:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "Welch unpacks where it went wrong for Canberra\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/a-dedicated-window-how-indian-premier-league-investors-would-seek-to-transform-australian-cricket-20250827-p5mq9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘A dedicated window’: How Indian Premier League owners would seek to transform Australian cricket",
    "publish_date": "Sun, 21 Sep 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "However, KKR group boss Mysore explained in an exclusive interview with this masthead that he and other potential investors would want an exclusive window for all players to appear in the entire BBL tournament, plus the right to rename and rebrand teams to give them higher visibility in India. Loading He said any overlap between Test cricket and the T20 league would be a red line for many potential investors. This would leave Cricket Australia with a huge challenge around how to structure the summer while preserving the things that matter to Australian cricket fans; the Boxing Day and New Year’s Tests. Mysore said it was unlikely that Indian investors with IPL teams in their stables would be content to buy into the BBL as passive participants. They would want a say in the name and branding of the teams, player availability, match timeslots and calendar windows.\n\n“Sustained interest in the league will depend on the availability of all local and foreign players,” Mysore said. “The two key components are a dedicated window, without any clashes with other leagues, and full availability of local players.” However, there is a contrast between investors, like KKR group or Mumbai Indians group – owned by the multi-billionaire Ambani family – and so-called “tech titans” based in the United States. A group of these tech moguls recently paid $300 million for a 49 per cent stake in the London Spirit franchise based at Lord’s. Some investors may be content simply to buy in because of the prestige. But already, the Hundred has been criticised by new franchise owners because the ECB rested some Test players from the early rounds following their exhausting drawn Test series against India.\n\nAt the same time, franchises are in the process of being renamed. BBL clubs, such as the Melbourne Stars and Sydney Sixers, have been described as “trophy assets” that investors will want to buy into simply to be associated with legendary venues, such as the MCG, SCG or Adelaide Oval. The continued appeal of the BBL was on show at Ninja Stadium in January when Mitch Owen powered the Hobart Hurricanes to victory over Sydney Thunder to claim the title. Credit: Getty Images But Mysore says investors expecting a return will be looking for ways to be actively involved. That is certainly the case for KKR, who would want to have a team named Melbourne or Sydney Knight Riders, branded in the group’s purple and gold colours, and involving players like Sunil Narine, who already have year-round deals with KKR.\n\n“Knight Riders were the first to conceive of and execute on a global brand strategy,” Mysore said. “It has become a genuine global brand that has also globalised our fan base.” CA says the Big Bash League is in good health, though still down on its peak season in 2016, when more than 80,000 people turned up for a Stars-Renegades derby at the MCG. AT the peak of its popularity, the BBL drew 80,000 fans to the MCG for a Melbourne derby in January 2016. Credit: Daniel Pockett - CA/Cricket Australia via Getty Images In those days, the BBL was seen as the world’s second-best T20 league behind the IPL, but since then, the franchise market has exploded. There are now major leagues in South Africa and the UAE competing for players at the same time as the BBL, in addition to those in India, the West Indies, England and the United States.\n\nThis growth has provided unprecedented opportunities for players to make millions, and demonstrated how much private capital is potentially available to cricket in Australia, should CA and the states finally decide to take the plunge. CA says the windfall would help supercharge the Big Bash, including a handsome increase to the salary cap to keep the best players from absconding to other leagues, and flow through to the grassroots. “My experience with privately owned teams is, if done right, it’s a really good thing for the sport,” said Australian Test captain Pat Cummins, who was purchased by Sunrisers Hyderabad at the 2024 IPL auction $3.7 million. “You look at an IPL team that’s privately funded, and the amount they put into the team and programs, they do their own development camps and their own talent pathway and academies.\n\n“Our IPL team we have a social media team of about 30 people who travel around, so there’s things that can get unlocked that make the experience better for fans. Then the big question is how do you use those funds to make sure that cricket’s in a really good spot and supporting community cricket as well as professional cricket.” But these leagues are not without their problems. The SAT20 is the third attempt by Cricket South Africa to grow a healthy franchise competition, jointly owned by pay TV service Supersport and a conglomerate of Indian investors. South Africa’s wider economic struggles, particularly in terms of the value of the Rand, is costing millions for team owners each year. Mysore was not shy in saying that there is something of a bubble about the growth of franchise leagues, up to and including the lofty sums paid for teams in the Hundred. “The financial viability in the medium to long term is a very important component,” Mysore said. “In the event that leagues are not financially viable, the future of those leagues will be questioned.”\n\nThe BBL is an attractive proposition for investors, given its history of relative financial success and the fact it is underpinned by Cricket Australia’s place as one of the “big three” nations alongside India and England. But much of the BBL’s strength has derived from taking a very different approach to the franchise model. The tournament co-exists with Test cricket, especially around Boxing Day and New Year, and does not rely on the presence of Cummins, Travis Head or Mitchell Starc playing its full duration. Mysore with established Knight Riders player Sunil Narine. Credit: NurPhoto via Getty Images In turn, that has allowed the Australian Test team to perform at a consistently high level with minimal disruption from the T20 circuit. It’s a dynamic that relies upon a shared sense of purpose between Cricket Australia and the states, who control the BBL teams. CA’s chief executive Todd Greenberg and chair Mike Baird have met with their state association counterparts over the past two weeks in attempts to thrash out details of a potential sale, but are yet to reach consensus. The states hold 30-year licences to the clubs, with a 15-year review clause that comes into effect next year.\n\n“That’s what we’re considering,” Baird told this masthead. “If you did consider private investment, what are the key criteria we would keep. “To individual teams and owners and what they might want, any sort of criteria, that is for us to consider and set the criteria. If we want to make the decision to consider private investment, it would be done on our terms, and done collectively. “The risks and challenges we’ve seen across the world. The beauty is we can take the best of that and put in the terms and conditions that are important to Australian cricket.” Mysore has fond memories of watching Test matches in his hometown of Chennai every January, and respects the traditions of Boxing Day and New Year Tests in Australia.\n\nBut that respect will not stop Mysore and others from asking questions before they decide whether to buy a franchise. In the UK, team owners have pushed for the separate sale of broadcast rights for the Hundred, away from international cricket, so that the value of the tournament is more clearly known. While the big broadcast numbers attracted by the Boxing Day and New Year’s Tests are widely thought to aid the audiences for BBL games in the evenings, franchise owners will want to know which is helping which. Baird has stressed that CA and the states must retain control of whatever privatisation model is ultimately agreed. A decision is expected before the end of the year.\n\n“Certainly, we’d want to control the schedule,” Baird said. “So that Test cricket remains an essential part of the Australian summer.” Cummins said other nations would love to have the commercially successful Test series seen here. “It is a different model to a lot of other countries, but I think it’s a better model,” he said. “They wish they could have five Test matches sold out and everyone watched as well as the BBL. “It’s great we’ve got two tournaments that can run concurrently and there’s a place for both of them.” The global strategy becomes still more attractive if Indian players are available to play outside the IPL. So far, the BCCI has rebuffed inquiries by franchise owners about allowing more freedom of movement, but the recent decision of champion off-spinner Ravichandran Ashwin to quit the IPL and go “global”, potentially to the BBL this summer, shows that the mood is gradually shifting.\n\nMysore declined to comment on whether Indian players would be more freely available to play in overseas leagues in the future, but Baird said this week he was in constant discussions about the matter with Indian authorities. Loading The BBL was effectively bankrolled in its first two years by CA’s slice of the cash from the short-lived T20 Champions League. But in 2013 CA signed a deal with Ten for the tournament for about $100 million over five years. That figure grew again as part of a $1.18 billion overall deal with Foxtel and Seven in 2018, before the current $1.5 billion agreement was signed in 2023. Franchise owners will want a percentage of the broadcast rights value from any future deals. In the meantime, plenty have conveyed their interest to Cummins, over numerous seasons of the IPL. “Three or four of the IPL owners have been like, ‘oh we’d love to get involved’,” Cummins said. “A lot of Indian fans, they’ve grown up watching Australian cricket teams, and they hold Australian cricket in such high regard that the BBL is, in their eyes, a really attractive league they want to be a part of, and they want to be linked to Australian cricket.”",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/afl/lions-young-core-inspires-grand-final-hat-trick-and-they-just-gained-another-member-20250920-p5mwme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lions’ young core inspires grand final hat-trick – and they just gained another member",
    "publish_date": "Sun, 21 Sep 2025 09:53:52 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "For all the superstars who litter the Brisbane Lions’ ranks, at the heart of their charge to last year’s premiership was their quintet of emerging sensations.\n\nWill Ashcroft, Kai Lohmann, Logan Morris, Jaspa Fletcher and Darcy Wilmot triggered a season turnaround in 2024 to break a 21-year title drought. Levi Ashcroft then joined them this year as a star on the rise.\n\nBy Saturday’s preliminary final clash with Collingwood, the sextet had become a seven-man band.\n\nThe Lions’ Ty Gallop celebrates a goal during the preliminary final between Collingwood and the Lions at the MCG. Credit: AFL Photos via Getty Images\n\nTy Gallop was fresh off kicking his maiden AFL goal against the Suns when his vice-captain, Josh Dunkley, hinted that the 19-year-old was on the brink of a breakout performance.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/emma-s-insurance-costs-have-soared-fivefold-it-s-part-of-a-wider-problem-20250916-p5mvhb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Emma’s insurance costs have soared fivefold. It’s part of a wider problem",
    "publish_date": "Sun, 21 Sep 2025 09:40:20 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Insurance premiums have shot up around Australia in the past few years, but for Emma Jordan, the increase has been particularly severe.\n\nAfter her house was damaged in severe flooding of 2022, the 27-year-old says the annual cost of insuring her house in the Victorian town of Echuca skyrocketed from about $2000 three years ago to about $10,000 today, according to quotes she’s received.\n\nEmma Jordan’s insurance costs have surged roughly five-fold since flooding in 2022. Credit: Jason South\n\nThe cost is so high that Jordan’s biggest asset is currently uninsured, although she plans to reassess in the future and could instead take out partial cover for the house.\n\n“I haven’t taken up any insurance at this point because $10,000 a year on insurance isn’t really feasible,” Jordan says.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/optus-ceo-must-fall-on-his-sword-20250921-p5mwov.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Optus CEO 'must fall on his sword'",
    "publish_date": "Sun, 21 Sep 2025 09:20:09 +1000",
    "category": "finance",
    "authors": [],
    "text": "Optus CEO 'must fall on his sword'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw5-liverpool-vs-everton-20250921-p5mwop.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Liverpool vs Everton",
    "publish_date": "Sun, 21 Sep 2025 09:07:01 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW5: Liverpool vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw5-burnley-vs-nottm-forest-20250921-p5mwoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Burnley vs Nott'm Forest",
    "publish_date": "Sun, 21 Sep 2025 09:06:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW5: Burnley vs Nott'm Forest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw5-wolves-vs-leeds-20250921-p5mwor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW5: Wolves vs Leeds",
    "publish_date": "Sun, 21 Sep 2025 09:06:45 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW5: Wolves vs Leeds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/tax-against-meteorites-wild-climate-002643818.html",
    "title": "‘Tax against meteorites’: Wild climate claim",
    "publish_date": "2025-09-21T01:51:25Z",
    "category": "finance",
    "authors": [],
    "text": "Net zero is “like having a tax against meteorites”, Nationals MP Barnaby Joyce has said in a rant in which he did not rule out a future Coalition split over climate.\n\nMr Joyce, a former deputy prime minister, was banished to the opposition back bench earlier this year after back-channelling hard to keep the Liberal and National parties from permanently breaking up.\n\nThe demotion was broadly seen as a check on his power as Nationals leader David Littleproud and Sussan Ley try to build consensus on touchy topics, including climate policy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut booting Mr Joyce from the front bench has only unleashed him as he is no longer required to toe the shadow ministry line, and he has since rallied a band of rebellious Coalition MPs in a push to abandon Australia’s ambitions to reach net zero emissions by 2050.\n\nWith pressure mounting on the Opposition Leader to come up with energy and climate policies, Mr Joyce was asked on Sunday if he would back another Coalition split should Ms Ley ultimately cave to moderates and stick with a green future.\n\nNationals MP Barnaby Joyce says net zero is ‘like having a tax against meteorites’. Picture: Martin Ollman / NewsWire\n\n“Well, that’s not my role – others can decide what they wish to do then,” Mr Joyce told Sky News.\n\n“I think it’s better if we just convince everybody, not just the Liberal Party, but I think Australians in general are over net zero.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“When I walk down the street, I don’t find people running up to me pleading that we stay in net zero.\n\n“I certainly meet lots and lots of people who want to get out, and they’re getting more and more loud all the time.”\n\nPolling has consistently shown a mixed bag when it comes to pursuing net zero.\n\nWhile Australians mostly back it as part of broader efforts to counter climate change, they do not support it at any cost and concerned about reliability.\n\nThough, Labor did take its renewables-driven energy plan to the federal election in May and won a historic landslide.\n\nEnergy experts also overwhelmingly agree that solar and wind are Australia’s cheapest energy options.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Joyce remains unconvinced, arguing that his constituents in the rural NSW electorate of New England are weathering higher power bills due to renewables, and that energy costs will only rise as coal is phased out.\n\nEnergy experts overwhelmingly agree that solar and wind are Australia’s cheapest energy options. Picture: Martin Ollman / NewsWire\n\n“I hope logic wins this debate,” he said.\n\n“It’s like having a tax against meteorites and saying, ‘Look, we’re going to stop meteorites. We’re going to have a tax.’\n\n“And you go, ‘Hang on.’ And every time you argue against it they say, ‘Well, don’t you believe in meteorites? Don’t you understand the damage meteorites will make to kids? Do you understand what meteorites will do to the earth?’\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“No, I understand all that, I just don’t believe your tax is going to stop them and this is the same thing – this net zero is not going to change the weather. It just can’t.”\n\nThe comments came after a week dominated by climate politics.\n\nThe Albanese government on Thursday unveiled Australia’s 2035 emissions reduction target, settling on a range from 62-70 per cent.\n\nIt has pleased few and angered many, with some of the target’s fiercest critics saying it will do little to prevent catastrophic warnings outlined in the climate risk assessment released just days earlier.\n\n‘Vanity project’\n\nMr Joyce also called pursuing net zero a “vanity project”, claiming that what Australia does will have no meaningful impact on global warming.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe has long-argued that Australia’s carbon emissions are minuscule when compared to the likes of the US and China -- the world’s biggest polluters.\n\nHe has also claimed both countries are abandoning net zero.\n\nThe US is doubling down on fossil fuels under the Trump administration and China is building more coal-fired power plants.\n\nBut Beijing is also leading the world in rolling out renewables and met its 2030 target five years ahead of schedule.\n\nClimate Change Authority chair Matt Kean says net zero is not a ‘vanity project’. Picture: Flavio Brancaleone / NewsWire\n\nClimate Change Authority chairman Matt Kean, whose advice informed Australia’s 2035 target, appeared on Sky directly after Mr Joyce and rejected that cutting emissions was about “vanity”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I don’t think that the fishermen in South Australia that are getting smashed by an algal bloom think this is a vanity exercise,” Mr Kean said.\n\n“I don’t think the thousands of people who lost lives and livelihoods during the worst floods our country has ever seen up in Lismore, or the worst bushfires that our country’s ever seen ... I don’t think they think this is a vanity exercise.\n\n“And I don’t think the farmers that are on the front line of this, that have seen the worst drought Australia’s ever seen in recent memory, think this is a vanity exercise.”\n\nHe admitted it is a “reality” that Australia’s emissions are small, but noted that “with our fossil fuel exports, we contribute around 4.5 per cent of global emissions”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“That’s a bit less than 1/20th, so it’s not insignificant,” Mr Kean said.\n\n“And what we know is that the more carbon we put into the atmosphere, the more heat that we’re creating, and the more extreme weather events that will result from that.\n\n“So it is having a catastrophic impact, not only on Australia, but globally, and we need to be part of a global effort to reduce the amount of carbon that we put into the atmosphere to stop or limit global warming so that we can protect our lives and our livelihoods.”",
    "source": "Yahoo",
    "cluster_id": 46
  },
  {
    "url": "https://au.news.yahoo.com/tow-truck-driver-launches-into-action-after-worrying-find-on-road-instantly-knew-010516114.html",
    "title": "Tow truck driver launches into action after worrying find on road: 'Instantly knew'",
    "publish_date": "2025-09-21T01:05:16Z",
    "category": "finance",
    "authors": [],
    "text": "A tow truck driver was going about his usual routine this week when a “distressing” scene on the side of a road prompted him to pull over and launch into action.\n\nRex, who works for Adams Towing on NSW’s Central Coast, told Yahoo News he was heading to a job on Wednesday when something unusual caught his eye, turning a standard call-out into an urgent rescue mission.\n\nWhile travelling along Manns Road in West Gosford, the driver spotted a very upset duck “flapping her wings and quacking very loudly” while looking down a nearby drain.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I instantly knew something was wrong… she was very distressed,” Rex said. “I pulled up in the safest place possible and jumped out of my truck to try to help.”\n\nIt didn’t take him long to figure out what was causing the duck’s worrying behaviour. “I got down on my hands and knees and looked into the drain and to my surprise found 11 baby ducklings staring up at us,” Rex told Yahoo.\n\n“I then tried to unbolt the drain and try and get it open to climb down but was not successful after many attempts.”\n\nConcerned, Rex called the local fire department for backup. Photos show a firefighter standing in the roadside drain, slowly lifting each duckling into the hands of others standing nearby.\n\nRex said he instantly knew 'something was wrong' after spotting the duck's worrying behaviour. Source: NSW Central Coast Incident Alerts, News & Information/Supplied\n\nAfter calling his manager Ashleigh to fill her in on the situation, it was agreed the tow truck driver would stay and help make sure the bird and her ducklings were safe.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I assisted the fire brigade by holding each duckling one by one as he lifted them out from the drain,” Rex explained. “I then popped each baby duckling in a bucket one by one. The mumma duck was watching very closely whilst I was doing this.”\n\nOnce they were removed, the birds were relocated to the nearest creek. “They then waddled off all as a happy family,” Rex said, bringing a happy ending to the story.\n\nAussies praise tow truck driver's kind roadside act\n\nLocals have inundated Rex and the family-owned towing business with praise since details of the impromptu rescue mission were posed online by NSW Central Coast Incident Alerts, News & Information, Ashleigh told Yahoo, noting staff “care strongly from animals and nature, supporting our local wildlife”.\n\nThe duck and her 11 ducklings were relocated to a nearby creek, where they 'waddled off as a happy family'. Source: Supplied\n\nAussies have also shared their delight over the “wonderful” outcome on social media.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Huge accolades to the driver from Adams Towing to notice the stressed mumma duck, to investigate, and then to get help for those babies,” one woman commented.\n\n“What an awesome tow truck driver. Thank you for finding these babies and doing something to help them! Such a good story,” another said.\n\nA few of our feathered friends have found themselves in some tricky situations recently, including a plover chick that was removed from a downpipe on the Sunshine Coast and another that fell down a roadside drain.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 47
  },
  {
    "url": "https://au.news.yahoo.com/call-next-steps-back-ambitious-004834139.html",
    "title": "Call for next steps to back 'ambitious' emissions goal",
    "publish_date": "2025-09-21T00:48:34Z",
    "category": "finance",
    "authors": [],
    "text": "Australia faces pressure to back its controversial climate target with action as the minister in charge bats away questions over a new renewable energy goal.\n\nLabor unveiled its 2035 climate target to criticism from environmental groups and the business sector as it revealed Australia would aim to reduce greenhouse gas emissions by between 62 and 70 per cent compared to 2005 levels.\n\nThe goal aligns with advice from the Climate Change Authority.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut when asked if Australia would follow it up with other mechanisms that would help reach the target, such as a 90 per cent renewable energy goal by 2035, Climate Change Minister Chris Bowen did not offer a firm commitment.\n\nAustralia hasn't locked in a 2035 target for transitioning to renewable energy, the minister says. (Mick Tsikas/AAP PHOTOS)\n\n\"We haven't set a particular (2035 renewables) target,\" he told ABC's Insiders on Sunday.\n\n\"What we have done is set our emissions reduction target and then we'll continue to deliver.\"\n\nAustralia is working towards a target of 82 per cent renewable energy by 2030, but the Australian Energy Market Operator has predicted 90 per cent of the grid would need to be powered by renewables by 2035 to reach net-zero emissions by 2050.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Bowen has backed his government's emissions reduction goal, but assured his government would continue to take other steps.\n\n\"This is very ambitious, it's doable, it's achievable,\" he said.\n\n\"We're making good progress, but I'm not putting my feet on the desk saying that's done.\"\n\nMembers of the Nationals remain opposed to the emissions reduction goals as turmoil over the net-zero target threatens to tear the coalition apart once again.\n\nOutspoken Nationals MP Barnaby Joyce has claimed it would have a \"devastating\" impact on the economy and played down its impact on climate change.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"They always come up with these Calamity Jane statements,\" he told Sky News on Sunday.\n\n\"I think Australians are over net-zero.\"\n\nNationals MP Barnaby Joyce claims the net-zero target would 'devastate' Australia's economy. (Lukas Coch/AAP PHOTOS)\n\nBut Climate Change Authority Chair Matt Kean, whose opinion aligns with the vast majority of climate experts, maintained action must be taken urgently.\n\n\"The more carbon we put into the atmosphere, the more heat that we're creating, and the more extreme weather events that will result from that,\" he told Sky News.\n\n\"It is having a catastrophic impact, not only on Australia, but globally.\n\n\"We need to be part of a global effort to reduce the amount of carbon that we put into the atmosphere - to stop or limit global warming - so that we can protect our lives and our livelihoods.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMany environment groups have warned the current 2035 target does not go far enough.\n\nThe emissions targets landed days after a diabolical report on Australia's expected climate impacts, including a warning that 1.5 million people could be exposed to coastal hazards from rising seas by 2050.",
    "source": "Yahoo",
    "cluster_id": 6
  }
]