[
    {
        "url": "https://www.9news.com.au/national/right-to-disconnect-law-1-in-2-employers-found-to-have-been-approached-by-staff-according-to-robert-half/d63ad302-fe1f-4c17-b3ae-dd977f1a99ed",
        "title": "More than half of employers approached by staff about right to disconnect",
        "publish_date": "Mon, 25 Aug 2025 01:21:11 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Research has found more than half of all employers have been approached by staff exercising their right to disconnect in the 12 months since ﻿new rules were introduced. ﻿\n\nEmployees became legally protected from monitoring, reading or responding to employers or third parties outside of working hours, unless the refusal was unreasonable, one year ago tomorrow.\n\n﻿Since then, 56 per cent of surveyed employers reported formal complaints from staff wanting to use their right, while 15 per cent reported informal feedback or comments, according to recruitment agency Robert Half.\n\nResearch has found that half of all employers have been approached by staff exercising their right to disconnect. (Dion Georgopoulos)\n\nRobert Half commissioned research into 500 hiring managers in finance and accounting, IT and technology and human resources from small to medium, large private and public sector businesses across Australia.\n\nSmall to medium businesses were found to have received 11 per cent more concerns from staff than large businesses.﻿\n\nAnd a staggering 78 per cent of employers in Western Australia ﻿were more likely to receive formal complaints from staff, followed by 62 per cent in Queensland, 43 per cent in NSW and 42 per cent in Victoria.\n\nRobert Half director Nicole Gorton said cultural norms and local industry dynamics played a role in how the legislation is being embraced in different regions.\n\nThe survey found that 93 per cent of employers ﻿had introduced at least one measure to support their staff's right to disconnect.\n\nREAD MORE: ﻿ Mushroom triple murderer arrives at court to face her victims\n\nThe right to disconnect was passed in February 2024 and came into effect in August that same year. (Louise Kennerley)\n\n\"The overwhelming positive response from employers is a clear signal that the right to disconnect has become a catalyst for cultural change,\" Gorton said.\n\n\"The legislation has seen businesses actively adapting their internal processes to build healthier and more sustainable work environments for their people.\"\n\nAs a result of the legislation, ﻿59 per cent of employers reported feeling that staff attitude towards after-hours communication had changed.\n\nEven more, 77 per cent, noticed improved well-being and work-life balance.\n\n\"The right to disconnect has sparked a positive change in workplace dynamics, with employees actively embracing the policy to set healthier boundaries after work hours, challenging the 'always-on' culture that has become so prevalent,\" Gorton said.\n\nThe right to disconnect was passed in February 2024 and came into effect in August that same year.\n\nREAD MORE: ﻿ Australia Post set to open up 3500 new roles\n\n﻿Eligible employees are allowed to refuse to engage in after-hours communication. (Dion Georgopoulos)\n\n﻿Eligible employees are allowed to refuse to engage in after-hours communication, in reasonable circumstances, without the fear of discipline or retaliation.\n\nIf an employer violates these rights, they can be fined up to $18,000 if requests are denied and internal mediation does not work.\n\n﻿Employment Minister Murray Watt said clocking off used to mean time with to yourself or loved ones, but technology had warped that definition.\n\n\"Many workers feel pressured to remain connected to their emails and calls long after they have finished their workday,\" he said when the rules came into effect.\n\n\"It should not be controversial that workers shouldn't be required to do unpaid overtime.\n\n\"The right does not prohibit employers or employees contacting one another.\n\n\"It just means, in most circumstances, an employee does not need to respond until they are back at work.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-teacher-study/e83bbc11-1254-45de-9ec5-620e964c376a",
        "title": "Teaching crisis continues, experts sound the alarm over mental health concerns",
        "publish_date": "Mon, 25 Aug 2025 01:12:10 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Experts are sounding the alarm after a study claimed nine out of 10 Australian teachers are experiencing extreme stress.\n\nTwo-thirds of teachers surveyed told researchers at the University of New South Wales they experienced severe symptoms of depression and anxiety, which is double the national average.\n\nWith 30 per cent of teachers considering leaving before retirement age and 70 per cent finding their workload unmanageable, immediate action is required according to researchers.\n\nRear view of primary school teacher writing on a clear whiteboard in classroom with students. (Getty)\n\n\"It provides a clear and urgent message: our teachers are struggling, and they need support,\" Dr Helena Graziera from UNSW said.\n\n\"Teachers are experiencing mental health symptoms at rates far above the general population, and that these symptoms are closely linked to their workload and intentions to leave the profession.\"\n\nGraziera said teachers are becoming overwhelmed with the amount of work away from the classroom, including administrative duties, compliance requirements and data collection, taking time away from lesson planning and student engagement, and leading to a higher rate of disillusionment.\n\nEarlier this month, thousands of teachers went on strike in Queensland to seek better pay and working conditions over safety concerns.﻿\n\nThe impact on Australian children could be stark, especially in regional or remote areas.\n\nTeachers in these areas reported higher rates of depression, whilst female teachers were more likely to express a desire to leave the profession.\n\nEarlier this month, teachers arounbd Queensland went on strike in protest of better pay and working conditions. (Catherine Strohfeldt)\n\nA high turnover rate of teachers impacts the education students receive in classrooms at all ages.\n\n\"Teachers' mental health is intricately related to students' outcomes, both in terms of students' mental health themselves, but also students' academic achievement,\" Granziera said.\n\nThe study recommended measures to reduce non-essential workload on teachers, as well as better monitoring systems of teacher wellbeing to support teacher retention.\n\n\"This research provides clear evidence that improving teachers' working conditions is not just beneficial, it's essential,\" Graziera said.\n\n\"If we want to retain skilled educators and ensure quality education for all students, we must address the root causes of teacher stress and mental health decline.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-government-fast-tracks-5-per-cent-deposit-first-home-buyer-scheme/46c907ca-702c-4378-bf9b-2466aa76a791",
        "title": "Fast-tracked scheme to help first home buyers",
        "publish_date": "Sun, 24 Aug 2025 23:34:36 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "P﻿rime Minister Anthony Albanese today said the fast-tracking of a government-supported first-home buyer scheme will help give more people a \"fair crack\" at entering the housing market.\n\nThe government guarantor scheme, enabling people to purchase their first home with a 5 per cent deposit, will now begin on October 1, instead of January 1.\n\nAnother ﻿15 per cent of the purchase price is guaranteed by the federal government, ensuring the applicant doesn't pay lender's mortgage insurance.\n\nREAD MORE: Mushroom triple murderer prepares to face her victims\n\nThe federal government is bringing forward its 5 per cent deposit first home buyer plan. (AAP)\n\nResearch shows that this might save young people about eight years of saving, helping them enter the housing market.﻿\n\nThe expansion of the scheme will also scrap the yearly cap on the number of first-home buyers and single parents who have mortgages guaranteed by the government.\n\nSo from October 1, all first home buyers can access the scheme, regardless of income.\n\nProperty price caps are also being raised as part of the changes.\n\nThey still vary state by state, but first home buyers can now access this scheme when they're buying a property as high as $1.5 million in Sydney, and $1 million in Brisbane and Canberra﻿.\n\nREAD MORE: Two killed in car and truck crash in rural NSW\n\nThe government has paused the National Construction Code for builders. (AAP)\n\nThe Treasury has warned the scheme risks spiking house prices.\n\nAlbanese said today supply was the key issue and he wanted people to have a \"fair crack\" at getting a foothold on the housing ladder.\n\nHousing Minister Claire O'Neil told Today this morning the expansion of the scheme was part of the government's strategy of combatting the housing crisis, but acknowledged more work was needed.\n\n\"We're about a year into a five-year target and there's no question that we're going to have to do more,\" she said Today .\n\n\"I can tell you we are leaving no stone unturned here. We are doing everything we can.\"\n\n﻿Yesterday the government announced a halt to the National Construction Code, enabling builders to work quicker.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/labubu-doll-demand-puts-focus-on-pop-mart/5cfb8422-c19b-4ecf-a2e7-9c65956d7c0d",
        "title": "Company behind Labubu dolls struggling to keep up with demand",
        "publish_date": "Mon, 25 Aug 2025 01:40:39 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Like many Labubu fans, 28-year-old American Joselyn Chamorro is over the craze.\n\nWaiting in overnight lines to buy the $US30 ($46) mischievous dolls, or shelling out $US100 to resellers, has lost its appeal. So when she saw a service station in Florida, was selling fake Labubus — known as Lafufus — for $US20, she didn't hesitate to buy one.\n\nTrying to get a real Labubu, \"it's almost like The Hunger Games ,\" Chamorro said.\n\nPop Mart, the Chinese manufacturer of the hugely popular Labubu dolls, expects a revenue of $US4.2 billion this year. (Getty)\n\nJust like an authentic Labubu, it even came in a blind box, meaning the buyer doesn't know the specific doll they're getting.\n\nLabubu's maker, Pop Mart, seems unstoppable. The Beijing-based toy company expects its revenue this year to exceed 30 billion yuan, or $US4.2 billion.\n\nJust in the Americas, revenue soared by more than 1000 per cent year-on-year, according to Pop Mart's semi-annual report released in August. Globally, revenue for Labubus alone skyrocketed 668 per cent in the first half of the year.\n\nBut as rapidly as Labubus have risen in popularity, they could fall just as fast.\n\n\n\nShortages of the creepy-cute dolls, on top of the $US20 to $US40 price tag, have driven shoppers to look for alternatives.\n\nPop Mart's strength lies in its creations that draw a cult following – Labubus, Cry Babies and Molly figurines – but the company still needs to grow past virality, Morningstar analyst Jeff Zhang said.\n\nREAD MORE: Vietnam plans mass evacuation as Typhoon Kajiki intensifies\n\nThe Labubu doll pop-up store at Westfield, Pitt Street, Sydney. (Jessica Hromas) (Nine)\n\n\"Compared with global leaders such as Disney and Sanrio, Pop Mart has yet to demonstrate a sufficiently long track record of generating excess return on invested capital from self-owned IPs,\" Zhang wrote.\n\nAnd in a twist, Lafufu owners aren't afraid to share they have a knock-off.\n\nChamorro's fake is smaller than the real Labubus, and its hands and face may be two different shades. But the palm-sized toy bears holds the same mischievous grin and soft fur that made the original go mind-bogglingly viral.\n\n\"My little monster, even though he's not authentic, he's still really cute in his own little way,\" Chamorro said.\n\nPop Mart isn't playing around\n\nPop Mart has trademarked \"Labubu\" since 2019 in the US and at least 2016 internationally, according to the company's legal filings. And China is cracking down on Lafufus, with its customs agents seizing droves of fakes.\n\nThere's a certain irony in China's possessiveness over its Labubu IP. The country is known for pushing out fakes of practically every well-known brand, accounting for 45 per cent of all reported seizures of counterfeit goods in 2021, according to the Organisation for Economic Co-operation and Development.\n\nPop Mart has launched lawsuits against retailers selling fake Labubu dolls. (Getty)\n\nIt also doesn't rank too highly in the US Chamber IP index, which measures the strength of intellectual property among different nations.\n\nPop Mart Americas recently sued a group of 7-Eleven stores in California for selling counterfeit Labubus. Zhang said more companies may face lawsuits from Pop Mart over Lafufus, but counterfeits might also decrease as Pop Mart ramps up its production.\n\nA consumer standards body in the UK warned fake Labubu dolls could pose a choking hazard for young children. The US Consumer Product Safety Commission, which issued a similar warning, noted a real Labubu will feature a holographic Pop Mart sticker, a scannable QR code linking to the official Pop Mart site and exactly nine teeth; newer Labubus will also have \"a subtle UV stamp on one foot.\"\n\nWhat's driving demand for Labubus?\n\nThese days, you may see more Lafufus on the streets than Labubus, especially as social media has destigmatised the shame of owning knock-off toys.\n\nLafufus are \"a lot more unique looking, you know, the little mess ups and the little quirks … people like that,\" Cassandra Harrison, a 32-year-old from New Jersey, told CNN.\n\nMany of her friends are starting Lafufu collections, and she recently found a wall of Lafufus at a phone repair store inside her local Super Walmart. But at the end of the day, Harrison still ended up purchasing a real Labubu.\n\nTurning Labubu, originally a storybook character, into a beloved plush wasn't exactly dumb luck, said Mark Tanner, managing director of consumer insights newsletter China Skinny . More and more Chinese companies are outpacing their Western competitors with rapid-fire product development, he told CNN.\n\nPop Mart did a lot of work behind the scenes to make the \"blind box\" approach work. Like most consumer trends today, the blind boxes appeal to shoppers who are scrolling through hyper-specific TikTok algorithms.\n\n\"(Pop Mart's strategy) just aligns really well with the way people are consuming information right now, where the algorithm does all the work for them. When you buy a Labubu, you're not having to make any choices,\" Tanner said.\n\nPop Mart also doesn't have the decades-long history as some of its Western competitors. So the company isn't as concerned about retaining loyal customers — it's still busy building its base.\n\nPop Mart has opened at least 50 stores this year around the world, Morningstar said. Morningstar analysts estimate that business outside China will account for 70 per cent of Pop Mart's revenue in 2034, compared with 39 per cent in 2024.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-post-jobs-christmas-black-friday/790dabf3-b836-478d-a2a1-f16b2f0cba95",
        "title": "Australia Post set to open up 3500 new roles",
        "publish_date": "Sun, 24 Aug 2025 22:13:42 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "One of Australia's biggest companies is set to hire more than 3500 people ahead of the Christmas period.\n\nAustralia Post is seeking to expand its workforce, which already consists of around 64,000 people, ahead of the end-of-year major cyber sale events such as Black Friday, as well as the holiday season.\n\nThe company is searching for forklift operators, van and truck drivers, and parcel sorters to help keep up with the massive demand.\n\nAustralia Post is about to experience its busiest period of the year. (Getty)\n\nVictoria is the state in need of the most workers, with 1000 roles available, whilst New South Wales and Queensland each have 900 positions to be filled for the Christmas period.\n\nSue Davies from Australia Post claimed the seasonal workers drafted in made a crucial difference and would benefit all Australians.\n\nOnline purchases surged in the last quarter on the back of end-of-financial-year sales. (Australia Post)\n\n\"Last year, we delivered almost 103 million parcels in the lead up to Christmas, thanks to the help of our seasonal team members,\" she said.\n\n\"Our ability to deliver parcels to customers quickly and reliably depends on the hard work and commitment of every individual we bring on board.\"\n\nAustralia Post currently has over 4000 locations across the country, and made $9 billion in revenue in the 2024 financial year.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-weather-rain-ruins-weekend-spots-for-entire-month-fields-ovals-underwaters/5d7ff8f5-c17a-4abd-944d-d60d1df67575",
        "title": "'Heartbreaking': Hidden toll of Sydney's wettest August in 27 years",
        "publish_date": "Sun, 24 Aug 2025 00:52:00 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "C﻿ountless sporting fields and ovals across Sydney are still underwater following the city's wettest August in 27 years.\n\nThe record deluge has come at a high price for young people – weekend sports.\n\nPerpetually soggy grounds have resulted in soccer matches in some areas being rained out for the past month.\n\nSoggy soccer fields across Sydney have resulted in soccer games being cancelled for a month. (9News)\n\nPresident of Holroyd Soccer Club Danny Rizk told Today it has been a \"heartbreaking\" few weeks for young players.\n\n\"The whole reason we're here is for these kids to to enjoy their sport and get out on the field. And it's it's heartbreaking when we have to tell them, sorry, look, you're not playing,\" Rizk said.\n\n\"That's happened now for four weekends.\"\n\n\"We work extremely hard to keep our kids on the field playing sport, keeping healthy,\" he added.\n\n\"And all this does is just drives them away and keeps them at home on monitors and on screens.\"\n\nHolroyd Soccer Club President Danny Rizk. (9News)\n\nRizk said his one of the local fields in Guildford has poor drainage and is a muddy mess after heavy rain over the past few weeks.\n\nHe said when 75 per cent of the fields are unplayable, the whole round is cancelled.﻿\n\nThe soccer president said synthetic turf is a good way to ensure wet weather doesn't destroy the field.\n\n\"﻿It's not the only solution, but it's definitely a solution,\" he said.\n\n\"Having a few more around the area will definitely keep weekends like the ones that we've had in the past four weeks operating, at least moving in our local area,\n\n\"We've only got one synthetic field and it's just not enough. We had to play 58 games last weekend. That's as an association and they weren't able to play it.\"\n\nThe torrential rain that battering Sydney also caused a giant sinkhole open up on a sporting oval in Cammeray.\n\nLocals first spotted the sinkhole at Tunks Park on Thursday after another big night of rain.\n\nA sinkhole appeared at Tunks Park on Sydney's north shore. (Nine News)\n\nFields with poor drainage mean the grounds can stay wet and soggy for weeks. (9News)\n\nThe sinkhole was pictured close to the goal posts at the park, which has been completely submerged by water.\n\nThursday was the wettest day of the year to date for Sydney.\n\nThe city's monthly rainfall total reached a record 368.8mm by Friday morning,\n\nConditions eased on Saturday﻿ and the sun finally made a long-awaited appearance following Sydney's wettest August since 1998.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/woodman-wickliffe-extends-try-record-at-women-rugby-world-cup/105692694",
        "title": "NZ's Woodman-Wickliffe extends try-scoring record at Women's Rugby World Cup",
        "publish_date": "Mon, 25 Aug 2025 00:26:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Portia Woodman-Wickliffe has extended her Women's Rugby World Cup try-scoring record to 21 as defending champions New Zealand beat Spain 54-8 in York on Sunday.\n\nNew Zealand was made to work hard in the first half of its Group C encounter as it led 21-3 at the break, but found its groove in the second period despite finishing the game with 13 players due to injuries.\n\nJorja Miller and Ayesha Leti-Iiga bagged two tries each, to go with scores by Liana Mikaele-Tu'u, Georgia Ponsonby, Theresa Setefano and Woodman-Wickliffe, who moves two clear of former England international Sue Day on the all-time leading try-scorers list at World Cups.\n\nSpain scored a try with the final play of the game through Ines Antolinez Fernandez to get some reward for a spirited showing.\n\nNew Zealand replacement loose-forward Kaipo Olsen-Baker, who missed the last World Cup with injury, left the field on a stretcher and in tears with a serious leg injury that could end her 2025 campaign after less than 15 minutes on the pitch.\n\nIn other games on Sunday, world number two Canada showed its power with a 65-7 win over Fiji in Pool B, led by a six-try performance from fullback Julia Schell, and South Africa defeated Brazil 66-6 in Pool D at Northampton, with Aseza Hele scoring three of its 10 tries.\n\nJulia Schell was unstoppable for Canada, scoring six tries in the team's 65-7 win over Fiji in York. (Getty Images: Stu Forster)\n\nAlso in Northampton, Ireland got off to a winning start in Pool C, with a 42-14 victory over Japan, while the other Pool D game in Exeter saw France beat Italy 24-0.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/coach-des-hasler-to-leave-gold-coast-titans-end-of-2025-season/105692750",
        "title": "Gold Coast Titans coach Des Hasler to depart club at end of 2025 season",
        "publish_date": "Mon, 25 Aug 2025 00:26:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Gold Coast Titans have announced NRL premiership coach Des Hasler will leave the club at the end of the 2025 season.\n\nHasler will coach the Titans for the remaining two games of the season, against the Dolphins and the West Tigers.\n\nHe joined the club in 2024 on a three-year contract, which was due to end after the 2026 season.\n\nIt followed the sacking of former coach Justin Holbrook.\n\nThe Gold Coast Titans remain at the bottom of the ladder, after four straight losses.\n\nThey have won just five games this season.\n\nThe team lost 32-18 to the New Zealand Warriors on Saturday in front of a home crowd at Robina Stadium.\n\nThe Titans finished the 2024 season in 14th place.\n\nThroughout his coaching career, Hasler has won two premierships and taken five teams to grand finals.\n\nThe Titans thanked Hasler for his service to the club and wished him all the best for the future.\n\nIn a statement, Titans chairman Dennis Watt called Hasler a \"true icon of the game\".\n\n\"While this season hasn't gone as planned, Des has conducted himself with the dignity and class that has defined his entire career,\" Watt said.\n\nThe club is yet to announce a replacement for Hasler for the 2026 season.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/sopranos-good-wife-star-jerry-adler-star-dies/105692620",
        "title": "Jerry Adler, star of The Sopranos and The Good Wife, dies aged 96",
        "publish_date": "Sun, 24 Aug 2025 23:42:40 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Jerry Adler, star of The Sopranos and The Good Wife, has died aged 96 in New York.\n\nAdler died on Saturday local time, according to a brief family announcement confirmed by the Riverside Memorial Chapel.\n\nThe star \"passed peacefully in his sleep,\" Paradigm Talent Agency's Sarah Shulman said on behalf of his family.\n\nNo immediate cause was given.\n\nAdler starred as Tony Soprano's adviser Hesh Rabkin across all six seasons of The Sopranos and played law partner Howard Lyman in The Good Wife.\n\nBut before Adler had ever stepped in front of a film or television camera, he had 53 Broadway productions to his name — all behind the scenes, serving as a stage manager, producer or director.\n\nAdler at the 2013 funeral of The Sopranos star James Gandolfini. (AP: Richard Drew/File)\n\nHe hailed from an entertainment family with deep roots in Jewish and Yiddish theatre, as he told the Jewish Ledger in 2014.\n\nHis father Philip Adler was a general manager for the famed Group Theatre and Broadway productions, and his cousin Stella Adler was a legendary acting teacher.\n\n\"I'm a creature of nepotism,\" Adler told TheaterMania in 2015.\n\n\"I got my first job when I was at Syracuse University and my father, the general manager of Gentlemen Prefer Blondes, called me [because] there was an opening for an assistant stage manager. I skipped school.\"\n\nAfter a long theatre career, which included the original production of My Fair Lady and working with the likes of Marlene Dietrich, Julie Andrews and Richard Burton, among many others, Adler left Broadway during its 1980s slump.\n\nHe moved to California, where he worked on television productions like the soap opera Santa Barbara.\n\n\"I was really getting into the twilight of a mediocre career,\" he told The New York Times in 1992.\n\nWhy are on-screen mobsters Catholic? Photo shows Tony Sopranos and his mobster crew. On-screen mob bosses, like Michael Corleone and Tony Soprano, earn their livelihood from sin. So why do they identify as Catholic?\n\nBut the retirement he was contemplating was staved off when Donna Isaacson, the casting director for The Public Eye and a longtime friend of one of Adler's daughters, had a hunch about how to cast a hard-to-fill role.\n\nSo began an acting career that had him working consistently in front of the camera for more than 30 years.\n\nAn early role on the David Chase-written Northern Exposure paved the way for his time on a future Chase project, The Sopranos.\n\n\"When David was going to do the pilot for The Sopranos he called and asked me if I would do a cameo of Hesh. It was just supposed to be a one-shot,\" he told Forward in 2015.\n\n\"But when they picked up the show they liked the character, and I would come on every fourth week.\"\n\nOther credits included stints on Rescue Me, Mad About You, Transparent and guest spots on shows ranging from The West Wing to Broad City.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/us-open-australian-fan-kicked-out-of-jordan-thompson-match/105692312",
        "title": "Australian booted out of US Open match after Frenchman complains",
        "publish_date": "Sun, 24 Aug 2025 23:20:51 +0000",
        "category": "sports",
        "authors": [],
        "text": "An Australian fan has been booted from Jordan Thompson's US Open first-round victory after repeatedly disrupting Frenchman Corentin Moutet.\n\nIn a see-sawing match between two combustible opponents, Thompson won out 6-2, 6-4, 1-6, 6-3 in two hours and 55 minutes despite a number of distractions.\n\nThe match was being played on Court 7 at Flushing Meadows, meaning spectators are quite close and effectively on court level with the players.\n\nMoutet took issue with someone in the crowd speaking to him during the final game of the first set and umpire James Keothavong stepped in.\n\nJordan Thompson made it through to the second round in almost three hours. (Getty Images: Maddie Meyer)\n\n\"Buddy, please don't talk to the players please,\" he said.\n\n\" If you want to support, that's fine, but not directly at the player. \"\n\nMoutet called a medical timeout after losing the opening set 6-2 to 58th-ranked Thompson and appeared to be struggling physically at times.\n\nAfter holding serve for a 3-2 lead in the second frame, Moutet directed an angry celebration back at that corner of the crowd.\n\nHis coaches, sitting in the same section, tried to calm down their charge as he pointed and shouted past them at the fan.\n\nEventually, Moutet walked away and spoke to Keothavong, pointing back at the crowd.\n\nCorentin Moutet took issue with the fan speaking directly at him during the match. (Getty Images: Maddie Meyer)\n\nThe umpire walked to the section and called out the fan, wearing a gold Australian Socceroos or Matildas jersey from 2018.\n\nKeothavong directed the fan to leave, much to the delight of surrounding fans, who applauded, cheered and chanted \"Nah nah nah nah, hey hey hey, goodbye\".\n\nThe Australian fan remonstrated, shouting back at the fans while collecting his belongings and making his way out of the arena.\n\nThompson maintained his focus to run to a 6-4 win in the second set, before things unravelled in the third as Moutet found a second wind.\n\nThompson received a code violation for launching a ball into the stands after being broken for 4-0, and the French world number 40 jumped out to a 5-0 lead before taking the set 6-1.\n\nMoutet's standard remained high as the pair reached 3-3 in the third, but Thompson shelved his frustrations to break for 5-3 before holding to love to win the match and move into a second-round match with another French leftie, 37-year-old Adrian Mannarino.\n\nIt was a less successful day for fellow Australians Destanee Aiava and Rinky Hijikata, who both lost in straight sets to Italian opponents.\n\nAfter coming through qualifying, Aiava's second main draw at the US Open lasted just 94 minutes as she lost 6-2, 7-6(7/4) to seventh seed Jasmine Paolini.\n\nAnd Hijikata was on court for 10 minutes less as he lost 6-2, 6-1, 6-2 to 32nd seed Luciano Darderi.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/first-ever-female-boundary-umpires-in-afl-history-makers/105691636",
        "title": "'Couldn't stop smiling': First female boundary umpires in AFL",
        "publish_date": "Sun, 24 Aug 2025 22:43:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "After the AFLW season opener between Carlton and Collingwood, boundary umpires Melissa Sambrooks, Kaitlin Barr and Greta Miller were taken into a private room under the guise of getting some feedback.\n\nIn there, boundary coach Darren Wilson told them over the phone that the following weekend, they'd each become the first female boundary umpires to officiate a men's AFL game.\n\n\"We were all in shock,\" Miller told ABC Sport,\n\nShe and Sambrooks officiated Carlton and Essendon's game on Thursday, while Barr umpired North Melbourne and Adelaide's game at Docklands on Saturday.\n\n\"It just felt like a blur. That whole night my hands were shaking, I couldn't stop smiling. My cheeks hurt but it just felt so surreal,\" Miller said.\n\n\"I couldn't go to sleep [that night] because it felt like Christmas.\"\n\nBoundary umpiring can be especially challenging due to the physically and running capability required. (Getty: Robert Cianflone)\n\nThankfully for the Miller, the night came around very quickly, helping with the nerves and anticipation.\n\n\"As it got closer, I had to switch on and 'OK, job starts now',\" she said.\n\n\"I just treated it the same [as any game]. I still had nerves, but it was just making me perform better, just go to a higher level.\"\n\nBoth Miller and Sambrooks started umpiring at just 12 at their local footy league — both in search of some extra pocket money — while Barr took it up in her final year of high school.\n\nAll progressed through VFL and AFLW.\n\nIniativies by the AFL have seen female participation increase by 72 per cent in the last three years across all levels of umpiring. (Getty: Robert Cianflone)\n\nWhile Eleni Tee (100 games) and Chelsea Roffey (300 games) have broken new ground in field and goal umpiring respectively, there remain few female umpires at AFL level.\n\nIn 2022, women made up just 10.8 per cent of umpires across all levels and 2.6 per cent at AFL level.\n\nThat number has increased to just under 20 per cent (a 72 per cent increase) across all levels in the past three years, according to the AFL, with women making up 36 per cent of the AFLW umpire list.\n\nMelissa Sambrooks started umpiring when she was 12 at local league football and eventually progressed through VFL and AFLW. (Supplied: Melissa Sambrooks/Dylan Burns)\n\n\"Once you start running W games, you're running with ex-AFL umpires and the advice they give you excels your experience and skills. That's where I just took a big leap in my career,\" Miller said.\n\n\"Hopefully in the next couple of years, it just becomes so normal for female umpires to come through the AFL.\"\n\nOne of the challenges in getting women and girls into boundary umpiring, Sambrooks said, is the physicality and running capability required.\n\n\"You have to be such a good runner but also have the strength and abilities to throw the ball in whilst incorporating in reading the play, understanding what's happening, the positioning,\" Sambrooks said.\n\n\"So as much as a lot of people go, 'Oh, they're just running the boundary', there is so much more to it … but it's not something that's impossible, as we've shown.\"\n\nMiller said there was some nice symmetry in that she umpired the AFL women's exhibition game between Melbourne and the Western Bulldogs in 2015 at the MCG and was back 10 years later.\n\nKaitlin Barr officiated Saturday's match between North Melbourne and Adelaide. (Getty: Morgan Hancock)\n\nShe and Sambrooks officiated the very first AFLW game in 2017 together, while Barr umpired last year's AFLW grand final between North Melbourne and Brisbane.\n\nThey ran 16 kilometres during Thursday's match at the MCG.\n\n\"The first quarter was really tough without a goal in the first 15 minutes,\" Sambrooks said.\n\n\"Just continuous turnovers and having to work hard … Luckily, it was a little bit more consistent with goals for the rest of the game after that, but yeah, really big Ks and definitely tough on the body.\"\n\nFan of boundary umpires Olivia Grcic holds up sign during the North Melbourne and Port Adelaide AFLW game on Sunday afternoon. (Supplied: author.)\n\nAfter the game, Miller said the moment started to really sink in as the messages poured in from friends and family.\n\n\"I saw the AFL post something, and people are coming up to me, and they're like, 'Oh, you've made history',\" Miller said.\n\n\"Now I'm just like, wow, we myself, Mel and Kailtin, we're history makers now, and hopefully we're what makes younger girls look up to us and then want to do what we do too.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/gold-mine-buys-agricultural-land-in-katanning-great-southern/105686334",
        "title": "Gold miner's 860ha farmland buy-up 'last piece of the puzzle'",
        "publish_date": "Sun, 24 Aug 2025 22:29:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "A rural community in Western Australia's Great Southern has welcomed the $35 million sale of farmland to a gold exploration and development company, saying it creates economic diversity for the region.\n\nAusgold has purchased 860 hectares from four farming families for its Katanning Gold Project, 290 kilometres south-east of Perth.\n\nThe sale includes the land acquisition, as well as compensation and relocation of the families involved.\n\nShire of Katanning President Kristy D'Aprile said the land purchase provided some certainty for the community after a long period of time.\n\n\"The mine is something we've talked about and been expecting for around 40 years, this recent announcement is progress for us,\" she said.\n\nKristy D'Aprile has lived in the town for more than 20 years. (ABC Asia: Sophie Johnson)\n\nCr D'Aprile said the sale provided the town with an opportunity to diversify.\n\n\"This will definitely change the landscape of Katanning, but the change in that land use will provide economic opportunities,\" she said.\n\n\"As a shire, we have been looking at how other shires deal with mining, and how that changes and diversifies that community.\"\n\nAusgold has purchased more than 800 hectares of farmland in WA's Great Southern region. (ABC Great Southern: Sophie Johnson)\n\n'Another piece of the puzzle'\n\nAusgold executive chairman John Dorward said the land acquisition was critical to the project's future.\n\n\"This farmland is integral to the Katanning Gold Project,\" he said.\n\n\"It's taken a while to get to, but we are happy now that we have a framework to move on.\"\n\nAusgold says the new agreement allows the company immediate access to four farming properties. (Supplied: Ausgold)\n\nMr Dorward said reaching the agreement brought an end to legal proceedings under which the company was aiming to assert its right to mine.\n\n\"The trial had started in the Wardens Court, but we were able to come to a commercial settlement outside rather than having to rely on it,\" he said.\n\nJohn Dorward says the company is keen to increase its landholdings in the area. (Supplied: Ausgold)\n\nMr Dorward said the \"considerable\" land acquisition allowed Ausgold to increase the buffer zone around the project, meaning it could look to expand further.\n\n\"What we are doing now is a quick update to our feasibility study that will show more gold production coming in over the life of the mine, which is really positive,\" Mr Dorward said.\n\n\"Over the course of the last 12 months, we've gone from a land holding of less than 50 hectares to around 2,000 hectares, and this was really the last major piece of the puzzle for us.\"\n\nAusgold says it will begin mining in 2027. (Supplied: Perth Mint)\n\nHe confirmed Ausgold was interested in increasing its landholding further.\n\n\"There are some additional parcels of land we would be interested in, but that is later in our 10-year mine life,\" he said.\n\n\"We will start mining early 2027, construction activities will be commencing around the middle of next year.\"\n\nAusgold has bought more farming land to continue its gold mine project. (Supplied: Ausgold)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/virginia-giuffre-memoir-jeffrey-epstein-to-be-released/105692304",
        "title": "Epstein accuser Giuffre wrote a memoir. Months after her death, it's coming out",
        "publish_date": "Sun, 24 Aug 2025 22:06:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "A posthumous and \"unsparing\" memoir by Virginia Giuffre, who alleged she was trafficked for sex to Prince Andrew by Jeffrey Epstein, will be published later this year.\n\nThe cover image released by Knopf for Nobody's Girl. (AP: Alfred A. Knopf)\n\nNobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice is scheduled for release this October, publishing house Alfred A Knopf confirmed to The Associated Press.\n\nMs Giuffre, who took her own life in April at age 41, had been working on Nobody's Girl with author-journalist Amy Wallace and had completed the manuscript for the 400-page book, according to Knopf.\n\nThe publisher's statement includes an email from Ms Giuffre to the journalist a few weeks before her death, saying that it was her \"heartfelt wish\" the memoir be released \"regardless\" of her circumstances.\n\n\"The content of this book is crucial, as it aims to shed light on the systemic failures that allow the trafficking of vulnerable individuals across borders,\" the email reads.\n\n\" It is imperative that the truth is understood and that the issues surrounding this topic are addressed, both for the sake of justice and awareness. \"\n\nMs Giuffre had been hospitalised following a serious accident on March 24, the publishing house said, and sent the email on April 1.\n\nShe died at her property in Neergabby in the shire of Gingin, about 80 kilometres north of Perth, on April 25.\n\n\"In the event of my passing, I would like to ensure that NOBODY'S GIRL is still released. I believe it has the potential to impact many lives and foster necessary discussions about these grave injustices,\" she wrote to Wallace.\n\nPrince Andrew, Virginia Giuffre, and Ghislaine Maxwell pictured in 2001 when Ms Giuffre was 17. (Supplied)\n\nIn 2023, The New York Post reported that Ms Giuffre had reached a deal \"believed to be worth millions\" with an undisclosed publisher.\n\nKnopf's spokesperson, Todd Doughty, said she initially agreed to a seven-figure contract with Penguin Press, but moved with acquiring editor Emily Cunningham after Knopf hired Cunningham as executive editor last year.\n\n'Intimate, disturbing new details'\n\nMs Giuffre had stated often that in the early 2000s — when she was a teenager — she was caught up in Epstein's sex-trafficking ring and exploited by Prince Andrew and other influential men.\n\nKnopf's statement says the book contains \"intimate, disturbing, and heartbreaking new details about her time with Epstein, Maxwell and their many well-known friends, including Prince Andrew, about whom she speaks publicly for the first time since their out-of-court settlement in 2022\".\n\nEpstein was found dead in a New York City jail cell in 2019 in what investigators described as a suicide.\n\nHis former girlfriend and associate, Ghislaine Maxwell, was convicted in late 2021 of sex trafficking, recruiting and grooming girls for Epstein to abuse.\n\nThe Duke of York has repeatedly denied Ms Guiffre's accusations that he forced her to have sex more than two decades ago at the London home of Maxwell, and allegations he abused her at Epstein's properties in Manhattan and the British Virgin Islands.\n\nFamily confirms death of Jeffrey Epstein accuser Virginia Giuffre Photo shows Virginia Giuffre stands on a balcony with Cairns harbour behind her. Virginia Giuffre, who alleged she was trafficked for sex to Prince Andrew by Jeffrey Epstein, dies by suicide at the age of 41.\n\nIn 2022, Ms Giuffre and Prince Andrew reached an out-of-court settlement after she sued him for sexual assault.\n\nNobody's Girl is distinct from Ms Giuffre's unpublished memoir, The Billionaire's Playboy Club, referenced in previous court filings and initially unsealed in 2019.\n\nThrough Mr Doughty, journalist Wallace says she began working with Ms Giuffre on a new memoir in spring 2021.\n\nDonald and Melania Trump pose with Jeffrey Epstein and Ghislaine Maxwell at the Mar-a-Lago club in Palm Beach in 2000. (Getty Images: Davidoff Studios)\n\nKnopf publisher and editor-in-chief Jordan Pavlin, in a statement, called Nobody's Girl a \"raw and shocking\" journey and \"the story of a fierce spirit struggling to break free\".\n\nTrump says Epstein 'stole' Giuffre\n\nIn July, US President Donald Trump told reporters that Epstein had \"stolen\" Ms Giuffe from Mar-a-Lago, his private club in Florida, where she once worked.\n\nShe had alleged being approached by Maxwell and hired as a masseuse for Epstein.\n\nMaxwell has denied Giuffre's allegations.\n\nThe ghost of Jeffrey Epstein haunts the world's most powerful men Photo shows A composite image of close-up headshots of Rupert Murdoch and Donald Trump. The destinies of the world's most powerful men are all colliding with the ghost of Jeffrey Epstein.\n\nMr Doughty declined to provide details about the Epstein associates featured in Nobody's Girl, but confirmed that Ms Giuffre made \"no allegations of abuse against Trump\", who continues to face questions about Epstein, the disgraced financier and his former friend.\n\nMs Giuffre's time with Epstein is well-documented, although her accounts have been challenged.\n\nShe had acknowledged making mistakes, errors she attributed to trying to recall events from years ago.\n\nIn 2022, she dropped allegations against Alan Dershowitz, saying in a statement at the time that she may \"have made a mistake in identifying\" the famed lawyer as an abuser.\n\n\"Nobody's Girl was both vigorously fact-checked and legally vetted,\" a Knopf statement reads.\n\nMs Giuffre's co-author on her memoir, Wallace, is an award-winning magazine and newspaper reporter whose work has appeared in The New York Times and The Los Angeles Times, among other publications.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/queensland-ballet-academy-boys-only-classes-brisbane/105681638",
        "title": "Boys take up ballet to improve strength and sporting skills",
        "publish_date": "Sun, 24 Aug 2025 21:51:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Boys are discovering a new way to build strength and flexibility, but it is not in the gym or on the footy field.\n\nThey are learning ballet, which is very different from how it used to be, according to Queensland Ballet Academy director Christian Tàtchev.\n\n\"I think we're still seen as men in tights running around after a swan or another spiritual creature, which is really not the case anymore,\" he said.\n\n\"The industry has changed, it's evolved. Dancers are much more dynamic, athletic. We're seen as elite athletes now.\"\n\nChristian Tàtchev says the academy is committed to running the classes long-term. (ABC News: Stephanie Smail)\n\nThe academy is offering free, boys-only classes in a bid to get more boys into ballet.\n\n\"We wanted to create an environment where they felt safe, they felt included, they felt supported and to create their own community,\" Mr Tàtchev said.\n\nThe academy aims to create a safe and inclusive environment for boys. (ABC News: Stephanie Smail)\n\nMr Tàtchev said that for some of the boys, ballet classes were helping them boost broader skills.\n\n\"Some of these boys use it as a supplementary training for sports activity,\" he said.\n\n\"We have someone who plays basketball, so they come here to improve their coordination and fitness and flexibility.\"\n\nHe said others were focused wholly on their dancing.\n\nIt's a primal thing\n\nQueensland Ballet Academy ballet master and choreographer Paul Boyd has danced professionally around the world.\n\n\"You should never underestimate the power of a male dancer, it's quite extraordinary,\" he said.\n\nPaul Boyd says young Australian men are not exposed to ballet. (ABC News: Stephanie Smail)\n\nMr Boyd said the stigma associated with men doing ballet had changed since he started his career at Wagga Wagga in regional New South Wales in the 1960s, but not enough.\n\n\"I think young men, especially in Australia, they're not really brought up with dancing and ballet,\" he said.\n\n\"But it's one of the most primal things we do. In other countries, male dancing is very very normal.\n\n\"Greece, Italy, so many different places.\n\n\"But here in Australia we're very reserved about it, especially about ballet.\"\n\nThe Queensland Ballet Academy is hoping to get more boys into ballet. (ABC News: Stephanie Smail)\n\nMr Boyd said he hoped more boys would get to learn the benefits of ballet and he thought these classes could help.\n\n\"You get a different energy when you get a whole heap of men or young men in the room with a male teacher,\" he said.\n\n\"And we've all been dancers at a principal level, so we know what is needed.\"\n\nLess floaty arms, more strength\n\nLucas Goodridge, 12, joins the class at the academy's Brisbane studios every Wednesday night.\n\n\"My mum said if I wanted to be good at hip hop, I had to do ballet,\" he said.\n\n\"So, grudgingly, I did one class and I just liked it and I kept going back, over and over again, and I just started to really like it and here we are now.\"\n\nLucas Goodridge says he enjoys ballet class. (ABC News: Stephanie Smail)\n\nLucas travels from the Sunshine Coast, north of Brisbane, to attend school and his boys-only ballet classes.\n\n\"It's more social and you don't feel like you're singled out because you're with people that are like you,\" he said.\n\n\"There's a male teacher, and you do more male technique and less floaty arms, and more jumps and strength, which is really good.\"\n\nAlfred Grant, 13, said dancing in a class full of boys was a welcome change.\n\nAlfred Grant says it is the first time he has danced with other boys. (ABC News: Stephanie Smail)\n\n\"In my old town [north of Melbourne] I was the only boy in the whole ballet school, so there weren't many teachers or people to teach me how to dance like a boy,\" he said.\n\n\"So it's been really nice to dance with other boys, so I can learn off them as well.\"\n\nMr Tàtchev said the academy was committed to running the classes long-term.\n\n\"We want to create this community and encourage these young men that one day will be fathers, brothers and friends of others interested in the art form,\" he said.\n\n\"We just need to start somewhere.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/federal-politics-live-august-25/105686590",
        "title": "Live: Albanese dismisses tax warning as 'academic' speak",
        "publish_date": "Sun, 24 Aug 2025 21:18:17 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Joshua Boscaini",
            "Stephanie Borys",
            "Patricia Karvelas"
        ],
        "text": "Senate President Sue Lines at the grand re-opening of Standing Orders! (ABC News: Simon Beardsell)\n\nWe were full of (coffee) beans this morning as parliament officially marked the re-opening of one of parliament's most iconic venues: our coffee hub.\n\nThe hole-in-the-wall kiosk replaced a coffee cart in the press gallery and despite costing the taxpayers a fair chunk of change to open up under the previous Morrison government, it was never officially given a name (other than the coffee hub).\n\nThat was until friend of the blog Claudia Long came along. She had a dream to rename the hub Standing Orders. So when we met with Senate President Sue Lines for our blog Q & A, we put the question to her.\n\nAnd today, Lines officially declared Standing Orders open for business (to be clear, it never closed. You can't deprive journalists, political staffers and other parliament employees of our caffeine fix).\n\n\"The speed with which this has happened has restored my faith in bureaucracy. No one understands standing orders - literally - more than President Sue Lines!\" Long said in an exclusive quote (aka her leaning over the desk wall to tell me).\n\nWe're told this hopefully just the first naming of many things around Parliament House. Personally, I have my fingers crossed that we get names for the many courtyards around the building (which are named after random letters and tbh I get lost).\n\nSo dear readers, do you have a suggestion? If so let us know in the comments section.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/north-queensland-anglican-diocese-enters-receivership/105684732",
        "title": "Church diocese goes into receivership following abuse claims",
        "publish_date": "Sun, 24 Aug 2025 21:18:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "A church diocese covering a third of Queensland has entered receivership to help fund ongoing compensation payments to victims of child sex abuse.\n\nThe Anglican Diocese of North Queensland covers 75 congregations, from the Torres Strait to Mackay and west to Mount Isa.\n\nSV Partners directors Michael Brennan and David Stimpson have been appointed as receivers.\n\nThe Anglican Diocese of North Queensland stretches across the state's north and central regions. (ABC News)\n\nThe financially troubled diocese successfully obtained an order from the Supreme Court of Queensland on August 22 to appoint receivers to all its assets.\n\nA spokesperson for the diocese said \"applying for such relief was a solemn and difficult decision\".\n\n\"Despite the appointment of receivers, the diocese remains conscious of its moral and financial obligations to survivors of historic abuse,\" they said.\n\n\"The diocese is committed to truth, justice and healing for those who have suffered so profoundly in the past.\"\n\nThe application was made by the diocese earlier this year, with the hope a financial restructure would allow the diocese to sell assets.\n\nRepresentatives from the church have met with schools and aged care service providers in the affected region, but as separately incorporated entities, they will not be directly impacted.\n\nThe diocese previously told the ABC it needed to source about $8 million to pay victims. (ABC News: Nathan Morris)\n\nReceivership follows abuse redress claims\n\nThe National Redress Scheme requires participating institutions to compensate victims of historic abuse through a claims process.\n\nIn May, North Queensland Bishop Keith Joseph told the ABC the diocese would need to find about $8 million to pay victims of child sexual abuse.\n\n\"There were some truly evil individuals in the past,\" he said.\n\n\"We want to acknowledge the harm done while upholding our moral and legal responsibilities.\"\n\nKeith Joseph heads the North Queensland diocese. (ABC News: Sofie Wainwright)\n\nBishop Joseph would not specify how many claims had been made against the diocese, but said none had occurred in the past 25 years, with most cases in the 1960s to 1980s.\n\nEach of the 23 Anglican dioceses in Australia operates separately, headed by bishops.\n\nThe North Queensland diocese, first established in 1883 and based in Townsville, has already sold its office space and bishop's residence.\n\nA spokesperson for the diocese said the goal of appointing receivers was to have as little impact as possible on the church's congregations.\n\n\"The focus of the receivers is to do all they can to secure the financial position of the diocese, so it can continue its service to the region,\" they said.\n\n\"This is a unique set of circumstances and it is very early in the receivership.\"\n\nEditor's note (25/08/25): This story has been edited to clarify that the diocese has not defaulted on payments to the victims of child sex abuse.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/wa-elective-surgery-delays-analysis/105681268",
        "title": "Why 'record' investment isn't fixing WA's health system",
        "publish_date": "Sun, 24 Aug 2025 21:15:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "West Australians are continually told they have a \"world-class\" health system, growing ever better thanks to \"record\" government investment.\n\nBut for many it doesn't feel like a world-class system, with ramping records being broken again this year and more than 100 elective surgeries being cancelled last week to make room for emergency patients.\n\nOne patient told the ABC she'd been waiting nearly a year for complex surgery to remove a tumour behind her jaw which was meant to happen within 90 days, and now doesn't have a date.\n\nThere are lots of different ways to understand this issue.\n\nLooking at the total amount given to WA Health each financial year by the state government doesn't paint the full picture, because it doesn't include Commonwealth funding, but it illustrates an important point and gives us a long-term view of the situation.\n\nThe darker line shows what the spend would look like adjusted for inflation.\n\nThe health budget rises each year, so the government can always claim to to be making \"record\" investments.\n\nSince 1999/2000 it's grown 313 per cent, which sounds huge.\n\nBut it doesn't account for inflation.\n\nThe WA Health budget rises each year, but against inflation and a rising population, is it keeping pace? (ABC News: Jake Sturmer)\n\nFactor that in and you get a 99 per cent increase over the same period.\n\nBut that misses another important measure — how many people the health system is caring for.\n\nUsing the state's population as an estimate, budget dollars per person have risen over the last quarter of a century by around 158 per cent.\n\nBut factor in inflation and that growth gets much smaller, at 24 per cent per person in 2024/25 dollars.\n\nOf course, this is an oversimplification — it's hard to capture the complexity of the health system over a long period.\n\nTechnology has improved, making some treatments cheaper and quicker.\n\nAt the same time, new pathways for treatment have opened, creating new patients who might not have been able to be treated previously, which adds cost to the system.\n\nAll of this is even more of a problem because the percentage of West Australians aged over 65 at the end of each financial year is growing and the aged care system isn't coping, forcing some into hospital emergency departments.\n\nDoctors say all this has eaten away at reserve capacity in the health system, meaning when an event largely out of your control comes around — like a particularly bad flu season this year — there's little wiggle room left.\n\nPublic hospitals in Perth cancelled some elective surgeries last week as emergency departments were put under pressure. (ABC News: Keane Bourke)\n\n\"As long as we can move patients through the emergency department, we have flow to see the new patients coming in, we can cope with those busier periods,\" Australasian College for Emergency WA Deputy Faculty Chair Eve Foreman said.\n\n\"When we can't move the patients out of the emergency department into the hospital … that's when we have issues with ED feeling busier than it would do normally.\"\n\nTaking the pulse of WA’s health system Photo shows A paramedic standing alongside a parked ambulance outside a hospital. Western Australia’s ailing health system has once again been in the spotlight this week, but the remedy to its problems remains elusive.\n\nED patients are by-and-large those most in need of medical care, so hospitals have to find a way to meet that demand.\n\nSo when there's a higher-than-usual number of very ill patients being rushed into emergency departments — as there was last week — hospitals have few levers to pull but to cancel elective surgery to free up space.\n\n\"It's part and parcel of managing a health system which is, at the moment, managing one of the most severe winter flu seasons on record, so we thank people for their patience,\" Premier Roger Cook said on Thursday, adding it was always doctors who made decisions about how urgent a surgery is.\n\nThat, of course, ignores the fact that if it were up to doctors there wouldn't be elective surgeries in the first place because there would be enough hospital beds and operating theatres and staff to treat people when they need it.\n\nLast week the WA government announced a $50 million fund to fix ageing hospitals. (ABC News: Keane Bourke)\n\n\"If there was a quick fix or a silver bullet, someone would have found it,\" Amber-Jade Sanderson, who was Health Minister until March, said during the week.\n\nIt's why the increased funding to date hasn't solve the problem, and why experts continue to call for wholesale system reform, from access to GPs to catch problems early through to expanded hospital capacity and more discharge options instead of keeping people in hospital beds once they're better\n\nPatient's surgery cancelled after 350-day wait Photo shows A woman sits in her home, being interviewed A patient caught up in the immense pressure being placed on WA hospitals says her planned surgery being cancelled has put her under significant stress and eroded her trust in the health system.\n\nThe government's promise last week of $50 million to fix aging hospitals and conduct an audit to identify issues has bought it some time after a week of embarrassing media coverage of problems at Sir Charles Gairdner Hospital.\n\nEfforts to convince the federal government to provide more aged care support including a premier-led delegation to Canberra next week also give it some cover.\n\nBut without meaningful change in the health of the health system, the government may head into the 2029 election having spent four years on the defensive about one of its most critical responsibilities.\n\nThere are few curlier questions in politics than how to manage the myriad demands on the health system.\n\nAnd there are few more critical issues for the Labor government to solve, both for our health and for its own political survival.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/alexandra-eala-makes-philippines-history-at-us-open/105692338",
        "title": "'They make me feel like I'm home': Filipina makes history at US Open",
        "publish_date": "Sun, 24 Aug 2025 21:07:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alexandra Eala has made history by becoming the first player from the Philippines to win a major singles match in the Open era with a stunning comeback to beat 14th-seeded Dane Clara Tauson 6-3, 2-6, 7-6 (13-11) at the US Open.\n\nAfter splitting the first two sets, Tauson raced out to a 1-5 lead in the deciding set, only for 20-year-old Eala to win the next five straight games, not giving her opponent a single look at a match point.\n\nTauson finally got back on the board to make it 6-6 and force a 10-point tiebreak to decide the match, with Eala holding her nerve and sending the crowd into raptures with a tense 13-11 win.\n\n\"To be Filipino is something I take so much pride in,\" the world number 75 said in her on-court interview.\n\n\"I don't have a home tournament so to be able to have this community here at the US Open, I'm so grateful that they make me feel like I'm home.\"\n\nEala shocked the tennis world with a run to the semifinals of the Miami Open in March, beating former French Open champion Jeļena Ostapenko, reigning Australian Open winner Madison Keys, and then-five-time major winner Iga Świątek on the way.\n\nEarlier, former champion Emma Raducanu exorcised some US Open demons, earning her first victory at the tournament since lifting the trophy in 2021.\n\nFour years after lifting the trophy, Emma Raducanu has finally claimed another win in New York. (Getty Images: Clive Brunskill)\n\nThe Briton could not get past the first round in her past two appearances after winning it all as a qualifier four years ago, but she got on the right track this time around with a near-pristine performance to beat Japan's Ena Shibahara 6-1, 6-2 in the first round.\n\n\"It's my first win here since 2021, so it's extra special,\" said Raducanu, who joined up with new coach Francisco Roig this month.\n\n\"First round's always difficult — especially at a slam.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nRaducanu sprinted through the opening set, making just four unforced errors and winning the first five games as the Japanese qualifier did herself no favours with a pair of early double faults.\n\nShe got off to another hot start in the second set, winning the first four games and saving the only break point she faced in the sixth game, before forcing her opponent into an error on match point from the baseline.\n\nShe next faces qualifier Janice Tjen, who became the first Indonesian to win a main draw grand slam match in 22 years by beating 24th seed Veronika Kudermetova 6-4, 4-6, 6-4.\n\nWorld number one and defending champion Aryna Sabalenka, and local stars Ben Shelton and Taylor Fritz, were among the other early straight-sets victors.\n\nFour-time US Open winner Novak Djokovic also made it through in straight sets — 6-1, 7-6(7/3), 6-2 — although admitted it was a \"strange match\" against American 19-year-old Learner Tien.\n\nAfter tearing through the opener in just over 20 minutes, the second set lasted over an hour as Djokovic appeared fatigued at different times.\n\nThe 37-year-old held his nerve to win the tiebreak before reverting to his usual form to close out the match 6-2.\n\n\"It was quite a strange match,\" he said.\n\n\"When you come to the late 30s it's really about trying to preserve the energy for what matters.\n\n\"I still have the flair, I still have the drive. At times I wish I was younger … but hopefully I can keep it going.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/asx-markets-business-news-live-updates-august-25/105691616",
        "title": "Live: Wall Street surges on Powell speech, ASX jumps on opening",
        "publish_date": "Sun, 24 Aug 2025 21:01:13 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Michael Janda",
            "Stephanie Chalmers"
        ],
        "text": "In annals of corporate raiding, President Donald Trump's extraordinary $US10 billion deal with chipmaker Intel is right up there for audacity and sets a new benchmark for \"state capitalism\" in the US.\n\nMr Trump said the US government would convert current and future government grants into equity, which would give it a 10% stake in the company.\n\nThat holding will make the US government Intel's biggest shareholder, ahead of the likes of investing behemoths like Vanguard (8.8%), BlackRock Institutional Trust (5.5%) and State Street Global Advisors (4.6%).\n\nGenerally, a corporate raid of such magnitude would attract a hefty premium, however the US government managed to get the stake for an absolute steal; a 20% discount to the Intel's share price immediately before the deal was made public.\n\nAs Reuters noted, the deal puts Mr Trump on better terms with Intel CEO Lip-Bu Tan, after the president recently said the CEO should step down due to conflicts of interest.\n\nIt will also ensure that the chipmaker will receive about $10 billion in funds for building or expanding factories in the US.\n\nHowever, the deal is not exactly a fool-proof investment for US taxpayers given the recent troubles at Intel and the underperformance of its chips compared to the likes of Nvidia and Advanced Micro Devices.\n\nGovernments are also notoriously bad stock pickers, with a penchant for pouring in good money after bad.\n\nHere's more from Reuters:\n\nUnder the agreement, the U.S. will purchase a 9.9% stake in Intel for $8.9 billion, or $20.47 per share, which represents a discount of about $4 from Intel's closing share price of $24.80 on Friday.\n\nThe purchase of the 433.3 million Intel shares will be made with funding from the $5.7 billion in unpaid grants from the Biden-era CHIPS Act and $3.2 billion awarded to Intel for the Secure Enclave program, also awarded under Trump's predecessor, Democratic President Joe Biden.\n\nIntel stock rose roughly 1% in the extended session on Friday after closing up 5.5% during regular trading.\n\nTrump met with Tan on Friday, a White House official said.\n\nThat followed Trump's August 11 meeting with the Intel CEO after Trump demanded that Tan resign over his ties to Chinese firms.\n\n\"He walked in wanting to keep his job and he ended up giving us $10 billion for the United States. So, we picked up $10 billion,\" Trump said on Friday.\n\nCommerce Secretary Howard Lutnick said on X that Tan had struck a deal \"that's fair to Intel and fair to the American People.\"\n\nThe Intel investment marks the latest unusual deal with U.S. companies, including a U.S. government agreement allowing AI chip giant Nvidia to sell its H20 chips to China in exchange for receiving 15% of those sales.\n\nOther recent deals include an agreement for the Pentagon to become the largest shareholder in a small mining company, MP Materials, to boost output of rare earth magnets and the U.S. government's winning a \"golden share\" with certain veto rights as part of a deal to allow Japan's Nippon Steel to buy U.S. Steel.\n\nThe federal government's broad intervention in corporate matters has worried critics, who say Trump's actions create new categories of corporate risk.\n\nAhead of the U.S. deal with Intel, Japan's SoftBank agreed to take a $2 billion stake in the chip maker on Monday.\n\nSome industry observers still question Intel's ability to surmount its problems.\n\nDaniel Morgan, senior portfolio manager at Synovus Trust, said Intel's problems are beyond a cash infusion from SoftBank or equity interest from the government, singling out Intel's contract chip manufacturing business, known as its foundry unit.\n\n\"Without government support or another financially stronger partner, it will be difficult for the Intel foundry unit to raise enough capital to continue to build out more Fabs at a reasonable rate,\" he said.\n\nThe government's stake is to be passive ownership and does not include a board seat, Intel said.\n\nThe government will be required to vote with Intel's board when shareholder approval is necessary, with \"limited exceptions.\" Intel did not specify the exceptions.\n\nThe equity stake also includes a five-year warrant at $20 a share for an additional 5% of Intel stock, which the U.S. can use if Intel loses control of the foundry business.\n\nFederal backing could give Intel more breathing room to revive its loss-making foundry business, analysts said, but it ceded the AI market to Nvidia and has lost market share to Advanced Micro Devices in its central processor business for several years. It has also faced challenges in attracting customers to its new factories.\n\nTan, who became CEO in March, has been tasked to turn around the American chipmaking icon, which recorded an annual loss of $18.8 billion in 2024 — its first such loss since 1986. The company's last fiscal year of positive adjusted free cash flow was 2021.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/science/2025-08-25/phev-plug-in-hybrids-taking-over-electric-vehicle-ev-sales/105647958",
        "title": "Plug-in hybrids are taking over EVs. It wasn't meant to happen this way",
        "publish_date": "Sun, 24 Aug 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's the \"transition technology\" that isn't going away.\n\nFor years, sales of plug-in hybrid electric vehicles (PHEVs), which can burn fuel or run off a battery, have been tipped to fall as full-battery electric vehicles (BEVs) take their place.\n\nBut in Australia, another story is unfolding.\n\nPHEV sales are booming.\n\nOne year ago, not a single PHEV ute had been sold anywhere in Australia.\n\nToday, there are more than 12,000 on our roads, and a PHEV is the fourth best-selling ute in the country.\n\nTo some, PHEVs are a necessary \"stepping stone\" in the process of vehicle electrification, helping Australians get used to battery-powered cars.\n\nBut others argue PHEVs simply prolong our costly love affair with unnecessarily large cars.\n\nThese hybrids, they say, are effectively gas guzzlers dressed up as EVs, or \"wolves in sheep's clothing\".\n\nSo why are Australians reluctant to drop the fuel tank entirely, and what does it mean for reducing emissions?\n\nHybrid EVs versus full-battery EVs\n\nThe phrase electric vehicle (EV) may conjure images of 100 per cent battery-powered cars, but many EVs regularly burn fossil fuels.\n\nAnd these cars make up an increasing proportion of the EV market.\n\nIn the space of just two years, PHEVs have become a common sight on our roads, with more than 60,000 sold. (Getty: petovarga)\n\nPlug-in hybrids or PHEVs combine an internal combustion engine (like petrol or diesel) with an electric motor and a battery pack that can be charged from an external power source.\n\nThey generally emit less CO2 than equivalent-model full-combustion vehicles, but significantly more than BEVs, when used over an extended period of time.\n\nThis is because PHEV batteries are relatively small and, when they're empty, drivers tend to run the car on fossil fuels before recharging.\n\nPlug-in hybrids now about a quarter of EVs sold\n\nIn two years, PHEVs have gone from about a tenth of total EV sales to about a quarter.\n\nThe rise of PHEVs is making the story of the electrification of transport in Australia more complicated.\n\nYou may have heard that EVs are accounting for a larger proportion of new car sales.\n\nWhile this is true, a lot of the recent increase is due to PHEVs.\n\nBEV sales, as a proportion of new car sales, have actually plateaued at less than 9 per cent over the past two years.\n\nBut PHEVs recently shot from 1 per cent to 5 per cent of sales in less than a year.\n\nWhat's causing this deceleration is contested.\n\nGlobally, the pace of growth of EV sales outside of China has slowed, with EV market share in the US and Europe stagnating.\n\nOne theory is the BEV industry faces a challenge reaching customers beyond the \"early adopters\", partly due to concerns about charging infrastructure.\n\nAnother theory is the arrival of PHEVs has effectively siphoned sales from BEVs.\n\nIn Europe and the US, like in Australia, PHEV sales are booming.\n\nAre plug-in hybrids helping or hindering fully electric car sales?\n\nThe popularity of PHEVs has defied predictions.\n\n\"Amongst the EV community we're a little surprised,\" Ben Elliston, chair of the ACT branch of the Australian Electric Vehicle Association (AEVA), says.\n\n\"PHEVs came out of nowhere in the last few years.\n\n\"It seemed clear to us that BEVs are the better technology but the mainstream buyer seems to have different ideas.\"\n\nChris Jones, president of the AEVA, says PHEVs are undermining Australia's emission reduction goals.\n\n\" PHEVs were a transition technology ... but now I think they're a handbrake on BEV sales. \"\n\nBut others in the automotive industry have a very different take.\n\nThey say PHEVs are cracking a consumer segment that isn't yet ready to go all-electric.\n\n\"They're a real stepping stone for people to ultimately move into a battery electric vehicle, but are not yet prepared to take that step,\" Rohan Martin, CEO of the National Automotive Leasing and Salary Packaging Association (NALSPA), says.\n\nLarger cars like utes and SUVs make up most of PHEV sales. (Getty: petovarga)\n\nAman Gaur, head of legal policy and advocacy at the Electric Vehicle Council, said many Australians wanted to buy big, powerful cars like SUV and utes.\n\nPHEVs are meeting demand currently unserved by BEVs, he says, noting that some vehicle electrification is better than none.\n\n\"We don’t live in the kind of country where we tell people what car to buy,\" he says.\n\n\" Some people may wish we drive smaller cars, like in Denmark, but we can't change that demand for larger cars. \"\n\nMike Costello, an analyst for automotive research firm Manheim Australia, says \"PHEVs are competing for the middle ground\", not just \"the so-called early adopters\".\n\n\"The BYD Shark ute for, example isn't just preaching to the converted, it’s pulling people out of [full combustion] four-wheel drives.\n\n\"There's little doubt some people would have traded in [Toyota] Hiluxes and [Ford] Rangers [for Sharks].\"\n\nWho's buying PHEVs?\n\nMichael Formosa, whose company services and repairs garage doors and gates in Sydney, traded in four Ford Ranger diesel utes for four PHEV utes in December last year.\n\nOther than a few issues with battery range when towing, he's happy with the decision, which has meant spending less on fuel.\n\n\"I worked out we're doing about an eighth [of our travelling] in petrol and the rest in [battery power],\" he says.\n\n\" Without the [plug-in hybrid], I'd still be driving a petrol or diesel ute. \"\n\nUtes account for about 20 per cent of all vehicles sold in Australia, making them a big chunk of the market.\n\nThe only BEV or fully-electric ute available in Australia, the LDV eT60, has had well-documented performance problems, and is a third more expensive than popular PHEV models. Eight have been sold in Australia so far this year.\n\n\"There isn't yet a fit-for-purpose BEV for light commercial vehicles,\" Mace Hartley, executive director of Australasian Fleet Management Association, says.\n\nPHEVs, meanwhile, now account for more than 7 per cent of sales in the ute market.\n\nThis suggests tradies like Michael are buying PHEVs instead of petrol or diesel utes, and not instead of BEVs.\n\nBut utes aren't the only kind of PHEV selling well.\n\nAbout half of PHEVs sold in 2025 were small or medium-size SUVs, a vehicle class that, unlike utes, includes lots of popular BEVs.\n\nHere, it's harder to argue PHEVs are serving a demand unmet by BEVs.\n\nA 2024 NALSPA survey found that, compared to BEV owners, a relatively high proportion of PHEV drivers lived in outer suburbs or were based in regional areas.\n\nMany weren't yet ready for a BEV due to range anxiety, but would consider one as their next car.\n\n\"If you're charging a PHEV at home each night, you can run it as a pure electric vehicle and not have range concerns,\" NALSPA's Rohan Martin says.\n\nBut the AEVA's Chris Jones says Australians are simply buying what dealerships are stocking and promoting.\n\n\"We've become hooked on these large and somewhat unnecessary vehicles,\" he says.\n\n\"Dealers will claim that's what people want, but when you walk into a dealership you see a wall of PHEVs ... and the BEVs are harder to find.\"\n\nAre PHEVs good or bad news for emissions?\n\nWhen burning fuel rather than running on battery power, PHEVs (which carry heavy batteries) actually emit more than their full-combustion equivalents.\n\nThey're only low-emission options if drivers plug them in to recharge.\n\nThis means if they're not being recharged, more PHEVs could amount to more higher-polluting cars on our roads.\n\nA recent study from Europe, using onboard fuel-consumption data, found many PHEV drivers often don't recharge.\n\nAs a result, PHEVs may not be as clean as their rated emissions suggest (these ratings are based on the assumption drivers charge more often).\n\nMany plug-in-hybrids have a battery-range of more than 50km, which is a greater distance than the average Australian drives each day. (Supplied: Ford)\n\nBased on the study's results, PHEVs may only be about half as polluting as their full-combustion equivalents.\n\nThat's good, but only as good as a standard hybrid (a vehicle with an onboard battery that can't be plugged in to charge).\n\n\"They're not going to decarbonise transport like we need them to,\" Mr Jones says.\n\nModelling of the EV uptake required to meet Australia's Paris Agreement emissions reduction commitment assumes PHEVs will account for 4–5 per cent of new car sales by 2030.\n\nThat's roughly where PHEV sales are now, but the long-term trend appears to be upwards.\n\nAre plug-in hybrids the future or a temporary convenience?\n\nEarlier this year, the federal government lifted a key tax exemption for PHEVs, effectively making them more expensive to own through a novated lease.\n\n\"The prevailing sense within the industry was the lifting of the [tax] exemption would stall PHEV sales, but this hasn’t happened,\" Manheim Australia's Mike Costello says.\n\n\"They’ve slowed but not stalled.”\n\nRather than shifting away from plug-ins, automotive brands are launching more PHEV models in the Australian market.\n\nThe Toyota RAV4, a top-selling medium SUV, will come with a PHEV option from 2026.\n\nBYD, meanwhile, will launch a mix of four to five new PHEV and BEV models in Australia over the next six months, the company's chief operating officer Stephen Collins says.\n\nChina turns into the world's first electrostate Photo shows A man stands on a busy market street with a looming coal plant's cooling towers in the background. China has put its economic might behind renewable technologies in a desire to stop relying on imported fossil fuels.\n\nThe future of PHEVs partly depends on whether car companies can build a BEV ute that Australians want to buy.\n\nIf they do, the rise of PHEVs may be just a flash in the pan.\n\nAccording to Mace Hartley from Australasian Fleet Management Association, Australia is \"18 months away from having BEV equivalents of the BYD Shark\".\n\nAman Gaur from the EV Council says improving battery technology means BEVs are the future, but plug-ins have a crucial role to play in the present.\n\n\"What we need is incentives to help people get into PHEV vehicles. We don't have any at the moment,\" he says.\n\n\"How are we getting people off petrol utes and into electrified utes?\"\n\nBYD's Stephen Collins says \"there's a place for plug-in hybrids in Australia over the next three to five years\".\n\n\"If we're looking at 10-years plus, maybe it's a different story.\"\n\nBatteries may be the future of transport, but the road to electrification is a twisty one.\n\nAnd the upstart plug-in is showing no sign of going away.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/cohousing-communal-living-for-six-canberra-residents/105690652",
        "title": "Three Canberra couples create communal home by changing planning laws",
        "publish_date": "Sun, 24 Aug 2025 20:48:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "At a property in Canberra's inner suburbs, there is a barbecue, a snooker table, a workshop and a garden.\n\nIn that respect it's like many other Australian homes.\n\nBut what makes this place – dubbed Stellulata – unique is that it is a purpose-built co-housing development, recently completed on a residential block to be home to six Canberrans.\n\n\"We've got three couples living on a block that previously had one house on it, so it's very efficient use of the land,\" co-owner Trish Macdonald said.\n\nThe property is now home to six Canberrans and a newly planted garden. (ABC News: Luke Stephenson)\n\nIn addition to the other amenities, there is also a large communal kitchen which has already hosted a 50th birthday.\n\nAnd there is a shared spare room where they plan to host their first overnight visitors soon.\n\n\"We've managed to transform an area where there was minimal activity … and now we've got this hubbub, an internal hubbub,\" co-owner James Godfrey said.\n\n\"But there's an ongoing connection with the community going past and there's a lot of vibrancy within here, but still relatively quiet.\"\n\nPrivate space combines with communal living\n\nThe concept sounds deceptively simple and normal: each couple has their own 100-square-metre private unit with shared common facilities all built on an 1,100 square-metre suburban block.\n\n\"We have our own private space,\" Ian Ross, another of the project's co-owners, said.\n\n\" But unlike a block of flats, where you've just got the lifts and foyer, we are sharing a lot more resources. \"\n\nThe residents say the property requires everyone to agree and to work together with shared principles. (ABC News: Luke Stephenson)\n\nThe journey has been anything but simple.\n\nWhat began as conversations between long-term friends Ian Ross, Joss Haiblen and Trish Macdonald seven years ago evolved into an odyssey that required changing the ACT's Territory Plan — a process that needed a Legislative Assembly vote — all disrupted by Covid, fires, rain and common garden construction delays.\n\nIt's built as a demonstration housing project to test whether the co-housing model will be suitable more generally in the Canberra community.\n\n\"The ACT government was looking for people who couldn't do what they wanted to do due to the planning rules, and while they didn't give us any financial support, they were willing to guide us through the planning system to get things changed,\" Mr Ross said.\n\n\"Four years was taken up getting approvals.\"\n\nThe concrete slab newly laid for Stellulata on a residential block that previously contained one home. (Supplied: Stellulata )\n\nThe other challenge was finding a block of land in the area.\n\n\"This block had virtually no trees. A big empty quarter acre block from 1949 with a small house on it,\" he said.\n\nMr Ross is up-front about saying it wouldn't be considered affordable housing — it's architecturally designed on an inner-city suburban block with fit-outs bespoke to each unit.\n\n\"We have been able to build something for a cost we wouldn't have been able to do individually,\" he said.\n\nShared space\n\nFor co-owners Trish Macdonald, Joss Haiblen, and Ian Ross, the goal was to downsize while keeping a strong connection with their community, doing the things they love in the area they enjoyed and being able to age in place.\n\nFor Mr Ross, the idea formed after his wife died.\n\nStellulata was designed and built over about seven years. (Supplied)\n\n\"I was single, living in a a very big house and I was looking at at downsizing, so I was certainly tempted by the situation of moving into a smaller place but still having community around me in the area that I wanted to live.\" he said.\n\nFor Jillian Reid and James Godfrey, it was the opposite.\n\n\"This is upsizing for us. There's no way we could have been living in this space in Ainslie by ourselves,\" Ms Reid said.\n\n\"For us to be able to share the land costs and the fixed cost to be able to do a build like this, it's meant that we've been able to achieve the sustainability objectives that we wanted and having more garden space which we just couldn't have afforded on our own.\n\n\"The aging in place piece is really important, which we're still happy about as well.\"\n\nOne of the kitchens in a unit at Stellulata, which was completed earlier this year. (Supplied)\n\nShared values\n\nEach resident's private space is smaller than a traditional house, but access to extensive common areas means the total available space remains similar — with shared costs.\n\nThey found that forming a company was the most suitable structure in the ACT for designing, building, managing and ultimately sharing their new home.\n\n\"Shared\" is a word that comes up regularly: shared resources and shared values, but also shared labour.\n\nUnlike traditional strata arrangements where this is outsourced, everyone in Stellulata contributes to take responsibility for different areas.\n\nSustainability and solar passive design informed the project. (Supplied: Stellulata )\n\nSome manage utilities, others handle the garden, and all major decisions involve all six residents.\n\n\"We all have our different ways of operating and that's really great,\" Mr Godfrey said.\n\n\"Some people have more time, less time, and some people go away for longer periods, so we can look after each other's places while people are away.\"\n\nChoosing a co-housing community\n\nMs Reid and Mr Godfrey discovered the project online while looking to upsize outside of the intensity and unaffordability of Sydney.\n\nMs Reid said she recalls Googling \"co-housing Canberra\", and when the Stellulata website popped up the couple went from there.\n\nThe property includes a row of three units in an inner suburb of Canberra. (Supplied)\n\nOver weeks there was an extensive interview stage.\n\n\"It was quite an interesting process because some might think it as an interview, that they were checking us … but simultaneously we were interviewing them,\" Mr Godfrey said.\n\n\"We needed to work out what were the threshold issues that either we would or we couldn't live with each other.\n\n\"We talked about issues of sustainability or environmental awareness, what sort of things interested us … whereas otherwise you buy into a strata place and you may or may not meet your neighbours before you buy or rent into a place.\"\n\nMs Macdonald says having a younger couple in the group gives diversity to their day and opens up their social circles.\n\n\"We're not in an aged care place. We're a normal part of the community,\" she said.\n\nCould it be replicated?\n\nCities and towns across Australia are continuing to grapple with the problem of housing affordability.\n\nIt is possible co-housing could offer a potential solution to the \"missing middle\" — housing options that are neither apartments nor suburban houses.\n\nThe project included the installation of solar batteries and panels. (Supplied)\n\nThe group agree the result is worth the effort, but Mr Ross candidly admitted it wasn't easy.\n\n\"It's fantastic but we were all pretty traumatised by the time we got to at the end of … seven years,\" he said.\n\n\"So it took us a little bit of time to settle in, but we are all feeling very relaxed in our units now.\"\n\nHe said that it could be replicated but in a different way.\n\n\"You probably wouldn't do it quite like this.\n\nCould you live in a smaller house? Photo shows Bird's eye view of rows of newly built houses with green lawns and solar panels on roofs. Amid a housing crisis and a quest to decarbonise, some Australians are asking how much space they really need to live well.\n\n\"You might choose to simply take an existing house, take advantage of some of the changed planning rules since we started, and make an extension or put in a second building, but treat it as a collaborative situation.\"\n\nWith another demonstration co-housing project for 30 units in Watson, Mr Ross is hopeful that these examples can show Canberrans a way to create a community in a conscious way.\n\n\"It does require conscious effort to make it work smoothly,\" he said.\n\n\"You can't assume that because you've known people for a long time, you'll be able to sort things out without thinking about it. It's not for everybody, but it's well worth it from our point of view.\"\n\nThe architecture of cooperation\n\nThe project's success depends as much on architecture as attitude.\n\nArchitect Brett Lowe designed the complex to be highly energy efficient and architecturally beautiful, leaning into the constrains of the smaller footprint to make the units feel large and spacious.\n\nThe outdoor layout is also built to encourage \"accidental\" encounters — moments when residents naturally cross paths.\n\nThe goal of Stellulata is to ensure everyone enjoys both privacy and a sense of community. (Supplied: Ian Ross)\n\n\"We want a situation where even when we're not intending to, we run into each other,\" Mr Ross said.\n\nThe buildings occupy 42 per cent of the land, leaving space for gardening, trees and a planned vegetable garden, which will sit in the front yard.\n\nThey hope to combine organic gardening with organic interactions with the neighbours as they walk past.\n\nArchitect Brett Lowe designed the co-housing property in collaboration with the co-owners. (Supplied)\n\nAlong with broader sustainability and the ability to use a large block for more people, the community aspect is what Mr Ross is most proud of.\n\n\" Being able to be with your neighbours, your close neighbours who you set up the co-housing community with, as well as with your broader neighbourhood. \"\n\nA long-term investment\n\nThe group all agree that this level of community development requires a serious time investment.\n\nBoth Mr Ross and Ms Macdonald were close to retirement when the project began, and said their partners joke that \"it couldn't have been done without the retired guys working on it\".\n\nThe residents hope their pioneering efforts might help nudge the idea further along to make it easier for others to replicate.\n\nIn a city where you might go days without seeing your neighbours, and with a loneliness epidemic already affecting Australians — there is a sense of optimism emanating from Stellulata.\n\nThe co-owners made sure to include a room for a snooker table. (ABC News: Luke Stephenson)\n\nIt also offers an alternative for those who cannot, or choose not to, live with their relatives.\n\n\"You don't have to scientifically prove that intergenerational wisdom, learning from elders, is a good thing but you don't always want to live next to your parents,\" Ms Reid said.\n\nThe group behind Stellulata is planning on showcasing their home on open days and said interest in the project is building.\n\n\"There's a long list of people who want to come and stay here, check out the place, including the snooker table behind us,\" Mr Godfrey said.\n\n\"And there's quite a long list of people thinking, 'hmm, this is not a bad way of living. I quite like this co-housing business'.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-25/queenstown-tasmania-bendigo-bank-closing/105625870",
        "title": "When this bank closes, the nearest will be 150km away",
        "publish_date": "Sun, 24 Aug 2025 20:28:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmania's West Coast is about to lose its last bank.\n\nAt the start of July, Bendigo Bank announced it was closing its Queenstown branch, along with nine other branches across the country.\n\nOnce the branch closes, the nearest bank will be in Burnie, a 300-kilometre, four-hour round trip from Queenstown.\n\nSince the announcement, locals have been rallying against the decision, while also preparing for life without a bank.\n\nThe West Coast Wilderness Railway is one of the largest businesses in Queenstown.\n\nAcross the railway service and its cafes in Queenstown and Strahan, the business handles a large amount of cash, and uses Bendigo Bank daily.\n\nIan Robertson says the news that Bendigo Bank was closing its Queenstown branch came as a shock. (ABC News: Mackenzie Heard)\n\nGeneral Manager Ian Robertson said he was \"completely blindsided\" by the bank closure.\n\n\"Bendigo Bank is supposed to be the community bank, so funny enough we would have expected them to take a little more notice about us before they made that unilateral decision,\" Mr Robertson said.\n\n\" Had they engaged with us, then they would have found out that we did have some very real concerns on how it will impact us. \"\n\nAmong those concerns are how the business will manage its cash floats and how it will do its daily banking.\n\nQueenstown is the largest town on Tasmania's West Coast. (ABC News: Maren Preuss)\n\nAn imperfect solution\n\nWhen the bank closes, businesses will have to use Australia Post to deposit their takings and exchange and manage their cash floats.\n\n\"One of my major concerns is that we need change quickly, and for that we'll probably have to carry some extra floats in the business,\" Mr Robertson said.\n\nTasmania's ghost towns Photo shows A composite image of three historical buildings, hills and clouds On Tasmania's wild west coast, towns have risen and fallen at the whim of industry. Some of their oldest living inhabitants remember their former homes, and how their communities came undone.\n\nUnlike the bank, Australia Post charges a fee for changing cash.\n\n\"Any change that we will need to do — and we will need to do a lot of it in high season — we'll have to pay for, so there will be a cost implication on the business.\"\n\nKerrie Scott runs a shop on the main street of Queenstown, and has been using the post office to bank since the Commonwealth Bank left town.\n\nShe agrees it is an imperfect solution.\n\n\"The post office is terrific, the staff are great, but once again it is limited,\" she said.\n\n\"[It's] a post office for letters and parcels. Not a bank.\n\nKerrie Scott says she's been using the post office since the Commonwealth Bank's Queenstown branch closed. (ABC News: Mackenzie Heard)\n\nIt is not just businesses that are concerned about the closure.\n\nLocals who have been using the bank for years are worried about what it means for them, too.\n\n\"We've been customers with Bendigo for about 25 years. And always used them wherever we've lived,\" Queenstown resident Tracy Wales said.\n\n\"And you [now won't be able to] just pop in and get some advice or talk to someone over the counter. Very disappointing.\"\n\nThe closure is likely to be particularly difficult for elderly people in the region.\n\n\"It's alright for people that are very digitally focused. I'm not. I'm 73 and I don't do internet banking and stuff like that, so it makes it harder for elderly people,\" Bob Wales said.\n\nOlder people are worried about how they will manage without a bank nearby. (ABC News: Mackenzie Heard)\n\nAt 84 and 88 years of age, Shirley and Dale Sturges are not planning on learning how to use internet banking.\n\n\"There's a lot of elderly people like us who are not happy with it,\" Ms Sturges said.\n\n\" We don't pay with our card, we don't pay on the internet for anything, so we've been using the bank for all those years. \"\n\nThey said they would need someone to drive them to Burnie if they needed to use the bank.\n\n\"We're devastated about it. But we're very grateful for people who are trying to help us.\"\n\nBendigo Bank is the last bank operating in Queenstown. (ABC News: Maren Preuss)\n\nCommunity fights back\n\nSince the announcement, community members have been rallying against the bank's decision.\n\nPeople power keeps bank open Photo shows A picture of the Korumburra Bendigo Bank branch Community campaign keeps bank open.\n\n\"Originally there was a bit of, 'here we go again, they're shutting another one of our services down on the West Coast', [but] the community's right behind this now to see if we can save the bank,\" West Coast Mayor Shane Pitt said.\n\nA public meeting about the closure held in Queenstown on August 3 was attended by about 60 locals, as well state Braddon MPs Gavin Pearce and Anita Dow, and federal Braddon MP Anne Urquhart.\n\nThey jointly called on Bendigo Bank to keep the branch open.\n\nShane Pitt is hopeful Bendigo Bank can be persuaded to stay open. (ABC News: Mackenzie Heard)\n\nA Bendigo Bank spokesperson told the ABC the \"difficult\" decision to close the Queenstown branch was made following a review of evolving customer preferences, a reduction in business activity and an increase in costs.\n\nIn a statement, the bank said about 21 per cent of its customers in Queenstown had visited the branch once in the past year.\n\nDespite community opposition, Bendigo Bank has maintained the bank would close permanently from September 26.\n\nBendigo Bank says the \"difficult\" decision was made to close the branch after a review. (ABC News: Mackenzie Heard)\n\nBut the mayor is still hopeful the decision can be reversed.\n\n\"Anything's possible until it's not. We've seen the Bendigo Bank in other locations around Australia that have reopened their banks or stopped the closure, so we're hoping that we may be able to entice the Bendigo Bank to change their views,\" Cr Pitt said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/man-dies-after-allegedly-robbing-shop-20250825-p5mpli.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Man dies after allegedly robbing shop",
        "publish_date": "Mon, 25 Aug 2025 12:03:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Man dies after allegedly robbing shop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/erin-patterson-plea-hearing-live-updates-mushroom-cook-to-make-plea-for-leniency-after-murder-conviction-20250822-p5mp2x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Silent exit: Erin Patterson walks past media as her victim’s statements echo",
        "publish_date": "Mon, 25 Aug 2025 12:02:23 +1000",
        "category": "lifestyle",
        "authors": [
            "Erin Pearson"
        ],
        "text": "Tim Patterson, Don’s nephew, spoke of the profound grief and lingering questions that have haunted him since the deaths of his loved ones. He described the agony of watching them fight for their lives in the hospital, a pain he had never experienced before.\n\nPatterson recounted a diary entry where he questioned why “God decide[d] to end such amazing lives in such a horrific manner.” He reflected on how his previous encounters with death had been softened by the knowledge that the person had lived a whole life. However, holding vigil over Gail as she passed away, he felt a new pain — a deep, senseless, and unjust loss of stolen years.\n\nTim Patterson spoke of his uncle, Don, as “a beautiful, honorable, caring man” who exuded “love and joy in everything he did.” He said he looked up to his uncle’s perpetually young heart and his genuine care for others.\n\nThe lack of explanation weighs heavily, he told the court. He finds it difficult to comprehend a world without Don and Gail. “Why did Erin decide that she’d make her life’s work a portrait of death and destruction?” he asked. “I guess that’s the final injustice in all of this, the lack of explanation, reason, or remorse.”\n\nDespite the passage of time, he said he still cries when he thinks about how they were lost.\n\n“It’s a strange thing, but for some reason, I still can’t fully accept they’re gone. In my mind, it’s just that we haven’t seen each other in a while.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/bentley-team-to-close-two-hatted-french-restaurant-monopole-20250825-p5mpk8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bentley team to close two-hatted French restaurant Monopole",
        "publish_date": "Mon, 25 Aug 2025 12:00:06 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles"
        ],
        "text": "Advertisement\n\nExclusive Eating outRestaurant news Bentley team to close two-hatted French restaurant Monopole From wine bar to upmarket bistro, this elegant French spot bids a final farewell after 13 years of dining. But its operators are already embarking on another project, with a new venue set to open in spring. Scott Bolles August 25, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOne of Sydney’s most prized restaurants, the two chefs’ hatted Monopole, is set to close its doors on Saturday, September 6. A particularly tough winter trade has been gruelling for many Sydney restaurants, but co-owner Brent Savage, whose Bentley Restaurant Group includes Monopole in its stable, blamed the closure on the end of a lease at the restaurant, which overlooks Australia Square. Monopole’s French makeover, with linen tablecloths and flickering candles. Dion Georgopoulos Savage said the CBD restaurant trade in 2025 felt more optimistic than last year, but confirmed rumours – swirling for months – that the Monopole site had been sounding out new operators. He is unsure of its future direction, however. “We looked at all our options,” Savage said.\n\nAdvertisement\n\nAfter eight years in its original location, Monopole moved from Potts Point in late 2020, later shifting from a wine bar focus to a French-leaning venue last year. “We got a good review, I feel quite proud of what we’ve achieved,” Savage said. But the closure isn’t the only news for the group, which is one of the most expansive and successful restaurant operations in Sydney. It will double down on its CBD restaurant openings King Clarence and Eleven Barrack with another new venue – Watermans – to open at Barangaroo in spring. From left: Nick Hildebrandt, Darryl Martin and Brent Savage will open Watermans in Barangaroo. Darryl Martin, the former owner-chef at Barzaari in Marrickville, will lead the Watermans kitchen. “We’re massive fans of Darryl from his Barzaari days,” Savage said. Pointing to Martin’s labne with salted cucumber as a dish that will make its way onto the Watermans opening menu, Savage said other dishes they’ve been working on include warm hummus with green zhoug; pickled watermelon and raw tuna salad with sumac; whole roasted John Dory with chermoula; and pomegranate-glazed slow-cooked lamb shoulder with pickled radishes and black lime.\n\nAdvertisement\n\nSavage stressed the restaurant start-up won’t be a carbon copy of Barzaari. “It’ll be Darryl’s repertoire with a little of our finesse,” Savage said. The 120-seat restaurant will slide into the recently completed One Sydney Harbour development at Barangaroo, a precinct where the Bentley crew has plenty of experience, having operated the now-closed Cirrus Dining nearby until 2024. Monopole’s duck breast, with crisp skin and rosy meat, and an orange-scented glaze. Dion Georgopoulos The expansive restaurant group isn’t ruling out a return for Monopole. “If it’s the right site, never say never,” Savage said. He and business partner Nick Hildebrandt said in a joint statement that the team were proud of their achievements at Monopole, both in the original Potts Point location and CBD.\n\nAdvertisement\n\n“An enormous amount of talent has graced both the kitchen and the floor,” the statement said. “Monopole was a ground-breaking wine bar when we opened it and has always pushed the envelope, holding two hats for 10 years and winning multiple awards for its wine list.” Related Article Good Food hat Good Food hat 16.5 / 20 Review This two-hatted wine bar has had a French makeover – but does it have that je ne sais quoi?\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/the-fed-chief-s-wise-words-are-wasted-on-trump-20250825-p5mpiz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Fed chief’s wise words are wasted on Trump",
        "publish_date": "Mon, 25 Aug 2025 11:59:01 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Then he went onto say that with policy in restrictive territory the outlook and shifting balance of risks might warrant adjusting the policy stance – i.e. a rate cut. The awkward position the Fed finds itself in is that on both sides of its mandate there are novel Donald Trump-inspired uncertainties. Ansell says price rises will offset Donald Trump’s tariffs on its products. Credit: AP The inflation rate, already materially above the Fed’s 2 per cent target rate, is picking up gradually as Trump’s tariffs start to impact. Because the bulk of the globally applicable baseline tariffs only just started to come into effect this month, and US businesses had built significant pre-tariff inventories earlier in the year, they will show up progressively in the inflation rate through the rest of this year and into next year.\n\n“The effects of tariffs on consumer prices are now clearly visible,” Powell said. “We expect those effects to accumulate over coming months, with high uncertainty about timing and amounts. The question that matters for monetary policy is whether those price increases are likely to materially raise the risk of an ongoing inflation problem. Loading “A reasonable base case is that the effects will be relatively short-lived – a one-time shift in the price level,” he said. “It is also possible, however, that the upward pressure on prices from tariffs could spur a more lasting inflation dynamic, and that is a risk to be assessed and managed,” he said, noting that a decline in real incomes from higher prices could see workers demanding higher wages or that the price rises could lead to a lift in inflation expectations that dragged actual inflation up.\n\nIf the impact of the tariffs on inflation is uncertain, so is the impact of Trump’s immigration policies on the unemployment rate. Last month’s contentious jobs report – the one that got the Bureau of Labor Statistics sacked by Trump – showed US employment growth is stalling, even though the unemployment rate remains at an historically low level of 4.2 per cent. Markets heard what they wanted to hear. Credit: AP Complicating assessment of the labour market, however, is that even as the growth in jobs has flat-lined, the supply of labour has also softened – the pool of job-seekers has been shrunk because of Trump’s harsh immigration policies. “Overall, while the labour market appears to be in balance, it is a curious kind of balance that results in a slowing in both the supply and demand for workers., This unusual situation suggests that downside risks to employment are rising and, if those risks materialise, they can do so quickly in the form of sharply higher layoffs and rising unemployment,” Powell said.\n\nSo, both sides of the Fed’s mandate are under pressure but the data that the data-dependent Fed relies on is, at this point, inconclusive. It remains very possible that both the inflation and unemployment rates could rise together. Trump, having spent years attacking Powell, is ramping up his campaign to “MAGA-fy” th Fed. The US economy is growing at about half the rate it did last year. Stagnation – low growth with relatively high inflation – remains a realistic possibility. That would confront the Fed with a very difficult choice of which side of its mandate to prioritise.\n\nPowell said it would not allow a one-time increase in prices to become an ongoing inflation problem, but when the risks to its dual mandate are evenly balanced, what does it do? History would suggest it would prioritise the fight against inflation. The Fed’s predicament is worsened by Trump’s continuing assaults on its independence. If it is to retain the credibility that is essential to bond investors’ trust that it will act in accordance with its view of the economy’s best long term interests, rather than short term political pressures, it can’t be seen to be succumbing to Trump’s campaign for radically lower interest rates – he wants them 3 percentage points lower – in order to lower the interest costs on America’s exploding government debt levels and boost growth. That could, while it retains its independence, make it more cautious than it might otherwise be, relying on data that reflects the recent economic past to justify a rate cut or hike.\n\nTrump, having spent years attacking Powell, is ramping up his campaign to “MAGA-fy” th Fed. He’s explored the possibility of sacking Powell, but doesn’t have that power. He tried to make a case that a blow-out in the cost of the Fed’s Washington headquarters provided a “cause” to fire Powell, but that effort fizzled. He has nominated Stephen Miran, the chairman of his council of economic advisers and a man who has said the president should be able to hire and fire Fed governors, to fill a vacant seat on the central bank’s board. Now, even as Powell delivered his address at Jackson Hole, Trump called for the resignation of a sitting Fed governor, Lisa Cook, and threatened to fire her after the Federal Housing Finance Agency director, Bill Pulte, alleged she had committed mortgage fraud.\n\nCook, whose term doesn’t expire until 2038, has said she won’t be “bullied” into resigning “because of some questions raised in a tweet.” It is unclear, even if the allegation were proven, whether it would be serious enough to provide “cause” for her removal or whether Trump has the authority to fire a board member of a quasi private institution. Nevertheless, the attack on Cook (using mortgage fraud allegations that Pulte has also deployed against other Trump adversaries like Democrat Adam Schiff and New York Attorney-General Letitia James) is, with the nomination of Miran, a clear signal that Trump isn’t going to abandon his efforts to gain influence over the Fed and its decision-making. If Miran is confirmed by Congress, there will be three Trump-appointed people on the Fed’s seven-member board of governors. If he could force Cook out, there’d be a majority of Trump appointees. The board doesn’t make interest rate decisions – those are made by the 12 members of the Open Market Committee, which includes the seven board members, the president of the New York Fed and four of the other 11 regional Fed presidents – but a strong Trump representation within those meetings could be intimidating, particularly as it is the Fed’s board that has the power to approve, or disapprove, the appointment of regional Fed presidents.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-bigger-climate-push-backed-in-far-right-israeli-mp-responds-to-shameful-visa-cancellation-20250825-p5mpgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to accelerate 5 per cent deposit scheme for first home buyers; Lambie criticises ‘rude’ Trump administration",
        "publish_date": "Mon, 25 Aug 2025 11:56:33 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The Housing Australia website is buckling under increased traffic after the government announced this morning it would accelerate its plan to expand its 5 per cent deposit scheme.\n\nThe first home buyers deposit scheme, which involves the government effectively backing first home buyers to avoid them paying lenders mortgage insurance, was due to start in January next year, but will now begin in October.\n\nClare O’Neil. Credit: Alex Ellinghausen\n\nHousing Minister Clare O’Neil shared on X some people had not been able to access the Housing Australia website, while others were waiting minutes for it to load.\n\n“It’s fantastic that Australians are so interested in getting a home of their own under Labor’s 5 per cent Deposit Program,” O’Neil said.\n\n“Please hold on while they resolve the issue ASAP.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/door-ajar-on-curnow-move-dons-hunt-a-lion-the-trade-state-of-play-at-each-non-finals-team-20250821-p5mood.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Door ajar on Curnow move, Dons hunt a Lion: The trade state of play at each non-finals team",
        "publish_date": "Mon, 25 Aug 2025 11:55:08 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Melbourne Coach Simon Goodwin is already out, and there could be other high-profile exits to come. Christian Petracca and Clayton Oliver – who are both on contracts worth more than a million dollars a year – were both keen for a fresh start last year. The Demons refused to consider trading them in 2024, so it will be interesting to see if Petracca and Oliver try to move again – and if list boss Tim Lamb softens his stance with a new coach on the way. There is nothing to the Petracca-Hawthorn whispers at this stage. Young defender Judd McVee is looking around, and has interest from the two WA clubs, while Adelaide also raised his name internally, as he weighs up whether to stay in red and blue. The other player whose name came up in trade speculation is forward Bayley Fritsch. They are among the clubs to have shown interest in Marcus Windhager, but his preference is to remain at St Kilda if they improve their financial offer. Giant Wade Derksen is on Melbourne’s radar, potentially as a delisted free agent. Could Christian Petracca follow Simon Goodwin in leaving Melbourne? Credit: AFL Photos North Melbourne The Kangaroos want to add some defensive steel to their mostly young midfield brigade, and have identified Saint Marcus Windhager as the man who could do that. They have presented a five-year contract offer with serious financial terms to Windhager’s management, and have as good a chance as any suitor if he chooses to depart. That said, Windhager’s preference is to continue playing with his close friend Nasiah Wanganeen-Milera at St Kilda. No.4 draft pick Zane Duursma has had an inauspicious first two seasons in the AFL, averaging only seven disposals and kicking 13 goals in 23 matches. North have no intention to move him on, regardless of how frustrated he might be. Will Phillips and Bailey Scott are worth monitoring as two players who spent most of the season out of the senior side.\n\nLoading Port Adelaide Like crosstown rivals Adelaide, the Power missed out on Nasiah Wanganeen-Milera’s signature. They have a decision to make on ex-Hawk Ryan Burton, who has struggled with injuries and is no longer a first-choice defender at Alberton. Burton is highly unlikely to be involved in a trade: his fate will likely be re-signing with Port, or signing elsewhere as a delisted free agent (assuming he lands at a third club). Giant Jacob Wehr is one player they are monitoring. The biggest priority is retaining midfield star Zak Butters, who is a restricted free agent next year. The Power have presented him with a new-age deal, where he can re-sign for two years – taking him to unrestricted free agency – then have the option to tack on six more. A conga line of Victorian clubs are interested in bringing Butters back to his home state, but don’t expect a resolution in the next two months. Richmond There won’t be a repeat of last year’s big-name departures (Shai Bolton, Daniel Rioli, Liam Baker and co.), with the Tigers instead set to work on the margins as their rebuild continues. They are among the clubs chasing out-of-favour Suns goalsneak Malcolm Rosas, while they have told veteran winger Kamdyn McIntosh he won’t be offered a contract for 2026. Jacob Koschitzke is unlikely to score a new contract at Richmond, but is among the defensive depth options the Giants are sifting through. Jacob Blight fell just short of his contract trigger, and might attract interest elsewhere. Perhaps, the most fascinating situation to monitor is whether Richmond keep the North Melbourne pick they secured during last year’s draft. Free agency compensation, academy and father-son selections, as well as a potential, albeit unlikely, West Coast priority pick, could push it deep into the top 10 in a weaker draft than recent years.\n\nSt Kilda The Saints are preparing for a club-defining off-season after making Nasiah Wanganeen-Milera the league’s first $2 million man. They upped their seven-year offer for Carlton ruckman Tom De Koning to about $1.8 million-a-year, as this masthead reported on Wednesday, while they are in the box seat for GWS defender Leek Aleer, who is seeking greater opportunity. St Kilda have also positioned themselves as favourites for contracted West Coast forward Liam Ryan if he departs. The Saints will take advantage of salary cap rules to pay above the limit to accommodate the incoming talent, but there may be some losses. North Melbourne have offered Marcus Windhager a five-year deal, while Melbourne and Essendon have also expressed interest. Contracted ruckman Rowan Marshall has a call to make with De Koning’s impending arrival, and Geelong are a possible destination. Captain Jack Steele will probably remain at Moorabbin, barring a late twist. Marcus Windhager’s future at St Kilda remains uncertain after the Saints retained Nasiah Wanganeen-Milera (left) as they prepare to bring in Leek Aleer and Tom De Koning (both right) Credit: Matt Davidson Sydney The Swans plan to be aggressive in the player movement period after a rare September off, with dual Coleman medallist Charlie Curnow linked to them. However, coach Dean Cox said this week they had not spoken to the star Blue. Curnow, who raised the possibility mid-season of a move to Gold Coast, is contracted at Carlton until the end of 2029, so a lot would have to happen for him to follow Tony Lockett, Barry Hall and Lance Franklin as a marquee forward recruit for Sydney. The Swans inquired about troubled Western Bulldog Jamarra Ugle-Hagan, but have reportedly cooled on the idea of bringing him in. The Ugle-Hagan situation remains delicate. They still have work to do to retain Jake Lloyd and back-up ruckman Peter Ladhams, and have decisions to make on veterans Dane Rampe, Robbie Fox and Joel Hamling. Cox also made clear that Ollie Florent – who spent significant time in the VFL this year – was under contract and a required player. Sydney have liked Sun Malcolm Rosas for years, and this could be the time they finally secure him.\n\nLoading West Coast The Eagles are primed for a big off-season after a second wooden spoon finish in three seasons, and four straight years in the bottom three. They will lose restricted free agent Oscar Allen to Brisbane, but would gain the No.2 draft pick as compensation, while Liam Ryan (contracted until 2026) is weighing up a move to Victoria, with St Kilda the likeliest destination. Speculation continues about Harley Reid, but any decision on his future is not expected to occur this year. Uncontracted speedster Jack Petruccelle is another to watch. West Coast would love to bring Brisbane premiership defender Brandon Starcevich home, and are in a tug-of-war with Adelaide for another Lion, Callum Ah Chee. They also expressed interest in Docker Neil Erasmus, veteran Cat Mitch Duncan and Giant Wade Derksen. The Eagles have long held interest in Deven Robertson, who could aid their midfield depth. Western Bulldogs Coach Luke Beveridge previously hinted at his disenchantment with his key defensive stocks, but was blatant about it after the Dogs’ round 24 defeat to Fremantle. He even mentioned they will see what is available in the “market”, so watch this space, given they already met with Jack Silvagni. That followed Beveridge subbing out Jedd Busslinger in the third quarter to go smaller despite acknowledging they were struggling with the Dockers’ talls. Veteran Liam Jones played just once after round six, while mid-sized backman Buku Khamis is exploring his options after not playing in the Bulldogs’ past eight matches. There is also fascination about midfielder Adam Treloar, whose physical issues mean the Dogs are yet to a new contract for him. Along with Silvagni, they have registered their interest in young Docker Neil Erasmus, while Gold Coast’s Alex Davies is someone they inquired about in the past.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/former-brisbane-lions-ceo-sells-beloved-balmoral-property-20250825-p5mpiy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Brisbane Lions CEO sells beloved Balmoral property",
        "publish_date": "Mon, 25 Aug 2025 11:54:59 +1000",
        "category": "sports",
        "authors": [
            "Sarah Webb"
        ],
        "text": "Former Brisbane Lions CEO Greg Swann has notched one last win after a decade with the club, selling his Balmoral home for $3.275 million in a bidding blitz that drew six punters.\n\nSwann, who returned to Melbourne last month to take up his new post as the AFL’s head of football performance, paid $1.813 million for the Wright Street property 10 years ago, which became both his beloved family home and a popular hangout for players during his Lions tenure.\n\nSet on a 607-square-metre block with a saltwater pool, the home features five bedrooms, three bathrooms and multiple living zones. Swann was said to have loved its entertaining spaces but admitted his favourite spot was the living room, where he would settle in to watch sport on TV.\n\nAt the Saturday in-room auction – held at The Calile Hotel – bidding opened at $2.7 million, kickstarting a flurry of $100,000 rises until the $3.2 million mark. A final $50,000 and then $25,000 bid followed before the hammer fell and a young family walked away with the keys.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/bulldogs-big-ugle-hagan-question-this-off-season-20250825-p5mplb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs' big Ugle-Hagan question this off-season",
        "publish_date": "Mon, 25 Aug 2025 11:52:52 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bulldogs' big Ugle-Hagan question this off-season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/after-164-starts-tommy-fleetwood-wins-a-golf-tournament-and-collects-15-million-20250825-p5mpii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After 164 starts Tommy Fleetwood wins a golf tournament … and collects $15 million",
        "publish_date": "Mon, 25 Aug 2025 11:52:16 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "After the plaudits from LeBron James and Tiger Woods and Everton FC - and almost everybody else on the internet - a journalist asked Tommy Fleetwood why people seem to like him so much. He probably did not mean his response as literally as it sounded.\n\nThe Englishman started by saying he had always been lucky to make great connections with others, then stopped and thought about it, before offering a piece of advice his father gave him and he now gives his own kids.\n\n“Even when I was an aspiring young amateur golfer, professional golfer, he always said: person first, golfer second,” he said. “You’re a good person first, whatever happens after that, you try and be a good golfer second.”\n\nFleetwood has been a “good golfer second” on the PGA Tour for a long time. Six times, from 164 attempts. Forty-four top-10 finishes and 30 top-five places. Until Sunday, the 34-year-old from Merseyside was one of only three players since 1983 to finish second six times without a victory, alongside Colin Montgomerie and Briny Baird.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/mum-and-dad-help-son-buy-1-195-000-coogee-one-bedder-20250825-p5mpig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mum and dad help son buy $1,195,000 Coogee one-bedder",
        "publish_date": "Mon, 25 Aug 2025 11:50:58 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward",
            "Elizabeth Redman"
        ],
        "text": "A one-bedroom art deco Coogee apartment sold for $1,195,000 at auction on Saturday to parents helping to buy the home for their son.\n\nSix bidders registered for the auction of 2/125 Mount Street, and four of them made offers.\n\nBidding began at $1,025,000, above the price guide of $950,000 to $980,000. As the reserve was $1.05 million, the home was on the market by the second bid.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/m1-closed-north-of-sydney-after-crash-20250825-p5mpl8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "M1 closed north of Sydney after crash",
        "publish_date": "Mon, 25 Aug 2025 11:48:37 +1000",
        "category": "finance",
        "authors": [],
        "text": "M1 closed north of Sydney after crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/workplace/how-bosses-are-catching-out-work-from-home-fakers-20241129-p5kuqc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How bosses are catching out work-from-home fakers",
        "publish_date": "Mon, 25 Aug 2025 11:46:49 +1000",
        "category": "finance",
        "authors": [
            "Dan Cave"
        ],
        "text": "This practice rocketed during the pandemic, and in 2022 60 per cent of employees said they thought they were being monitored at work, according to a survey by the TUC union. The proportion of employers tracking workers is expected to rise to 70 per cent by 2025, the management consultancy Gartner found. Bosses have used surveillance software to check on staff with keystroke logging, screen monitoring, time tracking and chat monitoring. These programs, some of which take screenshots of workers’ computers, can crack the tactics used by employees, such as running hours-long Powerpoint presentations. Some software offers the ability to log into an employee’s device remotely. Credit: Michele Mossop Some businesses use software that can take photos of employees via their laptop every few minutes and use their webcam to monitor them. Others offer “productivity scores” on workers, depending on their activity levels. Those mouse jigglers can also be outwitted by software because the cursor activity doesn’t look normal. Algorithms can also see when a mouse is active over the same web page for hours at a time. Teramind, a software firm that can identify repetitive cursor movements, found that out of one million employees sampled, 7 per cent appeared to be faking activity at work. This year, one American bank fired more than a dozen of its workers for pretending to work.\n\nSome software also offers the ability to log into an employee’s device remotely or track an employee’s tone and mood, and judge how useful their conversations are. One such program, Aware, can sync with popular workplace chat tools, such as Slack, to check the conversations of specific employees. It also claims to use artificial intelligence to track employee sentiment and monitor for certain behaviours. Loading Starbucks, AstraZeneca and Nestle all use software to monitor chats, which can also identify bullying, harassment and apparent discrimination. Elsewhere, one major consultancy company checks the IP address of remote workers to check they are not “working from the beach”. Employers that want staff back in the office are also using programs to monitor attendance. PwC, which has asked employees to go back three days a week, said it will track where its staff work to enforce the rules. Outfoxing bosses\n\nSome staff are already taking matters into their own hands – and their tactics are getting more hi-tech. A finance sector worker told The Telegraph that they, having some systems literacy, were able to bypass surveillance software by finding out which processes it tracked and looking for holes. “If the software only surveils processes called “chrome.exe”, “opera.exe”, “firefox.exe” you make a copy, rename it “excel.exe” or something and you’re good to go,” they said. Others have been able to bypass the top-end software, which might surveil keywords and take screenshots, by creating a virtual machine on the work computer which is untrackable. Labour’s promise to strengthen employment rights could affect this kind of surveillance software, by ensuring that bosses negotiate with staff and unions over its usage. Already, a patchwork of legislation, from GDPR to Employment Rights Act provisions, place limits on what bosses can do when it comes to digital surveillance. Does this software actually work? Amit Raj, founder of the Links Guys, who runs a fully remote company and uses tracking software, says even the most intricate tracking software wouldn’t be able to account for some remote staff’s get-out-of-work ploys.\n\n“There will always be some people who don’t work. While I’m not worried about employees watching YouTube for a few minutes, you can’t really track someone if they’re watching something on a second device and not working.” This hasn’t stopped Raj from looking into how to ensure staff stay on track. The software he uses to surveil staff, apart from senior hires, includes activity tracking, screenshots, time tracking, and the ability to check breaks. He describes how this software’s screenshot application has caught someone who just kept a work program open all day without doing much. But this requires an investigation with HR to confirm if that worker was actually doing anything, and he questions how useful some of the tracking software is. “It can’t tell you if they’re actually on a computer,” he says. Raj also uses surveillance software at the interview stage, to catch out jobseekers using so-called “virtual candidates” or ChatGPT to complete tasks. Of course, there are limits. Experts in HR worry surveillance might end up with unproductive consequences, impacting innovation, and sparking burnout and affecting wellbeing too. Others have questioned if they can truly track how work, well, works. Do they take into account paper notes, meetings, having to use the toilet?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/socialite-learns-fate-after-ramming-cars-after-boozy-lunch-20250811-p5mm3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Socialite learns fate after ramming cars after boozy lunch",
        "publish_date": "Mon, 25 Aug 2025 11:42:34 +1000",
        "category": "finance",
        "authors": [
            "Perry Duffin"
        ],
        "text": "A Sydney socialite, who smashed into multiple parked cars before horrified diners tried to pull her from her Range Rover in front of the Herald’s cameras, has been disqualified from driving and fined after losing a bid to have her case thrown out on mental health grounds.\n\nVanessa Jacobs Fennell was allegedly “doing laps” around Bellevue Hill with shredded tyres when she smashed into a parked Tesla and grazed other cars in late March.\n\nVanessa Jacobs Fennell, 54, refused a breath test and assaulted an officer after crashing her Range Rover into parked cars in Bellevue Hill earlier this year. Credit: Edwina Pickles\n\nThe Herald came across the wreck as Jacobs Fennell was being pulled from behind the wheel of the badly damaged black SUV by shocked members of the public.\n\nShe had been drinking at a lunch in the wealthy enclave of Double Bay with friends hours earlier.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/young-family-pays-5-59m-for-historic-south-melbourne-terrace-20250825-p5mpih.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young family pays $5.59m for historic South Melbourne terrace",
        "publish_date": "Mon, 25 Aug 2025 11:39:47 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "“The sellers have owned the home for 48 years, so it was a rare opportunity to secure the best address in town,” said Lanyon. Records show the home last traded in 1977 for $81,000. The property was one of 943 scheduled to go to auction in Melbourne over the week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 75.1 per cent from 719 reported results, while 53 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. Elsewhere, a first-home buyer beat out five others for the keys to a Keilor Downs townhouse, securing it at auction for $691,000 on Saturday.\n\nWith a price range of $570,000-$600,000, 8A Karu Court sold for $91,000 over its reserve of $600,000. “The bidding was so fast I didn’t even get time to announce it was on the market until it hit about $650,000, where there was a pause,” said selling agent Andrew Koulaouzos from Barry Plant Taylors Lakes. Six registered bidders took part in the auction, all were young first-home buyers. The auction opened at $570,000, quickly rising to $650,000, then slowed down, with two active bidders remaining.\n\nThe new owners celebrated with their whole family, who were in attendance, said Koulaouzos. Loading “They were rapt, it was like they had just got married,” he said. The three-bedroom home had over 57 parties inspect it over the campaign; the interest had a lot to do with the staging. “They put a fresh coat of paint on the inside walls, spruced up the garden, and staged the interior with new furniture and curtains,” Koulaouzos said.\n\n“A lot of people don’t value staging, but it can definitely give the property more appeal.” In Parkdale, a renovated weatherboard home sold under the hammer for $1,735,000. The four-bedroom home at 44 Keith Street had a price guide of $1.55 million to $1.65 million and a reserve at the top of the range. Two active bidders took part in the rapid-fire auction, said selling agent Aidan Oke from Ray White, The Bayside Group.\n\n“We had a couple trying to upsize out of Bentleigh, who were the underbidder, and a local young family that purchased it,” Oke said. Loading The location of the four-bedroom, single-level home in a coveted Bayside enclave was a major drawcard. In an interesting sign of the market, Oke said that another agent sold a house on the next street for $1.65 million recently, which is “really comparable.” “I’m a Parkdale local, so I really take notice of the market, and that’s a sign of a five per cent shift in the family home market in the space of a couple of weeks,” he said.\n\n“I think more people have more access to cash with the recent rate cuts, and given it’s not even spring yet, it’s a promising sign for the local market.” LJ Hooker’s head of research, Mathew Tiller, said Melbourne’s auction clearance rate reflects a strength in buyer numbers, both attending open homes and bidding at auctions. “There has definitely been an uptick from buyers, we saw it after the first rate cut and definitely now again after the second, not just in auctions but in sales more generally,” he said. Tiller also noted that there is still a “really low” level of listings in the Melbourne market.\n\n“This is driving buyer demand, especially for quality listings with a good location and good price point,” he said. Loading In Camberwell, a five-bedroom Californian bungalow with its own putting green passed in at auction but sold later that day for $3.85 million after private negotiations. The home at 12 Radnor Street had a price guide of $3.6 million to $3.96 million. While Belle Property Director Steve Burke declined to disclose the reserve, he said that it “was sold well in the range.” The auction drew a crowd of 60, with three active bidders participating.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/i-only-feel-half-alive-mushroom-lunch-survivor-reveals-heartbreak-of-life-without-his-wife-20250825-p5mpkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I only feel half alive’: Mushroom lunch survivor reveals heartbreak of life without his wife",
        "publish_date": "Mon, 25 Aug 2025 11:33:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "I think that the way our children [conducted] themselves through the crisis of our illness and the subsequent legal proceedings is testament to her mothering skills. Our children were thrown into an unprecedented situation in which they suddenly had to take medical responsibility for the lives of their parents: the trauma that they experienced at their mother’s death and at my near-death has left deep wounds. I’m deeply grieved by their ongoing pain. Heather was a proud grandma who loved each of our six grandchildren. Heather took an active interest in their lives and created activities that would bring them together. Family events are no longer the same. A very important member of our family is missing. Heather was also a fellow traveller with me in the way of Jesus, along with many other people. She took her faith very seriously. It shaped her life and the way that she lived. Heather was full of love, joy, peace, patience, kindness, gentleness, faithfulness and self-control. All the fruits of the spirit of Jesus living in her, we encouraged each other and urged each other on to love God and love our neighbours as ourselves. Convicted triple-murderer Erin Patterson arriving at the Supreme Court of Victoria in Melbourne on Monday. Credit: Jason Edwards She had a particular compassion for strugglers and disadvantaged people, and that was reflected in the teaching, mentoring work she chose to do when she re-entered the workforce after our children had reached secondary age.\n\nI could go on; there’s so much more that deserves to be said about Heather. It’s one of the distressing shortcomings of our society that so much attention is showered on those who do evil and so little on those who do good. The greatest impact of Erin’s actions on me has been to deprive me of Heather’s company and Heather’s important place in our family – the silence in our home is a daily reminder. I continue to carry a heavy burden of grief over her untimely death. It’s a truly horrible thought to live with, that somebody could decide to take her life. I only feel half alive without her. My consolation is that we will be reunited in the resurrection and the age to come. In a similar vein, the second-heaviest impact on me has been the loss of Don and Gail. They were the next two closest people to me, after Heather and our family, and again, they were good and solid people. No doubt their families will say more about them, but I would like to acknowledge their good character and their constructive influence on my life. Our families grew up together. They were all so serious about following Jesus, and we encouraged and supported each other for about 50 years. My life is greatly impoverished without them. I have suffered severe personal impacts from Erin’s actions.\n\nI very, very nearly died. It has taken me the best part of two years for my health and strength to recover to the point that I have. I praise God for my miraculous healing, and I thank the many medical professionals who strived to save all four of us. They threw everything into our care. I joke that I know this because I have a bump on the back of my head from the kitchen sink. It’s a grief to them that Heather, Gail and Don died. Although I’ve made a good recovery, my health has never returned to the levels I had before the fateful lunch. I have reduced kidney function, ongoing respiratory issues and reduced energy, and I’ve had to face the many challenges of re-establishing life without Heather. The challenge has vastly changed … I’m suddenly single. The heartbreak of having to wind up her affairs. Returning to pastoral work without her help and sage advice. Unsettled sleep. Nobody to share in life’s daily tasks, which has taken much of the joy out of pottering around the house and the garden. Nobody to debrief with at the end of the day. The impacts are so many and varied, some big and a myriad of small things, that no list could ever contain them. Loading I’m distressed that Erin has acted with callous and calculated disregard for my life and the lives of those I love. What foolishness possesses a person to think that murder could be the solution to their problems, especially the murder of people who had only good intentions towards her? Erin has brought deep sorrow and grief into my life and the lives of many others, the ripples spread out through family, friends, our church, congregation, the local community and beyond.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/he-clowns-around-on-tv-but-basketball-s-bradman-was-once-known-for-showing-a-different-emotion-20250815-p5mn95.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "He clowns around on TV. But basketball’s Bradman was once known for showing a different emotion",
        "publish_date": "Mon, 25 Aug 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "He was a seven-time NBL most valuable player (the trophy is named in his honour), and 14-time scoring champion, winning championships in 1993 and 1997. He was a first-team All-NBL player for a record 15 straight seasons, and averaged a phenomenal 30.8 points per game through a stunning career. Gaze led the Boomers to five Olympics, and was the flag bearer and overall team captain at the 2000 Sydney Games. The award for the best Australian international player of the year is the Gaze Medal. In 2013, he joined his father Lindsay, the godfather of Australian basketball, in the FIBA Hall of Fame. All this from a boy who literally grew up at the old Albert Park Basketball Stadium, where Lindsay was the general manager and the family lived in the attached residence. Gaze fell just short of an Olympic medal. The Boomers finished fourth three times (1988, ’96 and 2000) during his time. The bronze medal loss to Lithuania at the Atlanta Games in ’96, when star centre Arvydas Sabonis nailed two big three pointers, still hurts. Had the Australians had Luc Longley available through the tournament – the towering centre had been asked by the Chicago Bulls to have ankle surgery – a maiden men’s basketball medal may have been within reach.\n\n“Those moments are of what-ifs, or if only had he [Sabonis] missed a couple of those, it might have been a different outcome,” Gaze said. Those were the days: Melbourne Tigers’ greats Mark Bradtke, Andrew Gaze and Lanard Copeland. Credit: Fairfax Photographic The teary emotions Gaze had on national television when that drought was finally broken at the 2021 Olympics in Tokyo highlighted how much the Boomers still mean to him, a legacy of growing up around the team when his father was coach. “The thing that sticks out the most for me, I cast back to when I was a youngster, and the Australian team, the values around the team, and playing for Australia, and competing at the Olympic Games, and the spirit of the games, they were instilled in me because of my dad and, because of that, all my dreams as a youngster were Australian team and Olympic centric,” Gaze said. “Unlike today, where you can just jump on your phone, or watch it on television, access to college basketball, NBA, European basketball was basically non-existent.”\n\nGaze remains arguably the greatest shooter this country has produced, his classical technique making him and Brazilian great Oscar Schmidt as feared as any US star when it came to the Olympics, where Schmidt and Gaze still sit one and two for most career points, and the world championships. Loading In the late 1980s, The Age ran weekly sketches of instructional training and technique advice from Gaze, who remembers these fondly. It was an idea ahead of its time, this type of information now the domain of social media and the innumerable so-called basketball experts the sport breeds. Gaze’s one season with US college Seton Hall University in 1988-89, when the Pirates had a Cinderella run to the NCAA final, losing in overtime to the Michigan Wolverines, with Gaze starting in all games, sparked live coverage of the games in Australia, and extensive media exposure. He narrowly missed an NBA contract with the Seattle Supersonics. He was a pioneer in playing professionally in Europe, and his time in the NBA initially came with a stint with the then Washington Bullets in 1994. There was another with the 1998-99 San Antonio Spurs, but he did not suit up as a member of the actual playing squad through the play-offs en route to their title. Still, he received a championship ring. His perimeter shooting, and ability to space the floor, would have been ideal in the modern game.\n\n“I had my opportunities, I got a taste of it, but there were some ... decisions that I made during that period of time, if I had thrown myself out there a bit more, perhaps been a bit more aggressive at exploring opportunities, things might have been different, but not different enough that I have any regrets,” Gaze said. Gaze coached in the NBL with the Sydney Kings from 2016-19, and revealed a desire to still coach at the top level in Australia, or abroad, potentially in Asia, where opportunities beckon. Cricketing great urges caution over privatisation bid Australian cricket great Belinda Clark has urged the sport’s authorities to retain a country-over-club mantra when it comes to debating privatisation of women’s Twenty20 cricket.\n\nA report by the Boston Consulting Group has listed alternative forms of investment and ownership, including privatisation, of the men’s and women’s Big Bash Leagues for Cricket Australia to consider in a bid to help strengthen the standing of the two competitions, and attract the extra funds needed to lure the world’s best players, particularly in the men’s league. CA, state associations and other key figures are debating the report, but Clark – a former senior CA executive and interim chief executive officer who on Monday was elevated to legend status in the Sport Australia Hall of Fame – said caution was required when it came to ensuring the women’s program, including its pathways, continued to grow. Great honour: Cricketing great Belinda Clark has been elevated to legend status in the Sport Australia Hall of Fame. Credit: Paul Harris “I think it [privatisation] is definitely worth exploring appropriately. Whether it’s privatised or not, I think the key issue for the sport is how it balances the international game and the domestic game. If you throw all that league cricket into the domestic bucket, it’s really challenging,” Clark said. “I think the women’s game has done a pretty good job so far of balancing those two things. I think the men’s game has a challenge on its hands, but I think it’s important that the lens we look through for both the men’s and women’s game is specific for them, and I think the women have the chance to get the balance right.\n\nLoading “The men are in a position where they are trying to balance it. It’s something that has got to be a bit of give and take, whereas the women aren’t at that point. It’s really important that we keep international cricket as the premier competition. “What that does is it allows you to grow the game globally, these domestic leagues won’t allow you to do that in the same way. You don’t get the opportunities unless you are at the top of the tree to be playing in the domestic comps. I feel a really strong sense that this game should have opportunities for everyone, that we do need international cricket at all of its levels to continue to expand and provide people with the chance to play.” Clark, 54, has played an instrumental role in the rise of women’s cricket, as a player, captain and administrator, who now runs her own leadership company. Already with a swag of honours, Clark has been bestowed another by the Sport Australia Hall of Fame, having been inducted in 2011 as an athlete member.\n\nLoading “I feel a mix of gratitude, humbleness, just amazed that it has all led to this,” Clark said. A superb leader and one of the finest batters of her generation, Clark was captain of the Australian women’s team for 11 years from 1993, and won World Cups in 1997 and 2005. She still retains the record for most runs (4844 at an average of 47.49) by an Australian woman in ODIs, ahead of Karen Rolton and Meg Lanning, and has captained the most matches (101) with an 83 per cent winning record. She was the first woman to score a double century in a one-day international. “I am really proud the sport has moved along to where there is so much cricket going on now, both ODIs and T20s in particular. Which is why it lends itself to becoming a professional sport, because you are playing a lot,” Clark said.\n\nClark was the first woman inducted into the Australian Cricket Hall of Fame and the second in the ICC Cricket Hall of Fame. In 2023, a statue of Clark was unveiled outside the members’ entrance to the Sydney Cricket Ground. “I often get people sending me pictures of them with it, and I just love it. That’s fun and I enjoy that,” Clark said. Her legend status in the Sport Australia Hall of Fame caps a remarkable journey for a woman who grew up in Newcastle where her father, Allan, was an excellent local cricketer, while mother Margaret was a state tennis champion. Clark dreamt of winning Wimbledon, and idolised John McEnroe and Martina Navratilova. “I still take an interest. I think tennis is a great sport, particularly as a kid, it teaches you tactics, it teaches you movement, it teaches you to be self-reliant, there is no one out there with you … you are umpiring yourselves, so there is an element of being able to call a game yourself,” Clark said.\n\n“I really loved the game, but it just got to a point where cricket became a passion, it became the sport I loved the most.” Clark turned to cricket at 13 when at Newcastle High School, and later played district cricket in Sydney for Gordon. She debuted for Australia in an ODI in 1991, and a fortnight later posted a century on Test debut against India at North Sydney Oval. Clark was made Australian captain in 1993 after a disappointing World Cup sparked change. She was a key figure in the World Cup win in India in ’97, top-scoring with 52 in a low-scoring final against New Zealand. Her 970 runs that year remains a calendar year ODI record in the women’s game. There was more World Cup glory in 2005, when the Australians edged India in the final. Clark retired later that year, her 15 Tests reaping 919 runs at 45.95. So great has contribution been to the sport that the Australian women’s international player of the year is awarded the Belinda Clark Medal, as is the NSW Breakers’ player of the year in the women’s national cricket league.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/health-housing-and-wages-on-parliament-agenda-in-coming-fortnight/9i98k8vlp",
        "title": "Health, housing and wages on Parliament agenda in coming fortnight",
        "publish_date": "Mon, 25 Aug 2025 02:00:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pro-palestinian-march-organisers-say-support-at-record-levels/tl7cru0os",
        "title": "Pro Palestinian march organisers say support at record levels",
        "publish_date": "Mon, 25 Aug 2025 01:59:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/prime-minister-condemns-climate-wars-ahead-of-policy-debate-midday-news-bulletin-25-august-2025/el7hrs4d2",
        "title": "Prime Minister condemns \"climate wars\" ahead of policy debate | Midday News Bulletin 25 August 2025",
        "publish_date": "Mon, 25 Aug 2025 01:52:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Coalition debate future of net zero emissions target as Prime Minister weighs in\n\nTreasurer defends tax provisions that he says incentivise building superannuation\n\nAustralian tennis player Jordan Thompson heads to second round of the US Open\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA coalition split over net zero will play out in parliament as crossbench MPs push for stronger climate action.\n\n\n\n\n\nNationals MP Barnaby Joyce has revived his bill to scrap emissions targets, which Labor has allowed to be debated today.\n\n\n\n\n\nThe bill is certain to fail but is expected to expose divisions between Nationals who want the target repealed and moderate Liberals who say it must remain to show credibility on climate change.\n\n\n\n\n\nPrime Minister Anthony Albanese is accusing the opposition of reigniting what he calls the climate wars.\n\n\n\n\n\n\"It is defying what we see happening around us and defying the science. If you get rid of net zero, you are saying climate change is not real and you do not need to do anything about it. ... Now our opponents are having a debate, and they have one on the weekend at the LNP conference, we had the leader of the opposition come along and be repudiated by more than 90 per cent of members at that LNP conference.\"\n\n\n\n\n\nData released by Climate Change Minister Chris Bowen found Australia is tracking well to meet its 2030 target to reduce greenhouse gas emissions by 43 per cent from 2005 levels.\n\n\n\n---\n\n\n\n\n\nRetirees should continue to receive concessional tax treatment on their superannuation, Treasurer Jim Chalmers says, despite growing pressure for broader tax reform.\n\n\n\n\n\nSpeaking after a three-day productivity roundtable in Canberra, Dr Chalmers says fairness for younger generations must be part of future tax discussions.\n\n\n\n\n\nWhile feedback from the summit would shape upcoming budgets, he's told the ABC there are no plans to change tax concessions for retirees’ super balances.\n\n\n\n\n\n“They still deserve concessional treatment to encourage people to be in superannuation, and that’s not something we are proposing to change. ... We acknowledge that there are issues in superannuation and tax, and that's why two and a half years ago, I proposed what is a pretty modest change, but a meaningful change which makes the system a bit more sustainable, but still maintains an element of concessionality when it comes to tax treatment and super.”\n\n\n\n---\n\n\n\n\n\nThe Albanese government is set to bring forward the expansion of a scheme allowing first home buyers to put down a deposit of as little as five per cent.\n\n\n\n\n\nWhile previous iterations of the initiative had a yearly cap on participants, the scheme will now be open to all home buyers.\n\n\n\n\n\nOriginally slated for implementation in January 2026, the expanded scheme will begin rolling out from October.\n\n\n\n\n\nUnder the scheme, a first home buyer looking to purchase a property at the national median price of $844,000 would only need a $42,200 deposit.\n\n\n\n\n\nHousing minister Clare O'Neil says it is clear young people need greater access to the property market.\n\n\n\n\n\n\"This policy is going to have a hugely meaningful impact for the people who choose to use it. What we know is that it is incredibly challenging for this younger generation to get into home ownership. We are seeing young people having to save 8 or 9 years to build a deposit. With the 5 per cent deposit program that our government is expanding, we see that timeline brought back to two or three years.\"\n\n\n\n---\n\n\n\n\n\nIran’s Supreme Leader has declared the standoff with the United States unsolvable, insisting Tehran will never submit to US demands over its nuclear program.\n\n\n\n\n\nAyatollah Ali Khamenei’s remarks follow the suspension of nuclear talks with Washington after US and Israeli strikes on Iranian nuclear sites during a 12-day war in June.\n\n\n\n\n\nAlthough Iran and European powers agreed last week to resume discussions aimed at reviving full negotiations, France, Britain, and Germany have warned they could trigger further UN sanctions if Iran refuses to re-engage.\n\n\n\n\n\nWestern governments maintain Iran is seeking to develop nuclear weapons, a claim Iran rejects, saying it only wants nuclear energy.\n\n\n\n\n\nAyatollah Khamenei accuses the US of disrespecting Iranian sovereignty.\n\n\n\n\n\n“This issue of negotiation with America is unsolvable. The President of the U-S wants Iran to obey America’s orders. The Iranian nation is deeply offended by such a great insult and will stand up, with all its strength, to those who hold such misguided expectations.”\n\n\n\n---\n\n\n\n\n\nJordan Thompson is the first Australian into the U-S Open second round after a 6-2 / 6-4 / 1-6 / 6-3 win over France’s Corentin Moutet in New York.\n\n\n\n\n\nAfter dropping the third set and venting his frustration, Thompson regrouped and sealed victory with a backhand smash and a net finish.\n\n\n\n\n\nHe next faces French left-hander Adrian Mannarino.\n\n\n\n\n\nCompatriot Rinky Hijikata exited earlier, losing 6-2 / 6-1 / 6-2 to Italy’s 32nd seed Luciano Darderi.\n\n\n\n\n\nMeanwhile, former tournament winner, Britain's Emma Raducanu has won her first US Open match in four years, with a straight sets defeat of Japanese qualifier Ena Shibahara.\n\n\n\n\n\nRaducanu says she overcame nerves and was pleased with her performance.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/first-home-buyers-score-early-access-to-deposit-scheme/vpryr80bt",
        "title": "What is the government's 5 per cent home deposit scheme, and what's changing from October?",
        "publish_date": "Sun, 24 Aug 2025 20:51:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "All first home buyers in Australia will be able to get on the property ladder with a lower deposit sooner, as a federal scheme kicks in earlier than scheduled.\n\n\n\n\n\nThe government's expansion of the First Homebuyer Guarantee will allow all first-home buyers to put down a deposit of 5 per cent, and will start rolling out from 1 October, three months earlier than its original start time of January 2026.\n\n\n\n\n\nThe earlier start date for the scheme would reduce hurdles to entering the property market, Prime Minister Anthony Albanese said.\n\n\n\n\n\n\"We want to help young people and first home buyers achieve the dream of home ownership sooner,\" he said in a statement.\n\n\n\n\n\n\"Bringing the start date of our 5 per cent deposit scheme will do just that, getting more Australians into their home quicker, while saving money along the way.\"\n\n\n\nWhat is the first home buyer scheme?\n\nThe scheme allows first-home buyers to buy a property with a smaller 5 per cent deposit, compared to the usual 20 per cent.\n\n\n\n\n\nThe government acts as guarantor and contributes the remaining 15 per cent of a deposit, allowing buyers to avoid taking out costly lenders' mortgage insurance.\n\n\n\nWhat changes are coming to the scheme?\n\nWhile the scheme isn't new, it will be expanded from 1 October to all first-home buyers — after previous versions had a yearly cap on the number of participants.\n\n\n\n\n\nSimilarly, there will no longer be income limits for participants' eligibility for the scheme.\n\n\n\n\n\nPrice caps for eligible homes in the scheme in almost all jurisdictions will also be raised from October.\n\n\n\nHousing Minister Clare O'Neil said the scheme would make access to home ownership fairer. Source: AAP / Mick Tsikas In Sydney, the cap will increase from $900,000 to $1.5 million, in Brisbane it will increase from $700,000 to $1 million, and in Melbourne it will increase from $800,000 to $950,000.\n\n\n\n\n\nIt's estimated 70,000 people are expected to use the home guarantee scheme in its first year of expanded access, 20,000 more than the current yearly cap.\n\n\n\n\n\nHousing Minister Clare O'Neil said the scheme would make access to home ownership more equitable by \"levelling the playing field\", particularly for younger people entering the property market.\n\n\n\n\n\n\"It's just not right that an entire generation of young Australians have been locked out of the housing market, saving for decades while paying off someone else's mortgage.\"\n\n\n\nWhat's been the reaction to it?\n\nThe Housing Industry Association (HIA), the country's peak national industry association for the residential construction and development industry, welcomed the expansion.\n\n\n\n\n\nHIA managing director Jocelyn Martin said: \"This promises to open doors for more people and is an important boost for aspirational home buyers in Australia.\"\n\n\n\n\n\n\"This will make homeownership more accessible to those who may have previously been locked out of the market.\"\n\n\n\n\n\nThe Property Council of Australia said bringing forward the scheme would help more first-home buyers bridge the deposit gap and enter the market.\n\n\n\nBut CEO Mike Zorbas said on Monday the scheme design would need to be carefully reviewed on a regular basis from mid-2026 \"to ensure key housing markets do not overheat\".\n\n\n\n\n\nEverybody's Home, a national campaign aimed at addressing Australia's housing crisis, partially through increased social housing, said the scheme was \"good for some\" but was \"not a solution to the housing affordability crisis for all\".\n\n\n\n\n\n\"The real solution to Australia's housing crisis is to bring down the cost of housing for everybody through measures including tax reform and more social housing,\" spokesperson Maiy Azize said.\n\n\n\n\n\n\"Too many Australians are locked out of home ownership because they are stuck in a rental market that makes it extremely difficult to save.\n\n\n\n\n\n\"To tackle the housing crisis, the federal government must make major investments in social housing; these are low-cost rentals that are guaranteed to remain affordable. Australia already faces a social housing shortfall of 640,000 homes, and that gap is only widening.\"\n\n\n\n\n\nOpposition housing spokesperson Andrew Bragg was critical of the scheme being open to all first-home buyers without any income testing.\n\n\n\n\n\n\"This is an uncapped scheme which is available to billionaires, or the children of billionaires, if they want to use a government program,\" he told ABC radio on Monday morning, warning of taxpayers \"underwriting mortgage insurance schemes for extremely wealthy people\".\n\n\n\nWhat other changes are coming to housing?\n\nThe scheme's earlier start date comes as upcoming changes to the national construction code were paused to allow for homes to be built quickly.\n\n\n\n\n\nThe code will be put on hold until 2029, with the exception of safety standards, which have been touted as reducing complexity for workers in the construction industry.\n\n\n\n\n\nThe pause follows the federal government's productivity roundtable, which also led to the fast-tracking of environmental approvals for more than 26,000 homes.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thailand-cannabis-government-policy-reversal-shut-down/zhxue87ag",
        "title": "'They couldn't bear it': The city where cannabis shops are disappearing post-high",
        "publish_date": "Sun, 24 Aug 2025 19:33:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "For three years, downtown Bangkok has had a green glow.\n\n\n\n\n\nNeon cannabis leaves light up practically every corner; an inescapable marker of what quickly ballooned into a billion-dollar industry.\n\n\n\n\n\nMore than 18,000 recreational marijuana shops sprang up, seemingly out of nowhere, when Thailand became the first Asian nation to decriminalise cannabis in 2022.\n\n\n\n\n\nTheir glory days may have been short-lived.\n\n\n\n\n\nLast month, the government introduced new regulations restricting cannabis to medicinal use only, banning dispensaries from selling the drug to anyone without a prescription.\n\n\n\nSuradeth Wattanasoontornkul runs a small cannabis dispensary outside Bangkok's city centre. He says he's lost almost all his business. Source: SBS News It's now flagging more rules to come; planning to cut shop numbers back almost 90 per cent to 2,000 and require each one to have a doctor on site.\n\n\n\n\n\n\"The customers are gone,\" cannabis shop owner Suradeth Wattanasoontornkul says. \"They are scared. Everyone's business is going down.\"\n\n\n\n\n\n\"The shop opposite us just closed. They probably couldn't bear it anymore.\"\n\n\n\n\n\nSo far, there's no real evidence Thai authorities have started enforcing the new regulations, but Suradeth says the fear they will has scared most of his customers away.\n\n\n\n\n\nHe used to sell more than $7,000 worth of cannabis every month. Last month, it dropped to less than $500.\n\n\n\n\n\n\"We paid 5,000 baht ($240) to the government for a licence, but once we get that licence, they release new regulations and tell us the one we have is useless,\" Suradeth says.\n\n\n\n\n\n\"Sure, you can hire a doctor, but the cost is very high, and not every doctor wants to work in a cannabis shop.\"\n\n\n\nThe governmental feud fuelling recriminalisation\n\nThailand's health minister says the reforms are about improving public safety and addressing rising cannabis addiction, but analysts say they are also wound up in Thailand's latest political crisis.\n\n\n\n\n\nIn June, former Cambodian leader Hun Sen leaked the audio from a controversial phone call with Thai Prime Minister Paetongtarn Shinawatra , during which she appeared to make disparaging remarks about her own military's handling of the recent border crisis.\n\n\n\n\n\nHer political allies in the Bhumjaithai Party, which was the main driving force behind cannabis decriminalisation, withdrew from the coalition in outrage.\n\n\n\n\n\nWithin a week, Shinawatra's Pheu Thai Party had moved to recriminalise the drug .\n\n\n\n\n\nThe reversal on cannabis \"has a lot to do with coalition dynamics and coalition politics,\" political analyst Thitinan Pongsudhirak from Chulalongkorn University in Bangkok, says.\n\n\n\n\n\n\"The cannabis policy in Thailand is synonymous with the Bhumjaithai Party. It wanted to broaden its political base by decriminalising cannabis. So, suddenly, you had these cannabis shops mushrooming around Thailand, especially in Bangkok,\" he says.\n\n\n\nThe Thai government has flagged plans to cut cannabis shop numbers back almost 90 per cent to 2,000 and require each one to have a doctor on site. Source: SBS News The industry experienced near-instant economic success; its value was already estimated above $1 billion, with the Thai Chamber of Commerce predicting that number could rise to $1.8 billion by the end of this year.\n\n\n\n\n\nAnalysts believe tourists were behind much of the enthusiasm.\n\n\n\n\n\n\"I think there was a public backlash against it,\" Pongsudhirak says.\n\n\n\n\n\n\"The constituencies in favour of cannabis were limited; some vendors, proprietors, tourists, the hospitality industry. But the public sentiments at large are very sceptical. The Thais, being a predominantly Buddhist country, still frowned upon vices like this.\"\n\n\n\n\n\nThailand's public health minister Somsak Thepsuthin says he eventually wants to relist cannabis as a category five narcotic, which would result in tougher penalties for recreational use and possession, including jail time.\n\n\n\n\n\n\"We want to tell tourists they are welcome to enjoy Thailand's culture and nature, but Thailand should not be seen as a destination for recreational cannabis use,\" Thepsuthin recently said. \"It affects children, causes nuisance from unwanted odours.\"\n\n\n\nAn industry moving underground\n\nWith the new restrictions widely unenforced and more regulations on the way, the industry has settled into a grey zone for now.\n\n\n\n\n\nThose trying to keep their businesses open say there is little clarity and a lot of confusion.\n\n\n\nKitty Chopaka says cannabis dispensary owners are reporting a rise in tourists selling the drug to other tourists, suggesting the billion-dollar business is now moving underground. Source: SBS News \"The health department is coming out with one set of information, the provinces are coming out with another set of information, when a lot of things are actually still on the drawing board,\" Kitty Chopaka from advocacy group Writing Thailand's Cannabis Future says.\n\n\n\n\n\n\"The shops in the provinces where the health officers happen to be strict, they are now either shut down, or are being told 'We suggest you shut down until the rules are more concrete, but if you don't shut down we will come and do a little inspection where we're then probably able to suspend your licence'.\"\n\n\n\n\n\nChopaka has been speaking with a network of dispensary owners almost daily as they try to navigate the changes.\n\n\n\n\n\nThey have consistently been reporting a drop in sales since the prescription rules came into effect, but they do not believe that correlates with a drop in usage. Many believe tourists are now buying the drug from other tourists instead of the dispensaries.\n\n\n\n\n\nSome of the 18,000 registered shops have begun shutting down, while others are holding out to see if they might be one of the few that get to stay in business.\n\n\n\n\n\n\"A lot of the small businesses are going to get removed, the small farms, the ones where the husband is the grower, the wife is the trimmer, then maybe the mother-in-law is the seller at the shop. Those guys are not going to exist anymore,\" Chopaka says.\n\n\n\n\n\n\"I would say one small business is about ten lives you're dealing with. You've got the owner, the farms, the people who work in the shop, all of the production side of things. Each of them will have a family. And you times it by 18,000 — that's a lot of people.\"\n\n\n\n\n\nShe says: \"That's the sad part.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-rapa-nuis-famous-moai-statues-are-under-threat/a7vwmg2rb",
        "title": "INTERVIEW: Rapa Nui's famous moai statues are under threat",
        "publish_date": "Sat, 23 Aug 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-truth-about-working-from-home-and-should-we-work-on-friday-afternoons/tjp0um4gy",
        "title": "INTERVIEW: The truth about working from home - and should we work on Friday afternoons?",
        "publish_date": "Sat, 23 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/win-win-roadmap-government-pauses-building-code-updates-to-speed-up-housing-supply/ayylbnkqk",
        "title": "'Win-win roadmap': Government pauses building code updates to speed up housing supply",
        "publish_date": "Sat, 23 Aug 2025 21:21:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government says it has the balance right between sustainability and energy standards and removing red tape to speed up building approvals.\n\n\n\n\n\nA suite of changes to construction guidelines aimed at reducing delays comes after Treasurer Jim Chalmers confirmed alterations to the national code at the conclusion to last week's productivity summit.\n\n\n\n\n\nUnder the plan, updates to the 2000-page construction code will be frozen until mid-2029 once the 2025 changes are finalised. The code normally updates every three years.\n\n\n\n\n\nThe freeze excludes essential safety and quality changes and maintains the strong residential standards adopted in 2022, including 7-star energy efficiency.\n\n\n\n\n\nThe government will use the pause to streamline the code, including improving its usability with artificial intelligence, removing barriers and encouraging modern methods of construction, such as prefab and modular housing, and improving how code additions are developed.\n\n\n\nJim Chalmers confirmed alterations to the national code at last week's productivity summit. Source: AAP / Mick Tsikas Removing building red tape to speed up housing construction won't cut corners on standards, Housing Minister Clare O'Neil said.\n\n\n\n\n\n\"It's too hard to build a home in this country. We want builders on site, not filling in forms to get their approval,\" she said.\n\n\n\n\n\nThe government will also fast-track environmental assessment applications for more than 26,000 homes by creating a specialised environment department team, prioritising robust development applications.\n\n\n\n\n\nIt is also looking to use AI tools to simplify and hasten approvals.\n\n\n\n\"Piloting an AI program to help users navigate the volumes of codes and standards will add significant value, allowing more time to build homes and potentially reducing paperwork,\" Housing Industry Association director Jocelyn Martin said.\n\n\n\n\n\nEnvironment Minister Murray Watt said fast-tracked projects will still need to meet all environmental requirements, but developers will be incentivised to provide required information up front.\n\n\n\n\n\n\"This approach will ensure strong national environmental protections, while also leading to faster decision making, more certainty for industry and more homes for Australians,\" he said.\n\n\n\n\n\nRemoving impediments for superannuation investment in new housing and working with the states and territories to accelerate planning, zoning and approvals are also slated under the changes.\n\n\n\n\"We want builders on site, not filling in forms to get their approval,\" Housing Minister Clare O'Neil said. Source: AAP / Joel Carrett At the government's Economic Reform Roundtable in Canberra last week, a simplification and tidy-up of the code attracted broad support, with few disputing the need for standards that work together better and are easier to navigate.\n\n\n\n\n\nAs a \"floor\" for quality and performance, some saw it as a necessary tool to keep the next generation of homes safe, comfortable and not wasting energy.\n\n\n\n\n\nThe Property Council of Australia's Mike Zorbas said the measures will help unlock tens of thousands of new homes.\n\n\n\n\n\n\"This is a win-win roadmap to better housing supply,\" he said.\n\n\n\nMaster Builders Australia chief executive Denita Wawn applauded the government, saying the constant churn of regulatory change had added pressure to a complex and costly system.\n\n\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie, at the summit, warned a construction code freeze could mean households least able to afford home retrofits for a changing climate and energy future could lose out if reforms miss the mark.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-why-this-emergency-nurse-is-putting-his-life-on-the-line-again-in-gaza/9f7mw71cx",
        "title": "INTERVIEW: Why this emergency nurse is putting his life on the line – again – in Gaza",
        "publish_date": "Sat, 23 Aug 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/whats-behind-the-success-of-kpop-demon-hunters/5pu1ek9la",
        "title": "The hit Korean show that's infiltrated schools and stereos around Australia",
        "publish_date": "Sat, 23 Aug 2025 20:33:16 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "In schoolyards and dance clubs across the country, Australians are embracing a genre-bending animated film centred around a K-pop girl band that secretly fights demons.\n\n\n\n\n\nThe Netflix original KPop Demon Hunters has become an unlikely worldwide phenomenon, including in Australia, and is now the second most popular English-language movie globally.\n\n\n\n\n\nIn the nine weeks since its premiere on 21 June, it has racked up 210 million views and is second only to action comedy film Red Notice on the screener's list of most popular movies. It's the first animated movie to enter the list.\n\n\n\nThe animated film KPop Demon Hunters follows a girl band called Huntr/x. Source: Supplied / Netflix In Australia, KPop Demon Hunters is currently the number one film on Netflix and has spent nine weeks in the top 10.\n\n\n\n\n\nIt's become so popular that singalong screenings are being held in Hoyts cinemas across the country this weekend.\n\n\n\nWhat is KPop Demon Hunters about?\n\nThe English-language animated musical is a vibrant introduction to the world of K-pop and follows the lives of girl group Huntr/x, whose soaring vocals help keep demons away.\n\n\n\n\n\nThe music drives much of the film's appeal, and the soundtrack has been the number one album on the ARIA charts in Australia for five non-consecutive weeks. The song Golden has also topped the Top 50 Singles, securing a rare ARIA chart double.\n\n\n\n\n\nDirected and co-written by Maggie Kang, who was born in South Korea and grew up in Canada, the film was inspired by Kang's love of K-pop.\n\n\n\nREAD MORE Why Australians are getting hooked on Korean TV\n\n\"I have been a fan of these incredible artists and their work for many years, so it's a dream come true to have original songs written and produced for our film by legendary talent such as The Black Label [a leading South Korean record label],\" Kang says.\n\n\n\n\n\nDr Sung-Ae Lee, an expert in Asian cinema at Macquarie University, describes the film's blend of fast-paced visuals as channelling \"global energy\".\n\n\n\n\n\nShe points to its incorporation of K-pop culture, which thrives online, and says it reflects young people's use of social media platforms such as TikTok and YouTube, as well as its fan communities.\n\n\n\n\n\n\"I think it's kind of a turning point ... it's a really innovative idea of K-pop idols plus this fantasy genre,\" she says.\n\n\n\nKPop Demon Hunters follows the lives of K-pop superstars Rumi, Mira and Zoey, who use their secret identities as demon hunters to protect their fans from a supernatural threat. Source: Supplied / Netflix While Lee believes the success of the music, which is performed by real singers, is connected to its narrative context within the film, others have suggested it also demonstrates the potential for animated bands, possibly driven by artificial intelligence , to achieve chart success.\n\n\n\n\n\nSuk-Young Kim, a professor at the University of California, told the Wall Street Journal the film's success shows it's possible for fans to connect with nonhuman idols.\n\n\n\n\n\n\"This is a long-running dream for K-pop companies,\" Kim said. \"Here we have idols who never sleep, never get sick, never age.\"\n\n\n\nSchoolkids embrace hit film\n\nThe popularity of the film appears to have grown organically without the publicity that has helped fuel the success of other Netflix hits such as Red Notice.\n\n\n\n\n\nSydney mother Alison McLeod says she watched KPop Demon Hunters with her seven-year-old daughter after it was recommended by the Netflix algorithm.\n\n\n\n\n\nThe 44-year-old says the film reminded her of the Japanese manga series Astro Boy and other animations she watched as a child.\n\n\n\n\n\n\"I had friends that were into manga and definitely into K-pop music ... I knew a little bit about the genre and what to expect. And it just looked fun,\" McLeod tells SBS News.\n\n\n\nWhat I really liked once we started watching it was the themes ... the girl power.\n\n\"It embraces the [non] typical girl — these three girls are different. They just presented as really good role models for my little one, she's fiesty.\"\n\n\n\n\n\nHer daughter now re-enacts scenes from the movie with her friends at school, and McLeod says she also attended a seven-year-old's birthday party recently that featured songs from the soundtrack during a game of musical bumps (like musical statues but players sit instead of freeze).\n\n\n\n\n\n\"They were rocking out to the Demon Hunter soundtrack and every single kid there knew all the words,\" she says.\n\n\n\nMcLeod says her daughter is predominantly attracted to the music, with the film's soundtrack now on daily rotation in their car and home. But she also seems to identify more with the characters than those in other films, such as Encanto and Trolls, which have been previous obsessions.\n\n\n\n\n\nMcLeod has previously dyed her hair purple and both she and her partner have tattoos — like the lead character in Demon Hunters, Rumi. She says the film is helping her daughter to embrace differences in personal style and expression as \"cool\".\n\n\n\n\n\n\"We're not the norm in society, and I think that she [McLeod's daughter] feels like the Huntr/x girls embody that in a really cool way ... she'll [now] be like 'I can have purple hair'.\"\n\n\n\nA Hollywood film featuring Korean culture\n\nThe film has also been a hit within the Korean community and remains the top movie on Netflix in South Korea.\n\n\n\n\n\n\"I thought maybe Korean audiences [would] resist it but it was really popular and they like it,\" Lee says.\n\n\n\n\n\n\"I think it's because it's youth culture.\"\n\n\n\n\n\nLee says she didn't like KPop Demon Hunters the first time she watched it because it seemed Americanised.\n\n\n\n\n\n\"[While] the subject is quite Korean ... it's not Korean at all, it's actually Hollywood.\n\n\n\nThe animation is American to me — the body language and facial expression — they're all American, not Korean.\n\nShe says it's hard to pinpoint exact movements, but one example is shrugging, a common gesture in the US, and quite different to gestural conventions in Korean films.\n\n\n\n\n\nBut in other ways, it incorporates culturally Korean tropes, and folklore elements that Lee found impressive.\n\n\n\n\n\nThe film features a tiger and a magpie, a combination that is often seen in Korean folk paintings called Jakhodo. They symbolise good fortune and are thought to ward off evil spirits.\n\n\n\nA scene featuring a large tiger and magpie talking to the lead character Rumi. Source: Supplied / Netflix \"I was really surprised in the beginning [that] they're using it. I think it's one of the most beloved folk images [in Korean culture],\" Lee says.\n\n\n\n\n\nThe name of the boy band in the film, Saja, also has a dual meaning in Korean. It can refer to a lion, symbolising strength and courage, but can also refer to a grim reaper, a meaning that makes sense in the film as the band members are collecting souls.\n\n\n\nK-pop girl band Huntr/x must battle Saja, an irresistible rival boy band of demons in disguise. Source: Supplied / Netflix Leah Hyein Na, executive producer of the Korean program at SBS, says the Korean community in Australia is proud of the film and appreciates its meticulous depiction of Korean elements. She says her children also love the film and sing the songs with friends at school.\n\n\n\n\n\nAssociate professor in Korean studies at Australian National University, Roald Maliangkay, says the Korean studies community — both Korean and non-Korean — is particularly interested in how Korean folk elements have been incorporated in the film.\n\n\n\n\"I was shown an exhibition of Chosun dynasty clothes at the Korea University museum [recently] and the lady giving the tour pointed at a very old sword, noting that it was just like the one used in KPop Demon Hunters,\" he says.\n\n\n\n\n\nThe song Golden was also being played everywhere during Maliangkay's recent visit to South Korea, which he says is a good indication of its popularity with foreign tourists as well.\n\n\n\nWhy is Kpop Demon Hunters so popular?\n\nWorkers at the I HEART KPOP store in Brisbane say they saw an immediate impact on sales following the film's release.\n\n\n\n\n\n\"We had so many parents coming in looking for any of the merch from the movie,\" store worker Aurelia says.\n\n\n\n\n\nThe 24-year-old says the store has always attracted a mixed demographic — across race, age and gender — but they have seen more people coming in who aren't interested in K-pop but love the film.\n\n\n\n\n\nA recent K-pop party hosted by the store in Brisbane, which usually attracts around 800 people, drew around 1,200 attendees.\n\n\n\n\n\n\"The crowd went very crazy for the songs from KPop Demon Hunters,\" Aurelia says.\n\n\n\nAurelia has been a fan of K-pop since 2019 after stumbling upon a video of the boy band BTS on YouTube.\n\n\n\n\n\n\"I was really touched by the way that BTS talk about their fans, the relationship that they had between the fans and the respect that they had for them,\" she says.\n\n\n\n\n\nWhile she was initially sceptical of KPop Demon Hunters, she says she was happily surprised after watching it.\n\n\n\n\n\n\"You could see — as a K-pop fan — it was made by fans ... I thought that was awesome,\" she says.\n\n\n\nAurelia (left) is a K-pop fan and recently attended a dance party in Brisbane that drew 1,200 people. Source: Supplied / Silvana Sanchez Audrey Nuna, who voices Mira in the film, told SBS Korean that she had a feeling the movie would do well.\n\n\n\n\n\n\"When I was recording the songs for this movie, I did tell my mum,\" she says.\n\n\n\n\n\n\"I was like: 'mum, I think this movie's going to do really, really well' because I think so many people have a love — even people who are not Korean — have such a love for Korean music, Korean pop, Korean culture.\n\n\n\n\n\n\"[But] I don't think I ever could have expected it to be at this level.\"\n\n\n\nWith its themes of girl power, coming of age and youth culture, Lee says the film feels \"fresh\", and she also eventually embraced it.\n\n\n\nIt's not a typical supernatural action genre — it's quite fresh and [there's] flair to it, that's why I like it.\n\nLee believes audiences may also be drawn to its themes of self-acceptance, friendship and empowerment.\n\n\n\n\n\nOther shows featuring demon hunters, such as Buffy the Vampire Slayer and Sailor Moon, have also been popular with Western audiences in the past.\n\n\n\n\n\n\"Generation X or even older generations, they are really interested in K-pop and things like that because they grew up with [these shows],\" Lee says.\n\n\n\n\n\n\"These are all women warriors or girl warriors.\"\n\n\n\nMovie sparks interest in Korean culture\n\nMcLeod says her daughter is envious of her two Korean friends at school because they can understand parts of the songs that aren't translated into English.\n\n\n\n\n\n\"Their school teaches Mandarin, and she was like 'I wish they taught Korean instead',\" she says.\n\n\n\n\n\nHer daughter is also now asking to go to Korean restaurants instead of her usual favourite, which is Japanese.\n\n\n\n\"I think it's great that something that's a bit of a counter culture has reached such mainstream popularity,\" McLeod says.\n\n\n\n\n\n\"I hope that it has opened the door for other genres.\n\n\n\n\n\n\"It's wild that my anglo-Australian child is into K-pop, I love that so much.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-23-august-2025/hhiyp0sww",
        "title": "Evening News Bulletin 23 August 2025",
        "publish_date": "Sat, 23 Aug 2025 07:09:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nMultiple UN agencies call for urgent action to help more than half a million people in Gaza trapped in famine\n\nA milestone in Aboriginal land rights remembered 50 years on\n\nAustralia take on Samoa at the Women's Rugby World Cup\n\nMultiple UN agencies have repeated calls for an immediate ceasefire and unhindered humanitarian access, as famine is officially confirmed in Gaza.\n\n\n\n\n\nThe latest report by the UN-backed group responsible for monitoring global hunger crises says 514,000 people are experiencing famine in Gaza - a quarter of the population, with that number expected to rise to 641,000 by the end of September.\n\n\n\n\n\nIt is the first time the Integrated Food Security Phase Classification system has recorded famine outside of Africa.\n\n\n\n\n\nDr Mark Manary is an expert on child malnutrition at Washington University. He says now that so many people are already experiencing famine, regular food is not enough to save them.\n\n\n\n\n\n\"So when somebody is malnourished, how can they recover? Well, the answer is fairly simple. It's being provided therapeutic food. Therapeutic food is food that is completely replete with all the nutrients that are needed in ample quantities. If you had enough food in Gaza today for everyone to eat as much as they wanted, it would be three months before everyone would be recovered. But a week's worth of therapeutic food is life-saving.\"\n\n\n\n\n\nIsrael controls the flow of aid into Gaza and has dismissed the findings as biased.\n\n\n\n\n\n---\n\n\n\n\n\nWorkers in the childcare sector say staffing issues remain unaddressed, after Friday's meeting on childcare safety attended by state and territory ministers.\n\n\n\n\n\nThe ministers have agreed to establish a national register of childcare workers to be trialled and launched in early 2026.\n\n\n\n\n\nThere will also be a CCTV trial that will run at 300 centres across the country from October or November.\n\n\n\n\n\nPreeti Soodan, from the United Workers Union, says there needs to be change to ensure adequate staffing numbers.\n\n\n\n\n\n\"When we talk about the under roof ratio, it is extremely important to have minimum staff, as per that licensing of the childcare centre because it leads to... It is important that it should meet the Australian quality framework. And we are just demanding for the bare minimum, which is essential for the safety and wellbeing of the children.\"\n\n\n\n\n\n---\n\n\n\n\n\nMembers of the Gurindji community in the Northern Territory are marking 50 years since the Gurindji land handback, a historic turning point for Aboriginal land rights in Australia.\n\n\n\n\n\nAfter an almost decade-long struggle, in 1975 then Prime Minister Gough Whitlam poured sand into the hands of Gurindji man Vincent Lingiari - granting his people a lease to a parcel of land on the Wave Hill cattle station.\n\n\n\n\n\nThe moment paved the way for the Aboriginal Land Rights Movement – and the Northern Territory Aboriginal Land Rights Act.\n\n\n\n\n\nFor the first time Indigenous Australians could claim land rights if they could prove traditional ownership.\n\n\n\n\n\nGurindji Elder George Edwards says the community has come together this weekend - for the annual Gurindji Freedom Day Festival - to mark the significance of that moment, and the leadership shown by Vincent Lingiari then and the historic Wave Hill Walk-off a decade earlier.\n\n\n\n\n\n\"He was a great leader. He was the leader of the tribe, all tribe... Mr Lingiari, he was a great man. He was a hero for me. For what he done for us, done for our people.\"\n\n\n\n\n\n---\n\n\n\n\n\nIn Rugby Union, Wallaroos co-captain Emily Chancellor says the team wants to make a strong statement in their opening game against Samoa at the Women's Rugby World Cup.\n\n\n\n\n\nThe game takes place in Manchester later tonight.\n\n\n\n\n\nAustralia's best women's World Cup finish was a third-place showing in New Zealand in 2010.\n\n\n\n\n\nThere are ten Wallaroos players on their World Cup debuts - and forging strong group ties has been a focus of the preparation.\n\n\n\n\n\nTrilleen Pomare competed for Australia at the 2017 and 2021 Rugby World Cups.\n\n\n\n\n\nShe says this time Australia is in it to win it.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/made-by-hand-and-powered-by-the-sun-these-vehicles-are-setting-off-on-a-3000km-journey/vmpd3g4vp",
        "title": "Made by hand and powered by the sun, these vehicles are setting off on a 3,000km journey",
        "publish_date": "Sat, 23 Aug 2025 05:00:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Daniel Blik has travelled to Australia from the Netherlands to take part in a race in which his hi-tech vehicle will likely be overtaken by grey nomads towing caravans.\n\n\n\n\n\nLuckily, it's not the hope of lightning-fast speed that draws competitors from around the world to Australia to take part in the Bridgestone World Solar Challenge.\n\n\n\n\n\nThe manager of Solar Team Twente from the Netherlands told SBS Dutch that the event is more than just a race.\n\n\n\n\n\n\"For us, it's very important to show that there are other modes of transport available and that actual sustainable mobility is an option,\" he said.\n\n\n\n\n\nAlmost 40 sun-powered cars will set off from Darwin on Sunday as part of the challenge.\n\n\n\nInternational teams, many representing universities, have descended on Darwin for the beginning of the Bridgestone World Solar Challenge. Source: Supplied / Timo Hoogewoonink All of the vehicles taking part have been designed, engineered and built by the teams racing them.\n\n\n\n\n\nThe course, which covers just over 3,000 kilometres through the Australian outback, from the Darwin to Adelaide, takes place every two years.\n\n\n\n\n\nThe event aims to promote the development of energy-efficient transport as part of global decarbonisation efforts.\n\n\n\n\n\nIt often attracts teams from international universities and technical institutes as well as private entrepreneurs.\n\n\n\n\n\nVehicles compete within three different 'classes', allowing a variety of technology to be showcased.\n\n\n\nKevin van der Putte is a member of the Innoptus Solar Team from Belgium, which topped the competition's 'challenger' class in both 2023 and 2021.\n\n\n\n\n\nTheir vehicle completed the course travelling at an average speed of 88 km per hour.\n\n\n\n\n\n\"Our solar car is a really aerodynamic car, it's super light, it only weighs around 70 kilograms, purely made out of carbon,\" he said.\n\n\n\n\n\n\"And it also doesn't require fuel, so it only uses the energy of the sun.\"\n\n\n\nJules Teeuwen will be behind the wheel for the Brunel Solar Team from the Netherlands.\n\n\n\n\n\nHe said conditions in the car posed challenges to drivers.\n\n\n\n\n\n\"It's not very comfortable, in fact, in previous editions, we measured temperatures of up to 55 degrees Celsius, and you can also lose up to five kilos of sweat after one drive of the solar car,\" Teeuwen said.\n\n\n\n\n\nThe event continues until 31 August, giving teams just over a week to complete the challenge.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/erin-patterson-plea-hearing-live-updates-mushroom-cook-to-make-plea-for-leniency-after-murder-conviction-20250822-p5mp2x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Silent exit: Erin Patterson walks past media as her victim’s statements echo",
        "publish_date": "Mon, 25 Aug 2025 12:06:17 +1000",
        "category": "lifestyle",
        "authors": [
            "Erin Pearson"
        ],
        "text": "Tim Patterson, Don’s nephew, spoke of the profound grief and lingering questions that have haunted him since the deaths of his loved ones. He described the agony of watching them fight for their lives in the hospital, a pain he had never experienced before.\n\nPatterson recounted a diary entry where he questioned why “God decide[d] to end such amazing lives in such a horrific manner.” He reflected on how his previous encounters with death had been softened by the knowledge that the person had lived a whole life. However, holding vigil over Gail as she passed away, he felt a new pain — a deep, senseless, and unjust loss of stolen years.\n\nTim Patterson spoke of his uncle, Don, as “a beautiful, honorable, caring man” who exuded “love and joy in everything he did.” He said he looked up to his uncle’s perpetually young heart and his genuine care for others.\n\nThe lack of explanation weighs heavily, he told the court. He finds it difficult to comprehend a world without Don and Gail. “Why did Erin decide that she’d make her life’s work a portrait of death and destruction?” he asked. “I guess that’s the final injustice in all of this, the lack of explanation, reason, or remorse.”\n\nDespite the passage of time, he said he still cries when he thinks about how they were lost.\n\n“It’s a strange thing, but for some reason, I still can’t fully accept they’re gone. In my mind, it’s just that we haven’t seen each other in a while.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/man-dies-after-allegedly-robbing-shop-20250825-p5mpli.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Man dies after allegedly robbing shop",
        "publish_date": "Mon, 25 Aug 2025 12:03:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Man dies after allegedly robbing shop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/bentley-team-to-close-two-hatted-french-restaurant-monopole-20250825-p5mpk8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bentley team to close two-hatted French restaurant Monopole",
        "publish_date": "Mon, 25 Aug 2025 12:00:06 +1000",
        "category": "finance",
        "authors": [
            "Scott Bolles"
        ],
        "text": "Advertisement\n\nExclusive Eating outRestaurant news Bentley team to close two-hatted French restaurant Monopole From wine bar to upmarket bistro, this elegant French spot bids a final farewell after 13 years of dining. But its operators are already embarking on another project, with a new venue set to open in spring. Scott Bolles August 25, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOne of Sydney’s most prized restaurants, the two chefs’ hatted Monopole, is set to close its doors on Saturday, September 6. A particularly tough winter trade has been gruelling for many Sydney restaurants, but co-owner Brent Savage, whose Bentley Restaurant Group includes Monopole in its stable, blamed the closure on the end of a lease at the restaurant, which overlooks Australia Square. Monopole’s French makeover, with linen tablecloths and flickering candles. Dion Georgopoulos Savage said the CBD restaurant trade in 2025 felt more optimistic than last year, but confirmed rumours – swirling for months – that the Monopole site had been sounding out new operators. He is unsure of its future direction, however. “We looked at all our options,” Savage said.\n\nAdvertisement\n\nAfter eight years in its original location, Monopole moved from Potts Point in late 2020, later shifting from a wine bar focus to a French-leaning venue last year. “We got a good review, I feel quite proud of what we’ve achieved,” Savage said. But the closure isn’t the only news for the group, which is one of the most expansive and successful restaurant operations in Sydney. It will double down on its CBD restaurant openings King Clarence and Eleven Barrack with another new venue – Watermans – to open at Barangaroo in spring. From left: Nick Hildebrandt, Darryl Martin and Brent Savage will open Watermans in Barangaroo. Darryl Martin, the former owner-chef at Barzaari in Marrickville, will lead the Watermans kitchen. “We’re massive fans of Darryl from his Barzaari days,” Savage said. Pointing to Martin’s labne with salted cucumber as a dish that will make its way onto the Watermans opening menu, Savage said other dishes they’ve been working on include warm hummus with green zhoug; pickled watermelon and raw tuna salad with sumac; whole roasted John Dory with chermoula; and pomegranate-glazed slow-cooked lamb shoulder with pickled radishes and black lime.\n\nAdvertisement\n\nSavage stressed the restaurant start-up won’t be a carbon copy of Barzaari. “It’ll be Darryl’s repertoire with a little of our finesse,” Savage said. The 120-seat restaurant will slide into the recently completed One Sydney Harbour development at Barangaroo, a precinct where the Bentley crew has plenty of experience, having operated the now-closed Cirrus Dining nearby until 2024. Monopole’s duck breast, with crisp skin and rosy meat, and an orange-scented glaze. Dion Georgopoulos The expansive restaurant group isn’t ruling out a return for Monopole. “If it’s the right site, never say never,” Savage said. He and business partner Nick Hildebrandt said in a joint statement that the team were proud of their achievements at Monopole, both in the original Potts Point location and CBD.\n\nAdvertisement\n\n“An enormous amount of talent has graced both the kitchen and the floor,” the statement said. “Monopole was a ground-breaking wine bar when we opened it and has always pushed the envelope, holding two hats for 10 years and winning multiple awards for its wine list.” Related Article Good Food hat Good Food hat 16.5 / 20 Review This two-hatted wine bar has had a French makeover – but does it have that je ne sais quoi?\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/the-fed-chief-s-wise-words-are-wasted-on-trump-20250825-p5mpiz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Fed chief’s wise words are wasted on Trump",
        "publish_date": "Mon, 25 Aug 2025 11:59:01 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Then he went onto say that with policy in restrictive territory the outlook and shifting balance of risks might warrant adjusting the policy stance – i.e. a rate cut. The awkward position the Fed finds itself in is that on both sides of its mandate there are novel Donald Trump-inspired uncertainties. Ansell says price rises will offset Donald Trump’s tariffs on its products. Credit: AP The inflation rate, already materially above the Fed’s 2 per cent target rate, is picking up gradually as Trump’s tariffs start to impact. Because the bulk of the globally applicable baseline tariffs only just started to come into effect this month, and US businesses had built significant pre-tariff inventories earlier in the year, they will show up progressively in the inflation rate through the rest of this year and into next year.\n\n“The effects of tariffs on consumer prices are now clearly visible,” Powell said. “We expect those effects to accumulate over coming months, with high uncertainty about timing and amounts. The question that matters for monetary policy is whether those price increases are likely to materially raise the risk of an ongoing inflation problem. Loading “A reasonable base case is that the effects will be relatively short-lived – a one-time shift in the price level,” he said. “It is also possible, however, that the upward pressure on prices from tariffs could spur a more lasting inflation dynamic, and that is a risk to be assessed and managed,” he said, noting that a decline in real incomes from higher prices could see workers demanding higher wages or that the price rises could lead to a lift in inflation expectations that dragged actual inflation up.\n\nIf the impact of the tariffs on inflation is uncertain, so is the impact of Trump’s immigration policies on the unemployment rate. Last month’s contentious jobs report – the one that got the Bureau of Labor Statistics sacked by Trump – showed US employment growth is stalling, even though the unemployment rate remains at an historically low level of 4.2 per cent. Markets heard what they wanted to hear. Credit: AP Complicating assessment of the labour market, however, is that even as the growth in jobs has flat-lined, the supply of labour has also softened – the pool of job-seekers has been shrunk because of Trump’s harsh immigration policies. “Overall, while the labour market appears to be in balance, it is a curious kind of balance that results in a slowing in both the supply and demand for workers., This unusual situation suggests that downside risks to employment are rising and, if those risks materialise, they can do so quickly in the form of sharply higher layoffs and rising unemployment,” Powell said.\n\nSo, both sides of the Fed’s mandate are under pressure but the data that the data-dependent Fed relies on is, at this point, inconclusive. It remains very possible that both the inflation and unemployment rates could rise together. Trump, having spent years attacking Powell, is ramping up his campaign to “MAGA-fy” th Fed. The US economy is growing at about half the rate it did last year. Stagnation – low growth with relatively high inflation – remains a realistic possibility. That would confront the Fed with a very difficult choice of which side of its mandate to prioritise.\n\nPowell said it would not allow a one-time increase in prices to become an ongoing inflation problem, but when the risks to its dual mandate are evenly balanced, what does it do? History would suggest it would prioritise the fight against inflation. The Fed’s predicament is worsened by Trump’s continuing assaults on its independence. If it is to retain the credibility that is essential to bond investors’ trust that it will act in accordance with its view of the economy’s best long term interests, rather than short term political pressures, it can’t be seen to be succumbing to Trump’s campaign for radically lower interest rates – he wants them 3 percentage points lower – in order to lower the interest costs on America’s exploding government debt levels and boost growth. That could, while it retains its independence, make it more cautious than it might otherwise be, relying on data that reflects the recent economic past to justify a rate cut or hike.\n\nTrump, having spent years attacking Powell, is ramping up his campaign to “MAGA-fy” th Fed. He’s explored the possibility of sacking Powell, but doesn’t have that power. He tried to make a case that a blow-out in the cost of the Fed’s Washington headquarters provided a “cause” to fire Powell, but that effort fizzled. He has nominated Stephen Miran, the chairman of his council of economic advisers and a man who has said the president should be able to hire and fire Fed governors, to fill a vacant seat on the central bank’s board. Now, even as Powell delivered his address at Jackson Hole, Trump called for the resignation of a sitting Fed governor, Lisa Cook, and threatened to fire her after the Federal Housing Finance Agency director, Bill Pulte, alleged she had committed mortgage fraud.\n\nCook, whose term doesn’t expire until 2038, has said she won’t be “bullied” into resigning “because of some questions raised in a tweet.” It is unclear, even if the allegation were proven, whether it would be serious enough to provide “cause” for her removal or whether Trump has the authority to fire a board member of a quasi private institution. Nevertheless, the attack on Cook (using mortgage fraud allegations that Pulte has also deployed against other Trump adversaries like Democrat Adam Schiff and New York Attorney-General Letitia James) is, with the nomination of Miran, a clear signal that Trump isn’t going to abandon his efforts to gain influence over the Fed and its decision-making. If Miran is confirmed by Congress, there will be three Trump-appointed people on the Fed’s seven-member board of governors. If he could force Cook out, there’d be a majority of Trump appointees. The board doesn’t make interest rate decisions – those are made by the 12 members of the Open Market Committee, which includes the seven board members, the president of the New York Fed and four of the other 11 regional Fed presidents – but a strong Trump representation within those meetings could be intimidating, particularly as it is the Fed’s board that has the power to approve, or disapprove, the appointment of regional Fed presidents.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-bigger-climate-push-backed-in-far-right-israeli-mp-responds-to-shameful-visa-cancellation-20250825-p5mpgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to accelerate 5 per cent deposit scheme for first home buyers; Lambie criticises ‘rude’ Trump administration",
        "publish_date": "Mon, 25 Aug 2025 11:56:33 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "The Housing Australia website is buckling under increased traffic after the government announced this morning it would accelerate its plan to expand its 5 per cent deposit scheme.\n\nThe first home buyers deposit scheme, which involves the government effectively backing first home buyers to avoid them paying lenders mortgage insurance, was due to start in January next year, but will now begin in October.\n\nClare O’Neil. Credit: Alex Ellinghausen\n\nHousing Minister Clare O’Neil shared on X some people had not been able to access the Housing Australia website, while others were waiting minutes for it to load.\n\n“It’s fantastic that Australians are so interested in getting a home of their own under Labor’s 5 per cent Deposit Program,” O’Neil said.\n\n“Please hold on while they resolve the issue ASAP.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/door-ajar-on-curnow-move-dons-hunt-a-lion-the-trade-state-of-play-at-each-non-finals-team-20250821-p5mood.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Door ajar on Curnow move, Dons hunt a Lion: The trade state of play at each non-finals team",
        "publish_date": "Mon, 25 Aug 2025 11:55:08 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Melbourne Coach Simon Goodwin is already out, and there could be other high-profile exits to come. Christian Petracca and Clayton Oliver – who are both on contracts worth more than a million dollars a year – were both keen for a fresh start last year. The Demons refused to consider trading them in 2024, so it will be interesting to see if Petracca and Oliver try to move again – and if list boss Tim Lamb softens his stance with a new coach on the way. There is nothing to the Petracca-Hawthorn whispers at this stage. Young defender Judd McVee is looking around, and has interest from the two WA clubs, while Adelaide also raised his name internally, as he weighs up whether to stay in red and blue. The other player whose name came up in trade speculation is forward Bayley Fritsch. They are among the clubs to have shown interest in Marcus Windhager, but his preference is to remain at St Kilda if they improve their financial offer. Giant Wade Derksen is on Melbourne’s radar, potentially as a delisted free agent. Could Christian Petracca follow Simon Goodwin in leaving Melbourne? Credit: AFL Photos North Melbourne The Kangaroos want to add some defensive steel to their mostly young midfield brigade, and have identified Saint Marcus Windhager as the man who could do that. They have presented a five-year contract offer with serious financial terms to Windhager’s management, and have as good a chance as any suitor if he chooses to depart. That said, Windhager’s preference is to continue playing with his close friend Nasiah Wanganeen-Milera at St Kilda. No.4 draft pick Zane Duursma has had an inauspicious first two seasons in the AFL, averaging only seven disposals and kicking 13 goals in 23 matches. North have no intention to move him on, regardless of how frustrated he might be. Will Phillips and Bailey Scott are worth monitoring as two players who spent most of the season out of the senior side.\n\nLoading Port Adelaide Like crosstown rivals Adelaide, the Power missed out on Nasiah Wanganeen-Milera’s signature. They have a decision to make on ex-Hawk Ryan Burton, who has struggled with injuries and is no longer a first-choice defender at Alberton. Burton is highly unlikely to be involved in a trade: his fate will likely be re-signing with Port, or signing elsewhere as a delisted free agent (assuming he lands at a third club). Giant Jacob Wehr is one player they are monitoring. The biggest priority is retaining midfield star Zak Butters, who is a restricted free agent next year. The Power have presented him with a new-age deal, where he can re-sign for two years – taking him to unrestricted free agency – then have the option to tack on six more. A conga line of Victorian clubs are interested in bringing Butters back to his home state, but don’t expect a resolution in the next two months. Richmond There won’t be a repeat of last year’s big-name departures (Shai Bolton, Daniel Rioli, Liam Baker and co.), with the Tigers instead set to work on the margins as their rebuild continues. They are among the clubs chasing out-of-favour Suns goalsneak Malcolm Rosas, while they have told veteran winger Kamdyn McIntosh he won’t be offered a contract for 2026. Jacob Koschitzke is unlikely to score a new contract at Richmond, but is among the defensive depth options the Giants are sifting through. Jacob Blight fell just short of his contract trigger, and might attract interest elsewhere. Perhaps, the most fascinating situation to monitor is whether Richmond keep the North Melbourne pick they secured during last year’s draft. Free agency compensation, academy and father-son selections, as well as a potential, albeit unlikely, West Coast priority pick, could push it deep into the top 10 in a weaker draft than recent years.\n\nSt Kilda The Saints are preparing for a club-defining off-season after making Nasiah Wanganeen-Milera the league’s first $2 million man. They upped their seven-year offer for Carlton ruckman Tom De Koning to about $1.8 million-a-year, as this masthead reported on Wednesday, while they are in the box seat for GWS defender Leek Aleer, who is seeking greater opportunity. St Kilda have also positioned themselves as favourites for contracted West Coast forward Liam Ryan if he departs. The Saints will take advantage of salary cap rules to pay above the limit to accommodate the incoming talent, but there may be some losses. North Melbourne have offered Marcus Windhager a five-year deal, while Melbourne and Essendon have also expressed interest. Contracted ruckman Rowan Marshall has a call to make with De Koning’s impending arrival, and Geelong are a possible destination. Captain Jack Steele will probably remain at Moorabbin, barring a late twist. Marcus Windhager’s future at St Kilda remains uncertain after the Saints retained Nasiah Wanganeen-Milera (left) as they prepare to bring in Leek Aleer and Tom De Koning (both right) Credit: Matt Davidson Sydney The Swans plan to be aggressive in the player movement period after a rare September off, with dual Coleman medallist Charlie Curnow linked to them. However, coach Dean Cox said this week they had not spoken to the star Blue. Curnow, who raised the possibility mid-season of a move to Gold Coast, is contracted at Carlton until the end of 2029, so a lot would have to happen for him to follow Tony Lockett, Barry Hall and Lance Franklin as a marquee forward recruit for Sydney. The Swans inquired about troubled Western Bulldog Jamarra Ugle-Hagan, but have reportedly cooled on the idea of bringing him in. The Ugle-Hagan situation remains delicate. They still have work to do to retain Jake Lloyd and back-up ruckman Peter Ladhams, and have decisions to make on veterans Dane Rampe, Robbie Fox and Joel Hamling. Cox also made clear that Ollie Florent – who spent significant time in the VFL this year – was under contract and a required player. Sydney have liked Sun Malcolm Rosas for years, and this could be the time they finally secure him.\n\nLoading West Coast The Eagles are primed for a big off-season after a second wooden spoon finish in three seasons, and four straight years in the bottom three. They will lose restricted free agent Oscar Allen to Brisbane, but would gain the No.2 draft pick as compensation, while Liam Ryan (contracted until 2026) is weighing up a move to Victoria, with St Kilda the likeliest destination. Speculation continues about Harley Reid, but any decision on his future is not expected to occur this year. Uncontracted speedster Jack Petruccelle is another to watch. West Coast would love to bring Brisbane premiership defender Brandon Starcevich home, and are in a tug-of-war with Adelaide for another Lion, Callum Ah Chee. They also expressed interest in Docker Neil Erasmus, veteran Cat Mitch Duncan and Giant Wade Derksen. The Eagles have long held interest in Deven Robertson, who could aid their midfield depth. Western Bulldogs Coach Luke Beveridge previously hinted at his disenchantment with his key defensive stocks, but was blatant about it after the Dogs’ round 24 defeat to Fremantle. He even mentioned they will see what is available in the “market”, so watch this space, given they already met with Jack Silvagni. That followed Beveridge subbing out Jedd Busslinger in the third quarter to go smaller despite acknowledging they were struggling with the Dockers’ talls. Veteran Liam Jones played just once after round six, while mid-sized backman Buku Khamis is exploring his options after not playing in the Bulldogs’ past eight matches. There is also fascination about midfielder Adam Treloar, whose physical issues mean the Dogs are yet to a new contract for him. Along with Silvagni, they have registered their interest in young Docker Neil Erasmus, while Gold Coast’s Alex Davies is someone they inquired about in the past.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/former-brisbane-lions-ceo-sells-beloved-balmoral-property-20250825-p5mpiy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Brisbane Lions CEO sells beloved Balmoral property",
        "publish_date": "Mon, 25 Aug 2025 11:54:59 +1000",
        "category": "sports",
        "authors": [
            "Sarah Webb"
        ],
        "text": "Former Brisbane Lions CEO Greg Swann has notched one last win after a decade with the club, selling his Balmoral home for $3.275 million in a bidding blitz that drew six punters.\n\nSwann, who returned to Melbourne last month to take up his new post as the AFL’s head of football performance, paid $1.813 million for the Wright Street property 10 years ago, which became both his beloved family home and a popular hangout for players during his Lions tenure.\n\nSet on a 607-square-metre block with a saltwater pool, the home features five bedrooms, three bathrooms and multiple living zones. Swann was said to have loved its entertaining spaces but admitted his favourite spot was the living room, where he would settle in to watch sport on TV.\n\nAt the Saturday in-room auction – held at The Calile Hotel – bidding opened at $2.7 million, kickstarting a flurry of $100,000 rises until the $3.2 million mark. A final $50,000 and then $25,000 bid followed before the hammer fell and a young family walked away with the keys.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/bulldogs-big-ugle-hagan-question-this-off-season-20250825-p5mplb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bulldogs' big Ugle-Hagan question this off-season",
        "publish_date": "Mon, 25 Aug 2025 11:52:52 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bulldogs' big Ugle-Hagan question this off-season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/after-164-starts-tommy-fleetwood-wins-a-golf-tournament-and-collects-15-million-20250825-p5mpii.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "After 164 starts Tommy Fleetwood wins a golf tournament … and collects $15 million",
        "publish_date": "Mon, 25 Aug 2025 11:52:16 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "After the plaudits from LeBron James and Tiger Woods and Everton FC - and almost everybody else on the internet - a journalist asked Tommy Fleetwood why people seem to like him so much. He probably did not mean his response as literally as it sounded.\n\nThe Englishman started by saying he had always been lucky to make great connections with others, then stopped and thought about it, before offering a piece of advice his father gave him and he now gives his own kids.\n\n“Even when I was an aspiring young amateur golfer, professional golfer, he always said: person first, golfer second,” he said. “You’re a good person first, whatever happens after that, you try and be a good golfer second.”\n\nFleetwood has been a “good golfer second” on the PGA Tour for a long time. Six times, from 164 attempts. Forty-four top-10 finishes and 30 top-five places. Until Sunday, the 34-year-old from Merseyside was one of only three players since 1983 to finish second six times without a victory, alongside Colin Montgomerie and Briny Baird.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/mum-and-dad-help-son-buy-1-195-000-coogee-one-bedder-20250825-p5mpig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mum and dad help son buy $1,195,000 Coogee one-bedder",
        "publish_date": "Mon, 25 Aug 2025 11:50:58 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward",
            "Elizabeth Redman"
        ],
        "text": "A one-bedroom art deco Coogee apartment sold for $1,195,000 at auction on Saturday to parents helping to buy the home for their son.\n\nSix bidders registered for the auction of 2/125 Mount Street, and four of them made offers.\n\nBidding began at $1,025,000, above the price guide of $950,000 to $980,000. As the reserve was $1.05 million, the home was on the market by the second bid.\n\nThere is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/m1-closed-north-of-sydney-after-crash-20250825-p5mpl8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "M1 closed north of Sydney after crash",
        "publish_date": "Mon, 25 Aug 2025 11:48:37 +1000",
        "category": "finance",
        "authors": [],
        "text": "M1 closed north of Sydney after crash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/workplace/how-bosses-are-catching-out-work-from-home-fakers-20241129-p5kuqc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How bosses are catching out work-from-home fakers",
        "publish_date": "Mon, 25 Aug 2025 11:46:49 +1000",
        "category": "finance",
        "authors": [
            "Dan Cave"
        ],
        "text": "This practice rocketed during the pandemic, and in 2022 60 per cent of employees said they thought they were being monitored at work, according to a survey by the TUC union. The proportion of employers tracking workers is expected to rise to 70 per cent by 2025, the management consultancy Gartner found. Bosses have used surveillance software to check on staff with keystroke logging, screen monitoring, time tracking and chat monitoring. These programs, some of which take screenshots of workers’ computers, can crack the tactics used by employees, such as running hours-long Powerpoint presentations. Some software offers the ability to log into an employee’s device remotely. Credit: Michele Mossop Some businesses use software that can take photos of employees via their laptop every few minutes and use their webcam to monitor them. Others offer “productivity scores” on workers, depending on their activity levels. Those mouse jigglers can also be outwitted by software because the cursor activity doesn’t look normal. Algorithms can also see when a mouse is active over the same web page for hours at a time. Teramind, a software firm that can identify repetitive cursor movements, found that out of one million employees sampled, 7 per cent appeared to be faking activity at work. This year, one American bank fired more than a dozen of its workers for pretending to work.\n\nSome software also offers the ability to log into an employee’s device remotely or track an employee’s tone and mood, and judge how useful their conversations are. One such program, Aware, can sync with popular workplace chat tools, such as Slack, to check the conversations of specific employees. It also claims to use artificial intelligence to track employee sentiment and monitor for certain behaviours. Loading Starbucks, AstraZeneca and Nestle all use software to monitor chats, which can also identify bullying, harassment and apparent discrimination. Elsewhere, one major consultancy company checks the IP address of remote workers to check they are not “working from the beach”. Employers that want staff back in the office are also using programs to monitor attendance. PwC, which has asked employees to go back three days a week, said it will track where its staff work to enforce the rules. Outfoxing bosses\n\nSome staff are already taking matters into their own hands – and their tactics are getting more hi-tech. A finance sector worker told The Telegraph that they, having some systems literacy, were able to bypass surveillance software by finding out which processes it tracked and looking for holes. “If the software only surveils processes called “chrome.exe”, “opera.exe”, “firefox.exe” you make a copy, rename it “excel.exe” or something and you’re good to go,” they said. Others have been able to bypass the top-end software, which might surveil keywords and take screenshots, by creating a virtual machine on the work computer which is untrackable. Labour’s promise to strengthen employment rights could affect this kind of surveillance software, by ensuring that bosses negotiate with staff and unions over its usage. Already, a patchwork of legislation, from GDPR to Employment Rights Act provisions, place limits on what bosses can do when it comes to digital surveillance. Does this software actually work? Amit Raj, founder of the Links Guys, who runs a fully remote company and uses tracking software, says even the most intricate tracking software wouldn’t be able to account for some remote staff’s get-out-of-work ploys.\n\n“There will always be some people who don’t work. While I’m not worried about employees watching YouTube for a few minutes, you can’t really track someone if they’re watching something on a second device and not working.” This hasn’t stopped Raj from looking into how to ensure staff stay on track. The software he uses to surveil staff, apart from senior hires, includes activity tracking, screenshots, time tracking, and the ability to check breaks. He describes how this software’s screenshot application has caught someone who just kept a work program open all day without doing much. But this requires an investigation with HR to confirm if that worker was actually doing anything, and he questions how useful some of the tracking software is. “It can’t tell you if they’re actually on a computer,” he says. Raj also uses surveillance software at the interview stage, to catch out jobseekers using so-called “virtual candidates” or ChatGPT to complete tasks. Of course, there are limits. Experts in HR worry surveillance might end up with unproductive consequences, impacting innovation, and sparking burnout and affecting wellbeing too. Others have questioned if they can truly track how work, well, works. Do they take into account paper notes, meetings, having to use the toilet?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/socialite-learns-fate-after-ramming-cars-after-boozy-lunch-20250811-p5mm3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Socialite learns fate after ramming cars after boozy lunch",
        "publish_date": "Mon, 25 Aug 2025 11:42:34 +1000",
        "category": "finance",
        "authors": [
            "Perry Duffin"
        ],
        "text": "A Sydney socialite, who smashed into multiple parked cars before horrified diners tried to pull her from her Range Rover in front of the Herald’s cameras, has been disqualified from driving and fined after losing a bid to have her case thrown out on mental health grounds.\n\nVanessa Jacobs Fennell was allegedly “doing laps” around Bellevue Hill with shredded tyres when she smashed into a parked Tesla and grazed other cars in late March.\n\nVanessa Jacobs Fennell, 54, refused a breath test and assaulted an officer after crashing her Range Rover into parked cars in Bellevue Hill earlier this year. Credit: Edwina Pickles\n\nThe Herald came across the wreck as Jacobs Fennell was being pulled from behind the wheel of the badly damaged black SUV by shocked members of the public.\n\nShe had been drinking at a lunch in the wealthy enclave of Double Bay with friends hours earlier.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/young-family-pays-5-59m-for-historic-south-melbourne-terrace-20250825-p5mpih.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Young family pays $5.59m for historic South Melbourne terrace",
        "publish_date": "Mon, 25 Aug 2025 11:39:47 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "“The sellers have owned the home for 48 years, so it was a rare opportunity to secure the best address in town,” said Lanyon. Records show the home last traded in 1977 for $81,000. The property was one of 943 scheduled to go to auction in Melbourne over the week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 75.1 per cent from 719 reported results, while 53 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. Elsewhere, a first-home buyer beat out five others for the keys to a Keilor Downs townhouse, securing it at auction for $691,000 on Saturday.\n\nWith a price range of $570,000-$600,000, 8A Karu Court sold for $91,000 over its reserve of $600,000. “The bidding was so fast I didn’t even get time to announce it was on the market until it hit about $650,000, where there was a pause,” said selling agent Andrew Koulaouzos from Barry Plant Taylors Lakes. Six registered bidders took part in the auction, all were young first-home buyers. The auction opened at $570,000, quickly rising to $650,000, then slowed down, with two active bidders remaining.\n\nThe new owners celebrated with their whole family, who were in attendance, said Koulaouzos. Loading “They were rapt, it was like they had just got married,” he said. The three-bedroom home had over 57 parties inspect it over the campaign; the interest had a lot to do with the staging. “They put a fresh coat of paint on the inside walls, spruced up the garden, and staged the interior with new furniture and curtains,” Koulaouzos said.\n\n“A lot of people don’t value staging, but it can definitely give the property more appeal.” In Parkdale, a renovated weatherboard home sold under the hammer for $1,735,000. The four-bedroom home at 44 Keith Street had a price guide of $1.55 million to $1.65 million and a reserve at the top of the range. Two active bidders took part in the rapid-fire auction, said selling agent Aidan Oke from Ray White, The Bayside Group.\n\n“We had a couple trying to upsize out of Bentleigh, who were the underbidder, and a local young family that purchased it,” Oke said. Loading The location of the four-bedroom, single-level home in a coveted Bayside enclave was a major drawcard. In an interesting sign of the market, Oke said that another agent sold a house on the next street for $1.65 million recently, which is “really comparable.” “I’m a Parkdale local, so I really take notice of the market, and that’s a sign of a five per cent shift in the family home market in the space of a couple of weeks,” he said.\n\n“I think more people have more access to cash with the recent rate cuts, and given it’s not even spring yet, it’s a promising sign for the local market.” LJ Hooker’s head of research, Mathew Tiller, said Melbourne’s auction clearance rate reflects a strength in buyer numbers, both attending open homes and bidding at auctions. “There has definitely been an uptick from buyers, we saw it after the first rate cut and definitely now again after the second, not just in auctions but in sales more generally,” he said. Tiller also noted that there is still a “really low” level of listings in the Melbourne market.\n\n“This is driving buyer demand, especially for quality listings with a good location and good price point,” he said. Loading In Camberwell, a five-bedroom Californian bungalow with its own putting green passed in at auction but sold later that day for $3.85 million after private negotiations. The home at 12 Radnor Street had a price guide of $3.6 million to $3.96 million. While Belle Property Director Steve Burke declined to disclose the reserve, he said that it “was sold well in the range.” The auction drew a crowd of 60, with three active bidders participating.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/i-only-feel-half-alive-mushroom-lunch-survivor-reveals-heartbreak-of-life-without-his-wife-20250825-p5mpkc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I only feel half alive’: Mushroom lunch survivor reveals heartbreak of life without his wife",
        "publish_date": "Mon, 25 Aug 2025 11:33:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "I think that the way our children [conducted] themselves through the crisis of our illness and the subsequent legal proceedings is testament to her mothering skills. Our children were thrown into an unprecedented situation in which they suddenly had to take medical responsibility for the lives of their parents: the trauma that they experienced at their mother’s death and at my near-death has left deep wounds. I’m deeply grieved by their ongoing pain. Heather was a proud grandma who loved each of our six grandchildren. Heather took an active interest in their lives and created activities that would bring them together. Family events are no longer the same. A very important member of our family is missing. Heather was also a fellow traveller with me in the way of Jesus, along with many other people. She took her faith very seriously. It shaped her life and the way that she lived. Heather was full of love, joy, peace, patience, kindness, gentleness, faithfulness and self-control. All the fruits of the spirit of Jesus living in her, we encouraged each other and urged each other on to love God and love our neighbours as ourselves. Convicted triple-murderer Erin Patterson arriving at the Supreme Court of Victoria in Melbourne on Monday. Credit: Jason Edwards She had a particular compassion for strugglers and disadvantaged people, and that was reflected in the teaching, mentoring work she chose to do when she re-entered the workforce after our children had reached secondary age.\n\nI could go on; there’s so much more that deserves to be said about Heather. It’s one of the distressing shortcomings of our society that so much attention is showered on those who do evil and so little on those who do good. The greatest impact of Erin’s actions on me has been to deprive me of Heather’s company and Heather’s important place in our family – the silence in our home is a daily reminder. I continue to carry a heavy burden of grief over her untimely death. It’s a truly horrible thought to live with, that somebody could decide to take her life. I only feel half alive without her. My consolation is that we will be reunited in the resurrection and the age to come. In a similar vein, the second-heaviest impact on me has been the loss of Don and Gail. They were the next two closest people to me, after Heather and our family, and again, they were good and solid people. No doubt their families will say more about them, but I would like to acknowledge their good character and their constructive influence on my life. Our families grew up together. They were all so serious about following Jesus, and we encouraged and supported each other for about 50 years. My life is greatly impoverished without them. I have suffered severe personal impacts from Erin’s actions.\n\nI very, very nearly died. It has taken me the best part of two years for my health and strength to recover to the point that I have. I praise God for my miraculous healing, and I thank the many medical professionals who strived to save all four of us. They threw everything into our care. I joke that I know this because I have a bump on the back of my head from the kitchen sink. It’s a grief to them that Heather, Gail and Don died. Although I’ve made a good recovery, my health has never returned to the levels I had before the fateful lunch. I have reduced kidney function, ongoing respiratory issues and reduced energy, and I’ve had to face the many challenges of re-establishing life without Heather. The challenge has vastly changed … I’m suddenly single. The heartbreak of having to wind up her affairs. Returning to pastoral work without her help and sage advice. Unsettled sleep. Nobody to share in life’s daily tasks, which has taken much of the joy out of pottering around the house and the garden. Nobody to debrief with at the end of the day. The impacts are so many and varied, some big and a myriad of small things, that no list could ever contain them. Loading I’m distressed that Erin has acted with callous and calculated disregard for my life and the lives of those I love. What foolishness possesses a person to think that murder could be the solution to their problems, especially the murder of people who had only good intentions towards her? Erin has brought deep sorrow and grief into my life and the lives of many others, the ripples spread out through family, friends, our church, congregation, the local community and beyond.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/he-clowns-around-on-tv-but-basketball-s-bradman-was-once-known-for-showing-a-different-emotion-20250815-p5mn95.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "He clowns around on TV. But basketball’s Bradman was once known for showing a different emotion",
        "publish_date": "Mon, 25 Aug 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "He was a seven-time NBL most valuable player (the trophy is named in his honour), and 14-time scoring champion, winning championships in 1993 and 1997. He was a first-team All-NBL player for a record 15 straight seasons, and averaged a phenomenal 30.8 points per game through a stunning career. Gaze led the Boomers to five Olympics, and was the flag bearer and overall team captain at the 2000 Sydney Games. The award for the best Australian international player of the year is the Gaze Medal. In 2013, he joined his father Lindsay, the godfather of Australian basketball, in the FIBA Hall of Fame. All this from a boy who literally grew up at the old Albert Park Basketball Stadium, where Lindsay was the general manager and the family lived in the attached residence. Gaze fell just short of an Olympic medal. The Boomers finished fourth three times (1988, ’96 and 2000) during his time. The bronze medal loss to Lithuania at the Atlanta Games in ’96, when star centre Arvydas Sabonis nailed two big three pointers, still hurts. Had the Australians had Luc Longley available through the tournament – the towering centre had been asked by the Chicago Bulls to have ankle surgery – a maiden men’s basketball medal may have been within reach.\n\n“Those moments are of what-ifs, or if only had he [Sabonis] missed a couple of those, it might have been a different outcome,” Gaze said. Those were the days: Melbourne Tigers’ greats Mark Bradtke, Andrew Gaze and Lanard Copeland. Credit: Fairfax Photographic The teary emotions Gaze had on national television when that drought was finally broken at the 2021 Olympics in Tokyo highlighted how much the Boomers still mean to him, a legacy of growing up around the team when his father was coach. “The thing that sticks out the most for me, I cast back to when I was a youngster, and the Australian team, the values around the team, and playing for Australia, and competing at the Olympic Games, and the spirit of the games, they were instilled in me because of my dad and, because of that, all my dreams as a youngster were Australian team and Olympic centric,” Gaze said. “Unlike today, where you can just jump on your phone, or watch it on television, access to college basketball, NBA, European basketball was basically non-existent.”\n\nGaze remains arguably the greatest shooter this country has produced, his classical technique making him and Brazilian great Oscar Schmidt as feared as any US star when it came to the Olympics, where Schmidt and Gaze still sit one and two for most career points, and the world championships. Loading In the late 1980s, The Age ran weekly sketches of instructional training and technique advice from Gaze, who remembers these fondly. It was an idea ahead of its time, this type of information now the domain of social media and the innumerable so-called basketball experts the sport breeds. Gaze’s one season with US college Seton Hall University in 1988-89, when the Pirates had a Cinderella run to the NCAA final, losing in overtime to the Michigan Wolverines, with Gaze starting in all games, sparked live coverage of the games in Australia, and extensive media exposure. He narrowly missed an NBA contract with the Seattle Supersonics. He was a pioneer in playing professionally in Europe, and his time in the NBA initially came with a stint with the then Washington Bullets in 1994. There was another with the 1998-99 San Antonio Spurs, but he did not suit up as a member of the actual playing squad through the play-offs en route to their title. Still, he received a championship ring. His perimeter shooting, and ability to space the floor, would have been ideal in the modern game.\n\n“I had my opportunities, I got a taste of it, but there were some ... decisions that I made during that period of time, if I had thrown myself out there a bit more, perhaps been a bit more aggressive at exploring opportunities, things might have been different, but not different enough that I have any regrets,” Gaze said. Gaze coached in the NBL with the Sydney Kings from 2016-19, and revealed a desire to still coach at the top level in Australia, or abroad, potentially in Asia, where opportunities beckon. Cricketing great urges caution over privatisation bid Australian cricket great Belinda Clark has urged the sport’s authorities to retain a country-over-club mantra when it comes to debating privatisation of women’s Twenty20 cricket.\n\nA report by the Boston Consulting Group has listed alternative forms of investment and ownership, including privatisation, of the men’s and women’s Big Bash Leagues for Cricket Australia to consider in a bid to help strengthen the standing of the two competitions, and attract the extra funds needed to lure the world’s best players, particularly in the men’s league. CA, state associations and other key figures are debating the report, but Clark – a former senior CA executive and interim chief executive officer who on Monday was elevated to legend status in the Sport Australia Hall of Fame – said caution was required when it came to ensuring the women’s program, including its pathways, continued to grow. Great honour: Cricketing great Belinda Clark has been elevated to legend status in the Sport Australia Hall of Fame. Credit: Paul Harris “I think it [privatisation] is definitely worth exploring appropriately. Whether it’s privatised or not, I think the key issue for the sport is how it balances the international game and the domestic game. If you throw all that league cricket into the domestic bucket, it’s really challenging,” Clark said. “I think the women’s game has done a pretty good job so far of balancing those two things. I think the men’s game has a challenge on its hands, but I think it’s important that the lens we look through for both the men’s and women’s game is specific for them, and I think the women have the chance to get the balance right.\n\nLoading “The men are in a position where they are trying to balance it. It’s something that has got to be a bit of give and take, whereas the women aren’t at that point. It’s really important that we keep international cricket as the premier competition. “What that does is it allows you to grow the game globally, these domestic leagues won’t allow you to do that in the same way. You don’t get the opportunities unless you are at the top of the tree to be playing in the domestic comps. I feel a really strong sense that this game should have opportunities for everyone, that we do need international cricket at all of its levels to continue to expand and provide people with the chance to play.” Clark, 54, has played an instrumental role in the rise of women’s cricket, as a player, captain and administrator, who now runs her own leadership company. Already with a swag of honours, Clark has been bestowed another by the Sport Australia Hall of Fame, having been inducted in 2011 as an athlete member.\n\nLoading “I feel a mix of gratitude, humbleness, just amazed that it has all led to this,” Clark said. A superb leader and one of the finest batters of her generation, Clark was captain of the Australian women’s team for 11 years from 1993, and won World Cups in 1997 and 2005. She still retains the record for most runs (4844 at an average of 47.49) by an Australian woman in ODIs, ahead of Karen Rolton and Meg Lanning, and has captained the most matches (101) with an 83 per cent winning record. She was the first woman to score a double century in a one-day international. “I am really proud the sport has moved along to where there is so much cricket going on now, both ODIs and T20s in particular. Which is why it lends itself to becoming a professional sport, because you are playing a lot,” Clark said.\n\nClark was the first woman inducted into the Australian Cricket Hall of Fame and the second in the ICC Cricket Hall of Fame. In 2023, a statue of Clark was unveiled outside the members’ entrance to the Sydney Cricket Ground. “I often get people sending me pictures of them with it, and I just love it. That’s fun and I enjoy that,” Clark said. Her legend status in the Sport Australia Hall of Fame caps a remarkable journey for a woman who grew up in Newcastle where her father, Allan, was an excellent local cricketer, while mother Margaret was a state tennis champion. Clark dreamt of winning Wimbledon, and idolised John McEnroe and Martina Navratilova. “I still take an interest. I think tennis is a great sport, particularly as a kid, it teaches you tactics, it teaches you movement, it teaches you to be self-reliant, there is no one out there with you … you are umpiring yourselves, so there is an element of being able to call a game yourself,” Clark said.\n\n“I really loved the game, but it just got to a point where cricket became a passion, it became the sport I loved the most.” Clark turned to cricket at 13 when at Newcastle High School, and later played district cricket in Sydney for Gordon. She debuted for Australia in an ODI in 1991, and a fortnight later posted a century on Test debut against India at North Sydney Oval. Clark was made Australian captain in 1993 after a disappointing World Cup sparked change. She was a key figure in the World Cup win in India in ’97, top-scoring with 52 in a low-scoring final against New Zealand. Her 970 runs that year remains a calendar year ODI record in the women’s game. There was more World Cup glory in 2005, when the Australians edged India in the final. Clark retired later that year, her 15 Tests reaping 919 runs at 45.95. So great has contribution been to the sport that the Australian women’s international player of the year is awarded the Belinda Clark Medal, as is the NSW Breakers’ player of the year in the women’s national cricket league.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/albo-stays-away-big-call-234832029.html",
        "title": "‘Albo stays away’: Big call on Trump tariffs",
        "publish_date": "2025-08-25T00:55:08Z",
        "category": "finance",
        "authors": [
            "Joseph Olbrycht-Palmer"
        ],
        "text": "Senator Jacqui Lambie says there no need to ‘push the envelope’ to get an Albanese-Trump meeting. Picture: Martin Ollman / NewsWire\n\nAustralia might be able to stave off higher US tariffs if Anthony Albanese “stays away” from Donald Trump, independent senator Jacqui Lambie says.\n\nThe US President spared Australia from tariff hikes earlier month, leaving the rate at 10 per cent for most goods.\n\nIt is the lowest rate any country has managed to secure and has been achieved without an in-person meeting between the Prime Minister and Mr Trump.\n\nSenator Lambie said on Monday that Mr Albanese’s inability to lock in a face-to-face has “probably worked well”.\n\nSenator Jacqui Lambie says there no need to ‘push the envelope’ to get an Albanese-Trump meeting. Picture: Martin Ollman / NewsWire\n\n“Tariffs didn’t go up so that was a bit of a bonus,” she told Nine.\n\n“So maybe if maybe if Albo stays away from him that may continue.”\n\nADVERTISEMENT\n\nThough, she added “it’s really rude actually of Trump” not to meet with Mr Albanese, saying she knew the government “is doing everything it can to secure a meeting”.\n\nSenator Lambie said it was “actually Trump” who was the barrier.\n\n“It’s not on Albanese at all,” she said.\n\n“Quite frankly … if he doesn’t want to meet you, then why push the envelope?”\n\nWhile most Australian exports are covered by the 10 per cent duties, some are hit with higher rates.\n\nSteel, aluminium and copper are subject to 50 per cent levies.\n\nMost vehicles and automotive parts are slugged with 25 per cent imposts.\n\nThe Trump administration is also eyeing broader sectoral tariffs, including on timber, semiconductors and pharmaceuticals.\n\nWith pharmaceuticals worth billions to Australian producers, Mr Trump’s floated 250 per cent duties on the industry have triggered alarm bells in Canberra.\n\nUS President Donald Trump is not is eyeing more sectoral tariffs. Picture: Andrew Caballero-Reynolds / AFP\n\n‘I never see those submarines coming’\n\nNoting looming concerns around AUKUS sparked by the Trump administration’s review, Senator Lambie said it was “embarrassing” that Australia had funnelled billions to Washington without much to show for the submarine pact.\n\nADVERTISEMENT\n\n“We’ve paid $2bn but haven’t seen one piece of metal,” she said.\n\nThe crossbencher also said she did not think “it makes any difference … if you were mates with (Mr Trump) or you weren’t”.\n\n“When he decides to make his mind up, he makes mind up and everybody else pays the consequences,” Senator Lambie said.\n\nMr Albanese, for better or worse, will likely meet Mr Trump before year’s end.\n\nThe two leaders have several summits coming up, offering them opportunities to have a one-on-one.\n\n“We’ll have meetings with President Trump at a number of events over the coming months,” Mr Albanese told reporters earlier on Monday.\n\n“We’re about to enter summit season, and I look forward to discussions continuing face-to-face as they have been constructive when I’ve had discussions with President Trump up to now.”\n\nPrime Minister Anthony Albanese will likely meet US President Donald Trump before year’s end. Picture: Martin Ollman / NewsWire\n\nHe also said it was a “good thing” that ministers were meeting with their US counterparts, in reference to Deputy Prime Minister and Defence Minister Richard Marles’ visit to Washington this week.\n\nADVERTISEMENT\n\nSpeaking later on Sky, Senator Lambie, a veteran, dismissed Mr Marles’ visit as “just another free trip on the taxpayer”.\n\n“Is there another cheque that we’re going to give the US for submarines where we haven’t seen one piece of steel?” she said.\n\n“I never see those submarines coming.”\n\nShe went on to take aim at Mr Marles directly, saying he was not focused on arming Australia with the missiles and drones it needs.\n\n“I don’t have any admiration for Richard Marles,” Senator Lambie said.\n\n“I’ve made that quite clear during the last few years, especially when it comes to Defence and Defence personnel.\n\n“I don’t believe he’s doing anything about the clean-up in Defence.\n\n“So if you want to waste taxpayers money and send him over there, be my guest.”",
        "source": "Yahoo"
    }
]