[
  {
    "url": "https://www.9news.com.au/world/sole-survivor-air-india-plane-crash-vishwash-kumar-ramesh-speaks-of-his-survival/70d80693-dbc6-4736-b710-b8dd0862ca04",
    "title": "A miracle in seat 11A: Sole survivor of Air India crash speaks",
    "publish_date": "Sat, 14 Jun 2025 00:34:15 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "It seemed impossible, but shortly after news broke that an Air India flight had crashed in the city of Ahmedabad, video started circulating on social media showing a man walking from the scene in a bloodstained shirt.\n\nThen, it emerged there was one survivor: a British national of Indian origin, identified as Vishwash Kumar Ramesh by the Hindustan Times .\n\n\"Thirty seconds after takeoff, there was a loud noise and then the plane crashed. It all happened so quickly,\" it quoted him as saying in an interview at the hospital where he was being treated.\n\nREAD MORE: The girl who fell 3km from a plane explosion and survived\n\nParts of an Air India plane that crashed on Thursday are seen on top of a building in Ahmedabad, India, Friday, June 13, 2025 (AP Photo/Rafiq Maqbool)\n\nHe said he had been visiting family and was returning to the UK with his brother, who had been sitting in a different row. He didn't know if his brother had survived, he said.\n\nAir India later confirmed that of the 242 people on board the flight, 241 had died, making Ramesh the sole survivor.\n\nHis cousin Ajay Valgi told reporters in Leicester, England, that Ramesh had called his family to tell them he's \"fine,\" adding that they were upset about his brother and all of the others who died.\n\nA doctor told CNN that Ramesh's condition was \"not very critical\" and that he could be released in the next couple of days.\n\n\"He has some blood in the images, but he's not very badly injured. He is very comfortable and under strict observation, no issues,\" said Dr. Rajnish Patel, professor and head of surgery at Ahmedabad Civil Hospital.\n\nIndian news outlets have shared a photo of Ramesh's boarding pass, which indicates that he was in seat 11A of the flight, in the emergency exit row, just in front of the plane's left wing. CNN hasn't independently confirmed the veracity of the photo.\n\nREAD MORE: ﻿ Black box recovered as investigations continue into Air India crash\n\nA doctor said he had examined the sole survivor of the Air India crash, whom he identified as Vishwash Kumar Ramesh. (Supplied)\n\nCNN safety analyst and former US Federal Aviation Administration safety inspector David Soucie expressed surprise that someone seated at that part of the plane would survive such a crash.\n\nThat seat is \"right where the spar of the wing would go under and it would be a solid place for the aircraft to hit the ground, but as far as survivability above it, that is incredibly surprising,\" he told CNN.\n\nRamesh told Indian broadcaster Doordarshan that he escaped through a small space near the door by his seat. He said his hand was burned by the flames as he fled from the aircraft.\n\n\"I don't know how I managed to escape,\" Ramesh said, adding that he saw other passengers die in front of him.\n\n\"For some time, I thought I was also going to die. But when I opened my eyes, I realised I was alive and I tried to unbuckle myself from the seat and escape from where I could,\" he said.\n\nRamesh's survival was described as miraculous by a British member of parliament.\n\n\"It's nothing short of a miracle. I have reached out to the family and I'm choosing to respect their privacy at this trying time. But as you may have picked up … one of his brothers was also on that flight who sadly didn't survive,\" Shivani Raja, member of parliament for Leicester East, told CNN's Max Foster on Thursday.\n\nIndian Home Affairs Minister Amit Shah meeting British plane crash survivor Vishwash Kumar Ramesh. (Indian Ministry of Home Affairs)\n\nPeople inside the BJ Medical College and Hospital hostel were also killed when the plane crashed into it, a senior doctor at the Ahmedabad Civil Hospital, where a majority of the dead and injured people were taken, told CNN.\n\nThe doctor added that t﻿he death toll is likely to rise.\n\nEarlier Thursday, Swapnil Bhalodia of the Indian Medical Association Medical Students Network said at least three medical students had died in the crash and another 30 were injured.\n\nThe plane was headed for London's Gatwick airport and was carrying Indian, British, Canadian and Portuguese nationals.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/gold-coast-beach-erosion-impacts-cyclone-alfred-causes-recovery-efforts/aaceaa13-4100-48fa-9dfe-94fa389dcf62",
    "title": "'The sea will keep rising': The race to save the Gold Coast's beaches",
    "publish_date": "Fri, 13 Jun 2025 21:16:12 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "An offshore dredge spewing a rainbow of sand towards Main Beach is just one part of the estimated $50 million effort to restore the 320,000 semi-trailer loads of sand lost from Gold Coast beaches during Tropical Cyclone Alfred .\n\nBut as fast as sand is pumped onto the shore, high tides and strong swells wash it away again.\n\nThe owners of multimillion-dollar properties at Main Beach are desperately trying to save what is left of their backyards.\n\nHome owners are taking it upon themselves to save their properties as clumps of turf fall into the ocean. (Nine)\n\nWhat was once beachfront is now clifftop.\n\nThe beach is the narrowest it's been in 25 years.\n\n﻿Jess Symmons, from Melbourne, is one of countless tourists who have made their annual sojourn north to escape the cold, only to find 30 metres of beach, and the coastal walkway, are missing.\n\n\"We couldn't work out where the path had gone when we got here a couple of days ago, and yeah, we couldn't work out how they were gonna rebuild it,\" she said.﻿\n\nAn off-shore dredge sends a rainbow of sand towards the beach. (Nine)\n\n\"We usually access the beach along here every morning for a swim, so it just means that we have to change up our plans a little bit and head a bit further down.\n\n\"It's sad without the lifeguards and you've got kids that want to swim in the ocean.\"\n\nMain Beach resident Tony Pound reckons, at times, the erosion is getting worse.\n\n\"It seems to be all working, but when they get a big tide or swell, it's back to square one, you know, so they've got a bit of work to do.\n\n\"I can't see that it's gonna be finished for a long time.\n\n\"(Locals) are just a bit depressed about the whole thing and they were expecting quicker results but you know, it just can't happen like that.﻿\"\n\nREAD MORE: Air India plane was in Australia days before crash disaster\n\nBeachfront has become clifftop for this property. (Nine)\n\nThe Gold Coast's beaches are already some of the most managed and engineered in the world and much of the infrastructure needed to do the restoration work is already in place or under construction.\n\nGeobags filled with sand are used to form artificial reefs, already in place at Palm Beach and Narrowneck, ﻿to bear the brunt of large swells before they reach the shore.\n\nSand that naturally collects at the Gold Coast Seaway is transported across to South Stradbroke Island or south to Surfers Paradise, Narrowneck and Main Beach via underground pipelines, usually during winter when the beaches are quiet.\n\nBut it's a slow process.\n\nThe Gold Coast City Council estimates it could take three years for beaches to recover from the damage wreaked by Alfred.﻿\n\nRatepayers have been hit with a one-off $10 levy to cover the clean-up bill.﻿\n\nBut there's no guarantee there won't be further destructive weather events before the recovery is complete.\n\nSurfers Paradise has lost 30 metres of beach. (Nine)\n\n\"The three pillars of sand, sea walls and dune vegetation isn't really cutting it because climate change is increasing, sea levels are rising, storm surges are increasing, all these factors are combining to make this problem worse,\" Mark Ellis, a coastal erosion researcher from Bond University, said.\n\n\"Whether this is Main Beach, Wamberal, Collaroy, or Western Australia or New Zealand, this is happening across the world.\n\n\"I understand people want to maintain their assets... but how much is the ratepayer going to put into maintaining those private assets?\n\n\"In the long term, some of those houses might need to be removed or pushed back, you know, maybe create more of a green strip.\n\n﻿\"This is the big discussion that we need to have, because sooner or later, you can build the wall higher, but the sea is going to keep on rising.\"\n\nHe said the Gold Coast City Council's Coastal Adaptation Plan, which sets out how the city will manage and mitigate coastal hazards up to 2100, may need to be significantly fast-tracked.\n\n\"Short term we need to be protecting what's there, but long term looking to how we reduce the vulnerability of the coastal strip because cyclones, as we know, are getting stronger, waves are getting more intense... we just can't keep up... the council has ssen that it can't keep up with the sand nourishment.\n\n\"We need to change the way we think about coastal property, because everyone loves to live at the beach and we don't begrudge them living there but society needs to be looking at how we can move forward in the future with the climate impact.\"﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/prostate-cancer-testing-expanded-in-world-first/fb898481-0d3d-4774-a21c-665e32dc9f32",
    "title": "More Australian men to be tested for prostate cancer in world-first reforms",
    "publish_date": "Fri, 13 Jun 2025 09:37:44 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "More men will be tested for prostate cancer as part of world-first reforms to boost early detection.\n\nThere are 26,000 new cases each year in Australia and about a third are diagnosed late.\n\nA steering committee was formed to revamp 2016 testing guidelines, which were deemed too confusing, out of date and inadequate.\n\nMore men will be tested for prostate cancer as part of world-first reforms to boost early detection. (Nine)\n\nFollowing consultation with leading experts and the public, the changes will be put to the National Health and Medical Health Research Council for approval.\n\nThe new guidelines include offering a baseline PSA blood test to men aged 40 and a stronger push for GPs to offer twice-yearly testing to all men aged 50 to 69.\n\nThere is also a recommendation to scrap a 2016 stance to avoid testing men over 70.\n\nImportantly, it recommends earlier and more frequent testing for men at higher risk.\n\n\"We have stronger recommendations about men with family histories of prostate cancer because if you have a father, brother, an uncle with prostate cancer, your risk is higher,\" said Professor Jeff Dunn, Steering Committee Chair and PCFA Chief of Mission.\n\nThere is also a recommendation to scrap a 2016 stance to avoid testing men over 70. (Nine)\n\nDunn said significant advances in technology such as multiparametric MRI has helped drive the push for better early detection.\n\nThe use of MRI has become standard practice to investigate elevated PSA levels, reducing the number of invasive procedures performed.\n\n\"It was important that we update these guidelines to factor in the latest evidence, the latest clinical practice,\" he said.\n\n\"We will detect prostate cancer earlier and we will save lives.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/van-gogh-chair-idiot-tourists-sit-on-and-break-delicate-chair-in-italian-museum/3822b719-1eaa-4e76-bc3b-2a42cc28b4a1",
    "title": "Idiot tourists sit on and break 'delicate' Van Gogh chair in Italian museum",
    "publish_date": "Sat, 14 Jun 2025 01:39:05 +0000",
    "category": "entertainment",
    "authors": [
      "Jun"
    ],
    "text": "Two tourists have been caught on CCTV sitting on and breaking a \"very delicate\" art piece at an Italian museum.\n\nThe \"Van Gogh\" chair covered in Swarovski crystals, made by artist Nicola Bolla, was displayed in Verona's Palazzo Maffei Museum.\n\nIt was destroyed when a male tourist tried to sit on the chair, breaking it immediately.\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Instagram)\n\nAnother female tourist, appearing to be his partner, stood by taking photos while ﻿the man broke the chair.\n\nThe museum released the video footage of the incident, condemning the actions of the pair.\n\n﻿\"Disrespectful behaviour has put the integrity of a work of art at risk: the 'Van Gogh' chair by the artist Nicola Bolla was damaged by some visitors,\" the museum said on Instagram.\n\n\"[They were] waiting for the security personnel to leave, chose to take a 'spectacular' photo, ignoring every rule of respect for art and cultural heritage.\"\n\nIdiot tourist break Van Gogh art chair at Palazzo Maffei. (Nine)\n\nThe chair covered in Swarovski crystals, made by artist Nicola Bolla, was in Verona, Italy's Palazzo Maffei Museum. (Facebook: Palazzo Maffei Verona)\n\nIn another post to Facebook, the museum said they were able to fix the chair after ﻿days of not knowing whether the piece could be saved.\n\n\"We are sharing this episode not only for the record, but to start a real awareness campaign on the value of art and the respect it deserves,\" the post read.\n\n\"A heartfelt thanks goes to the police, our security department and the restorers, whose precious work allowed the work to be recovered.﻿\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/australian-shoe-brand-wittner-thrown-possible-lifeline-by-the-shoe-group-after-voluntary-administration/953023b8-7396-4dc0-9798-cc511e39d545",
    "title": "Iconic Australian footwear brand thrown lifeline",
    "publish_date": "Fri, 13 Jun 2025 02:39:19 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "Australian footwear brand Wittner could have a new owner, two months after the retail brand fell into administration .\n\nAustralian company The Shoe Group has expressed interest in a possible acquisition of Wittner and has entered into a period of exclusivity with the voluntary administrators.\n\nThe Shoe Group's chairman Ian Unwin said the business felt excited about the opportunity to bring Wittner into the group.﻿\n\nWomen's shoe brand Wittner has become the latest retail brand in Australia to collapse. (Supplied)\n\nAustralian company The Shoe Group has expressed interest in a possible acquisition of Wittner. (Facebook)\n\n\"It is a brand with a proud legacy and strong customer following, and we look forward to supporting its continued success,\" Unwin said.\n\nDeloitte Turnaround and Restructuring partner and transaction lead Daniel Demir said the proposed sale would support the continuation of an iconic and much-loved Australian business.\n\n\"The proposed sale represents a major milestone for a more than 100-year-old heritage brand, achieved under an accelerated timeline and in the context of a challenging retail environment,\" Demir said.\n\nThe companies that didn't survive Australia's cost of living crisis in 2024 View Gallery\n\n\"We have worked closely with the Wittner team to maintain trading stability throughout the administration process and are pleased to make today's announcement to secure the future of this iconic Australian brand.\"\n\nVoluntary ﻿administrator David Orr said the proposed sale would deliver a positive outcome for all stakeholders, including employees, creditors, landlords, and concession partners.\n\n\"We thank them for their ongoing support and collaboration during the administration process,\" Orr said.\n\n\"TSG brings deep sector expertise and integrated capabilities across manufacturing and retail, making it well placed to support Wittner's future.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/bunnings-warehouse-rolling-out-ev-charges-at-select-stores-across-three-australian-states-and-in-new-zealand/85be9221-cb56-4557-bd6c-e1775a1fa74b",
    "title": "Bunnings Warehouse rolls out new feature in carparks at select stores",
    "publish_date": "Fri, 13 Jun 2025 03:52:12 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "﻿Bunnings Warehouse has rolled out a range of EV chargers in car parks at select stores across Australia.\n\nThe retailer has introduced the chargers to 14 of its stores in Victoria, New South Wales, Western Australia and New Zealand to give EV owners with the opportunity to charge their car while they shop.\n\nThe rollout includes a mix of 22kW, 50kW and 120kW chargers, depending on the site with signage and instructions available to help customers.\n\n﻿Bunnings Warehouse has installed a range of chargers for EV car owners.\n\nA further two EV charging stations will be installed in the coming weeks.\n\nBunnings Warehouse director of stores Rod Caust said the initiative reflected the changing needs of shoppers.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\n\"As electric vehicles become more common in Australia and New Zealand, we're installing EV charging stations in some of our store car parks so our customers with EVs can charge up while they shop,\" Caust said.\n\nEV owners can find stores with EV charging stations through their chosen EV charging station app.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/mick-fanning-charity-golf-day-shark-attack-northern-rivers-floods/5e324c17-ceab-44bf-b87a-29320ac05570",
    "title": "For Mick Fanning, the shark attack 'was just something that happened'",
    "publish_date": "Thu, 12 Jun 2025 19:19:12 +0000",
    "category": "sports",
    "authors": [
      "Jun"
    ],
    "text": "When live broadcasters on the eastern cape of South Africa captured the terrifying moment a shark trailed Australian surf icon Mick Fanning just minutes into the 2015 J-Bay Open Final﻿, viewers across the world gripped their couches and braced for the worst.\n\nBut as the 10th anniversary of the champion wave rider's brush with death looms, Fanning is remarkably relaxed about his miraculous escape from harm.\n\n\"﻿It was just something that happened,\" he told 9news.com.au .\n\nREAD MORE: Whale freed from shark net off Gold Coast\n\nThe infamous shark incident during the 2015 J-Bay Open Final was broadcast around the world. (World Surf League via Getty Imag)\n\n\"To be honest, it wasn't like a flick of the switch moment where I was gonna change my whole life.\n\n\"I just had to do work on myself to get myself back to, you know, surfing and stuff like that.\"\n\nAfter the near-attack in July 2015, Fanning returned to Jeffreys Bay the following year where he took out the competition, before retiring from WSL competition in 2018 as a three-time world champion.\n\nSince then, the Ballina-bred surfer has turned his focus - and perhaps his broader legacy - to ﻿charity.\n\nIn March 2022, TV cameras were again fixed on Fanning, who again donned his signature wetsuit as he traversed deadly flood waters on his jet ski , carrying essential supplies and helping dozens of locals in the Northern Rivers to safe ground.\n\nMick Fanning has used his jet ski to help flood impacted victims in Murwillumbah. (9News)\n\n\"﻿I know that area really well,\" Fanning said.\n\nThe 43-year-old learned to surf in Ballina before honing his skills after moving to the Gold Coast as a teenager.\n\n\"It's a place that I love and I got plenty of friends down there so I had a lot of friends that were affected by it all.\"\n\nFrom there, Mick Fanning's Charity Golf Day was born.\n\nThe inaugural event ﻿raised hundreds of thousands of dollars for the flood recovery.\n\nThree years on, that figure is approaching $2 million, but the circumstances across the region are devastatingly similar.\n\n\"It seems like it's just happening every other year now,\" Fanning said.\n\n\"I guess on the ground and in doing all the rescue work and helping people get back on their feet, you build relationships and ... we've just found that a lot of people are still really struggling.\n\n\"It's been three years on now and ... people are just finding out that the grants they thought they were going to get are not coming through.\n\n\"Some people are just, you know, losing that hope.\"\n\nFanning will be joined by celebrity mates and supporters today for his fourth annual Charity Golf Day. (Supplied)\n\nThe golf day has helped raise almost $2 million for charities supporting the flood recovery effort. (Supplied)\n\nFanning hopes some of the community's faith can be restored when a star-studded lineup of Aussie sporting legends and celebrities converge on the green at Coolangatta and Tweed Heads Golf Club today for the fourth annual Charity Golf Day.\n\n\"We're just here to let them know that we're still here we're still thinking of them and still trying to help where we can,\" he said.\n\n\"There's some incredible people that are all coming out to support and yeah, we're very thankful for all their support and donating their time.\"\n\nFamous faces such as Dylan Alcott, Ellyse Perry, Hamish Blake, Sally Pearson, Karl Stefanovic and Shannon Noll will be swinging their drivers alongside generous supporters to raise vital funds for on-the-ground charities including Givit, Human Nature, and Hands On Hearts.\n\nThis year, $1 million and a Mercedes-Benz are on the line if players can snag a hole-in-one.﻿\n\n\"It keeps getting bigger and bigger and bigger and you know we try and add something new and exciting each and every year﻿,\" Fanning said.\n\n\"It's pretty massive that we can do things like that and just keep making the day bigger and better and hopefully raise more money for those in need, and actually raise more awareness.\"\n\nFans who want a chance to win a year's supply of Balter beer, or would like to make a donation or purchase merch designed by street artist Sid Tapia, can visit the Mick Fanning Charity Golf Day website .",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/cosmetic-procedure-pressures-on-australian-brides-to-be/5b5bd1ab-9fd4-4291-9869-675f739d1f7f",
    "title": "Ashley's algorithm changed when she got engaged. It almost cost her $1700",
    "publish_date": "Thu, 12 Jun 2025 19:17:19 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "﻿Ashley Brooks-Garrett﻿ never really considered Botox until she got engaged and her social media algorithm changed.\n\nSuddenly, her TikTok and Instagram feeds were full of photos of perfect brides and posts about cosmetic procedures, from affordable skin treatments to pricey Botox and filler.\n\nCosmetic procedures – especially nonsurgical ones – are becoming a popular part of wedding preparation, with ﻿US aesthetics company RealSelf reporting that wedding-related cosmetic procedure reviews rose by 30 per cent in 2019 alone.\n\nREAD MORE: Bank staff catch red flags that nearly cost woman her life savings\n\nAshley Brooks-Garrett﻿ didn't consider cosmetic procedures like Botox until she got engaged and her social media algorithm changed. (Supplied)\n\nWedding websites provide \"beauty timelines\" instructing brides on when to undergo specific procedures, cosmetic clinics promote bridal packages, and social media is awash with brides-to-be showing off their before and after photos.\n\nThe result is an intense pressure to join in, one that almost cost Brooks-Garrett $1700.\n\n\"Being bombarded with images of perfect brides constantly on social media definitely played a part in the pressure I felt to look a certain way,\" she told 9news.com.au.\n\n\"Society expects you to be absolutely perfect for one whole day and it's absolutely impossible ... it left me in a huge state of panic.\"﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nSo she traded her Aldi cleanser for a $250 skincare routine, spent $900 on facials and booked $600 worth of Botox.\n\nClinical psychologist and co-founder of ReadyMind Cosmetic Psychology Dr Toni Pikoos said Brooks-Garrett isn't the first bride to be sucked in by social media pressure to look perfect and she won't be the last.\n\nThese days, influencers and everyday women publicise their cosmetic procedures on social media, ﻿normalising what used to be a taboo experience.\n\nWhile that's not necessarily a bad thing, it can have a huge impact on brides.﻿\n\n\"The narrative around cosmetic procedures in society is really shifting towards this view of them being part of self-care and empowerment,\" Pikoos said.\n\n\"When you're bombarded with that sort of messaging, you start to feel like, 'That's what I'm supposed to be doing for the big day as well.'\"\n\nSpecialist medical practitioner Dr Imaan Joshi said pressure may prompt brides to undergo procedures they don't need or may regret.\n\n\"I do think that it's a little bit predatory, for lack of a better word, to start suggesting all these things to young women who don't actually need anything,\" she said.\n\n\"But social media presents it as just another thing you do on your path to getting married.\"\n\nBrooks-Garrett admits she almost fell into that trap but ended up cancelling her $600 Botox less than 24 hours beforehand.\n\n\"I panicked,\" she said, adding that she wanted to \"look like herself\" in wedding photos.\n\nREAD MORE: Death toll of horrific Austrian school shooting rises to 11\n\nBrooks-Garrett﻿ cancelled her Botox appointment because she wanted to \"look like herself\" on her wedding day. (Supplied)\n\nShe also \"couldn't justify the expense\" on top of all her other wedding costs but some Australian brides get around that by travelling overseas for cheaper cosmetic procedures in a practice known as medical tourism.\n\nDavid Allen, chief executive of medical tourism operator Asthetica, said business is booming in Australia and brides-to-be are interested in travelling to Turkey for eyebrow transplants, dental veneers and teeth whitening on a budget.\n\nSome have also inquired about more invasive procedures, including ﻿liposuction, abdominoplasty (tummy tuck), gastric sleeve surgery, and rhinoplasty.\n\nAllen said ﻿Asthetica, which only works with JCI and ISO accredited hospitals, will service \"a minimum\" of 15 Australian brides by the end of the year.\n\n\"Historically, women would purchase a wedding dress a size or two too small and use it as their motivation to be their best on the big day,\" he said.\n\nNow they're \"seeking something with longevity\" in the form of cosmetic procedures, with some brides- and grooms-to-be even booking \"couples surgery\" together.\n\nJoshi said that social media has ﻿\"trivialised\" medical tourism, as users sharing their positive experiences ﻿on TikTok and Instagram often leave out the risks.\n\n\"It's normalised to the extent where people think that it's no different to getting your hair done or your nails done, but it's not,\" she said.\n\n\"You have no idea about the qualifications of the person that you see in a foreign country. You have no idea about the system [or] what they can and can't safely do.\"\n\nPikoos added that ﻿Australian brides need to be educated about the potential of undergoing cosmetic procedures overseas, especially in countries that don't have the same standards or regulations as Australia.\n\n\"You hear terrible horror stories,\" she said.\n\nSocial media has put more pressure than ever on brides to look a certain way and while some may be happy with the results of cosmetic procedures performed in Australia or abroad, Pikoos wants all brides to examine why they want these procedures.\n\n﻿If it's due to shame, embarrassment or anxiety, she suggested addressing those emotions before forking out for a procedure they may regret or be disappointed by.\n\nJoshi added that while investing in skincare can boost brides' confidence, they need to understand the risks and long-term implications of more invasive procedures.\n\nBrooks-Garrett﻿ is glad she invested $1150 in her skin but cancelled her Botox appointment. (Supplied)\n\nLooking at her wedding photos now, Brooks-Garrett﻿ is glad she invested $1150 in skincare and facials but cancelled her $600 Botox appointment.\n\n\"As women, we are made to feel that so much of our worth is tied up in our looks, as if our appearance is central to our value,\" she said.\n\n\"But my face is so expressive and you can see exactly what I was feeling ... love and pure joy.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/desert-potters-pass-on-ancient-firing-skills/105403990",
    "title": "Friendships forged in the outback at 'child-like' weekends of pottery",
    "publish_date": "Sat, 14 Jun 2025 01:55:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a remote station north of Broken Hill, potters from near and far gather for a weekend of primitive firing.\n\nFor about 30 years, station owner and potter Cynthia Langford has opened the gates to welcome potters to do four different types of firings.\n\n\"We've got our sawdust firing … you get a nice black, very highly burnished pot come out of there and they're always very excited about those,\" she says.\n\n\"Then we've got our pit where we put our pots in the pit with coffee grounds and different salted corn husks and things, and get lovely colours on our pots.\n\n\" And then we've got our cow-pat firing that we do in a drum with dry cow pats. \"\n\nHome-made bin kilns are a much more affordable option. (ABC Broken Hill: Katherine Spackman)\n\nThe potters spend most of the day firing pots in bins the Broken Hill potters made in 2012 during a workshop with Swedish potter Stefan Jakob.\n\n\"We had a workshop where we made an IKEA rubbish bin into a little kiln and our members bring their little kiln out and we collect up all their little sticks and bits of wood and we fire our pots in the rubbish bins,\" Mrs Langford says.\n\nAdelaide's Nicki Murnane adds wood to the home-made bin kiln used for raku pottery. (ABC Broken Hill: Katherine Spackman)\n\nFriendship formed through pottery\n\nJoining the Broken Hill group are five members from the Adelaide Potters Club.\n\nEach year since 2012, potters from the club have been travelling six hours to come to the remote station.\n\n\"They were just really excited about coming and joining us to do this and being able to do these primitive firings,\" Mrs Langford says.\n\nCynthia Langford from Purnamoota Station hosts primitive pottery firings on her property each year. (ABC Broken Hill: Katherine Spackman)\n\nAdelaide ceramicist Frances Rogers is attending the firing for the first time and says she loves the simple colour scape.\n\n\"I actually find it really inspiring for the pots — like you look over and you go, 'OK, I'll use copper red today because that's what I'm looking at,'\" she says.\n\nAdelaide's Frances Rogers made her raku creation at the primitive pottery firing event. (ABC Broken Hill: Katherine Spackman)\n\nPersonal trainer Nicki Murnane is returning to Purnamoota for the second time and says it is a great weekend of getting back to nature and meeting lovely people.\n\n\"I always say to people it's a child-like weekend,\" she says.\n\nNicki Murnane has twice been to the primitive pottery firings on the remote outback station. (ABC Broken Hill: Katherine Spackman)\n\n\"The anticipation you get as a kid on Christmas Eve, that's what you get here, and you don't really get that much in life anymore.\n\n\"[It's] the sheer joy of unravelling and opening up and not knowing what you're going to get.\"\n\nPots are draped with corn husks, beetroot leaves, coffee grounds and wire before they go into the fire pit. (ABC Broken Hill: Katherine Spackman)\n\nMore accessible pottery\n\nA highlight for the visitors is the raku firings in metal bins that the Broken Hill potters bring from their homes.\n\nRaku pottery is a Japanese firing technique that produces distinctive markings on the surface of the ceramics.\n\nThe Broken Hill potters burn emu feathers or horse hair onto their pots at the weekend event.\n\n\"You open the lid and you put a little sugar on it and if the sugar burns black when it hits the pot then the pots are ready to come out and have feathers put on it,\" Broken Hill Potters Society president Sue Andrews says.\n\nAs part of a raku firing, a Broken Hill potter burns emu feathers onto a pot. (ABC Broken Hill: Katherine Spackman)\n\nThe other raku technique they use involves putting a raku glaze on pots and getting it to temperature before quickly removing it to put it in another bin to reduce the glaze and give different colours.\n\nAdelaide ceramicist Frances Rogers says it is a wonderful collective activity.\n\n\"You need all hands on deck … pulling the pot out and dropping it in the hot barrel and someone's throwing paper and the other ones got the wet paper and you know, everyone's like 'get the lid on' so it's a little bit more adrenaline,\" she says.\n\nRogers says it is making pottery more affordable and accessible.\n\n\"[Proper kilns] will be $4,000. They've just told us we could whip one of these up for about $400 or $450,\" she says.\n\nUnpredictable and spontaneous results\n\nThe potters pack their pots with cow pats to create unique patterns. (ABC Broken Hill: Katherine Spackman)\n\nBroken Hill's Lee Quinn has been a potter for 40 years.\n\nShe enjoys the process of making the cow-pat pit.\n\nAs the pots were removed on Sunday morning, Mrs Andrews says it is the best cow pat firing they have had.\n\n\"Its just the colours — normally it doesn't come this good. I think it was more pots in the cow pat, tightly packed in a smaller drum,\" she says.\n\nSue Andrews says this year's cow pat firing on a remote station was the best they have ever had. (ABC Broken Hill: Katherine Spackman)\n\nWaitlist for Broken Hill pottery classes\n\nJoining this weekend was new potter and firefighter Jack Simmonds, who managed to get into day classes at the Broken Hill Potters Society after a three-year wait.\n\n\"I did a sip and clay night probably in 2021 and put my name down for classes and then I got the call-up late last year and they said there's a spot for you Tuesday mornings and I rang my boss and got Tuesday mornings off,\" he says.\n\nBroken Hill's Jack Simmonds has done his first pottery pit firing. (ABC Broken Hill: Katherine Spackman)\n\nMrs Langford, who first joined the potters in 1991, says the Broken Hill Potters Society was founded in the mid-1970s by three or four women.\n\nThey sold pots and eventually raised money to buy a kiln together and officially formed a society.\n\nIn time, they purchased an old scout hall and raise funds each year through Mother's Day and Christmas fairs to earn the money to pay for the rates.\n\nThe Broken Hill Potters Society runs weekly classes teaching people pottery skills. (ABC Broken Hill: Katherine Spackman)",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/surging-scott-day-in-us-open-mix-as-superstars-crash/105416752",
    "title": "Surging Scott, Day in US Open mix as superstars crash",
    "publish_date": "Sat, 14 Jun 2025 01:10:30 +0000",
    "category": "sports",
    "authors": [],
    "text": "True to his word, Adam Scott has hung tough to storm right into contention as a raft of golfing heavyweights floundered during the US Open second round at the beastly Oakmont Country Club.\n\nWhile defending champion Bryson DeChambeau led the exodus of big names to miss the halfway cut, Scott carved out a second straight even-par round of 70 to be tied fourth in the clubhouse.\n\nAustralians at the US Open 36 holes T4: Adam Scott — Level par\n\nT12: Jason Day — 3-over\n\nT45: Marc Leishman — 6-over\n\nT59: Cam Davis — 7-over\n\nT70: Cameron Smith — 8-over\n\nT80: Min Woo Lee — 9-over Halfway cut at 7-over\n\nContesting his 96th consecutive major, the 44-year-old showed the younger stars how to play major championship golf, repeatedly rebounding from bogeys with birdies to sit just three shots off the pace at the halfway mark of the tournament.\n\nWith the final pairs left on the course, play was suspended due to dangerous weather in the area. However most of those remaining are either safely inside the cut of 7-over or well outside.\n\nFour Australians will be there for the weekend — Scott, Jason Day, Marc Leishman and Cam Davis. Cameron Smith made a late comeback on his second nine, but left himself too much to do and finished a shot outside the cut on 8-over. Min Woo Lee shot a 2-over 72 to finish on 9-over.\n\nSam Burns fired the low round of the championship, a brilliant 5-under 65 to snare the clubhouse lead at 3-under.\n\nFellow American and first-round leader JJ Spaun is second, one stroke behind Burns, after following up his starting 66 with a 72 on Friday (Saturday AEST).\n\nSeeking his maiden major, Norwegian super talent Viktor Hovland is the only other player above Scott on the leaderboard, and one of only three players in red numbers at one under after posting a second-round 70.\n\nScott's fellow former world number one Day battled back into the picture with the second-lowest round of the day to also raise hopes of a famous Australian triumph at the US Open's most gruelling venue.\n\nThe former PGA champ was way off the pace after his opening round of 76 but demonstrated his enduring class with a 3-under 67 to get back to 3-over for the tournament, just six shots back entering the weekend in a tie for 13th.\n\nDay's round, which began at the 10th hole, was ignited by a terrific eagle at his third hole — the gigantic par-five 12th that measures 647 yards.\n\nHe struck his approach from 323 yards to 20 feet from the hole and sank the eagle putt. Two birdies quickly followed in the next five holes.\n\nHis biggest disappointment as he looked set to finish with a 66 after two more birdies on the homeward nine, was his wayward drive at the ninth that led to an anti-climactic final bogey.\n\nBurns, who shot a final-round 62 on Sunday at the Canadian Open before losing in a play-off, also started his second round on the back nine and birdied 11, 13, 17 and 18.\n\nHe responded to his lone bogey at the first hole by putting his approach at the next hole to about six feet.\n\nAmerican world number one Scottie Scheffler had five bogeys and four birdies in his 71 to be left at 4-over, alongside countryman Collin Morikawa (71) and fellow dual major winner Jon Rahm, who exploded after shooting a 75.\n\nThe second-round spoiler left the superstar Spaniard seven shots adrift of Burns.\n\n\"Honestly, I'm too annoyed and too mad right now to think about any perspective,\" Rahm said.\n\n\"Very few rounds of golf I played in my life where I think I hit good putts and they didn't sniff the hole, so it's frustrating.\"\n\nMasters champion Rory McIlroy birdied the last hole in a round of 72 to be 6-over and just inside the cut line.\n\nAustralian Marc Leishman, who had begun promisingly with a 71, suffered in his second round with a 75 that included a double-bogey six at the ninth hole to also hover at 6-over.\n\nA day after Patrick Reed recorded the fourth albatross in US Open annals, Frenchman Victor Perez made a hole-in-one at the par-three sixth, the second ever ace during a US Open at Oakmont.\n\nFive-time major winner Brooks Koepka, one of 14 LIV Golf players in the field, started his day two shots off the pace but dropped back after a 74 that featured eight bogeys.\n\nAfter out-duelling McIlroy down the stretch to reign last year at Pinehurst, DeChambeau won't feature on the weekend after slumping to 10-over with a second-round 77.\n\nAt nine over following rounds of 77 and 72, Australian Min Woo Lee was also sent packing, along with dual major winner Justin Thomas, 2016 Oakmont champion Dustin Johnson, fellow former world number one Justin Rose, LIV Golf dominator Joaquin Niemann and Swedish sensation Ludvig Aberg.\n\nIncredibly, Johnson and Niemann were among some 60 players to finish at 10-over or worse, with American George Duangmanee racking up a +35 total with horror rounds of 86 and 89.\n\nAAP with agencies",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/how-to-visit-the-snow-in-australia-on-a-budget/104328340",
    "title": "How Aussies are affording a 'bloody expensive' trip to the snow",
    "publish_date": "Sat, 14 Jun 2025 01:00:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thinking of taking a trip to the snow this winter, but the cost of staying in a resort town and hitting the slopes is giving you chills?\n\nYou're not alone.\n\nHere's how others have found ways to enjoy holidaying in the Australian Alps on a budget.\n\n'It's a bucket-list item'\n\nHigh school mates Dylan Oakroot and Alex Marychurch sit under the pull-out awning of their SUV in a free campground and watch the rain pour down.\n\nEvery so often, one of the pair stands up to push the growing pool of water off their canvas roof.\n\nThere's a pool forming, too, in the corner of the barbecue, where some of the cheapest sausages the boys could buy are slowly cooking in the rain.\n\nAlex Marychurch braves the rain to cook some steak and sausages for a cheap meal. (ABC News: Jack Fisher)\n\nIt's snow season 2024, and what some might consider a dour situation is one of pure joy for the 23-year-olds from Brisbane.\n\nThey knew doing it on the cheap was the only way they were ever going to fulfil their dream of visiting the snow.\n\n\"It's our first time seeing snow. We've been dreaming about it for a long time. It's a bucket-list item,\" Mr Oakroot said.\n\n\" We're trying to do it cheap, but it's bloody expensive. \"\n\nVisitors say some costs, such as day and lift passes, cannot be avoided. (ABC News: Jack Fisher)\n\nThe boys will miss the 2025 winter season because of life circumstances, but Mr Oakroot said they would \"definitely\" make the trip again.\n\n\"We plan to return next year, and maybe with some more people too,\" he said.\n\nSnow sports, and even just a day trip to see the snow up close, are becoming too expensive for many people.\n\nMr Oakshot and Mr Marychurch are staying in a campground near Jindabyne, in the Snowy Mountains, rated one of the least-affordable towns in Australia in the 2023 Rental Affordability Index.\n\nHouse prices here have risen almost 150 per cent over five years, with locals being priced out of the town they grew up in as homes are transformed into short-term rentals.\n\nJindabyne was rated the least affordable town in Australia in the 2023 Rental Affordability Index. (ABC News: Jack Fisher)\n\nThe population of around 5,000 quadruples to more than 20,000 during peak snow season as tourists head to the ski fields of Perisher, Thredbo and Charlotte Pass, which are all just a 30-minute drive away.\n\nEvery night in winter, Jindabyne is lit up with fluorescent lights, as almost every store selling food or renting snow gear desperately tries to capitalise on the tourist boom.\n\nMost stores in Jindabyne's CBD rely on winter tourism dollars. (ABC News: Jack Fisher)\n\nBut most evenings, ravenous crowds descend on the only major supermarket in town, eager to feed themselves as cheaply as possible.\n\nAnd during the day, when one Instagrammer reported that a hot chocolate on the slopes can cost up to $17, many budget-conscious holiday-makers resort to bringing a packed lunch.\n\n'A better experience'\n\nOne of the biggest expenses for Mr Oakroot and Mr Marychurch was the cost of fuel to get them from Brisbane to Jindabyne.\n\nBut, Mr Oakroot said, some costs were unavoidable.\n\n\"The most expensive part was the lift passes. They charge an arm and a leg for a lift pass, but it's worth it,\" he said.\n\nDay passes to go skiing in Australia start from about $150, with membership deals pushing tourists to spend more on a seasonal pass.\n\nMates Dylan Oakroot and Alex Marychurch hope to return to the snow next year. (ABC News: Jack Fisher)\n\nThe mates are curbing costs by sleeping in a swag and a rooftop tent, eating a diet of sausages, eggs, cheese, bread and cheap steaks cooked in the drizzle, and relying on lighting a fire or simply rugging up to stay warm.\n\n\"Doing it as cheaply as possible adds to the experience,\" Mr Oakroot said.\n\n\"You've got more challenges you've got to overcome. You make more memories. It's a lot better.\"\n\n'No other way to save'\n\nAt another Snowy Mountains campsite, Wollongong's Judy Chang is playing with her young daughter, Skye, outside their teepee tent.\n\n\"Accommodation is so expensive, so we decided to invest in a tent,\" she said.\n\nJudy Chang says camping is the only way she can fulfil her dream of annual family snow trips. (ABC News: Jack Fisher)\n\n\"There's not really any other way to save money. You have to pay for a lift pass, so this is how we're doing it.\"\n\nMs Chang was able to keep some costs down by raiding second-hand markets and op-shops, managing to pick up a second-hand ski jacket and snowboard for Skye.\n\n\"They grow so quickly, and the second-hand market offers pretty new things,\" she said.\n\nJudy Chang bought two-year-old Skye a second-hand snowboard. (ABC News: Jack Fisher)\n\nMs Chang also recommended purchasing a two-year car pass from National Parks because it was cheaper in the long run than the annual alternative.\n\nHer dream of having a yearly family snow trip was only feasible by cutting costs as much as possible, she said.\n\n\"It's hard. Not everyone is into camping, and winter camping is tough, but it is super nice,\" she said.\n\n\" Everyone should at least give it a try. \"\n\nJudy Chang says camping with a toddler isn't easy, but it makes a snow trip affordable. (ABC News: Jack Fisher)\n\n'Tourism is what it is'\n\nBut tension is brewing in the town.\n\nMany locals are frustrated by the growing trend of BYO food and accommodation, with local cafes and traders feeling they're missing out on tourism dollars as visitors cut costs.\n\nComments on the local Facebook noticeboard criticise visitors to the region who don't give back — those who don't buy a ski pass at the resorts, who bring their own lunch, who take up valuable car parks without spending in local shops.\n\n\"80 per cent of the non-skiiers [sic] come up with a slow cooker full of rice and don't spend a penny on the resort or other food outlets up there. Sooner or later those businesses are going to go belly up,\" one comment says.\n\n\"They need to stop all [visitors] taking a packed lunch up there in a full van taking a parking spot away from skiers whilst contributing nothing but park entry to the economy. Ban snow play and toboggans,\" another said.\n\nHowever, Jindabyne Chamber of Commerce president Olivier Kapetanakos said tourists trying to visit the snow cheaply was nothing new and was often a way for people to try out the snow before committing to a more expensive visit in the future.\n\nHe said many such tourists returned in future years or even moved to the area long term.\n\n\"Tourism is what it is,\" he said.\n\n\"We have to take them as they are.\n\n\" We must help the first-time snow tourist have a good time so they will feel comfortable to return. \"\n\nMr Kapetanakos said local businesses had learnt that three-or-so months of tourism could not sustain a year-round income and many had pivoted to new markets, such as hiking and mountain-biking.\n\nContributing to the town\n\nFor Matt Boggas from the Sunshine Coast, a trip to the snow looks like snowboarding during the day, then sleeping in his car at night, cooking his own food, waking himself up with a swim in Jindabyne Lake, and trying not to drink too much.\n\nMatt Boggas returns to the Snowy Mountains every year. (ABC News: Jack Fisher)\n\nAnd if he didn't sleep in his car?\n\n\"It would be ridiculous. It would be a lot of money – definitely unaffordable for most people our age [25],\" he said.\n\n\" Even going and getting a beer here is crazy. \"\n\nThe local brewery sells 300mL beers from $9, while many choose to purchase alcohol to be consumed at home.\n\nBWS Jindabyne is the liquor store chain's top-performing store nationally during the winter months.\n\nMatt Boggas sleeps in his car and eats cheaply so he can enjoy the snowfields every year. (ABC News: Jack Fisher)\n\nWhen he's not on the slopes, Mr Boggas is dropping in at the local skate-bowl, just off the main street, which becomes a magnet for would-be snowboarders after the lifts have closed for the day, or in bad weather.\n\nAs young people carve around on scooters and skateboards with music pumping, Mr Boggas says these people — many friends of his from the Sunshine Coast who make the pilgrimage to the snow annually — contribute something to the snow experience.\n\nIt's what he comes back for each year.\n\n\"The cost makes it super inaccessible. It sucks,\" he said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/professor-scolyer-parkrun-milestone/105415382",
    "title": "Professor Richard Scolyer celebrates milestone set after cancer diagnosis",
    "publish_date": "Sat, 14 Jun 2025 00:41:19 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Australian of the Year Richard Scolyer has completed his 250th Parkrun — a milestone he set after he was diagnosed with terminal brain cancer in 2023.\n\nThe renowned melanoma researcher was among hundreds of runners who took part in the Greenway Parkrun at Haberfield in Sydney's inner west on Saturday morning.\n\nProfessor Scolyer, who put himself forward as \"patient zero\" for revolutionary brain cancer treatment, crossed the finish line to applause and cheers from the crowd.\n\nShortly after he finished the race, light rain began to fall and a rainbow formed over the reserve.\n\nA number of media turned up to the event, he told them that 250 Parkruns was a \"big goal\" he set for himself.\n\nA rainbow formed after Richard Scolyer finished his run. (ABC News: Luke Royes)\n\n\"I did a lot of Parkruns in the early 2000s but then as the kids go through various parts of their life you stop doing it,\" he said.\n\n\"And then when I got sick again I wanted to try and get to 250.\n\n\" I guess it's part of my personality. Bit embarrassing, but wanting to get to 250 was something that pushed me along. \"\n\nProfessor Scolyer said it was \"crazy\" to see such a huge turnout at the run and that he was \"very happy\" to complete his goal.\n\n'I never thought I'd get there'\n\nProfessor Scolyer said he had doubts about whether he would reach the major milestone.\n\n\"To be honest, I never thought I'd get there,\" he said.\n\nThe cancer researcher participated in the run at Richard Murden Reserve on Saturday. (ABC News: Luke Royes)\n\nIn a post to his more than 20,000 followers on X earlier this week, he wrote that it was a goal \"I wasn't sure I'd reach\" and that he was excited to be able to take part in the run.\n\n\"So it's with a huge amount of gratitude to my family, friends, and medical team that I'll be celebrating this achievement,\" he said.\n\n\" Thanks to everyone who's been cheering me on. \"\n\nThe post on social media came after a long period of no updates, which Professor Scolyer said was due to the impact of his latest round of cancer treatment, but that he now felt \"like the fog has lifted a bit\".\n\nProfessor Scolyer was diagnosed with an aggressive glioblastoma in 2023 and was given just six to eight months to live.\n\nBut an experimental immunotherapy treatment he was given managed to keep the cancer at bay for almost two years with no recurrence.\n\nRichard Scolyer's treatment defied expectations by keeping his brain cancer at bay for 22 months. (Twitter: @ProfRAScolyer)\n\nHowever, he revealed in March that after undergoing scans, he had received the heartbreaking news that his brain cancer had come back.\n\nIn May, he had another setback, revealing that his first proper scan since the surgery showed the glioblastoma had progressed and it was getting \"harder to treat\".\n\n'I'm still here so I'm pretty pleased about that'\n\nHe told ABC News Breakfast last month he wasn't sure how much time he had left.\n\n\"I'm still here and still able to chat to you so I'm pretty pleased about that,\" he said. \"Who knows how long I've got. Could be months, could be less.\"\n\nProfessor Scolyer said he's focused on spending the time he has left doing the things he loves most.\n\n\"I love my life. I love the interactions I have with so many people.\n\nRichard Scolyer was diagnosed with terminal brain cancer in 2023. (Supplied: Instagram/@profrscolyer)\n\n\"I guess in reality, I have focused down on the things that I like doing. Spending more time with my family is number one, but also contributing to society. It's something I've done for a long, long time.\n\n\"I've been a specialist for more than 25 years now. So a lot of things that I've done I don't want to give up just like that.\"\n\nProfessor Scolyer has been very public and honest about his prognosis and journey through brain cancer treatment in interviews, social media and in his recent memoir, Brainstorm.\n\nHis memoir, which was co-written with Garry Maddox, won the Social Impact Book of the Year at the Australian Book Industry Awards in Melbourne last month.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/ingham-flood-victims-homeless-as-house-crisis-worsens/105366038",
    "title": "Flood victim's double 'devastation' as rental crisis leaves her adrift",
    "publish_date": "Sat, 14 Jun 2025 00:02:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Karen Thomas is packing up precious memories and the few belongings she has left as she prepares to leave her beloved community of Ingham.\n\nMs Thomas hasn't been able to find any permanent housing since floods inundated her rental property in February.\n\nCommunity advocates say she's not alone.\n\nResidents in the flood-stricken Queensland town say they are being forced to leave due to a worsening housing crisis.\n\nFloods hit during grief\n\nMs Thomas has not only lost her home in Ingham, she has lost her community.\n\nThe floods came just after her daughter, Jody Davies, died from suicide in September.\n\nKaren Thomas with a photo of her daughter Jody, who died last year. (ABC News: Georgia Loney)\n\nIn the months after Jody's death, volunteering at the local community hub had given Ms Thomas meaning and purpose in her life.\n\nThen the floods hit.\n\n\"When we went back to the house after the flood had subsided, it was like devastation, it was terrible,\" she said.\n\n\"All my baby photos, all my photos, I lost … I opened the box up and they were all destroyed, so I had to throw them out.\"\n\nMs Thomas had no formal rental agreement for the flood-damaged property, and was not able to return to live there.\n\n\n\nShe found temporary accommodation for a while, but that property has now been sold.\n\n\"We've been everywhere and we've done everything, I've been begging,\" she said.\n\nMs Thomas is moving to Townsville, more than 100 kilometres south, where she can stay with family.\n\n\"I'm going to live with my grandchildren in a little room, until hopefully I can come back to Ingham,\" she said.\n\nKaren Thomas threw away flood-damaged property. (ABC News: Georgia Loney)\n\nLiving in cars, couch surfing\n\nThe Hinchinbrook Community Support Centre's Quinta Lahtinen said Ms Thomas's circumstances were not unique.\n\n\n\nShe said she had seen many people who were living in precarious housing situations as a result of the floods.\n\nQuinta Lahtinen says people have left town due to the lack of housing. (ABC News: Georgia Loney)\n\nWhen the flood hit Ingham, which has a population of about 4,500, it destroyed or badly damaged more than 200 houses.\n\n\"Quite a number of our community are moving out of the district, because of the housing crisis,\" Ms Lahtinen said.\n\nFloodwater surrounded and inundated Ms Thomas's rental property in Ingham in February. (Supplied: Karen Thomas)\n\n\"We're seeing a lot of people living in cars and vans.\n\n\"We're seeing really significant overcrowding issues with families, and lots of couch surfing.\"\n\nSkills shortage slows recovery\n\nVeteran real estate agent Felix Reitano said rental listings were few and far between \"even before the floods\", but the lack of available housing was worse now.\n\n\"People [were] attracted to the town because of relatively low prices and its proximity to Townsville,\" he said.\n\nReal estate agent Felix Reitano says floods exacerbated the housing crisis. (ABC News: Georgia Loney)\n\nMr Reitano said it was disheartening to have to turn good tenants away because there wasn't enough stock.\n\n\"People had to move out of their properties to get insurance work done, and they didn't have a place to go to,\" he said.\n\n\"It's very embarrassing as a real estate agent when you can't place a good tenant in a house, where we would like to retain them as a tenant.\"\n\nFloodwaters inundated hundreds of houses in Ingham in February. (ABC News: Sophie Johnson)\n\nHe said businesses were slowly getting back on track, but skills shortages meant repair work was taking longer than it otherwise would.\n\n\"It's going to take a long time to get out of this crisis,\" he said.\n\nRecovery takes time\n\nHinchinbrook deputy mayor Mary Brown spearheaded recovery efforts after the floods.\n\nMs Brown said the shire was continuing to advocate for an increase in housing supply.\n\n\"That's not a quick process,\" she said.\n\nHinchinbrook deputy mayor Mary Brown says the town is slowly recovering. (ABC News: Georgia Loney)\n\n\"The town looks lovely, a lot of the debris has been cleaned up, and things look like they're getting back to normal — and in a lot of ways they are.\n\n\" But there are also those longer-term impacts around recovery. \"\n\n'Please don't forget us'\n\nFor Ms Thomas, a supply of more homes to ease the housing crisis can't come soon enough.\n\n\"If the government put 100 dongas up on a piece of land, just for a year or so, people [would] get somewhere to live, and settle [while] the houses get fixed up, \" she said.\n\n\"If there's a place to rent, it's gone in five seconds. There's really nothing in this town.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/big-brother-movement-migration-scheme-celebrates-a-century/105404752",
    "title": "'We were uncouth youth': The legacy of 15,000 boys sent to Aussie farms",
    "publish_date": "Fri, 13 Jun 2025 23:39:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Identical twins Alistair and Alex Macdonald were just 16 when they arrived at an isolated farm in southern New South Wales in 1955, a world away from the grey streets of Edinburgh.\n\nThey had left Scotland for Australia as part of the Big Brother Movement, a government-backed scheme aimed to help populate and develop a young Australian nation.\n\n\"When we were uncouth youth looking for our future,\" Alex laughed.\n\nScheme shaped rural Australia\n\nBetween 1925 and 1982, in one of the biggest immigration schemes in the nation's history, 15,000 boys — some as young as 14 — came to Australia from the United Kingdom.\n\nEager for adventure and opportunity, they all migrated voluntarily.\n\nKnown as Little Brothers, they were in the care of adult supervisors, or Big Brothers.\n\nA group of teenage boys migrating to Australia under the Big Brother Movement. (Supplied)\n\nMany, like the Macdonald brothers, dreamed of becoming farmers.\n\n\"We all came out to the good country,\" Alex Macdonald said.\n\nEarlier this year the twins, now 86, returned to the farm at Blighty where 70 years ago their hopes of a better life in Australia first took shape.\n\nBut life back then was tough.\n\n\"Work, work, work, all the time, but that was how it was,\" Alistair recalled, stepping carefully across a paddock strewn with broken concrete and rusted relics.\n\nAlex and Alistair Macdonald revisit the property where they were sent in 1955 as teenage migrants. (ABC Landline: Tim Lee)\n\nTheir stories echo the experience of many boys whose lives were changed by the Big Brother Movement.\n\nKnown now as BBM, the organisation is celebrating its centenary this year with reunions in most states of Australia.\n\nThe thinning ranks of men once known as Little Brothers have been gathering to reminisce.\n\n\"It's lovely to honour the old men now. Just to see their faces and for them to connect with other people. Some people haven't seen each other for years,\" BBM CEO Suellen McCaffrey said.\n\nAs the movement turns 100, Suellen McCaffrey says it continues to help young Australians build their future. (Supplied)\n\n\"Not so many organisations get to 100 years old so it's so important to recognise the journeys and honour the journeys these men have made,\" she said.\n\nGenerations linked by the same journey\n\nThe NSW reunion was held at Calmsley Hill, near Parramatta, the former training farm where new arrivals had a basic course in farming before being assigned to rural properties.\n\nAmong those in attendance was 93-year-old Jim Reardon, who arrived from Liverpool in 1949.\n\nDecades after arriving in Australia, former Little Brothers gather with their families to celebrate. (Supplied)\n\nHe recalled the initial years as \"torrid\".\n\n\"I used to live in little tin hut, hot in the summer, freezing in the winter. Cutting down trees, it was hard graft,\" Mr Reardon said.\n\n\" Twelve hours a day, seven days a week. \"\n\nBy the late 1950s, new Big Brother arrivals had shifted. They were typically older, in their 20s, and seeking city work rather than farming.\n\nLittle Brother migrants were taught farm skills such as how to ride a horse. (Supplied)\n\nThe sponsorship scheme ended following changes to the migration rules in 1983.\n\nAustralian immigration policy became more multicultural and the scheme was seen to favour only Britons.\n\nThe training farm in western Sydney was sold, and the proceeds reinvested, and the organisation evolved into BBM Youth Support.\n\nIt sponsors young Australians to travel overseas to further their careers, many focused on rural development.\n\nThe Big Brother scheme had a profound role in the development of the Australian nation.\n\nA century later, numbers tell the story\n\nThe organisation estimates there are now almost 100,000 descendants of the Little Brothers.\n\n\"The Big Brother Movement allowed my father and my family so many opportunities. We are the Australian story,\" said Nick Bleasdale, who attended the Sydney reunion.\n\nThe Macdonald brothers (Alistair on the left) on the boat coming out to Australia 1955. (Supplied)\n\n\"My father [who] passed away not long ago, ended up as the mayor of Blacktown. He would always tell me my whole life he was a Little Brother and for that as a family we are forever grateful.\"\n\nAs are the Macdonalds.\n\nTheir three siblings and parents followed them, migrating to Australia to live out the rest of their lives.\n\nAlex Macdonald (on the tractor) working with burr harvesters on an Australian farm in 1956. (Supplied)\n\n\"I've had a very fortunate life,\" Alistair Macdonald said.\n\n\"We're lucky, aren't we? We're in the lucky country, so Aussie has been pretty lucky to us,\" added Alex.\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/nt-life-as-a-cowboy-in-the-remote-top-end-rodeos/105400900",
    "title": "'It's just so free': Life as a cowboy in the remote Top End",
    "publish_date": "Fri, 13 Jun 2025 23:10:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's late afternoon at a dusty rodeo arena in rural Darwin, and a growing crowd is watching on as women compete in barrel racing, guiding horses around an obstacle course plotted by 44-gallon drums.\n\nA persistent dust cloud hovers at ground level, stirred up by the rhythmic canter of a new horse entering the arena every minute or so.\n\nA woman competing in barrel racing at the Noonamah Rodeo. (ABC News: Sam Parry)\n\nFor many spectators who have driven in from Darwin and nearby towns, the Noonamah Rodeo is an exaggerated spectacle of rural life.\n\nA road train cab perched above the arena spews flames at various intervals.\n\nThere's a half-time freestyle motocross show, and the live country music playing will continue until the early hours of the morning.\n\nA road train cab and big screen fit out the rodeo arena. (ABC News: Sam Parry)\n\nThe arena is next to the Noonamah Tavern, in Darwin's rural area. (ABC News: Sam Parry)\n\nFor urban visitors, it's a rare chance to pull on the RMs and a Ringers Western work shirt or to flaunt a slightly more polished cowboy-core 'fit inspired by celebrities like Orville Peck or Beyoncé.\n\nBut for others, it is serious business.\n\nCowboys waiting in the stalls for the next event. (ABC News: Sam Parry)\n\nBackstage, dozens of young men in sturdy boots, well-worn jeans and wide-brimmed hats are standing, talking among themselves.\n\nIt seems most of them know each other from the rodeo circuit, and they aren't afraid to call themselves \"cowboys\".\n\nCowboys come from all over the Top End to compete at the Noonamah Rodeo. (ABC News: Sam Parry)\n\nOne of them is UK-born Jack Milsom.\n\nJust a year ago, at 25, he left his small home town in the Adelaide Hills seeking a life on a remote Top End cattle station, with no idea what to expect.\n\nOne year on, he's buckling up a pair of tasselled leather chaps in the shadow of this rodeo arena by a roadside pub.\n\nJack Milsom says station life has always appealed to him. (ABC News: Sam Parry)\n\nJack says he's always been drawn to the idea of life on the land, and so one day, with \"literally only directions, not knowing how the pay was or what I was doing\" he got in the car and drove 3,200 kilometres north.\n\n\"Looking at stations and what not, I thought 'that lifestyle is for me', and took the jump,\" he says, in his blended British-Australian accent.\n\n\"I thought, bugger it, you only live once.\n\n\"It's just so free. You get to work on the land every day, the boss is cruisy, you get to go back to the workshop at the end of every day.\n\n\"Everyone has a beer, a yarn, and rinse, wash, repeat.\"\n\nJack Milsom has embraced the cowboy lifestyle since he \"took the jump\" to work on a Top End station about a year ago. (ABC News: Sam Parry)\n\nFor the men and women who work on remote Top End cattle stations — part of a community of workers often based hundreds of kilometres from each other — events like this one are important.\n\nAs well as a rare chance to socialise, they are an opportunity to compete in that celebrated event of cowboy culture, the rodeo.\n\nWomen typically compete in barrel racing, while the men ride bulls.\n\nA rodeo rider and his bull bolt into the arena. (ABC News: Sam Parry)\n\nWhen he's not riding unruly livestock for a crowd of thousands, Jack is driving heavy machinery at Old Mount Bundy Station, near Jabiru, where he lives and works.\n\nHe is quick to clarify that station life is not easy, but affords an undeniable sense of freedom.\n\n\"Don't get me wrong, the work's hard and you do long hours, but it's very rewarding work,\" he says.\n\nA bull rider hangs on during a rodeo event. (ABC News: Sam Parry)\n\nAfter a few moments, the rider tumbles to the ground. (ABC News: Sam Parry)\n\nThe cowboy uniform\n\nIn a yard behind the arena — a quasi-locker room for competitors, bordered by nothing more than temporary cyclone fencing — a handful of other bull riders are preparing for a night of rural entertainment.\n\nThe cowboys get changed in full view of thousands of spectators queuing up to enter the venue, pulling gear out of worn duffel bags that litter the ground.\n\nCowboys get ready backstage. (ABC News: Sam Parry)\n\nSplayed open in the dust, they contain a variety of cattlemen's accoutrements like brushes, bull-ropes, talcum powder and leather-related products.\n\nStraddling a saddle in the dirt as he adjusts his stirrups, Jack says that before each rodeo, he applies rosin to the inside of his chaps, in the hopes he'll stick to his saddle as he's being thrown around.\n\nJack Milsom prepares ahead of a bull ride. (ABC News: Sam Parry)\n\nNearby, other competitors are tying and tightening various intricate knots in the bull-ropes which will bind them to the huge animals they'll be riding in just minutes.\n\nCowboys rely on ropes like these to secure them to the bulls they ride at the rodeo. (ABC News: Sam Parry)\n\nA cowboy preparing for an event. (ABC News: Sam Parry)\n\nIt's a struggle to spot anyone not wearing a wide-brimmed hat of one variety or another.\n\nNot many look like the felt type you might associate with The Man from Snowy River. Instead, most Top End cowboys and cowgirls prefer hats made of thatched straw.\n\nThe wide-brimmed hats worn by Top End cowboys are about utility as well as style. (ABC News: Sam Parry)\n\n\"Wide-brimmed hats, they go back a long way for cattlemen. It's what drovers wore,\" Jack explains.\n\n\"You see cattlemen with bigger brims and felt hats, that's actually a tool when you're out working with cattle on horseback.\n\n\"You use the top of your hat. You flip it upside-down and give your horse a drink, and also it keeps you safe from the sun.\"\n\nCowboys at the rodeo say Top End station work is hard but rewarding. (ABC News: Sam Parry)\n\nA cowboy herding rodeo bulls ahead of an event. (ABC News: Sam Parry)\n\nAs well as a good hat, Jack says durable denim is essential for a cowboy, because when \"you're playing with cattle in the yard, you get hooked, they [your jeans] get ripped\".\n\nAnd while a big belt buckle might seem like a cowboy staple, it's not something just anyone can wear.\n\n\"You do see a lot of people trying to act like they've got a buckle and stuff but, see, some of the cowboys around here, they've actually earned it, they've done the hard yards,\" Jack says.\n\nThis belt buckle recognises a rodeo championship win. (ABC News: Sam Parry)\n\nChampion bull rider Sam Woodall has competed in the United States and Brazil. (ABC News: Sam Parry)\n\nThe moral code of the cowboy\n\nMost rodeo spectators from Darwin and surrounds are wearing what New South Wales competitor Dean Wallace sees as a less authentic interpretation of cowboy western wear.\n\nWhile many spectators will stay at the arena into the early hours of the morning for an after-party, Dean says most of his fellow competitors will \"go back to their utes for a sleep\" or a quiet beer.\n\nDean Wallace says there's much more to being a cowboy than the clothes. (ABC News: Sam Parry)\n\n\"I think the ones that highlight a bad view of cowboy culture are the ones that dress up for tonight, get on the piss, try to fight someone and get carried out,\" he says.\n\n\"You see some people who dress up just for tonight and they've never actually seen a paddock, stepped in s*** or touched a sheep.\"\n\nA bull in a stall bordering the rodeo arena. (ABC News: Sam Parry)\n\nDean isn't keen on the suggestion cowboys are proud of their differences from \"city slickers\", and says rather than being concerned about their identity, most cowboys just don't care.\n\n\"There are moral standards for a cowboy, and you shouldn't have to think about what those are,\" he declares.\n\nBut he explains that the cowboy identity can't simply be adopted by anyone.\n\nCowboys have a culture all their own. (ABC News: Sam Parry)\n\n\"It's just being tough enough to handle whatever gets thrown at you, brave enough to do whatever you have to do and looking after those around you. I guess that's my view of a cowboy,\" he says.\n\nWhile Dean says the cowboy identity usually comes with growing up in a pastoral family, he believes it is not impossible to become one — but it takes hard work.\n\nDean Wallace says it takes a certain toughness to be a cowboy. (ABC News: Sam Parry)\n\n\"I'm all for anyone that wants to get into it,\" he says.\n\n\"If you put your hat on, put your boots on and you're willing to work for it, that's all there is to it.\n\n\"I'm telling you, if you go from a lifestyle where you're not used to it and you try to get into it, you'll quickly figure if you're a cowboy or not.\"\n\nAs the final bull is taken back to the yards and the night-time entertainment starts warming up, as if on cue, Dean and his fellow bull riders begin to pack up and head to their utes, leaving the crowd of partygoers behind them in the settling dust.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/teacup-mini-pigs-buyers-shocked-when-fully-grown/105224426",
    "title": "'Teacup' pigs weighing up to 300kg surrendered by dismayed buyers",
    "publish_date": "Fri, 13 Jun 2025 22:55:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Q: What do \"teacup\" pigs and unicorns have in common?\n\nA: Neither exist, even if we really want them to.\n\n\n\nTeacup pigs are promoted as perfect for kids and suburban homes.\n\n\n\nBut these little pets can become a big problem, as Tayla Anderson knows all too well.\n\nMs Anderson admits she may have naively bought into the mini-pig fallacy when her mother surprised her with two piglets.\n\nShe said they were told the pigs would stay miniature for their whole lives.\n\n\"We never owned pigs before but we assumed we were being told the truth … we didn't know any better,\" Ms Anderson said.\n\nTayla Anderson loved her pigs but was not prepared for how big they grew. (Supplied: Tayla Anderson)\n\n\"They grew to about thigh height, and I could almost ride them like a horse.\"\n\nMs Anderson said it was lucky she lived on a small farm in Victoria at the time and was able to give her bigger-than-expected pigs a home.\n\n\"I've been to a lot of properties and I've never seen a small pig,\" she said.\n\nTayla says she was lucky to have the room when they reached full size. (Supplied: Tayla Anderson)\n\nUniversity of Queensland pig health expert Dakota Leschke, who works with large animals on farms and sanctuaries, said he regularly heard from owners who thought they had bought a miniature pig.\n\n\"Mini pigs are an umbrella term and they are generally smaller than a commercial pig,\" Dr Leschke said.\n\n\"The smallest pig I have ever seen is 100 kilograms, but I have seen mini pigs up to 250kg.\n\n\"Teacup pigs are more of a myth, not everything is truthful online.\"\n\nMore to love\n\nKathy says Belly was sold as a miniature pig but is now close to 200kg. (ABC New England North West: James Paras)\n\nRSPCA senior manager of animal care Georgie Casper said miniature pigs were not a recognised breed in Australia.\n\n\"A commercial pig, for example, will reach about 250-300kg, but that won't happen for four to five years,\" she said.\n\nKathy Anderson runs a sanctuary for pigs. (ABC New England North West: James Paras)\n\nKathy Anderson, who is not related to Tayla, has more than 120 pigs on her rural property, just outside Tenterfield in North West NSW.\n\nThe Contented Pig Inn has become a haven for pigs of all shapes and sizes.\n\nSome arrived sick or injured, others had nowhere else to go.\n\nMs Anderson said some owners surrendered their pets after what they thought was a tiny pig turned into a 300kg hog.\n\n\"We have had incidences of kids who wanted pigs, they're sold a piglet and then they are surrendered because the parents freaked out,\" she said.\n\n\"I don't know what the thought process is. There are breeds of dogs like little terriers that stay small, but that's not pigs.\"\n\n'They weren't miniature pigs'\n\nBelly was sold as a mini pig but ended up at Ms Anderson's property after its owners realised they were drastically unprepared.\n\n\"She was so skeletal, she was in pain, so thin,\" she said.\n\nBelly's original owners kept her on the diet recommended to them by a breeder. (Supplied: Kathy Anderson)\n\n\"Belly was kept on an odd diet to keep her small, probably chicken feed.\n\n\"Breeders do that to keep the pigs small.\"\n\nBelly now weighs in at 200kg.\n\nSouth Australian pig breeders Rachel and Joel Redford said they were approached regularly by buyers looking for teacup pigs.\n\n\"Teacup pigs are completely false, the term shouldn't be used,\" Ms Redford said.\n\n\" We constantly turn people away who want to have a pig for their apartment. \"\n\nDespite the breed not being recognised in Australia, the Redfords do advertise miniature pigs for sale.\n\nMs Redford said 15to 20 years of breeding had allowed them to produce a pig that might only grow to weigh 70kg.\n\n\"These pigs have been chosen for their characteristics,\" she said.\n\n\"Some of them are 30-centimetres tall.\n\n\"We don't feel there are many reputable local breeders.\"\n\nThe RSPCA says some breeds of pig can grow as large as 300kg. (ABC New England North West: James Paras)\n\nResponsible ownership\n\nRSPCA NSW said its inspector had not reported any major issues from pig owners recently.\n\nBut Ms Casper said misinformation about pigs was common.\n\n\"You need to understand what their needs are,\" she said.\n\n\"They are very sensitive, intelligent and curious animals.\n\n\"If you're interested in owning a pig, you need to be able to provide them with adequate nutrition, shelter, transportation [and] veterinary care.\"\n\nAccording to the NSW DPI, keeping pigs — including free-range pigs — is classified as intensive livestock agriculture and is prohibited in some land-use zones.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/177-nations-of-tasmania-mark-thomson-andrew-wilson/105343826",
    "title": "There are 177 nationalities in Tasmania. This duo wants to talk to them all",
    "publish_date": "Fri, 13 Jun 2025 22:54:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Podcaster Mark Thomson has put a call out to anyone from Belarus who is living in Tasmania to contact him.\n\nAnyone from El Salvador, Zambia, and Laos too.\n\nIt may seem a novel request, but along with friend and photographer Andrew Wilson, he's set an ambitious goal to speak to and photograph at least one person from the 177 countries represented in Tasmania.\n\n\"I know there's about 20 Jamaicans in Tasmania somewhere, but I don't know where they are, so I'd love it to hear from someone from Jamaica\" Thomson said.\n\nMark Thomson says the stories are a great source of connection to history and the community. (ABC News: Luke Bowden)\n\nAfter losing his job in 2020 due to the COVID-19 pandemic, and unsure when it would end, Thomson set his sights on a long-term project.\n\n\"A tip I got about podcasts was that you need to find something that's repeatable, so I was thinking of doing something relating to migrants and cultural diversity,\" he said.\n\n\" It popped into my head, 'has anyone tried to interview one person from all these nationalities?' and it occurred that might be an interesting way to delve into those kinds of stories in an original way. \"\n\nThe Tasmanian government's Multicultural Access Point (MAP) listed 177 nations as being represented on the island, and so began Thomson's journey.\n\nIt started as a podcast — 177 Nations of Tasmania — but now incorporates Mr Wilson's portraits in an exhibition currently on display in the State Library in Hobart.\n\nHe's captured some amazing stories, such as Nick Anagnostis', whose parents put him on a boat by himself from Lesbos, Greece, aged just 15 years old, to escape civil unrest.\n\nA portrait of Nick Anagnostis taken for the 177 Nations project. (Supplied: Andrew Wilson)\n\nMr Anagnostis arrived in Melbourne, managing to make his way to Sydney by train without knowing a word of English.\n\n'Luck and patience'\n\nFor Thomson, some of the stories have left a significant emotional impact.\n\n\"I was interviewing this elderly Hungarian lady, she's 99 now, so she was at high school during the Nazi occupation of Austria,\" he said.\n\n\" She told me that the main language was Hungarian, then suddenly one day that had changed to German. \"\n\nAnna Kecksemeti, from Hungary, photographed for the 177 Nations project. (Picture: Andrew Wilson)\n\nBut the story that stayed with Thomson most was hearing about her Jewish friend's father, who she saw taken away by German soldiers when she was just a child.\n\n\"It really stuck with me, and it makes you realise that those personal stories can actually be so powerful, more powerful than if you could have told me about the history of Jews in Europe at the time,\" he said.\n\n\" It makes you realise that there are people in our community that have really experienced some really major historical events which have driven them here. \"\n\nThe 177 Nations exhibition is currently on display at the state library in Hobart. (ABC News: Luke Bowden)\n\nFor Thomson, finding all 177 nationalities was more about having a target than achieving the goal.\n\nHowever, he's slowly getting closer, with 115 nationalities represented in the project so far.\n\n\"I've got to the stage where it's actually seeming a bit more realistic. I didn't expect to get to 115, so I think, 'well, why not?'\" he said.\n\n\"Hopefully having this public exhibition will give it a bit more momentum and a few more people will approach me.\n\n\" But realistically, a lot of those remaining ones, there's just going to be one or two people so there's going to be a bit of luck and patience involved. \"\n\nHighlighting diversity\n\nAndrew Wilson was recruited to take portraits of the people who were interviewed, to expand the scope of the project. (ABC News: Luke Bowden)\n\nIn 2024, a discussion with photographer Wilson set the wheels in motion for the project's scope to be expanded beyond a podcast.\n\nCWA branch back from the dead after migrant outreach Photo shows Four women in red aprons laugh in a kitchen while holding a spoon fulls of chocolate cake from a green mug. People can have set ideas about what the Country Women's Association looks like, and who gets to be involved. In southern Tasmania, this reforged branch is trying to change that.\n\n\"As a portrait photographer, I thought that would be a really amazing series to do of the people he's interviewing,\" Wilson said.\n\nAfter securing a grant through Hobart City Council, the pair were able to realise their vision.\n\nHelping to highlight Tasmania's diversity is why Wilson was drawn to the project.\n\n\"Tasmania is a small island and we're remote from lots of things in the world, but so many people from all around the world have chosen to come live here,\" he said.\n\n\"They've brought their culture to us and that's not something we should be afraid of, that's something we are embracing and it's wonderful.\n\n\"And as a visual storyteller, I was just as much interested in the backgrounds of the people as photographing them as well.\"\n\nMr Wilson says embracing cultures from around the world is a \"wonderful\" thing. (ABC News: Luke Bowden)\n\nFor Andrew, the creative process begins with asking who they are, where they are from and what emotional state brought them to Tasmania.\n\n\"I take a photo that hopefully captures that moment for them,\" Wilson said.\n\n\"Some people have escaped persecution and it's been quite an emotional conversation because they've actually had to leave their whole family and move here for love or for work.\n\n\"And now their parents might be getting older and they have this internal conflict of being here and not being able to care for their parents, who are aging on the other side of the world.\"\n\nCultural items tell a story\n\nMarzi Riazi, from Iran, photographed for the 177 Nations project. (Supplied: Andrew Wilson)\n\nThe subjects of each shoot are asked to wear or bring something relevant to their culture.\n\n\"It's been quite fascinating to see the different outfits and the different relics or objects that they've brought in that are significant to them in some way,\" Wilson said.\n\n\"Marzi from Iran wore this incredible ornate silk face scarf and a crown with all this beading and ornate jewellery all over her hands.\n\n\" I had to put up like eight photos of her because each told a different story. \"\n\nJoanna Sun posing for her portrait as part of the 177 Nations of Tasmania project. (ABC News: Luke Bowden)\n\nJoanna Sun was sitting for her portrait when the ABC visited. Ms Sun was born in Singapore and has Peranakan heritage.\n\nIn her portrait, she holds an ornately decorated teapot.\n\nJoanna Sun was born in Singapore, and hails from Peranakan heritage. (Supplied: Andrew Wilson)\n\n\"The design of this teapot is very specific,\" Ms Sun said.\n\n\"On a trip to Malacca [Malaysia], which is where my maternal grandmother's from, my parents bought this teapot, lugged it all the way back to Singapore and popped it in the luggage onto the plane to Tassie.\n\n\"If you look at the motifs and the phoenix it's specific to the Chinese culture but the colours — the pink and the teal and the use of peonies as well — you can only find that within our Peranakan culture\".\n\nJoanna Sun says the teapot was taken from Singapore to Tasmania by her parents. (Supplied: Andrew Wilson)\n\nMs Sun moved to Tasmania in 2007 to live with her now-husband Simon, studying a TAFE course in nursing that introduced her to the aged care sector, an industry she continues to work in.\n\n\"I think that's where Tassie has helped me grow in terms of my career and opportunities as well … I've had the opportunity to actually do a PhD, which I probably wouldn't have had [the opportunity] in Singapore.\"\n\nWhen the 177 Nations of Tasmania project is complete, Libraries Tasmania will acquire and archive it as a snapshot in time of Tasmania's history — an important aspect of the project for Ms Sun.\n\nThe 177 Nations exhibition is on display on level 2 of the State Library of Tasmania. (ABC News: Luke Bowden)\n\n\"Being in a different country and now having kids — my husband's Tasmanian, so my kids are Tassie boys as well,\" she said.\n\n\"It's not just a project for me but for my boys and their children as well into the future\".\n\nNationalities not yet captured in the project\n\nMark Thomson is interested in talking to people who came to Tasmania preferably as adults, or older teens, and who have now settled permanently in the state.\n\nEUROPE\n\nAlbania\n\nBelarus\n\nJersey\n\nIceland\n\nKosovo\n\nMoldova\n\nMontenegro\n\nWales\n\nASIA\n\nBrunei\n\nGeorgia\n\nKuwait\n\nLaos\n\nMongolia\n\nTajikistan\n\nYemen\n\nAFRICA\n\nAlgeria\n\nBotswana\n\nBurkina Faso\n\nBurundi\n\nCameroon\n\nGambia\n\nGuinea\n\nLiberia\n\nNamibia\n\nSomalia\n\nZambia\n\nAMERICAS\n\nCosta Rica\n\nEl Salvador\n\nJamaica\n\nTrinidad and Tobago\n\nUruguay\n\n(Mark believes there may also be people from the Bahamas and St Lucia living in Tasmania who could be part of the project)\n\nOCEANIA\n\nKiribati\n\nSolomon Islands\n\nTuvalu\n\nVanuatu\n\nNew Zealand (someone with an unusual story)\n\nThe 177 Nations of Tasmania exhibition is on display at the State Library of Tasmania. Anyone who wants to participate can visit the 177 Nations of Tasmania Facebook page.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/werrimull-football-club-boycott-over-alleged-sexual-assault/105386050",
    "title": "Female footballers boycott major game over alleged sexual assault",
    "publish_date": "Fri, 13 Jun 2025 22:46:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "Female footballers in a north-west Victorian league have boycotted a major event in protest of their club's handling of a sexual assault allegation.\n\nThe Millewa Centenary Day on June 7 at Lake Cullulleraine drew a crowd of hundreds from across the region..\n\nBut notably absent from the football and netball showcase were the majority of the Werrimull Football Netball Club's women's football team, who refused to play.\n\nWerrimull's Jemma Jo Johnson is calling for more action to be taken by clubs to protect their players. (Supplied: Jemma Johnson)\n\nWerrimull FNC player Jemma Jo Johnson, who uses the pronouns they/them, said the boycott was a response to the club's decision not to suspend a male player under investigation by AFL Victoria following a sexual assault allegation.\n\nJohnson said eight women from the Magpies squad had chosen to quit playing for the club as a result.\n\n\"Our safe place has been absolutely just stripped from us,\" they said.\n\n\"It is time — they [Werrimull Football Netball Club] really have a chance to not just protect us and look after us, but show the rest of the league that the people in power aren't going to allow the females to feel unsafe.\"\n\nThe ABC understands the allegation was reported to the club and AFL Victoria but not to police.\n\nWerrimull Football Netball Club president Dale Ramsey confirmed AFL Victoria was investigating an incident.\n\nIn a statement, the club said it was \"deeply concerned and saddened by recent allegations\".\n\n\"We take these allegations extremely seriously and are committed to fostering a safe, respectful, welcoming and inclusive environment for all players, members and supporters — both on and off the field,\" the statement said.\n\nLack of guidelines\n\nThe protest has highlighted what University of Canberra sport integrity and ethics associate professor Catherine Ordway said was a grey area for AFL clubs.\n\nCatherine Ordway says clubs must decide in advance what to do if a player faces serious allegations. (ABC News: Donal Sheil)\n\nShe said each club should decide in advance what to do in the event of a player facing serious allegations.\n\n\"It's always better, in the calm time when there hasn't been an incident, to sit down and say 'What do we stand for as a club?'\" Dr Ordway said.\n\n\"If we care about keeping women and girls safe, if we care about keeping young people safe, then let's have some rules and some guidelines so that if this comes up in future then we know how to act.\"\n\nShe said a one-size-fits-all rule was difficult to implement.\n\n\"There are always going to be hard cases where a blanket rule would be completely inappropriate and unfair because it might depend on the age of the [people] involved,\" Dr Ordway said.\n\nThe ABC understands Werrimull FNC does not have specific guidelines relating to players under active AFL integrity or police investigations.\n\n'Not just our club'\n\nJohnson said the club had lost key members due to the way it had handled the case.\n\nWerrimull footballer Jemma Jo Johnson is dismayed \"that one person is prioritised over a whole team\". (Supplied: Barb Kelly)\n\n\"We've actually lost a couple of really, really valuable and much-loved people in our club,\" they said.\n\n\"That's the part that we feel the most heartbroken about, I think, is that one person is prioritised over a whole team that has put nothing but love and energy into the club.\n\n\"There is a bigger issue here across the league, not just in our club.\"\n\nIn a statement sent out to clubs across north-west Victoria, Millewa Football Netball League (MFNL) chairperson Emily Harlock-Knights said the league \"unequivocally condemns any form of behaviour that is abusive, disrespectful, or unbecoming — whether on or off the field\".\n\nBut she said the league and clubs were not equipped to investigate serious incidents.\n\n\"It is not the role of the MFNL or our clubs to act as judge, jury, or executioner,\" Ms Harlock-Knights said.\n\n\" We strongly encourage anyone who experiences or witnesses this type of behaviour to report it to Victoria Police or relevant authorities who are properly equipped to investigate and manage these incidents in a lawful and fair manner. \"\n\nAFL Victoria has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/act-orroral-valley-fire-coronial-inquest-mild-findings-value/105415774",
    "title": "Though not scathing, the inquiry into this devastating fire was needed",
    "publish_date": "Fri, 13 Jun 2025 22:14:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "I'd never heard of Bumbalong.\n\nBut during the Black Summer bushfires of 2020, this small New South Wales community between Canberra and Bredbo hit the news when a bushfire swept through, destroying homes, farms and livestock in a single day.\n\nI watched the flames myself, from Bredbo, as they crept quickly along the hills, sending embers ahead over great distances, igniting patches of dry grass in the surrounding paddocks.\n\nThe residents who fought the blaze that day would have had little sense of the greater battle still being fought five years on.\n\nThe coronial inquiry findings acknowledged the hardship of Bumbalong residents. (Source: Getty Images)\n\nSome are still re-building after years living in caravans on their land, without even basic facilities like a flushing toilet.\n\nThe findings of an inquiry into the fire by the ACT's Chief Coroner Lorraine Walker brought down yesterday included an apology.\n\n\"This matter has taken far too long to be finalised,\" Chief Coroner Walker said.\n\n\"I offer my apologies to those affected by the fire and its aftermath.\"\n\nIt was the first time the hardship suffered by the residents had been officially acknowledged.\n\nFire started by Defence helicopter\n\nThe Orroral Valley fire burned for five weeks, destroying 80 per cent of the ACT's Namadgi National Park. (Supplied: Department of Defence)\n\nThis bushfire was no act of nature, it was started by an army helicopter across the border in the ACT.\n\nIt's now well known the aircraft made an unplanned toilet stop on a hill in the Namadgi National Park at the head of the Orroral Valley.\n\nA hot searchlight underneath the helicopter ignited the dry grass, and the pilot hastily took off.\n\nThe crew said they were focused on safety because they thought the helicopter was damaged.\n\nIt would be at least 35 minutes after the fire started before Defence told the local firefighting authorities of the exact location of the blaze.\n\nThe focus of the inquiry was what happened in those minutes.\n\nThere had been other calls for an inquiry into the fire.\n\nThe fire threatened Canberra's southern suburbs as it burned for five weeks. (Supplied: Jacob Ross)\n\nIt not only caused serious damage to Bumbalong, it also burned through 80 per cent of Namadgi National Park, and even threatened Canberra's southern suburbs, as it burned for five weeks.\n\nAt the time, Chief Minister Andrew Barr said he didn't want a \"witch hunt\", so the ACT's Chief Coroner set up her own inquiry.\n\nIn the end, yesterday's findings were mild.\n\nShe found there had been an \"error of judgement\", finding also it was not plausible that none of the crew thought to tell local authorities about the fire immediately.\n\nBut there was still great value in the inquiry.\n\nInquiry facilitated transparency\n\nThe fire began when the helicopter landed for a break and its searchlight ignited the grass. (Supplied: Department of Defence)\n\nThe identities of the crew were suppressed, but they were compelled to give evidence.\n\nThis produced a clear picture of how the events unfolded, including the conversations between the crew members which were recorded and played to the court.\n\nThe inquiry facilitated a transparency that hadn't been there before.\n\nBefore that, events had come to light slowly after questions from the ABC, revealing the helicopter crew never called in the fire during its flight back to Canberra Airport.\n\nThis photograph was taken from the Defence helicopter that began the Orroral Valley fire, just moments after it was accidentally set. (Supplied: Department of Defence)\n\nLater, pictures taken by the crew emerged.\n\nThe inquiry also revealed details, including that it was more than nine hours before the Emergency Services Agency Commissioner Georgina Whelan was told a Defence chopper was the cause of the fire.\n\nInterestingly the Chief Coroner found the delay in reporting the fire had little impact on the response by local authorities.\n\nThe smoke had already been spotted from a fire tower within minutes, and firefighters called in.\n\nIn her finding Chief Coroner Lorraine Walker said reporting the fire earlier would have been beneficial. (ABC News: Tamara Penniket)\n\nBut as Chief Coroner Walker said, reporting the fire earlier would have been beneficial.\n\n\"Failure to report the fire earlier, and failure of the Commonwealth to accept the overarching need to do so, does raise an issue of public safety,\" Chief Coroner Walker said.\n\nThe Bumbalong residents were relieved to hear the Coroner's findings, saying at least someone has been found responsible.\n\nThey are hoping the findings will help in their next round, a battle in the Civil courts with the Commonwealth over compensation for their losses.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/dark-places-and-dreams-australia-s-swimmers-are-growing-up/105416702",
    "title": "Dark places and dreams: Australia's swimmers are growing up",
    "publish_date": "Fri, 13 Jun 2025 22:04:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Swimming careers don't last that long. Two Olympics is very good, three is exceptional.\n\nThe class of 2021 from the Tokyo Games are now some of Australia's all-time greats: Kaylee McKeown, Ariarne Titmus, Mollie O'Callaghan, Zac Stubblety-Cook.\n\nComing out of Paris, the quartet and their contemporaries are older and somewhat wiser.\n\nSome, like Titmus, are taking a year off, while those swimming on are working out what it is exactly they want from the sport.\n\nMcKeown off to world titles despite DQ Photo shows An Australian swimmer arches her back as she dives into the water in a backstroke race. Kaylee McKeown beat rival Mollie O'Callaghan in the race of the night at the Australian Swimming Trials, but she acknowledges she is still not at her best after struggling since the Paris Olympics.\n\nThe instinctive, youthful and very fast swimmers of Tokyo have grown up in front of our eyes and even though they're only in their early to mid-20s, they've taken on some of the baggage that comes with age: doubts and questions creep in.\n\nStubblety-Cook won gold in the men's 200m breaststroke in Tokyo, he won a World Championship and set a world record before following it up with silver in Paris.\n\n\"The last eight years have very much been [as a] younger athlete, really hungry and really one after the other,\" Stubblety-Cook said.\n\n\"Last year I had a lot of time off, and a lot of time to reflect and see where I was at, and make sure I really wanted to commit to the next four years.\n\n\"The way Mel (Marshall, his coach) put it to me the other day, it was like you go from being capable but mentally not knowing how you did it, and then you swap over at some point and all of a sudden you realise, 'Oh, shit, how do I do this?'\" he said.\n\nStubblety-Cook has another chance at a World Championship in Singapore next month after winning the 200m breaststroke at the Australian Selection Trials in Adelaide.\n\n\"Mel and I both believe my best time is still in me, so I'm still chasing that, and I think that's the goal over the next three years, and just to get better and better each year.\"\n\nHe said he was excited at the prospect of swimming at the World Championships.\n\n\"Everyone's keeping their cards close to their chests, and I know a lot of people have a lot of time off and down time,\" Stubblety-Cook said.\n\n\"I actually think it will come down to a race, I don't think it will be all that fast,\" he said.\n\nLike so many of the Paris veterans, Stubblety-Cook said he'd had a sharp comedown after the Games.\n\n\"I mean the 'Olympic Blues' is always like something to be mindful of, I think people underestimate, especially first time, what it is.\n\nParalympic veteran Rohan Crothers said he still suffers from the post-Paralympic comedown despite competing at the top level for over a decade.\n\n\"You spend your entire life training and preparing for this one competition and then it's over in thirty seconds, or over in a minute,\" Crothers said.\n\n\"And you get back home and everyone's happy to see you and they all support you, but then two weeks later, life goes on and that can be really difficult to cope with as an athlete.\n\n\"But I think one of the great things about sport is that it's not just about the competition, it is also the community,\" Crothers said.\n\nO'Callaghan opens up on the insular life of elite swimmers Photo shows Female swimmer restingon lane ropes after winning a race, goggles on forehead, looking at timing screen Mollie O'Callaghan has won the women's 200m freestyle at the Australian Swimming Trials, but was disappointed to be well off her personal best time.\n\nMollie O'Callaghan has five Olympic gold medals at just 21. But for most of those years she's been head down, swimming up and down a pool — now she's lifting her head, but it hasn't been easy.\n\nO'Callaghan said she'd been to a dark place this year but had learnt so much about herself.\n\nShe wrapped up the women's 100m freestyle final at the Australian Selection Trials to book another spot for the World Championships in Singapore next month after winning the 200m freestyle earlier in the week.\n\nShe won the 100m freestyle World Championship in 2022 and 2023.\n\nHer time of 52.87 seconds was her fastest time of the year, but she said she wasn't concerned with times.\n\n\"Dean (Boxall, her coach) and I've spoken and it's just about racing and enjoying it,\" O'Callaghan said.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nO'Callaghan dislocated her kneecap in January, which meant she was on a modified program for the first part of the year.\n\nShe has a hyper-mobility which makes her susceptible to dislocations.\n\n\"You can't really predict injury. You can't predict sickness. You can't predict any of that. You can try and prevent it all you want, but sometimes those things just happen,\" she said.\n\n\"And look, there's a lot of tears, but I think in the long run, I've learned so much about myself and I wouldn't change a thing.\n\n\"Moments like this make it even more special.\n\n\"You have to step into that dark place to get the best out of yourself.\n\n\"That's what sports is about. It's putting yourself in that hole to see how mentally strong you are, and I've definitely done that this season.\n\n\"I think this year, originally the plan was just to have fun with it, and I think soak in and take everything that we normally don't get to do while we're so focused in on an Olympic cycle.\n\nPallister breaks 800m record Photo shows GettyImages-2219782218 Lani Pallister claims Ariarne Titmus' 800m women's freestyle record in Adelaide, before hugging swimming champion Dawn Fraser poolside.\n\nTitmus talks a lot about wanting to have fun and explained what that meant to her.\n\n\"Obviously it's like the friendships, I think getting to travel, getting, getting to do what my dreams are,\" she said.\n\n\"Getting the opportunity to go around the world, to see new things, trying my hardest.\n\n\"But I think fun at the end of the day is hopping in the pool knowing that I gave it my all and got the best out of myself.\"\n\nSam Short is still just 21, but already he's an Olympic veteran and a former World Champion in the 400m freestyle.\n\nOn Friday, he added the 1,500m freestyle title to the races he's previously won at these trials: the 400m and 800m.\n\nFor Short, fun is racing and living on the edge of success and failure.\n\n\"It's a very brutal sport — one thing wrong and everyone will see it,\" he said.\n\n\"So much training comes down to fine margins and it is hard, but it's why I love the sport — you know you stuff up one bit and you're going to pay the price,\" Short said.\n\nBenjamin Goedemans was second, just half a second behind Short and will make his first national team at the World Championships.\n\nIn other results, Ella Ramsay won her second race of the trials and booked another ticket for Singapore by winning the women's 200m breaststroke final after previously winning the 200m individual medley and coming second in the 100m breaststroke.\n\nSwimming Australia has named a team of 25 for the World Para Swimming Championships in September and also in Singapore.\n\nIt's led by some of the biggest names in the sport including Paris flag-bearer, Brendan Hall, Alexa Leary, Benjamin Hance, Tim Hodge and Crothers.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nCrothers said he was still motivated to continue swimming for the greater good as well as personal success.\n\n\"Why I swim, why I still compete is for that little two minute golden window after a race where I get a platform and an opportunity to inspire young kids with a disability to get involved with the community, get involved with sport,\" he said.\n\n\"I didn't think I was going to be anyone or achieve anything in my life until I saw another swimmer race for about two-and-a-half minutes at the Beijing Paralympics.\n\n\"And that has literally changed my entire life — it's given me so many incredible opportunities.\n\n\"So, although it's a small moment for me as an athlete, I place so much value and absolutely treasure the impact that my sporting achievements and my sporting ability can have on Australia and the world-wide community,\" Crothers said.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/brian-wilson-musician-humble-fan-icon/105391698",
    "title": "Our beloved musicians hold the secrets to us — keep them close",
    "publish_date": "Fri, 13 Jun 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The troubled and sometimes estranged daughter of the musical genius Brian Wilson famously described her young life waking each morning to the same song being played by her father at full volume. Every single day.\n\nCarnie Wilson, herself an accomplished musician, said she would wake to the first heartbeat-like thumps of the song echoing through the house: DUM. Da-da da DUM. A familiar wall of sound would roll through the drumbeat, then the percussion would hit, and then the yearning lyrics to the Ronettes' smash hit, Be My Baby, would soar once again.\n\nThe night we met I knew I/needed you so\n\nBrian Wilson, the founder of the Beach Boys, often described the 1963 classic as the greatest song he knew. \"I felt like I wanted to try to do something as good as that record, and I never did. I've never stopped trying. It's the greatest record ever produced, no doubt.\"\n\nBrian Wilson, visionary behind the Beach Boys, dies aged 82 Photo shows A man in a pink shirt smiling Brian Wilson, the visionary and fragile leader of the Beach Boys and one of the world's most influential recording artists, has died aged 82.\n\nListening to one great musician stand in awe of another's piece of music, sounding humble and joyous just like any other fan, is a wonderfully intimate thing. When you realise that Bruce Springsteen or Florence Welch are buying the same records you buy and are also standing in their living room with the volume up wondering, how do they do that, you understand how connected you all are as music fans. How you all attend the same church and sing the same hymns.\n\nIt is a remarkable leveller when a great musician declares themselves simply another fan. Brian Wilson's enduring love of that gorgeous piece of pop makes him a kid singing at the top of his voice in the car, just like us.\n\nThe best kind of musical rivalry\n\nIn the wake of Brian Wilson's death this week at the age of 82, generations of musicians have spoken about how much they loved his songs too, about how meaningful they have been in their lives as fans and musicians, and there is one song in particular that they keep coming back to.\n\nShall I try to list them all, the artists who say that the Beach Boys, the album Pet Sounds, and that one song have been some of the most important songs in their lives? Patti Smith, Bruno Mars, Iggy Pop, Elton John, Paul Simon, Janelle Monae, Carole King, Leonard Bernstein, Smokey Robinson, the Gibb brothers, The Eagles… I'll have to stop there, but will finish of course with John Lennon and Paul McCartney, who were unabashed fans.\n\nThe two bands inspired each other and competed with each other in their early days. The Beatles' Rubber Soul spurred Brian to write Pet Sounds, which in turn sparked Sergeant Peppers: the best kind of rivalry when fans get the benefits.\n\nBrian Wilson was not only a legendary musician but a fan of The Ronettes, calling their song Be My Baby the greatest ever produced. (Reuters: Lucas Jackson )\n\nBut what of this one song — the one song that all these musicians and others reference when they say it's one of the greatest ever written?\n\nThe night Brian died, the singer-songwriter Sting was on tour in Germany, and this is how he commemorated him.\n\nLoading Instagram content\n\nThe simple purity of God Only Knows, and the glorious harmonies of its recorded version have become a touchstone of modern music, and a shared password of musical passion: if someone you like likes this song too, then you're going to be just fine.\n\nPaul McCartney wrote on Instagram this week: \"Brian had that mysterious sense of musical genius that made his songs so achingly special. The notes he heard in his head and passed to us were simple and brilliant at the same time.\"\n\nPlaying their songs to keep them close\n\nI've written before about how our most beloved musicians close a door on our early, formative lives as music fans when they die. We get to keep their music, but our connection to that thrilled, younger self gets ever more distant, and they seem to take an understanding of us with them. They have the secret of us because of our love for them.\n\nFor many this week Brian was that idol, and I know when another goes, we all privately review the list of those who remain and dread the inevitable news of their loss one day.\n\nI've checked my list. For now, they are all here, although so many are missing. But I can still play their songs to keep them close.\n\nThis weekend, read about the Melbourne eccentric who kept the people and faces of his city alive with a photo booth that nobody thought was anything more than an amusement. The persistence of memory, again.\n\nHave a safe and happy weekend, and here is just a handful of great artists who revere that Brian Wilson song, all in perfect harmony, to celebrate the BBC's enduring love of music, just like ours. Go well.\n\nLoading YouTube content\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/small-business-pressure-from-regulation-online-shopping/105399260",
    "title": "Surging $69b online shopping market puts small family business legacies at risk",
    "publish_date": "Fri, 13 Jun 2025 21:50:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Noels Sens has been crafting necklaces and rings his whole life, but the Bendigo jeweller is planning to call time on the family business.\n\nHis father migrated to Australia in 1954 from the Netherlands and started his own jewellery and watchmaking business in central Bendigo.\n\nBut now the family legacy is winding up.\n\n\"I've got two kids but they don't want to be jewellers,\" he said.\n\n\"You can't do things forever and there is no succession with family, which is kind of sad, but that's just how life goes.\"\n\nNoel Sens is winding up the family business. (ABC News: Emile Pavlich)\n\nMr Sens said the number of jewellery and watchmakers in Bendigo had plummeted while larger chain stores now dominated the market offering \"cheaper stuff\".\n\n\"[The number of] people actually making stuff and repairing stuff is dwindling,\" he said.\n\n\"It's a trade that's dying.\"\n\nMr Sens said he wanted to maintain the reputation of his business and decided not to sell. (ABC News: Emile Pavlich)\n\nIn the coastal town of Warrnambool, in Victoria's south west, Rauerts Shoes is another family business that is reluctantly closing the doors.\n\nFor two years owner Peter Rauerts has tried to sell the business, set up by his late father in 1946, but there was \"very little interest\" from prospective buyers.\n\n\"We were willing to negotiate. Talk turkey, as you say. But no-one's come forward [and] made us an offer,\" Mr Rauerts said.\n\nRauerts Shoes owner Peter Rauerts is closing the family business after attempts to sell it for two years failed. (ABC South West Victoria: Jean Bell)\n\nHe said he was ready to retire, his son had declined to take on the family business, and costs had just kept rising.\n\n\"It costs $10,000 a week just to open the doors. You think you're doing alright and then you get lumped with all these costs,\" he said.\n\nAnother Warrnambool institution, Dale Cleves Music Shop, closed in April after 40 years of doing business in the town.\n\nStore manager of 32 years, Ron Philp, said the current climate was tough for small retailers.\n\n\"Financially it doesn't add up [to keep going],\" he said.\n\nPeter Rauerts continued the family legacy of his father Ron (pictured) by running the shoe business. (ABC South West Victoria: Jean Bell)\n\nWhile neither of these Warrnambool businesses were closing due to financial trouble, the Australian Retailers Association [ARA] said insolvencies nationally had risen by almost 20 per cent in one year to March 2025.\n\nOnline sales trend accelerates\n\nThe Australian Retailers Association said the retail landscape had been disrupted by \"ultra-low-cost operators\".\n\n\"Temu and Shein [global online businesses] are growing at pace in this market, operating outside the legal commitments of local homegrown retailers in areas such as tax, employment and sustainability,\" CEO Chris Rodwell said.\n\nRegional Victorian businesses closures include: In Warrnambool , Rauerts Shoes, Dale Cleves Music Shop, homewares store Abby Lane, clothing store Phinc, and Darrians Arts and Office Supplies all announced closures this year\n\n, Rauerts Shoes, Dale Cleves Music Shop, homewares store Abby Lane, clothing store Phinc, and Darrians Arts and Office Supplies all announced closures this year Elephant Bridge Hotel in Darlington closed suddenly in June\n\nclosed suddenly in June Fossey's Gin Distillery in Mildura closed last year\n\nclosed last year Sens Jewellers and Central Trophies in Bendigo is closing after decades of operation\n\nis closing after decades of operation After 20 years, Harry Limes was among the Ballarat hospitality businesses to close in 2024\n\nhospitality businesses to close in 2024 Maryborough Telecommunications in Maryborough has announced it will close\n\nhas announced it will close Fig Tree Cafe in Horsham closed after six months of operation\n\nclosed after six months of operation Red Door Books in Lancefield will close at the end of June after 18 years in business\n\nAccording to Australia Post, Australians spent almost $69 billion shopping online in 2024, 12 per cent more than the previous year.\n\n\"There's no question that online shopping is having a big effect on retail,\" said Bendigo trophy shop owner Glenn Fordham.\n\nMr Fordham is another long-term Bendigo retailer retiring without selling his business.\n\nGlenn and Barb Fordham passed on some of their engraving business to son Sean, who will expand its online services. (ABC News: Emile Pavlich)\n\nHis son, Seann, plans to take the family's trophy business online without a bricks and mortar presence.\n\n\"There's a lot of pressure on small business nowadays. I would go home and all I would think about is the business,\" Mr Fordham said.\n\nThe federal government will host a roundtable with experts, unions and business leader in August on how to improve productivity.\n\nSens Jewellers and Central Trophies engraves badges, trophies, and other items. (ABC News: Emile Pavlich)\n\n'Sleepwalking' into big corporate economy\n\nIn February, Small Business Ombudsman Bruce Billson said there was an \"alarming trend\" of Australia's small businesses declining with large corporate businesses employing more people.\n\n\"We are sleepwalking into a big corporate economy,\" he said.\n\nThat's a view shared by Steve Timmis who closed his gin distillery shop in Mildura about a year ago.\n\n\"Every single little corner you take it's another pinch, it's another cut, it's another kick in the guts,\" he said.\n\nMildura-based Fossey's Gin Distillery closed its flagship store a year ago, but has kept its Melbourne store open. (ABC Mildura-Swan Hill: Jennifer Douglas)\n\nMr Timmis said he had experienced mounting licensing fees from multiples tiers of government and increased property rates before he shut up shop.\n\n\"It is just becoming overwhelming now. You're seeing huge amounts of businesses close down and exiting, particularly in Victoria and, more so, in regional Victoria,\" he said.\n\n\"I call it a death by a thousand cuts.\"\n\nThe Victorian government did not respond to the ABC's request for comment before deadline.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/metastatic-cancer-queensland-identifying-women-living/105407984",
    "title": "'Invisible' patients living with deadly cancer counted in Queensland",
    "publish_date": "Fri, 13 Jun 2025 21:28:39 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Brisbane mother Larissa Erzitech describes herself as an \"invisible\" cancer sufferer who, until now, had been absent from official statistics.\n\nUntil recently, Queensland did not track how many people were living with metastatic breast cancer — also known as stage 4 — where the cancer has spread from its initial tumour to other parts of the body.\n\nNot being acknowledged meant the mother of two little boys, who was first diagnosed with breast cancer at age 38, had to battle her disease in a quiet corner, unable to access Medicare for some of her most vital medications.\n\nHer youngest son was just 9 months old when she first felt a lump in her breast, but with treatment, a year later she was told she was cancer free.\n\nShe felt as if the health system decided sufferers would die long before they needed to access expensive, life-prolonging treatment.\n\nLarissa Erzitech first felt a lump in one of her breasts while breastfeeding her son. (Supplied)\n\nBut two years ago came the devastating news the cancer had returned, and spread to her brain as a metastatic cancer.\n\nShe is one of the youngest victims in Queensland living \"with\" the disease rather than dying from it.\n\nForgotten statistics\n\nMs Erzitech is one of nearly 4,000 people now formally identified as living with metastatic breast cancer thanks to a program for national reform spearheaded by Breast Cancer Network Australia and Cancer Alliance Queensland.\n\nHer journey has been brutal — she says the drugs she has been on have caused terrible side effects.\n\nMs Erzitech says managing treatment side effects is like playing \"a game of whack-a-mole\". (Supplied)\n\n\"In our community, we joke that the side effects are like a game of whack-a-mole, as you never know what you're going to get and when they'll pop up,\" Ms Erzitech said.\n\n\"Changes in my heart, ongoing fatigue, mild nausea, hair loss, low white blood cells and sore joints.\n\n\"But you need to manage it very quickly to stay on the treatment.\n\n\"It is all out of pocket expenses as the medications are not covered by Medicare.\"\n\nMs Erzitech is one of nearly 4,000 people now formally identified as living with metastatic breast cancer. (Supplied)\n\nIt was yet another consequence of being \"invisible\" when it came to data, along with an inability to access clinical trials or new \"life-extending\" treatment regimes.\n\nMs Erzitech is now forced to grapple with the heartbreaking decision of when to tell her sons, now aged five and nine, that one day she will die.\n\nBut she also has a little hope that by being \"officially\" counted in the statistics, the Queensland health system can plan services, direct resources and invest in research that truly meets hers and other sufferers' needs.\n\nLarissa Erzitech with her husband Adrian and their two boys. (Supplied)\n\nPatients have felt 'written off'\n\nQueensland is only the second jurisdiction in the world, after New South Wales, to identify these survivors.\n\nBreast Cancer Network Australia director of policy and advocacy Vicki Durston said \"now, for the first time, these women matter\".\n\n\"This is a turning point, for too long governments have written off people with metastatic breast cancer because it is not curable, forgetting incurable shouldn't mean invisible,\" she said.\n\nVicki Durston says people with metastatic breast cancer have been \"written off\" because it isn't curable. (Supplied)\n\nThe newly released data counts anyone diagnosed with invasive breast cancer between 1982 to 2024 who were still alive by the end of last year.\n\n\"Without foundational data, where do we even start? If they're not counted, then they're not prioritised through policy planning or cancer plans,\" Ms Durston said.\n\n\"Historically people are counted when diagnosed and again when they die.\n\n\"Governments assumed advanced meant limited survival, however with advancement in treatment options and precision medicines, we now have options to support those diagnosed.\n\n\"Their needs are different to those with early breast cancer and you can't plan for a group you cannot see.\"\n\nThose suffering from metastatic breast cancer have different treatment requirements to early patients. (Supplied)\n\nShe said metastatic breast cancer sufferers have felt \"written off\" for too long, despite advances in oral therapies and new precision treatments extending life spans.\n\n\"So we're doing a lot of advocacy with the Commonwealth government, to say those medicines need to be fast-tracked so that people can get access to them, but so they also do not have to mortgage their home to be able to afford it.\n\n\"There's some assumptions by government that people with advanced breast cancer that has metastasised die, but they all don't.\n\n\"They're living and they're living well. And we want to ensure that there's visibility of that data to advance the advocacy and the policy priorities.\"\n\n'Fighting to live well'\n\nQueensland Minister for Women Fiona Simpson said that while international data was still scarce, Queensland was now nation-leading in improving dignity and recognition for these patients.\n\n\"Up until this point what had been collected nationally was wrong with regard to the true impact of this cancer on people's lives,\" she said.\n\n\"Why you need to know the truth is that it will drive better treatment options and hopefully life-extending care.\n\n\"It is not about just fighting this disease but fighting to live well.\"",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/drought-impacting-the-next-generation-of-farmers/105374520",
    "title": "In one town, the impact of climate change is starkly felt by the next generation",
    "publish_date": "Fri, 13 Jun 2025 21:24:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "The farming town of Orroroo, in South Australia's mid north, is a microcosm of the drought plaguing swathes of Australia. What is its future in a changing climate?\n\nThe auburn dirt of Orroroo is like that found in many towns in regional Australia, rich in colour, but devastating when swept into the air.\n\nThe red-coloured dirt of the land near Orroroo. ( )\n\nA dust storm hit Orroro in May, blanketing the town. ( )\n\nLast month the town, and many others across South Australia, Victoria and New South Wales were blanketed in thick dust as storms swept across the country.\n\nFor those in Orroroo, the hope had been for a much-needed reprieve from ongoing drought.\n\nThe dust storm covered Orroroo's school. ( )\n\nBut instead they were met with amber skies, forcing locals and school children to remain indoors as the front passed.\n\nOrroroo school principal Peter Usher.\n\nOrroroo Area School principal Peter Usher said it was the first time he had seen a change in the brave face of the community he has called home since the start of the year.\n\n\"It was almost like the land slapping everyone in the face of reality,\" he says.\n\nThe view from inside Orroroo's school. ( )\n\nAlong with their principal, the school's students were watching the topsoil from their family farms blow away.\n\nElla is a student at Orroroo Primary School. ( )\n\n\"It was all red, the sky, and it was yuck,\" year two student Ella recalls.\n\n\"It ruined it a bit more because we were starting to get green grass ... but then it unfortunately blew it away.\"\n\nLoading...\n\nIn a bid to share the news from their small town, student Clay took to Facebook with a weather report.\n\n\"News update from Orroroo, can we please have rain?\"\n\nThe town of Orroroo sits on the southern edge of the Flinders Ranges. ( )\n\nOrroroo sits on the southern edge of the Flinders Ranges, near Goyder's Line, a geographical mark drawn by the state's surveyor general in 1865 which determined where crops could be planted.\n\nOrroroo is a farming community in SA's mid north region. ( )\n\nFarming is at the town's heart.\n\nStudents from throughout the region bus into school each day. ( )\n\nEach day, children and some staff members from surrounding farms make their way to school.\n\nBut the weight of the ongoing drought continues to bear down, bringing with it both emotional and practical responsibilities.\n\nFor year two student Clay, the workload for his family has only increased.\n\nClay is a student at Orroroo Primary school. ( )\n\n\"Feeding sheep at the moment lots,\" he said.\n\nClay's family runs a farm.\n\n\"We haven't even got our seeder out yet, but we mostly grow grain down at where we call the valley.\n\n\"Last year it was terrible down there too.\"\n\nGrant Chapman also understands the weight of responsibility of running a family farm.\n\nGrant Chapman is the Mayor of Orroroo and a sheep farmer. ( )\n\nThe third-generation farmer has dedicated his life to the land and is also the local mayor.\n\nGrant has removed crops from his property due to a lack of rain. ( )\n\nLike everyone else, he watched what little feed that was left on the ground blow away in the storm last month.\n\n\"The dust started reasonably early in the morning. It continued all day just before dark,\" he recalls.\n\nGrant Chapman's farm has felt the impact of drought. ( )\n\n\"It was huge winds and dust storms like we've never seen in this area before. Not in my lifetime anyway.\n\n\"It just swept the country bare. Any remaining dry food that was about, even though there wasn't much, is gone … it was just a really devastating day.\"\n\nGrant's family has farmed just outside of Orroroo for three generations, and on his property they are entering their third season of drought.\n\n\"I think it's the worst drought in my lifetime,\" he says.\n\n\"I've talked to my dad, he's 92-years-old and he says he can't remember a drought being this widespread.\"\n\nEven before this drought hit, Grant made the decision to get out of cropping altogether.\n\nThe land, once filled with crops and greenery ...\n\nGrant Chapman's property was once covered in lush, green crops in 2016. ( )\n\nGrant's farm is now dry and dusty after years of drought conditions. ( )\n\n... now resembles a dry, dusty moonscape.\n\nHe now just farms sheep, but when he spoke to the ABC he only had three weeks of feed left.\n\nIt has left him with the difficult choice to sell part of his flock.\n\nWithout rain he may have to destock completely, seeing years of hard work breeding the best stock disappear.\n\nIt is a familiar tale for many working the land.\n\nAt the South Australian Livestock Exchange in Dublin, north of Adelaide, Elders livestock manager Matt Ward is auctioning sheep that, in a normal year, would still be grazing in paddocks.\n\nLivestock sales have been booming as people offload their stock amid the drought. ( )\n\nThe South Australian Livestock Exchange in Dublin, north-west of Adelaide, is a hive of activity. ( )\n\n\"Today in particular there's probably three lines of ewe lambs in the sale yards … that are being sold as ewe lambs because they can't carry them through … to be sold in the spring,\" he says.\n\n\"With lack of feed in the whole of South Australia, the graziers can't afford to buy them so they're going to slaughter unfortunately.\"\n\nSheep at the South Australian Livestock Exchange. ( )\n\nSome sheep in good condition are setting record prices.\n\nSome sheep were in poor condition. ( )\n\nOthers, are showing the signs of a continued drought crisis.\n\nReprieve not guaranteed\n\nThe anecdotes from farmers that they have never seen a drought this bad are backed by the data.\n\nAccording to the Bureau of Meterology (BOM) the start of the year saw the lowest rainfall on record for large parts of south-eastern Australia, from Western Australia, through South Australia, New South Wales, Victoria and Tasmania.\n\nFor some of those regions, they have been in the bottom five per cent of rainfall records for 26 months.\n\nIt is a trend, the BOM says is being influenced, at least in part, by climate change.\n\nSwathes of Australia have been impacted by drought. ( )\n\nFarmer Rob Pearce runs Sunnydale Station, about 40 kilometres out of Broken Hill. ( )\n\n\"We are seeing a declining trend in rainfall across much of southern Australia,\" Climatologist Caitlin Minney said.\n\n\"That's been observed definitely in the last 30 years so in south-east Australia, there's been a decrease of about nine per cent in that April to October which is that key, cool-season growing time, since 1994.\"\n\nRob Pearce farms sheep in western New South Wales near Broken Hill.\n\nHe says the last few seasons haven't been too bad, but they're heading into drought too.\n\nRob Pearce is hoping the rains will come this winter. ( )\n\nHe's preparing for the worst while he waits for rain, but remains in good spirits.\n\n\"God's got the say and I haven't got his email address,\" he said.\n\n\"I could see the writing on the wall [in] October so I've been sort of planning for this, getting sheep down like breeding them quick and getting them out quick because I didn't think it was going to rain.\"\n\nBack in South Australia, Alison Henderson is also trying to focus on resilience.\n\nShe runs a Merino stud less than an hour south of Orroroo.\n\nHer family has farmed here for five generations, but said this drought was \"unprecedented\" for the district.\n\n\"Definitely my dad, my grandpa, their generations can't remember a season like it, and they've got a few years in their memory that stick out as bad drought years,\" she says.\n\nAlison Henderson is a fifth-generation farmer. ( )\n\nThe reality of the drought is clear from above. ( )\n\nAlison Henderson is hoping her sustainable practices will future-proof her business. ( )\n\nShe is among the next generation of Australia's farmers, and despite having to sell off part of her flock and spend additional money on feed, she is hopeful for the future.\n\nShe is breeding Poll Merino sheep that are more resistant to drought.\n\n\"I love these genetics because what we've seen is growth rates, despite of the drought conditions, have been the best we've ever seen,\" she says.\n\n\"In the good times they're able to consume that feed and store that energy in their body as body condition and during tough times like this, they've still got that body condition that they can utilise and it means also that we don't have to feed them as much because they are able to utilise what they're eating better.\"\n\nChildren play in the mud kitchen at the school. ( )\n\nBack at Orroroo Area school, many students are also a part of the next generation of the town's farmers.\n\nChildren play in the sandpit Orroroo Area School. ( )\n\nWhile they play in the sand with miniature animals and trucks, their parents and families are working hard to survive.\n\nChildren playing in the sandpit. ( )\n\nFor those about to graduate, the transition is much closer to the horizon.\n\n\"I guess growing up that's always been the thing 'oh yeah I'll just go back and work on the farm',\" year 12 student Cooper Shackleford says.\n\n\"But it's getting to the point now where it's almost like 'well am I able to make a living off the farm and is it going to be able to support the family that's already there plus more people coming on?'\"\n\nAshby Thomas wants to go into agronomy when he finishes school, but when he did work experience at a business last year he saw another impact of the drought.\n\n\"There was no work on at all because there had been no rain to get the crops up so hopefully there'll be rain soon but there's not a lot of work around for that type of business,\" he says.\n\nPeter Usher says the town will be relieved when proper rains hit. ( )\n\nCooper Shackleford is in year 12 and has bright hopes for the future. ( )\n\nAshby Thomas is is Year 12 and wants to get into agronomy when he finishes school. ( )\n\nBut the most obvious answer to what is needed is simply rain, and lots of it.\n\nThere was good news in Orroroo and across much of drought-affected Australia last weekend when vast areas experienced downpours.\n\nWhile it wasn't enough to break the drought, locals say every drop helps restore their faith in the region's future.\n\nSchool principal Peter Usher said the town will be celebrating when big rains finally arrive. ( )\n\nPrincipal Peter Usher says when it rains, he'll give his students the chance to celebrate.\n\nEarlier this year, a moment of rain caused huge joy, despite its brief appearance.\n\n\"I know that when we get rain, because we will, it will be truly a celebration,\" he says.\n\n\"I'm really looking forward to seeing how beautiful the area is when we do have rain and the crops are growing because everyone's described that to me.\n\n\"At the moment they're all, not apologising, but they're saying this is not normally Orroroo, we normally have some rain.\"\n\nCredits:\n\nReporting: Leah MacLennan\n\nWords: Leah MacLennan and Jessica Haynes\n\nDigital production: Jessica Haynes\n\nPhotography and drone imagery: Che Chorley\n\nAdditional reporting: Will Hunter\n\nAdditional images: Will Hunter, Peter Usher and Grant Chapman\n\nEditing: Sara Garcia",
    "source": "ABC",
    "cluster_id": 23
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/monash-ivf-second-embryo-bungle-what-is-ivf/105414704",
    "title": "What's IVF, and how did a provider get an embryo transfer wrong twice?",
    "publish_date": "Fri, 13 Jun 2025 21:18:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "The IVF industry is under the microscope after major fertility provider Monash IVF apologised for a second embryo bungle.\n\nDays after the company told the stock market about the latest case, its chief executive officer resigned.\n\nIt followed revelations in April that one of Monash IVF's Brisbane patients had been mistakenly implanted with another woman's embryo in 2023 and gave birth to a baby who had no genetic links to her later that year.\n\nAn independent review is ongoing.\n\nApproximately 20,000 babies are born from IVF treatment in Australia every year, according to the Australian and New Zealand Assisted Reproduction Database.\n\nSo, what is the process, what are the checks and balances, and how rare are such bungles?\n\nDuring IVF treatments, an egg is fertilised with sperm in a lab before being implanted into the uterus. (Supplied: Adobe)\n\nWhat is IVF?\n\nIn vitro fertilisation — or IVF — is one of the most common assisted reproductive technology procedures (ART).\n\nThe process involves collecting a donor or patient's eggs, then fertilising them with sperm in a Petri dish in a lab.\n\nA fertilised egg — known as an embryo — is then implanted into the woman's uterus.\n\nWhat are the checks and balances?\n\nFertility educator and IVF patient advocate Lucy Lines has previously worked as an embryologist — a scientist who specialises in developing embryos.\n\nShe says whenever eggs, sperm or embryos are moved in the lab, the dishes and paperwork are all labelled with the patient's name, their ID number, and date of birth.\n\nIVF bungle could spark battle over parentage Photo shows In vitro fertilisation Monash IVF realised the mistake in February, after the birth parents asked to transfer their remaining frozen embryos to another provider.\n\nIn some labs, they are allocated a colour code as well, she says.\n\n\"At minimum, there are three points of reference for each client inside the lab,\" she says.\n\n\"So then when anything is moved from one dish or tube to another dish or tube, a second embryologist will come along and audibly repeat [the patient's name, date of birth, and the ID number].\n\n\"That is the historical way that it was done.\n\n\"In some labs they've added an extra level, a barcode that requires a scanner to read the barcode, or in some other labs they have an RFID (Radio Frequency Identification) label, which has an auto-reader on the bench top or workspace and that reader will sound if there are things on that bench that don't match each other.\"\n\nAdvocates are urging parents considering IVF to \"arm yourself with knowledge\" about the process. (AP: Sang Tan)\n\nWhat are the regulations?\n\nIt varies.\n\nThere are more than 40 \"different pieces of legislation\" governing ART and IVF across the country, according to the Fertility Society of Australia and New Zealand (FSANZ).\n\nFor example, laws to regulate ART providers in Queensland only passed parliament last year.\n\nBy comparison, Victoria has had laws in place for years.\n\nParents urged to DNA test kids after second IVF error Photo shows A woman stands in a room with bookshelves behind her. She is looking up and has her hands on her hips. After a second embryo mix-up at Monash IVF, activists say \"rare mistakes\" are systemic failures and urge families to get DNA tests.\n\nFSANZ’s Reproductive Technology Accreditation Committee (RTAC) is responsible for setting performance standards and granting licences to fertility providers across the country.\n\nThe society and RTAC are currently operated on a \"volunteer basis by professionals within the sector who have taken on additional responsibilities\".\n\nFSANZ is calling for the establishment of RTAC as an independent statutory authority to \"strengthen oversight and trust in the sector\".\n\nThat is backed by the Victorian Health Minister Mary-Anne Thomas who said yesterday it was concerning that the body that currently accredits fertility care providers is made up of fertility care providers.\n\nYesterday, all Australian states and territories agreed to undertake a review into the implementation of an independent verification body for fertility providers.\n\nDo you know more? Contact Janelle Miles and Kate McKenna\n\nWhat are there calls for?\n\nThere are growing calls for national fertility legislation to replace the \"fragmented\" state and territory laws and provide \"consistent, enforceable standards\".\n\nIVF activist Anastasia Gunn is among those pushing for change.\n\nAnastasia and Lexie Gunn's three sons were conceived through the IVF process. (Four Corners: Ron Foley)\n\n\"We're asking for federal legislation of the industry, which the industry itself are asking for that,\" she says.\n\n\"We're asking for a federal donor conception registry [as] historically gametes and embryos have been moved interstate.\n\n\"Donor conceived people have a right to know their biological and medical history if they choose to.\n\n\"We're choosing to ask for external regulation of the industry.\"\n\nAre embryologists registered?\n\nNo, there is no licensing or registration of embryologists in Australia — unlike other professions such as doctors and nurses.\n\nIt is something the FSANZ would like to see changed.\n\nEmbryo mix-ups more common overseas Photo shows A close up of a baby in white muslin wrap with stars on it, being held by two adults. No faces are visible. While experts say this case is \"unprecedented\" in Australia, it's happened multiple times in the US, as far back as 1999.\n\n\"We continue to advocate for robust professional recognition of embryologists in Australia — both to uphold standards and to protect the public,\" a FSANZ spokesperson said in a statement.\n\n\"The medical laboratory professionals in Australia chose to set up this self-regulated scheme because the Australian Government decided not to include Medical Scientists and Technical Officers in the professions covered by the Australian Health Practitioner Regulation Agency (AHPRA) when it was established in 2010.\n\n\"Most comparable countries do have formal regulation of Medical Scientists and Technical Officers to protect the public and set minimum standards for ongoing assessment of competency and continuing professional development.\n\n\"It would require the Australian Government to legislate mandatory registration.\"\n\nHow often do these mistakes happen?\n\nThe industry insists they are rare.\n\nBut others — such as Sydney Law School lecturer Christopher Rudge — acknowledge it is also difficult to know without specific data.\n\n\"The recent history of IVF mistakes and errors is somewhat clouded by reported settlements, private settlements, so it is hard to know the true frequency of these errors,\" Dr Rudge told the ABC earlier this week.\n\nMonash IVF is a publicly listed company, which means it has \"disclosure obligations\".\n\nMonash IVF has made two statements to the ASX regarding embryo mix-ups in as many months.\n\nOver the past two months, it has made statements to the ASX — and its shareholders — about the two embryo incidents.\n\nHowever the ASX also issued Monash IVF a 'please explain' about the timing of the Brisbane announcement — which came weeks after the company said it became aware of the mix-up.\n\nMonash IVF's chief financial officer said the company did not expect the bungle would affect its share price \"as it was an isolated incidence of human error\".\n\nThe company's share price plummeted from $1.08 to 69 cents after the Brisbane bungle was made public in April.\n\nAn independent review is ongoing into two separate IVF bungles at Monash IVF this year. (Supplied: Adobe)\n\nWhat should patients be asking their clinic?\n\nMs Lines says it was complex.\n\n\"My only answer is, if you're looking down the barrel of IVF, arm yourself with the knowledge of what's actually involved … so that you can empower yourself to ask the questions that you need the answers to,\" she says.\n\n\" As a culture, we're very used to going to our doctor and doing what we're told. You should be doing that, but you should also be an active participant in your care. \"",
    "source": "ABC",
    "cluster_id": 24
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/abuse-survivor-wins-case-against-waller-legal/105410390",
    "title": "Abuse survivor wins 'landmark' case against high-profile law firm",
    "publish_date": "Fri, 13 Jun 2025 21:09:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "A survivor of sexual abuse at a Catholic school in Victoria has won a claim against his ex-lawyers, after suing the law firm for negligence.\n\nThe survivor was abused at Monivae College in Hamilton in the late 1970s by two Catholic brothers and was originally represented in his lawsuit against the Catholic order by Waller Legal in 2015.\n\nHe first settled his claim against the Order of the Missionaries of the Sacred Heart (MSC) for $140,000 in February 2017.\n\nHe later went on to sue Waller Legal, claiming the firm was negligent and provided inadequate advice when representing him in that claim.\n\nLast week, in a judgement against Waller Legal, Supreme Court Justice Jack Forrest awarded the survivor $263,000.\n\nRightside Legal partner Michael Magazanik, who represented the survivor in his action against his ex-lawyers, described it as a \"landmark\" decision.\n\n\"It sets out the obligations of a lawyer when representing someone who's been sexually abused as a child,\" Mr Magazanik said.\n\nThe survivor, who legally cannot be identified, told the ABC he felt satisfied with the judgement.\n\n\"It's been a long process,\" he said.\n\n\"I just kept fighting, and I'm hoping that my victory, and ultimately the judgement, will encourage others to pursue their claims to the full amount.\"\n\nHe said any others who felt dissatisfied at their settlement should seek new legal representation.\n\nUnder its principal solicitor Dr Vivian Waller, Waller Legal is among the most prominent specialist abuse law firms in Melbourne.\n\nAnother lawyer at the firm was responsible for the day-to-day management of the survivor's case against MSC.\n\nIn a statement, lawyers representing Waller Legal said the law firm was reviewing the judgement, and considering an appeal.\n\n\"Waller Legal founder and principal Dr Vivian Waller has represented and advocated for hundreds of survivors of institutional sexual abuse for almost 30 years, and will continue to do so,\" it said.\n\n\"She has been instrumental in agitating for important law reforms for survivors.\"\n\nMSC said due to ongoing legal matters, the Catholic order would not comment\n\nLaw firm's advice included 'furphies': Judge\n\nThe survivor suffered the abuse between the age of 11 and 12, and said when he first began pursuing legal action against the MSC in 2015, Waller Legal seemed to be the only firm helping victims of historic child abuse.\n\nHe described the process with Waller Legal as being \"like on a conveyer belt\".\n\nThe survivor took the firm to court alleging negligent advice and misleading conduct in relation to both the handling of his economic loss (lost earnings) claim and the advice given to him.\n\nThe Ellis defence was repeatedly referenced in Justice Forrest's judgement, which refers to a legal technicality that prevented abuse survivors from suing unincorporated organisations, including churches.\n\nIn his ruling, Justice Forrest said Waller Legal's belief in the efficacy of the Ellis defence was \"misconceived and negligently held at the time\" the survivor was represented by the firm.\n\nJustice Forrest also said advice that any claim faced \"insurmountable obstacles\" were \"furphies\".\n\n\"Not one of the points now identified by Waller Legal and described as constituting an insurmountable obstacle was mentioned by MSC in the negotiations to settle … in 2016 and 2017,\" the judgement stated.\n\nThe judge threw out the allegation of misleading conduct.\n\n'A point of principle' for abuse survivor\n\nMr Magazanik began representing the survivor in 2019.\n\nIn 2021, the survivor launched a fresh suit against MSC, and in 2022 settled his claim for an additional $400,000.\n\nIn this latter case, the judge refused to set aside the part that related to his claim for economic loss.\n\nLawyer Michael Magazanik represented the abuse survivor in his case against Waller Legal. (ABC News: David Weber)\n\n\"My client has enormous endurance,\" Mr Magazanik said.\n\n\"He's been through two police processes in relation to his abusers.\n\n\"This is a point of principle for him. He wanted to stand up for what he thought was right.\"\n\nOf the two Catholic brothers accused of abuse in the case, one has been sentenced in 2013 to two years and three months in prison, while the other had not been convicted of any criminal offences.\n\nFurther legal action possible\n\nMr Magazanik said Rightside Legal had separately been pursuing a class action lawsuit over allegations the firm failed to sufficiently claim for lost earnings, but the Supreme Court had found the details of each case were too different for a group action to progress.\n\nHe said many of those in the class action were now contemplating individual cases against Waller Legal.\n\n\"We will read this decision very carefully and give each of them individual advice about their prospects,\" he said.",
    "source": "ABC",
    "cluster_id": 25
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-14/aussie-stars-gruesome-lords-injury-a-huge-test-blow/105416674",
    "title": "Aussie star's 'gruesome' Lord's injury a huge Test blow",
    "publish_date": "Fri, 13 Jun 2025 20:44:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "Star batter Steve Smith could be forced to miss Australia's upcoming tour of the West Indies after suffering a \"gruesome\" compound dislocation of his finger.\n\nIn a major blow for Australia's immediate and long-term prospects, Smith hurt his right little finger during a crucial moment of the World Test Championship (WTC) final at Lord's on Friday, local time.\n\nWearing a helmet while standing closer in slips than normal, the former Australia captain put down a regulation chance off Mitchell Starc that would have dismissed Proteas captain Temba Bavuma for only two.\n\nSmith immediately left the field in immense pain after spilling the catch that would have put Australia in the box seat to claim back-to-back WTC titles.\n\nInstead, Bavuma combined with Aiden Markram for an unbeaten 143-run stand to put South Africa in reach of a famous victory on 2-213, just 69 runs from the winning line.\n\nThe 36-year-old was assessed by medical staff in the Lord's change rooms, before being taken to hospital for X-rays and further treatment.\n\nAs of an hour after stumps, Smith was still in hospital and the Australian team had no further update on his condition.\n\n\"We weren't really up to speed in terms of how gruesome the injury was,\" Australia assistant coach Daniel Vettori said.\n\n\"We just heard there was a fear of the compound fracture or dislocation, something of that nature.\n\n'We'll just wait and see what comes back after he gets back from hospital.\"\n\nA compound dislocation is when bone pierces the skin, which could mean Smith needs surgery and a long rehabilitation.\n\nOne of the greatest red-ball batters of all-time, Smith's looming absence will be a major blow after scoring four centuries from his last six Tests in a stunning late-career resurgence.\n\nBut Smith's misfortune could give out-of-form teammate Marnus Labuschagne a reprieve.\n\nThe 30-year-old Labuschagne averaged less than 30 during this WTC cycle during the past two years, with his last century coming back in July 2023.\n\nA long-term number three, Labuschagne moved up to open for the first time in his Test career for this match.\n\nBut the promotion failed to snap him out of his lean spell, making 17 and 22.\n\nQuick hits from the third day of the World Test Championship Photo shows Mitchell Starc, Steve Smith and Temba Bavuma. Steve Smith and Temba Bavuma both end up in the hands of medical staff, as Mitchell Starc scores his first 50 in six years. Here are five quick hits from the third day of the World Test Championship decider.\n\nTeenage tyro Sam Konstas, who announced himself last Boxing Day, is almost certain to be given an opportunity as opener for Australia's first tour of the Caribbean in 10 years.\n\nIf Smith can't play, Konstas could slot back in to open with Usman Khawaja, while Labuschagne would likely drop down to number three.\n\nBut even Khawaja, who turns 39 later this year, is under pressure to keep his Test career going after scores of 0 and 7 in this Test.\n\nAustralia's first Test begins in Barbados in 12 days on June 25, followed by matches in Grenada and Jamaica.\n\nAAP",
    "source": "ABC",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/tourists-sit-on-and-break-van-gogh-chair-at-italian-museum-20250614-p5m7ek.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tourists sit on and break Van Gogh chair at Italian Museum",
    "publish_date": "Sat, 14 Jun 2025 11:42:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tourists sit on and break Van Gogh chair at Italian Museum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 3
  },
  {
    "url": "https://www.smh.com.au/sport/afl/blues-injury-blow-sam-walsh-out-for-six-weeks-with-foot-injury-20250614-p5m7e3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues injury blow: Sam Walsh out for six weeks with foot injury",
    "publish_date": "Sat, 14 Jun 2025 11:11:50 +1000",
    "category": "sports",
    "authors": [
      "Scott Spits"
    ],
    "text": "Carlton have been hit with another injury blow with confirmation that midfielder Sam Walsh will be sidelined for up to six weeks with a foot injury.\n\nThe Blues said 24-year-old Walsh reported foot soreness after training on Friday. They said there was no fracture in the foot and he would not need surgery.\n\nStar Carlton midfielder Sam Walsh. Credit: Getty Images\n\n“During yesterday’s main training session, Walsh reported foot soreness and has subsequently undergone a series of scans and consultation over the last 24 hours,” the Blues reported on Saturday.\n\nCarlton head to Western Australia for Sunday’s clash against the West Coast Eagles. They are also without key forward Harry McKay.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/lifestyle/david-beckham-knighted-in-king-charles-birthday-honours-20250614-p5m7e4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Beckham knighted in King Charles' birthday honours",
    "publish_date": "Sat, 14 Jun 2025 09:49:02 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "David Beckham knighted in King Charles' birthday honours\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/world/asia/flickering-green-and-white-inside-the-cabin-seconds-before-the-air-india-crash-20250614-p5m7dj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Flickering green and white’: Inside the cabin seconds before the Air India crash",
    "publish_date": "Sat, 14 Jun 2025 09:45:37 +1000",
    "category": "finance",
    "authors": [
      "Christopher Jasper",
      "Joe Pinkstone"
    ],
    "text": "In his final message to air traffic controllers, the plane’s pilot said the Boeing 787-8 Dreamliner had “no thrust”, was “losing power” and was “unable to lift”. The Dreamliner is designed to be able to climb and fly safely in the event of having only one engine operational. Speculation has been rife over what may have caused the crash, including the possibility of pilot error, faulty flaps, electrical problems or engine failure. A bird strike is a prominent hypothesis, and could have caused a catastrophic engine failure leading to such a situation, but there has been no evidence of flocks in the area at the time of the crash. “More than one thing went wrong here. The thing that might have started it, and I think probably did, was a loss of power,” Learmount said\n\n“Whether it was loss of power on one engine or both engines is not clear. But the failure of a single engine should not cause a crew to lose control of a modern airliner, even in the critical early climb phase. Loading “At the same time, simultaneous engine failures for unconnected reasons simply do not happen, based on the entire history of aviation. So if there was a failure of both, the question is what could have caused it.” The two engines on the plane are made by General Electric aviation and have a good safety history. On Friday, the Indian aviation regulator, the Directorate General of Civil Aviation, issued a notice to Air India to conduct more inspections of all of its 787-8 and 787-9 fleet with GE engines. This includes an inspection of the fuel monitoring systems, a test of the electronic engine control, a check of the hydraulics and a review of take-off parameters. “Power assurance checks” are also to be done on each plane within two weeks.\n\nDr Akhil Bhardwaj, a senior lecturer in aviation safety at the University of Bath, said he believed the DGCA was acting with an “understandable abundance of caution”. Last year, a United Airlines 787 jet, which has the same GEnx-1B engines as the doomed AI 171 flight, suffered an “uncontained left engine failure shortly after take-off” while flying from Singapore to San Francisco last year, according to a National Transportation Safety Board report. The engine ceased working at cruise altitude and set alight, according to the report, with the pilots managing to circle back and land the plane in Singapore using just one engine. A GE Aerospace spokesman said: “Safety is our top priority, and we support the action being taken by the Indian Directorate General of Civil Aviation for enhanced safety inspections of the Air India 787-8/9 fleet.\n\n“We continue to work closely with the appropriate regulatory and investigative agencies, and we are committed to providing all technical support necessary to understand the cause of this accident.” Loading Experts have suggested that the Dreamliner, which until Thursday had an unblemished safety record, also deployed its Ram Air Turbine (RAT) during the ill-fated 60 seconds between take-off and the crash. The RAT is a propeller-like device that sits in the fuselage between the wings and is only deployed in the most dangerous situations, to provide emergency power to vital electrical systems. Sambulo Matema, a lecturer in aviation management at University College Birmingham, said: “There is credence to this theory. In a complete power‑loss scenario, the aircraft transitions from engine‑supplied power to RAT power, and lighting anomalies can occur.”\n\nLoading “This behaviour aligns with established emergency procedures and the expected performance of aircraft electrical systems under severe duress. “After total power loss, the RAT deploys as a fallback power source. During this transition, green emergency lighting activates, and white lights may flash while onboard systems reboot and stabilise.” Learmount, who flew Hercules military transport planes around the Middle East during his RAF career, said the RAT would have sent power to the cockpit. The plane’s batteries would also have supported vital systems. However, neither could have done anything to keep the plane aloft in the event of its turbines spooling down.\n\nLoading All this suggests the fault lay in the engines. However, what could have caused them to shut down remains unclear. One theory is contaminated fuel. In 2010, a Cathay Pacific flight to Hong Kong almost ended in disaster when the pilot was unable to control engine thrust, leading it to land at twice the usual speed. It later emerged that fuel pumped into the plane had been contaminated with saltwater, damaging its engines over time. However, such problems are rare. Learmount said: “If you go looking for a potential cause of multiple engine failure, fuel contamination could do it. But again, history is against that potential cause in observed reality.”",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/another-aussie-even-schmidt-can-t-ignore-elephant-in-lions-room-20250613-p5m74y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Another Aussie’: Even Schmidt can’t ignore elephant in Lions room",
    "publish_date": "Sat, 14 Jun 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There is certainly precedence for picking players who originate from Australia, New Zealand and South Africa – former Crusaders winger Sean Maitland, Dylan Hartley and Matt Stevens, a Junior Springbok, all made the initial selection. There has been a long history of players from the SANZAAR countries finding their way into the Home Nations’ Test teams: in that sense this Lions tour is nothing different, and the ‘nothing to see here’ argument put forward in some quarters in the northern hemisphere holds water. There is no doubt, either, that all the SANZAAR Lions have displayed a level of personal commitment and passion for their adopted countries. But this is really a numbers game, and the volume of SANZAAR players in this year’s squad is atypical. In fact, it might never be repeated because World Rugby changed the eligibility laws at the end of 2020 to extend the residential qualification period from three years to five years.\n\nIt was a significant rule change advertised at the time to uphold the “integrity and sanctity” of the international game, but it came too late to affect this Lions squad. The second question of whether it matters is an emotive one. Lions icon Willie McBride raised his head above the parapet a few months ago and said he was “bothered” by the presence of eight players who were not born in either Britain or Ireland. McBride was subsequently labelled by some as an old man shouting at the clouds, but not so fast. This week, recently retired England halfback Danny Care voiced the same sentiment. “Whatever I say here, you’re going to get stick. You open yourself up to it,” he told the BBC Rugby Union Weekly podcast. “It doesn’t sit that well with me that some of these… both your starting wingers are going to be lads that never, ever once in their childhood or even their mid-20s ever dreamt of wearing a red Lions jersey.”\n\nLoading In other words, it does matter, and it matters to British and Irish players – this is not simply a topic being beaten up by the venomous Australian media to unsettle the tourists. Schmidt, of course, has to be careful on the subject. As Ireland coach he benefited from the services of both Bundee Aki, a New Zealander of Samoan heritage, and CJ Stander, a South African, in a famous win against the All Blacks in 2018. And, as he said earlier in the week, he coached Bealham as well. It would be hypocritical of him to use the SANZAAR players as a stick to beat the Lions with. But for the rest of us, there is the nagging question of why the Lions have been permitted to turn SANZAAR players against the Wallabies in a series that is ultimately designed to test the quality of the rugby that is being played within the respective borders of the Australia and the British and Irish Isles?",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/star-of-sandpapergate-gives-australia-a-test-batting-lesson-20250613-p5m76d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star of Sandpapergate gives Australia a batting lesson, takes Proteas to within 69 runs of victory",
    "publish_date": "Sat, 14 Jun 2025 09:09:38 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "London: A few days ago, Pat Cummins was queried about some unresolved elements of the 2018 “Sandpapergate” series in South Africa by an English interviewer, and gave the blunt reply: “I don’t want to talk about it.”\n\nOne man with much fonder memories of that encounter is Aiden Markram, then early in his Test career. Markram was actually in the middle when the sandpaper incident unfolded in Cape Town. His security at the crease, amounting to 480 runs at 60 for the series, had helped drive Australia to ugly extremes.\n\nAustralia’s wicketkeeper Alex Carey, right, reacts as South Africa’s Aiden Markram plays a shot on day three. Credit: AP\n\nThose runs showed Markram to be a player of quality and character, after he had started the tour being goaded by David Warner for a run out in which AB de Villiers was dismissed in Durban.\n\nThough South Africa lost the game, Markram’s 143 in the chase was a century of top class. By sculpting an unbeaten 102 in the company of his captain Temba Bavuma in the World Test Championship being decided at Lord’s to pull the Proteas to within sight of victory, he has now played an innings to surpass it. At stumps on a match-defining day in London, Markram had guided the Proteas to 2-213, needing just another 69 runs to pull off a remarkable win.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/smith-taken-for-scans-after-finger-left-at-sickening-angle-20250614-p5m7db.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smith’s West Indies tour in doubt after finger left at sickening angle",
    "publish_date": "Sat, 14 Jun 2025 09:07:24 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "London: Steve Smith’s West Indies tour has been thrown into doubt after he was taken to hospital for x-rays on a compound dislocation to his right little finger.\n\nSmith’s digit was left bent at a sickening angle after he dropped a sharp chance offered by Temba Bavuma on the third afternoon of the World Test Championship final at Lord’s, having moved up very close to the bat at slip.\n\nAustralia’s Steve Smith reacts in pain as he leaves the field. Credit: AP\n\nA Cricket Australia spokesperson confirmed that Smith was set to be taken for scans on the badly damaged finger. The first Test against the West Indies in Barbados is scheduled for June 25, a little less than two weeks from now.\n\n“Steve Smith has suffered a compound dislocation of his right little finger while fielding in the slip cordon during the ICC Men’s World Test Championship final against South Africa at Lord’s,” A CA spokesperson said.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/when-a-good-deed-becomes-a-privacy-disaster-a-sperm-donor-speaks-out/e54xaajb4",
    "title": "When a good deed becomes a privacy disaster: a sperm donor speaks out",
    "publish_date": "Fri, 13 Jun 2025 21:30:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"You've created something beautiful, which was supposed to be a good deed. It's almost like you're being punished because your information was held on a computer system.\"\n\n\n\n\n\nThat’s a sperm donor whom we will call Isaac.\n\n\n\n\n\nSBS News has used an actor to record his comments, to obscure his identity and protect his sensitive personal information, which was part of a data breach earlier this year.\n\n\n\n\n\nIt all began when he agreed to be a sperm donor for some friends of his who couldn’t conceive themselves.\n\n\n\n\n\n\"Being a sperm donor is the epitome of awkward. You kind of feel like you're a bit of produce to some extent, which has been selected by your genetic characteristics. Personally, it's like why did they choose me? And that's an interesting thing, which makes you go to the depths of your own self-confidence. But the whole process is naturally incredibly awkward because effectively you've been chosen to jizz in a cup.\"\n\n\n\n\n\nBut Isaac wanted to help the couple and agreed to go ahead with being their sperm donor.\n\n\n\n\n\nI-V-F ((in vitro fertilisation)) treatment is becoming increasingly more common in Australia, with one in every 18 births now a product of the process.\n\n\n\n\n\nThe couple decided to go to Genea Fertility, one of Australia’s largest I-V-F clinics, where staff asked Isaac several probing questions about his medical history, and he underwent a series of psychological sessions.\n\n\n\n\n\n\"You go through the longest form I've ever been through in my life. Any diagnosis you've had, any medication you've had. The staff there were really, really lovely, and particularly given the awkwardness of a sperm donation, they're adept at handling that awkward situation.\"\n\n\n\n\n\nIsaac also spoke to staff about intimate personal circumstances, about himself and his family.\n\n\n\n\n\n\"People have mental health issues, and medication could be quite a lifesaver. I have a history of taking medication since I was 17 years old. It's still highly stigmatised. I also have a family history of autoimmune disease.\"\n\n\n\n\n\nWith his donation, the couple conceived their first child, but the joy Isaac feels for helping his dear friends start a family has been mixed with frustration and anger.\n\n\n\n\n\nIn February, Genea informed Isaac via email that his data was among a batch that had been breached by cybercriminals and posted to the Dark Web.\n\n\n\n\n\nThe exposed data includes people's medical history, diagnoses and treatments, medications and prescriptions, and pathology and diagnostic test results.\n\n\n\n\n\n\"You've created something beautiful, which was supposed to be a good deed. It's almost like you're being punished because your information was held on a computer system. I don't know what the next step is, but having some information about what the fuck's happening is probably a bloody good step.\"\n\n\n\n\n\nNot only could Isaac be at risk of fraud or blackmail, but so could any children conceived through the clinic, including his friend’s newborn.\n\n\n\n\n\nFour months later, he feels left in the dark about what Genea is doing to protect customers from hackers and scammers.\n\n\n\n\n\nGenea declined to be interviewed by SBS News, instead pointing to statements it has made on its website.\n\n\n\n\n\n\"Our teams and cybersecurity experts are working hard to urgently review the impacted data. This is a detailed and complex process which will take some time to complete to ensure we can clearly understand the nature and extent of the data that has been published and identify impacted individuals.\n\n\n\n\n\nSo what happens now?\n\n\n\n\n\nProfessor Dali Kaafar is the executive director of Macquarie University's cybersecurity hub.\n\n\n\n\n\nHe says investigating cybercrime can be a lengthy process and in the meantime, Isaac's personal data could be used against him.\n\n\n\n\n\n\"If they actually sense some form of vulnerability with their victim, for instance, the victim is trying to hide some sort of information from the employer or from their families, they'll probably try to leverage that in a form of blackmail.\"\n\n\n\n\n\nProfessor Kaafar predicts data breaches will only become more frequent, especially against companies like Genea.\n\n\n\n\n\n\"Health providers handle obviously vast amounts of highly sensitive personal information, not only the medical histories or the diagnosis, et cetera, but things like contact details of patients and so on. So it makes them immediately attractive targets for cybercriminals. And so I think the very first explanation or the very first view of why the health sector is consistently reported as the highest number of data breaches in Australia and globally as well, by the way, is largely due to that first piece, which is the volume and the sensitivity of the data is there. They're definitely by nature a very attractive target for cyber criminals.\"\n\n\n\n\n\nIt’s a scary thought for Isaac when he thinks about both his future and that of the donor-conceived child.\n\n\n\n\n\n\"What happens if I get a job which is relatively high profile or dealing with sensitive activity, could this open me up to not getting employed because an employer might've found my internet history, and maybe they have had ethical concerns or concerns with my health record? There are lots of bits and pieces which we all choose to disclose or not disclose as we go about our day. And if that information is out there, it's taken away my agency and my choice to disclose that information if I want to. That's only compounded further by the lack of information that I've been provided about this investigation and the data breach.\"\n\n\n\n\n\nHe wants to see consequences for the data breach and for Genea to be held accountable.\n\n\n\n\n\n\"Some things are more sensitive than others, and if you're at the more extreme end of sensitivity, you want the ramifications to be higher and you also want to make sure there's incentive to not have this happen again.\"\n\n\n\n\n\nUnlike financial fraud, where victims can demonstrate losses as a dollar figure, the value of a person's privacy is subjective.\n\n\n\n\n\nFaith Gordon, an associate professor in law at the Australian National University, says people affected by breaches can make legal claims for the breach itself as well as its impact, and there could be compensation for losses such as embarrassment, humiliation and anxiety.\n\n\n\n\n\n\"There's a lot of legal and ethical accountability for these clinics. They do have ethical and also legal duties. For example, under Australian law, Australia's Privacy Act, there is health data protection requirements and there's medical ethical guidelines as well about informed consent and data protection. So breaches can give rise to claims for this breach and for the impact of it.\"\n\n\n\n\n\nAssociate Professor Gordon says there's more that can be done to protect people, especially children conceived through these clinics\n\n\n\n\n\n\"A data breach could expose very, very personal information, including names and dates of birth and donor status and notes about embryos. So that can result in significant stigma and psychological harm and potentially future discrimination as well. Child ren have very specific rights and very specific vulnerabilities, and these need to be protected, and they also need to be empowered to actually access justice when something does go wrong in this space as well.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-australian-homes-are-so-cold-and-what-you-can-do-about-it/mm2mecuff",
    "title": "Why Australian homes are so cold — and what you can do about it",
    "publish_date": "Fri, 13 Jun 2025 20:36:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Winter has arrived in Australia, and you may have noticed it feels just as cold — or even colder —inside your home compared with outside.\n\n\n\n\n\nAustralia is typically considered a warm country, and winter temperatures do not reach the lows recorded in many other parts of the world.\n\n\n\n\n\nBut inside many homes, it's a different story.\n\n\n\n\n\nHere's why they feel so cold, and what you can do to keep warm.\n\n\n\nWhy are Australian houses so cold?\n\nIf you live in Australia and you're feeling the cold, you're not alone.\n\n\n\n\n\nContent creators from colder places, such as Canada, the United States, and the United Kingdom, have taken to social media to question why Australian houses are so cold compared to those overseas.\n\n\n\nThe World Health Organization (WHO) recommends houses should be kept at a minimum of 18 degrees to support general health and wellbeing.\n\n\n\n\n\nAccording to the WHO, colder temperatures can have negative impacts on respiratory, cardiovascular and mental health. Cold temperatures can also make mould in a house worse and weaken a person's immune system.\n\n\n\n\n\nBut according to a 2023 study published in the Energy Research and Social Science journal, across the sampled homes, 81 per cent were below 18 degrees from June to August, with an average temperature of 16.5C.\n\n\n\n\n\nAustralian homes were colder than Finland, which averaged temperatures of 20 to 24 degrees, and Greenland, which had an average indoor temperature of 21.8C.\n\n\n\n\n\nAustralian homes are often uninsulated, draughty, or fitted with inefficient heaters, meaning they are prone to letting in cold air and letting out warm air.\n\n\n\nAustralia's regulatory standards and building codes have also historically been less stringent than other countries, according to Professor Ralph Horne, associate deputy vice chancellor of research and innovation at RMIT.\n\n\n\n\n\n\"As far back as 2005, research comparing Australian cities to those overseas found housing in compatible climate zones in North America and Europe was 55 per cent more efficient for heating and cooling energy compared to minimum standard housing in Australia,\" he said.\n\n\n\n\n\n\"The average energy efficiency [NatHERS] rating of all the overseas comparison homes was over seven stars, and we have yet to implement seven stars here in Australia, almost 20 years later.\"\n\n\n\nWhat can you do to make your house warmer?\n\nFortunately, there are a few things you can do to enhance the warmth inside your home.\n\n\n\n\n\nIf you own your property, consider retrofitting and upgrading your heating and insulation systems.\n\n\n\n\n\nThis can include improving insulation in the floor, walls and ceilings, and sealing cracks in windows, door frames and floors.\n\n\n\nInstalling a split-system air conditioning and heating system, as well as floor heating, can also help make your house feel warmer.\n\n\n\n\n\nYou should also regularly maintain heating systems and clear out filters to ensure they are working efficiently.\n\n\n\n\n\nUpgrading heating systems can be costly, and energy efficiency expert Adam Corrigan, founder of Your Energy Friend, said each household is different and there are many energy-saving options to consider.\n\n\n\n\n\nThe first thing he recommends for households is to analyse their power bills and shop around to get the best deal, followed by making your house more energy-efficient.\n\n\n\n\n\n\"If you want to make your home more comfortable, get your insulation sorted and do your draft proofing. That's your best return on investment. That's your best bang for buck,\" he said.\n\n\n\nCorrigan said simple changes such as installing heavy-lined curtains and a box pelmet (which goes around the top of the curtain) can be very effective at keeping your home warm and are much cheaper than double-glazed windows, for example.\n\n\n\n\n\nWhile renters cannot make such changes to homes, there are some affordable options to stay warmer in winter.\n\n\n\n\n\nIf your house has draughts, you can apply weather strips, 'door snakes' or other barriers around windows or door frames to prevent cold air from entering the house, and to block warm air from escaping.\n\n\n\n\n\nIf you have hard floors, adding rugs can provide some insulation and add warmth underfoot, and if you have ceiling fans, using the reverse setting can distribute warm air from the ceiling.\n\n\n\nFor rental homes without heating systems, portable electric or oil heaters can be an effective option for heating up single rooms. To maintain the desired heating in a specific area, ensure doors and windows are closed to prevent heat from escaping.\n\n\n\n\n\nHorne said while Australia has had a longstanding awareness of drought and water efficiency, there has not been enough of a focus on energy efficiency in homes — meaning many residents are now left in cold houses, and unable to afford heating.\n\n\n\n\n\n“An implicit reliance on cheap energy has now become increasingly challenged by the need to respond to climate change, and the rise in energy poverty.\n\n\n\n\n\n\"For a variety of reasons, energy costs have risen across Australia and this has brought to light the inefficiency of Australian homes, as households struggle to keep the heating on and pay the bills.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/from-swords-to-scarves-hellenic-dancers-pay-tribute-to-their-heritage/cw653yxnq",
    "title": "From swords to scarves, Hellenic dancers pay tribute to their heritage",
    "publish_date": "Fri, 13 Jun 2025 09:38:02 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "From swords to scarves, Hellenic dancers pay tribute to their heritage\n\nPublished 13 June 2025, 5:12 am\n\nSBS is marking 50 years of broadcasting. Across this period Australia has seen many generations of migration. One Greek community in Brisbane is paying homage to its roots and marking many decades of dancing together.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-artists-drowned-out-on-music-streaming-platforms/04de12otd",
    "title": "Australian artists drowned out on music streaming platforms",
    "publish_date": "Fri, 13 Jun 2025 09:30:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian artists drowned out on music streaming platforms\n\nPublished 13 June 2025, 5:10 am\n\nDigital technology has made it easier than ever to access music made by artists around the world. But it would appear Australian performers are being drowned out as a result. Of the top 10,000 global artists listened to by Australians - more than half are from the US. Only 8.4% are Australian.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/petrol-prices-may-rise-12c-per-litre-following-iran-attack/jlh7kyx52",
    "title": "Petrol prices may rise 12c per litre following Iran attack",
    "publish_date": "Fri, 13 Jun 2025 09:30:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/israel-bombs-iran-and-trump-takes-on-la/aanyoft39",
    "title": "Israel bombs Iran and Trump takes on LA",
    "publish_date": "Fri, 13 Jun 2025 08:15:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/world/tourists-sit-on-and-break-van-gogh-chair-at-italian-museum-20250614-p5m7ek.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tourists sit on and break Van Gogh chair at Italian Museum",
    "publish_date": "Sat, 14 Jun 2025 11:42:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Tourists sit on and break Van Gogh chair at Italian Museum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 3
  },
  {
    "url": "https://www.theage.com.au/sport/afl/blues-injury-blow-sam-walsh-out-for-six-weeks-with-foot-injury-20250614-p5m7e3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Blues injury blow: Sam Walsh out for six weeks with foot injury",
    "publish_date": "Sat, 14 Jun 2025 11:11:50 +1000",
    "category": "sports",
    "authors": [
      "Scott Spits"
    ],
    "text": "Carlton have been hit with another injury blow with confirmation that midfielder Sam Walsh will be sidelined for up to six weeks with a foot injury.\n\nThe Blues said 24-year-old Walsh reported foot soreness after training on Friday. They said there was no fracture in the foot and he would not need surgery.\n\nStar Carlton midfielder Sam Walsh. Credit: Getty Images\n\n“During yesterday’s main training session, Walsh reported foot soreness and has subsequently undergone a series of scans and consultation over the last 24 hours,” the Blues reported on Saturday.\n\nCarlton head to Western Australia for Sunday’s clash against the West Coast Eagles. They are also without key forward Harry McKay.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/lifestyle/david-beckham-knighted-in-king-charles-birthday-honours-20250614-p5m7e4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "David Beckham knighted in King Charles' birthday honours",
    "publish_date": "Sat, 14 Jun 2025 09:49:02 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "David Beckham knighted in King Charles' birthday honours\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/world/asia/flickering-green-and-white-inside-the-cabin-seconds-before-the-air-india-crash-20250614-p5m7dj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Flickering green and white’: Inside the cabin seconds before the Air India crash",
    "publish_date": "Sat, 14 Jun 2025 09:45:37 +1000",
    "category": "finance",
    "authors": [
      "Christopher Jasper",
      "Joe Pinkstone"
    ],
    "text": "In his final message to air traffic controllers, the plane’s pilot said the Boeing 787-8 Dreamliner had “no thrust”, was “losing power” and was “unable to lift”. The Dreamliner is designed to be able to climb and fly safely in the event of having only one engine operational. Speculation has been rife over what may have caused the crash, including the possibility of pilot error, faulty flaps, electrical problems or engine failure. A bird strike is a prominent hypothesis, and could have caused a catastrophic engine failure leading to such a situation, but there has been no evidence of flocks in the area at the time of the crash. “More than one thing went wrong here. The thing that might have started it, and I think probably did, was a loss of power,” Learmount said\n\n“Whether it was loss of power on one engine or both engines is not clear. But the failure of a single engine should not cause a crew to lose control of a modern airliner, even in the critical early climb phase. Loading “At the same time, simultaneous engine failures for unconnected reasons simply do not happen, based on the entire history of aviation. So if there was a failure of both, the question is what could have caused it.” The two engines on the plane are made by General Electric aviation and have a good safety history. On Friday, the Indian aviation regulator, the Directorate General of Civil Aviation, issued a notice to Air India to conduct more inspections of all of its 787-8 and 787-9 fleet with GE engines. This includes an inspection of the fuel monitoring systems, a test of the electronic engine control, a check of the hydraulics and a review of take-off parameters. “Power assurance checks” are also to be done on each plane within two weeks.\n\nDr Akhil Bhardwaj, a senior lecturer in aviation safety at the University of Bath, said he believed the DGCA was acting with an “understandable abundance of caution”. Last year, a United Airlines 787 jet, which has the same GEnx-1B engines as the doomed AI 171 flight, suffered an “uncontained left engine failure shortly after take-off” while flying from Singapore to San Francisco last year, according to a National Transportation Safety Board report. The engine ceased working at cruise altitude and set alight, according to the report, with the pilots managing to circle back and land the plane in Singapore using just one engine. A GE Aerospace spokesman said: “Safety is our top priority, and we support the action being taken by the Indian Directorate General of Civil Aviation for enhanced safety inspections of the Air India 787-8/9 fleet.\n\n“We continue to work closely with the appropriate regulatory and investigative agencies, and we are committed to providing all technical support necessary to understand the cause of this accident.” Loading Experts have suggested that the Dreamliner, which until Thursday had an unblemished safety record, also deployed its Ram Air Turbine (RAT) during the ill-fated 60 seconds between take-off and the crash. The RAT is a propeller-like device that sits in the fuselage between the wings and is only deployed in the most dangerous situations, to provide emergency power to vital electrical systems. Sambulo Matema, a lecturer in aviation management at University College Birmingham, said: “There is credence to this theory. In a complete power‑loss scenario, the aircraft transitions from engine‑supplied power to RAT power, and lighting anomalies can occur.”\n\nLoading “This behaviour aligns with established emergency procedures and the expected performance of aircraft electrical systems under severe duress. “After total power loss, the RAT deploys as a fallback power source. During this transition, green emergency lighting activates, and white lights may flash while onboard systems reboot and stabilise.” Learmount, who flew Hercules military transport planes around the Middle East during his RAF career, said the RAT would have sent power to the cockpit. The plane’s batteries would also have supported vital systems. However, neither could have done anything to keep the plane aloft in the event of its turbines spooling down.\n\nLoading All this suggests the fault lay in the engines. However, what could have caused them to shut down remains unclear. One theory is contaminated fuel. In 2010, a Cathay Pacific flight to Hong Kong almost ended in disaster when the pilot was unable to control engine thrust, leading it to land at twice the usual speed. It later emerged that fuel pumped into the plane had been contaminated with saltwater, damaging its engines over time. However, such problems are rare. Learmount said: “If you go looking for a potential cause of multiple engine failure, fuel contamination could do it. But again, history is against that potential cause in observed reality.”",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/another-aussie-even-schmidt-can-t-ignore-elephant-in-lions-room-20250613-p5m74y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Another Aussie’: Even Schmidt can’t ignore elephant in Lions room",
    "publish_date": "Sat, 14 Jun 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There is certainly precedence for picking players who originate from Australia, New Zealand and South Africa – former Crusaders winger Sean Maitland, Dylan Hartley and Matt Stevens, a Junior Springbok, all made the initial selection. There has been a long history of players from the SANZAAR countries finding their way into the Home Nations’ Test teams: in that sense this Lions tour is nothing different, and the ‘nothing to see here’ argument put forward in some quarters in the northern hemisphere holds water. There is no doubt, either, that all the SANZAAR Lions have displayed a level of personal commitment and passion for their adopted countries. But this is really a numbers game, and the volume of SANZAAR players in this year’s squad is atypical. In fact, it might never be repeated because World Rugby changed the eligibility laws at the end of 2020 to extend the residential qualification period from three years to five years.\n\nIt was a significant rule change advertised at the time to uphold the “integrity and sanctity” of the international game, but it came too late to affect this Lions squad. The second question of whether it matters is an emotive one. Lions icon Willie McBride raised his head above the parapet a few months ago and said he was “bothered” by the presence of eight players who were not born in either Britain or Ireland. McBride was subsequently labelled by some as an old man shouting at the clouds, but not so fast. This week, recently retired England halfback Danny Care voiced the same sentiment. “Whatever I say here, you’re going to get stick. You open yourself up to it,” he told the BBC Rugby Union Weekly podcast. “It doesn’t sit that well with me that some of these… both your starting wingers are going to be lads that never, ever once in their childhood or even their mid-20s ever dreamt of wearing a red Lions jersey.”\n\nLoading In other words, it does matter, and it matters to British and Irish players – this is not simply a topic being beaten up by the venomous Australian media to unsettle the tourists. Schmidt, of course, has to be careful on the subject. As Ireland coach he benefited from the services of both Bundee Aki, a New Zealander of Samoan heritage, and CJ Stander, a South African, in a famous win against the All Blacks in 2018. And, as he said earlier in the week, he coached Bealham as well. It would be hypocritical of him to use the SANZAAR players as a stick to beat the Lions with. But for the rest of us, there is the nagging question of why the Lions have been permitted to turn SANZAAR players against the Wallabies in a series that is ultimately designed to test the quality of the rugby that is being played within the respective borders of the Australia and the British and Irish Isles?",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/star-of-sandpapergate-gives-australia-a-test-batting-lesson-20250613-p5m76d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star of Sandpapergate gives Australia a batting lesson, takes Proteas to within 69 runs of victory",
    "publish_date": "Sat, 14 Jun 2025 09:09:38 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "London: A few days ago, Pat Cummins was queried about some unresolved elements of the 2018 “Sandpapergate” series in South Africa by an English interviewer, and gave the blunt reply: “I don’t want to talk about it.”\n\nOne man with much fonder memories of that encounter is Aiden Markram, then early in his Test career. Markram was actually in the middle when the sandpaper incident unfolded in Cape Town. His security at the crease, amounting to 480 runs at 60 for the series, had helped drive Australia to ugly extremes.\n\nAustralia’s wicketkeeper Alex Carey, right, reacts as South Africa’s Aiden Markram plays a shot on day three. Credit: AP\n\nThose runs showed Markram to be a player of quality and character, after he had started the tour being goaded by David Warner for a run out in which AB de Villiers was dismissed in Durban.\n\nThough South Africa lost the game, Markram’s 143 in the chase was a century of top class. By sculpting an unbeaten 102 in the company of his captain Temba Bavuma in the World Test Championship being decided at Lord’s to pull the Proteas to within sight of victory, he has now played an innings to surpass it. At stumps on a match-defining day in London, Markram had guided the Proteas to 2-213, needing just another 69 runs to pull off a remarkable win.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/smith-taken-for-scans-after-finger-left-at-sickening-angle-20250614-p5m7db.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smith’s West Indies tour in doubt after finger left at sickening angle",
    "publish_date": "Sat, 14 Jun 2025 09:07:24 +1000",
    "category": "sports",
    "authors": [
      "Daniel Brettig"
    ],
    "text": "London: Steve Smith’s West Indies tour has been thrown into doubt after he was taken to hospital for x-rays on a compound dislocation to his right little finger.\n\nSmith’s digit was left bent at a sickening angle after he dropped a sharp chance offered by Temba Bavuma on the third afternoon of the World Test Championship final at Lord’s, having moved up very close to the bat at slip.\n\nAustralia’s Steve Smith reacts in pain as he leaves the field. Credit: AP\n\nA Cricket Australia spokesperson confirmed that Smith was set to be taken for scans on the badly damaged finger. The first Test against the West Indies in Barbados is scheduled for June 25, a little less than two weeks from now.\n\n“Steve Smith has suffered a compound dislocation of his right little finger while fielding in the slip cordon during the ICC Men’s World Test Championship final against South Africa at Lord’s,” A CA spokesperson said.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://au.news.yahoo.com/another-clue-drops-as-frantic-hunt-for-powerball-100-million-winner-intensifies-222900193.html",
    "title": "Another clue drops as frantic hunt for Powerball $100 million winner intensifies",
    "publish_date": "2025-06-13T22:29:00Z",
    "category": "finance",
    "authors": [],
    "text": "More than 24 hours after the life-changing Powerball $100 million draw, Australia’s newest multimillionaire remains a complete mystery — and the clock is ticking.\n\nMore than 34 hours after the winning numbers were drawn, officials from The Lott are yet to hear from Thursday night’s mystery Powerball $100 million division one winner. Source: The Lott\n\nMore than a day after the life-changing numbers were drawn, Australia’s newest multimillionaire is still a mystery — and officials are desperately urging Powerball players in Sydney’s east to check their tickets immediately.\n\nOne ticket, purchased at Bondi Junction Newsagency & Internet Café on Oxford Street, holds the sole division one winning entry from Thursday night’s $100 million Powerball draw 1517.\n\nBut with no registered player details linked to the ticket, The Lott still has no way of contacting the winner — and can only wait, and hope, that someone soon realises they’ve become one of the country’s richest individuals.\n\n\"With a winning entry tucked away in their car, wallet, or stuck on their fridge door, one New South Wales player is walking around completely oblivious to the fact their life has forever changed,\" The Lott spokesperson Eliza Wregg said.\n\nADVERTISEMENT\n\n\"There are 100 million reasons why Sydney’s eastern suburbs players should check their tickets today.”\n\nThe winning numbers drawn Thursday, June 12, were 28, 10, 3, 16, 31, 14 and 21. The Powerball number was 6. For Bondi Junction Newsagency & Internet Café, the news is already legendary.\n\nSearch for mystery Powerball $100 million winner continues\n\n\"Wow. It’s legendary to hear we’ve sold the winning ticket in Thursday night’s Powerball draw worth $100 million,\" said store owner Manish.\n\n\"This is by far the biggest winning entry we’ve ever sold. The team are thrilled to hear the winning news. I’ll be rewarding the particular staff member who sold the winning ticket, too. I’m hoping it’s one of our regular customers, but you never know — it could be a tourist too. We’re located right next to the closest station to Bondi Beach, so you never know.\"\n\nThe Lott confirmed that this is the only Division One winner nationally in draw 1517, meaning just one lucky ticket holder is entitled to the entire nine-figure prize.\n\nADVERTISEMENT\n\n\"Imagine discovering you’re suddenly a multi-millionaire! You could immediately retire, take the trip of your dreams, or spoil those nearest and dearest to you,\" Wregg added.\n\n\"All you need to do is visit TheLott.com, scan your ticket on The Lott app or visit one of our friendly retailers to find out if you are our division one winner.\"\n\nIf the winner comes forward, they’ll join the ranks of Powerball royalty. Last year alone, 21 Australians shared in over $773 million worth of division one prizes — including a record $150 million win by a single Adelaide man. Until then, the nation waits — and watches — to see who will step forward to claim one of the biggest lottery prizes ever handed out in Australia.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 38
  }
]