[
  {
    "url": "https://www.9news.com.au/national/primary-school-carpark-carjacking-lara-victoria/950d9f65-a11b-4839-aefe-4e36a766584c",
    "title": "Woman, 56, targeted in daylight carjacking at Victorian primary school",
    "publish_date": "Wed, 06 Aug 2025 01:46:53 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/winner-of-oz-lotto-15-million-dollar-prize-plans-caravan-holiday/a18a42b3-d4dd-4a70-a876-a2eec9b346e9",
    "title": "Aussie lottery winner reveals how he'll spend $15 million fortune",
    "publish_date": "Wed, 06 Aug 2025 00:40:17 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "P﻿atience has paid off big time for a Victorian man who became an instant multi-millionaire in last night's Oz Lotto draw.\n\nThe resident of Horsham in the state's west pocketed $15 million by holding one of the two division one winning entries in draw 1642.\n\nThe stunned father and grandfather said he always thought he'd win the lottery since he started playing decades ago.\n\nREAD MORE: ﻿ Dangerous new substanice hitting Aussie streets\n\nThe winner of last night's division one Oz Lotto draw says he believed he'd always win the prize. (The Lott)\n\n\"Honestly, I always thought I was going to win.\n\n\"Ever since I was in my 20s, I've thought, 'one day I'm going to win'. It's just taken a while,\" he told an Oz Lotto official.\n\nHe says he'll help his children pay their home mortgages with his newfound wealth, but also plans to splash some of the money on a motoring passion.\n\n\"A new car and caravan are what I want so we can do a few trips, maybe eventually do a lap around Australia,\" he said.\n\nHis 18-game QuickPick entry was purchased on The Lott website – the official home of Australia's lotteries.\n\nThe winning numbers last night in draw 1642 were 11, 32, 40, 42, 38, 29 and 34, while the supplementary numbers were 15, 3 and 47.\n\nThe other division one winning entry was from Queensland.\n\nThere are more chances to win big with tomorrow's Powerball offering $12 million, while next Tuesday's Oz Lotto has $3 million up for grabs.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/sydney-water-gross-plumbing-video-flushing-household-items/fe1841fe-50ce-45cc-abb4-ceae262fa51d",
    "title": "Horror footage reveals result of flushing household products down the toilet",
    "publish_date": "Wed, 06 Aug 2025 01:13:59 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Sydney Water has just revealed, in gross and gory detail, exactly what can happen when you flush household items down the toilet.\n\n﻿The water utility service shared footage of a pipe that appeared to be overflowing with sewage after experiencing a blockage.\n\nOriginally ﻿captured by SGT Plumbing, a business located near the Mornington Peninsula, the video left nothing to the imagination.﻿\n\nCrazy footage revealed what happens when you flush the wrong items down the toilet. (Facebook/Sydney Water/SGT Plumbing)\n\n\"Still treating your toilet like a bin? Then watch this,\" Sydney Water captioned the clip.\n\n\"While things like wet wipes, tissues, cottons buds and sanitary products might disappear when flushed, once past the s-bend, they can get caught and block household pipes, causing toilets to backflow into bathrooms.\"\n\nBlockages like the one in the clip are commonly caused by unflushable items in toilets.\n\nNon‑flushable wet wipes (which don't comply with the Flushable Products Standard [AS/NZS 5328:2022]) contribute to 75 per cent of wastewater blockages in Sydney.\n\nREAD MORE: House committee issues subpoenas for Epstein files and depositions with the Clintons\n\nOther common ﻿unflushable items that contribute to blockages include household staples like paper towel, tissues and cotton buds.\n\nHair is another major contributor and fats, oils and grease can cause blokages when poured down kitchen drains.\n\nAll of these contributors can cause wastewater to ﻿overflow into homes, yards and local waterways, posing significant health risks.\n\nWastewater contains harmful microorganisms including bacteria and viruses that can cause illnesses like gastroenteritis in humans.\n\nWastewater overflows can also harm animals and the environment, and the blockages that cause them can be expensive to fix.\n\nBlockages in pipes on private property are the responsibility of the residents, not Sydney Water, and the cost to get a pl﻿umber out to clear it can be high.\n\nThankfully, blockages are avoidable.﻿\n\n\"Only flush the 3Ps - Pee, Poo, and toilet Paper - to steer clear of nasty (and expensive) plumbing nightmares,\" Sydney Water wrote on Facebook.\n\nAnd check that any 'flushable' products ﻿comply with the Flushable Products Standard before you even think about putting them in the toilet.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/entitled-behaviour-family-claims-their-parking-space-with-road-cone/a0ca3a77-f160-4b3b-9dfd-d21c778c5269",
    "title": "'Entitled behaviour': Family claims 'their' parking space with road cone",
    "publish_date": "Tue, 05 Aug 2025 21:36:19 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The card left on a New Zealand man's windscreen didn't pull any punches: \"Hey! You absolutely suck at parking!\" it read.\n\nFlipping it over, the man saw a note in thick black pen. \"MOVE YOUR CAR!\"\n\nBut the man, who asked to stay anonymous, hadn't done anything wrong. His vehicle, parked opposite his home on a residential street in Milldale, north Auckland, was not in a reserved or disabled spot - it was parked perfectly legally.\n\nHe penned a response on the back - \"street parking is public\" - and placed it on the windscreen of his neighbour's car.\n\nOccupants of an Auckland house have been using a road cone to mark out \"their\" parking spot. (Reddit)\n\nWhile the card was unwelcome, it wasn't a surprise. The same neighbour who left the card had been using a road cone to mark \"their\" space, reserving one of the two street parking spaces outside their home.\n\n\"The cone situation has been going on for a while,\" the man told Stuff .\n\nHe said the neighbour, who lived in a property with a double garage and driveway, kept the cone in his boot, putting it in place whenever he left home in the afternoons.\n\nWhen Stuff visited on Tuesday, a woman, who did not want to be named but who said she was one of the owners of the house, answered the door.\n\nShe said: \"It's not really a public parking space. People keep parking their cars on our spot, we've got three vehicles and this is the parking allocated for our home and that's the only reason why.\n\n\"When we leave for five minutes and we come back, then we have to park way up in the street.\"\n\nThis note was no surprise to the resident who found it on his windscreen. (Reddit)\n\nShe said it was about \"common sense\". They had told the owner of the car the note was left on that they didn't mind them parking there during the day, but that they wanted the space from 5pm when they were all home.\n\n\"They are moaning about it, but like we said and explained to them, have a little bit of common sense.\n\n\"We said we don't mind you parking there but my husband is coming home later. Where the hell is he supposed to park?\"\n\nStuff sent photos from the scene to Auckland Transport. A member of their media team said he wasn't sure if the cone came from a contractor, or was privately owned.\n\n\"Regardless, in this case, it's being cheekily used to reserve a parking space, which is a no-go.\n\n\"Parking spaces on the road, including this parking space on this street… are for everyone to use.\"\n\nThe cone in the parking spot on a Milldale street. (Reddit)\n\nUniversity of Auckland Professor Dr Tim Welch, who studies transportation, infrastructure and urban modelling, said such territorial behaviour was surprisingly common.\n\n\"It's the perception you have ownership over everything that's in front of your property, even though it's technically open to everyone.\"\n\nHe called the behaviour \"erratic and irrational\", pointing out that we don't see the same kind of ownership over footpaths.\n\n\"You don't see people blocking off those spaces.\"\n\nWelch said driver psychology often meant they felt they had priority over other modes of transport, which resulted in rageful feelings when slowed down by traffic or cyclists.\n\n\"That comes out in dangerous driving... blocking off your car space is an extension of that.\"\n\nUniversity of Canterbury's Dr Simon Kingham, who specialises in the effect of urban environment on health and wellbeing, called the behaviour \"slightly entitled and selfish\".\n\n\"None of us own streets outside our house, but a lot of people feel the parking space outside is theirs, but it's a public space.\n\n\"It's not great in terms of community well being and cohesion.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/sydney-airport-australia-digital-passenger-card-qantas/cda2f695-bc9b-4ffe-b444-5270ffb28357",
    "title": "How digital move could speed up travel at Australia's biggest airport",
    "publish_date": "Tue, 05 Aug 2025 23:09:39 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Sydney Airport has unveiled a trial of a digital incoming passenger card to speed up travel at Australia's biggest gateway.\n\nIn partnership with Qantas, passengers flying from Auckland or Queenstown in New Zealand will be able to complete their declaration digitally before they fly, rather than having to fill out a paper form on the flight.\n\nWhen these passengers land at Sydney, they will receive a digital pass with a QR code, which they show to border and biosecurity officers.\n\nThe trial is only available to Qantas customers on certain flights from New Zaland cities. (Getty Images/iStockphoto)\n\nAs it stands, the trial is only available to Qantas customers via the airline's app.\n\nMinister for Home Affairs and Immigration Tony Burke said travellers will benefit from the new trial.\n\n\"When people arrive in Sydney, I want them out of the airport and experiencing the city as fast as possible,\" he said\n\n\"Extending the trial to Australia's busiest airport means every day, hundreds more passengers will have a more seamless travel experience.\"\n\nREAD MORE: House committee issues subpoenas for Epstein files and depositions with the Clintons\n\nThe trial is part of a wider effort to work towards contactless travel in the future, which will utilise digital credentials and facial recognition, which is claimed will make journeys easier for travellers.\n\nSydney Airport also announced 32 new SmartGate kiosks would be deployed by early next year.\n\nThe airport claims will allow frontline officers to assist travellers requiring extra support.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/prince-harry-cleared-of-bullying-sophie-chandauku-sentebale-head/105619268",
    "title": "Prince Harry cleared of bullying charity boss",
    "publish_date": "Wed, 06 Aug 2025 02:14:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prince Harry has been cleared of bullying following a dispute with an African charity he founded.\n\nThe charity, Sentebale, was at the centre of a boardroom dispute in late March and April when its chair, Sophie Chandauka, publicly accused Prince Harry of \"bullying\".\n\nDays earlier, Harry and co-founder Prince Seeiso of Lesotho announced they were resigning from the charity they established in 2006 after the trustees quit when Ms Chandauka refused their demand to step down.\n\nHarry launched the charity in honour of his mother, Princess Diana, to help young people with HIV and AIDS in Lesotho and later Botswana.\n\nCharity given plan to address governance weakness\n\nPrince Harry (second from right) was criticised for bringing a camera crew to a polo benefit. (Reuters: Marco Bello)\n\nAfter a months-long inquiry, the UK-based Charity Commission \"found no evidence of widespread or systemic bullying or harassment, including misogyny or misogynoir at the charity\".\n\nIn its conclusions published on Wednesday, it \"criticised all parties to the dispute for allowing it to play out publicly\", saying it had \"severely impacted the charity's reputation\".\n\nThe commission added there was \"a lack of clarity in delegations\" and this led to \"mismanagement in the administration of the charity\".\n\nIt issued the charity with a plan to \"address governance weaknesses\".\n\nPair urged not to lose sight of charity\n\nSophie Chandauka voiced her concerns in an interview on Sky News in March. (Sky News)\n\nPrince Harry said in a statement an April that the events were \"heartbreaking to witness, especially when such blatant lies hurt those who have invested decades in this shared goal\".\n\nMs Chandauka accused the Duke of Sussex of trying to force her out through \"bullying [and] harassment\" in an interview with Sky News.\n\nWhat happens next for Prince Harry's charity? Photo shows A close up photo of Prince Harry's face The Duke of Sussex has been accused of \"harassment and bullying at scale\" by the chair of a charity he founded.\n\nIn one of her examples, Ms Chandauka criticised the prince for bringing a Netflix camera crew to the charity's polo fundraiser last year and for his wife Meghan's unplanned appearance at the event.\n\nThe accusations were a fresh blow for the prince, who kept up only a handful of his private patronages, including with Sentebale after a dramatic split with the royal family in 2020, leaving the UK to live in North America with his wife and children.\n\n\"Moving forward, I urge all parties not to lose sight of those who rely on the charity's services,\" the commission's chief executive David Holdsworth said.\n\nPrince Harry chose the name Sentebale as a tribute to Diana, who died in a Paris car crash in 1997 when the prince was just 12. It means \"forget me not\" in the Sesotho language and is also used to say goodbye.\n\nAFP",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/gold-coast-suns-essendon-afl-round-24-fixture/105619322",
    "title": "Critical game in AFL finals race scheduled for a Wednesday night",
    "publish_date": "Wed, 06 Aug 2025 02:00:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Gold Coast Suns' bid for their maiden finals appearance could go down to the last Wednesday in August.\n\nThe AFL has released its round 24 fixture, including the postponed game between the Suns and Essendon that was unable to be played in Opening Round due to Cyclone Alfred.\n\nThat extra game will now be played during what is a pre-finals bye week for the other top eight sides, scheduled for a 7:20pm bounce at Carrara Stadium on Wednesday August 27.\n\nThe Suns are one of a number of sides battling for the final spots in the top eight, and there is every chance that match will determine their fate.\n\nEssendon and Gold Coast's round 24 games against Carlton and Port Adelaide will be played on Thursday night and Friday night respectively.\n\nTwo other crucial round 24 games have been scheduled for the last Sunday of the home-and-away season.\n\nLoading...\n\nThe Western Bulldogs play Fremantle at Docklands at 3:15pm on August 24, while Brisbane hosts Hawthorn at the Gabba at 7:20pm that night.\n\nThe results of those two games are also likely to have a massive say in the final make-up of the top eight.\n\n\"Round 24 is set to deliver an exciting finish to the home and away season, with several matches likely to influence the final eight,\" AFL head of strategy and scheduling Josh Bowler said.\n\n\"The round will start on Thursday night and finish the following Wednesday to provide the Gold Coast Suns and Essendon sufficient days' break between matches, with their rescheduled Opening Round match being played during round 24, in addition to their respective clashes against Carlton and Port Adelaide.\n\n\"To avoid a clash between the Western Bulldogs' round 24 AFL match and their round two AFLW match, we have also adjusted the start time of the AFLW match between Richmond and the Western Bulldogs on Sunday, 24 August, and subsequently the AFLW match between Essendon and the West Coast Eagles.\n\n\"The revised start times give Bulldogs fans the opportunity to watch both their club's teams play on the same day, and we thank everyone involved in working through these changes.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/what-to-know-about-doctors-using-ai-digital-scribes/105590878",
    "title": "What you need to know about doctors using AI digital scribes",
    "publish_date": "Wed, 06 Aug 2025 01:58:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Melissa Street's GP and psychologist both asked if they could start using artificial intelligence to record notes and a clinical summary of her appointments, she agreed to try it.\n\n\"I said yes as it allows my doctor to actually listen to me rather than being distracted trying to type everything I say,\" says the university student from Kabi Kabi/Sunshine Coast.\n\nNearly one in four GPs nationally are believed to be using AI digital scribes for note-taking, according to the Australian Medical Association (AMA). Other practitioners, like psychologists and podiatrists, are also using the technology.\n\nHere's what experts say we need to be aware of when deciding whether to consent to its use.\n\nWhat is an AI digital scribe?\n\nDigital scribes are software applications that turn an audio recording into text by recording the conversation between a clinician and a patient (via a phone, tablet or computer microphone, or a dedicated sensitive microphone).\n\nThe AI software then uses the transcript from the conversation to generate a written summary that goes into the patient's medical record or a letter that can be forwarded to other clinicians.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\n\"We've had digital scribes for a while now,\" says Yves Saint James Aquino, a research fellow at the Australian Centre for Health Engagement, Evidence and Values at the University of Wollongong.\n\n\"But the new stuff that we have are the scribes that are using large language models (LLM) to summarise the text.\n\n\"So, it's not just transcribing exactly … they are now summarising a conversation or a clinical interaction based on [an] audio recording.\"\n\nHe says it is up to the clinicians to check the clinical summary, letters or notes for accuracy.\n\nCan I say no to the use of AI and storage of my medical data?\n\nJennifer Morris, a patient safety advocate from Melbourne/Naarm, has recently written a guide to the technology for consumer and community representatives.\n\nPatient safety advocate Jennifer Morris says patients can ask to see what the technology is producing to check its accuracy. (Supplied: Jennifer Morris)\n\nShe believes one of the things that can be helpful for people deciding whether they want to use the technology is to see what it's producing.\n\n\"[Patients] have the right to access their medical records and decide for themselves whether they think it's accurate enough,\" she says.\n\n\"I've been looking at letters that it's been writing for me [in consultations] and decided it's not meeting my standard of accuracy.\n\n\"So, I'm choosing not to have it in my own consultations.\"\n\nExperts say clinicians should be able to clearly demonstrate to patients what the digital scribe software is, how it works and where the data is being stored.\n\n\"If the data is stored or processed outside of Australia, the developers and users, including clinicians, should make sure that the location outside Australia has the same level of privacy protection and privacy laws,\" Dr Saint James Aquino says.\n\nWhat are the regulations for AI digital scribes?\n\nDr Saint James Aquino says patients \"have to be informed every time it [digital scribe technology] is being used\", even if they have previously consented to it.\n\nYves Saint James Aquino says more studies are needed to understand the effectiveness of AI digital scribes in health care. (Supplied: Dr Yves Saint James Aquino)\n\nHe says most of the software apps being used aren't regulated because they \"don't meet the legal definition of a medical device\" by the Therapeutic Goods Administration (TGA).\n\n\"So, what consumers and patients should know is that a lot of AI scribes are not really tested in the same way that we expect a medical product, a pharmaceutical product or a medical device should be tested.\n\n\" It means we don't really know the implications or we don't really know any evidence of safety or long-term harm. \"\n\nHe says while clinicians report the technology's positive benefits, such as saving time and effort and allowing more interaction with patients, further studies are needed because current evidence of its effectiveness \"is very anecdotal\".\n\nLast month, the TGA released a new report on how it was dealing with the \"rapid innovation\" of artificial intelligence in clinical settings.\n\nThe Australian Health Practitioner Regulation Agency has also developed a code of practice for clinicians using AI.\n\nWhat are the potential risks of AI digital scribes?\n\nMs Morris says AI only works well if it is trained with high-quality data.\n\nPrivacy concerns over GPs' AI scribes Photo shows A man sits at a desk with two computer screens behind him. The first question your GP asks at your next appointment could be \"do you mind if artificial intelligence listens along?\"\n\nShe says some large language models may not \"represent diverse people\" and they may also be a problem if the data they are built on is not from or about \"Australia or Australians\".\n\n\"So, if you have AI that's trained on a population, for example, of mostly white, wealthy, middle-aged people, it may not be as effective.\n\n\"Australia is, of course, a very multicultural country and that is actually important from a scientific, research and medical point of view.\n\n\"Because different people from different backgrounds, ethnic backgrounds, cultural backgrounds have different needs [and] respond to health care differently.\n\n\" So, it's really important that the data that AI is trained to reflect that diversity. \"\n\nThe TGA says clinicians have reported that \"digital scribes frequently propose diagnosis or treatment options for patients beyond the stated diagnosis or treatment a clinician has identified during consultations\".\n\n\"This functionality indicates digital scribes meet the definition of a medical device and require pre-market approval and inclusion in the Australian Register of Therapeutic Goods (ARTG).\"\n\nIt says a review of digital scribes is needed.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/disabled-men-in-mainstream-sports-nfl-football/105569408",
    "title": "'Like a monkey in the circus': The triumphs and trials of disabled men in mainstream sport",
    "publish_date": "Wed, 06 Aug 2025 01:04:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Even 55 years on, it's one of those otherworldly, scarcely believable sporting moments.\n\nThe New Orleans Saints were in turmoil, having just fired their coach after a disastrous start to the 1970 NFL season.\n\nBut somehow, they had just about kept pace with the Detroit Lions for the entirety of the sides' early November David vs Goliath clash.\n\nAnd with only seconds on the clock, a generational Saints kicker had a shot at a miracle.\n\nHe was one of American football's best, but even for Tom Dempsey, this, surely, was just too far out.\n\nAt the time, the league record for the longest field goal was 56 yards.\n\nDempsey's potentially game-winning kick would be taken from 63.\n\nBut off a casual, barely three-step walk-up, his contact was true.\n\nAnd straight.\n\nDempsey's record would stand for more than 40 years. (Getty Images: Bettman)\n\n\"I was on my way into the locker room and basically thought I'd stop and watch him miss it,\" Detroit Lions linebacker Wayne Walker told NFL films years later.\n\n\"But I heard his foot hit the ball — it was a sound unlike I've ever heard.\n\n\"It almost sounded like a cannon going off.\"\n\nThe ball soared and flew over two thirds of the field, maintaining its height just long enough to sneak through and over the goalposts.\n\nNo-one in the stadium could quite believe what they'd witnessed — the television commentators were beside themselves as Dempsey was mobbed by his teammates and jubilant fans stormed the pitch.\n\nIt was a one-in-a-million moment, made possible by a perfect storm of chance, skill and sheer spectacle.\n\nAnd one made even more remarkable by the fact that Dempsey scored that goal with only half a kicking foot.\n\nThe few men with disability to 'make it'\n\nBorn without toes on his right foot and fingers on his right hand, Dempsey is one of just a handful of men with disability to have made a mark on elite mainstream sport.\n\nThis contrasts with elite women's sport, in which representation of disability and neurodivergence have become more commonplace in recent years, and runs parallel to a number of areas — including LGBTQIA+ participation — in which men's sport lags behind.\n\nLoading Instagram content\n\nBut a decade before soccer player Carson Pickett — the first player with limb difference to represent the US women's team — went viral for images of her 'fist-bumping' a two-year-old boy also born without a left hand, Spaniard Álex Sanchez was blazing his own trail in elite men's soccer.\n\nIn 2009, Sanchez became the first player with limb difference to play in La Liga, the top flight of Spanish football.\n\nHaving retired from the professional game earlier in 2025, Sanchez identifies providing representation for children and footballers with disability as his most meaningful sporting achievement.\n\nHowever, for large swathes of his early career, his relationship to disability was fraught.\n\n\"The only problem I had was tying my boots when I was a kid,\" Sanchez told ABC Sport.\n\n\"I actually didn't realise I had a disability — the disability wasn't important, I was a kid like the rest of them.\n\n\"The only thing important was to score the goals.\"\n\nGrowing up, the only thing that mattered to Sanchez was scoring goals. (Supplied: Alex Sanchez)\n\nBut as a teenager slowly creeping towards a professional debut, Sanchez began to wonder how his impairment would be perceived by a football mad Spanish public.\n\nAnd when he was eventually named in Real Zaragoza's match-day squad for the first time, Sanchez was shocked by the media frenzy.\n\nDespite being a no-name 19-year-old debuting for one of the league's smaller sides, Sanchez was featured on the front page of a Spanish sport newspaper with a daily readership in the millions.\n\nAccompanying his image was a crude Spanish word Sanchez says is used to refer to \"people with a disability like mine\".\n\n\"I was like, 'what the f*** is this?',\" Sanchez said.\n\n\"It was crazy, it was not as sensitive as I wanted.\n\n\"As a 19-year-old boy you are not ready to deal with some things.\"\n\nSanchez's career featured successful stints in Spain, India and Australia. (Supplied: Alex Sanchez)\n\nAfter that, the media opportunities came thick and fast, but it wasn't long before Sanchez decided to stop talking to the press.\n\n\"All of their questions related to disability and some of them were not the way I wanted to speak about disability,\" Sanchez said.\n\n\"It was like 'oh, this guy can't play PlayStation, or tie his laces, or do a throw-in'.\n\n\"Honestly, I felt like a monkey in the circus.\"\n\nDempsey's 'sledgehammer' shoe causes a stir\n\nAfter his record-breaking NFL kick, Dempsey had a similar experience of alienation from his own narrative.\n\nDempsey, who'd had much success kicking barefoot as a college player, commissioned the design and construction of a bespoke football boot upon his entrance into the NFL in the late 1960s.\n\nLoading Instagram content\n\nThe shoe, worth nearly US$2,000 in today's money, was built to accommodate Dempsey's unconventional foot and featured an almost 5-centimetre block of leather at its front.\n\nIt was while wearing the boot that Dempsey would score his career defining three-pointer, and almost immediately, the fairness and legality of the instrument was called into question by opposition players and officials.\n\nDallas Cowboys general manager and major NFL powerbroker Tex Schramm was a prominent critic, declaring the toeless Dempsey had an \"unfair advantage\" and comparing his boot to a golf club with a \"sledgehammer surface\", even though its legality had long since been cleared with the NFL and that Dempsey kicked so inconsistently with it that the Saints released him after the 1970 season.\n\nDisabled women changing mainstream sport Photo shows A woman is running on a track, with the sun setting behind her. Telaya Blacksmith is facing a crossroads, to continue her Paralympic journey, or pursue Aussie Rules — she is one of several disabled women building a name in mainstream sport.\n\nSeven years later, in 1977, the league implemented what would become colloquially known as the \"Tom Dempsey rule\", which states players with an artificial limb are required to wear footwear that conforms to the dimensions of a standard boot.\n\nThat's despite the fact no evidence was ever presented to support the claim Dempsey had an unfair advantage, and flies in the face of an ESPN Sport Science report that claimed the specialty shoe actually hindered Dempsey's kicking ability.\n\nIt was a ruling that Dempsey, who spent his post-football career in auto sales before passing away in 2020 after contracting coronavirus, never agreed with.\n\nDempsey never believed the speculation surrounding his kick was warranted. (Getty Images/Sports Illustrated: Greg Foster)\n\n\"Unfair, eh? How 'bout you try kicking a 63-yard field goal to win it with two seconds left and you're wearing a square shoe,\" Dempsey was quoted as saying in response to speculation over the legality of his kick.\n\n\"Oh yeah, and no toes either.\"\n\nThe importance of role models in elite sport\n\nAway from the media spotlight, Sanchez's early career saw him bounce between Spain's top three divisions.\n\nDuring those years, there was one moment that remained at the back of his mind.\n\n\"The day before my debut, one kid with a disability like mine came to my hotel to say thank you — thank you for being an inspiration, thank you for playing in La Liga,\" Sanchez said.\n\n\"I couldn't believe it at that point.\"\n\nSanchez spent the last half of his career as an outspoken disability advocate. (Supplied: Alex Sanchez)\n\nAs Sanchez's career progressed, the lingering impact of that moment inspired his media re-emergence.\n\n\"I knew I couldn't be shy, I couldn't stop speaking about disability, I had to do something — because there're a lot of kids like him,\" Sanchez said.\n\n\"His mum came to the hotel as well. My mum didn't have this kind of example when I was growing up — there was no example in Spain, there was no example in football.\"\n\nLoading Instagram content\n\nBy the time Sanchez made the adventurous decision to move to Australia and sign for NPL NSW side Sydney Olympic, he was already an outspoken disability advocate.\n\nSanchez was a huge success in the Harbour City, scoring 34 league goals in 44 games and leading Olympic to its first championship in three decades.\n\nFor Sanchez, in terms of lifestyle, accessibility and disability, things off the pitch were just as good as his form on it, and his time in Australia is memorialised by a tattoo on his arm.\n\n\"It was the best time of life, playing for Sydney Olympic,\" Sanchez said.\n\n\"There wasn't a bad day in Australia.\"\n\nAfter a Spanish homecoming, a couple years playing in India and the completion of no less than four university degrees, Sanchez retired from professional football in early 2025 with no doubts about his crowning achievement.\n\n\"It was the most positive point of my career, playing in La Liga with my disability,\" Sanchez said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/high-court-upholds-helensburgh-coal-sacked-workers-ruling/105618052",
    "title": "High Court upholds ruling coal company breached Fair Work Act",
    "publish_date": "Wed, 06 Aug 2025 00:51:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A coal company which sacked 22 workers at the outset of the COVID-19 pandemic has lost a High Court challenge to rulings that the sackings breached the Fair Work Act.\n\nHelensburgh Coal sacked the workers from its Metropolitan Coal Mine north of Wollongong in June 2020, after a significant drop in the price of metallurgical coal.\n\nThe workers argued their dismissal was unfair because some work at the mine was being performed by contractors, and theirs was not a case of genuine redundancy.\n\nMultiple hearings in the Fair Work Commission resulted in a finding of unfair dismissal, which was upheld in the Federal Court.\n\nIn a unanimous decision, the High Court has dismissed the company's appeal.\n\nThe majority judgment pointed to the context of the Fair Work Act as a reaction to the Howard government's WorkChoices legislation.\n\nUnder WorkChoices, a dismissal which was deemed \"harsh, unjust or unreasonable\" was permitted for \"genuine operational reasons\".\n\nThe Fair Work Act states a dismissal is not a genuine redundancy \"if it would have been reasonable in all the circumstances for the person to be redeployed\".\n\n\"There has therefore been a significant rebalance in favour of employees since the enactment of the Fair Work Act,\" the High Court ruled.\n\nThe case will now go back to the Fair Work Commission to assess what remedy the workers are owed.\n\nPeabody owns the Metropolitan Mine in Helensburgh. (Supplied.)\n\nCompany dismissed 90 workers\n\nHelensburgh Coal engaged labour hire companies Nexus and Menster in August 2018 and March 2020 respectively.\n\nA drop in the coal price in the early stages of the pandemic led to its decision to reduce production at the mine, requiring only four crews instead of the usual five.\n\nThe company committed to insource some, but not all, of the work being done by Nexus.\n\nA total of 90 permanent employees were ultimately dismissed, 47 of whom, including the 22 litigants, did not agree to their termination.\n\nA major point of difference in the case was whether an employer must consider restructuring its operations and freeing up work for the otherwise redundant employees.\n\nHelensburgh Coal argued it only had to consider whether any jobs were available at the time of the sackings.\n\n\"Redeployment does not mean, and should not be confused with, replacement,\" its submissions said.\n\nThe High Court unanimously upheld the Federal Court's ruling. (ABC News: Matt Roberts)\n\nThe workers disagreed, and submitted it was up to the Fair Work Commission to assess whether any potential changes were reasonable.\n\nThey said the concept of redeployment \"envisages re-arrangement, re-organisation or transfer and is not limited to an existing vacant job, position or task\".\n\nThe workers argued Helensburgh Coal owed no obligations to either of the labour hire firms it had engaged in the months and years prior.\n\nIn a statement, the Mining and Energy Union said the High Court had delivered justice for the workers, and set an important precedent about corporate responsibility to a workforce.\n\n\"Today the High Court has been clear: permanent workers cannot be removed in favour of contractors through dodgy corporate restructuring,\" MEU General Secretary Grahame Kelly said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/country-to-couture-fashion-show-marks-10th-anniversary/105612748",
    "title": "Australia's finest First Nations' fashion hits Country to Couture runway",
    "publish_date": "Wed, 06 Aug 2025 00:24:51 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "This week marks the 10th anniversary of Darwin's biggest fashion show, Country to Couture, with the event shining a spotlight on some of Australia's finest First Nations artists.\n\nTwenty collections were featured across two sold-out runway shows, with more than 80 artists involved in their creation — from independent creatives to established brands and those who have developed their work through community art centres.\n\nThe Tabilbahn Yunggulba (Saltwater Tidal) collection draws upon the storytelling of the Quandamooka people. (ABC News: Pete Garnish)\n\nClaire Summers, executive director of the Darwin Aboriginal Art Fair Foundation, which established the Country to Couture event, said it \"started with very humble beginnings and has now turned into a spectacular\".\n\nReflecting on its origins, Ms Summers said the Country to Couture runway shows were \"borne out of a re-emergence of textile designs\" across the country following the global financial crisis.\n\n\"A lot of art centres found that they needed to diversify what they were doing to be able to reach new audiences,\" Ms Summers said.\n\n\"What we saw was art centres taking on textile design as part of their core business and part of the mediums that they were supporting artists to work on out in community.\n\nCountry to Couture showcases a range of traditional and contemporary designs. (ABC News: Pete Garnish)\n\n\"Before long, the art centres started to say to us, 'We need somewhere to be able to showcase and celebrate our beautiful textiles. We want a runway.'\n\n\"So, back in 2016, in the heart of the Darwin Aboriginal Art Fair, nestled amongst all the art booths, we had our very first Country to Couture runway.\"\n\nMs Summers said in large part, Country to Couture aimed to \"make a great bridge\" between textile fashion design and the \"fine art market\".\n\nHere's a look at this year's collections.\n\nSHOW 1\n\nMurrgan by Girringun Aboriginal Art Centre\n\nThe Murrgan (blue quandong) collection has used materials that have been coloured with natural indigo and plant-based dyes. (ABC News: Pete Garnish)\n\nNugal Biik (Belongs to Country) by Simone Thomson\n\nThe Nugal Biik collection blends modern silhouettes with textures and colours inspired by the Birrarung (Yarra River) and Dhungala (Murray River). (ABC News: Pete Garnish)\n\nNaarm-based Indigenous designer Simone Thomson says Aboriginal art from south-east Australia, like hers, tends to feature \"diamonds, chevrons and line work\" as opposed to the dot style often presumed to be synonymous with all First Nations art. (ABC News: Pete Garnish)\n\nEchoes of the Tide by Jarli (Designers: Corina Jadai)\n\nThe Echoes of the Tide collection is inspired by the pattern on a turtle shell, paired with ocean hues. (ABC News: Pete Garnish)\n\nGarkambarryirri (Daybreak) by Bula'bula Arts x Black Cat Couture\n\nThis collection and its designers hail from north-east Arnhem Land, featuring hand-painted and screen-printed elements by Yolŋu artists. (ABC News: Pete Garnish)\n\nNguramban-Dhi (From Country) by Corella & Crow (Designers: Rechelle Turner and Megan Daley)\n\nThe Nguramban-Dhi collection has the motif of a bogong moth, a species native to Ngunnawal country and in decline, reflecting the designers' passion for sustainability. (ABC News: Pete Garnish)\n\nThe Corrella & Crow label is named after the totems of the Wiradjuri and Ngunnawal designers, Rechelle Turner and Megan Daley. (ABC News: Pete Garnish)\n\nWarrajamba - A Mermaid in the Bay by Delvene Cockatoo-Collins\n\nThis collection is most recognisable for its use of shells adorned on linen fabric. (ABC News: Pete Garnish)\n\nMaju Karlaj (sister sister) by KingKing Creative (Designers: Sarrita King and Tarisse King)\n\nThe Maju Karlaj collection is inspired by the designers childhood trips between Adelaide (Kaurna land) and Darwin (Larrakia land). (ABC News: Pete Garnish)\n\nConnection to Taam (Country) by Nangarri Designs (Designer: Rowena Morgan)\n\nThis collection aims to reflect the landscape of Kija Country, including the landscape's ochre tones of yellow, red and brown. (ABC News: Pete Garnish)\n\nBiik by Yanggurdi (Designer: Cassie Leatham)\n\nThis collection uses up-cycled materials, some dyed with native plant bush-dye. (ABC News: Pete Garnish)\n\nSHOW TWO\n\nMilky Water by Jaru Girl Designs\n\nThe Milky Water western collection blends traditional cowboy attire with prints that represent a connection to country and its fruits and plants. (ABC News: Pete Garnish)\n\nThe designers say this collection pays tribute to the Aboriginal stockmen and women who work on outback stations. (ABC News: Pete Garnish)\n\nReturn to Country by Mowanjum Arts and Cultural Centre x PaletTheory\n\nThis collection was designed by artists from Worrorra, Ngarinyin and Wunambal country. (ABC News: Pete Garnish)\n\nPirriya by Tjarlirli & Kaltukatjara Art\n\nThis collection features garments made of silk, which allows for its dynamic shape, making the collection true to its name of Pirriya (breeze). (ABC News: Pete Garnish)\n\n'Pirrya' draws upon Australia's contemporary Western Desert Aboriginal art movement. (ABC News: Pete Garnish)\n\nKanyarra by Goompi's Girl (Designer: Nicole Enoch-Chatfield)\n\nThe Kanyarra collection regularly features crocodile (Kanyarra) iconography. (ABC News: Pete Garnish)\n\nYirrganydji designer Nicole Enoch-Chatfield says the crocodile (Kanyarra) represents a return to \"home, safety and roots\". (ABC News: Pete Garnish)\n\nTabilbahn Yunggulba (Saltwater Tidal) by Sandra and Shara Delaney\n\nThis collection reflects the cultural storytelling and country of the Quandamooka people (from south-east Queensland). (ABC News: Pete Garnish)\n\nMagpie Goose x Quandamooka Artists\n\nThis collection is centred on the Quandamooka People of Minjerribah (North Stradbroke Island), with its brightly coloured designs embodying the concept of \"wearable art\". (ABC News: Pete Garnish)\n\nMagpie Goose's collaboration with Quandamooka artists draws inspiration from their stories and cultural heritage. (ABC News: Pete Garnish)\n\nFire in the Sky by Yarrabah Arts & Cultural Precinct\n\nTrue to its name, the designs in this collection feature stunning sunset hues. (ABC News: Peter Garnish)\n\nThis collection is inspired by the vibrant colours of the sky. (ABC News: Pete Garnish)\n\nTjindu (Sun) by Eleraze Creatives (Designers: Sonya Coleman, Sonearae Bilney, Tallulah Bilney)\n\nThe bright colours of this collection depict the sunrises and sunsets seen by those on the far west coast of South Australia. (ABC News: Pete Garnish)\n\nJarndunil / Saheli Yagarramaguranjin (women / friends are creating together) by Nagula Jarndu Designs\n\nThis collection offers a personal touch, with hand-printed textiles, hand-woven and dyed fabrics and hand-embroidered designs. (ABC News: Pete Garnish)\n\nSunset Healing by Mimmim x TATIA (Designers: Mim Cole and Tatiana Hoffmann)\n\nThis wide-brimmed hat from Mimmim x TATIA was a crowd favourite, receiving a roar of applause. (ABC News: Peter Garnish)\n\nThis collection combines \"European elegance\" with innovative prints that honour the designer's Larrakia roots. (ABC News: Peter Garnish)\n\n'Sunset Healing' blends Larrakia storytelling with contemporary fashion. (ABC News: Pete Garnish)\n\nButterfly Kisses by Simone Arnol",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/ozzy-osbourne-cause-of-death/105618454",
    "title": "Ozzy Osbourne died of a heart attack, death certificate shows",
    "publish_date": "Tue, 05 Aug 2025 23:38:51 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Ozzy Osbourne died of a heart attack and had coronary artery disease in addition to suffering from Parkinson's disease for years, his death certificate said.\n\nThe singer had suffered from coronary artery disease as well as Parkinson's, according to the certificate filed at a register office in London and obtained by The New York Times.\n\nOsbourne died on July 22 at 76.\n\nAn email from The Associated Press requesting confirmation from the registry office in Hillingdon Council in north-west London, which covers the district where the Black Sabbath singer was reportedly officially pronounced dead, was not immediately returned.\n\nOzzy Osbourne's wildest career moments Photo shows ozzy osbourne in 2011 dripping in sweat and eyes bulging on stage during a concert Performer Ozzy Osbourne's final words sung on a stage were: \"I tell you to enjoy life, I wish I could, but it's too late\" — a fitting epitaph for a career filled with wild antics, often spurred by drugs and alcohol abuse.\n\nHis family's representatives have yet to comment on the cause of death, but the document was submitted by Osbourne's daughter, Aimée Osbourne, the New York Times reported.\n\nThe singer died of \"(a) Out of hospital cardiac arrest (b) Acute myocardial infarction (c) Coronary artery disease and Parkinson's disease with autonomic dysfunction (Joint Causes),\" the certificate states.\n\nOsbourne, also a somewhat unexpected reality TV star, announced in 2020 that he had Parkinson's disease after suffering a fall.\n\nIn announcing his death, his family asked for privacy and said that he was with relatives when he died.\n\nFans came out in droves from across the country to mourn his death in his hometown of Birmingham last week.\n\nOsbourne had his final show there just weeks before his death, as admirers watched the heavy metal icon perform while seated on a black throne.\n\n\"I don't know what to say, man, I've been laid up for like six years. You have no idea how I feel — thank you from the bottom of my heart,\" Osbourne said during his performance.\n\n\"You're all special. Let's go crazy, come on.\"\n\nAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/nfl-bans-smelling-salts-concussion-nrl-afl/105618182",
    "title": "NFL star 'distraught' as smelling salts banned over safety concerns",
    "publish_date": "Tue, 05 Aug 2025 23:30:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "The NFL is banning the use of smelling salts during games, saying the products are not proven to be safe and also could mask signs of a concussion.\n\nThe league sent a memo to teams explaining the decision to ban smelling salts and any other ammonia inhalants during pre-game activities, games and half-time on the sideline or locker rooms.\n\n\"In 2024, the FDA (Food and Drug Administration) issued a warning to companies that produce commercially available ammonia inhalants (AIs), as well as to consumers about the purchase and use of AIs, regarding the lack of evidence supporting the safety or efficacy of AIs marketed for improving mental alertness or boosting energy,\" the memo read.\n\n\"The FDA noted potential negative effects from AI use. AIs also have the potential to mask certain neurologic signs and symptoms, including some potential signs of concussion.\n\n\"As a result, the NFL Head, Neck, and Spine Committee recommended prohibiting the use of AIs for any purpose during play in the NFL.\"\n\nSan Francisco 49ers tight end George Kittle revealed the ban during an interview with NFL Network, crashing an interview with teammate Fred Warner to \"air a grievance\" about the league's ban.\n\n\"I've been distraught all day, I considered retirement,\" he joked, adding he used them before \"every drive\".\n\n\"We've got to figure out a middle ground here, somebody help me out, somebody come up with a good idea.\"\n\nSmelling salts and other similar products have been used in numerous sports for decades, with athletes from boxing to ice hockey given them after head knocks, although usage has become less prevalent recently.\n\nThe practice has been banned as a treatment for potential concussion cases in rugby league for years, with the NRL operations manual saying smelling salts or similar substances are not allowed following a head injury.\n\nBut many players believe they can provide a sudden jolt of energy or alertness and NRL players were seen using them as recently as this year, with a number of Bulldogs players grimacing and coughing after inhaling a powerful substance in a bottle with the label covered and being held by a trainer before a preseason game in Redcliffe.\n\nCanterbury Bulldogs players were seen reacting after sniffing this bottle held by a trainer in a preseason game. (Supplied: NRL.com)\n\nMany teams use a bucket filled with eucalyptus oil and hot water, covered with a towel, with players taking a whiff before games.\n\nMelbourne halfback Jahrome Hughes said the vapour \"gives you that buzz\" on an episode of the 167 Podcast he hosts with Storm teammates Ryan Papenhuyzen and Cameron Munster.\n\nThey tried smelling salts in the episode to hilarious effect, with Papenhuyzen joking he felt like he had been pepper-sprayed.\n\n\"I don't know if I could do that before a game,\" Hughes said.\n\nLoading Instagram content\n\nThe NFL's memo explicitly prohibits any club personnel from providing or supplying products such as ammonia capsules, inhalers, ammonia in a cup, or any form of smelling salts.\n\nA 2023 study titled Ammonia Inhalants: Use, Misuses, and Role in Sports Performance by orthopaedic sports medicine experts from the University of Washington and Columbia University found the treatment could boost an athlete's heart rate and increase stamina, \"only during repeated bouts of high-intensity exercise\".\n\n\"In contrast, there is no performance benefit to ammonia inhalants in a short burst of maximal effort despite elevated arousal and an associated perception of performance enhancement,\" the research from Dr Joshua Bender and Dr Charles Popkin found.\n\n\"Importantly, ammonia inhalants have no role in medical management of head injuries, as they have the potential to exacerbate an underlying brain injury due to the involuntary withdrawal reflex associated with ammonia inhalation.\n\n\"Furthermore, the signs and symptoms of a concussion or more threatening head injury may be masked by ammonia inhalation and lead to continued participation in competition, causing additional harm.\"\n\nThe AFL has been contacted for comment.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/cotality-says-building-delays-not-approvals-holding-up-housing/105614902",
    "title": "Why the obsession with housing approvals could push prices even higher",
    "publish_date": "Tue, 05 Aug 2025 23:06:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "A leading property researcher has questioned the state and federal government approach of speeding up building approvals to boost housing supply, warning that the construction industry simply cannot keep pace.\n\nWhile data shows home approvals are starting to gather pace from a low base, Eliza Owen from Cotality (formerly known as CoreLogic) worries a construction bottleneck could drive up costs and flood the market with poor-quality homes.\n\nShe said the current focus on accelerating building approvals could cause more problems than it would solve without more construction sector capacity.\n\n\"It's like turning up the water pressure on a bath that's already full,\" she warned.\n\n\"With completion times already above average and construction costs elevated, it seems an odd time to be incentivising more dwelling approvals and commencements.\n\n\"There's a lot in the pipeline. The building industry is stretched thin.\"\n\nLoading...\n\nMs Owen pointed out that the average time between commencing construction on a unit block and completing it had blown out from around six quarters (about 18 months) a decade ago to more than nine quarters (about 22 months).\n\nIt is a similar story for townhouses and detached homes, where construction times have increased from around 10 and seven months respectively to 13 and more than 10 months.\n\nThe average number of quarters between commencement and completion of residential buildings. (Supplied: Cotality)\n\nToo few tradies to keep up\n\nMs Owen's observations come as Housing Minister Clare O'Neil hosts meetings with industry groups to thrash out how to achieve the federal government's target of 1.2 million new homes by mid-2029.\n\nHousing Industry Association chief executive Simon Croft, who was at Ms O'Neil's roundtable meeting on Tuesday, said it was \"really important to have a target — an ambitious target\" but \"the numbers are saying [1.2 million homes in five years] will be a very significant ask\".\n\nLast month, accidentally leaked advice published by ABC News showed Treasury had been warning the government its signature housing policy target would \"not be met\".\n\nAustralia is desperately short of skilled tradespeople, say industry leaders. (Supplied: Russell Mowbray)\n\nMr Crost said Australia needed many more skilled tradespeople — including carpenters, electricians and plumbers — if it was to have any realistic hope of meeting the 1.2 million new homes goal.\n\n\"We are currently 83,000 tradies short,\" he said.\n\nThe Albanese government's plan includes buildings funded by the private sector — developers, investors and owner-occupiers — plus a smaller number of government-funded homes.\n\nCotality's analysis showed the closest Australia has come to a similar rate of building was at the end of 2019, when 1.04 million homes were built in five years.\n\nThe one thing that could produce a property market crash Photo shows A bird's eye view of dozens of homes in a suburb, with a frame of one house being constructed. An Australian property market crash may be laughable, but it's conceivable.\n\nHowever, Ms Owen pointed out that interest rates were much lower over that period and investor activity was higher, especially among overseas buyers.\n\n\"It's too hard to build a home in Australia,\" Ms O'Neil said in a statement.\n\n\" For many builders, it takes much longer to approve a home than to build one. This needs to change. \"\n\nIndustry focus on supply issues\n\nMs Owen analysed national data about properties being built and applications for new homes.\n\nShe found completion rates were hovering around 890,000 over five years, well below the mid-2029 target of 1.2 million.\n\nCan construction activity grow enough to meet the government's ambitious target? (Supplied: ABS)\n\nMs Owen says the number of people looking to build would rise further if the Reserve Bank of Australia dropped interest rates, as expected this month.\n\nHowever, she noted the building industry would be hard-pressed to respond to extra work.\n\nMr Croft said the round table with the housing minister was focused on the skills shortfall, as well as ways to respond to demand, including changing construction codes and other regulations, and \"modern methods\" to build faster, such as pre-fabrication and 3D printing.\n\nLoading...\n\nMaster Builders Australia's (MBA) chief executive Denita Wawn, who missed the minister's round table but was briefed by a representative, noted the emphasis on supply and said the MBA was also focused on easing infrastructure issues that could hold up housing developments, like a lack of sewerage or roads.\n\n\"You've got horrific stories of effectively stranded suburbs,\" she said.\n\nMore focus needed on demand: Owen\n\nMs Owen doubted supply issues could be fixed in time to meet the mid-2029 target.\n\n\"It's clear that under-construction is where you have the biggest hold-up,\" she argued.\n\n\"Approvals will start to rise when interest rates come down.\n\n\" There is a risk that it could re-accelerate housing construction costs. \"\n\nConstruction costs have tumbled since the height of pandemic shortages. (Supplied: Cotality)\n\nMr Croft disagreed, saying inflation in the building sector had eased since the pandemic, when materials such as timber soared in cost.\n\nMs Owen was also concerned that pushing for 1.2 million homes could lead to poorer-quality builds, which she said was a problem during the last development boom up to 2019, with many apartments in particular plagued by serious defects, from flammable cladding to leaks and even structural flaws.\n\nBuilding expert issues warning Photo shows A close up of apartment balconies. Bronwyn Weir was commissioned by government to write a report on the state of Australia's building industry. Now she says she wouldn't buy a new apartment.\n\n\"More dwelling completions are not necessarily a mark of success for Australia's housing market,\" she argued.\n\nInstead, Ms Owen called for more focus on easing demand, including dropping tax concessions for property investors.\n\nThis week, the union movement reignited the debate around negative gearing, with ACTU secretary Sally McManus calling for a one-property limit.\n\n\"The supply side is fraught,\" Ms Owen says.\n\n\" Surely it would make sense to reduce demand. \"\n\nMs Owen believes discussion around reducing demand is increasing after \"politically a lot of hesitancy\" but that there needs to be more focus on this side of the equation.\n\n\"I think it's fair to say that wealthy lobby groups like developers have an interest in making the supply side more feasible,\" she added.\n\nWe need to solve where Australia builds new homes Photo shows An aerial photo of a new housing estate with empty blocks and several new houses being built. To meet the government's housing target every year there will need to be infill land created about 26 times the size of Melbourne's CBD across Australia.\n\nMs Wawn slammed calls to reduce housing demand and described the ACTU's latest push over negative gearing as \"disappointing\".\n\n\"It's a totally wrong call about resolving the housing crisis,\" she said.\n\nA federal government spokesperson said the Commonwealth was \"realistic about the factors beyond [its] control\" when it came to the 1.2 million housing target, such as the current level of interest rates.\n\n\"The homes target is not just ambitious — it's essential,\" the spokesperson said.\n\n\"This crisis wasn't created overnight, and it won't be fixed overnight — but real progress is being made right across the country.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/football-legend-jorge-costa-dies-aged-53/105618248",
    "title": "'He's part of my history': Football legend's emotional reaction to champion's death",
    "publish_date": "Tue, 05 Aug 2025 22:57:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jorge Costa, who captained Porto to the 2004 Champions League title, has died from a cardiac arrest, the club has said. He was 53.\n\nCosta, a central defender who made 50 international appearances for Portugal, was Porto's director of football at the time of his death.\n\nCaptain Jorge Costa and goalkeeper Vitor Baia lift the Champions League trophy for FC Porto in 2004. (Getty Images: Shaun Botterill)\n\nThe club said in its announcement that Costa embodied Porto's values of \"dedication, leadership, passion, and an unwavering spirit of conquest.\"\n\nPortuguese media reported that Costa sustained cardiac arrest at the club's training centre and was transported to São João Hospital.\n\nCosta's finest achievement in his playing career was as captain of Jose Mourinho's Porto team that was a surprise winner of the Champions League in 2004. A year earlier, he lifted the second-tier UEFA Cup.\n\nCosta also helped Porto win eight Portuguese league titles.\n\nPortuguese Prime Minister Luis Montenegro offered his condolences and praised Costa's \"dedication and commitment\" to both Porto and the national team.\n\nAn emotional Mourinho paid tribute to Costa during a press conference for his Turkish club, Fenerbahçe.\n\n\"He's part of my history,\" Mourinho said.\n\n\"You have captains. You have leaders … sometimes it's not about the armband at all. It's what they represent. And Jorge was one of these guys who cleaned the garbage and let his coach do his job as a coach and not as a leader of the dressing room.\n\n\"That's perfection as a coach, when your captain does this work. I'm very sad. He's part of my history, of course.\n\n\"But let's forget football. Let's focus on him. Jorge was a young guy with his kids. I am very sad, but I'm here now because he would tell me, 'C'mon, do your press conference'. And he would say, 'Play the game tomorrow. Win the game and forget about me'.\n\n\"That would be Jorge, so that is what I am trying to do. To play the game. To win the game and then cry after.\"\n\nCosta spent a short period on loan at English team Charlton in the 2001–02 season.\n\n\"To hear of a life taken at 53 is never nice to hear, but he's a former teammate who had such a great standing in the game and captained a Champions League-winning side,\" said Steve Brown, chair of Charlton's ex-players' association.\n\n\"He was loved at Charlton, a man mountain of a player and a great guy, too.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/australian-singer-col-joye-dies-aged-89/105618188",
    "title": "Australian musician Col Joye dies aged 89, remembered as 'true gentleman'",
    "publish_date": "Tue, 05 Aug 2025 22:43:13 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Col Joye, the first Australian pop performer to reach number one on the local charts, has died at the age of 89.\n\nColin Jacobsen — known professionally as Col Joye — had enormous success in Australia in the early days of rock and roll with his band the Joy Boys.\n\nHe started his music career in his brother Kevin Jacobsen's band, The KJ Quintet, in Sydney in 1957.\n\nThey impulsively changed their name to Col Joye and the Joy Boys to secure a gig at the Manly Jazzerama and, joined by younger brother Keith on bass, the Joy Boys began performing regularly in Bankstown.\n\nIn 1959 their second single, Bye Bye Baby made the top spot on the Sydney charts and three further top 10 hits followed.\n\nAlong with his brother Kevin, in the 1960s Joye also established an influential management, publishing and recording business.\n\nJoye saw the Bee Gees in Surfers Paradise in 1961 and signed them to Joye Music, with the Gibb brothers performing backing vocals as Joye's hit single Starlight of Love in 1963.\n\nIn 1973, his single Heaven Is My Woman's Love became a national number one.\n\nCol Joye remembered as a 'guiding light'\n\nAustralian singer and songwriter Normie Rowe told ABC News Joye was an idol of his.\n\n\"Col was in my psyche right throughout my entire life. I watched him and I thought, 'If I'm going to be a singer, that's the sort of singer I want to be'.\n\n\"He was the true gentleman of the industry. I don't think anybody could have ever had a bad word to say about Col,\" he said.\n\nNormie Rowe, Col Joye and Brian Cadd were all part of the Long Way to the Top tour. (AAP: Julian Smith)\n\nIn the early 2000s, Rowe and Joye joined the Long Way to the Top live concert tour, where more than two dozen Australian rock 'n' roll singers performed.\n\nRowe said Joye was \"a guiding light\" on the tour.\n\n\"He was almost like the den mother of the whole tour. And we all revered him so much. Every morning he would arrive at the bus to go on the next concert or to the airport and he would get on with his ukulele and start immediately strumming a little ditty, a different one every day.\n\n\"I think he carried it around with him wherever he went in the last 10 years.\"\n\nIn recent years, Rowe had been gifted Joye's guitar.\n\n\"I phoned him and said, 'Colin, there's a guitar here for me?' And he said, 'Yes, it's my guitar, it's my Maton guitar and I won't be going on stage anymore, so I wanted it to go to somebody who would play it'.\"\n\nRowe said he plans on eventually giving the guitar to a national museum so that it continues to be \"beautifully cherished\".\n\nARIA tribute\n\nThe Australian Recording Industry Association (ARIA) paid tribute to Joye, who was among the first inductees into the ARIA Hall of Fame.\n\n\"From music to TV, publishing to concert promotion, artist management and live performances, Col Joye made a remarkable contribution to Australian music for more than six decades,\" ARIA chief executive officer Annabelle Herd said.\n\n\"At a time when the local industry was dominated by US and UK artists, he proved that Australians would embrace local artists and local music.\n\n\"Our deepest condolences go to Col's family. He will be sadly missed.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-06/diggers-and-dealers-kalgoorlie-miners-question-net-zero-future/105615120",
    "title": "Mining forum panel questions Australia's 'zombie' energy transition",
    "publish_date": "Tue, 05 Aug 2025 22:12:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Duelling perspectives on Australia's transition to renewables and whether it is dead in the water have played out on the floor of one of the country's major annual mining conferences.\n\nMore than 2,300 delegates are in Kalgoorlie-Boulder, 600 kilometres east of Perth, for the annual Diggers and Dealers Mining Forum, bringing the industry's practical and financial arms together for the 34th time in Western Australia's gold mining capital.\n\nWhile this year's gathering comes amid a surging gold price, questions over housing the industry's local workforce, and shaky futures for nickel and rare earths, organisers chose to shine a spotlight on the future and feasibility of Australia's shift to renewables.\n\nWhile miners, particularly in remote parts of Western Australia, have followed the state's smaller communities in setting up their own independent renewable energy infrastructure, the forum's keynote panel questioned the likelihood of renewables meeting the nation's total energy needs.\n\nAidan Morrison (right) says Australia's energy transition is being kept alive by government subsidies. (ABC Goldfields: Jarrod Lucas)\n\nThe panel, featuring Canadian nuclear energy advocate Chris Keefer and Centre for Independent Studies (CIS) director of energy research Aidan Morrison, urged attendees to question the assumptions being made by industry and political leaders.\n\n\"There is no serious intellectual defence for the prospect we'd meet net zero targets in 2050,\" Mr Morrison said.\n\n\" It is simply impossible, even if we had the right investment. \"\n\nHe told the forum that the transition to a fully renewable grid was only being propelled by increasingly generous state and federal subsidies.\n\n\"Forcibly intubated and resuscitated by government subsidies,\" he said.\n\nWind turbines are built at Kathleen Valley Lithium Mine, which is 80 per cent powered by renewable energy. (Supplied: Zenith Energy)\n\n\"It shows what it looks like to have a resuscitated zombie coming to life, the dead starting to walk again.\"\n\nDr Keefer said nations such as Australia and Canada were getting caught up in a geopolitical fight over energy between China and the United States that they had no part in.\n\n\"The levers of emissions reduction are not really in the hands of countries like Canada and Australia anymore,\" he said.\n\n\"In Inner Mongolia, [China is] building what they call 'energy bases' — something like 6 gigawatts of solar, similar amounts of wind and batteries.\n\n\"But also coal, mine-mouth coal, 4 to 5 gigawatts.\"\n\nGold nuggets and other specimens on display under the Diggers marquee. (ABC Goldfields: Robert Koenig-Luck)\n\nFirst 'net zero' gold mine\n\nThe panel, moderated by broadcaster and CIS executive director Tom Switzer, also questioned the feasibility of renewables powering Australia's enormous grids on the largest possible scale.\n\n\"As if we're some singular, big bucket where if it's sunny somewhere, it's immediately shareable somewhere else on the continent,\" Mr Morrison said.\n\n\"If you think about that from a cold, hard, engineering perspective, it is absolutely bonkers.\"\n\nOthers at the conference were more positive about renewables and pointed to smaller, localised successes.\n\nAustralia's first \"net zero\" gold mine was announced at the forum late on Tuesday.\n\nBellevue Gold managing director Darren Stralow said the mine, 40km north of Leinster in the northern Goldfields, recorded net zero carbon emissions for the first half of 2025.\n\nDarren Stralow says Bellevue Gold now runs Australia's first \"net zero gold mine\". (ABC Goldfields: Jarrod Lucas)\n\n\"We've increased renewables, decreased greenhouse gases and looked for opportunities throughout the mining cycle to reduce carbon from what we do,\" he said.\n\n\"It's allowed us to work with some like-minded partners, to see if there's a benefit to that in terms of revenue, and to look to sell our gold in a bit of a different way.\"\n\nThe mine is forecast to be 80–90 per cent powered by renewable energy, the highest penetration in Australia.\n\n'Cost-effective' for remote mines\n\nFor Regis Resources managing director Jim Beyer, renewables were a question of economics rather than advocacy.\n\n\"For a remote mine site, renewables make good economic sense,\" Mr Beyer said.\n\n\"At Duketon [1,000km north-east of Perth], we put in a solar farm and it saved us diesel.\n\n\" It saves us money on diesel, and because we're not burning, it reduces our carbon emissions. \"\n\nJim Beyer says renewables are a cost-effective option for remote mine sites. (ABC Goldfields: Jarrod Lucas)\n\nIt is a similar story with wind and solar infrastructure at the remote Tropicana Gold Mine, about 1,000km east of Perth.\n\n\"Power there runs off gas,\" Mr Beyer said.\n\n\"But when the blades are turning and the sun's out … it's cost-sensible as well as carbon reduction.\"\n\nMinister defends 2050 target\n\nResources Minister Madeleine King pointed to heavy renewable energy investment at the Kathleen Valley Lithium Mine and the Bellevue Gold Mine, while reiterating the government's position.\n\n\"I don't mind people having an opinion; I don't share that opinion,\" she said, in response to the keynote panel's comments.\n\n\" My opinion is that we should strive for net zero by 2050. \"\n\nMadeleine King says Labor remains committed to Australia's net zero target. (ABC Goldfields: Robert Koenig-Luck)\n\nHer West Australian counterpart, David Michael, said there would be no shift in the government's position on uranium mining, ruling out any further approvals following those granted by the Barnett Liberal government in 2017.\n\nDeep Yellow's project at Mulga Rock, estimated to be Australia's third-largest untapped uranium resource, is the only project in WA free to proceed under current laws.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/these-hefty-cinnamon-scrolls-are-some-of-the-best-value-buns-in-melbourne-20250806-p5mkt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These hefty cinnamon scrolls are some of the best value buns in Melbourne",
    "publish_date": "Wed, 06 Aug 2025 12:23:07 +1000",
    "category": "finance",
    "authors": [
      "Quincy Malesovas"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHeart Bakes in Port Melbourne is known for its tall, doughnut-like scrolls.\n\n1 / 6 Heart Bakes is known for its hefty scrolls. Supplied 2 / 6 Outside the Port Melbourne cafe. Supplied 3 / 6 Tiramisu scrolls are also available. Supplied 4 / 6 In the kitchen. Supplied 5 / 6 Take a seat outside while you wait for your coffee. Supplied 6 / 6 Good Food crowned Heart Bakes’ cinnamon scrolls as the best value in town. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nHeart Bakes is known for its value-for-money cinnamon scrolls ($7.50). They’re hefty – about 9cm high and almost doughnut-like in texture, doused in a liberal drizzle of icing. The cinnamon flavour is subtle, ideal for those who prefer a less intense spice. All baking is done on-site, and dining in means your scroll can be warmed to order. Can’t make it to Port Melbourne? You’ll also find them at its sibling cafe Heart Coffee in Richmond.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/rugby-world-cup-2027-coming-down-under-20250806-p5mkt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby World Cup 2027 coming Down Under",
    "publish_date": "Wed, 06 Aug 2025 12:14:25 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rugby World Cup 2027 coming Down Under\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/queensland/queensland-emerging-as-a-standout-economic-performer-report-says-20250804-p5mk8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queensland emerging as a ‘standout economic performer’, report says",
    "publish_date": "Wed, 06 Aug 2025 12:07:41 +1000",
    "category": "finance",
    "authors": [
      "William Davis"
    ],
    "text": "Queensland’s population growth and an expected swell of investment before the 2032 Brisbane Games has been a boon for the state’s commercial property sector, according to industry giant JLL.\n\nA new report, Unlocking Queensland’s Potential, found Queensland was “emerging as a standout economic performer” following the continued rise in interstate migration and infrastructure spend.\n\n“Brisbane’s commercial property sector is offering a rare combination of stability, scale and growth,” the US real estate services company said in a statement.\n\nBrisbane’s commercial real estate market has “appeal as a low-volatility, long-term investment” according to JLL. Credit: Courtney Kruk\n\nVacancy rates in Brisbane’s CBD office market were the least volatile in the country during the past decade, according to the JLL report.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/lifestyle/delta-goodrem-celebrates-lipstick-day-for-a-heartfelt-cause-20250806-p5mksz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Delta Goodrem celebrates Lipstick Day for a heartfelt cause",
    "publish_date": "Wed, 06 Aug 2025 12:04:53 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Delta Goodrem celebrates Lipstick Day for a heartfelt cause\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-albanese-advances-efforts-to-end-gaza-humanitarian-crisis-bill-and-hillary-clinton-subpoenaed-in-epstein-case-20250806-p5mknw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese advances efforts to end Gaza humanitarian crisis; Bill and Hillary Clinton subpoenaed in Epstein case",
    "publish_date": "Wed, 06 Aug 2025 12:00:59 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Opposition Leader Sussan Ley has hit out at the Albanese government’s economic management, finding that “all is not well” as Australians continue to grapple with persistent cost of living pressures.\n\nSpeaking in Victoria, Ley said that Australian businesses were being weighed down by excessive regulation and compliance standards, which she noted were key drags on productivity.\n\nOpposition Leader Sussan Ley. Credit: Simon Schluter\n\n“Everywhere I go, I’m hearing messages that tell me that all is not well, particularly for small business,” Ley said.\n\n“No matter how good you are at what you do, running a small business, if you’re overwhelmed by red tape and compliance, it’s a dead weight loss of productivity.”\n\nLey also used the news conference to raise concern about the potential for raised taxes following its economic reform roundtable this month, and criticised the government’s handling of energy prices.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/politics/queensland/resources-department-paid-187k-to-industry-figure-for-25-days-work-20250806-p5mkqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Resources department paid $187k to industry figure for 25 days’ work",
    "publish_date": "Wed, 06 Aug 2025 12:00:22 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien",
      "Marissa Calligeros"
    ],
    "text": "Queensland’s Resources Department paid $187,500 to industry figure Ian Davies for up to 25 days of “strategic analysis” of the state’s north-west mineral region and talks with Swiss mining giant Glencore.\n\nDirector-general Graham Fraine confirmed the arrangement at a parliamentary estimates hearing, but would not be drawn on whether he knew of a donation to the LNP in Davies’ name.\n\nDavies left his role leading major east-coast gas producer Senex Energy, part owned by Gina Rinehart’s Hancock Prospecting, in January after almost 15 years.\n\nIan Davies’ knowledge and expertise was described by Resources Minister Dale Last as “invaluable”. Credit: Oscar Colman\n\nFor more than seven years until February, he held board roles – including as chair – with the peak Australian Energy Producers group, and since August has been on the board of Adelaide-based Amplitude Energy, where he will take up the chair position in November.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/technology/bubble-fears-the-multitrillion-dollar-threat-hanging-over-markets-20250806-p5mkqk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bubble fears: The multitrillion-dollar threat hanging over markets",
    "publish_date": "Wed, 06 Aug 2025 12:00:12 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Morgan Stanley research has said global data centre capacity will expand by 600 per cent by 2030. It has a lower estimate of what that will cost – $US3 trillion. This year, hyperscalers are expected to invest about $US320 billion, compared to $US200 billion last year. By 2028, they will be investing more than $US300 billion in data centres and AI chips. Data centres are popping up around the globe to power the AI boom. Credit: Bloomberg Whether it is $US3 trillion or $US6.7 trillion, the scale of investment is staggering and is far out-running the revenues being generated. Last year, those hyperscalers generated only $US45 billion of AI-related revenue. By 2028, Morgan Stanley said, their revenues might exceed $US1 trillion. That qualification – the “might” – is significant. Companies are pouring ever-increasing amounts of their shareholders’ funds into AI, based on very optimistic expectations of its potential revenues and margins and the development of applications that don’t currently exist.\n\nFierce competition to be one of those left standing and dominating the sector when the inevitable clean out occurs is fuelling an investment binge, although, at this admittedly very early stage of the sector’s development, the massive numbers of AI users aren’t translating into a material base of paying users. Loading The entity that sparked the boom, Open AI’s ChatGPT, for instance, has about 700 million weekly active users and that user base is growing at a dramatic rate – roughly four times its size last year. It has, however, only about 5 million paying business users, and while that is growing rapidly, the conversion rate from free to paying users is less than impressive for a business valued in its most recent funding rounds at about $US300 billion. By the end of this year, OpenAI is expected to generate revenue at an annualised run-rate of about $US20 billion. Earlier this year, the group agreed a deal with Oracle under which it will pay $US30 billion a year to lease 4.5 gigawatts of data centre computing power and another with Nvidia to buy $US40 billion of its most powerful chips. It is a cash and capital-devouring sector, on an unprecedented scale.\n\nMost of the big players in AI would share broadly similar features with OpenAI, although the established mega techs like Amazon, Microsoft, Google and Meta Platforms may have the opportunity of commercialising AI within their existing customer base. These massive investments are being made – the mega-techs are spending around $US100 billion each this year, with plans to spend more next year and beyond – without any firm understanding of the eventual demand or the returns from the investments. The problem with market bubbles is you only know you are in one when they burst. Credit: AP That hasn’t phased investors, who are ploughing funds into the sector at ever more dizzy valuations. Elon Musk’s xAI, for instance, first raised money, at a $US18 billion valuation, in March last year. It raised more in December, at a $US50 billion valuation. By March this year, another raising saw its value increased to $US80 billion and, more recently, it was looking to raise funds at a valuation of up to $US200 billion.\n\nSomehow, having raised about $US30 billion or so of debt and equity for an entity that is expected to burn about $US13 billion of cash this year and which doesn’t expect, if everything goes according to its plans, to be cashflow-positive before 2029, people are valuing it, with real money, at $US200 billion? That’s what you’d call a very high-risk investment, particularly when you take into account xAI’s competitors in this race of AI supremacy, most of whom have massive cash flows from their existing operations to self-fund their AI plays. xAi’s valuations are effectively a capitalisation of Musk’s reputation. Is the AI boom a bubble? We’ll only know if it bursts. There are a couple of other features of the sector that provide question marks. One is that, to date, the generative AI sector is overly-reliant on expensive Nvidia chips, which are upgraded regularly and are therefore a recurring and very substantial cost.\n\nThe other is that the multitude of data centres that are being built, and those that will have to be built, to power the rollout of AI require huge amounts of power themselves. The International Energy Agency has estimated that electricity demand from data centres will more than double by 2030 and that by that date the US economy will consume more electricity for data processing than it now does for the manufacturing of all energy-intensive goods, including aluminium, steel, cement and chemicals. Whether it is even possible for the power requirements of the data centres to be met within the timeframes AI firms need them and at affordable prices is a significant question, particularly in the US, where Joe Biden’s push for a surge in renewables has been aborted by Donald Trump. ChatGPT has about 700 million weekly active users and that user base is growing at a dramatic rate. Credit: Getty None of this is meant to question the potential of AI to ignite a new industrial revolution, transforming work and society.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/books/he-was-an-egotist-adam-courtenay-s-shocking-memoir-about-father-bryce-20250729-p5mirf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He was an egotist’: Adam Courtenay’s shocking memoir about father Bryce",
    "publish_date": "Wed, 06 Aug 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Susan Chenery"
    ],
    "text": "As a former ad man, he understood decades before anyone else that Bryce Courtney was a brand. “He got huge amounts of shit over that, but I think it is his greatest legacy,” says Adam with a snide laugh. But perhaps Bryce’s greatest fictional creation was himself. Not only was he a master storyteller, he was a master of self-invention. Adam believes Bryce invented himself from the moment he set foot on Australian soil in 1958. Sydney was a sunny, open place where you could leave the past behind and become somebody else. And so the myth began; the ascendancy of Bryce Courtenay, the braggadocio, the legend. There were the advertising years, in says Adam, the flimflam man; the drinking, smoking, womanising. Adam feared sitting next to his father at dinner parties, “the more beers, the greater the megalomania.” Then came the Damascene conversion to long-distance running and positive thinking. Pain was gain. Adam had a front-row seat: he watched all these incarnations, “caught between love and admiration for my father, and a gnawing sense that something wasn’t right.” He and his brothers let the Dad facts “through to the keeper all the time.”\n\nSpending his life in close proximity to a fabulist, Adam became a truth seeker. He became a financial journalist, first in Sydney, then for 15 years in London working for the Financial Times and The Sunday Times. Now an author, his own strictly non-fiction historical books deal with the great characters and stories from early colonial history, the escaped convicts and reprobates, the men who went native, “the guys that history has often overlooked.” They are a fascinating insight into how it was in the brutal newly formed colony, how we became what we are. As Adam got older, there was a “moral confusion” about his father “mixing bullshit with a marvellously told story”. He was finding it harder to accept the narrative as it flew along. He now realises his sense of self was at stake. “We all tell porkies all the time. But when it comes to important things I think you have to be honest.” And by the third act of Bryce’s life, fame and wealth. “It started to wear very thin because it became bullshit about himself and who he was and where he came from,” Adam says. “That’s a different mode of bullshit. The Dad facts become pertinent and real. It takes on a different dimension.” As his father became Australia’s most beloved author, Adam says he had trouble recognising him. His first wife of 38 years, Benita, had been left behind. He was shedding skin. He had a new “family” with Christine Gee. “His new role in life was to be a guru for the people,” says Adam. “There was almost a priest-like ability … he ministered to people. He was always there to help. I never doubted his capacity or ability, but I no longer believed in the myth that he was still creating right up to the end.”\n\nFiction and fact were becoming blurred. Defending charges of antisemitism for Solomon’s Song, Bryce blithely told The Australian Jewish News that his wife and sons had “freely chosen to be Jews”. They had not. Adam’s mother Bonita was Jewish but agnostic and called herself Anglican. Adam, a Christian, was “very, very angry. There was no Jewish religion or culture. It just did my head in because he was saying something about me that didn’t exist.” Adam believes his finest book was April Fool’s Day, about his favoured son Damon, who was a haemophiliac and died of AIDS at 25 after a contaminated blood transfusion. In theory, it was non-fiction, but he caricatured people, played fast and loose with the facts and hurt people who loved Damon, some of whom threatened to sue. “There was no need for exaggeration,” says Adam. “There were things that were just wrong. It wasn’t necessary to enhance what happened. The story had enough pathos in itself.” Bryce Courtenay in his days as an advertising man, in 1992. Credit: Barry Chapman/Fairfax Media Bryce would go on to be an advocate for blood screening and HIV. “He demystified AIDS to a great degree,” Adam concedes. “And that has to be remembered.” Adam does, though, have some fond memories “I remember laughing (at) Dad’s trying to be cool. I found it really sweet,” he says. He was a present and involved father who sent his boys to Cranbrook, and gave them substantial financial help in buying their first homes.\n\nBut Adam would learn though that confronting Bryce was seen as an act of betrayal. “Moderating my adoration,” Adam says diplomatically. The blue eyes would turn acidic. It was only years later that he realised “I was being gaslit by a specialist”, he writes in the memoir. Suddenly, Bryce would be the victim. Loading It was Bryce’s sister Rosemary who provided the answers Adam needed: the foundation of his own life had been based on confabulation. Bryce’s insatiable need for adulation came from a place of shame. He was not the orphan he told audiences he was, often moving himself to tears. But he was illegitimate. In provincial 1930s and ’40s South Africa, this made his mother socially unacceptable. There was no noble lineage; his father was not a crusading barrister but an alcoholic married clothing salesman, Arthur Ryder. Bryce’s childhood was chaotic. His mother Paddy Greer, who eventually embraced Pentecostal religion and spoke in tongues, was constantly moving, unable to hold down a job.“I think his mother treated him very badly,” Adam says. “And I think he was very, very lonely.” The poverty was dire. Bryce spent time in an orphanage at Krugersdorp and was bullied at several schools because he didn’t have a father.\n\nLoading Adam learnt that he was not the most gifted scholar ever seen at the King Edward VII school, nor was he ever offered a place at Oxford. “I feel compassion and sadness. There was darkness there and stories and myths may have been to get himself out of depression.” Adam stops short of calling Bryce a narcissist. “A narcissist is someone who doesn’t care about anybody else. And I want to give Bryce credit for really caring about lots of people, his generosity was incredible. He helped hundreds of people as a mentor,” he says. “I think he was an egotist, not a narcissist.” Adam still has great love for his father. “He wasn’t a Machiavellian guy. He didn’t have a nasty side. Essentially, he was a very, very pleasant, engaging, good guy,” he says. “Even if he used to say things that weren’t true.” My Father Bryce (Hachette) by Adam Courtenay is out now.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/culture/books/instead-of-doomscrolling-have-a-laugh-at-these-black-mirror-esque-stories-20250801-p5mjj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Instead of doomscrolling, have a laugh at these Black Mirror-esque stories",
    "publish_date": "Wed, 06 Aug 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Jack Cameron Stanton"
    ],
    "text": "SATIRE\n\nPlaying Nice Was Getting Me Nowhere\n\nAlex Cothren\n\nPink Shorts Press, $32.99\n\nIn his novel The Real Life of Sebastian Knight, Vladimir Nabokov spoke of “parody as a kind of springboard for leaping into the highest regions of serious emotion”. When a writer takes a worn-out or dead style and reanimates it through the fun of formal play and subversion, they combine their instinct for mockery with pathos (Nabokov described this approach as a “clown developing wings”).\n\nMy ideal parodist charms with a spirited voice and funny representations, before gradually revealing the seriousness behind their burlesques. What separates the satirist from the comedian is the texture of the laughter invoked, found not in just punchlines and observational digs, but in the equally amusing and horrifying lens through the world is portrayed.\n\nAustralian writer Alex Cothren’s short-story collection Playing Nice Was Getting Me Nowhere arises from the American satirical tradition, whose most visible practitioners are George Saunders and Thomas Pynchon. Like Cothren, these writers combine jaunty, sparkling surfaces with a darkly ironic commentary. They render injustice and suffering through cartoonish exaggerations and flights of fancy. And although the satirist wields the grotesque and the unreal, these distortions have the strange effect of making their critique more acutely felt.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/lockyer-explains-why-katoa-will-snub-huge-offers-20250806-p5mksw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lockyer explains why Katoa will snub huge offers",
    "publish_date": "Wed, 06 Aug 2025 11:59:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Lockyer explains why Katoa will snub huge offers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/world/north-america/inside-jeffrey-epstein-s-dracula-manhattan-lair-20250806-p5mknv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Jeffrey Epstein’s ‘Dracula’ Manhattan lair",
    "publish_date": "Wed, 06 Aug 2025 11:56:34 +1000",
    "category": "finance",
    "authors": [
      "David Enrich",
      "Matthew Goldstein",
      "Jessica Silver-Greenberg",
      "Steve Eder"
    ],
    "text": "The ensuing right-wing outrage has threatened to splinter the “Make America Great Again” movement – for whom Epstein is a central figure in conspiracy theories – and has put Trump on the defensive like few other issues. Seeking to quell the backlash, the Justice Department dispatched a top official to meet with Ghislaine Maxwell, Epstein’s longtime associate who is serving a 20-year prison sentence for sex trafficking. On Friday, Maxwell was moved to a lower-security facility. That fuelled speculation that Trump might commute her sentence or even pardon her in return for her cooperation. Pictures seen in Epstein’s townhouse. Credit: US Department of Justice For years, Maxwell was a fixture in Epstein’s New York townhouse, where she had an office. But she and Epstein had split by the mid-2010s. A framed photo in the townhouse showing Epstein with Trump and his then-girlfriend, Melania Knauss, was cropped to exclude Maxwell. At least one other MAGA luminary also visited the townhouse: Steve Bannon, a former adviser to Trump and an online media personality, who has said he videotaped hours of interviews in the mansion with Epstein in 2019. Framed photos of Bannon – including a mirror selfie snapped by Epstein – were kept in at least two rooms in the mansion.\n\nThe townhouse was one of five properties around the world owned by Epstein. After his release in 2009 from a Florida jail, where he served 13 months for soliciting prostitution from a teenager, the mansion served as both a personal hideaway and a salon where he could hold court with accomplished intellectuals, scientists and financiers, according to legal records and interviews with people who frequented the home. The visitors considered Epstein fun, smart and curious. Another perk: getting to mingle with the young, attractive women who roamed the property and worked as his assistants. The townhouse, a stone’s throw from Central Park, was sold to Epstein in 1998 by Leslie H. Wexner, the billionaire owner of L Brands. Epstein renovated and redecorated the mansion in an eccentric style.\n\nGhislaine Maxwell with Epstein. Credit: AP Dozens of framed prosthetic eyeballs lined the entryway. A sculpture of a woman wearing a bridal gown and clutching a rope was suspended in a central atrium. In the ground-floor dining room, Epstein entertained a rotating cast of celebrities, academics, politicians and businessmen. The food could be mundane – sometimes nothing more than a buffet of Chinese takeout, Allen’s letter noted – but the events were anything but. Photos show that guests sat in leopard-print chairs around a large rectangular table. Occasionally, attendees said in interviews, a magician performed.\n\nSometimes, a chalkboard was wheeled out so a guest could sketch a diagram or write a mathematical formula. Epstein preserved a map of Israel drawn on a chalkboard with Barak’s signature, according to a photo reviewed by The New York Times. Up a grand staircase was Epstein’s wood-paneled office, featuring a massive desk. Photos show a taxidermied tiger lounging on a lush rug. In the office, according to photos reviewed by the Times, Epstein showcased a green first edition of Lolita – the 1955 novel in which an intellectual develops a sexual obsession with a 12-year-old girl and repeatedly rapes her. The massage room had paintings of naked women and shelves stocked with lubricant. Credit: US Department of Justice Atop a wooden sideboard were more framed photos, including one of Epstein with Saudi Arabia’s crown prince, Mohammed bin Salman.\n\nSeveral of Epstein’s victims have said the mansion was outfitted with a network of hidden video cameras. In the massage room were paintings of naked women, a large silver ball and chain, and shelves stocked with lubricant, according to photos reviewed by the Times. Loading Epstein regularly directed teenage girls – some recruited from middle schools in Queens – to massage him while he was naked. Sometimes he masturbated in front of them, according to court records and interviews with victims. Sometimes he raped or assaulted them. No surveillance cameras were visible in the photos of the massage room. An earlier collection of letters, presented to Epstein in a leather-bound album for his 50th birthday in 2003, reflected an era of his life before he was first arrested.\n\nThat book included contributions from Trump and Bill Clinton, among dozens of others, The Wall Street Journal reported. Trump has denied a report in the Journal that he contributed a sexually suggestive note and drawing. He has sued the news organisation for defamation. Clinton’s spokesperson has said the former president was unaware of Epstein’s crimes. Loading But by 2016, as Epstein’s reputation as a sexual predator became increasingly hard to ignore, his social network was shrinking. Three years later, he would die in a Manhattan jail while awaiting prosecution on federal sex-trafficking charges. The Times reviewed seven birthday messages given to Epstein in 2016. In addition to those from Zuckerman, Allen and Barak, there were letters from linguist Noam Chomsky and his wife; Joichi Ito, an entrepreneur who years later would resign from the Massachusetts Institute of Technology and the board of The New York Times Co. because of his ties to Epstein; and Lawrence M. Krauss, a prominent physicist. Martin Nowak, a Harvard University biologist, contributed a science-themed poem.\n\nZuckerman, Allen, Ito, Nowak and Bannon did not respond to requests for comment. Barak declined to comment. Chomsky’s wife responded on his behalf and declined to comment. Krauss said he didn’t recall the letter, but attended “several lunches with very interesting discussions” with scientists, authors and others at Epstein’s home. Loading In their typed letter, Barak and his wife, Nili Priel, hailed Epstein as “A COLLECTOR OF PEOPLE”. The letter concluded, “May you enjoy long and healthy life and may all of us, your friends, enjoy your table for many more years to come”. This article originally appeared in The New York Times.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/thousands-of-queensland-teachers-walk-off-the-job-20250806-p5mksv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Thousands of Queensland teachers walk off the job",
    "publish_date": "Wed, 06 Aug 2025 11:55:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of Queensland teachers walk off the job\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/edmed-set-for-wallabies-redemption-after-painful-three-minute-debut-20250805-p5mkje.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Edmed set for Wallabies redemption after painful three-minute debut",
    "publish_date": "Wed, 06 Aug 2025 11:55:10 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "Tane Edmed is poised for a return to Test rugby, with the former Waratahs playmaker set to be picked in the Wallabies squad for the Rugby Championship opener against South Africa, due to be named on Thursday.\n\nEdmed made his debut for the Wallabies last November against Ireland, lasting just three minutes in Dublin after coming on as a 74th-minute substitute before being knocked out while making a tackle.\n\nEdmed will come into the squad after Reds five-eighth Tom Lynagh was ruled out after suffering his third concussion of the season after being illegally cleared out of a ruck by British and Irish Lions hooker Dan Sheehan in the third Test.\n\nSheehan subsequently received a four-match ban for the “reckless” hit on Lynagh, which officials did not pick up during the game.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/companies/rupert-murdoch-shows-trump-his-own-of-the-art-of-the-deal-20250806-p5mkoi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rupert Murdoch shows Trump his own of the ‘Art of the Deal’",
    "publish_date": "Wed, 06 Aug 2025 11:52:59 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Rupert Murdoch’s News Corp is used to being the centre of controversy, but its annual results on Wednesday morning were more newsworthy than normal, with the $US10 billion lawsuit from US President Donald Trump against the Wall Street Journal just weeks old.\n\nChairman emeritus Rupert and chairman Lachlan Murdoch did not participate in the conference call that followed the better-than-expected results, but the wily media mogul’s fingerprints were all over it.\n\nThe News Corp results offer a fresh twist on the latest battle between Donald Trump and Rupert Murdoch. Credit: Fairfax Media\n\nChief executive Robert Thomson did not mention Trump once. However, he treated investors and analysts to a 40-minute show that was by turns fawning, deflective, distracting, but above all shamelessly self-serving in a way that even Trump would have loved.\n\nNews Corp’s book division publishes Trump’s Art of the Deal, and Thomson reminded the president that it is looking out for his interests when it comes to stopping AI from consuming and cannibalising the ideas in his book.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/titan-submersible-report-they-had-a-good-reputation-they-didnt-deserve-it/g7f4rx1zr",
    "title": "Titan submersible report: 'They had a good reputation. They didn't deserve it'",
    "publish_date": "Wed, 6 Aug 2025 01:15:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nJune 2023.\n\n\n\n\n\nIt was the rescue operation that captivated the world.\n\n\n\n\n\nThe submarine owned by OceanGate Expeditions, named Titan, lost contact with the surface during a dive to the wreckage of the Titanic at a depth of 3,810 metres.\n\n\n\n\n\nAboard were OceanGate's CEO, Stockton Rush, and four passengers: British billionaire Hamish Harding, Pakistani-born British businessman Shahzada Dawood, and his 19-year-old son, Suleman, and French explorer Paul-Henri Nargeolet.\n\n\n\n\n\nEach passenger paid $368,000 for the experience.\n\n\n\n\n\nAfter the loss of contact, the US Coastguard launched an extensive - and expensive - search operation.\n\n\n\n\n\nRear Admiral John Mauger was leading the operation and admitted it was a challenging task, involving the coordination of many different resources.\n\n\n\n\n\n\"This is a complex case, and the Coast Guard doesn't have all the resources to be able to effect this kind of a rescue, although this is an area that's within our search zone. My lead planner for this effort is called the SAR Mission Coordinator of the Search and Rescue Mission Coordinator. And that's a reflection of in many cases, we are working to bring all assets to bear and our role is in coordinating all of the technical expertise that we can bring to bear on the problem. In addition to flying aircraft or operating ships out on the water when necessary.\"\n\n\n\n\n\nFrench-Australian Submarine expert Eric Fusil - with 20 years of experience - admitted the search was extraordinarily difficult.\n\n\n\n\n\n\"Honestly, it's like finding a needle in a haystack. First, when you are above the surface, we can use GPS we can use radar, we can use radio. There is nothing like that, that we can use below the sea because simply put the electromagnetic frequencies the electromagnetic waves do not propagate far under sea so you can only rely on acoustic sensors to try to mitigate and be aware of your environment.\"\n\n\n\n\n\nOn June 22nd, Rear Admiral Mauger told waiting reporters that all hope was lost.\n\n\n\n\n\n\"This morning, an ROV or remote operated vehicle from the vessel Horizon Arctic discovered the tail cone of the Titan submersible approximately 1600 feet from the bow of the Titanic on the sea floor. The ROV subsequently found additional debris in consultation with experts from within the unified command. The debris is consistent with the catastrophic loss of the pressure chamber.\"\n\n\n\n\n\nAt nearly four kilometres underwater, the pressure equates to 400 atmospheres (6,000 PSI) – as much as 35 elephants on one's shoulders.\n\n\n\n\n\nAll aboard would have been killed in an instant.\n\n\n\n\n\nDetails began to emerge that the Titan submarine had issues.\n\n\n\n\n\nDavid Pogue is a science writer and has been aboard Titan in the past.\n\n\n\n\n\nHe spoke at the time of when he first saw the submersible.... and he was not impressed - and feared for his life.\n\n\n\n\n\n“Before we went, we had never seen the sub. We didn't know anything about it. There's very little information on the website. Just that it's a state of the art, one-of-a-kind carbon fiber submersible. I didn't know at that point that you drive the thing with an Xbox game controller. I didn't know that the ballast was, you know, used construction pipes. You just, you get there and then you start seeing this stuff and now your mood crashes and you get a little worried. Like, is this the level of polish and sophistication we're talking about?\"\n\n\n\n\n\nNow, just over two years later, the US Coastguard has released its report into the disaster.\n\n\n\n\n\nDavid Pogue's concerns at the time proved to be close to the truth.\n\n\n\n\n\nThe Coastguard determined the safety procedures at OceanGate were “critically flawed” and found “glaring disparities” between safety protocols and actual practices.\n\n\n\n\n\nJason Neubauer is chair of the US Coast Guard Marine Board of Investigation.\n\n\n\n\n\nHe says it appears OceanGate set out to dodge the regulations.\n\n\n\n\n\n\"One of the tactics was not to register the Titan with any flag state. So there was no oversight, you know, which should typically occur in any vessel, even recreational. So that was the first strategy, I've never seen that in 28 years of, of doing and overseeing investigations. The second is to use an international operating area, that's really, you know, outside of where it was constructed, and that really removes Coast Guard oversight domestically. So that's one way that I think they were able to kind of create enough confusion, you know, between the nations where they were operating, to keep going for several years in plain sight. And a part of that is Ocean Gate had a good reputation. So I think they were given the benefit of the doubt, and they did not deserve it.\"\n\n\n\n\n\nThe 300-page report concluded that the inadequate design of the Titan submersible was a primary contributing factor in its implosion.\n\n\n\n\n\nMr Neubauer says had OceanGate CEO Stockton Rush lived, he would have faced manslaughter charges.\n\n\n\n\n\n\"From the Marine Board's perspective, we would have recommended to make a referral to Department of Justice for the prosecutors - to look to conduct a separate criminal investigation of what we have called manslaughter, and that is really based on the fact that he was the master of the submersible and in charge of the safety and was negligent from the standpoint of not complying with any standards and not maintaining the vessel.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rising-rates-of-homelessness-among-first-nations-families-spurs-calls-for-intervention/6kt5zfhtb",
    "title": "Rising rates of homelessness among First Nations families spurs calls for intervention",
    "publish_date": "Tue, 5 Aug 2025 08:40:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWithout a home address, you can't open a bank account.\n\n\n\n\n\nWithout a bank account, you can't get a job or even apply for government income support.\n\n\n\n\n\nWithout any of those, you can't apply for, let alone rent, a property.\n\n\n\n\n\nWhile finding secure and affordable housing feels increasingly difficult for many Australians, getting out of homelessness is even harder.\n\n\n\n\n\nHousing organisations are sounding the alarm over the increasing number of First Nations families with children turning to homelessness services.\n\n\n\n\n\n\"There's more people just deeply affected by the housing crisis. So rents just keep rising and rising and vacancy rates are really low. So it's really hard for people to find a home they can afford in the rental market. And homelessness services are overwhelmed by all the increasing number of people who need help.\"\n\n\n\n\n\nThat was Kate Colvin, the CEO of Homelessness Australia.\n\n\n\n\n\nAccording to their latest report, done in conjunction with the The National Aboriginal and Torres Strait Islander Housing Association, the number of families with children accessing homelessness services rose by five per cent between the 2022-23 financial year and the 2023-24 financial year.\n\n\n\n\n\nOf that five per cent increase, 31 per cent were Indigenous, with homelessness services assisting over 24,000 Indigenous children over that period.\n\n\n\n\n\nDarren Smith is the CEO of Aboriginal Housing Victoria and the Chair of the Aboriginal Housing and Homelessness Forum in Victoria.\n\n\n\n\n\n\"I think the first thing to recognise is that there's a history of exclusion, which includes exclusion from housing for Aboriginal people that's gone on for generations in this country. Aboriginal people are 15 times more likely to experience homelessness in Victoria, which really relates to that legacy of colonisation, dispossession, and decades of policy failure.\"\n\n\n\n\n\nWithout adequate resourcing, homelessness organisations are being forced to turn away families in need.\n\n\n\n\n\nOver the two years, data shows a 12 per cent increase in the number of First Nations families already homeless when they first asked for support, and those still homeless at the end of support rose by 8 per cent.\n\n\n\n\n\nKate Colvin says children are particularly vulnerable in unstable housing.\n\n\n\n\n\n\"We know that when children are homeless, often they have to move from place to place. There might only be temporary accommodation available for a very short time, and then they have to move somewhere else. Or oftentimes there's not temporary accommodation available at all and people end up couch surfing, sleeping cars, sometimes even on the street.\"\n\n\n\n\n\nThe Yoorrook Justice Commission was Victoria's and Australia's first formal truth-telling inquiry led by First Peoples, into historic and ongoing systemic injustices perpetrated against First Peoples through colonisation.\n\n\n\n\n\nOne focus area in the inquiry was child protection.\n\n\n\n\n\nIn Victoria, First Nations children are 21.7 times more likely to be in out-of-home care.\n\n\n\n\n\nFirst Nations youth in Victoria are also incarcerated at a rate of 10.4 times the rate of non-Indigenous youth.\n\n\n\n\n\nDarren Smith says homelessness is just one consequence of these systemic injustices.\n\n\n\n\n\n\"We know that there's a high proportion of Aboriginal children that are in out of home care and involved with a child protection system who are turning up into homelessness services to access housing support. And we should be able to actually do something that can resolve those issues for those young people. And it's part of preventing the next generation of child removals.\"\n\n\n\n\n\nFor kids, not having a stable address often means being unable to attend school.\n\n\n\n\n\nKate Colvin says that when housing instability starts in youth, it's more likely to persist into adulthood.\n\n\n\n\n\n\"It's very difficult for children to stay connected to their education in that circumstance. Even if they're going to school, they might really struggle to fully participate in the classroom. So it has then often a long-term impact with adults who are homeless, particularly rough sleeping, often having had their first experience of homelessness as a child. So huge impacts. And we think that this is such a huge priority for government. We shouldn't have children homeless in Australia, and we really hope that this goes to the top of their priority list.\"\n\n\n\n\n\nHomelessness comes in different forms, with those sleeping rough making up just over 5 per cent of people experiencing homelessness in 2021.\n\n\n\n\n\nWhile First Nations people account for under 4 per cent of the total population, they account for 28 per cent of all homeless people in Australia.\n\n\n\n\n\nDarren Smith says generations of disadvantage mean many First Nations families don't have intergenerational wealth to fall back on.\n\n\n\n\n\n\"Without safe, secure and affordable housing, people don't have the stability to support themselves. So we understand, and we know about intergenerational wealth as well. So, the fact that people don't have the security so that they can get the kind of opportunities in terms of employment, kids not going to school, all those things contribute in the longer term to the ability to create wealth over a lifetime and intergenerational wealth and without that passing of intergenerational wealth from parents to their children, they're behind the market, behind the ball in terms of being able to actually access the housing market themselves in the future.\"\n\n\n\n\n\nThere are many reasons for homelessness, including poverty, lack of housing supply, domestic and family violence and relationship breakdowns.\n\n\n\n\n\nKate Colvin says that when people access homelessness services before the point of crisis, they are far less likely to become homeless.\n\n\n\n\n\n\"So what we know is that if someone comes to a homeless service and can get that early intervention support, so they come to a homelessness service, they're at risk of homelessness, in 80 per cent of circumstances, they don't become homeless. So the homeless service can help negotiate issues that may have arisen with the landlord, might be able to help assist with some arrears if that's the issue. Or sometimes if it's family breakdown, often we have young people who are experiencing homelessness because of conflict or difficulties at home. And a homelessness service might be able to assist that young person to return safely home if that's possible, or to stay safely perhaps with another family member.\"\n\n\n\n\n\nThe problem, she says, is that with surging demand for these services, those not yet in crisis can't be prioritised.\n\n\n\n\n\n\"But the problem is that when people come to a homelessness service, they've got so many people who just don't have accommodation that evening that they're triaging the support that's available. And so it does end up going to someone who is in that more immediate and desperate circumstance, but then down the track, the problem is, is that it's much harder to rehouse people than it is to stop the tenancy breakdown.\"\n\n\n\n\n\nWith nationwide housing supply issues, even those with secure employment are finding it increasingly difficult to find affordable, appropriate housing.\n\n\n\n\n\nDr Erika Martino is a VicHealth Postdoctoral Research Fellow at the Centre of Health Policy at the University of Melbourne.\n\n\n\n\n\nShe says that racism can also be a barrier to getting rentals.\n\n\n\n\n\n\"Our work and also more broad evidence in the sector suggests that racism in the rental market is widespread, but it's often under-reported and also extremely hard to prove. And this can include being ignored by agents offered fewer inspections, asked to pay more rent or much more rent upfront to secure the properties. We heard that a lot, that people had to cough up to six months rent to secure a place. And these practices are essentially, I would say, facilitated by an unequal power dynamic within the rental system that preferences housing provider rights over tenant rights.\"\n\n\n\n\n\nDarren Smith says that some landlords and real estate agents make assumptions about potential renters and sometimes prioritise non-Indigenous applicants.\n\n\n\n\n\n\"We certainly see that Aboriginal people don't have the same opportunities that everyone else has. So if there's a choice, Aboriginal people are at the bottom of it. We do hear stories, particularly for regional areas about families being knocked back for properties. Assumptions being made about who the renters are or potential renters are based on their surnames. And even we see discrimination from time to time where people are working for Aboriginal organisations that there's an assumption around Aboriginality where they don't get the same kind of opportunities to access private rental markets.\"\n\n\n\n\n\nHomelessness is not only an issue of housing, but of health.\n\n\n\n\n\nDr Martino says if rising rates aren't dealt with, Australia's health system will also be impacted.\n\n\n\n\n\n\"There is a large body of evidence both generated from within my research group and internationally that shows that homelessness and housing insecurity are strongly linked to poor, physical and also poor mental health outcomes. So for example, people experiencing homelessness face higher rates of chronic illness, injury, disability, and also premature mortality. And mental health conditions such as depression, anxiety, and trauma are both causes and consequences of housing instability. \"\n\n\n\n\n\nIf the rate of Indigenous people accessing homelessness services in Victoria were scaled up to the general population of Victoria, it would be around 1.2 million people.\n\n\n\n\n\nIf 1.2 million Victorians were accessing homelessness services, it would likely be declared a national emergency.\n\n\n\n\n\nKate Colvin says the longer this crisis goes unaddressed, the more investment will be needed down the line.\n\n\n\n\n\n\"So the main issue with federal and state interventions in homelessness is that there's just simply not enough resourcing. So for example, when we have a health crisis like COVID , there was a huge surge in investment into hospitals because there was a recognition that more people would need that emergency intervention. But we have had a growing and growing and growing housing crisis in this country, and the governments just haven't responded by increasing investment in homelessness services. \"\n\n\n\n\n\nWhile the Australian government has committed to building more homes, not all forms of housing are appropriate for everyone.\n\n\n\n\n\nDr Martino says problems often arise when social housing models are treated as one size fits all.\n\n\n\n\n\n\"There are in particular certain housing forms that are, or models that don't work particularly well. So for example, shared or high density settings, housing can often retraumatise women who have been experienced abuse or violence. And some of my research, having spoken to some women who've been through say, the crisis accommodation system because there's not enough crisis accommodation available, often women will end up in motels due to insufficient supply, and this is actually placed or places women at further risk. And this will sometimes mean that women end up returning to unsafe family homes. So they're essentially forced to choose between homelessness and violence.\"\n\n\n\n\n\nThe Australian Government's Closing the Gap Target aims to increase the number of Aboriginal and Torres Strait Islander people living in appropriately sized housing to 88 per cent by 2031.\n\n\n\n\n\nWhile improvements have been made, the government is not on track to meet those targets.\n\n\n\n\n\nDarren Smith says that to provide culturally safe and appropriate housing for Aboriginal people, there needs to be more investment in the Aboriginal community controlled sector.\n\n\n\n\n\n\"The first thing you need to do when you need to address homelessness is you need to be able to provide people with a home. And we have 7,000 Aboriginal people across Victoria at the moment that are seeking social housing, and we need to make sure that the Aboriginal community controlled sector is supported so that they can actually provide that housing.\"\n\n\n\n\n\nKate Colvin says if the government wants to see serious improvements, it must put First Nations-led organisations in charge of leading the efforts.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/kmart-faces-lawsuit-over-allegedly-sourcing-stock-from-factories-linked-to-forced-labour/mp8voimvo",
    "title": "Kmart accused of sourcing stock from factories allegedly linked to forced labour",
    "publish_date": "Tue, 5 Aug 2025 08:11:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Retail giant Kmart is facing accusations that it misled customers on its ethical credentials by allegedly sourcing clothing supplies from factories in China with links to slave labour.\n\n\n\n\n\nAn Australian-based Uyghur group has filed a lawsuit against the outlet in the Federal Court, seeking to gain documents so they can see whether it knowingly sourced stock from suppliers who they claim used forced labour from those in the ethnic group.\n\n\n\n\n\nIn its ethical sourcing statement, Kmart said it aimed to provide products that respected human rights according to its ethical sourcing code, which committed to abiding by international standards, including guidelines set out in the United Nations Universal Declaration of Human Rights.\n\n\n\n\n\nThe lawsuit, filed by the Australian Uyghur Tangritagh Women's Association, claims Kmart included on its 2024 and 2025 factory lists two suppliers that they claim have links to the Xinjiang Uyghur Autonomous Region.\n\n\n\n\n\nIt said this region in China's west has been well-documented for \"systemic state-sponsored forced labour and other atrocities against Uyghur and other Turkic Muslim people\".\n\n\n\nLISTEN TO How Australia's Modern Slavery Act is failing the Uyghur community SBS News 13:00 English\n\nThe group wants proof from Kmart that it has abided by its ethical sourcing promises regarding these suppliers and whether its public statements have been misleading or deceptive.\n\n\n\n\n\nKmart must ensure it is not profiting off forced labour in China, association president Ramila Chanisheff said.\n\n\n\n\n\n\"We're demanding answers from Kmart so we know whether its actions live up to its words about addressing forced labour risks in its supply chain,\" she said.\n\n\n\nKmart defends its sourcing program\n\nIn a statement, Kmart defended its sourcing program, adding that regular monitoring is conducted through site visits and audit programs.\n\n\n\n\n\n\"For over 15 years, we have had in place an Ethical Sourcing Program, which helps us to identify and mitigate modern slavery risks, including the risk of forced labour, in our operations and supply chains,\" it said.\n\n\n\n\n\nKmart risks a legal claim that it breached Australian Consumer Law by misleading and deceptive conduct if documents show it had failed to monitor the risk of using forced labour in its supply chain.\n\n\n\n\n\nJennifer Kanis, principal lawyer for law firm Maurice Blackburn, who are representing the Uyghur group, said the firm was using this first-of-its-kind case to bring real accountability to Australian retailers.\n\n\n\nMaurice Blackburn lawyer Jennifer Kanis said the firm has identified \"credible links between two of its factories and suppliers and the use of Uyghur forced labour in Xinjiang\". Source: AAP / Alex Murray Kanis said that the lawsuit's allegation that there were links between the factories and the use of Uyghur forced labour was, in their view, in opposition to Kmart's position that it \"supports ethical sourcing and the protection of human rights\".\n\n\n\n\n\nKmart said in its statement that it was disappointed that the legal action is proceeding after it spent more than 12 months communicating with Maurice Blackburn over the details of its sourcing program.\n\n\n\n\n\nHuman Rights Law Centre associate legal director Freya Dinshaw said the case highlighted the weaknesses in Australia's laws when members of the public are left to take companies to court on suspicions of modern slavery.\n\n\n\n\n\nUnlike the United States, Australia has not banned imports of products made in the Xinjiang region, instead opting for a transparency approach that requires businesses to report annually on their actions to identify and address slavery risks.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/plug-in-hybrids-drive-sales-migrants-more-optimistic-asx-rallies-to-record-high/pukwobysv",
    "title": "Plug-in hybrids drive sales, migrants more optimistic & ASX rallies to record high",
    "publish_date": "Tue, 5 Aug 2025 08:06:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-report-says-tackling-climate-change-linked-to-economic-prosperity/ss98mf7fm",
    "title": "New report says tackling climate change linked to economic prosperity",
    "publish_date": "Tue, 5 Aug 2025 05:59:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhile economic cost is often considered a barrier to the transition to clean energy, a new report from the Productivity Commission suggests getting this transition right could boost Australia's economic growth.\n\n\n\n\n\nThe report from the independent government advisory body, titled 'Investing in cheaper, cleaner energy and the net zero transformation,' outlines a set of steps its authors say would get Australia back on the path to productivity growth by tackling climate change.\n\n\n\n\n\nProductivity Commissioner Barry Sterland says the report makes an important connection between two of Australia's most pressing issues, lagging productivity, and addressing the impacts of a changing climate.\n\n\n\n\n\n\"Our productivity performance has been really bad. It is critical for income growth and intergenerational equity that we improve our productivity. Performance and climate change also has to be dealt with. It's a long-term issue. The government's made international commitments and Australia needs to meet those. And so what we're trying to do in this report is bring those two things together.\"\n\n\n\n\n\nIt's the second of five reports due ahead of a federal government summit later this month [[19-21 Aug]] aimed at lifting productivity rates and boosting economic growth.\n\n\n\n\n\nThe report's recommendations include actions to reduce the cost of meeting emissions targets, speeding up approvals processes for new energy infrastructure, and addressing barriers to private investment in the transition to clean energy.\n\n\n\n\n\nMr Sterland says the report acknowledges that the transition to green energy infrastructure can and must happen faster and more efficiently.\n\n\n\n\n\n\"The current system has for a long time, there's been a wide recognition that it doesn't really protect the environment particularly well, but it also takes too long for all sorts of projects to navigate and particularly energy infrastructure. The timelines have really blown out and got very long, and that's starting to challenge our ability to develop the clean energy we need to replace the existing aging infrastructure.\"\n\n\n\n\n\nHe says building Australia's preparedness for future climate impacts by improving processes now is key to the country's future economic prosperity.\n\n\n\n\n\n\"Climate impacts are coming and they're going to affect us no matter what responses happen. Now there's a certain amount of climate response coming into the system, and so we have to start acting early so that we are more resilient and the cost of those natural disasters doesn't keep going up so that we have a more resilient society so that we can still manage to have all the things we really want while addressing those climate impacts.\"\n\n\n\n\n\nClimate Council CEO Amanda McKenzie says the report recognises Australians are already feeling the wide-reaching economic impacts of climate change.\n\n\n\n\n\n\"We are seeing right now the impact in South Australia of this massive algal bloom which has been driven by a massive marine heat wave, and that's affecting fisheries. It's affecting tourism and of course the community. We found that annual farm profits across Australia are 23 per cent lower since 2 000 due to climate change and one of the big worries in the community as of course the uninsurability of houses.\"\n\n\n\n\n\nShe says the Commission suggests a key priority in tackling these rising economic impacts needs to be making Australian houses more climate resilient.\n\n\n\n\n\n\"It says that if we are better prepared, we can cope with disasters more effectively. So it has a series of recommendations that we also endorse creating a central public database for all climate hazards so people have better access to understanding what they're actually exposed to. They also couple that with a recommendation around a star rating system for housing resilience so that homeowners can work out well, what do I need to do to make my house safer.\"\n\n\n\n\n\nMr Sterland says building this resilience is one way to improve Australia's economic position, by lowering disaster recovery costs.\n\n\n\n\n\n\"We've got to start making our society and our economy and our housing stock in particular, which is what we focus on in this report, more resilient to that change so that the human impacts of those disasters aren't as great the disaster spend that all the governments are having to respond in picking up the pieces and assisting communities pick up the pieces after those disasters. And so that is a challenge.\"\n\n\n\n\n\nDani Alexander is the CEO of the Energy Institute at the University of New South Wales.\n\n\n\n\n\nShe says with Australia's current energy infrastructure aging and in need of replacement, the Commission's report acknowledges an important opportunity to make the transition to clean energy benefit the economy.\n\n\n\n\n\nBut she says finding the most efficient and cost-effective way to achieve this transition also requires innovation and research- and currently, Australia's investment in research and development lags behind other OECD countries.\n\n\n\n\n\n\"We've got some of the best minds in energy innovation right here in Australia. But we need to activate our fantastic research and also technology development capabilities to get more from our energy projects, which is what productivity is all about. Unfortunately, we haven't seen this opportunity highlighted in the interim report or indeed even the latest update from the strategic examination of R and D (research and development.\"\n\n\n\n\n\nShe says the Productivity roundtable later this month gives the Australian government a chance to invest in finding new solutions to tackle climate change and boost productivity.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-has-lifted-its-cap-on-international-students-heres-by-how-much/zze1o982f",
    "title": "Australia has lifted its cap on international students. Here's by how much",
    "publish_date": "Tue, 5 Aug 2025 05:32:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "The addition of 25,000 student enrolments for next year has been welcomed by the university sector, despite questions about how to unlock the placements.\n\n\n\n\n\nOn Monday, Education Minister Jason Clare announced a National Planning Level of 295,000 international student places for 2026 to manage growth in a \"sustainable\" way.\n\n\n\n\n\nThe government will issue a new direction for the changes, replacing Ministerial Direction 111, which acted as a de facto cap and enabled it to reduce numbers by slowing visa processing and assigning quotas for international students to each university.\n\n\n\n\n\nClare announced two caveats for universities to gain additional placements: student housing and a focus on Southeast Asian neighbours.\n\n\n\nEducation Minister Jason Clare has increased international university numbers by 9 per cent for 2026. Source: AAP / Lukas Coch Phil Honeywood, CEO of the International Education Association of Australia (IEAA), welcomed the 9 per cent increase but highlighted that the levels were still lower than during the pandemic.\n\n\n\n\n\n\"Any increase in the enrolment figures from the government is very welcome ... however, it's patchy,\" he told SBS News.\n\n\n\n\n\n\"Our English language colleges are collapsing as we speak because of the combination of high student visa fees and just a concern that the future for Australian international education is not fantastic.\"\n\n\n\nRegional Universities Australia CEO Alec Webb reacted to the news with \"positivity\", praising the fact that \"no university will go backwards in 2026\".\n\n\n\n\n\n\"It definitely signals that Australia is still open for business, and Australia should still be a destination that is being considered for prospective international students,\" Webb told SBS News.\n\n\n\nNew housing critical to extra placements\n\nUniversities will have to demonstrate stronger engagement with Southeast Asia and progress in providing secure student accommodation for both local and international students in order to apply for an increase in their allocation.\n\n\n\n\n\nWhile Honeywood encouraged the pivot to closer neighbours such as Thailand and Indonesia — \"great student source markets\" — he expressed concern about housing backlogs.\n\n\n\n\n\n\"It's taking purpose-built student accommodation companies anything up to three years to get a project approved and commence construction. So it's a long game,\" he said.\n\n\n\nREAD MORE New international student order met with mixed reaction from university sector\n\nIt's a concern also expressed by Webb, who hopes universities will get clarity around housing expectations soon, as well as more information about how the 25,000 placements will be split between metro and regional universities.\n\n\n\n\n\n\"Obviously, that can't be a new site build, there is an incredible amount of delay and lag associated with not only obtaining the planning permissions, but also with the actual construction itself,\" he said.\n\n\n\n\n\n\"So we're very keen to work with the department and the government to better understand what the expectation is in regards to securing the supply of housing.\"\n\n\n\n\n\nSBS News has contacted Clare for comment.\n\n\n\nREAD MORE Are international students to blame for the housing crisis?\n\nThe focus on housing reflects the intersection between education and migration, a point exacerbated during the federal election campaign.\n\n\n\n\n\nFormer Opposition leader Peter Dutton said the housing crisis had been exacerbated by record levels of migration, which peaked at 536,000 in 2022-23, and used it to justify proposed cuts to migration levels .\n\n\n\n\n\nIn opposition to Labor's student cap legislation last year, Greens senator Mehreen Faruqi argued that international students are being used as a \"scapegoat\" for a \"housing crisis they did not cause\" .\n\n\n\nAustralia 'the least worst' option\n\nThe sector has repeatedly raised concerns that the ongoing debate about international student numbers is deterring prospective students from choosing Australia, delivering a blow to the $34 billion a year industry.\n\n\n\n\n\nHowever, Honeywood says Australia can capitalise on recent disruption to the global market caused by Donald Trump's presidency in the United States.\n\n\n\n\n\n\"Australia's been very fortunate that other countries we compete against, particularly Canada, Donald Trump's USA now and the UK are also winding back on international student recruitment,\" he said.\n\n\n\n\n\n\"And therefore when students are thinking which country to go and study at, they're obviously seeing that Australia is in many cases the least worst when it comes to their ability to access education.\"\n\n\n\nFrom tariffs to university education, experts argue that President Donald Trumphas created global uncertainty that Australia can capitalise off. Source: AP / Evan Vucci This week's announcement outlines capacity for 2026 ahead of new legislation, subject to passing, which will establish the Australian Tertiary Education Commission.\n\n\n\n\n\nThe body will oversee student caps and university allocations, balancing which courses and skills are needed and hopes to provide stability to the sector from 2027.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/these-hefty-cinnamon-scrolls-are-some-of-the-best-value-buns-in-melbourne-20250806-p5mkt1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "These hefty cinnamon scrolls are some of the best value buns in Melbourne",
    "publish_date": "Wed, 06 Aug 2025 12:23:07 +1000",
    "category": "finance",
    "authors": [
      "Quincy Malesovas"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nHeart Bakes in Port Melbourne is known for its tall, doughnut-like scrolls.\n\n1 / 6 Heart Bakes is known for its hefty scrolls. Supplied 2 / 6 Outside the Port Melbourne cafe. Supplied 3 / 6 Tiramisu scrolls are also available. Supplied 4 / 6 In the kitchen. Supplied 5 / 6 Take a seat outside while you wait for your coffee. Supplied 6 / 6 Good Food crowned Heart Bakes’ cinnamon scrolls as the best value in town. Supplied Previous Slide Next Slide\n\nBakery$$$$\n\nHeart Bakes is known for its value-for-money cinnamon scrolls ($7.50). They’re hefty – about 9cm high and almost doughnut-like in texture, doused in a liberal drizzle of icing. The cinnamon flavour is subtle, ideal for those who prefer a less intense spice. All baking is done on-site, and dining in means your scroll can be warmed to order. Can’t make it to Port Melbourne? You’ll also find them at its sibling cafe Heart Coffee in Richmond.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/rugby-world-cup-2027-coming-down-under-20250806-p5mkt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby World Cup 2027 coming Down Under",
    "publish_date": "Wed, 06 Aug 2025 12:14:25 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rugby World Cup 2027 coming Down Under\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/queensland/queensland-emerging-as-a-standout-economic-performer-report-says-20250804-p5mk8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queensland emerging as a ‘standout economic performer’, report says",
    "publish_date": "Wed, 06 Aug 2025 12:07:41 +1000",
    "category": "finance",
    "authors": [
      "William Davis"
    ],
    "text": "Queensland’s population growth and an expected swell of investment before the 2032 Brisbane Games has been a boon for the state’s commercial property sector, according to industry giant JLL.\n\nA new report, Unlocking Queensland’s Potential, found Queensland was “emerging as a standout economic performer” following the continued rise in interstate migration and infrastructure spend.\n\n“Brisbane’s commercial property sector is offering a rare combination of stability, scale and growth,” the US real estate services company said in a statement.\n\nBrisbane’s commercial real estate market has “appeal as a low-volatility, long-term investment” according to JLL. Credit: Courtney Kruk\n\nVacancy rates in Brisbane’s CBD office market were the least volatile in the country during the past decade, according to the JLL report.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/lifestyle/delta-goodrem-celebrates-lipstick-day-for-a-heartfelt-cause-20250806-p5mksz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Delta Goodrem celebrates Lipstick Day for a heartfelt cause",
    "publish_date": "Wed, 06 Aug 2025 12:04:53 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Delta Goodrem celebrates Lipstick Day for a heartfelt cause\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-albanese-advances-efforts-to-end-gaza-humanitarian-crisis-bill-and-hillary-clinton-subpoenaed-in-epstein-case-20250806-p5mknw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Albanese advances efforts to end Gaza humanitarian crisis; Bill and Hillary Clinton subpoenaed in Epstein case",
    "publish_date": "Wed, 06 Aug 2025 12:00:59 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Opposition Leader Sussan Ley has hit out at the Albanese government’s economic management, finding that “all is not well” as Australians continue to grapple with persistent cost of living pressures.\n\nSpeaking in Victoria, Ley said that Australian businesses were being weighed down by excessive regulation and compliance standards, which she noted were key drags on productivity.\n\nOpposition Leader Sussan Ley. Credit: Simon Schluter\n\n“Everywhere I go, I’m hearing messages that tell me that all is not well, particularly for small business,” Ley said.\n\n“No matter how good you are at what you do, running a small business, if you’re overwhelmed by red tape and compliance, it’s a dead weight loss of productivity.”\n\nLey also used the news conference to raise concern about the potential for raised taxes following its economic reform roundtable this month, and criticised the government’s handling of energy prices.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/politics/queensland/resources-department-paid-187k-to-industry-figure-for-25-days-work-20250806-p5mkqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Resources department paid $187k to industry figure for 25 days’ work",
    "publish_date": "Wed, 06 Aug 2025 12:00:22 +1000",
    "category": "finance",
    "authors": [
      "Matt Dennien",
      "Marissa Calligeros"
    ],
    "text": "Queensland’s Resources Department paid $187,500 to industry figure Ian Davies for up to 25 days of “strategic analysis” of the state’s north-west mineral region and talks with Swiss mining giant Glencore.\n\nDirector-general Graham Fraine confirmed the arrangement at a parliamentary estimates hearing, but would not be drawn on whether he knew of a donation to the LNP in Davies’ name.\n\nDavies left his role leading major east-coast gas producer Senex Energy, part owned by Gina Rinehart’s Hancock Prospecting, in January after almost 15 years.\n\nIan Davies’ knowledge and expertise was described by Resources Minister Dale Last as “invaluable”. Credit: Oscar Colman\n\nFor more than seven years until February, he held board roles – including as chair – with the peak Australian Energy Producers group, and since August has been on the board of Adelaide-based Amplitude Energy, where he will take up the chair position in November.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/technology/bubble-fears-the-multitrillion-dollar-threat-hanging-over-markets-20250806-p5mkqk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bubble fears: The multitrillion-dollar threat hanging over markets",
    "publish_date": "Wed, 06 Aug 2025 12:00:12 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Morgan Stanley research has said global data centre capacity will expand by 600 per cent by 2030. It has a lower estimate of what that will cost – $US3 trillion. This year, hyperscalers are expected to invest about $US320 billion, compared to $US200 billion last year. By 2028, they will be investing more than $US300 billion in data centres and AI chips. Data centres are popping up around the globe to power the AI boom. Credit: Bloomberg Whether it is $US3 trillion or $US6.7 trillion, the scale of investment is staggering and is far out-running the revenues being generated. Last year, those hyperscalers generated only $US45 billion of AI-related revenue. By 2028, Morgan Stanley said, their revenues might exceed $US1 trillion. That qualification – the “might” – is significant. Companies are pouring ever-increasing amounts of their shareholders’ funds into AI, based on very optimistic expectations of its potential revenues and margins and the development of applications that don’t currently exist.\n\nFierce competition to be one of those left standing and dominating the sector when the inevitable clean out occurs is fuelling an investment binge, although, at this admittedly very early stage of the sector’s development, the massive numbers of AI users aren’t translating into a material base of paying users. Loading The entity that sparked the boom, Open AI’s ChatGPT, for instance, has about 700 million weekly active users and that user base is growing at a dramatic rate – roughly four times its size last year. It has, however, only about 5 million paying business users, and while that is growing rapidly, the conversion rate from free to paying users is less than impressive for a business valued in its most recent funding rounds at about $US300 billion. By the end of this year, OpenAI is expected to generate revenue at an annualised run-rate of about $US20 billion. Earlier this year, the group agreed a deal with Oracle under which it will pay $US30 billion a year to lease 4.5 gigawatts of data centre computing power and another with Nvidia to buy $US40 billion of its most powerful chips. It is a cash and capital-devouring sector, on an unprecedented scale.\n\nMost of the big players in AI would share broadly similar features with OpenAI, although the established mega techs like Amazon, Microsoft, Google and Meta Platforms may have the opportunity of commercialising AI within their existing customer base. These massive investments are being made – the mega-techs are spending around $US100 billion each this year, with plans to spend more next year and beyond – without any firm understanding of the eventual demand or the returns from the investments. The problem with market bubbles is you only know you are in one when they burst. Credit: AP That hasn’t phased investors, who are ploughing funds into the sector at ever more dizzy valuations. Elon Musk’s xAI, for instance, first raised money, at a $US18 billion valuation, in March last year. It raised more in December, at a $US50 billion valuation. By March this year, another raising saw its value increased to $US80 billion and, more recently, it was looking to raise funds at a valuation of up to $US200 billion.\n\nSomehow, having raised about $US30 billion or so of debt and equity for an entity that is expected to burn about $US13 billion of cash this year and which doesn’t expect, if everything goes according to its plans, to be cashflow-positive before 2029, people are valuing it, with real money, at $US200 billion? That’s what you’d call a very high-risk investment, particularly when you take into account xAI’s competitors in this race of AI supremacy, most of whom have massive cash flows from their existing operations to self-fund their AI plays. xAi’s valuations are effectively a capitalisation of Musk’s reputation. Is the AI boom a bubble? We’ll only know if it bursts. There are a couple of other features of the sector that provide question marks. One is that, to date, the generative AI sector is overly-reliant on expensive Nvidia chips, which are upgraded regularly and are therefore a recurring and very substantial cost.\n\nThe other is that the multitude of data centres that are being built, and those that will have to be built, to power the rollout of AI require huge amounts of power themselves. The International Energy Agency has estimated that electricity demand from data centres will more than double by 2030 and that by that date the US economy will consume more electricity for data processing than it now does for the manufacturing of all energy-intensive goods, including aluminium, steel, cement and chemicals. Whether it is even possible for the power requirements of the data centres to be met within the timeframes AI firms need them and at affordable prices is a significant question, particularly in the US, where Joe Biden’s push for a surge in renewables has been aborted by Donald Trump. ChatGPT has about 700 million weekly active users and that user base is growing at a dramatic rate. Credit: Getty None of this is meant to question the potential of AI to ignite a new industrial revolution, transforming work and society.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/books/he-was-an-egotist-adam-courtenay-s-shocking-memoir-about-father-bryce-20250729-p5mirf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He was an egotist’: Adam Courtenay’s shocking memoir about father Bryce",
    "publish_date": "Wed, 06 Aug 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Susan Chenery"
    ],
    "text": "As a former ad man, he understood decades before anyone else that Bryce Courtney was a brand. “He got huge amounts of shit over that, but I think it is his greatest legacy,” says Adam with a snide laugh. But perhaps Bryce’s greatest fictional creation was himself. Not only was he a master storyteller, he was a master of self-invention. Adam believes Bryce invented himself from the moment he set foot on Australian soil in 1958. Sydney was a sunny, open place where you could leave the past behind and become somebody else. And so the myth began; the ascendancy of Bryce Courtenay, the braggadocio, the legend. There were the advertising years, in says Adam, the flimflam man; the drinking, smoking, womanising. Adam feared sitting next to his father at dinner parties, “the more beers, the greater the megalomania.” Then came the Damascene conversion to long-distance running and positive thinking. Pain was gain. Adam had a front-row seat: he watched all these incarnations, “caught between love and admiration for my father, and a gnawing sense that something wasn’t right.” He and his brothers let the Dad facts “through to the keeper all the time.”\n\nSpending his life in close proximity to a fabulist, Adam became a truth seeker. He became a financial journalist, first in Sydney, then for 15 years in London working for the Financial Times and The Sunday Times. Now an author, his own strictly non-fiction historical books deal with the great characters and stories from early colonial history, the escaped convicts and reprobates, the men who went native, “the guys that history has often overlooked.” They are a fascinating insight into how it was in the brutal newly formed colony, how we became what we are. As Adam got older, there was a “moral confusion” about his father “mixing bullshit with a marvellously told story”. He was finding it harder to accept the narrative as it flew along. He now realises his sense of self was at stake. “We all tell porkies all the time. But when it comes to important things I think you have to be honest.” And by the third act of Bryce’s life, fame and wealth. “It started to wear very thin because it became bullshit about himself and who he was and where he came from,” Adam says. “That’s a different mode of bullshit. The Dad facts become pertinent and real. It takes on a different dimension.” As his father became Australia’s most beloved author, Adam says he had trouble recognising him. His first wife of 38 years, Benita, had been left behind. He was shedding skin. He had a new “family” with Christine Gee. “His new role in life was to be a guru for the people,” says Adam. “There was almost a priest-like ability … he ministered to people. He was always there to help. I never doubted his capacity or ability, but I no longer believed in the myth that he was still creating right up to the end.”\n\nFiction and fact were becoming blurred. Defending charges of antisemitism for Solomon’s Song, Bryce blithely told The Australian Jewish News that his wife and sons had “freely chosen to be Jews”. They had not. Adam’s mother Bonita was Jewish but agnostic and called herself Anglican. Adam, a Christian, was “very, very angry. There was no Jewish religion or culture. It just did my head in because he was saying something about me that didn’t exist.” Adam believes his finest book was April Fool’s Day, about his favoured son Damon, who was a haemophiliac and died of AIDS at 25 after a contaminated blood transfusion. In theory, it was non-fiction, but he caricatured people, played fast and loose with the facts and hurt people who loved Damon, some of whom threatened to sue. “There was no need for exaggeration,” says Adam. “There were things that were just wrong. It wasn’t necessary to enhance what happened. The story had enough pathos in itself.” Bryce Courtenay in his days as an advertising man, in 1992. Credit: Barry Chapman/Fairfax Media Bryce would go on to be an advocate for blood screening and HIV. “He demystified AIDS to a great degree,” Adam concedes. “And that has to be remembered.” Adam does, though, have some fond memories “I remember laughing (at) Dad’s trying to be cool. I found it really sweet,” he says. He was a present and involved father who sent his boys to Cranbrook, and gave them substantial financial help in buying their first homes.\n\nBut Adam would learn though that confronting Bryce was seen as an act of betrayal. “Moderating my adoration,” Adam says diplomatically. The blue eyes would turn acidic. It was only years later that he realised “I was being gaslit by a specialist”, he writes in the memoir. Suddenly, Bryce would be the victim. Loading It was Bryce’s sister Rosemary who provided the answers Adam needed: the foundation of his own life had been based on confabulation. Bryce’s insatiable need for adulation came from a place of shame. He was not the orphan he told audiences he was, often moving himself to tears. But he was illegitimate. In provincial 1930s and ’40s South Africa, this made his mother socially unacceptable. There was no noble lineage; his father was not a crusading barrister but an alcoholic married clothing salesman, Arthur Ryder. Bryce’s childhood was chaotic. His mother Paddy Greer, who eventually embraced Pentecostal religion and spoke in tongues, was constantly moving, unable to hold down a job.“I think his mother treated him very badly,” Adam says. “And I think he was very, very lonely.” The poverty was dire. Bryce spent time in an orphanage at Krugersdorp and was bullied at several schools because he didn’t have a father.\n\nLoading Adam learnt that he was not the most gifted scholar ever seen at the King Edward VII school, nor was he ever offered a place at Oxford. “I feel compassion and sadness. There was darkness there and stories and myths may have been to get himself out of depression.” Adam stops short of calling Bryce a narcissist. “A narcissist is someone who doesn’t care about anybody else. And I want to give Bryce credit for really caring about lots of people, his generosity was incredible. He helped hundreds of people as a mentor,” he says. “I think he was an egotist, not a narcissist.” Adam still has great love for his father. “He wasn’t a Machiavellian guy. He didn’t have a nasty side. Essentially, he was a very, very pleasant, engaging, good guy,” he says. “Even if he used to say things that weren’t true.” My Father Bryce (Hachette) by Adam Courtenay is out now.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/culture/books/instead-of-doomscrolling-have-a-laugh-at-these-black-mirror-esque-stories-20250801-p5mjj6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Instead of doomscrolling, have a laugh at these Black Mirror-esque stories",
    "publish_date": "Wed, 06 Aug 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Jack Cameron Stanton"
    ],
    "text": "SATIRE\n\nPlaying Nice Was Getting Me Nowhere\n\nAlex Cothren\n\nPink Shorts Press, $32.99\n\nIn his novel The Real Life of Sebastian Knight, Vladimir Nabokov spoke of “parody as a kind of springboard for leaping into the highest regions of serious emotion”. When a writer takes a worn-out or dead style and reanimates it through the fun of formal play and subversion, they combine their instinct for mockery with pathos (Nabokov described this approach as a “clown developing wings”).\n\nMy ideal parodist charms with a spirited voice and funny representations, before gradually revealing the seriousness behind their burlesques. What separates the satirist from the comedian is the texture of the laughter invoked, found not in just punchlines and observational digs, but in the equally amusing and horrifying lens through the world is portrayed.\n\nAustralian writer Alex Cothren’s short-story collection Playing Nice Was Getting Me Nowhere arises from the American satirical tradition, whose most visible practitioners are George Saunders and Thomas Pynchon. Like Cothren, these writers combine jaunty, sparkling surfaces with a darkly ironic commentary. They render injustice and suffering through cartoonish exaggerations and flights of fancy. And although the satirist wields the grotesque and the unreal, these distortions have the strange effect of making their critique more acutely felt.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/lockyer-explains-why-katoa-will-snub-huge-offers-20250806-p5mksw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lockyer explains why Katoa will snub huge offers",
    "publish_date": "Wed, 06 Aug 2025 11:59:24 +1000",
    "category": "finance",
    "authors": [],
    "text": "Lockyer explains why Katoa will snub huge offers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/world/north-america/inside-jeffrey-epstein-s-dracula-manhattan-lair-20250806-p5mknv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inside Jeffrey Epstein’s ‘Dracula’ Manhattan lair",
    "publish_date": "Wed, 06 Aug 2025 11:56:34 +1000",
    "category": "finance",
    "authors": [
      "David Enrich",
      "Matthew Goldstein",
      "Jessica Silver-Greenberg",
      "Steve Eder"
    ],
    "text": "The ensuing right-wing outrage has threatened to splinter the “Make America Great Again” movement – for whom Epstein is a central figure in conspiracy theories – and has put Trump on the defensive like few other issues. Seeking to quell the backlash, the Justice Department dispatched a top official to meet with Ghislaine Maxwell, Epstein’s longtime associate who is serving a 20-year prison sentence for sex trafficking. On Friday, Maxwell was moved to a lower-security facility. That fuelled speculation that Trump might commute her sentence or even pardon her in return for her cooperation. Pictures seen in Epstein’s townhouse. Credit: US Department of Justice For years, Maxwell was a fixture in Epstein’s New York townhouse, where she had an office. But she and Epstein had split by the mid-2010s. A framed photo in the townhouse showing Epstein with Trump and his then-girlfriend, Melania Knauss, was cropped to exclude Maxwell. At least one other MAGA luminary also visited the townhouse: Steve Bannon, a former adviser to Trump and an online media personality, who has said he videotaped hours of interviews in the mansion with Epstein in 2019. Framed photos of Bannon – including a mirror selfie snapped by Epstein – were kept in at least two rooms in the mansion.\n\nThe townhouse was one of five properties around the world owned by Epstein. After his release in 2009 from a Florida jail, where he served 13 months for soliciting prostitution from a teenager, the mansion served as both a personal hideaway and a salon where he could hold court with accomplished intellectuals, scientists and financiers, according to legal records and interviews with people who frequented the home. The visitors considered Epstein fun, smart and curious. Another perk: getting to mingle with the young, attractive women who roamed the property and worked as his assistants. The townhouse, a stone’s throw from Central Park, was sold to Epstein in 1998 by Leslie H. Wexner, the billionaire owner of L Brands. Epstein renovated and redecorated the mansion in an eccentric style.\n\nGhislaine Maxwell with Epstein. Credit: AP Dozens of framed prosthetic eyeballs lined the entryway. A sculpture of a woman wearing a bridal gown and clutching a rope was suspended in a central atrium. In the ground-floor dining room, Epstein entertained a rotating cast of celebrities, academics, politicians and businessmen. The food could be mundane – sometimes nothing more than a buffet of Chinese takeout, Allen’s letter noted – but the events were anything but. Photos show that guests sat in leopard-print chairs around a large rectangular table. Occasionally, attendees said in interviews, a magician performed.\n\nSometimes, a chalkboard was wheeled out so a guest could sketch a diagram or write a mathematical formula. Epstein preserved a map of Israel drawn on a chalkboard with Barak’s signature, according to a photo reviewed by The New York Times. Up a grand staircase was Epstein’s wood-paneled office, featuring a massive desk. Photos show a taxidermied tiger lounging on a lush rug. In the office, according to photos reviewed by the Times, Epstein showcased a green first edition of Lolita – the 1955 novel in which an intellectual develops a sexual obsession with a 12-year-old girl and repeatedly rapes her. The massage room had paintings of naked women and shelves stocked with lubricant. Credit: US Department of Justice Atop a wooden sideboard were more framed photos, including one of Epstein with Saudi Arabia’s crown prince, Mohammed bin Salman.\n\nSeveral of Epstein’s victims have said the mansion was outfitted with a network of hidden video cameras. In the massage room were paintings of naked women, a large silver ball and chain, and shelves stocked with lubricant, according to photos reviewed by the Times. Loading Epstein regularly directed teenage girls – some recruited from middle schools in Queens – to massage him while he was naked. Sometimes he masturbated in front of them, according to court records and interviews with victims. Sometimes he raped or assaulted them. No surveillance cameras were visible in the photos of the massage room. An earlier collection of letters, presented to Epstein in a leather-bound album for his 50th birthday in 2003, reflected an era of his life before he was first arrested.\n\nThat book included contributions from Trump and Bill Clinton, among dozens of others, The Wall Street Journal reported. Trump has denied a report in the Journal that he contributed a sexually suggestive note and drawing. He has sued the news organisation for defamation. Clinton’s spokesperson has said the former president was unaware of Epstein’s crimes. Loading But by 2016, as Epstein’s reputation as a sexual predator became increasingly hard to ignore, his social network was shrinking. Three years later, he would die in a Manhattan jail while awaiting prosecution on federal sex-trafficking charges. The Times reviewed seven birthday messages given to Epstein in 2016. In addition to those from Zuckerman, Allen and Barak, there were letters from linguist Noam Chomsky and his wife; Joichi Ito, an entrepreneur who years later would resign from the Massachusetts Institute of Technology and the board of The New York Times Co. because of his ties to Epstein; and Lawrence M. Krauss, a prominent physicist. Martin Nowak, a Harvard University biologist, contributed a science-themed poem.\n\nZuckerman, Allen, Ito, Nowak and Bannon did not respond to requests for comment. Barak declined to comment. Chomsky’s wife responded on his behalf and declined to comment. Krauss said he didn’t recall the letter, but attended “several lunches with very interesting discussions” with scientists, authors and others at Epstein’s home. Loading In their typed letter, Barak and his wife, Nili Priel, hailed Epstein as “A COLLECTOR OF PEOPLE”. The letter concluded, “May you enjoy long and healthy life and may all of us, your friends, enjoy your table for many more years to come”. This article originally appeared in The New York Times.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/thousands-of-queensland-teachers-walk-off-the-job-20250806-p5mksv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Thousands of Queensland teachers walk off the job",
    "publish_date": "Wed, 06 Aug 2025 11:55:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of Queensland teachers walk off the job\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/edmed-set-for-wallabies-redemption-after-painful-three-minute-debut-20250805-p5mkje.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Edmed set for Wallabies redemption after painful three-minute debut",
    "publish_date": "Wed, 06 Aug 2025 11:55:10 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "Tane Edmed is poised for a return to Test rugby, with the former Waratahs playmaker set to be picked in the Wallabies squad for the Rugby Championship opener against South Africa, due to be named on Thursday.\n\nEdmed made his debut for the Wallabies last November against Ireland, lasting just three minutes in Dublin after coming on as a 74th-minute substitute before being knocked out while making a tackle.\n\nEdmed will come into the squad after Reds five-eighth Tom Lynagh was ruled out after suffering his third concussion of the season after being illegally cleared out of a ruck by British and Irish Lions hooker Dan Sheehan in the third Test.\n\nSheehan subsequently received a four-match ban for the “reckless” hit on Lynagh, which officials did not pick up during the game.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/companies/rupert-murdoch-shows-trump-his-own-of-the-art-of-the-deal-20250806-p5mkoi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rupert Murdoch shows Trump his own of the ‘Art of the Deal’",
    "publish_date": "Wed, 06 Aug 2025 11:52:59 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Rupert Murdoch’s News Corp is used to being the centre of controversy, but its annual results on Wednesday morning were more newsworthy than normal, with the $US10 billion lawsuit from US President Donald Trump against the Wall Street Journal just weeks old.\n\nChairman emeritus Rupert and chairman Lachlan Murdoch did not participate in the conference call that followed the better-than-expected results, but the wily media mogul’s fingerprints were all over it.\n\nThe News Corp results offer a fresh twist on the latest battle between Donald Trump and Rupert Murdoch. Credit: Fairfax Media\n\nChief executive Robert Thomson did not mention Trump once. However, he treated investors and analysts to a 40-minute show that was by turns fawning, deflective, distracting, but above all shamelessly self-serving in a way that even Trump would have loved.\n\nNews Corp’s book division publishes Trump’s Art of the Deal, and Thomson reminded the president that it is looking out for his interests when it comes to stopping AI from consuming and cannibalising the ideas in his book.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/aussies-caught-bali-boat-horror-220119247.html",
    "title": "5 Aussies caught in deadly Bali boat incident",
    "publish_date": "2025-08-06T02:02:53Z",
    "category": "finance",
    "authors": [
      "Alexandra Feiam"
    ],
    "text": "There were 80 people on-board a high-speed ferry when it capsized off the east coast of Bali on Tuesday\n\nThe Australian government has given an update on five Australians who were thrown into the water when a boat carrying 80 people capsized off Bali.\n\nTwo people have died and another is still missing in the aftermath of the tragedy.\n\nThe fast boat was carrying 75 passengers – including at least five Australians – and five crew members when it got caught in a large surf off Sanur in southeast Bali at about 5pm AEST Tuesday.\n\nTwo have died and scores of others are injured after a boat capsized in Bali.\n\nThere were 80 people on board when the boat flipped. Picture: 9News\n\nThe boat, named Fast Boat Dolphin II, had crossed from Nusa Penida and was about 100m from its destination port in Sanur when the boat flipped.\n\nThe passengers were thrown into the water, with locals scrambling to pull them out of the ocean.\n\nADVERTISEMENT\n\nA Department of Foreign Affairs and Trade (DFAT) spokesman told NewsWire they were aware of the incident and working with local authorities in Bali.\n\n“The Department of Foreign Affairs and Trade has confirmed the welfare of a small number of Australians who were on board the vessel,” they said.\n\n“We are working with local authorities to confirm no other Australians were affected and stand ready to provide consular assistance should it be required.”\n\nPassengers were seen being escorted off the rescue boats. Picture: 9News\n\nHorrifying footage showed the distressed passengers loaded into inflatable rescue boats and scrambling to leave the water, with one woman carried to the shore seemingly unconscious.\n\nHead of the Denpasar Search and Rescue team I Nyoman Sidakarya confirmed two Chinese nationals had died in the incident, and one crew member was still missing.\n\nThe boat threw the passengers into the water. Photo by Dicky Bisinglasi / AFP\n\nThe rescue team said 14 people had been transported to hospital.\n\nADVERTISEMENT\n\n“We received the initial report to the Bali Province Disaster Management Operations Center (Pusdalops PB) at 4.25pm,” he said.\n\n“We are continuing to gather information regarding the number of passengers and their current condition.”\n\nDozens of people have been injured in the incident.\n\nMaritime accidents are common in Indonesia due to poorly regulated safety rules, overcrowding and rough sea conditions.\n\nSmartraveller warns Australians travelling to Indonesia to be cautious of rough seas and strong rips at tourist beaches.\n\nIn March, a 39-year-old Australian woman was killed and two others were injured after a snorkelling boat capsized off the coats of Bali.",
    "source": "Yahoo",
    "cluster_id": 37
  }
]