[
    {
        "url": "https://www.9news.com.au/world/pope-leo-xiv-says-he-will-emulate-the-late-pope-francis-and-reveals-challenges-of-artificial-intelligence/ee80d0cd-c5ae-49e7-b64d-1f59956b95d6",
        "title": "Pope Leo will closely follow Francis, says AI represents challenge for humanity",
        "publish_date": "Sat, 10 May 2025 21:28:20 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Pope Leo XIV indicated that his papacy will follow closely in the footsteps of the late Pope Francis, telling church cardinals that they should take up that \"precious legacy\" and identifying artificial intelligence as a main challenge for working people and \"human dignity\".\n\nPope Leo, born in Chicago as Robert Prevost, was elected on Thursday, becoming the first US-born pope to the surprise and delight of many Catholics across the Americas.\n\nIn his first formal meeting with cardinals, which began with a standing ovation, the new pontiff said he chose his papal name to continue down the path of Pope Leo XIII, who addressed \"the social question in the context of the first great industrial revolution\".\n\nPope Leo XIV met with cardinals in the Vatican's synod hall – a deviation from the typical location for the first meeting with cardinals, which is usually held in the apostolic palace. (Vatican Media via CNN)\n\nPope Leo XIII ruled the Roman Catholic Church from 1878 until his death in 1903 and is remembered as a pope of Catholic social teaching.\n\nHe wrote a famous open letter to all Catholics in 1891, called \"Rerum Novarum\" (\"Of Revolutionary Change\"), which reflected on the destruction wrought by the Industrial Revolution on the lives of workers.\n\n\"In our own day, the church offers to everyone the treasury of her social teaching in response to another industrial revolution and to developments in the field of artificial intelligence that pose new challenges for the defense of human dignity, justice and labor,\" the new American pontiff said on Saturday, speaking in fluent Italian.\n\nWearing the white robes of the papacy, he strongly signaled to the cardinals that his leadership will build upon Pope Francis' church reforms and legacy of social justice.\n\nWhite smoke billows from Sistine Chapel chimney as new pope elected View Gallery\n\n\"It has been clearly seen in the example of so many of my predecessors, and most recently by Pope Francis himself, with his example of complete dedication to service and to sober simplicity of life, his abandonment to God throughout his ministry and his serene trust at the moment of his return to the Father's house,\" Pope Leo told the gathering.\n\n\"Let us take up this precious legacy and continue on the journey, inspired by the same hope that is born of faith.\"\n\nHe went on to ask the other senior church leaders to renew their commitment to the pivotal Second Vatican Council, which enacted sweeping church reforms in the 1960s.\n\nThe modernising reforms included allowing Mass to be celebrated in local languages rather than Latin for the first time.\n\nWearing the white robes of the papacy, he strongly signaled to the cardinals that his leadership will build upon Pope Francis' church. (Vatican Media via CNN)\n\nSetting out that vision on Saturday, Leo said the church should be guided by a missionary focus, \"growth in collegiality and synodality\", courageous dialogue with the contemporary world and \"loving care for the least and the rejected\".\n\nHe also suggested that he will approach the weighty office with humility and fraternity.\n\n\"You, dear cardinals, are the closest collaborators of the pope. This has proved a great comfort to me in accepting a yoke clearly far beyond my own limited powers, as it would be for any of us,\" Leo added.\n\n\"Your presence reminds me that the Lord, who has entrusted me with this mission, will not leave me alone in bearing its responsibility,\" he said, also specifically thanking Dean of the College of Cardinals Giovanni Battista Re and the Camerlengo Cardinal Kevin Joseph Farrell, who was responsible for shepherding the church through the papal transition.\n\n\"He is an excellent pope and he had much more than 100 votes,\" Cardinal Désiré Tsarahazana of Madagascar told Italian news outlet RAI on Saturday.\n\n\"This morning's meeting went very well, we also spoke about the need to make the church more collegial.\"\n\nNewly elected Pope Leo XIV concelebrates Mass with the College of Cardinals inside the Sistine Chapel. (Vatican Media via AP)\n\nAfter the meeting with cardinals, Leo left the Vatican to visit an Augustinian sanctuary just outside Rome, the Madonna del Buon Consiglio (Mother of Good Counsel), in Genazzano, according to the Vatican press office.\n\nThe pope, who is also the first pontiff from the Augustinian religious order, was greeted by the local bishop and several hundred people in the town square.\n\nThe visit to the Augustinian church holds huge significance for the new pontiff, who was formerly global leader of the religious order.\n\nThe sanctuary is also linked to his namesake, Leo XIII, who had a strong devotion to Mary as \"Our Lady of Good Counsel\".\n\n\"I wanted so much to come here in these first days of the new Ministry that the Church has given me, to carry forward this mission as the Successor of Peter,\" the pope told those gathered outside the church after he prayed in front of the altar and the image of Mary.\n\nPope Leo will appear on the balcony of St. Peter's Basilica for a second time on Sunday to greet crowds of people in the square below.\n\nThe city of Rome is expecting 150,000 people to gather.\n\n﻿Leo's installation Mass will take place the following week on Sunday, May 18.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-says-great-progress-made-between-us-and-china-following-first-day-of-trade-talks/cd3bf954-5dbe-4aa8-a0eb-689365dea267",
        "title": "Trump says 'great progress made' between US and China",
        "publish_date": "Sun, 11 May 2025 01:51:41 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "President Donald Trump said on Saturday there was \"great progress made\" on trade talks between the United States and China, amid a possible thaw in the trade war sparked by his massive tariffs.\n\n\"A very good meeting today with China, in Switzerland. Many things discussed, much agreed to. A total reset negotiated in a friendly, but constructive, manner. We want to see, for the good of both China and the U.S., an opening up of China to American business. GREAT PROGRESS MADE!!!\" Trump posted on Truth Social.\n\nIt was the first comment from Trump after a day of talks in Geneva between US officials, including Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer, and Chinese officials.\n\nUS President Donald Trump speaks at an event for Military Mothers, Thursday, May 8, 2025, in the East Room of the White House in Washington (AP Photo/Jacquelyn Martin)\n\nA source briefed on the meetings told CNN talks will continue Sunday.\n\nBessent urged the public earlier this week not to expect a major trade deal out of the meetings, but he acknowledged it was an important step in negotiations.\n\nVice Premier He Lifeng is leading the talks on the Chinese side, state broadcaster CCTV said in a brief report.\n\nChinese state-run news agency Xinhua called the Switzerland talks \"an important step toward resolving the issue.\"\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\n\"However, an ultimate solution requires sufficient strategic patience and determination, as well as the just support of the international community,\" Xinhua said.\n\nThe US has placed a minimum 145 per cent tariff on most Chinese imports, and China has responded with a 125 per cent tariff on most US imports.\n\nAs a result, trade between the two sides is falling sharply, according to logistics experts.\n\nEven reducing that tariff rate by half might not be enough to change trade levels significantly. Economists have said 50 per cent is the make-or-break threshold for the return of somewhat normal business between the two countries.\n\nOn Friday, hours after Bessent and Greer had set off for Switzerland, Trump floated the possibility of slashing tariffs on Chinese goods to 80 per cent while demanding China \"open up its market to USA.\"\n\n\"80 per cent Tariff on China seems right! Up to Scott B,\" Trump said in a Truth Social post.\n\nThe combination of fewer goods arriving in the US and increased costs on imports that do arrive has already started pushing up prices for Americans. Goldman Sachs analysts said Thursday that a key measure of inflation would effectively double to 4 per cent by the end of the year because of Trump's trade war.\n\nSecretary of Treasury Scott Bessent leaves his hotel for a meeting on tariffs with Chinese officials in Geneva, Switzerland, on Saturday. (CNN)\n\nAnd with ships carrying goods under the 145 per cent tariffs now coming into port, a trade deal wouldn't lower prices immediately.\n\nTo say Americans depend on a wide range of Chinese goods understates how pervasive they have become in daily life. Footwear, clothes, appliances, microchips, baby goods, toys, sports equipment, office machine parts and much more all pour into the US from China in staggering numbers.\n\nBut now those imports are decreasing. Imports into the United States during the second half of 2025 are expected to fall at least 20 per cent year over year, according to the National Retail Federation. The decline from China will be even starker. Investment bank JPMorgan expects a 75 per cent to 80 per cent drop in imports from there.\n\nEconomic impact\n\nThe trade war has already affected the US economy. The nation's gross domestic product, the broadest measure of the US economy, showed America's first quarterly contraction since early 2022, as importers raced to bring in goods before punishing tariff rates kicked in.\n\nThe impact of the sky-high tariffs is also being felt keenly in China, whose exports to the US fell sharply in April. Chinese outbound shipments to the US stood at US$33 billion ($51.3 billion) last month — a whopping 21 per cent decline from the $63 billion recorded in April 2024, according to a CNN calculation.\n\nSteep US tariffs have also taken a heavy toll on China's manufacturing sector. Chinese factory activity contracted at its fastest pace in 16 months in April, adding urgency to Beijing's efforts to roll out fresh economic stimulus.\n\nChinese Vice Premier He Lifeng, left, Switzerland's Economy Minister Federal Councillor Guy Parmelin, center, Switzerland's President Karin Keller-Sutter, right, speak, during a bilateral meeting between Switzerland and China, in Geneva, Switzerland, on Friday, May 9, 2025 (Martial Trezzini/Keystone via AP)\n\nThe news that Bessent and Greer would meet their Chinese counterparts in Geneva raised hopes of a detente between the two nations.\n\nThe US and China are the world's largest and second-largest economies, respectively, bigger than even the next 20 economies put together, according to World Bank data.\n\nTrump also told a conservative radio host on Wednesday that he would raise the case of jailed Hong Kong media tycoon Jimmy Lai \"as part of the negotiation.\" Lai, a pugnacious former publisher whose now-shuttered tabloid Apple Daily was a regular thorn in Beijing's side, is in the midst of a national security trial that could send him to prison for life.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/matthew-haylett-recovery-teenager-broke-his-neck-dive-beach-gone-wrong/10c208a0-8445-4c9e-9c5d-d1c4f06f8d9c",
        "title": "Paralysed teen gets inspirational visit after beach dive gone wrong",
        "publish_date": "Sat, 10 May 2025 13:23:41 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A Mindarie teen paralysed in a tragic accident has found new hope through someone who's walked the same path.\n\nSix weeks after the accident at a Perth beach , Matthew Haylett is making a slow but steady recovery, confined to a hospital bed and unable to walk.\n\nToday, Thomas Davison gave him a glimpse of what could be.\n\nREAD MORE: Australian dies after jumping off boat while holidaying in Thailand\n\nParalysed teen Matthew Haylett met Thomas Davison, who has gone through the same situation after accidentally diving into a sandbank at a WA beach. (9News)\n\nHaylett was left in a critical condition after diving into the water at Mullaloo beach, unaware there was a sandbank. (9News)\n\nHaylett was left in a critical condition after diving into the water at Mullaloo beach, unaware there was a sandbank.\n\nNow out of intensive care, the 17-year-old is at Fiona Stanley's State Rehabilitation Centre and learning to move again.\n\n\"He's pushing through no matter what,\" Haylett's mum Megan Larson told 9News.\n\n\"He's still convinced he's gonna walk out of here in six months.\"\n\nToday he met Davison, who's suffered the same fate and given him what he needs most - hope.\n\n\"That's the most I've seen Matthew really laugh and interact,\" Larson said.\n\nDavison broke his spine plunging into a sandbank at Mandurah's Town Beach in 2023.\n\nDavison broke his spine plunging into a sandbank at Mandurah's Town Beach in 2023. (9News)\n\nTwo years on from his own accident, the 17-year-old has defied the odds and is now learning to drive. (9News)\n\nThe incident paralysed him from the neck down.\n\n\"Talking to people in a similar situation to me when I had my accident really helped boost my confidence and give me that hope that I needed,\" Davison told 9News.\n\nTwo years on from his own accident, the 17-year-old has defied the odds and is now learning to drive.\n\n\"I had one goal for myself and that was just to get out of that wheelchair. I've succeeded [with] that now,\" Davison said.\n\nIt's a goal Haylett also wants to reach.\n\nHaylett will stay at Fiona Stanley Hospital for at least the next six months.\n\nHaylett is making a slow but steady recovery, confined to a hospital bed and unable to walk, but Davison's given him much-needed hope. (9News)\n\nAfter that, his family are unsure where they'll live, as their current rental in Mindarie isn't wheelchair friendly.\n\n\"We have to find a new home because my son needs to come home, where he can live a semi-independent or functional life,\" Larson said.\n\nA fundraiser has been set up to help Haylett get back on his feet.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/montacute-road-crash-adelaide-family-demand-answers-after-woman-hit-by-van-while-walking-dog/92f93989-a5d9-4cd7-ad6a-23455b40bc44",
        "title": "Adelaide family demand answers after woman hit by van",
        "publish_date": "Sat, 10 May 2025 10:46:21 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel.\n\nThe victim's distraught husband has been at his wife's bedside at the Royal Adelaide hospital for most of today.\n\nHe told 9News they were walking the family dog yesterday morning, when they were hit by a van.\n\nThe family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel. (Nine)\n\nThe couple had a green light to cross Montacute Road.\n\nFootage from a nearby traffic camera appears to show the 91-year-old driver turning into their path.\n\nThe woman's husband told 9News he put his arms up to try and get the driver's attention.\n\nThe driver didn't see him, knocking him over and then hitting his wife.\n\nShe was rushed to hospital with life-threatening injuries.\n\nShe was in emergency surgery for several hours yesterday and has now been transferred to the intensive care unit.\n\nThe 48-year-old has several head injuries and a number of broken bones.\n\nREAD MORE: Australian dies after jumping off boat in Thailand ﻿\n\nThe family of a woman who was hit by a van while walking her dog in Adelaide are demanding answers, questioning if the elderly driver should have been behind the wheel. (Nine)\n\nMeanwhile, the elderly driver, a 91-year-old man from Rostrevor, has been reported for dangerous driving and had his licence taken away.\n\nThe husband and his teenage son say he shouldn't have been behind the wheel, and the tragic accident could have been avoided.\n\nThe woman tonight remains in a critical but stable condition.\n\nThe 91-year-old will be summoned to appear in court at a later date.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/womens-health-women-seeking-care-vulvovaginal-disorders-giving-up-over-poor-treatment/7ee5ff16-52f5-47a8-a11d-e6a5766ab6dc",
        "title": "Lily spent 30 years trying to get doctors to take her pain seriously",
        "publish_date": "Sat, 10 May 2025 01:23:18 +0000",
        "category": "lifestyle",
        "authors": [
            "May"
        ],
        "text": "For 30 years, doctors have been telling Lily* that the excruciating pain she experiences during sex is all in her head.\n\nIt's actually vaginismus, a common ﻿vulvovaginal disorders which causes involuntary vaginal muscle spasms. But after decades of poor experiences with healthcare providers she's given up on finding treatment.\n\nLily isn't alone; ﻿new research from the US revealed than one in two women ﻿seeking care for vulvovaginal disorders (including vaginismus) consider giving up due to poor experiences with healthcare professionals.\n\nFor 30 years, doctors have been telling Lily* that her pain is in her head. (Getty)\n\nThe ﻿study found that one in four patients felt belittled by medical professionals, one in five said they were not believed, and nearly two in five were made to \"feel crazy\".\n\nAbout 40 per cent said they had been told to \"relax more\" by a healthcare professional and 20 per cent claimed they were told to drink alcohol to manage their condition.\n\nThey're lines Lily's heard before right here in Australia.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\n\"Usually they will say that there's nothing wrong with you, this is basically in your head [...] you just need to try to relax during sex,\" she told 9news.\n\n\"I would go away with no major support, no referral to other professionals.\"﻿﻿\n\nDespite the constant setbacks, she kept seeking treatment until a recent gynecologist appointment with a ﻿killed the last shred of hope she'd been hanging onto.\n\nAfter describing her pain to the female ﻿gynecologist, Lily was asked if her husband's genitals were simply \"too big\" for her.\n\n\"I've had this problem for 30 years [...] to just put it down to the size of my husband's anatomy is so unprofessional,\" she said.\n\n\"That gave me the feeling like I might as well just give up if I see an experienced female gynecologist and that's her answer to the problem.\"\n\nThe US study found that more than ﻿52 per cent of participants gave up on seeking treatment as a result of poor experiences with medical professionals and Australian experts wouldn't be surprised if the statistics were similar here.\n\nGynaecologist lead at Jean Hailes for Women's Health Dr Pav Nanayakka (centre). (Instagram/@drpav.migs)\n\nGynaecologist lead at Jean Hailes for Women's Health Dr Pav Nanayakka has heard many reports of women feeling dismissed, shamed and invalidated when seeking care for vulvovaginal disorders.\n\nShe told 9news that it often leads to a loss of trust in the healthcare profession and patients avoiding care altogether.\n\n\"There are definitely educational gaps in medical training,\" she said.\n\n\"Many providers have very little formal education about evolving vaginal disorders, especially the chronic or less common ones.\"\n\nA 2021 study of ﻿21 people who sought help for vaginismus in Australia uncovered that negative experiences when seeking help weakened their sense of self and increased their likelihood of giving up on getting help.\n\nConversely, ﻿positive experiences made women more likely to continue seeking help and treatment even when faced with setbacks.\n\nMore broadly, two in three women reported they experienced health care related gender bias or discrimination, according to the 2024 #EndGenderBias Report.\n\nExperiences of gender bias or discrimination were most common in relation to sexual or reproductive health care.\n\nAustralian Bureau of Statistics (ABS) data from 2024 also showed that women in Australia are significantly less likely to report positive experiences with ﻿hospital ED doctors, specialists, and nurses than men.\n\nREAD MORE: Biden launches bizarre attack on Trump\n\nWhere Australia ranks in countries with the greatest health freedoms View Gallery\n\nNanayakka encouraged patients who have had poor experiences to seek medical professionals with a special interest in women's health rather than giving up on treatment entirely.\n\n\"There can be some really, really important conditions that can be misdiagnosed and they can be potentially dangerous if they are missed,\" she said.\n\nBut affording specialist appointments, especially when you've already paid to seek care before, can be difficult in a cost of living crisis.\n\nLily has forked out thousands on medical appointments over the years and can't afford to keep up with the costs of seeking specialist care for her vaginismus.\n\n\"I would say at the moment, I feel like I've given up hope,\" she said.\n\n\"I just wonder if it was a man who had extreme physical pain every time they had sex, would they be so easily dismissed?\"\n\n*Name changed for privacy.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/kittens-miraculous-escape-from-sydneys-m8-tunnel/ebc0a843-ee2e-4e19-a807-c37d83bbb0c9",
        "title": "Leo the kitten's miraculous escape from busy Sydney tunnel",
        "publish_date": "Fri, 09 May 2025 12:04:51 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "He's looking pretty relaxed now, nestled in the arms of his new human.\n\nBut last month, the only warmth Leo the stray kitten could find would be in the engine bay of a recently parked car.\n\nThat car started moving through Sydney's West Connex tunnel at 80km/h, throwing Leo to the roadway.\n\nREAD MORE: Big four bank jumps the gun on rate cut 11 days before RBA call\n\nKitten's miraculous escape from Sydney's M8 tunnel (Nine)\n\nThe snoozing kitten was left to dodge the quickly approaching tyres of oncoming traffic.\n\n\"Seeing that poor little cat running across the motorway, might have been the most heart-stopping moment that I've seen,\" West Connex Operations manager Jill Collins said.\n\nLeo would chew through a clutch of his nine lives in just a few seconds, missing moving engine parts as he fell from the bay to the cold concrete below.\n\nYou can watch the full story above.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gold-coast-secluded-estate-popular-with-russell-crowe-for-sale-property-news/1623e471-fa6b-49da-86a5-7058c7d4a850",
        "title": "Secluded Gold Coast estate popular with celebrities hits the market",
        "publish_date": "Fri, 09 May 2025 10:16:29 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A secluded estate in the hills of Upper Coomera on the Gold Coast is generating buzz due to its history of attracting high-profile residents.\n\nThe property, located on Jenkins Court, has reportedly hosted celebrities, including Russell Crowe, purportedly during the filming of Land of Bad .\n\nAccording to agent Alex Fleri, the mansion offers unique appeal.\n\nA secluded estate in the hills of Upper Coomera on the Gold Coast is generating buzz. (Nine)\n\n\"Where else could you get a Hollywood mansion on the Gold Coast?\"\n\nThe eight-hectare estate boasts a full-size tennis court, a fully equipped gym, and an infinity pool.\n\nThese features, combined with the property's secluded location, contribute to its allure for those seeking privacy.\n\n\"There are properties with views on the Gold Coast, but not 360 panoramic views perfect for privacy, seclusion and security.\"\n\nThe outdoor area is another key selling point, according to Fleri.\n\nThe property's proximity to Village Roadshow Studios further enhances its appeal to those in the entertainment industry.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/romance-fiction-enjoys-comeback-as-women-seek-escapism/105240694",
        "title": "Romance fiction enjoys comeback as women seek escapism",
        "publish_date": "Sun, 11 May 2025 01:57:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Romance novels are enjoying a renaissance in Australia but their female characters are no longer just dreaming of marrying a knight in shining armour.\n\nThe contemporary female protagonists in modern-day romance fiction deal with real-life struggles and dramas, are proactive rather than passive and have agency in their lives.\n\nAnd readers are here for that, with an average annual growth rate of 49 per cent over three years for Australian sales of romance fiction, a genre once trivialised as a low-brow guilty pleasure.\n\nAccording to Nielsen BookScan Australia, 3 million romance books, valued at $46.4 million, sold in 2024.\n\nWith romance sub-genres such as rural, historical, paranormal, erotic, billionaire, LGBTQIA and romantasy, the female protagonists in these stories are diversified and represent women's experience across different cultural, faith and class backgrounds.\n\nWomen of all ages are buying books at boutique \"pop-literary\" events in Australia. (ABC Gippsland: Rachael Lucas)\n\nImmersive escapism, intimate connection\n\nCollins Booksellers owner Natasha Hunt in Sale, Victoria has observed an uprising of female writers in the fiction and memoir space, and women who want, as readers, to be inspired and feel joy, particularly with romance, general fiction and romantasy.\n\nNatasha Hunt says female readers are seeking escapism and connection in women's stories. (ABC Gippsland: Rachael Lucas)\n\n\"There's some fantastic literature out there,\" she said.\n\n\"I'm not sure the television is giving us what we're looking for, and I think people are looking to escape from what's happening in the world, so they're turning back to books and in the traditional form,\" she said.\n\nMagazines make a comeback Photo shows A collage of three different magazine, Live to Ride, Vanity Fair and National Geographic. Among the long rows of glossy publications that cater to the reading needs of home renovators, gold hunters, hobby farmers, celebrity watchers, and puzzle lovers, this newsagent is witnessing a resurgence in demand for print magazines.\n\nMs Hunt describes that immersive experience and the pleasure of touching the pages and feeling the weight of a book as an alternative to doing \"bite-sized bits on the phone\" and endless scrolling.\n\n\"They hold a book, they sit in their favourite place, their favourite couch, looking out the window and immersing in that story, sipping a wine or a coffee or whatever brings them joy.\"\n\nIt is also a portal for learning about life and relationships.\n\nLisa Ireland hosted a Women in Fiction literary event as part of the Stratford Shakespeare Festival in Victoria. (ABC Gippsland: Rachael Lucas)\n\nIn a world of digital transactions in which people lack connection, Ms Hunt believes women are seeking depth, nuance and the lost art of getting to know someone slowly, even if that is through a story.\n\nThe slow awakenings, prolonged courtships and gradual unravelling of a book offer a counter point to the relatively superficial online realm.\n\n\"Romance is a very intellectual genre, people underestimate what is written in romance books — it's not all soft and fluffy and happily ever after, they tackle some very serious issues,\" Ms Hunt said.\n\n\"The world is hard at the moment. Books are not cheap, but people will buy a book and then share it with their family and their friends — it's the gift that keeps giving.\"\n\nLawyer who just wanted to write\n\nWild Horses is about a drama teacher who moves to Queensland's Darling Downs after a scandal. (ABC Gippsland: Rachael Lucas)\n\nUpper Pakenham-based rural fiction author Jennifer Scoullar has published 13 books, but only after a career change.\n\nHer ambitions to become a writer were thwarted by her mother's insistence that she pursue a career in law.\n\nAfter years of working as a lawyer with the National Crime Authority and Legal Aid, she became burnt out and desensitised to the daily stories of human struggle, a burden that took a toll on her wellbeing.\n\n\"So many of us just do what people expect us to do, and we ourselves internalise these expectations, and very often that isn't actually what we want to do. It doesn't bring us joy,\" Ms Scoullar said.\n\nFeeling that she was losing her empathy towards people, she delved into the escapism of writing, creating worlds where she could control the behaviour of her characters and the situations they faced, even granting them a more optimistic future.\n\nJennifer Scoullar gave up a legal career to become an author. (ABC Gippsland: Rachael Lucas)\n\nEventually she made the break and quit law to write.\n\nIt was a move that would bring an end to her marriage, and confront her with the challenges of raising her four children alone.\n\nShe completed a year-long novel writing course with Writers Victoria but with no industry connections or big profile to launch a book in a market saturated by celebrity cookbooks and biographies, Ms Scoullar's chances of being published were slim.\n\nFemale authors are using TikTok, Instagram and QR code technology to connect with new readers. (ABC Gippsland: Rachael Lucas)\n\nBut then a friend suggested attending a writers' conference, where she was able to pitch to publisher Belinda Byrne, sister of First Tuesday Book Club presenter Jennifer Byrne, who was on the hunt for a rural fiction writer.\n\nThe chance meeting resulted in a book deal with Penguin Australia.\n\n\"Publishers began to realise that there was an appetite for stories about strong country women living their dreams on the land, and the hardships they faced, the struggles they faced, and the romantic heartbreaks and triumphs, so the genre started to grow,\" Ms Scoullar said.\n\nMs Scoullar describes her books as rural fiction with romantic elements. (ABC Gippsland: Rachael Lucas)\n\nStories for women by women\n\nStratford-based author and women's literary event organiser Lisa Ireland is in the process of writing her ninth book published by Penguin Random House.\n\nOriginally from the western suburbs of Melbourne and a teacher for 20 years, Ms Ireland said her books had mirrored the various stages of her life, from finding love, to motherhood through to middle age.\n\nLisa Ireland has published nine books about issues faced by women. (ABC Gippsland: Rachael Lucas)\n\nShe believes the women's fiction movement is primarily driven by younger female readers, who are discovering books and authors through TikTok and Instagram and want to see their own lives represented.\n\n\"Our stories are just as important as men's stories,\" Ms Ireland said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/ruby-gamble-the-outback-queensland-postie-from-cunnamulla/105238020",
        "title": "A larrikin and a lifeline, meet Ruby Gamble the outback postie",
        "publish_date": "Sun, 11 May 2025 01:31:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "A few things are certain in the outback around Cunnamulla.\n\nDingoes do not want pats, the next drought is never far away, and Ruby Gamble will make her deliveries.\n\nNow in her early 70s, Ruby the outback postie has spent nearly three decades delivering mail, medicine, beer and just about anything else her remote customers need.\n\nCunnamulla, 750 kilometres west of Brisbane, is home to about 1,200 people spread out over a region bigger than the size of Tasmania.\n\nRuby's vehicle of choice — a two-wheel-drive Toyota Hilux — covers up to 10,000km a month across vast, sunbaked, bulldust-covered roads.\n\nThe country around Cunnamulla is wide, brown and treacherous. (ABC Southern Queensland: Dan McCray)\n\n\"A lot of times I turn up and they'll say, 'Oh sh*t, is it mail day? Is it Thursday or Friday? Oh, it's Tuesday,'\" she said.\n\n\"They forget when they're in the bush.\"\n\nThe Australia Post contractor's customers live and work on isolated sheep and cattle stations the size of European countries.\n\nSome do not see another soul all week.\n\nThat makes Ruby more than just a delivery driver — she is a lifeline.\n\nThe postie even maintained connections with her customers when devastating floods across Western Queensland earlier this year made it too dangerous to go bush, forcing her into one of the longest breaks of her 28-year career.\n\nRecent flooding stopped Ruby Gamble from making her postal run for nearly a month. (ABC Southern Queensland: Dan McCray)\n\n\"I kept ringing them to make sure they're all okay, and if they need food or anything,\" she said.\n\nNow that the waters have receded, Ruby is back on the road.\n\nA 3yo ute with almost 500,000km\n\nRuby's three-year-old ute is already pushing half a million kilometres.\n\nIt has been modified with an extra-long tray to carry hay bales — and the occasional case of beer.\n\n\"Just about ready to trade it in,\" Ruby said.\n\nThe postie's trusty three-year-old Hilux has done more kilometres than most cars do in a lifetime. (ABC Southern Queensland: Dan McCray)\n\nShe and her late husband Col took up the delivery contract in 1997 and shared the run for more than a decade, until her partner of 43 years passed away.\n\n\"The bastard handed in his rifle on the Paroo River,\" she said.\n\n\"We caught a heap of fish, he drank a six-pack … then he comes into the caravan, towel around him, throws it open and says, 'Anyhow Ruby, I'm the only one who knows how to find all the good fish holes.'\n\n\"I told him, 'Shut up, you skiting bastard' — they were the last words I ever spoke to him.\"\n\nWithin 10 minutes, Col had died from a massive heart attack.\n\n'Ruby, we need you out here'\n\nRuby took a break from work to grieve after Col's death while friends filled in on the mail run.\n\nBut before long, her customers came calling.\n\n\"After a couple of months [they said], 'Ruby, we need you out here,'\" she said.\n\n\"They made me get out of bed and keep going.\"\n\nWhen Ruby Gamble's customers said they needed her, she went straight back to work. (ABC Southern Queensland: Dan McCray)\n\nJoanne Woodcroft, the licensee and self-titled postmistress of the Cunnamulla Post Office, said Ruby was part of the town's identity.\n\n\"Ruby and her husband Col, stalwarts of the post office … the fabric of our community,\" she said.\n\n\" People like Ruby are the heart of this place. \"\n\nJoanne Woodcroft (right) says Ruby Gamble is an essential pillar of the community. (ABC Southern Queensland: Dan McCray)\n\nFourteen years since Col's death, Ruby has not remarried, despite encouragement from her kids.\n\n\"One of 'em says, 'Mum, you know, we were never meant to be on our own and if you find somebody else that's OK with us,'\" she said.\n\n\"I said, 'You bastards have only been here four days and I can't put up with you … how am I gonna put up with someone else?'\"\n\nBogged in the bush, rescued by a jet\n\nSeven hours a day in the car gives Ruby a chance to reflect on the adventures she's had on her mail run.\n\n\"A few years ago, I got bogged — no phones out there, I can't get anybody on the UHF,\" she said.\n\nYou never know who you might bump into in Queensland's outback. (ABC Southern Queensland)\n\nThinking quickly, she hit SOS on her GPS and, 30 minutes later, spotted a jet circling above.\n\n\"I'm looking for a tree to hide under, thinking, 'What have I done?'\" Ruby said.\n\n\" It was on its way from Cairns to Melbourne and they diverted it to come find me. How good was that? \"\n\nRescued and brought to safety, Ruby inadvertently went about the rest of her day without telling the authorities she was OK.\n\n\"The police caught up with me later that day at the pub,\" she said.\n\n\"They had called my son to ask if I was on any medication, he told 'em, 'Yep — VB and Panadol.'\"\n\nAfter nearly three decades, Ruby is showing no signs of slowing down.\n\nBut of an afternoon, odds on you'll find her enjoying a VB at the old Billabong Hotel in town, ready to share a tale from the road.\n\n\"It's been a good life, I wouldn't swap it for anything.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/royal-edinburgh-military-tattoo-exclusive-brisbane-celebration/105278048",
        "title": "Brisbane secures international show for 75th anniversary celebration",
        "publish_date": "Sun, 11 May 2025 01:13:09 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The Royal Edinburgh Military Tattoo is coming exclusively to Brisbane in 2026, as part of the event's 75th anniversary celebrations.\n\nThe Tattoo began as a celebration of Scottish and British military and cultural tradition, and is famous for its massed bagpipes, marching bands and dancers performing against the backdrop of Edinburgh Castle.\n\nOver seven and a half decades, the event has grown to become a stadium spectacular which travels the world featuring shows of more than 1,000 performers — representing over 50 countries.\n\nThe event celebrates Scottish and British military and cultural tradition. (Supplied)\n\nBrisbane's Lang Park will host two shows on February 12 and 14, entitled 'The Heroes Who Made Us', which organisers hope will attract more than 100 million viewers worldwide.\n\n'Landmark moment' for Brisbane\n\nIt's the first time the Tattoo has come to Australia since 2019, and event chief executive Jason Barrett said it was significant that Brisbane had been chosen to host the milestone occasion.\n\nThe musicians and dancers involved in the show represent more than 50 countries. (Supplied)\n\n\"Bringing the Tattoo to Brisbane, as part of our 75th anniversary, is a landmark moment in our history,\" Mr Barrett said.\n\n\" This is a celebration of the human spirit, of shared identity, and of the heroes who shape our communities. \"\n\nQueensland Premier David Crisafulli said \"my vision is to see Queensland become the events capital\", with the state's commitment to hosting the Olympic and Paralympic Games contributing to this new opportunity.\n\nDavid Crisafulli wants Queensland to become a hub for events. (ABC News: Glen Armstrong)\n\nMr Barrett said the 2032 Games did form part of the Tattoo's decision, explaining \"it was clear to us that Queensland, and Brisbane, is on the rise\".\n\n\"If we could do two shows or even beyond that, if ticket sales compel us … that would be our goal,\" he said.\n\nQueensland pursued hosting the Tattoo, citing the economic and reputational benefits it could bring to Brisbane. (Supplied)\n\nQueensland Tourism Minister Andrew Powell said the state had \"pursued\" hosting the event, in the hope it would generate economic and reputational benefits.\n\n\"This significant event has the potential to attract crowds of national and international visitors, generate up to $39 million in economic benefits for our state, and enhance Brisbane's reputation as a vibrant city on the world stage,\" Mr Powell said.\n\nThe massed bagpipes, marching bands and dancers are famous for their performances against the Edinburgh Castle backdrop. (Supplied)\n\nMusical talents in the spotlight\n\nThe Royal Edinburgh Military Tattoo is the biggest stage in the world for bagpipers.\n\nPerth local Alisdair McLaren started playing at 13 years of age, and has since risen through the ranks to become Pipe Major.\n\nThe tourism minister says the Tattoo shows could generate up to $39 million in economic benefits for Queensland. (Supplied)\n\nHe's led the band's performances at Tattoo's since 2017, and has tutored other pipers to perform at the event, including representatives from Brisbane Boys College in 2022.\n\n\"I used to travel to Brisbane each year to compete at the Australasian Piping Solo Competition, where the top three pipers from each Australian state and from New Zealand competed against each other for a place in the world final,\" Mr McLaren said.\n\nTickets for the shows will go on sale on May 21.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/becoming-mum-reflecting-on-mothers-day/105273324",
        "title": "'Everyone should have two mums': Narelda Jacobs's motherhood journey",
        "publish_date": "Sun, 11 May 2025 00:30:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "On a cold Alice Springs morning, Cherisse Buzzacott's kids are frolicking on the play equipment and running through the park. She's trying to encourage them to keep their jumpers on — but she knows it's futile.\n\n\"They are busy, rambunctious, but I wouldn't change it,\" she laughs.\n\nWARNING: Aboriginal and Torres Strait Islander readers are advised that this article contains the name of a child who has died.\n\nCherisse's youngest, Angus, is now five, and she is also known as mum to her partner's twins — Douglas and Dylan — who she's raised since they were about four.\n\n\"They beautifully acknowledge that they have two mums.\"\n\nCherisse thought she may never have children, now she is mother to three boys. (ABC: Grenville Turner)\n\nBut this picture is missing Senna — a child who came too early and died too soon after birth.\n\n\"I love to say her name, I love to speak about her memory,\" Cherisse said.\n\nSenna was named after the legendary Formula One race car driver, but it also happens to be the name of a beautiful yellow flower.\n\n\"I love to share the story of how she was born and how she's been in our lives. And the boys love talking about it and acknowledge that they have a sister.\"\n\nMother's Day took on new meaning when Cherisse Buzzacott lost her baby girl at 22 weeks. (ABC: Grenville Turner)\n\nThe Arrernte midwife recalls that in her 20s, before she became a mum, people would ask, \"When is it your turn?\"\n\nShe felt the weight of expectation as women around her would have multiple babies in the time she was trying for one.\n\nOver eight years she would have four miscarriages — one while receiving an award on stage for being a midwife.\n\nWhen baby Senna was born prematurely at 22 weeks, she died soon after.\n\n\"I was that person that was having grief and loss, but I was supporting some of the happiest times for people,\" she said.\n\n\"I always thought if I never have a baby, and this is my life, then this is what I do. I help other women have babies.\"\n\nNow, watching Angus swinging on the monkey bars, she reflects on the hardships she's overcome and the happiness that lay on the other side.\n\n\"Having my son has just been everything that I imagined, but also so much better,\" she said.\n\n\"I've had all these experiences, and I've waited this long, and I finally got him.\"\n\nNew mums Narelda Jacobs and Karina Natt are spending their days exploring the world of motherhood. (Supplied: Jade Dolman)\n\n'Everyone should have two mums'\n\nWhadjuk Noongar journalist Narelda Jacobs now spends her mornings in Sydney with her eight-week-old baby Sanna strapped to her chest, walking around the neighbourhood to give her partner a break at home.\n\nAs the mum of a 30-year-old, Narelda always thought she would have more kids, but the opportunity never presented itself — until now.\n\nNarelda is on day duty while her wife Karina, who has been up and down all night feeding, sleeps.\n\n\"While Karina is the one that gave birth and is breastfeeding, everything we do, we're doing together.\"\n\nNarelda first became a mum at 19 years old with her daughter Jade. The pregnancy wasn't planned, and she says she still had so much to learn about the world.\n\nNarelda was very excited for her first daughter Jade to meet her baby sister Sanna for the first time. (Supplied: Narelda Jacobs)\n\n\"I had fallen pregnant out of wedlock … It was a shotgun wedding when I married Jade's dad, there was also some shame associated with being pregnant.\"\n\nThe marriage only lasted a few months, and she found herself a single mum.\n\n\"Jade is loved an enormous amount. It didn't impact the amount of the love I have for her, it is just very different experiences now and you can't compare them.\"\n\nAll these years later Narelda has forged a successful television career, and after marrying Karina last year, she said there is no shortage of love this time around either.\n\n\"Everyone should have two mums,\" Narelda laughs.\n\n\"There are two mums changing a nappy, there are two mums getting a new outfit, there are two mums bathing the baby … How lucky is this kid?\"\n\nSharing the baby joy and challenging how people think about families\n\nNarelda Jacobs has taken a year off to spend time with her new baby girl. (Supplied: Narelda Jacobs)\n\nSanna is named after Finland's youngest ever prime minister, Sanna Marin. Narelda said the former leader was everything they aspire their daughter to be.\n\n\"We've just really loved watching her be more observant and more aware of the world around her,\" Narelda gushed.\n\nBut when they announced Sanna's birth on social media, Narelda said the nasty comments outnumbered the good ones.\n\n\"People are often surprised when they learn that homophobia exists.\n\n\"How great for you that you don't ever have to experience homophobia but for us it's an everyday thing online.\"\n\nThe pair decided to create what they've called a \"satirical picture book for adults\". Titled 'If Queers Weren't Meant to Have Kids', it's due to be released later this year.\n\n\"We hope that it will challenge people's thinking around rainbow families and how they're created, and the importance of including them.\"\n\nIn turn, they hope by normalising their family, their child will have fewer questions to answer from other kids at day care.\n\nWith extended families interstate, Narelda says it's their \"chosen family\" who will rally around with support and are \"dying to babysit\".\n\n\"It's like a ready-made village.\"\n\nMother's Day celebrations — how these mums will mark the occasion\n\nCherisse said her boys are loved by three big families. (ABC: Grenville Turner)\n\nCherisse's five-year-old describes Mother's Day as \"about love and kind\" — a precious insight from a boy who rules the roost in their house.\n\nCherisse and her boys will celebrate the day with kangaroo tail cooked over a fire and will sing songs as the embers burn.\n\nMother's Day is always \"bittersweet\" for Cherisse, and each year they make a trip to Senna's grave to place toys and trinkets.\n\nCherisse knows her partner Mica, and her three sons Douglas, Dylan and Angus will spoil her with gifts and food on Mother’s Day. (ABC: Grenville Turner)\n\n\"Although I have three amazing sons, I don't have my daughter here with me.\n\n\"I'm still able to get up and celebrate, and not kind of sit in sadness, but it is more about that memory and reflection and just talking about it, that, you know, she did exist.\"\n\nShe explained that not everyone would do what she does, and that culturally just speaking her name wasn't always accepted, but this is right for her.\n\nThe midwife, who now works in health advocacy, encourages anyone who has gone through loss and grief to find their own personal way of healing.\n\n\"If you are a mum and you've experienced loss, you know loss of your own mum, loss of a baby, loss of a pregnancy, miscarriage, I feel like it's your choice to choose how you spend Mother's Day,\" the midwife said.\n\n\"It's not up to other people to determine.\"\n\nNarelda says she and Karina have done a lot in a short time — become a couple, get married and have a baby — but she couldn't be happier. (Supplied: Narelda Jacobs)\n\nNarelda Jacobs said her focus will be on ensuring her wife Karina has a great first Mother's Day, but she doesn't expect they will be able to leave the house for long.\n\n\"She has done an exceptional job from throughout pregnancy and with the birth experience and now catering for every need of the little one, it's just been a joy to watch, and she does it with loving eyes and just a reassuring voice constantly.\"\n\nMother's Day is one day where Narelda says the value of the unpaid and under-recognised work mums do can be celebrated.\n\n\"I'm looking at the blessing that it is to be a mum, to bring to life a new creation.\"\n\nAfter working hard for years, Narelda says the family are taking time out to connect. (Supplied: Narelda Jacobs/ Jade Dolman)\n\nAfter 25 years as a journalist and presenter on Network 10, Narelda has taken the year off to be present and try to \"slow down\".\n\n\"It's really nice to be reminded that this is a really precious time, the most precious of times.\n\n\"You're allowed to press pause and just be here for your baby.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/premenstrual-dysphoric-disorder-diagnoses-on-the-rise/105274892",
        "title": "After years of unexplained mood swings, a four letter diagnosis changed Kris's life",
        "publish_date": "Sun, 11 May 2025 00:06:12 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "After years of drastic, unexplained mood swings in the lead-up to her period, a Perth mother was handed a lifeline in the form of a four-letter diagnosis.\n\nKris Stanley, 36, went to the doctor in 2021 when she started feeling suicidal every month.\n\nThe appointment was the first time she had heard of premenstrual dysphoric disorder, commonly known as PMDD.\n\n\"It was like someone had turned the lights on,\" she said.\n\n\"It was almost liberating … to have something to research, to sink your teeth into.\n\n\" I'm not going crazy. \"\n\nKris Stanley was diagnosed with PMDD in 2021 and wants to make more women aware of the condition. (ABC News: Grace Burmas)\n\nAmong other symptoms, PMDD can cause severe depression and anxiety during the luteal phase of the menstrual cycle, due to a sensitivity to the natural changes in hormones.\n\nLife doesn't stop\n\nKris would try to push through this quick onset of depression and helplessness for the sake of her family.\n\n\"As a mum we don't always get the opportunity to put the rest of life on hold,\" she said.\n\n\"We always have to overcome and be as strong as we can be.\n\n\"I'm a pretty strong person but PMDD has definitely brought me down a few times.\"\n\nWhen she got her diagnosis, it gave her license to talk openly with her sons and partner about what was really going on, teaching them not only about PMDD, but the phases of the menstrual cycle in general.\n\nShe said it's a topic not worth sugar coating.\n\nKris Stanley says she talks openly about PMDD with her family. (ABC News: Grace Burmas)\n\n\"I like to give the boys a heads up so they can be a little bit more understanding,\" Kris said.\n\n\"The more information they're armed with and the more empathetic they can be as humans and as men towards their loved ones, then hopefully we can get a little bit more understanding for women in general when they're going through something that is pretty full on.\"\n\nPMDD, the menstrual condition that makes life hell for thousands of women Photo shows Woman with dark hair and lip ring stands in her house doorway. Thousands of Australian women deal with premenstrual dysphoric disorder, or PMDD, and symptoms can include extreme mood changes, depression and anxiety.\n\nLate diagnosis common\n\nDr Niamh Leonard was the general practitioner and women's health specialist who identified Kris's symptoms as PMDD.\n\nShe has noticed a steady rise in diagnoses over the past few years and a peak in patients aged 35 and older.\n\n\"It's a time when women often have young families, maybe getting back into the workforce or trying to further their careers and are really unable to function properly,\" she said.\n\n\"It's a very difficult age and time.\"\n\nDr Niamh Leonard says there has been a rise in PMDD diagnoses over the past few years. (ABC News: Grace Burmas)\n\nThere's a suite of reasons that could explain why people are often diagnosed later in their reproductive life.\n\nDr Leonard said it could be a link to perimenopause or the fact the condition was only recognised as a psychological disorder just over a decade ago.\n\nBut she said the cultural issues surrounding women's health cannot be ignored.\n\n\"Many women have masked for so long,\" Dr Leonard said.\n\n\"Women in general just try to push through and sometimes they're afraid to speak about how dark their thoughts are at times.\n\n\"To have the diagnosis and be feeling better and to be functioning that's all women really want.\"\n\nTimes slowly changing\n\nDuring its short time in the public eye, awareness of PMDD is steadily growing.\n\nMany of Dr Leonard's patients are now coming to her practice having already heard of PMDD because they've spoken to a friend or seen a post on social media.\n\nDr Niamh Leonard says a PMDD diagnosis is more common in women over the age of 35. (ABC News: Grace Burmas)\n\nKris says legitimising the experience of PMDD cannot be overstated.\n\nFor her the education and diagnosis came late, but she feels it's a case of better late than never.\n\n\"If talking about PMDD helps one other woman get a diagnosis and not feel like she's going crazy or not feel like there's no point in living anymore I think that's the goal,\" Kris said.\n\n\"Not feeling alone in it makes it easier to overcome.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/afl-docklands-stadium-gun-police/105278850",
        "title": "Teen allegedly tries to enter Melbourne AFL game with fake gun",
        "publish_date": "Sat, 10 May 2025 22:55:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "A teenager has allegedly been caught trying to enter an AFL game at a Melbourne stadium with a small knife and an imitation firearm on Saturday.\n\nPolice say a 15-year-old male approached a gate at Docklands Stadium and asked about entering the venue at about 4:30pm, where a match between Essendon and the Sydney Swans had just started.\n\nThe male did not have a ticket and was searched by officers nearby.\n\nPolice found and seized the weapons, and the male was given a caution.\n\nHe did not enter the venue.\n\nThe incident follows a security scare at the MCG during an AFL game last month, where two men were charged after allegedly carrying two guns into the venue.\n\nThe AFL, which owns the stadium, says it's aware of the incident.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/pope-leo-warns-of-ai-challenges/105278816",
        "title": "Pope Leo warns of AI challenges before unexpected visit to Francis's grave",
        "publish_date": "Sat, 10 May 2025 22:30:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Pope Leo XIV has spoken of the challenges posed by AI in his first official address to church leaders.\n\nAfter the meeting, Leo made a surprise visit to his predecessor's tomb, and then to a small Augustinian sanctuary about an hour out of Rome.\n\nDressed in the white robes of the papacy and speaking fluent Italian, Leo addressed more than 100 of the church's cardinals, telling them they should look to continue the legacy of Pope Francis.\n\nThe pontiff also discussed artificial intelligence, describing it as a challenge for working people and human dignity.\n\nWhy 'Leo'?\n\nIn explaining to cardinals why he chose his pontifical name, he alluded to the social upheaval AI could bring to the world.\n\nPope Leo XIV arrives for his surprise visit to the Basilica of St Mary Major. (Reuters: Yara Nardi)\n\n\"There are different reasons for this but mainly because Pope Leo XIII, in his historic encyclical, addressed the social question in the context of the first great industrial revolution,\" he said.\n\n\"I have sensed myself called upon to continue on the same path.\n\n\"That is why I've decided to take the name Leo XIV.\"\n\nAfter addressing the cardinals, Leo made an unexpected trip to Francis's grave.\n\nA flower for Francis\n\nThe former pontiff had asked for his body to be entombed inside his favourite Roman basilica, Santa Maria Maggiore (St Mary Major), rather than in the Vatican.\n\nVisitors were delighted by the unexpected sight of the new pope.\n\nLeo waved from the passenger side of a Volkswagen vehicle as he arrived.\n\nInside the basilica, he walked slowly to Francis's tomb, laying a white flower on it.\n\nHe then knelt in prayer for a few moments.\n\nVisitors shocked by visit\n\nLuisa Laganaro, from Turin, said she was inside the church when the pope arrived.\n\n\"We found ourselves with the pope, it was a huge, intense emotion,\" she said.\n\n\"My heart is still beating because, well, when will I have the chance again to find myself face to face with the pope?\n\n\"It's really beautiful.\"\n\nLeo speaks to people gathered outside the Sanctuary of the Madre del Buon Consiglio (Mother of Good Counsel) in Genazzano, near Rome. (AP: Vatican Media)\n\nLeo also made an unannounced visit to the Sanctuary of the Madre del Buon Consiglio (Mother of Good Counsel) in Genazzano, near Rome.\n\nThe late Pope Francis, who died on April 21, made surprise visits to Catholic sites near Rome quite frequently.\n\nHe asked to be buried at St Mary Major in a simple tomb, decorated only with an inscription of the word \"Franciscus\", his name in Latin.\n\nTens of thousands of people are expected to descend on the Vatican on Sunday morning, local time, when the new pope presides over his first public Sunday prayer.\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/poppy-production-tasmania-increases-in-drug-ozempic-shortage/105257466",
        "title": "Weight-loss drug demand opens new markets for Tasmania's poppy growers",
        "publish_date": "Sat, 10 May 2025 22:17:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "A shortage of the weight-loss drug Ozempic to treat type 2 diabetes has opened up new markets for the Tasmanian alkaloid poppy sector.\n\nIt's the shot in the arm northern Tasmanian pharmaceutical business Extractas Bioscience needed.\n\nFor nearly a decade the poppy processor has struggled with a global oversupply of narcotic material for painkillers, because of a crackdown on opioid prescriptions and cuts to elective surgeries during the COVID pandemic.\n\nBut in the past two years there's been a noticeable shift in sales.\n\nA worldwide shortage of diabetes medicine Ozempic — driven by an unexpected increase in demand for off-label prescribing for weight loss — is partly responsible.\n\nExtractas Bioscience produces many base pharmaceutical ingredients from its poppies, not just the materials that go into oxycodone painkillers.\n\nSome of those ingredients are highly sought after for medications that suppress appetite.\n\nRoss Murdoch says new markets are opening up for Tasmanian poppy products. (ABC News: Laurissa Smith)\n\n\"We're seeing an increase in thebaine and oripavine, that are used as the basis for these,\" chief executive Ross Murdoch said.\n\n\"So we're actually finding that demand has increased enormously on the back of Ozempic, driving this anti-obesity type treatment.\n\n\"We fit into both the treatment of the diabetes and the obesity associated with that, as well as getting the benefit of the expanding market.\"\n\nExtractas Bioscience's extraction plant at Westbury in northern Tasmania. (ABC News: Jordan Young)\n\nSo how does it work?\n\nAfter flowering, the dry poppy capsules are harvested in late summer.\n\nThe seed is separated from the poppy straw and loaded into extractors at the sprawling factory at Westbury.\n\nA range of pharmaceutical compounds can often be extracted from one poppy plant. (ABC News: Laurissa Smith)\n\n\"We extract the drug out of that, we dry it and put it into containers,\" Mr Murdoch said.\n\n\"We then ship it around the world to wholesalers and other companies that make it into the APIs [active pharmaceutical ingredients] and into the drugs.\"\n\nThe raw ingredients extracted from the company's entire poppy production amounts to roughly 100 tonnes annually and goes into about four main products.\n\nOften, a range of pharmaceutical compounds can be extracted from the one poppy plant.\n\nPoppies are harvested after flowering. (ABC News: Laurissa Smith)\n\nThe patented thebaine poppy variety is used to extract materials for medication that can reverse an opioid overdose or treat an opioid addiction, as well as form the base ingredient for weight-loss medicines.\n\nAlklaoids from the same poppy are used to make the oxycodone family of painkillers, commonly branded as Endone or OxyContin.\n\nThe Tasmanian poppy industry experienced a big drop in demand for these after prescription policies changed in 2015, but Mr Murdoch said there had been a slight resurgence.\n\n\"Most of the companies, if not all the companies, we sell to in the world have worked through their inventory level,\" he said.\n\n\"So they are really demanding what they're going to manufacture without an ability to slow down their demand.\n\n\"We don't have the inventory, so we also are needing to grow what they demand.\n\n\" As that demand grows for not only pain products, but also the other associated products, we're seeing that we need to expand our hectares enormously. \"\n\nThis year the business is planning to contract nearly 9,000 hectares of poppies, triple the area from three years ago.\n\nCompany marks fives decades in poppy manufacturing\n\nThe market turnaround comes as staff and growers from across the decades celebrate 50 years of the company's involvement in the poppy processing business.\n\nToday, Extractas Bioscience employs 140 people, and contracts around 150 farmers to grow poppies for the company across Tasmania.\n\nThe business, which was previously known as Tasmanian Alkaloids, was initially set up as a joint venture between Abbott Laboratories and Ciech Polfa in 1975.\n\nTasmanian Alkaloids field officers inspect poppy trials at Forthside in Tasmania's north-west in the early 1980s. (Supplied: Extractas Bioscience)\n\nIn 1982, US company Johnson and Johnson took it over.\n\nIt spent decades cultivating a more versatile, opiate-rich poppy that drug manufacturers wanted, particularly in the multi-billion dollar pain medication market in the US.\n\nTasmanian Premier Jeremy Rockliff's father Rick was one of the first employees with Tasmanian Alkaloids, and spent more than 40 years with the company.\n\n\"He continued growing poppies right up until the time he passed away so it means a lot,\" Mr Rockliff said of his father.\n\n\"It was his passion and our passion as well as a family.\n\n\" The company has been good. There's been some good and bad times for farmers, it's been very loyal to its customers and the community. \"\n\nRick Rockliff, third from the left, with other Tasmanian Alkaloids field officers in 1983. (Supplied: Extractas Bioscience)\n\nIn 2016, Johnson and Johnson sold Tasmanian Alkaloids to US private equity firm SK Capital.\n\nIn 2020, it renamed the business Extractas Bioscience to reflect its expanding portfolio of plant extracts, which at the time, included medicinal cannabis.\n\nAfter such a prolonged downturn in the market, Poppy Growers Tasmania president Michael Nichols believes the industry is finally turning a corner.\n\n\"Two years ago we were only growing 3,000 hectares and this year there's potential of 12,000 hectares if they can find the area,\" Mr Nichols said.\n\n\"They've got a very proud history, they might have changed names a few times, but that hasn't taken away the quality of the product produced by the farmers.\"\n\nMichael Nichols says the industry is finally turning a corner. (ABC News: Meg Fergusson)\n\nMr Murdoch credited the company's longevity to its staff and growers.\n\n\"We've got people who've been here for 30, 40, years,\" he said.\n\n\"Second generation people, including the farmers that we work with, who are second or third generation growers.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/jannik-sinner-alex-de-minaur-rome-masters-tennis/105278812",
        "title": "Italian crowd compares Sinner's victorious return to pope's ascent",
        "publish_date": "Sat, 10 May 2025 21:56:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jannik Sinner has made a solid return from his three-month doping ban by beating 99th-ranked Mariano Navone 6-3, 6-4 before an adoring home crowd at the Italian Open.\n\nIt was Sinner's first match since he won his third grand slam title at the Australian Open in January but he said it took him all of three games to get his competitive focus back.\n\n\"Amazing feeling. I have waited quite long for this moment. I am very happy to be back,\" Sinner said.\n\nThere were not too many signs of rust and it did not take long for Sinner to start crushing his groundstrokes on or near the lines.\n\nWhen the Italian broke for 3-1 in the first set, the crowd inside Campo Centrale sang \"Ole, ole, ole, Sin-ner, Sin-ner.\"\n\nSinner acknowledged he had doubts over whether he would regain the form that he had before his ban.\n\n\"It's normal to have doubts. Would be strange to don't have any doubts. Would sound very arrogant, no?\" Sinner said.\n\n\"I had doubts before going on court today. I have doubts now what's going to happen in the next match. But we have to live with doubts because it means that you really care, that you want to improve, that you want to show yourself, that you want to do something special.\"\n\nSinner returning to 'divided' locker room Photo shows A tennis ball flies away from Jannik Sinner as he serves during a practice session. As Jannik Sinner prepares to return from his doping ban, there are still major questions to be answered about the process that led to such different outcomes for the world number one and Australia's Max Purcell.\n\nMany fans in the sold-out crowd of 10,500 were dressed in orange, Sinner's theme colour. And there were plenty of signs that said \"Bentornato Jannik\" (\"Welcome back Jannik\").\n\nThe victory extended Sinner's winning streak to 22 matches, dating to October.\n\n\"It went very well at times,\" he said.\n\n\" Could be better, yes, but in any case it doesn't matter about the result today. It has been a remarkable day for me. \"\n\nIn February, Sinner agreed to the three-month ban in a settlement with the World Anti-Doping Agency that raised some questions, since it conveniently allowed him not to miss any Grand Slams and come back at his home tournament.\n\nSinner admitted to being nervous before his return match. (AP: Andrew Medichini)\n\nThe settlement was made after WADA appealed a decision last year by the International Tennis Integrity Agency to fully exonerate Sinner for what it deemed to be an accidental contamination by a banned anabolic steroid in March 2024.\n\nMany fellow pros feel Sinner was treated too lightly, but the crowd at the Foro Italico night session was fully behind Sinner, who has remained Italy's most popular athlete despite his suspension.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\nWhen Sinner unleashed a backhand approach winner up the line early in the first set — the game in which he eventually broke Navone's serve — one Sinner fan yelled, \"Destroy him.\"\n\nAnother sign in the crowd translated to \"Make our hearts beat.\" One more referred to this week's election of a new pope just down the road at the Vatican, joking that \"After three months of conclave, Habemus Papam!\" — using the Latin words that are announced from the balcony of St Peter's Basilica when a pope is elected.\n\nHis only real lapse came late in the second set when he failed to consolidate a break and dropped his serve. But he broke again in the next game and then served the match out.\n\nSinner will next face 93rd-ranked Dutch qualifier Jesper De Jong, who beat 25th-seeded Alejandro Davidovich Fokina 6-0, 6-2.\n\nThe crowd was note so vocally behind Australian number one Alex de Minaur as he beat local hope Luca Nardi 6-4, 7-5.\n\nAlex de Minaur has shown his ability on clay in recent seasons. (Getty Images: Clive Mason)\n\nDe Minaur produced a typically professional performance to beat the 21-year-old in just under two hours, hitting three fewer winners but, crucially, 13 fewer unforced errors.\n\nDe Minaur would have been facing Felix Auger-Aliassime in the third round, but the Canadian 27th seed was a late withdrawal due to a back injury and Bolivian Hugo Dellien took his place, taking down qualifier Thiago Seyboth Wild to progress.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nDe Minaur is joined in the third round by countryman Alexei Popyrin, who plays 10th seed Daniil Medvedev.\n\nIn the women's tournament, three-time champion Iga Świątek was beaten by Danielle Collins 6-1, 7-5. The third-round loss marked Świątek's earliest defeat at a big WTA event in nearly four years.\n\nŚwiątek, the top clay-court player on the women's tour, was coming off a lopsided loss to Coco Gauff in the Madrid Open semifinals last week.\n\nShe has 15 days to rediscover her form before May 25, which marks the start of the French Open, where she has won four of her five grand slam titles.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-11/affordable-housing-projects-revoked-sunshine-coast/105092264",
        "title": "After 40 years calling the Sunshine Coast home, Narelle has been forced out",
        "publish_date": "Sat, 10 May 2025 21:52:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "For more than four decades, Narelle Lockett called the Sunshine Coast home.\n\nShe grew up not far from the region's stunning beaches and enjoyed the simple life.\n\nOver the years, she anxiously watched as the area became increasingly popular with interstate residents and house prices skyrocketed.\n\nDespite the increasingly expensive housing market, Ms Lockett said she was prepared to make sacrifices so she could stay there, including at one point spending about 70 per cent of her income on rent.\n\nBut when her landlord proposed hiking that rent even further, to $700 a week, the extra $80 a week was a bridge too far.\n\nMs Lockett feels isolated in the small town she now lives in. (ABC News: Lucy Loram)\n\nFor months, she scrolled online searching for rentals, applying for about two dozen and even looked at living in a caravan park, but to no avail.\n\nMs Lockett then decided to travel north to a town called Toogoom, north of Hervey Bay, where she now lives with her teenage children for about $500 a week.\n\nEven that's $50 more than it was when she first moved in about two years ago.\n\nLoneliness, isolation\n\nIt wasn't a decision Ms Lockett made lightly.\n\n\"Luckily, I'm not the type of person to get depressed, but it has been challenging at times. You can get pretty lonely,\" she said.\n\nLiving in such a small town and being far from family and friends has meant Ms Lockett has struggled with the emotional toll of the move.\n\n\"Basically, I don't have any friends up here, and because Toogoom is a very [small town] it doesn't have any facilities. We don't even have shops or anything here,\" she said.\n\n\"I basically live the life of a hermit now.\"\n\nSymptom of a worsening crisis\n\nEarlier this year, Queensland's Deputy Premier and State Planning Minister Jarrod Bleijie revoked approval for a 90-unit affordable housing development in the suburb of Birtinya, about 20 minutes south of Maroochydore.\n\nBrisbane Housing Company had proposed a 90-unit complex for Bright Place, in Birtinya. (Supplied: Brisbane Housing Company)\n\nThe project from the Brisbane Housing Company (BHC) was to provide homes for essential workers, including healthcare staff at the nearby Sunshine Coast University Hospital, via a build-to-rent model.\n\nRent would have been no more than 74.9 per cent of the market rate, BHC said.\n\nIt was approved in September by the former Labor government through a Ministerial Infrastructure Designation, a process intended to streamline approvals for housing projects by bypassing local government approvals.\n\nDeputy Premier Jarrod Bleijie repealed the approval for the BHC Birtinya development. (ABC News: Lucas Hill)\n\nMr Bleijie argued that the project, which is located in his electorate of Kawana, bypassed the usual council and community consultation process.\n\nThe repeal notice stated there were too many units proposed for the site.\n\n\"Before the election, I expressed concern about that development. It's in a cul-de-sac and public transport was non-existent,\" Mr Bleijie told reporters.\n\n\"It would have put an immense pressure … on residents living there on an already strained road system\".\n\nThere was also some opposition to the project in Birtinya.\n\nThe Birtinya Residents Action Group argued the \"reckless\" development would overcrowd an already busy area.\n\nFormer housing minister Meaghan Scanlon, pictured with deputy opposition leader Cameron Dick, approved the Birtinya development last year. (ABC News: Lottie Twyford)\n\nBut Mr Bleijie's decision drew the ire of the state opposition, which accused him of \"pulling the rug\" out from under his community.\n\nSunshine Coast Mayor Rosanna Natoli said the project could proceed if BHC resubmitted plans to the council for local government approval.\n\nThe developer has already signalled it intends to take that path and said it would work collaboratively with the council.\n\nCr Natoli, who wouldn't comment specifically on that development, agreed the coast was falling short on housing, especially for essential workers.\n\nSunshine Coast Mayor Rosanna Natoli wouldn't comment specifically on the Birtinya development. (ABC News: Amy Sheehan)\n\nThe mayor said local council was doing its bit, including identifying land that could be used for affordable housing.\n\nFor example, she said, a joint council-state project set to deliver 22 affordable homes to be administered through a community housing provider was underway in Marcoola.\n\nThe Sunshine Coast Council is working with the state government to build 22 affordable homes for rent in Marcoola. (Supplied: Taylor Bunnag/Sunshine Coast Council)\n\nThe Queensland government said it was building more than 270 social homes on the Sunshine Coast, as well as 29 in Noosa — mostly by partnering with community housing providers.\n\nA similar proposed development planned for Tewantin, near Noosa, also had its approval revoked by the state government in March — using new powers it gave itself in December.\n\nReport: Australians need $130,000 salary to comfortably afford rent Photo shows Group of city workers walking on street New report finds Australians need a six-figure salary to comfortably afford the national weekly asking rent for a typical unit.\n\nNoosa Mayor Frank Wilkie welcomed that decision, as he'd been critical of the State Facilitated Development (SFD) process that had bypassed the usual local government approvals process.\n\nA second 196-unit affordable housing project planned for Noosa remains under review, Mr Bleijie confirmed on Friday.\n\nHe said that developer was working \"positively\" with the local council.\n\nAs part of the SFD process, both were required to designate at least 15 per cent of the dwellings as affordable.\n\nBoth were controversial as they would have exceeded current height limits for the region.\n\nThe figures\n\nOn the Sunshine Coast, the median house price is just below $1.2 million, just shy of Sydney's $1.3 million.\n\nAccording to Tim Lawless from property analytics firm CoreLogic, housing prices continued to rise — albeit slowly — across Noosa and the Sunshine Coast, up 5.3 per cent in the 12 months to March.\n\nHe attributed the slower rate of growth to the fact the market as a whole had become increasingly unaffordable, with prices having skyrocketed 70 per cent in the past five years.\n\nCoreLogic chief analyst Tim Lawless says prices are rising in markets previously thought of as \"affordable\". (ABC News: Geoff Kemp)\n\nHousing prices further afield, in what had traditionally been more affordable markets, such as Gympie and the hinterland, were also going up, he said.\n\nA recent report from Everybody's Home, an advocacy group aimed at resolving the nation's housing crisis, found the Sunshine Coast was now among the most unaffordable places to live in the country.\n\nThe report found even people earning $100,000 a year were spending 46 per cent of their income on rent.\n\nAffordable housing is defined as spending 30 per cent or less of income on rent or housing costs.\n\nMs Lockett says she won't move again, no matter what happens. (ABC News: Lucy Loram)\n\nFor that to be possible, a person living on the \"lifestyle destination\" of the coast would need to be earning more than $130,000.\n\nIt's a stark reality that has left Ms Lockett resigned to staying where she is — even as prices rise there, too.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/relief-for-wallabies-star-as-scans-rule-out-spinal-fracture-20250511-p5ly6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Relief for Wallabies star as scans rule out spinal fracture",
        "publish_date": "Sun, 11 May 2025 10:40:54 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Noah Lolesio has been cleared of a spinal fracture after a suffering a scary neck injury that saw him stretchered off the field and taken to Royal Perth Hospital on Saturday night.\n\nLolesio was taken from the field a neck brace after getting caught awkwardly in a ruck in the first half of the Brumbies’ 33-14 win over the Western Force at HBF Park. Attempting to clean out over fullback Tom Wright, Lolesio was pushed backwards by several Force players, and the full weight of halfback Henry Robertson landed on the back of Lolesio’s neck, with his chin pinned dangerously down on his chest.\n\nIn clear pain, the Wallabies no.10 was treated on field before being taken off amid concern he may have suffered a fracture in his spine.\n\n“He’s in the hospital at the moment, about to go in for scans. He’s got feeling, he’s got movement, it all looks very positive,” Larkham said post-game. “But obviously it was a very nasty injury.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/brumbies-win-super-derby-in-perth-but-lolesio-stretchered-off-with-spinal-injury-20250511-p5ly71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brumbies win Super derby in Perth but Lolesio stretchered off with spinal injury",
        "publish_date": "Sun, 11 May 2025 09:58:44 +1000",
        "category": "sports",
        "authors": [
            "Darren Walton"
        ],
        "text": "A spinal injury to Wallabies flyhalf Noah Lolesio has overshadowed the ACT Brumbies’ surge to an all-important Super Rugby Pacific home play-off.\n\nLolesio was stretchered off wearing a neck brace, and in apparent extreme pain, midway through the first half of his Brumbies’ 33-14 derby win over the Western Force in Perth.\n\nThe Brumbies’ and incumbent Australian No.10 was twisted in an accidental off-the-ball play while trying to repel a Force attack on his goal line in the 20th minute of Saturday night’s derby.\n\nIt was initially unclear if Lolesio had suffered a back, hip or leg injury in the incident.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/sinner-wins-on-return-from-doping-ban-20250511-p5ly72.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sinner wins on return from doping ban",
        "publish_date": "Sun, 11 May 2025 09:58:33 +1000",
        "category": "sports",
        "authors": [],
        "text": "Sinner wins on return from doping ban\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/australian-players-may-refuse-to-return-if-ipl-resumes-20250511-p5ly6r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian players may refuse to return if IPL resumes",
        "publish_date": "Sun, 11 May 2025 09:57:44 +1000",
        "category": "sports",
        "authors": [
            "Scott Bailey"
        ],
        "text": "Australia’s cricketers are in a state of flux, uncertain whether the Indian Premier League will resume and some questioning if they will return.\n\nPlayers boarded flights out of India on Saturday, after the tournament was postponed on Friday due to the escalating conflict with Pakistan.\n\nAustralians featuring in the Pakistan Super League were also planning trips home, after plans to move the rest of that tournament to the UAE were abandoned.\n\nBut as players began making their exits with most on multi-leg flights, it emerged both tournaments could potentially resume after a ceasefire between the two countries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/why-a-multimillion-dollar-legal-boom-is-running-out-of-steam-20250411-p5lr2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why a multimillion-dollar legal boom is running out of steam",
        "publish_date": "Sun, 11 May 2025 09:50:09 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "In the Victorian Supreme Court, 16 cases were filed last year, compared with 21 cases in 2020 and 25 in 2014. Defamation reforms Defamation laws changed in most states and territories in July 2021, and again in July last year. A number of the reforms made it harder for plaintiffs to bring, and win, a lawsuit. This may have resulted in a drop in the number of cases filed in those jurisdictions, but other factors, including the high cost of litigation, are also likely to be relevant.\n\nWestern Australia has been a hold-out and has not passed any of the changes to defamation law that might have contributed to falling case numbers across the majority of the country. It has also seen a downturn in cases: 15 cases were filed in the WA Supreme Court last year compared with 28 to 30 cases in the preceding three years. However, new filings were relatively stable between 2016 and 2019, averaging 16 cases per year. Costly losses Among the other factors that may be discouraging would-be plaintiffs are the astronomical cost of litigation and high-profile court losses.\n\nTwo of the largest defamation cases in recent years, brought by former Special Air Service soldier Ben Roberts-Smith against The Age and The Sydney Morning Herald, and former federal Liberal staffer Bruce Lehrmann against Network Ten, were dismissed by the Federal Court. Both resulted in costs orders in the millions. But appeals have begun in both cases, and Roberts-Smith has sought to expand his appeal to introduce evidence of a “secret recording” involving Age and Herald investigative journalist Nick McKenzie. Australia mirrors UK University of Sydney Professor David Rolph, a defamation law expert, said it was “not surprising that from time to time there might be a downturn in defamation filings”. Defamation has been consistently popular across Australia over the long term, but “there are periods where it is more intensely litigated than others”, he said.\n\n“One observation that might be made, though, is from around 2020-2021 in jurisdictions that introduced stage one of the reforms ... there has been a decided decline. “This mirrors the decline in new claims in the UK after they introduced their 2013 Defamation Act. “Many of the reforms in [the UK law] were introduced in Australia, such as serious harm and the public interest defence. After reforms are introduced, it is to be expected that there will be a downturn in new filings. “One way to illustrate this is that filings in Western Australia, which to date has introduced none of the reforms, have remained consistently high, albeit with a significant drop-off in the last year.” As to the potential impact of recent court losses, Rolph said that “when prominent plaintiffs fail, that itself can have a chilling effect on other prominent plaintiffs suing for defamation”.\n\nSerious harm Under the serious harm requirement, a plaintiff must show an allegedly defamatory publication “has caused, or is likely to cause, serious harm” to their reputation to bring a claim. This was designed to discourage lower-level lawsuits, sometimes referred to as “backyard” claims. “Harm to reputation was previously presumed, which made it very easy for virtually anyone to sue for defamation,” Rolph said. Adding this new obstacle “may deter some claimants”, he said.\n\nA new procedural hurdle Rolph said a new requirement that a person suing for defamation issue a concerns notice before filing proceedings may also “act as a barrier”. A concerns notice sets out the allegedly defamatory statements at the heart of their claim. During a trial, a plaintiff “can’t rely on a statement they haven’t put in their concerns notice”. “The effect of this is to increase the costs of pre-trial steps because specialist practitioners would need to be engaged to draft concerns notices.” Western Australia",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/a-cricket-team-lost-ten-wickets-for-0-and-won-by-153-runs-20250511-p5ly6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A cricket team lost ten wickets for 0. And won by 163 runs",
        "publish_date": "Sun, 11 May 2025 09:40:55 +1000",
        "category": "sports",
        "authors": [],
        "text": "A tactical masterclass or a strategy that goes against the spirit of cricket? That is the debate after a bizarre situation occurred in a Women’s Twenty20 World Cup Asian qualifier.\n\nUnited Arab Emirates batters retired out en masse in an effort to end their match against Qatar quickly with rain threatening to halt play. With only one team progressing from the group, the UAE wanted to close out a win to keep qualification in their own hands.\n\nUAE reached 0-192 in 16 overs with captain Esha Oza making 113 off 55 balls before deciding to finish their innings early to avoid a washout.\n\nEnding an innings by declaration is not allowed in white-ball cricket, so every batter had to pad up and walk to the middle before retiring without facing a ball.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/star-studded-jamaicans-pipped-by-spain-20250511-p5ly6q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star-studded Jamaicans pipped by Spain",
        "publish_date": "Sun, 11 May 2025 09:29:26 +1000",
        "category": "finance",
        "authors": [],
        "text": "Star-studded Jamaicans pipped by Spain\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-saturday-may-11-20250511-p5ly6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Saturday May 11",
        "publish_date": "Sun, 11 May 2025 08:24:18 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Saturday May 11\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australian-cricketers-head-back-home-after-ipl-cancelled-amid-india-pakistan-conflict-20250511-p5ly64.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian cricketers head back home after IPL cancelled amid India-Pakistan conflict",
        "publish_date": "Sun, 11 May 2025 07:24:32 +1000",
        "category": "sports",
        "authors": [],
        "text": "Australian cricketers head back home after IPL cancelled amid India-Pakistan conflict\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/explosions-reported-hours-after-india-and-pakistan-reach-ceasefire-deal-20250511-p5ly63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Explosions reported hours after India and Pakistan reach ceasefire deal",
        "publish_date": "Sun, 11 May 2025 07:24:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Explosions reported hours after India and Pakistan reach ceasefire deal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/crows-stellar-mark-leaves-legends-raving-20250511-p5ly5y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crow's stellar mark leaves legends raving",
        "publish_date": "Sun, 11 May 2025 06:53:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Crow's stellar mark leaves legends raving\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/payten-fumes-at-white-noise-over-officiating-20250511-p5ly5x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Payten fumes at 'white noise' over officiating",
        "publish_date": "Sun, 11 May 2025 06:49:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Payten fumes at 'white noise' over officiating\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/when-will-albanese-key-policies-take-effect/pnkn4f1te",
        "title": "From tax changes to bulk billing, here's when Albanese's key policies are set to begin",
        "publish_date": "Sun, 11 May 2025 01:18:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese and Labor have entered a second term of government after winning the federal election in a landslide — but when will their key policy promises kick in?\n\n\n\n\n\nLabor has secured a majority in the House of Representatives , currently predicted to hold at least 92 seats compared to the Liberals' 40.\n\n\n\n\n\nThe party made a series of sweeping policy promises in the run-up to the election across a number of different sectors, including healthcare, education, and energy.\n\n\n\n\n\nHere's when those changes are due to come into effect.\n\n\n\nREAD MORE The many ways Australia will change under Anthony Albanese's second term\n\nHECS cut\n\nLabor has promised it will cut 20 per cent of all student loan debts, wiping around $16 billion in debt for around three million Australians.\n\n\n\n\n\nThis includes all HELP, VET Student Loan, Australian Apprenticeship Support Loans and other income-contingent student support loan accounts.\n\n\n\n\n\nWhen the government announced this policy in November, they said the cuts would come into effect by June 1, and Albanese recently said he will make it his first priority once parliament resumes .\n\n\n\nTax cuts\n\nAs part of their budget announcement, the Albanese government promised to introduce new tax cuts for every Australian taxpayer and the legislation for the cuts passed parliament in March.\n\n\n\n\n\nThe staggered cuts include an initial reduction in tax from the 16 per cent rate to 15 per cent from 1 July 2026.\n\n\n\n\n\nFrom 1 July 2027, the rate will be cut from 15 per cent to 14 per cent.\n\n\n\n\n\nFor workers who earn above $45,000, this will mean a further tax cut of $268 in 2026-27 and $536 from 2027-28.\n\n\n\nWorking from home tax deduction\n\nThe Albanese government has promised Australians working from home will be able to claim an instant $1,000 tax deduction to cover work expenses.\n\n\n\n\n\nAlbanese said this will provide \"permanent cost of living relief and make tax time quicker and easier for 5.7 million taxpayers\".\n\n\n\n\n\nThe government has said the tax deduction will come into effect for the 2026-27 financial year.\n\n\n\nInternational student visa fees\n\nTo fund some of their election promises, Labor announced in April that it would raise visa fees for international students from $1,600 to $2,000.\n\n\n\n\n\nThe increased fees are expected to deliver $760 million to the budget over the forward estimates and will come into place from July 1.\n\n\n\nBulk billing\n\nA key pillar of Labor's campaign, the government promised to introduce reforms to bulk billing , including expanding the bulk-billing incentive to all Australians and introducing a new incentive payment for practices that bulk bill every patient.\n\n\n\n\n\nLabor said these changes will mean that nine out of 10 GP visits will be bulk billed by 2030.\n\n\n\n\n\nThe changes to bulk billing incentives and the Bulk Billing Practice Incentive Program are both expected to come into effect on 1 November.\n\n\n\nLISTEN TO Labor's new frontbench confirmed; leadership contests underway for Greens, Liberals and Nationals SBS News 09/05/2025 04:11 Play\n\nSolar batteries\n\nThe government has promised to make renewable energy storage cheaper for households and small businesses by cutting the cost of home batteries.\n\n\n\n\n\nThe Cheaper Home Batteries Program will cut the cost of an installed battery by 30 per cent and come into effect from 1 July.\n\n\n\nSubsidised childcare\n\nIn February, the government passed legislation allowing families to access three days of subsidised childcare .\n\n\n\n\n\nThe government said families earning between $50,000 to $100,000 are expected to save an average of $1,460 per year, and Labor considers it a stepping stone towards universal childcare.\n\n\n\n\n\nActivity tests will be scrapped, meaning parents won't have to work or study to be eligible for childcare subsidies.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/its-mothers-day-but-are-you-your-mums-favourite-child/ilmybhrs7",
        "title": "It's Mother's Day - but are you your Mum's favourite child?",
        "publish_date": "Sat, 10 May 2025 22:26:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/palliative-care-in-multicultural-australia/qd3zu543s",
        "title": "Palliative care in multicultural Australia",
        "publish_date": "Sat, 10 May 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "This story has been produced in collaboration with SBS Greek.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFrances Davey's mother Virginia migrated to Australia from Greece about 70 years ago.\n\n\n\n\n\nNow 96 years old, she is receiving Palliative Care at Fronditha Care - an aged-care provider which specialises in assisting Australians from a Greek cultural background.\n\n\n\n\n\nMy mother speaks two languages [[butt]] Now that she's got dementia, she's gone back to her native language, and her early years in a little village, she doesn't live in Australia anymore, she's lost the last forty years. It's really important the cultural palliative care has been established.\n\n\n\n\n\nFrances says understanding and supporting her mother's cultural and spiritual needs is an important aspect to sensitive and dignified care.\n\n\n\n\n\nShe still would like all the religious ceremonies, the religious beliefs and the religious days, name days and Easter in particular, because she had lots of fond memories, that's good for her.\n\n\n\n\n\nCulturally Appropriate Palliative Care is addressed in a new online module launched this week ((launched Sunday)) by Dementia Australia in its 'Ask Annie App' in collaboration with the Fronditha Care Foundation.\n\n\n\n\n\nThis is Doctor David Sykes, Director at the Centre for Dementia Learning at Dementia Australia.\n\n\n\n\n\nThis new module on palliative care is really aimed at providing real life scenarios to workers to give them some valuable tips and strategies on how they can really provide valuable care and support.\n\n\n\n\n\nFaye Spiteri is Fronditha Care's CEO.\n\n\n\n\n\nAs people prefer to age in place, by the time they reach residential care, they are usually in a more advanced stage of an illness such as living with dementia, so it was very important to combine the palliative care module with dementia education so that our team members are better able to understand these issues that are inter-related.]]\n\n\n\n\n\nAccording to Palliative Care Australia, 400 people of all ages die of a terminal illness in Australia each day and could benefit from palliative care.\n\n\n\n\n\nCamilla Rowland, the CEO at Palliative Care Australia, says palliative care is a human right that can offer people support in their final days.\n\n\n\n\n\nOver 37% of older Australians over 65 come from other countries. So we have a multicultural society, so we need to ensure that everybody has an individualized person-centered care plan.]]\n\n\n\n\n\nIt's something registered nurse Waruni Garusingha feels passionate about.\n\n\n\n\n\nIn Greek Orthodox Traditions, they place a high importance on spiritual support, involving a priest to provide prayers and blessings, and also most of the Greek families prefer to be with their loved ones in their final moments, and also we usual put Greek icons in the room, soft music, they were also highlighted in the module.\n\n\n\n\n\nEncouraging a compassionate approach, to empower and respect the choices of those in their last years, months and days of life.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-environmental-footprint-of-ai/c02q43kiv",
        "title": "The environmental footprint of AI",
        "publish_date": "Sat, 10 May 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMore than 400 million weekly users making a total of one billion requests every single day - that's the estimated reach of ChatGPT.\n\n\n\n\n\nAnd it's just one company.\n\n\n\n\n\nThere are thousands of AI chatbots fielding an increasing number of queries.\n\n\n\n\n\nAnd while the technology may seem invisible to the average user, the environmental toll is significant, explains Dr Ascelin Gordon, a Senior Lecturer in Sustainability at Melbourne's RMIT University.\n\n\n\n\n\n\"When the big AI boom happened a few years ago, I became really interested in the environmental footprint that was resulting from our intense, growing AI usage. And so I began doing some research around looking at AI use and data centres and what the impacts were that resulted from those.\"\n\n\n\n\n\nDr Gordon explains that AI requires a lot of computer power both to train and deploy the technology.\n\n\n\n\n\n\"So AI basically runs in data centres. And when we have these AI models, they need to be first trained, which uses a lot of energy and resources. And so the training occurs running in these big data centres and then they need to be deployed where users can interact with them. The problem is you can have millions of users using an AI model every single day. And so the resources quickly add up. \"\n\n\n\n\n\nData centres, which house computing infrastructure, have been around for decades.\n\n\n\n\n\nUp until now, they've maintained a fairly stable appetite for power, but the AI boom is driving a surge in energy demands.\n\n\n\n\n\nResearch carried out by investment bank Goldman Sachs in 2024 suggests a single ChatGPT query uses nearly 10 times as much energy as a typical Google search.\n\n\n\n\n\nAnalysts at the time stated that AI could drive the kind of electricity growth which hasn’t been seen in a generation.\n\n\n\n\n\nEarlier this year, U-S President Donald Trump issued executive orders to allow some coal-fired power plants set for retirement to keep running, in part, to meet the rising demand of data centres .\n\n\n\n\n\nDr Gordon says data centres across the globe are expanding both by numbers and in size, as the technology becomes even more sophisticated.\n\n\n\n\n\n\"There's probably around up to 7,000 data centres all around the world and the number is rapidly growing. Now people are starting to do things like generate images and generate audio and even generate video. And doing those sorts of activities can use hundreds and thousands of times more electricity and water compared to just doing simple text queries.\"\n\n\n\n\n\nThe International Energy Agency, or the I-E-A, estimates that a single data AI focused centre consumes as much electricity as 100,000 households.\n\n\n\n\n\nAnd the largest ones under construction today will consume 20 times as much.\n\n\n\n\n\nFor context, however, these sprawling warehouses - located in almost every corner of the world - accounted for just 1.5 percent of global electricity consumption in 2024.\n\n\n\n\n\nBut the figure is expected to double by the end of the decade, according to the IEA research published in April.\n\n\n\n\n\nPower-hungry, and water-thirsty too.\n\n\n\n\n\nBy some estimates, between 20 and 50 prompts to an AI chatbot can require up to half a litre of water.\n\n\n\n\n\nProfessor Seyedali Mirjalili founded the Centre for Artificial Intelligence Research and Optimisation at Adelaide's Torrens University.\n\n\n\n\n\nHe says while the exact toll is difficult to quantify, data centres use vast amounts of water for cooling purposes.\n\n\n\n\n\n\"It depends on obviously the model that you use. Some of them are quite small, some of them are quite large. The data centre is where the data is stored, it's racks of servers so it requires a large amount of electric electricity to run those servers. And also you need a lot of waters to cool it down and that's where the water consumption comes in.\"\n\n\n\n\n\nAnd then, Dr Gordon says there's the issue of e-waste.\n\n\n\n\n\n\"As these data centres proliferate around the world, the amount of e-waste that the discarded computers that are used every time they're replaced is growing massively. So it's really important that we get on top of this e-waste problem.\"\n\n\n\n\n\nThere are growing calls for tech companies to be required to monitor the environmental costs of AI and for governments to implement sustainability standards.\n\n\n\n\n\nProfessor Mirjalili again.\n\n\n\n\n\n\"Other things that should be mandated and should be prioritised as well, like energy efficiency, water efficiency, or making sure that AI is aligned with human values. And I believe that this should be on the agenda for governments and large corporates.\"\n\n\n\n\n\nThere have been some improvements in efficiency, as well as investments in cleaner energy.\n\n\n\n\n\nIf done right, Professor Mirjalili says, AI has the potential to help drive down emissions.\n\n\n\n\n\n\"If you think about the emerging technology that have been able and will be able to help us to combat the challenges that global challenges, AI is definitely one of them. Forecasting, modelling of the emissions of different companies. So I would say those are good examples of where AI can help us to better understand and model climate change.\"\n\n\n\n\n\nThere's the potential to create a future where AI is tool in solving, rather than helping cause, the climate crisis.\n\n\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-fashion-week-2025-juanita-page-joseph-and-james/s405u0bwq",
        "title": "'We need to give men the same freedom': How Juanita Page is making menswear more playful",
        "publish_date": "Sat, 10 May 2025 20:30:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "From her sunlit hotel suite in Darling Harbour, Juanita Page is putting the final touches on her debut solo runway show.\n\n\n\n\n\nThe collection features 25 lofty streetwear looks and draws inspiration from Page's playful and lively family gatherings.\n\n\n\n\n\nThe 33-year-old designer is a proud Gooreng Gooreng and South Sea Islander woman and one of a relatively small pool of women designing menswear in Australia. Her label, Joseph & James, blends streetwear ease with refined tailoring.\n\n\n\n\n\nIt's a signature that's earned her a place on this year's Australian Fashion Week (AFW) stage.\n\n\n\n\n\n\"It's definitely a massive milestone,\" Page says.\n\n\n\n\n\n\"We have no-one else to hide behind. It's just us.\"\n\n\n\nJuanita Page says she hopes her designs will spark conversation around men's fashion. Source: Supplied\n\nMenswear: A 'blank canvas'\n\nSpeaking with SBS News ahead of her AFW debut, Page admits the moment is both daunting and an honour.\n\n\n\n\n\nBut what excites her most is the chance to challenge how Australians think about menswear: Who gets to define it and the conversations around masculinity and risk-taking.\n\n\n\n\n\n\"We don't call women eccentric or attention-seeking when they go bold or take risks with fashion. We call it 'a look',\" she says.\n\n\n\nWe need to give men that same freedom.\n\nPage's desire to push the boundaries of traditional menswear was seeded early in her career while studying fashion design technology at RMIT.\n\n\n\n\n\n\"When I first started studying fashion, everyone instinctively gravitated toward women's wear,\" she says.\n\n\n\n\n\n\"That made me wonder: who is designing for anybody else? It became this creative blank canvas for me.\"\n\n\n\n\n\nThat instinctive curiosity led her to explore silhouettes, fabrics and stories often overlooked in men's fashion in Australia — and a sense of play that is now central to her label's identity.\n\n\n\nREAD MORE The Indigenous fashion designer making swimwear from recycled plastic\n\nEach collection is rooted in an overarching narrative, which Page says is shaped in part by her Indigenous heritage and connection to her community.\n\n\n\n\n\n\"Storytelling is a big part of culture for me, and every collection starts there,\" she says.\n\n\n\n\n\n\"For this collection, I thought about what values I learned growing up, and what we loved doing as a family. It always came back to food, gathering, sharing, making people feel welcome.\"\n\n\n\n\n\nHer AFW show is infused with those moments of connection: Kick-ons after a night out and backyard meals with family.\n\n\n\n\n\nPage says the clothes are designed to embody those memories of feeling relaxed, elevated and joyful.\n\n\n\n\n\n\"There's something about gathering over food that breaks down walls,\" she says.\n\n\n\n\n\n\"I wanted the clothes to reflect that feeling of ease and confidence, like when you're really yourself with the people you love.\"\n\n\n\nJoseph & James will debut their solo collection at Australian Fashion Week 2025. Source: Supplied\n\nPermission to play\n\nBeyond the AFW runway, that sense of ease and playfulness is also something Page hopes to bring to Australian menswear more broadly.\n\n\n\n\n\n\"I think men here tend to dress very understated, very functional,\" she says.\n\n\n\nBut what if dressing could be expressive too? What if we gave men permission to play?\n\nFor Page, moving away from functionality and towards expression doesn't have to come at the expense of sustainability.\n\n\n\n\n\nWhile she doesn't loudly promote Joseph & James as a sustainable brand, ethics are embedded in every stitch.\n\n\n\n\n\nFrom limited production runs that often fall below manufacturer minimums to her strict adherence to natural fibre use, Page says sustainability is foundational to the brand.\n\n\n\n\n\n\"We just think this should be the standard,\" she says.\n\n\n\n\n\n\"It costs more; it's harder as a small brand. But it matters.\"\n\n\n\nREAD MORE Country couture showcases First Nations fashions\n\nQuiet confidence\n\nOn the eve of AFW, which opens this week at Sydney's Carriageworks, Page says she's feeling reflective.\n\n\n\n\n\nThe runway might be her debut solo show, but she says it represents much more: A quiet reshaping of who menswear is for, how it feels and what it can become.\n\n\n\n\n\n\"If someone wears something they wouldn't normally try, and they feel good in it, then that's the win.\n\n\n\n\n\n\"Confidence builds in those moments. That's what I want our clothes to do.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/mario-is-93-and-has-lived-with-prostate-cancer-for-30-years-he-puts-it-down-to-early-testing/qk1a156bv",
        "title": "Mario is 93 and has lived with prostate cancer for 30 years. He puts it down to early testing",
        "publish_date": "Sat, 10 May 2025 08:32:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nCroatian-born Mario Raspor is 93 years old.\n\n\n\n\n\nIt's been nearly 30 years since his doctor encouraged him to do a PSA (Prostate-Specific Antigen) blood test, which screens for early signs of prostate cancer.\n\n\n\n\n\n\"I said: 'I'm going to do the test and see what happens'. And that shows PSA was a bit high. Then I went on treatment, slowly.\"\n\n\n\n\n\nMr Raspor was diagnosed before the cancer had spread to other parts of the body - and he was able to avoid surgery.\n\n\n\n\n\n\"Well, I felt fear, of course I did. I'm not that strong, to ignore that. In the beginning was scary, of course. Because I heard from other people. Then I put myself in my head, that this is my life, I'm going to carry on as it comes and it goes. That's many years now, and I'm still here!\"\n\n\n\n\n\nHormone therapy now helps keep the cancer at bay, and he manages his side effects through exercise and a healthy lifestyle.\n\n\n\n\n\nWhile Mr Raspor was able to identify and treat the cancer at an early stage, research from Monash Rural Health, has found men from migrant backgrounds are much less likely to be diagnosed early.\n\n\n\n\n\nDr Eli Ristevski is the lead researcher on the project.\n\n\n\n\n\n\"Men from culturally and linguistically diverse backgrounds, particularly those who didn't speak English as a first language, had more advanced disease at diagnosis.\"\n\n\n\n\n\nThe study looked at data from nearly 26,000 Victorians diagnosed with prostate cancer between 2009 and 2022.\n\n\n\n\n\nIt found people born in non-English-speaking countries were 17 per cent more likely to be diagnosed with cancer at an advanced or high-risk stage.\n\n\n\n\n\nAnd those migrants who prefer to speak a language other than English were 54 per cent more likely to be diagnosed with advanced prostate cancer.\n\n\n\n\n\nDr Ristevski says there are multiple contributing factors, including language barriers and stigma.\n\n\n\n\n\n\"People can be worries about cancer, worried about what a cancer diagnosis means. There can be embarrassment and a lot of cultural factors like that as well. The tests have changed and cancer treatment has changed so much in the last 20 years, and is constantly changing. So people can sometimes hold on to old ideas about what's involved in screening; and if you are diagnosed, what your treatment might be.\"\n\n\n\n\n\nProstate cancer is the most common cancer affecting Australian men, with 1 in 6 diagnosed with prostate cancer by the age of 85.\n\n\n\n\n\nWhile it can be relatively easy to treat, urologist Dr Richard Savdie says early diagnosis is key to improving treatment options and chances of survival.\n\n\n\n\n\n\"Prostate cancer diagnosis starts with a simple PSA test, with your GP. And that is a blood test. And based on your blood test results, patients can then be referred on to a urologist for further testing. So if you diagnose prostate cancer at an early stage, your five-year survival approaches 100 per cent. If you're diagnosed with metastatic disease (advanced stage), your 5-year year survival drops dramatically to 32 per cent.\"\n\n\n\n\n\nDr Savdie says the research from Monash Rural Health in Victoria points to a consistent trend across the country when it comes to migrants accessing screening services.\n\n\n\n\n\n\"Communities in New South Wales and in all states and territories in Australia would be affected the same as this Victorian study is showing. And that's due to language barriers, health literacy and cultural fears around cancer diagnosis.\"\n\n\n\n\n\nDr Ristevski says new, culturally appropriate health education and communication programs are needed to ensure language and cultural background no longer impact chances of survival.\n\n\n\n\n\n\"By involving people from those communities within the development, design, implementation and also evaluation of those programs, you'll get better results.\"\n\n\n\n\n\nMr Raspor says while the diagnosis was initially a shock, the daily reality of living with and managing prostate cancer is not nearly as frightening.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/coalitions-quota-question-as-labor-swears-in-record-number-of-women/dgvvi54km",
        "title": "The Coalition's 'hard, fast' quota question as Labor swears in record number of women",
        "publish_date": "Sat, 10 May 2025 01:15:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "A record number of women helped Labor secure its landslide election win, raising questions around how the Coalition can boost its gender diversity.\n\n\n\n\n\nLabor women will outnumber men in the lower house for the first time, with more than 15 newly elected MPs contributing to the 51 of 92 seats polling firm Redbridge predicts for the major party so far.\n\n\n\n\n\nNew faces in parliament include Renee Coffey, representing Griffith after defeating the Greens' Max Chandler-Mather ; Jo Briskey, who succeeds former NDIS minister Bill Shorten in Maribyrnong; and Ash Ambihaipahar, who takes over Barton from former Indigenous Australians minister Linda Burney, who has retired.\n\n\n\n\n\nWomen's Minister Katy Gallagher told ABC's RN it's a testament to Labor's continued work towards gender equality over three decades, having introduced quotas in 1994.\n\n\n\n\n\n\"The thing about gender equality in the Labor Party is everyone in the caucus is for gender equality. That conversation or that argument has been won,\" Gallagher said on Wednesday.\n\n\n\nA record-breaking number of women have been elected to Australia's parliament, with a major share coming from Labor's ranks in the House of Representatives. Source: SBS News Labor MPs will join a historic 48th parliament with at least 68 women making up the lower house, an increase from 58 in 2022 and 40 under a Morrison-led government.\n\n\n\n\n\nHowever, that number could rise as high as 72 depending on the final results in Bean, Longman, and Monash.\n\n\n\n\n\nCatherine Hunter, CEO of the Diversity Council of Australia, told SBS News this election marked a major milestone for gender diversity in parliament, with diversity more broadly \"essential for a healthy democracy\".\n\n\n\n\n\n\"When people making decisions reflect the diversity of the Australian community, the policies they create are more likely to be more inclusive, more effective, and ultimately, fairer,\" she said.\n\n\n\n\n\nShe said lived experience is critical to making decisions, otherwise leaders risk \"overlooking or misunderstanding the realities facing huge sections of the population\".\n\n\n\n\n\nSo, how does Australia compare to the rest of the world?\n\n\n\nCoalition faces quota pressures as women representation drops\n\nWhile Labor's gender diversity continues to grow, the Coalition went backwards at this election.\n\n\n\n\n\nIt elected seven women MPs out of 40, a decrease from nine in 2022. It may be boosted slightly by Gisele Kapterian, if she retains the tightly contested seat of Bradfield in NSW.\n\n\n\n\n\nThis is due to Bridget Archer losing Bass and Jenny Ware losing Hughes, as well as men replacing retiring MPs Karen Andrews in McPherson and Nola Marino in Forrest.\n\n\n\n\n\nOf the 10 independents currently projected to enter parliament, seven are women.\n\n\n\n\n\nFormer Liberal frontbencher Simon Birmingham argues the Coalition should consider \"hard, fast and ambitious\" quotas for women in parliament, with representation so low.\n\n\n\n\n\n\"I struggle to think of any alternatives if there's to be a new direction that truly demonstrates change and truly guarantees that the party will better reflect the composition of modern society,\" he said in a post on LinkedIn.\n\n\n\n\n\nFormer Liberal NSW premier Barry O'Farrell said it is important that political parties reflect the community they represent, with more diversity both culturally and in terms of gender.\n\n\n\n\n\nPressed on women quotas specifically, he told SBS News the Liberals \"need to increase its diversity in all areas\".\n\n\n\nA record number of women will represent Australians in the federal parliament, a considerable uptick from the 58 women who were elected to the 47th parliament. Source: SBS News Michelle Ryan is the director of the Global Institute for Women's Leadership at The Australian National University.\n\n\n\n\n\nShe told SBS News that alongside quotas, the Coalition needs to consider where it's placing its women candidates, avoiding the glass cliff.\n\n\n\n\n\nThe glass cliff refers to women being given leadership opportunities during difficult times or times of crises, but in a political context, can refer to being placed in more difficult contests.\n\n\n\n\n\n\"We did an analysis last election and what we saw is that women are more likely than men to be placed in risky and precarious seats, so ones that are basically either unwinnable or difficult to win or hold,\" she said.\n\n\n\n\n\n\"They do differ by party as well. For the Coalition, women were much more likely to be in those unwinnable seats.\"\n\n\n\nSource: SBS News\n\nHow does Australia compare to the rest of the world?\n\nAustralia does \"pretty well relative to its comparators\", according to Ryan.\n\n\n\n\n\nShe said Scandinavian countries such as Finland, which has had three women prime ministers, and Switzerland, which has had five women presidents, often lead perceptions around gender diversity.\n\n\n\n\n\nHowever, parliaments like Rwanda, which in 2024 had 50 per cent representation, often surprise the public.\n\n\n\n\n\n\"So that's partly due to quotas. It's partly to do with genocide, where many men were killed. So the reasons for representation are often different,\" she said.\n\n\n\n\n\nShe said this includes the rise of women to head of state due to marriage or being the daughter of a previous prime minister.\n\n\n\n\n\nOther countries with at least half of their parliament or lower house made up of women include Cuba, Nicaragua, Andorra, Mexico and the United Arab Emirates, according to UN Women.\n\n\n\n\n\nUN Women calculates that globally, only 27.2 per cent of parliamentarians in single or lower houses are women, with monarchy-based systems excluded from the count.\n\n\n\n\n\nDespite a mammoth election year globally in 2024, 107 countries have yet to have a woman as the head of state.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-role-of-non-medical-interventions-in-managing-chronic-pain/p1ed6x4ws",
        "title": "INTERVIEW: The role of non-medical interventions in managing chronic pain",
        "publish_date": "Fri, 9 May 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/hysterectomy-the-word-that-fails-women-suffering-heavy-periods/4e36logjg",
        "title": "Hysterectomy: the word that fails women suffering heavy periods",
        "publish_date": "Fri, 9 May 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMenstruation can be disruptive for many, but for some women it can be crippling.\n\n\n\n\n\n\"I'd get out the door and I would flood to the point where I'd have to come back and change again. And I'd literally just sit down and cry and think, 'I can't do this anymore' Because it was ruining every aspect of my life.\"\n\n\n\n\n\nSixty-year-old Michelle Watts is recounting a ski trip - one of many occasions where she bled through layers of clothing.\n\n\n\n\n\nMichelle suffered from heavy menstrual bleeding for 18 months from 2021, which the Australian Commission on Safety and Quality in Healthcare defines as excessive menstrual blood loss that interferes with a woman's quality of life.\n\n\n\n\n\n\"I was about as sad as I could ever be because everything was, everything was impossible to do in my eyes by the end. I couldn't go swimming with my friends anymore, swimming became challenging, going to the gym became challenging. All those things that I loved to do, I just couldn't do.\"\n\n\n\n\n\nAfter many failed treatments, Michelle finally underwent a uterectomy, traditionally known as a hysterectomy.\n\n\n\n\n\nBut the original terminology for this procedure is causing concern among some specialists, due to its links to the Greek word 'hysteria'.\n\n\n\n\n\nDr Talat Uppal is a Gynaecologist and Director at Women's Health Road - and is in the process of changing the language.\n\n\n\n\n\n\"It was really thought to explain a lot of the concerns women might have had.... both on the emotional and physical front, which was actually not factual and not found to be correct.\"\n\n\n\n\n\nOne in four people who menstruate suffer from heavy menstrual bleeding, and two thirds of those experience iron deficiency.\n\n\n\n\n\nYet less than half of women suffering from the condition visit a doctor.\n\n\n\n\n\n\"Traditionally or historically women have been left out of research. And sometimes even the animals in the labs were male animals. And so this is a long historical background of disadvantage of not including women. And we really want to change that narrative when it comes to heavy bleeding.\"\n\n\n\n\n\nDr Uppal welcomes a number of measures in the government's multi-million dollar investment in women's health, but would like to see more attention given to this issue.\n\n\n\n\n\n\"I think it's just part of that silence around heavy menstrual bleeding... and I don't think it's deliberate, I feel it's just a culture where it's not front of mind.\"\n\n\n\n\n\nMichelle believes a lack of awareness is why she struggled to receive adequate care for months.\n\n\n\n\n\n\"It's just been so normalised....and I don't think it should be, I don't think it's normal. And it's really hard to get any information because it's just taken as 'well you're a woman, this is what happens.\"\n\n\n\n\n\nShe can't imagine what her life would have looked like without undergoing the procedure, now relishing the active lifestyle she was forced to sacrifice.\n\n\n\n\n\n\"My ability to participate in skiing, running, swimming... all of the things that I wanted to enjoy, that's all possible again, I never have to worry about that ever again, it's like an absolute new lease of life.\"\n\n\n\n\n\nIt's part of an international effort to make medical language more accurate.\n\n\n\n\n\nHelping lead the change is the CSIRO, who are responsible for updating global standards for clinical terminology.\n\n\n\n\n\nKatrina Ebril is the Interoperability Lead with the Australian e-Health research centre at the CSIRO, and says this change is a first when it comes to women's bodies.\n\n\n\n\n\n\"It's definitely time to change... and we do this for other procedures. And it is a uterectomy, let's call it what it is, and start to use that much more positive language and much more language that aligns to what the actual procedure is.\"\n\n\n\n\n\nFor women like Michelle, removing taboos around menstruation is key to making treatment more accessible, and encouraging others to seek help.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-connecting-migrants-with-employers/7em2dsdul",
        "title": "INTERVIEW: Connecting migrants with employers",
        "publish_date": "Fri, 9 May 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/relief-for-wallabies-star-as-scans-rule-out-spinal-fracture-20250511-p5ly6k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Relief for Wallabies star as scans rule out spinal fracture",
        "publish_date": "Sun, 11 May 2025 10:40:54 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Noah Lolesio has been cleared of a spinal fracture after a suffering a scary neck injury that saw him stretchered off the field and taken to Royal Perth Hospital on Saturday night.\n\nLolesio was taken from the field a neck brace after getting caught awkwardly in a ruck in the first half of the Brumbies’ 33-14 win over the Western Force at HBF Park. Attempting to clean out over fullback Tom Wright, Lolesio was pushed backwards by several Force players, and the full weight of halfback Henry Robertson landed on the back of Lolesio’s neck, with his chin pinned dangerously down on his chest.\n\nIn clear pain, the Wallabies no.10 was treated on field before being taken off amid concern he may have suffered a fracture in his spine.\n\n“He’s in the hospital at the moment, about to go in for scans. He’s got feeling, he’s got movement, it all looks very positive,” Larkham said post-game. “But obviously it was a very nasty injury.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/brumbies-win-super-derby-in-perth-but-lolesio-stretchered-off-with-spinal-injury-20250511-p5ly71.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brumbies win Super derby in Perth but Lolesio stretchered off with spinal injury",
        "publish_date": "Sun, 11 May 2025 09:58:44 +1000",
        "category": "sports",
        "authors": [
            "Darren Walton"
        ],
        "text": "A spinal injury to Wallabies flyhalf Noah Lolesio has overshadowed the ACT Brumbies’ surge to an all-important Super Rugby Pacific home play-off.\n\nLolesio was stretchered off wearing a neck brace, and in apparent extreme pain, midway through the first half of his Brumbies’ 33-14 derby win over the Western Force in Perth.\n\nThe Brumbies’ and incumbent Australian No.10 was twisted in an accidental off-the-ball play while trying to repel a Force attack on his goal line in the 20th minute of Saturday night’s derby.\n\nIt was initially unclear if Lolesio had suffered a back, hip or leg injury in the incident.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/sinner-wins-on-return-from-doping-ban-20250511-p5ly72.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sinner wins on return from doping ban",
        "publish_date": "Sun, 11 May 2025 09:58:33 +1000",
        "category": "sports",
        "authors": [],
        "text": "Sinner wins on return from doping ban\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/australian-players-may-refuse-to-return-if-ipl-resumes-20250511-p5ly6r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian players may refuse to return if IPL resumes",
        "publish_date": "Sun, 11 May 2025 09:57:44 +1000",
        "category": "sports",
        "authors": [
            "Scott Bailey"
        ],
        "text": "Australia’s cricketers are in a state of flux, uncertain whether the Indian Premier League will resume and some questioning if they will return.\n\nPlayers boarded flights out of India on Saturday, after the tournament was postponed on Friday due to the escalating conflict with Pakistan.\n\nAustralians featuring in the Pakistan Super League were also planning trips home, after plans to move the rest of that tournament to the UAE were abandoned.\n\nBut as players began making their exits with most on multi-leg flights, it emerged both tournaments could potentially resume after a ceasefire between the two countries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/why-a-multimillion-dollar-legal-boom-is-running-out-of-steam-20250411-p5lr2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why a multimillion-dollar legal boom is running out of steam",
        "publish_date": "Sun, 11 May 2025 09:50:09 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "In the Victorian Supreme Court, 16 cases were filed last year, compared with 21 cases in 2020 and 25 in 2014. Defamation reforms Defamation laws changed in most states and territories in July 2021, and again in July last year. A number of the reforms made it harder for plaintiffs to bring, and win, a lawsuit. This may have resulted in a drop in the number of cases filed in those jurisdictions, but other factors, including the high cost of litigation, are also likely to be relevant.\n\nWestern Australia has been a hold-out and has not passed any of the changes to defamation law that might have contributed to falling case numbers across the majority of the country. It has also seen a downturn in cases: 15 cases were filed in the WA Supreme Court last year compared with 28 to 30 cases in the preceding three years. However, new filings were relatively stable between 2016 and 2019, averaging 16 cases per year. Costly losses Among the other factors that may be discouraging would-be plaintiffs are the astronomical cost of litigation and high-profile court losses.\n\nTwo of the largest defamation cases in recent years, brought by former Special Air Service soldier Ben Roberts-Smith against The Age and The Sydney Morning Herald, and former federal Liberal staffer Bruce Lehrmann against Network Ten, were dismissed by the Federal Court. Both resulted in costs orders in the millions. But appeals have begun in both cases, and Roberts-Smith has sought to expand his appeal to introduce evidence of a “secret recording” involving Age and Herald investigative journalist Nick McKenzie. Australia mirrors UK University of Sydney Professor David Rolph, a defamation law expert, said it was “not surprising that from time to time there might be a downturn in defamation filings”. Defamation has been consistently popular across Australia over the long term, but “there are periods where it is more intensely litigated than others”, he said.\n\n“One observation that might be made, though, is from around 2020-2021 in jurisdictions that introduced stage one of the reforms ... there has been a decided decline. “This mirrors the decline in new claims in the UK after they introduced their 2013 Defamation Act. “Many of the reforms in [the UK law] were introduced in Australia, such as serious harm and the public interest defence. After reforms are introduced, it is to be expected that there will be a downturn in new filings. “One way to illustrate this is that filings in Western Australia, which to date has introduced none of the reforms, have remained consistently high, albeit with a significant drop-off in the last year.” As to the potential impact of recent court losses, Rolph said that “when prominent plaintiffs fail, that itself can have a chilling effect on other prominent plaintiffs suing for defamation”.\n\nSerious harm Under the serious harm requirement, a plaintiff must show an allegedly defamatory publication “has caused, or is likely to cause, serious harm” to their reputation to bring a claim. This was designed to discourage lower-level lawsuits, sometimes referred to as “backyard” claims. “Harm to reputation was previously presumed, which made it very easy for virtually anyone to sue for defamation,” Rolph said. Adding this new obstacle “may deter some claimants”, he said.\n\nA new procedural hurdle Rolph said a new requirement that a person suing for defamation issue a concerns notice before filing proceedings may also “act as a barrier”. A concerns notice sets out the allegedly defamatory statements at the heart of their claim. During a trial, a plaintiff “can’t rely on a statement they haven’t put in their concerns notice”. “The effect of this is to increase the costs of pre-trial steps because specialist practitioners would need to be engaged to draft concerns notices.” Western Australia",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/a-cricket-team-lost-ten-wickets-for-0-and-won-by-153-runs-20250511-p5ly6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A cricket team lost ten wickets for 0. And won by 163 runs",
        "publish_date": "Sun, 11 May 2025 09:40:55 +1000",
        "category": "sports",
        "authors": [],
        "text": "A tactical masterclass or a strategy that goes against the spirit of cricket? That is the debate after a bizarre situation occurred in a Women’s Twenty20 World Cup Asian qualifier.\n\nUnited Arab Emirates batters retired out en masse in an effort to end their match against Qatar quickly with rain threatening to halt play. With only one team progressing from the group, the UAE wanted to close out a win to keep qualification in their own hands.\n\nUAE reached 0-192 in 16 overs with captain Esha Oza making 113 off 55 balls before deciding to finish their innings early to avoid a washout.\n\nEnding an innings by declaration is not allowed in white-ball cricket, so every batter had to pad up and walk to the middle before retiring without facing a ball.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/star-studded-jamaicans-pipped-by-spain-20250511-p5ly6q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Star-studded Jamaicans pipped by Spain",
        "publish_date": "Sun, 11 May 2025 09:29:26 +1000",
        "category": "finance",
        "authors": [],
        "text": "Star-studded Jamaicans pipped by Spain\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-saturday-may-11-20250511-p5ly6d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Saturday May 11",
        "publish_date": "Sun, 11 May 2025 08:24:18 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Saturday May 11\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australian-cricketers-head-back-home-after-ipl-cancelled-amid-india-pakistan-conflict-20250511-p5ly64.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian cricketers head back home after IPL cancelled amid India-Pakistan conflict",
        "publish_date": "Sun, 11 May 2025 07:24:32 +1000",
        "category": "sports",
        "authors": [],
        "text": "Australian cricketers head back home after IPL cancelled amid India-Pakistan conflict\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/explosions-reported-hours-after-india-and-pakistan-reach-ceasefire-deal-20250511-p5ly63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Explosions reported hours after India and Pakistan reach ceasefire deal",
        "publish_date": "Sun, 11 May 2025 07:24:16 +1000",
        "category": "finance",
        "authors": [],
        "text": "Explosions reported hours after India and Pakistan reach ceasefire deal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/crows-stellar-mark-leaves-legends-raving-20250511-p5ly5y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Crow's stellar mark leaves legends raving",
        "publish_date": "Sun, 11 May 2025 06:53:57 +1000",
        "category": "finance",
        "authors": [],
        "text": "Crow's stellar mark leaves legends raving\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/payten-fumes-at-white-noise-over-officiating-20250511-p5ly5x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Payten fumes at 'white noise' over officiating",
        "publish_date": "Sun, 11 May 2025 06:49:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Payten fumes at 'white noise' over officiating\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/tradies-incredible-property-transformation-in-just-five-weeks-80000-profit-062508887.html",
        "title": "Tradie's incredible property transformation in just five weeks: '$80,000 profit'",
        "publish_date": "2025-05-10T06:25:08Z",
        "category": "finance",
        "authors": [],
        "text": "Sam described the $500,000 property as 'horrible' when he purchased it. Just five weeks later, it's completely unrecognisable.\n\nWhen Sam Harper walked through the front door of his newest property flip project, he admitted feeling a little \"scared\". With broken windows, blackened ceilings and asbestos-infested walls, the home in one of Perth's up-and-coming eastern suburbs needed a complete gut.\n\nWhile most young Aussies around the country are grappling with how they'll get onto the property ladder, 27-year-old Sam is busy finishing off his fourth property renovation project in just two years.\n\nAfter five weeks and nearly $60,000 injected into the Koondoola home, the self-professed property flipper couldn't be more proud of what he and his team had done with the place.\n\nSam, a former tradie from Victoria, told Yahoo, \"like most young blokes\", he wasn't sure what to do after finishing high school, so jumped straight into an electrician apprenticeship. But after nearly 10 years in the industry, he knew it was never something he was passionate about.\n\nADVERTISEMENT\n\n\"That quickly becomes a bit of a burden,\" he said. \"I had the realisation if I don't go for something I actually want, I might get myself stuck doing something I don't want to be doing.\"\n\nAfter travelling the country with his partner, the pair settled down in Perth and bought their first home two years ago. He jumped into a course to become a buyer's agent with the hopes of learning the ropes of property investing, but in doing so quickly discovered \"I'd trap myself with more debt in a job I didn't want to be in,\" he explained.\n\nThat's when he started delving into the world of property flipping. \"I knew it was a big thing in other countries, but not done as much in Australia,\" he said.\n\nLast January, Sam and his partner used their full-time salaries to buy a home to live in and renovate on the side. After nearly five months, Sam said the equity wasn't quite enough to start flipping more properties, so he used \"private investor funds\" to help get the first few property flips off the ground.\n\nThe Koondoola property has been 'completely gutted' in the inside and is now unrecognisable. Source: Professionals\n\n'Scary' Perth house with $195,000 upside\n\nSam's most recent project in Koondoola, an eastern suburb of Perth, is his proudest achievement to date. He said he was \"genuinely scared\" to enter the property after purchasing it. He described the condition as \"horrible\".\n\nADVERTISEMENT\n\n\"It was a nice family home for years,\" he explained. But after several years of neglect, it was left looking a little worse for wear.\n\nThe house required a complete gutting. \"Kitchens ripped out and put back together, bathroom ripped out and put back together, there was asbestos in the kitchen and the bathroom so when we were demolishing we had to get it all done properly,\" he said.\n\nWallpaper had to be removed, holes in the walls patched up, along with repainting, reflooring and \"full landscaping\". Sam and his team placed new grass and reticulation in the backyard, painted the outdoor \"bunker\" — a former wine cellar, and painted the patio. He estimates the entire cost of the project was about $60,000.\n\nThe property, purchased in February of this year for $500,000 is now listed for $695,000 — with Sam estimating that his profit before tax will be around $80,000. Remarkably, it took just five weeks. \"It's a pretty quick turnaround,\" he concedes.\n\nSam's strategy to property flipping success\n\nSo what is Sam's secret to success? Buying properties no one else will touch.\n\nADVERTISEMENT\n\n\"The ones I've done have been in horrible condition,\" he said. \"Otherwise it can be a challenge to pick them up. Though in saying that, there are opportunities everywhere.\"\n\nSo far, he's done projects within a 30-minute radius of his home in areas that have a cheaper price point.\n\n\"I'm mainly looking at fundamentals where there is heaps of opportunity to find deals,\" he said.\n\nWhile a background in the trades has definitely helped Sam, he thinks you learn more \"when you get your hands dirty\".\n\n\"I've worked alongside many other trades which has given me an idea of how things happen, but there are plenty of people still doing this that don't have a trade background and are successful,\" he said.\n\nSam's message to young Aussies trying to get on property ladder\n\nIncredibly, Sam was able to make property flipping his full-time gig through his business Harpers House Flipping after less than two years.\n\nADVERTISEMENT\n\n\"Only six months ago I was still wearing high vis doing something that I didn't love,\" he said. \"It wasn't going to get me and my family where we wanted to go. I had no idea if it was going to work out but I didn't let fear get in the way. I trusted I was going to figure it out.\"\n\nHis plan eventually is to build enough capital to buy properties to hold for the long term.\n\nWhile many young Aussies will tell you the property market is simply too hard to get into, Sam argues that a \"mindset shift\" needs to take place. \"If you focus on the problem, that's all you'll see.\n\n\"My mindset is always looking for opportunity,\" he said. \"Anyone who achieves anything great in their life will have the mindset of 'I'll find a way', and they usually do.\"\n\n\"At the start it was quite scary, but I want people to know that you don’t have to be anything special to go out there and chase what you want to chase, and create a better life.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/coles-shopper-makes-disgusting-discovery-in-common-product-i-feel-violently-ill-055117338.html",
        "title": "Coles shopper makes 'disgusting' discovery in common product: 'I feel violently ill'",
        "publish_date": "2025-05-10T05:51:17Z",
        "category": "finance",
        "authors": [],
        "text": "After finishing all the juice, Naomi was surprised to feel something moving around when she shook the empty bottle.\n\nColes shopper Naomi instantly felt sick after finding out what was hiding inside her bottle of lime juice. Source: TikTok/@naomibrosnan/Getty\n\nA woman trying to enjoy a healthy evening snack has been left feeling “violently ill” after making a stomach-churning discovery in one of her ingredients bought from Coles.\n\nNaomi said she eats frozen grapes with a little bit of lime juice over them every night, and finally came to the end of her Coles-branded lime juice this week — or so she thought.\n\nWhile there was no more juice in the bottle, she could feel something solid sliding around inside the empty container. Out of curiosity, she cut the bottle open.\n\nNaomi told Yahoo News she felt \"disgusted\" by the sight. In a video shared online, she turned the camera to her bathroom sink to show a fleshy-looking mass that had come out of the bottle.\n\nADVERTISEMENT\n\n\"It honestly turned me and my partner's stomach especially not knowing what it is,\" she said.\n\nShe said the lime juice wasn’t due to expire until December, and consumed the bottle within two weeks — well within the six-week guideline.\n\nSlimy blob in Coles juice bottle horrifies Aussies\n\nHer disgust was mirrored by her viewers, who were shocked and disturbed at the sight of the slimy lump.\n\n“What on Earth?” one woman asked.\n\n“Mouse placenta obviously,” another joked.\n\nAnother person said the exact same thing happened to her only two nights before with the same bottle of lime juice.\n\nThe slimy blob is believed to be a 'scoby', a live culture of bacteria and yeast. Source: tiktok.com/@naomibrosnan\n\nSeveral viewers suggested it could be a ‘SCOBY’ – Symbiotic Culture of Bacteria and Yeast – and as it turns out they are likely correct.\n\nScoby's form during fermentation and can have a thick, rubbery, jelly-like appearance. They’re crucial to kombucha brewing, as they turn the sweet tea into an effervescent drink.\n\nADVERTISEMENT\n\nWhile they look gross, they’re usually not harmful. Still, that didn’t stop Naomi from swearing off limes for the foreseeable future.\n\nColes responds to bizarre find\n\nNaomi said she has been in contact with Coles, who are in the process of investigating.\n\nA Coles spokesperson told Yahoo News they are transitioning their lime juice bottles from opaque packaging to transparent — but it's not because of scobys. Their lemon juice bottles have already undergone the change, which will make the cartons recyclable.\n\n\"At Coles, we take pride in providing our customers with great quality and value everyday. If a product doesn’t meet our customers' expectations, we encourage them to bring it back into store so we can provide a refund or replacement,\" the spokesperson said.\n\n\"We have transitioned the packaging of our Coles Lemon Juice 250mL and 500mL from opaque bottles to transparent bottles, making them kerbside recyclable.\n\nADVERTISEMENT\n\n\"At Coles, we are committed to reducing unnecessary and problematic plastic in our packaging, with more initiatives to follow including the transition of Coles Lime Juice 250mL to transparent bottles that are kerbside recyclable in the coming weeks.”\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]