[
  {
    "url": "https://www.9news.com.au/world/breathtaking-images-show-what-working-as-a-scientist-can-look-like/5b5c591f-3a1e-494b-a425-041714d1ca69",
    "title": "Stunning photography shows what working as a scientist can look like",
    "publish_date": "Fri, 16 May 2025 21:36:59 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 7 Attribution: Aman Chokshi/Dagmara Wojtanowicz\n\nThe Scientist At Work competition is now in its sixth year and invites Nature﻿ readers to capture the colourful work that scientists do around the world.\n\nSix winners were revealed and one was deemed the overall winner.﻿\n\nThe winners were selected by a jury of Nature staff.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/government-pushes-for-wage-increase-for-millions-of-workers/3eb5a514-55ca-4820-9781-4515a14ad500",
    "title": "Push for three million workers to get a pay rise above inflation",
    "publish_date": "Fri, 16 May 2025 09:27:10 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "The federal government is pushing the Fair Work Commission to deliver pay rises for almost three million workers to catch up with inflation price rises.\n\nThe Australian Government made a submission today to the annual wage review, recommending that \"the Commission award an economically sustainable real wage increase to Australia's award workers\".\n\n\"This is all about ensuring that three million Australians can get the decent pay that they need and deserve to provide for their loved ones,\" Treasurer Jim Chalmers said.\n\nREAD MORE: US basketballer could face death penalty after arrest in Indonesia\n\n\"This is all about ensuring that three million Australians can get the decent pay that they need and deserve to provide for their loved ones,\" Treasurer Jim Chalmers said. (Nine)\n\nThe government also argued that economic conditions had \"turned a corner,\" making it safe to increase wages, with inflation moving into the target range set by the Reserve Bank of Australia.\n\nThey said that along with low unemployment figures released yesterday, interest rates were falling.\n\n\"Low-paid workers and their families are particularly affected by cost-of-living pressures, because they typically have limited liquid asset buffers to draw on to cover rising costs and they are less able to deal with unexpected expenses,\" the government said.\n\nThe government also said this increase would help narrow the gender pay gap, which currently sits at 11.9 per cent on weekly wages.\n\nBut business groups say it's not just workers who are doing it tough.\n\n\"It's very easy for a politician in Canberra to decree that there should be higher salaries and higher wages,\" Council of Small Business Organisations spokesperson Luke Acherstraat said.\n\n\"But who foots the bill? It's small businesses, the mums and dads, many of whom are struggling.\n\n\"Small businesses will need to pass these costs on.\"\n\nREAD MORE: Police officer allegedly stabbed with screwdriver\n\n\"It's very easy for a politician in Canberra to decree that there should be higher salaries and higher wages,\" Council of Small Business Organisations spokesperson Luke Acherstraat said. (Nine)\n\n﻿Economists say any wage increases need to come with better productivity, or it could push prices up.\n\n\"Any wage growth that is significantly in excess of growth of labour productivity will lead to higher inflation and probably higher unemployment as a result, neither of which are things that we want to see,\" Economist Saul Eslake said.\n\nAustralia's productivity has been sluggish in recent years, worry economists about the nation's future prospects.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/driver-avoids-jail-after-mates-drowned-in-flooded-creek/e156988c-c408-413f-b1dd-5a2db3c20957",
    "title": "Driver avoids jail after his two mates drowned in flooded NSW creek",
    "publish_date": "Fri, 16 May 2025 07:06:38 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A father-of-five who decided to drive through a flooded creek causing his two friends to drown has avoided being sent to jail.\n\nDistrict Court Judge Julia Baly, sitting in Newcastle , said Jawad Al Hussein, 43, had miscalculated the risks when he drove his Mitsubishi Triton ute into the floodwaters as his two friends stood on its tray with a German shepherd dog.\n\nAl Hussein managed to drive two metres before the ute stalled, and he felt the vehicle moving to the left and he lost control.\n\nSydney fathers Bob Chahine and Ghosn Ghosn died in floodwaters in 2022. (Supplied)\n\nHis two friends could not swim and they either fell or jumped from the ute as it was swept downstream by the fast-moving waters.\n\nTheir bodies were found days later having been carried up to two kilometres from the Preston Creek causeway near Goulburn in southern NSW.\n\n\"To my mind, the risks were very obvious,\" Judge Baly said today when sentencing Al Hussein to a 10-month intensive corrections order, 350 hours of community service and two years' disqualification from driving.\n\nAn ICO is considered by the courts to be a prison sentence served in the community under strict supervision.\n\n\"It was dark, the weather was bad, some roads were closed, it had been raining, at times heavily, the causeway was flooded and the water was flowing.\n\n\"Mr Al Hussein had not drunk alcohol or used drugs and he must have been alive to these conditions. He proceeded notwithstanding these obvious and significant risks.\"\n\nThe judge said, in her view, Al Hussein had been overconfident in the ute and his own ability to navigate the situation.\n\n\"Further, it was highly negligent to have two passengers on the tray of the ute knowing that they could not swim and would be directly exposed to the elements.\"\n\nJudge Baly said there had been no rush to cross the causeway to get to Al Hussein's hobby farm a few minutes away when he decided to drive into the floodwaters.\n\n\"The offender was not exercising the degree of care that a reasonable and prudent driver would have exercised in the conditions that prevailed.\"\n\nAl Hussein pleaded guilty to two counts of negligent driving causing the deaths of his friends, Ghosn Ghosn, 30, and Bob Chahine, 32 , on the night of October 31, 2022.\n\nHe had been found not guilty of manslaughter and dangerous driving causing the deaths after a trial in Goulburn District Court in February.\n\nThe judge said Al Hussein was completely devastated and deeply remorseful over the deaths of his two friends and would have to live with what he had done for the rest of his life.\n\nAl Hussein and another man who were in the cab of the ute were able to escape through the car windows and swim to safety before watching their terrified friends disappear into the darkness.\n\nAl Hussein walked for almost an hour trying to get phone reception after the accident before calling triple zero pleading for help.\n\n\"Please help, please help. There's two people dying,\" he told the operator.\n\n\"They went. They're gone. We lost them. I wish we could see them.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/bruce-springsteen-scathing-remarks-donald-trump-administration-on-stage-uk-concert/b32fb3c5-ae6d-494e-9b82-821a1605c702",
    "title": "Rock legend slams Trump in scathing on-stage comments",
    "publish_date": "Thu, 15 May 2025 17:04:29 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader \"unfit\" for office.\n\n\"The mighty E Street Band is here tonight to call upon the righteous power of art, of music, of rock n' roll in dangerous times,\" Springsteen said at the beginning of a concert in Manchester, northern England, on Wednesday (Thursday AEST).\n\n\"In my home, the America I love — the America I've written about that has been a beacon of hope and liberty for 250 years — is currently in the hands of a corrupt, incompetent and treasonous administration,\" he said.\n\nBruce Springsteen on stage in Manchester on Wednesday. (Shirlaine Forrest/Getty Images via CNN Newsource)\n\n\"Tonight, we ask all who believe in democracy and the best of our American spirit to rise with us, raise your voices against authoritarianism,\" added Springsteen.\n\nThe rock star spoke out several times during the show, later posting clips of his comments to his Instagram account.\n\n\"The last check on power, after the checks and balances of government have failed, are the people — you and me. It's in the union of people around a common set of values. Now that's all that stands between democracy and authoritarianism. So at the end of the day, all we've really got is each other,\" he continued.\n\nHe later criticised some of the US administration's most recent policies.\n\n\"In America, the richest men are taking satisfaction in abandoning the world's poorest children to sickness and death. This is happening now,\" he said.\n\nBruce Springsteen performs during the first night of his 'The Land of Hopes and Dreams' tour at Co-op Live on May 14, 2025 in Manchester, England. (Shirlaine Forrest/Getty Images)\n\n\"In my country, they are taking sadistic pleasure in the pain that they inflict on loyal American workers, they're rolling back historic civil rights legislation that led to a more just and plural society,\" he said.\n\n\"They're abandoning our great allies and siding with dictators against those struggling for their freedom. They're defunding American universities that won't bow down to their ideological demands. They're removing residents off American streets, and without due process of law, are deporting them to foreign detention centers and prisons. This is all happening now,\" added Springsteen.\n\nThe singer also criticised US lawmakers for failing to protect the American people from what he called \"an unfit president and a rogue government,\" and having \"no concern or idea of what it means to be deeply American\".\n\n\"The America that I've sung to you about for 50 years is real and, regardless of its faults, is a great country with a great people, so will survive this moment,\" said Springsteen.\n\nThe Manchester show was the first on the European leg of Springsteen and the E Street Band's Land of Hope and Dreams tour, which will also take in dates in France, Germany, Spain, Italy and the Czech Republic.\n\nSpringsteen previously criticised Trump and urged Americans to vote for Kamala Harris at a campaign rally for the Democratic candidate last year.\n\nHis criticism of Trump comes after Hollywood star Robert De Niro took aim at the US president at the Cannes Film Festival on Tuesday.\n\n\"In my country, we are fighting like hell for the democracy we once took for granted,\" said De Niro.\n\nRobert De Niro accepts the honorary Palme d'Or onstage during the opening ceremony at the 78th annual Cannes Film Festival at the Palais de Festival on May 13, 2025 in Cannes, France (Andreas Rentz/Getty Images)\n\n\"That affects all of us here, because the arts are democratic, art is inclusive and brings people together, like tonight. Art looks for truth. Art embraces diversity, and that's why art is a threat,\" added De Niro, who is an outspoken critic of the US president.\n\n\"That's why we are a threat to autocrats and fascists,\" he added.\n\nDe Niro ended his speech with a call for people to stand up to Trump \"without violence, but with great passion and determination.\"\n\n\"It's time for everyone who cares about liberty to organise, to protest and when there are elections, of course, to vote. Vote,\" the actor added.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/afl-indigenous-round-guernsey-geelong-designed-in-wa/105287816",
    "title": "Geelong's new Indigenous round guernsey travels 3,000km from WA",
    "publish_date": "Sat, 17 May 2025 01:29:22 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Geelong Cats will don a guernsey with northern West Australian flair when they run out for the AFL's annual Sir Doug Nicholls Round.\n\nThe design on Geelong's Indigenous guernsey was a collaboration with the team's mature-age recruit Lawson Humphries and his family, who originate in the Pilbara, 3,000 kilometres from Geelong's home ground.\n\nHumphries' younger sister and Worrora, Oomiday and Nyul Nyul artist, Meeza Humphries, said taking the lead on the design was a dream come true.\n\n\"We'd always been involved in footy, so it was always a dream,\" she said.\n\n\" I've always loved the Indigenous round, and I really wanted to represent my mob and tell a story. \"\n\nThe design incorporates well-known elements of the Geelong jumper and cultural images from the Humphries' country.\n\nEach of the hoops on the Geelong guernsey were designed by one of the Humphries siblings. (Supplied: Meeza Humphries)\n\nFamily affair\n\nHumphries and his three siblings turned Geelong's navy-blue hoops into an aspect of their traditional environment.\n\nMeeza said it was incredible not only to work with Lawson, but also with older siblings Stephanie and Joshua.\n\n\"It's really special because [they're] much older, so they have a bit more knowledge than me and Lawson,\" she said.\n\n\" It's helpful that not only can we express how we know stories, but we can also hear them, and we've actually learned more stories through this process. \"\n\nRoss Humphries, Lawson and Meeza's father, said he was proud to see the siblings collaborating.\n\n\"Everybody played their little part … it was a lot of work, and to do it as a family is a really great experience,\" he said.\n\nRoss said feedback on the jumper had been \"pretty positive\" so far, and he hoped to see the design make it to the North West.\n\n\"I hope I see kids across the Pilbara and Kimberley running around in the jumper,\" he said.\n\nMeeza said colour choices were designed to reflect their vibrant upbringing — from bright turquoise waters to vivid red dirt.\n\nThe guernsey also features the Oongood — a snake representing Humphries' journey to the AFL from WA's north.\n\nMeeza said the guernsey had already made an impact.\n\n\"I have a friend from Broome that lives in Geelong now — she contacted me and said, 'Thanks for making Geelong a bit more like home',\" she said.\n\nLoading Instagram content\n\nMeeza will travel to the ground in Adelaide to explain the significance of the guernsey to the playing squad, and then watch her handiwork on the field when Geelong take on Yartapuulti (Port Adelaide) in the AFL tonight.\n\n\"It's pretty surreal,\" she said.\n\n\"It's a bit crazy when you think about it, but I'm very proud of everyone involved.\"\n\nFrom the Kimberley to Kardinia Park\n\nHumphries, now in his second year in the AFL, has had a humble beginning to his AFL career.\n\nThe defender was the second last pick in the 2023 National Draft — somewhat a surprise pick that came less than two months after playing in the WAFL Reserves grand final.\n\nHumphries debuted for the Cats in round 16 the following year, wearing another one-off guernsey.\n\nThat jumper featured his junior club logo — the Wickham Wolves from WA's Pilbara — for Geelong's annual country round.\n\nIf selected, Humphries will run out this weekend for his 20th game for the club — which includes playing in two matches in the 2024 finals series.\n\n\"Lawson was out last week with concussion, but he'll be back this week,\" his father Ross said.\n\n\"So it's fantastic because he gets to wear the jumper that he helped create.\"\n\nMeeza says she \"couldn't be prouder\" of her big brother. (Supplied: Meeza Humphries)\n\nMeeza said it was incredible seeing her big brother play on the big stage.\n\n\"It's pretty crazy to me — he's just my brother,\" she said.\n\n\"I know he's getting famous now, but he's still the same old Lawson Humphries to me.\"\n\nBut she said she could not be any prouder.\n\n\"I always believed he'd make it to the AFL,\" Meeza said.\n\n\"I'm so proud of how he's taken it on — he was drafted as a mature-ager, but that didn't stop him, he's put in all the work and definitely deserves to be there.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/mccrae-landslide-inquiry-safety-water-damage/105298634",
    "title": "The collapse of a multi-million-dollar home shocked many. But clues may have bubbled up for weeks",
    "publish_date": "Sat, 17 May 2025 01:05:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Brett Cooper was used to the sound of water flushing through the stormwater system that flanked his home.\n\nBut the noise just before Christmas was different.\n\nThere had been no significant rainfall, but the usual trickle was surging with a jet engine's roar.\n\nMr Cooper followed mysterious water leaks near his home all the way to a muddy area next to a highway. (ABC News: Danielle Bonica)\n\nMr Cooper was convinced something was wrong once he found multiple signs of water leakage through his neighbourhood. (ABC News: Danielle Bonica)\n\nMysterious water leaks were also drawing attention — disintegrating asphalt and turning nature strips into swamps in the streets around his hillside neighbourhood.\n\nMr Cooper's curiosity about the source of the water eventually led him to a grated stormwater pit by a nearby highway.\n\nBrett Cooper noticed water flushing through the stormwater system in the hillside suburb of McCrae. (ABC News: Danielle Bonica)\n\nAs he stepped into the vegetated area, he immediately noticed something odd — the ground was so saturated, his shoes sunk into mud.\n\n\"At that point, I was sure something was very wrong,\" he said this week.\n\nMr Cooper never expected to detail these experiences to a room full of lawyers presiding over a high-level inquiry ordered by the Victorian government.\n\nBut he faced nearly 300 questions about them this week, as the inquiry probed a January landslide that destroyed one multi-million-dollar property and raised serious questions about the safety of its hillside neighbourhood.\n\nBrett Cooper never expected to have to tell his discoveries of McCrae's water leakage issues to a room full of lawyers. (ABC News: Danielle Bonica)\n\nHomes ruined in wake of disaster\n\nOver days of hearings, the inquiry shone a light on a series of landslides in McCrae on Victoria's Mornington Peninsula.\n\nTwo landslides in November 2022 came a day or so after 80 millimetres of rain had soaked the area.\n\nBut it had been a hot and dry summer when on the evening of January 5 this year, Kellie Moran heard a loud rumbling just outside her family's beloved holiday home.\n\nThe Moran family's home was destroyed in the January landslide. (McCrae Inquiry)\n\nUp to 25 tonnes of material slammed into the dwelling after coming loose from the escarpment — or slope — uphill.\n\n\"That was when we noticed greenery, like a tree I suppose, outside the living room window,\" Ms Moran told the inquiry this week.\n\n\"The laundry had sort of been pushed across the hallway.\n\nThe Morans told the landslide inquiry of the mental and financial toll the disaster took on them. (McCrae Inquiry)\n\n\"The laundry door, cupboards in the laundry had come through the wall and we couldn't get access to that end of the house anymore.\"\n\nMrs Moran and her daughter, who was standing in the hallway moments earlier, left nothing to chance and fled.\n\nWhen an engineer inspected the disfigured home in the days that followed, he noticed a steady flow of water coming out of the escarpment — about 200 millilitres every second.\n\nLoading...\n\nA major landslide obliterated the home on January 14, less than two years after they purchased the property for more than $2 million, and seriously injured a council building surveyor who was in the property at the time.\n\nThe Morans were among several McCrae residents to tell the inquiry about the significant mental, financial and emotional toll the landslides had taken.\n\nPaul and Denise Willigenburg have barely returned to their neighbouring home since an engineering assessment in 2022 found their lives could be at risk.\n\nPaul and Denise Willigenburg have had to move twice due to landslides. (Supplied: Paul Willigenburg)\n\nAs proposed stabilisation works stalled in May 2023, Mr Willigenburg told the inquiry, the couple was at one point told their insurers would not cover the cost of their temporary rental (a decision that was later overturned).\n\nEarlier this year, they were briefly allowed back into their home and found it ransacked. Jewellery, watches and a laptop were gone.\n\nEight properties remain in an exclusion zone established in January.\n\nParts of McCrae remain fenced off. (ABC News: Danielle Bonica)\n\n22 Olympic swimming pools' worth of water\n\nWhen Kevin Hutchings heard bystanders discussing \"water up the road\" immediately after the January 14 landslide, he went to see the potholes and puddles himself.\n\nSigns of water damage in McCrae early this year. (McCrae Inquiry)\n\nA former managing director of the local water authority, he didn't stop there.\n\nWorking with an experienced local plumber, John Bolch, on behalf of affected home owners, he visited dams and drains, looked at water flows.\n\nAfter they discovered a potentially burst water main, the pair calculated how much water may have flowed from the site in the five weeks before it was repaired at the end of 2024.\n\nThe figure they produced, reviewed by an engineer, was 54.7 million litres — or 22 Olympic swimming pools.\n\nThis photo shows a burst water main site at McCrae. Surrounding fallen trees indicate saturation underground. (McCrae Inquiry)\n\nMr Bolch told the inquiry he believed the saturated ground and trench line became \"basically the highway for the water\".\n\nA geotechnical expert the pair briefed theorised that underground water travelled through the area's natural contours, accumulating \"over many weeks, leading up to the January landslides\".\n\nIn a community update after the landslide, South East Water said it began investigating the leaks in November 2024, and water samples indicated the water was not from its network.\n\nMap of the area surrounding the landslide created by geotechnical company CivilTest. (McCrae Inquiry)\n\nSouth East Water managing director Lara Olson said the organisation was reviewing its \"full leak process including the alarms … and including the process that we usually go through\".\n\n\"We were using our standard practices that had worked previously,\" she said.\n\n\"When I read through the records about what's happened you can see there's a conclusion made using those practices or discussions where our team members conclude that its not our asset that it's ground water or something else.\"\n\nInquiry to report next month\n\nThe burst water main theory is just one of five potential factors the inquiry will consider before it reports next month.\n\nOthers included a natural spring, stormwater drainage, the removal of vegetation at the property immediately uphill of the January landslides and building works in that area.\n\nGerry Borghesi, who owns the home just uphill of the landslide, told the inquiry some trees on his property were significantly trimmed and one removed in 2021.\n\nHe also detailed the installation of two retaining walls in his garden, telling the inquiry a planning permit was not required for the first in 2020 because it was less than 1 metre tall.\n\nThe Penny Lane, McCrae property that fell down the hill as it was pictured when listed for sale in February 2023. (Supplied)\n\nUnder questioning from a Mornington Peninsula Shire lawyer on Thursday, Mr Borghesi admitted he did not apply for a building permit or advise the council of a second, taller wall installed in January 2024, because the height of the retained soil wasn't being changed.\n\nThe lawyer asked the home owner about a number of authorised works at the home.\n\n\"In the course of any of the work that you've done, did you ever seek a report from a geotechnical engineer as to the cumulative impacts of the works on your property to better inform you in relation to any more work you were proposing?\" the lawyer asked.\n\n\"No,\" Mr Borghesi replied.\n\nThe inquiry also heard there was no erosion management overlay over the area — a council planning tool that can restrict works in landslide-prone areas — despite it previously being identified as high-risk.\n\nA house slid down a hill and collided with two others in McCrae in January. (Supplied)\n\nThe inquiry has heard how a woman narrowly avoided major injury because of destruction caused by the landslip. (Supplied: Tanina Osborne)\n\nA 2018 review recommended updating the overlays, the inquiry heard, but by 2023 the work still hadn't been funded or carried out.\n\nCouncil staff said they nonetheless imposed additional controls on works in high-risk zones.\n\nMr Borghesi, who is in a VCAT dispute with the council over the 2022 landslide, was one of several residents who spoke of difficulty getting information out of South East Water and sometimes the council.\n\nLandslide risk specialist Darren Paul told the inquiry that a change in underground water pressure was almost certainly a factor in the landslides earlier this year.\n\n\"Water would almost certainly be the trigger,\" he said.\n\n\"A line of inquiry is what might the source of water be.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/us-pga-championship-cam-davis-jhonattan-vegas/105304844",
    "title": "Davis slumps at PGA Championship, Vegas leads after second round",
    "publish_date": "Sat, 17 May 2025 00:43:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Cam Davis has fallen off the pace with a disappointing second round at the PGA Championship at Quail Hollow in Charlotte, North Carolina.\n\nDavis was two shots off the lead at 5-under-par after his first round but followed up with a 3-over 74.\n\nHe sits in a share of 27th place at 2-under through 36 holes, six strokes behind the leader, Venezuela's Jhonattan Vegas.\n\nDavis's compatriot Adam Scott is also at 2-under, having fired an even-par 71 in the second round.\n\nElvis Smylie (73) made the cut at 1-over in his US major championship debut, but fellow Australians Jason Day, Cam Smith, Min Woo Lee and Karl Vilips all failed to do so.\n\nVegas maintained his overnight lead, despite a last-hole double-bogey.\n\nHe had been on course to enjoy a substantial halfway lead when he came to the last hole in his second round with a four-shot advantage over the field.\n\nBut that was soon halved after he made a mess of a bunker shot at 18 and then missed a putt to finish with a second-round 70, to go with his brilliant opening 7-under 64.\n\nJhonattan Vegas leads the tournament by two strokes. (Getty Images: David Cannon)\n\nVegas leads at 8-under, two shots ahead of Frenchman Matthieu Pavon (65), England's Matt Fitzpatrick (68) and South Korean Kim Si-woo (64), who managed a hole-in-one on the sixth.\n\n\"I can't really get to down on myself for making a double on 18, even though I wish I didn't make that,\" Vegas said.\n\n\"I just have to remember the good stuff and keep it up for two more days.\"\n\nWorld number one Scottie Scheffler (68) was tied for fifth place on 5-under.\n\nUS Open champion Bryson DeChambeau had a 3-under 68 but capped his day with a disappointing bogey that left him five shots behind Vegas.\n\nMasters winner Rory McIlroy (69) survived to make the cut at 1-over, as did defending champion Xander Schauffele (71).\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/burswood-street-motorsport-circuit-divides-opinion/105298432",
    "title": "How 'Rita's racetrack' is dividing opinion in Perth",
    "publish_date": "Sat, 17 May 2025 00:32:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "The WA government is ploughing ahead with its controversial $217 million plan to build a street motorsport circuit in Perth's Burswood Park, but don't dare call it a motorplex.\n\nThat was the sentiment from Thursday's announcement that the consultation process was opening for one of the government's biggest election promises.\n\nThere are differing opinions about the project, but the state government believes all are crystal clear on one thing.\n\n\"It's not a motorplex. It's not a motorplex at all,\" deputy Premier Rita Saffioti said on Thursday.\n\n\"It's a sports and entertainment precinct that will help drive activity and create new opportunities to host events into the future.\"\n\nRita's racetrack\n\nDubbed \"Rita's racetrack\" by some, the project has drawn the ire of locals worried about noise from the track and the environmental impact of construction.\n\nThere had initially been strong messaging about the boon the racetrack and motorsport facilities would be for tourism in WA, with Premier Roger Cook arriving at the first media event for the plan in a V8 supercar.\n\nWA Premier Roger Cook appeared in a racing car when the government announced its plan to build the facility. (ABC News)\n\nBut as the project officially enters the community and stakeholder consultation phase, proponents have pivoted to focus on spruiking the facility's multipurpose potential.\n\n'All spin': Zempilas hits out at WA govt's 'retro-fitted' race track plan Photo shows Motorsport Street Circuit flyer The WA government is forging ahead with a controversial racetrack project in Perth's Burswood Park amid firm resistance from residents, the local council and the opposition.\n\nIt's these elements — including a large amphitheatre for live music and a building for other sporting and community events — that locals have no qualms about.\n\nAlong with the WA Sportscar Club, Mr Cook was flanked by representatives of the WA Association of Musica and West Cycle for this week's update on the project.\n\n\"When complete, Burswood Park will be host to more major sporting events, more live music, and importantly, more community functions, creating an entertainment hub,\" Mr Cook said on Thursday.\n\nParts of the existing parkland at Burswood near the Swan River is set to be ripped up to make way for the new venue. (ABC News: Courtney Withers)\n\n\"I think people will say that this is an incredible project for the state,\" Ms Saffioti said.\n\nAccusations of spin\n\nBut frustrated locals aren't buying it, and it's one thing the state opposition and the Greens WA are united on.\n\nOpposition leader Basil Zempilas accused the state government of retrofitting its plans \"to try and cover up for their own failures\" and \"save face\".\n\nBasil Zempilas has accused the government of trying to save face over an unpopular announcement. (ABC News: Courtney Withers)\n\n\"They have not been clean with the public of Western Australia on the issue,\" he said on Thursday.\n\n\"It is all spin. They did not announce [the proposal] with microphones singing. They did not announce on push bikes. They announced in a V8 supercar.\"\n\n'Concrete over everything'\n\nGreens WA MLC Brad Pettitt said the project would still be \"dominated\" by the racetrack, and said not acknowledging this was \"disingenuous\".\n\nHe said the Greens would consider teaming up with the Liberals and others to push for a select inquiry into the issue.\n\nGreens leader Brad Pettitt says his party will team up with the Liberals in opposition to the Burswood racetrack plan. (ABC News: Courtney Withers)\n\n\"This one's become a really acute project, one that I think has become symbolic of this government's disregard for the community, disregard for green spaces and their willingness to just concrete over everything,\" he said.\n\nA mandate?\n\nSome residents had threatened to boycott Labor at the March 8 poll in protest at the racetrack, but incumbent Hannah Beazley comfortably retained the seat of Victoria Park, although there was a 10 per cent swing to the Liberals, and an 8 per cent swing to the Greens.\n\nThis could be seen as a mandate for the state government to charge on with the racetrack.\n\nBut Town of Victoria Park Mayor Karen Vernon said locals felt robbed of their ability to have their say prior to the racetrack becoming an election issue.\n\nShe said the community held little hope the consultation now being conducted would be anything other than an \"administrative exercise\".\n\nKaren Vernon says locals feel their opinions won't be taken seriously by the government despite the community consultation exercise. (ABC News: Grace Burmas)\n\n\"I think the fundamental issue that the community has ventilated long and loud, both throughout the election campaign and since then is their concern about the motorsport street circuit,\" she said.\n\n\"Now we hear that the community consultation does go to shaping things like what type of trees you want there, what's important to you, is accessibility important to you, is public transport important to you?\n\nBurswood Park is currently a mix of green spaces and small lakes. (ABC News: Courtney Withers)\n\n\"We would say our community has said all those things are important to us.\"\n\nGiven the lingering community sentiment and appetite for a political stoush, it's unlikely \"Rita's racetrack\" will fade from the headlines any time soon.\n\nCommunity consultation is due to close next month.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/stephanie-gilmore-wsl-surfing-comeback-loss-to-erin-brooks/105301054",
    "title": "Steph Gilmore plans 'revenge' after WSL Gold Coast Pro comeback loss",
    "publish_date": "Fri, 16 May 2025 23:59:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Eight-time world champion Stephanie Gilmore has all but confirmed a return to the top level next year following her quarter-final finish at the Gold Coast Pro last week.\n\nThe greatest female surfer of all time will not be at Margaret River when the World Surf League championship tour event kicks off today, but the 37-year-old says a promising comeback at Burleigh Heads has reignited her competitive fire.\n\n\"Jeffreys Bay sounds pretty good, Lower Trestles, Fiji,\" she said.\n\n\"I was excited to go out there and test myself against the best girls in the world and see if I can still do it.\n\n\"Now I'm thinking I want to get some revenge.\"\n\nSteph Gilmore has just finished competing at the Gold Coast Pro after a wildcard entry. (Supplied: WSL / Beatriz Ryder)\n\nAfter an 18-month break from the sport, Gilmore was granted a wildcard entry into her home event.\n\nShe claimed the prized scalp of reigning women's world champion, 19-year-old Caitlin Simmers, before going down to another rising star, 17-year-old Erin Brooks, in the finals.\n\nBrooks was just five months old when Gilmore won her first world title in her rookie year on tour in 2007.\n\n\"I used to always see stats when Kelly [Slater] would surf heats against up-and-comers and they were like, 'Kelly was on tour for five years before this guy was born,'\" Gilmore said.\n\n\"Now that's the situation I'm in, and it's cool.\n\n\" Time goes quick when you're having fun. \"\n\nGilmore says she has unfinished business after she was beaten by Erin Brooks in the quarter finals. (Supplied: WSL / Beatriz Ryder)\n\nHaving proved to herself she still has what it takes to match it with an exciting new generation of female talent on tour, Gilmore said she had unfinished business and was hungry to avenge her loss.\n\nThe WSL's new-look 2026 schedule will help to sweeten the deal.\n\nA return to the \"Dream Tour\" destinations and the axing of the controversial mid-season cut made it likely fans would be seeing the biggest name in the sport back in a rashie next year.\n\nGilmore admits she has missed the adrenaline rush of high-stakes competition and the energy of surfing in front of big crowds, but do not expect to see her at every stop.\n\n\"At the end of the day, I think it's more about your personal drive and motivation,\" she said.\n\n\" If I still want it, then I think I can still apply myself and chase after it. \"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/utas-flags-staff-cuts-restructure-amid-falling-enrolments/105300068",
    "title": "UTAS flags staff cuts, restructure amid falling enrolments",
    "publish_date": "Fri, 16 May 2025 23:05:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "The University of Tasmania (UTAS) will cut 13 arts and humanities staff and scrap dedicated tourism courses, as part of a proposed restructure.\n\nThe university's proposal will merge the humanities and social sciences faculties into a single school, which would lead to some courses being discontinued.\n\nThe 13 positions would be cut through targeted and voluntary redundancies.\n\nThe restructure would also include dividing the School of Creative Arts and Media into two parts, and re-establishing the music conservatorium.\n\nDivision secretary of the National Tertiary Education Union's (NTEU) Tasmanian Branch Ruth Barton told ABC Radio Hobart that university staff are feeling angry and disappointed.\n\n\"They're feeling quite confused about it all, and about the disjuncture between the rhetoric being directed towards Tasmania's future … and then these cuts,\" Dr Barton said.\n\nNTEU's Ruth Barton says staff are confused and angry by the proposed changes. (ABC News: Selina Bryan)\n\nProfessor Lisa Fletcher, UTAS Interim Academic Lead, College of Arts, Law and Education said financial challenges, workload issues, and declining student numbers in arts programs informed the decision to restructure.\n\nThe ABC understands the university decided to discontinue the graduate certificate, graduate diploma and masters of tourism, environmental and cultural heritage in 2023.\n\nProfessor Lisa Fletcher says the changes mean the university can offer courses that are financially \"sustainable\". (ABC News: Morgan Timms)\n\nProfessor Fletcher said the university is committed to delivering courses across the humanities, social sciences and creative arts.\n\n\"It is vitally important that our priority remains delivering compelling and exciting and meaningful courses for our students, but we need to do that on a scale that we can afford,\" she said.\n\nHumanities 'devalued', student says\n\nMs Brown is studying psychological sciences at UTAS, but is taking arts electives too. (ABC News: Owain Stia James)\n\nUndergraduate student Ally Brown is studying psychological sciences at UTAS, and a gender studies course.\n\nShe said she felt the university's decision devalued and de-prioritised the arts and humanities faculties.\n\nLoading...\n\n\"You feel a bit [on the] outer, for sure, doing a humanities degree because the uni doesn't care about it and UTAS isn't known for it,\" Ms Brown said.\n\nDr Barton said students may be forced to move to the mainland to study subjects that aren't available locally.\n\n\"If students want to do things like certain specialties or follow certain interests, their ability to follow those interests will be limited,\" she said.\n\nMs Brown said this would be problematic due to the financial strain it may put on students.\n\n\"A lot of people don't have the option to switch to a mainland uni financially,\" she said.\n\n\" We rely on UTAS to offer the broadest range of courses it can. \"\n\nChanges to tourism and humanities\n\nMost of the university's facilities are in the Hobart suburb of Sandy Bay. (ABC News: Luke Bowden)\n\nThere are a number of proposed changes to humanities and creative arts and media courses.\n\nThe university has proposed to discontinue Asian Philosophy units in its Philosophy major, as well as Indonesian and German language studies.\n\nUp to three staff in the Arts department and one in the Theatre department will lose their jobs.\n\nDr Barton said this decision was confusing for staff, as Tasmania has a prominent arts sector.\n\n\"It seems like the university, for all its rhetoric, is taking actions that appear contradictory to Tasmania's economic and cultural life,\" she said.\n\nProfessor Fletcher said UTAS was committed to ensuring the continuation of arts — both creative and the humanities — in their proposal.\n\n\"It is fundamental that we continue to offer those vital disciplines, not just for the career opportunities that they drive, but also because they lead to a better society,\" Professor Fletcher said.\n\nDedicated tourism courses will also be cut.\n\nTCIT boss Amy Hills says the university should offer \"cutting-edge tourism specialities\". (ABC News: Morgan Timms)\n\nTourism Industry Council of Tasmania (TICT) chief executive Amy Hills said she was disappointed UTAS would no longer have a dedicated tourism course.\n\nAccording to the state government, tourism contributes to $4.55 billion or 10.8 per cent of Tasmania's Gross State Product.\n\nThe direct and indirect contribution of tourism in Tasmania to GSP is the highest in the country.\n\n\"One in six Tasmanians are supported by the visitor economy,\" Ms Hills said.\n\n\" Why can't we have a world class university that is teaching cutting-edge tourism specialities, but also doing research that the world and the nation needs? \"\n\nProfessor Fletcher said students can still study a Bachelor of Business majoring in tourism or hospitality management.\n\nGovernment accused of changing plan for uni sales Photo shows Unidentified uni students seen from behind. The Tasmanian government is accused of deceit after announcing plans to amend its University of Tasmania protection legislation to allow for the sale of some campus properties.\n\n\"Tourism is an important industry for Tasmania and the university continues to support the sector where we can add value,\" she said.\n\nThe university's proposal will also see social work and psychology shift to the school of health.\n\nIt would also see police and emergency management courses moved to paramedicine, with two roles within policing and emergency management to be axed.\n\nThe university said it will carry out a four-week consultation period with staff about the proposed changes.\n\nDr Barton said that the process is tokenistic.\n\n\"That, as usual, will be a fake consultation where it's a tick-box exercise that they go through to endorse pre-determined outcomes,\" she said.\n\nMs Fletcher said the proposal period is \"genuine\".",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/eurovision-2025-grand-final-time-where-to-watch-australia/105289734",
    "title": "Your pocket guide to the 2025 Eurovision grand final",
    "publish_date": "Fri, 16 May 2025 23:03:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "After two electric semi-finals, we're at the pointy end of the Eurovision Song Contest.\n\nThis weekend, 26 countries will battle through ballads, opera, pop and techno, vying to be crowned the winners of Eurovision 2025.\n\nHere's what you need to know ahead of the grand final.\n\nWhen is the Eurovision 2025 grand final?\n\nIt's being held on Saturday night in Switzerland.\n\nBecause of the time difference, it'll be early Sunday morning in Australia.\n\nWant to catch up on the semifinals?\n\nWhere can I watch the grand final in Australia?\n\nOn SBS and SBS on Demand.\n\nWe'll also be live blogging all the action on ABC News from 4:30am AEST.\n\nDon't worry if you're not an early riser though. SBS will be broadcasting a repeat of the final at 7:30pm on Sunday.\n\nMelody is representing Spain at the grand final with her autobiographical number ESA DIVA. (Reuters: Denis Balibouse)\n\nWhat time is the Eurovision grand final in Australia?\n\nThe broadcast will kick off at:\n\n5am AEST: ACT, New South Wales, Queensland, Tasmania and Victoria\n\nACT, New South Wales, Queensland, Tasmania and Victoria 4.30am ACST: Northern Territory and South Australia\n\nNorthern Territory and South Australia 3am AWST: Western Australia\n\nIs Australia in the grand final this year?\n\nNo, unfortunately not.\n\nAustralia's entrant Go-Jo was knocked out after its performance in the second semi-finals earlier this week.\n\nLoading YouTube content\n\nWhich countries got through to the grand final?\n\nThis year, 37 countries entered the contest but only 26 of them are in the grand final.\n\nTwenty countries made it through the publicly voted semi-finals this week. They are:\n\nNorway: Kyle Alessandro — Lighter\n\nKyle Alessandro — Lighter Albania: Shkodra Elektronike — Zjerm\n\nShkodra Elektronike — Zjerm Sweden: KAJ — Bara Bada Bastu\n\nKAJ — Bara Bada Bastu Iceland: VAEB — RÓA\n\nVAEB — RÓA Netherlands: Claude — C'est La Vie\n\nClaude — C'est La Vie Poland: Justyna Steczkowska — GAJA\n\nJustyna Steczkowska — GAJA San Marino: Gabry Ponte — Tutta L'Italia\n\nGabry Ponte — Tutta L'Italia Estonia: Tommy Cash — Espresso Macchiato\n\nTommy Cash — Espresso Macchiato Portugal: NAPA — Deslocado\n\nNAPA — Deslocado Ukraine: Ziferblat — Bird of Pray\n\nZiferblat — Bird of Pray Lithuania: Katarsis — Tavo Akys\n\nKatarsis — Tavo Akys Israel: Yuval Raphael — New Day Will Rise\n\nYuval Raphael — New Day Will Rise Armenia: PARG — SURVIVOR\n\nPARG — SURVIVOR Denmark: Sissal — Hallucination\n\nSissal — Hallucination Austria: JJ — Wasted Love\n\nJJ — Wasted Love Luxembourg: Laura Thorn — La Poupée Monte Le Son\n\nLaura Thorn — La Poupée Monte Le Son Finland: Erika Vikman — ICH KOMME\n\nErika Vikman — ICH KOMME Latvia: Tautumeitas — Bur Man Laimi\n\nTautumeitas — Bur Man Laimi Malta: Miriana Conte — SERVING\n\nMiriana Conte — SERVING Greece: Klavdia — Asteromáta\n\nThen there are the 'big five' countries that automatically gain entry to the grand final due to the financial contributions they make to the competition:\n\nUK: Remember Monday — What The Hell Just Happened?\n\nRemember Monday — What The Hell Just Happened? Italy: Lucio Corsi — Volevo Essere Un Duro\n\nLucio Corsi — Volevo Essere Un Duro France: Louane — maman\n\nLouane — maman Spain: Melody — ESA DIVA\n\nMelody — ESA DIVA Germany: Abor & Tynna — Baller\n\nFinally, as the reigning champion, Switzerland gets a free pass into the grand final.\n\nItaly's song this year is a poetic, rock ballad. (Reuters: Denis Balibouse)\n\nHow does the voting system work?\n\nEach participating country gives two sets of points to their top 10 songs:\n\nTop rated song: 12 points\n\n12 points 2nd rated song: 10 points\n\n10 points 3rd rated song: 8 points\n\n8 points 4th rated song: 7 points\n\n7 points 5th rated song: 6 points\n\n6 points 6th rated song: 5 points\n\n5 points 7th rated song: 4 points\n\n4 points 8th rated song: 3 points\n\n3 points 9th rated song: 2 points\n\n2 points 10th rated song: 1 point\n\nOne set of those points comes from the a public vote of viewers from that country.\n\nThe other set is decided by a jury of five music industry professionals from that country.\n\nThe act with the most points wins.\n\n10 years of Australia in Eurovision Photo shows Dami sits on a black box wearing a white bedazzled gown while stretching an arm out as she sings a power ballad on stage. We look back over a decade of our contributions to the song contest and consider where to from here.\n\nCan Australians vote in Eurovision?\n\nYes.\n\nWhile people in Europe can vote via text and call, Australian's can only vote online.\n\nThe public are allowed up to 20 votes each but, fair warning, it will cost you 65c per vote.\n\nYou can access Australia's online voting portal during the Eurovision grand final here.\n\nWhy is Australia in Eurovision?\n\nIn short, because Australian broadcaster SBS has been such a big supporter of the event.\n\nIt's been covering the contest since 1983 — a whopping four decades — but Australian acts have only been taking the stage for 10 years.\n\nIn 2015, Australia was invited to compete as a wildcard entry to align with the 'building bridges' theme of that year.\n\nGiven Guy Sebastian's success (coming in fifth place) that year, the SBS struck a deal with the EBU for Australia to stay on the bill until 2023.\n\nIn 2024 and 2025, we were invited back to compete again.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/business-leader-begs-coalition-forget-climate-wars/105302608",
    "title": "'Anything but that': Business leader begs Coalition not to reopen climate wars",
    "publish_date": "Fri, 16 May 2025 23:02:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Another battle within the federal opposition over net zero would \"hobble\" the Australian economy, a prominent business leader has warned, urging the parliament to focus on the mechanics of the climate transition.\n\nNew Liberal leader Sussan Ley this week stated her belief that Australia should reduce emissions \"appropriately\", but could not say whether the Coalition would continue its commitment to achieving net zero emissions by 2050.\n\nProminent business lobbyist Innes Willox said that reconsidering net zero would be like \"re-opening an old wound\" and would undermine the confidence of investors.\n\nSussan Ley, whose deputy Ted O'Brien was the architect of the Coalition's nuclear policy, could not say whether the net zero commitment would remain. (ABC News: Matt Roberts)\n\n\"Oh god no, no, anything but, please … For many in business there would be a lot of eye-rolling about this, simply because business had hoped that the broad fundamentals were settled,\" he told the ABC's Insiders: On Background podcast.\n\n\"Business has been locked into net zero now for a long time [and] has already made investment decisions predicated on emissions reduction heading towards net zero by 2050. To reopen that now would put a lot of potential investment decisions on hold.\"\n\nLoading...\n\nMr Willox, who is chief executive of industrial business lobby Ai Group, said there was room for debate about how to achieve the target, including the future role of nuclear, but that net zero was a \"north star\" which let the market price and compare alternatives.\n\n\"We have an agreed position that both political sides have settled on for some time, and that's given business and industry some certainty around investment. To go back on that now would make things very difficult.\"\n\nNuclear worth talking about, but not for today\n\nThe Coalition's internal debate about climate policy has spilled out into the open since its heavy election defeat, with both the Liberals and Nationals calling for a rethink.\n\nMatt Canavan, who challenged David Littleproud for the leadership of the Nationals, was explicit that net zero should be dropped and coal embraced, and while his leadership bid did not succeed, his view is shared by several party colleagues.\n\nThe Coalition must figure out its answer to the net zero question Photo shows Sussan Ley, David Littleproud, Angus Taylor, Peter Dutton QT 20221027_041653670_iOS If the two parties found themselves at odds over net zero, can they viably stay together in a coalition?\n\nLiberal views are split between those who want the nuclear power policy ditched for more ambitious emissions reduction policies, those who want it retained but with less taxpayer money involved, and those who want to double down or ditch net zero entirely.\n\nEven moderate Andrew Bragg has welcomed a rethink of that target, while Ms Ley has said energy policy should \"start from the position of affordable, reliable, baseload power\" and consider the energy needs of the manufacturing sector.\n\nMr Willox said certainty about targets was important for the manufacturing sector, not just for investments in energy generation itself.\n\n\"The one thing Peter Dutton said during the election campaign that was right on the money was that energy is the economy, and if we don't have energy right … Then we're really going to hobble ourselves as an economy,\" he said.\n\n\"Energy is so important to a range of businesses, not just energy-intensive industry or generators or utilities, there is a whole range of things that are at stake here.\"\n\nInnes Willox says Peter Dutton was right to state that \"energy is the economy\", with the viability of energy-intensive manufacturing at stake in the transition. (ABC News: Matt Roberts)\n\nHe welcomed the nuclear debate and said there was merit in lifting the moratorium on nuclear energy, but that there were more pressing priorities.\n\n\"The fact is that it is a longer-term option … Nuclear may have made things easier towards the end [of the transition], but as of now, it's not there. So we have to plan without it,\" he said.\n\n\"What I kept hearing from the private sector was that in the Australian context, nuclear in the time frame that was being talked about wasn't going to stack up … Business needs to know that projects will be viable for a long time to make the investments they need to make, and at the moment it doesn't add up for nuclear for the private sector.\n\n\"That's not to say that it won't in the future, but we're dealing with the here and now. That's why I think the Coalition went down the path of government funding to try to speed that up … [But] that changes the ball game when it comes to level playing fields around investment.\"\n\nProductivity needed to unlock the transition\n\nMr Willox said the debate the parliament needed to have was how to achieve the net zero transition, citing regulatory blockages as a major obstacle.\n\n\"The government has, through this last term, had a whole range of objectives around renewable build, and we just haven't achieved that as a country. We haven't built the solar farms, we haven't built the wind that was expected…\n\n\"So we've got to look at a whole range of things around planning, around permitting, around construction time [and] construction cost.\"\n\nMr Willox welcomed comments by Treasurer Jim Chalmers that productivity would be a focus for the Albanese government's second term.\n\nAfter the election, Mr Chalmers had said the economic priority of the second term would be \"primarily productivity without forgetting inflation\", inverting the priorities of the first term.\n\nNew Environment Minister Murray Watt told the ABC this week reforming environment approval laws was one of his \"highest priorities … Current environmental laws aren't working for the environment and they're not working for business.\"\n\nMurray Watt says environmental approvals are among his highest priorities. (ABC News: Ian Cutmore)\n\nMr Willox said productivity was \"a very core message\", including in the energy space.\n\n\"We're really interested in what the government is saying it will do with Murray Watt in the environment portfolio, to see how we can unshackle [the approvals process] to allow the build to occur…\n\n\"We have to get the social licence in place, the approvals, the permitting, and we've got to build it … Or else we're not going to achieve our targets. We're not going to achieve a 2030 target, let alone a 2035 target or a 2050 target.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/record-breaking-row-from-carnarvon-to-africa/105295888",
    "title": "Two rowing teams attempt world records crossing Indian Ocean",
    "publish_date": "Fri, 16 May 2025 23:01:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Two rowing teams have begun epic journeys across the Indian Ocean from Western Australia to Africa, aiming to break separate world records.\n\nOne of the boats left on Thursday and the other leaves today, both beginning their journeys from Carnarvon, 900km north of Perth.\n\nThe first group of four men, who called their boat No Great Shakes, departed on Thursday and are bound for Dar Es Salaam in Tanzania.\n\nThree out of the four men are called Matthew and all hail from the United Kingdom.\n\nMatt Mason, who is trying to row every major ocean, said the team would try to set a world record to complete the journey from WA to Africa in 90 days.\n\n\"We're going to try and be the first and fastest classic style boat to row across the Indian Ocean,\" he said.\n\n\"It's a different type of boat compared to a lot of the majority of ocean rowboats, cause we don't have the wind assistance, so slightly different rowing and takes us a lot longer.\"\n\nMatt Mason has been trying to row every major ocean. (ABC Pilbara: Lina Elsaadi)\n\nCarnarvon has become a popular spot for people to start their water travels across the Indian Ocean.\n\n\"Carnarvon is a great launching off point because of the currents, you're straight out,\" Mr Mason said.\n\n\"You've only got a few hundred miles north to go, and then we're in the traders.\"\n\nSecond boat heads for Kenya\n\nIn an unlikely coincidence, another unrelated boat and crew will make their voyage today on the boat Untamed.\n\nThe team of four all come from different countries — Netherlands, Bulgaria, Ukraine and China.\n\nThe Untamed kayak is flying the flags of all the crew members. (ABC Pilbara: Lina Elsaadi)\n\nThe men are hoping to make the journey of more than 9,000 kilometres to Mombasa, in Kenya, in 75 days.\n\nUntamed will contribute to research at the University of Western Australia (UWA).\n\nEvgeniy Sudyr said the crew would send data to UWA, including temperature, speed, and GPS.\n\n\"They want to do this for a couple of reasons, one of them is to check dynamics of ocean rowing boats in the Indian Ocean,\" he said.\n\n\"All of this is good to do research [on], nobody did it before.\"\n\nStefan Ivanov holds the \"Explorers Club\" flag, which the Untamed crew got special permission to fly under. (ABC Pilbara: Lina Elsaadi)\n\nA breadth of experience\n\nThree of the crew on No Great Shakes have experience with ocean rowing, but it will be Matt Hemmings' first voyage.\n\nIn order to prepare for the journey, crew member Jake Mattock started running marathons.\n\n\"These guys [crew members] are military marines and commandos, I'm a civilian who worked in tech sales,\" he said.\n\n\"So I wanted to build up that mental strength that I can sustain like endurance events and stay calm under pressure in nature.\"\n\nUntamed rower and Dutchman Ralph Tuijin has embarked on 12 ocean rows, including a failed solo attempt at the Indian Ocean crossing 13 years ago, when he collided with a cargo ship.\n\nIf Mr Tuijin and Untamed finish this attempt, he will have the world record for the most completed ocean rows — 13.\n\nThe crew of the Untamed prepare for their massive feat across the Indian Ocean. (ABC Pilbara: Lina Elsaadi)\n\nMental and physical challenge\n\nPerth man Rob Barton was the first person to ever complete the row solo.\n\nIt took him 86 days.\n\nMr Barton said the rowers would encounter both physical and mental challenges.\n\n\"You learn to have a lot of faith and confidence in your boat,\" he said.\n\n\"Once you've been out there for a few days and you've encountered a few breaking waves and the boat's still surviving, you realise that the boat's capable.\n\n\" It's all down to you, and your personal strength just grows as each day goes on. You made it yesterday … why can't you make it tomorrow? \"\n\nInspirational messages written in the cabin of No Great Shakes, ahead of the crew's long journey to Africa. (ABC Pilbara: Lina Elsaadi)\n\nMr Barton said the adventure changed his life.\n\n\"When I came back, I couldn't sit behind the desk any longer, I had to get back to the ocean, and that's what I'm doing now,\" he said.\n\n\"That's my job now, sailing for a living.\"\n\nNeighbours farewell the crew of No Great Shakes. (ABC Pilbara: Lina Elsaadi)\n\nDespite the upcoming weeks of having to go to the toilet in a bucket in front of others and relying on freeze-dried packets of food, No Great Shakes crew member, Matt Hemmings expected he would look back on his journey with affection.\n\n\"It's pretty much type 2 fun,\" he said.\n\n\"It's not gonna be fun at the time, but you'll look back on it with a weird fondness.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/emergency-services-levy-fallout-across-victoria/105301354",
    "title": "Victorian councils 'deeply reluctant' to enforce controversial levy",
    "publish_date": "Fri, 16 May 2025 22:35:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victorian councils are \"deeply reluctant\" to enforce the state government's increased emergency services levy as backlash from the agriculture sector intensifies.\n\nThe Victorian government's Emergency Services and Volunteers Fund legislation passed through the Upper House on Thursday night and was met with outrage from some volunteer fire fighters.\n\nThe fund, which replaces the cheaper fire services levy, is designed to raise revenue for fire services, the State Emergency Service, triple-0 and the state control centre.\n\nCouncils across the state are now tasked with collecting the new tax from ratepayers from July 1, despite many local government bodies vehemently opposing the tax.\n\nRegional Cities Victoria (RCV) chair Shane Sali said he was worried some residents would simply refuse to pay the new line item.\n\n\"That's a shortfall on their rates notice which means we have to go through a collection process of trying to get that outstanding money from ratepayers,\" he said.\n\nMr Sali said councils were in the dark around how they were expected to collect and handle any issues with levy payment.\n\nArarat Rural City Council chief executive Tim Harrison said his council was \"deeply reluctant\" to fulfil its legal obligation in collecting the tax.\n\nMayor Jo Armstong said the levy was \"a complete travesty\".\n\n\"It will impact every single resident, from our farmers and those on fixed incomes to local businesses, inevitably causing significant mental and financial hardship and further straining our local economy,\" she said.\n\nMoorabool Shire Council Mayor Paul Tatchell said the change disproportionately impacted rural communities.\n\n\"There are fairer ways to do this and it's a shame the Victorian government is using our rural property owners to claw back some of their huge debt,\" he said.\n\nFarmer and CFA volunteer Prue Milgate says the levy will harm local economies. (Supplied)\n\nA pub with no CFA\n\nFarmers in regional Victoria who already pay substantial rates in addition to volunteering say the new levy will add to their financial pressures.\n\nCentral Victorian farmer and CFA volunteer Prue Milgate said drought-affected farmers were heartbroken about the ripple effect her community would face.\n\n\"That money is what pays my sporting club, it's what pays my children's memberships to our excursions at the school,\" she said.\n\n\"Most farming families … are already struggling because we've had very little rainfall\n\n\" We aren't going to be able to put money back into our communities. \"\n\nSome CFA volunteers have refused to attend call-outs as an act of protest against the levy. (Supplied)\n\nPeter Shields, who has volunteered for 30 years as a CFA volunteer in Dookie, near Shepparton, says his fellow brigade members are throwing in the towel.\n\n\"I was the only one at the pub last night that wasn't pulling out of the CFA,\" the former Nationals candidate said.\n\n\"But I will not be turning up to any fire on government land.\"\n\nExemption or rebate?\n\nOn Friday Premier Jacinta Allan said CFA volunteers and farmers in 24 shires eligible for state drought support would be \"exempt\" from having to pay the levy.\n\nBut it was later revealed that CFA volunteer firefighters and farmers struggling through drought could apply for a rebate after paying the levy in full.\n\nThat rebate would only apply to a single property.\n\nMs Allan said every dollar raised would go back to emergency services and be reported on annually.\n\nFarmers in parts of Victoria are doing it tough amid a lack of rain. (ABC News: Ted O'Connor )\n\nActing CFA chief officer Gary Cooks said firefighters were pleased the government added some exemptions for volunteers and drought-affected farmers.\n\nBut Victorian Farmers Federal president Brett Hosking said it would be an arduous process for farmers and the CFA.\n\n\"It's an incredibly large burden to place on the CFA, who have enough to worry about already,\" he said.\n\nMr Hosking said the levy would prompt farmers to leave the industry and rural communities.\n\n\"That's one less family employed in the community, less kids in the school, less people at the local shop and less people on the back of firefighting appliances,\" he said.\n\nOptics risk for Labor?\n\nDeakin University politics lecturer Geoff Robinson said the levy could have political ramifications for the state government.\n\nHe said few farmers voted for Labor but some provincial seats held by the government could be impacted.\n\n\"The government does face the potential perception that it is being seen as being very Melbourne-focused,\" he said.\n\nThe government said the new tax was needed to fund emergency services to respond to an increasing number of calls for assistance for fires, floods and extreme weather events.\n\nDr Robinson said the tax could be an example of the cost of dealing with climate change.\n\n\"That puts pressure on all levels of government, particularly on state governments, because they have a limited taxation base as well and often struggle to finance important services,\" he said.\n\nOpposition agriculture spokeswoman Emma Kearley told ABC Radio Melbourne there needed to be more detail about the levy exemptions.\n\n\"It's being oversold,\" she said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/giro-ditalia-stage-seven-juan-ayuso-wins/105304656",
    "title": "Ayuso pounces to win Giro stage seven, Roglič takes pink jersey",
    "publish_date": "Fri, 16 May 2025 22:20:03 +0000",
    "category": "sports",
    "authors": [],
    "text": "Spain's Juan Ayuso has won stage seven of the Giro d'Italia, with Slovenian Primož Roglič moving into the overall lead.\n\nThe first mountain stage of the race — a 168-kilometre ride from Castel di Sangro to Tagliacozzo — came down to Ayuso having the legs to get away from his rivals in the final 400 metres.\n\nAyuso's UAE Team-Emirates colleague Isaac del Toro was second, with Egan Bernal (Ineos Grenadiers) third, denying Roglič (Red Bull-Bora-Hansgrohe) a place on the podium.\n\nBut Roglič did enough to take the leader's pink jersey from Mads Pedersen, with the Dane losing touch on the final climb.\n\nAyuso's efforts put him second overall, 4 seconds behind Roglič, with Del Toro 5 seconds further back in third.\n\nGroves wins Giro d'Italia stage six Photo shows Kaden Groves sitting in the saddle of his race bike, smiling with his arms outstretched, winning a stage of the GIro d'Italia. Australian sprinter Kaden Groves triumphs on the sixth stage of the Giro d'Italia, on a dramatic day when the race is neutralised after a huge crash on the 227km ride from Potenza to Naples.\n\nAustralia's Michael Storer (Tudor Pro) finished the stage in 10th position, 8 seconds adrift of Ayuso, to move up three places into sixth spot in the general classification.\n\n\"It's my fourth Grand Tour … but I never managed to pull it (victory) off,\" Ayuso said.\n\n\"So to finally do it today in my first Giro d'Italia is something super special that I will always remember.\"\n\nThe stage was seen as the first real test for the general classification.\n\nPedersen (Lidl-Trek) had been expected to relinquish his hold on the pink jersey, with the race having favoured the sprinters in the earlier stages.\n\nThere was no easing into the stage, with the riders climbing from the start, and tackling another two classified climbs before the steep ascent to the finish.\n\n\"I knew that I could do only one attack and not mess around with two or three on this final which was very explosive,\" Ayuso said.\n\n\"When I saw my distance, I went full gas. It was important today to not only get the win but also try and recover the time I lost in the time trial.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-17/cannes-dress-code-nudity-trains-halle-berry-heidi-klum/105282066",
    "title": "Excusez-moi? Cannes Film Festival's dress code is nakedly hypocritical",
    "publish_date": "Fri, 16 May 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "You know someone's all out of runway for their cause when they start throwing around words like \"decency\".\n\nAt the 11th hour to the start of this year's film festival in the glittering French coastal resort of Cannes — the same town that once banned the public \"modest dressing\" of the burkini from its beaches — decided to ban overly revealing dresses on the red carpet, all in pursuit of what authorities call \"decency\".\n\nNeither can you wear a long train that will stop \"the smooth flow of guests\". But you must, if you're a woman, still wear high heels as you stumble, sans long gown, up those fabled stairs.\n\nYes, Cannes has always had an eccentric and controlling dress code — tuxedos only for men, no flats for women — but when the battleground becomes the body, then forget \"quiet luxury\": for many in the fashion world this new ban is being seen as a kind of quiet conservatism, and a new, insidious surge in the policing of women's bodies.\n\nHeidi Klum appears to have broken the dress code this year with a voluminous train. (Reuters: Stephane Mahe)\n\nExcusez-moi?\n\nIt's the strangest decision. If Cannes has been one thing for the majority of those who are even aware of it, it's a provocative fashion parade of breasts, legs and nipples at every turn. It's the French way, n'est-ce pas?\n\nThe event can expect front pages around the world when models, stars and starlets turn up in see-through frocks and enormous gowns — Bella Hadid in a 10-denier stocking dress; Irina Shayk in … duct tape?\n\nOne photographer's close-up at Cannes Photo shows A dog on a stand with film cameras in front of it. Photographer Eric Gaillard has been taking photos at the festival since 1981, when it was a small and intimate affair.\n\nI would have thought that a part of the world that relies for its libertarian fortunes on tax-dodging oligarchs, monarchs and patriarchs can't really afford to stride the wobbly moral high ground of a dress code ban that finds a free nipple the most appalling thing in its sight … and yet here we are.\n\nBut Cannes has always been a rather weird film festival. It sets itself apart, demanding to be regarded as the most serious and significant cinema market in the world, citing its own revered French film history as its guardrails, and yet it gives an eight-minute standing ovation to the latest chapter of a movie franchise like Mission: Impossible, while celebrating its culture of \"le booing\" to loudly deride other movies that don't land.\n\nActor Sharon Stone arrives for the screening of British director Peter Chelsom's film The Mighty at the 51st Cannes Film Festival in 1998. (Reuters: Eric Gaillard)\n\nA strange hypocrisy\n\nThe hypocrisy of the new ban is almost charming. Cannes is supposed to express the epitome of film culture in any year, and while I don't want to say that Cannes as a festival doesn't seem to know what it's got going for it … it clearly doesn't. Because why are most of us aware of this two-week spring break for the movie set? Because ever since ambitious starlets of the 50s turned up on the Croisette wearing little more than a cravat for banks of obliging photographers, the main reason anyone outside of the film industry knew the festival even existed at all was because of what women wore — or didn't.\n\nFor decades, the festival's sexy reputation has derived from hopeful young women willing to come and their her clothes off for a shot at fame.\n\nRobert De Niro hits out at Donald Trump Photo shows Robert De Niro holding up the Palme d'Or with Leonardo DiCaprio clapping beside him, both dressed in tuxes Actor Robert De Niro has come out swinging against US President Donald Trump.\n\nBut clearly, it's taken years for catatonic Cannes authorities to finally express how shocked — shocked, I tell you — they must have felt at Jane Birkin's repeated braless wearing of sheer dresses on the red carpet throughout the 70s.\n\nFrance fiercely defends its libertarian reputation and open-minded celebration of the body and will present even its most pervy expressions of that sensibility as a marker of its anti-puritanism and sophistication.\n\nThat 2016 \"burkini\" ban was Cannes giving the French general burqa ban a Riviera touch. Images of armed police officers on the beach forcibly requiring a woman to remove her clothing whipped around the world. Only a city that leans heavily on decades of fame created via breast-baring Brigitte Bardots could twist itself into a logical knot like this.\n\nWhat seems even more hypocritical is the long French tradition of exploiting female nudity in their films: it's galling that Cannes authorities only seem to get the horrors about exposed flesh when it's women and their stylists who are in charge of what gets seen, not a male director.\n\nBella Hadid attended the 2024 festival in a series of sheer dresses including a nipple-baring Saint Laurent choice. (Reuters: Stephane Mahe)\n\nSo, what is this ban really about? It's been a scant seven years since Cate Blanchett led a powerful protest on the Cannes red carpet to highlight the lack of female directors at the festival and in the film industry: Blanchett joined 82 other women, representing the only 82 films by female directors that had competed for the Palme d'Or compared to 1645 by men — and what's happened in the years since that protest? Virtually nothing has changed. In 2024, only four out of 24 films in the main competition were by women.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nYou won't see many women-directed films this year either, and now neither do you have to be tormented by bits of the bodies who made them — the blokes who run the joint have now figured out just one more way to control them.\n\nMargaret Atwood famously said that every instance of female suppression she included in her horrifyingly prescient novel, The Handmaid's Tale, could be found somewhere in history. And as the grip of restraint and control tightens around women everywhere, it's important to remember that. So, to paraphrase Maya Angelou, when libertarian France tries to show you who it really is, believe it. As a Cannes audience might put it: \"booooo!\"\n\nThis weekend, spend some time with one of my favourite poets, Ocean Vuong. His collection Time is a Mother lives by my bedside, and he's having a moment right now.\n\nHave a safe and happy weekend as Canadian ensemble Arcade Fire tap into the New Order DNA in all of us with their new album, Pink Elephant. I always loved their album, Neon Bible, and this is a slightly cooler departure from that. Here's the first single. Go well.\n\nLoading YouTube content\n\nVirginia Trioli is the presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/world/north-america/pop-singer-says-she-saw-sean-diddy-combs-repeatedly-abuse-former-girlfriend-20250517-p5lzzt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pop singer says she saw Sean ‘Diddy’ Combs repeatedly abuse former girlfriend",
    "publish_date": "Sat, 17 May 2025 11:28:43 +1000",
    "category": "entertainment",
    "authors": [
      "Jack Queen"
    ],
    "text": "Warning: This story contains graphic content.\n\nNew York: Pop singer Dawn Richard has told a jury in Sean “Diddy” Combs’ sex-trafficking trial that she often saw the hip-hop mogul beat his then-girlfriend Casandra Ventura, who earlier testified that Combs physically and emotionally abused her throughout their 11-year relationship.\n\nDawn Richard (pictured in 2024) is due to give further evidence at the trial next week. Credit: Jordan Strauss/Invision/AP\n\nRichard recounted an incident at Combs’ Los Angeles home in 2009 when Combs beat Ventura and dragged her upstairs by the hair. Richard then said she heard breaking glass and screaming.\n\n“He came down the stairs screaming, belligerent, asking where his food was and proceeded to hit her over the head and beat her on the ground in front of us,” Richard told the jury in Manhattan federal court during a fifth day of testimony on Friday (New York time).",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/fears-overpass-could-be-closed-for-year-after-turbine-jam-20250517-p5m006.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears overpass could be closed for year after turbine jam",
    "publish_date": "Sat, 17 May 2025 11:23:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fears overpass could be closed for year after turbine jam\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/rugby-convert-pushes-case-for-try-of-the-decade-20250516-p5lzym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby convert pushes case for 'try of the decade'",
    "publish_date": "Sat, 17 May 2025 11:05:13 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rugby convert pushes case for 'try of the decade'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/consortium-set-to-get-9-billion-to-build-part-of-rail-loop-operate-trains-20250513-p5lyxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Consortium set to get $9 billion to build part of rail loop, operate trains",
    "publish_date": "Sat, 17 May 2025 10:54:10 +1000",
    "category": "finance",
    "authors": [
      "Kieran Rooney"
    ],
    "text": "A $9 billion contract for building part of the Suburban Rail Loop and operating the train line is set to be awarded to a consortium including construction giant John Holland, in what would be the largest deal of its kind for the project yet.\n\nTwo sources told The Age that TransitLinX – a group of companies comprising John Holland, RATP Dev, Alstom, KBR and WSP – is the preferred bidder for the “linewide” contract of the SRL East, a $34.5 billion underground rail line between Cheltenham and Box Hill.\n\nA Suburban Rail Loop construction site in Heatherton. Credit: Justin McManus\n\nThe contract, under which the companies will be tasked with building the trains used on the line, operating and maintaining the network and fitting out the tunnels, is expected to be worth at least $8 billion to $9 billion.\n\nTransitLinX will now begin the process of negotiating and finalising the details of the contract with the Allan government. The contract is to be signed by the end of this year.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/prince-harry-wants-to-reconcile-with-his-family-is-it-possible-20250513-p5lyr1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Prince Harry wants to reconcile with his family. Is it possible?",
    "publish_date": "Sat, 17 May 2025 09:45:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Nell Geraets"
    ],
    "text": "When Prince Harry, Duke of Sussex, stood down as a senior royal in 2020, the Windsor family fractured. Since then, Harry has moved across the world from the royals, a controversial tell-all memoir betrayed their trust, and a legal dispute over security further deepened the rift.\n\nHowever, in an interview with the BBC this month, Harry revealed he wants to mend his relationship with his family.\n\n“I would love reconciliation with my family. There’s no point continuing to fight any more, life is precious,” the prince said, adding that he doesn’t know how much time he has left with his father, King Charles III.\n\nPrince Harry isn’t speaking with his father. Brooklyn Beckham didn’t go to his father’s 50th celebration. Are family rifts fixable? Credit: Compiled by Jamie Brown\n\nMeanwhile, the notable absence of Brooklyn Peltz Beckham and his wife, Nicola Peltz Beckham, from pictures of David Beckham’s 50th birthday celebrations on May 3 has raised questions about the state of relationships in football’s royal family. While none of the Beckhams have formally addressed reporting about a family rift, the speculation has proved a reminder that all families are complicated, from the rich and famous to the everyday.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/australian-oscar-jenkins-sentenced-to-13-years-in-russian-prison-20250517-p5lzzq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Oscar Jenkins sentenced to 13 years in Russian prison",
    "publish_date": "Sat, 17 May 2025 09:44:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Australian Oscar Jenkins sentenced to 13 years in Russian prison\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/investigation-after-woman-found-dead-in-queensland-20250517-p5lzzp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Investigation after woman found dead in Queensland",
    "publish_date": "Sat, 17 May 2025 09:44:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Investigation after woman found dead in Queensland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/how-rejecting-a-job-offer-led-mariners-coach-to-australian-soccer-s-big-stage-20250514-p5lz6b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How rejecting a job offer led Mariners coach to Australian soccer’s big stage",
    "publish_date": "Sat, 17 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Emily Husband initially turned down the job that has led her to the biggest stage in Australian women’s domestic soccer.\n\nThat offer came in 2020 when the English coach, who now leads the Central Coast Mariners in the A-League Women’s competition, received a phone call from Sydney University football director John Curran, who asked Husband to manage the club’s first team in the National Premier Leagues NSW competition, after three years overseeing the reserve grade side.\n\nCentral Coast Mariners coach Emily Husband. Credit: Dean Sewell\n\n“I said, ‘I don’t know, I have to think about it; I don’t think I’m ready’,” said Husband, who was doubling as Canberra United’s assistant coach at the time.\n\n“I came back to Sydney, and he would ask, ‘So, when are we announcing you as the head coach?’ And I said, ‘No John, I don’t feel that I’m quite ready to take this on yet’. And he said, ‘I have confidence in you, just give it a crack’. I guess the rest is history.”",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/joe-schmidt-should-let-wallabies-play-for-their-states-against-the-lions-here-s-why-20250516-p5lzp4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joe Schmidt should let Wallabies play for their states against the Lions. Here’s why",
    "publish_date": "Sat, 17 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There isn’t an apples-to-apples comparison to be made between the British and Irish Lions tour of New Zealand in 2017 and the one in Australia this year, at least in terms of scheduling.\n\nThe All Blacks, to the pleasant surprise of many at the time, allowed established Test stars such as Sam Whitelock, Codie Taylor, Owen Franks and Israel Dagg to play for the Crusaders against the Lions just two weeks before the first Test of the series.\n\nWallabies coach Joe Schmidt has signalled this won’t happen this year, and the apparent discrepancy has already been picked up in the northern hemisphere, where fears of the tour being devalued are a quadrennial storyline.\n\nThe complexity of this year’s schedule is that the Wallabies are playing against Fiji in Newcastle on July 6, one day after the Waratahs host the Lions in Sydney and four days after the Reds welcome them in Brisbane.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-may-17-2025-20250516-p5lzwv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, May 17, 2025",
    "publish_date": "Sat, 17 May 2025 08:26:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "1/25\n\nSheep farmer Duncan Barber on his Coliban Park property near Redesdale in Victoria. Duncan has not seen Victorian drought like this in many years, and is in dire need of rain soon. Credit:Alex Coppel",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/voss-flat-admission-after-carlton-fadeout-20250517-p5lzzk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Voss' flat admission after Carlton fadeout",
    "publish_date": "Sat, 17 May 2025 08:13:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Voss' flat admission after Carlton fadeout\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/lifestyle/king-charles-and-prince-william-make-rare-public-appearance-together-20250517-p5lzzi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles and Prince William make rare public appearance together",
    "publish_date": "Sat, 17 May 2025 07:59:11 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles and Prince William make rare public appearance together\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/volunteers-play-a-significant-role-in-australia-but-numbers-are-dropping/5ya92l0kw",
    "title": "Volunteers play a significant role in Australia, but numbers are dropping",
    "publish_date": "Fri, 16 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs washing machines whir in the mobile laundry van, 75 year old Dave Paulsen sits and chats.\n\n\n\n\n\nHe's been volunteering with not-for-profit organisation Orange Sky in the Northern Rivers since 2019, offering free laundry services and showers to people experiencing homelessness or hardship.\n\n\n\n\n\n\"It gives them that boost for the day, they can come and feel like they're like normal people who are able to wash their clothes every day, or have a shower every day. Whereas some of these people, at times we've had people come who haven't been able to wash their clothes for two or three weeks.\"\n\n\n\n\n\nMore than 122,000 Australians experience homelessness on any given night . .\n\n\n\n\n\nMr Paulsen says as well as providing a safe space where people can come and look after their cleanliness, the mobile laundry also offers a chance to connect with others.\n\n\n\n\n\n\"While their washing is being done- it usually takes around an hour, an hour and ten minutes. They'll wash and dry them- they can sit and chat and tell us their story, or just discuss general world events. And quite a lot of people will just sit and talk. Quite a lot of them don't even get their washing done. They know we're going to be at a place on a day every week, and they'll come along just for a bit of conversation.\"\n\n\n\n\n\nCreating opportunities for connection is also at the heart of 19 year old Rheanca Lincoln's work as a volunteer in her community in Toowoomba.\n\n\n\n\n\nAlong with a group of other young people, she founded We Are Not Alone , which brings young people with disability from regional towns together for workshops and social events.\n\n\n\n\n\n\"I think loneliness right now is at the highest prevalence in young people, and I think that volunteering can be a really creative way to combat that. Because for me, it really allowed me to break out of my 14 year old shell and see the world from a different perspective, and it really shaped the journey I'm on now.\"\n\n\n\n\n\nFor Stephanie Harvey, a Bidjara woman from central Queensland and the CEO of First-Nations-led organisation Community First Development, volunteering is all about these reciprocal relationships.\n\n\n\n\n\nThe organisation brings skilled volunteers - from lawyers and builders to engineers and teachers - together with First Nations communities to work on various projects.\n\n\n\n\n\nMs Harvey says the bonds that form between volunteers and communities are key to what makes their projects work.\n\n\n\n\n\n\"Volunteering in First Nations communities, when it's done the right way, it's not about giving, it's not about welfare, and it's certainly not extractive. It really is about connection and genuine relationships. Our volunteers don't help, they work alongside community members, learning from each other and building relationships. It really is that two-way exchange, where volunteers share their skills and experience, but also gain a deeper understanding of culture, respect and connection.\"\n\n\n\n\n\nWhile around a fifth of Australia’s formal volunteers are involved in community services, welfare, and homelessness, another sector where volunteers make major contributions is emergency and natural disaster response.\n\n\n\n\n\nHarmandeep Singh Sidhu from Coffs Harbour is a volunteer with the Rural Fire Service.\n\n\n\n\n\nHe was recently awarded for saving the life of another crew member during a bushfire in the Clarence Valley in 2023.\n\n\n\n\n\nMr Sidhu told SBS Punjabi about his own decision to support his community to cope with and recover from natural disaster- something he plans to do for as long as he is able to do so.\n\n\n\n\n\n\"I joined the RFS in 2020 when I only thought of dealing with the fires around my farm/residence. But later I liked the services that they provide in dangerous and vulnerable situations. I have also served during the Lismore floods in 2022. After that, I decided to join this service forever. \"\n\n\n\n\n\nThese are just some stories from the nearly 6 million Australians who volunteer every year.\n\n\n\n\n\nWhile Volunteer Week celebrates the significant contribution volunteers make to Australian society, CEO of Volunteering Australia Mark Pearce says numbers of volunteers have been dropping.\n\n\n\n\n\n\"There's been a long term decline in the rate of what we would term formal volunteering. That is people who volunteer their time through organisations and into community. Percentage wise, there are less volunteers than there were three years ago, five years ago and ten years ago.\"\n\n\n\n\n\nBarriers to participation such as out of pocket costs, and reliance on volunteers to deliver essential services without adequate training are some of the reasons Volunteering Australia identifies for this decline.\n\n\n\n\n\nMr Pearce says more funding is needed to ensure those who dedicate their time to helping others can do so in a sustainable and supported way.\n\n\n\n\n\n\"Volunteering is fundamental to the health and wellbeing every community. As a consequence, the Federal, as well as State and Territory governments have a responsibility to remove the burdens from people who put up their hands and say \"I have a commitment to my community.\"\n\n\n\n\n\nHe says this Volunteer Week is a chance to stop and think about the stories of dedication and commitment to change behind every volunteer.\n\n\n\n\n\n\"They give you a sense of what can be done. They give you a sense of what can be done. From time to time we can all feel a bit helpless, volunteering is somewhat unique in giving us the agency to do things that matter to us, to stop that feeling of helplessness and give us an opportunity to be involved. And the stories reflect that.\"\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-record-numbers-of-malicious-data-breaches-recorded-how-do-you-protect-yourself/x6fiwc7ql",
    "title": "INTERVIEW: Record numbers of malicious data breaches recorded - how do you protect yourself?",
    "publish_date": "Fri, 16 May 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/home-grown-coffee-is-tibors-passion-precision-roasted-by-flamethrower/kuo53sy81",
    "title": "Home-grown coffee is Tibor's passion, precision-roasted by flamethrower",
    "publish_date": "Fri, 16 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt’s one reason local growers are busy planting, as ................ explains.\n\n\n\n\n\n[[PACKAGE]]\n\n\n\n\n\nThat’s the sound of a gas-powered flame thrower firing into a rotating concrete mixer.\n\n\n\n\n\nBut it’s not concrete that’s going round and round - it’s coffee beans.\n\n\n\n\n\nBorn in Yugoslavia, Hungarian migrant Tibor Pinci has developed his own unique way of roasting green coffee beans at his small plantation in the hills above Coffs Harbour in Northern New South Wales.\n\n\n\n\n\nHe knows from the sound of the beans popping exactly when to stop - a few seconds too long, and the batch is spoiled.\n\n\n\n\n\n“We call it an open roaster. So that one, tumbling it, and of course you go with the flame in there, and that involves a lot of precision, because it can be just overdone or underdone in a few seconds.”\n\n\n\n\n\nThere are around 500 coffee growers in Australia, many of them in northern New South Wales and Queensland.\n\n\n\n\n\nAs global coffee prices soar, small plantations like Tibor’s are multiplying.\n\n\n\n\n\nHe describes his as a ‘hobby farm’, but he’s still producing 500 kilograms of roasted coffee a year.\n\n\n\n\n\nA baker by profession, his first attempts at growing coffee plants weren’t encouraging when they lived in Sydney.\n\n\n\n\n\n“So coffee starts growing, comes winter, they die. So it happened about three times before I find out they don't like frost. So in the end, I got about a thousand little seedlings, and I brought it up here to Coffs, because my wife is from Coffs, so my mother-in-law is here. And I said, just look after them, water them once a week, and should be all right. So months later, we came back, and the trees were like a couple of foot tall.”\n\n\n\n\n\nThe process is quite laborious.\n\n\n\n\n\n“I handpick all my cherries when they're beautifully ripe. We dry the cherries as well, because we're making the coffee berry tea out of that one, then the beans get dried and then before I roast, they get hulled it means the white shell comes off to get the green bean and then the green bean can be roasted.”\n\n\n\n\n\nTibor’s customers say they love the full aroma of his coffee with no bitterness.\n\n\n\n\n\nSo what’s the secret?\n\n\n\n\n\nAt Southern Cross University in Lismore, researchers are trying to figure that out.\n\n\n\n\n\nProfessor Tobias Kretzschmar says coffee growing is not new to Australia\n\n\n\n\n\n“As far as I'm aware, coffee arrived pretty much with the first fleet and there's been attempts since to establish an industry and it's been thriving in the last 20 to 30 years.”\n\n\n\n\n\nWhile producers are happy with the quality of the coffee, he says to make the industry more sustainable, they’re researching other varieties of coffee bush more suited to Australia.\n\n\n\n\n\n“The problem they're having is they put their money on a variety that's much too vigorous for this environment. Keeps growing. It's one of the older varieties that's not dwarfing like the new ones, meaning every couple of years the growers will have to prune it. The tree is stressed, won't produce the next year. So a lot of work and yield losses affiliated with the old varieties.”\n\n\n\n\n\nHe says a key part of their research is finding out what makes Australian coffee different.\n\n\n\n\n\nThat’s where his colleague, Dr Ben Liu comes in:\n\n\n\n\n\n“So we're doing analysis on coffee, trying to understand the flavour and the taste of coffee. At the same time, trying to actually create a chemical fingerprint for our coffee. That means when you have a good cup of coffee or bad cup of coffee, you don't know what's going on there. If you can do a chemical analysis, you know what's in there. So next time you can keep producing a good cup of coffee.”\n\n\n\n\n\nHe says coffees grown in Queensland and New South Wales have their own individual flavour characteristics.\n\n\n\n\n\n“Can be a big difference from farm to farm. Just for example, some of the farms produce coffee. in the far north of Queensland. They produce more traditional coffee flavour, like a cocoa and nutty, those coffee flavour. Here, in the subtropical area in northern New South Wales or southeast Queensland, our coffee tend to actually smell and taste more like fruity and juicy.”\n\n\n\n\n\nAt Tibor’s farm, nothing is wasted.\n\n\n\n\n\nHe sells roasted beans online and at the Sunday morning market in Coffs Harbour.\n\n\n\n\n\nAnd he makes tea from the dried berries, and flour from the hull of the beans, all full of healthy antioxidants.\n\n\n\n\n\nAs for the flavour - Tibor simply knows what his customers like:\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-even-votes-for-australia-in-eurovision-the-data-is-in-as-milkshake-man-makes-his-debut/zfmzg0wh2",
    "title": "Bloc party: Australia’s Eurovision BFFs (and the countries that never call)",
    "publish_date": "Fri, 16 May 2025 20:47:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia’s Eurovision hopeful Go-Jo has missed out on a spot in the grand final, despite a high-energy performance that had fans back home cheering for the 'Milkshake Man' and his sugary-slick dance moves.\n\n\n\n\n\nWhile the result stings for Australian fans (and milkshake lovers alike), data suggests this might be less about the song and more about who’s voting — and who isn’t.\n\n\n\n\n\nSince joining the competition in 2015, Australia has made quite a controversial splash for a country outside Europe.\n\n\n\n\n\nWe’ve earned points from far and wide, with Sweden emerging as our most loyal fan.\n\n\n\nThe Swedes have given us a total of 86 points over the years, mostly from their expert juries.\n\n\n\n\n\nThe United Kingdom and Denmark have also shown us love on the scoreboard, offering support that might hint at strong diaspora ties or just a mutual respect for a good key and costume change.\n\n\n\n\n\nBut not everyone had felt the Aussie spirit.\n\n\n\n\n\nItaly, in a move that feels just a little personal now, has never given us a single point. Zero. Zilch. Not even for Dami Im, whose Sound of Silence anthem came second in the 2016 contest.\n\n\n\nA snapshot of who Australia has voted for in Eurovision. Source: SBS News\n\nEnter the Eurovision blocs\n\nWelcome to the world of Eurovision voting blocs, where loyalty runs deeper than lyrics and neighbouring countries often show up for each other no matter the tune.\n\n\n\nThe Nordic voting bloc shows how Sweden and Norway tend to vote. Source: SBS News\n\nThe Nordic bloc\n\nSweden and Norway are Eurovision’s ultimate ride-or-die duo.\n\n\n\n\n\nSince 1957, Sweden has awarded Norway 372 points, and Norway has given back a whopping 550.\n\n\n\n\n\nThese two just can’t get enough of each other’s entries, no matter how many sequins or wind machines are involved.\n\n\n\n\n\nDenmark, Finland and Iceland are also regular fixtures in each other’s top rankings.\n\n\n\n\n\nThis tight-knit Nordic circle has long been known for sending sleek, pop-driven entries and then clapping the loudest when their neighbours do the same.\n\n\n\n\n\nIt’s Eurovision solidarity at its finest.\n\n\n\nMonster rock band Lordi of Finland celebrate their victory at the finals of the 2006 Eurovision Song Contest Source: Getty / Sean Gallup/Getty Images\n\nThe Mediterranean alliance\n\nTravel south and you'll find another unbreakable bond, this time between Greece and Cyprus.\n\n\n\n\n\nGreece has given Cyprus 522 points since the contest began, while Cyprus has repaid the favour with 544.\n\n\n\nSouthern European countries tend to stick together in voting. Source: SBS News If they could vote for each other twice, they probably would.\n\n\n\n\n\nAlbania, Armenia and France also appear high on Greece’s list.\n\n\n\n\n\nIt’s a reminder that Eurovision is just as much about politics, culture and community as it is about power ballads.\n\n\n\nThe bloc advantage\n\nEven though Eurovision has introduced a hybrid system combining jury and public votes, bloc loyalty still has weight, especially during the semi-finals, when public votes matter more.\n\n\n\n\n\nFor countries like Australia that don’t fit into a regional alliance, the road to the final can be steeper.\n\n\n\n\n\nWithout built-in neighbours ready to throw a few extra points our way, success depends on capturing the hearts of fans and impressing the juries.\n\n\n\n\n\nAustralia may not have a bloc, but we do have big talent.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/newly-re-elected-government-urges-above-inflation-minimum-wage-rise-for-over-three-million-workers/7eme45aw2",
    "title": "Newly re-elected government urges above-inflation minimum wage rise for over three million workers",
    "publish_date": "Fri, 16 May 2025 09:54:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Newly re-elected government urges above-inflation minimum wage rise for over three million workers\n\nPublished 16 May 2025, 8:16 am\n\nThe government has called on the Fair Work Commission to lift the wages of more than three million workers above the rate of inflation. The move was a key election pledge from the Prime Minister who's rounded out his first official overseas visit since being re-elected.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/australias-go-jo-gives-eurovision-a-good-shake/gkvkku4d5",
    "title": "Australia’s Go-Jo gives Eurovision a good shake",
    "publish_date": "Fri, 16 May 2025 09:49:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia’s Go-Jo gives Eurovision a good shake\n\nPublished 16 May 2025, 8:15 am\n\nAustralia's 'Milkshake man' has put on an electric performance on the Eurovision semifinal stage in Basel. But did the voting crowd think it was 'sweet sweet, yum yum' to qualify for the grand final?",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-at-a-three-month-high/phbebyzr2",
    "title": "ASX at a three month high",
    "publish_date": "Fri, 16 May 2025 07:59:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/john-pesutto-moira-deeming-defamation-case-bankruptcy-by-election-hawthorn/uk1s7k9br",
    "title": "Why a former Liberal leader's defamation case could lead to a by-election",
    "publish_date": "Fri, 16 May 2025 06:29:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Victorian opposition leader John Pesutto has been ordered to pay $2.3 million in costs after he was found to have defamed first-term MP Moira Deeming.\n\n\n\n\n\nIn December, Federal Court Justice David O'Callaghan found Pesutto had defamed Deeming by implying she was associated with neo-Nazis who gatecrashed a controversial Melbourne rally she attended.\n\n\n\n\n\nHe ordered Pesutto pay her $315,000 on top of her legal costs for the case, which were calculated to be $2,308,873.\n\n\n\n\n\nDeeming's barrister Sue Chrysanthou SC is also pushing for Pesutto to pay her legal fees for the costs hearings.\n\n\n\nREAD MORE Michael McCormack defeats Barnaby Joyce to retain Nationals leadership\n\nThe scale of the final bill has raised internal fears about the Hawthorn MP's ability to pay it, with MPs ineligible to sit in Victorian parliament if they declare bankruptcy.\n\n\n\n\n\nPesutto's latest register of interest does not list any investment properties or any other forms of income, only his home in Camberwell.\n\n\n\n\n\nFormer Victorian Liberal premiers Ted Baillieu, Jeff Kennett and Denis Napthine were listed among his donors for the court battle.\n\n\n\n\n\nPesutto's annual salary has also dropped from about $378,000 to $205,000 since he lost the Liberal leadership in late-December.\n\n\n\nMoira Deeming brought a defamation suit against John Pesutto, arguing that he had implied she was associated with neo-Nazis who gatecrashed a demonstration she attended. Source: AAP / Joel Carrett In a short statement, Pesutto said he was determined to continue serving as an MP.\n\n\n\n\n\n\"I am grateful for the support I am receiving from the community and am hopeful with this support that I will be able to fulfil these obligations and continue serving the people of Victoria,\" he said.\n\n\n\n\n\nThe Herald Sun reports Pesutto has been in discussions with the Cormack Foundation, a multimillion-dollar investment group for the Liberal Party, to cover the legal costs bill.\n\n\n\nREAD MORE Brad Battin becomes new Victorian Opposition leader after ousting John Pesutto\n\nPremier Brad Battin said it was up to the party secretariat to decide whether to bail out Pesutto and indicated the Liberals weren't preparing for a by-election in Hawthorn, declaring it a \"hypothetical\".\n\n\n\n\n\n\"It's a bit early to pre-empt this,\" he told reporters.\n\n\n\n\n\n\"All of the conversations I'll have with my team around this will remain confidential.\n\n\n\n\n\n\"I would like to see John at the next election.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-16-may-2025/ay9on46fu",
    "title": "Ukraine, Russia negotiators to meet in Istanbul | Evening News Bulletin 16 May 2025",
    "publish_date": "Fri, 16 May 2025 05:54:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Ukraine and Russia to engage in peace talks in Turkey\n\nFederal Government makes bid to boost minimum wage\n\nCameron Davis has success at first round of PGA Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nCeasefire negotiations between Ukraine and Russia are expected to proceed In Istanbul later today, for the first time in three years.\n\n\n\n\n\nLeaders from both countries will not attend, neither will US President Donald Trump.\n\n\n\n\n\nUkrainian President Volodymyr Zelensky was in the Turkish capital Ankara, questioning the commitment of the Russian parties.\n\n\n\n\n\nHe says unfortunately they are not taking the real negotiations very seriously.\n\n\n\n\n\nIt comes after Russian President Vladimir Putin rejected an offer by Ukrainian President Volodymyr Zelenskyy to meet face-to-face in Turkiye.\n\n\n\n\n\nVladimir Medinsky is the Head of the Russian delegation.\n\n\n\n\n\n\"The delegation is in a constructive mindset, looking for possible solutions and points of contact. The task of direct negotiations with the Ukrainian side is to sooner or later establish long-term peace by eliminating the basic root causes of the conflict.\"\n\n\n\n---\n\n\n\n\n\nFormer Victorian Liberal leader John Pesutto has been ordered to pay over $2.3 million dollars in costs, after losing a defamation case brought by Liberal colleague Moira Deeming.\n\n\n\n\n\nFederal Court senior judicial registrar Alison Legge handed down the decision earlier today .\n\n\n\n\n\nIf Mr Pesutto be unable to pay his bills, he faces the prospect of declaring bankruptcy, which would trigger a by-election in his electorate of Hawthorn.\n\n\n\n\n\nHe could also choose to appeal the decision.\n\n\n\n\n\nMr Pesutto lost the defamation case in December but held on to the leadership, only to lose it in a leadership spill weeks later.\n\n\n\n---\n\n\n\n\n\nThe federal government has fulfilled its election commitment to push for a lift in the award wage for workers.\n\n\n\n\n\nIn its formal submission to the Fair Work Commission's annual review of minimum and award wages, Labor has called for an economically sustainable real wage increase for the three million Australians on an award wage.\n\n\n\n\n\nThe government did not nominate a specific figure, in keeping with past practice.\n\n\n\n\n\nTreasurer Jim Chalmers says its one part of addressing cost of living pressures.\n\n\n\n\n\n\"Now we know there's more work to do because people are under pressure, and that's why this submission today seeks a real wage increase for millions of Australians. We have made a lot of progress together, and we seek with this submission today to build on that progress so that Australians can earn more and keep more of what they earn.\"\n\n\n\n\n\nThe Fair Work Commission will announce its annual wage review decision next month.\n\n\n\n---\n\n\n\n\n\nA proposal to improve access to abortions is set to become law in New South Wales, after draft legislation passed both houses of parliament.\n\n\n\n\n\nAbortion was decriminalised in the state in 2019 – but it is still inaccessible for many people, particularly in regional Australia.\n\n\n\n\n\nThe bill includes a provision that will enable nurse practitioners and endorsed midwives to prescribe drugs for medical abortions - which has to be in line with guidelines from the Therapeutic Goods Administration.\n\n\n\n\n\nGreens MP Amanda Cohn introduced the private member's bill.\n\n\n\n\n\nShe says it is an important step forward in improving access to healthcare for women.\n\n\n\n\n\n\"I acknowledge that this bill while necessary is not a silver bullet. Cultural change within an organisation as a big as a local health district takes time. Training, educating, and supporting health workers takes time and resourcing. And it is not something that can be solved simply with a stroke of a pen.\"\n\n\n\n\n\nThe legislation was ultimately passed in the lower house 65 votes to 20.\n\n\n\n---\n\n\n\n\n\nTraditional Owners have raised concerns about amendments to the Northern Territory government's Sacred Sites Act.\n\n\n\n\n\nThe legislative changes have now passed parliament and introduces an enforceable undertakings regime to remediate damages to sacred sites, rather than prosecution through a court process.\n\n\n\n\n\nThe NT government says the changes provide a more streamlined approval processes, while ensuring the protection of sacred sites remains paramount.\n\n\n\n\n\nThe Aboriginal Areas Protection Authority, which is responsible for protecting Aboriginal sacred sites under the Act, says it has concerns about the lack of consultation on the legislation.\n\n\n\n\n\nChairperson of the Aboriginal Areas Protection Authority, Bobby Nunggumajbarr spoke to NITV about this.\n\n\n\n\n\n\"There's never been any consultation whatsoever has been done with these changes of the bill. And that's the reason we are hurt today and we are really, really disappointed. We are on the risk and Traditional Owners of the sacred sites are in a very difficult position.\"\n\n\n\n---\n\n\n\n\n\nAussie golfer Cameron Davis is off to a strong start, after the first round of the PGA championship in North Carolina.\n\n\n\n\n\nVenezuela's Jhonattan Vegas used a late birdie to score his first career leader in a major tournament, while golf's big names struggled on the course.\n\n\n\n\n\nThe world's top three ranked players didn't have their best day.\n\n\n\n\n\nScott Scheffler was the only one to go subpar, while Rory McIlory ended the day three over.\n\n\n\n\n\nDefending champion and world number three Xander Schauffele went round in one over - but is still expected to win the Championship.\n\n\n\n\n\nIt’s the first time in at least 30 years that no top ten player is amongst the top ten scores posted in the opening round of a major tournament.\n\n\n\n\n\nFor Australian player, Cameron Davis, it was a better turnout.\n\n\n\n\n\nHe fired 7 birdies in his opening round.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/forever-chemicals-in-water-for-decades/lg4y1agc6",
    "title": "Residents to pursue class action over toxic 'forever chemicals' in water",
    "publish_date": "Fri, 16 May 2025 05:51:16 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Residents in a tourist hotspot want free tests for cancer-causing 'forever chemicals' in their blood after a major investigation revealed they had been drinking from a contaminated water supply for decades.\n\n\n\n\n\nPer- and polyfluoroalkyl substances (PFAS) are a group of 15,000 highly toxic, synthetic chemicals resistant to heat, stains and grease, dubbed \"forever chemicals\" because of their inability to break down.\n\n\n\nPFAs detected in Blue Mountains\n\nHigh-level contamination was detected in the drinking water catchment serving 30,000 people in the Blue Mountains in NSW in mid-2024.\n\n\n\n\n\nPFAS levels were found to be about 300 times higher than Sydney's main drinking water source but they still met Australian guidelines for safe drinking water.\n\n\n\nAn eight-month WaterNSW investigation released on Friday zeroed in on three potential sources of contamination — dating as far back as 33 years ago.\n\n\n\n\n\nTwo separate motor vehicle accident sites on the Great Western Highway in 1992 and 2002 near the Medlow Bath township, and the Medlow Bath Rural Fire Brigade station were all identified as possible sources of contamination in the Adams Creek and Medlow catchments.\n\n\n\nResidents to pursue class action\n\nJohn Dee, a veteran environmental activist, described the fallout as an \"Erin Brockovich-level scandal\".\n\n\n\n\n\nHe's leading a group called Stop PFAS that will sue the NSW government and Sydney Water to get free PFAS blood testing for local residents and compensation for those affected.\n\n\n\n\n\n\"People in the Blue Mountains have been drinking toxic tap water for 32 years,\" he told AAP.\n\n\n\nResults of tests paid for by some residents have found PFAS in the bloodstream nearly 50 times the level considered safe by chemicals manufacturer 3M.\n\n\n\n\n\nWhile the value of individual blood tests is debated among scientists, exposure to PFAS increases the risk of testicular and kidney cancer, affecting the immune system and causing developmental damage in children.\n\n\n\nWhat happens now?\n\nMedlow Dam and Greaves Creek Dam, of which Adams Creek is a tributary, will remain disconnected from the water supply system, WaterNSW said.\n\n\n\n\n\nThe dams will only return when permanent mitigation measures are in place.\n\n\n\nREAD MORE The new guidelines designed to make your drinking water safer\n\nSteep terrain, potential PFAS spread over a wide geographical region and extensive disturbance of high-value ecological habitat are all flagged as barriers to remediation.\n\n\n\n\n\nA spokesperson for Sydney Water said it would work with other agencies to ensure it met the proposed Australian Drinking Water Guidelines.\n\n\n\nIs it safe to drink water from these areas?\n\nHealth authorities say current drinking water meets existing guidelines and is safe to drink.\n\n\n\n\n\nBut the report did not quantify the current rate of PFAS discharge from potential source areas in surface water and groundwater, nor the total mass of PFAS previously discharged.\n\n\n\n\n\nRisks to human health and the environment from exposure to PFAS at the source areas have also not been quantified.\n\n\n\n\n\nAfter community pressure, Sydney Water installed a $3.4 million mobile PFAS treatment plant at the Blue Mountains catchment in January.\n\n\n\n\n\nThe National Health and Medical Research Council drafted new drinking water guidelines in October, reducing the benchmark for the PFOA group of chemicals.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-art-of-the-middle-east-deal-philippines-midterms-and-tissue-gate/ehvanrkpi",
    "title": "The Art of the Middle East Deal, Philippines Midterms and Tissue-Gate",
    "publish_date": "Fri, 16 May 2025 05:49:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australias-go-jo-elated-with-eurovision-2025-performance/zhh7aubjc",
    "title": "Australia's Go-Jo elated with Eurovision 2025 performance",
    "publish_date": "Fri, 16 May 2025 02:41:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Eurovision journey has ended in disappointment, with Go-Jo - whose real name is Marty Zambotto - failing to qualify for the 2025 grand final, despite a vibrant performance of his song 'Milkshake Man'.\n\n\n\n\n\nMr Zambotto says he has no regrets, describing the experience as \"the most incredible thing\" he has ever done.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia’s journey at Eurovision 2025 has come to an end.\n\n\n\n\n\nGo-Jo, whose real name is Marty Zambotto, opened the second semi-final with his colourful, high-energy number 'Milkshake Man'.\n\n\n\n\n\nBut despite a confident performance and support from Aussie fans, he didn’t secure enough votes to qualify for the final.\n\n\n\n\n\nHe spoke with journalists shortly after the loss.\n\n\n\n\n\nZambotto: \"The comments are going mental apparently.\"\n\n\n\n\n\nReporter: \"About we was robbed.\"\n\n\n\n\n\nZambotto: \"I haven't even checked them, I don't know where my phone is. But I will find it.\"\n\n\n\n\n\nReporter 2: \"How do you feel about that?\"\n\n\n\n\n\nZambotto: \"\"Know, I mean, like, you know, I, we put so much work and effort into everything. And, you know, I talked to my team, and they've, like, you know, it's a hard thing to kind of, you know, see all the work put into it. And me as an individual, but the team, and how proud everyone is of, like, you know, everything we've done. And I know that I couldn't have done anything better. And I suppose I couldn't have worked harder if I tried.\"\n\n\n\n\n\nBut he says he has no regrets.\n\n\n\n\n\n\"Aside from, you know, the result this journey has been the most incredible thing that I've ever experienced in my whole entire life. And like, I'm so grateful for that. And you know, the friendships I've made, and, like, even me learning about media training from Clementine and SBS like I was talking to her about that she taught me so much, even just on how to speak to a camera. I was useless before this.\"\n\n\n\n\n\nThis marks the second year in a row Australia has failed to qualify.\n\n\n\n\n\nTheir last grand final appearance was in 2023 with metal band Voyager.\n\n\n\n\n\n(Excerpt of Voyager's performance 'Promise')\n\n\n\n\n\nOne of the most powerful stories this year is that of Ukraine’s entry, rock band Ziferblat.\n\n\n\n\n\n(Excerpt of Ziferblat's 'Bird of Pray')\n\n\n\n\n\nComprising twin brothers Valentyn and Daniil Leshchynskyi, and drummer Fedir Khodakov, Ziferblat are not only competing with their song 'Bird of Pray', but also carrying the emotional weight of war back home.\n\n\n\n\n\nAt a Ukrainian cultural event in Basel, the band spoke about their dual mission, music and remembrance.\n\n\n\n\n\nDaniil Leshchynskyi: \"A little bit of pressure, yeah, but it's a childhood dream to represent such a big country.\"\n\n\n\n\n\nValentyn Leshchynskyi: \"Like we have two missions here because we are representing Ukraine during the war time and so we need to remind Europeans about the war. We started this fundraising company. We need $100,000 to buy a four-robotic system to de-mine Ukrainian territory.\"\n\n\n\n\n\nThey were also shaken when their backing vocalist, Khrystyna Starykova, lost her home to a Russian shelling attack just days before their rehearsal.\n\n\n\n\n\nValentyn Leshchynskyi: \"But the day after, she came to us like nothing happened. I mean, she's so strong, she is 19 years old only. But the impact of this situation, I think she won't give up. I mean she knows what to do here, she's focused on the staging. Of course it's difficult when you're losing your flat while you need to like stay calm to celebrate here because it's a musical festival, it's not about the war or something.\"\n\n\n\n\n\nThe politics didn’t stop with Ukraine.\n\n\n\n\n\nOutside the Eurovision venue, St Jakobshalle, demonstrators gathered in support of Israel’s participation in the contest.\n\n\n\n\n\n(Sound of people clapping and singing)\n\n\n\n\n\nIsrael’s act this year is 24-year-old Yuval Raphael, a survivor of the 7th of October 2023 Hamas attack at the Nova music festival.\n\n\n\n\n\n(Excerpt of 'New Day Will Rise')\n\n\n\n\n\nDespite tensions outside the Eurovision venue, these Israeli fans from Tel Aviv, said they felt supported.\n\n\n\n\n\nSalame: \"The people here are so nice.\"\n\n\n\n\n\nZaruk: \"We thought people are going to be louder.\"\n\n\n\n\n\nSalame: \"At the beginning, we were kind of afraid to say that we're from Israel. And now everyone who asked us where are we from, we're saying Israel. And they gave us a big hug. Big hug.\"\n\n\n\n\n\nOthers, like Lea Kobler, gathered in support of Palestinians in Gaza.\n\n\n\n\n\n\"It should be a happy occasion that Eurovision is finally in Switzerland, but it's not, it's not. How can we rightfully exclude Russia, but we're still welcoming Israel, who is doing horrendous things to so many people, and we just welcome them here and parade them and say 'oh hello', and they're committing a genocide and war crimes and nobody's doing anything.\"\n\n\n\n\n\nStill, voices like local pastor Lukas Kundert emphasised solidarity.\n\n\n\n\n\n\"The Jewish people of Basel have heard little in recent days that they are supported here in Switzerland. That they are protected by the population, and this is an opportunity to show that.\"\n\n\n\n\n\nThe grand final will be broadcast live on on SBS and SBS On Demand on Sunday 18 May at 5am AEST - and replayed at 7:30pm.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/sussan-ley-faces-net-zero-challenge-amid-personal-struggles/chrual65i",
    "title": "Sussan Ley faces net zero challenge amid personal struggles in first week",
    "publish_date": "Fri, 16 May 2025 02:06:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Newly elected Liberal leader Sussan Ley faces a challenging first week in the job, as she seeks to unite a fractured Opposition while being at her dying mother's bedside.\n\n\n\n\n\nThe Liberal and National parties are divided over their policy offerings following their federal election defeat , including whether or not to ditch the proposal to build seven nuclear reactors.\n\n\n\n\n\nLey met with Nationals leader David Littleproud at her home in Albury, NSW, on Thursday to negotiate the Coalition's agreement on policies as well as frontbench responsibilities.\n\n\n\n\n\nShe said their first meeting was \"productive and respectful\" but that no decision had been made in regards to \"nuking nuclear\".\n\n\n\nSussan Ley met with Nationals leader David Littleproud on Thursday to negotiate the Coalition's agreement on policies as well as frontbench responsibilities. Source: AAP / Mick Tsikas \"I'm not here to talk about individual policies. Nothing's been adopted, nothing has been abandoned,\" she told Nine's Today program on Friday morning.\n\n\n\n\n\n\"But what I made very clear early on was that my approach would be a consultative one … We would work together to meet the Australian people where they are in terms of our agenda.\"\n\n\n\n\n\nLey expressed appreciation for Littleproud travelling to her for the first of their meetings so that she could be with her mother, Angela Braybrooks.\n\n\n\n\n\nBraybrooks reportedly went into end-of-life care the night before Ley faced former Treasury spokesperson Angus Taylor in the Liberals' leadership spill, which s he won 29 to 25 on Tuesday morning .\n\n\n\n\n\nLey has spoken of the 93-year-old's resilience and strength throughout the week, thanking those who have offered good wishes to the family.\n\n\n\nSussan Ley pictured with her mother Angela. Credit: Supplied by Sussan Ley's office\n\nCoalition alliance risks split over net-zero target\n\nThere are some within the Coalition, like Senator Matt Canavan, who believe aspirations to achieve net-zero emissions by 2050 need to be \"dumped\".\n\n\n\n\n\nThe Coalition pitched nuclear reactors as the pathway to achieving this, offering them as an alternative to Labor's renewable strategy.\n\n\n\n\n\nHowever, there were swings against the Coalition in nearly every seat where it proposed a nuclear plant, except for Flynn in Queensland, according to Australian Electoral Commission data.\n\n\n\nMeanwhile, Labor recorded positive swings in every seat where offshore wind projects have been announced.\n\n\n\n\n\nNationals senator Bridget McKenzie said net-zero targets would have an impact on regional areas.\n\n\n\n\n\n\"Our job is to mitigate and make sure that our communities aren't bearing the brunt, the negative impact of those decisions,\" she told Sky News on Friday.\n\n\n\n\n\n\"Our party has been very clear that we have always had concerns about how net zero will impact those of us that live in rural and regional communities.\"\n\n\n\nHowever, if it were to completely scrap net-zero targets, the Coalition risks further disenfranchising metro suburban Australia, which Redbridge Group director Simon Welsh told SBS News had \"repudiated\" the Liberals.\n\n\n\n\n\nLey will have to find a consensus with Littleproud on how to win back these voters to ensure success in upcoming elections while appeasing a National Party that has been emboldened after only losing one senator.\n\n\n\n\n\nIn comparison, the Liberals have lost at least 13 seats in the lower house.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press and Cameron Carr\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.theage.com.au/world/north-america/pop-singer-says-she-saw-sean-diddy-combs-repeatedly-abuse-former-girlfriend-20250517-p5lzzt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Pop singer says she saw Sean ‘Diddy’ Combs repeatedly abuse former girlfriend",
    "publish_date": "Sat, 17 May 2025 11:28:43 +1000",
    "category": "entertainment",
    "authors": [
      "Jack Queen"
    ],
    "text": "Warning: This story contains graphic content.\n\nNew York: Pop singer Dawn Richard has told a jury in Sean “Diddy” Combs’ sex-trafficking trial that she often saw the hip-hop mogul beat his then-girlfriend Casandra Ventura, who earlier testified that Combs physically and emotionally abused her throughout their 11-year relationship.\n\nDawn Richard (pictured in 2024) is due to give further evidence at the trial next week. Credit: Jordan Strauss/Invision/AP\n\nRichard recounted an incident at Combs’ Los Angeles home in 2009 when Combs beat Ventura and dragged her upstairs by the hair. Richard then said she heard breaking glass and screaming.\n\n“He came down the stairs screaming, belligerent, asking where his food was and proceeded to hit her over the head and beat her on the ground in front of us,” Richard told the jury in Manhattan federal court during a fifth day of testimony on Friday (New York time).",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/national/fears-overpass-could-be-closed-for-year-after-turbine-jam-20250517-p5m006.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fears overpass could be closed for year after turbine jam",
    "publish_date": "Sat, 17 May 2025 11:23:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fears overpass could be closed for year after turbine jam\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/rugby-convert-pushes-case-for-try-of-the-decade-20250516-p5lzym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rugby convert pushes case for 'try of the decade'",
    "publish_date": "Sat, 17 May 2025 11:05:13 +1000",
    "category": "finance",
    "authors": [],
    "text": "Rugby convert pushes case for 'try of the decade'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/consortium-set-to-get-9-billion-to-build-part-of-rail-loop-operate-trains-20250513-p5lyxb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Consortium set to get $9 billion to build part of rail loop, operate trains",
    "publish_date": "Sat, 17 May 2025 10:54:10 +1000",
    "category": "finance",
    "authors": [
      "Kieran Rooney"
    ],
    "text": "A $9 billion contract for building part of the Suburban Rail Loop and operating the train line is set to be awarded to a consortium including construction giant John Holland, in what would be the largest deal of its kind for the project yet.\n\nTwo sources told The Age that TransitLinX – a group of companies comprising John Holland, RATP Dev, Alstom, KBR and WSP – is the preferred bidder for the “linewide” contract of the SRL East, a $34.5 billion underground rail line between Cheltenham and Box Hill.\n\nA Suburban Rail Loop construction site in Heatherton. Credit: Justin McManus\n\nThe contract, under which the companies will be tasked with building the trains used on the line, operating and maintaining the network and fitting out the tunnels, is expected to be worth at least $8 billion to $9 billion.\n\nTransitLinX will now begin the process of negotiating and finalising the details of the contract with the Allan government. The contract is to be signed by the end of this year.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/prince-harry-wants-to-reconcile-with-his-family-is-it-possible-20250513-p5lyr1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Prince Harry wants to reconcile with his family. Is it possible?",
    "publish_date": "Sat, 17 May 2025 09:45:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Nell Geraets"
    ],
    "text": "When Prince Harry, Duke of Sussex, stood down as a senior royal in 2020, the Windsor family fractured. Since then, Harry has moved across the world from the royals, a controversial tell-all memoir betrayed their trust, and a legal dispute over security further deepened the rift.\n\nHowever, in an interview with the BBC this month, Harry revealed he wants to mend his relationship with his family.\n\n“I would love reconciliation with my family. There’s no point continuing to fight any more, life is precious,” the prince said, adding that he doesn’t know how much time he has left with his father, King Charles III.\n\nPrince Harry isn’t speaking with his father. Brooklyn Beckham didn’t go to his father’s 50th celebration. Are family rifts fixable? Credit: Compiled by Jamie Brown\n\nMeanwhile, the notable absence of Brooklyn Peltz Beckham and his wife, Nicola Peltz Beckham, from pictures of David Beckham’s 50th birthday celebrations on May 3 has raised questions about the state of relationships in football’s royal family. While none of the Beckhams have formally addressed reporting about a family rift, the speculation has proved a reminder that all families are complicated, from the rich and famous to the everyday.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/australian-oscar-jenkins-sentenced-to-13-years-in-russian-prison-20250517-p5lzzq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Oscar Jenkins sentenced to 13 years in Russian prison",
    "publish_date": "Sat, 17 May 2025 09:44:33 +1000",
    "category": "finance",
    "authors": [],
    "text": "Australian Oscar Jenkins sentenced to 13 years in Russian prison\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/investigation-after-woman-found-dead-in-queensland-20250517-p5lzzp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Investigation after woman found dead in Queensland",
    "publish_date": "Sat, 17 May 2025 09:44:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Investigation after woman found dead in Queensland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/how-rejecting-a-job-offer-led-mariners-coach-to-australian-soccer-s-big-stage-20250514-p5lz6b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How rejecting a job offer led Mariners coach to Australian soccer’s big stage",
    "publish_date": "Sat, 17 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Emily Husband initially turned down the job that has led her to the biggest stage in Australian women’s domestic soccer.\n\nThat offer came in 2020 when the English coach, who now leads the Central Coast Mariners in the A-League Women’s competition, received a phone call from Sydney University football director John Curran, who asked Husband to manage the club’s first team in the National Premier Leagues NSW competition, after three years overseeing the reserve grade side.\n\nCentral Coast Mariners coach Emily Husband. Credit: Dean Sewell\n\n“I said, ‘I don’t know, I have to think about it; I don’t think I’m ready’,” said Husband, who was doubling as Canberra United’s assistant coach at the time.\n\n“I came back to Sydney, and he would ask, ‘So, when are we announcing you as the head coach?’ And I said, ‘No John, I don’t feel that I’m quite ready to take this on yet’. And he said, ‘I have confidence in you, just give it a crack’. I guess the rest is history.”",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/joe-schmidt-should-let-wallabies-play-for-their-states-against-the-lions-here-s-why-20250516-p5lzp4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joe Schmidt should let Wallabies play for their states against the Lions. Here’s why",
    "publish_date": "Sat, 17 May 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "There isn’t an apples-to-apples comparison to be made between the British and Irish Lions tour of New Zealand in 2017 and the one in Australia this year, at least in terms of scheduling.\n\nThe All Blacks, to the pleasant surprise of many at the time, allowed established Test stars such as Sam Whitelock, Codie Taylor, Owen Franks and Israel Dagg to play for the Crusaders against the Lions just two weeks before the first Test of the series.\n\nWallabies coach Joe Schmidt has signalled this won’t happen this year, and the apparent discrepancy has already been picked up in the northern hemisphere, where fears of the tour being devalued are a quadrennial storyline.\n\nThe complexity of this year’s schedule is that the Wallabies are playing against Fiji in Newcastle on July 6, one day after the Waratahs host the Lions in Sydney and four days after the Reds welcome them in Brisbane.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-may-17-2025-20250516-p5lzwv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Age photos of the week, May 17, 2025",
    "publish_date": "Sat, 17 May 2025 08:26:46 +1000",
    "category": "finance",
    "authors": [],
    "text": "1/25\n\nSheep farmer Duncan Barber on his Coliban Park property near Redesdale in Victoria. Duncan has not seen Victorian drought like this in many years, and is in dire need of rain soon. Credit:Alex Coppel",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/voss-flat-admission-after-carlton-fadeout-20250517-p5lzzk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Voss' flat admission after Carlton fadeout",
    "publish_date": "Sat, 17 May 2025 08:13:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Voss' flat admission after Carlton fadeout\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/lifestyle/king-charles-and-prince-william-make-rare-public-appearance-together-20250517-p5lzzi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King Charles and Prince William make rare public appearance together",
    "publish_date": "Sat, 17 May 2025 07:59:11 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "King Charles and Prince William make rare public appearance together\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://au.news.yahoo.com/free-woolworths-gift-to-solve-annoying-supermarket-trend-how-did-i-not-know-224917256.html",
    "title": "Free Woolworths gift to solve annoying supermarket trend: 'How did I not know?'",
    "publish_date": "2025-05-16T22:49:17Z",
    "category": "finance",
    "authors": [],
    "text": "Coin-operated trolleys are a major frustration for many Aussie shoppers but most don't know there's a simple, and free, tool they can get to unlock them.\n\nSupermarkets and major retailers like Woolworths, Coles and Kmart are in a constant battle to ensure shopping trolleys stay where they are meant to be — in stores. However, a growing trend of locking them up in Australia to prevent them from being dumped is causing growing frustration among shoppers who rarely have a $1 or $2 coin required to operate them.\n\nRecently, regular Woolies shopper Stefan was fuming after his arm was hurting from having to lug a heavy basket around the store to do his weekly shop because he didn't have a coin on him to access a trolley.\n\n\"My arm was killing me,\" he told Yahoo News of the ordeal, admitting that he \"never\" holds coins on him.\n\nHowever, after sharing his gripe online, Aussies informed Stefan of a little-known gift from staff at Woolies which solves the annoying problem — a keyring token which can be used to release the trolley without a gold coin.\n\nADVERTISEMENT\n\n\"I went up to the desk and asked, and they were like 'here you go' and gave it to me,\" he explained, asking, \"how did I not know about that?\"\n\nWhile the supermarket remained tight-lipped about the free item when approached by Yahoo News, it's understood customers who don’t have a coin to use for the trolley locks are welcome to enquire about the tokens.\n\nWhy are trolleys being locked in Woolworths, Coles, Aldi and Kmart?\n\nTrolley dumping is a widespread issue, with supermarkets spending \"significant amounts\" on maintaining their fleets. Brisbane-based Ocean Crusaders' Ian Thomson recently told Yahoo it costs roughly $300 to replace a trolley, and stores \"don't do much\" to recover missing ones.\n\n\"That's often being paid for with our groceries,\" he said, suggesting it's everyday Aussies who bear the brunt of the ultimate costs of the problem.\n\nADVERTISEMENT\n\nColes recently told Yahoo News they have teams of people collecting trolleys removed from the premises.\n\n\"Abandoned trolleys are a nuisance to local communities and we are continually working to make this better across all our stores, including regular collections of abandoned trolleys with vehicles on the road frequently,\" a Coles spokesperson said.\n\n\"We are always reassessing our trolley management and take local feedback into account when deciding what methods to employ at any of our stores, including the use of coin locks and electronic wheel lock systems.\"\n\nAldi's 'preventative measure' against trolley theft\n\nAldi, well known for using coin-operated trolleys, told Yahoo News Australia they too use them to prevent trolleys being dumped, as well as to save money.\n\nADVERTISEMENT\n\n\"The Aldi trolley token system is a key preventative measure against trolleys being dumped in backstreets, waterways and public areas. As a result, we find almost all of our trolleys are returned to our stores,\" a spokesperson said.\n\n\"By incentivising customers to return their own trolleys, we save money on trolley retrieval services and pass those savings on to customers in the form of our low prices. It’s part of our Good Different operating model.\"\n\nThe store sells a trolley token for 99 cents.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 38
  },
  {
    "url": "https://au.news.yahoo.com/adidas-halts-use-of-wild-kangaroo-skins-in-shoes-no-longer-justifiable-125158353.html",
    "title": "Adidas halts use of wild kangaroo skins in shoes: 'No longer justifiable'",
    "publish_date": "2025-05-16T12:51:58Z",
    "category": "finance",
    "authors": [],
    "text": "In a surprise move, Adidas CEO Bjørn Gulden revealed the company was no longer using kangaroo leather.\n\nAdidas CEO Bjørn Gulden (circled) announced the company was no longer using kangaroo leather at the company's AGM near Nuremberg, after a passionate speech by Center for a Humane Economy president Wayne Pacelle (right). Source: Supplied/Adidas\n\nAnimal rights campaigners are claiming victory after Adidas announced it was no longer using leather harvested from wild Australian kangaroos. Pressure had been mounting on the German-based sporting manufacturer to cease using the product in its soccer boots because of animal welfare concerns.\n\nUnited States-based Center for a Humane Economy has run a high-profile campaign, highlighting concerns about a lack of oversight when kangaroos are shot, and that joeys are considered collateral and bludgeoned to death. In 2023, Puma, Nike and New Balance abandoned the product, commercially known as K-leather, and switched to synthetic alternatives, which they said were superior.\n\nSpeaking to Yahoo News from Frankfurt on Friday night, Center for a Humane Economy president Wayne Pacelle said the company’s sudden announcement came as a “surprise”, but it was welcome. “It was time for this very strong global brand to divorce itself from the largest massacre of terrestrial wildlife in the world,” he said.\n\nWhile Adidas used only a small amount of kangaroo leather in its shoes, a decision from such a high profile company is set to be a blow to the industry's morale. Advocates of wild kangaroo shooting claim their product is better for the environment than farmed alternatives like cow leather and that it can be done sustainably without harming the species' overall health.\n\nADVERTISEMENT\n\nThe Australian Wild Game Industry Council argues shooters kill in a way that \"minimises pain, suffering and distress\". \"The methods for the euthanasia of joeys in instances where they are unintentionally orphaned are also based on scientific research into kangaroo behaviour and ecology,\" it maintains.\n\nApplause as Adidas CEO announces end to kangaroo leather\n\nAdidas CEO Bjørn Gulden announced the decision on May 15 at the company’s Annual General Meeting in Fürth, Germany.\n\n“The good news is that we don't need to discuss this anymore because we haven't bought any kangaroo leather since August last year,” he said in German. In video of the speech, seen by Yahoo News, members of the 250-person strong crowd can then be heard erupting in applause.\n\nGulden then confirms the last shoes from that shipment are being produced now, meaning there may still be some stock available.\n\nAdidas had already scaled back its use of K-leather, but was continuing to use it in soccer boots. Source: Adidas\n\nGulden's announcement was preceded by a 6-minute address by Pacelle, who had travelled from Washington to speak before the board. Dressed in a suit and tie, and standing at the podium, he delivered what he \"hoped\" would be a “very rational argument” on animal welfare and why choices made by large commercial brands like Adidas matter.\n\nADVERTISEMENT\n\nContinuing, he claimed the conditions of the slaughter did not meet Adidas’s own animal welfare standards, and that shooting kangaroos to make football boots was “no longer acceptable in the 21st century”.\n\n“We don’t need to use kangaroo leather, it is completely unnecessary. If we take an honest look at what’s happening with these animals, we know that this is no longer justifiable,” he added, before reminding the board that in the United States, animal welfare has more donors than any other cause.\n\nAdidas claims kangaroo decision not influenced by campaign\n\nFollowing Pacelle’s speech, Gulden denied Adidas’s decision to stop purchasing kangaroo leather was influenced by Center for a Humane Economy’s campaign, or that kangaroos were directly shot to make shoes.\n\n“We don't agree on the matter because you know the meat industry is responsible for regulating the population,” he said in German. “Shoe production uses waste products, so we'll see now because I hope you come every year, and then we can see if it improves just because we don't make the shoes.”\n\nAustralia is home to the largest slaughter of terrestrial wildlife in the world. Source: Getty (File)\n\nSpeaking later with Yahoo, Pacelle said leather was a valuable component of what makes kangaroo shooting viable, noting the flesh is not sold at a high price, with much of it used as pet food.\n\nADVERTISEMENT\n\nHe was \"baffled\" as to why Adidas took so long to make the announcement, given K-leather hadn't been purchased since last year.\n\nProtests had been ongoing at stores across the United States, with activists entering shops with placards and calling on the company to abandon its use of kangaroo. \"These have created a lot of clamour within the company, and it is definitely behind Nike in the United States, which is definitely an important market,\" Gulden said.\n\nAnimal rights advocates celebrate around globe\n\nKangaroo continues to be used in luxury handbags and boots, and by Japanese sporting goods manufacturers Mizuno and ASICS. Center for a Humane Economy is now turning its attention to these shoe brands, and will work to fight any industry expansion into other international markets like China.\n\nAnimal welfare groups around the world have celebrated Adidas’s announcement, which was the most high-profile sporting company to continue selling K-leather boots.\n\nADVERTISEMENT\n\nCenter for a Humane Economy’s director of international programs Jennifer Skiff told Yahoo that today had been “a good day”.\n\nSpeaking after the AGM she said, “Adidas’s decision marks a historic milestone in animal protection and corporate responsibility. This sends a clear message: compassion is not a compromise. Cruelty has no place in commerce.”\n\nDonny Moss from TheirTurn, a group that led dozens of protests in Adidas, said, “This win belongs to every advocate who stood outside a store, signed a petition, or raised their voice”.\n\nAnimal welfare advocates claim it’s unethical to bludgeon joeys to death after their mothers are shot for their meat and skins. Source: Getty (File)\n\nIn Australia, Animal Justice Party MP Emma Hurst celebrated the decision, calling it a win for “transparency, ethics, and global consumer expectations”.\n\n“Australians and animal lovers worldwide owe a great deal to the relentless work of the Center for a Humane Economy and the global coalition that made this possible,” she said.\n\nAlyssa Wormald from the Victorian Kangaroo Alliance said it's time for leaders in Australia to see the \"writing on the wall\" and realise the kangaroo harvesting industry is \"dying\".\n\n\"We know the reduced demand for kangaroo products is hitting the kangaroo industry hard. Very few processors are buying carcasses, so shooters are packing it in, and there is no incentive for new shooters to get involved,\" she said.\n\nAdidas has been contacted for comment.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 39
  },
  {
    "url": "https://au.news.yahoo.com/90-second-change-on-550-aussie-roads-divides-opinion-absolute-joke-070434497.html",
    "title": "90-second change on 550 Aussie roads divides opinion: 'Absolute joke'",
    "publish_date": "2025-05-16T07:04:34Z",
    "category": "finance",
    "authors": [],
    "text": "The council believe an increase in travel time is 'insignificant' when lives are at risk.\n\nMore than 550 roads will have their speed limit amended in the coming weeks. Source: Shire of Augusta-Margaret River\n\nA new speed reduction trial is being rolled out on roads in one Aussie state and despite the initiative being a desperate attempt to curb growing road fatality rates, there has been a mixed reaction to the move, which will cost drivers 90 seconds on the road.\n\nAround 550 local roads in the popular Margaret River region of Western Australia will be affected by the three-year Safer Speeds program, with the first of the new speed limit signs sprouting up in Gracetown this week. While there is no blanket speed change across the roads, the majority are being reduced by 10 kilometres per hour.\n\nThe Shire of Augusta-Margaret River has remained steadfast on its decision to introduce the changes despite the neighbouring City of Busselton council pulling out of what was due to be a joint program, with 1,800 roads in that council area now no longer due for a speed limit change.\n\n\"The intent was to have the trial over the two shires, but City of Busselton decided not to. Their community response to participate in the trial was quite different than ours,\" Shire President Julia Meldrum told Yahoo News. \"Over 50 per cent of our community were happy for us to proceed with the trial, which was a different result than the City of Busselton.\"\n\nADVERTISEMENT\n\n\"The reason we're involved in this trial is because speed is one contributor to road crashes and serious injury, so it's one way of saving lives.\"\n\nResidents pose with new speed limit signs erected this week. Source: Facebook/Shire of Augusta-Margaret River\n\nSpeed reduction program called out as 'joke' by some drivers\n\nThere has been a 10.4 per cent increase in the number of roadside fatalities in Western Australia in the last 12 months, according to the National Road Safety Strategy, and speed continues to be the leading cause of serious collisions.\n\nHowever, some drivers are pushing against the speed reduction trial, claiming it will increase travel time and is only going to \"frustrate people\" — with many sharing their opinions on social media, calling the trial an \"absolute joke\".\n\nADVERTISEMENT\n\n\"Absolutely needless and just more infuriating and impatience will build for road users,\" one driver said online, with many championing the City of Busselton's decision to pull out.\n\nIn response, Meldrum told Yahoo News the average travel time will only increase by 90 seconds and she strongly believes the road safety implications of reduced speed limits will vastly outweigh the slight increase of time on the road.\n\n\"I'm encouraging community members to be patient on the roads and be sensible on the roads. And, you know, is 90 seconds really a long time? Not really. It's insignificant when you consider there could be lives saved and serious injury prevented.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 40
  }
]