[
  {
    "url": "https://www.9news.com.au/finance/inflation-australia-october-abs/bf7bd95e-cdca-4424-b8a0-903b4be71acb",
    "title": "Final nail in the coffin for rate cut hopes",
    "publish_date": "Wed, 26 Nov 2025 01:08:17 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Inflation\n\nhas jumped once again, all but putting the final nail in the coffin for any chance of an\n\ninterest rate\n\ncut in 2025, and even raising the spectre of another hike.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/barnaby-joyce-david-littleproud-steak-dinner/d9e4e9d2-91c0-4d4d-939c-a366c83f4ab8",
    "title": "Littleproud blasts Hanson's steak dinner, says Aussies can't even afford sausages",
    "publish_date": "Wed, 26 Nov 2025 01:18:45 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "N﻿ationals leader David Littleproud lightly mocked Pauline Hanson's decision to woo Barnaby Joyce with a steak dinner while fielding questions about the New England MP's potential defection to One Nation.\n\nLittleproud pointed that while Hanson and Joyce dined out on expensive wagyu beef, albeit cooked on an office sandwich press, millions of Australians \"can't even put a sausage on a plate\".\n\n\"I'm not interested in dress-ups and cook-ups. I'm worried about Australians being able to afford dinner tonight,\" Littleproud told reporters in Canberra.\n\nNationals leader David Littleproud said he was not interested on \"cook-ups\" after Joyce and Hanson's steak dinner. (Alex Ellinghausen)\n\n\"She's one of the few Australians that can probably afford wagyu steak.\n\n\"What The National Party and I am worried about are the millions of Australians that last night struggled to put a sausage on the plate.\n\n\"Not a wagyu.\"\n\nHanson and Joyce fuelled speculation they may be joining forces after the One Nation leader cooked up a steak in her office on Monday evening.﻿\n\nHanson, who has been banned from the Senate for seven days over her burqa stunt in the chamber earlier on Monday, said the final decision was \"still up to Barnaby\".\n\n\"I told you I was going to wine and dine him, but we will see what happens,\" she said.\n\nHanson and Joyce fuelled speculation they may be joining forces after enjoying the wagyu dinner. (Nine)\n\nJoyce has so far refused to confirm whether he will exit politics altogether or join One Nation.\n\n﻿He plans to deliver the verdict on his political future by the end of the week.\n\nLittleproud told reporters﻿ it was \"disappointing\" that Joyce has skipped party room meetings and said he is still the member for New England.\n\n\"He made a contract with the people of New England as The Nationals member,\" Littleproud added.\n\n\"He's made a statement that he won't re-contest that seat, but that contract still holds.\"\n\nMember for New England Barnaby Joyce has refused to confirm whether he will defect to One Nation or not. (Alex Ellinghausen)\n\nHe said Joyce was still welcome to party room meetings with the Nationals, including discussions around net zero.\n\nOne Nation's approach to climate change may be the clincher for Joyce's decision, after he claimed the party's policy was, \"unlike others\", not \"barking mad\".\n\n\"﻿It's disappointing he wasn't there,\" Littleproud added.\n\n\"But he can still play a significant role in selling that message right up to when he hands over the seat to whoever the next member for New England is.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/energyaustralia-cuts-100-jobs/ec2b34da-a93c-4c45-9222-99d77175fe01",
    "title": "EnergyAustralia scraps 100 jobs in big shake-up",
    "publish_date": "Tue, 25 Nov 2025 23:24:06 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Almost 100 jobs at the EnergyAustralia office in Melbourne have been cut as the company carries out a major restructure.\n\n﻿The redundancies impact technology, finance, and procurement teams, but no jobs are going in frontline services, including call centres.\n\nThe company is also looking at redeploying some of the impacted workers.\n\nEnergyAustralia is cutting 100 jobs from its corporate office in Melbourne.﻿ (EnergyAustralia/Facebook)\n\nA spokesman for EnergyAustralia said the company's priority was supporting affected workers.\n\n\"There are changes happening to ensure we are well placed to deliver reliable energy for the long term,\" he said.\n\n\"Supporting our people through this change is a top priority, whether that's providing lots of notice to anyone impacted, through to looking at any redeployment opportunities.\"\n\nThe spokesperson said EnergyAustralia ﻿was undergoing \"a generational energy transformation and our systems and structures at our company need to reflect that\" .\n\nThe job cuts come after other energy companies reduced their workforce.\n\nThe Australian Financial Review reported this month that AGL Energy was making about 300 workers redundant as the company prepares to reskill staff for a switch to renewable energy sources.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/changes-to-b6-vitamin-safety-controls-announced-tga/5f1166c8-5f41-433d-9572-13a3df8ce14c",
    "title": "New safety controls for products containing vitamin B6",
    "publish_date": "Wed, 26 Nov 2025 00:22:04 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "New guidelines will restrict products containing certain levels of vitamin B6 in a bid to reduce the risk of nerve damage associated with the long-term consumption of high doses.\n\nThe Therapeutic Goods Administration said products with lower doses will remain available over the counter, while higher-dosage products will need advice from a pharmacist or a doctor's prescription.\n\nLower dosage products are defined as containing 50 milligrams or less per recommended daily dose, and will be available for general retail sale.\n\nREAD MORE: Catastrophic fire danger closes dozens of NSW schools ﻿\n\nGuidelines for medicines containing B6 vitamins have changed. (Getty)\n\nDoses containing between 50mg and 200mg per recommended daily dose will require the advice of a pharmacist.\n\nDoses containing more than 200mg per recommended daily dose will need a prescription.\n\nThese changes follow the TGA's final decision to amend the Poisons Standard for vitamin B6.\n\nHigher doses will require a GP's prescription. (Getty)\n\nThis decision was based on an extensive review process, including a public consultation showing strong support for tighter controls.\n\nThe decision strikes a balance between the benefits of vitamin B6, where some people may need low-dose supplementation, and the risks of prolonged ingestion of high doses, which can include damage to peripheral nerves.\n\nVitamin B6 deficiency is uncommon among the Australian population.\n\nREAD MORE: Outrage at punishment for revenge porn scandal ﻿\n\nThe average adult requirement for vitamin B6 is 1.1mg to 1.3mg per day, and the recommended dietary intake for a healthy adult is 1.3mg to 1.7mg per day.\n\nVitamin B6 deficiency is more likely to occur in the elderly, or those with alcohol dependence, obesity, or certain kidney, liver and autoimmune conditions.\n\nThese new safety guidelines will be implemented on June 1, 2027 to allow time for the necessary changes.\n\nConsumers should always check the label of any vitamin or supplement products for vitamin B6. It is also called pyridoxine, pyridoxamine and pyridoxal.\n\nIf you experience tingling, burning or numbness in your hands or feet, stop taking the product immediately and seek medical advice as soon as possible.\n\nYou should talk to a registered healthcare professional about what treatment is right for you.\n\nYou can also report any side effects to the TGA via the Adverse Event Reporting System .",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/gambling-advertising-spam-text-messages-rules-regulations-betting-companies-how-they-can-message-you-explainer/e4c69943-2fd0-4d3d-8d50-08d44ed6f75a",
    "title": "These dangerous texts are flooding millions of Aussies' phones",
    "publish_date": "Wed, 26 Nov 2025 01:38:33 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "More than three million Australians who have self-identified as being problem or at-risk gamblers could be vulnerable to a proliferation of text messages sent by betting companies.﻿\n\nWhile there are strict laws governing gambling ads on TV, radio or online, the rules when it comes to texts are much looser.\n\nSo how often can a gambling company send an SMS message, and what are the rules around the practice?﻿\n\nA phone showing a text from a gambling company to a customer. (Getty)\n\nAll direct communication must include a disclaimer﻿\n\nLegally, gambling companies are required to include just two things in direct marketing material like texts: consistent ﻿messaging about the risks and potential harm of gambling, and a way for consumers to opt out.\n\nThat means all texts must include specific taglines like \"chances are you're about to lose'\"and a link or instructions to unsubscribe.\n\nBetting companies can also only send direct marketing materials to ﻿customers who provide \"express consent\" to receive it, per the National Consumer Protection Framework for Online Wagering.\n\nCompanies that send texts after a consumer has unsubscribed are in breach of the Australian Communications and Media Authority's spam rules\n\nEarlier this year ﻿ Tabcorp copped a $4 million fine for spamming VIP customers with thousands of messages without any way to unsubscribe.\n\nIn 2022, Sportsbet was ordered to pay ﻿$3.7 million in fines for sending more than 150,000 texts and emails to about 37,000 customers who had tried to unsubscribe.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nTabcorp was found to have breached the Australian Communications and Media Authority's spam rules. (Supplied)\n\nWhy are text messages treated differently to other media, such as TV ads?﻿\n\nBut because texts count as private messages﻿, they can skirt around most public gambling advertising restrictions.\n\n\"One of the big issues here is the rise of smartphones,\" associate professor at CQUniversity's Experimental Gambling Research Laboratory Alex Russell told 9news.com.au.\n\n\"Everyone's got a smartphone in their pocket all the time, and you can bet on that all the time.\"\n\nAnd betting companies can reach customers all the time via texts.\n\nTexts which have been shown to influence consumers to place more bets, larger bets, and riskier bets according to Australian research.\n\nIn a 2018 survey from the ﻿Victorian Responsible Gambling Foundation, sports bettors received an average of 2.3 texts per week and race bettors averaged ﻿4.3 texts per week.\n\nSports bettors received an average of 2.3 texts per week from gambling operators. (Getty)\n\nThe texts often included incentives to bet, such as bonus bets and reward points.﻿\n\nIn most cases, bettors who received a text responded by placing a bet with the operator that sent it.\n\nThey were also influenced to place more bets, place unplanned bets, make ﻿impulsive betting decisions and bet more than planned.\n\n\"We do see that people are targeted more if they are more likely to lose,\" Russell added.\n\n\"So if you're getting offers, it's probably because it's good value for them [gambling companies] to send it to you, because you're going to bet and lose.\"\n\nHow much money are Aussies gamblers losing?\n\nAustralians are the biggest gambling losers in the world per capita, losing about $32 billion annually; more than governments spend on aged care in Australia.\n\nNearly 3.5 million Aussies admitted they are problem or at-risk gamblers in a recent study\n\nThe number of problem gamblers has also risen by 22 per cent since last year.\n\nAnd the losses don't just affect the individual who is gambling.\n\n\"A hell of a lot more people are harmed by gambling,\" Russell said.\n\nBut he questions how Aussi﻿es are supposed to break free from gambling addiction when betting companies are able to reach them with targeted texts any hour of the day.\n\nCalls grow for greater regulation around SMS messages﻿\n\nGambling reform advocates have called for more transparency and regulation around direct digital marketing materials like texts encouraging bets.\n\nLast year, more than 70 prominent Australians, including former prime ministers,﻿ signed an open letter calling on the federal government to ban gambling advertising in accordance with the Murphy Report parliamentary inquiry's recommendations.\n\nIndependent Senator David Pocock was one of the signatories.﻿\n\n\"The evidence shows that partial advertising bans do not work,\" he told 9news.com.au.\n\n\"The Murphy Report was clear, the Government should immediately ban direct inducements, such as the bonus bets people are offered via personalised texts.\"\n\nSenator David Pocock was one of many prominent Aussies who signed an open letter calling on the federal government to ban gambling advertising in 2024. (Alex Ellinghausen)\n\nHe called it \"predatory marketing\" that targets Aussies on a losing streak and highlighted the government's inaction in the two years since the Murphy Report was released.\n\n\"There is wide support in the Parliament to ban gambling ads and to ban inducements, but it won't happen while the Prime Minister continues to bow to pressure from the gambling companies and the powerful vested interests who are making too much money off of the suffering of Australians,\" Pocock said.\n\nThe Albanese government has not committed to a ban on gambling advertising.\n\nLast week, the AFR reported the government is actually expected to abandon plans for a total ban on online gambling advertising.\n\nRussell fears it will only do more harm to already struggling Australians.\n\n\"How are you meant to not experience a problem when gambling is so saturated and everywhere?\" Russell said.\n\n\"How are you meant to get away from this?\"﻿\n\nThe Albanese government has not committed to a ban on gambling advertising. (Getty)\n\nHow to stop or unsubscribe from ﻿betting company texts in Australia\n\nGambling companies are legally required to include a way for consumers to unsubscribe from text marketing in any texts they send.\n\nIn some cases, consumers must text 'STOP' or a similar phrase to a specific number.\n\nIn others, they can click an unsubscribe link in the text and follow the prompts to opt out of text message marketing.\n\nAustralians can also register with BetStop , a free government initiative that blocks all licensed Australian online and phone gambling providers.﻿\n\nAfter joining the National Self-Exclusion Register﻿, online and phone gambling providers will not be able to send you marketing messages.\n\nHow to report spam texts from gambling companies\n\nIf you think a betting company has broken Australia's spam rules, you can report it to the ACMA by submitting a complaint form.\n\nSpecific spam texts can also be forwarded to the ﻿ACMA on 0429 999 888.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/fame-brings-risk-of-early-death-comparable-to-smoking-study-finds/20b1ffb3-5c38-4af0-90aa-ca7f0fc28a20",
    "title": "Rock-star fame as bad for you as smoking, study claims",
    "publish_date": "Wed, 26 Nov 2025 00:26:03 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Being a famous rock star is a common dream, but a new study suggests achieving that goal comes with an early grave.﻿\n\nA peer-reviewed study published in the Journal of Epidemiology and Community Health examined the life expectancies of famous singers compared to those who never reached the limelight.\n\nThe stars were found to die about four years earlier - even though overall, wealthier social brackets are associated with a higher life expectancy.\n\nFamous singers tend to die younger. (Getty)\n\nBut it's far from clear whether it's fame itself, the demands of the music industry, or the lifestyle associated with being a musician, which contributes to this heightened risk, explain the researchers.\n\nThe researchers compiled a list of 324 celebrity singers who were active between 1950 and 1990, and matched them with 324 non-celebrity singers for birth year, gender, nationality, ethnicity, music genre, and whether or not they were solo artists or in a band.\n\nOf the sample, 83.5 per cent were male, 61 per cent were from North America, and the remainder from Europe and the UK.\n\nThe pressures of public scrutiny were a possible influence. (Getty)\n\n﻿Most singers (65 per cent) were rock artists, followed by RnB (14 per cent), pop (9 per cent), New Wave (6 per cent), rap (4 per cent) and electronica (2 per cent).\n\nFifty-nine per cent of the singers were in a band, 29 per cent were solo artists, and 12 per cent had careers spanning both.\n\nAnalysis of the data showed that, on average, famous singers survived until they were 75; less famous singers survived until they were 79.\n\nFame could be as unhealthy as smoking. (Getty)\n\nWhile band membership was associated with a 26 per cent lower risk of death compared with going it alone, the inclusion of this variable didn't influence the overall effect of fame, as famous singers were still 33 per cent more likely to die earlier than their less well-known counterparts.\n\n\"Together, the analyses indicate that an elevated risk emerges specifically after achieving fame, which highlights fame as a potential temporal turning point for health risks including mortality,\" the researchers said.\n\n\"Beyond occupational explanations, our findings suggest that fame adds further vulnerability within an already at-risk group.\"\n\nThe heightened risk associated with fame is comparable to other known health risks, such as occasional smoking, which confers a heightened risk of death of 34 per cent, they said.\n\nA possible explanation for the findings may lie in \"the unique psychosocial stress that accompanies fame, such as intense public scrutiny, performance pressure, and loss of privacy,\" they suggested.\n\n\"These stressors may fuel psychological distress and harmful coping behaviours, making fame a chronic burden that amplifies existing occupational risk,\" they said.\n\n\"Being famous appears so detrimental that it overrides any potential benefits associated with high socioeconomic status. Again, this highlights the increased vulnerability of famous individuals, suggesting a need for targeted protection and support for this population.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/nige-jones-city-of-joondalup-councillor-apologises-for-trying-to-bill-ratepayers-for-strip-club-beer/57b20df5-ca5e-440f-ab84-f1f0154dae89",
    "title": "Councillor apologises for trying to bill ratepayers for strip club beer",
    "publish_date": "Tue, 25 Nov 2025 12:30:00 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A councillor at one of Perth's biggest local governments has apologised for trying to bill ratepayers for a trip to a strip club while on council business in Adelaide.\n\nCity of Joondalup councillor Nige Jones called the move a \"genuine mistake\", claiming he walked into Crazy Horse Revue – which has a bright neon sign at the front and labels itself online as \"Australia's most iconic gentleman's club\" – wanting a late-night beer before an early flight and stayed \"20 minutes max\".\n\n\"I couldn't sleep, and I went out for a drink thinking it might help me sleep, went into the first bar two minutes from where I was,\" he told Perth's 6PR radio on Tuesday.\n\nREAD MORE: The supermarket change that may revolutionise how Aussies shop\n\nCity of Joondalup councillor Nige Jones called the move a \"genuine mistake\". (9News)\n\n\" … got a beer, and then a few minutes later a girl walked out, skimpily dressed, and I realised what's going on.\n\n\"So I skolled and went.\"\n\nOn August 26, he submitted an expense claim for costs associated with the conference trip and included the strip club beer.\n\nThe council censured him earlier this month and ordered him to undertake an \"education course on ethical decision making\" and provide a \"written reflection on his actions\".\n\n\"His claim for reimbursement of an alcoholic beverage at the Crazy Horse Revue and attendance at this establishment while on City-funded travel does not meet the standards of conduct expected of a Council member,\" the council noted .\n\nThe reflection was sent in on November 19 and Jones said he'd booked himself in for the course in March, the earliest date available.\n\n\"It's definitely not where a councillor should be,\" Jones told 6PR.\n\n\"I accept that, and I apologise to the ratepayers for that, but like I said, I didn't actually receive the reimbursement – the council picked up on it straight away.\"\n\nREAD MORE: One state just turned the tables on renting\n\nNige Jones said he walked into the Crazy Horse Revue wanting a late-night beer before an early flight and stayed \"20 minutes max\". (9News)\n\nREAD MORE: Accused Melbourne CBD stabber attempts bail despite safety fears\n\n﻿Jones said the strip club visit took place about 11.30pm and he had \"documentation to prove that I was in the next pub not shortly after\".\n\n\"At the time, I just thought it was a mistake and I left,\" he said, admitting he was embarrassed about the incident now.\n\n\"It was like, you know, it was 20 minutes max in there.\n\n\"You know, if I was a pervo, I would have stayed in longer.\"\n\nIf he had his time again, he \"wouldn't have put the bloody receipt in\".\n\n\"But I did it in kind of innocence, because I didn't think I was up to no good,\" Jones said.\n\n\"I was just looking for a late beer.\n\n\"I was in an area that I'm not familiar with, you know, I'm not familiar with Adelaide at all.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/social-media-ban-australia-how-to-download-data-export-memories-backup-accounts-explained/64d4d185-6268-4e1c-923f-2926fa1e4609",
    "title": "Thousands of Aussies will lose their data in a matter of weeks",
    "publish_date": "Tue, 25 Nov 2025 04:27:07 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Australia's social media ban for under-16s is looming and many young Aussies are racing to save their data before losing access to Instagram, TikTok and other platforms.\n\nEarly next month, all Australian users under the age of 16 will be booted from a wide range of 'age-restricted' social media platforms.\n\nThe ban has been divisive and though many young Aussies have railed against it, there seems to be no stopping it now.\n\nThousands of Aussies will lose priceless data in a matter of weeks when the under-16s social media ban starts. (Getty/iStock)\n\nWith that in mind, here's how to download your data, export memories and backup your accounts before the ban﻿.\n\nWhen does the social media ban start in Australia?\n\nThe social media ban will go into effect on December 10.\n\n﻿The ﻿eSafety Commissioner is already consulting with social media platforms that will be affected by the ban about their plans to \"prevent and remove underage account holders\" from that date.\n\n\"We expect age-restricted social media platforms to comply with the requirements once they take effect,\" the eSafety website reads.\n\nWhich social media apps are banned?\n\nThe list of 'age-restricted' social media platforms that will be required to adhere to the ban from December 10 currently includes:\n\nFacebook\n\nInstagram\n\nKick\n\nReddit\n\nSnapchat\n\nThreads\n\nTikTok\n\nTwitch\n\nX (formerly Twitter)\n\nYouTube\n\n﻿Meta's Messenger and WhatsApp, as well as Discord, Pinterest, YouTube Kids, and Roblox, are not included in the ban.\n\nREAD MORE: Why the crypto market is crashing\n\nWill my accounts be deleted or just deactivated?\n\nThis will depend on the platform.\n\nSocial media platforms are not required to delete those accounts, but some may.\n\nAccording to the eSafety website, age-restricted platforms ﻿will be required to stop under-16s from using any existing accounts or creating new ones from December 10.\n\nUnder the ban, age-restricted platforms are allowed to let under-16s deactivate their accounts and retain all the data associated with them.\n\nThey can then return to those accounts once they turn 16.\n\n\"But young people shouldn't rely on platforms to provide this option,\" the eSafety website reads.﻿\n\n\"It's best that they download any data they want to save, including connections, posts, chats, photos and videos – before 10 December.\"\n\nThe ﻿eSafety website urges under-16s to take screenshots or download posts, chats, photos or videos they want to keep when the ban goes into effect.\n\nHow do I download my TikTok drafts before the ban?\n\nTikTok doesn't allow users to download drafts to their devices directly, but there is a workaround.\n\nIf you post a draft as a private video you will be able to save it to your phone's camera roll without anyone else seeing it on TikTok.\n\nThe steps are as follows:\n\nOpen your drafts folder Tap the draft you want to save In the editing screen, tap 'next'﻿ Tap 'everyone can view this post' and change it to 'only you' Hit post to post it privately On the live video, tap the three dots in the bottom right Tap download - it will then appear in your camera roll﻿\n\nIf you want to download TikTok videos you've posted to your account to your camera roll before the ban starts, just follow steps six and seven.﻿\n\nDownloading TikTok drafts is as simple as posting them privately, then tapping 'download'. (Nine)\n\nCan I save my Snapchat Memories to my camera roll all at once?\n\nIf you don't want to download your memories one by one, you can request a Memories-only Snapchat export.\n\nThe steps are as follows:\n\n﻿Log into your Snapchat account online here , or go to the 'Settings' section on the Snapchat app Select 'My Data﻿' Under 'select data to include,' click the 'export your memories' toggle on Click 'request only memories' Select a date range of memories you want to receive (the bigger the range, the longer the download will take to process)﻿ Confirm your email address so you can be notified when your data is ready﻿ Hit 'submit'﻿\n\nOnce your memories are ready, you'll get an email with a link that will allow you to download them.\n\nIt can take several days for Snapchat to process data requests, so make sure to get in well before the ban takes effect.﻿\n\nHow do I export Instagram chats and photos?\n\nThe best way to save large amounts of data from Instagram to your device﻿ is through Accounts Centre.\n\nThe steps are as follows﻿:\n\nGo to your profile in the app and tap the three lines in the top right ﻿Tap Accounts Centre, then 'Your information and permissions' Tap ﻿'Export your information' Tap 'Create export'﻿ Select the profile or account you want to save information from Tap 'Export to device' Click into 'Customise information' and tick the boxes beside everything you want to save, such as comments, media (photos) and messages, then hit 'Save' Select a date range, media format and quality, and input your email Hit 'start export'﻿\n\n﻿You will receive an email to notify you when your data is ready to download.\n\nAs with Snapchat, ﻿this can take time so make sure to get in early.\n\nWhat happens to my data if I don't download it before the deadline?\n\nIf under-16s don't download their data from age-restricted social media platforms ﻿before the deadline, they risk losing access to it.\n\nAs they will no longer be able to access ﻿age-restricted social media accounts from December 10, they will not be able to access or save the data associated with those accounts.﻿\n\nHow will social media apps know if I am under 16?\n\nAge-restricted social media platforms are responsible for identifying the accounts of under-16s.\n\nSome platforms will use existing data to confirm if users are 16 or older (e.g. an account that has been active since 2006 is unlikely to belong to an under-16).﻿\n\nSome may also require some users to prove their age, though the ways in which they do this will vary between platforms.\n\nAny methods ﻿age-restricted social media platforms use to confirm users' age must meet Australia's regulatory requirements and respect privacy laws and digital rights.\n\nDiscord, Pinterest, YouTube Kids and a few other social media platforms have escaped the ban. (Getty)\n\nDo I have to upload my ID to keep my social media account?\n\nOne of the options for users to prove their age may be to ﻿provide a government-issued ID - however, this cannot be the only option.\n\nAll ﻿age-restricted social media platforms must also offer a reasonable alternative when performing age checks.\n\nThat's because ﻿Social Media Minimum Age legislation specifically prohibits platforms from compelling Australians to provide a government-issued ID or use an Australian Government accredited digital ID service to prove their age.\n\n\"No one who is 16 or older is prevented from having a social media account because they choose not to provide government ID,\" per the eSafety website.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/football-matildas-preparing-for-new-zealand-ahead-of-asian-cup/106054718",
    "title": "Matildas prepare to face New Zealand with one eye on Asian Cup",
    "publish_date": "Wed, 26 Nov 2025 01:59:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "Caitlin Foord says the Matildas are mindful they cannot waste any time in the build-up to next year's Asian Cup.\n\nThe Matildas are in camp for their final two matches before the Asian Cup kicks off in Australia on March 1.\n\nHeyman 'uncomfortable' with missing ALW for Matildas Michelle Heyman is 'uncomfortable' with the A-League Women continuing without international players as the Matildas prepare for their last matches before the AFC Women's Asian Cup.\n\nThey play New Zealand in Gosford on Friday night, before the two teams meet again in Adelaide on Tuesday.\n\nThe Matildas have produced mixed results since Joe Montemurro took over as coach in June.\n\nThey host New Zealand off the back of a frustrating 3-0 defeat to European champions England in October, which proved a reality check.\n\n\"We need to get the most out of these games (against New Zealand),\" Foord said.\n\n\"We have to tighten up what didn't really go well last camp and really make the most of these two games, because it is the final prep that we have.\n\n\"Once we get into camp before the Asian Cup, it's going to come really fast.\"\n\nSam Kerr is set to play for the Matildas against New Zealand. (Getty Images: Andy Cheung)\n\nSam Kerr is set to play on home soil for the first time in two years after initial doubts over her fitness.\n\nKerr was rested for two consecutive matches by Chelsea as part of her rehabilitation following the knee injury she suffered at the beginning of 2024.\n\n\"She's [Kerr] here, and she's been part of training, so she looks fine to me,\" Foord said.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/inflation-3-8pc-october-2025-australia-bureau-of-statistics/106054014",
    "title": "Breaking: Inflation jumps to 3.8pc in October, up from 3.6pc in September",
    "publish_date": "Wed, 26 Nov 2025 01:02:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "Inflation jumped to 3.8 per cent in October, up from 3.6 per cent in September.\n\nThe largest contributors to annual inflation were housing (+5.9 per cent), food and non-alcoholic beverages (+3.2 per cent), and recreation and culture (+3.2 cent).\n\nThis is the first release of the complete Monthly Consumer Price Index (CPI) from the Australian Bureau of Statistics (ABS).\n\nMichelle Marquardt, ABS head of prices statistics, says it marks the transition from the traditional quarterly CPI to the complete monthly CPI as Australia's primary measure of headline inflation.\n\nAustralian statistician David Gruen says the transition to complete inflation data every month will give everyone a \"quicker read\" on inflation.\n\nHowever, he said monthly data was inherently more volatile than quarterly data, so that would take some getting used to.\n\nLoading...\n\nHe said the quality of the seasonal adjustments in the new monthly data would also improve over time.\n\n\"The benefit of the monthly CPI is that it's more frequent,\" Dr Gruen told the ABC.\n\n\"One drawback is that for about half the basket, we only have 18 months of data.\n\nForget AI. Here's a real Aussie bubble Amid global warnings of impending financial doom, APRA and the Reserve Bank are far more concerned about a home-grown bubble, one that's been taking in oxygen for almost three decades.\n\n\"So [for] the seasonal patterns, the usual period of time that we use for seasonal adjustment is three years, so we will be doing seasonal adjustment on some part of the basket with less than the ideal amount of information.\n\n\"[So] in terms of being confident about the seasonals, I think the complete monthly CPI is going to provide more information but the quality of that information is going to improve as the length of time expands,\" he said.\n\nThe data show annual goods inflation was 3.8 per cent in October, up from 3.7 per cent in September. It was only 1.2 per cent in June.\n\nAnnual services inflation was 3.9 per cent in October, up from 3.5 per cent in September.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/revisiting-the-past-to-slow-dementia-progression/106051388",
    "title": "Australians with dementia urged to revisit the past like Hemsworth family",
    "publish_date": "Wed, 26 Nov 2025 00:29:26 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The packet of medication in the fridge was the first thing to set off alarm bells inside Helena Popovic's head.\n\nThe Gold Coast general practitioner had been cooking a meal for her elderly father Ilija Popovic in his home when she spotted it.\n\nHe had been depressed and withdrawn from family and friends, but his daughter put it down to a broken heart from the death of her mother and the love of her father's life.\n\nThe prescription medication in the fridge suddenly made sense.\n\n\"Dad was withdrawn, his memory wasn't great and he was so depressed, but I just wrote it off as grief,\" Dr Popovic said.\n\nMr Popovic was in the early stages of Alzheimer's and vascular dementia.\n\nHer parents had been keeping the diagnosis a secret.\n\nHelena Popovic ensured her father stayed social after his dementia diagnosis. (Supplied: Helena Popovic)\n\nWith no time to waste, Dr Popovic researched all sorts of methods to keep him engaged as his condition progressed.\n\nOne treatment stood out to her.\n\nReminiscence therapy involves people with dementia talking about the past to try to stay engaged in the present.\n\n\"Luckily he still knew me but he was just so depressed, so I said to him 'what can I do to help, Dad?',\" Dr Popovic said.\n\nTickets booked and suitcases packed, the father and daughter globetrotters embarked on the trip of a lifetime to the other side of the world before Mr Popovic deteriorated further.\n\nThey stayed with Mr Popovic's cousins who cooked him his favourite meals like sarma, or stuffed cabbage rolls. (Supplied: Helena Popovic)\n\nBack to Belgrade\n\nBelgrade in Serbia was the place where the memories really came flooding back.\n\nIt was in the former capital of socialist Yugoslavia where love blossomed between Mr Popovic and his wife, Dragica, and from where the pair fled as political refugees in 1971.\n\n\"Taking him back to his homeland really brought him to life,\" Dr Popovic said.\n\n\"We reunited with his old friends and really had a great adventure.\"\n\nThe pair visited sites like the Kalemegdan Fortress, where he had played at as a child.\n\nIt brought back memories of climbing walls and hanging off trees.\n\n\"It was also where he'd experienced his first kiss. I could see the emotion in his eyes as he recalled it,\" Dr Popovic said.\n\nThe pair wandered around Belgrade reminiscing about \"the good old days\". (Supplied: Helena Popovic)\n\nMr Popovic's favourite food was kajmak, a variation of clotted cream spread on freshly baked bread.\n\n\"He hadn't eaten kajmak in decades and he just grinned at every meal, taking in his history,\" she said.\n\nReminiscence therapy\n\nMemory stimulation through travel is a concept explored by Hollywood superstar Chris Hemsworth in his new documentary A Road Trip To Remember, which launched on the Gold Coast this month.\n\nHis father Craig Hemsworth has early-onset Alzheimer's.\n\nIn the film the pair travelled back to Hemsworth's childhood home in Melbourne which producers re-furnished to look exactly as it did when they lived there.\n\nThe Hemsworths revisited Bulman, a remote Aboriginal community they had lived in decades ago. (Supplied: Disney)\n\nThe pair also road tripped to a remote Indigenous community in the Northern Territory where the family once lived.\n\nThere they connected with friends they had not seen in decades and engaged in the nostalgic sights, sounds and smells of the Australian outback.\n\nIn 2025 there are more than 433,000 Australians living with dementia, and the illness is now the leading cause of death for Australians, according to Dementia Australia.\n\nDementia Australia client services director Barbra Williams said socialising and connecting through meaningful experiences, like reminiscing the past, can help delay dementia and its progression for those already living with the illness.\n\n\"Reminiscing can improve a person's sense of wellbeing and belonging. It helps them understand their place in the world and their value to their family and social network,\" she said.\n\nChris Hemsworth took his father on a trip down memory lane to try to combat his Alzheimer's symptoms. (Supplied: Disney )\n\n\"Visiting old places where you grew up or looking through photo albums are great things to keep people's minds active and connected to the world around them.\"\n\nMr Popovic lived for another decade after his Serbian trip down memory lane and died while still living in his home in 2019 at 89 years of age.\n\nUp until his death, Dr Popovic made sure her father stayed engaged in his community, doing weekly activities like Meals on Wheels and catching up with friends.\n\n\"Loneliness and social isolation drives dementia and they will forget you if you stop visiting,\" she said.\n\n\"People have to be less scared of continuing their relationship with someone with dementia. Just be a little bit more patient because they might repeat stories.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/family-sues-geelong-hospital-for-alleged-medical-negligence/106050058",
    "title": "Family sues Geelong Hospital over alleged medical negligence",
    "publish_date": "Wed, 26 Nov 2025 00:01:21 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The family of a Port Fairy woman who died in hospital is suing the healthcare provider over alleged medical negligence.\n\nJennifer Buchanan died in Geelong Hospital in February 2023, after she was admitted for chemotherapy treatment for acute myeloid leukaemia.\n\nA statement of claim filed in the Victorian Supreme Court lists Ms Buchanan's husband, Paul Buchanan, and her two daughters as the three plaintiffs in the matter.\n\nCourt documents lodged by the family's lawyers said Ms Buchanan was admitted to hospital in late December 2022 to begin chemotherapy.\n\nAbout a month later, she was admitted to the intensive care unit.\n\nThe documents allege Ms Buchanan suffered a perforated right internal jugular vein when a catheter was inserted while she was in ICU.\n\nShe developed haemothorax, a condition where blood accumulated between her lungs and rib cage, according to the claim.\n\nThe documents said she opted to be transferred to palliative care on February 10, on the advice of Barwon Health, and died four days later.\n\n\"The cause of Jennifer’s death was multi-organ failure due to sepsis and re-accumulating iatrogenic haemothorax,\" the documents said.\n\nIt's alleged, the hospital should have known that the risks of inserting a catheter into a vein carried the risk of a perforation of a blood vessel.\n\nThe documents said the hospital did not advise Ms Buchanan or her family of the increased risk.\n\nThe statement of claim alleged the hospital breached its duty of care, and that the perforation would not have occurred and Ms Buchanan would not have died if the hospital had exercised reasonable care.\n\nBarwon Health's lawyers declined to comment.\n\nIn a statement provided by his lawyers, Paul Buchanan said the proceeding followed a hospital review of his late wife's treatment, which the family had been \"very disappointed\" in.\n\n\"I had hoped that the devastating outcomes of her treatment would be recognised and systems changed that would ensure other families would not have to endure what we went through,\" he said.\n\n\"With our questions and concerns about Jennifer’s treatment not satisfactorily answered, we decided to follow a legal path to gain the answers we sought.\"\n\nA trial has been set down for October 2026.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/the-art-of-the-inner-child/106038688",
    "title": "Want to connect with your inner child? These artists can show you how",
    "publish_date": "Wed, 26 Nov 2025 00:00:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "People often assume that Beci Orpin's art is for kids.\n\n\"My work's always been quite colourful, it has a naivety to it, and those two things make people go, 'oh it's for children',\" says the Naarm/Melbourne-based artist.\n\nAn illustrator, graphic designer and installation artist, Orpin's work does often appeal to kids, and she's released a series of kids' books.\n\n\"But I also think it's just as important for adults.\"\n\nTrading in whimsy and delight, Orpin's work is primarily aimed at an older audience, but one that may need some help connecting to their inner child. This includes her latest installation: a giant plush rabbit called Bunny Dearest, as part of the Joy exhibition at the Immigration Museum in Melbourne.\n\n\" My work creates that sense of wonder and that sense of joy, which I think people all associate with childhood,\" she adds, \"But it doesn't mean it's childish. \"\n\nOrpin's playful style doesn't stop her from engaging with big topics, like climate change, politics and refugee rights.\n\nThis graphic about compassion by Beci Orpin became so popular online she was commissioned to turn it into a book, called Take Heart, Take Action. (Supplied: Instagram)\n\n\"If you present those issues with a sense of optimism and simplicity then it's really digestible for a whole lot more people, and potentially more people will pay attention to it as well,\" she says.\n\nThree decades into a successful career, Orpin says she can still get frustrated about \"the perception\" of what she does.\n\n\"There's a lot of things I could say about the patriarchy and women artists in general not being taken seriously, especially those who base work in craft,\" she says.\n\nBut although she's struggled at times to figure out where her work fits, she now says that's part of the fun of it.\n\n\"Now I say I sit between the cracks, and that's exactly where I want to sit.\"\n\nChildlike or childish?\n\nCeramic artist Glenn Barkley knows the feeling of being misunderstood and miscategorised all too well.\n\n\"Someone once wrote a review of my work and some other artists who are my peers and they said that our work is childish,\" the artist based on Gadigal land in Sydney tells Namila Benson on ABC iview's The Art Of.\n\n\"I don't think it's childish, I think it's childlike, and they're two completely different things. I think to be childlike is admirable.\"\n\nReplete with pastel colours and hand-made shapes, Barkley constructs intricate and surprising ceramics, covering everything from vases to denim outfits.\n\nGlenn Barkley's intricate, colourful ceramics are assembled by hand. (Supplied by the artist and Sullivan+Strumpf: Photos by Aaron Anderson and Mark Pokorny)\n\nA writer and curator, his passion for ceramics started when he attended a casual pottery workshop.\n\n\"From the moment I touched the material I thought, 'oh, I think I've wasted my life. I should have been doing this 20 years ago'!\"\n\nBarkley's work may be bright and colourful, but it doesn't shy away from more adult topics. His work Stuff White People Like is all about our cultural obsession with conspiracy theories, and features busts of Harold Holt and JFK.\n\n\"I do like big political ideas and cultural ideas,\" Barkley says, \"but sort of looking at them the way a child might.\"\n\nGetting into the gross stuff\n\nThe inner child isn't only drawn to bright colours and simple patterns — something the Snuff Puppets seize upon.\n\nStream The Art Of... on ABC iview Hosted by Namila Benson, the ABC's bold and vibrant arts and culture show The Art Of… returns for another season, taking you into the studios, brains and hearts of some of Australia's most exciting creators.\n\nBased out of Naarm/Melbourne, this group of artists create riotous public shows with giant puppets, harnessing the fascination people of all ages have with things that are gross, silly, over-the-top.\n\nStanding at about 10-feet high, the puppets represent everything from enormous babies to seagulls to \"the full range of genitals\".\n\nChief executive and co-artistic director Andy Freer says the sheer scale of the puppets takes adult audience members back to childhood.\n\n\"You have an adult human, about five or six foot, but the puppet is like 10 foot, and so the adult becomes the child,\" says Andy Freer. (Supplied: Snuff Puppets)\n\n\"As a child you see these big adult heads coming down at you, and all those emotions and memories come flooding back — there is fear, but there is also joy and excitement,\" he says on The Art Of.\n\n\" And I think as we grow older, we do lose this sense of excitement and we get stressed about very boring things. \"\n\nFreer says they like playing with \"very taboo subjects\", and puppets help them push those limits.\n\n\"You can do things with puppets that you really can't do with any other human actor: you can chop their heads off, you can disembowel them, they can give birth.\"\n\nOne of their notorious skits, performed at festivals all around the world, is a comment on the meat industry.\n\nIt starts off with a herd of puppet cows creating a ruckus among a crowd, which always gets a lot of chuckles. But then a man dressed as a butcher arrives to round them up, and the performance turns into a cacophony of blood, excrement (both fake, of course) and general pandemonium.\n\nLoading...\n\n\"It just gets worse and worse and worse, and people are horrified,\" Freer says with a chuckle.\n\n\"But they've been laughing, and horrified at the same time, so they're reverting to this very immediate, childlike response.\"\n\nThe audience reactions go beyond shrieks and chuckles, too. Freer says they once received a random postcard after one of their shows from someone who had been struggling with depression.\n\nThe person said the \"chaos and the magic and the wildness\" was an invaluable help.\n\n\"It made him realise that life can be a crazy madhouse, and we can all have fun and it's not so serious after all.\"\n\nAccessing your inner child\n\nBeci Orpin says she is well and truly still in touch with her inner child.\n\n\"She's never going away,\" she laughs.\n\n\"It's not even something that I think about, I feel like I learned it from my mum, who is super young at heart.\"\n\nOrpin does admit that her perception of joy has been changing as she gets older, which has influenced her work.\n\n\"The joy of experiencing something for the first time is really hard to get, so as you get older the joy seems to come from small things, like if I get a perfect cup of tea in the morning,\" she says.\n\n\"Or it's really large, unexpected things, and so that's what I was trying to create with Bunny Dearest.\"\n\nShe believes that pushing yourself to have new experiences is key to staying in touch with your inner child.\n\nBeci Orpin's \"ode to the sneezy season\" for the Springtime Art Show at Melbourne's Backwoods Gallery. (Supplied: Beci Orpin)\n\n\"I've run lots of workshops, and the adults often enjoy it more than children, and my theory is it's because adults don't allow themselves the time and the space to actually make something,\" she says.\n\n\"So, when their kids are sitting down and making something they're like 'oh great I can do this too'.\"\n\nGlenn Barkley says making art can definitely connect you with your inner child, but that's not the final step.\n\n\"I also think you need to get your inner child to take you to your inner adult, and those two people need to meet each other.\"\n\nWatch the new season of The Art of... free on ABC TV and ABC iview.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/tas-peacock-centre-inpatient-beds-shut-due-to-rats/106053542",
    "title": "Mental health beds closed in Hobart due to rat infestation",
    "publish_date": "Tue, 25 Nov 2025 23:41:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "A 12-bed public mental health facility in southern Tasmania has been closed while it addresses a rat infestation.\n\nPeacock House is the inpatient service of the wider Peacock Centre, which remains open.\n\nThe Health Department, which operates the facility, said in a statement that after a \"rodent issue\" was noticed earlier this month, it immediately began industrial cleaning and pest control.\n\nThe department said clients were being cared for at \"appropriate alternative mental health services that meet their clinical needs\".\n\n\"Affected staff are being redeployed to other acute mental health services within the south,\" it said.\n\nThe department also said it \"engaged with WorkSafe Tasmania, an occupational hygienist and facilities management in relation to remedial works required to rectify this issue\".\n\nThe broader Peacock Centre includes Safe Haven, for people who are suicidal or in acute mental health distress, and the Mental Health Integration Hub.\n\nThe Peacock Centre provides a dedicated emergency support service for people with acute mental illness. (ABC Hobart: Jo Spargo)\n\nBoth are operating normally, the department said, while Peacock House would re-open \"as soon as it is appropriate to do so\".\n\nEmily Shepherd, from the Australian Nursing and Midwifery Federation, said the beds were being closed as patients were discharged, and it welcomed the fact that Statewide Mental Health Services had been \"proactive in managing this issue\".\n\nThe Health Department said an occupational hygienist was scheduled to inspect the site today.\n\nPeacock Centre's troubled history\n\nThe North Hobart centre has been substantially damaged by two fires in the past decade.\n\nA 54-year-old man was found guilty of arson after setting fire to the centre's reception area in 2016.\n\nThe heritage building was in the process of being rebuilt when it was again damaged by a deliberately lit blaze on Christmas Eve, 2021.\n\nThe Peacock Centre was first damaged by fire in 2016. (Supplied: Nikki Long)\n\nTash Smyth, the chief executive of Mental Health Lived Experience Tasmania, told ABC Mornings she was confident people could still find the help they needed during the closure.\n\nBut she said Peacock House was a \"vital service\" and needed to get \"back up and running as soon as possible\".\n\nTherapists, patients concerned over Hobart Clinic closure For more than four decades, The Hobart Clinic has provided private mental health services to clients. Since the announcement of its October closure, clinic staff, therapists and patients have warned of the negative impact on those reliant on the service.\n\n\"We have wanted this type of service for years,\" she said.\n\n\"And we've gotta remember the other services that the Peacock Centre offers, as in the Safe Haven and the Integration Centre.\"\n\n\"Having all of these combined in a non-clinical setting is just vital.\"\n\nMs Smyth encouraged people in need to call the Access Mental Health Phoneline on 1800 332 388.\n\nState's mental health beds decline\n\nDedicated mental health services in Tasmania have come under strain in recent years.\n\nIn 2023, the St Helen's Private Hospital in Hobart closed after operator Healthscope said it could not afford to maintain the heritage building.\n\nSt Helen's offered 31 inpatient mental health beds and an eight-bed mother and baby unit for mothers needing help with sleep and post-natal mental health problems.\n\nThe hospital also treated people with drug and alcohol-related challenges.\n\nThis year, the 27-bed Hobart Clinic in Rokeby — southern Tasmania's remaining private mental health facility — closed for 17 days due to financial problems.\n\nThe Hobart Clinic has had financial troubles and re-opened after a rescue bid by former staff. (ABC News: Luke Bowden)\n\nThe ABC also reported that the clinic had failed to meet a key requirement during a regulatory audit.\n\nA six-month lifeline from the state government kept the clinic afloat, with clinicians now driving a long-term plan to keep the site open.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/afl-zach-merrett-steps-down-as-bombers-captain/106053918",
    "title": "Merrett gives up Bombers captaincy after failed Hawks trade",
    "publish_date": "Tue, 25 Nov 2025 23:24:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Zach Merrett has stepped down as Essendon men's captain after his failed trade request to Hawthorn left his position untenable.\n\nMerrett never appeared likely to retain his captaincy after trying to force an exit from the Bombers, despite being contracted until the end of the 2027 season.\n\nAppointed captain in 2023, the 30-year-old told teammates he would step down from the role after returning to preseason training.\n\nVice-captain Andrew McGrath is the early favourite to become the club's next skipper.\n\n\"It's been weighing on my mind around who is the best person to lead this club and [the] group moving forward, and I feel like I've come to the decision that I'm not the right person,\" Merrett said in a club statement.\n\nMerrett trade saga shows it is time to stop using first-round picks to judge deals The AFL trade period offered three different test cases on just how much value a first-round pick holds during negotiations. Two stars got their moves, while one was left stranded.\n\nDesperate for success, Merrett had requested his trade to Hawthorn after losing \"love and connection\" with the Bombers.\n\nThe six-time Bombers best-and-fairest winner has not won a final across 251 matches for Essendon since his debut in 2014.\n\nThe Bombers last won a final in 2004.\n\nMerrett was forced to remain at the club after Essendon, refusing to trade the star midfielder under any circumstances, knocked back every offer from the Hawks.\n\nJy Simpkin, who similarly had a failed trade from North Melbourne despite being contracted, is poised to join Merrett in giving up the captaincy.\n\nSimpkin, desiring more midfield time, could not engineer a trade to another club.\n\nNorth Melbourne has the second-longest drought without a finals win, dating back to 2015.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/voter-study-shows-coalition-economic-losses/106053538",
    "title": "Voters rate Dutton worst leader in decades and prefer Labor on economy",
    "publish_date": "Tue, 25 Nov 2025 23:00:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "For the first time in decades, the Coalition has lost its perceived advantage on economic management, according to a leading academic study released today.\n\nThe results of the Australian Election Study (AES) are a snapshot of the opposition's struggle to win over voters in this year's federal election campaign, suggesting the Liberal Party has lost its grip on one of its longest-held strengths.\n\nIt suggests several short- and long-term problems for the opposition to overcome, with voters preferring Labor's offering on economic management, taxation, housing affordability, and the cost of living.\n\nThe research also found Peter Dutton was the least popular major party leader the AES had ever polled, dating back to the study's beginning four decades ago in 1987.\n\nThe post-election survey of voters' attitudes and behaviour is conducted by the Australian National University (ANU) and Griffith University after every federal election and asks voters for their views on party policies and attitudes to democracy.\n\n\"The Liberals have really ceded the area of economic management to Labor,\" ANU politics professor Ian McAllister said.\n\n\"What it suggests is that it's going to be very difficult for the Liberals to get an advantage back in that area.\n\n\"You really have to build up an area as your policy strength, and once you lose that, it's very difficult to get back.\"\n\nAs recently as 2019, the Coalition held a 26-percentage-point lead over Labor on management of the economy, but that lead slid in 2022 and again in 2025.\n\nNow, the Coalition trails by four percentage points.\n\n\"By and large, people are looking for a party that really isn't going to do any short-term harm to them in terms of economic policy, and at the moment that's the Labor government,\" Professor McAllister said.\n\nThe study has only asked voters about economic management since 2010, but has tracked voter preferences on taxation policy since 1990.\n\nThe Coalition has also traditionally been preferred by voters in that policy area, with the 2025 election the first where Labor's tax policy was preferred.\n\nThe detailed survey was conducted by the ANU and Griffith University after the May 2025 election, with 2,070 respondents recruited from randomly selected addresses across the nation, as well as from participants in previous waves of the study.\n\nWhen asked about the state of the economy, 42 per cent of Australians thought it would be worse in a year's time than it was today, with just 24 per cent thinking it would be in better shape.\n\nWhile voters were generally pessimistic, they were less pessimistic than in the wake of the 2022 election, when 53 per cent of Australians thought the economy would worsen.\n\nAll up, voters preferred Labor's policies in nine of the 10 policy areas surveyed in 2025, with health, education and climate change among the government's strongest areas.\n\nThe only policy area in which Labor trailed the Coalition was national security.\n\nThe Coalition has acknowledged its need to improve its economic credentials since the election, when it campaigned on a promise to repeal tax cuts that Treasurer Jim Chalmers announced in March's federal budget.\n\nThe opposition has sought to frame its new climate emissions and energy policy around power prices and the cost of living, and Shadow Treasurer Ted O'Brien will today outline his party's approach to the budget in an address at the National Press Club.\n\nDutton least popular leader on record\n\nUnsurprisingly, the AES found Anthony Albanese was also the preferred major party leader over Mr Dutton.\n\nIn fact, Mr Dutton recorded the lowest levels of popularity of any major party leader since the study began in 1987.\n\n\"People didn't see him as a leader, he wasn't regarded as a strong leader, and they also saw him as lacking inspiration,\" Professor McAllister said.\n\n\"Certainly, that was a major factor in the lack of success for the Liberals in the election.\"\n\nWhile voters are more likely to say that policy issues are the single biggest influence on their vote, the researchers have found that leadership does matter, and crucially, that swing voters are more likely to have their vote influenced by the party leaders.\n\nThe leader with the second-lowest popularity in the study's history is Scott Morrison in 2022, with Bill Shorten in 2019 coming fourth last in the ranking.\n\nThe most popular leaders in the history of the study were Kevin Rudd in 2007, Bob Hawke in 1987, Kim Beazley in 1998, and John Howard in 1996.\n\nThe findings show a pattern of steadily decreasing popularity of political leaders in general, although the research does not explain the cause.\n\n\"If you draw trend lines … you'll find that there's quite a significant decrease over the years,\" Professor McAllister said.\n\nWhile the causes of the trend are less clear, it suggests the electoral challenges ahead may not lie solely with the Liberals.\n\n\"While [Labor] obviously won the election and got a historically large number of seats … their vote has been eroded as well if you look at the first preference vote,\" he said.\n\n\"They aren't suffering as much as the Liberals, but there's potential long-term existential threats to the Labor vote as well.\"\n\nAlready-released findings from the 2025 survey found that millennial voters had bucked the trend of previous generations, who have trended rightward as they have aged. The researchers found that the Coalition picked up just 21 per cent support from that age group in May's election.\n\nMillennials and Gen Z voters shift away from Coalition in 2025 As Liberals prepare to fly to Canberra to hash out their net zero stance, results from the Australian Election Study suggest those under 45 have continued to drift away from them.\n\nThe study also found 25 per of voters said they did not feel close to any political party, a record high, suggesting Australians were increasingly detaching from parties.\n\nThe \"non-partisans\" for the first time on record exceeded the number of Liberal partisans, which fell to 24 per cent.\n\nTrust in government and satisfaction with democracy remained relatively stable since the last election, but the share of Australians who said they would still vote if it were voluntary slipped to 74 per cent, the lowest figure on record.\n\nThe share of voters who support compulsory voting slipped slightly, but remained high at 67 per cent.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/nt-integrity-and-ethic-commissioner-established-icac-parliament/106051172",
    "title": "NT Integrity and Ethics Commissioner established amid opposition",
    "publish_date": "Tue, 25 Nov 2025 21:59:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory's embattled anti-corruption watchdog has been integrated into a new umbrella agency alongside three other integrity bodies.\n\nThe Integrity and Ethics Commissioner (EIC) was established on Tuesday night after an NT government bill passed parliament.\n\nThe IEC will now effectively hold office as the:\n\nIndependent Commissioner Against Corruption (ICAC)\n\nInformation Commissioner\n\nOmbudsman\n\nHealth Complaints Commissioner\n\nAn assistant IEC and an IEC inspector will also be established under the legislation.\n\nThe inspector will \"evaluate\" the performances and conduct of both the IEC and the auditor-general.\n\nNT Chief Minister Lia Finocchiaro said the changes were based on a review of the territory's integrity bodies, by ICAC Inspector Bruce McClintock SC and Acting Supreme Court Judge Graham Hiley KC.\n\nBruce McClintock has co-authored a review into the territory's integrity bodies. (AAP: Dan Himbrechts)\n\nICAC plagued with issues since inception\n\nThe establishment of the IEC comes just seven years after the NT ICAC was formed.\n\nThe ICAC's time in the territory has been turbulent, with well-documented court challenges and internal turmoil.\n\nThe anti-corruption watchdog has been without a permanent commissioner since Michael Riches resigned in May.\n\nMr Riches' resignation came after an 11-month investigation into \"workplace allegations\" at his office.\n\nMichael Riches resigned in May, but had been on leave for 11 months prior to it. (ABC News: Michael Donnelly)\n\nDuring debate in parliament on Tuesday, Ms Finocchiaro said the public's trust in the ICAC had been eroded and therefore the IEC was needed.\n\n\"Coming into government, we knew we had to restore community confidence in this incredibly important institution,\" she said.\n\n\"Our greatest concern from day one has been what will it take to restore people's trust in this integrity function.\n\n\"We have to deal with that, hence a structural reform.\"\n\nMs Finocchiaro said the IEC would likely become operational within the first half of 2026.\n\nLia Finocchiaro introduced the bill in October. (ABC News: Michael Donnelly)\n\nIntegrity shake-up criticised by politicians, national experts\n\nThe government introduced the legislation to parliament in October, but refused calls from the opposition and crossbench to refer it to the Legislative Scrutiny Committee.\n\nIndependent Darwin-based politician Justine Davis subsequently asked for submissions to her \"community scrutiny forum\".\n\nMs Davis received submissions from all of Australia's transparency and integrity expert bodies, along with organisations in the NT.\n\n\"The unequivocal feedback was that this bill should not pass in this form, that it weakens our integrity structures, that it doesn't address the issues that are actually there and then it puts us all at risk,\" she said.\n\n\" We all know there is no shortage of integrity issues here in the Northern Territory and this is an opportunity to actually address them. \"\n\nJustine Davis received submissions from organisations inside and outside the territory. (ABC News: Michael Franchi)\n\nOn Tuesday morning, the Centre for Public Integrity said the IEC's establishment would \"not solve the NT's integrity crisis\".\n\n\"Instead, by merging the ombudsman, anti-corruption commission, and health complaints commission into a 'super-commission', they risk making it worse,'\" it said in a statement.\n\n\" The NT government should withdraw this bill and reform their integrity system on the basis of a comprehensive and open inquiry. \"\n\nTransparency International Australia chief executive Clancy Moore said combining the four agencies together created \"obvious risks around conflict of interests and political interference\".\n\n\"The Finocchiaro government must put the bill under the microscope of a parliamentary inquiry and include important guardrails to enshrine the agency's independence, deal with conflict of interests and ensure appointments are based on merit with transparent selection criteria,\" he said.\n\nClancy Moore is calling for a parliamentary inquiry into the bill. (Four Corners: Craig Hansen)\n\nThe bill's explanatory statement says there is \"a clear mechanism for managing actual, potential, or perceived conflicts of interest that may arise when the commissioner performs multiple statutory functions under any of the integrity acts\".\n\nDuring parliamentary debate, Opposition Leader Selena Uibo criticised the bill for lacking provisions for whistleblower protections.\n\nShe also said the reforms should have provided the ICAC an opportunity to \"reset\" and instead the new model would cause another \"period of upheaval\".",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/world-cup-cristiano-ronaldo-set-to-avoid-ban/106053604",
    "title": "Ronaldo set to avoid World Cup ban as FIFA confirms draw shake-up",
    "publish_date": "Tue, 25 Nov 2025 21:52:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Cristiano Ronaldo will likely avoid missing any Portugal matches at the men's World Cup, despite receiving a red card in a qualifier.\n\nRonaldo swung an arm and struck Ireland defender Dara O'Shea with an elbow during Portugal's 2-0 loss in Dublin earlier this month.\n\nFIFA published a disciplinary verdict that imposed a three-match ban, judging Ronaldo's action to be an example of \"violent conduct\".\n\nBut two of those matches are deferred for a one-year probation period.\n\nRonaldo served a mandatory one-match ban when Portugal played its final qualifying match last week, a 9-1 win over Armenia that sealed its place at the World Cup in North America and Mexico.\n\nFIFA cited its disciplinary rules that allowed for parts of a sanction to be probationary, though it was rare in cases of a three-match ban for two of them to be deferred.\n\nDraw change\n\nMeanwhile, FIFA announced the World Cup draw would reward the four highest-ranked teams: Spain, Argentina, France and England.\n\nThey will be placed in separate sections of a new tennis-style seeded tournament bracket.\n\nDefending champion Argentina's passage to the semifinals appears easier. (Getty Images/Soccrates: Eric Verhoeven)\n\nThe draw procedure means the top four teams in the latest rankings will — if they finish top of their respective round-robin groups — avoid each other until the semifinals of the June 11-July 19 tournament.\n\nThe rule aims to maintain competitive balance in the expanded 48-team format.\n\nAt previous World Cups, the path for teams into and through the knockout phase was decided by the group in which they were drawn.\n\nCuraçao to make history with World Cup debut With a population of just over 150,000, the Caribbean island nation of Curaçao will become the smallest nation ever to play at the World Cup after a scoreless draw with Jamaica secured its passage to next year's tournament.\n\nFIFA also revealed the four pots for the final draw, which takes place on December 6 AEDT in Washington.\n\nThe Socceroos will be drawn from pot two.\n\nThey are the lowest-ranked team in their 12-team pot, which also includes their continental rival Japan and world number 10 Croatia.\n\nForty-two teams have already qualified for the World Cup.\n\nThe other six entries will be decided in March when European and global play-off brackets are scheduled.\n\nThose teams all will come out of the draw pot of lowest-ranked teams.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-26/queensland-company-buys-coal-miner-fitzroy-resources/106053568",
    "title": "Premier says newly formed Queensland company secures 1,000 coal mining jobs",
    "publish_date": "Tue, 25 Nov 2025 21:37:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "The future of more than 1,000 employees, contractors and suppliers at three Queensland mining sites has been secured, according to the premier, after a newly formed company purchased a majority shareholding in Bowen Basin mining company Fitzroy Resources.\n\nFitzroy Resources operates Broadlea, Carborough Downs and Ironbark mines near Moranbah in central Queensland.\n\nArgo Queensland, formed two months ago, has acquired a 70 per cent stake in the company for an undisclosed sum.\n\nPremier David Crisafulli said the deal was struck during negotiations he led at a recent trade mission to India and Japan.\n\nIt is the third major mining announcement for Central Queensland this week.\n\nIn a letter to employees, the company said the sale marked an end to an \"extraordinarily challenging\" period for staff, contractors and suppliers.\n\n\"Fitzroy has been through a difficult period and we are grateful for the support of our team and stakeholders as we have successfully worked through it,\" the letter reads.\n\n\"This transaction will deliver a significantly strengthened balance sheet, which puts Fitzroy in a stable position to manage our financial commitment to you and our contractor partners and suppliers.\"\n\nFitzroy Resource's coal loading stockpile at Carborough Downs mine. (ABC Tropical North)\n\nIn a statement, CEO Dan Clifford said the transaction could take up to four months and was a strong vote of confidence in the long-term potential of the mines.\n\nBowen Basin mines to expand\n\nOn Tuesday the Chinese-backed mining company Yancoal said it hoped to expand and extend the life of the Yarrabee coal mine near Blackwater.\n\nThe open-cut mine opened in 1994 and produces mostly metallurgical coal for the international steel market.\n\nThe company is now proposing to extend the life of the mine until 2070, continuing to mine up to 4 million tonnes of coal a year until then.\n\nDeputy Premier Jarrod Bleiji has also announced the expansion of the Centurion mine, 40 kilometres north of Moranbah, into the 2050s.\n\nThe government has declared it a \"co-ordinated\" project to allow mine owner Peabody Energy to deal with a single government agency while seeking approvals for the $662 million project.\n\nPeabody said the expansion would produce around 100 million tonnes of high-grade steel-making coal for export.\n\nIsaac businesses welcome sale\n\nIsaac Chamber of Commerce president Nathan Corbett said it was hoped the Fitzroy Resources sale would provide more security for business.\n\n\"It's either business as usual or it's a potential uplift … with investment in the region and investment in businesses,\" he said.\n\nMr Corbett said most mining companies had a \"buy-local-first policy\" and while the company name might change, he hoped operations would remain the same.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/small-business/a-better-scent-the-small-business-cleaning-up-our-home-and-beauty-products-20251107-p5n8h8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A better scent: The small business cleaning up our home and beauty products",
    "publish_date": "Wed, 26 Nov 2025 12:59:23 +1100",
    "category": "finance",
    "authors": [
      "Katie Cunningham"
    ],
    "text": "Crafting products that meet the high standards Everingham sets for herself takes a lot of work. Making effective cleaning products with “a very high percentage of naturally derived ingredients” requires a lot of research and development, which can be costly. And it’s not just what’s inside that counts – getting the packaging right can be equally as challenging.\n\n“[Take] soft pouch refills,” says Everingham. “So many customers have asked for them thinking they are better for the environment. But in Australia they just go to landfill, so we don’t offer them.”\n\nWhether it’s manufacturing, marketing, product or packaging design or staffing, there is always something that needs attention.\n\nEveringham’s secret weapon in business is her American Express Platinum® Business Card, which has proven invaluable “in quite a few ways”. It’s her small business solution.\n\n“It helps us manage cash flow with the 55 days interest free.¹ We have on occasion paid suppliers using the card. It’s also well accepted these days, so we put most of our subscription charges, like Shopify and Klaviyo, on the card.” she says.\n\nEveringham also appreciates the American Express rewards system, which she’s used to accumulate points that can be redeemed on flights and hotels², and the lounge access in airports around the world³ – great for making business travel that little bit nicer.\n\nWhen you’re running a busy small business, having a card that supports managing cash flow can be helpful.\n\nAfter 12 years in the game, Everingham has found the other crucial asset when it comes to overcoming business challenges is mindset. Because no matter your industry, problems will pop up.\n\n“Every week it’s something different. So the way I see running a business is ‘which challenge or problem am I tackling now’. It’s how you approach these that determines your success,” she says.\n\n“Often there is a beautiful silver lining – sometimes you just have to look for it and see if there is a positive coming from the particular challenge. Either way, you learn – and hopefully don’t make the same mistake twice.”\n\nTerms, exclusions and conditions apply on American Express products and services. Please see terms and conditions here.\n\n­­­­­­­Explore our range of Business Cards here.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/this-queer-western-has-guts-and-glam-but-not-quite-enough-giddy-up-20251125-p5ni78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This could be the silliest play I’ve ever seen",
    "publish_date": "Wed, 26 Nov 2025 12:54:50 +1100",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "James Lew also distracts us with some lollies in the set and costumes design, although the karaoke performances that punctuate the show – as light relief! – are a sin against music. Composer and sound designer Guy Webster not only assails our ears with excruciating songs (albeit in keeping with the idiom) sung badly, but backs up the comic-book action with comic-book sound effects, consisting of more explosions of white noise than is fair on the ears. By the time the morals about mother-daughter relationships and having the courage to break one’s own rules engulfed us, I just wanted to be somewhere else. Vying for the silliest play I’ve seen, this made a director, playwright and actors who are capable of good work look fourth rate. MUSIC\n\nFREEDMAN JAZZ\n\nThe Neilson, November 22\n\nReviewed by JOHN SHAND\n\n★★★★ Twenty-four years ago, pianist Andrea Keller won the inaugural Freedman Jazz Fellowship, and now she was one of a trio of judges announcing saxophonist/composer Sam Gill had won this year’s $30,000 fellowship. Gill will pursue compositional studies, collaboration and recording in New York over the next two years.\n\nWhile the windfall can be life-changing, the evening again felt more of a concert than a competition, with the four finalists performing in one of Sydney’s best venues, with musicians of their choice. It was a testament to the diversity and creativity of Australian jazz that all four sounded like no one else in the music’s history. Gill performed three of his compositions with an iteration of his band Coursed Waters, featuring pianist Novak Manojlovic, electric bassist Christopher Hale and drummer James McLean. Instantly we were assailed by the piquancy of Gill’s soprano saxophone sound and the intriguing outside-of-the-box nature of his sophisticated compositions, with their rhythmic switchbacks and radically changing vistas. On Double Down, he turned to his more usual alto saxophone for a piece that could have been the love child of a menage a trois between Anthony Braxton, Frank Zappa and Nino Rota. It allowed the players maximum creative scope, including a Manojlovic solo that swelled and ebbed with the rhythm section to create an extraordinary sense of the music arriving in waves rather than metered time. After a glorious solo from Hale’s six-string bass, the band converged on a sudden starburst of energy that one felt as a physical jolt. But then trumpeter Niran Dasika would have been a worthy winner, too, initially elevating us to the heavens with celestial solo trumpet – although any angels involved were of the fallen variety, with digital looping, circular breathing and vocal growls used to supernatural effect. When joined by guitarist Lawrence Folvig and drummer Kyrie Anderson, the impact was nothing short of visionary. The guitar hummed and sang like some natural phenomenon, while Anderson was endlessly inventive both texturally and rhythmically, and the trumpet cried out its songs of quiet desperation. In its conceptual scope, this was not a trio, but a three-piece orchestra.\n\nPianist Wilbur Whitta’s trio with bassist Cameron Undy and Alexander Inman-Hislop was utterly engrossing in its sheer playfulness and its ability to make jazz minus the cliches. Again, the compositions were notable for their originality and internal contrasts, with Whitta’s playing effortlessly blending blitheness and conviction. If Perth singer Holli Scott didn’t quite rise to the heights of the other three, she was engaging on her own terms, proving an imaginative lyricist, composer and singer, whose music drifted and swooned like a morning-after reverie. Her songs were performed with trumpeter Jessica Carlton and guitarist Dom Barrett, who ensured that dreaminess remained the prevailing aesthetic, even if the trio was reportedly compromised by sound issues. THEATRE\n\nCowbois\n\nThe Seymour Centre, November 22\n\nUntil December 13\n\nReviewed by KATE PRENDERGAST\n\n★★★½\n\nThis is a noble-hearted, gun-twirling yet dismayingly middling Australian premiere of Charlie Josephine’s 2023 queer western comic fairytale that rides into Sydney town. Making too much of its saddle of progressive morality, this Siren Theatre production of Cowbois stints the energising camp and soaring spirit needed to vindicate its overlong runtime, going down like slow service on watery whisky.\n\nFor all of director Kate Gaul’s good intentions, it only occasionally comes into itself as a radical, celebratory, liberated reimagining of a genre that traditionally loves a binary. Emily Cascarino, Faith Chaza, Branden Christine, Rory Spinks, Jules Billington, Jane Phegan and Amie McKenna. Credit: Alex Vaughan The play is set, naturally, in a small-town saloon. Unnaturally – some could say “queerly” (an overused joke) – there are almost no menfolk here. Aside from the liquor-shaky sheriff and a precocious boy (referred to as “kid”), the husbands all up and left to join the gold rush a year ago, valiantly promising their wives they’d return with a fortune. Another unnatural thing: the town was built to be an exceptional forward-thinking haven, its two founding principles “no guns, no politics”. However, neither of these are upheld. And when fugitive outlaw Jack Cannon swaggers into town, a new kind of man wanted for murder and wanted in a second, sacrilegiously biblical way, its petticoated inhabitants are left weak-kneed, round-eyed and fundamentally shook. New lawless awakenings are about to happen – and not even the returning wave of toxic masculinity that crashes down when the boys get back can reinstate the old oppressive “normal”.\n\nJules Billington is our gunslinger in red, infusing as much tender kindness as cocksure masc into the trans baddie. There’s not a whole lot of substance behind the performativity of their character, though, and Jack’s romance with married Miss Lillian (Emily Cascarino) seems to gallop on subversive lust alone (do they have one intimate exchange before professing love to one another?). An impossible event between them confirms the British playwright’s story to be a wistful, better-world fantasy. A live band in the rafters provides subtle atmospherics, comic sound effects and backing for a few song and dance numbers. The actors weren’t cast to excel in this form of entertainment, with a lack of talent and gusto in throat and on hoof making you wonder why what’s billed as “feel good” so often feels bad. Brockman’s dramatic lighting and Emelia Simcox’s set, featuring clamshell footlights and enormous yellow drapes with purple tassels, battles the underwhelm with immersive aesthetics. One’s heart can’t help but clench in gender-affirming plot moments, too, particularly those involving vulnerable transformation. The sweetest is when “Miss Lucy”, inspired by Jack, shucks off her long skirts to become Lou (Faith Chaza), brave and beaming in jeans and necktie. Sheriff (Matthew Abotomey) also gets a cheer for self-expression of repressed femininity with silk. Clay Crighton (previously on piano and violin, who also contributed original music and lyrics) is a second-act show-stealer as Charley Parkhurst, a hilarious drag caricature of a rival outlaw. His entrance interrupts a long and scattered argument between the townsfolk about new and old values. The most conservative voice is then conveniently shot by dainty hand, and his death promptly passed over by a hammy, action-packed shoot-out. Lord knows the messages of Cowbois are important in a backsliding world. But this desperado could do with more fire in the belly, their steed a swift kick with sharp spurs.\n\nMUSIC\n\nBach Mass in B minor\n\nSydney Chamber Choir\n\nCity Recital Hall, November 22\n\nReviewed by PETER McCALLUM\n\n★★★★½ With his genius for contrapuntal combinations carrying deep musical and symbolic significance, Bach constructed the great four-part fugue, Donna Nobis Pacem, which concludes the Mass in B minor, so the pleas for peace pile harmoniously on top of one another, each beginning before the previous one has ceased and overreaching it (a “stretto” in musical terms) to create a sonic image of collective yearning. The swelling sonority and translucent texture of the Sydney Chamber Choir and the Muffat Collective orchestra under Sam Allchurch in this number encapsulated all the virtues of the performance that it brought to such a glowing close: clarity, balance, judicious tempi and an absence of unwanted accent or distortion. Conductor Sam Allchurch. Credit: Robert Catto\n\nThe striking opening chords that begin the Mass were sung with an unforced, open sound, allowing pure vowels and the music’s harmonic richness to convey the necessary emphasis. The ensuing expansive five-part Kyrie fugue flowed with a deeply embedded, unhurried pulse. For the Christe, soprano Sara Macliver and alto Sally-Anne Russell created a nicely edged duet sound and their pealing imitation in the second theme was like the playful eddies of running water. For the second Kyrie, the choir returned with a tone of measured seriousness. The choruses of the Gloria and the addition of a brilliant battery of three trumpets require, of course, more animation, but Allchurch’s broad metric direction ensured the music was emblematic of joy rather than over-excitement. Concertmaster Matthew Greco led with light precision, aptly demonstrated in the nimbleness of his and Macliver’s ornamentation in Laudamus te. Illustrating the two-in-one theme implicit in the text of the Domine Deus section, flute players Melissa Farrow and Mikaela Oberg wove threads of silvery filigree against Macliver and tenor Andrew Goodwin, the latter singing with smoothly tanned finish and blooming projection. Russell sang the Qui sedes ad dexteram Patris aria with full sound and rich colour, memorably bringing the same qualities to the darker depths of the penultimate Agnus Dei just before the final chorus. Bass David Greco enlivened the Quoniam and Et in Spiritum Sanctum arias with pointed, elastic articulation that accentuated the natural rhythmic emphasis of the complex melodic line.\n\nWhile the orchestra retuned after the Credo, Allchurch regrouped the chorus to facilitate the double-choir format Bach uses for the Osanna. The regrouping also highlighted the broad antiphonal strokes of the Sanctus, which swayed majestically like great tolling bells and gave the music of the Donna nobis pacem (which had been heard earlier in the Gratias agimus fugue with the former grouping) a more focused, brilliant finish. When performed as well as it was here, Bach’s Mass inevitably creates a sense of awe and wonder at the extent of human imagination and craft. What better way for Sydney Chamber Choir to end its 50th anniversary season. MUSIC\n\nSam Fender\n\nShowring, Entertainment Quarter, November 21\n\nReviewed by ROD YATES\n\n★★★★ In 2019, British singer-songwriter Sam Fender played his debut Sydney show at the 500-capacity Oxford Art Factory.\n\nFast-forward six years – during which he’s amassed three UK No.1 albums, a Mercury Music Prize for this year’s People Watching LP and, in June, a sold-out show at the 80,000 capacity London Stadium – and his star has risen significantly. Among the 15,000 people flowing through the gates of the Showring, the constant stream of Newcastle United shirts suggests his expat appeal remains strong. However, when the North Shields-born artist asks how many in the crowd are British and how many are Australians, the loudest cheer comes from the locals, affirmation that his songs of everyday life and blue-collar tribulation have resonance beyond his home country. Sam Fender’s star has risen significantly. Credit: Georgia Griffiths On this night, those songs sound majestic.\n\nThat Fender opens his biggest-ever Sydney show not with a mainstream hit but the deep cut Angel in Lothian suggests this is a man not tied to the staid old traditions of arena rock but one who has faith in his material and his band to make it a convincing opener. His backing group has swelled to a seven-piece over the years, a younger, northern English answer to Springsteen’s E Street Band, and they look like they’re having the collective time of their life. That they can pull off the howling noise-punk rock of Howdon Aldi Death Queue – introduced by Fender as a “stupid song”, and arguably the only set-list misstep of the evening – and follow it with a track as nuanced and elegant as Spit of You is a byproduct not only of the hundreds of shows they’ve played together but their history as friends stretching back to their teenage years. The real stars, though, are the songs themselves. Anthems such as Seventeen Going Under, People Watching and triumphant closer Hypersonic Missiles blend wildly melodic hooks with Fender’s lyrical talent for making his deeply personal experiences resonate with the masses. He begins The Dying Light – a song that addresses suicide and those “who didn’t make the night” – solo on piano before shepherding it to a triumphant, hopeful, full-band climax. The Borders delivers an additional element of joy when a fan is invited onstage to play guitar; recent single Talk to You (the recorded version of which features Elton John) sits as comfortably in the set as older songs such as Will We Talk?",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/the-moment-of-dreadful-clarity-how-katie-allen-s-daughter-recognised-her-worst-fear-20251125-p5nibt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The moment of dreadful clarity: How Katie Allen’s daughter recognised her worst fear",
    "publish_date": "Wed, 26 Nov 2025 12:48:28 +1100",
    "category": "lifestyle",
    "authors": [
      "Annika Smethurst"
    ],
    "text": "I meet Allen on Chapel Street in South Yarra, the suburb where she boarded at Melbourne Girls Grammar and one of the enduring anchors of her life. She lives in neighbouring Toorak, and represented the former seat of Higgins from 2019 to 2022. Abacus Kitchen and Bar, where we sit at an airy corner table, is her local – a place she drops into with her children when they visit Prahran Market. Katie Allen. Credit: Simon Schluter Before we order, Allen continues to talk me through her diagnosis. While the public only learnt of her cancer after election day in May, she had kept it a secret for 18 months, a decision that left her feeling like she was fighting it alone. Now she speaks about it without hesitation, which she says can be too much for some. It’s as if she is finally exhaling after holding her breath for far too long.\n\nReturning to November 2023 – the morning after Jemima noticed her yellowing eyes – Allen found the second sign she had been dreading: white stool. She didn’t try and explain it, she didn’t try and take away the pain because you can’t. Katie Allen Now in Point Lonsdale, she and her husband Malcolm had planned a quiet Melbourne Cup weekend. From there, they immediately drove to Geelong Hospital for a scan. Within an hour, a doctor walked in, sat down and told her simply: “You’ve got a one-centimetre lesion in your pancreas.” “She didn’t try and explain it, she didn’t try and take away the pain because you can’t,” Allen says. “She knew that I knew what that meant.” It was cholangiocarcinoma – a cancer of the bile ducts that is rare, aggressive and notoriously hard to treat.\n\nAs a doctor, Allen had delivered news like this to parents before. Now she was on the other side. “I wept and she waited.” Allen recognised instantly the dissociation she had seen so often. “The shutters come down … you have to give them the bare bones and then say nothing else. I knew that was happening with me.” Within days, she was in surgery. Her tumour was removed, but the risk of recurrence was high – almost inevitable. She and Malcolm discussed stopping work, selling the house, travelling.\n\n“But it is just not us,” she said. They agreed instead to carry on. She told fewer than a dozen people: her four children – Monty, 29; Jemima, 26; Arabella, 24; and Archie, 22 – and a handful of close family. You go out for dinner, and you have the extra, or you order the champagne, and you get the French, you just say ’why the f--- not. Katie Allen With the preselection for Higgins days away, Allen even kept the truth from her staff, claiming she’d had her gall bladder removed. She refused to trigger a sympathy vote. “I didn’t want to be defined by the C-word,” she says. “I didn’t want people to vote for me, or not, because I had cancer.”\n\nOnly after recounting the diagnosis do we turn to lunch. Allen orders the prawn and blue swimmer crab cake with confit kipfler, pickled watermelon radish and squid ink; I choose the Mooloolaba grilled swordfish with reef coconut sauce, potatoes and pangrattato. We share a plate of broccolini. Allen is trying to put on weight. She is noticeably lighter, but she remains bright, animated and determinedly stylish, pausing to reapply her trademark pink lipstick before a photo. Loading As her colleagues in Canberra would attest, Allen has always been forthright, but now she speaks with the certainty of someone who knows exactly how precious time is: “Malcolm said a couple of weeks ago, ‘this is a bitch of a disease but gosh it has brought some beautiful moments’.” In the two years since she was diagnosed, there is a new rule in the Allen household: you always order the good stuff.\n\n“You go out for dinner, and you have the extra, or you order the champagne, and you get the French, you just say ‘why the f--- not’,” she grins. But the extra bottles of Dom aren’t for Allen. She stopped drinking 12 years ago – ironically, to reduce her cancer risk. At Abacus, we indulge in tall glasses of homemade lemonade. If her illness has taken much from her, it has also drawn her already tight-knit family closer together. In 2024, all four of her children were living or studying in Britain. But when December came, they all flew home to spend time with their mum – the cancer still a secret. Subtle excuses kept the extended clan away, allowing a two-week cocoon at home. ‘The kids are amazing, they are my greatest story … They are very loving children.’ Katie Allen “I was crying the whole time,” Allen tells me through floods of tears. “It was the best two weeks of my life ... It was so gorgeous.”\n\nHer children created a treasure hunt for her Christmas present, hiding gifts in the places she is at her happiest, like a book for the hammock in the garden. “The kids are amazing, they are my greatest story … They are very loving children.” This month she became a grandmother for the first time, a milestone that brings both joy and a fierce determination to keep going. Allen’s own childhood was similarly close. Born in 1966, she grew up in Albury, where her father Bill was a much-loved local physician. She tagged along on his ward rounds at seven, the moment medicine imprinted itself. “He loved what he did, he had a beautiful bedside manner.”\n\nAfter boarding school at Melbourne Girls Grammar – where her grandmother, mother and daughters were also educated – she briefly flirted with journalism, making it to the final six for a cadetship at a Melbourne newspaper. Monash medicine won out. He kissed me and we have never looked back. We have been together ever since. I have never looked at another man. Katie Allen Two decades before that fateful Cup weekend when she was diagnosed with cancer, Allen met her husband trackside at Flemington on Cup weekend. It was 1988, Empire Rose won the two-mile race, but Allen insists she “snagged” the best prize – an Englishman called Malcolm. “He kissed me and we have never looked back. We have been together ever since. I have never looked at another man. Never thought about another man. He is my rock.” Back in that Geelong hospital room, it was Malcolm – a management consultant – who refused to let the diagnosis upend their lives. Through floods of tears, Allen recalls turning to her husband, who was already encouraging her not to give up on her dream of returning to Canberra.\n\n“Oh Malcolm, it’s over,” she told him. Loading While she absorbed the emotional shock, he shifted instantly into what she calls management mode – encouraging her to run for Higgins, even as she recovered from surgery. “I was doing it to keep him happy,” she admits. “He just wants to keep kicking the cancer can down the road.” Allen went on to win preselection for Higgins. Five months later, the seat would be abolished in a redistribution, forcing her into a bruising contest for neighbouring Chisholm. In September 2024, she defeated the preselected candidate, Theo Zographos, to secure the party’s endorsement.\n\n“Now and then, if someone would do something really mean, I would think ‘If only you knew I had cancer’,” she jokes. Katie Allen outside a polling booth on election day in May 2022. Credit: Scott McNaughton By early 2025, with the federal election approaching, her symptoms crept back. Mild abdominal pain at first, then more unmistakable signs. She knew she should see a doctor, but put it off – a delay she now recognises as denial. A conga line of Liberal colleagues visited Chisholm to help her campaign. She never once revealed her private health battle. She knows the ethics of running while harbouring a cancer diagnosis will always prompt debate – voters deserve transparency and candidates owe them the full picture.\n\nAllen grappled with the possibility of winning, relapsing, and triggering a by-election, but her family pushed her to live fully, not withdraw. “My family all said it’s better I get in there and do it.” A tropical cyclone pushed the election to May, stretching out the campaign as her health deteriorated. Some nights she plunged into the pool three times to soothe the pain. Katie Allen in 2022. Credit: Simon Schluter “I rang my doctor and said ‘I am deteriorating’ and she knew what that meant.”\n\nStill, she did not want her illness to influence the result. Loading On May 3, she lost Chisholm. The following Monday, she was in hospital for tests and immediately started chemotherapy. The cancer had spread. After the relapse, she said her prognosis “dropped significantly”, shifting her into what oncologists call a different “prognostic environment”. She doesn’t like the term “terminal” but acknowledges it is incurable. Still, she holds tight to what she calls “deluded hope” – the stories of rare patients who defy the averages.\n\n“There are some people who are the outliers who last a year or two, and you want to be the outlier. “I know it is deluded hope, but what else have you got.” A new clinical trial – one she nearly missed – has given her new hope. Before that, she had just wanted to make it to Christmas. “If you are on a treatment with no side effects, that is a good quality of life.” Allen is approaching life with vulnerability and pragmatism, largely free of regrets – except for Canberra, where she wishes she had done more to champion the party’s moderate faction.\n\n“I went in to change the Liberal Party from the inside … but I completely and utterly failed. I did my best, but I didn’t make much difference.” Katie Allen with John Howard in 2022. Credit: Eddie Jim During her time in Canberra, she crossed the floor on the religious discrimination bill to vote on amendments that would prohibit vilification of and discrimination against children based on sexuality and gender identity, protecting all LGBTIQ+ students. She also joined colleagues pushing for the Murugappan family to be returned to Biloela. And she was part of the internal push to cut greenhouse gas emissions to net zero by 2050. She jokes that she should have been “the Pauline Hanson of the moderates”, but said she mostly remained quiet when she should have spoken up.\n\nDespite the recent turmoil in the state and federal Liberal parties, Allen hasn’t given up. She sees promise in younger women such as Jess Wilson and Amelia Hamer, whose rise she has quietly supported – even hosting events for Hamer as her health wobbled. Loading Her medical background means she does not romanticise what lies ahead. She supports Victoria’s voluntary assisted dying laws for others but doesn’t wish to use them saying she has great faith in the health system. When her time does come – a date she hopes has been pushed further back thanks to her new trial – she hopes to spend her final days at home. But she is not grieving her life.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyrics are king at a Doja Cat show – it’s a shame we can’t hear most of them",
    "publish_date": "Wed, 26 Nov 2025 12:47:50 +1100",
    "category": "entertainment",
    "authors": [
      "Nell Geraets",
      "Thuy On",
      "Karl Quinn",
      "Andrew Fuhrmann"
    ],
    "text": "Prior criticism around the tour’s lack of visuals, structure and outfits are technically warranted – the stage remains unchanged throughout and Doja wears just one costume. But such simplicity keeps all eyes on the so-called queen of rap-pop, whose exaggerated facial expressions offer all the theatrics needed. And when you aren’t looking at Doja, you’re watching her tiger-striped band, many of whom do the robot or roll around on the floor during instrumental interludes. Loading For someone who’s known for sending the occasional barb to fans online (remember when she told us to “get a job”?), there sure is a lot of love in the room. The crowd – many of whom are dressed in ’80s workout gear and inflatable cow costumes – carry Doja through each track, particularly Take Me Dancing and Boss Bitch, singing so loudly it practically drowns out the backing tracks. This clearly tickles Doja, who smiles ear-to-ear each time she holds the mic out. Her commitment to the fans shines brightest when she stops the show to ask the crowd to help get a fan who has fainted to safety. It may not be her strongest gig, but you know you have a star on your hands when a singer who is losing their voice can still make a packed crowd purr.\n\nReviewed by Nell Geraets\n\nMUSIC\n\nDaniel Müller-Schott with Konstantin Shamray ★★★★★\n\nMelbourne Recital Centre, November 25 German cellist Daniel Müller-Schott has returned to Melbourne, filling Elisabeth Murdoch Hall with the glorious resonance and many-splendoured lyricism of his 1727 “Ex Shapiro” Matteo Goffriller cello. Cellist Daniel Müller-Schott Noting his instrument is almost exactly contemporaneous with Bach’s Cello Suite No. 3 in C major, BWV 1009, Müller-Schott brought an expansive, larger-than-life feeling to this classic. Like the rest of the suite, the Prelude was flexible yet rhythmic, powered by artistic and technical assurance. Other movements were beautifully characterised, with especially telling contrasts between the sprightly Courante and the intense yet subtly coloured Sarabande, while the well-known Bourée and the rustic Gigue were buoyed by joyous rhythmic energy.\n\nTogether with Russian-born, Australian-based pianist Konstantin Shamray, Müller-Schott offered great insights into Shostakovich’s Cello Sonata in D minor, Op. 40. Once again proving himself to be an extraordinary colourist, Müller-Schott gave the opening two themes a life of their own, with exchanges between instruments deftly handled. Loading At the centre of the work, the third-movement Largo became a soul-searing expression of heartache. This vividly etched lament was surrounded by remarkable vigour, both in the second-movement Allegro and in the impish finale. Throughout, the artists harnessed Shostakovich’s formidable array of technical demands to memorable musical ends. From the outset, Brahms’ Cello Sonata No. 2 in F major, Op. 99 overflowed with grandeur and ardent passion. Thanks to the superb instrument, the pizzicato in the Adagio had an unusual depth, while the middle section of the Allegro passionato was yet another instance of the cello’s voice taking on an almost-human quality. The cheerful, hope-giving finale set the seal on arguably one of the best concerts of the year. How wonderful to see Müller-Schott’s generous, open personality and poetic musicianship garner him quite a following of young fans, teeming in the audience and listening with rapt attention.\n\nReviewed by Tony Way\n\nCABARET\n\nMeow Meow’s The Red Shoes ★★★\n\nMalthouse Theatre, until December 6 The original Hans Christian Andersen’s tale involves a girl enamoured with a pair of red shoes. As punishment for her vanity, the shoes are cursed, and she’s forced to dance in them forever. Meow Meow’s The Red Shoes is a retelling of the Hans Christian Anderson classic. Credit: Brett Boardman Even when her feet are amputated, the shoes still dance tauntingly before her. Yes, it’s grim, as a lot of these unvarnished fairytales are wont to be, but this is Meow Meow’s Red Shoes, and she has her own ideas about the classic story. It’s the third iteration in her fairytale series, after The Little Matchstick Girl and The Little Mermaid. The show opens on a comic note with the performer (otherwise known as Melissa Madden Gray) being dragged on stage by her legs. This self-confessed “eternal showgirl” has lost her muse; she’s a marionette slackened with existential angst and more attuned to the sorry, lustreless state of the world.\n\nIndeed, Dann Barber’s set contributes to the post-apocalyptic mood with its mountain of debris and a plastic curtain. Meow Meow climbs up and down this graveyard of rubbish, singing and emoting and resplendent in a black mini dress, bouffant hair and even bigger plumed headgear. The musicians (Mark Jones, Dan Witton and Jethro Woodward) are in distressed tuxedoes, and between them play an astonishing array of instruments including piano, guitar, double bass, drums and tuba. Dann Barber’s set contributes to the post-apocalyptic mood. Credit: Brett Boardman Meow Meow’s energy is unflagging: aside from the actual dancing (sometimes lopsidedly with different footwear), she also hops, crawls and does the splits. She can be vulnerable one moment (hobbling around trying to find her missing red shoe), and brazen the next, in an interactive aside with the audience to “redistribute the wealth”. There’s a lot going on in this digressive show with its various sprays against communism, capitalism and world greed in general. It’s a springboard of ideas, but it’s difficult to find the skein of narrative about the titular red shoes in between all the play and hijinks.\n\nMeow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/reynolds-defends-special-broncos-rebrand-20251126-p5nimk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Reynolds defends 'special' Broncos rebrand",
    "publish_date": "Wed, 26 Nov 2025 12:46:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Reynolds defends 'special' Broncos rebrand\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/lifestyle/meghan-markle-rep-responds-to-claims-she-stole-dress-from-2022-photoshoot-20251126-p5nim5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle rep responds to claims she 'stole' dress from 2022 photoshoot",
    "publish_date": "Wed, 26 Nov 2025 12:34:44 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle rep responds to claims she 'stole' dress from 2022 photoshoot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/a-restored-art-deco-pub-with-an-all-are-welcome-attitude-and-5-happy-hour-beers-20251126-p5nilg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A restored art deco pub with an all-are-welcome attitude (and $5 happy hour beers)",
    "publish_date": "Wed, 26 Nov 2025 12:20:26 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe Orrong Hotel is a local hot spot in Armadale, with weekly specials galore.\n\n1 / 6 Watch the footy at the Orrong Hotel. Supplied 2 / 6 Graze on party pies at the Orrong Hotel. Supplied 3 / 6 The Orrong Hotel’s wood-panelled dining room. Supplied 4 / 6 Louisiana chicken wings come with pickles and ranch dressing. Wayne Taylor 5 / 6 The Philly cheese steak. Wayne Taylor 6 / 6 School prawns. Wayne Taylor Previous Slide Next Slide\n\nPub dining$$$$\n\nDating to around 1940, this art deco pub was sensitively restored in 2021. The original timber front bar sits handsomely in the retro-styled corner parlour, making the idea of lifting an elbow to drink an icy lager extremely appealing. Important to note: the old coolroom is now a poolroom.\n\nThe very model of a friendly local, the Orrong has alluring happy hours with $5 beers, $25 express lunches, a steak night on Thursdays with a meat raffle, and an all-day rotating Sunday roast of meat and (usually more than three) veg for $28. Classic counter meals are balanced by contemporary dishes such as tacos and eggplant parmigiana.\n\nBest for: An all-are-welcome attitude.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/a-day-in-the-life-of-a-premier-league-manager-20251126-p5niln.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A day in the life of a Premier League manager",
    "publish_date": "Wed, 26 Nov 2025 12:06:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "A day in the life of a Premier League manager\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/takaichi-s-gamble-japan-is-trying-to-escape-the-debt-trap-20251126-p5nihe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Takaichi’s gamble: Japan is trying to escape the debt trap",
    "publish_date": "Wed, 26 Nov 2025 12:04:32 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Japan’s bond yields have been hitting decades-long highs. Its sharemarket is sliding. The yen is slumping. The country’s new prime minister has monster challenges, with implications for markets and economies elsewhere.\n\nLast week, Sanae Takaichi unveiled her responses to an economic contraction (the September quarter saw the economy shrink at an annualised rate of 1.8 per cent), persistent inflation of 3 per cent, a weakening currency, the impact of Donald Trump’s tariffs and the affordability issues for households that are prevalent elsewhere.\n\nShe announced a ¥21.3 trillion ($211 billion) stimulus package that includes subsidies for energy costs, a cut in Japan’s petrol tax, cash handouts for households, rice vouchers and investments in shipbuilding, semiconductors and artificial intelligence.\n\nJapan’s Prime Minister Sanae Takaichi faces monster-sized economic challenges. Credit: AP\n\nTo fund the package, Takaichi will need to issue more government bonds. Japan is already the world’s most indebted economy, with a debt-to-GDP ratio of about 230 per cent.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/traveller/reviews-and-advice/this-former-70s-motel-has-become-a-beacon-of-luxury-in-byron-bay-20250821-p5moos.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This former ’70s motel has become a beacon of luxury in Byron Bay",
    "publish_date": "Wed, 26 Nov 2025 12:02:41 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\n★★★★ Reviews & adviceHotel reviews This former ’70s motel has become a beacon of luxury in Byron Bay Katherine Scott November 26, 2025 — 12:02pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to Australian road trips. See all stories .\n\nThe hotel The Bower Byron Bay The heated magnesium pool at The Bower Byron Bay. Check-in Not unlike the flux of defecting A-listers and preternaturally beautiful folk who’ve sent Byron’s average attractiveness levels into the stratosphere, The Bower Byron Bay continues to hold its own among the town’s newest crop of glamorous coastal stays. She’s had a fair whack of work over the decades. The former 1970s motel was first reimagined as a luxury hotel in 2017 – the original designer and co-owner, Taliah Lowry, laced Byron’s beachy essence with a touch of New York grit, inspired by the US city’s industrial-cool Bowery neighbourhood. A recent two-year upgrade has once again restored its sheen and grown its footprint, with new additions including a guest lounge, hotel bar, swish new reception space, an onsite spa treatment centre and four beautiful new suites.\n\nAdvertisement\n\nThe look The new guest lounge … currently used for functions. The Bower Barn. The Bower’s old-school roadside motel past is easy to spot, thanks to a concrete carpark that dissects the property, but creative firms Studio Plenty and Tanev Muir have added plenty of tropical greenery and flair to the mix. No two accommodations are the same, though they do share a penchant for organic textiles and tones, modern art, dark woods and custom furnishings by Byron artist Alexis Williams. The revamp has also seen all rooms upgraded with king beds, and a beautiful new lounge and bar area that’s currently reserved as a function space. The one-bed Bower Barn and five-bedroom Bower Cottage at the back of the property are among the most striking and sought-after stays – think charming white weatherboard exteriors, picket gates, pitched ceilings, rustic wooden beams, and luxe touches like a glass-roofed bath (for bathing under the stars) and a private cedar mineral spa. Outside, a striking solar-panel-powered circular heated magnesium pool, hugged by palms and day beds with privacy curtains, is the pièce de résistance.\n\nAdvertisement\n\nThe room One of the new luxury Bower Studios. Shades of grey … the Bower Studio. We’re staying in one of two newly launched Bower Studios. The sultry combination of a giant four-poster bed, distressed mirrors, and sheer black curtains framing a freestanding stone bath feels both luxurious and, erm, 50 Shades? The cabin’s entrance is steps from the car spot, tucked behind a whitewashed wall for extra privacy; inside, a soaring pitched roof and spectrums of charcoal tap into that smouldering New York warehouse vibe. There’s a kitchenette, Nespresso machine, mini-bar stocked with snacks and local favourites, complimentary bath salts and decadent Hunter Amenities. It takes a second to master where to find the various light switches; tech is generally great, with fast Wi-Fi and a smart TV with casting capability. The beautiful rough-hewn wooden side tables and handmade ceramic lamps look neat, but don’t leave much room for a phone or book. The open-plan en-suite is all sorts of ravishing, between the egg-shaped bath overlooking a glass-walled garden and floating vanity. Food + drink\n\nAdvertisement\n\nThe pool is serviced by a licensed pool bar. There’s no onsite restaurant, though the spiffy pool area is serviced by a licensed pool bar offering a basic menu of Curatif canned cocktails, drinks and bar snacks – and you can BYO food from local eateries or pre-order a hamper (if you’re after something freshly shaken, you’ll have to venture into town). Next door, The General Store cafe mixes heritage appeal with a sun-kissed aesthetic, and the coffee and brunch dishes don’t miss (the smoked bacon is a revelation). Out + about Pixie Italian dining room. It’s a 15-minute walk to town and 20 minutes to the beaches. Happily, the buzzy Jonson Lane area is only a block away and boasts some of the town’s best restaurants – tuck into aperitivo and chilli-laced tubes of mezze maniche pasta with pork sausage at Pixie Italian, or soak up the punchy Asian flavours and deep list of lo-fi drops at Bar Heather.\n\nAdvertisement\n\nYou can’t swing a yoga mat without hitting a day spa in these parts, but the Bower’s petite new guest-only spa is well worth securing a booking for, offering treatments with luxe Mukti Organics products; the 90-minute facial has me floating back to my room. The verdict The pool, the bath ... file it all under “ridiculously good-looking” and chalk it down to the Byron effect. A worthy base from which to hit the town’s boutiques, beaches, and bars, The Bower’s latest refresh cements it as one of the better luxury options in town. Essentials From $320 a night; $620 for a Bower Studio. No wheelchair access rooms. 28 Bangalow Rd, Byron Bay. Phone: (02) 6680 9577. See thebowerbyronbay.com.au\n\nAdvertisement\n\nOur rating out of five ★★★★ Highlight Complimentary Lekker bikes, yoga mats, hairstyling tools and beach umbrellas are a welcome bonus. Lowlight\n\nAdvertisement\n\nFair warning, the toilet and shower aren’t exactly sealed off from the room (think a cubicle-style half-wall that lets in light – but leaves little to the imagination). The writer stayed as a guest of The Bower Byron Bay.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/music/the-world-mocked-her-but-now-rebecca-black-is-playing-lollapalooza-20251124-p5ni09.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world mocked her, but now Rebecca Black is playing Lollapalooza",
    "publish_date": "Wed, 26 Nov 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "John Bailey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This month Australia implements laws to address the toxic aspects of online life, but not so long ago, it was apparently perfectly fine for a good portion of the internet to direct astonishing levels of hatred and vitriol at a young girl from California. People who go viral for reasons beyond their control typically disappear back into the scenery of non-internet life. Rebecca Black never flinched. Black is now touring Australia as part of the Spilt Milk festival, alongside Kendrick Lamar and Doechii. She’s also headlining her own shows, including her largest ever at Melbourne’s Forum Theatre. If you think her presence has something to do with Friday, the song that launched her to fame and became the most viewed YouTube video the year it was released, you’re living in the past. A brief recap is all the Friday affair deserves. When Black was 13 she recorded a novelty pop song and video clip with an LA company that offered ordinary folks just such an experience. Friday was intended to be a throwaway bit of fun to share with friends, but somehow the music video ended up online right at the moment when memes and meanness were becoming inextricable. Until that point, social media had been a largely benign place full of lolcats and rickrolling and pokes. By 2011, however, the tone had started to shift. The default voice was snarkier, the humour had become crueller, and any innocent could find themselves hoisted up for public ridicule. The socials democratised the angry mob, promising a pitchfork and flaming torch for everyone. Black – at age 22 – who was just 13 when her pop video went viral for all the wrong reasons. Credit: It’s hard to overstate just how vile the response to Friday became, with strangers posting the most violent and juvenile comments towards a random kid whose home movie had so upset them. From medieval witch trials to the screaming fans of the Fab Four to the Twilight and Tay-Tay stans in recent times, there’s a certain sort who have a screaming fit whenever they see a girl having fun on her own terms. Today it’s Black: 1, Haters: 0. She never quit. This year the 28-year-old played a DJ set at Lollapalooza, one of the largest music festivals on earth. Punters who only remembered her as the Friday girl were floored. The set-list from that gig includes titles familiar from the pop canon – from Britney’s Toxic to Bjork’s Hyperballad to Addison Rae’s Fame Is a Gun – but you won’t find the bootleg cuts she spins anywhere on Spotify or Shazam. They’re familiar while also illustrating a deep knowledge of dance culture today.\n\nAdvertisement\n\nWhen Black DJs, she says, “I’m there to highlight the tracks that I really love and feel attached to, that I find in the depths of SoundCloud or some random part of someone’s discography. I love playing throwback stuff because I want to play the remixes that I wish I could hear in a club, that I know would be played deep in some Barcelona queer underground club.” TAKE 7: THE ANSWERS ACCORDING TO REBECCA BLACK Worst habit? Picking my nails, which I’m doing right now. Greatest fear? Dying. The line that stayed with you? The concept that life hands you exactly what you need when you’re ready for it. You’ll never be handed a situation to get through without the ability to undertake it. Whether or not it is actually true I’m not sure, but it has certainly helped me hold onto hope when I needed it. Biggest regret? Missing moments with family over the years. It takes effort, and I don’t want to have regrets over that. Favourite book? In the Dream House by Carmen Maria Machado. It’s an incredible book about toxic queer relationships. The artwork or song you wish was yours? There’s a lot. The new ROSALÍA album is something only she could do, even having the concept to do it. If you could time travel, where would you choose to go? The future. I want to know what’s up. But I’m afraid of time travel, for sure. That mix of pop appeal and underground edginess is what Black’s own songwriting has evolved into. Her latest album, Salvation, is a banging mix of abrasive hyperpop (think SOPHIE or Charli XCX) and the kind of ambitious songwriting that fell out of favour for the first few decades of this century. “I feel like I’m listening way more to things from the past than I am things that are happening right now. That’s where I learn,” Black says. “If you go back and listen to some of the big pop stars of the ’90s, like Madonna, Janet, that was a time where pop was actually really interesting. “Listen to some of the instrumentals that were on Velvet Rope, Ray of Light, Erotica. That was a time where I think pop was at its best and was celebrated because it was constantly trying to push itself forward ... I think that was why pop died for a second. It felt like that ethos got lost. Everyone was just trying to make something really digestible.” The teenage Black might have been treated harshly by the internet, but like most people her age, her music tastes were discovered online. “I don’t think the way that my relationship with music developed was much different to a lot of my fans,” she says. “It was really a relationship with the internet, a relationship with artists who were really intrinsic to the internet. I mean, I was a Tumblr kid growing up. My audience were my peers.” That might be why the comments on her videos today speak so starkly of the way our online culture has changed. They’re full of admiration for the artist and passionate about their love of her new work, occasionally punctuated with shocked praise from viewers who didn’t realise this was that Rebecca Black.\n\nAdvertisement\n\n“I do think there are pieces of the internet where there is an intention to treat others with kindness,” she says. “I see moments where the internet is trying to police itself in ways.” Offline, too, she’s found her people. The Rebecca Black of 2025 has become something of an icon in queer club spaces, where she finds so much of the most interesting music is happening. “I think there’s a lot of places outside of the US that are way more advanced in the queer spaces they have, including Australia, Melbourne particularly.” She also does a lot of meet-and-greets as she tours. “I love them because I really love understanding who gets it? Who gets me in this way?” Black is now a DJ and something of a queer icon. Credit: Getty Images for Kohls The lyrics on Salvation sometimes flirt with possible references to Black’s past – the title track’s chorus declares that “I don’t need you to save me/I already saved myself” – but the vocals also toy with voice and character to blur personal experience and the playfulness of fiction. “Some of those characters are ways that I can channel the parts of myself that only exist in my head,” she says. “There’s ways that we talk to ourselves or talk about things with ourselves in our heads that I would never articulate, even with a partner. That lives just for me. But the other place it can live is in a song. Those characters are the most deeply personal in a way because I’m disguising them as something that’s a different version of me, but it’s actually probably the truest.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/world/europe/virginia-giuffre-s-family-in-battle-over-who-inherits-andrew-s-multimillion-dollar-payout-20251126-p5nifw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Virginia Giuffre’s family in battle over who inherits Andrew’s multimillion-dollar payout",
    "publish_date": "Wed, 26 Nov 2025 11:59:50 +1100",
    "category": "finance",
    "authors": [
      "Victoria Ward",
      "Connor Stringer"
    ],
    "text": "Virginia Giuffre’s family is readying for an Australian courtroom showdown over her multimillion-dollar estate.\n\nAndrew Mountbatten-Windsor’s sex abuse accuser took her own life in April but died “intestate” – without a formal will.\n\nVirginia Giuffre in 2022, with a photo of herself as a teenager. Credit: Getty\n\nHer closest relatives are now preparing to contest her legacy, with a case management hearing scheduled at the Supreme Court of Western Australia in Perth on Friday.\n\nGiuffre, who was 41, amassed a fortune through victim compensation funds and civil lawsuit settlements relating to the years of abuse she suffered at the hands of Jeffrey Epstein.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/rodd-and-gunn-unveil-french-influenced-fine-diner-and-moody-bar-in-four-storey-precinct-20251126-p5nikr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rodd & Gunn unveil French-influenced fine diner and moody bar in four-storey precinct",
    "publish_date": "Wed, 26 Nov 2025 11:55:33 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe new dining room is the cherry on top of the New Zealand fashion label’s global flagship.\n\n1 / 7 The bar within The Dining Room, fitted with Pitt & Giblin speakers. Jason South 2 / 7 Marron with a roulade of squash and a sauce bisque at the new dining room. Jason South 3 / 7 Art deco design features inside the second-floor restaurant of Rodd & Gunn’s global flagship. Supplied 4 / 7 A deconstructed bouillabaisse featuring roasted bass grouper, prawn, squid and more. Jason South 5 / 7 A highball take on the Penicillin cocktail with honey crisps on the side. Jason South 6 / 7 Bread course, with caramel-glazed brioche at front. Jason South 7 / 7 Rodd & Gunn’s Lodge Restaurant is an extension of the retail experience at the store. Jason South Previous Slide Next Slide\n\nEuropean$$$$\n\nThe Lodge Dining Room is the cherry on top of the New Zealand fashion label Rodd & Gunn’s four-storey global flagship in Melbourne. The precinct includes a shiny retail shopfront on Little Collins Street and beneath it the Cellar & Caffetteria, the subterranean wine bar and bottle shop with cocktails curated by Matt Bax (Bar Americano) and a snackable, shareable Italian menu.\n\nThe Dining Room incorporates not only the restaurant, but a moody bar one level down, also helmed by Bax. Chef James Evangelinos is offering a menu that focuses on technique-driven, French-influenced fine dining with mostly classic flavours. Meals start with the old-school European hospitality of complimentary bread, featuring several bakes of the day centred around a lofty brioche loaf glazed in caramel.\n\nThe $75-a-head fruits de mer is essentially a table-blanketing seafood course, a selection of raw and creatively cooked bites such as moreish abalone croquettes. Beyond, find gently poached Shark Bay scallops with charred white asparagus and a liquid-nitrogen-charged almond dressing spooned on tableside. Sweet marron is served in a delicately flavoured marron bisque alongside a roulade of summer squash.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-ozempic-sized-force-turbocharging-an-aussie-food-shake-up/i7cvou9f7",
    "title": "'Value per bite': The Ozempic-sized force turbocharging an Aussie food shake-up",
    "publish_date": "Tue, 25 Nov 2025 18:38:21 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "More protein and fresh food, hyper-selective eating and 'mini menus'. With an increasing number of Australians on Ozempic-like weight loss medications, these are some of the ways our future eating habits could be influenced, experts say.\n\n\n\n\n\nOriginally developed for the management of diabetes, these GLP-1 drugs are now being sold for weight loss due to their appetite suppression capabilities.\n\n\n\n\n\nIn the past five years in Australia, there's been a surge in the uptake of these medications, such as semaglutide — marketed as Ozempic and Wegovy, and tirzepatide — sold as Mounjaro.\n\n\n\nHow many Australians are on Ozempic-like medications?\n\nNearly 500,000 Australians — almost 2 per cent of the adult population — are using Ozempic-like medications for weight loss or medical reasons, according to a report led by researchers at the University of New South Wales (UNSW), which has not yet been peer reviewed.\n\n\n\n\n\nSales of GLP-1 medications have increased almost 10-fold from 57,941 units in May 2020 to 496,875 units in April 2025, according to the UNSW report, which measured the gap between sales to pharmacies and Pharmaceutical Benefits Scheme (PBS) dispensings.\n\n\n\n\n\nThe figures are likely an underestimate because there may be more GLP-1 medicines that weren't examined in the report.\n\n\n\n\"The popularity of these GLP-1 medicines are booming in Australia,\" report lead researcher Michael Falster, from the UNSW School of Population Health, told SBS News.\n\n\n\n\n\nMore people could join the uptake as medication costs drop and they become available in pill form, instead of an injection.\n\n\n\n\n\nFalster said such medicines for obesity are under review for subsidisation on the PBS.\n\n\n\n\n\nHe said, if they are subsidised, there would likely be \"huge growth in the number of people who are using the medicines\".\n\n\n\nHow will Ozempic change Australian eating habits?\n\nAppetite suppression and a shift in tastes — two of the effects of the medications — are set to have a knock-on effect on the food industry.\n\n\n\n\n\n\"Every bite needs to count, and so, you know, people will be looking for those high nutrient options so that quality protein, the fibre element, is very important to support the gut health and some of the side effects,\" professor Rebecca Golley, a professor of Nutrition and Dietetics at Flinders University, told SBS News.\n\n\n\n\n\nAccording to food and agribusiness bank Rabobank, more people eating less could lead to a rise in demand for dairy, fresh food and \"functional beverages\", with people chasing more \"value per bite\".\n\n\n\n\"It's changing quite sizeably how those consumers are eating, and the amount of people on those products is rising in Australia,\" Stefan Vogel, general manager of the bank's research division, told SBS News.\n\n\n\n\n\n\"Why is protein so important? Because it's not only fat that one is losing when you're using the drug, but it's also muscle that is reduced.\"\n\n\n\nHow dinners are changing in households\n\nA US study found households with at least one person on the medications reduced spending on products such as chips, sweet baked goods and salad dressings, while yoghurt, fresh produce, meat snacks and nutrition bars grew slightly.\n\n\n\n\n\nThose eating habits are likely to affect more than the person on that medication.\n\n\n\n\n\n\"It's often not the person itself that's using the drug, but it's the larger part of the household that shows some change,\" Volger said.\n\n\n\n\n\n\"The dinners are changing a little bit across the household.\"\n\n\n\nREAD MORE Experts call for 'urgent' scrutiny after weight loss drugs are linked to suicidal thoughts\n\nIt's currently estimated that usage of GLP-1 drugs is already reducing food and beverage consumption by one to two per cent, driven primarily by the United States and with Europe starting to follow.\n\n\n\n\n\nVogel said the food industry is looking at what to do about products that are high in sugar and high in fat.\n\n\n\n\n\nAlready, companies such as Nestlé are responding by introducing a line of high-protein, high-fibre frozen meals, while Danone and Coca-Cola are also trying to capture the \"Ozempic market\" by selling high-protein, low-sugar products.\n\n\n\n\n\nRestaurants in the US are also reportedly selling \"Ozempic menus\" to appeal to people taking the medications, selling bite-size portioned meals.\n\n\n\n\n\nHowever, with the uptake still relatively low compared to the general population, restaurants in Australia are not following the US trend, Vogel said.\n\n\n\nGolley from Flinders University said many Australians still opt for discretionary and energy-dense, nutrient-poor foods, a trend that's been consistent for over three decades. GLP-1 drugs could reverse the trends.\n\n\n\n\n\n\"These drugs will be one of those things that we can add into the mix to finally see a shift to decrease those energy-dense, nutrient-poor foods,\" she told SBS News.\n\n\n\n\n\nHowever, Falster from UNSW said GLP-1 medications are not a \"magic bullet\" for weight loss and the best way to obtain the clinical effects are to use the medicines with other lifestyle interventions.\n\n\n\n\n\n\"There's a good chance that what people eat is going to change in the future,\" he said.\n\n\n\n\n\n\"But I think...we need to make sure that people are working with clinicians and dietitians to make sure that what they are eating is healthy and balanced and appropriate for making sure people maintain muscle and bone while they're in the process of losing fat.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/historic-deal-struck-between-delivery-drivers-and-transport-workers-union/pi7uewsji",
    "title": "Historic deal struck between delivery drivers and Transport Workers Union",
    "publish_date": "Tue, 25 Nov 2025 08:23:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Historic deal struck between delivery drivers and Transport Workers Union\n\nPublished 25 November 2025, 6:07 am\n\nWorking conditions for Uber Eats and Doordash delivery drivers are set to change after a historic deal between the Transport Workers Union and the delivery platforms. The joint proposal, submitted to the Fair Work Commission, includes an hourly minimum wage and accident insurance.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/more-names-added-to-australias-national-monument-to-migration-a-symbol-of-belonging-and-hope/svke6yhqi",
    "title": "More names added to Australia's National monument to migration, a symbol of belonging and hope",
    "publish_date": "Tue, 25 Nov 2025 07:34:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "More names added to Australia's National monument to migration, a symbol of belonging and hope\n\nPublished 25 November 2025, 6:03 am\n\nMore than 800 new names have been added to Australia's National Monument to Migration, representing migrants from 56 countries. Their accounts of belonging, hardship and hope honoured at an unveiling ceremony in Sydney.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/rental-squeeze-intensifies-perth-now-australias-least-affordable-city/itb0xvotp",
    "title": "Rental squeeze intensifies: Perth now Australia’s least affordable city",
    "publish_date": "Tue, 25 Nov 2025 07:31:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"The last time was $418.36.\"\n\n\n\n\n\nBudgeting is a battle when there’s nothing left to spare.\n\n\n\n\n\nFor Perth single mother Emily Clements, every week feels like a calculation of survival.\n\n\n\n\n\nShe’s raising two neurodivergent children on her Centrelink parenting payment, which is about $800 a week.\n\n\n\n\n\n\"My rent is $850 a week… so already my whole Centrelink payment has already gone to the rent. I don't save anything, I don't have any savings. The additional money will come from my parents, if something pops up, like my car if there is a flat tyre.\"\n\n\n\n\n\nMs Clements works part-time in administration.\n\n\n\n\n\nBut every dollar she earns reduces her pension.\n\n\n\n\n\n\"We've got some money here we can use. Some fake money… gosh, wouldn’t it be nice if it was real.\"\n\n\n\n\n\nSaving for a home deposit is a thought she’s learned to push away.\n\n\n\n\n\nAnd the guilt hits hardest when she thinks about providing for her kids.\n\n\n\n\n\n\"I actually try not to think about it because it makes me feel like a huge failure. It’s never been on my radar… that I couldn’t provide for my kids.\"\n\n\n\n\n\nIt wasn’t always like this.\n\n\n\n\n\nMs Clements says she grew up in a mid-level wealthy family.\n\n\n\n\n\nShe’s been renting for the past decade, but in the past few years her rent went from $380 a week to $850 today.\n\n\n\n\n\nAnd the competition is fierce.\n\n\n\n\n\nShe’s been to several home opens recently — each she says, with more than 40 people lining up.\n\n\n\n\n\n\"I went to one home open, I was waiting to ask a question to the real estate agent ... as I was waiting there a lady was already talking to him who said she had just sold her property and had $600,000 in her savings, so she was happy to pay a whole year of rent in advance.. so they are the type of people I am competing with.\"\n\n\n\n\n\nNational Shelter’s latest Rental Affordability Index shows this pressure is happening across the country.\n\n\n\n\n\nWhile interest rates have steadied, affordability isn't easing quick enough.\n\n\n\n\n\nJohn Engeler, from National Shelter, says the solution has to come from every level of government.\n\n\n\n\n\n\"These are the types of things state governments can do — and when you back it in with what the Commonwealth can do, both through leadership and schemes like build-to-rent and national rental laws, and other ways the Commonwealth itself can make a difference - that's what we'd like to see.\"\n\n\n\n\n\nBut in many cities, especially Sydney and Perth, that difference can’t come fast enough.\n\n\n\n\n\nIn Sydney, the pressure is just as intense.\n\n\n\n\n\nForty-two-year-old Charlotte Karlsson-Jones came to Australia from Sweden at 19 as a student.\n\n\n\n\n\nMore than two decades later, she’s a single mother still renting — and still struggling.\n\n\n\n\n\n\"For me as a first-generation immigrant… my parents aren’t in the property market. We don’t have the luxury others in my generation have had. We’re already far behind.\"\n\n\n\n\n\nWorking part-time, she earns $2,000 a fortnight.\n\n\n\n\n\n$1,200 of that goes straight to rent.\n\n\n\n\n\n\"Older women have for a very long time sort of been the most high risk of ending up as homeless, or in social housing, so I think that's not something we address by housing for older women. I think we address it way earlier in a woman's life in terms of their opportunites to go to work and support themselves.\"\n\n\n\n\n\nAnd it’s not just families feeling the strain.\n\n\n\n\n\nBusinesses are struggling to attract staff who simply can’t afford to live anywhere near where they work.\n\n\n\n\n\nCafe owner Ie-Tehn Kwee sees the flow-on effects every day.\n\n\n\n\n\n\"The issue is there are less houses available than people need. And some people own way more houses than they can live in. And if those houses were more available, things would ease.\"\n\n\n\n\n\nWestern Australia's Housing Minister, John Carey, says the state’s economy and population growth are behind the pressure — and insists the government is “doing everything it can.”\n\n\n\n\n\nHe points to $5.8 billion in housing investment and 3,800 social homes delivered over four years.\n\n\n\n\n\nThe Federal Government says it recognises more needs to be done — but argues it is increasing supply through national housing funds and by partnering with the states to build more rental homes.\n\n\n\n\n\nFor families like Emily’s, big plans and long-term promises don’t change the immediate uncertainty.\n\n\n\n\n\n“I love you.”\n\n\n\n\n\nThis may well be their last Christmas in this rental.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/investors-brace-for-aussie-cpi-data-as-us-rate-cut-looks-increasingly-likely/7vf7xkf3c",
    "title": "Investors brace for Aussie CPI data as US rate cut looks increasingly likely",
    "publish_date": "Tue, 25 Nov 2025 07:22:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/revealed-labors-nature-law-concessions-in-bid-to-win-greens-or-coalition-support/21t9vkjol",
    "title": "Revealed: Labor's nature law concessions in bid to win Greens or Coalition support",
    "publish_date": "Tue, 25 Nov 2025 07:10:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Labor has unveiled its final pitch to both the Greens and Coalition, as it tries to secure support for its environmental law overhaul.\n\n\n\n\n\nThe 1,500 pages of reforms are before a Senate inquiry, however, the government is dialling up the pressure to meet its self-imposed Christmas deadline.\n\n\n\n\n\nThe committee has heard from industry, business and environmental groups.\n\n\n\n\n\nConcerns vary, from streamlining approvals, weakening environmental protections and ministerial discretion undermining the reforms, to reporting requirements that could delay projects.\n\n\n\nREAD MORE Labor faces a Christmas crossroads over its environment laws reboot\n\nWith only two days left of the parliamentary year, Environment Minister Murray Watt is urging the parties to \"get this done\".\n\n\n\n\n\n\"The act of parliament you're talking about is 25 years old, it is hopelessly out of date and broken, it's gotta be fixed now,\" he told Sky News on Tuesday.\n\n\n\n\n\n\"We can keep talking about this for years or we can actually work together to pass these reforms this week.\"\n\n\n\n\n\nSBS News has obtained a copy of the concessions sent to the Greens and Coalition ahead of their party room meetings on Tuesday morning.\n\n\n\n\n\nHere's a breakdown of what's on offer.\n\n\n\nThe Greens\n\nThe Greens have been calling for a ban on native logging, with Labor instead assuring the party on Sunday that the native forestry industry would need to comply with the proposed new national environmental standards within three years.\n\n\n\nBuilding on the momentum, Labor has sought to address concerns around the expansion of coal and gas by excluding them from the national interest exemption.\n\n\n\n\n\nIt will also limit the fast-tracking of fossil fuel projects as well as restrict them from new streamlined assessment pathways.\n\n\n\n\n\nIf a deal is struck with the Greens, the government will not go ahead with plans to hand over a water trigger or assessments for projects based on surface and groundwater impacts to the states.\n\n\n\n\n\nThe government will review the bilateral agreements with states, giving them assessing powers or approvals in some instances. Either way, the minister will retain ultimate decision-making powers, even if a bilateral agreement is in place.\n\n\n\nGreens senator Sarah Hanson-Young is part of the committee scrutinising the environmental protection laws, arguing three years for the native forestry industry is \"too long\". Source: AAP / Mick Tsikas Last month, Watt ruled out the Greens' demands for a climate trigger, which would see projects rejected if they worsen carbon emissions or impact climate change.\n\n\n\nThe Coalition\n\nThe government tried to alleviate concerns that penalties for breaches are too high — up to $1.6 million for individuals or $825 million for businesses — by stating they would only apply in \"most serious and egregious breaches\".\n\n\n\n\n\nControversial \"stop work\" orders that halt projects will only be in place for a maximum of 14 days.\n\n\n\n\n\nThe minister will have the power to set KPIs as well as sack the head of the proposed National Environment Protection Agency, addressing concerns they would have too much power.\n\n\n\nOf the seven demands tabled by the Coalition last week, two key items are missing.\n\n\n\n\n\nThe amendments do not provide workable definitions of the unacceptable impact test for high-polluting projects that result in their refusal, or what constitutes a net gain or parameters for demonstrating how the project minimises harm or improves the environment.\n\n\n\n\n\nThe definitions, along with no attempt to address scope 1 and 2 emission reporting requirements, are expected not to fly with relevant industry stakeholders.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/fair-work-shake-up-gig-workers-secure-pay-rise-and-protection/rnprlmqjx",
    "title": "Fair Work shake-up: gig workers secure pay rise and protection",
    "publish_date": "Tue, 25 Nov 2025 05:32:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Albanese Labor Government has agreed to a minimum standards agreement for gig workers in Australia.\n\n\n\n\n\nA gig worker is someone who earns income by doing short-term, flexible jobs. They're usually not traditional employees with stable hours.\n\n\n\n\n\nThe deal was negotiated between the Transport Workers Union, ride-share company Uber and Doordash and is before the Fair Work Commission.\n\n\n\n\n\nFollowing years of fighting by gig workers and the Transport Workers Union the deal delivers minimum conditions and pay standards for food delivery riders.\n\n\n\n\n\nThe deal secures a 25 per cent wage increase above the minimum, provides injury insurance and access to employment records.\n\n\n\n\n\nIt also guarantees the right to protection from unfair algorithmic dismissal, where an automated computer system judges how effective a worker is and sacks them.\n\n\n\n\n\nMinister for Employment and Workplace Relations Amanda Rishworth says these reforms are a world first.\n\n\n\n\n\n“Minimum standards, including minimum rates of pay, to ensure that we don't have sort of sub slavery conditions in this country, and so there are workers that had fallen through the cracks, and we took action to fix that law and the agreement that's been struck between the TWU and the platforms is a really profound one.”\n\n\n\n\n\nThe deal also mandates that the platforms must pay for both dispute resolution processes and accident insurance.\n\n\n\n\n\nThe National Secretary of the Transport Workers Union Michael Kaine says there will be a formal consultative process under this new system.\n\n\n\n\n\n“Uber Eats and DoorDash have engaged with the union constructively and in good faith to reach this position. That is a testament to the system that the Albanese government put in place, that is a system that requires these applications to first go to the road transport advisory group, a formal consultative body under the new system, and compel parties to talk to each other about how best it would be to get standards in place. Then if the impasse, or if there is an impasse that needs to be broken, the Fair Work Commission sits ready to act. “\n\n\n\n\n\nUtsav is a food delivery driver in Canberra.\n\n\n\n\n\nHe is a member of the Transport Workers Union, and is passionate about the reforms.\n\n\n\n\n\nHe says sometimes drivers will be on the road and there's not enough work, causing people to sit there making hardly any money at all.\n\n\n\n\n\nThe changes will shift the system from a commission-based model to one guaranteeing a minimum wage.\n\n\n\n\n\n“The drivers that are alongside me, they were crazy enough, the TW members were crazy enough to take that fight, and they've passed laws. They passed, they've been involved with the negotiations. They've done intense negotiation with the companies, and we're this close now to actually get minimum standard. And when I say this, I am proud, but I'm not proud as well, because we're not talking about a decent pay. We're talking about minimum wage. Let that sit with that everybody. It's a minimum wage that we've been fighting for over the last seven years, minimum conditions. It's for this win is for every worker who can now take a sick leave, who can now work 40 / 50, hours and stay home, spend some time with their families.”\n\n\n\n\n\nCanberra food delivery driver Nabin Adhikari calls the new right to be consulted an unprecedented change.\n\n\n\n\n\n“We are having a consultation, right, something like we always wanted, for always wanted to speak with someone when we have there is a sudden change from the algorithm or the platform makes a change, and now we are getting that chance. How powerful is that? How powerful a worker, for a worker, when they are making a change, just for the sake of the money, now, they have to discuss with the consult with the worker. Finally, worker will be having a voice. I think that is the most powerful thing...more than the pay, than the Insurance.”\n\n\n\n\n\nMinister Rishworth was asked about the loophole in the unfair deactivation laws that resulted in the reinstatement of drivers deactivated for severe misconduct.\n\n\n\n\n\nShe responded by saying that the laws were only intended to prevent workers from being unfairly dismissed by algorithms.\n\n\n\n\n\n“Every rider deserves to be safe...Equally, the code of deactivation was also about ensuring, what we had heard that too many drivers were being deactivated based on an algorithm.”\n\n\n\n\n\nUber Eats currently charges a 30 per cent commission on every order.\n\n\n\n\n\nUntil now workers have been paid based on this commission.\n\n\n\n\n\nSo who will pay for the new minimum wage?\n\n\n\n\n\nWill the increased costs to pay gig workers be passed on to consumers, or will they be absorbed by the platforms?\n\n\n\n\n\nDr Alex Feen. a senior lecturer in work and organizational studies at the University of Sydney says the answer is somewhere in the middle.\n\n\n\n\n\n“It's likely consumers will have to pay slightly higher prices for their deliveries. It may come somewhat from the restaurants who are using these services, and we may also see that the platforms are having to perhaps give up some of their cuts.”\n\n\n\n\n\nMr. Kaine says that he hopes that the multinational platforms absorb most of the financial burden.\n\n\n\n\n\nHowever, he believes consumers will be willing to tolerate a modest price hike in exchange for fairer worker conditions.\n\n\n\n\n\n“If you asked the average Australian, would you be okay if you paid a few cents more for your delivery, knowing that the worker who's knocking at your door has proper pay, is appropriately looked after if they're injured, and has terms and conditions that can ensure they can look after themselves and their families. I think that most Australians would say yes to that as well.”\n\n\n\n\n\nThe deal now awaits the decision of the Fair Work Commission, which holds the authority to either approve or reject the agreement.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/this-queer-western-has-guts-and-glam-but-not-quite-enough-giddy-up-20251125-p5ni78.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This could be the silliest play I’ve ever seen",
    "publish_date": "Wed, 26 Nov 2025 12:54:50 +1100",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "James Lew also distracts us with some lollies in the set and costumes design, although the karaoke performances that punctuate the show – as light relief! – are a sin against music. Composer and sound designer Guy Webster not only assails our ears with excruciating songs (albeit in keeping with the idiom) sung badly, but backs up the comic-book action with comic-book sound effects, consisting of more explosions of white noise than is fair on the ears. By the time the morals about mother-daughter relationships and having the courage to break one’s own rules engulfed us, I just wanted to be somewhere else. Vying for the silliest play I’ve seen, this made a director, playwright and actors who are capable of good work look fourth rate. MUSIC\n\nFREEDMAN JAZZ\n\nThe Neilson, November 22\n\nReviewed by JOHN SHAND\n\n★★★★ Twenty-four years ago, pianist Andrea Keller won the inaugural Freedman Jazz Fellowship, and now she was one of a trio of judges announcing saxophonist/composer Sam Gill had won this year’s $30,000 fellowship. Gill will pursue compositional studies, collaboration and recording in New York over the next two years.\n\nWhile the windfall can be life-changing, the evening again felt more of a concert than a competition, with the four finalists performing in one of Sydney’s best venues, with musicians of their choice. It was a testament to the diversity and creativity of Australian jazz that all four sounded like no one else in the music’s history. Gill performed three of his compositions with an iteration of his band Coursed Waters, featuring pianist Novak Manojlovic, electric bassist Christopher Hale and drummer James McLean. Instantly we were assailed by the piquancy of Gill’s soprano saxophone sound and the intriguing outside-of-the-box nature of his sophisticated compositions, with their rhythmic switchbacks and radically changing vistas. On Double Down, he turned to his more usual alto saxophone for a piece that could have been the love child of a menage a trois between Anthony Braxton, Frank Zappa and Nino Rota. It allowed the players maximum creative scope, including a Manojlovic solo that swelled and ebbed with the rhythm section to create an extraordinary sense of the music arriving in waves rather than metered time. After a glorious solo from Hale’s six-string bass, the band converged on a sudden starburst of energy that one felt as a physical jolt. But then trumpeter Niran Dasika would have been a worthy winner, too, initially elevating us to the heavens with celestial solo trumpet – although any angels involved were of the fallen variety, with digital looping, circular breathing and vocal growls used to supernatural effect. When joined by guitarist Lawrence Folvig and drummer Kyrie Anderson, the impact was nothing short of visionary. The guitar hummed and sang like some natural phenomenon, while Anderson was endlessly inventive both texturally and rhythmically, and the trumpet cried out its songs of quiet desperation. In its conceptual scope, this was not a trio, but a three-piece orchestra.\n\nPianist Wilbur Whitta’s trio with bassist Cameron Undy and Alexander Inman-Hislop was utterly engrossing in its sheer playfulness and its ability to make jazz minus the cliches. Again, the compositions were notable for their originality and internal contrasts, with Whitta’s playing effortlessly blending blitheness and conviction. If Perth singer Holli Scott didn’t quite rise to the heights of the other three, she was engaging on her own terms, proving an imaginative lyricist, composer and singer, whose music drifted and swooned like a morning-after reverie. Her songs were performed with trumpeter Jessica Carlton and guitarist Dom Barrett, who ensured that dreaminess remained the prevailing aesthetic, even if the trio was reportedly compromised by sound issues. THEATRE\n\nCowbois\n\nThe Seymour Centre, November 22\n\nUntil December 13\n\nReviewed by KATE PRENDERGAST\n\n★★★½\n\nThis is a noble-hearted, gun-twirling yet dismayingly middling Australian premiere of Charlie Josephine’s 2023 queer western comic fairytale that rides into Sydney town. Making too much of its saddle of progressive morality, this Siren Theatre production of Cowbois stints the energising camp and soaring spirit needed to vindicate its overlong runtime, going down like slow service on watery whisky.\n\nFor all of director Kate Gaul’s good intentions, it only occasionally comes into itself as a radical, celebratory, liberated reimagining of a genre that traditionally loves a binary. Emily Cascarino, Faith Chaza, Branden Christine, Rory Spinks, Jules Billington, Jane Phegan and Amie McKenna. Credit: Alex Vaughan The play is set, naturally, in a small-town saloon. Unnaturally – some could say “queerly” (an overused joke) – there are almost no menfolk here. Aside from the liquor-shaky sheriff and a precocious boy (referred to as “kid”), the husbands all up and left to join the gold rush a year ago, valiantly promising their wives they’d return with a fortune. Another unnatural thing: the town was built to be an exceptional forward-thinking haven, its two founding principles “no guns, no politics”. However, neither of these are upheld. And when fugitive outlaw Jack Cannon swaggers into town, a new kind of man wanted for murder and wanted in a second, sacrilegiously biblical way, its petticoated inhabitants are left weak-kneed, round-eyed and fundamentally shook. New lawless awakenings are about to happen – and not even the returning wave of toxic masculinity that crashes down when the boys get back can reinstate the old oppressive “normal”.\n\nJules Billington is our gunslinger in red, infusing as much tender kindness as cocksure masc into the trans baddie. There’s not a whole lot of substance behind the performativity of their character, though, and Jack’s romance with married Miss Lillian (Emily Cascarino) seems to gallop on subversive lust alone (do they have one intimate exchange before professing love to one another?). An impossible event between them confirms the British playwright’s story to be a wistful, better-world fantasy. A live band in the rafters provides subtle atmospherics, comic sound effects and backing for a few song and dance numbers. The actors weren’t cast to excel in this form of entertainment, with a lack of talent and gusto in throat and on hoof making you wonder why what’s billed as “feel good” so often feels bad. Brockman’s dramatic lighting and Emelia Simcox’s set, featuring clamshell footlights and enormous yellow drapes with purple tassels, battles the underwhelm with immersive aesthetics. One’s heart can’t help but clench in gender-affirming plot moments, too, particularly those involving vulnerable transformation. The sweetest is when “Miss Lucy”, inspired by Jack, shucks off her long skirts to become Lou (Faith Chaza), brave and beaming in jeans and necktie. Sheriff (Matthew Abotomey) also gets a cheer for self-expression of repressed femininity with silk. Clay Crighton (previously on piano and violin, who also contributed original music and lyrics) is a second-act show-stealer as Charley Parkhurst, a hilarious drag caricature of a rival outlaw. His entrance interrupts a long and scattered argument between the townsfolk about new and old values. The most conservative voice is then conveniently shot by dainty hand, and his death promptly passed over by a hammy, action-packed shoot-out. Lord knows the messages of Cowbois are important in a backsliding world. But this desperado could do with more fire in the belly, their steed a swift kick with sharp spurs.\n\nMUSIC\n\nBach Mass in B minor\n\nSydney Chamber Choir\n\nCity Recital Hall, November 22\n\nReviewed by PETER McCALLUM\n\n★★★★½ With his genius for contrapuntal combinations carrying deep musical and symbolic significance, Bach constructed the great four-part fugue, Donna Nobis Pacem, which concludes the Mass in B minor, so the pleas for peace pile harmoniously on top of one another, each beginning before the previous one has ceased and overreaching it (a “stretto” in musical terms) to create a sonic image of collective yearning. The swelling sonority and translucent texture of the Sydney Chamber Choir and the Muffat Collective orchestra under Sam Allchurch in this number encapsulated all the virtues of the performance that it brought to such a glowing close: clarity, balance, judicious tempi and an absence of unwanted accent or distortion. Conductor Sam Allchurch. Credit: Robert Catto\n\nThe striking opening chords that begin the Mass were sung with an unforced, open sound, allowing pure vowels and the music’s harmonic richness to convey the necessary emphasis. The ensuing expansive five-part Kyrie fugue flowed with a deeply embedded, unhurried pulse. For the Christe, soprano Sara Macliver and alto Sally-Anne Russell created a nicely edged duet sound and their pealing imitation in the second theme was like the playful eddies of running water. For the second Kyrie, the choir returned with a tone of measured seriousness. The choruses of the Gloria and the addition of a brilliant battery of three trumpets require, of course, more animation, but Allchurch’s broad metric direction ensured the music was emblematic of joy rather than over-excitement. Concertmaster Matthew Greco led with light precision, aptly demonstrated in the nimbleness of his and Macliver’s ornamentation in Laudamus te. Illustrating the two-in-one theme implicit in the text of the Domine Deus section, flute players Melissa Farrow and Mikaela Oberg wove threads of silvery filigree against Macliver and tenor Andrew Goodwin, the latter singing with smoothly tanned finish and blooming projection. Russell sang the Qui sedes ad dexteram Patris aria with full sound and rich colour, memorably bringing the same qualities to the darker depths of the penultimate Agnus Dei just before the final chorus. Bass David Greco enlivened the Quoniam and Et in Spiritum Sanctum arias with pointed, elastic articulation that accentuated the natural rhythmic emphasis of the complex melodic line.\n\nWhile the orchestra retuned after the Credo, Allchurch regrouped the chorus to facilitate the double-choir format Bach uses for the Osanna. The regrouping also highlighted the broad antiphonal strokes of the Sanctus, which swayed majestically like great tolling bells and gave the music of the Donna nobis pacem (which had been heard earlier in the Gratias agimus fugue with the former grouping) a more focused, brilliant finish. When performed as well as it was here, Bach’s Mass inevitably creates a sense of awe and wonder at the extent of human imagination and craft. What better way for Sydney Chamber Choir to end its 50th anniversary season. MUSIC\n\nSam Fender\n\nShowring, Entertainment Quarter, November 21\n\nReviewed by ROD YATES\n\n★★★★ In 2019, British singer-songwriter Sam Fender played his debut Sydney show at the 500-capacity Oxford Art Factory.\n\nFast-forward six years – during which he’s amassed three UK No.1 albums, a Mercury Music Prize for this year’s People Watching LP and, in June, a sold-out show at the 80,000 capacity London Stadium – and his star has risen significantly. Among the 15,000 people flowing through the gates of the Showring, the constant stream of Newcastle United shirts suggests his expat appeal remains strong. However, when the North Shields-born artist asks how many in the crowd are British and how many are Australians, the loudest cheer comes from the locals, affirmation that his songs of everyday life and blue-collar tribulation have resonance beyond his home country. Sam Fender’s star has risen significantly. Credit: Georgia Griffiths On this night, those songs sound majestic.\n\nThat Fender opens his biggest-ever Sydney show not with a mainstream hit but the deep cut Angel in Lothian suggests this is a man not tied to the staid old traditions of arena rock but one who has faith in his material and his band to make it a convincing opener. His backing group has swelled to a seven-piece over the years, a younger, northern English answer to Springsteen’s E Street Band, and they look like they’re having the collective time of their life. That they can pull off the howling noise-punk rock of Howdon Aldi Death Queue – introduced by Fender as a “stupid song”, and arguably the only set-list misstep of the evening – and follow it with a track as nuanced and elegant as Spit of You is a byproduct not only of the hundreds of shows they’ve played together but their history as friends stretching back to their teenage years. The real stars, though, are the songs themselves. Anthems such as Seventeen Going Under, People Watching and triumphant closer Hypersonic Missiles blend wildly melodic hooks with Fender’s lyrical talent for making his deeply personal experiences resonate with the masses. He begins The Dying Light – a song that addresses suicide and those “who didn’t make the night” – solo on piano before shepherding it to a triumphant, hopeful, full-band climax. The Borders delivers an additional element of joy when a fan is invited onstage to play guitar; recent single Talk to You (the recorded version of which features Elton John) sits as comfortably in the set as older songs such as Will We Talk?",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/the-moment-of-dreadful-clarity-how-katie-allen-s-daughter-recognised-her-worst-fear-20251125-p5nibt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The moment of dreadful clarity: How Katie Allen’s daughter recognised her worst fear",
    "publish_date": "Wed, 26 Nov 2025 12:48:28 +1100",
    "category": "lifestyle",
    "authors": [
      "Annika Smethurst"
    ],
    "text": "I meet Allen on Chapel Street in South Yarra, the suburb where she boarded at Melbourne Girls Grammar and one of the enduring anchors of her life. She lives in neighbouring Toorak, and represented the former seat of Higgins from 2019 to 2022. Abacus Kitchen and Bar, where we sit at an airy corner table, is her local – a place she drops into with her children when they visit Prahran Market. Katie Allen. Credit: Simon Schluter Before we order, Allen continues to talk me through her diagnosis. While the public only learnt of her cancer after election day in May, she had kept it a secret for 18 months, a decision that left her feeling like she was fighting it alone. Now she speaks about it without hesitation, which she says can be too much for some. It’s as if she is finally exhaling after holding her breath for far too long.\n\nReturning to November 2023 – the morning after Jemima noticed her yellowing eyes – Allen found the second sign she had been dreading: white stool. She didn’t try and explain it, she didn’t try and take away the pain because you can’t. Katie Allen Now in Point Lonsdale, she and her husband Malcolm had planned a quiet Melbourne Cup weekend. From there, they immediately drove to Geelong Hospital for a scan. Within an hour, a doctor walked in, sat down and told her simply: “You’ve got a one-centimetre lesion in your pancreas.” “She didn’t try and explain it, she didn’t try and take away the pain because you can’t,” Allen says. “She knew that I knew what that meant.” It was cholangiocarcinoma – a cancer of the bile ducts that is rare, aggressive and notoriously hard to treat.\n\nAs a doctor, Allen had delivered news like this to parents before. Now she was on the other side. “I wept and she waited.” Allen recognised instantly the dissociation she had seen so often. “The shutters come down … you have to give them the bare bones and then say nothing else. I knew that was happening with me.” Within days, she was in surgery. Her tumour was removed, but the risk of recurrence was high – almost inevitable. She and Malcolm discussed stopping work, selling the house, travelling.\n\n“But it is just not us,” she said. They agreed instead to carry on. She told fewer than a dozen people: her four children – Monty, 29; Jemima, 26; Arabella, 24; and Archie, 22 – and a handful of close family. You go out for dinner, and you have the extra, or you order the champagne, and you get the French, you just say ’why the f--- not. Katie Allen With the preselection for Higgins days away, Allen even kept the truth from her staff, claiming she’d had her gall bladder removed. She refused to trigger a sympathy vote. “I didn’t want to be defined by the C-word,” she says. “I didn’t want people to vote for me, or not, because I had cancer.”\n\nOnly after recounting the diagnosis do we turn to lunch. Allen orders the prawn and blue swimmer crab cake with confit kipfler, pickled watermelon radish and squid ink; I choose the Mooloolaba grilled swordfish with reef coconut sauce, potatoes and pangrattato. We share a plate of broccolini. Allen is trying to put on weight. She is noticeably lighter, but she remains bright, animated and determinedly stylish, pausing to reapply her trademark pink lipstick before a photo. Loading As her colleagues in Canberra would attest, Allen has always been forthright, but now she speaks with the certainty of someone who knows exactly how precious time is: “Malcolm said a couple of weeks ago, ‘this is a bitch of a disease but gosh it has brought some beautiful moments’.” In the two years since she was diagnosed, there is a new rule in the Allen household: you always order the good stuff.\n\n“You go out for dinner, and you have the extra, or you order the champagne, and you get the French, you just say ‘why the f--- not’,” she grins. But the extra bottles of Dom aren’t for Allen. She stopped drinking 12 years ago – ironically, to reduce her cancer risk. At Abacus, we indulge in tall glasses of homemade lemonade. If her illness has taken much from her, it has also drawn her already tight-knit family closer together. In 2024, all four of her children were living or studying in Britain. But when December came, they all flew home to spend time with their mum – the cancer still a secret. Subtle excuses kept the extended clan away, allowing a two-week cocoon at home. ‘The kids are amazing, they are my greatest story … They are very loving children.’ Katie Allen “I was crying the whole time,” Allen tells me through floods of tears. “It was the best two weeks of my life ... It was so gorgeous.”\n\nHer children created a treasure hunt for her Christmas present, hiding gifts in the places she is at her happiest, like a book for the hammock in the garden. “The kids are amazing, they are my greatest story … They are very loving children.” This month she became a grandmother for the first time, a milestone that brings both joy and a fierce determination to keep going. Allen’s own childhood was similarly close. Born in 1966, she grew up in Albury, where her father Bill was a much-loved local physician. She tagged along on his ward rounds at seven, the moment medicine imprinted itself. “He loved what he did, he had a beautiful bedside manner.”\n\nAfter boarding school at Melbourne Girls Grammar – where her grandmother, mother and daughters were also educated – she briefly flirted with journalism, making it to the final six for a cadetship at a Melbourne newspaper. Monash medicine won out. He kissed me and we have never looked back. We have been together ever since. I have never looked at another man. Katie Allen Two decades before that fateful Cup weekend when she was diagnosed with cancer, Allen met her husband trackside at Flemington on Cup weekend. It was 1988, Empire Rose won the two-mile race, but Allen insists she “snagged” the best prize – an Englishman called Malcolm. “He kissed me and we have never looked back. We have been together ever since. I have never looked at another man. Never thought about another man. He is my rock.” Back in that Geelong hospital room, it was Malcolm – a management consultant – who refused to let the diagnosis upend their lives. Through floods of tears, Allen recalls turning to her husband, who was already encouraging her not to give up on her dream of returning to Canberra.\n\n“Oh Malcolm, it’s over,” she told him. Loading While she absorbed the emotional shock, he shifted instantly into what she calls management mode – encouraging her to run for Higgins, even as she recovered from surgery. “I was doing it to keep him happy,” she admits. “He just wants to keep kicking the cancer can down the road.” Allen went on to win preselection for Higgins. Five months later, the seat would be abolished in a redistribution, forcing her into a bruising contest for neighbouring Chisholm. In September 2024, she defeated the preselected candidate, Theo Zographos, to secure the party’s endorsement.\n\n“Now and then, if someone would do something really mean, I would think ‘If only you knew I had cancer’,” she jokes. Katie Allen outside a polling booth on election day in May 2022. Credit: Scott McNaughton By early 2025, with the federal election approaching, her symptoms crept back. Mild abdominal pain at first, then more unmistakable signs. She knew she should see a doctor, but put it off – a delay she now recognises as denial. A conga line of Liberal colleagues visited Chisholm to help her campaign. She never once revealed her private health battle. She knows the ethics of running while harbouring a cancer diagnosis will always prompt debate – voters deserve transparency and candidates owe them the full picture.\n\nAllen grappled with the possibility of winning, relapsing, and triggering a by-election, but her family pushed her to live fully, not withdraw. “My family all said it’s better I get in there and do it.” A tropical cyclone pushed the election to May, stretching out the campaign as her health deteriorated. Some nights she plunged into the pool three times to soothe the pain. Katie Allen in 2022. Credit: Simon Schluter “I rang my doctor and said ‘I am deteriorating’ and she knew what that meant.”\n\nStill, she did not want her illness to influence the result. Loading On May 3, she lost Chisholm. The following Monday, she was in hospital for tests and immediately started chemotherapy. The cancer had spread. After the relapse, she said her prognosis “dropped significantly”, shifting her into what oncologists call a different “prognostic environment”. She doesn’t like the term “terminal” but acknowledges it is incurable. Still, she holds tight to what she calls “deluded hope” – the stories of rare patients who defy the averages.\n\n“There are some people who are the outliers who last a year or two, and you want to be the outlier. “I know it is deluded hope, but what else have you got.” A new clinical trial – one she nearly missed – has given her new hope. Before that, she had just wanted to make it to Christmas. “If you are on a treatment with no side effects, that is a good quality of life.” Allen is approaching life with vulnerability and pragmatism, largely free of regrets – except for Canberra, where she wishes she had done more to champion the party’s moderate faction.\n\n“I went in to change the Liberal Party from the inside … but I completely and utterly failed. I did my best, but I didn’t make much difference.” Katie Allen with John Howard in 2022. Credit: Eddie Jim During her time in Canberra, she crossed the floor on the religious discrimination bill to vote on amendments that would prohibit vilification of and discrimination against children based on sexuality and gender identity, protecting all LGBTIQ+ students. She also joined colleagues pushing for the Murugappan family to be returned to Biloela. And she was part of the internal push to cut greenhouse gas emissions to net zero by 2050. She jokes that she should have been “the Pauline Hanson of the moderates”, but said she mostly remained quiet when she should have spoken up.\n\nDespite the recent turmoil in the state and federal Liberal parties, Allen hasn’t given up. She sees promise in younger women such as Jess Wilson and Amelia Hamer, whose rise she has quietly supported – even hosting events for Hamer as her health wobbled. Loading Her medical background means she does not romanticise what lies ahead. She supports Victoria’s voluntary assisted dying laws for others but doesn’t wish to use them saying she has great faith in the health system. When her time does come – a date she hopes has been pushed further back thanks to her new trial – she hopes to spend her final days at home. But she is not grieving her life.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyrics are king at a Doja Cat show – it’s a shame we can’t hear most of them",
    "publish_date": "Wed, 26 Nov 2025 12:47:50 +1100",
    "category": "entertainment",
    "authors": [
      "Nell Geraets",
      "Thuy On",
      "Karl Quinn",
      "Andrew Fuhrmann"
    ],
    "text": "Prior criticism around the tour’s lack of visuals, structure and outfits are technically warranted – the stage remains unchanged throughout and Doja wears just one costume. But such simplicity keeps all eyes on the so-called queen of rap-pop, whose exaggerated facial expressions offer all the theatrics needed. And when you aren’t looking at Doja, you’re watching her tiger-striped band, many of whom do the robot or roll around on the floor during instrumental interludes. Loading For someone who’s known for sending the occasional barb to fans online (remember when she told us to “get a job”?), there sure is a lot of love in the room. The crowd – many of whom are dressed in ’80s workout gear and inflatable cow costumes – carry Doja through each track, particularly Take Me Dancing and Boss Bitch, singing so loudly it practically drowns out the backing tracks. This clearly tickles Doja, who smiles ear-to-ear each time she holds the mic out. Her commitment to the fans shines brightest when she stops the show to ask the crowd to help get a fan who has fainted to safety. It may not be her strongest gig, but you know you have a star on your hands when a singer who is losing their voice can still make a packed crowd purr.\n\nReviewed by Nell Geraets\n\nMUSIC\n\nDaniel Müller-Schott with Konstantin Shamray ★★★★★\n\nMelbourne Recital Centre, November 25 German cellist Daniel Müller-Schott has returned to Melbourne, filling Elisabeth Murdoch Hall with the glorious resonance and many-splendoured lyricism of his 1727 “Ex Shapiro” Matteo Goffriller cello. Cellist Daniel Müller-Schott Noting his instrument is almost exactly contemporaneous with Bach’s Cello Suite No. 3 in C major, BWV 1009, Müller-Schott brought an expansive, larger-than-life feeling to this classic. Like the rest of the suite, the Prelude was flexible yet rhythmic, powered by artistic and technical assurance. Other movements were beautifully characterised, with especially telling contrasts between the sprightly Courante and the intense yet subtly coloured Sarabande, while the well-known Bourée and the rustic Gigue were buoyed by joyous rhythmic energy.\n\nTogether with Russian-born, Australian-based pianist Konstantin Shamray, Müller-Schott offered great insights into Shostakovich’s Cello Sonata in D minor, Op. 40. Once again proving himself to be an extraordinary colourist, Müller-Schott gave the opening two themes a life of their own, with exchanges between instruments deftly handled. Loading At the centre of the work, the third-movement Largo became a soul-searing expression of heartache. This vividly etched lament was surrounded by remarkable vigour, both in the second-movement Allegro and in the impish finale. Throughout, the artists harnessed Shostakovich’s formidable array of technical demands to memorable musical ends. From the outset, Brahms’ Cello Sonata No. 2 in F major, Op. 99 overflowed with grandeur and ardent passion. Thanks to the superb instrument, the pizzicato in the Adagio had an unusual depth, while the middle section of the Allegro passionato was yet another instance of the cello’s voice taking on an almost-human quality. The cheerful, hope-giving finale set the seal on arguably one of the best concerts of the year. How wonderful to see Müller-Schott’s generous, open personality and poetic musicianship garner him quite a following of young fans, teeming in the audience and listening with rapt attention.\n\nReviewed by Tony Way\n\nCABARET\n\nMeow Meow’s The Red Shoes ★★★\n\nMalthouse Theatre, until December 6 The original Hans Christian Andersen’s tale involves a girl enamoured with a pair of red shoes. As punishment for her vanity, the shoes are cursed, and she’s forced to dance in them forever. Meow Meow’s The Red Shoes is a retelling of the Hans Christian Anderson classic. Credit: Brett Boardman Even when her feet are amputated, the shoes still dance tauntingly before her. Yes, it’s grim, as a lot of these unvarnished fairytales are wont to be, but this is Meow Meow’s Red Shoes, and she has her own ideas about the classic story. It’s the third iteration in her fairytale series, after The Little Matchstick Girl and The Little Mermaid. The show opens on a comic note with the performer (otherwise known as Melissa Madden Gray) being dragged on stage by her legs. This self-confessed “eternal showgirl” has lost her muse; she’s a marionette slackened with existential angst and more attuned to the sorry, lustreless state of the world.\n\nIndeed, Dann Barber’s set contributes to the post-apocalyptic mood with its mountain of debris and a plastic curtain. Meow Meow climbs up and down this graveyard of rubbish, singing and emoting and resplendent in a black mini dress, bouffant hair and even bigger plumed headgear. The musicians (Mark Jones, Dan Witton and Jethro Woodward) are in distressed tuxedoes, and between them play an astonishing array of instruments including piano, guitar, double bass, drums and tuba. Dann Barber’s set contributes to the post-apocalyptic mood. Credit: Brett Boardman Meow Meow’s energy is unflagging: aside from the actual dancing (sometimes lopsidedly with different footwear), she also hops, crawls and does the splits. She can be vulnerable one moment (hobbling around trying to find her missing red shoe), and brazen the next, in an interactive aside with the audience to “redistribute the wealth”. There’s a lot going on in this digressive show with its various sprays against communism, capitalism and world greed in general. It’s a springboard of ideas, but it’s difficult to find the skein of narrative about the titular red shoes in between all the play and hijinks.\n\nMeow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/reynolds-defends-special-broncos-rebrand-20251126-p5nimk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Reynolds defends 'special' Broncos rebrand",
    "publish_date": "Wed, 26 Nov 2025 12:46:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Reynolds defends 'special' Broncos rebrand\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/lifestyle/meghan-markle-rep-responds-to-claims-she-stole-dress-from-2022-photoshoot-20251126-p5nim5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Meghan Markle rep responds to claims she 'stole' dress from 2022 photoshoot",
    "publish_date": "Wed, 26 Nov 2025 12:34:44 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Meghan Markle rep responds to claims she 'stole' dress from 2022 photoshoot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/a-restored-art-deco-pub-with-an-all-are-welcome-attitude-and-5-happy-hour-beers-20251126-p5nilg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A restored art deco pub with an all-are-welcome attitude (and $5 happy hour beers)",
    "publish_date": "Wed, 26 Nov 2025 12:20:26 +1100",
    "category": "finance",
    "authors": [],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe Orrong Hotel is a local hot spot in Armadale, with weekly specials galore.\n\n1 / 6 Watch the footy at the Orrong Hotel. Supplied 2 / 6 Graze on party pies at the Orrong Hotel. Supplied 3 / 6 The Orrong Hotel’s wood-panelled dining room. Supplied 4 / 6 Louisiana chicken wings come with pickles and ranch dressing. Wayne Taylor 5 / 6 The Philly cheese steak. Wayne Taylor 6 / 6 School prawns. Wayne Taylor Previous Slide Next Slide\n\nPub dining$$$$\n\nDating to around 1940, this art deco pub was sensitively restored in 2021. The original timber front bar sits handsomely in the retro-styled corner parlour, making the idea of lifting an elbow to drink an icy lager extremely appealing. Important to note: the old coolroom is now a poolroom.\n\nThe very model of a friendly local, the Orrong has alluring happy hours with $5 beers, $25 express lunches, a steak night on Thursdays with a meat raffle, and an all-day rotating Sunday roast of meat and (usually more than three) veg for $28. Classic counter meals are balanced by contemporary dishes such as tacos and eggplant parmigiana.\n\nBest for: An all-are-welcome attitude.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/a-day-in-the-life-of-a-premier-league-manager-20251126-p5niln.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A day in the life of a Premier League manager",
    "publish_date": "Wed, 26 Nov 2025 12:06:40 +1100",
    "category": "sports",
    "authors": [],
    "text": "A day in the life of a Premier League manager\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/takaichi-s-gamble-japan-is-trying-to-escape-the-debt-trap-20251126-p5nihe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Takaichi’s gamble: Japan is trying to escape the debt trap",
    "publish_date": "Wed, 26 Nov 2025 12:04:32 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Japan’s bond yields have been hitting decades-long highs. Its sharemarket is sliding. The yen is slumping. The country’s new prime minister has monster challenges, with implications for markets and economies elsewhere.\n\nLast week, Sanae Takaichi unveiled her responses to an economic contraction (the September quarter saw the economy shrink at an annualised rate of 1.8 per cent), persistent inflation of 3 per cent, a weakening currency, the impact of Donald Trump’s tariffs and the affordability issues for households that are prevalent elsewhere.\n\nShe announced a ¥21.3 trillion ($211 billion) stimulus package that includes subsidies for energy costs, a cut in Japan’s petrol tax, cash handouts for households, rice vouchers and investments in shipbuilding, semiconductors and artificial intelligence.\n\nJapan’s Prime Minister Sanae Takaichi faces monster-sized economic challenges. Credit: AP\n\nTo fund the package, Takaichi will need to issue more government bonds. Japan is already the world’s most indebted economy, with a debt-to-GDP ratio of about 230 per cent.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/traveller/reviews-and-advice/this-former-70s-motel-has-become-a-beacon-of-luxury-in-byron-bay-20250821-p5moos.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This former ’70s motel has become a beacon of luxury in Byron Bay",
    "publish_date": "Wed, 26 Nov 2025 12:02:41 +1100",
    "category": "finance",
    "authors": [
      "Katherine Scott"
    ],
    "text": "Advertisement\n\n★★★★ Reviews & adviceHotel reviews This former ’70s motel has become a beacon of luxury in Byron Bay Katherine Scott November 26, 2025 — 12:02pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Holiday Guide to Australian road trips. See all stories .\n\nThe hotel The Bower Byron Bay The heated magnesium pool at The Bower Byron Bay. Check-in Not unlike the flux of defecting A-listers and preternaturally beautiful folk who’ve sent Byron’s average attractiveness levels into the stratosphere, The Bower Byron Bay continues to hold its own among the town’s newest crop of glamorous coastal stays. She’s had a fair whack of work over the decades. The former 1970s motel was first reimagined as a luxury hotel in 2017 – the original designer and co-owner, Taliah Lowry, laced Byron’s beachy essence with a touch of New York grit, inspired by the US city’s industrial-cool Bowery neighbourhood. A recent two-year upgrade has once again restored its sheen and grown its footprint, with new additions including a guest lounge, hotel bar, swish new reception space, an onsite spa treatment centre and four beautiful new suites.\n\nAdvertisement\n\nThe look The new guest lounge … currently used for functions. The Bower Barn. The Bower’s old-school roadside motel past is easy to spot, thanks to a concrete carpark that dissects the property, but creative firms Studio Plenty and Tanev Muir have added plenty of tropical greenery and flair to the mix. No two accommodations are the same, though they do share a penchant for organic textiles and tones, modern art, dark woods and custom furnishings by Byron artist Alexis Williams. The revamp has also seen all rooms upgraded with king beds, and a beautiful new lounge and bar area that’s currently reserved as a function space. The one-bed Bower Barn and five-bedroom Bower Cottage at the back of the property are among the most striking and sought-after stays – think charming white weatherboard exteriors, picket gates, pitched ceilings, rustic wooden beams, and luxe touches like a glass-roofed bath (for bathing under the stars) and a private cedar mineral spa. Outside, a striking solar-panel-powered circular heated magnesium pool, hugged by palms and day beds with privacy curtains, is the pièce de résistance.\n\nAdvertisement\n\nThe room One of the new luxury Bower Studios. Shades of grey … the Bower Studio. We’re staying in one of two newly launched Bower Studios. The sultry combination of a giant four-poster bed, distressed mirrors, and sheer black curtains framing a freestanding stone bath feels both luxurious and, erm, 50 Shades? The cabin’s entrance is steps from the car spot, tucked behind a whitewashed wall for extra privacy; inside, a soaring pitched roof and spectrums of charcoal tap into that smouldering New York warehouse vibe. There’s a kitchenette, Nespresso machine, mini-bar stocked with snacks and local favourites, complimentary bath salts and decadent Hunter Amenities. It takes a second to master where to find the various light switches; tech is generally great, with fast Wi-Fi and a smart TV with casting capability. The beautiful rough-hewn wooden side tables and handmade ceramic lamps look neat, but don’t leave much room for a phone or book. The open-plan en-suite is all sorts of ravishing, between the egg-shaped bath overlooking a glass-walled garden and floating vanity. Food + drink\n\nAdvertisement\n\nThe pool is serviced by a licensed pool bar. There’s no onsite restaurant, though the spiffy pool area is serviced by a licensed pool bar offering a basic menu of Curatif canned cocktails, drinks and bar snacks – and you can BYO food from local eateries or pre-order a hamper (if you’re after something freshly shaken, you’ll have to venture into town). Next door, The General Store cafe mixes heritage appeal with a sun-kissed aesthetic, and the coffee and brunch dishes don’t miss (the smoked bacon is a revelation). Out + about Pixie Italian dining room. It’s a 15-minute walk to town and 20 minutes to the beaches. Happily, the buzzy Jonson Lane area is only a block away and boasts some of the town’s best restaurants – tuck into aperitivo and chilli-laced tubes of mezze maniche pasta with pork sausage at Pixie Italian, or soak up the punchy Asian flavours and deep list of lo-fi drops at Bar Heather.\n\nAdvertisement\n\nYou can’t swing a yoga mat without hitting a day spa in these parts, but the Bower’s petite new guest-only spa is well worth securing a booking for, offering treatments with luxe Mukti Organics products; the 90-minute facial has me floating back to my room. The verdict The pool, the bath ... file it all under “ridiculously good-looking” and chalk it down to the Byron effect. A worthy base from which to hit the town’s boutiques, beaches, and bars, The Bower’s latest refresh cements it as one of the better luxury options in town. Essentials From $320 a night; $620 for a Bower Studio. No wheelchair access rooms. 28 Bangalow Rd, Byron Bay. Phone: (02) 6680 9577. See thebowerbyronbay.com.au\n\nAdvertisement\n\nOur rating out of five ★★★★ Highlight Complimentary Lekker bikes, yoga mats, hairstyling tools and beach umbrellas are a welcome bonus. Lowlight\n\nAdvertisement\n\nFair warning, the toilet and shower aren’t exactly sealed off from the room (think a half-wall that lets in light – but leaves little to the imagination). The writer stayed as a guest of The Bower Byron Bay.\n\nSign up for the Traveller newsletter The latest travel news, tips and inspiration delivered to your inbox. Sign up now.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/music/the-world-mocked-her-but-now-rebecca-black-is-playing-lollapalooza-20251124-p5ni09.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world mocked her, but now Rebecca Black is playing Lollapalooza",
    "publish_date": "Wed, 26 Nov 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "John Bailey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This month Australia implements laws to address the toxic aspects of online life, but not so long ago, it was apparently perfectly fine for a good portion of the internet to direct astonishing levels of hatred and vitriol at a young girl from California. People who go viral for reasons beyond their control typically disappear back into the scenery of non-internet life. Rebecca Black never flinched. Black is now touring Australia as part of the Spilt Milk festival, alongside Kendrick Lamar and Doechii. She’s also headlining her own shows, including her largest ever at Melbourne’s Forum Theatre. If you think her presence has something to do with Friday, the song that launched her to fame and became the most viewed YouTube video the year it was released, you’re living in the past. A brief recap is all the Friday affair deserves. When Black was 13 she recorded a novelty pop song and video clip with an LA company that offered ordinary folks just such an experience. Friday was intended to be a throwaway bit of fun to share with friends, but somehow the music video ended up online right at the moment when memes and meanness were becoming inextricable. Until that point, social media had been a largely benign place full of lolcats and rickrolling and pokes. By 2011, however, the tone had started to shift. The default voice was snarkier, the humour had become crueller, and any innocent could find themselves hoisted up for public ridicule. The socials democratised the angry mob, promising a pitchfork and flaming torch for everyone. Black – at age 22 – who was just 13 when her pop video went viral for all the wrong reasons. Credit: It’s hard to overstate just how vile the response to Friday became, with strangers posting the most violent and juvenile comments towards a random kid whose home movie had so upset them. From medieval witch trials to the screaming fans of the Fab Four to the Twilight and Tay-Tay stans in recent times, there’s a certain sort who have a screaming fit whenever they see a girl having fun on her own terms. Today it’s Black: 1, Haters: 0. She never quit. This year the 28-year-old played a DJ set at Lollapalooza, one of the largest music festivals on earth. Punters who only remembered her as the Friday girl were floored. The set-list from that gig includes titles familiar from the pop canon – from Britney’s Toxic to Bjork’s Hyperballad to Addison Rae’s Fame Is a Gun – but you won’t find the bootleg cuts she spins anywhere on Spotify or Shazam. They’re familiar while also illustrating a deep knowledge of dance culture today.\n\nAdvertisement\n\nWhen Black DJs, she says, “I’m there to highlight the tracks that I really love and feel attached to, that I find in the depths of SoundCloud or some random part of someone’s discography. I love playing throwback stuff because I want to play the remixes that I wish I could hear in a club, that I know would be played deep in some Barcelona queer underground club.” TAKE 7: THE ANSWERS ACCORDING TO REBECCA BLACK Worst habit? Picking my nails, which I’m doing right now. Greatest fear? Dying. The line that stayed with you? The concept that life hands you exactly what you need when you’re ready for it. You’ll never be handed a situation to get through without the ability to undertake it. Whether or not it is actually true I’m not sure, but it has certainly helped me hold onto hope when I needed it. Biggest regret? Missing moments with family over the years. It takes effort, and I don’t want to have regrets over that. Favourite book? In the Dream House by Carmen Maria Machado. It’s an incredible book about toxic queer relationships. The artwork or song you wish was yours? There’s a lot. The new ROSALÍA album is something only she could do, even having the concept to do it. If you could time travel, where would you choose to go? The future. I want to know what’s up. But I’m afraid of time travel, for sure. That mix of pop appeal and underground edginess is what Black’s own songwriting has evolved into. Her latest album, Salvation, is a banging mix of abrasive hyperpop (think SOPHIE or Charli XCX) and the kind of ambitious songwriting that fell out of favour for the first few decades of this century. “I feel like I’m listening way more to things from the past than I am things that are happening right now. That’s where I learn,” Black says. “If you go back and listen to some of the big pop stars of the ’90s, like Madonna, Janet, that was a time where pop was actually really interesting. “Listen to some of the instrumentals that were on Velvet Rope, Ray of Light, Erotica. That was a time where I think pop was at its best and was celebrated because it was constantly trying to push itself forward ... I think that was why pop died for a second. It felt like that ethos got lost. Everyone was just trying to make something really digestible.” The teenage Black might have been treated harshly by the internet, but like most people her age, her music tastes were discovered online. “I don’t think the way that my relationship with music developed was much different to a lot of my fans,” she says. “It was really a relationship with the internet, a relationship with artists who were really intrinsic to the internet. I mean, I was a Tumblr kid growing up. My audience were my peers.” That might be why the comments on her videos today speak so starkly of the way our online culture has changed. They’re full of admiration for the artist and passionate about their love of her new work, occasionally punctuated with shocked praise from viewers who didn’t realise this was that Rebecca Black.\n\nAdvertisement\n\n“I do think there are pieces of the internet where there is an intention to treat others with kindness,” she says. “I see moments where the internet is trying to police itself in ways.” Offline, too, she’s found her people. The Rebecca Black of 2025 has become something of an icon in queer club spaces, where she finds so much of the most interesting music is happening. “I think there’s a lot of places outside of the US that are way more advanced in the queer spaces they have, including Australia, Melbourne particularly.” She also does a lot of meet-and-greets as she tours. “I love them because I really love understanding who gets it? Who gets me in this way?” Black is now a DJ and something of a queer icon. Credit: Getty Images for Kohls The lyrics on Salvation sometimes flirt with possible references to Black’s past – the title track’s chorus declares that “I don’t need you to save me/I already saved myself” – but the vocals also toy with voice and character to blur personal experience and the playfulness of fiction. “Some of those characters are ways that I can channel the parts of myself that only exist in my head,” she says. “There’s ways that we talk to ourselves or talk about things with ourselves in our heads that I would never articulate, even with a partner. That lives just for me. But the other place it can live is in a song. Those characters are the most deeply personal in a way because I’m disguising them as something that’s a different version of me, but it’s actually probably the truest.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/world/europe/virginia-giuffre-s-family-in-battle-over-who-inherits-andrew-s-multimillion-dollar-payout-20251126-p5nifw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Virginia Giuffre’s family in battle over who inherits Andrew’s multimillion-dollar payout",
    "publish_date": "Wed, 26 Nov 2025 11:59:50 +1100",
    "category": "finance",
    "authors": [
      "Victoria Ward",
      "Connor Stringer"
    ],
    "text": "Virginia Giuffre’s family is readying for an Australian courtroom showdown over her multimillion-dollar estate.\n\nAndrew Mountbatten-Windsor’s sex abuse accuser took her own life in April but died “intestate” – without a formal will.\n\nVirginia Giuffre in 2022, with a photo of herself as a teenager. Credit: Getty\n\nHer closest relatives are now preparing to contest her legacy, with a case management hearing scheduled at the Supreme Court of Western Australia in Perth on Friday.\n\nGiuffre, who was 41, amassed a fortune through victim compensation funds and civil lawsuit settlements relating to the years of abuse she suffered at the hands of Jeffrey Epstein.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/rodd-and-gunn-unveil-french-influenced-fine-diner-and-moody-bar-in-four-storey-precinct-20251126-p5nikr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rodd & Gunn unveil French-influenced fine diner and moody bar in four-storey precinct",
    "publish_date": "Wed, 26 Nov 2025 11:55:33 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nThe new dining room is the cherry on top of the New Zealand fashion label’s global flagship.\n\n1 / 7 The bar within The Dining Room, fitted with Pitt & Giblin speakers. Jason South 2 / 7 Marron with a roulade of squash and a sauce bisque at the new dining room. Jason South 3 / 7 Art deco design features inside the second-floor restaurant of Rodd & Gunn’s global flagship. Supplied 4 / 7 A deconstructed bouillabaisse featuring roasted bass grouper, prawn, squid and more. Jason South 5 / 7 A highball take on the Penicillin cocktail with honey crisps on the side. Jason South 6 / 7 Bread course, with caramel-glazed brioche at front. Jason South 7 / 7 Rodd & Gunn’s Lodge Restaurant is an extension of the retail experience at the store. Jason South Previous Slide Next Slide\n\nEuropean$$$$\n\nThe Lodge Dining Room is the cherry on top of the New Zealand fashion label Rodd & Gunn’s four-storey global flagship in Melbourne. The precinct includes a shiny retail shopfront on Little Collins Street and beneath it the Cellar & Caffetteria, the subterranean wine bar and bottle shop with cocktails curated by Matt Bax (Bar Americano) and a snackable, shareable Italian menu.\n\nThe Dining Room incorporates not only the restaurant, but a moody bar one level down, also helmed by Bax. Chef James Evangelinos is offering a menu that focuses on technique-driven, French-influenced fine dining with mostly classic flavours. Meals start with the old-school European hospitality of complimentary bread, featuring several bakes of the day centred around a lofty brioche loaf glazed in caramel.\n\nThe $75-a-head fruits de mer is essentially a table-blanketing seafood course, a selection of raw and creatively cooked bites such as moreish abalone croquettes. Beyond, find gently poached Shark Bay scallops with charred white asparagus and a liquid-nitrogen-charged almond dressing spooned on tableside. Sweet marron is served in a delicately flavoured marron bisque alongside a roulade of summer squash.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/optus-rocked-another-major-outage-232706614.html",
    "title": "‘Unacceptable’: MP slams Optus outage",
    "publish_date": "2025-11-26T01:51:40Z",
    "category": "finance",
    "authors": [],
    "text": "Liberal MP Melissa McIntosh has lashed Optus following a significant outage that has left more than 14,000 Optus customers without coverage in Melbourne’s southeast.\n\n“It is absolutely unacceptable triple-0 calls are again being impacted by yet another Optus outage,” the opposition communications spokeswoman said.\n\n“It is sending chills up Australians’ spines this morning.\n\n“Regardless of the fault, Optus has an obligation to provide triple-0 services to Australians anywhere and at any time.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe ongoing outages “must stop”, Ms McIntosh said, before reiterating her call for a “full and thorough independent inquiry into the triple-0 ecosystem.”\n\nMs McIntosh has called for a full-scale inquiry into the triple-0 network. Picture: NewsWire / Martin Ollman\n\n“What else will put Australians at ease unless we find every issue in the system and ensure there is a plan to address every fault,” she said.\n\nMs McIntosh demanded Labor and the telco watchdog “speak up and take action”, accusing both of being the “last to respond or provide Australians with the information they need and deserve”.\n\nCommunication Minister Anika Wells’ office has been contacted for comment.\n\nOptus investigates\n\nIn a message on the company’s website, Optus has confirmed it is probing the outage affecting those in the Frankston and Mornington Peninsula areas of Victoria.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt is affecting 14,096 services.\n\nThe outage has been attributed to an “aerial fibre break”.\n\n“Calls to emergency services are impacted by this outage,” the message on the website states.\n\n“Optus customers will only be able to call emergency services if they are within coverage of another mobile network or are able to call via wi-fi.”\n\nMore than 14,000 Optus customers have been rocked by a major outage. Picture: NewsWire / Nikki Short\n\nA further update has been promised “as soon as possible if there’s a significant change”, or within the next six hours.\n\nOptus has been contacted for further comment.\n\nThe new outage comes just a few months after the telco’s disastrous triple-0 outage, which left hundreds unable to make emergency calls when a network disruption turned catastrophic.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe outage has been linked to the deaths of three Australians.\n\nIn September – that same month – Optus was hit with a $100m fine for exploiting vulnerable Australians in “predatory” conduct.\n\nThe court found between 2019 and 2023, sales were pushed on 400 vulnerable Australians when Optus sold products they did not want or need, or could not use and afford.\n\nThe company failed to explain terms and conditions on the contracts for sale in a manner that could be easily understood – which resulted in many failing to understand how their ongoing payment obligations worked.",
    "source": "Yahoo",
    "cluster_id": 39
  }
]