[
  {
    "url": "https://www.9news.com.au/national/toyota-tundra-ute-recalled-reverse-lights-issue/9f87280e-545c-4203-9951-c96fd3196b17",
    "title": "Ute that sells for $160,000 recalled over safety issue",
    "publish_date": "Tue, 27 May 2025 00:13:07 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Hundreds of﻿ Toyota utes that have been recalled over an issue with the reverse lights.\n\nThe recall affects models from Toyota Tundra VXKH75 regular, Limited, and Platinum range from 2022 to 2024.\n\nThis amounts to 831 affected units around the country.\n\nHundreds of Toyota Tundra utes have been recalled. (Supplied)\n\nThe recall notice said a manufacturing defect could allow moisture to enter the internal circuit board of the reverse lamps, meaning they might not light up when the car is in reverse.\n\nThe rear-view camera may also become activated while driving.\n\nThe Tundra sells from a starting price of $159,990.﻿\n\nYoung woman's drug conviction tears apart Australia View Gallery\n\n\"If the traffic behind is unable to identify if the vehicle is reversing, it could increase the risk of an accident causing serious injury or death to vehicle occupants and/or other road users,\" the notice read.\n\nToyota will contact owners of the affected cars to advise them of the recall, and will contact them again later when parts are available.\n\nWhen that happens, owners will be able to make an appointment at their preferred Toyota dealer to fix the issue, free of charge.\n\nFind out more online or contact Toyota on 1800 987 366.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/snooze-alarms-may-cost-you-vital-sleep-study-says/d747cd71-0280-499a-a6e3-5baf812ab596",
    "title": "Why hitting the snooze button may cost you hours of lost sleep",
    "publish_date": "Tue, 27 May 2025 00:07:28 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "When jolted awake by the blare of an alarm clock, it's tempting to reach for the snooze button to catch a bit more shut-eye. For many people, \"just five more minutes\" is practically a morning mantra. And what's the harm?\n\nThere's increasing debate about your snoozing habit, and whether or not it's silently sabotaging your morning.\n\nOn the \"stop snoozing\" side of the research, American sleep scientist Dr Rebecca Robbins suggests the snooze alarm may actually cost us sleep.\n\nThere is debate about the benefits of hitting the snooze button on your alarm when you wake in the morning. (Getty)\n\n\"That first alarm may interrupt vital stages of sleep, and anything that you might be able to get after hitting the snooze alarm is probably going to be low quality and fragmented sleep,\" said Robbins, an associate scientist for the Division of Sleep and Circadian Disorders at Brigham and Women's Hospital, in the north-east US.\n\nThe average snoozer takes an extra 11 minutes after their first alarm, according to a new study coauthored by Robbins that used data from the sleep-tracking app SleepCycle. That adds up to about one night's worth of sleep per month spent snoozing.\n\nAs we sleep, the brain cycles through different stages of neurological activity and the second half of the night is dominated by rapid eye movement (REM) sleep, when most of our dreaming is thought to take place. It's an important sleep stage for our cognitive function and memory consolidation, said Robbins, who is also an assistant professor of medicine at Brigham and Women's Hospital.\n\n\"When you press the snooze button, especially for just a few minutes at a time, you're not likely to return to that REM stage,\" Robbins said.\n\nBut for a different take, there are sleep experts such as Dr Justin Fiala, a pulmonary, critical care and sleep medicine physician at Northwestern Medicine Canning Thoracic Institute in Chicago.\n\nGaining an uninterrupted night's sleep has major health benefits. (iStock)\n\nThere isn't consensus on whether this lighter sleep achieved during a snooze session always does more harm than good, said Fiala, who is also an assistant professor at Northwestern Medicine.\n\nOn one hand, losing out on quality sleep instead of just waking up later may increase the risk of cognitive impairment and lower one's mood.\n\n\"Certainly, if you're feeling worse off (and) more tired from the snooze alarm, I would recommend going back to waking up cold turkey without it,\" said Fiala, who also runs the CommunityHealth Chicago sleep clinic.\n\nOn the other hand, those with a certain chronotype — a natural disposition determined by factors such as age and genetics — may benefit from the habit, Fiala said, referencing a 2023 study which found night owls tend to rely on their snooze button more.\n\n\"If your chronotype is nocturnal, you're a night owl, but your work schedule requires you to be up at 5am, that increases the dissonance between what your body is naturally inclined to do,\" Fiala said.\n\nFor these night owls, the brief period of light sleep induced by the snooze button may actually help them transition from deeper stages of sleep interrupted by the first alarm into wakefulness, he said, adding that more research should be done to fully understand this effect and its limitations.\n\nRegardless of one's chronotype, this distinction of who gets the most out of snoozing can also help inform how to get the most out of snoozing.\n\nParamedics and other shift workers have to adapt to changing sleep patterns.. (Nine)\n\nConsistency is key\n\nMost sleep experts emphasise adults get the recommended seven to nine hours of sleep per night for good health and emotional well-being. Sleeping enough can also reduce feelings of tiredness upon waking, but the consistency of your sleep timing is just as important as duration, said Kimberly Honn, an associate professor of psychology at Washington State University Spokane, in the north-western US.\n\nAt deep stages of sleep, electric pulses of the brain reach a highly rhythmic pattern different from our more erratic, awakened state, she explained. Trying to wake up during these stages cuts important brain maintenance processes short and can lead one to experience the foggy effects of sleep inertia, which can last for several minutes or even hours after waking up.\n\nWhen the body is accustomed to a regular sleep schedule, it may reduce the experience of sleep inertia upon waking, Honn said. The body can grow accustomed to moving through each sleep stage at similar times, ensuring sleep cycles are completed before waking and eventually allowing you to fall asleep faster.\n\n\"In the perfect world, we would not be relying on an alarm clock at all,\" Robbins said. \"We would be able to fall asleep and wake up naturally and have energy throughout the day.\"\n\nFiala said he generally recommends varying bedtimes by no more than 30 minutes per night, even on weekends. If you have to switch schedules, he says you should change it incrementally over time.\n\nThe healthiest places to live in Australia revealed View Gallery\n\nOptimising your morning routine\n\nIt's possible people who use the snooze button less simply don't have the luxury to sleep past their alarm, Robbins suggested.\n\nInflexible work schedules could require first responders to start their shift promptly, or parents may have to rally their children out the door and toward the school bus.\n\nFor this reason, Robbins recommends those trying to ditch a snoozing habit introduce more time constraints into their morning routine by setting the first alarm as late as possible.\n\n\"Ask yourself: Is there anything in that morning routine that you could maybe do without? Or maybe you could find a way to do it faster?\" Robbins said.\n\nSnoozing could also mean you're losing out on time that could be used for adding wakefulness-promoting habits into your morning routine.\n\nThe heaviest snoozers tracked in Robbins' study used around 22 to 27 minutes resting after the first alarm — time that could be used for stretching, journaling or cooking a nutritious breakfast, Robbins suggested.\n\n\"We talk a lot about wind down routines and bedtime rituals. I think morning rituals are also really lovely to help you get excited about your day,\" Robbins said.\n\n\"It's important to find something to look forward to, whether that's a meeting in the morning, making yourself a cup of coffee, whatever helps motivate you (and) gets you out of bed.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/liverpool-crowd-minivan-crash-football-rally-turns-to-horror-in-pictures/afc80af2-262f-43ed-bee3-edafc8c964d8",
    "title": "Images from Liverpool show revelry turn to horror",
    "publish_date": "Mon, 26 May 2025 22:08:30 +0000",
    "category": "sports",
    "authors": [
      "May"
    ],
    "text": "1 of 18 Attribution: Lee Smith/Action Images/Reuters via CNN\n\nR﻿evelry turned to horror in the UK early this morning after a minivan smashed into a crowd of people celebrating the Premier League triumph of Liverpool FC.\n\nA white British man, aged 53, has been arrested after the incident.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/most-trusted-brands-in-australia-revealed-2025/cc4ac584-dfb3-4ca8-adac-c8b56655dbc8",
    "title": "Australia's most trusted brands for 2025 revealed",
    "publish_date": "Mon, 26 May 2025 20:43:27 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 21 Attribution: Bunnings Warehouse / Toyota\n\nIn the 26th annual Reader's Digest \"Trusted Brands\" survey - Australians have spoken.\n\nFrom global names to iconic home brands, this year's results reflect the brands Aussies rely on most in these challenging times.\n\nHere are the top 20 most trusted brands in Australia.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/the-suburbs-where-its-cheaper-to-buy-than-rent/df585d92-eb57-4c99-b125-c15cfcf68995",
    "title": "The suburbs where it's cheaper to buy than rent",
    "publish_date": "Mon, 26 May 2025 07:48:25 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "New data has revealed the suburbs across major Australian cities where a mortgage costs less than the median weekly rent.\n\nSydney's median weekly rent is now sitting at $787, with Perth at $713 and Brisbane not far behind at $678.\n\nBased on purchasing with a 20 per cent deposit and a 30-year mortgage, some suburbs in our major cities are more affordable for buyers than renters.\n\nCotality - formerly Corelogic - crunched the numbers for Ubank.\n\nWhile housing remains unaffordable for many, you can see the breakdown of which suburbs meet this criteria in the table below.\n\nIn Sydney, units in Eastlakes, Telopea, Greystanes, and Pennant Hills are all affordable for less than the median weekly rent.\n\nIn this scheme, houses were available on the outskirts of Sydney, in Mount Victoria in the Blue Mountains and San Remo on the Central Coast.\n\n\"What's changing is that rents have gone up and they've stayed up. Meanwhile, mortgage rates are coming down,\" Cotality head of research Eliza Owen said.\n\n\"And that means the payment on a mortgage might actually start to look closer to or even cheaper than rent in some markets.\"\n\nIn Melbourne, the price of homes has risen by less than the national average in recent years.\n\n\"While the national home value has risen about 40 per cent since COVID, Melbourne is only up about 11 per cent,\" Owen said.\n\n\"And that means that, while rents have risen, people could actually find mortgage serviceability quite feasible in many parts of the city.\"\n\nIn Melbourne, the price of homes has risen by less than the national average in recent years. (Getty)\n\nMany are now choosing to rent where they want to live, and invest in a property elsewhere.\n\n\"We're actually seeing more customers make inquiries about that as an option,\" UBank's head of direct lending Annie Harrison said.\n\n\"It's not for everybody, mind you, but it is for some customers who want to maintain that lifestyle, who've had really good savings behaviours but want to get a foot into the property ladder.\"\n\nAnd with more interest rate cuts predicted this year, Owen said Cotatlity expects mortgage serviceability to improve even if property prices keep rising over the course of the year.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/blue-mountains-training-guides-tafe-nsw-rope-units-scrapped/105314090",
    "title": "Adventure sector facing trained worker shortfall after TAFE NSW cuts",
    "publish_date": "Tue, 27 May 2025 01:34:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "New South Wales' outdoor adventure and education sector is struggling to secure enough trained workers, two years after TAFE NSW discontinued a number of ropes training units.\n\nA Certificate III or IV in Outdoor Leadership includes elective courses in skills such as top rope climbing and belaying, which are core for those wanting to work in the adventure tourism sector.\n\nBusiness owners said the units in rope safety and awareness were critical for those wanting to work in canyoning or rock climbing, but students enrolled in the outdoor certificates through TAFE NSW had been unable to complete the modules in recent years.\n\nOutdoors NSW & ACT chief executive Lorie Modde said an unfortunate tragedy might have prompted TAFE NSW to suspend the elective ropes courses, but lamented the lack of information surrounding it.\n\nIn October 2022, a student studying outdoor leadership died during a rope training course in the Blue Mountains.\n\nSafeWork investigated and reported the death was linked to a rope release issue, but concluded no further action would be taken.\n\n'You wouldn't believe it's Australia' Photo shows Shards of ice are sent flying as a climber in orange summits the ice wall peak. Ice climbing, introduced to Australia by migrants in the 1960s, is booming as extreme sport lovers seek higher thrills — but with such a short season, you have to book early.\n\n\"We've been waiting since 2022 to find out what we could learn … to make sure there are better systems and better processes to go forward,\" Ms Modde said.\n\n\"Of a workforce that's over 50,000 people, roping is one of the mandatory requirements we need for school camps.\"\n\nMs Modde said nature therapy and tourism also needed trained guides.\n\nA TAFE NSW spokesperson said elective roping units had not been offered since 2022 \"following an assessment of the feasibility and level of student demand\".\n\n\"It is standard practice for TAFE NSW to regularly review its course offerings, while continuing to meet the demands of students and industry,\" they said.\n\nMs Modde rejected that, and said the industry had a shortfall of about 3,300 workers across full-time, part-time and casual roles that required roping skills, according to a 2025 industry survey.\n\n\"TAFE NSW's withdrawal effectively turns its back on a wide web of industries and communities who rely on this training for safety and service delivery,\" Ms Modde told ABC Radio Sydney.\n\nThe Blue Mountains attracts more than 4 million visitors each year. (ABC News: Keana Naughton)\n\nThe Blue Mountains is a hub for adventure tourism, with 4.4 million visitors each year, according to Destination NSW.\n\nMore than 47,000 of those visitors take part in activities requiring trained guides, according to figures from Outdoors NSW & ACT.\n\nSector concerns over training\n\nWhile ropes training is no longer available through TAFE NSW, students can choose to complete individual units — or the entire outdoor leadership course — at private institutions across Australia, with domestic course fees ranging up to $18,600 for the Certificate IV.\n\nBut the site of private training providers can make this complicated, with the closest available to the Blue Mountains located 165 kilometres away in Lake Macquarie.\n\nHugh Ward is an owner and director at the Blue Mountains Climbing School, which relies on part-time and casual staff to run recreational climbing and canyoning courses, as well as guided experiences for school and corporate groups.\n\nMr Ward says he has declined bookings because he can't find enough staff. (Supplied: Sammy Zammit/Thin Air Productions)\n\nHe said the decision to stop ropes training was complicated but was \"choking off the supply line\" of people equipped to handle complex outdoor situations.\n\n\"My sense is that adventure tourism is growing in the mountains, [but] the [training course] places are becoming harder to get,\" he said.\n\n\" [Guides] need exposure to remote places, decision making, risk management, in ways that you can't get in a classroom. \"\n\nHe noted the lack of any fee-free training at TAFE NSW as a primary driver of missing qualifications.\n\nLack of guides an issue\n\nMr Ward described TAFE NSW's consultation with the sector as having \"no straight answers\" and said the characterisation of student demand was not a \"true and accurate representation\".\n\n\"Our day-to-day is OK. Where it gets complicated is when we have a few trips out … we have to say no to things,\" he said.\n\nTAFE NSW said it had consulted with the adventure tourism industry on the changes as recently as last month.\n\nBlue Mountains Adventure Company manager Andy Mein echoed the concerns and said \"all available guides\" were needed for school programs, with the business \"struggling\" to meet demand for skilled guides with any further growth.\n\nMr Mein said as previous TAFE graduates naturally moved to other areas or jobs, no rope trained guides would fill the void and businesses would be forced to restrict what they could offer.\n\nThough the flow-on effects of restricting visitor numbers were the main economic concern for the sector, Mr Ward said the mental health, risk management and communication skills developed in the outdoors benefited everyone.\n\n\"There's a lot more going on than just the finances of the Blue Mountains adventure sector,\" he said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/phil-gould-lachie-galvin-will-not-destabilise-bulldogs/105341756",
    "title": "Gould adamant Galvin arrival will not derail Dogs' season",
    "publish_date": "Tue, 27 May 2025 01:32:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "A defiant Phil Gould has insisted Lachlan Galvin's looming arrival at Canterbury will not destabilise the Bulldogs, adamant it is not a make-or-break moment.\n\nGalvin remains a chance to be released from Wests Tigers as early as this week, potentially paving the way for him to play in blue and white after their bye.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nThe fallout from the Galvin saga has already begun, with questions over off-contract halfback Toby Sexton's future.\n\nGould also confirmed on Monday night that hooker Reed Mahoney has been given permission to test the market, despite being signed until the end of 2026.\n\nCanterbury view Bailey Hayward as a long-term talent, with the utility able to play hooker and having already deputised in the halves this season.\n\nNRL live Photo shows Wests Tigers player Lachlan Galvin looks off to the side with his hands on his hips during an NRL game. Canterbury boss Phil Gould says the ladder-leading Bulldogs have just about locked up teen star Lachlan Galvin as the teen Tiger appears set for an early release.\n\nFor Galvin's arrival to be secured, both the Bulldogs and Tigers will need to agree on a six-figure transfer fee given the teenager is contracted until the end of next year.\n\nIt is also believed that Galvin will need to address legal claims that he was bullied while at the Tigers, after social media backlash following his decision not to re-sign.\n\nQuestions remain over where Galvin will fit into the table-topping Dogs' team if the move comes to fruition after the club's best start to a season in 23 years.\n\nRegardless, Gould insisted that Galvin's arrival would not cause animosity from other players if he was to take their spot.\n\n\"No. None at all. That's the least of my worries,\" Gould said on the Nine Network's 100% Footy.\n\n\"I don't think anyone denies he is a talent. And you win premierships with talented players. It's my responsibility to get talented players into the club.\n\n\"I think it will create great competition, that's what it'll create if he turns up.\n\n\"He's got talent. Why wouldn't you want a talented player at your football club? And why wouldn't the other players want talent at their football club? They do.\"\n\nIf Galvin does land at Canterbury before next Tuesday, he would be available to face Parramatta, the club he met with, in the King's Birthday public holiday clash.\n\nGould indicated one option for Galvin could still be the back row, with the Bulldogs facing a forwards shortage through a spate of suspensions and injuries.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThere is the potential he could replace Sexton in the halves, or potentially pair up with the off-contract halfback if Matt Burton was moved elsewhere.\n\nBurton has previously won a premiership at left centre for Penrith, while it has also been suggested the playmaker could be a weapon at fullback.\n\nEither of those moves could leave centre Bronson Xerri or fullback Connor Tracey out of the team, depending on how the backline reshuffle would take place.\n\n\"(Where he plays) will be up to the coaching staff. How he comes in and how he trains. How he gets along with the group team-wise,\" Gould said.\n\n\"The more depth you've got in the club, the more talented players you've got, the better.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/disability-housing-provider-shutdown-investor-complaints/105338844",
    "title": "Disability housing provider shut down leaves investors, contractors in the dark",
    "publish_date": "Tue, 27 May 2025 00:55:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "More people have been left scrambling in the wake of a disability accommodation company shutting down operations, including subcontractors, a former AFL footballer and a finance group from Asia.\n\nNDISP, which ceased operating this month, has also faced complaints from investors whose properties it oversaw, and from a parent over the care of his son who has a disability.\n\nThe company ran more than 140 disability homes in Queensland before this month transferring the leases to a new company, Sigma SDA, amid a winding up lawsuit from the Australian Taxation Office.\n\nAs the ABC reported last week, it faced remonstrations about issues including properties going vacant from retiree investors who owned the homes it managed.\n\nDisability accommodation investment questions Photo shows A woman with long light brown hair in a white top with floral pattern stares at the camera. A company that manages at least 140 disability homes in Queensland is being accused of making misleading claims to property investors.\n\nThe company argued that dissatisfied investors represented four or five homes out of 150. It maintained the vast majority of investors were happy and the risks were fully disclosed, rejecting any suggestion of misconduct.\n\nThe ABC can reveal Wel.co, a Melbourne-based property development group run by former Essendon midfielder and current club vice-president Andrew Welsh has built specialist disability accommodation managed by NDISP, as has Asia-based finance group OCP Asia.\n\nOther investors came via Australia-based funds.\n\nFamily voices accommodation concerns\n\nFormer soldier Gavin Boggitt has also encountered difficulty with NDISP, whose Townsville-based son Braydon is in a wheelchair with limited speech.\n\nBraydon, 25, was placed in an NDISP administered home in 2023. Since then, Mr Boggitt said he experienced a frustrating lack of communication with the company — he said they were difficult to contact and multiple people would deal with issues.\n\n\"You didn't know who to talk to from one moment to the next,\" Mr Boggitt told the ABC.\n\nThe problems, he said, included a lack of grab rails in areas including showers.\n\nGavin Boggitt said while the NDIS system was great, problems included things being slow including getting repairs on his son Braydon’s wheelchair. (ABC News: Jonathon Poulson)\n\nAt one stage Mr Boggitt said he told NDISP in writing that Braydon would be leaving, but then the decision was made for Braydon to stay. He said when they contacted NDISP to rescind the departure decision, the company staffer was not even aware that Braydon had planned to be leaving.\n\nWhile Braydon is now in a new home with a new manager, Mr Boggitt said problems still occurred.\n\nMr Boggitt said the government NDIS was a great system overall, but many things ran slowly, including getting repairs for Braydon's wheelchair after 18 months.\n\nThe National Disability Insurance Agency, which oversees the NDIS, said it was boosting the experience for participants via improved processes and increased frontline resources.\n\nUnpaid contractors and software failures add to woes\n\nA lawn mowing contractor working on NDISP properties also told the ABC of struggles in getting paid for invoices to NDISP and a related maintenance company.\n\nIn email correspondence, company staff promised to ensure payments would be made — sometimes a Christmas backlog was blamed, or new employees were involved in training.\n\nAt one stage, the contractor said the bill from a related company for outstanding work grew to more than $13,000 late last year. While that was mostly repaid, he said, billing recently shifted to NDISP and he estimated a $6,000 payment has become past due.\n\nWhile he does have other work, he said the lack of payment stings.\n\n\"I've got a family to feed … I've got mortgages to pay,\" he said.\n\nNDISP director Darryl Richards blames issues including an entity the company hired having botched the implementation of a software program. (Supplied)\n\nAsked about client and contractor complaints, NDISP director Darryl Richards blamed issues including an entity the company hired having botched the implementation of a $150,000 enterprise software program for his organisation.\n\nHe also lashed out at the introduction of a sector-wide NDIS billing system, which has attracted complaints across the sector in the past couple of years as a \"disaster\".\n\nHe added his organisation \"always had multiple qualified accountants running the finance department internally\", and payments of subcontractors were handled without NDISP directors being directly involved.\n\nRelationship managers and senior regional staff would have been easily contactable, he maintained.\n\n\"They would have organised someone to install rails etc if they were needed,\" he said.\n\nAmong institutional fund backers of specialist disability accommodation was OCP Asia, which in 2022 announced plans to put up to $200 million, potentially as debt, into the sector, eyeing up to 40 homes in a deal involving NDISP.\n\nIt ultimately contracted NDISP to run an undisclosed number of homes but has declined to answer questions from the ABC about what happened with its investment.\n\nWel.Co Group founder Andrew Welsh. (Facebook)\n\nNDISP also leased multiple properties from Mr Welsh's Wel.co. Mr Welsh declined to comment.\n\nAn unknown number of other investors bought homes run by NDIS through funds run by James Brooker's Social Impact Funds Management and Kevin Nolan's DHI Fund Management.\n\nQueensland land title records show nine properties in the state are owned by Sydney-based Boutique Capital, which is the trustee of the funds.\n\nBoutique Capital, which is run by Tim Baker, the husband of TV star Georgie Gardner, did not respond to the ABC's questions.\n\nAttempts to obtain comment from Mr Brooker were unsuccessful.\n\nMr Nolan said the DHI funds had \"two operational SDA buildings now managed by Sigma with seven out of our 10 apartments occupied\".\n\n\"Please note that DHI Fund Management has not raised capital since 2022 and has no intention to do so,\" he said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-27/citrus-update-australian-season-2025-positive-outlook/105314706",
    "title": "Citrus producers hopeful for bumper harvest after tough seasons",
    "publish_date": "Tue, 27 May 2025 00:31:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Challenging weather, labour issues and low stock have hit Australian citrus growers for the past few seasons, but this year could turn things around and break the industry export record.\n\nIn Moora, 170 kilometres north-east of Perth, the tough conditions brought by recent seasons have taught growers a number of important lessons.\n\nMoora Citrus is the largest citrus producer in Western Australia, with an estimated 10,000 tonnes of fruit expected to be picked across its three Mid West orchards.\n\nChief executive Shane Kay said 2024 had been a particularly light year.\n\n\"We average around 8,000 tonnes per year and we were below that,\" Mr Kay said.\n\nShane Kay, Mark English, Vanessa Gillam, Alan Yildiz and Sue Middleton celebrate the opening of a mega citrus packing shed in Bindoon. (ABC Midwest & Wheatbelt: Lucinda Jose)\n\nWeather conditions just right\n\nMr Kay grows lemons, mandarins and grapefruit, but it is the oranges he has his eye on right now.\n\n\"We're currently experiencing a very warm autumn; we're looking forward to some cold nights and clear days to help the fruit colour up and mature properly,\" Mr Kay said.\n\nCold weather is required to turn the fruit from green to orange on the tree.\n\nOnce picked, packing sheds then use equipment which grades fruit based on blemishes.\n\nMarked fruit will go to lower priced offerings, while first grade product is sold to retailers locally or exported internationally to markets which pay a premium for high quality fruit.\n\nThough the colour does not affect the taste or internal makeup of the fruit, Citrus Australia chief executive Nathan Hancock said appearance had a massive influence on the price.\n\n\"In Australia in particular, we've sort of been coached into believing that fruit mustn't have any blemishes on the outside,\" Mr Hancock said.\n\nCitrus Australia CEO Nathan Hancock says conditions are looking up for growers. (Supplied: Citrus Australia)\n\nExport success\n\nHe said production across Australia would be strong in 2025, as well as demand from international markets.\n\nExport demand has been strong enough to potentially break the record tonnage sent out of Australia, which was set in 2019 at 304,000 tonnes and had an export value of $541 million.\n\nChinese markets took the majority of exported fruit, importing 83,000 tonnes.\n\nLast year over 280,000 tonnes of citrus were exported, with a value of $590 million.\n\nMost international markets for citrus sit in Asia, with large volumes going to Japan, China and Thailand as well as the United States, Canada and United Arab Emirates.\n\n\"The fruit size is looking good as well. We need fruit to be of a certain size for it to be in that profitable market range because cost of production in Australia is very, very high,\" Mr Hancock said.\n\nThere's hope this season will produce a bumper crop. (ABC Midwest & Wheatbelt: Lucinda Jose)\n\nOngoing challenges\n\nOne of the biggest costs facing growers is wages.\n\n\"Our wage costs have just continued to climb and it's not really aligned with the returns we get,\" Mr Kay said.\n\n\"So that's causing some challenges; we're trying to find ways of increasing production and improving efficiencies.\"\n\nIn his Moora orchard, Mr Kay is implementing a three-hectare trial block of protective netting.\n\nIt has so far proven successful, helping to decrease wind impact and water use.\n\n\"We're doing a cost-benefit analysis of that right now, because it's not cheap,\" Mr Kay said.\n\n\"But there are some really good water savings which is important.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/thousands-without-power-as-sa-storm-clean-up-begins/105340656",
    "title": "Thousands without power as SA cleans up after damaging storm",
    "publish_date": "Tue, 27 May 2025 00:05:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Thousands of South Australian households and businesses are without power as the clean-up continues after the gusty winds, high rainfalls and high tides that lashed most of the state yesterday.\n\nWind gusts of up to 126 kilometres per hour were recorded on Monday, as well as sea levels up to 4.6 metres above the lowest astronomical tide expected at Port Pirie.\n\nSES duty manager Kane Murray said crews attended 470 call outs overnight, with the majority responding to fallen trees, as well as localised flooding and property damage.\n\nLoading...\n\nThe Bureau of Meteorology (BOM) said areas of the state recorded up to 40 millimetres of rain, with the highest totals recorded on the Mount Lofty Ranges.\n\nThe high tides and storm surge have damaged a number of jetties across the state, including at Normanville, where the pontoon yesterday also washed up onto the shore.\n\nNormanville Mayor Darryl Houston points out damage caused to the jetty. (ABC News: Caroline Horn)\n\nNormanville Mayor Darryl Houston said he was surprised to see the jetty still standing when he arrived at the beach this morning.\n\n\"I fully expected after seeing some of the shots last night of the waves crashing completely over the top of the jetty that it may not be here,\" he said.\n\n\"To see it still standing is a relief ... unfortunately there is significant damage by the looks of it, a lot of the boards are broken, with the pressure they've popped up so it's going to be quite a fix I think.\"\n\nThe Henley Beach jetty has been closed due to damage. (ABC News: Lincoln Rothall)\n\nDowned powerlines have forced the closure of Sacred Heart College's Marcellin campus in Somerton Park.\n\nThe school wrote on Facebook that the campus would be closed from today until further notice.\n\n\"Marcellin Campus is currently without power due to significant damage from last night's storm. Powerlines are down on Cudmore Street which poses a significant safety risk,\" the post read.\n\nSacred Heart College in Somerton Park says its campus will be closed until further notice. (ABC News: Isabel Dayman)\n\nSenior BOM forecaster Simon Timcke told ABC Radio Adelaide conditions should ease today, but wind gusts had caused damage across the state.\n\n\"The dust was quite an amazing feature, watching it on the satellite picture … a very widespread area of dust. Then it pushed into north-western Victoria and that persisted for a good part of the day,\" he said.\n\n\"I'm sure [it was] some welcome rainfall but the winds, perhaps, [were] not so welcome.\n\nTrees damaged in Klemzig along a pathway. (ABC News: Paul Martinello)\n\n\"We saw very strong and gusty winds around most of the agricultural area yesterday, with some pretty big gusts, a lot of places picking up gusts in the 80-100kph [area], so there is quite a lot of tree damage and debris around as a result of that.\n\n\"We're certainly in the easing mode, but I think once everybody gets up and surveys the damage from yesterday there will be quite a bit around.\n\n\"Those elevated tides really causing some pretty amazing scenes across the coastal fringe there too.\"\n\n'Carved a whole new coastline'\n\nYesterday's storms have badly damaged beaches in the south-east holiday town of Robe.\n\nLoading Facebook content\n\nDistrict Council of Robe chief executive Nat Traeger said Fox Beach was particularly hard hit.\n\n\"We are in a pretty critical position where there's only 800 millimetres of dune between the road and the coast now,\" she said.\n\n\"It's carved a whole new coastline right from our marina right around Long Beach. We've lost a lot of coast.\"\n\nShe said the obelisk was intact, but there had been damage to ramps down to beaches, the town jetty, and boats and pontoons at the local marina.\n\n\"The whole channel wasn't even visible, so that means the sea and the tide breached the whole marina into the car park and a lot of people in their time have not seen that happen,\" she said.\n\n\"It was just a ridiculously high tide.\"\n\nThere was also flooding in low-lying parts of Kingston South East yesterday.\n\nA tree has fallen onto this house in Morphetville in Adelaide's southern suburbs. (Supplied)\n\nPeter Oliver, who runs a cafe at Hindmarsh Island, said he was \"astounded\" by the damage.\n\n\"It was probably the worst storm we've seen here in probably 10 or more years … lots of damage,\" he said.\n\n\"The tide has come up super fast, faster than I've ever seen.\n\n\"All the jetties are underwater. My neighbour's jetty has been smashed into pieces.\"\n\nGrange resident Dennis Sparrow said he had recorded more then 22mm of rain at his property, where a tree also dropped limbs during the strong winds.\n\nMr Sparrow said he would spend today cleaning up the fallen branches to protect his pet cats Macey and Molly.\n\nGrange resident Dennis Sparrow cleans up fallen tree limbs. (ABC News: Lincoln Rothall)\n\n\"[The fallen limbs] have very sharp spines on it and I've got to cut them off otherwise the pussycats might get their little eyes hurt,\" he said.\n\n\"I've seen it where we've actually had two inches of rain in a day, but last night we had an inch of rain and we had lots and lots of wind, so I haven't seen this at all before.\"\n\nPatricia from Cambray, 17km from Walker's Flat, told ABC Radio Adelaide the area had recorded 24.8mm of rain all year, with 13mm of that falling just yesterday.\n\n\"It was horrendous. I come from Queensland and I thought I was in a cyclone,\" she said.\n\n\"It was so bad, you couldn't see in front of you. I had dust all over the place and I actually went to check the sheep troughs and I had three inches of mud, which I tried to clean out so I could get proper water to them.\"\n\nA dust storm in Jamestown after strong winds hit SA. (ABC News: Carl Saville)\n\nMichael from Monash told ABC Radio Adelaide it was the worst dust storm he had seen since the Ash Wednesday bushfires in 1983, with visibility down to \"30 or 40 metres\".\n\n\"We get the odd one here or there that might last for an hour … but not to this extent,\" he said.\n\nAlgal bloom to be assessed after storm\n\nThe Department of Primary Industries and Regions says it could take up to a week to know whether yesterday's strong winds were enough to break up the algal bloom.\n\nSince March an algal bloom caused by warmer-than-average sea temperatures has been choking the ocean along the Fleurieu Peninsula, Kangaroo Island and the Yorke Peninsula south coast.\n\nOceanography lead Mark Doubell said satellite images would be used to survey the algal bloom once the clouds had cleared.\n\n\"I think it's going to take several days [and] up to potentially a week to be really certain [the algae has dispersed].\n\n\"And, of course, water sampling is being taken to confirm the presence of the algae and its concentration, but that also takes several days to turn around.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/richard-boyle-pleads-guilty-to-four-charges/105341326",
    "title": "ATO whistleblower Richard Boyle pleads guilty to four charges",
    "publish_date": "Tue, 27 May 2025 00:02:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian Taxation Office (ATO) whistleblower Richard Boyle has pleaded guilty to four charges, including taping private conversations without consent.\n\nThe former debt collection officer became an internal whistleblower in October 2017, when he grew concerned about operations in the tax office.\n\nWhen he felt his complaints were ignored, he went public on Four Corners about the culture at the ATO, including allegations his area was instructed to use heavy-handed tactics on taxpayers who owed the tax office money.\n\nBoyle was originally facing 66 charges, but over time many were dropped.\n\nIn South Australia's District Court on Tuesday, he pleaded guilty to disclosing protected information, making a record of protected information, using a listening device to record private conversations and recording another person's tax file number.\n\nBoyle had been trying to invoke whistleblower protections to avoid a criminal trial.\n\nRichard Boyle spoke to Four Corners about his concerns with practices at the ATO. (ABC)\n\nHe had been scheduled to stand trial later this year, after last year losing his last chance to secure immunity from prosecution when the High Court refused his application for special leave to appeal.\n\nHe had earlier lost an appeal in South Australia's Supreme Court.\n\nOutside court after Tuesday's hearing, former senator Rex Patrick said what Boyle had faced was a \"disgrace\".\n\n\"This has been a long saga that has taken a lot out of Richard Boyle, he should be wearing a big S on his chest as a superhero — instead of a conviction,\" he said.\n\n\"It just shows that there is injustice in our political system where we persecute people who blow the whistle.\n\n\"This has been eight long years for Richard and it's a disgrace.\"\n\nMr Patrick said Boyle's case shows \"whistleblower laws are totally inadequate\".\n\nRichard Boyle first raised concerns with practices at the ATO in October 2017. (ABC News: Olivia Mason)\n\n\"This just shows how broken our whistleblower laws are we have someone step up … and they find themselves before a court having to plead guilty,\" he said.\n\n\"This will have a chilling affect on all whistleblowers.\"\n\nKieran Pender from the Human Rights Law Center called on the government to urgently reform whistleblower laws to prevent any similar prosecutions.\n\n\"This is a heartbreaking day for Richard Boyle and whistleblowers in Australia,\" he said.\n\n\"Prosecuting whistleblowers has a chilling effect on truth and transparency, and sends a clear message to prospective whistleblowers that if you speak up you will face punishment.\"\n\nCampaigner at the Whistleblower Justice Fund Tosca Lloyd said \"whistleblowers like Boyle should be protected, not punished\" and said the \"broken laws\" must be fixed.\n\nBoyle is scheduled to return to court in August for a pre-sentence hearing.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/macquarie-point-stadium-enabling-legislation-released/105339114",
    "title": "Hobart stadium cost up to $945m as enabling legislation released",
    "publish_date": "Mon, 26 May 2025 23:16:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Draft legislation that would enable a stadium to be built at Macquarie Point in Hobart, has been released for public consultation.\n\nThe Tasmanian government has also updated the cost estimate for the stadium, saying it was now estimated to be $945 million, up from its previous figure of $775 million.\n\nThe stadium proposal is being assessed by the Tasmanian Planning Commission as a project of state significance, but the government wants to pull out of that process and instead give the parliament the only say on whether the stadium will be built.\n\nA roofed stadium at Macquarie Point is a condition of Tasmania's AFL licence.\n\nEric Abetz has released the draft legislation for public consultation. (ABC News: Luke Bowden)\n\n'Never say never': Public forum on Hobart stadium a mixed bag Photo shows wide shots of a forum of people speaking. There's continued calls for the Tasmanian government to try to re-negotiate the state's AFL licence deal, amid a public forum over the proposed Macquarie Point stadium development.\n\nBusiness, Industry and Resources Minister Eric Abetz said the government was confident the legislation \"provides the necessary details for the parliament to provide their support\".\n\n\"The government has reviewed and acknowledged the concerns and challenges raised within the draft Integrated Assessment Report by the Tasmanian Planning Commission,\" Minister Abetz said.\n\n\"This draft bill and subsequent planning conditions addresses these points and demonstrate the efforts by the government to ensure the legislation is comprehensive.\n\n\" The enabling legislation and supporting materials are hundreds of pages long, carefully addressing concerns, permits and conditions. \"\n\nAbetz: 'I won't be rubber stamping anything'\n\nPoll reveals support levels for proposed Hobart stadium across Tasmania Photo shows Concept art showing interior of sports stadium with cricket match underway. If it wasn't already official, it is now: The proposed Hobart stadium is massively on the nose among many Tasmanians.\n\nMr Abetz said the permit included conditions requiring \"subject and site-specific expert management plans to be finalised and submitted to the relevant regulator for approval before construction or operations\" can start.\n\nHe said that was standard practice for commercial development approval.\n\nMacquarie Point Development Corporation chief executive Anne Beach said conditions were developed with input from agencies and regulators, Hobart City Council, TasNetworks and TasWater.\n\nMr Abetz said as Minister, he would be issuing the permit for the stadium if the legislation passes.\n\n\"Be absolutely assured I won't be rubber stamping anything, but, as Minister, I will be provided with the capacity to issue the relevant permits, but the legislation will require me to consult with the relevant authorities prior to making a permit,\" he said.\n\n\"From the government''s point of view, transparency's key; we want to ensure that people fully understand what we're doing, why we're doing it.\n\n\" So they can be confident and proud that the stadium that's delivered here will be something that they'll be able to look back on, and scratch their heads and say, 'why was there all this opposition 40 years ago'. \"\n\nThe stadium is a condition of Tasmania's AFL licence, the government says. (Supplied: Macquarie Point Development Corporation)\n\nIn parliament, Greens leader Rosalie Woodruff described the bill as \"draconian\", arguing it would give Mr Abetz \"unprecedented power to unilaterally amend the stadium permit\".\n\n\"You've given him free range to instruct the planning commission to change the planning scheme to facilitate any permit conditions,\" Dr Woodruff said.\n\n\"This legislation is draconian and bringing it to parliament is an utter farce.\n\n\"It doesn't matter if the parliament approves the stadium bill as written, because you've given Minister Abetz full power change it as he sits fit.\"\n\nFunding for concert hall sound proofing\n\nThe government has also agreed to a request from the Tasmanian Symphony Orchestra (TSO) to soundproof the Federation Concert Hall. The TSO asked for $4.45 million.\n\nMr Abetz said the total cost of the stadium was now estimated to be $945 million.\n\nHe said the figure incorporated \"improvements that will enhance the stadium user experience to better cater for a wide range of planned uses, including helping facilitate cricket at the venue\".\n\n\" It also accounts for detailed items such as audio-visual, communications, kitchen, and food and beverage fit-outs. \"\n\nIt is not clear whether the $4.45 million for the TSO is included in the $945 million figure.\n\nQuestions over cost\n\nDid the premier break his 'not a red cent more' promise? Photo shows Jeremy Rockliff with a football. The definition of a \"red cent\" and a qualification of the $375 million in taxpayer money for the planned Hobart stadium matter when determining if the premier has broken his word.\n\nIndependent MP Rebekah Pentland took aim at the growing cost of the project, asking in parliament how Tasmanians could have faith the latest cost estimate was \"even in the ballpark\".\n\n\"The stadium was originally costed at $715 million with your government promising to cap its contribution at $375 million not a red cent more now … we learnt the price tag has blown out to $945 million,\" Ms Pentland said.\n\n\"That still doesn't include the cost of critical infrastructure like road access and sewerage works.\n\n\"Why should Tasmanians believe you can build a new stadium at Macquarie Point for less than a billion dollars?\n\n\"The new berth for the Spirits at Devonport was originally going to cost $90 million now the estimate is a massive $493 million.\"\n\nJacqui Lambie Network MP Andrew Jenner asked the government what kind of precedent it was setting.\n\n\"In just two years your government has introduced, and is planning to introduce again, special legislation to fast track major projects involving massive amounts of public money,\" he said.\n\n\"These laws bypass Tasmania's normal planning processes and in at least one case was brought forward after the original proposal was rejected through the proper channels.\n\n\" It would seem that it isn't about cutting red tape, it's just a simple way of making it easier for this government and developers to get their own way. \"\n\nConversations with cricket bodies continuing\n\nCricket Tasmania and Cricket Australia have raised concerns about the stadium roof, saying daytime games could not be played at the stadium in its current form.\n\nMr Abetz said the government was \"confident we can sort these issues out with cricket\".\n\nAnne Beach says the Macquarie Point Development Corporation is working working with cricket bodies. (ABC News: Luke Bowden)\n\nMs Beach said the Macquarie Point Development Corporation was continuing to work with Cricket Tasmania and Cricket Australia.\n\n\"The last thing we need to work through is the roof, and we know that there are a few challenges around the shadows,\" Ms Beach said.\n\n\" We've gone and looked at other venues and looked at how they've managed those, and found that the dispersed nature of the shadow is quite minor when you experience it on the field. \"\n\nShe said decisions about the materials to be used were still being made.\n\n\"We're looking at building a test rig on site so that cricket can have confidence in what we'll build and they'll know we can manage this issue.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/terence-crawford-eyes-boxing-immortality/105319830",
    "title": "Terence Crawford eyes boxing immortality against Saúl Canelo Álvarez",
    "publish_date": "Mon, 26 May 2025 22:35:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Terence Crawford has never been to Australia before.\n\nThat might seem a little strange.\n\nThis is a man, after all, who was in tentative talks to fight Australian Tim Tszyu at one stage.\n\nHe is also the man who comprehensively out-fought Jeff Horn and took his WBO welterweight belt in 2018.\n\nWhen Horn won that particular belt in a boilover victory against Manny Pacquiao at Lang Park, Crawford was keen to be in attendance as a future opponent for the winner.\n\nAt that stage of his career, Crawford was already a world title winner at lightweight and unified champion at light welterweight.\n\nSo what gives?\n\n\"Well, I always wanted to visit Australia,\" Crawford tells ABC Sport, a smile lighting up his face.\n\n\"Australia has been on my bucket list for a long time now.\n\n\"I remember when Jeff Horn fought Manny Pacquiao I was supposed to come here and witness, but Top Rank said that my visa didn't get granted because of parking tickets.\"\n\nSeemingly, that's no longer an issue.\n\nTerence Crawford is making the most of his trip to Australia. (Supplied: Press Run/Ian Reyno)\n\nCrawford was speaking to ABC Sport on the Gold Coast, the first leg of his whistlestop tour of Australia with events in Sydney and Melbourne to come.\n\nJust hours after touching down in the country for the first time, Crawford was amenable and relaxed as he settled down on a couch ahead of our interview, displaying no signs of jet lag.\n\nIn fact, the 37-year-old's relaxed, friendly demeanour is almost incongruous with what the world knows he is capable of in the ominous squared circle where he has made his name one to both admire and fear.\n\nThis is a man who has a perfect 41-0 record in the unforgiving glare of the boxing ring over a 17-year professional career. But, in so many ways, Crawford is a multi-faceted athlete, both in the ring and out.\n\nCrawford's home town of Omaha, Nebraska, was not an easy place to grow up.\n\nCrime, poverty and violence were daily issues young people had to face.\n\nMany people still have to face them.\n\nTerence Crawford was relaxed during his interview with ABC Sport. (Supplied: Press Run/Ian Reyno)\n\nSo, much in the same way he was saved from a troubled life by the peculiar sanctuary found within a boxing ring, he has provided a space for others in his home town to do the same.\n\n\"What I'm doing with B&B Sports Academy is definitely trying to save one life at a time,\" Crawford says, leaning forward such is the earnestness with which he tells his tale.\n\n\"You know, if I could save one [person], then I did my job.\n\n\"Now, you're not going to be able to save all of them. Once some individuals get to a certain age, they're going to find their way in life and do whatever they want to do.\n\n\"You, as a mentor, you can do it all, you can do everything that you can to help them stay on course and just give them talks and the guidance so that they would remember everything that you taught them along the way and do the right thing.\n\n\"But another thing is giving them the opportunity to experience things that they normally wouldn't be able to experience because of financial reasons and other things.\n\n\"So this thing that me and Brian McIntyre has been doing with B&B Boxing and B&B Sports Academy has been wonderful for the youth in the community as well.\"\n\nTerence Crawford has walked the same walk so many of the kids he is now trying to help are doing. (Supplied: Press Run/Ian Reyno)\n\nBoxing's capacity to assist wayward youths is well documented, wresting lives from the brink of the abyss and pushing them into untold glory.\n\nThere are far more instances where boxers have not reached the heights of a world championship or an Olympic Games — and the issues fighters face after their career can be unspeakably devastating.\n\nYet, it is a journey that has brought such incredible success for Crawford and established him as one of the all-time greats.\n\nWhen he stunningly took Errol Spence Junior apart across nine phenomenal rounds in 2023, Crawford became an undisputed world champion in a second-weight division.\n\nTerence Crawford is undisputed at welterweight. (Getty Images: Al Bello)\n\nHe had, earlier in his career, beaten unified light welterweight champion Julius Indoingo in 2017 to claim all four straps at light welterweight too.\n\nBeing undisputed is not normal. In the four-belt era since 2008, just 11 men and 11 women have been so heralded.\n\nBeing undisputed across two weights is virtually unheard of.\n\nOnly Japanese sensation Naoya Inoue (bantamweight and super bantamweight) and Ukrainian talisman Oleksandr Usyk (cruiserweight and heavyweight) — aside from Crawford — have achieved it in men's boxing.\n\nLegendary Irishwoman Katie Taylor (lightweight and light welterweight) and Claressa Shields (middleweight, light middleweight and heavyweight) of the USA have done so in the women's ring.\n\nFew fighters in boxing history have been more skilled, more adaptable, in a ring than the man from Omaha, Nebraska.\n\nEver since he won his first world title, the WBO lightweight crown, in a tinderbox atmosphere in Glasgow in 2014 against Ricky Burns, right through to his light middleweight victory against Israil Madrimov last year, Crawford has transferred his power, his speed and his trickery through the weight classes.\n\nTerence Crawford will be the smaller man against Canelo, but has carried his power through the divisions. (Getty Images: Al Bello)\n\nBut up next is Canelo Álvarez in a fight that could be one of the highest-earning pay-per-view fights in history and one of the most eagerly anticipated contests ever.\n\nLike Crawford, Canelo is a four-weight world champion and is currently undisputed at super middleweight.\n\nCrawford has made it his business to out-think and out-match all of his previous opponents, but Canelo poses an entirely different challenge. He has already beaten one of the 11 undisputed champions in his career, former light middleweight champ Jermell Charlo in 2023.\n\n\"It's important to me because it's a challenge, in two ways,\" Crawford says.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's a challenge because I'm fighting arguably one of the best Mexican fighters of all time and then it's a challenge because I'm moving up potentially three weight classes.\n\n\"I say three because I was only at 154 [pounds, light middleweight] for one fight.\"\n\n\"It's the opportunity to do something that no other men's fighter has done before and … to become a three-weight undisputed world champion.\"\n\n\"I want him at his best,\" Crawford says, confirming there's no rehydration clause in the contract, meaning Canelo may well be several kilos heavier when they meet in the ring.\n\n\"Because I don't want no excuses when I win.\n\n\"[If] I get him at his best and there's no stipulations or guidelines, then I get more credit than, you know, having all these rehydration clauses and all this stuff.\n\n\"He's the champion. I'm moving up to fight him in his division, so long as he makes weight, that's what it is.\"\n\nAnd what would victory mean?\n\n\" I would say I'm in the conversation with the greatest. \"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/roadside-memorial-removal-causes-anger-alice-springs/105337314",
    "title": "'Beyond heartbreaking' removal of roadside memorial angers family",
    "publish_date": "Mon, 26 May 2025 22:21:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Alice Springs Town Council has apologised after a roadside memorial was destroyed without consultation with family and friends.\n\nAlice Springs teen Alex Marchant-Powell died on May 31 last year when the car he was driving hit a tree on Bougainvillea Avenue in East Side.\n\nThe tree became a roadside memorial for friends and family to visit and pay their respects.\n\nSeveral weeks ago mementos, flowers and fairy lights were removed without consultation, leaving those closest to him bereft.\n\nHis mother, Nicolle Marchant, said learning of the removal as the one-year anniversary of her son's death approached had caused her unbelievable pain.\n\n\"To lose your only child, your whole world, is the greatest heartache that anyone can go through,\" she said.\n\n\"And then to know that some heartless person or people have just gone and torn down memorabilia is beyond heartbreaking.\"\n\nNicolle Marchant says her son Alex Marchant-Powell was her world. (Supplied: Nicolle Marchant)\n\nMs Marchant said she did not want a similar thing to happen to anyone else in Alice Springs.\n\n\"For this to occur, this absolutely heartless act, is completely unnecessary,\" she said.\n\n\"There's so much sadness there, but there's so much love there.\n\n\"It's a place that they can go and just sit and be and remember Alex and all the love that he shared with everyone.\"\n\nClosest thing to a grave\n\nAlex Shaw said he often went to the tree to pay his respects to his lost mate.\n\nOscar McClean and Alex Shaw are shocked at the roadside memorial's removal. (ABC Alice Springs: Emma Haskin)\n\n\"We don't have a grave or anything,\" Mr Shaw said.\n\n\"So this is the closest thing we have to it.\"\n\n\"We filled it with decorations.\n\n\"The base was covered in flowers and filled with valuable mementos and photos.\n\n\"A lot of the stuff were personal items of his that we took from his house and left it for him.\"\n\nHe said he was shocked by the removal.\n\n\"I felt disrespected and it feels that Alex's memory had been disrespected and insulted,\" he said.\n\n\"The whole year has been trying to keep the [memorial] alive, trying to keep it going especially for his mother.\"\n\n'We've let them down'\n\nCouncil director of technical services, Joel Andrew, said the council had provided an apology to Ms Marchant and to her son's friends.\n\n\"We've let them down … by not contacting them and trying to work through and find a solution to the concerns,\" he said.\n\nFriends lay flowers at the roadside memorial for their friend Alex Marchant-Powell. (ABC Alice Springs: Emma Haskin)\n\nMr Andrew said there was a roadside memorial policy which dictated the size, shape and makeup of memorials.\n\n\"[Staff] said it was outside of the policy and removed it,\" Mr Andrew said.\n\n\" Part of that policy is to contact the family members and try and find a mitigation to concerns of residents and in this case that wasn't done. \"\n\nHe said at least two complaints had been received for Mr Marchant-Powell's memorial.\n\n\"I think it was an effect on the nearby residents and also the distraction towards drivers [as it] was quite lit up at night with fairy lights and it's causing concern for residents,\" Mr Andrew said.\n\nMr Andrew said the council would work with Mr Marchant-Powell's family and friends to ensure the memorial was reinstated.\n\n\"We've offered to try and mitigate the situation,\" he said.\n\n\"I understand her son's friends have some things they'd like to put in place for the one-year anniversary and we're trying to assist with that and make recompense as much as we possibly can.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/reasons-parents-delay-sending-children-to-school/105289888",
    "title": "'They are really little': Why parents delay sending children to school",
    "publish_date": "Mon, 26 May 2025 22:06:53 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Nadine Ensor always suspected she would delay sending her daughter, born in June, to school.\n\n\"She was very advanced with language and the standard things they check off, like being able to count and recite the alphabet, so I had no doubts academically she could have gone [when first eligible],\" says 36-year-old Nadine, based in Brisbane/Meanjin.\n\n\"For me, [the motivation to delay] was definitely more the emotional side of things.\"\n\nRegulations around the age children start school vary across Australia, and between public, Catholic and independent schools.\n\nTypically, however, children born in the first part of the year can be sent to school in either the year they turn five or the year they turn six.\n\nIf Nadine's daughter started school when she was first eligible, she would have been four and a half, and one of the youngest in her class.\n\n\"I also worried about the social aspects, and also fatigue,\" Nadine says.\n\n\"If she was starting school when [she was] four and a half, she would just be too burnt-out.\"\n\nPreparing if you have a child with disability starting school Photo shows A child wearing a navy backpack and uniform holding her mum's hand as they walk into school. For parents of children with disability, worries about how their child will transition into school can be heightened. But there are ways to help manage it.\n\nTwo-thirds of parents delaying if they have the option\n\nNew research from Macquarie University found that of Australian parents who could choose when to send their children to school, 66 per cent planned for them to start later.\n\nThe study surveyed 226 parents.\n\nCo-author Penny Van Bergen, an associate professor of psychology in education at the university, said one of the most interesting findings was that academic concerns didn't typically play a role in parents' decision-making.\n\n\"A lot of international research says academic competitiveness is why you might hold a child back, but there wasn't a sense [parents in Australia] were making those choices for competitive reasons,\" Dr Van Bergen says.\n\nSocial and emotional readiness\n\nLike Nadine, many parents are concerned about their children's social, emotional and behavioural readiness for school, Dr Van Bergen says.\n\n\"Whether a child would make friends, be able to sit still — parents were seeing that as a sign they are probably not ready and won't enjoy themselves if they are still developing those skills.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nRebecca English, a senior education lecturer at the Queensland University of Technology, says parents may also be concerned about their child needing a nap or rest time, and other factors such as whether the child has toileting accidents.\n\nFamily time and milestones\n\nAnother motivation for Nadine delaying her daughter's schooling was the family dynamic.\n\n\"I had a newborn that year, so I didn't want the whole commitment of school alongside a newborn as well,\" she says.\n\nShe also wanted to spend more time with her daughter, a desire shared by some parents surveyed in the Macquarie University study.\n\nWanting to spend more time together is one motivation for parents delaying their child's schooling. (Pexels)\n\nDr Van Bergen says there is a philosophy of \"they are really little, let them enjoy life, there's plenty of time for school\".\n\n\"They recognised they were privileged to make that choice, but talked about wanting that extra 'gift of time'.\"\n\nParents were also considering milestones ahead, such as when their children would reach the ages they could drive and drink.\n\n\"We don't want them to be the last to get their drivers licence,\" Dr Van Bergen gives as an example.\n\nFinancial pressures\n\nBecause early childhood education and child care are more expensive than public schooling, some parents felt they had to send their child \"on time\", Dr Van Bergen says.\n\nWork demands also played a role.\n\nCan you challenge a school's uniform policy? Photo shows three school kids running through grounds From hair length to skirt length, school uniform policies, or dress codes, dictate many aspects of a student's appearance. But how enforceable are they?\n\nGender\n\nBoys are more likely to be \"held back\", Dr Van Bergen explains, due to \"beliefs about boys not being social and emotionally ready\".\n\nParents she surveyed were almost four times as likely to report they intended to start boys later than girls.\n\n\"There is a narrative that boys are less mature, or less developed, than girls that floats around, and that drives parents' decision-making,\" Dr Van Bergen says.\n\nShe says while at a group level there are school-readiness trends that favour girls, on an individual level there is a \"huge overlap\" between genders, so readiness really needs to be considered case by case.\n\nPhysical size\n\nParents reported concerns about physical size, usually more with boys than girls.\n\nThis is particularly in the context of bullying and \"sporting prowess\", Dr Van Bergen says.\n\nFeeling unsure?\n\nSome parents are concerned their children will be smaller than their classmates. (Adobe Stock)\n\nFive per cent of the parents surveyed by Macquarie University said they were still unsure about when to send their child to school.\n\nDr English says it can be hard for parents to know what to expect from school because things will have changed a lot since their years of education.\n\n\"Talk to the school. Talk to your peers. If you have a psychologist or occupational therapist or speech therapist, talk to them as well,\" she says.\n\n\"If you are on the NDIS, talk to your providers.\"\n\nShe says it can also be helpful to ask relatives and friends with older children about their experience, as well as instructors of the child's extra-curricular activities, such as swimming.\n\nDr Van Bergen says parents should follow their instincts.\n\n\"School teachers do an amazing job to support children and bring them into a different educational context, but it's still a big transition,\" she says.\n\n\" Trusting your gut is important. \"\n\nShe recommends parents avoid being \"fatalistic\" about their decision.\n\n\"If there are any education gaps between younger and older children to start with, [research shows] it closes over time.\"\n\nNadine says she \"100 per cent\" made the right decision by delaying her daughter's schooling.\n\n\"There is so much pressure on prep and so many commitments … it's full on.\"\n\nThis is general information only. For personal advice, you should see a qualified professional.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/the-extraordinary-life-of-clara-wieck-schumann/105329120",
    "title": "'She was a pioneer': Clara Schumann still inspires musicians today",
    "publish_date": "Mon, 26 May 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Most women in 19th-century Europe were encouraged to learn the piano as a way to attract husbands, but it was never intended that they would pursue a career in music.\n\nDespite these constraints, Clara Wieck Schumann became a concert pianist and composer.\n\nClara Schumann gave her debut concert when she was nine years old.\n\n\"She was really a pioneer with so many things,\" says Australian pianist Andrea Lam, one of the judges in the new ABC iview series The Piano.\n\nMany are still inspired by Schumann’s life story and music today.\n\nBorn in Leipzig, Germany in 1819, Schumann made her debut when she was nine years old.\n\nShe later married fellow pianist and composer Robert Schumann, becoming his musical partner and staunchest advocate.\n\nAfter her husband’s death, Schumann supported her family by touring as a concert pianist, teaching students and mentoring younger composers. Some became lifelong friends.\n\nHer father’s prodigy\n\nWhat's your favourite music for the piano? Photo shows A dark blue piano from birds eye view with the words Classic 100 Piano written on top, on a background of colourful swirls Voting now in the Classic 100: Piano. Tell us your favourites and we'll count down Australia's top 100 choices across June 7 and 8 on ABC Classic and the ABC listen app.\n\nClara Schumann’s father, Friedrich Wieck, was a self-taught musician who sold pianos and ran a music-lending library. Her mother was a well-known singer and pianist as well as Schumann’s first teacher.\n\nWhen the couple separated, Schumann remained under her father’s custody.\n\nWieck devised his own methods to teach the piano, and Schumann was his model student, who he used to shore up his reputation.\n\nHer daily routine was planned to the minute.\n\nWieck would give his daughter a one-hour lesson on the piano as well as violin, singing, theory, harmony, composition, and counterpoint. On top of this, Schumann was expected to do an extra two-hours practise on her own.\n\nIn later life, Schumann wrote: \"[My father] was exceedingly strict, that he reprimanded me when I deserved it and in so doing, prevented me from becoming arrogant from the praise the world showered on me.\"\n\nHer future husband Robert Schumann was impressed with Schumann's talent after seeing her perform as a nine-year-old. He took lessons from her father, living in their house for a year.\n\nBy her mid-teens, Schumann had toured all over Europe to perform piano recitals under her father’s management.\n\n\"Recitals, where people bought tickets to hear a pianist or [other instrumentalists] perform in a public auditorium, were a new concept in the 19th century,\" says Andrew Ford,host of The Music Show.\n\nSchumann was admired for her musical interpretations, which she played from memory, unlike most of her fellow performers. One Austrian poet even wrote a poem called \"Clara Wieck and Beethoven\" after hearing her play the Appassionata Piano Sonata.\n\nSchumann’s relationship with her father broke down when he refused to give her permission to marry Robert Schumann, resulting in months-long legal battles.\n\nThe young couple won their case in court and married a day before Schumann's 21st birthday in 1840.\n\nMusical partner and champion\n\nSchumann premiered her first piano concerto at the age of 16 under the baton of renowned composer Felix Mendelssohn.\n\nRobert and Clara Schumann often composed together in the early years of their marriage (Getty: Hulton Archive)\n\nAfter their marriage, Robert and Clara collaborated musically for many years. But Robert’s physical and mental health deteriorated soon after.\n\nTouring to Russia in 1844 exhausted him.\n\nAs Robert continued to decline, Clara began to take the role of the family’s breadwinner through performing and teaching.\n\nRobert committed himself to a mental asylum in 1854 and died two years later, leaving Clara a single mother of seven children.\n\nSchumann reforged her earlier career as a concert pianist, giving public performances at home and overseas.\n\nFord says: \"The idea that you can buy a ticket to sit in a large auditorium listening to a great pianist play Bach or Beethoven owes a lot to Clara Schumann.\"\n\nSchumann was the first performer for many of her husband’s compositions. In later life, she premiered many piano pieces by Johannes Brahms, who became a close friend of the family.\n\nThere are over 1,300 preserved concert programs which detail the music she performed in recitals between 1831–1889.\n\nChampioning Clara Schumann\n\nAlthough Schumann did much to champion other composer’s music, even making them staples of classical music concerts, her own compositions were rarely performed after her death.\n\nBut Schumann is far from being forgotten.\n\nIn Germany, there are streets named after her in Berlin, Leipzig and other cities. Before the introduction of the Euro in 2002, Schumann was featured in one of Germany’s notes for the 100 Deutsche Mark.\n\n\"She’s not lost, but I think she needed to be rediscovered,\" says British pianist Isata Kanneh-Mason.\n\nGet ready to stream the Classic 100: Piano in Concert Photo shows A conductor getstures on stage. Stream the Classic 100 in Concert on Saturday 21 June from 7.30 pm on ABC TV and ABC iview.\n\nTo mark Schumann's 200 birthday in 2019, Kanneh-Mason recorded an album of her music, including the piano concerto Schumann premiered as a young woman.\n\nThat same year, her birth town in Leipzig organised a festival to honour her life and music.\n\nThe town had a memorial plaque to mark the place where she was born, and her marital home is now a museum and music school dedicated to both Clara and Robert Schumann.\n\nKanneh-Mason was inspired by Schumann’s life story when she chose to record her music.\n\n\"Not only did she manage to sustain a long and demanding concert career, she also raised a large family and dealt with inconceivable tragedies,\" Kanneh-Mason says.\n\nSchumann also has a young torch-bearer in ABC iview's The Piano.\n\nJust like Schumann, \"I practise everyday,\" says 12-year-old Stefania, one of the younger performers in the series.\n\n\"I think of the piano as an extension of my soul and body,\" Stefania says.\n\nAfter wowing judges Harry Connick Jr and Andrea Lam with her flawless performance of Bach's English Suite No. 2, Stefania was invited to perform for the Finale concert.\n\nStefania performs music by Clara Schumann in The Piano's finale, mentored by Lam, who herself was a prodigy, debuting with the Sydney Symphony aged just 13.\n\n\"It's really important to be able to identify with your idols and with people that you respect,\" Lam says.\n\n\" To have Clara Schumann as a beacon for us is phenomenal. \"\n\nStream The Piano free on ABC iview or watch Sundays at 7:30pm on ABC TV.\n\nVote for your favourite piano music in the Classic 100: Piano and hear what made the top 100 across June 7 and 8 on ABC Classic and the ABC listen app.\n\nGet the latest classical music stories direct to your inbox",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-27/agricultural-land-value-increase-property-report/105337226",
    "title": "Farmland value increase exceeds all other property types, report finds",
    "publish_date": "Mon, 26 May 2025 21:54:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmland has increased in value more than any other Australian property type over the last two decades, a report has found.\n\nThe Australian Property Institute's (API) inaugural valuation report shows the value of agricultural land has increased by 256 per cent since 2005, compared to 154 per cent for housing over the same period.\n\nThe strongest growth was recorded in western Victoria's Wimmera region, where land values have skyrocketed by more than 800 per cent amid demand from the renewable energy, grain and grazing sectors, according to the report.\n\nAmelia Hodge says the results of the study might not be expected by some. (Supplied: Amelia Hodge)\n\nAPI chief executive Amelia Hodge said it was surprising to some that farmland had outperformed metropolitan property categories.\n\n\"It's really interesting that the Wimmera region has come out the winner over 20 years,\" she said.\n\n\"Agricultural land has come out nationally as the best performing category.\"\n\nThe API says the Wimmera topped the table for the highest percentage increase in farmland value. (Supplied: Australian Property Institute)\n\nAdelaide tops housing growth\n\nAustralia's smaller capital cities outpaced Sydney and Melbourne in housing value growth over the last two decades.\n\nIn Adelaide prices rose by 175 per cent since 2005 and by 172 per cent in Hobart.\n\nSydney residential property prices grew by an average of 171 per cent during that time.\n\nPrices in Brisbane and Melbourne increased by 169 per cent.\n\nAdelaide house prices increased by 175 per cent in 20 years, according to the API report. (ABC News: Viki Ntafillis)\n\nInflation rose by 67 per cent over the same period.\n\nThe API report drew its comparisons using data from the Australian Bureau of Statistics, the Australian Bureau of Agricultural and Resource Economics, Suburbtrends and Colliers Edge.\n\nThe Gold Coast was the top performing regional residential market and six other Queensland regional cities were in the top 10.\n\nThe Gold Coast had the biggest increases in property values of all regional cities. (ABC Gold Coast: Cathy Border)\n\nFrom despair to prosperity\n\nWimmera-based real estate agent Nick McIntyre said it used to be hard to sell farmland in the region.\n\n\"You look back 20 years and we were in the middle of the Millennium Drought and prices were going nowhere,\" he said.\n\nElders real estate agent Nick McIntyre has 40 years' experience in the business. (Supplied: Nick McIntyre)\n\nMr McIntyre said a \"perfect storm\" of low interest rates, strong commodity prices and favourable seasons had driven prices up.\n\n\"We saw property prices double and double again — and in some instances double again — from about $1,000 to $2,000 to $4,000 to even $8,000 an acre,\" he said.\n\nThe API report noted the rise in the value of farmland in the Wimmera was also driven by the conversion of land into solar farms.\n\nBut Mr McIntyre disagreed with that assessment and attributed the growth to production capacity.\n\n\"Seasons are very reliable and even in the driest of years they can almost always get some sort of crop, whereas that's not always the case in other areas,\" he said.\n\nHigh prices bring challenges\n\nMinyip farmer Ryan Milgate said the swing towards grain growing and away from livestock production had boosted prices.\n\n\"The change in our farming systems and our ability to successfully grow crops like lentils, I think, has underpinned why the Wimmera is such a sought-after cropping area,\" he said.\n\nRyan Milgate says land value is just \"a number on a piece of paper\" for intergenerational farmers who don't plan to sell. (ABC News: Sean Warren)\n\nBut Mr Milgate said high land values had put a lot of pressure on those who had expanded and he expected prices to flatten out.\n\n\"The capital value of the land doesn't reflect the capacity of the land to produce, so one of the real issues is there has been a real squeeze in return on investment,\" he said.\n\n\"It's important to note the vast majority of farmers are here for the long-term and the capital value of our land is just a number on a piece of paper.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/asx-markets-business-live-news-may-27-2025/105339300",
    "title": "Live: European tariff reaction, market awaits inflation read to inform next RBA rate cut",
    "publish_date": "Mon, 26 May 2025 21:25:10 +0000",
    "category": "finance",
    "authors": [
      "Daniel Ziffer",
      "Gareth Hutchens",
      "Stephanie Chalmers"
    ],
    "text": "Just returning to one of Dan's earlier posts about a new study from Robert Walters Australia which has found two-thirds of Australian job ads don't say how much the pay is.\n\nI'd love to hear your thoughts on this. Please feel free to leave a comment on the blog.\n\nIf you go into any Reddit forum on this topic you'll quickly see how much job hunters hate when employers don't advertise how much money they're willing to pay.\n\nA quick example:\n\nA: \"Employers like to claim they're worried a great candidate won't apply if they see low pay. What they really mean is their lowest offer is embarrassingly low.\" B: \"It’s just a waste of time. I had an interview for a role. Senior role, managing 3 people, international travel. They wanted to pay $110k including bonus and super. They got extremely offended when I asked them the salary and then noted that in my industry that role would be approx. 200k. They ended up hiring someone really junior who lasted 6 months and are now hiring again. Pay peanuts get monkeys. C: \"When I see a posting that says COMPETITIVE SALARY I now automatically assume your pay is s & $t, otherwise why wouldn’t you disclose it? D: \"I wish it was mandatory to post the base pay on job adverts, it would make the whole thing more competitive in favour of the employees and it would reduce wasting our time and the employers time when we turn down the job after finding out that the wages are dog s% & ^.\n\nThose comments come from this Australian reddit forum, which was started two years ago.\n\nI'd argue that the issue feeds into the much broader feeling we all have about the phenomenon of \"bullshit jobs\" and the general \"enshittification\" of daily online services.\n\nIt's part of the same aggravating thing.\n\nIf things just worked, and if there was a basic level of transparency in our daily interactions, it would save everybody's time.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/retirees-wa-sues-margaret-thomas-husband-frank-pinner/105153164",
    "title": "Charity suing husband of former CEO in bid to claw back retirees' millions",
    "publish_date": "Mon, 26 May 2025 21:22:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Millions of dollars belonging to retirees who have prepaid funerals through a charity could be in jeopardy amid an investigation from WA's consumer watchdog.\n\nRetirees WA (RWA) has thousands of mostly senior members and operates retirement villages and aged care facilities across Western Australia, social programs for seniors, and a scheme for discounted funerals.\n\nBut money from the charity's prepaid funeral fund has been tied up in a maze of loans and investments into companies linked to Frank Pinner, the husband of RWA's former chief executive officer Margaret Thomas.\n\nThe charity is now pursuing legal action against Mr Pinner and his companies to try to recoup millions of dollars. Mr Pinner has filed a defence denying that any monies are owed.\n\nMillions flow from funeral fund\n\nMargaret Thomas is the Mayor of Kalamunda, and ran unsuccessfully for the Liberals in the 2005 state election.\n\nMs Thomas led Retirees WA for almost two decades. (ABC News: Cason Ho)\n\nA few months after the election loss, she became Retirees WA's chief financial officer, and was also appointed its chief executive officer in 2007.\n\nMillions of dollars started flowing from the charity into loans and investments, with the approval of the boards at the time.\n\nMs Thomas's husband, Frank Pinner, was a director of the company which received the investments, ASIC records show.\n\nFrank Pinner has been paid to build Retirees WA's retirement villages and aged care facilities. (ABC News: Cason Ho)\n\nThe money for all the investments and loans came from Retirees WA's funeral fund, where millions of dollars are held in trust on behalf of members who have prepaid their funerals.\n\nAs of the last financial year, the charity had $6.6 million worth of prepaid funerals. Its most expensive funeral package is $4,279 — or about 1,500 prepaid funerals.\n\nA web of money\n\nThe charity's financial reports show it invested $1.6 million in 2005 into Mr Pinner's building company, Over 55 Lifestyle Villages Pty Ltd, and another $2.8 million the following year.\n\nLoading...\n\nThe charity also loaned $1.8 million to Mr Pinner's company in 2006, which the company used to buy a property.\n\nRetirees WA then paid $4,315 per month, growing to $9,200 per month by 2015, to lease part of the property back as office space.\n\nMr Pinner's company sold the property for $3 million in 2016, and paid the $1.8 million loan back to the charity.\n\nRWA's financial reports do not state the charity received the $1.2 million profit from the sale of the property.\n\nCharity sues\n\nMs Thomas stepped away from her dual roles at Retirees WA early last year.\n\nShe and Mr Pinner both declined requests for interviews and did not answer written questions about Mr Pinner's financial links to the charity.\n\n\"Those questions are based on numerous factual inaccuracies, and imply a number of imputations which are false,\" a letter from their lawyer said.\n\nMargaret Thomas was re-elected Mayor of Kalamunda in 2023. (Supplied)\n\nBut the lawyer refused to clarify the \"inaccuracies\" and said it would be inappropriate to respond to questions relating to ongoing legal proceedings.\n\nNone of the transactions detailed above are part of ongoing legal proceedings and the ABC is not suggesting any wrongdoing by Ms Thomas or Mr Pinner in relation to any of them.\n\nRetirees WA was founded in 1933 as the Invalid and Old Age Pensioners' Association. (ABC News: Cason Ho)\n\nRetirees WA is suing Mr Pinner and his companies over what it claims is a default on a $1.5 million loan made to his company in May 2017, and another $1.5 million loan made in November 2020.\n\nMr Pinner denies the allegations.\n\nThroughout Margaret Thomas's tenure at RWA, building contracts for the charity's retirement villages and aged care facilities were approved by the boards to be given to companies operated by Mr Pinner.\n\nLinks to former auditor\n\nThe charity's financial web stretches beyond husband and wife.\n\nPast financial reports show Graeme Wovodich was RWA's external auditor in charge of scrutinising the charity's finances for a decade during Ms Thomas's tenure, when he worked as a director with Armada Accountants & Advisors.\n\nGraeme Wovodich has been an auditor for more than three decades. (ABC News: Cason Ho)\n\nThe ABC understands Mr Wovodich left his firm in 2018, which resulted in him losing Retirees WA as a client.\n\nA year later, a $4.8 million investment from the funeral fund in one of Mr Pinner's companies was transferred to Retirement Village Developments Pty Ltd, a company directed by Mr Wovodich.\n\nHowever, the investment in Mr Wovodich's company has been \"fully impaired\" in the charity's latest financial report, which means the $4.8 million has been deemed irrecoverable and the investment revalued at $0.\n\nGraeme Wovodich also declined a request for an interview, and did not respond to written questions.\n\nRed flags\n\nMembers of Retirees WA have been raising questions about the charity's financial management for years.\n\n\"What absolutely amazes me, I find it utterly bewildering … they were allowed to do this for years,\" member Susan Burns said.\n\nSusan Burns and other RWA members have scoured through the charity's financial documents. (ABC News: Cason Ho)\n\n\" How can you run a charity like that? \"\n\n\"There was a resident in here who unfortunately has since died ... he was really concerned about the funeral fund. A lot of people got told, 'don't leave your money in the funeral fund'.\"\n\nLetters from Ms Burns show she alerted WA's consumer watchdog about the charity's financial management as early as 2016 and also complained to the Australian Charities and Not-for-profit Commission.\n\nMs Burns says she's concerned about the charity's ability to stay solvent. (ABC News: Cason Ho)\n\n\"We were just ignored,\" she said.\n\nIn mid-2021, Consumer Protection formally started investigating the governance of Retirees WA.\n\nRetirees WA changes\n\nThe consumer watchdog says its ongoing investigation is \"highly complex\", and it will provide information to families once it is finished.\n\nConsumer Protection says it's focused on protecting the interests of RWA's members and retirement village residents. (ABC News: Cason Ho)\n\nRetirees WA's new CEO Henrietta de Sa was the charity's funeral fund manager when some of the loans and investments were approved using money from the fund, but said she was not involved in the decisions.\n\nShe said changes had been made in the organisation's management structure since Ms Thomas left to ensure the board \"has more insight over all our financial decisions and over the organisation as a whole.\"\n\nHenrietta de Sa stepped in as interim-CEO after Margaret Thomas's departure, and was officially appointed CEO this year. (ABC News: Cason Ho)\n\nNew rules will mean one person can't hold both CEO and CFO positions — as Margaret Thomas did — and the charity is implementing a \"liquidity management strategy\" to ensure it can meet its financial obligations.\n\n\"We realised there were a lot of things, that our policies and procedures need to be changed, because they were not up to date,\" Ms de Sa said.\n\n\" Retirees WA does have a plan … I think Retirees WA is very solvent, and there's no worry. \"\n\nGovernance failings\n\nUniversity of Western Australia charity governance expert Ian Murray warns of the potential dangers of charities transacting with private companies where the transaction involves people with pre-existing connections, such as family members or business partners.\n\nProfessor Murray says related party transactions are common between charities, but less common between a charity and for-profit. (ABC News: Cason Ho)\n\n\"When you're talking about red flags, yes we would worry a bit about for-profits and non-profits entering into related party transactions,\" Professor Murray said.\n\nHe said it could be difficult for the federal regulator — the Australian Charities and Not-for-profits Commission (ACNC) — to have a clear picture of whether a related party transaction might be a cause for concern.\n\n\"The reporting is all about 'have you got related parties?' … but in a charity setting, that's not the worry. It's a secondary question about 'have we got private benefit flowing to someone?',\" he said.\n\nProfessor Murray says there are gaps in charity regulation which should be addressed. (ABC News: Cason Ho)\n\nProfessor Murray said a recent Productivity Commission inquiry into regulation of the charity sector recommended giving more enforcement powers to the federal regulator, including against individuals.\n\n\"Charities exist for the public benefit,\" Professor Murray said.\n\n\"It's going to be people in need, or others who charities are meant to be serving, who are the ones that suffer when we have governance failures in the charity sector.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-27/monaco-grand-prix-racing-an-f1-problem/105339084",
    "title": "F1's dull and comical Monaco race proves you cannot manufacture fun",
    "publish_date": "Mon, 26 May 2025 21:16:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "How can F1 make the Monaco Grand Prix an exciting race?\n\nIt is a simple question, seemingly without an answer.\n\nMonte Carlo's narrow streets and slow and tight corners, combined with the long and wide cars of modern F1 make overtaking near impossible.\n\nFor decades, it has led to races that more resemble processions. A parade of race cars, rather than cars racing.\n\nMonaco Grand Prix soured by 'silly' deliberately slow driving Photo shows Carlos Sainz of Spain driving the (55) Williams FW-47 on track during Lando Norris has survived an early scare and a tense finish to win his first Monaco Grand Prix, a race that threatens to be remembered for slow, negative driving.\n\nBut this year's race went from dull to borderline comical, and it may have taught F1's front office an important lesson — F1 is best when it is organic.\n\nThe Monaco Grand Prix is the jewel in the crown for F1.\n\nIt is the race every driver wants to win and every fan wants to attend.\n\nBut the race itself is arguably the worst of the year and F1 wanted to change that.\n\nEvery driver was mandated to pit twice on Sunday. The hope was for teams to come up with varied pit strategies and add excitement and unpredictability to the race.\n\nWhat fans got was the exact opposite.\n\nThe combination of needing to stop twice, and overtaking being impossible around Monaco, led to drivers deliberately driving slow to help their teammates.\n\nDespite a new pit stop mandate, the usual gridlock of cars during the Monaco Grand Prix continued in 2025. (Getty Images: NurPhoto/Alessio Morgese)\n\nTeams instructed drivers to go slow, holding up rivals, while their teammates could race clear, complete their stops, and then emerge on track still in front of the gaggle who were slaving behind a deliberately slow car.\n\nIt was confusing, dull and the exact opposite of what a race is.\n\nA mandate that was hoped to produce one of the best races in recent years, actually led to one of F1's worst races.\n\nAnd there is a lesson for organisers in this.\n\nIn the wild world of F1, simplicity is great and organic excitement is better than manufactured fun.\n\nDespite years of boring races, hundreds of thousands still attended and tens of millions still watched at home.\n\nF1 fans knew what they were getting into, because they love the product for what it is.\n\nAt its core F1 is simple; build a fast car, employ a quick driver, and complete the race as soon as possible.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThat is how F1 has always been, and that is what has made it so popular.\n\nThe series had an enormous following around the world for decades, and the simplicity of the sport allowed everyone to enjoy it.\n\nNetflix got involved and gave F1 a popularity surge that it still enjoys now.\n\nBut even Netflix knew audiences would enjoy the simplicity of F1.\n\nThe early seasons focused heavily on the plight of backmarker teams, desperately trying to score just one, crucial and all-important championship point.\n\nThey were driving, to survive. Simple.\n\nIt was this simplicity that was sorely lacking in Monaco on Sunday and all it achieved was confusing the audience.\n\nThe intention from F1 was commendable. There is little doubt F1 was thinking of its fans when it introduced the pit stop mandate.\n\nBut when excitement and fun are forced, it is never as good as when it comes naturally.\n\nSomething race winner Lando Norris summarised well on Sunday.\n\n\"I think Formula 1 should not turn into just a show to entertain people. It's a sport. It's who can race the best, who can qualify the best,\" he said.\n\n\"The last thing I want is manufactured racing, and I think we definitely need to stay away from that and do a better job with cars, with tyres.\n\n\"Then you might start to see more racing, but not by just introducing so many pit stops.\"\n\nMcLaren's Lando Norris celebrates with a trophy on the podium after winning the Monaco Grand Prix alongside third-placed Oscar Piastri and McLaren chief executive Zak Brown. (Reuters: Stephanie Lecocq)\n\nF1 has new technical regulations from 2026, meaning next year's cars will be vastly different to 2025.\n\nThe next generation of cars is hoped to allow for better wheel-to-wheel racing.\n\nWill this translate to on-track battles in Monaco? More than likely not.\n\nBut fans have proven over the decades that they enjoy the product as it is.\n\nFans don't need pit stop mandates or funky rules.\n\nFans want fast cars, great drivers and a compelling story that plays out without interference.\n\nAnd when F1 gets that right, it is a beautiful sport to watch.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/movies/get-50-percent-off-tickets-to-sydney-film-festival-20250521-p5m10p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get 50% off tickets to Sydney Film Festival*",
    "publish_date": "Tue, 27 May 2025 12:00:00 +1000",
    "category": "entertainment",
    "authors": [],
    "text": "As a Herald subscriber, you can get 50% off tickets* to Sydney Film Festival.\n\nSydney Film Festival is your destination for big premieres, big screen experiences, and big nights out. With over 200 new films, from over 70 countries, across 13 venues, over 12 days, Sydney Film Festival is a celebration of stories too big for a small screen.\n\nDon’t miss premieres of some of the biggest films of the year including Ari Aster’s Eddington starring Pedro Pascal and Joaquin Phoenix, Kelly Reichardt’s The Mastermind and new Aussie hit horror Together. See the bigger picture, June 4-15.\n\nSydney Film Festival, closing night 2024 at the State Theatre Credit: Sydney Film Festival\n\nHerald subscribers can access a strictly limited offer of half price tickets by entering the promo code SMH25 on the booking page when selecting tickets. The number of redemptions is strictly limited to 100, and not available for event screenings, including screenings at the Sydney Opera House.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/too-many-plodders-have-the-blues-already-peaked-or-can-they-save-their-season-20250527-p5m2g3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Too many plodders’: Have the Blues already peaked, or can they save their season?",
    "publish_date": "Tue, 27 May 2025 11:58:43 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "When Michael Voss was appointed coach of Carlton after two middling full seasons under David Teague, then Carlton president Luke Sayers said the three-time Brisbane premiership skipper, also an experienced assistant and senior coach, had the attributes needed to fulfil the untapped potential on the Blues’ list.\n\n“We have done that [coaching change] because we believe, right at this period of time, that Michael is the best leader and the best coach to get what we believe is the untapped potential within our playing group,” Sayers, flanked by chief executive Brian Cook and Voss, said.\n\n“Michael is a person of great integrity, of great values. He knows what success and high-performance looks and feels like and, if you strip it back, he is a real people’s person with good EQ and very good relational skill sets, and when we look at our list, we think our list is really poised for great things when married up with those attributes and those skill sets which Vossy has in spades.”\n\nWhat next: Blues coach Michael Voss has much to ponder over the mid-season bye. Credit: AFL Photos\n\nSayers made those comments in September 2021. Three-and-a-half seasons later, the potential of the Blues’ list remains just that – untapped.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/haas-to-play-as-crichton-misses-nsw-captain-s-run-20250526-p5m2dc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Haas to play as Crichton misses NSW captain’s run",
    "publish_date": "Tue, 27 May 2025 11:58:40 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Blues prop Payne Haas has been cleared to play in Wednesday’s Origin series opener while Blues officials will wait until match-day morning to make a final call on Stephen Crichton’s fitness after the Bulldogs centre sent an injury scare through the camp on Monday.\n\nNSW coach Laurie Daley said on Tuesday he was weighing up whether to train behind closed doors for the remainder of the series – without any public or media in attendance – after footage was published by this masthead showing Crichton hobbling from the paddock with a quad injury.\n\nNSW rounded out their preparations on a balmy morning at Suncorp Stadium, with the immediate concern the availability of right centre and Canterbury captain Crichton.\n\nSouth Sydney’s Campbell Graham, who has been in camp all week, will start the game if Crichton is ruled out.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/it-s-a-big-part-of-my-life-injury-plagued-wallaby-confirms-his-future-20250527-p5m2gs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was devastated’: Wallabies star reveals turmoil upon announcing his future",
    "publish_date": "Tue, 27 May 2025 11:54:59 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Injury-plagued Wallabies centre Josh Flook has cast aside a tumultuous year on the field to ink a contract extension with the Queensland Reds.\n\nFlook hoped for a career-defining campaign in 2025.\n\nBut after the 23-year-old scored twice while making two linebreaks in the Reds’ round-three triumph of the Western Force, he was taken from the field, initially believing the injury was not a major concern.\n\nJosh Flook is tackled during a Bledisloe Cup match against the New Zealand All Blacks. Credit: Getty Images\n\nScans revealed a ruptured tendon, which has kept him out of the game ever since.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/swimming/clowns-juggling-knives-clean-swimmers-face-bans-if-they-compete-at-enhanced-games-20250527-p5m2hh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Clowns juggling knives’: Clean swimmers face bans if they compete at Enhanced Games",
    "publish_date": "Tue, 27 May 2025 11:48:25 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "The world’s best swimmers have been warned they could face bans from future competitions if they take part in the Enhanced Games - even if they compete clean.\n\nWorld Aquatics, the global governing body for swimming, has likened the proposed event to “clowns juggling knives” and is threatening to sanction any athlete who takes part, regardless of whether they use performance-enhancing drugs.\n\nTwo-time Australian Olympian James Magnussen, one of the public faces of the Enhanced Games, has publicly urged reigning Olympic champion Cam McEvoy to race at the inaugural event in Las Vegas next May.\n\nThe Enhanced Games plans to pit drug-enhanced athletes against clean Olympians — and is offering huge financial incentives to lure them in, including $US1 million ($AUD1.55 million) for breaking the men’s 50m freestyle world record.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/the-best-places-to-stay-in-rome-20230330-p5cws7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best places to stay in Rome",
    "publish_date": "Tue, 27 May 2025 11:40:21 +1000",
    "category": "lifestyle",
    "authors": [
      "Maria Pasquale"
    ],
    "text": "Hotel Viminale Perfect for: Stylish professionals, fashionable couples, smart city escapes\n\nPart of the Bzar Hotels group, the Hotel Viminale embodies the kind of elegant, older-hipster trendiness of its home neighbourhood of Monti. The recently restored property opts for a neutral palette of creamy, buttery tones which complement the high ceilings, large windows and neoclassical features of the building, while also adding just enough contemporary touches and modern conveniences to keep things interesting. The result is a smartly seductive option in a cool and convenient location, ideal for a fun yet sophisticated Roman holiday.\n\nFrom €145 a night. Via Cesare Balbo, 31, 00184. Phone: +39 06 8403 0333. See hotelviminalerome.com Mama Shelter\n\nPerfect for: Young hip couples, party fiends, families with teenagers\n\nThe Mama Shelter crew has properties all over Europe and their Roman outpost near the Vatican keeps the brand’s hip signature style with plenty of bright colours, design-led decor and pattern-clashing fabrics. The vibe is fresh and fun, with the hotel’s restaurant and communal areas hosting a packed calendar of onsite events varying from themed brunches to disco nights and DJ sets. When it’s time for a moment of peace head up to the lovely rooftop bar or chill out in the spa and pool.\n\nFrom €185 a night. Via Luigi Rizzo, 00136. Phone: +39 06 9453 8900. See mamashelter.com/roma Villa Spalletti Trivelli Perfect for: Honeymooners, aristocratic charm, old-world luxury\n\nWalking into Villa Spaletti Trivelli is like walking into a perfectly preserved historic palazzo, complete with antique furniture, wall-hung tapestries and sumptuous decor. The stately villa is a romantic hideaway in the heart of town and thoroughly spoils its guests with fabulous service and beautifully furnished rooms, suites and apartments. Pamper yourself at the tranquil wellness centre then head up to the newly refurbished rooftop terrace where you can recline with a classy cocktail or take a dip in the jacuzzi.\n\nFrom €410 a night. Via Piacenza 4, 00184: Phone: +39 06 4890 7934. See villaspalletti.it W Rome\n\nPerfect for: Well-heeled creatives, fun-loving families, fashionistas\n\nThe Marriot’s punchy offshoot brand packs its 19th century palazzo with a fresh decor and a funky attitude which draw a different type of jet set to the Via Veneto area, historically home to more classic “grand dame” luxury hotels. In the warmer months, head up to the rooftop and feast on pizzas by one of Rome’s best, Pier Daniele Seu at ‘Seu Pizza con Vista’ (Seu Pizza with a View). From the relaxed lounge in place of a formal lobby, modern welcome desk pods and a hidden door leading to a charming secret garden, the W is full of surprising, theatrical elements that appeal to a lively younger crowd.\n\nFrom €440 a night. 26/36, Via Liguria, 00187 Rome. Phone: +39 06 894121. See marriott.com Corso 281 Perfect for: Stylish shoppers, small families, wine connoisseurs\n\nIn sharp contrast to some of Rome’s overly fussy five-star offerings, Corso 281’s quiet sophistication and restrained monochrome colours offer an altogether more demure upscale sojourn. Everything here is fine-tuned, from your preferred pillow type to your breakfast order served in room, while the basement caveau packed with rare labels and prized vintages will please even the snobbiest of wine connoisseurs. Add a super-central location and this is a great choice for those looking for discreet luxury without in-your-face opulence.\n\nFrom €400 a night. Via del Corso 281, 00186. Phone: +39 06 8780 9370. See corso281.com\n\nHotel Eden Perfect for: Old luxury, well-to-do families, special occasions\n\nThe Dorchester Collection’s Eden is a sure bet for classic old-school luxury, faultless service and sumptuous refinement with just the right amount of high-end pizazz. Everything feels expensive and there is a sense of hushed affluence throughout, with soft creamy hues, luxury fittings and lashings of marble and gold, along with flash technology. There is also an award-winning spa and wellness centre and a Michelin-starred top-floor restaurant, La Terrazze run by award-winning chef Salvatore Biano, which boasts an incredible view over the city. Despite the luxe, families are well catered for with large family suites, special family rates and children’s welcome gifts on arrival.\n\nFrom €1060 a night. Via Ludovisi 49, 00187. Phone: +39 06 478121. See dorchestercollection.com The Glam\n\nPerfect for: Smart city-breakers, couples, culture hounds\n\nFor a sassy short city break, the Glam ticks all the boxes. The location on busy Via Nazionale is well-placed for sightseeing while the cute wine bars and artsy cobbled streets of Monti lie just around the corner. Inside the mood is calm, mature and boutiquey; modern decor in black and white is punctuated with warm, rich tones of aubergine and chartreuse. A cute rooftop bar and restaurant, complete with jacuzzi, add a lot of value and a lot of fun.\n\nFrom €167. Via Nazionale 82, 00184. Phone: +39 06 9934 5430. See theglamhotelroma.it Margutta 19 Perfect for: Art fiends, romantics, older sophisticates\n\nLocated on pretty Via Margutta, once the haunt of Rome’s artist community, this swish collection of 16 chic suites forgoes flashiness for a more composed version of luxury. There is a tasteful eye for style throughout, from the art nouveau-inspired lobby to the handsome rooms decorated in warm shades of ochre, cream and deep chocolate. Backing onto the verdant climes of the Pincio hill and boasting a beautiful secret garden restaurant, the ambience is one of secluded tranquillity and cultured affluence.\n\nFrom €440. Via Margutta 19, 00187. Phone: +39 06 9779 7979. See romeluxurysuites.com Babuino 181\n\nPerfect for: Shopaholics, short stays, business travellers\n\nFor a five-star feel without the hefty price tag look no further. Babuino 181 gives its guests the feeling of city living; step straight out onto Via del Babuino, an elegant boutique-lined thoroughfare well-placed for exploring Rome’s centre. Inside the mood is bright, light and contemporary, and while it lacks the extra amenities of swankier hotels, there is a cute rooftop bar for breakfast and drinks. Add the great location and well-thought-out details, and it hits the mark for smart style on a budget.\n\nFrom €215. Via Babuino 181, 00187. Phone: +39 06 3229 5295. See romeluxurysuites.com Soho House Perfect for: Design fiends, creative networkers, media types\n\nSnazzy members-club Soho House opened its Roman outpost in 2021, choosing the hipster-esque San Lorenzo district as its home. The purpose-built 10-storey hotel exudes cosmopolitan creativity with an aesthetic that blends avant-garde art with retro panache and a subtle nod to 1950s dolce vita. There’s a hi-tech spa, art gallery space and cinema room but the place to be is the rooftop where you can soak up 360-degree views of the city from the bar, restaurant and pool.\n\nFrom €310 . Via Cesare di Lollis 14, 00185. Phone: +39 06 9480 8000. See sohohouse.com\n\nHotel Hassler Perfect for: Iconic location, timeless grandeur, five-star service\n\nA self-titled ‘stairway to heaven’, the Hassler’s fabulous location at the top of the Spanish Steps certainly gives the impression that you are looking down on the Eternal City. A favourite of film stars, aristocracy and celebrities, this is luxury with a capital L, from the exquisite suites and beautifully furnished rooms, to the faultless service. The Michelin-starred Imago restaurant, with its floor-to-ceiling windows and panoramic views over the Roman rooftops is one of the city’s most magical dining experiences, also thanks to chef Andrea Antonini’s spectacular culinary creations.\n\nFrom €990. Piazza Trinità dei Monti 6, 00187. Phone: +39 06 699 340. See hotelhasslerroma.com Hotel de la Ville\n\nPerfect for: Laid-back luxury, moneyed movers and shakers, super-chic city stays\n\nPlayfulness and joie de vivre make the Hotel de la Ville textbook perfection in how to do light-hearted luxury. Housed in an impressive 18th century palazzo perched atop the Spanish Steps, the Grand Tour provides the theme throughout, with a few contemporary flourishes to keep things fresh. Rooms are adorned with heavy brocade and velvets, tempered with pale walls and lots of light, while the panoramic Cielo rooftop bar gives off easy-breezy Riviera vibes with its red-striped umbrellas. Design-lovers will adore the new inhouse Ginori café where the fresh, flavourful dishes are served on stunning Ginori porcelain and tableware.\n\nFrom €1290. Via Sistina 69, 00187. Phone: +39 06 977931. See roccofortehotels.com Chapter Roma Perfect for: Edgy Millennials, contemporary design fans, young couples\n\nRight on the border of the Jewish Ghetto and the Regola district, Chapter offers a dose of urban grit and edge tucked away from the crowds. Exposed brick walls and industrial elements jostle with vintage finds, artisanal accessories and bespoke furniture, all softened with block colours of dark green, tangerine and coral. Great service and a choice of drinking and dining locations make this great value if you want a luxury feel without breaking the bank.\n\nFrom €200. Via di S. Maria de’ Calderari 47. Phone: 00186. +39 06 8993 5351. See chapter-roma.com The Hoxton",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/money/planning-and-budgeting/this-simple-piece-of-planning-could-prevent-nasty-inheritance-disputes-20250527-p5m2ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to avoid inheritance fights? Just take after the cardinals",
    "publish_date": "Tue, 27 May 2025 11:38:31 +1000",
    "category": "finance",
    "authors": [
      "Noel Whittaker"
    ],
    "text": "Wasn’t it fascinating to watch the Papal conclave over recent weeks? The producers of the movie Conclave must have been counting their blessings, as viewers were drawn to their fictionalised version just as the real event was unfolding.\n\nIt made me think that many families go through their own kind of conclave after the death of a parent. There might be a will appointing an executor – hopefully – but what if that person is no longer suitable, perhaps due to ill health, estrangement, or simply being overwhelmed?\n\nThe papal conclave lasted just two days and involved 133 experienced cardinals. A family conclave may be far less public, but it can be just as fraught. Credit: AP\n\nThe papal conclave lasted just two days and involved 133 highly educated and experienced cardinals. Throngs packed St Peter’s Square and millions watched online.\n\nA family conclave may be far less public, but it can be just as fraught. Someone has to arrange the funeral, draft the death notice, and write the eulogy – often amid simmering tensions. These decisions can be especially sensitive in blended or second families, where loyalties and histories collide.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-advance-global-stocks-rise-on-trump-s-tariff-delay-20250527-p5m2f9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX trades sideways; Telstra and IAG slip",
    "publish_date": "Tue, 27 May 2025 11:34:20 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket had a flat start on Tuesday, while European markets gained in their first session trading after President Donald Trump extended a deadline on his aggressive euro area tariffs, leaving markets guessing yet again by making trade threats before backtracking.\n\nThe S&P/ASX 200 was up 6.4 points, or less than 0.1 per cent, at 8367.40 as of 11.12am AEST, swinging between narrow gains and losses in the first hour of trading as gains by energy and IT stocks were offset by declines in utilities. The local market edged up by 0.1 per cent on Monday.\n\nThe Australian dollar dipped overnight after hitting six-month highs on Monday, but was 0.1 per cent higher at 64.94 US cents at 11.12am AEST.\n\nEuropean markets took centre stage with Wall Street closed. Credit: Getty Images\n\nEnergy stocks were the morning’s best performers so far, with oil and gas giants Woodside and Santos up 0.8 per cent and 0.6 per cent, respectively, as oil prices steadied, with the market weighing the prospect for easing trade tensions between the European Union and the US ahead of an OPEC+ meeting that will decide on supply policy. Oil has trended lower since mid-January on concerns around the fallout from Donald Trump’s trade war, with a push by the oil cartel to restore idled supply adding to the headwinds.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-transport-minister-made-a-safety-promise-four-days-later-it-was-torn-apart-20250516-p5lzrz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The transport minister made a safety promise. Four days later, it was torn apart",
    "publish_date": "Tue, 27 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Transport bureaucrats circulated secret plans to slash improved safety measures at a major Sydney intersection four days after the then-minister gave public assurances that no such cuts would be made, casting aside expansive upgrades promised as a condition of WestConnex four years ago.\n\nAn internal presentation shared on November 14 laid bare plans to remove or weaken at least 14 of the 33 featured upgrades for Sydney Park Junction, at the intersection of St Peters, Erskineville and Alexandria, despite then-transport minister Jo Haylen’s office confirming on November 10 that the upgrades would go ahead as promised in 2021 after Transport for NSW’s first attempt to slash upgrades in August.\n\nPlans to slash the upgrades were circulated four days after then Transport Minister Jo Haylen (right) promised cuts wouldn’t be made, after she and senior minister John Graham (left) were urgently briefed on the matter. Credit: Monique Westermann\n\nThe new tranche of documents, obtained by the Herald, reveal the latest proposed cuts to Sydney Park Junction, including the removal of a pedestrian and bicycle crossing once touted as a centrepiece of the upgrades. This would represent another broken promise for an inner-city community seeking safer active transport links.\n\nAn extended cycleway and new bus shelter are among the other upgrades on the chopping block, while plans for widened footpaths and raised pedestrian crossings have also been toppled as a proposal for increased car parking on Sydney Park Road is preferred.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/world/annual-cheese-rolling-race-in-uk-20250527-p5m2js.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Annual cheese rolling race in UK",
    "publish_date": "Tue, 27 May 2025 11:18:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Annual cheese rolling race in UK\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/afl/mid-season-draftee-linked-to-afl-great-20250527-p5m2jq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mid-season draftee linked to AFL great",
    "publish_date": "Tue, 27 May 2025 11:16:02 +1000",
    "category": "sports",
    "authors": [],
    "text": "Mid-season draftee linked to AFL great\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/world/europe/macron-downplays-video-showing-wife-pushing-his-face-away-20250527-p5m2ez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Macron downplays video showing wife pushing his face away",
    "publish_date": "Tue, 27 May 2025 11:03:40 +1000",
    "category": "finance",
    "authors": [
      "John Leicester"
    ],
    "text": "Paris: They were just play-fighting.\n\nThat was French President Emmanuel Macron’s explanation for video images that showed his wife, Brigitte, pushing her husband away with both hands on his face before they disembarked from their plane to start a tour of South-East Asia.\n\nThe moment quickly made headlines in France, with media trying to decipher the interaction that cameras spotted through the just-opened door of the plane. The headline of a story on the website of the daily Le Parisien newspaper asked: “Slap or ‘squabble’? The images of Emmanuel and Brigitte Macron disembarking in Vietnam trigger a lot of comments.”\n\nMacron later told reporters that the couple, married since 2007 after meeting at the high school where he was a student and she was a teacher, were simply joking around.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/more-people-are-self-diagnosing-adhd-and-autism-leaving-experts-worried/s8bbpmde3",
    "title": "ADHD and autism: Experts urge caution as social media blurs diagnostic boundaries",
    "publish_date": "Tue, 27 May 2025 01:07:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Social media is re-shaping the lines between autism and attention deficit/hyperactivity disorder (ADHD) as an increasing number of people identify as having both conditions in online forums.\n\n\n\n\n\nResearchers from The University of Melbourne analysed 470,000 Reddit posts over a ten-year period from the forum's ADHD and autism communities.\n\n\n\n\n\nIt found users spoke of having both ADHD and autism, and in some cases were self-diagnosing rather than seeking clinical assessment.\n\n\n\nBenefits and risks of social media\n\nJemima Kang, a graduate researcher at The University of Melbourne, studied the Reddit posts and found emerging patterns.\n\n\n\nKang found users frequently mentioned ADHD in the autism communities, and vice versa, and discovered memberships of the two communities were overlapping more often.\n\n\n\n\n\n\"In general, this rising public interest in ADHD and autism and the interconnectedness is helping a lot of people better understand themselves and find community and articulate what they've been going through,\" she told SBS News.\n\n\n\n\n\nBut she said the overlap can also cause harm, as the \"growing interconnectedness\" can blur important distinctions between the two conditions.\n\n\n\n\n\n\"It can foster unwanted dual diagnoses and place strain on clinical services,\" she said.\n\n\n\n\n\nExperts and advocates warn that while the two mental health conditions could co-occur, they need to be treated separately.\n\n\n\nREAD MORE Autism and ADHD frequently overlap. People living with both can feel misunderstood\n\nExpensive to diagnose the distinct conditions\n\nAccording to Australia's government-funded service Healthdirect, autism spectrum disorder, or autism, is a developmental condition that affects a person's interaction with the world.\n\n\n\n\n\nWhile ADHD — also a developmental condition — includes symptoms of being easily distracted, impulsive and overactive.\n\n\n\n\n\nErin, who has both conditions, said she had to go through a long process to confirm her diagnoses.\n\n\n\n\n\n\"In my early 30s, I got the autism diagnosis first, and had found out other family members had ADHD, and I noticed that both of those conditions apply to me, so when I started seeing a psychiatrist, I asked her if I could be assessed for ADHD,\" she told SBS News.\n\n\n\nUnderstanding her diagnosis has helped Erin create strategies to navigate life better. Source: SBS News / Cameron Carr For Erin, the process of receiving both diagnoses involved separate and expensive evaluations, with some overlap but largely distinct assessments.\n\n\n\n\n\n\"The tests are pretty separate, and it's expensive. It was somewhere about 12.5 per cent of my entire yearly salary,\" she said.\n\n\n\n\n\nDr Tamara May, a clinical psychologist specialising in autism and ADHD, told SBS News — getting an autism or ADHD diagnosis in Australia is challenging — let alone receiving both.\n\n\n\n\n\n\"For ADHD, most people will see a psychiatrist who wants to access the most evidence-based treatment, which is stimulant medication, and that's very restrictive. You have to go privately,\" she said.\n\n\n\n\n\n\"To do an autism diagnosis, usually it's going through a psychologist who has expertise in the developmental conditions and diagnosing autism, and that can also, if it's done privately, can cost a lot, and for adults, it's generally just done privately.\"\n\n\n\nMay said it could be around $1,000 for a single appointment.\n\n\n\nConditions can come with a 'significant amount of disability'\n\nNicole Rogerson, CEO of Autism Awareness Australia, a not-for-profit autism education and awareness organisation, said people need to be careful about what they've read on social media.\n\n\n\n\n\n\"A wider amount of people now self-identify as being on the autism spectrum and potentially having ADHD,\" she told SBS News.\n\n\n\n\n\n\"Whilst we want to embrace that idea that neurodiversity has got a positive message behind it, it's crucial to understand that these conditions are very serious, and for a decent proportion of the community, it will come with a significant amount of disability.\"\n\n\n\nLISTEN TO Social media reshaping the lines between Autism and ADHD SBS News 26/05/2025 07:53 Play\n\nRogerson said the key is to ensure quality services are provided, whether it's for people with only one or both conditions.\n\n\n\n\n\n\"What is really important is that we have good quality diagnostic services across the country and that people are getting quality assessments. It's not merely ticking a box by seeing somebody you know online for telehealth,\" she said.\n\n\n\n\n\n\"If somebody has a legitimate diagnosis of ADHD, their life may be vastly improved with the help of medication. So it's important that we get the diagnosis right so we can get the right support for those people.\"\n\n\n\nWhat's the government doing?\n\nEarlier this year, the government launched its first national autism strategy with the aim to improve the lives of autistic people and dismantle harmful attitudes barring their participation in society.\n\n\n\n\n\nThe strategy, which will inform the federal government's policy approach, will run until 2031 and aims to bring Australia in line with countries such as the United Kingdom, the United States and Canada.\n\n\n\nREAD MORE Federal government unveils Australia's first national autism strategy\n\nSome states are also looking at making ADHD diagnosis cheaper and more accessible for people.\n\n\n\n\n\nSince 2017, the Queensland government has allowed GPs to diagnose and prescribe ADHD medication to children.\n\n\n\n\n\nOn Monday, the NSW government also announced that the state's GPs would be able to diagnose ADHD and prescribe medication for both children and adults.\n\n\n\n\n\nUp to 1,000 GPs would first receive training before taking on the new responsibility, but the details of the training and the rollout are yet to be confirmed.\n\n\n\n\n\nDr Rebekah Hoffman, the NSW and ACT chair of the Royal Australian College of General Practitioners, said the reform makes it easier for existing ADHD patients to access prescriptions, while reducing stigma around mental health.\n\n\n\n\n\n\"What it also means is hopefully there's a reduced wait list for getting into paediatricians and psychiatrists if we're able to go on and manage some of their complex but stable patients that don't need to see them as regularly.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/a-war-zone-flood-hit-residents-desperate-for-help-say-army-deployment-isnt-enough/qw9sc6igf",
    "title": "'A war zone': Desperate for help, flood-hit residents say army deployment 'isn't enough'",
    "publish_date": "Mon, 26 May 2025 19:35:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prime Minister Anthony Albanese is set to visit flood-ravaged communities in Taree, but residents say the promised government assistance falls far short of what's needed to confront the scale of the disaster.\n\n\n\n\n\nFor over a century, the Andrews family have lived in a house on farmland in Taree on the NSW mid-north coast.\n\n\n\n\n\nNow, it's the scene of unimaginable destruction.\n\n\n\n\n\nA densely packed wall of debris — several metres high — surrounds the back of the home.\n\n\n\n\n\nTrees, tangled metal, broken fences, farm equipment, and power lines are wrapped around all the structures in the area — washed up by raging floodwaters that ripped through the area last week.\n\n\n\nIan Andrews said he's heartbroken to see his childhood home destroyed. Source: SBS News Ian Andrews has lived in the family home for over 80 years and said they’re in desperate need of assistance to clear the debris.\n\n\n\n\n\n“It's heartbreaking”, he said, choking back tears.\n\n\n\n\n\n\"You can see the amount of debris we've got to remove, and we need to get it done quickly,\" he said.\n\n\n\n\n\n\"We need trucks. There’s 20, 30, 40 truckloads [of debris] there.\"\n\n\n\nThe Andrews family have lived in this house for more than 115 years. Now it's surrounded by debris nearly as high as the roof. Source: SBS News / Alexandra Jones Ian's wife, Sharyn Andrews, says it’s been difficult — physically and emotionally — to begin the clean-up while grappling with the reality that a lifetime of memories have been washed away.\n\n\n\n\n\n\"It's just devastating. It's stuff that we can't fix,\" she said.\n\n\n\n\n\n\"We are only pensioners, so it makes it very hard money-wise.\"\n\n\n\n\n\n\"We don't know whether we'll be able to come back and live in this house because the water's got so high.\"\n\n\n\nSharyn said other than friends and family, they've been offered no assistance.\n\n\n\n\n\n\"We haven't had anyone here other than my family. We've had no help from anybody.\"\n\n\n\n\n\n\"The longer they leave it, the worse it is. The mud smells,\" Sharyn said.\n\n\n\n\n\n“People can't do it, it's got to be machinery. People can't move this.\"\n\n\n\nMarkings inside the Andrews family home show the water level in 2021 floods, and a line far above it now shows how high waters rose this year. Source: SBS News\n\nPM to visit flood-ravaged areas\n\nPrime Minister Anthony Albanese is visiting Taree on Tuesday, and announced on Monday that 70 ADF personnel would be deployed to the region to assist .\n\n\n\n\n\n\"They will be involved in clean-up, in debris removal, in welfare checks and re-establishing critical infrastructure,\" Albanese said.\n\n\n\n\n\nThey will be joined by 100 disaster relief workers by the end of the week.\n\n\n\n\n\nIan and Sharyn's grandson, Josef Proctor, said he'd like to see more boots on the ground.\n\n\n\n\n\n\"Any help is good, but would I say it's good enough? No. No way,\" he said.\n\n\n\n\n\n\"This is like a war zone. A disaster, just catastrophic.\"\n\n\n\nSingle father of three Josef Proctor said he's devastated by the destruction, but the community coming together to help has lifted his spirits. Source: SBS News \"There hasn't been much government assistance in the area. Not at the moment anyway,\" he said.\n\n\n\n\n\nJosef lives on the same street as his grandparents and is also one of the thousands now displaced by the disaster.\n\n\n\n\n\n\"I'm a single dad of three kids and their rooms are gone. Clothes gone. It's been pretty extreme.\"\n\n\n\n\n\n\"If I didn't have my mum, we would have nowhere to go,” Proctor said.\n\n\n\n\n\n\"I'm going to have to move away.\"\n\n\n\n\n\nHe said he can’t quite believe what he's seeing.\n\n\n\n\n\n“Whole buildings in sections, like whole chicken coops... just scattered.\"\n\n\n\nThe NSW government is opening five recovery centres in flood-impacted areas from Tuesday, offering a range of support services to affected residents. Source: SBS News\n\nHelping hands\n\nShattered by the news of his hometown’s suffering, ex-rugby league player Matt Adamson travelled on Monday from Queensland to help with the clean-up.\n\n\n\n\n\n\"I grabbed some rakes and some boxes of gum boots and stuff because a lot of farmers were saying they needed that sort of general assistance just to get through,” Adamson said.\n\n\n\n\n\n\"I get pretty emotional, because as a young kid growing up in this area, it was a beautiful place to grow up.\n\n\n\nEx-rugby league player Matt Adamson (right) travelled from Queensland to help his hometown clean up after devastating floods. Sharyn Andrews (left) saidshe remembers Adamson from when he was a child. Source: SBS News Through the heartache, Sharyn said she's grateful for the helping hands.\n\n\n\n\n\n\"The people that are helping, like Matty, he's come from Queensland because his parents live here in town, and we've known him from when he was a little kid,\" Sharyn said.\n\n\n\n\n\nAfter seeing the scale of the damage, Adamson also thinks much more assistance is needed.\n\n\n\n\n\n\"Has the prime minister been here yet? Has he turned up?\" he said.\n\n\n\n\n\n\"This is a big moment to come and help local people who pay their taxes and are struggling to survive, especially our farmers,\" Adamson said.\n\n\n\n\n\nMillions of dollars in disaster relief payments are now available to residents and businesses in 19 council areas.\n\n\n\n\n\nIan Andrews hopes he’ll be eligible.\n\n\n\n\n\n\"This is a lower-income [area], like a lot of pensioners, a lot of older people in the Taree area, and I know there's a lot of them that have been caught in the flood. They're probably just as bad off as I am,\" Andrews said.\n\n\n\nRecord-breaking floods\n\nSharyn said the water last week rose nearly a metre above the last devastating floods in 2021.\n\n\n\n\n\nHer late mother-in-law also kept records of previous flood events.\n\n\n\n\n\n\"She said the 1929 was the worst flood. And this flood was bigger than 1929.\n\n\n\n\n\n\"She always kept a journal and had all the all the heights recorded. And I have continued that since we've lived here,\" she said.\n\n\n\nStill smiling as they confront the mammoth cleanup ahead. (From right) Matt Adamson, Josef Proctor and Sharyn Andrews. Source: SBS News \"Terrible to lose a lot of sentimental stuff, but we have our memories.\n\n\n\n\n\n\"And that's what I say to the kids. You know, the kids are upset, and I said, \"You know, we’ve just got our memories.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/when-your-share-of-80-billion-in-student-debt-is-set-to-be-cut/fpl55ehbn",
    "title": "When your share of $80 billion in student debt is set to be cut",
    "publish_date": "Mon, 26 May 2025 19:35:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians with growing student debt will have to wait to see their balances reduced by 20 per cent, despite Education Minister Jason Clare saying it's the government's first priority.\n\n\n\n\n\nThe Albanese government promised to cut $16 billion in student debt from 1 June 2025 if it were re-elected, amid wider reforms to the repayment system.\n\n\n\n\n\nHowever, the changes require legislation and parliament doesn't commence until the end of July.\n\n\n\nIn the meantime, student loans will rise by 3.2 per cent due to annual indexation calculations (based off the Consumer Price Index).\n\n\n\n\n\nSo, how will these changes be applied?\n\n\n\nWhen can we expect the cuts to be made?\n\nClare is adamant that the cuts to student loans will be the \"very first legislation\" Labor introduces when parliament returns on 22 July.\n\n\n\n\n\nOnce it's passed, he confirmed that outstanding student debts will be wiped retrospectively.\n\n\n\nEducation Minister Jason Clare has announced cuts to student debts as well as changes to repayments from 1 July. Source: AAP / Lukas Coch \"The legislation will cut 20 per cent off your student debt and backdate it to 1 June, before indexation was applied,\" Clare said in a statement to SBS News.\n\n\n\n\n\n“This is a game-changer for the more than three million Australians with a student loan.\"\n\n\n\n\n\nThis means the indexation that is applied on 1 June will be re-calculated by the Australian Taxation Office after the measure comes into effect.\n\n\n\n\n\nThese changes apply to several student support loans including HELP, VET Student Loan and the Australian Apprenticeship Support Loan.\n\n\n\n\n\nThe legislation should be passed quickly, breezing through the lower house where Labor holds 94 seats, and the upper house, where Labor and the Greens hold a majority.\n\n\n\nREAD MORE Labor floats plan targeting Morrison-era policy that hiked university course fees\n\nThe Greens are expected to vote for the changes as they supported wiping all student debt during their election campaign.\n\n\n\nHow much will the average Australian save?\n\nUniversity students and graduates will have roughly $5,500 cut from their student debts as a result of the changes,\n\n\n\n\n\nHECS-HELP debt, which grew to roughly $80 billion in 2023-24, is considered a debt recovery measure instead of a revenue stream for the government.\n\n\n\n\n\nFor a graduate with $50,000 in student loans, their debt will be wiped by $10,000.\n\n\n\n\n\nThe reduction is on debts as of 1 June, so Australians who voluntarily decide to pay off their debts before this date will not be reimbursed.\n\n\n\nWhat's next in Labor's student repayment reforms?\n\nThe minimum repayment threshold for student loans will also be raised on 1 July, offering cost-of-living relief for younger Australians.\n\n\n\n\n\nThose with student debt will start repaying their loans once their income is above $67,000, instead of the current $54,000 threshold.\n\n\n\n\n\nThe amount you pay will no longer be a percentage of your income but instead will be a marginal repayment, as recommended by the Australian University Accord.\n\n\n\n\n\nFor someone earning $70,000, the compulsory repayment will be reduced by $1,300 annually.\n\n\n\n\n\nThe measures are a recognition that course fees have increased — spiking under the Morrison government's Jobs-ready Graduates package — and younger Australians are paying high fees at a time when they are also looking to buy their first homes and start a family.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/private-hospital-giant-healthscope-falls-into-receivership/ih5rgc0vf",
    "title": "Private hospital giant Healthscope falls into receivership",
    "publish_date": "Mon, 26 May 2025 10:09:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Private hospital giant Healthscope falls into receivership\n\nPublished 26 May 2025, 8:45 am\n\nHealthscope, one of Australia’s largest private hospital groups has collapsed. The company has 37 hospitals across the country and employs around 20,000 people. Its owner, Canadian private equity group Brookfield, has been struggling to pay back $1.6 billion to creditors.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/energy-bills-to-increase-up-to-10-per-cent-from-july-1st/zurhk2wmc",
    "title": "Energy bills to increase up to 10 per cent from July 1st",
    "publish_date": "Mon, 26 May 2025 10:02:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Energy bills to increase up to 10 per cent from July 1st\n\nPublished 26 May 2025, 8:43 am\n\nWith winter setting in, Australians have been told they will soon be paying more for electricity from July 1. Queensland, NSW and South Australian residents can expect a 3 per cent to 10 per cent increase on their annual bills.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/national-sorry-day-remembering-australias-dark-history-of-the-stolen-generations/8ypdllead",
    "title": "National Sorry Day: remembering Australia's dark history of the Stolen Generations",
    "publish_date": "Mon, 26 May 2025 09:46:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "National Sorry Day: remembering Australia's dark history of the Stolen Generations\n\nPublished 26 May 2025, 8:41 am\n\nEvents have been held around the country marking National Sorry Day, an acknowledgement of the forced removal of First Nations children from their families and culture. One third of First Nations people are descended from Stolen Generations survivors. Today, many gathered to share their experiences with each other and the broader public.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/reflection-and-a-call-for-action-on-national-sorry-day/ab0v33uvu",
    "title": "Reflection, and a call for action, on National Sorry Day",
    "publish_date": "Mon, 26 May 2025 08:47:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOn the traditional land of the Dharug people at Parramatta, in western Sydney... one of many ceremonies held across the country to mark the 28th National Sorry Day, and remember the history of the Stolen Generations.\n\n\n\n\n\n\"One of my grandmothers was taken from up north and we had no idea where she was from for 100 years, for four generations. So all of the newly identified brothers and sisters, I feel you. For all the families that are reconnecting to their own motherlands, I want you to know that I see you.\"\n\n\n\n\n\nThat's the voice of Jie Pittman, speaking at the event in Parramatta, an area where the first school for Aboriginal children was built in 1814.\n\n\n\n\n\nDharug knowledge holder Julie Jones Webb says the trauma of the Stolen Generations is embedded in this institution's history.\n\n\n\n\n\n\"What they didn’t tell us is when we put our children in the Parra Native Institution that on those documents that we couldn’t read is that our ancestors marked an X on was a notation that we would never, ever, be able to take our children back home again.\"\n\n\n\n\n\nSorry Day marks 28 years since the landmark Bringing Them Home report was tabled in federal parliament.\n\n\n\n\n\nThe report detailed how thousands of First Nations children were forcibly removed from their families under what was government policy.\n\n\n\n\n\nMr Pittman says Sorry Day is a chance for all Australians to confront this history and the harm caused.\n\n\n\n\n\n\"Acknowledgement is our economy and the knowledge of what we know. To have so many more Australians in acknowledging helps with the next steps of healing.\"\n\n\n\n\n\nThere are around 17,000 stolen generations survivors.\n\n\n\n\n\nAttendants at the Parramatta event were encouraged to join dance and weaving workshops, to celebrate the strength and survival of Aboriginal and Torres Strait Island people and culture, and keep culture alive for future generations.\n\n\n\n\n\nIn Brisbane, song and dance were part of Sorry Day events, too.\n\n\n\n\n\nSharron Mirii Bell, founder of Aboriginal organisation Indigenous Insights attended the event.\n\n\n\n\n\nShe says the removal of children has caused immeasurable damage.\n\n\n\n\n\n\"I have no idea how anyone in their right mind would ever think that it would be a possibility, or an idea, to take babies away from their families, their homelands, from their language, their food source, their connection to country.\"\n\n\n\n\n\nThe Bringing them Home report handed down 54 recommendations to support reconciliation for our Stolen Generations, and 28 years on - only 6 per cent of them have been implemented.\n\n\n\n\n\nFirst Nations children still make up around 45 per cent of those in out-of-home care, despite making up 7 per cent of the children's population.\n\n\n\n\n\nAs Australia marks National Sorry Day it also marks the beginning of reconciliation week, which runs until the 4th of June.\n\n\n\n\n\nFormer minister for Indigenous Australians Ken Wyatt says it's a chance for politicians to recognise that concrete action is needed to address ongoing disadvantage.\n\n\n\n\n\n\"It doesn't matter which government is in, I've seen over my lifetime, governments talk about the issues of need, the gaps, the levels of disparity, the incarceration rates, and when they're in opposition they're very strong on some of that language. But what I;m also seeing in that period, is when in government, Aboriginal affairs is not the priority.\"\n\n\n\n\n\nAboriginal elder Tom Calma says reconciliation is facing a battle for support from politicians and public alike, especially after last year's failed Voice to parliament referendum.\n\n\n\n\n\nBut he says the movement for reconciliation is growing stronger, and needs continued support.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/adf-to-assist-nsw-flood-recovery-as-ex-rugby-league-player-returns-to-devastation/ex7k41ik3",
    "title": "ADF to assist NSW flood recovery as ex-rugby league player returns to 'devastation'",
    "publish_date": "Mon, 26 May 2025 06:57:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "The army has been dispatched to help with a mammoth clean-up effort after flooding wiped out at least 400 homes on Australia's east coast.\n\n\n\n\n\nPrime Minister Anthony Albanese said Australian Defence Force personnel would be dispatched from Tuesday to help with recovery and clean-up efforts.\n\n\n\n\n\n\"The presence of ADF personnel on the ground brings enormous confidence to communities that are really doing it tough,\" he told reporters on Monday.\n\n\n\n\n\n\"It's a sign of how seriously we, as a nation, are taking what is a catastrophic event.\"\n\n\n\nEx-rugby player lending a hand\n\nFormer rugby league player Matt Adamson is among the volunteers helping flood-affected communities in NSW.\n\n\n\n\n\nBorn in Taree on the mid-north coast, which has borne the brunt of deadly floods, Adamson described the area around the town as \"devastation\".\n\n\n\nEx-rugby league player Matt Adamson said he felt \"emotional\" witnessing the flood damage in his hometown. Source: SBS News / SBS The ex-Penrith Panthers star drove overnight down from the Sunshine Coast in Queensland to help with the clean-up and said he felt \"emotional\" seeing the aftermath of the floods firsthand.\n\n\n\n\n\n\"It was a beautiful place to grow up and be raised as a young kid. So there are a lot of good memories and fond memories,\" he told SBS News.\n\n\n\n\n\n\"So to come back and lend a hand here, I think, is really important. And I'm sure there are plenty of other people who are doing the same.\"\n\n\n\nREAD MORE Around 50,000 remain cut off as NSW flood recovery crews confront mammoth challenge\n\nGreater support needed\n\nOn his drive down from Queensland, Adamson bought rakes, gumboots, and other much-needed supplies for the locals.\n\n\n\n\n\nHe plans to stay in Taree for three days, helping in any way he can before returning to his family.\n\n\n\n\n\n\"There's greater support needed. Just the fundamentals like tools and gumboots and just simplistic things like that,\" he said.\n\n\n\nAlbanese told communities affected by floods that all three levels of government \"have got your back\".\n\n\n\n\n\nHe confirmed 70 Australian Defence Force personnel would be on the ground on Tuesday, ready to assist locals along the mid-north coast.\n\n\n\n\n\nA team of 100 Disaster Relief Australia workers would also be operating in the area by the end of the week.\n\n\n\n\"They will be involved in clean-up, in debris removal, in welfare checks and re-establishing critical infrastructure that is so important for these communities,\" Albanese said.\n\n\n\n\n\nA Disaster Recovery Allowance of up to 13 weeks in income support will be available for affected communities from Monday.\n\n\n\n\n\nMore than 32,000 people remained isolated by floodwaters on Sunday evening, and about 400 properties have been deemed inhabitable or destroyed, according to the NSW State Emergency Service.\n\n\n\nBut communities could face a new weather threat in the coming days.\n\n\n\n\n\nA cold front with strong winds of 60 to 80km/h due on Monday and Tuesday could hamper recovery efforts, cause damage and bring down trees, the Bureau of Meteorology has warned.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-26-may-2025/ea9xzp61p",
    "title": "Army helps with flood relief in NSW | Evening News Bulletin 26 May 2025",
    "publish_date": "Mon, 26 May 2025 06:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points 70 ADF members fly into NSW flood zones\n\n12 die in largest air strike on Kyiv\n\nMatildas ready for Argentina friendly\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nSeventy Australian Defence personnel are preparing to join recovery efforts in New South Wales, after more than 300 properties were destroyed by flooding.\n\n\n\n\n\nAn estimated 10,000 properties were hit by floods in the Hunter and mid-north coast regions, after a month's worth of rain fell in a matter of days.\n\n\n\n\n\nFrom Monday, those who have lost income from the flooding will be able to apply for financial support via My Gov online.\n\n\n\n\n\nMinister for Emergency Management, Kristy McBain, says the government will support those who have lost in the floods.\n\n\n\n\n\n\"I think it's really important to again reiterate, at a time of disaster, the Australian people need to come together, and that is what you will see, modelled from the Prime Minister all the way down to the local Mayor.\"\n\n\n\n-—\n\n\n\n\n\nNew South Wales Premier Chris Minns says personal hardship payments of $180 per individual or $900 per household will soon be available to residents in flood-affected communities.\n\n\n\n\n\nHe says it has been devastating to see the damage firsthand over the last few days in Taree, Maitland, Raymond Terrace and Gillieston Heights.\n\n\n\n\n\n\"Residents are going to do it very tough - not just in the next few days, but in the next few weeks. This is a major massive clean-up - one of the largest clean-ups in New South Wales history. I also want to announce that recovery centres will be located in five locations. They can help with replacing ID, legal assistance, insurance - particularly insurance applications; and crucially at a time like this, mental health support as well.\"\n\n\n\n---\n\n\n\n\n\nA resolution on whether the Nationals can rejoin with the Liberals - resuming their Coalition agreement could come as early as today.\n\n\n\n\n\nNationals party room expected to meet on Monday or Tuesday, as talks continue.\n\n\n\n\n\nThe Nationals last week announced an end to the Coalition agreement, citing disagreement over four policy demands.\n\n\n\n\n\nFormer Nationals leader and sitting Riverina MP Michael McCormack, who was part of a minority that did not support the Coalition break-up, says he hopes the partnership can be repaired.\n\n\n\n---\n\n\n\n\n\nAn interim ban on the sale of machetes will take effect across Victoria from Wednesday noon after a gang fight shut down a major Melbourne shopping centre.\n\n\n\n\n\nShoppers were sent running from Northland Shopping Centre in Melbourne's north on Sunday afternoon, after a violent brawl erupted between rival gangs armed with machetes.\n\n\n\n\n\nWhile an Australian-first ban on carrying a machete in public won't be brought forward from September 1, an interim ban on machete sales will be imposed.\n\n\n\n\n\nVictorian Premier Jacinta Allan says the decision not to fast track the ban was based on advice from Victoria Police.\n\n\n\n\n\n\"I also want to be clear that there will be no exemptions to allow the sale of machetes during this ban period. It's a total ban on all sales everywhere, right across Victoria, and we're doing this today as quickly as possible, because we must never let the places where we gather, the places where families come together to meet, to shop, to enjoy the peace of their weekend, become the places we fear.\"\n\n\n\n---\n\n\n\n\n\nGeneral Practitioners in New South Wales will soon be able to treat and diagnose ADHD, in changes aimed at addressing barriers to the often expensive and lengthy process.\n\n\n\n\n\nAn ADHD diagnosis can be lifechanging, but the costs of assessment and diagnosis can cost upwards of $5000.\n\n\n\n\n\nOngoing treatment with a psychiatrist can cost $500 every few months.\n\n\n\n\n\nUnder new changes, GPs across the state will be able to provide ongoing prescriptions for those already diagnosed and a smaller number will be able to diagnose and initiate medication.\n\n\n\n\n\nNew South Wales Health Minister Ryan Park says this is what the community has asked for.\n\n\n\n\n\n\"We have heard loud and clear that this is an issue when it comes to ADHD. We've also heard loud and clear that GP's can play an important role in the solution of this problem.\"\n\n\n\n---\n\n\n\n\n\nAt least twelve people have been killed and dozens injured, in what is being described as Russia's largest aerial attack of the war on Ukraine so far.\n\n\n\n\n\nRussian forces have launched 367 drones and missiles at Ukrainian cities, including Kyiv, in attacks Ukrainian officials say killed three children.\n\n\n\n\n\nUkrainian President Volodymyr Zelenskyy has made calls on social media for the US to speak out against the attack.\n\n\n\n\n\nUS President Donald Trump says he is absolutely considering putting sanctions on Russia.\n\n\n\n\n\n“Yeah, I'll give you an update. I'm not happy with what Putin's doing. He's killing a lot of people. And I don't know what the hell happened to Putin. I've known him a long time. Always gotten along with him. But he's sending rockets into cities and killing people, and I don't like it at all. Okay? We're in the middle of talking, and he's shooting rockets into Kyiv and other cities. I don't like it all.\"\n\n\n\n---\n\n\n\n\n\nTo sport now, the Matildas will feed off the energy of their trio of UEFA Women's Champions League winners, as they look to celebrate interim coach Tom Sermanni's 150th match in style.\n\n\n\n\n\nSermanni will lead Australia for the 150th time when the Matilda's host Argentina at Marvel Stadium on Friday night, in the first of two international friendlies.\n\n\n\n\n\nArsenal stars Caitlin Foord, Steph Catley and Kyra Cooney-Cross are set to arrive in Melbourne fresh off their historic 1-0 triumph over Barcelona in Lisbon.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/state-wide-reform-to-improve-adhd-diagnosis-and-treatment/2y89x3ysf",
    "title": "'Life-changing': The state-wide reform intended to improve ADHD diagnosis and treatment",
    "publish_date": "Mon, 26 May 2025 03:34:36 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "General practitioners in NSW will soon be able to diagnose and treat people with attention deficit hyperactivity disorder (ADHD) under reforms announced by the state government.\n\n\n\n\n\nThe Royal Australian College of General Practitioners (RACGP) and ADHD advocates have backed the reforms, unveiled on Monday, making NSW the third state to move on implementing changes to improve treatment access.\n\n\n\n\n\nADHD is a neurodevelopmental condition that can affect both children and adults. Over one million, or an estimated one in 20, Australians live with ADHD.\n\n\n\n\n\nA recent Senate inquiry found factors such as where people live, cost, stigma, gender and cultural and linguistic background, along with different prescribing regulations across states and territories, was impacting access to assessment and support.\n\n\n\nCurrently, most people seeking a diagnosis, management and ongoing prescription for ADHD must see a specialist — a psychiatrist for adults and a paediatrician for children.\n\n\n\n\n\nThis is often extremely expensive and many patients wait months or years for a diagnosis, or can't access treatment at all, the NSW government said.\n\n\n\n'Hoping to break the cycle'\n\nUnder the reforms, up to 1,000 GPs will be able to provide ongoing ADHD prescriptions for children and adults who are on stable doses of medication.\n\n\n\n\n\nA smaller number of GPs will be able to diagnose and initiate medication where appropriate.\n\n\n\n\n\nUnder both scenarios, GPs will need to undertake accredited training and will receive support, the government said.\n\n\n\n\n\nNSW Premier Chris Minns said the government is \"hoping to break the cycle of people having to wait years for, what can be, a life-altering diagnosis\".\n\n\n\nMental Health Minister Rose Jackson said the reforms are the \"much-needed relief\" families have been hoping for.\n\n\n\n\n\n“This is about fairness — saving families hundreds of dollars and giving them quicker access to the help they need, without the long, expensive wait for a specialist,\" she said.\n\n\n\n\n\n“Too many families are stuck waiting, paying, and struggling to access basic ADHD support — especially in the regions. That’s not just frustrating, it’s fundamentally unfair.\"\n\n\n\n\n\nFor children and families managing ADHD, she said the difference between getting help now and waiting years \"can be life-changing\".\n\n\n\nNSW follows Queensland, Western Australia\n\nUnder Queensland legislation, GPs can prescribe certain medications for children under the age of 18 to treat ADHD without approval.\n\n\n\n\n\nAhead of the WA state election in March, the government reportedly proposed reforms allowing specialist GPs to diagnose and treat patients, along with additional training in ADHD diagnosis and management.\n\n\n\nLast December, the federal government adopted one of the Senate inquiry report's recommendations, to expedite the development of uniform prescribing rules to ensure consistency across state and territory jurisdictions.\n\n\n\n\n\nThis was one of 15 recommendations made by the committee. The government gave \"in principle\" support to nine others.\n\n\n\n'Life-changing impacts'\n\nRACGP NSW & ACT chair Dr Rebekah Hoffman said she has heard about families in rural areas travelling more than seven hours to see a paediatrician, and families in Sydney spending more than $5,000 on assessments and diagnosis.\n\n\n\n\n\n“This announcement will have life-changing impacts when it comes to accessing timely and affordable ADHD care for families across the state,\" she said.\n\n\n\n\n\nShe said early intervention is vital, and enabling GPs with specific skills to start prescriptions for ADHD medications \"will stop many children from languishing on outpatient waiting lists\".\n\n\n\n\n\n“GPs in many parts of Australia, and around the world, are already diagnosing ADHD and prescribing medications. Our colleagues in Queensland, for example, have been safely prescribing ADHD medications since 2017.\"\n\n\n\nThe Australasian ADHD Professionals Association (AADPA) welcomed NSW's reforms, which it says will improve access to care, cut waiting times and bring down costs.\n\n\n\n\n\nHowever, it stressed that education and accuracy must remain central to the rollout.\n\n\n\n\n\n“The expansion of GP roles in ADHD care is a positive and necessary step — but it’s essential that we keep accurate diagnosis at the heart of this process. Getting it right matters for every child, every adult, and every family involved,” said AADPA president, professor David Coghill.\n\n\n\n\n\nThe NSW government will seek expressions of interest from GPs to undertake education and training, funded by NSW Health, in the coming months.\n\n\n\n\n\nThe reforms will be introduced in stages, with GPs expected to be able to provide ongoing prescriptions for children early next year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/sport/afl/too-many-plodders-have-the-blues-already-peaked-or-can-they-save-their-season-20250527-p5m2g3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Too many plodders’: Have the Blues already peaked, or can they save their season?",
    "publish_date": "Tue, 27 May 2025 11:58:43 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "When Michael Voss was appointed coach of Carlton after two middling full seasons under David Teague, then Carlton president Luke Sayers said the three-time Brisbane premiership skipper, also an experienced assistant and senior coach, had the attributes needed to fulfil the untapped potential on the Blues’ list.\n\n“We have done that [coaching change] because we believe, right at this period of time, that Michael is the best leader and the best coach to get what we believe is the untapped potential within our playing group,” Sayers, flanked by chief executive Brian Cook and Voss, said.\n\n“Michael is a person of great integrity, of great values. He knows what success and high-performance looks and feels like and, if you strip it back, he is a real people’s person with good EQ and very good relational skill sets, and when we look at our list, we think our list is really poised for great things when married up with those attributes and those skill sets which Vossy has in spades.”\n\nWhat next: Blues coach Michael Voss has much to ponder over the mid-season bye. Credit: AFL Photos\n\nSayers made those comments in September 2021. Three-and-a-half seasons later, the potential of the Blues’ list remains just that – untapped.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/haas-to-play-as-crichton-misses-nsw-captain-s-run-20250526-p5m2dc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Haas to play as Crichton misses NSW captain’s run",
    "publish_date": "Tue, 27 May 2025 11:58:40 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Blues prop Payne Haas has been cleared to play in Wednesday’s Origin series opener while Blues officials will wait until match-day morning to make a final call on Stephen Crichton’s fitness after the Bulldogs centre sent an injury scare through the camp on Monday.\n\nNSW coach Laurie Daley said on Tuesday he was weighing up whether to train behind closed doors for the remainder of the series – without any public or media in attendance – after footage was published by this masthead showing Crichton hobbling from the paddock with a quad injury.\n\nNSW rounded out their preparations on a balmy morning at Suncorp Stadium, with the immediate concern the availability of right centre and Canterbury captain Crichton.\n\nSouth Sydney’s Campbell Graham, who has been in camp all week, will start the game if Crichton is ruled out.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/it-s-a-big-part-of-my-life-injury-plagued-wallaby-confirms-his-future-20250527-p5m2gs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was devastated’: Wallabies star reveals turmoil upon announcing his future",
    "publish_date": "Tue, 27 May 2025 11:54:59 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Injury-plagued Wallabies centre Josh Flook has cast aside a tumultuous year on the field to ink a contract extension with the Queensland Reds.\n\nFlook hoped for a career-defining campaign in 2025.\n\nBut after the 23-year-old scored twice while making two linebreaks in the Reds’ round-three triumph of the Western Force, he was taken from the field, initially believing the injury was not a major concern.\n\nJosh Flook is tackled during a Bledisloe Cup match against the New Zealand All Blacks. Credit: Getty Images\n\nScans revealed a ruptured tendon, which has kept him out of the game ever since.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/swimming/clowns-juggling-knives-clean-swimmers-face-bans-if-they-compete-at-enhanced-games-20250527-p5m2hh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Clowns juggling knives’: Clean swimmers face bans if they compete at Enhanced Games",
    "publish_date": "Tue, 27 May 2025 11:48:25 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "The world’s best swimmers have been warned they could face bans from future competitions if they take part in the Enhanced Games - even if they compete clean.\n\nWorld Aquatics, the global governing body for swimming, has likened the proposed event to “clowns juggling knives” and is threatening to sanction any athlete who takes part, regardless of whether they use performance-enhancing drugs.\n\nTwo-time Australian Olympian James Magnussen, one of the public faces of the Enhanced Games, has publicly urged reigning Olympic champion Cam McEvoy to race at the inaugural event in Las Vegas next May.\n\nThe Enhanced Games plans to pit drug-enhanced athletes against clean Olympians — and is offering huge financial incentives to lure them in, including $US1 million ($AUD1.55 million) for breaking the men’s 50m freestyle world record.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/the-best-places-to-stay-in-rome-20230330-p5cws7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The best places to stay in Rome",
    "publish_date": "Tue, 27 May 2025 11:40:21 +1000",
    "category": "lifestyle",
    "authors": [
      "Maria Pasquale"
    ],
    "text": "Hotel Viminale Perfect for: Stylish professionals, fashionable couples, smart city escapes\n\nPart of the Bzar Hotels group, the Hotel Viminale embodies the kind of elegant, older-hipster trendiness of its home neighbourhood of Monti. The recently restored property opts for a neutral palette of creamy, buttery tones which complement the high ceilings, large windows and neoclassical features of the building, while also adding just enough contemporary touches and modern conveniences to keep things interesting. The result is a smartly seductive option in a cool and convenient location, ideal for a fun yet sophisticated Roman holiday.\n\nFrom €145 a night. Via Cesare Balbo, 31, 00184. Phone: +39 06 8403 0333. See hotelviminalerome.com Mama Shelter\n\nPerfect for: Young hip couples, party fiends, families with teenagers\n\nThe Mama Shelter crew has properties all over Europe and their Roman outpost near the Vatican keeps the brand’s hip signature style with plenty of bright colours, design-led decor and pattern-clashing fabrics. The vibe is fresh and fun, with the hotel’s restaurant and communal areas hosting a packed calendar of onsite events varying from themed brunches to disco nights and DJ sets. When it’s time for a moment of peace head up to the lovely rooftop bar or chill out in the spa and pool.\n\nFrom €185 a night. Via Luigi Rizzo, 00136. Phone: +39 06 9453 8900. See mamashelter.com/roma Villa Spalletti Trivelli Perfect for: Honeymooners, aristocratic charm, old-world luxury\n\nWalking into Villa Spaletti Trivelli is like walking into a perfectly preserved historic palazzo, complete with antique furniture, wall-hung tapestries and sumptuous decor. The stately villa is a romantic hideaway in the heart of town and thoroughly spoils its guests with fabulous service and beautifully furnished rooms, suites and apartments. Pamper yourself at the tranquil wellness centre then head up to the newly refurbished rooftop terrace where you can recline with a classy cocktail or take a dip in the jacuzzi.\n\nFrom €410 a night. Via Piacenza 4, 00184: Phone: +39 06 4890 7934. See villaspalletti.it W Rome\n\nPerfect for: Well-heeled creatives, fun-loving families, fashionistas\n\nThe Marriot’s punchy offshoot brand packs its 19th century palazzo with a fresh decor and a funky attitude which draw a different type of jet set to the Via Veneto area, historically home to more classic “grand dame” luxury hotels. In the warmer months, head up to the rooftop and feast on pizzas by one of Rome’s best, Pier Daniele Seu at ‘Seu Pizza con Vista’ (Seu Pizza with a View). From the relaxed lounge in place of a formal lobby, modern welcome desk pods and a hidden door leading to a charming secret garden, the W is full of surprising, theatrical elements that appeal to a lively younger crowd.\n\nFrom €440 a night. 26/36, Via Liguria, 00187 Rome. Phone: +39 06 894121. See marriott.com Corso 281 Perfect for: Stylish shoppers, small families, wine connoisseurs\n\nIn sharp contrast to some of Rome’s overly fussy five-star offerings, Corso 281’s quiet sophistication and restrained monochrome colours offer an altogether more demure upscale sojourn. Everything here is fine-tuned, from your preferred pillow type to your breakfast order served in room, while the basement caveau packed with rare labels and prized vintages will please even the snobbiest of wine connoisseurs. Add a super-central location and this is a great choice for those looking for discreet luxury without in-your-face opulence.\n\nFrom €400 a night. Via del Corso 281, 00186. Phone: +39 06 8780 9370. See corso281.com\n\nHotel Eden Perfect for: Old luxury, well-to-do families, special occasions\n\nThe Dorchester Collection’s Eden is a sure bet for classic old-school luxury, faultless service and sumptuous refinement with just the right amount of high-end pizazz. Everything feels expensive and there is a sense of hushed affluence throughout, with soft creamy hues, luxury fittings and lashings of marble and gold, along with flash technology. There is also an award-winning spa and wellness centre and a Michelin-starred top-floor restaurant, La Terrazze run by award-winning chef Salvatore Biano, which boasts an incredible view over the city. Despite the luxe, families are well catered for with large family suites, special family rates and children’s welcome gifts on arrival.\n\nFrom €1060 a night. Via Ludovisi 49, 00187. Phone: +39 06 478121. See dorchestercollection.com The Glam\n\nPerfect for: Smart city-breakers, couples, culture hounds\n\nFor a sassy short city break, the Glam ticks all the boxes. The location on busy Via Nazionale is well-placed for sightseeing while the cute wine bars and artsy cobbled streets of Monti lie just around the corner. Inside the mood is calm, mature and boutiquey; modern decor in black and white is punctuated with warm, rich tones of aubergine and chartreuse. A cute rooftop bar and restaurant, complete with jacuzzi, add a lot of value and a lot of fun.\n\nFrom €167. Via Nazionale 82, 00184. Phone: +39 06 9934 5430. See theglamhotelroma.it Margutta 19 Perfect for: Art fiends, romantics, older sophisticates\n\nLocated on pretty Via Margutta, once the haunt of Rome’s artist community, this swish collection of 16 chic suites forgoes flashiness for a more composed version of luxury. There is a tasteful eye for style throughout, from the art nouveau-inspired lobby to the handsome rooms decorated in warm shades of ochre, cream and deep chocolate. Backing onto the verdant climes of the Pincio hill and boasting a beautiful secret garden restaurant, the ambience is one of secluded tranquillity and cultured affluence.\n\nFrom €440. Via Margutta 19, 00187. Phone: +39 06 9779 7979. See romeluxurysuites.com Babuino 181\n\nPerfect for: Shopaholics, short stays, business travellers\n\nFor a five-star feel without the hefty price tag look no further. Babuino 181 gives its guests the feeling of city living; step straight out onto Via del Babuino, an elegant boutique-lined thoroughfare well-placed for exploring Rome’s centre. Inside the mood is bright, light and contemporary, and while it lacks the extra amenities of swankier hotels, there is a cute rooftop bar for breakfast and drinks. Add the great location and well-thought-out details, and it hits the mark for smart style on a budget.\n\nFrom €215. Via Babuino 181, 00187. Phone: +39 06 3229 5295. See romeluxurysuites.com Soho House Perfect for: Design fiends, creative networkers, media types\n\nSnazzy members-club Soho House opened its Roman outpost in 2021, choosing the hipster-esque San Lorenzo district as its home. The purpose-built 10-storey hotel exudes cosmopolitan creativity with an aesthetic that blends avant-garde art with retro panache and a subtle nod to 1950s dolce vita. There’s a hi-tech spa, art gallery space and cinema room but the place to be is the rooftop where you can soak up 360-degree views of the city from the bar, restaurant and pool.\n\nFrom €310 . Via Cesare di Lollis 14, 00185. Phone: +39 06 9480 8000. See sohohouse.com\n\nHotel Hassler Perfect for: Iconic location, timeless grandeur, five-star service\n\nA self-titled ‘stairway to heaven’, the Hassler’s fabulous location at the top of the Spanish Steps certainly gives the impression that you are looking down on the Eternal City. A favourite of film stars, aristocracy and celebrities, this is luxury with a capital L, from the exquisite suites and beautifully furnished rooms, to the faultless service. The Michelin-starred Imago restaurant, with its floor-to-ceiling windows and panoramic views over the Roman rooftops is one of the city’s most magical dining experiences, also thanks to chef Andrea Antonini’s spectacular culinary creations.\n\nFrom €990. Piazza Trinità dei Monti 6, 00187. Phone: +39 06 699 340. See hotelhasslerroma.com Hotel de la Ville\n\nPerfect for: Laid-back luxury, moneyed movers and shakers, super-chic city stays\n\nPlayfulness and joie de vivre make the Hotel de la Ville textbook perfection in how to do light-hearted luxury. Housed in an impressive 18th century palazzo perched atop the Spanish Steps, the Grand Tour provides the theme throughout, with a few contemporary flourishes to keep things fresh. Rooms are adorned with heavy brocade and velvets, tempered with pale walls and lots of light, while the panoramic Cielo rooftop bar gives off easy-breezy Riviera vibes with its red-striped umbrellas. Design-lovers will adore the new inhouse Ginori café where the fresh, flavourful dishes are served on stunning Ginori porcelain and tableware.\n\nFrom €1290. Via Sistina 69, 00187. Phone: +39 06 977931. See roccofortehotels.com Chapter Roma Perfect for: Edgy Millennials, contemporary design fans, young couples\n\nRight on the border of the Jewish Ghetto and the Regola district, Chapter offers a dose of urban grit and edge tucked away from the crowds. Exposed brick walls and industrial elements jostle with vintage finds, artisanal accessories and bespoke furniture, all softened with block colours of dark green, tangerine and coral. Great service and a choice of drinking and dining locations make this great value if you want a luxury feel without breaking the bank.\n\nFrom €200. Via di S. Maria de’ Calderari 47. Phone: 00186. +39 06 8993 5351. See chapter-roma.com The Hoxton",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/money/planning-and-budgeting/this-simple-piece-of-planning-could-prevent-nasty-inheritance-disputes-20250527-p5m2ix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to avoid inheritance fights? Just take after the cardinals",
    "publish_date": "Tue, 27 May 2025 11:38:31 +1000",
    "category": "finance",
    "authors": [
      "Noel Whittaker"
    ],
    "text": "Wasn’t it fascinating to watch the Papal conclave over recent weeks? The producers of the movie Conclave must have been counting their blessings, as viewers were drawn to their fictionalised version just as the real event was unfolding.\n\nIt made me think that many families go through their own kind of conclave after the death of a parent. There might be a will appointing an executor – hopefully – but what if that person is no longer suitable, perhaps due to ill health, estrangement, or simply being overwhelmed?\n\nThe papal conclave lasted just two days and involved 133 experienced cardinals. A family conclave may be far less public, but it can be just as fraught. Credit: AP\n\nThe papal conclave lasted just two days and involved 133 highly educated and experienced cardinals. Throngs packed St Peter’s Square and millions watched online.\n\nA family conclave may be far less public, but it can be just as fraught. Someone has to arrange the funeral, draft the death notice, and write the eulogy – often amid simmering tensions. These decisions can be especially sensitive in blended or second families, where loyalties and histories collide.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-advance-global-stocks-rise-on-trump-s-tariff-delay-20250527-p5m2f9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX trades sideways; Telstra and IAG slip",
    "publish_date": "Tue, 27 May 2025 11:34:20 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporters"
    ],
    "text": "The Australian sharemarket had a flat start on Tuesday, while European markets gained in their first session trading after President Donald Trump extended a deadline on his aggressive euro area tariffs, leaving markets guessing yet again by making trade threats before backtracking.\n\nThe S&P/ASX 200 was up 6.4 points, or less than 0.1 per cent, at 8367.40 as of 11.12am AEST, swinging between narrow gains and losses in the first hour of trading as gains by energy and IT stocks were offset by declines in utilities. The local market edged up by 0.1 per cent on Monday.\n\nThe Australian dollar dipped overnight after hitting six-month highs on Monday, but was 0.1 per cent higher at 64.94 US cents at 11.12am AEST.\n\nEuropean markets took centre stage with Wall Street closed. Credit: Getty Images\n\nEnergy stocks were the morning’s best performers so far, with oil and gas giants Woodside and Santos up 0.8 per cent and 0.6 per cent, respectively, as oil prices steadied, with the market weighing the prospect for easing trade tensions between the European Union and the US ahead of an OPEC+ meeting that will decide on supply policy. Oil has trended lower since mid-January on concerns around the fallout from Donald Trump’s trade war, with a push by the oil cartel to restore idled supply adding to the headwinds.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-transport-minister-made-a-safety-promise-four-days-later-it-was-torn-apart-20250516-p5lzrz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The transport minister made a safety promise. Four days later, it was torn apart",
    "publish_date": "Tue, 27 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Daniel Lo Surdo"
    ],
    "text": "Transport bureaucrats circulated secret plans to slash improved safety measures at a major Sydney intersection four days after the then-minister gave public assurances that no such cuts would be made, casting aside expansive upgrades promised as a condition of WestConnex four years ago.\n\nAn internal presentation shared on November 14 laid bare plans to remove or weaken at least 14 of the 33 featured upgrades for Sydney Park Junction, at the intersection of St Peters, Erskineville and Alexandria, despite then-transport minister Jo Haylen’s office confirming on November 10 that the upgrades would go ahead as promised in 2021 after Transport for NSW’s first attempt to slash upgrades in August.\n\nPlans to slash the upgrades were circulated four days after then Transport Minister Jo Haylen (right) promised cuts wouldn’t be made, after she and senior minister John Graham (left) were urgently briefed on the matter. Credit: Monique Westermann\n\nThe new tranche of documents, obtained by the Herald, reveal the latest proposed cuts to Sydney Park Junction, including the removal of a pedestrian and bicycle crossing once touted as a centrepiece of the upgrades. This would represent another broken promise for an inner-city community seeking safer active transport links.\n\nAn extended cycleway and new bus shelter are among the other upgrades on the chopping block, while plans for widened footpaths and raised pedestrian crossings have also been toppled as a proposal for increased car parking on Sydney Park Road is preferred.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/world/annual-cheese-rolling-race-in-uk-20250527-p5m2js.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Annual cheese rolling race in UK",
    "publish_date": "Tue, 27 May 2025 11:18:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Annual cheese rolling race in UK\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/afl/mid-season-draftee-linked-to-afl-great-20250527-p5m2jq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mid-season draftee linked to AFL great",
    "publish_date": "Tue, 27 May 2025 11:16:02 +1000",
    "category": "sports",
    "authors": [],
    "text": "Mid-season draftee linked to AFL great\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/world/europe/macron-downplays-video-showing-wife-pushing-his-face-away-20250527-p5m2ez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Macron downplays video showing wife pushing his face away",
    "publish_date": "Tue, 27 May 2025 11:03:40 +1000",
    "category": "finance",
    "authors": [
      "John Leicester"
    ],
    "text": "Paris: They were just play-fighting.\n\nThat was French President Emmanuel Macron’s explanation for video images that showed his wife, Brigitte, pushing her husband away with both hands on his face before they disembarked from their plane to start a tour of South-East Asia.\n\nThe moment quickly made headlines in France, with media trying to decipher the interaction that cameras spotted through the just-opened door of the plane. The headline of a story on the website of the daily Le Parisien newspaper asked: “Slap or ‘squabble’? The images of Emmanuel and Brigitte Macron disembarking in Vietnam trigger a lot of comments.”\n\nMacron later told reporters that the couple, married since 2007 after meeting at the high school where he was a student and she was a teacher, were simply joking around.",
    "source": "TheAge",
    "cluster_id": 31
  }
]