[
    {
        "url": "https://www.9news.com.au/finance/saving-rates-decrease-rba-interest-rate-cut/622b9073-248a-4cb8-afd6-e71817a36756",
        "title": "Millions slapped with rude side-effect of RBA rate cut",
        "publish_date": "Fri, 15 Aug 2025 05:36:27 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The Reserve Bank's interest rate cut earlier this week was widely welcomed, but millions of Australians are now starting to feel an unpleasant after-effect for their combined $1.6 trillion in savings.\n\nSeven banks have now cut the interest rate on their savings accounts, including Macquarie, NAB and Bank of Queensland – the latter of which had been offering a best-in-market 5.10 per cent to 14-to-35-year-olds.\n\n\"The third RBA rate cut of the year is already hitting savers in the hip pocket with NAB, Macquarie and BOQ all cutting key savings rates today, alongside some smaller banks,\" Canstar data insights director Sally Tindall said.\n\nNAB is one of several banks to have dropped its savings rates. (Ben Rushton/Fairfax Media)\n\n\"BOQ's rate has dropped back to 4.85 per cent, which will be disappointing for their customers who have sought out a market-leading rate to turbocharge their savings.\"\n\nIt leaves﻿ the vast majority of available rates now starting with a 4, and two of the three banks still offering 5 per cent – ING and Move – are yet to announce their response to the RBA's rate cut.\n\nThe one exception is Westpac, which said it will leave its savings rate for 18-to-29-year-olds on hold at 5 per cent.\n\nCommonwealth Bank and ANZ are still yet to announce a change to their interest rate for savers, although Canstar said they were likely to be cut next Friday.\n\nREAD MORE: This could be the final nail in the coffin for working in the office\n\n﻿ \"Once the August RBA rate cut filters through, know that a competitive ongoing savings rate is estimated to be 4.75 per cent and above, however, you'll have to be able to meet monthly terms and conditions to achieve this rate,\" Tindall said.\n\n\"We expect more savings rates will fall victim to this latest RBA cut in the weeks ahead, however, banks aren't likely to make a song and dance about them.\n\n\"Our rate tracker shows more than 60 banks have rushed to share the good news on mortgage rates, yet many banks are leaving their savings customers guessing.\n\n\"If your bank hasn't told you what's happening with your savings yet, don't wait – call, email, or even reach out on social media.\n\n\"It's your hard-earned money, and you have every right to know where your rate is headed.\"\n\nAs of July﻿, Australian households had about $1.6 trillion deposited with financial institutions, according to APRA.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/shane-warne-australia-cricket-heart-health/7407e74f-f9ee-4db6-9c0b-2451e073594d",
        "title": "How late Australian cricket legend is helping raise awareness for heart issues",
        "publish_date": "Fri, 15 Aug 2025 13:55:56 +0000",
        "category": "lifestyle",
        "authors": [
            "Aug"
        ],
        "text": "A campaign launched in memory of Shane Warne has helped uncover risk factors for heart disease in seven out of 10 Australians tested, a study has confirmed .\n\nThe Australian cricket legend died suddenly in Thailand in 2022 from a heart attack, with Shane Warne Legacy founded to create awareness of heart health.\n\nA study led by Monash University analysed over 76,000 people in Australia, with the Shane Warne Legacy Health Check reaching 300 communities and conducting checks at the Boxing Day Test match in Melbourne late last year.\n\nREAD MORE: Caribbean officials warn of heavy rains and big waves as Tropical Storm Erin nears\n\nShane Warne died in 2022 at the age of 52. (Getty)\n\nIt found nearly 70 per cent of people screened had at least one uncontrolled risk factor for heart disease and half of those with high blood pressure hadn't had a check in a year or more.\n\nRisk factors for heart disease include elevated blood pressure, being overweight or obese and smoking.\n\nDr Sean Tan from Monash University said the study proved how important screening programs like this are in helping people treat problems early.\n\n\"They identified thousands of Australians at risk, many of whom hadn't had a blood pressure check in the past year,\" he said.\n\nShane Warne's statue outside the Melbourne Cricket Ground, the location of the Boxing Day Test. (Scimex)\n\n\"Meeting people where they are, whether that's at their local pharmacy or the MCG, can make all the difference to health outcomes.\"\n\nThe study also found those living in rural areas tended to present higher rates of all risk factors, as well as being more likely to report diabetes than those in urban areas.\n\nIt highlights a need to make screening and testing more accessible to all areas of the country.\n\n\"This study shows us what's possible when you combine evidence-based screening with strong public engagement,\" Professor Stephen Nicholls from the Victorian Heart Institute said.\n\n\"We owe it to Australians to make health checks more accessible, more visible, and more frequent.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/health-star-rating-experts-say-system-has-failed-and-must-be-made-mandatory/83b69302-0008-4867-9151-37fb49a3c68b",
        "title": "Experts say the Health Star Rating system has failed. This is why",
        "publish_date": "Fri, 15 Aug 2025 21:18:25 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "More than 10 years after Health Star Ratings were first introduced, experts say the voluntary system has failed because manufacturers have not been obligated to use it.\n\n﻿The system, which was launched in 2014, rates the overall nutritional profile of a packaged food product from 0.5 to 5 stars.﻿\n\nCurrently just over a third of products (36 per cent) feature a Health Star Rating and, unsurprisingly, it's the 5-star products that are far more likely to feature the rating (61 per cent) compared to only 16 per cent of 0.5-star products.﻿﻿\n\nThe Health Star Rating is designed to help consumers make healthier choices by comparing similar products. (Getty)\n\n\"Voluntary uptake has failed,\" Dr Alexandra Jones, the head of Food Governance at The George Institute for Global Health said.\n\nShe said because the system was voluntary, it was applied \"selectively... often for marketing purposes﻿\".\n\n\"Fundamentally people understand the concept of stars and they can use it to make a better choice,\" she said.\n\n\"In the real world their ability to actually use it has been mostly limited ﻿by the fact that it's only on a third of products.\"\n\n﻿In 2019, a review of the system found consumers understood the system﻿ but it was not on enough labels to adequately compare similar products.\n\nThe Australian, New Zealand and state and territory governments then set the industry a series of targets in an effort to lift the uptake.\n\nThe final target, 70 per cent by November 2025, almost certainly will not be met.﻿\n\n\"Until it's mandatory, people will continue to struggle out there ﻿to understand how to make good choices,\" Dietitians Australia CEO Magriet Raxworthy said.\n\n\"Australians want easy, transparent nutrition information about the food they are choosing for themselves and their families, and mandating the system will bring more consistency and clarity across the shelves.\"\n\nJones said Food Standards Australia New Zealand (FSANZ) had been ordered to start the preparatory work for a mandatory system but she feared the timeline could blow out as far as 2029.\n\nExperts say the logo is applied selectively as a marketing tool, rather than health advice for consumers. (iStock)\n\n\"Now that we've had 10 years of voluntary operation we know a lot about how this system works and where it needs to be improved,\" she said.\n\n\"We don't want this to go on any longer than it has to.\"\n\nShe said mandatory country of origin labelling, which has seen an uptake of more than 90 per cent in a similar time frame, proved it was possible to implement a mandatory Health Star Rating system quickly.\n\n\"Rapid food labelling change is definitely possible when it is mandated,\" she said.\n\nA spokesperson from FSANZ confirmed preparatory work to inform future decision-making by food ministers on whether the Health Star Rating system should be mandated was underway.\n\n\"If the voluntary uptake target (70 per cent of intended products displaying the HSR by 14 November 2025) is not met, FSANZ's preparatory work will enable an efficient process for incorporating the HSR system into the Australia New Zealand Food Standards Code, should ministers ask FSANZ to consider mandating the system,\" the spokesperson said.\n\nHow does the health star rating system work?\n\nManufacturers input the nutritional information of their product on a government website, which uses an algorithm to calculate the Health Star Rating of the product.\n\n﻿The algorithm gives points for protein, fibre, fruits, vegetables, nuts and legumes and removes points for saturated fat, sugar and salt.\n\nProducts are given a rating between 0.5 and 5 stars.\n\nThe manufacturer can then choose whether to display the rating on their product or not.\n\nConsumers ideally then use the rating to compare similar products and ultimately make healthier choices.\n\nThe rating aligns with the Australian Dietary Guidelines﻿ and New Zealand Eating and Activity Guidelines.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/centr-chris-hemsworth-job-cuts-melbourne-office/86aa31d2-0005-4711-a184-a377631ab7eb",
        "title": "Chris Hemsworth's fitness app lays off Aussie staff, shifts to US",
        "publish_date": "Fri, 15 Aug 2025 02:46:29 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "A fitness app founded by Chris Hemsworth has laid off more than a dozen Australian staff and closed its Melbourne office in a shift to the US.\n\nCentr has long had headquarters in Melbourne and California, but is now moving operations almost entirely to the US, with just a handful of Australian staff to continue working remotely.\n\nA spokesperson for the company confirmed to 9news.com.au that it will no longer have a Melbourne office, and that 15 ﻿staff have been caught up in the transition.\n\nREAD MORE: This could be the final nail in the coffin for working in the office ﻿\n\nChris Hemsworth's fitness and wellness app is shutting its Melbourne office and laying off Australian staff. (Centr)\n\n\"As Centr continues to scale globally, we've made the strategic decision to consolidate operations in the US to improve operational and geographic efficiency,\" they said.\n\n\"This transition affects 15 roles, with a few team members continuing remotely as part of the US-based team.\n\n\"Centr remains focused on continued growth across its digital platform, performance-grade equipment, and global partnerships.\"\n\nDo you know more? Email daniel.jeffrey@nine.com.au\n\nThe company's digital general manager, Nick Robinson, said \"﻿Centr will continue to drive towards business goals by streamlining operations and seeking exceptional talent\".\n\nJust two years ago, Centr had claimed that its Melbourne office would \"continue to be the global hub for all content and customer service, and will also be home to all sales and marketing for Australia, New Zealand and Asia\".\n\nWhile the business was sold three years ago, Hemsworth has continued to be the face of Centr. (Centr)\n\nThat statement came after a previous round of lay-offs in Australia﻿ that saw around 20 staff lose their jobs.\n\nCentr was founded by Australian actor Hemsworth in early 2019, and has gone on to amass hundreds of thousands of subscribers and expand from a fitness and wellness app to also include an exercise equipment store.\n\nIn 2022, it was valued at about $290 million when it was bought by HighPost Capital, the private equity firm co-founded by Jeff Bezos's younger brother, Mark.\n\nHemsworth has continued to be the face of the business, which promotes itself as having \"Chris's vision as our foundation\".\n\n9news.com.au has approached Hemsworth for comment. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/premier-league-2025-26-when-does-epl-start-how-to-watch-australia-clubs-predictions-news-explained/d6995b50-d219-4bca-9284-a55988b6199a",
        "title": "Everything you need to know about the Premier League",
        "publish_date": "Fri, 15 Aug 2025 01:50:55 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "The Premier League is back! And for tens of thousands of football fans in Australia that means nine months of late nights and early starts following their favourite clubs.\n\nThis year the Premier League is set to be bigger than ever. For champions Liverpool , another title would put them one ahead than bitter rivals Manchester United .\n\nFor United, surely the season can't be any worse than last year - a title challenge is unlikely but stranger things have happened, after all, this season will mark ten years since Leicester City stunned the world by winning the championship.\n\nAnd what about Arsenal ? Is this finally their year. Spurs too have a huge fanbase in Australia, despite the decision to sack Ange Postecoglou.\n\nBut we understand not everyone is a diehard fan, so we've put together a quick guide to everything you need to know ahead of the new season.﻿\n\nLiverpool star Mohamed Salah will hope to lead the Reds to victory again. (AP)\n\nHow does the Premier League work?\n\nThe Premier League is made up of 20 football teams in England.\n\nEach season, three teams from the division below - called the Championship - are promoted and replace the three teams that finished in the bottom three places in the previous Premier League season.\n\nThe competition takes place in a round-robin format, where each team plays each other home and away in a 38-game season.\n\nThe team with the most points at the end of the season are crowned champions.\n\nWhich teams have been promoted to the Premier League in 2025-26 season?\n\nA couple of big teams are making their return to the Premier League this season.\n\nLeeds United are back after two seasons away; they are one of the best-supported clubs in England and have plenty of Aussie fans thanks to the exploits of Aussie stars Mark Viduka and Harry Kewell in the late 1990s and early 2000s.\n\nSunderland are also back in the Premier League for the first time since 2017; they became known around the world thanks to their Netflix documentary 'Sunderland Till I Die', which charted their struggles after relegation from the Premier League.\n\nBurnley round off the promoted teams, who replaced Southampton, Ipswich Town and Leicester City.\n\nLeeds United are back in the top flight, and will have a big following in Australia backing them. (Getty)\n\nWhich team is likely to win the 2025-26 Premier League?\n\nThe bookmakers currently back Liverpool to retain their Premier League title after spending big in the transfer market, including spending a whopping $222 million on German star Florian Wirtz.\n\nIt is most likely to be a three-horse race for the Premier League this season, with Liverpool set to battle Arsenal and Manchester City.\n\nArsenal have finished second three seasons in a row, but have made a couple of key signings, including Viktor Gyokeres, a striker who scored 54 goals last season.\n\nManchester City have arguably the best manager in the world in Pep Guardiola and the best striker in the world in Erling Haaland, and will be out for redemption after a tough season last time out.\n\nWhat is the 'big four' in the Premier League?\n\nThe big four are the four biggest teams by support in the Premier League, and have historically been the most significant.\n\nIt refers to Liverpool, Arsenal, Manchester United and Chelsea, who became part of the special group in the 2000s as they often finished in the top four positions.\n\nThis has been challenged in recent years by Manchester City and Tottenham Hotspur, with the moniker 'the big six' now used to describe the biggest sides in the league.\n\nFierce rivals Arsenal and Tottenham Hotspur are part of the now 'big six' of Premier League teams. (Getty)\n\nWhat is the new 2025-26 Premier League ball?\n\nThe new Premier League season is also significant because it is the first time in 25 years Nike will not be supplying the Premier League ball.\n\nInstead, a deal with Puma has begun, with the new 'Puma Orbita' set to be used this season.\n\nThe Premier League ball has a new look and new supplier this season. (Getty)\n\nWhen does the 2025-26 Premier League begin?\n\nThe new season gets underway tomorrow morning (AEST) when champions Liverpool host Bournemouth at Anfield.\n\n﻿On Saturday night, Aston Villa take on Newcastle in a game you can watch on Channel Nine at 9.30pm AEST as free-to-air Premier League football returns to Australia for the first time in six years.\n\nThe biggest game of the opening weekend sees Arsenal travel to face rivals Manchester United. That takes place on Tuesday at 2am AEST.\n\nThe season concludes on May 25, with all 10 games being played simultaneously.\n\nHow to watch the Premier League in Australia\n\nThe Premier League has a new home in Australia, with every match available live and on demand on Stan Sport . Nine, the publisher of this website, also owns Stan Sport.\n\nIn addition, one game for the first three rounds of the season will be shown on free-to-air television on Channel Nine.\n\nThese games will be Newcastle United's trip to Aston Villa on the opening weekend, Manchester City's heavyweight clash with Tottenham Hotspur, and Chelsea's local rivalry match against Fulham.\n\nThese three matches all begin at 9:30 pm (AEST).",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/working-from-home-now-includes-majority-of-full-time-employees-australia/19aa9280-40cc-439f-b18a-848205f00c3e",
        "title": "This could be the final nail in the coffin for working in the office",
        "publish_date": "Fri, 15 Aug 2025 00:55:01 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "More than half of Australia's full-time employees now spend part of their week working from home, with the proportion sharply rising in the cities.\n\nNew research from Roy Morgan has shown that more than 6.7 million Australians, or 46 per cent of the total employed population, work from home at least some of the time.\n\nThat proportion rises to 51 per cent for full-time employees, and falls to 36 per cent for part-time employees.\n\nMore Australians are working from home, especially in the cities. (Getty)\n\n\"﻿These latest Roy Morgan findings clearly show that 'work-from-home' arrangements have become a permanent and distinct feature of Australia's employment sector,\" Roy Morgan chief executive Michele Levine said.\n\nThe trend is concentrated in the capital cities, with a majority of workers in Sydney (55 per cent), Melbourne (52 per cent), and Canberra (51 per cent) working from home.\n\nThat falls to below half in Brisbane (43 per cent), Adelaide, (44 per cent), Perth, (40 per cent), and Hobart (45 per cent).﻿\n\nIn regional Australia, work-from-home rates are noticeably lower, with Queensland (40 per cent) having the highest level, followed by NSW (39 per cent), Victoria (36 per cent), the Northern Territory (34 per cent), South Australia (33 per cent) and Western Australia (31 per cent).﻿\n\nSmaller workplaces, ﻿especially solo workers or the self-employed, naturally have the highest working from home rates (55 per cent), while smaller businesses have the lowest (38 per cent for workplaces with five to 24 employees).\n\nThe industries with the most people working from home include finance and insurance (66 per cent), communications (61 per cent), property and business services (57 per cent), and public administration and defence (56 per cent).\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\nBy contrast, just 31 per cent of retail employees work from home, with other low-level sectors including recreation and personal services (37 per cent) and transport and storage (38 per cent).\n\nIncome also makes a difference, with work-from-home rates peaking at﻿ 64 per cent for those with a wage of $300,000 or more.\n\n\"Gaining an in-depth understanding of the nuances surrounding current 'working from home' trends across different cities, industries, workplace sizes and income bands is vital to understand as businesses, employees, and policymakers adapt to a rapidly changing workforce landscape,\" Levine said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/albany-homelessness-crisis-growing-smaller-houses-needed/105647560",
        "title": "Social housing groups flag smaller dwellings as crisis circuit breaker",
        "publish_date": "Sat, 16 Aug 2025 01:59:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The population of one of Australia's fastest-growing regional cities is rising as sea changers flock to the region.\n\nBut away from a coastline framed by million-dollar homes, a crisis is growing.\n\nCatherine Sawtell said four weeks ago she was staying in a house with rats under the floorboards and a possum in the roof.\n\nThe university-educated 64-year-old once owned her own home in Albany, 420 kilometres south of Perth, but became homeless in about 2019 when her marriage broke down.\n\nCatherine Sawtell has been battling homelessness since her marriage broke down. (ABC Great Southern: Andrew Chounding)\n\nShe bounced from refuge to shelter, sleeping on couches and in share homes, eventually moving to Queensland in 2021 to stay with a friend.\n\nMs Sawtell returned a year later to Albany, but affording a home in the coastal city on a disability pension proved impossible.\n\n\"I wanted to be in Albany, but the chances of getting a rental in Albany were nil,\" she said.\n\n\"I have an excellent rental record … I'm not on any blacklists or anything like that, but I couldn't get anything.\"\n\nMs Sawtell has a unit in a new affordable housing development. (ABC Great Southern: Andrew Chounding )\n\nSmall home solution\n\nAfter five years homeless, a social housing provider helped Ms Sawtell secure accommodation that allowed her to start rebuilding her life.\n\n\"I've only recently got the confidence back to get my licence back and then I got a little loan,\" she said.\n\n\"And I bought a little second-hand car, so I'm mobile now.\"\n\nHer two-bedroom home is one of 12 units designed by affordable housing provider Advance Housing with people like Ms Sawtell in mind.\n\nCatherine Sawtell has moved into one of 12 specifically built units in Albany. (ABC Great Southern: Andrew Chounding)\n\nChief executive John Lysaught said demand for social housing had risen by 30 per cent in the past 18 months, but much of the available stock was unfit for purpose.\n\nHe said fewer than 6 per cent of development approvals in the past five years were for one and two-bedroom homes, but almost 90 per cent of people on the social housing waiting list were seeking smaller dwellings.\n\n\"For pure social housing, there's over 750 eligible tenancies on the waitlist for the Great Southern, and over 570 of those are in Albany,\" Mr Lysaught said.\n\n\" There's a real disconnect between the housing stock that's available and what people are requiring. \"\n\nA handwritten letter from a man looking for a house in Albany. (ABC Great Southern: Andrew Chounding)\n\nGrowing city, growing problem\n\nAlbany has become the fastest-growing regional centre in Western Australia and the fourth-fastest nationally, according to a recent report by the Regional Australia Institute.\n\nIt found the region, with a population of about 50,000, experienced a 200 per cent rise in internal migration in the 12 months to December.\n\nAlbany house prices have soared since COVID. (Supplied: REIWA)\n\nSupport services fear the increasing population will worsen the housing crisis.\n\n\"It seems to be getting worse if anything,\" Southern Aboriginal Corporation deputy chief executive Oscar Colbung said.\n\n\"Demand has increased so much that there's virtually nothing available more broadly.\"\n\nOscar Colbung says the housing shortage in the region is worsening. (ABC Great Southern: Andrew Chounding)\n\nMore dwellings on the way\n\nWA Housing Minister John Carey said the government was working with community housing providers to deliver more social and affordable housing across the state, targeted towards seniors and those with disabilities.\n\nMr Lysaught's plans for Albany included 36 and 51-unit developments, but getting ahead of the shortage was an ongoing struggle.\n\n\"The pressure on the social housing system just continues to rise,\" he said.\n\n\"There's lots being done about it, both by government and by community providers, but it's going to take some time to try and catch up.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/locals-and-conservationists-call-for-tailings-dam-decision/105660790",
        "title": "Mining town locals frustrated over approval wait after new minister's 'frank' comments",
        "publish_date": "Sat, 16 Aug 2025 01:43:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ideologically, they are at loggerheads, but there is one thing locals of a remote Tasmanian mining town and conservationists agree on — the federal environment minister needs to hurry up and make a decision about a controversial project.\n\nMining company MMG has been operating in Rosebery for more than 85 years and employs about 500 workers and contractors. The majority of workers are Tasmanian, and a substantial number live on the west coast.\n\nThe mine has two existing tailings dams, but a new one is required for the operation to survive beyond 2030, MMG says. (Supplied: MMG)\n\nThe part Chinese-owned company wants to build a new tailings dam for its zinc, copper and lead mine to store 25 million cubic metres of acid sulphide waste, which it maintains is necessary to operate beyond 2030.\n\nBut environmental groups are vehemently opposed, saying it would \"destroy\" precious Takayna/Tarkine rainforest with \"toxic mine sludge\".\n\nThe proposal has not budged for more than four years.\n\nEnvironmental campaigners say there are modern solutions to mine tailings, including underground disposal, which would have less environmental impact. (ABC News: Mackenzie Heard)\n\nProject yet to hit minister's desk\n\nRosebery locals, such as Mike Wakefield, fear that without the dam's green light, the town will collapse.\n\n\"We all depend on that dam,\" he said.\n\n\"Without [the mine] we're useless. We're like a ship in the middle of the ocean ready to sink.\n\n\" We need it, as simple as that. \"\n\nMike Wakefield says the town will suffer if the tailings dam does not go ahead. (ABC News: Mackenzie Heard)\n\nThree months into his role as federal environment minister, Murray Watt said there were many approvals to work through.\n\n\"To be frank, I haven't had a single briefing on that project since I took over the role as minister,\" he said while visiting Tasmania on Thursday.\n\n\"Once I've been briefed on that, I'll be in a position to give you some more information.\n\n\"We don't respond to what [the Bob Brown Foundation] sees as a priority. We respond to the hundreds of projects that we consider … need to be dealt with.\n\n\"In some cases, we rely on proponents to supply us with information. In some cases it takes time to interpret that information, but we always operate as quickly as we possibly can to apply the law.\"\n\nMMG's Rosebery mine is mostly operated by Tasmanian staff. (Supplied: MMG)\n\nRequest for dam preceded Macquarie Harbour approval\n\nThat does not sit well in Rosebery.\n\nMr Wakefield said former federal environment minister Tanya Plibersek should hang \"her head in shame\", and Labor should have dealt with it by now.\n\n\"While [politicians are] sitting in their nice houses, getting good wages, getting good monies, we suffer out here if it doesn't happen,\" he said.\n\n\" They need to get off their rear ends and sign it so people here know exactly what their future is going to be. \"\n\nCharles Mawer says the dam is \"the best thing\" for the town. (ABC News: Mackenzie Heard)\n\nResident Charles Mawer is frustrated by environmental groups, who he blames for putting Rosebery's future on hold.\n\n\"If they could shut this mine down, they'd be the happiest people in the world,\" he said.\n\n\" [The mine] does help the town, and they are good for us, and this dam is the best thing. \"\n\nEnvironmental campaigners have, in the past, set up a blockade at the site of a proposed tailings dam at the Rosebery mine. (ABC News: Mackenzie Heard)\n\nMr Wakefield said while he understood why environmental groups were concerned, there was more to the picture.\n\n\"But what they don't understand is their actions affect people here, and they need to come out and live here for a while and see,\" he said.\n\nRemote, small and lacking resources and services, Rosebery Neighbourhood House coordinator Tania Blake said MMG poured a lot back into the community, including the school.\n\nTania Blake also worked at the Rosebery mine for 17 years. (ABC News: Mackenzie Heard)\n\nShe said without the mine, the organisation would be supporting more families.\n\n\"There's a need for certainty in the community,\" she said.\n\n\"We need to make sure that [Mr Watt is] briefed on it and gets across it soon.\n\n\" He passed the Macquarie Harbour stuff just recently and this tailings dam has been on the radar long before that, so [it] definitely needs an answer. \"\n\nMMG has other options, conservationists say\n\nThe Bob Brown Foundation is staging a blockade at the site, where hundreds of activists have spent \"many, many nights\" over the years.\n\nThey too are frustrated by Mr Watt.\n\nJenny Weber wants to see MMG explore the possibility of putting mine waste below the mine instead. (ABC News: Mackenzie Heard)\n\n\"He's the environment minister. He's the leading environmentalist who can give World Heritage Protection to Takayna, so it's not good enough that it's taken this long,\" campaign manager Jenny Weber said.\n\n\"We are now on stand-by here in the beautiful Takayna to see if Murray Watt chooses to destroy this place.\n\n\"It's a beautiful, stunning nature that is going to be completely destroyed, entirely swamped, by toxic mine sludge, if the tailings dam is to be allowed to proceed.\"\n\nEnvironmentalists want the new tailings dam stopped due to it being in Tasmanian masked owl habitat. (Supplied: Raptor Refuge)\n\nShe wants to see MMG explore the possibility of putting mine waste below the mine instead.\n\n\"We believe that Rosebery does have a future without a tailings dam in Takayna,\" she said.\n\nCouncil to advocate for project\n\nWest Coast Mayor Shane Pitt said all ministers had priorities, but the project was vital for the region and he would nudge Mr Watt.\n\n\"We'd like to see him put it high on his list,\" he said.\n\n\"But you know, there's a lot of work that needs to be done on these issues as well, so he needs the time to be able to read through the documentation.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/continuous-glucose-monitors-used-non-diabetics/105619630",
        "title": "Influencer promotion of glucose monitors sparks concern from diabetic",
        "publish_date": "Sat, 16 Aug 2025 01:12:18 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Corrine Moore beams with pride and relief as she opens a graph on her phone, showing a steady line that reflects her blood sugar levels throughout the day.\n\nIt is a rare event for the 25 year old, who has suffered from type 1 diabetes since she was two and constantly battles to keep her blood sugar levels within a safe range.\n\nThe app she uses connects to a continuous glucose monitor (CGM) stuck to her arm, which takes measurements of her blood sugar every five minutes.\n\nThe device not only gives her painless access to checking her blood sugar, but alerts her to rises and drops in her levels before they become dangerous.\n\nCorrine Moore says living with Type 1 diabetes is a constant battle. (ABC Midwest & Wheatbelt: Brianna Melville)\n\nFor Ms Moore, CGMs are part of a constant struggle to keep her body functioning, so she was surprised to scroll upon videos of non-diabetics wearing the devices in recent months.\n\nNew health trend?\n\nIn an Instagram reel, a woman wearing a CGM explains how a morning coffee spiked her blood sugar by 2 millimoles per litre and how she avoided it the next time by going for a walk.\n\nThe account tells viewers that reducing blood sugar spikes helps the body avoid storing fat, and directs them to an online paid \"fatburner\" academy.\n\nIn other videos, self-described \"biohackers\" nervously install CGM's on their arms for the first time, and recount the information it gives them throughout the day.\n\nContinuous glucose monitors are being tried by people without diabetes. (Instagram: curiousmediahq/ lynlee_and_lydia_/ kyliegulliver)\n\nMs Moore, whose blood sugar often spikes by more than 10mmol/L after a miscalculated or mistimed insulin dose, says it is frustrating to witness.\n\n\"To me, that's a lifesaving medical device, to them it's to see what their sugar levels are doing after they eat a banana,\" Ms Moore says.\n\n\" Their pancreas is going to work and it's going to do what it needs to do. \"\n\nMs Moore says it is debilitating or fatal if diabetics do not constantly monitor their blood sugar and adjust it correctly, making it hard to watch people who do not carry the same mental load fret about small rises and drops in their glucose levels.\n\n\"They make it look so easy-breezy but it's not for us [diabetics],\" she says.\n\nAn app connects to a continuous glucose monitor. (ABC Midwest & Wheatbelt: Brianna Melville)\n\n\"We don't want to desensitise how life-threatening diabetes can be, it can be quite scary.\"\n\nThe ABC reached out to a number of content creators promoting usage of CGMs.\n\nThose who responded were adamant about the potential health benefits.\n\nBut they insist diabetics should be granted priority access.\n\n\"In the western world we have a culture of treating symptoms and treating disease,\" Curious Media director Steve Grace says.\n\n\"I think everyone wants to move to more of a preventative style [of healthcare].\"\n\n\"If the device is available for purchase, why not allow broader use when it has clear preventative potential?\" content creator Kylie Gulliver says.\n\nA case for preventative health\n\nSome of the online content showing non-diabetic CGM users is linked to Vively, which launched in 2021 as \"the first company in Australia to bring blood glucose monitoring to those without diabetes\".\n\nMedical director and co-founder, Michelle Woolhouse, says the devices can help people lose weight by showing them how different foods and behaviours impact their bodies in real-time.\n\n\"It's really about giving people an educational tool alongside lifestyle advice, that can help them to really feel empowered and understand what works for them,\" Dr Woolhouse says.\n\n\" It's one thing to research [which foods are healthy] … but it's when knowledge becomes personalised it becomes alive in that person's life so they are more likely to do something about it. \"\n\nShe says the devices can also help people discover health issues prior to a diagnosis, such as pre-diabetes, and intervene before it gets worse.\n\nMichelle Woolhouse says CGMs can help people discover health issues. (Supplied: Michelle Woolhouse)\n\n\"A lot of people are recognising they have more metabolic dysfunction than they previously thought that they would,\" she says.\n\nDr Woolhouse says peri-menopausal women are a large demographic of non-diabetic CGM users, using them to mitigate weight gain that occurs during a shift in their metabolism.\n\nCould CGMs run out?\n\nIn the wake of a recent shortage in type 2 treatment drug Ozempic, many diabetics such as Ms Moore remain nervous about weight-loss claims triggering demand and shortages in their supplies.\n\nHowever, the Therapeautic Goods Administration says it it not aware of any supply disruptions for CGMs.\n\nDr Woolhouse says her company definitely considered the prospect of shortage, but says it is \"not the case\" in Australia.\n\n\"Two new players have just been registered on the TGA, there's a lot of new CGMs coming onto the market,\" she says.\n\n\" There's no shortage at all for CGMs. \"\n\nDiabetes WA spokesperson Jessica Weiss says there is \"plenty\" of stock available but it is \"challenging to say\" whether the future supply could be affected by uptake from non-diabetics.\n\nUnsubsidised, CGMs generally cost about $200 — $300 per month.\n\nA limited quota of the devices is partially subsidised each year for type 1 diabetics, and they remain full price for type 2 diabetics, who continue to campaign for affordable access.\n\nIs more information a good thing?\n\nMs Weiss says without the right education, non-diabetics using CGMs could misunderstand what to expect from their bodies and set unrealistic targets around their glucose levels, develop increased anxiety or cut out certain types of foods.\n\n\"You're getting a lot of information that you didn't previously have,\" she says.\n\nJessica Weiss says minor blood sugar spikes and dips are normal in people without diabetes. (ABC Perth: Keana Naughton)\n\n\"For people without diabetes, our body does an excellent job of regulating our glucose levels. These highs and lows are very normal and very safe.\n\n\" There are other health and fitness tracking devices that might be more appropriate than these therapeutic medical devices. \"\n\nShe advises \"a little bit of extra caution\" when buying health-related products outside of conventional channels.\n\nOn Vively's website, Dr Woolhouse says the research is \"still early\" on CGMs, and there is not yet solid evidence to say whether wearing one has any negative impact for non-diabetics.\n\nHowever, she insists her company provides comprehensive coaching by professionals to ensure clients interpret their readings correctly.\n\n\"We do a lot of education in the app to help people really understand [the data]\" she says.\n\n\"We do find it can actually help people to understand the sources of their eating disorders, as they stabilise their blood glucose levels.\"\n\nEditor's Note: Reporter Brianna Melville has type 1 diabetes and uses a glucose monitor.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/robert-bogucki-nowhere-man-reveals-cultural-survival-obsession/105562102",
        "title": "Why we're fascinated by outback survival, from the comfort of suburbia",
        "publish_date": "Sat, 16 Aug 2025 01:02:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "How would you cope if you got lost in the bush? How long could you survive if you had to rely on your own skills? Would you drink your own wee if it was the only option?\n\nThey're questions few of us will ever answer.\n\nMost of us are too busy watching survival TV shows and scrolling wilderness content on social media, all from the safety of the suburbs.\n\nHowever, every year there are people who risk death to prove they can live off the land and endure the elements.\n\nPeople like Robert Bogucki, who danced with death during his 1999 pilgrimage into the Great Sandy Desert, and captivated strangers all over the world.\n\nDecades later, we're still hooked on watching folks more brazen than us grapple with their mortality.\n\nSurvivor, about to embark on its 49th season, is one of the longest-running reality TV shows of all time, while Alone Australia remains SBS's most successful franchise, with its latest season pulling in 3.5 million viewers.\n\nBut at a time when Australians are more buffered from risk than ever before, the pop culture obsession with outback survival is a strange phenomenon.\n\nIt hints at a craving for hardship and a desire for meaning that many feel is lacking in their lives.\n\nSurvival content is booming\n\nFor thousands of years — and to this day, in many parts of the world — humans struggled to locate enough water, food, and shelter to survive.\n\nThese days it's typically people from privileged backgrounds who test their mettle in outback survival quests — flexing their practical skills to achieve a sense of strength and psychological wellbeing by enduring discomfort and overcoming adversity.\n\nOthers opt for a safer, entry-level option — booking into the growing number of commercially run outback survival retreats.\n\nBut most people only watch survival challenges vicariously online.\n\n\"Outback Mike\" has built a large online following around content about survival. (ABC News: Holly Richardson)\n\nMike Atkinson, who's trained in outback survival in the Australian military and showcased his skills on the reality TV show Alone, has noticed interest growing in recent years.\n\n\"Most of us in our current lifestyles probably don't get out into the wilderness, but there's definitely a growing trend in recent years for people wanting to explore that kind of area,\" he says.\n\nAlone has a lesson about fear. Here's why we need it now Photo shows A group in winter clothes stands in a remote location with snowcapped mountains in the distance Fear is seen as something that should be avoided, yet should it be? The reality TV show Alone Australia shows us fear is more nuanced and positive than assumed, writes Eric Brymer.\n\nAtkinson now creates content about his wilderness adventures full time, and goes by \"Outback Mike\". He believes people are drawn to the genre because they feel disconnected from nature.\n\n\"Modern life is pretty devoid of real challenges and outback survival gives you that real challenge,\" Atkinson says.\n\n\"It's a connection to our evolutionary past, and they want to experience it.\n\n\"But I reckon less than half of people watching this material will ever actually use the skills, whether it's on camping trips or overnight hikes, or trying more challenging outdoor activities.\"\n\nWhen risky adventure divides public opinion\n\nReality TV shows create an illusion of risk, with paramedics and evacuation teams waiting on standby to snatch contestants away from danger if needed.\n\nBut a small number of people risk their lives in search of solitude and spiritual growth, drawing on an age-old belief that romanticises nature as \"authentic\", and capable of revealing fundamental human truths.\n\nThis yearning for spiritual connection is what sent Robert Bogucki out into the Great Sandy Desert in 1999.\n\nHis remarkable story of survival, as told in the ABC's Expanse: Nowhere Man podcast, inspired visceral reactions among the public.\n\nListen to the podcast Photo shows A stylised desert landscape in purple and pink with the silhoutted face of a man, titled EXPANSE NOWHERE MAN Season five of Expanse tells the extraordinary story of Robert Bogucki's survival in the Great Sandy Desert, and his return to Australia decades later.\n\nSome were envious of his chance to seek solitude and challenge away from the shackles of daily life, while others were angry about the resources that went into large-scale search efforts to find him. Many were simply baffled by an impulse to disappear alone that they couldn't understand.\n\nWhile Bogucki and his long-time partner Janet North received letters of support and celebration of his survival from around the world, there was also significant backlash.\n\nThe WA Premier at the time described Bogucki's actions as reckless, while letters to the editor scolded him as a \"'selfish ignorant rich kid\" who \"needed a good smack in the mouth\".\n\nBen Martin, a former reporter for The West Australian who joined the search for Bogucki in 1999, believes the public response is revealing.\n\n\"There's a fine line between celebrating some sort of frontier spirit, versus someone regarded as doing something a bit weird,\" he reflects.\n\n\"People judged Robert so harshly … but people are paying thousands of dollars to go to yoga retreats to disconnect and just think, which is not that different to what Robert was seeking.\n\n\"So I think the depth of thought that Robert was seeking was lost on a lot of people.\"\n\nThe saga revealed a double-standard in how we respond to people who undertake risky endeavours. An attempt to break a world record is considered brave and bold, and extreme sports like base-jumping are deadly but tolerated.\n\nBut dangerous journeys to achieve a spiritual, psychological or religious objective tend to puzzle and even offend the general public.\n\nAnother young explorer going Into the Wild\n\nThe fall-out from Bogucki's odyssey revealed a deeper tension between the desire of the state to keep people safe, and the freedom of the individual to live and die as they wish.\n\nThere are similarities with the much more famous case of Christopher McCandless, who starved to death in remote interior Alaska in 1992.\n\nMcCandless — whose story was immortalised in the 1996 book Into The Wild, and later adapted for film — was determined to prove he could live off the land, but misjudged river levels and became trapped as the freezing winter approached.\n\nThe site of the bus where McCandless spent his final days became something of a tourist spot after his death. (AP: Jillian Rogers)\n\nBoth Bogucki and McCandless were intelligent, independent-minded young American men from highly educated and well-to-do families.\n\nBoth embarked on physically and mentally challenging journeys into the wilderness, with an awareness and acceptance of the risks involved.\n\nBut only one lived to tell the tale, while the other died a preventable death in the prime of life.\n\nLooking back now, Robert Bogucki says he can understand the comparison, although their motivations differed.\n\n\"All I can say about McCandless is that he got what he wanted, to be out there alone in the wilderness,\" he says.\n\n\"And I think he had a fulfilling life. He got what he asked for.\n\n\"Some people would say 'oh, that's terrible because he died', but where do you want to die, in a hospital with a bunch of tubes sticking out of you?\"\n\nDecades after his journey into the Great Sandy Desert, Robert Bogucki met some of the people who went looking for him. (ABC News: Franque Batty)\n\nWhile Robert's quest was primarily spiritual, he endured many of the challenges and discomforts experienced by those undertaking more straight-forward survival quests.\n\nTowards the end of the trip, he was so weakened by dehydration and malnutrition that he felt he'd die if he succumbed to the feelings of despair, or stopped moving to sit under a tree for more than a few minutes.\n\nFinding Robert Bogucki Photo shows A composite image shows cut-out faces of Robert Bogucki as a young man in hospital and now, aged 59, on desert background In 1999 a young American dumped his bicycle and walked out into the Great Sandy Desert. Why was he willing to risk his life, and why do some people need to get lost in order to feel found?\n\nOn day 36 on his journey, he was so thirsty he considered drinking his own urine, but decided against it, deciding it would be akin to \"giving up\".\n\nUltimately, Bogucki believes it was his faith in God and positive mindset that allowed him to endure a level of deprivation that the guidebooks suggest no-one could survive.\n\n\"The simple answer [for how I survived] is by focusing on the good and not the bad — the life aspect, as opposed to the things that sucked energy from me,\" he says.\n\n\"It came down to believing in God because of the love of life, as opposed to a fear of dying or hell.\"\n\nThose long, hot days and nights in the desert changed Bogucki, instilling a self-awareness and confidence in his ability to endure hardship that would be difficult to replicate.\n\n\"It definitely caused me to slow down … it helps you identify your ego, that detrimental part of your self-awareness that I had to learn about, and that's always there,\" he says.\n\n\"To be aware of that definitely helps deal with these modern times.\"\n\nBogucki, now aged 59, lives with his partner Janet in a log cabin in remote central Alaska — not far from where McCandless died.\n\nThis mural at a museum in Fairbanks reflects the local perspective on living in the wilderness. (ABC News: Erin Parke)\n\nHe recognises that many people face adversity and hardship in daily life.\n\n\"Not everyone's going to go for a walk in the desert, or go to the edge of the abyss, but they'll have their own troubles and trials and tribulations,\" he says.\n\n\"I learnt you have a strength you don't know you have … everyone's got their cross to bear.\"\n\nThe fine line around free will\n\nThe Bogucki saga exposed deep divisions over whether people should be allowed to undertake risky activities in the outback, or be protected from themselves in what's often characterised as a \"nanny state\" intervention.\n\nOpinion pieces published in the wake of his rescue dissected the ideological tension.\n\nOne, by Alaskan outdoorsman Charlie Campbell, captured the culture of staunch individualism that's more pervasive in the US than Australia.\n\n\"[Bogucki's case] raises an interesting question, one with profound moral dilemmas attached,\" he wrote in the Fairbanks Daily Miner.\n\n\"What is society's responsibility to rescue people who may not want to be rescued?\n\n\"We live in an age where more and more a huge safety net is created under most any activity we undertake. The problem with this is it runs counter to a basic human need to exercise free will.\"\n\nHe pointed to the installation of boardwalks and handrails across scenic locations and national parks, \"excessive\" warning signs, and children so buffered from risk they would emerge into adulthood timid and unchallenged by adversity.\n\nCharlie Campbell believes remote areas like where Robert Bogucki lived were ruined by excessive safety measures. (ABC News: Erin Parke)\n\nThe column also suggested a legal disclaimer could be considered for those of sound mind who wanted to undertake high-risk endeavours without intervention by authorities.\n\nIt's an idea supported by Atkinson, who believes society has tipped too far in favour of minimising risk.\n\n\"People end up so risk-averse that they've lost the ability to actually weigh up the positives and negatives of a risk decision, and they're missing out on a heap of positive experiences in nature because of that,\" he says.\n\n\"It's detrimental, especially when parents seem to set this goal that my child shouldn't go through any hardship, whereas really it needs to be: 'What are the suitable risks that they can take, and what are the deliberate hardships that I'm going to allow them to experience in order for them to grow?'\"\n\nInto the Wild bus removed over safety concerns Photo shows Alaska Army National Guard soldiers use a CH-47 Chinook helicopter to removed an abandoned bus. A wrecked bus made famous by a non-fiction book and movie about a North American explorer is removed for tourists' safety.\n\nA 2024 study from the Australian Institute of Family Studies showed the amount of time children under five spend indoors has increased in recent years, with researchers warning it could negatively impact wellbeing and development.\n\nAtkinson is by no means reckless. His wife and children are forefront in his mind, and he says he assesses the dangers of each journey carefully, whether it's sailing a handmade canoe through tropical waters or surviving alone on a remote beach for weeks.\n\nAt times, he's carried a satellite communication device, leaving instructions to contact authorities if he doesn't do a digital \"check-in\" for more than seven days.\n\nBut the 47-year-old former military pilot believes strongly that individuals should retain the right to risk their lives, so long as they're of sound mind and communicating clearly.\n\n\"I've thought a lot about the most responsible way for people to do something like what Robert Bogucki did, and I think an indemnity form is the answer,\" he says.\n\n\"So you can sign a form saying to the authorities: 'Hey, I'm going out bush, and I'm not going to tell you where, because I don't want you to have to feel responsible for searching for me.'\n\n\"You should be able to do that as a kind of basic human right, because otherwise it opens up a whole bag of worms about how much risk you're allowed to take in your own life.\"\n\nIt's the kind of system that could help authorities navigate cases like that of Thomas Seibold, a German man who disappeared in 2012 during an ambitious adventure in remote interior Alaska.\n\nThomas Siebold disappeared around the Ambler area in Alaska in 2012. (Alaska State Troopers)\n\nSeibold was an experienced, resilient survival instructor at an outdoor skills school in Wisconsin.\n\nThe police incident report into his disappearance, obtained by the ABC, states that Seibold had hiked to a remote cabin and planned to stay a couple of months alone to \"spend time with nature\".\n\nHe was due to trek the 40 kilometres out to safety at the start of winter, but was never seen again.\n\nAn inventory of his belongings — found at the cabin — included maps, winter clothing, a 0.22 calibre rifle, a moose carcass and a handful of berries.\n\n\"Seibold has been presumed deceased … he is officially listed as a missing person,\" the police report states.\n\nAnother life likely lost in the pursuit of solitude in the wilderness, in a manifestation of free will that few would choose.\n\nAre ancient survival skills disappearing?\n\nIn Australia, it's becoming harder and harder to be alone in the wilderness to test your skills and enjoy peace and quiet.\n\nEvery year, the spiderweb of sealed road spreads across the outback landscape. And mobile phone reception is expanding across the vast interior, making it difficult to avoid the incessant buzz of notifications.\n\nIt's no doubt a positive for remote residents, for whom the bitumen and bars of reception are a critical link to help in times of crisis.\n\nRemote communities left offline in digital shift Photo shows A phone box with a bright orange roof sits on a dirt road with bushland and a windmill behind it. A national snapshot shows internet access is improving overall, but half the country's Aboriginal communities still don't have phone reception.\n\nBut many, like Bogucki, believe we're less happy because our increasingly safe, suburbanised existence.\n\n\"It's pretty clear that the answer is to get back to respecting the earth and having a connection with it,\" he says.\n\n\"When you're in the city everything's so easy to get … and when you tear away all that modern world stuff, you can feel the benefits.\n\n\"Your ego drops, you stop looking at yourself in the mirror. Don't take the selfie, don't take your phone out there and take selfies. It's not conducive to the spirit path, and it's not conducive to life.\"\n\nRobert Bogucki believes reconnecting with nature is paramount to a peaceful existence. (ABC News: Erin Parke)\n\nAs technology expands to fill almost every facet of our lives, the promise of the wilderness shimmers like a mirage in our minds — a place to disconnect, to be alone, and, in as Bogucki puts it, \"strip away the bark to find your essence\".\n\nThis concept of choosing to \"go bush\" for spiritual enlightenment is, in some ways, a privileged perspective.\n\nWhy do we care about some people who go missing, but ignore others? Photo shows A side-by-side image shows young German woman Carolina Wilga and Aboriginal man Clinton Lockyer The miraculous survival of German backpacker Carolina Wilga was met with joy and relief. But for families of missing Aboriginal men, it's prompted uncomfortable questions.\n\nAboriginal people continued to \"survive\" in some of the most challenging wilderness landscapes in Australia until around 50 years ago.\n\nMany still rely on age-old hunting and fishing techniques in places where shops are far away and incomes low.\n\nThey're skills that help people survive when things go pear-shaped out bush.\n\nAnd it's often local Indigenous people who find and help tourists when they become stranded.\n\nJabirr Jabirr and Nyikina man Lindsay Greatorex says older Aboriginal people's knowledge of Australia's remote landscapes is unparalleled and underestimated.\n\nLindsay Greatorex was one of the local police officers who helped search for Robert Bogucki in 1999. (ABC Kimberley: Andy Seabourne)\n\n\"For tens of thousands of years, Aboriginal people built this incredible knowledge of country … they knew where the soak holes were, they knew the weather and the timing of everything,\" he says.\n\n\"That's how we survived in those arid locations over the years, and there's still this survival instinct of the mob.\n\n\" The landscape might be harsh and look dangerous, but if you're born and raised there, that's your country, and if you look after country, it'll look after you. \"\n\nGreatorex worked as a police officer across Western Australian for almost 20 years, and was part of the local team that went out in search of Bogucki in 1999.\n\nAt times throughout his career, he watched in disbelief as men who'd grown up in the desert used their tracking skills to quickly locate missing people in remote areas.\n\nBut he says the skills are at risk of disappearing, with younger generations largely stuck in towns and unable to learn how to live off the land their ancestors survived in for generations.\n\n\"It's sad to see, and it's why it's so important we do our best to get our kids out bush,\" he reflects.\n\n\"I have a bit of knowledge, but even I get my bush tucker from the supermarket — it's not like the old days, that's for sure.\"\n\n'Bogucki envy' in the search for meaning\n\nOutback survival makes for riveting viewing because it captures a reality that terrifies most people — being forced to rely on only yourself as imminent death looms.\n\nAustralians are increasingly buffered from risk, and living longer than ever before.\n\nOutback survival offers a glimpse at an earlier existence that few would want to relive, but one that many suspect offered a sense of focus, purpose and wellbeing many now struggle to achieve.\n\nAs Australian writer Ruth Ostrow observed in an article about Bogucki's disappearance in 1999, the fear of a life unlived haunts those of us fortunate enough to never know how we'd cope in a life -or-death situation.\n\n\"As I stare into Bogucki's eye, I am afraid. Afraid of letting life pass me by,\" she wrote in a piece titled In Search of Peace on Earth.\n\n\"But most of all, I'm afraid that I will never roam barefoot through dusty sand dunes, totally alone with the sound of my heartbeat and the wind, in the wilderness of my soul.\n\n\"We've grown fat on money, food and possessions. But still we remain empty.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/thrill-of-racing-draws-more-women-into-motorsport/105641246",
        "title": "Thrill of the racetrack entices more women into motorsport",
        "publish_date": "Sat, 16 Aug 2025 00:35:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "The throbbing sound of a revving V8 engine and the intoxicating smell of diesel and rubber tyres are all part of the appeal of car meets.\n\nBut it's not only men flocking to car meets across the country — women dig cars too.\n\nAnd now more women are getting involved in the sport on the track and behind the scenes.\n\nThe thrill of it\n\nCar enthusiast Deb Myers never dreamed of racing until she met her husband Ian Crabbe about six years ago.\n\nNow she loves the thrill of it.\n\nDeb Myers and Ian Crabbe have matching racing cars. (ABC Far North: Amanda Cranston)\n\n\"We recently drag raced at Palmyra Dragway in Mackay and my best time was 10.67 for the quarter mile,\" Ms Myers said.\n\nFor the first few years she and her husband would time their trip around the track, also known as a hot lap, taking turns racing in his 2008 Clubsport Holden Commodore.\n\nBut now they do that in their own identical, supercharged, colour-matched cars, mainly at their local, the Springmount Raceway near Mareeba in Far North Queensland.\n\n\"There are lots of females in the car scene, which is encouraging to see,\" Ms Myers said.\n\n\"And there's quite a lot of ladies that drag race up at Springmount and we always say 'girl power' to them.\"\n\nDeb Myers developed a love of car racing through her husband. (Supplied: Deb Myers)\n\nMr Crabbe has enjoyed watching his wife blossom in the sport and become increasingly involved in regular car meets.\n\n\"The car community is very welcoming and more women are embracing it and giving racing a go and I really applaud it,\" he said.\n\nWomen to 'feel safe and respected'\n\nIn her 30 years in the industry, self-confessed automotive addict and racing commentator Lara Wilde has seen women become more active, including in racing, behind the scenes as pit crew, attending car meets and in leadership roles.\n\n\"I'm seeing more women getting a profile in motorsport, not because they are women, but because they are exceptional,\" Ms Wilde said.\n\nLara Wilde is booked solidly, commentating 46 out of 52 weekends this year. (Supplied: Lara Wilde)\n\nShe believes it has opened the door for other women to pursue their passion.\n\n\"It's important for women to be welcomed into the car community and to feel safe and respected,\" Ms Wilde said.\n\n\" We need male allies to make it a safe space. \"\n\nShe welcomed a national push to get more women into motorsport.\n\n\"We're seeing women like Betty Klimenko, who is the first woman to own a V8 Supercar team in Australia.\n\n\"And Formula One is on a mission to put the first permanent woman driver on the grid of Formula One.\"\n\nEarlier this year, teens Joanne Ciconte and Aiva Anagnostiadis represented Australia in the all-female Formula 1 Academy series for the first time.\n\nMotorsport Australia, the Fédération Internationale de l'Automobile (FIA)-appointed not-for-profit organisation, said more women were entering the industry nationally, both on and off the track.\n\n\"The great thing about motorsport is the car doesn't know your gender, who is pressing the pedals or how well you can steer,\" development manager Charlie Barlow said.\n\n\"Once you're behind the wheel, it's completely gender-free.\"\n\nCharlie Barlow says the great thing about motorsport is the car does not know your gender. (Supplied: Charlie Barlow)\n\nBut Ms Barlow said the initial break into the industry was often a barrier to women, and she believed changing this was an industry-wide responsibility.\n\nShe said the organisation's Girls on Track program had helped to address the gender imbalance in the male-dominated industry.\n\nMore than 3,500 girls have completed the program since it launched in 2018, with many pursuing a career in motorsport in varied roles including engineering, team management and coordination.\n\nAn early introduction to the sport worked for commentator Lara Wilde, who has fostered a love of cars since her youth.\n\n\"When I was growing up, a car was independence, freedom, a chance to have a social life and an extension of who I was,\" she said.\n\nLara Wilde has always been passionate about cars and has made a career our of it. (Supplied: Lara Wilde)\n\nOnce a hobby, it led to a career that sees her booked 46 out of 52 weekends a year.\n\n\"I do Summernats, which is the biggest burnout show in Australia, plus Red Nats, Northern Nats, Rocky Nats and all the Nats.\"\n\nSuccess off the track\n\nMs Wilde is keen to see even more women challenging stereotypes by pursuing a career in motorsport.\n\nAlready doing this is Leonie Pollard, a judge at Cairns' NQ Burnouts and Tropical Meltdown and Powerfest in Mackay.\n\nLeonie Pollard with a shirt made just for her. (Supplied: Leonie Pollard)\n\n\"They were looking for a judge for NQ Burnouts about five years ago and my son threw my name in the ring,\" Ms Pollard said.\n\n\" They decided I would be a good judge because I'm not biased and I call it how it is. \"\n\nBut she said female judges were still a minority, which she attributed to outdated stereotypes.\n\n\"I also think social media is partly to blame as men can be quite disgusting with their comments about women on car pages,\" she said.\n\n\"They pick on women's looks and their driving and they can be really hurtful.\"\n\nHowever Ms Pollard, whose children and grandchildren attended races, said many men were supportive of women in the industry, with some even introducing their partners or daughters to the scene.\n\nLeonie Pollard is thrilled more women are getting into motorsport. (Supplied: Leonie Pollard)\n\nShe said women also tended to rally around each other.\n\n\"Even if they're competitors or one is beating the other, they help each other out, which is great,\" Ms Pollard said.\n\nAs the grandmother prepared for her next north Queensland event, she said she had no intention of getting behind the wheel herself.\n\n\"I worked as pit crew for drag racing many years ago but preferred working in the background because it costs a lot less,\" she said.\n\n\"It is an expensive hobby.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/dramatic-liverpool-win-premier-league-opener-soured-racist-abuse/105662030",
        "title": "Liverpool wins dramatic Premier League opener soured by racist abuse",
        "publish_date": "Sat, 16 Aug 2025 00:09:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Liverpool talisman Mo Salah and substitute Federico Chiesa struck late goals as the Premier League champions began the defence of its title by beating Bournemouth 4-2 in a thriller on the opening night of the season at Anfield on Friday.\n\nOn a bittersweet evening charged with emotion after the July death of Liverpool forward Diogo Jota, newcomer Hugo Ekitike bagged a goal on his league debut to put the hosts ahead after 37 minutes, and Cody Gakpo doubled the lead in the 49th.\n\nBut the night was soured by racist abuse targeting Bournemouth's Antoine Semenyo, which led to the game being halted for several minutes after Bournemouth's Ghana international reported the abuse from someone in the crowd.\n\nSemenyo went on to pull a goal back for the visitors in the 64th minute and completed a double 12 minutes later to rock Liverpool and shock the home fans.\n\n\"It's totally unacceptable,\" Bournemouth captain Adam Smith said.\n\n\"Kind of in shock to be honest that it happened. In this day and age it shouldn't be happening.\n\n\"I don't know how Ant's played on to be honest and come up with those goals … Something has to be done. We'll support him in there and hopefully he'll be ok.\"\n\nFederico Chiesa picked a good time to score his first Premier League goal for Liverpool, giving them a 3-2 lead at Anfield in the 89th minute against Bournemouth. (Getty Images: AMA/Robbie Jay Barratt)\n\nChiesa came off the bench and sent the Anfield faithful away happy with an 88th-minute strike after goalkeeper Djordje Petrovic swatted away a ball into the box by Salah, who scored himself deep into added time to wrap up the three points.\n\n\"Fantastic,\" Liverpool boss Arne Slot said of Italian forward Chiesa's goal.\n\n\"He came in in the end because we needed a goal. For him then to score in such a moment is special.\n\n\"It's even more special because the fans have supported him. It's nice he gives them something in return with a great goal.\"\n\nLiverpool's Mohamed Salah was left in tears at Anfield as the fans sang Diogo Jota's song at full-time in honour of the late Reds' striker. (AP: Ian Hodgson)\n\nWith Liverpool ahead again, Salah chased the ball past the defence before cutting inside and firing into the bottom corner with a 94th-minute goal that put the Egyptian joint-fourth with Andy Cole on the all-time Premier League scorers' list with 187.\n\nAn emotional Salah pointed to the heavens and flapped two hands to mimic Jota's shark goal celebration.\n\nHe headed for The Kop stand after the final whistle, and wiped away tears while applauding the fans who were singing their Jota song to the tune of \"Bad Moon Rising.\"\n\nThe night started with an emotional minute's silence for Jota and his brother Andre Silva, who died in a car crash. Fans fought back tears as they sang \"You'll Never Walk Alone.\"\n\nEkitike, who has joined from Eintracht Frankfurt, was the most impressive of Slot's close-season signings in a spending spree topping 300 million pounds ($406.53 million).\n\n\"Obviously I think it was a good performance, I could do better,\" said the French forward — who held up two fingers in one hand, and made a zero with the other in a tribute to Liverpool's Jota, who wore number 20 — after his goal.\n\nLiverpool fans held banners and tifo displays at Anfield in honour of the late Diogo Jota and his brother Andre Silva. (Getty Images: Liverpool FC)\n\n\"But the most important thing was winning, the mentality we showed. Obviously we wanted to win tonight for the people who came and for Diogo,\" added the 23-year-old forward.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/backpacker-claims-mistreated-underpaid-broome/105381104",
        "title": "Backpackers allege exploitation in WA tourist hotspot",
        "publish_date": "Sat, 16 Aug 2025 00:07:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "With tourist season in full swing across Western Australia's north, backpackers claim they have been paid late or underpaid for work done at a Kimberley tourist resort.\n\nFormer workers at Broome Beach Resort allege wrongdoing by the company ranging from unpaid trials with no supervision, being \"threatened\" to be reported to visa authorities when requesting wages and having pay withheld for weeks.\n\nThe resort has disputed the allegations, saying they were \"misleading, lack factual basis and are not reflective of [its] employment practices or business operations\".\n\nThe ABC understands at least two former employees have made complaints to the Fair Work Ombudsman (FWO), which declined to comment on whether it was investigating.\n\nConcern around unpaid trials\n\nIn May, French couple Killian Vayne and Gabrielle Bidaud were offered a trial by the resort's manager.\n\nMr Vayne said he was asked to weed the parking lot for \"several hours with no supervision and no information about pay or the possibility of being hired\".\n\nHe said his partner \"spent the entire morning cleaning multiple rooms\" with limited supervision and no indication of when to take a break or find a rest room.\n\n\n\nMr Vayne said they were not made aware until after their shift that two hours would be an unpaid trial.\n\n\"They told us of our entire morning's work, two hours would be unpaid … we're demanding payment for those two hours,\" he said.\n\nKillian Vayne and Gabrielle Bidaud claim they were unsupervised during their unpaid trials. (Supplied)\n\nAccording to the FWO, an unpaid trial is a \"demonstration by someone working under supervision to show they have the skills for the job\" and may be unlawful if the person is not under direct supervision.\n\nIn an email seen by the ABC, Mr Vayne was told his trial was unsupervised to assess whether he was suitable.\n\n\"We agreed to a two-hour unpaid trial to ensure you are suitable for the job, hence it was unsupervised,\" the email said.\n\nBroome Beach Resort said claims Mr Vayne or Ms Bidaud were unaware the trial was unpaid or the trial was unsupervised were \"factually incorrect\".\n\nAllegations of threats\n\nMr Vayne said when he raised concern about unpaid trials and working up to eight hours without a break, he and his partner were dismissed \"without valid justification\" and \"barred\" from the site.\n\nHave a story to share? Email Dunja Karagic on dunja.karagic@abc.net.au or securely on dunjakar@protonmail.com\n\n\"The management threatened to report our visas if we continued to demand our rights,\" he said.\n\nIn an email seen by the ABC, the resort told Mr Vayne it did not have his visa details on file. (Supplied/Canva)\n\nWhile Mr Vayne said he had already worked at the resort for more than a week, he was told in an e-mail he had not been paid because the company did not have his visa details.\n\nAccording to the Department of Home Affairs, employers must ensure non-citizens hold a valid visa before they are employed.\n\n\"Actual pay owing, not your blackmailing demands will be forwarded to you and Gabrielle along with your pay slip, once we have received your full documentation,\" the email read.\n\n\" We must be sure you are in Australia working legally. It appears we do not have either of your visa details on file, even though they have been requested. \"\n\nBroome Beach Resort said no employee had been dismissed for raising issues related to entitlements.\n\n\"Both individuals were employed on a casual basis and offered no further shifts for behavioural concerns that made them unsuitable for continued employment,\" the resort said in a statement.\n\nIn response to concerns about their visas, Broome Beach Resort said at the time of onboarding the individuals confirmed they held valid working rights in Australia.\n\n\"We requested supporting documentation multiple times,\" the resort said.\n\n\"They were not rostered beyond initial shifts until documentation was received. There was no intention or attempt to engage workers unlawfully.\"\n\nWhile Ms Vayne and Ms Bidaud have been paid most of their wages, they said the resort still owed them a total of almost 10 hours worked, as well as penalty rates for shifts worked without a break and their unpaid trials.\n\nBroome Beach Resort has rejected claims of unpaid hours or missing penalty rates.\n\nMore claims of withheld pay\n\nMr Vayne eventually decided to publish his story on social media to encourage other backpackers to come forward.\n\nOther backpackers told the ABC Mr Vayne's social media post gave them confidence to share their experiences.\n\nFrench backpacker Michael, who did not want to use his real name for fear it would damage his employment prospects, said he worked more than 30 hours for the resort in April.\n\nBut he said he was not paid until June.\n\n\"For two months, I was sending text messages every week, trying to call … sending emails … telling them I will go to Fair Work,\" he said.\n\nA French backpacker says he sent multiple pay requests to the resort. (Supplied/ Canva)\n\nIn response, the resort's \"administration\" told Michael to \"please respect the process we have in Australia\".\n\n\"Threats, theft and sabotage are not accepted here,\" the email, seen by the ABC, said.\n\nHow did we verify this information? Gathered visa details and pay slips from backpackers\n\nSpoke to multiple backpackers who worked at Broome Beach Resort\n\nObtained text messages and emails between backpackers and staff at Broome Beach Resort\n\nMichael said it was not until Mr Vayne's social media post went live that he was paid for most of his hours.\n\n\"I received one pay slip [for] 28 hours, so 3 hours and 40 minutes they still owe me,\" he said.\n\nIn response, Broome Beach Resort said the delays were not intentional and any delays were administrative and related to \"missing or incorrect bank or visa details\".\n\nThe resort rejected claims Michael was still owed money.\n\nBackpacker Clara Grassy said she had to repeatedly request payment for 15 hours of work in mid-May.\n\nClara Grassy says she was ignored by Broome Beach Resort when requesting her last pay cheque. (Supplied: Clara Grassy)\n\n\"[Staff] completely ghosted me,\" she said.\n\n\"Because of the pressure they're starting to get thanks to Killian … [they] finally proceeded with the payment.\"\n\nCalls for more awareness\n\nMr Vayne said he was speaking out to prevent potential exploitation of backpackers.\n\n\"Backpackers are often unaware of their rights, isolated and financially vulnerable,\" he said.\n\n\"Companies know perfectly well if we give our point of view, they'll fire us.\"\n\nMichael said he shared his story to \"prevent backpackers [from] being treated like this\".\n\nFWO denied multiple requests for comment on whether it was investigating complaints against Broome Beach Resort.\n\nA spokesperson said a change to the organisation's media policy meant it could not comment on specific matters unless they were in the public interest.\n\n\"We encourage any workers with concerns to contact us directly for free advice and assistance,\" they said.\n\n'Regulatory gap'\n\nUniversity of Technology Sydney Law Faculty associate professor and Migrant Justice Centre executive director, Laurie Berg, said she had conducted surveys with more than 15,000 temporary migrant workers, many of whom were backpackers.\n\n\"They've told us lots of difficulties they've faced including exploitation and struggling to get redress when they're owed,\" she said.\n\n\"It is unlawful for any employer to withhold pay pending some sort of visa check.\n\n\"Under the law, the employer should not be letting someone start work if their visa documents haven't been checked.\"\n\nMs Berg said her research showed it was a common for backpackers to have to follow up on their pay with employers.\n\nMs Berg says it is common for backpackers to have to chase up their wages. (ABC News: John Gunn)\n\n\"I do think across the country, some employers feel they can take advantage of the fact backpackers on temporary visas move around [and] are not in a strong position to follow up,\" she said.\n\nMs Berg said some workers were falling between the cracks due to the FWO lacking resources to follow up all cases.\n\n\"It is not an agency that routinely resolves accounts of exploitation by migrant workers — it doesn't have the resources to do that,\" she said.\n\n\" I think there is a real regulatory gap here. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/nt-epa-releases-new-emissions-policy-enviroment-groups-concerned/105646982",
        "title": "Environment groups say a worrying WA environment trend is taking place in the NT",
        "publish_date": "Fri, 15 Aug 2025 23:25:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Less than a year after Western Australia's environmental watchdog was stripped of its powers to assess the emissions of some of the state's most highly polluting projects, environmental advocates and experts say they are concerned the Northern Territory is moving in the same direction.\n\nThe WA Environmental Protection Authority (EPA)'s powers were weakened following a review co-written by its former chair Paul Vogel, which recommended a broad set of changes to environment protection laws that one MP characterised as an industry \"wish list\".\n\nAmong the review's recommendations were that major projects, including mining, oil and gas projects, should only be examined at the federal level using the Commonwealth's \"safeguard mechanism\", to avoid duplication and cut bureaucracy.\n\nMr Vogel is now the chair of the Northern Territory EPA.\n\nThis week, the NT EPA released its new emissions policy, the atmospheric processes guidance.\n\nIt allows the EPA to defer projects to the safeguard mechanism, and cites \"the desirability of avoiding duplication\" with the federal policy — which, it states, \"in most cases meets the NT EPA's objectives\" for reducing emissions.\n\nWhy some of Australia’s biggest polluters are celebrating this week Photo shows Flare towers with fire coming out of the top. New laws have stripped WA's environmental watchdog of its power to consider carbon emissions when approving high-polluting projects. So is the EPA now a toothless tiger?\n\nCritics have described the new policy as a \"WA blueprint\" and say it could lead to higher emissions, less scrutiny and legal risks.\n\nWesley Morgan, a research associate with the Institute for Climate Risk and Response at the University of New South Wales (UNSW), said WA and the NT had a long history of \"competing with each other to attract large-scale fossil fuel projects\".\n\n\"They're falling over each other to make it easier for gas companies to operate in their jurisdictions, and I think this is another example of that,\" he said.\n\nFederal government best-placed to lead on climate policy, industry says\n\nDavid Slama, the NT director of Australian Energy Producers, which represents the majority of Australia's oil and gas companies, welcomed the NT government's efforts to \"reduce regulatory duplication\".\n\n\"The guidelines bring the NT into line with the Commonwealth and Western Australian governments in recognising climate policy is best addressed at a national level through the safeguard mechanism,\" he said.\n\nHowever, Environment Centre NT (ECNT) executive director Kirsty Howey described the policy shift as \"disgraceful\".\n\nKirsty Howey says the new guidance \"effectively [strips] the EPA of its ability to properly assess the environmental impact\" of projects. (ABC News: Tristan Hooft)\n\nShe pointed to new federal data showing the Northern Territory's emissions have risen by 98 per cent over the past two decades, and said the policy change would only exacerbate the problem.\n\n\"This policy is effectively stripping the EPA of its ability to properly assess the environmental impact of projects, both locally and globally,\" she said.\n\n\"We suspect that we are copying a similar blueprint to WA, which is renowned for being frankly a jurisdiction that takes no responsibility when it comes to the proper regulation of climate impacts.\n\n\"[Previously the policy] required the NT EPA to properly assess the emissions that will be generated by highly polluting projects, and to fundamentally change it in this way, strips back these protections.\"\n\nThe new policy comes after the NT's Country Liberal Party (CLP) government backflipped on its 2030 emissions reduction target in June.\n\nSince coming to power late last year, the CLP has also scrapped the NT's large emitters policy and its target of 50 per cent renewables by 2030.\n\nWarning streamlining processes could open the door to legal risks\n\nThe federal safeguard mechanism is a policy that has been around for years but has been significantly strengthened by the Albanese government.\n\nIt requires big polluters to offset emissions that surpass their annual limit by buying carbon credits.\n\nBut Andrew Macintosh, an environment law and policy professor at the Australian National University, said with carbon prices set \"incredibly low\", the policy had not been effective.\n\nA major study by Professor Macintosh last year found that nearly a third of projects under Australia's carbon credit scheme delivered little or no emissions reductions, despite costing taxpayers hundreds of millions of dollars.\n\nHe also warned that the NT government had opened itself up to legal risks with its policy change.\n\nAndrew Macintosh says the new policy could lead to legal risks. (ABC News)\n\n\"They're trying to streamline processes for the oil and gas companies, and it could end up doing the reverse by opening up opportunities for legal proceedings,\" he said.\n\nMr Morgan agreed, saying a recent decision by the International Court of Justice — the world's highest court — could also have significant implications.\n\n\"What they found is that countries need to be properly assessing the impacts on the earth's climate from new fossil fuel projects,\" he said.\n\n\"Countries that continue to open new fossil fuel projects may be committing internationally wrongful acts and so can essentially be sued by other nations for continuing to harm the climate.\"\n\nIn a statement, an NT EPA spokesperson said it would require big polluters covered by the safeguard mechanism to submit information on projected emissions from their project and on emission reduction obligations imposed by the mechanism.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/breakthrough-eating-disorder-financial-audit-questions/105652960",
        "title": "Auditors question future of prominent mental health charity",
        "publish_date": "Fri, 15 Aug 2025 23:15:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The future of a prominent South Australian mental health charity — responsible for delivering a new eating disorder service that has received millions of dollars in government funding — is in question, after auditors raised concerns about its financial position.\n\nBreakthrough Mental Health Research Foundation has reported a \"deficit in equity\" of nearly $2 million, according to documents filed in June with the Australian Charities and Not-for-profits Commission (ACNC).\n\nIndependent auditors concluded there was \"material uncertainty\" that may cast \"significant doubt\" over the charity's ability to continue operating.\n\nBreakthrough Mental Health Research Foundation has reported a \"deficit in equity\" of nearly $2 million. (ABC News: Guido Salazar)\n\nBut Breakthrough said it was confident it would remain afloat — and expected its financial position to improve once work began on the new eating disorder facility.\n\nSA Health has confirmed it is in ongoing discussions with Breakthrough about its financial situation.\n\nWork on the centre, located at the Repat Health Precinct, was slated to begin in mid-2025 and take 18 months to complete — but it has not yet started.\n\nService plagued by years of delays\n\nThe new statewide eating disorder service was first announced in 2019 as a $7.1 million facility, with the former federal Liberal government to contribute $5 million and Breakthrough to fundraise the remainder.\n\nThe project, led by Breakthrough, would be delivered in collaboration with SA Health and Flinders University and include a five-bed residential unit, day program and outpatient clinics.\n\nBut it stalled for five years until the current federal and state governments each contributed another $2.5 million in December 2024, taking the total budget to $12.1 million.\n\nThe top-up came six months after auditors first flagged concerns over Breakthrough's financial position, mentioned in the previous year's audit.\n\nIn 2019, as part of its $2.1 million contribution to the project, Breakthrough announced it had secured a $500,000 donation from mental health and wellbeing charity the Fay Fuller Foundation.\n\nThe new statewide eating disorder service was first announced in 2019 but has been plagued by delays. (ABC News: Guido Salazar)\n\nHowever, the foundation has confirmed it did not go ahead with the donation — and its formal involvement in the project ended in 2022.\n\nA Fay Fuller Foundation spokesperson did not address questions about why the funding was withdrawn.\n\nA Breakthrough spokesperson said the charity was \"comfortable that interest is sufficient to meet its fundraising contribution towards the project\".\n\nLease to recover costs\n\nAt the end of last year, Breakthrough reported a deficit in equity of $1.94 million, meaning the charity would be short by that amount when repaying its debts if it collapsed.\n\nIt also has a fully drawn $1.59 million loan from the Flinders Foundation.\n\nBreakthrough, which was paid the initial $5 million in government funding in 2022, reported $5.53 million in \"total current assets\".\n\nThe new eating disorder service is to be housed at the Repat Health Precinct. (ABC News: Guido Salazar)\n\nThe charity's spokesperson said accounting regulations meant the $5 million in government funding is currently classed as a deficiency — but it would \"become positive\" once work on the eating disorder service began.\n\nHe said Breakthrough, as a start-up organisation, had for several years paid out more in grant funding than it received in operating income.\n\nAsked about the loan, he said the Flinders Foundation, which founded Breakthrough in 2020, seeded it with cash to invest in its growth and development.\n\n\"Breakthrough has met its commitments under the loan arrangement to date, and makes provisions for all future payments,\" he said.\n\nBreakthrough also plans to recover costs through a 40-year lease that will require SA Health to pay rent on the centre — despite taxpayers contributing $10 million for its construction.\n\nThe SA government says Breakthrough has not flagged any issues with them. (ABC News: Guido Salazar)\n\nIn a statement, a SA Health spokesperson said the department would not pay market rent for the site.\n\nIt is understood, under the arrangement, Breakthrough would receive reimbursement for operating expenses such as maintenance and security.\n\nGovernment 'in discussions' with Breakthrough\n\nFollowing initial inquiries from the ABC, made in July, the SA Health spokesperson said standard measures were in place to manage \"scenarios where project requirements are not able to be upheld\".\n\nBut she said Breakthrough had not flagged any issues.\n\n\"We are in regular communication with Breakthrough Mental Health Research Foundation and we're not aware of any issues with respect to Breakthrough's financial position,\" she said.\n\nIn an updated statement, provided on Friday, SA Health said it was now looking into Breakthrough’s financial position.\n\n\"Since the previous statement provided to the ABC … the Department for Health and Wellbeing and the Southern Adelaide Local Health Network have been in discussions with both the Flinders Foundation and Breakthrough to further understand their financial position and these discussions are ongoing,\" the spokesperson said.\n\nHealth Minister Chris Picton said the government was committed to the delivery of the service.\n\nIn a statement, a spokesperson for the federal Department of Health, Disability and Ageing said \"any arrangements between South Australia and Breakthrough Mental Health Research Foundation are a matter for the South Australian government\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/michael-theo-on-autism-and-work/105558342",
        "title": "Autistic people bring 'impressive gifts' to work, but many aren't given a chance",
        "publish_date": "Fri, 15 Aug 2025 22:13:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Michael Theo first appeared on Love on the Spectrum, viewers were drawn to his authenticity, determination and charm.\n\nMichael was a fan favourite and while he didn't find love on the show, he was able to use his profile to springboard into a more meaningful career and has since built an impressive CV.\n\nFor many autistic people, though, these kinds of opportunities are hard to come by.\n\nThe unemployment rate for people with autism is six times higher than the \"non-disabled population\", according to the Australian Bureau of Statistics, and advocates say employers often view neurodivergence as a limitation rather than a strength.\n\nBut Michael is out to prove that when autistic people are given a chance to thrive in meaningful work, they're capable of great success — just like everybody else.\n\nOne chance can change everything\n\nMichael wasn't always destined for stardom. He spent his early career working at a kitchen manufacturer, which he describes as one of his \"worst jobs\".\n\n\"Factories are like prisons in my eyes,\" he says.\n\nAlthough always secretly hopeful he would end up in showbiz, Michael admits it was opportunity, rather than hard work, that saw him get his foot in the door.\n\nActors Ben Miller, Michael Theo and Sally Phillips on the set of ABC comedy series Austin. (ABC)\n\nNow a world away from his \"soulless\" factory job, Michael is imploring autistic people not to let others choose their path for them.\n\n\"If you're given an opportunity, take it,\" he says.\n\nAustin Season Two Photo shows S2 Austin promo Stream all episodes of the brand new season now on ABC iview.\n\nMichael believes his natural strengths — authenticity, honesty and ability to follow direction — make him an excellent performer and have allowed him to find success in the acting world.\n\nIt's this strengths-based approach that advocacy groups say is the best path to meaningful employment for autistic people.\n\nFinding the right fit\n\nSharon Fraser, chief executive of Reframing Autism, says most autistic people have deep passions, and when this aligns with their employment, it can be life-changing.\n\nHowever, she stresses the need for workplaces to think differently when it comes to neurodivergence.\n\n\"Many organisations might see employing an autistic person as like charity work, and that's just not the case,\" she says.\n\n\" When autistic people are appropriately accommodated, we bring some really impressive gifts to any workplace. \"\n\nIt's a sentiment shared by George Arkinstall who, with his autistic brother Harry, founded a successful gardening business that employs people on the spectrum.\n\nGeorge says one particular employee has found his passion in gardening and is now studying the field at TAFE.\n\nGardening a Difference aims to be a \"stepping stone\" for people on the spectrum to develop their confidence and pursue their passions. (Supplied)\n\n\"He's wanted to be a sports turf manager since he was in grade 9 … he knows every lawn mower you point out from down the street,\" he says.\n\nBut George says for other employees, working at Gardening a Difference is about personal growth and development.\n\n\"When people come to our job interviews, they've often experienced rejection from many, many job interviews prior … [they've also been] ostracised from a very early age and have an awareness of their 'difference',\" he says.\n\n\"You see this almost-like armour, the version of themselves that's protecting themselves. Then, as they meet the team and get into the rhythm of things, they start to open up.\n\n\"Gardening is the medium to learn about teamwork, build skills and build confidence, and that belief in themselves. That affects someone's ability and willingness to put themselves in positions where doors open.\"\n\nBrothers Harry and George Arkinstall co-founded the inclusive gardening business. (Instagram: gardeningadifference)\n\nGeorge says a positive and inclusive work environment can be built in any industry, whether it's car cleaning, data entry or medicine.\n\n\"We have to be careful not to constrain what people on the spectrum can do,\" he says.\n\n\"It's not so much about gardening … I think it's more about instilling this meaning in people's life.\"\n\nFinding purpose in meaningful work\n\nThis sense of meaning is something Michael is now driven by in his multi-faceted career.\n\n\"My true purpose is being an actor and spreading awareness of my lived experience on the spectrum,\" he says.\n\nAs well as finding personal fulfilment, Michael has enjoyed other benefits like making new friends, having the freedom to travel and not being \"tied down\" to a full-time job.\n\nHe's currently saving up to buy his own home, something he said would be even harder had he not pursued an acting career that pays \"quite well\".\n\nMichael now works as an autism advocate in various capacities, including public speaking. (Instagram: mr_a_plus_michael)\n\nIn addition to his television work, Michael is a public speaker, podcast host, voiceover artist, advocate and now a consultant.\n\n\"Working as an autism consultant allows me to share my story so that other people on the spectrum can accomplish their dreams and goals,\" he says.\n\nHis advice for people on the spectrum is simple: \"Follow your heart.\"\n\n\"If you're going to do something you want to do but you feel too nervous, just take it step by step.\"\n\nSharon from Reframing Autism says Michael's desire to find employment that offers purpose is a universal experience.\n\n\"So many of us get a huge amount of purpose and fulfilment and connection from our work … it's no different for autistic people,\" she says.\n\n\"We … place a hierarchy on what jobs are important and what jobs are not important, but if you find your own meaning, your own joy, your own fulfilment from the work that you're doing, then who gives a crap about how society might see that?\"\n\nFear of unknown impeding workplace diversity\n\nBoth Sharon and George say there's some work to do to drive true inclusion, with traditional working hours and a lack of awareness among the challenges.\n\nSharon says full-time work can be unsustainable, and this is reflected in ABS data from 2022, which found almost three in four autistic people with a job work part-time.\n\nSharon Fraser is a late-diagnosed autistic woman and has spent most of her career as a senior finance leader. (Reframing Autism)\n\n\"Entrepreneurship seems to be a really good option for lots of folks. It can give you the flexibility and the sense of achievement,\" she says.\n\n\"It really is that sort of creative problem solving. If you can find that way to connect the thing that brings you joy with a need somewhere: that's the secret sauce.\"\n\nFor George, greater understanding of the autism spectrum is key to building more diverse workplaces.\n\n\"Not enough people are exposed to interacting with people on the autism spectrum growing up, and in different facets of their life,\" he says.\n\n\"When you have two resumes on your desk and one person has autism … then that fear starts, and people don't engage.\n\n\"That happens over and over again on a large scale within our society. And then all of a sudden, you have these people being left behind.\"\n\nGeorge says every business needs to employ people on the spectrum to avoid creating a society where segregated employment is the norm.\n\n\"We just can't hope for only these people that grew up with people on the spectrum to start businesses and to be able to employ people on the spectrum,\" he says.\n\nStream the new season of Austin now on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/wa-government-rooftop-solar-investment-push/105649258",
        "title": "Just 13pc of rooftop solar capacity realised, advocates say",
        "publish_date": "Fri, 15 Aug 2025 22:06:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "At first blush, Suzanne Bradshaw and Greg Ash could be your typical household power consumers.\n\nThey live in a house they built six years ago on a battleaxe block in the inner Perth suburb of Mount Lawley.\n\nLike so many households, theirs is one that increasingly relies on electricity — from the gadgets under their roof to the solar panels on top of it.\n\nBut look a little closer and a different picture emerges.\n\nIn a workshop attached to the house are a number of kilns — electric furnaces used by Ash to make glass.\n\nSuzanne Bradshaw and Greg Ash use solar power to help meet the energy needs of their glass furnaces. (ABC News: Courtney Withers)\n\n\"I've been working on glass, this type of glass, for 23 years now,\" the 72-year-old says.\n\n\"So they [the kilns] can consume a fair bit of power.\"\n\nGiven their power needs, the couple have had to take steps to mitigate their exposure to the grid — and its associated costs.\n\nAsh has worked with glass for two decades. (ABC News: Courtney Withers)\n\nThey were early adopters of solar power, forking out more than $20,000 for panels when the technology was still relatively expensive.\n\nIn 2019, when they moved into their new house, they installed an even bigger system and followed it up with a battery a couple of years later.\n\nAnd to round it out, they have signed up for a type of dynamic pricing known as a time-of-use tariff, enabling them to draw dirt cheap power off the grid between 9am and 3pm every day.\n\nBradshaw and Ash spent $20,000 on solar panels to help power their home. (ABC News: Glyn Jones)\n\nIt costs them about nine cents for every kilowatt hour they buy from their retailer during those hours — but up to 45 cents per kilowatt hour at other times.\n\nTheir household battery helps Ash and Bradshaw to access power outside peak times. (ABC News: Courtney Withers)\n\n\"The good thing about that is if it's an overcast day and you're not getting as much solar coming in, you can top up your battery during the middle of the day,\" Bradshaw says.\n\n\"That also means we're not using electricity during the peak… that other consumers need.\"\n\nBradshaw and Ash are among the 400,000 small-scale solar customers in WA. (ABC News: Courtney Withers)\n\nThe couple's circumstances are increasingly common among Australian consumers.\n\nAustralia has long led the world in its adoption of rooftop solar and Western Australia is no exception.\n\nThere are more than four million small-scale solar installations across the country's homes and businesses — equivalent to about one in three customers.\n\nRegistrations for batteries under the Commonwealth's small-scale green energy scheme have exceeded those for solar panels for the first time. (ABC News: Courtney Withers)\n\nIt's a similar figure in WA, where about 400,000 small-scale customers have solar.\n\nAnd now, courtesy of generous subsidies led by the Commonwealth, uptake of batteries is booming, too.\n\nFor the first time, registrations for batteries under the Federal Government's small-scale green energy scheme exceeded those for solar panels in July.\n\nScratching the surface\n\nA new report commissioned by the office of Brad Pettitt, the leader of the WA Greens, is urging the Cook Government to go much further.\n\nThe report, written by green power advocates Sustainable Energy Now, suggests WA has barely scratched the surface of its rooftop solar capacity.\n\nIt says \"only 13 per cent of the potential capacity\" for rooftop solar has been realised in WA's main grid, which spans the country's south-western corner.\n\nThe report found WA has yet to realise its potential in the solar energy space. (ABC News: Courtney Withers)\n\nAnd it notes that of those customers who have solar, fewer than one in 20 have a battery as well.\n\nThe lobby argues that better capitalising on WA's capacity for small-scale solar power and batteries could dramatically cut the need for large-scale projects required as part of the transition away from fossil fuels.\n\n\"Fully utilising suitable rooftops\" could slash the need for wind and solar farms while halving the requirement for new high-voltage power lines and saving billions, it argues.\n\nCrucially, it says small-scale solutions will also be much quicker than large-scale ones, a key advantage given the government's plan to get out of coal power by 2029.\n\nThere's been an uptick in the adoption of household batteries in WA. (August 2025) (ABC News: Courtney Withers)\n\nPettitt says the state's current plan, which relies on large-scale projects, is off track.\n\nBrad Pettitt says the state government should prioritise small-scale solar, instead of big projects. (ABC News: Courtney Withers)\n\n\"The fastest and fairest way to decarbonise is actually utilising our rooftops,\" Pettitt says.\n\n\"There are savings in the billions around needing less transmission.\n\n\"We're saying 'let's get smart about this, using existing rooftops, we don't need to clear vegetation, we don't need to put in new transmission, we can do it now and we can do it quickly'.\"\n\nWhat are the risks?\n\nSelling excess solar to your neighbour could shake up the energy market Photo shows An illustration of rows of houses in blue. One house with panels is connected to the two neighbouring properties. For all Australia's success in adopting rooftop solar, millions of people are missing out. Now a new trial is aiming to overcome that divide through trading.\n\nNot everyone supports the proposal.\n\nGreg Watkinson, the former chief executive of WA's economic watchdog and a director of Electricity Market Advisory Services, says there are risks for consumers in the plan.\n\nHe says there are significant costs incurred by households and small businesses when they invest in solar panels and batteries and many can over-capitalise.\n\nBy contrast, he says there are economies of scale when big businesses invest in large-scale projects such as major batteries and wind farms.\n\nWhat's more, he says those big businesses are sophisticated investors \"who know what they're doing and it's their money to burn — if they waste it, it's on them\".\n\nGreg Watkinson says solar is not a risk-free energy solution for consumers. (ABC News: Courtney Withers)\n\n\"The risk is that households end up spending too much,\" Watkinson says.\n\n\"If we ended up having solar panels on everyone's roofs, maybe we'd be spending too much.\n\nCan Australia's staggering 'small-scale flex' save our energy future? Photo shows Electricians place solar panels on roof As Australia's energy transition hits turbulence, a quiet but fundamental shift is underway.\n\n\"I expect we would be, so I don't think that's the way to go.\"\n\nWA Energy Minister Amber-Jade Sanderson declined a request for an interview.\n\nInstead, she issued a statement in which she said the government \"recognises the importance of harnessing our vast rooftop solar resource\".\n\nThe Minister noted the government is helping up to 100,000 households to get batteries through its — albeit watered down — subsidy scheme.\n\nAsh says investing in solar has been worth the risk. (ABC News: Courtney Withers)\n\nGlass artist Greg Ash thinks he's ahead of the game now he's got a battery along with his solar panels.\n\n\"All you have to do is look at what's happening in the eastern states as opposed to here,\" Ash says.\n\n\"We're better off with our power and gas than they are, but it will come back and bite us here, so people should be looking at solar and battery.\n\n\"And hopefully that will get cheaper for the average person.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/bethell-to-become-england-youngest-men-cricket-captain-at-21/105661958",
        "title": "Jacob Bethell to become England's youngest men's cricket captain at 21",
        "publish_date": "Fri, 15 Aug 2025 21:49:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jacob Bethell will break a record which has stood for 136 years when the 21-year-old all-rounder becomes England's youngest ever men's cricket captain next month.\n\nBethell will lead England against Ireland in three T20 Internationals in Dublin.\n\nThe previous youngest England captain was Monty Bowden, who was 23 in 1889 when he took charge for a Test in South Africa after regular skipper Aubrey Smith fell ill with fever.\n\nSome senior players will be missing in Ireland, including usual white-ball captain Harry Brook, who will be in charge of one-day international and T20I games against visiting South Africa earlier in September.\n\n\"Jacob Bethell has impressed with his leadership qualities ever since he has been with the England squads, and the series against Ireland will provide him with the opportunity to further develop those skills on the international stage,\" England men's selector Luke Wright said in a statement on Friday.\n\nThe captaincy is part of a rapid rise for Bethell, who made his debuts for England in all three formats only last year.\n\nThe series in Ireland begins on September 17, after England's tour of South Africa for three One-Day Internationals (ODI) and three T20 matches, starting September 2.\n\nRight-arm fast bowler Sonny Baker has earned his first national team call-up for the ODIs against South Africa after the 22-year-old impressed selectors with his performance for England Lions and in domestic cricket.\n\nEngland will then travel to New Zealand in October for a white-ball tour, followed by five Ashes Tests in Australia from November.\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-16/brisbane-home-prices-no-change-rate-cut-new-laws/105660078",
        "title": "New laws won't ease house prices in south-east Queensland, experts say",
        "publish_date": "Fri, 15 Aug 2025 21:28:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Experts say south-east Queensland’s \"extreme rate\" of property price growth is unlikely to be affected by new seller disclosure laws which came into effect in August.\n\nUnder the new laws, sellers must provide a mandatory comprehensive disclosure statement before signing a contract.\n\nIt must include any relevant information about land contamination, zoning, heritage listings, transport resumption plans and accurate rates and water charges.\n\nBut with Brisbane leading the country in profitable property resales, Domain’s Dr Nicola Powell said south-east Queensland remains a sellers’ market.\n\nNew seller disclosure laws came into effect in Queensland on August 1. (ABC News: Pete Mullins)\n\nMore than 99 per cent of properties on the market in Brisbane sold for a profit in the first six months of 2025, according to new data from Domain.\n\nThe median profit from a house sale in Brisbane was $480,000 – up from $145,000 in 2019.\n\n\"Brisbane’s almost been in this kind of super cycle,\" Dr Powell said.\n\nDr Nicola Powell says the new laws offers a level of transparency for potential buyers. (Supplied)\n\n\"There are a lot of things happening economically for south-east Queensland and there's a lot of competition when you think about the lack of new homes being built.\"\n\n'Strengthening' the sector\n\nWith the Brisbane 2032 Olympic and Paralympic Games on the horizon, competition from the infrastructure sector will draw workers away from residential building, Dr Powell said.\n\nReal estate agents claim the changes have led to a 'bottleneck' in sales, but Dr Powell said the laws bring Queensland in line with other states and territories.\n\n\"This is about strengthening the property sector,\" Dr Powell said.\n\n\"It's about ensuring buyers have all of the information they need.\n\n\"We have to remember most people's largest asset [is] their home. If you've got a seller trying to manipulate the system or hide something about the property, what this is trying to do is add that level of transparency.\"\n\nWhat's in store for south-east Queensland's real estate market in 2025 Photo shows A for sale sign outside a home next to a new home being built Will it be a buyer's or a seller's year? We've asked the experts what to expect.\n\nDr Powell said the high costs associated with the property market means owners are holding on to their homes for longer.\n\n\"Things like stamp duty, which are really a disincentive to move. They add tens of thousands of dollars to a property transaction,\" she said.\n\nDemand for property 'incredibly strong'\n\nA new rate cut from the Reserve Bank — the third so far in 2025 — will have a \"short-lived\" impact on the Brisbane market, Antonia Mercorella from the Real Estate Institute of Queensland (REIQ) said.\n\n\"There tends to be a bit of a holding pattern that occurs around the time of the [rate cut] announcement,\" Ms Mercorella said.\n\n\"It’s probably not as significant as one might think simply because the demand for property here is just so incredibly strong.\"\n\nAntonia Mercorella says sellers should consider organising disclosure documents early, to avoid delays down the line. (ABC News: Michael Lloyd)\n\nMs Mercorella said she believes the \"scarcity problem\" will continue to drive prices up.\n\n\"Even if people aren’t getting those interest rate cuts that they’re hoping for, they’re still needing to secure that shelter, so that’s ultimately what’s the biggest factor at play,\" she said.\n\nWhile it might not impact prices, the new disclosure scheme could initially see some contracts delayed, Ms Mercorella said.\n\n\"There are concerns that it will slow things down. As time marches on, we will get better at preparing these disclosure documents.\"\n\nQueensland's housing market 'frozen' after new property laws come into effect Photo shows A house with a white picket fence and a for sal sign out the front. Tough new disclosure laws for property sales came into effect in Queensland on August 1.\n\nFor sellers frustrated by a new legislative hurdle, Ms Mercorella said preparation is key.\n\n“The moment you are engaging a real estate agent that’s when you should start thinking about the preparation of that seller disclosure statement so that it doesn’t lead to delays when a buyer comes along,” she said.\n\nMs Mercorella said the changes could also help sellers and potentially lead to fewer contract terminations.\n\n\"There is an argument to be made that actually they may reduce the number of contract terminations because a buyer is entering into the contract with better knowledge about the key matters affecting the property.\"\n\n\"It enables you to identify any issues affecting the property of a negative nature that could be addressed before putting it on the market.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-august-16-2025-20250816-p5mnfk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, August 16, 2025",
        "publish_date": "Sat, 16 Aug 2025 12:00:10 +1000",
        "category": "finance",
        "authors": [],
        "text": "9/26\n\nLuciana and Mario Martini from the Careless documentary. The documentary is about the aged care crisis. Luciano and Mario have been married for many years and want to stay living at home for as long as possible Credit:Justin McManus",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/former-australian-cricket-captain-and-coach-bob-simpson-dies-aged-89-20250816-p5mnfe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Australian cricket captain and coach Bob Simpson dies, aged 89",
        "publish_date": "Sat, 16 Aug 2025 10:56:21 +1000",
        "category": "sports",
        "authors": [
            "Chloe Saltau"
        ],
        "text": "Former Australian cricket captain and coach Bob Simpson has died at the age of 89.\n\nSimpson was a giant figure in Australian cricket for more than four decades, playing 62 Test matches, famously emerging from retirement at age 41 to lead Australia during the World Series Cricket era, and later becoming the nation’s first full-time coach.\n\nBob Simpson and Shane Warne at a training session, 1996. Credit: Fairfax\n\nCricket Australia confirmed his death to this masthead on Saturday morning.\n\nAlong with captain Allan Border, Simpson instilled new standards of fitness and discipline to oversee an Australian renaissance that included winning the World Cup in 1987, regaining the Ashes in 1989, and with captain Mark Taylor beating the mighty West Indies away from home in 1995.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/how-177-bombs-came-to-rest-under-a-children-s-playground-in-england-20250816-p5mnf8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How 177 bombs came to rest under a children’s playground in England",
        "publish_date": "Sat, 16 Aug 2025 10:10:01 +1000",
        "category": "finance",
        "authors": [
            "Evie Glynne"
        ],
        "text": "London: Bomb dispersal teams rarely get called out to the picture postcard town of Wooler, in Northumberland. But in February this year, vans, diggers and the world’s media descended on the town, in the Cheviot Hills, coming to a stop where a playground used to be.\n\nIt happened after Steven Parkinson, a local builder, had been tasked with digging up Scotts Park in the town after the parish council secured a grant for the renovation of the play area.\n\nThe bombs were discovered as a construction project was under way to renovate the Scotts Park playground in Wooler. Credit: Mark Mather\n\nAs he set to work on January 14, a “suspicious” object caught his eye. He alerted Kerren Rodgers, the clerk of the parish council, who was equally baffled.\n\n“Dealing with a suspected bomb in a playground is not exactly something they cover in the clerk’s manual,” she told the BBC adding that the authorities had nevertheless cordoned off the playground and an Explosive Ordnance Disposal team was called.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/no-deal-between-putin-and-trump-in-ukraine-negotiations-20250816-p5mnf4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No deal between Putin and Trump in Ukraine negotiations",
        "publish_date": "Sat, 16 Aug 2025 09:22:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "No deal between Putin and Trump in Ukraine negotiations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/rising-wedding-costs-are-also-jacking-up-the-price-for-guests-20250816-p5mnez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rising wedding costs are also jacking up the price for guests",
        "publish_date": "Sat, 16 Aug 2025 08:57:49 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Rising wedding costs are also jacking up the price for guests\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-saturday-august-16-20250816-p5mney.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Saturday August 16",
        "publish_date": "Sat, 16 Aug 2025 08:46:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Saturday August 16\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/king-charles-and-queen-camilla-meet-veterans-marking-anniversary-of-vj-day-20250816-p5mnev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles and Queen Camilla meet veterans marking anniversary of VJ Day",
        "publish_date": "Sat, 16 Aug 2025 07:37:14 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles and Queen Camilla meet veterans marking anniversary of VJ Day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/epl-2025-live-updates-liverpool-fc-take-on-bournemouth-in-highly-anticipated-english-premier-league-season-opener-20250815-p5mn8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Late goals, Jota tributes and racism claim as Liverpool win English Premier League opener",
        "publish_date": "Sat, 16 Aug 2025 07:28:48 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "This has been some way to open the new Premier League season. If you need a reason to start watching a little more religiously in 2025/26, this might be enough to twist your arm. And if you missed this game, it’s probably one to re-read from the start of the blog today and watch on replay, whether your support Liverpool or Bournemouth or not.\n\nHere’s a wrap-up of the match from Reuters, and keep your eyes peeled for some commentary a little later. Thanks for your company.\n\nLiverpool talisman Mo Salah and fellow forward Federico Chiesa struck late goals as the Premier League champions began the defence of their title by beating Bournemouth 4-2 in a thriller on the opening night of the season at Anfield on Friday.\n\nOn a bittersweet evening charged with emotion after the July death of Liverpool forward Diogo Jota, newcomer Hugo Ekitiké bagged a goal on his debut to put the hosts ahead after 37 minutes and Cody Gakpo doubled the lead in the 49th.\n\nBut Antoine Semenyo, who was the target of racist abuse in the first half that led to a pause in the game, pulled one back for the visitors in the 64th minute and completed a double 12 minutes later to rock Liverpool and shock the home fans.\n\nHowever, substitute Chiesa sent the Liverpool faithful away happy with an 88th-minute strike after goalkeeper Djordje Petrovic swatted away a ball into the box by Salah, who scored himself deep into added time to wrap up the three points.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/salah-seals-win-for-liverpool-20250816-p5mnes.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Salah seals win for Liverpool",
        "publish_date": "Sat, 16 Aug 2025 07:16:29 +1000",
        "category": "sports",
        "authors": [],
        "text": "Salah seals win for Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/alleged-racism-stops-premier-league-opener-20250816-p5mneq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alleged racism stops Premier League opener",
        "publish_date": "Sat, 16 Aug 2025 07:06:21 +1000",
        "category": "sports",
        "authors": [],
        "text": "Alleged racism stops Premier League opener\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/liverpool-pay-tribute-to-jota-20250816-p5mnen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool pay tribute to Jota",
        "publish_date": "Sat, 16 Aug 2025 06:42:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Liverpool pay tribute to Jota\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/ciraldos-stinging-message-for-players-after-loss-20250816-p5mnem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ciraldo's stinging message for players after loss",
        "publish_date": "Sat, 16 Aug 2025 06:31:48 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ciraldo's stinging message for players after loss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-16-august-2025/i4gtw9pz3",
        "title": "Midday News Bulletin 16 August 2025",
        "publish_date": "Sat, 16 Aug 2025 01:59:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nThe US and Russian presidents fail to come to a Ukraine peace deal\n\nA 5.6 magnitude earthquake strikes Queensland leaving thousands without power\n\nBrisbane thrash Fremantle by 57 points as Fyfe’s finals hopes fade\n\nParents and unions have cautiously welcomed reforms to Working with Children Checks but say further action is needed to protect children.\n\n\n\n\n\nUnder changes announced on Friday, anyone barred from holding a check in one state or territory will, by year’s end, be automatically banned nationwide.\n\n\n\n\n\nAttorney-General Michelle Rowland calls the reform long overdue but rules out a single national system, with states and territories continuing to run their own checks.\n\n\n\n\n\n\"This is long overdue reform that Australians rightly expect will be delivered. We do not have a national scheme, and the states and territories administer those schemes. We are looking at a way in which we can get the most efficient outcome, and that is by individual state schemes talking to one another. That’s what we are going to do through the National Checking Capability, and that’s what states and territories have agreed.\"\n\n\n\n\n\nThe Australian Childcare Alliance says the move would help close dangerous loopholes but urged further measures, including a national register for early childhood educators and teachers.\n\n\n\n\n\n**\n\n\n\n\n\nUnited States President Donald Trump says he and Russian President Vladimir Putin were not able to reach an agreement at talks in Alaska, but he believes progress has been made toward achieving a ceasefire in Ukraine.\n\n\n\n\n\nThe summit has been the first face-to-face encounter for the two leaders since 2019.\n\n\n\n\n\nWhile President Trump seemed confident of achieving a deal with Russia prior to the meeting, he now says there are still some key points that need to be addressed first.\n\n\n\n\n\n\"There's no deal until there's a deal. I will call up NATO in a little while, I will call up President Zelenskyy and tell him about today's meeting. It's ultimately up to them. But we had an extremely productive meeting and many points were agreed to and there are just a very few that are left. Some are not that significant. One is probably the most significant, but we have a very good chance of getting there. We didn't get there, but we have a very good chance of getting there.\"\n\n\n\n\n\nPresident Putin praised Mr Trump for helping make diplomatic progress toward peace.\n\n\n\n\n\n\"Our talks were held in a constructive and mutually respectful atmosphere, and were very thorough and useful. I would like to thank my American colleague once again for the offer to come to Alaska. It is quite logical to meet here. After all, our countries, although separated by oceans, are in fact close neighbours.\"\n\n\n\n\n\nMr Putin has also suggested the next round of talks could take place in Moscow.\n\n\n\n\n\n**\n\n\n\n\n\nThe Albanese government has welcomed the diplomatic steps taken by United States President Donald Trump at talks with Russian President Vladimir Putin in Alaska.\n\n\n\n\n\nAttorney-General Michelle Rowland tells Channel Seven that all tools must be used to push for an end to Russia's invasion of Ukraine.\n\n\n\n\n\n\"Russia's illegal invasion of Ukraine has been going on for too long and we as a government welcome the United States involvement to try to bring this conflict to a close. Australia stands with Ukraine and any methods and any useful tools that the US could have at its disposal through this meeting is one that we certainly welcome because I'm sure that all Australians want to see this conflict end, as does the rest of the free world.\"\n\n\n\n\n\n**\n\n\n\n\n\nAn earthquake has struck Queensland with thousands feeling the effects near Australia's east coast.\n\n\n\n\n\nGeoscience Australia registered a 5.6 magnitude earthquake near the Wrattens National Park at Kilkivan, about 170 kilometres northwest of Brisbane this morning.\n\n\n\n\n\nThe quake was recorded about 9:50am at a depth of two kilometres.\n\n\n\n\n\nMore than 6000 people told the agency that they felt the affects of the quake within half an hour.\n\n\n\n\n\nThe agency says earthquakes above magnitude five occur every one-to-two years, with an average of 100 quakes at magnitude three or lower recorded each year in Australia.\n\n\n\n\n\n**\n\n\n\n\n\nHalf a century ago then prime minister Gough Whitlam poured a handful of soil into the hands of a man who had led an eight-year protest for the rights of his people\n\n\n\n\n\n\n\nOn the 16th of August 1975 Mr Whitlam travelled to Wave Hill Station, about 600 kilometres south of Darwin, to hand back land to the Gurindji people.\n\n\n\n\n\nIt was the first time the Commonwealth Government had returned land to its original custodians.\n\n\n\n\n\nDuring the handover ceremony, transferring leasehold title to a parcel of land at the Wave Hill cattle station to Gurindji people, Mr Whitlam poured the soil into the hands of senior Elder Vincent Lingiari.\n\n\n\n\n\nPrime Minister Anthony Albanese says the iconic image of the exchange is an enduring tribute to the courage, determination and solidarity of Gurindji people.\n\n\n\n\n\n**\n\n\n\n\n\nIn football, Liverpool have beaten Bournemouth in a 4-2 thriller at Anfield in the opening match of the Premier League season.\n\n\n\n\n\nNewcomer Hugo Ekiteke bagged a goal on his debut before Cody Gakpo doubled the lead at the beginning of the second half.\n\n\n\n\n\nBut Antoine Semenyo, who was the target of racist abuse from fans in the first half, scored twice in 12 minutes to shock the home fans and level the playing field.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/5-6-magnitude-earthquake-recorded-near-brisbane/dhrphuixm",
        "title": "'Anyone else feel that?': Queensland magnitude-5.6 earthquake felt near Brisbane",
        "publish_date": "Sat, 16 Aug 2025 01:06:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Residents in southern Queensland have been rocked by a magnitude-5.6 earthquake on Saturday morning, with tremors felt all the way down to Brisbane.\n\n\n\n\n\nThe Australian Government's national geoscience organisation, Geosciences Australia, reported the earthquake striking at around 9:49am on Saturday morning.\n\n\n\n\n\nIt reported the epicentre to be near Kilkivan — about 220 kilometres north-west of Brisbane — while the depth of the quake reached about 10 kilometres.\n\n\n\n\n\nResidents as far south as the Gold Coast and as far north as Hervey Bay reported feeling the tremor.\n\n\n\n\n\nSome were quick to joke on social media, while others reported feeling their houses shake.\n\n\n\n\"Woahhh earthquake on the Gold Coast... anyone else feel that? I assume that means median home price went through $2m?\" one user wrote on X.\n\n\n\n\n\nAnother joked: \"We will rebuild\".\n\n\n\nGeoscience Australia said there had been more than 10,000 \"felt reports\".\n\n\n\n\n\nThere is no tsunami risk.\n\n\n\n\n\nThis is a developing story and this article will be updated.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/now-16-jacki-is-among-international-bull-riders-competing-at-iconic-rodeo-in-queensland/5rqu9y39t",
        "title": "Now 16, Jacki is among international bull riders competing at iconic rodeo in Queensland",
        "publish_date": "Fri, 15 Aug 2025 21:30:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA rodeo ritual for team USA.\n\n\n\n\n\n(Team USA in a huddle): \"So we never stop fighting. We never give up. And when we win, it won't be by luck. Amen.\"\n\n\n\n\n\nEight-year-old Axton Hale is getting into the zone behind the chutes.\n\n\n\n\n\nHe's praying in a circle with other riders before taking on a bucking bull in the red dirt arena.\n\n\n\n\n\n\"Let's go now. Are you ready?\"\n\n\n\n\n\nThere's an organised chaos, with cowboys and cowgirls getting ready before they compete. The chaps are on and pep talks can be heard.\n\n\n\n\n\n\"It's just a fun sport, you get on cool bulls and ride cool bulls. I have some emotions if I fall off I might get a tiny little emotional but I have God with me.\"\n\n\n\n\n\nAxton is among dozens of young international competitors at the Mount Isa rodeo, which has been around since 1959.\n\n\n\n\n\nBut it's the first time the event has hosted a junior tri-national competition, with riders from the US, New Zealand and Australia going head-to-head.\n\n\n\n\n\n\"Hi my name is Jacki Gayle and I'm a bull rider on team USA.\"\n\n\n\n\n\nThe 16-year-old is the only female junior bull rider at this year's rodeo - hailing all the way from Texas.\n\n\n\n\n\nThe African American teenager started riding when she was just 11 years old, but it took months to convince her mother that the sport was safe.\n\n\n\n\n\n\"She called me crazy at first and thought that I was going to get hurt; and I wouldn't like it. But I tried and it and here we are four years later. And I've got all my friends and my rodeo family telling me that I can do this. And I don't know, it's just fun.\"\n\n\n\n\n\nJacki has earned recognition in various rodeo sanctions and currently holds the title of Southern New Mexico Rodeo Princess.\n\n\n\n\n\nShe recently competed in the Bill Pickett Youth Rodeo - an event in Texas which aims to honour Black rodeo history.\n\n\n\n\n\nJacki admits that growing up, she didn't see many cowboys and cowgirls that look like her - with representation now being an important part of her rodeo journey.\n\n\n\n\n\n\"There isn't very many dark skinned or African American cowboys out there. So it's nice for me to be one of the few who are trying to get more awareness and get more people into the sport.\"\n\n\n\n\n\nAnd she's not the only one bringing a unique flare to the arena.\n\n\n\n\n\nThe other nation competing against Australia and the USA - is New Zealand.\n\n\n\n\n\n(Sounds of Hakka dance and chant)\n\n\n\n\n\nIt's the first day of the rodeo and the sun is about to rise; standing in the empty arena, performing the Haka is the New Zealand team.\n\n\n\n\n\nLeading the Haka is Ty Blake, the 16-year-old bull rider attended his first rodeo when he was just 6 weeks old.\n\n\n\n\n\n\"Rodeo culture is just family, just one big family. Everyone's together, everyone helps each other out. Dad used to show jump way back in his glory days; and Mum's a horsemanship world champion. So I have good genes.\"\n\n\n\n\n\nHe says the sport has taught him resilience - and fearlessness.\n\n\n\n\n\n\"There's a song, called hooked on an 8 second ride and it's about the adrenaline that goes through. And it's something you can't get over. It's like an itch you just got to scratch it and ever since then, I've been scratching it.\"\n\n\n\n\n\nKylee Ferguson is the director for the youth rodeo organisation; and he helped co-ordinate the international talent for 2025.\n\n\n\n\n\n\"When we take teams to other countries, we really focus on that team building experience and making friends. To us the most important thing is getting the contacts on the other side of the world. You can see the friendships already formed and spending a lot of time together. I think, it's the best way to make friendships across the world.\"\n\n\n\n\n\n(Sound of cows mooing)\n\n\n\n\n\nA growing sport - making way for a new generation of rodeo athletes...\n\n\n\n\n\nIncluding up and coming First Nations bull riders: like 10-year-old Carl Douglas Jnr, who made the journey to Mount Isa from Cape York.\n\n\n\n\n\n\"It feels good, sitting on it and riding on it make your family proud. My family was doing bull riding - my cousin, brothers.\"\n\n\n\n\n\nThese young riders, hoping to win some buckles - and lend a hand along the way. Axton again.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/insideout-fijian-band-celebrates-pacific-island-heritage-on-australian-tour/mh6e86oho",
        "title": "INSIDEOUT: Fijian band celebrates Pacific Island heritage on Australian tour",
        "publish_date": "Fri, 15 Aug 2025 10:48:55 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "INSIDEOUT: Fijian band celebrates Pacific Island heritage on Australian tour\n\nPublished 15 August 2025, 8:42 am\n\nFijian band, Inside Out, fuses reggae grooves, pop and Fijian folk, in a celebration of their Pacific Island heritage. The group is currently on tour around Australia, and SBS went to meet them.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/milestone-for-multiculturalism-afl-sees-first-player-of-vietnamese-descent/c3ghhrlc8",
        "title": "Milestone for multiculturalism: AFL sees first player of Vietnamese descent",
        "publish_date": "Fri, 15 Aug 2025 10:37:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/national-reforms-fast-tracked-for-working-with-children-check-system/zyz9v6zd9",
        "title": "National reforms fast-tracked for 'Working With Children Check' system",
        "publish_date": "Fri, 15 Aug 2025 10:06:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-cochlears-dig-howitt-car-groups-william-elliott-asx200-milestone/81t4n7a3j",
        "title": "CEO Series: Cochlear's Dig Howitt & CAR Group's William Elliott & ASX200 milestone",
        "publish_date": "Fri, 15 Aug 2025 08:27:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/experts-warn-of-the-dangers-of-battery-fires/r67jaxbdj",
        "title": "Experts warn of the dangers of battery fires",
        "publish_date": "Fri, 15 Aug 2025 07:38:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Here in Australia we've had 11 plugin electric car battery fires nationally ever. That's the total number that we've ever had. These are primarily due to things like high-speed collisions. We've had several where there's been arson attacks and we've had at least three where electric cars have been in a private home garage and there's been another fire that's spread to the vehicle.\"\n\n\n\n\n\nEmma Sutcliffe is the Director of E-V FireSafe, a company funded by the Australian Department of Defence to research electric vehicle [[EV]] battery fires and emergency responses.\n\n\n\n\n\nShe says nationally since 2010 there have been 11 road-registered plug-in electric car fires in Australia.\n\n\n\n\n\nBut there has been a significant rise in fires related to lithium-ion batteries, including small lithium-ion batteries.\n\n\n\n\n\nMs Sutcliffe says more recently in Perth, four homes were burnt down in the space of 48 hours in July.\n\n\n\n\n\n\"Lithium-ion battery fire is known as thermal runaway and in an electric car you may have hundreds or even thousands of separate lithium-ion battery cells. When ne of those gets damaged, it short circuits and it releases a toxic flammable gas, and that gas ignites and then the heat spreads to the next cell and that cell bursts open and off-gases and ignites, and then that spreads to the next cell.\"\n\n\n\n\n\nShe says that chain reaction is very hard to stop.\n\n\n\n\n\n\"And once thermal runaway starts, it's very difficult to bring it under control or to stop it. So this is the challenge for firefighters - we can't really stop them or runaway in an electric vehicle very efficiently.\"\n\n\n\n\n\nMs Sutcliffe says the most frequent fire danger from electric vehicles lies with e-bikes and e-scooters, which are known to catch fire nationally at least every two days.\n\n\n\n\n\n\"This is because they're often made with poor quality battery cells. There's not a lot of regulation around how those products are built or sold. They take a lot of wear and tear in daily use. And the other challenge is that people bring their e-bike or their e-scooter into their home at the end of the day when they've come home from work or school and they plug it in their lounge room.\"\n\n\n\n\n\nShe says when the fires start in people's homes, the consequences are lethal.\n\n\n\n\n\n\"We've had five fatalities here in Australia from e-bike and e-scooter battery fires, and we are losing homes on a scarily regular basis. In fact, in Perth in July, there were four homes lost to e-bike and e scooter battery fires just in the space of 48 hours.\"\n\n\n\n\n\nGlobally over an 18 month period in 2022 to 2023, four entire families were killed by personal mobility devices [[PMDs]] that caught fire in their homes.\n\n\n\n\n\nThe experts say people don't realise that PMD safety requirements are pretty low compared to EVs and home batteries.\n\n\n\n\n\nSmaller items like vapes, power tools and power banks catch fire nationally daily.\n\n\n\n\n\n\"Now if your battery pack is looking swollen, if it's unexpectedly hot to touch, so you haven't been charging it or using it, but it feels really hot to touch or if it smells funny, they're some of the early warning signs that that battery may have an issue.\"\n\n\n\n\n\nMs Sutcliffe adds that if someone is experiencing any of those warning signs, then they should take that e-bike or e-scooter out of their home and away from anything flammable.\n\n\n\n\n\nGareth Morgan is the Director at E-V Fire Protection.\n\n\n\n\n\nThey developed the World's First Electric Under Vehicle Fire Suppression System.\n\n\n\n\n\nHe tells SBS News it's tricky to rely on statistics of electric vehicle fires.\n\n\n\n\n\n\"The statistics are very difficult to rely on, and that is because the data that's being captured around the world for electric vehicle fires and the difference of fires where those fires originate from, whether they're just a vehicle fire or a traction battery fire, that data's not actually being captured. So it's a very, very grey area.\"\n\n\n\n\n\nHe echoes similar sentiment as Ms Sutcliffe, saying its infrequent to get a vehicle battery fire.\n\n\n\n\n\n\"One of the big challenges that fire brigades certainly around Australia and around the rest of the world, are having on a daily basis, they are attending fires associated with micro mobility devices like scooters and skateboards and like a lot of that is a result of poor manufacturing.\"\n\n\n\n\n\nMr Morgan says it's important to follow the manufacturer's guidance for charging the vehicle.\n\n\n\n\n\nIt's understood that constant rapid charging and charging the vehicle to a very high state is known to be not very good for the battery and could contribute to faults occurring in the future.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-trump-putin-showdown-palestinian-statehood-gains-ground-haitis-bbq-bounty/tfa1d82kz",
        "title": "The Trump Putin showdown, Palestinian Statehood gains ground & Haiti's BBQ bounty",
        "publish_date": "Fri, 15 Aug 2025 07:38:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/china-up-usa-out-where-are-australians-travelling-in-2025/xqa6cd2i0",
        "title": "China up, US down: Why Australian travellers are moving away from old favourites",
        "publish_date": "Fri, 15 Aug 2025 07:27:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australians are switching up where they're travelling to, according to the latest annual report from the Australian Bureau of Statistics.\n\n\n\n\n\nThe top five destination countries in 2024-25 were Indonesia, New Zealand, Japan, the US and China.\n\n\n\n\n\nIndonesia — particularly Bali — remained at the top, accounting for 14 per cent, or 1,741,370, of Australian trips.\n\n\n\nREAD MORE Australians are obsessed with Japan, but a new travel hotspot is emerging\n\nJapan also continued its rise, stepping into the third place with 910,640 visitors. The number of trips to Japan has tripled compared with data from 2014-15.\n\n\n\n\n\nIt overtook the US, which dropped to fourth with 746,220 visits — down from third in 2023-24. The US was the only country in the top five where travel volumes were lower than 10 years ago, with 253,220 fewer trips in 2024-25 than 2014-15, a 25 per cent drop.\n\n\n\n\n\nChina moved up two places to become Australia's fifth most popular travel destination.\n\n\n\n\n\nTen years ago, in 2014-15, the top five countries were New Zealand, Indonesia, the US, the UK and Thailand.\n\n\n\nIndonesia topped the list of Australians' most popular travel destinations yet again, thanks to its island paradise of Bali. Meanwhile, the United States has dropped one place. Source: SBS News\n\nJapan up, US down\n\nAccording to Sara Dolnicar, Professor at the University of Queensland's Business School, the rise in interest in Japan is multifaceted — including a strong exchange rate, more affordable and shorter direct flights, and cultural motives such as cuisine, scenery and traditions.\n\n\n\n\n\nSkyscanner's 2025 travel trends report found that the top factors influencing destination choice were weather (66 per cent), attractions (65 per cent), food (63 per cent) and culture (59 per cent).\n\n\n\nTravel to the United States is 25 per cent lower than 10 years ago, while the number of trips to Japan has tripled compared to data from 2014-15. Source: SBS News On the other hand, Dolnicar says the United States may be seeing a dip in travel interest partly due to political insecurity.\n\n\n\n\n\n\"I don't know if it's specifically the Trump administration or whether it's the perceived volatility of decision-making, but there is absolutely no doubt that that has affected international travel into the US,\" Dolnicar said.\n\n\n\n\n\n\"I think for Australians, there is a bit of unease. But I wouldn't say it's that people feel the fear in their bones.\"\n\n\n\n\n\n\"The way consumers operate in their behaviour is that they'll still want to go to New York, but they'll say, 'maybe I'll just wait a couple of years.'\"\n\n\n\nAn increase in travel to China is not necessarily politically motivated either, Dolnicar said. Instead, it's more likely linked to the new policy introduced in November 2024, allowing Australian passport holders to travel in China for 30 days without a visa, she said.\n\n\n\n\n\n\"Being able to walk in and get a stamp for 30 days — that would have had a big effect [on the figures].\"\n\n\n\n\n\n\"With the US, people might say they love it, but now is not a good time. And now with China, they might have always wanted to check it out and they've made it easier to get in — so why not?\"\n\n\n\nThe bigger forces shaping travel\n\nWhile destination-specific factors matter, Dolnicar says five broader forces are influencing where Australians go: exchange rates, political insecurities (including safety), natural disasters, the cost of living, and the post-COVID desire for international travel.\n\n\n\n\n\nCost is often the first consideration, especially in a cost-of-living crisis. \"If you've seen that your disposable income is not sufficient, you'll just say that you can't travel that year,\" she said.\n\n\n\n\n\nMargy Osmond, CEO of peak industry group Tourism and Transport Forum Australia, said their data indicated two-thirds of the nation were planning a trip, but there was still a \"noticeable drop\" in those who actually took holidays.\n\n\n\n\n\n\"That suggests that while the desire to explore remains strong, cost-of-living pressures and economic uncertainty are influencing how and when people travel,\" Osmond told SBS News.\n\n\n\nExchange rates are also having an effect. Dolnicar points to a roughly 25 per cent increase in the value of the Australian Dollar over the Japanese Yen in the last decade: \"It's gigantic. For a dollar now, you get 25 per cent more holiday than you used to.\"\n\n\n\n\n\nOn the other side of the coin, the Australian Dollar's exchange rate with the US Dollar has fallen by almost 9 per cent over the last five years.\n\n\n\n\n\nOsmond added: \"While the US remains a bucket-list destination for many Australians, higher costs, a weaker exchange rate and the rising expense of long-haul flights have dampened demand.\"\n\n\n\nWhat's the next hotspot?\n\nOsmond predicts Australians may increasingly choose destinations closer to home, particularly in South East Asia and the Pacific.\n\n\n\n\n\n\"Many travellers are now gravitating towards destinations that offer better value and shorter travel times, particularly across Asia and the Pacific, which has seen some of the US market share shift elsewhere,\" she said.\n\n\n\n\n\n\"While traditional favourites like the US and Europe will remain aspirational, emerging destinations in Asia and the Pacific could enter the top five, and the industry will need to navigate challenges such as affordability, sustainability and seamless border experiences to meet travellers’ expectations.\"\n\n\n\n\n\nThe Australian Travel Industry Association's (ATIA) May 2025 travel trends report found Japan had the largest percentage increase year-on-year, with a 38.4 per cent rise, followed by China (+35 per cent) and Vietnam (+26.2 per cent).\n\n\n\n\n\n\"The whole of Asia is very attractive. It's close and it's affordable,\" Dolnicar said. \"Vietnam is kind of an alternative to Indonesia … it's a little bit more off the beaten track.\"\n\n\n\nLISTEN TO Up, up, and away: carbon emissions in the tourism industry on the rise SBS News 06:29 English\n\nBut climate change is also set to make a large impact on where and how Australians travel in the future — potentially making some destinations less viable and increasing ticket prices.\n\n\n\n\n\n\"Some popular ski areas will no longer have snow,\" Dolnicar said. \"That sunny and blue-skied destination might now have rainfall.\"\n\n\n\n\n\nShe warns that measures such as carbon limits or a mandated use of biofuels — a more expensive fuel made from renewable sources — could make overseas travel less affordable.\n\n\n\n\n\n\"If the flight to Bali is suddenly very expensive, you're not going to go,\" she said.\n\n\n\n\n\n\"There is a real likelihood that we'll need to move back to more local travel because the carbon emissions we generate with the way we're currently travelling is out of control.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/childcare-laws-national-scheme/lhd45293k",
        "title": "Anthony Albanese calls working with children laws 'hopeless'",
        "publish_date": "Fri, 15 Aug 2025 02:22:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Calls for a unified system have been growing following multiple reports of abuse in childcare centres.\n\nPrime Minister Anthony Albanese said the reports were a \"wake-up call\" for regulations.\n\nA NSW inquiry was told childcare centres were not checking whether staff were allowed to work with children.\n\nAustralia's Working with Children Check (WWCC) laws are \"hopeless\", Prime Minister Anthony Albanese says, as the country's top legal advisers meet to consider a national scheme .\n\n\n\n\n\nFederal Attorney-General Michelle Rowland is meeting with her state and territory counterparts in Sydney today to discuss setting up a national system for WWCCs.\n\n\n\n\n\nCalls for a unified system have been growing following multiple reports of abuse in childcare centres.\n\n\n\n\n\nIn one instance, a Victorian childcare worker was still allowed to retain his Working with Children Check and work in the industry despite a major provider substantiating grooming allegations against him.\n\n\n\nAlbanese said the reports were shocking and indicated more needed to be done to fix WWCCs.\n\n\n\n\n\n\"It's hopeless, and we need to do better, quite clearly, and these revelations are a wake-up call for state and territory governments in terms of the regulations,\" he told ABC Radio on Friday.\n\n\n\n\n\n\"The reports that we've seen recently have shocked parents and every parent's worst nightmare. That's why we are taking action at the national level.\"\n\n\n\n\n\nRecommendations for a national WWCC scheme were made in the findings of the 2017 royal commission into child sexual abuse.\n\n\n\nRowland conceded the reform had not happened quickly enough.\n\n\n\n\n\n\"All representatives of states and territories are united in the goal of making this system better and making it safer for children, which should be our top priority,\" she told ABC Radio.\n\n\n\n\n\n\"I acknowledged this has taken too long, but I wish to reassure Australians that ... this is top of the agenda.\n\n\n\n\n\n\"What this will mean is that someone who is banned in one state or territory is banned in all states and territories.\"\n\n\n\n\n\nRowland said the lack of a national scheme for WWCCs puts young people at risk.\n\n\n\n\n\nThe attorney-general said she was hopeful a national scheme would be in place within 12 months.\n\n\n\nIt comes as a NSW parliamentary inquiry on Thursday was told childcare centres were not checking whether staff were allowed to work with children before they were hired.\n\n\n\n\n\nThe inquiry was also told banned workers were able to work in the industry for years without oversight.\n\n\n\n\n\nLiberal senator Jane Hume said a national scheme should have been implemented with \"more urgency\" when the Coalition was last in government.\n\n\n\n\n\n\"This is the right approach, to get a nationally uniform approach to Working with Children Checks,\" she told Seven's Sunrise program.\n\n\n\n\n\nLaws passed by the federal parliament in July will strip funding from childcare centres not meeting compliance.\n\n\n\n\n\nEducation ministers will also meet next week to consider further child safety laws for childcare centres.\n\n\n\n\n\nAmong the measures being considered are use of CCTV in centres, as well as mandatory child safety training.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-august-16-2025-20250816-p5mnfk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, August 16, 2025",
        "publish_date": "Sat, 16 Aug 2025 12:00:10 +1000",
        "category": "finance",
        "authors": [],
        "text": "9/26\n\nLuciana and Mario Martini from the Careless documentary. The documentary is about the aged care crisis. Luciano and Mario have been married for many years and want to stay living at home for as long as possible Credit:Justin McManus",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/former-australian-cricket-captain-and-coach-bob-simpson-dies-aged-89-20250816-p5mnfe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Former Australian cricket captain and coach Bob Simpson dies, aged 89",
        "publish_date": "Sat, 16 Aug 2025 10:56:21 +1000",
        "category": "sports",
        "authors": [
            "Chloe Saltau"
        ],
        "text": "Former Australian cricket captain and coach Bob Simpson has died at the age of 89.\n\nSimpson was a giant figure in Australian cricket for more than four decades, playing 62 Test matches, famously emerging from retirement at age 41 to lead Australia during the World Series Cricket era, and later becoming the nation’s first full-time coach.\n\nBob Simpson and Shane Warne at a training session, 1996. Credit: Fairfax\n\nCricket Australia confirmed his death to this masthead on Saturday morning.\n\nAlong with captain Allan Border, Simpson instilled new standards of fitness and discipline to oversee an Australian renaissance that included winning the World Cup in 1987, regaining the Ashes in 1989, and with captain Mark Taylor beating the mighty West Indies away from home in 1995.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/how-177-bombs-came-to-rest-under-a-children-s-playground-in-england-20250816-p5mnf8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How 177 bombs came to rest under a children’s playground in England",
        "publish_date": "Sat, 16 Aug 2025 10:10:01 +1000",
        "category": "finance",
        "authors": [
            "Evie Glynne"
        ],
        "text": "London: Bomb dispersal teams rarely get called out to the picture postcard town of Wooler, in Northumberland. But in February this year, vans, diggers and the world’s media descended on the town, in the Cheviot Hills, coming to a stop where a playground used to be.\n\nIt happened after Steven Parkinson, a local builder, had been tasked with digging up Scotts Park in the town after the parish council secured a grant for the renovation of the play area.\n\nThe bombs were discovered as a construction project was under way to renovate the Scotts Park playground in Wooler. Credit: Mark Mather\n\nAs he set to work on January 14, a “suspicious” object caught his eye. He alerted Kerren Rodgers, the clerk of the parish council, who was equally baffled.\n\n“Dealing with a suspected bomb in a playground is not exactly something they cover in the clerk’s manual,” she told the BBC adding that the authorities had nevertheless cordoned off the playground and an Explosive Ordnance Disposal team was called.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/no-deal-between-putin-and-trump-in-ukraine-negotiations-20250816-p5mnf4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No deal between Putin and Trump in Ukraine negotiations",
        "publish_date": "Sat, 16 Aug 2025 09:22:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "No deal between Putin and Trump in Ukraine negotiations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/rising-wedding-costs-are-also-jacking-up-the-price-for-guests-20250816-p5mnez.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rising wedding costs are also jacking up the price for guests",
        "publish_date": "Sat, 16 Aug 2025 08:57:49 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Rising wedding costs are also jacking up the price for guests\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-saturday-august-16-20250816-p5mney.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Saturday August 16",
        "publish_date": "Sat, 16 Aug 2025 08:46:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Saturday August 16\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/king-charles-and-queen-camilla-meet-veterans-marking-anniversary-of-vj-day-20250816-p5mnev.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "King Charles and Queen Camilla meet veterans marking anniversary of VJ Day",
        "publish_date": "Sat, 16 Aug 2025 07:37:14 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "King Charles and Queen Camilla meet veterans marking anniversary of VJ Day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/epl-2025-live-updates-liverpool-fc-take-on-bournemouth-in-highly-anticipated-english-premier-league-season-opener-20250815-p5mn8q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Late goals, Jota tributes and racism claim as Liverpool win English Premier League opener",
        "publish_date": "Sat, 16 Aug 2025 07:28:48 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "This has been some way to open the new Premier League season. If you need a reason to start watching a little more religiously in 2025/26, this might be enough to twist your arm. And if you missed this game, it’s probably one to re-read from the start of the blog today and watch on replay, whether your support Liverpool or Bournemouth or not.\n\nHere’s a wrap-up of the match from Reuters, and keep your eyes peeled for some commentary a little later. Thanks for your company.\n\nLiverpool talisman Mo Salah and fellow forward Federico Chiesa struck late goals as the Premier League champions began the defence of their title by beating Bournemouth 4-2 in a thriller on the opening night of the season at Anfield on Friday.\n\nOn a bittersweet evening charged with emotion after the July death of Liverpool forward Diogo Jota, newcomer Hugo Ekitiké bagged a goal on his debut to put the hosts ahead after 37 minutes and Cody Gakpo doubled the lead in the 49th.\n\nBut Antoine Semenyo, who was the target of racist abuse in the first half that led to a pause in the game, pulled one back for the visitors in the 64th minute and completed a double 12 minutes later to rock Liverpool and shock the home fans.\n\nHowever, substitute Chiesa sent the Liverpool faithful away happy with an 88th-minute strike after goalkeeper Djordje Petrovic swatted away a ball into the box by Salah, who scored himself deep into added time to wrap up the three points.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/salah-seals-win-for-liverpool-20250816-p5mnes.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Salah seals win for Liverpool",
        "publish_date": "Sat, 16 Aug 2025 07:16:29 +1000",
        "category": "sports",
        "authors": [],
        "text": "Salah seals win for Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/alleged-racism-stops-premier-league-opener-20250816-p5mneq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alleged racism stops Premier League opener",
        "publish_date": "Sat, 16 Aug 2025 07:06:21 +1000",
        "category": "sports",
        "authors": [],
        "text": "Alleged racism stops Premier League opener\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/liverpool-pay-tribute-to-jota-20250816-p5mnen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool pay tribute to Jota",
        "publish_date": "Sat, 16 Aug 2025 06:42:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Liverpool pay tribute to Jota\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/ciraldos-stinging-message-for-players-after-loss-20250816-p5mnem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ciraldo's stinging message for players after loss",
        "publish_date": "Sat, 16 Aug 2025 06:31:48 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ciraldo's stinging message for players after loss\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]