[
  {
    "url": "https://www.9news.com.au/world/sean-diddy-combs-trial-what-to-know-about-cassie-ex-girlfriend-testifying/43986cf3-2593-4006-bc07-def9e37dcc6d",
    "title": "Who is Cassie, the ex-girlfriend testifying against Sean 'Diddy' Combs?",
    "publish_date": "Tue, 13 May 2025 22:50:51 +0000",
    "category": "entertainment",
    "authors": [
      "May"
    ],
    "text": "Casandra Ventura, the RnB singer and actor known simply as Cassie, began testifying overnight in Sean \"Diddy\" Combs ' sex trafficking trial. She is expected to return to the stand tonight.\n\nThe music mogul is charged with leveraging his status to coerce women – including Cassie – into abusive sexual encounters and using violence if they refused.\n\nHe has pleaded not guilty. Cassie sued Combs in 2023 alleging years of rape and abuse.\n\nSinger Cassie Ventura, known as Cassie, is testifying against her former partner Sean \"Diddy\" Combs. (AP)\n\nThe suit was settled within hours, but was followed by dozens of similar legal claims and touched off a criminal investigation.\n\nHere's what you need to know about the 38-year-old star witness.\n\nA talented performer\n\nA singer, actor, dancer and model, Cassie's professional ambitions began in adolescence, when she signed to the top-tier talent and modelling agency Wilhelmina.\n\nHer music career launched shortly thereafter, when she left her home state of Connecticut for New York, where she signed with manager Tony Mottola and first met Combs.\n\nCassie is perhaps best known for the 2006 hit single Me & U , which secured the number one spot on the Billboard Hot RnB/Hip-Hop songs chart and number three on the Billboard Hot 100 all genres chart.\n\nIt was certified platinum by the Recording Industry Association of America.\n\nThe song was the lead single of her only studio album, released by Combs' Bad Boy Records, and was self-titled.\n\nShe left the label in 2019.\n\nCassie with Diddy in 2015. (Charles Sykes/Invision/AP)\n\nAs an actor, she appeared in several television and film projects including Fox's Empire , The Perfect Match and Spenser Confidential . She made her acting debut in 2008 in Step Up 2: The Streets and contributed the song Is It You to its soundtrack.\n\nShe appeared in a number of music videos as well, including Wiz Khalifa's Roll Up and Mario's Just A Friend 2002.\n\nAlthough she never released her long-teased sophomore album, at one point tentatively titled Electro Love , she did drop a few tracks: the RnB-pop Official Girl with Lil Wayne, Must Be Love with Combs, and Let's Get Crazy with Akon.\n\nAnd in 2012, Nicki Minaj tapped her for a feature on The Boys from Minaj's Pink Friday: Roman Reloaded – The Re-Up .\n\nCassie is also a wife and a mother.\n\nShe married personal trainer Alex Fine in September 2019.\n\nTheir first daughter, Frankie Stone Fine, was born that same year and they welcomed their second daughter, Sunny Cinco Fine, in 2021.\n\nShe is currently pregnant with their third child, a son .\n\nCassie Ventura wipes tears from her eye while testifying in Manhattan federal court. (AP)\n\nThe Combs connection\n\nCassie met Combs in 2005 when she was 19 and he was 37. He signed her to his Bad Boy Records label and, within a few years, they started dating.\n\nIn her 2023 civil lawsuit, Cassie alleges Combs trapped her in a \"cycle of abuse, violence, and sex trafficking\" for more than a decade, including raping her and forcing her to engage in sex acts with male sex workers. Combs settled the lawsuit the next day.\n\nIn May 2024, CNN aired video that showed Combs attacking Cassie in a hotel hallway in 2016.\n\nThe video closely mirrored an assault described in her lawsuit, which said Combs had already punched her that night, and she was trying to leave the InterContinental Hotel in Los Angeles when he woke and came after her.\n\nThis frame grab taken from hotel security camera video and aired by CNN appears to show Sean \"Diddy\" Combs attacking singer Cassie in a Los Angeles hotel hallway in March 2016. (AP)\n\nIn the footage, a man who appears to be Diddy, wearing only a towel, punches Cassie, kicks her, and throws her on to the floor.\n\nThe lawsuit alleges Combs paid US$50,000 ($77,268.41) to bury the video at the time.\n\nLater, Combs apologised for the assault on Cassie in his first real acknowledgment of wrongdoing since the stream of allegations began.\n\nAmong other things, Cassie alleges Combs raped her when she tried to leave him and often punched, kicked and beat her, causing injuries including bruises, burst lips, black eyes and bleeding.\n\nShe also alleges that Combs was involved in blowing up rival rapper Kid Cudi's car when he learned that Cudi was romantically interested in her, and she alleges that Combs ran out of his home with guns when he learned that Suge Knight, a rival producer, was eating at a nearby diner.\n\nOn the first day of Combs' sex trafficking trial, a witness, Daniel Phillip, said he was a professional stripper who was paid US$700 to US$6000 ($1081.76 to $9272.21) to have sex with Cassie while Combs watched and gave instructions, with the first encounter in 2012.\n\nPhillip told jurors that he stopped meeting with the couple after he saw Combs throw a bottle at her and then drag her by her hair into a bedroom as she screamed.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/cost-of-living-easing-why-many-aussies-still-feel-the-pinch-despite-lower-inflation/7a4bc908-1cc3-4b3a-9161-c566db2df111",
    "title": "Aussies still pessimistic about economy despite easing inflation",
    "publish_date": "Tue, 13 May 2025 19:39:30 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Australians ﻿remain pessimistic about their economic outlook despite the best inflation figures in years and the likelihood of an interest rate cut in less than a week.\n\nNew data from Westpac released yesterday ﻿showed the bank's consumer confidence index at 92 – a slight improvement from last month but still in negative territory (under 100), where it has sat for more than three years.\n\n\"Sentiment has trended up throughout 2024 as most consumers benefited from a still resilient labour market and falling inflation rates,\" AMP economist My Bui said.\n\nREAD MORE: New Liberal leader pays tribute to dying mother in first speech ﻿\n\nDespite easing inflation and the likelihood of a second interest rate cut this year, Australians are pessimistic about the economy. (Glenn Campbell)\n\n\"However, the progress has been stalled somewhat recently, with sentiment at the same level as the beginning of the year.\"\n\nIt comes after ABS data last week showed living costs ﻿are rising at a level beyond inflation.\n\nWhile core inflation slowed to 2.9 per cent in the March quarter and the headline consumer price index was at 2.4 per cent﻿, the ABS found households' living costs had increased by more, rising by up to 3.5 per cent over the last 12 months.\n\nOnly self-funded retirees have seen their costs rise largely in line with inflation, with health, energy, housing and insurance proving a significant burden for most Australians.\n\n\"Higher mortgage interest charges, insurance premiums, and food prices over the year contributed to rises in annual living costs across all household types,\" ABS acting head of prices statistics Neel Tikaram said.\n\n\"The rise in mortgage interest charges was driven by higher mortgage debt levels and the continued rollover of expired fixed-rate mortgages to higher variable-rate mortgages,\" he added.\n\n\"The effect of the Reserve Bank of Australia's cash rate cut in February 2025 will be seen in the June 2025 quarter due to the timing of the change in the cash rate.\"\n\nMore relief could be on the way soon, though, with the RBA largely expected to move to cut interest rates for the second time this year next week.\n\nThe RBA is widely expected to cut interest rates next week. (AFR)\n\nMarkets are pricing in a roughly even-money chance of a rare double cut, which would see the official cash rate dropped from its current 4.10 per cent to 3.60.\n\nBui said the consumer confidence figures only added to the case for the Reserve Bank to ease interest rates.\n\n\"Leading consumer and business confidence readings are still fragile, signalling a challenging landscape for GDP recovery this year,\" she said.\n\n\"In addition to threats from a global trade slowdown, today's data adds to the argument that the RBA needs to cut rates further this year.\n\n\"We continue to see at least two more 25bps cuts, one in May and one in August.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/sussan-ley-new-liberal-party-leader-charles-croucher-analysis/dad67bbc-1c2f-4b79-af28-4ef7f94b0963",
    "title": "'Incredible life story': How Sussan Ley will lead the Liberals",
    "publish_date": "Tue, 13 May 2025 08:21:59 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Sussan Ley will have to be \"consultative\" and collaborative as the newly-installed Liberal leader, because she can't afford to alienate any element of her election-battered shrunken party room, Nine political editor Charles Croucher says.\n\nLey was elected over opponent Angus Taylor this morning, winning by 29 votes to 25.\n\nHer new deputy, Ted O'Brien, was elected with 38 votes over Phil Thompson, who received﻿ 16.\n\nREAD MORE: Sussan Ley defeats Angus Taylor to become first woman to lead Liberals ﻿\n\nSussan Ley has an \"incredible life story\", Nine political editor Charles Croucher says. (Sydney Morning Herald)\n\nNorthern Territory Senator Jacinta Nampijinpa Price, who defecte﻿d to the Liberal party room from the Nationals to run as Taylor's would-be deputy, failed to nominate after Taylor's loss.\n\n\"(Ley's) going to have to be consultative, because ... she's going to need every one of them to be in any way combative against the prime minister,\" Croucher said.\n\nHe said Ley, who had been former Liberal leader Peter Dutton's deputy, had an \"incredible life story\" and her background could be used in her pitch to voters.\n\nAngus Taylor was defeated in the ballot. (Getty)\n\n\"Having immigrated here with her family, she trained to be a pilot, she's been a jackaroo, she's a grandmother, she has a great backstory that I think we'll hear more of in the coming days,\" Croucher said.\n\n\"She had a history as a punk rocker and can be good company when she's having a good time, so I think we'll see a bit of that.\"﻿\n\nPolitically, he said, Ley had been an advocate for small business, and he expected her to return to a small-government outlook.\n\nAlbanese celebrates victory with coffee View Gallery\n\n\"But also she's someone who has been willing to adapt and change to please whoever's in charge of the party at the time,\" he said.\n\n\"So, I think we're going to see her now in charge, and that's the big challenge for her - what does that look like?\"\n\nDespite Taylor's defeat, and the controversy around Price's jump from the Nationals party room to the Liberals, Crouchers said he expected both of them to be included in Ley's strategy.\n\nUltimately, he said, the party as a whole faced an uphill battle.\n\n\"There's a long run to go before this side of politics is anywhere near government again,\" he said.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/wage-growth-australia-march-2025-wage-price-index/105290150",
    "title": "Annual wage growth ticks up to 3.4 per cent in March quarter",
    "publish_date": "Wed, 14 May 2025 01:54:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "Wage growth in Australia has increased to 3.4 per cent over the past year, the first time wage growth has ticked up since the June quarter of 2024.\n\nData released by the Australian Bureau of Statistics on Wednesday shows quarterly wages growth of 0.9 per cent in the March quarter, up from 0.7 per cent in the December quarter.\n\nIt has seen the annual pace of growth in the Wage Price Index (WPI) lift from 3.2 per cent in the December quarter to 3.4 per cent in the March quarter.\n\nThe Reserve Bank was forecasting annual wage growth to pick up in the first six months of this year, so the wage increases were broadly expected, if slightly ahead of schedule.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/carla-zampatti-australian-fashion-week-designer-anniversary/105287448",
    "title": "Carla Zampatti's legacy lives on at 60th anniversary runway show",
    "publish_date": "Wed, 14 May 2025 01:47:09 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Australian design icon Carla Zampatti continued to influence local designers at the brand's opening of Australian Fashion Week in Sydney on Monday night.\n\nThe Carla Zampatti brand celebrated 60 years of its elegant designs with 60 looks featured on an outdoor runway at the Museum of Contemporary Art along Sydney's harbour.\n\nThe designer launched the eponymous label in 1965, and released her first national collection five years later.\n\nShe died in 2021 after a serious fall at an outdoor opera event aged 78.\n\nLocal designers were put front and centre at the 60th anniversary show. (ABC News: Greg Heap)\n\nChief executive of Carla Zampatti and son of the late designer, Alex Schuman, said he wanted the brand's 60th anniversary to celebrate Australia's designers.\n\n\"There are countless designers, stylists, photographers, even models, who got their first run in Carla Zampatti, and now they've got their own brands,\" Mr Schuman said.\n\nMichael La Sordo's design as part of the Carla Zampatti show. (Supplied: Janna Melonkvist)\n\nAs part of the runway, 14 local designers were featured, including Grace Lillian Lee, Pip Edwards, Michael Lo Sordo and Zampatti's daughter Bianca Spender.\n\nSydney-based designer Lo Sordo was mentored by Zampatti and said he was \"honoured\" to be one of the 14 designers to feature in this \"milestone\" runway.\n\nHe said Zampatti would \"swan in and swan out\" of rooms, often unannounced, and that \"effortless\" presence was inspiration for his garment.\n\n\"Carla touched so many people over the decades of her legacy and her career.\"\n\nLo Sordo (right) described the fashion show as a \"milestone\". (ABC News: Greg Heap)\n\nLo Sordo said the next generation of designers were carrying on Zampatti's legacy and \"taking Carla into the future\".\n\nWith Australian Fashion Week nearing three decades, the event's format has changed over the years.\n\nThis year, not-for-profit organisation the Australian Fashion Council has taken control of the event.\n\nThe late designer would \"swan in and out\" of rooms, a desginer recalled. (Supplied)\n\nAustralian Fashion Week CEO, Kellie Hush, said the week was a \"trade event\" and not \"fashion entertainment\".\n\n\"We are not set up to make a profit out of Australian Fashion Week; we are here to serve the industry … and make sure it's strong for the future,\" Ms Hush said.\n\n\"The domestic customer is really important … what's happening internationally in unpredictable.\"\n\nThe late Australian designer was remembered for touching \"so many people over the decades\". (ABC News: Sally-Anne Young)\n\nThe fashion landscape in Australia has been hit by ongoing cost-of-living pressures and is impacted by the recent tariffs imposed by the US.\n\nAustralia's fashion industry is worth about $28 billion and just over $7 billion of this is from exports, according to the Australian Fashion Council.\n\nCarla Zampatti holds a unique position, being a locally made brand.\n\nAlex Schuman said he had noticed a shift from consumers towards local designers. (ABC News: Jak Rowland)\n\n\"We're Australian-made; it doesn't really impact us … I think for brands that are exporting Chinese-made products, it's going to be a really big challenge from them,\" Mr Schuman said.\n\nDespite cost of living pressures, Mr Schuman said he has noticed a consumer shift towards local brands.\n\n\"There's a desire to come back to Australian designers, and Australian-made garments,\" he said.\n\nSixty looks featured at the Carla Zampatti Australian Fashion Week 2025 show in Sydney. (ABC News: Sally-Anne Young)\n\nLo Sordo said Australian Fashion Week was a prime opportunity for the new generation of designers.\n\n\"It's a really important time at the moment where we need to focus on our local industry,\" Lo Sordo said.\n\nDesigns from Monday night's runway with Carla Zampatti will be donated to a permanent collection of works by Australian designers at the Powerhouse Museum.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/independent-publishing-melbourne-design-week-art-book-fair/105289628",
    "title": "Indie publishers face huge challenges. Here's why so many are flourishing",
    "publish_date": "Wed, 14 May 2025 01:34:40 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In a digital world increasingly dominated by ephemeral media, independent publishing in Australia is experiencing a renaissance marked by creativity, collaboration and diverse narratives.\n\nSpurred on by National Reading Survey results, showing 42 per cent of Australians are \"occasional\" readers and read a book every 15 weeks at most, the Melbourne Art Book Fair (MABF) — part of this year's Design Week 2025 — is out to cultivate a vibrant reading culture.\n\nIndie publishers \"play a disproportionate role … in nurturing young talent\", Monash University media lecturer Ben Eltham told the ABC earlier this year. (Supplied: Melbourne Art Book Fair/Tobias Titz)\n\nThe Stallholder Fair, from May 16–18, showcases more than 100 leading publishers and artists from the Asia-Pacific region, with limited-edition books, prints and magazines.\n\nAnd the flourishing indie publishing scene is right at the forefront.\n\nIndie publishing movement\n\nIndie publishing — small scale, often self-directed and with a focus on unique content and alternative voices — is \"having a moment\", says Dr Megan Patty, publisher at the National Gallery of Victoria (NGV), and founder and curator of the MABF.\n\nThat's in part because, in recent years, an influx of independent publishers has filled the gaps left by traditional publishing houses, offering fresh perspectives.\n\nThese publishers are part of a movement that focuses on collaboration, experimentation and support for emerging artists. They are a catalyst for creative dialogue and community-building.\n\nThe fair allows for \"real-world connections and conversations\" around books, curator Megan Patty says. (Supplied: Melbourne Art Book Fair/Tobias Titz)\n\nThe MABF has grown in response to this style of publishing, highlighting the importance of inclusivity and community-building in the literary world.\n\n\"Every year has been bigger and better for us,\" says Perimeter Books co-founder Dan Rule, a proud participant in the fair since its inception in 2014.\n\nEstablished in 2011, Perimeter has published more than 100 works focusing on the interrelation between a book's form and the content it carries.\n\nRule draws inspiration from art critics like late New Yorker critic Peter Schjeldahl, and works closely with artists to translate their ideas into publications.\n\n\"Being a publisher is inherently collaborative,\" Rule says; the creative process involves partnering with artists, designers and writers to bring their visions to life.\n\nResisting homogenisation\n\nIndie publishers face unique challenges, particularly in funding and business sustainability.\n\nRecently, three Australian independent publishing houses — Text, Affirm and Pantera — were acquired by multinational publishing houses.\n\nTakeovers of indie publishers 'bad for readers' Photo shows A stack of books with an open book on top; a wall lined with books in the background Small presses have dominated literary prizes in recent years, and larger publishers are buying them out. What do these acquisitions mean for the local publishing industry?\n\n\"History shows that mergers often result in the dissolution of the smaller imprint,\" editor and researcher Alice Grundy wrote in The Conversation.\n\nAnd while acquisitions by mainstream publishers can offer some positives, like increased distribution reach and financial stability, they also raise important concerns; namely, that being acquired could threaten indie publishers' editorial independence, leading to homogenisation and the loss of diverse, innovative voices.\n\nThose innovative voices include marginalised perspectives, those experimenting with form, and authors who are emerging.\n\nAs Rule notes: \"Independent publishers can take the kind of risks around the specificities of content, perspective and form that larger publishers simply cannot.\"\n\nTransforming ideas\n\nDespite the challenges, the industry is far from devoid of good news stories.\n\n\"Variety is good for the industry,\" Millicent Weber, lecturer in English at the ANU, told the ABC. (Supplied: Melbourne Art Book Fair/Sarah Pannell)\n\nPerimeter has built a flexible business model rooted in three pillars: publishing, distribution and retail, and Rule says this integrated approach ensures that each aspect supports the others.\n\nUro Publications, co-founded by Mat Ward and Andrew McKenzie nearly 20 years ago, has carved a niche as a leading publisher of architecture and design books.\n\n\"As a local architecture and design publisher, there needs to be a conversation about how we shape our built environment for the people that live here,\" Ward says, aligning with the fair's commitment to diverse narratives.\n\nUro's publications often challenge conventional formats, featuring authoritative voices from architectural critics and innovative practitioners, which \"foster fruitful discussions, [which] enrich the community, ultimately transforming how architecture is perceived\".\n\n\"I get a kick out of providing a platform for people to share their expertise and ideas,\" Ward says.\n\nGrowth year on year\n\nOver its 11-year history, the MABF has established itself as a vital platform, not only for showcasing innovative art and design publications, but for enhancing literacy and promoting cultural discourse across Australia.\n\n\"Every year, the anticipation builds,\" Dr Patty says.\n\n\"It's incredible to see how the fair continues to foster connections within the creative community and engage audiences in meaningful ways.\"\n\nSince its inception, more than 200,000 people have attended the MABF.\n\nFor Dr Patty, every interaction represents an opportunity to ignite a passion for reading, particularly among young children who are more likely to develop lifelong reading habits when exposed to vibrant art books and interactive storytelling experiences.\n\n\"Find your people, collaborate, and get offline,\" she says.\n\n\"Because it's in those real-world connections and conversations that the future of indie publishing truly takes shape.\"\n\nMelbourne Design Week and the Melbourne Art Book Fair run from May 15–25.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/melioidosis-death-toll-31-fatality-in-townsville/105280938",
    "title": "Melioidosis death toll hits 31 with latest fatality in Townsville",
    "publish_date": "Wed, 14 May 2025 01:05:12 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Another person has died from soil-borne disease melioidosis in Queensland, bringing this year's death toll from the disease to 31.\n\nThe latest Queensland Health figures show one person in Townsville has died from the infection in the past week.\n\nThere have also been four new melioidosis cases reported in the same period.\n\nThree of those cases were around Cairns and the other was in the Townsville region.\n\n\n\nTownsville Public Health Unit director Steven Donohue said the latest death illustrated how serious the illness could be.\n\n\"As you can imagine, this is concerning,\" Dr Donohue said.\n\n\" It is a pretty nasty disease, particularly when it happens to the sick and elderly. Deaths are not uncommon. \"\n\nThe elderly, heavy drinkers, and those with chronic health conditions are most at risk.\n\nCases slowing\n\nMelioidosis is a rare disease caused by bacteria found in soil and water in northern Australia and South-East Asia.\n\nThe bacteria enters the body through cuts or inhalation, so cases soared after record-breaking flooding.\n\nHenry Street was among streets flooded in Townsville in March 2025. (ABC North Qld: Georgia Loney)\n\nQueensland Health said it had received 221 melioidosis notifications this year, which experts have described as a significant outbreak.\n\n\n\nMost of the cases have been in Cairns and Townsville, including a cluster in Townsville's northern suburbs.\n\nSymptoms include fever and coughing, which can be mistaken for other illnesses, and the disease can develop into fatal sepsis.\n\nIntravenous antibiotics are often needed for months to treat melioidosis. (ABC North Qld: Georgia Loney)\n\nDr Donohue said reports of new cases had died down significantly as the weather dried up.\n\n\"So far as we can see, the outbreak that we've had this year is probably over,\" he said.\n\n\" We are keeping our fingers crossed. \"\n\nSteven Donohue says cases of melioidosis continue to be detected in North Queensland. (ABC News)\n\nWhat's causing the outbreak?\n\nThe number of cases has soared since flooding, as people cleaned up after the floods and came into contact with the bacteria.\n\nHealth authorities have continued to urge people to cover up when working outside.\n\nThere is also a theory that more than a decade of construction works on the Bruce Highway has stirred up clay-like soil believed to harbour the bacteria.\n\nThe Queensland government has said that stringent environmental protection protocols reduced the risk of soil-borne diseases leaving worksites.\n\nDr Donohue said there was a range of reasons for the outbreak.\n\n\"It's entirely plausible that a number of the cases in the south of Cairns, near the Bruce Highway upgrade may be linked to that, but of course there are a number of factors,\" he said.\n\n\"We know that melioidosis tends to affect older people, and those with immune problems, or diseases like diabetes, kidney disease, as well as people's behaviour.\n\n\"There are a number of things going on.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/robert-de-niro-hits-out-at-donald-trump-palme-d-or-speech-cannes/105289966",
    "title": "Robert De Niro slams Donald Trump in Palme d'Or acceptance speech at Cannes",
    "publish_date": "Wed, 14 May 2025 00:48:35 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Robert De Niro is well known for being a fierce critic of US President Donald Trump and the veteran actor did not mince words when presented with the honorary Palme d'Or at the 78th Cannes Film Festival on the French Riviera.\n\n\"In my country, we are fighting like hell for the democracy we once took for granted,\" De Niro told the crowd in his acceptance speech.\n\n\"That affects all of us here because the arts are democratic.\n\n\"Art is inclusive. It brings people together, like tonight. Art looks for truth. Art embraces diversity. And that's why art is a threat.\n\n\"That's why we are a threat to autocrats and fascists.\"\n\nThe audience, which included actors Halle Berry and Jeremy Strong who were sitting on the stage, applauded.\n\nTrump's film tariff threat is an opportunity for Australia Photo shows Donald Trump If the re-elected Labor government is serious about investing in the arts, now is the time to prove it.\n\nDe Niro continued, making reference to Mr Trump being named the chair of the John F Kennedy Center for the Performing Arts, and his announcement earlier this month of 100 per cent tariffs on movies \"produced in foreign lands\".\n\n\"America's philistine president has had himself appointed head of one of our premier cultural institutions,\" De Niro said.\n\n\"He has cut funding and support to the arts, humanities and education and now he has announced a 100 per cent tariff on films that are produced outside the US.\n\n\"Let that sink in for a minute,\" he paused.\n\n\"You can't put a price on creativity, but apparently you can put a tariff on it.\n\n\"Of course, this is unacceptable. All these attacks are unacceptable. And this isn't just an American problem, it's a global one.\n\n\"Like a film, we can't just all sit back and watch.\n\n\"We have to act, and we have to act now without violence but with great passion and determination.\n\n\"It's time for anyone who cares about liberty to organise, to protest and when there are elections, of course to vote.\"\n\nThe Palme d'Or is the highest prize awarded usually to the director of the Best Feature Film of the official competition at Cannes.\n\nDe Niro, 81, received the honorary Palme d'Or in recognition of his illustrious Hollywood career as well as his involvement with Cannes going back half a century.\n\nThe award was handed to De Niro by fellow actor Leonardo DiCaprio ahead of the opening night film Partir Un Jour, a French comedy.\n\nThis year's festival has been overshadowed by news of French actor Gérard Depardieu being convicted of sexual assault on a film set.\n\nThe festival has also banned nudity and \"voluminous outfits\" on the red carpet, with its new \"decency code\" the talk of the town.\n\nThe Cannes Film Festival is taking place on the French Riviera from Wednesday May 14 – Sunday May 25 AEST.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/nrl-las-vegas-teams-announced-for-2026/105290042",
    "title": "NRL ditches women's game for Vegas as teams confirmed for 2026",
    "publish_date": "Wed, 14 May 2025 00:23:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "The NRL has confirmed the teams set to play their season openers in Las Vegas next year, while losing the Jillaroos from the slate.\n\nThe Canterbury Bulldogs will face the St George Illawarra Dragons, and the North Queensland Cowboys will take on the Newcastle Knights at Allegiant Stadium on Saturday, February 28 (March 1 in Australia).\n\nEnglish Super League teams Hull Kingston Rovers and Leeds Rhinos will also face off.\n\nThe league's reduction from four to three games has seen the women's international game dropped from the schedule, which had been flagged after the Jillaroos' 90-4 win over England this year.\n\nJulia Robinson scored a hat-trick as the Jillaroos ran in 17 tries against England in Vegas. (Getty Images: Ezra Shaw)\n\nThe final game of the Vegas showcase — a marquee match-up between premiership contenders Penrith and Cronulla — was played out in front of noticeably fewer fans earlier this year.\n\nAllegiant Stadium does not give pass-outs, allowing fans to leave and return later, as Lang Park does for Magic Round.\n\nNRL Las Vegas 2025 season opener — as it happened Photo shows Penrith Panthers Nathan Cleary, Liam Martin, Paul Alamoti and Izack Tago celebrate after an NRL try against Cronulla Sharks. Four-time defending premiers Penrith showed their class as they beat the Sharks to open their NRL season in Las Vegas, while the Canberra Raiders thumped the Warriors and the Jillaroos humiliated England.\n\nAfterwards, Australian Rugby League Commission chairman Peter V'landys said it appeared four games — two NRL, one Super League and one women's international — made for too long a day.\n\n\"We're looking at three next year,\" he told AAP.\n\n\"[Because of the] length of day and fans leaving after their teams played.\"\n\nThe NRL made clear it wanted to maintain the strong relationship with the English Super League, leaving the women's game as the one to receive the chop.\n\nThe NRL is organising four chartered flights from Sydney, Newcastle and Townsville, each themed for the supporters of the four teams in action.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Las Vegas has become a bucket list item for not only NRL and Super League fans but for fans of world-class sport and entertainment,\" NRL chief executive Andrew Abdo said.\n\n\"We've worked with our partners to create affordable travel packages for fans who want to take advantage of a once-in-a-lifetime trip with family and friends.\n\n\"We've given supporters the opportunity to plan early and take advantage of special offers.\"\n\nThe league said the two flights from Sydney would cost $2,800 return, while the Newcastle and Townsville flights would cost $2,990 return.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/erin-patterson-mushroom-murder-trial-fungi-expert-live-blog/105289606",
    "title": "Live: Fungi expert resumes testimony in Erin Patterson's murder trial",
    "publish_date": "Wed, 14 May 2025 00:19:06 +0000",
    "category": "lifestyle",
    "authors": [
      "Judd Boaz",
      "Kristian Silva",
      "Tim Callanan"
    ],
    "text": "A discussion begins over the buttery collybia mushroom, which Dr May mentioned is highly unlikely to grow in Victoria.\n\nMs Stafford, as she has about a dozen times this morning, asks that if it were to grow in Victoria, what similarities it would have to a death cap mushroom.\n\n\"There's a few hypotheticals in there that I'm struggling to disentangle,\" Dr May says.\n\nDr May appears very reluctant to say the mushroom could be found in Victoria, but concedes it could theoretically be found in Victoria.\n\nThe similarities to death cap and non-toxicity of the buttery collybia are pointed out, and we move on to yet another mushroom.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/afl-players-association-response-lachie-schultz-umpires-audio/105289820",
    "title": "AFLPA 'disappointed' as audio reveals umpires' false statement over concussion",
    "publish_date": "Wed, 14 May 2025 00:01:12 +0000",
    "category": "sports",
    "authors": [],
    "text": "The AFL Players' Association (AFLPA) says they are disappointed in the immediate handling of a player's serious on-field injury after play was not stopped despite a clear concussion.\n\nCollingwood forward Lachie Schultz was badly concussed in the Magpies' win over Fremantle at Perth Stadium last Thursday when he attempted to tackle Dockers defender Jordan Clark.\n\nHe went to ground and was clearly concussed, with his arm involuntarily held up in the air.\n\nAudio obtained by Channel 7's The Agenda Setters revealed on Tuesday night that field umpires were aware Schultz was injured when they allowed play to continue while he was sprawled out on the turf. This is despite later telling the AFL they had not seen him.\n\n\"It is now clear that the umpires noticed Lachie Schultz's injury and had the opportunity to stop the play to ensure he left the field safely,\" AFLPA CEO Paul Marsh said.\n\n\"What this highlights to us is that the process of dealing with vital health and safety issues on the field is unclear, and there are many recent examples of the industry needing to better prepare everyone for when these situations occur.\n\n\"Equally, we are disappointed that the AFL failed to appropriately review a serious on-field incident but acknowledge that they have taken responsibility for this.\"\n\nThe audio revealed one umpire heard saying: \"We have got an injured player in the middle. I am watching … We are OK. We are OK.\"\n\nAfter Collingwood moved the ball inside 50, some of Schultz's teammates appealed for medical help. In the audio, an umpire is heard telling a player on the ground: \"We can only stop the play if the ball is coming near or if they instruct us to.\"\n\nThis contradicts a statement released by the AFL last Friday, which said play should have been stopped but the four umpires had not seen Schultz on the ground: \"The umpires did not see the injured player at the time, so play continued. Upon review, if the umpires were aware, play would have been stopped.\"\n\nAFL football boss Laura Kane said the AFL had initially been given the wrong information by the umpires but took full responsibility for the error.\n\n\"The statement we released was incorrect, but we were given the wrong information from the umpires,\" she said in a statement provided to Channel 7.\n\n\"It's inconsistent with the vision. They [the umpires] were going off memory and not the vision and we should always look at the vision.\n\n\"All the field umpires from the game have all been coached this afternoon that they should have stopped the game.\"\n\nMarsh added the union welcomed the opportunity to work with the industry to continually strengthen health and safety protocols for members, particularly given the seriousness of head injuries.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/finding-solace-in-forced-adoption-support-group-bunbury-wa/105283050",
    "title": "Mother finds solace in helping others through forced adoption trauma",
    "publish_date": "Wed, 14 May 2025 00:00:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the 1970s, Louise Kirk became a mother at 16.\n\nBut instead of relishing the joys of motherhood, her baby was adopted by another woman against her wishes.\n\nMs Kirk is one of thousands of women whose babies were taken in Western Australia's forced adoption era, and 50 years later she is still coming to terms with the trauma.\n\n\"No thought was given to my dignity, [I was] treated like a cow really,\" she said.\n\n\" Everyone walking around in their white suits and jackets, and everyone just treating me like I was a bad girl. \"\n\nWaking up without her baby\n\nAfter giving birth, Ms Kirk remembers waking up in a hospital bed without her baby.\n\n\"I was never able to hold him; he was just taken away,\" she said.\n\nMs Kirk said it was later agreed she could take her son home, where social services paid regular visits.\n\nLoading...\n\nEventually, an appointment was set for her to speak to a woman about adoption.\n\n\"The girls in the office said, 'We'll look after [your son] while you go in to see the lady,'\" she said.\n\nMs Kirk said the meeting that ensued was \"scary\".\n\n\"She was knocking her knuckles on the table and telling me how many girls like me waste her time and everybody's time and the best thing for him is to go and be adopted out,\" she said.\n\nMs Kirk said she was coerced to sign paperwork.\n\n\"I walked out of that room and the bassinet was gone; I still had the nappy bag and my son was gone,\" she said.\n\nMs Kirk's baby had been taken to a residential home for unmarried mothers and wards of the state.\n\n\"I'm a mother one minute, with a little baby who was about six months old, and now I've got no baby,\" she said.\n\nSupporting other mums\n\nA recent inquiry into forced adoption in WA unearthed many similar stories to Ms Kirk's.\n\nIt has been estimated that tens of thousands of babies were removed from their mothers across Australia from the late 1930s to the early 80s.\n\nLouise and her husband Ian have founded a Bunbury support group. (ABC South West WA: Bridget McCarthur)\n\nMs Kirk eventually reconnected with her son when he was in his 20s.\n\nWhile still dealing with the trauma of the forced adoption, she has found some solace in connecting with other women like herself.\n\nHer experience pushed her to form a support group in Bunbury, gathering with other women whose children were also taken from them.\n\n\"All of these women know exactly where I'm coming from,\" she said.\n\n\"They're all really, really, really amazing women … that come from all sorts of incredible backgrounds.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/condingup-wharton-beach-subdivision-raises-concerns/105275290",
    "title": "Perth developer plans 300-block subdivision near pristine WA beaches",
    "publish_date": "Tue, 13 May 2025 23:39:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "A farming community in Western Australia's remote south-east has questioned plans for a 300-block subdivision near one of the country's most pristine beaches.\n\nPerth-based developer John Bestall wants to create a \"holiday village-style\" precinct on his 607-hectare property, 770 kilometres south-east of Perth and 60km east of Esperance.\n\nHis plans, submitted to the Shire of Esperance, propose 1-8ha lots that would suit rural residential living or tourist accommodation, given the famous Wharton Beach and Duke of Orleans Bay are a five-minute drive down the road.\n\nHe also believes the project would support the future development of a new town site in the area.\n\nThe Orleans Bay Road property currently contains a tree plantation that would be harvested prior to development.\n\nThe applicant hopes to create a \"holiday village-style\" precinct near Wharton Beach, east of Esperance. (Supplied: Shire of Esperance)\n\nA new town?\n\nEsperance's current local planning strategy already supports a future town site at Wharton Beach, opposite the existing caravan park.\n\nThe area is a popular tourist destination with visitors regularly driving from Esperance to fish, camp, surf and see the famous white sand beaches.\n\nBut the region is remote and has little infrastructure apart from the caravan park and services at Condingup, 25km to the north.\n\nWith his land currently zoned as rural, Mr Bestall has asked for support to change the classification to allow for additional tourism, conservation and residential use.\n\nIt also proposes creating \"conservation covenants\" and leaving 144 hectares as a large rural lot to protect native vegetation.\n\nBig change for locals\n\nIn Condingup, a hub and meeting point for the local farming community, the project has sparked plenty of discussion.\n\nMarie Fowler, who farms in the area, believes long-time farmers wanting to retire locally would like the idea, while others would worry about its impact on the existing town.\n\nThe proposed development is between Condingup and Wharton Beach, 80km east of Esperance. (Supplied: Shire of Esperance)\n\n\"There's not an option [elsewhere] really to have that lifestyle block, a five-acre block or something a bit bigger,\" she said.\n\n\"So I think there is interest from that point of view.\n\n\" And that would be a positive because that will keep those people, those families, in Condingup and keep that connection to the community here. \"\n\nBut she said there was concern the new precinct may overwhelm Condingup as it could be more than three times its size.\n\nShe was interested to learn more as the process moved forward.\n\nWharton Beach is a short drive from the existing caravan park. (ABC Esperance: Hayden Smith)\n\nPeter Brown, a retiree who lives at the nearby caravan park, worried the development would put too much pressure on the area and lead to reduced accessibility to the coast.\n\n\"The Wharton town site, that's been spoken about ever since I can remember. Nothing ever happened with it,\" he said.\n\n\"Personally, I don't think it needs to be there.\"\n\nWhile he said the region desperately needed housing, he believed it should be closer to Esperance or Condingup.\n\n\"From my perspective I hope it doesn't go ahead,\" he said.\n\n\"But … that's maybe just being selfish.\"\n\nWharton Beach is among the most popular with tourists in the Esperance region. (ABC Esperance: Hayden Smith)\n\nEsperance Shire chief executive Shane Burge said if the subdivision was to happen, the developer would be responsible for putting in public amenities such as roads and green spaces.\n\nHe said the shire would take on responsibility once it was finished, funded through rates paid by new property owners.\n\nHe said the area would likely also need its own water supply scheme.\n\nBut he said the idea was still a long way off.\n\n\"There is [community] concern,\" he said.\n\n\"We'll make sure if the planning commission do support it that it's widely put out there [for public feedback].\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/alex-de-minaur-loses-tommy-paul-jannik-sinner-italian-open/105289640",
    "title": "Hailstorm delays de Minaur's Italian Open disappointment",
    "publish_date": "Tue, 13 May 2025 23:26:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's hopes in Rome are officially over after Alex de Minaur was sent packing in the round of 16 on a cold, hail-hit day at the Italian Open.\n\nDe Minaur's clash with American 11th seed Tommy Paul was delayed by heavy rain, topped by a hailstorm, but it could have been worse.\n\nLocal favourite Lorenzo Musetti's match was suspended after the rain started hammering down as he set up match point against Daniil Medvedev.\n\nThree hours later, both players and a packed stadium returned for one point, with ninth-ranked Musetti ripping an off-forehand winner to reach the quarterfinals of his home Masters tournament for the first time.\n\nMeanwhile, de Minaur spent a long afternoon and evening waiting to play his last-16 tie but started strongly, breaking in the opening game, before going down 7-5, 6-3 in 1 hour and 56 minutes.\n\nIt was the Australian number one's first loss to Paul in six matches, in the sort of contest you would expect from two of the fastest players on tour.\n\nAfter a tough opening set where both players fought off a slew of break points, seventh seed de Minaur was broken in the fourth and 12th games to drop the first frame and was soon trailing 5-1 in the second, with Paul closing it out soon after.\n\nRome is the last big warm-up tournament before the French Open starts at Roland Garros on May 25.\n\nEleventh seed Paul will next face Hubert Hurkacz of Poland, who beat Czech Jakub Mensik, seeded ten places higher at 20, 7-6 (7-5), 4-6, 7-6 (7-5).\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women's Sport Survey.\n\nEarlier, Italian tennis fans were able to enjoy watching returning hero Jannik Sinner progress to the quarterfinals with a win over Francisco Cerundolo.\n\nHaving taken the first set tie break, Sinner eased to a 7-6(2), 6-3 victory in his third match back since a three-month ban for a doping offence.\n\n\"Today I felt that I raised my level,\" he said.\n\n\"It was a very long day … But I need this. I'm happy to be back. I was three months out, so every situation for me, I feel very fortunate to be here, very lucky.\"\n\nIt marked Sinner's 24th consecutive win on tour, dating back to last October.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/ABC",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/asic-sues-macquarie-securities-claims-misreporting-short-sales/105289652",
    "title": "Macquarie sued for allegedly misreporting millions of short sales",
    "publish_date": "Tue, 13 May 2025 23:25:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "The corporate regulator is suing the broking arm of Macquarie, alleging it misled the market by misreporting millions of short sales over more than a decade.\n\nThe Australian Securities and Investments Commission (ASIC) has started proceedings against Macquarie in the NSW Supreme Court — its fourth regulatory action against the investment bank in just over a year.\n\nASIC claims Macquarie Securities failed to correctly report the volume of short sales to the market operator between December 2009 and February 2024.\n\nIt is the first short sale reporting case brought by the regulator and alleges \"multiple systems-related issues, many of which remained undetected for over a decade\".\n\n\"This action is timely given significant recent global market volatility,\" ASIC chair Joe Longo said.\n\n\"Accurate and reliable data underpins the integrity of, and confidence in, Australia's financial markets. Investors expect reliable information to analyse market movements and inform their investment decisions.\"\n\nMacquarie said its securities arm identified issues with its daily reporting of short sales and reported them to ASIC in late 2022.\n\nIt later found a number of related issues, which it also reported to the regulator.\n\n\"The reporting issues identified in the proceedings have been remediated with additional controls implemented,\" Macquarie said in a statement.\n\nThe regulator alleges that Macquarie failed to correctly report the volume of short sales by at least 73 million — but estimates it could be between 298 million and 1.5 billion sales.\n\nIt says accurate reporting of short sale data is important to \"inform investors, governments, regulators and financial market participants about market sentiment and potential risks\".\n\nRegulations requiring the reporting of short sales were introduced following the 2008 global financial crisis, when short selling contributed to the unprecedented market volatility.\n\nMacquarie said it was reviewing ASIC's claim and could not comment further as the matter was before the court.\n\n\"Macquarie takes its compliance obligations very seriously and continues to invest in programs to further improve systems and controls across the Group,\" its statement read.\n\nWhat is short selling?\n\nShort selling is a strategy that aims to profit off the price of a financial product falling.\n\nIn the case of shares, it would involve \"borrowing\" a stock and selling it immediately, before buying it back in the future at a (hopefully lower) price, to replace the stock borrowed and pocket the price difference as profit.\n\nIt comes with the risk that the stock price does not fall and the short seller is left with an unprofitable position.\n\nSignificant short positions affect broader sentiment around a stock, given they indicate people are betting on price falls.\n\nThe strategy is sometimes employed by so-called activist short sellers, which ASIC describes as \"a person taking a short position in a financial product and then publicly disseminating information… to negatively impact the price of the product\".\n\nActivist short-selling campaigns can take the form of formal reports or informal methods such as social media posts.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/kramer-vs-kramer-director-robert-benton-dead-at-92/105289438",
    "title": "'Kramer vs. Kramer' director Robert Benton dies aged 92",
    "publish_date": "Tue, 13 May 2025 23:09:02 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Robert Benton, the Oscar-winning writer and director of Kramer vs. Kramer, has died aged 92.\n\nBenton's son, John Benton, said that he died on Sunday at his home in Manhattan of \"natural causes.\"\n\nDuring a 40-year screen career, the Texas native received six Oscar nominations and won three times: for writing and directing Kramer vs. Kramer and for writing Places in the Heart.\n\nHe co-wrote Arthur Penn's groundbreaking crime thriller Bonnie and Clyde, starring Faye Dunaway and Warren Beatty, with David Newman.\n\nBut it is his script and direction on Kramer vs. Kramer — the 1979 film that offered an unflinching look at divorce and went on to become one of the most awarded films of its time — that he is arguably best known for.\n\nThe movie picked up nine Oscar nominations and brought home five: Benton's Best Director and Best Adapted Screenplay, as well as Best Actor for Dustin Hoffman, Best Supporting Actress for Meryl Streep and the year's grand prize of Best Picture.\n\nMeryl Streep and Dustin Hoffman pose with the Oscars they won for their performances in Kramer vs. Kramer at the 52nd annual Academy Awards in 1980. (AP Photo)\n\nBenton was also widely appreciated by actors as attentive and trusting, and directed Oscar-winning performances by Dustin Hoffman, Meryl Streep and Sally Field.\n\nBut despite coaxing winning performances out of a host of 20th-century legends, Benton was known in Hollywood as a self-effacing director.\n\n\"I have found actors — through luck, through the judgement of casting directors or through my own instinct — that are extraordinarily good,\" he told the crowd.\n\n\"There's a thing you've just got to gamble with, and when you see it and it works, it's brilliant.\"\n\nAsked how he got some of Tinseltown's biggest stars to perform for him, he deadpanned: \"I tried not to get in their way … that's not so easy.\"\n\nOscar-winning triumphs\n\nBenton was an art director for Esquire magazine in the early 1960s when a love for French New Wave movies and old gangster stories (and news that a friend got $25,000 for a Doris Day screenplay) inspired him and Newman to draft a treatment about the lives of Depression-era robbers Clyde Barrow and Bonnie Parker, imagining them as prototypes for 1960s rebels.\n\nTheir project took years to complete as Francois Truffaut and Jean-Luc Godard were among the directors who turned them down before Warren Beatty agreed to produce and star in the movie.\n\nBonnie and Clyde, directed by Arthur Penn and starring Beatty and Faye Dunaway, overcame initial critical resistance in 1967 to the film's shocking violence and became one of the touchstones of 1960s culture and the start of a more open and creative era in Hollywood.\n\nBenton arrives for the screening of Feast of Love in New York in 2017. (AP: Rick Maiman)\n\nOver the following decade, none of Benton's films approached the same impact, although he continued to have critical and commercial success.\n\nHis writing credits included Superman and What's Up, Doc? and he directed and co-wrote The Late Show, a melancholy comedy for which his screenplay received an Oscar nomination.\n\nBut his career soared in 1979 with his adaptation of the Avery Corman novel Kramer vs. Kramer, about a self-absorbed advertising executive who becomes a loving parent to his young son after his wife walks out, only to have her return and ask for custody.\n\nStarring Hoffman and Streep, the movie was praised as a perceptive, emotional portrait of changing family roles and expectations and received five Academy Awards, including best picture.\n\nHoffman, disenchanted at the time with the film business, would cite Kramer vs. Kramer and Benson's direction for reviving his love for movie acting.\n\n\"Somebody asked me once when the Academy Award nominations came out and I'd been nominated, 'What's the great thing about the Academy Awards?'\" Benton told Venice magazine.\n\n\"I said, 'When you go to the awards and you see people, some of whom you've had bitter fights with, some of whom you're close friends with, some people you haven't seen in 10 years, some people you just saw two days before — it's your family'.\n\n\"It's home. And home is what I've spent my life looking for.\"\n\nFive years later, Benton was back in the Oscars race with a more personal film, Places in the Heart, in which he drew upon family stories and childhood memories for his 1930s-set drama starring Fields as a mother of two in Texas who fights to hold on to her land after her husband is killed.\n\nA lifelong movie fan\n\nBenton was born in Waxahachie, Texas, outside of Dallas.\n\nHe owed his early love for movies to his father, telephone company employee Ellery Douglass Benton, who, instead of asking about homework, would take his family to the picture shows.\n\nThe elder Benton would also share memories of attending the funerals of outlaws Barrow and Parker, Texas natives who grew up in the Dallas area.\n\nThe filmmaker studied at the University of Texas and Columbia University, then served in the US Army from 1954 until 1956.\n\nBetween hits, Benton often endured long dry spells.\n\nHis latter films included such disappointments as the thrillers Billy Bathgate, The Human Stain and Twilight.\n\nHe had much more success with Nobody's Fool, a wry comedy released in 1994 and starring Paul Newman, in his last Oscar-nominated performance, as a small-town troublemaker in upstate New York.\n\nBenton, whose film was based on Russo's novel, was nominated for Best Adapted Screenplay.\n\nThe filmmaker is survived by his son. His wife of six decades, Sallie, died in 2023.\n\nAP/AFP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/rory-mcilroy-to-return-to-australian-open/105289514",
    "title": "Masters champ McIlroy returning to Australia after more than a decade",
    "publish_date": "Tue, 13 May 2025 22:21:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Masters champion Rory McIlroy will headline the men's Australian Open in 2025 and 2026, with the tournament to be played in Melbourne for the next two years.\n\nRoyal Melbourne on the Melbourne Sandbelt will host the tournament from December 4–7 this year, while nearby Kingston Heath will be the home of the Open in 2026.\n\nMcIlroy's return to Australia comes off the back of his historic win at the 2025 Masters Tournament to complete the career grand slam with his fifth major win.\n\nMcIlroy's decade-long quest for immortality Photo shows Rory McIlroy holds his head as the crowd celebrates behind him Rory McIlroy finally achieved golfing immortality in a modern masterpiece of sporting theatre, its flawed brilliance symbolic of the Northern Irishman's career as a whole.\n\nThe last time the 35-year-old appeared at the Australian Open was in 2014, when McIlroy finished 15th, 15 shots off a blistering 21-year-old Jordan Spieth.\n\nThe year prior, McIlroy had won the Stonehaven Cup for his only victory of the year after going head-to-head with that year's Masters winner, Adam Scott.\n\n\"I'm proud to be committing to the Australian Open for the next two years, especially with it being played on the world-class Melbourne Sandbelt, somewhere I've always wanted to play professionally,\" McIlroy said in a statement.\n\n\"The success of the Australian Open is important for the global game, and I'm incredibly confident it will thrive again this year, especially with it being staged in one of the world's great sporting cities and on two of the finest golf courses in the world over the next two years.\"\n\nGolf Australia chief executive James Sutherland said the appearance of the Northern Irishman would help elevate the status of the tournament.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Rory McIlroy, one of the best to ever play our game, playing on the world-renowned Melbourne Sandbelt, is a mouth-watering proposition for golf fans,\" Sutherland said.\n\n\"We are committed to elevating the status of our national championship, and this announcement is a significant step in that direction.\"\n\nThe Australian Open is moving away from its previous combined event, with the dates and venue of the women's Australian Open and Australian All Abilities Championship to be confirmed at a later date.\n\n\"We are confident that the revised format, with individual men's, women's and all-abilities events, will give each event their own platform to showcase the incredible talent in golf,\" Sutherland said.\n\nThe announcement came on the eve of the PGA Championship at Quail Hollow Club in Charlotte, where McIlroy is grouped with defending champion Xander Schauffele and 2024 Masters winner Scottie Scheffler.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/giro-ditalia-yellow-card-mads-pedersen-max-kanter/105289426",
    "title": "Aussie rider benefits from controversial yellow card in Giro bunch sprint",
    "publish_date": "Tue, 13 May 2025 22:14:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian cyclist Kaden Groves's long wait for a win goes on after he was squeezed out on the fourth stage of the Giro d'Italia.\n\nThe Australian sprinter has not topped the podium for 250 days, last doing so at the Vuelta a España in September.\n\nA flat 189-kilometre stage from Alberobello to Lecce offered the prospect of breaking that drought but his Alpecin-Deceuninck team struggled to find the optimum position in a tricky finish and Groves came home in sixth.\n\nBut he was later bumped up to fifth place after German rider Max Kanter was controversially relegated to 103rd.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women's Sport Survey.\n\nThe XDS Astana sprinter was penalised for bumping with race leader Mads Pedersen in the bustle for prime position leading into the bunch sprint, although many saw it as a harsh punishment.\n\nIn addition to being docked 98 places, he was fined 500 Swiss francs ($920), lost 13 points in the race for the sprinter's mauve jersey and handed a yellow card. Another one, and he is out of the race.\n\nPicnic-PostNL rider Bram Welten was also carded for sitting up and decelerating into the chasing pack after leading out for eventual winner, Casper van Uden.\n\nVan Uden led a Dutch 1-2-3, with the grand tour debutant surprising the peloton by holding off compatriots Olav Kooij (Visma-Lease a Bike) and Maikel Zijlaard (Tudoe Pro) in a tense finish.\n\nPink jersey wearer Mads Pedersen was fourth, a disappointment for the Dane who had already won two stages, but also a relief after being close to two crashes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nOne involved most of his Lidl-Trek team and the other took out his final lead-out man, Soren Kragh Andersen, who appeared to have badly injured his left wrist.\n\nPedersen's general classification lead over pre-race favourite Primož Roglič (Red Bull-Bora-Hansgrohe) was cut to seven seconds after the Slovenian picked up an intermediate sprint bonus. Mathias Vacek (Lidl-Trek) is seven seconds further adrift.\n\nAustralia's best GC hope, Michael Storer (Tudor Pro), is ninth, 36 seconds behind Pedersen.\n\nGroves should have another chance in the fifth stage, a 151km ride from Ceglie Messapica to Matera with a rising finish.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-14/asx-markets-business-live-news/105289422",
    "title": "Live: ASX opens lower, ASIC sues Macquarie for misleading conduct",
    "publish_date": "Tue, 13 May 2025 22:09:20 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "David Chau",
      "Michael Janda"
    ],
    "text": "A very useful note from Capital Economics on the state of play with US tariffs following Donald Trump's backdown and 90-day 'reciprocal' tariff pause with China announced on Monday.\n\nThe firm's group chief economist Neil Shearing and global chief economist Jennifer McKeown borrow from Winston Churchill in concluding, \"this may not be the beginning of the end of the trade war — but it could be the end of the beginning.\"\n\n\"The recent climbdown has left the effective US tariff rate on the rest of the world at around 15% as opposed to the 27% which was threatened at the height of this year's trade war,\" they note. \"While this is still the highest since the 1930s, it is unlikely to cause a global or US recession. But we are not out of the woods yet.\"\n\nThey offer a useful summary of where US tariff policy currently stands.\n\nCurrent US tariff rates (Capital Economics)\n\n\"The 25% sector-specific tariffs on steel, aluminium, automobiles, and auto parts announced in March and April remain in place, albeit with rebates for vehicles assembled in the US and a partial exemption for the UK,\" Shearing and McKeown note. \"The 10% universal tariffs announced on Liberation Day are also still in place. There are exemptions for electronics (including smartphones and semiconductors), critical minerals and energy. \"Since the Liberation Day 'reciprocal tariffs' are on hold for 90 days from 9th April, and USMCA-compliant imports are now exempt from Canada and Mexico's 25% tariff, the only significant new nation-specific tariffs since the start of Trump's second term are on China.\"\n\nIn total, tariffs on most Chinese exports to the US stand at 30%.\n\nHowever, the so-called \"reciprocal\" tariffs from Liberation Day are merely paused, not yet abandoned.\n\n\"The most obvious flashpoint falls on 8th July, when the original 90-day pause on reciprocal tariffs is due to expire. The 90-day pause on reciprocal tariffs on China will then expire on 12th August,\" Shearing and McKeown write. \"If countries are unable to reach a deal with the US ahead of these deadlines then reciprocal tariffs could in theory revert to the levels announced on 2nd April. This would push up the effective US tariff rate by 7%-pts compared to its current level. \"It will be extremely difficult for the US to negotiate deals with 180+ countries in the next two months and, given the constitutional role of Congress, any deals that are done will fall well short of the 'full and comprehensive' trade agreements that President Trump has talked about. \"In practice, we think it is likely that the pause on reciprocal tariffs will be extended for those countries that fail to agree a deal with the US ahead of these deadlines. However, it is possible that the administration will take it down to the wire before announcing extensions. If so, this could presage more volatility in financial markets.\"\n\nThe economists warn that the US is still considering \"sector-specific\" tariffs in a range of key areas, with semiconductors a particular risk both to global supply chains and certain countries such as Taiwan, Malaysia and Vietnam.\n\n\"Sector-specific tariffs are another key area to watch. Section 232 investigations are still underway in the US to assess the potential security threat from imports of copper, timber and lumber, semiconductors, pharmaceuticals, critical minerals, trucks and commercial aircraft,\" Shearing and McKeown explain.\n\nThen there's the big elephant in the room — China.\n\nNot only has the US targeted China directly with higher tariffs, it is also looking to strike trade deals that further isolate its rival superpower from other trading partners. And this might make US-China negotiations over a longer-term trade deal particularly thorny.\n\n\"It is notable that last week's US-UK agreement contained clauses that appear designed to force the UK to exclude China from supply chains of strategically-important goods. Many countries would accede to similar demands,\" Shearing and McKeown observe. \"But if this is widespread, it will not only make it harder for the US to agree deals with some countries that have close ties with China, it will also make it harder for the US to agree a lasting deal with China itself.\"\n\nSo, while there's great relief at this week's US-China tariff step down, as Churchill said after the Allies' victory against the Axis forces at El Alamein: \"This is not the end. It is not even the beginning of the end. But it is, perhaps, the end of the beginning.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/bulldogs-to-lead-vegas-2026-charge-as-nrl-targets-record-crowd-20250514-p5lz21.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bulldogs to lead Vegas 2026 charge as NRL targets record crowd",
    "publish_date": "Wed, 14 May 2025 12:00:50 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "The NRL is targeting its biggest Las Vegas venture yet – with the potential to crack 50,000 fans on US soil for the first time – after locking in Canterbury, St George Illawarra, Newcastle and North Queensland to play in 2026.\n\nThe NRL confirmed the four teams, along with Super League’s Hull KR and Leeds, will kick off next season on US soil on Saturday February 28 (Sunday March 1, AEDT).\n\nThe Bulldogs and Dragons are expected to draw healthy travelling contingents from two of the game’s biggest fan bases for their season-opener.\n\nThe two Sydney outfits have agreed to share the gate from both their 2026 games, with Canterbury fielding around 8000 expressions of interest in travelling to Las Vegas when fans were polled earlier this year.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/cba-profits-rise-chief-says-australia-can-navigate-heightened-global-risks-20250513-p5lywy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CBA boss tips interest rate cut next week; bank reports $2.6b profit",
    "publish_date": "Wed, 14 May 2025 11:56:57 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Commonwealth Bank chief executive Matt Comyn says the banking giant expects the Reserve Bank will cut interest rates next week and further reductions are probably on the cards later this year, highlighting the decline in inflation.\n\nThe Reserve Bank’s board will meet next week to set interest rates after a turbulent period on global markets, which have been buoyed by this week’s announcement of a trade truce between the United States and China.\n\n“There is heightened risk to the global economy from geopolitical and macroeconomic uncertainty”: Commonwealth Bank chief executive Matt Comyn. Credit: Oscar Colman\n\nAs CBA reported $2.6 billion in profit for the March quarter, Comyn said on Wednesday the central bank was likely next week to acknowledge the volatile global environment, but its main focus would be on the decline in domestic inflation to its target band of 2 to 3 per cent.\n\n“We certainly still think it’s likely that they will reduce by 25 basis points,” he said. “I think it’s incredibly unlikely it’s more than that, even though the market seems to be pricing in some possibility of that.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/lifestyle/cate-campbell-addresses-online-trolls-criticising-her-looks-20250514-p5lz3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cate Campbell addresses online trolls criticising her looks",
    "publish_date": "Wed, 14 May 2025 11:53:57 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Cate Campbell addresses online trolls criticising her looks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-religious-sect-given-voter-data-carbon-neutral-energy-bills-on-trial-20250514-p5lyz2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Religious sect given voter data, carbon neutral energy bills on trial",
    "publish_date": "Wed, 14 May 2025 11:50:43 +1000",
    "category": "finance",
    "authors": [
      "Ben Cubby"
    ],
    "text": "Real wages growth has lifted to its highest level since inflation was artificially made negative during the depths of the pandemic.\n\nData from the Australian Bureau of Statistics showed wages grew by 0.9 per cent through the first three months of the year.\n\nAnnual wages growth increased to 3.4 per cent, with inflation over that period up by 2.4.\n\nLoading\n\nThe 1 per cent increase in real wages is the highest since the June quarter of 2020 when government policies – particularly on childcare fees – drove down prices growth.\n\nIn the March quarter, wages growth was in line with inflation.\n\nOver the past year, private wages grew by 3.3 per cent, unchanged from the December quarter of 2024. Public sector wage growth lifted from 2.9 per cent to 3.6 per cent.\n\nIn positive news for the Reserve Bank, despite the lift in wages the share of people getting very large jumps in pay continues to ease.\n\nThe bureau noted the share of people getting wage hikes of more than 4 per cent annually has fallen in each success quarter since the middle of last year.\n\nThe share of people getting a wage bump of between 3 and 4 per increased to 37.6 per cent, the highest proportion since the early 2000s.",
    "source": "SMH",
    "cluster_id": 3
  },
  {
    "url": "https://www.smh.com.au/sport/how-the-umpires-handled-schultz-concussion-20250514-p5lz3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How the umpires handled Schultz concussion",
    "publish_date": "Wed, 14 May 2025 11:49:53 +1000",
    "category": "sports",
    "authors": [],
    "text": "How the umpires handled Schultz concussion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/nsw/this-north-sydney-loo-would-have-a-world-heritage-view-opponents-say-the-idea-stinks-20250505-p5lwm0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This North Sydney loo would have a world heritage view. Opponents say the idea stinks",
    "publish_date": "Wed, 14 May 2025 11:46:30 +1000",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "A North Sydney Council proposal to build public toilets and a viewing platform near a top spot for photographs of the Sydney Opera House framed by the Harbour Bridge has been criticised as a loo interrupting a UNESCO view.\n\nThe site at 1 Henry Lawson Avenue, McMahons Point, on the north side of the harbour has been hotly contested for years.\n\nJoan Street, a resident and secretary of the Lavender Bay precinct group, says she was dumbfounded when the development application was released. Credit: Dylan Coker\n\nAfter a range of development proposals were knocked back over the past few decades, the land was acquired by the former Liberal state government. It was given to the council to realise the dream of it becoming public open land that would provide contiguous access to the harbour foreshore from McMahons Point to Blues Point.\n\nNorth Sydney Council has lodged a development application to demolish the old dilapidated boat shed and retain heritage items – critics say that is uncontroversial, though overdue.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/victoria/controversy-over-giant-billboard-slapped-on-heritage-listed-fed-square-20250512-p5lye5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Controversy over giant billboard slapped on heritage-listed Fed Square",
    "publish_date": "Wed, 14 May 2025 11:44:30 +1000",
    "category": "finance",
    "authors": [
      "Tom Cowie"
    ],
    "text": "A large advertisement for Ralph Lauren plastered across the Atrium at Federation Square has sparked criticism that Melbourne’s most prominent public space is being commercialised in a “desperate” chase for revenue.\n\nThe billboard, which faces Flinders Street, was recently installed on behalf of the luxury fashion brand under a heritage exemption that allows for temporary signage on the exterior of Federation Square without a permit.\n\nA Ralph Lauren billboard has been plastered across Federation Square in Melbourne. Credit: Alex Coppel\n\nProfessor Rob Adams, a former City of Melbourne urban designer who worked on Federation Square, described the billboard as “really quite inappropriate” and not in keeping with the city’s character.\n\n“Can you imagine the Eiffel Tower sticking a poster like this on one of their icons?” he said.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-bleijie-demands-stafford-byelection-20250513-p5lytv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Bleijie demands Stafford byelection; Mam to make Broncos return; Moorooka ‘lifestyle precinct’ gets green light",
    "publish_date": "Wed, 14 May 2025 11:41:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "More than 2500 extra homes could be built in Nathan, Salisbury and Moorooka, after Brisbane City Council formally adopted a new neighbourhood plan for the inner-southern suburbs.\n\nLoading\n\nThe Moorooka Magic Mile, famous for its car yards, has been earmarked for an employment and lifestyle precinct, while Ipswich Road is slated to increase from four to six lanes as a “shady subtropical boulevard” through Moorooka.\n\nA new bikeway on the western side of Ipswich Road has also been touted as part of future council upgrades.\n\nThe new neighbourhood plan will come into effect on June 27.\n\nYou can read more about the council’s plans here.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/he-won-the-world-cup-with-spain-now-he-s-interested-in-buying-into-the-a-league-20250514-p5lz0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He won the World Cup with Spain. Now he’s interested in buying into the A-League",
    "publish_date": "Wed, 14 May 2025 11:31:16 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Juan Mata wants to extend his storied playing career – but if it doesn’t happen in the A-League, his contribution to the Australian game may not necessarily be over, after the former Manchester United and Chelsea star confirmed his interest in investing in a club as a part-owner.\n\nMata’s one-season marquee contract with the Western Sydney Wanderers is set to expire after their finals campaign ended in disappointment with a 2-1 defeat at home to Melbourne Victory in last week’s elimination final.\n\nJuan Mata wants to play on, but it may not be with the Wanderers. Credit: Rhett Wyman\n\nMata, 37, has been restricted to a bit-part role under coach Alen Stajcic and came off the bench late in the second half, spurning a golden chance to score not long after – although he wasn’t helped by the uneven pitch at CommBank Stadium, which caused the ball he received for his shot to bobble on its way to him.\n\nThough he featured 23 times for the Wanderers, Mata started only seven times and logged just 599 minutes for the season.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/aflpa-calls-for-injury-protocols-to-tighten-after-schultz-concussion-bungle-20250514-p5lyzz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Got to be a huge inquest’: Buckley calls for investigation over AFL’s umpires statement",
    "publish_date": "Wed, 14 May 2025 11:29:16 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Brittany Busch"
    ],
    "text": "The AFL Players Association has called for protocols around on-field player safety to be tightened after the botched handling of Lachie Schultz’s concussion last Thursday night.\n\nThe AFL’s football boss Laura Kane took responsibility for the Schultz situation after it emerged on Tuesday night that umpires were aware the Collingwood player was lying injured on Optus Stadium, despite the AFL initially saying umpires had told the league they hadn’t seen him.\n\nLachie Schultz of the Magpies collapses in the hands of medical staff. Credit: Getty Images\n\nBut former Collingwood coach Nathan Buckley said the on-field incident was a red herring, and after hearing the tapes thought the umpires handled the situation “perfectly”.\n\nHe said the focus should instead be on investigating who was responsible for the AFL making a false statement.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/world/europe/move-over-wrexham-how-a-group-of-aussies-are-putting-heart-back-into-english-soccer-20250416-p5ls2a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Move over, Wrexham: How a group of Aussies are putting heart back into English soccer",
    "publish_date": "Wed, 14 May 2025 11:15:42 +1000",
    "category": "sports",
    "authors": [
      "Rob Harris"
    ],
    "text": "But as TV rights boomed and the Premier League gained international appeal, clubs attracted celebrity backers and foreign billionaires. Roman Abramovich’s takeover of Chelsea in 2003 signalled a new era, followed by the Glazers at Manchester United and Sheikhs and sovereign wealth at Manchester City and Newcastle. Roman Abramovich lifts the Champions League trophy with Chelsea in 2012. Credit: AP Even celebrities joined in, with Hollywood stars Ryan Reynolds and Rob McElhenney turning Wrexham – then a National League club in the fifth tier of English football – into a global media story. Australians have also made their mark in lower leagues. Sydney-based businessman Clem Morfuni took over Swindon Town in 2021, rescuing the club from financial collapse. At Southend United, a consortium led by Australian businessman Justin Rees has taken control after years of chaos and the club’s near-expulsion.\n\nThe Civitas group, which also includes former AFL player Ray Wilson – the former Hastings Funds Management chairman – and Tim Cheong, a tax partner at Moore Australia, bought into Sutton as minority shareholders in late 2023. Since then, Civitas has been heavily contributing to the club’s operations and quietly transforming its DNA. Rather than chasing headlines or superstar signings, the Civitas style is focused on long-term foundations. The London club hopes to be building a promising future based on sustainable growth. Credit: SUFC First, it brought the players and training facilities back home to the heart of Sutton. Previously training near Heathrow – an hour away – players now prepare just metres from their match-day ground, Gander Green Lane. “We found out who really wanted to be part of the club. Some didn’t want to make the move. That was telling,” Lovett says. “But I think people finally saw us as walking the talk ... we’re bringing things back to the community.”\n\nNext came the backroom transformation. Civitas installed a new sporting department, prioritising data-driven recruitment and performance. Enter “Swiss Amber” – a proprietary analytics platform developed in-house to scout, track and profile talent based on KPIs specific to Sutton’s evolving style. “Clubs in lower leagues often recruit based on who played well against them last week,” Alexiou says. “We’re applying the same data principles used in the Premier League – just tailored to our reality.” They’re not chasing Hollywood endings; they’re building systems. Slowly, methodically. Sutton’s historic Gander Green Lane is now also home to the Crystal Palace Women’s Super League team, thanks to a landmark 10-year partnership that’s upgrading facilities and generating revenue. “It’s a big deal,” says Alexiou. “A true partnership with Crystal Palace. They’ve invested in the ground, installed a Premier League-quality pitch, and brought real visibility. We’ve now got the best surface in the National League – and we didn’t pay a pound for it.”\n\nSutton United FC investor Craig Lovett. There’s also a community element that can’t be faked. The club has partnered with the Royal Marsden Hospital, fostering local health and outreach initiatives that reflect the club’s roots. Sutton’s staff and players are becoming part of the borough’s day-to-day fabric. While firmly planted in English soil, the Civitas vision extends across the hemisphere. The long-term dream is to create a multi-club model, linking teams across the United States, Europe and potentially Australia – each operating sustainably, sharing lessons, and developing talent. But first comes connecting with Australians abroad. Nicknamed “The U’s”, Sutton United recently launched targeted promotions to engage the Aussie expat community in London, beginning with local outreach in Clapham, a known hub for Australians and New Zealanders. “We want Sutton to be the club for Aussies in the UK,” Lovett says. “Affordable, authentic football in a proper ground. Not £100 Premier League tickets that aren’t accessible to most fans.”\n\nThere are plans to eventually establish an Australian talent pathway, creating opportunities for young players from the A-League or NPL to cut their teeth in England while avoiding the brutal churn of top-tier academies. “It’s about giving them the right environment – not just a shot at glory, but time to grow,” Alexiou adds. The club founded in 1898 plays out of Gander Green Lane in the National League. Credit: SUFC Unlike many lower-league takeovers, the group isn’t looking for a quick flip. “This is a long-term play. We’re talking decades, not seasons,” Alexiou says. “We want to create a club that can outlive us. One that’s profitable, and built to last.”\n\nSutton United is known for its rich local heritage. Credit: SUFC Sutton United and its new-look young squad finished the 2024-25 National League season mid-table, a result that the group knows loyal fans – the Amber Army – won’t be overly happy about. But managed by Steve Morison, a former player with Norwich in the top-flight, the team reached the final of the National League Cup (losing 2–1 at home to Leeds United’s Under-23 team last month) – an exciting prospect for a club whose recent history has been mostly about survival. There’s a quiet confidence to what the group is building. They know they don’t have billionaire backers or blockbuster branding, but they also know what they do have: data, experience, heart, and a long view. “We’re not pretending to be Wrexham,” Lovett says. “We believe if we keep doing things the right way – recruitment, training, community – there’s no reason we can’t be a championship team in the medium term.”\n\nSutton United may never be the loudest name in English football. But with its new Aussie engine room, it might be one of the smartest. From their base in Melbourne, Alexiou and Lovett are infusing Sutton United with a blueprint that echoes successful models back home – like the Western Bulldogs or Geelong in the AFL, clubs that have become community institutions, not just sporting entities. To partner with the Royal Marsden Hospital, the club wore a purple kit for solidarity in their match against Dagenham & Redbridge. “It was actually the first thing we did when we bought into the club,” Alexiou says, noting the importance of embedding the club deeper into its community from day one. Their approach is influenced by the tradition and passion they’ve found at Sutton – a club steeped in local pride, not just results. “You sit there and these guys in the crowd are talking about FA Cup wins in 1989 against Coventry City,” Alexiou says. “It’s hard to describe … very hard to replicate something like that. We want every Australian in London to feel they are a part of this, too.”",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/couple-reveal-astonishing-water-tower-renovation-results-20250514-p5lz38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple reveal astonishing water tower renovation results",
    "publish_date": "Wed, 14 May 2025 11:14:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Couple reveal astonishing water tower renovation results\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/halle-berry-forced-to-ditch-amazing-gown-after-cannes-naked-dress-ban-20250514-p5lz0o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Halle Berry forced to ditch ‘amazing’ gown after Cannes ‘naked dress’ ban",
    "publish_date": "Wed, 14 May 2025 11:13:16 +1000",
    "category": "lifestyle",
    "authors": [
      "Craig Simpson"
    ],
    "text": "Halle Berry has been forced to ditch her red carpet dress plans after a Cannes ban on both sheer and billowing dresses.\n\nThe Best Actress Oscar-winner for 2001’s Monster’s Ball will have to follow the same sartorial regulations as everyone else.\n\nNudity has been prohibited at the Cannes Film Festival following the recent vogue for sheer “naked dresses”, and overly “voluminous” gowns have also been banned.\n\nFrom left: 78th Cannes Film Festival jury president Juliette Binoche with jury members Alba Rohrwacher, Leïla Slimani, Halle Berry and Hong Sang-soo. Credit: Getty Images\n\nThe policy, intended to stop elaborate trains clogging up the aisles of film festival cinemas, prevented Berry, 58, from wearing her planned dress.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-10-acts-who-have-qualified-for-the-eurovision-grand-final/2ebnpekoh",
    "title": "The 10 acts that have qualified for the Eurovision grand final",
    "publish_date": "Wed, 14 May 2025 01:51:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "The lineup for the 2025 Eurovision Song Contest grand final is shaping up with 10 acts progressing through the first semi-final of the competition.\n\n\n\n\n\nThey will join the six countries who automatically qualify for the final, along with 10 other acts competing on Friday 16 May at 5am AEST.\n\n\n\n\n\nAustralia's entry Go-Jo will be performing in the second semi-final, where viewers will be able to cast their vote via the official Eurovision Song Contest website.\n\n\n\nWho has progressed so far?\n\nThe ten acts that have moved through are:\n\n\n\nNorway: Lighter by Kyle Alessandro\n\nAlbania: Zjerm by Shkodra Elektronike\n\nSweden: Bara Bada Bastu by KAJ\n\nIceland: RÓA by VÆB\n\nNetherlands: C'est La Vie by Claude\n\nPoland: GAJA by Justyna Steczkowska\n\nSan Marino: Tutta L'Italia by Gabry Ponte\n\nEstonia: Espresso Macchiato by Tommy Cash\n\nPortugal: Deslocado by NAPA\n\nUkraine: Bird of Pray by Ziferblat\n\nThey will join past year's winner, Switzerland, and the acts from the 'big five' — France, Germany, Italy, Spain, and the United Kingdom.\n\n\n\n\n\nThey are:\n\n\n\nSwitzerland -Voyage by Zoë Më\n\nFrance - Maman by Louane\n\nGermany - Baller by Abor & Tynna\n\nItaly - Volevo Essere Un Duro by Lucio Corsi\n\nSpain - Esa diva by Melody\n\nUnited Kingdom - What The Hell Just Happened? by Remember Monday\n\nBroadcasters from the big five make the largest financial contribution to the production of the Eurovision contest organised by the European Broadcasting Union, granting them a guaranteed position in the grand final each year.\n\n\n\nWho was knocked out?\n\nThese five acts did not receive enough support to make it through to the grand final:\n\n\n\nSlovenia: How Much Time Do We Have Left by Klemen\n\nBelgium: Strobe Lights by Red Sebastian\n\nAzerbaijan: Run With U by Mamagama\n\nCroatia: Poison Cake by Marko Bošnjak\n\nCyprus: Shh by Theo Evan\n\nWho is Australia up against?\n\nGo-Jo will be performing first up on Friday, competing against 15 other acts vying to be one of the ten that progress through this stage.\n\n\n\n\n\nThe running order is:\n\n\n\nAustralia: Milkshake Man by Go-Jo\n\nMonetenegro: Dobrodošli by Nina Žižić\n\nIreland: Laika Party by EMMY\n\nLatvia: Bur Man Laimi by Tautumeitas\n\nArmenia: SURVIVOR by PARG\n\nAustria: Wasted Love by JJ\n\nGreece: Asteromáta by Klavdia\n\nLithuania: Tavo Akys by Katarsis\n\nMalta: SERVING by Miriana Conte\n\nGeorgia: Freedom by Mariam Shengelia\n\nDenmark: Hallucination by Sissal\n\nCzechia: Kiss Kiss Goodbye by ADONXS\n\nLuxembourg: La Poupée Monte Le Son by Laura Thorn\n\nIsrael: New Day Will Rise by Yuval Raphael\n\nSerbia: Mila by Princ\n\nFinland: ICH KOMME by Erika Vikman\n\nYou can watch the grand final on Sunday 18 May at 5am AEST on SBS and SBS On Demand.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/china-us-tariffs-drop-from-apocalyptic-to-merely-bad/ngqlgvivz",
    "title": "China-US tariffs drop: 'From apocalyptic to merely bad'",
    "publish_date": "Tue, 13 May 2025 08:14:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThere were cheers and fading fears on Wall Street overnight after news of a truce in the trade war between the world's two largest economies.\n\n\n\n\n\nMarkets rebounded strongly after the US and China agreed to cut tariffs on each other's imports by 115 per cent for 90 days.\n\n\n\n\n\nThis sent the S&P 500 surging by more than 3 per cent, while the tech-heavy Nasdaq catapulted 4.4 per cent higher.\n\n\n\n\n\nIt means it's now 22.5 per cent above its low point in early April.\n\n\n\n\n\nWhile investors hailed the move, analysts were more cautious.\n\n\n\n\n\n\"We've gone from okay to apocalyptic, to sort of merely bad.\"\n\n\n\n\n\nMarcus Noland is the executive vice president and director of studies for the Peterson Institute of International Economics.\n\n\n\n\n\n\"When Donald Trump was inaugurated, we were 'okay.' The tariff rates were probably somewhere on the order of 15 percent to 20 percent. Then through an escalatory spiral, they rose to 145 percent. China's actually applied tariffs on us were even higher. And now they've been reduced to something on the border of 30 percent.\"\n\n\n\n\n\nMr Noland says prices will still be higher, with ongoing uncertainty and delays likely to continue for some time to come.\n\n\n\n\n\nIt's certainly good news for American businesses reliant on Chinese goods - but many of these have also reacted with measured relief.\n\n\n\n\n\n\"It kind of feels a little bit like we dodged a hurricane, we didn't get free of the wind and the rain, but so far, we've dodged major impact.”\n\n\n\n\n\nJay Foreman is the CEO of the toy company Basic Joy.\n\n\n\n\n\n\"And our hope is, from here, is the 30 percent will maybe go down to 10 percent or less.\"\n\n\n\n\n\nArthur Brunner says it's a hope shared by European investors.\n\n\n\n\n\nHe's the director of market making bonds at ICF bank.\n\n\n\n\n\n“ The stock markets started the new week with a bang. The DAX set a new all-time high shortly after the opening. The reason here is the hope for a permanent, lasting agreement.”\n\n\n\n\n\nAsian markets were more mixed today, not matching the surge in the US and Europe.\n\n\n\n\n\nEconomists warn that tariffs are still higher than before, and the future of talks between Beijing and Washington is far from certain.\n\n\n\n\n\nPresident Trump says he’ll likely speak with Chinese leader Xi Jinping at the end of the week.\n\n\n\n\n\nDirector-general of the World Trade Organisation, Ngozi Okonjo-Iweala is calling for a bit more chill.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/nasdaq-enters-bull-market-asx200-at-11-week-high-as-us-china-trade-talks-progress/ls9c6s9fl",
    "title": "Nasdaq enters bull market, ASX200 at 11 week high as US-China trade talks progress",
    "publish_date": "Tue, 13 May 2025 07:27:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/who-is-sussan-ley-the-liberal-partys-first-female-leader/lwatlwvb2",
    "title": "From Nigeria to Canberra: The rise of Sussan Ley, the Liberal Party's first female leader",
    "publish_date": "Tue, 13 May 2025 06:17:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sussan Ley has been elected as the Liberal Party's first female leader.\n\n\n\n\n\nOn Tuesday, Ley became the most senior woman in the party's 80-year history, winning the party room vote 29 to 25 over Opposition Treasury spokesperson Angus Taylor.\n\n\n\n\n\nThe mother-of-three is no stranger to high-profile roles, having previously held environment and health portfolios as well as the deputy Liberal leadership under Peter Dutton.\n\n\n\n\n\nThe 63-year-old acknowledged her globe-trotting childhood in her first remarks as leader, stating hers is a \"migrant story\".\n\n\n\nSo what do we know about Sussan Ley and what can we expect from her leadership?\n\n\n\nWho is Sussan Ley?\n\nNigerian-born Ley was raised primarily in the Middle East, moving to the United Arab Emirates with her English family before she was two.\n\n\n\n\n\nIn a 2014 profile, Ley told SBS how she accompanied her father during fieldwork for British intelligence agency MI6. It was during these trips that she first embraced a passion for diversity.\n\n\n\n\n\nShe previously described her time at a boarding school in Sussex, England from the age of 10 as \"tough\" but \"a defining period of time\" that nurtured her interest in politics.\n\n\n\n\n\nBy the age of 13, her family had moved to Australia. After briefly dabbling in cattle farming in Queensland, they moved to Canberra.\n\n\n\n\n\nIt was here she embraced punk culture, opting for spiked purple hair, black lipstick and multiple piercings.\n\n\n\n\n\n\"It was a way of expressing yourself purely in terms of your own identity and not taking on anyone else’s views about anything. I liked that,\" she told SBS News.\n\n\n\n\"People sometimes assume that by being a punk, you weren’t a conservative, but quite clearly you could be and I was then.\"\n\n\n\n\n\nAfter leaving school, she added another 's' to her first name because of a numerological belief it would change her personality.\n\n\n\n\n\n\"I worked out that if you added an 's' I would have an incredibly exciting, interesting life and nothing would ever be boring,\" she told The Australian newspaper in 2015.\n\n\n\n\n\nLey has worked many jobs, including air traffic controller, shearer, cook and wool and beef farmer as well as public servant. She also got her commercial pilot's licence.\n\n\n\n\n\nThe grandmother of six also studied at university as a mature aged student, completing a bachelor of economics and masters qualifications in tax and accounting.\n\n\n\nLife in politics: from same-sex marriage flips to class actions\n\nLey's more than two decades in parliament (she was elected as the member for Farrer in south-west NSW in 2001) have not been without controversy.\n\n\n\n\n\nShe has openly admitted when she's changed her mind on issues throughout her time in office, including eventually supporting same-sex marriage after initially opposing it.\n\n\n\n\n\nIn 2011, she was the co-chair of the parliament’s Friends of Palestine group and spent 10 days in the occupied West Bank.\n\n\n\n\n\nUpon her return, she gave a speech to parliament in which she said: \"I support the Palestinian bid for statehood in part because it will give heart to the ordinary people of the West Bank and Gaza.\"\n\n\n\n\n\nOn Tuesday, as the Opposition's party leader, she says she views the issue differently, highlighting she has since been on a trip to Israel.\n\n\n\n\"Right now, what we’re seeing is not a party interested peace with Israel, not a party interested in a secure Israel behind secure borders and not a party interested in a just and lasting peace,\" she said.\n\n\n\n\n\nIn 2017 she was forced to step down as health minister in the Turnbull government following revelations she made taxpayer-funded chartered flights to the Gold Coast, during which she bought a property.\n\n\n\n\n\nMore recently, as environment minister in 2022 she appealed a class action by eight children, arguing she did not have a duty of care to protect young people from climate change.\n\n\n\n\n\nOn Australia Day this year, she compared the arrival of the First Fleet to Elon Musk's SpaceX Mars mission, calling British settlement a \"daring experiment\".\n\n\n\n\n\n\"And just like astronauts arriving on Mars, those first settlers would be confronted with a different and strange world, full of danger, adventure and potential,\" she said.\n\n\n\n\n\nAustralia Day became a public holiday in 1994 and marks the day the First Fleet landed in Sydney Cove in 1788. But many Australians, both Indigenous and non-Indigenous, now refer to it as Invasion Day or Survival Day.\n\n\n\nWhat can we expect from her leadership?\n\nAhead of the leadership decision, experts told SBS News that Ley could take a more moderate approach to leadership than her predecessor Peter Dutton.\n\n\n\nAmy Remeikis, the chief political analyst for policy think tank The Australia Institute, said Ley can be a mixed bag in her views.\n\n\n\n\n\n\"While she is more moderate than Dutton and Taylor, she straddles this weird section in between being a moderate and a conservative,\" she said.\n\n\n\n\n\n\"She's a regional Liberal and while she has had some more moderate views, particularly when it comes to women, for a while there she was against live export.\"\n\n\n\n\n\nWhen it comes to economic policy, Ley appears to be in line with traditional Liberal values of small government and reduced taxes, Remeikis said.\n\n\n\n\n\nDr Mark Rolfe, a lecturer in the school of social sciences at the University of NSW, said Ley's leadership could deal with a perceived \"gender problem\" within the Liberal Party.\n\n\n\n\n\n\"When we see the number of teal representatives, and the lack of female Liberals, its clear that professional women voters have departed from the Liberal Party,\" he said.\n\n\n\n\"The issue of gender voting has confounded the Liberals.\"\n\n\n\n\n\nFollowing her ascent to leader, Ley admitted the Coalition had \"let women down\" at the federal election.\n\n\n\n\n\n\"There is no doubt about that, and that is true, the number of women that are supporting us is declining, and I want to rule the line under that,\" she told reporters on Tuesday.\n\n\n\n\n\nRolfe said Ley would have a challenging path as leader of a party that is mostly made up of conservative MPs.\n\n\n\n\n\nJohn Mickel, former Labor MP and adjunct associate professor at the Queensland University of Technology, said appearing moderate could be the key to winning back voters, particularly professional women.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/bulldogs-to-lead-vegas-2026-charge-as-nrl-targets-record-crowd-20250514-p5lz21.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bulldogs to lead Vegas 2026 charge as NRL targets record crowd",
    "publish_date": "Wed, 14 May 2025 12:00:50 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "The NRL is targeting its biggest Las Vegas venture yet – with the potential to crack 50,000 fans on US soil for the first time – after locking in Canterbury, St George Illawarra, Newcastle and North Queensland to play in 2026.\n\nThe NRL confirmed the four teams, along with Super League’s Hull KR and Leeds, will kick off next season on US soil on Saturday February 28 (Sunday March 1, AEDT).\n\nThe Bulldogs and Dragons are expected to draw healthy travelling contingents from two of the game’s biggest fan bases for their season-opener.\n\nThe two Sydney outfits have agreed to share the gate from both their 2026 games, with Canterbury fielding around 8000 expressions of interest in travelling to Las Vegas when fans were polled earlier this year.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/cba-profits-rise-chief-says-australia-can-navigate-heightened-global-risks-20250513-p5lywy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CBA boss tips interest rate cut next week; bank reports $2.6b profit",
    "publish_date": "Wed, 14 May 2025 11:56:57 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Commonwealth Bank chief executive Matt Comyn says the banking giant expects the Reserve Bank will cut interest rates next week and further reductions are probably on the cards later this year, highlighting the decline in inflation.\n\nThe Reserve Bank’s board will meet next week to set interest rates after a turbulent period on global markets, which have been buoyed by this week’s announcement of a trade truce between the United States and China.\n\n“There is heightened risk to the global economy from geopolitical and macroeconomic uncertainty”: Commonwealth Bank chief executive Matt Comyn. Credit: Oscar Colman\n\nAs CBA reported $2.6 billion in profit for the March quarter, Comyn said on Wednesday the central bank was likely next week to acknowledge the volatile global environment, but its main focus would be on the decline in domestic inflation to its target band of 2 to 3 per cent.\n\n“We certainly still think it’s likely that they will reduce by 25 basis points,” he said. “I think it’s incredibly unlikely it’s more than that, even though the market seems to be pricing in some possibility of that.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/lifestyle/cate-campbell-addresses-online-trolls-criticising-her-looks-20250514-p5lz3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cate Campbell addresses online trolls criticising her looks",
    "publish_date": "Wed, 14 May 2025 11:53:57 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Cate Campbell addresses online trolls criticising her looks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-religious-sect-given-voter-data-carbon-neutral-energy-bills-on-trial-20250514-p5lyz2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Religious sect given voter data, carbon neutral energy bills on trial",
    "publish_date": "Wed, 14 May 2025 11:50:43 +1000",
    "category": "finance",
    "authors": [
      "Ben Cubby"
    ],
    "text": "Real wages growth has lifted to its highest level since inflation was artificially made negative during the depths of the pandemic.\n\nData from the Australian Bureau of Statistics showed wages grew by 0.9 per cent through the first three months of the year.\n\nAnnual wages growth increased to 3.4 per cent, with inflation over that period up by 2.4.\n\nLoading\n\nThe 1 per cent increase in real wages is the highest since the June quarter of 2020 when government policies – particularly on childcare fees – drove down prices growth.\n\nIn the March quarter, wages growth was in line with inflation.\n\nOver the past year, private wages grew by 3.3 per cent, unchanged from the December quarter of 2024. Public sector wage growth lifted from 2.9 per cent to 3.6 per cent.\n\nIn positive news for the Reserve Bank, despite the lift in wages the share of people getting very large jumps in pay continues to ease.\n\nThe bureau noted the share of people getting wage hikes of more than 4 per cent annually has fallen in each success quarter since the middle of last year.\n\nThe share of people getting a wage bump of between 3 and 4 per increased to 37.6 per cent, the highest proportion since the early 2000s.",
    "source": "TheAge",
    "cluster_id": 3
  },
  {
    "url": "https://www.theage.com.au/sport/how-the-umpires-handled-schultz-concussion-20250514-p5lz3h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How the umpires handled Schultz concussion",
    "publish_date": "Wed, 14 May 2025 11:49:53 +1000",
    "category": "sports",
    "authors": [],
    "text": "How the umpires handled Schultz concussion\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/nsw/this-north-sydney-loo-would-have-a-world-heritage-view-opponents-say-the-idea-stinks-20250505-p5lwm0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This North Sydney loo would have a world heritage view. Opponents say the idea stinks",
    "publish_date": "Wed, 14 May 2025 11:46:30 +1000",
    "category": "finance",
    "authors": [
      "Julie Power"
    ],
    "text": "A North Sydney Council proposal to build public toilets and a viewing platform near a top spot for photographs of the Sydney Opera House framed by the Harbour Bridge has been criticised as a loo interrupting a UNESCO view.\n\nThe site at 1 Henry Lawson Avenue, McMahons Point, on the north side of the harbour has been hotly contested for years.\n\nJoan Street, a resident and secretary of the Lavender Bay precinct group, says she was dumbfounded when the development application was released. Credit: Dylan Coker\n\nAfter a range of development proposals were knocked back over the past few decades, the land was acquired by the former Liberal state government. It was given to the council to realise the dream of it becoming public open land that would provide contiguous access to the harbour foreshore from McMahons Point to Blues Point.\n\nNorth Sydney Council has lodged a development application to demolish the old dilapidated boat shed and retain heritage items – critics say that is uncontroversial, though overdue.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/victoria/controversy-over-giant-billboard-slapped-on-heritage-listed-fed-square-20250512-p5lye5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Controversy over giant billboard slapped on heritage-listed Fed Square",
    "publish_date": "Wed, 14 May 2025 11:44:30 +1000",
    "category": "finance",
    "authors": [
      "Tom Cowie"
    ],
    "text": "A large advertisement for Ralph Lauren plastered across the Atrium at Federation Square has sparked criticism that Melbourne’s most prominent public space is being commercialised in a “desperate” chase for revenue.\n\nThe billboard, which faces Flinders Street, was recently installed on behalf of the luxury fashion brand under a heritage exemption that allows for temporary signage on the exterior of Federation Square without a permit.\n\nA Ralph Lauren billboard has been plastered across Federation Square in Melbourne. Credit: Alex Coppel\n\nProfessor Rob Adams, a former City of Melbourne urban designer who worked on Federation Square, described the billboard as “really quite inappropriate” and not in keeping with the city’s character.\n\n“Can you imagine the Eiffel Tower sticking a poster like this on one of their icons?” he said.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-bleijie-demands-stafford-byelection-20250513-p5lytv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Bleijie demands Stafford byelection; Mam to make Broncos return; Moorooka ‘lifestyle precinct’ gets green light",
    "publish_date": "Wed, 14 May 2025 11:41:03 +1000",
    "category": "finance",
    "authors": [],
    "text": "More than 2500 extra homes could be built in Nathan, Salisbury and Moorooka, after Brisbane City Council formally adopted a new neighbourhood plan for the inner-southern suburbs.\n\nLoading\n\nThe Moorooka Magic Mile, famous for its car yards, has been earmarked for an employment and lifestyle precinct, while Ipswich Road is slated to increase from four to six lanes as a “shady subtropical boulevard” through Moorooka.\n\nA new bikeway on the western side of Ipswich Road has also been touted as part of future council upgrades.\n\nThe new neighbourhood plan will come into effect on June 27.\n\nYou can read more about the council’s plans here.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/he-won-the-world-cup-with-spain-now-he-s-interested-in-buying-into-the-a-league-20250514-p5lz0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "He won the World Cup with Spain. Now he’s interested in buying into the A-League",
    "publish_date": "Wed, 14 May 2025 11:31:16 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Juan Mata wants to extend his storied playing career – but if it doesn’t happen in the A-League, his contribution to the Australian game may not necessarily be over, after the former Manchester United and Chelsea star confirmed his interest in investing in a club as a part-owner.\n\nMata’s one-season marquee contract with the Western Sydney Wanderers is set to expire after their finals campaign ended in disappointment with a 2-1 defeat at home to Melbourne Victory in last week’s elimination final.\n\nJuan Mata wants to play on, but it may not be with the Wanderers. Credit: Rhett Wyman\n\nMata, 37, has been restricted to a bit-part role under coach Alen Stajcic and came off the bench late in the second half, spurning a golden chance to score not long after – although he wasn’t helped by the uneven pitch at CommBank Stadium, which caused the ball he received for his shot to bobble on its way to him.\n\nThough he featured 23 times for the Wanderers, Mata started only seven times and logged just 599 minutes for the season.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/aflpa-calls-for-injury-protocols-to-tighten-after-schultz-concussion-bungle-20250514-p5lyzz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Got to be a huge inquest’: Buckley calls for investigation over AFL’s umpires statement",
    "publish_date": "Wed, 14 May 2025 11:29:16 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Brittany Busch"
    ],
    "text": "The AFL Players Association has called for protocols around on-field player safety to be tightened after the botched handling of Lachie Schultz’s concussion last Thursday night.\n\nThe AFL’s football boss Laura Kane took responsibility for the Schultz situation after it emerged on Tuesday night that umpires were aware the Collingwood player was lying injured on Optus Stadium, despite the AFL initially saying umpires had told the league they hadn’t seen him.\n\nLachie Schultz of the Magpies collapses in the hands of medical staff. Credit: Getty Images\n\nBut former Collingwood coach Nathan Buckley said the on-field incident was a red herring, and after hearing the tapes thought the umpires handled the situation “perfectly”.\n\nHe said the focus should instead be on investigating who was responsible for the AFL making a false statement.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/world/europe/move-over-wrexham-how-a-group-of-aussies-are-putting-heart-back-into-english-soccer-20250416-p5ls2a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Move over, Wrexham: How a group of Aussies are putting heart back into English soccer",
    "publish_date": "Wed, 14 May 2025 11:15:42 +1000",
    "category": "sports",
    "authors": [
      "Rob Harris"
    ],
    "text": "But as TV rights boomed and the Premier League gained international appeal, clubs attracted celebrity backers and foreign billionaires. Roman Abramovich’s takeover of Chelsea in 2003 signalled a new era, followed by the Glazers at Manchester United and Sheikhs and sovereign wealth at Manchester City and Newcastle. Roman Abramovich lifts the Champions League trophy with Chelsea in 2012. Credit: AP Even celebrities joined in, with Hollywood stars Ryan Reynolds and Rob McElhenney turning Wrexham – then a National League club in the fifth tier of English football – into a global media story. Australians have also made their mark in lower leagues. Sydney-based businessman Clem Morfuni took over Swindon Town in 2021, rescuing the club from financial collapse. At Southend United, a consortium led by Australian businessman Justin Rees has taken control after years of chaos and the club’s near-expulsion.\n\nThe Civitas group, which also includes former AFL player Ray Wilson – the former Hastings Funds Management chairman – and Tim Cheong, a tax partner at Moore Australia, bought into Sutton as minority shareholders in late 2023. Since then, Civitas has been heavily contributing to the club’s operations and quietly transforming its DNA. Rather than chasing headlines or superstar signings, the Civitas style is focused on long-term foundations. The London club hopes to be building a promising future based on sustainable growth. Credit: SUFC First, it brought the players and training facilities back home to the heart of Sutton. Previously training near Heathrow – an hour away – players now prepare just metres from their match-day ground, Gander Green Lane. “We found out who really wanted to be part of the club. Some didn’t want to make the move. That was telling,” Lovett says. “But I think people finally saw us as walking the talk ... we’re bringing things back to the community.”\n\nNext came the backroom transformation. Civitas installed a new sporting department, prioritising data-driven recruitment and performance. Enter “Swiss Amber” – a proprietary analytics platform developed in-house to scout, track and profile talent based on KPIs specific to Sutton’s evolving style. “Clubs in lower leagues often recruit based on who played well against them last week,” Alexiou says. “We’re applying the same data principles used in the Premier League – just tailored to our reality.” They’re not chasing Hollywood endings; they’re building systems. Slowly, methodically. Sutton’s historic Gander Green Lane is now also home to the Crystal Palace Women’s Super League team, thanks to a landmark 10-year partnership that’s upgrading facilities and generating revenue. “It’s a big deal,” says Alexiou. “A true partnership with Crystal Palace. They’ve invested in the ground, installed a Premier League-quality pitch, and brought real visibility. We’ve now got the best surface in the National League – and we didn’t pay a pound for it.”\n\nSutton United FC investor Craig Lovett. There’s also a community element that can’t be faked. The club has partnered with the Royal Marsden Hospital, fostering local health and outreach initiatives that reflect the club’s roots. Sutton’s staff and players are becoming part of the borough’s day-to-day fabric. While firmly planted in English soil, the Civitas vision extends across the hemisphere. The long-term dream is to create a multi-club model, linking teams across the United States, Europe and potentially Australia – each operating sustainably, sharing lessons, and developing talent. But first comes connecting with Australians abroad. Nicknamed “The U’s”, Sutton United recently launched targeted promotions to engage the Aussie expat community in London, beginning with local outreach in Clapham, a known hub for Australians and New Zealanders. “We want Sutton to be the club for Aussies in the UK,” Lovett says. “Affordable, authentic football in a proper ground. Not £100 Premier League tickets that aren’t accessible to most fans.”\n\nThere are plans to eventually establish an Australian talent pathway, creating opportunities for young players from the A-League or NPL to cut their teeth in England while avoiding the brutal churn of top-tier academies. “It’s about giving them the right environment – not just a shot at glory, but time to grow,” Alexiou adds. The club founded in 1898 plays out of Gander Green Lane in the National League. Credit: SUFC Unlike many lower-league takeovers, the group isn’t looking for a quick flip. “This is a long-term play. We’re talking decades, not seasons,” Alexiou says. “We want to create a club that can outlive us. One that’s profitable, and built to last.”\n\nSutton United is known for its rich local heritage. Credit: SUFC Sutton United and its new-look young squad finished the 2024-25 National League season mid-table, a result that the group knows loyal fans – the Amber Army – won’t be overly happy about. But managed by Steve Morison, a former player with Norwich in the top-flight, the team reached the final of the National League Cup (losing 2–1 at home to Leeds United’s Under-23 team last month) – an exciting prospect for a club whose recent history has been mostly about survival. There’s a quiet confidence to what the group is building. They know they don’t have billionaire backers or blockbuster branding, but they also know what they do have: data, experience, heart, and a long view. “We’re not pretending to be Wrexham,” Lovett says. “We believe if we keep doing things the right way – recruitment, training, community – there’s no reason we can’t be a championship team in the medium term.”\n\nSutton United may never be the loudest name in English football. But with its new Aussie engine room, it might be one of the smartest. From their base in Melbourne, Alexiou and Lovett are infusing Sutton United with a blueprint that echoes successful models back home – like the Western Bulldogs or Geelong in the AFL, clubs that have become community institutions, not just sporting entities. To partner with the Royal Marsden Hospital, the club wore a purple kit for solidarity in their match against Dagenham & Redbridge. “It was actually the first thing we did when we bought into the club,” Alexiou says, noting the importance of embedding the club deeper into its community from day one. Their approach is influenced by the tradition and passion they’ve found at Sutton – a club steeped in local pride, not just results. “You sit there and these guys in the crowd are talking about FA Cup wins in 1989 against Coventry City,” Alexiou says. “It’s hard to describe … very hard to replicate something like that. We want every Australian in London to feel they are a part of this, too.”",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/couple-reveal-astonishing-water-tower-renovation-results-20250514-p5lz38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Couple reveal astonishing water tower renovation results",
    "publish_date": "Wed, 14 May 2025 11:14:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Couple reveal astonishing water tower renovation results\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/halle-berry-forced-to-ditch-amazing-gown-after-cannes-naked-dress-ban-20250514-p5lz0o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Halle Berry forced to ditch ‘amazing’ gown after Cannes ‘naked dress’ ban",
    "publish_date": "Wed, 14 May 2025 11:13:16 +1000",
    "category": "lifestyle",
    "authors": [
      "Craig Simpson"
    ],
    "text": "Halle Berry has been forced to ditch her red carpet dress plans after a Cannes ban on both sheer and billowing dresses.\n\nThe Best Actress Oscar-winner for 2001’s Monster’s Ball will have to follow the same sartorial regulations as everyone else.\n\nNudity has been prohibited at the Cannes Film Festival following the recent vogue for sheer “naked dresses”, and overly “voluminous” gowns have also been banned.\n\nFrom left: 78th Cannes Film Festival jury president Juliette Binoche with jury members Alba Rohrwacher, Leïla Slimani, Halle Berry and Hong Sang-soo. Credit: Getty Images\n\nThe policy, intended to stop elaborate trains clogging up the aisles of film festival cinemas, prevented Berry, 58, from wearing her planned dress.",
    "source": "TheAge",
    "cluster_id": 29
  }
]