[
    {
        "url": "https://www.9news.com.au/national/teal-mp-sophie-scamps-apologises-for-linking-climate-change-with-death-of-nrl-player/1dcc7b40-dcf2-455c-8581-741cbb411542",
        "title": "Teal MP 'deeply sorry' for linking rugby league player's death with climate change",
        "publish_date": "Wed, 30 Apr 2025 01:21:36 +0000",
        "category": "sports",
        "authors": [
            "Apr"
        ],
        "text": "Teal MP Sophie Scamps today apologised for linking climate change with the tragic death of a young rugby league player.\n\nRemarks by the politician and doctor caused an outcry from the family of Keith Titmuss who died in 2020 following a Manly Sea Eagles training session.\n\nScamps told Ben Fordham on 2GB she was \"deeply sorry\" for linking his death with climate change when she spoke at an environmental event earlier this year.\n\nLIVE UPDATES: Labor leads the polls days out from election day\n\nTeal independent MP Sophie Scamps (Photo: Alex Ellinghausen) (The Sydney Morning Herald)\n\n﻿\"Lethal humidity is something that the medical fraternity is getting more and more concerned about,\" the MP for Mackellar, on Sydney's northern beaches, told a Doctors For the Environment Australia meeting.\n\nBut the mother of Keith Titmuss, Lafo, this week slammed the MP's remarks, telling News Corp the coroner's report mentioned nothing about climate change.\n\nLast year's coronial inquest found her son died of \"exertional heat stroke\". ﻿\n\nTitmuss suffered a seizure after a cardio workout. (Supplied)\n\nThe coroner said the maximum temperature on the day of Titmuss' death was 25 degrees.\n\nScamps said today she never mentioned Keith Titmuss by name and did not directly link his death with climate change.\n\nBut she insisted doctors and sporting organisations in Australia and overseas were concerned about the impact of hotter weather and increased humidity on human bodies.\n\n\"It's impacting athletes all around the world.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/over-600-jobs-up-for-grabs-at-amazon-australia/61858c24-3b14-465b-81c4-1e2c2894f455",
        "title": "More than 600 jobs up for grabs at Amazon Australia",
        "publish_date": "Wed, 30 Apr 2025 00:10:58 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "More than 600 jobs are up for grabs at Amazon Australia as the US company looks to hire seasonal workers across the country.\n\nThe roles at Amazon Logistics and fulfilment sites ﻿are in NSW, Victoria, Queensland and WA.\n\nThe US company is hiring ahead of its mid-year sales season and the Prime Shopping event in July. ﻿\n\nLIVE UPDATES: Labor leads the polls days out from election day\n\nThe US company is hiring ahead of its mid-year sales season and the Prime Shopping event in July. ﻿ (Supplied)\n\n\"As we prepare for one of our biggest shopping events of the year, we're excited to welcome hundreds of seasonal workers to our sites across our Australian operations network,\" Amazon Australia Director of HR Operations Jacqui Marker said.\n\n\"These roles offer competitive pay, a safe and inclusive work environment, and the opportunity to build valuable skills in a fast-paced, technology-driven workplace.\n\nAustralia's fastest growing jobs with competitive salaries View Gallery\n\n\"Whether someone is looking for temporary work or hoping to build a long-term career with Amazon, we're proud to be creating job opportunities in our local communities while helping us deliver for our customers during Prime Day\".\n\nOpen positions include packers and sorters, forklift drivers and more. (Supplied)\n\nOpen positions include packers and sorters, forklift drivers and more.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/baby-colic-item-recalled-over-lack-of-safety-evidence/2a603722-bfc0-4bf6-8d96-6e8643aa9935",
        "title": "Baby colic item recalled over lack of evidence on its safety",
        "publish_date": "Tue, 29 Apr 2025 22:32:20 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A popular product purporting to help babies suffering from colic has been recalled and removed from the Australian Register of Therapeutic Goods.\n\nIn a recall notice issued last week, the Department of Health said BlissBaby, the makers of the product Lufti Colic Reliever, had failed to provide sufficient evidence to the Therapeutic Goods Administration for the safe use of their product.\n\nAny potential harm or risk could not be ruled out and the devices were therefore being recalled, the department said. However, no adverse events associated with the product have been reported.\n\nThe Lufti Colic Reliever has been recalled because of a lack of evidence provided to the Therapeutic Goods Administration over its safety. (Supplied)\n\nAnyone who has purchased the product is advised to not use it and seek a refund from BlissBaby.\n\nAccording to the BlissBaby website, more than 50,000 of the Lufti Colic Reliever have been sold.\n\n\"These disposable colic relief catheters are designed to be inserted into the baby's bottom to help release trapped gas. They may also help relieve bloating, indigestion, constipation, or excess wind,\" the website states.\n\n\"The catheter features a soft, pliable, and rounded tip. It is made of baby-friendly material that is free from BPA and latex. The safety stopper ensures that the catheter won't get inserted too far into your baby's rectum.\"\n\nThe item is unavailable on the website and is listed as \"sold out\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/china-pledges-to-stand-up-to-donald-trump-tariffs-in-video-message/80e33397-4bae-443a-b933-8f9ab1b456a3",
        "title": "China tells Trump: 'We won't 'kneel down' on tariffs",
        "publish_date": "Tue, 29 Apr 2025 22:20:54 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "In a sharp rebuke of US President Donald Trump's trade war, China's Foreign Ministry posted to social media a striking video that calls on the international community to stand up to America's \"bully\" leader.\n\n\"Bowing to a bully is like drinking poison to quench thirst – it only deepens the crisis,\" China said in its video, narrated in English and subtitled in Chinese.\n\n\"History has proven compromise won't earn you mercy – kneeling only invites more bullying. China won't kneel down.\"\n\nUS President Donald Trump, left, and Chinese President Xi Jinping are in the midst of a bitter trade war. (AP Photo/Susan Walsh, File) (AP)\n\nThe video narrates a history lesson of what China considers American economic aggression, forcing companies such as Toshiba and Alstom into breakup, financial crisis and bankruptcy and sending Japan's economy into \"decades of anemic growth.\"\n\nBy contrast, China portrayed itself as a free-trade haven with which other countries can safety invest and partner.\n\n\"China will stand firm, no matter how hard the wind blows,\" China said in the video. \"Someone has to step forward, torch in hand to shatter the fog and illuminate the path ahead.\"\n\nThe sweeping and dramatic rhetoric doubled as a stern message to the Trump administration after its historic trade war escalation as well as a call to action for other countries. China in the video called on every nation to \"stand tall\" to \"break through the walls of hegemony.\"\n\nThe video didn't specifically mention the 145 per cent tariffs the Trump administration has imposed on Chinese imports – or the 125 per cent retaliatory tariffs China has, in turn, placed on American goods. But China published the video across social media in a moment of apparent willingness to bend from the Trump administration.\n\nChina insists it will stand up to the US tariffs, and urged other nations to take a similar stand. (Getty)\n\nTrump has recently said he expects the tariff on Chinese goods to come down, and US Treasury Secretary Scott Bessent recently called the extremely high tariffs \"unsustainable.\"\n\nBut Trump also said China would need to come up with a strong offer, and though he has said the two nations are in constant communication, China has repeatedly denied the countries are in any kind of active trade negotiation.\n\nMeanwhile, trade talks with the US appear to be in full swing for a large handful of other nations. Bessent said he is in active discussions with 17 other countries during a 90-day window in which the Trump administration paused extraordinarily high \"reciprocal tariffs\" as high as 50 per cent on dozens of countries.\n\nChina urged other nations to stand firm – and to not pick sides with the US over China.\n\n\"We know standing up for ourselves keeps the possibility of cooperation alive,\" the video said. \"China won't back down so the voices of the weak will be heard, bullying will be stopped and justice will not disappear from the world.\"\n\nUS Treasury Secretary Scott Bessent, (AP Photo/Manuel Balce Ceneta) (AP)\n\nThe video's message: America is untrustworthy.\n\nIn the video, China called the US \"a paper tiger.\" It noted that American imports and exports make up less than a fifth of global trade, and the nation \"does not represent the entire world.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariff-fallout-damaging-world-economy-says-billionaire-investor-ray-dalio/0b4bf0a9-518e-4cca-889c-d55aa879fd4b",
        "title": "Billionaire warns it's 'too late' to escape damage from Trump's tariffs",
        "publish_date": "Wed, 30 Apr 2025 00:03:37 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Billionaire American investor Ray Dalio believes it is \"too late\" to combat the economic fallout of US President Donald Trump's tariffs and says the world economic order, with the US at the centre, is breaking down.\n\n\"Based on many of my indicators,\" he wrote in a social media post, \"it appears that we are on the brink of the monetary order, the domestic political and the international world orders breaking down due to unsustainable, bad fundamentals\".\n\nDalio is the founder of Bridgewater Associates, the largest hedge fund by assets, who became famous on Wall Street for anticipating the 2008 financial crisis.\n\nREAD MORE: Trump signals huge move with Australia\n\nBillionaire investor Ray Dalio fears Donald Trump is upturning the global economic order. (AP)\n\nHe is also something of a perennial doom forecaster.\n\nLast year, he told the Wall Street Journal that he \"got it wrong\" with his 2023 forecast that the US economy was entering a debt crisis.\n\nIn a lengthy post on X on Monday, Dalio said he had heard from a growing number of people, including exporters who trade with the US, who recognise that \"whatever happens with tariffs … radically reduced interdependencies with the US is a reality that has to be planned for\".\n\n\"It is also increasingly being realised that the United States' role as the world's biggest consumer of manufactured goods and greatest producer of debt assets to finance its over-consumption is unsustainable.\"\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\nThe post comes as investors, business leaders and governments around the world are desperate for clarity about the strategy behind Trump's tariffs.\n\nForeign investors have retreated from dollar-backed assets and US Treasuries amid widespread concerns about the future stability of the world's largest economy.\n\nWhile it's unlikely to happen overnight, market participants and academics are contemplating a future in which the US dollar is no longer the global reserve currency.\n\nLIVE UPDATES: Labor leads the polls days out from election day\n\nInvestment guru Ray Dalio fears the US may lose its global economic leadership. (AP Photo/Peter Morgan, File)\n\nAccording to Dalio, whose warning came with a promotion of his new book, investors would be \"naive\" to assume that they can keep lending to the US and get paid back in \"hard\" dollars, meaning currency that isn't devalued.\n\n\"There is a growing risk that the United States…will increasingly be bypassed by a world of countries that will adapt to these separations from the United States and create new synapses that grow around it,\" he wrote.\n\nDalio isn't the only billionaire to sound the alarm over Trump's policies.\n\nJamie Dimon, CEO of JPMorgan Chase; Stanley Druckenmiller, founder of the Duquesne Family Office; hedge fund investor Bill Ackman and others have all publicly fretted that the trade war the president set off could hurt the American economy.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/recipetin-eats-vs-brooki-bakehouse-nagi-maehashi-accuses-brooke-bellamy-of-copying-recipes-in-bake-with-brooki-cookbook/3110d17f-ab10-4a83-bb48-1510ce466305",
        "title": "'Blatant exploitation': RecipeTin Eats claims TikToker copied recipes",
        "publish_date": "Tue, 29 Apr 2025 20:25:35 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A dispute has broken out between two of Australia's most influential cooks over allegations of plagiarising recipes.\n\nNagi Maehashi of popular cooking website RecipeTin Eats yesterday published a blog accusing Brisbane TikTok star and bakery owner Brooke Bellamy of copying two of her recipes in her best-selling Bake with Brooki cookbook, released last year.\n\nBellamy responded late last night, denying she had plagiarised.\n\nShe said she had offered to remove the recipes in question — for caramel slice and baklava — from future reprints and that she'd been making the slice years before Maehashi published her recipe online.\n\nNagi Maehashi, creator of RecipeTin Eats, pictured in her kitchen. Image: Nagi Maehashi (Nagi Maehashi, creator of RecipeTin Eats, pictured in her kitchen. Image: Nagi Maehashi)\n\nBoth creators have more than a million followers on social media, RecipeTin Eats boasts more than 30 million visitors to its website a month and Brooki Bakehouse in central Brisbane often has long queues down the street.\n\nMaehashi said she'd made \"copyright infringement allegations\" against the book's publisher, Penguin Random House Australia, claiming it plagiarised two of her recipes, but she had not launched legal proceedings against either the author or publisher.\n\n\"To me, the similarities between the recipes in question are far too specific and detailed to be dismissed as coincidence,\" she said.\n\n\"Penguin has denied the allegations. I have received no response from Brooke Bellamy, the author.\n\n\"I'm speaking up because staying silent protects this kind of behaviour. Profiting from plagiarised recipes is unethical – even if it is not copyright infringement – and undermines the integrity of the entire book.\n\n\"And it's a slap in the face to every author who puts in the hard work to create original content rather than cutting corners.\"\n\nBrooke Bellamy responded late last night, denying she had plagiarised (A Current Affair)\n\nThe Sydneysider said the similarities were brought to her attention by a reader in November and she posted comparison photos.\n\nShe described the inclusion of the recipes in the book, which Maehashi claims has sold more than 90,000 copies, or $4.6 million in sales, in six months as \"disrespectful\" and a \"kick in the guts\".\n\n\"I put a huge amount of time and effort into testing recipes, whether it's an original creation or one adapted from another source. It is what I am known for – the press have called me 'obsessive' about testing on more than one occasion,\" she wrote.\n\n\"And I share them freely on my website for anyone to enjoy.\n\nREAD MORE: ﻿ Disgraced cardinal formally withdraws from participation in conclave to elect pope\n\nBellamy responded last night on her Instagram Stories, saying she had \"great respect\" for Maehashi. (9Product Reviews)\n\n\"To see them plagiarised (in my view) and used in a book for profit, without permission, and without credit, doesn't just feel unfair. It feels like a blatant exploitation of my work.\"\n\nBellamy responded last night on her Instagram Stories, saying she had \"great respect\" for Maehashi.\n\n\"I did not plagiarise any recipes in my book which consists of 100 recipes I have created over many years, since falling in love with baking as a child and growing up baking with my mum in our home kitchen,\" she said.\n\n\"In 2016, I opened my first bakery. I have been creating my recipes and selling them commercially since October 2016 - as shown in the next slide and as was communicated at the first point of contact I received.\n\n\"On March 2020, Recipetin Eats published a recipe for caramel slice.\n\n\"It uses the same ingredients as my recipe, which I have been making and selling since four years prior.\"\n\nREAD MORE: ﻿ Teenagers earn high praise for heroic rescue at Adelaide beach\n\nThe statement posted by brookibakehouse on Instagram in response to the allegations. (Instagram/brookibakehouse)\n\nThe second part of the statement posted on Instagram. (Instagram/Brookibakehouse)\n\nBellamy said recipe development was \"enveloped in inspiration from other cooks, cookbook authors, food bloggers and content creators\".\n\n\"This willingness to share recipes and build on what has come before is what I love so much about baking and sharing recipes - the community that surrounds it,\" she said.\n\n\"I stand by my love for baking, my recipes, and the joy this book has brought so many home bakers around the world eager to try recreating my recipes from inside their homes.\"\n\nPenguin Random House Australia has been contacted for comment by 9News.com.au.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/world-news-donald-trump-calls-amazons-jeff-bezos-for-considering-tariff-charge-label/36d63203-4e15-4588-ad49-b22c16c7c833",
        "title": "'Pissed' Trump calls Amazon boss over 'tariff charge'",
        "publish_date": "Tue, 29 Apr 2025 21:27:29 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The White House took aggressive aim at Amazon, with President Donald Trump putting in a call to Amazon founder Jeff Bezos after the company considered displaying the added cost of tariffs on certain items.\n\nTrump called Bezos to complain about reports that Amazon was considering displaying the cost of US tariffs next to prices for certain products on the company's website, two senior White House officials told CNN. Trump later said it was a \"good call\".\n\n\"Jeff Bezos was very nice. He was terrific,\" Trump told reporters on Tuesday. \"He solved the problem very quickly. Good guy.\"\n\nWhite House press secretary Karoline Leavitt with Treasury Secretary Scott Bessent, back left, shows a picture of Jeff Bezos as she responds to a question about Amazon. (AP)\n\nPunchbowl News first reported that Amazon will soon \"display how much of an item's cost is derived from tariffs — right next to the product's total listed price.\"\n\nThe move could directly illustrate to American consumers how Trump's tariffs are affecting the cost of goods. Trump has slapped 145 per cent tariffs on imports from China and a 10 per cent minimum tax on all other countries.\n\nThe call came shortly after one of the senior officials phoned the president to inform him of the story.\n\n\"Of course he was pissed,\" one of the officials, granted anonymity to speak candidly, told CNN.\n\n\"Why should a multibillion-dollar company pass off costs to consumers?\"\n\nAt a briefing Tuesday, White House Press Secretary Karoline Leavitt called the move a \"hostile and political act,\" adding that she had spoken about the matter with President Trump earlier.\n\nCommerce Secretary Howard Lutnick echoed Levitt's comments, saying it was a hostile act if a company went out of its way to \"make it seem\" like tariffs have caused prices to change.\n\nAmazon boss Jeff Bezos alongside his fiancee Lauren Sanchez at a red carpet earlier this month. (Jordan Strauss/Invision/AP)\n\n\"It's nonsense,\" he said in a CNBC interview. \"A 10 per cent tariff is not going to change virtually any price,\" he added, referring to the nearly universal baseline tariff on all countries.\n\n\"The only price will change would be a product that we don't make here, like a mango.\" The 10 per cent tariff, however, is hardly the only one in effect.\n\nAn Amazon spokesperson said in a statement to CNN that the move \"was never a consideration for the main Amazon site and nothing has been implemented on any Amazon properties.\"\n\nAmazon, however, said it was considering the \"idea of listing import charges on certain products\" on Haul, its spin-off website that sells items below $US20 ($31), but the change wasn't rolled out.\n\n\"This was never approved and not going to happen,\" an Amazon spokesperson said.\n\nHowever, Senate Minority Leader Chuck Schumer encouraged businesses to do just that.\n\n\"To the large businesses that sell to consumers, I say show your customers how much tariffs are hurting in their pocketbook. People deserve to know the impact tariffs have on their finances,\" Schumer said in remarks delivered on the Senate floor.\n\nChinese online retailers Temu and Shein have already sounded the alarm over increased prices. (AP)\n\nOther e-commerce websites, such as Shein and Temu, have implemented changes to their pricing due to the cost of tariffs. Temu has even introduced a new import charge that is displayed at checkout. Both companies source most of their products from China.\n\nLeavitt also cited a Reuters report from 2021 about an alleged partnership between Amazon and a \"Chinese propaganda arm\" that censored user reviews on its Chinese website for President Xi Jinping's speeches and writings.\n\nShe said that was \"another reason why Americans should buy American,\" adding that \"it's another reason why we are onshoring critical supply chains here at home, to shore up our own critical supply chain and boost our own manufacturing here.\"\n\nBezos has actively worked to cultivate a relationship with the president in his second term, congratulating him on his November election and dining at the White House.\n\nAmazon donated $US1 million to Trump's inaugural fund and is producing a documentary focused on first lady Melania Trump .\n\nTrump recently praised Bezos, telling The Atlantic in an interview published Monday: \"He's 100 per cent. He's been great.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-policy-promises-anthony-albanese-peter-dutton-housing-tax-energy-health-explained/69f5f5d2-2fff-4aa3-b10e-8ce7d707a50f",
        "title": "The election promises Labor and the Coalition have made to win your vote",
        "publish_date": "Tue, 29 Apr 2025 04:11:32 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "With the federal election campaign now just days away, both Labor and the Coalition have unveiled﻿ a slew of policies in an attempt to attract voters.\n\nUnlike in 2022, when Anthony Albanese ran a \"small target\" campaign and there were relatively few significant differences between the major parties' policy offerings, there are some notable contrasts this time around.\n\nHere are the main election promises made by Labor and the Coalition in the lead-up to the 2025 election.﻿\n\nREAD MORE: Where Albanese and Dutton have been on the campaign trail ﻿\n\nAnthony Albanese and Peter Dutton have made a long list of election promises. (Nine)\n\nHousing\n\nLabor\n\nLabor will allow first-home buyers to get into the property market with just a 5 per cent deposit without having to pay lenders mortgage insurance ﻿(LMI).\n\nIt has also promised $10 billion in funding to build 100,000 properties specifically for first-home﻿ buyers, and has matched the Coalition's pledge to ban foreign investors from buying existing homes for two years.\n\nIt will also continue a series of other housing policies enacted this term, including the Housing Australia Future Fund , Help to Buy scheme , and National Housing Accord target of building 1.2 million homes by mid-2029.﻿\n\nREAD MORE: The key seats that could give Labor a second term in government ﻿\n\nTha major parties have different approaches to addressing the housing crisis. (Dion Georgopoulos/SMH)\n\nCoalition﻿\n\nThe Coalition has promised to make the interest payments on the first $650,000 of a mortgage for a new home tax deductible for eligible buyers.\n\nIt will also allow people to withdraw $50,000 from their superannuation for a home deposit, and has allocated $5 billion for a fund to speed up essential infrastructure in a move it says will support 500,000 new homes.\n\nIt has also promised to ban ﻿foreign investors from buying existing homes for two years, scrap the $10 billion Housing Australia Future Fund, and reduce migration intake by 25 per cent.\n\n﻿Tax and cost of living\n\nContrasting tax relief has been ﻿front and centre since the first day of the campaign, with Albanese and Peter Dutton arguing they have the better plan to handle the cost of living.\n\nLabor\n\nLabor went into the election fresh off the federal budget, when it announced a \"modest\" tax cut worth about $5 a week when it's introduced in 2026-27 before doubling to $10 a week the year after.\n\nAt the party's official campaign launch, Albanese also announced an automatic $1000 deduction﻿ all workers will be able to claim instead of having to lodge individual claims and receipts for multiple deductions.\n\nREAD MORE: The suburbs that could make Peter Dutton prime minister ﻿\n\nCoalition\n\nThe Coalition has promised to repeal Labor's tax cuts, instead promising to halve the fuel excise for a year to provide cost-of-living relief to motorists .\n\nIt has also offered up a temporary tax offset of up to $1200 for low- and middle-income earners who take home less than $144,000. This will only apply for the 2025-26 financial year.\n\nPeter Dutton has been visiting plenty of petrol stations to push his proposed cut to the fuel excise. (James Brickwood/SMH)\n\nEnergy﻿ and climate\n\nPerhaps the most significant policy difference between the two major parties is on energy, thanks to the Coalition's push for Australia to embrace nuclear power . ﻿\n\nLabor\n\nLabor has pledged to extend the energy bill rebates rolled out in the 2024 budget for another six months , providing households with an extra $150 in savings.\n\nIt will continue to roll out renewables to meet Australia's energy needs, with the goal of solar and wind making up 82 per cent of the grid by 2030, with gas and other fossil fuels \"firming\" up supply.\n\nIt's also announced a $2.3 billion fund to cut the cost of installing battery storage by 30 per cent.\n\nLabor has existing emissions reductions targets for 2030 and 2050 (a 43 per cent cut and net zero respectively), but hasn't committed to a 2035 goal. ﻿\n\nREAD MORE: The severe penalties for anyone caught voting twice ﻿\n\nLabor's energy policy is focused on expanding the rollout of renewables. (Wolter Peeters/SMH)\n\nCoalition\n\nThe centrepiece of the Coalition's energy plan is its proposal to construct seven nuclear reactors around the country.\n\nIt says all of the plants would be operational sometime in the 2040s, and would cost $331 billion – although the modelling used for that figure relies on Australia needing and producing significantly less energy than Labor's plan.﻿\n\nIt is also planning to ramp up gas production to meet the energy shortfall in the interim as coal plants shut down and the reactors are built﻿, announcing a $1 billion fund for infrastructure expansion.\n\nDutton cancels press conference as nuclear protesters descend on footy oval View Gallery\n\nIt will also introduce an east coast gas reservation , forcing local producers to keep more gas in Australia instead of selling it overseas, and fast-track approval for the North West Shelf gas expansion.\n\nThe Coalition has not set emissions reduction targets. While it has previously talked of scrapping and reviewing Labor's 2030 goal, it says it is committed to net zero by 2050 and the emissions reduction targets Australia signed up to at the Paris climate conference.\n\nThe Coalition has also pledged to repeal the New Vehicle Efficiency Standard, which encourages car makers to produce more fuel-efficient vehicles and penalises companies that exceed a set emissions cap.\n\nThe Coalition is proposing a shift to nuclear energy. (AP Photo/Virginia Mayo)\n\nHealth\n\nLabor has leant heavily into health – particularly Medicare – during the campaign, seeking to target Dutton for his previous stint as health minister.\n\nLabor\n\nLabor will also spend $644 million to expand the Medicare urgent care clinic network with 50 new centres, and $1 billion to build or upgrade dozens of walk-in mental health facilities and train 1200 new workers in the sector.\n\nIt has also announced plans for a $204 million, 24/7 GP hotline. ﻿\n\nMedicare has been at the heart of Anthony Albanese's re-election pitch. (Alex Ellinghausen)\n\nCoalition\n\nFor the most part, the Coalition has matched Labor's big health policies, promising to back the $8.5 billion Medicare funding and cut to PBS medicine costs.\n\nOn mental health, it is promising $400 million for youth services, and will permanently reintroduce the pandemic-era policy for 20 subsidised mental health sessions for people with a mental health care plan﻿, up from the current 10.\n\nEducation\n\nEducation is another area ﻿that Labor has sought to target, particularly in relation to childcare and student debt.\n\nLabor\n\nLabor has promised to forgive $16 billion in student debt on June 1 – a 20 per cent cut for everyone with an outstanding HECS-HELP or other similar loan.\n\nIt will also establish a $1 billion fund to build and upgrade 160 childcare centres, in addition to its move to provide three days of subsidised childcare for all families .﻿\n\nLabor will also continue to provide fee-free TAFE places.﻿\n\nCoalition\n\nThe Coalition will set a target of having 400,000 apprentices and trainees and incentivise businesses to provide those positions.﻿\n\n﻿Workplace\n\nA focus on workplace policies has somewhat faded as the campaign﻿ has progressed.\n\nLabor\n\nLabor will ban non-compete clauses for workers earning less than $175,000 a year to make it easier for people to change jobs. It is also promising to protect penalty rates in legislation if re-elected.\n\nCoalition\n\nThe Coalition has promised to shrink the size of the public service by 41,000 workers over five years through a hiring freeze, natural attrition, and offering voluntary redundancies.\n\nIt is also offering up to $20,000﻿ in tax deductions for small businesses to spend on staff meals and entertainment.\n\nIt has previously promised to repeal the right-to-disconnect ﻿laws introduced in the last parliament, although has said it would keep Labor's same job, same pay legislation.\n\nIt had been promising to force public servants back to the office, but scrapped that policy one week into the campaign .﻿\n\nREAD MORE: The 10 closest seats heading into the election ﻿\n\nBoth parties have a small handful of policies focused on workplaces. (Louie Douvis/AFR)\n\nCrime\n\nAs a largely state-controlled issue, crime hadn't been a major talking point until late in the campaign due to an Easter Monday announcement by the Coalition .\n\nLabor\n\nLabor largely wasn't drawn on the Coalition's crime announcement, pointing to its own policies it enacted during the last term, including introducing a child sexual offender registry and a crackdown on illegal tobacco being imported into Australia.﻿\n\nIt also made the first domestic violence pledge of the campaign: $8.6 million in funding for \"innovative \" management of perpetrators, as well as a crackdown on financial abuse .﻿\n\nCoalition\n\nThe Coalition ﻿promised to allocate $750 million in funding for a range of crime policies, including trialling a new child sex offenders disclosure scheme, an AFP strike force to target illicit drugs, and a national antisemitism taskforce led by the AFP.\n\nIt also said it would standardise knife laws and roll out detector wands across the country in conjunction with the states and territories.\n\nIn a later announcement, it ﻿promised $90 million for domestic violence prevention and response , including setting up a notional offenders registry.\n\nREAD MORE: How independents will shape the federal election ﻿\n\nDefence spending was brought up late on in the campaign. (AP)\n\nDefence\n\nWhile defence has loomed over much of the campaign due to the reported Russian request for an airbase in Indonesia, it took until 10 days before election day for a major announcement by either of the parties.﻿\n\nLabor\n\nLabor has not leant heavily into defence during the campaign. Last year, it promised to increase defence spending by $50.3 billion over a decade , and later announced it would bring some of that forward.\n\nCoalition\n\n﻿The Coalition announced it would boost spending by a further $21 billion by 2030 and lift total defence expenditure to 3 per cent of GDP within the next 10 years.\n\nHow will they pay for their promises?\n\nEvery election, each of major parties publishes its election costings, a document outlining how it will fund its election promises and what impact they will have on the budget bottom line.﻿\n\nLabor\n\nLabor released its costings the Monday before the election, and says it can pay for its new promises and still have the budget in a better position.﻿\n\nIt outlined $6.4 billion in labour cost savings plus an extra $760 million in new revenue from increased student visa application fees.\n\nThe government says, when combined with the cost of its election promises, the budget will be better off ﻿by about $1 billion over the forward estimates period, with $150.5 billion in combined deficits instead of $151.6 billion.﻿\n\nThe bulk of Labor's policies were already costed in March's federal budget.﻿\n\nCoalition\n\nThe Coalition is yet to publish its costings﻿. Peter Dutton has said they will be released \"in due course\".",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/inflation-march-quarter-2025-stable/105232824",
        "title": "Breaking: Headline inflation stable at 2.4pc while RBA's preferred measure drops within target",
        "publish_date": "Wed, 30 Apr 2025 01:34:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Headline inflation has remained steady but the Reserve Bank's preferred measure of consumer prices has fallen within the RBA's target band for the first time in more than three years.\n\nThe Australian Bureau of Statistics March quarter data show headline inflation remained steady at an annual rate of 2.4 per cent, while the RBA's preferred measure of trimmed mean inflation dropped from 3.3 to 2.9 per cent.\n\nEconomists surveyed by Reuters generally expected headline inflation to ease to 2.3 per cent for the 12 months to March, with the trimmed mean figure falling to 2.8 per cent — within the Reserve Bank's 2-3 per cent target range.\n\nAhead of the data release, markets were pricing in the virtual certainty of a 0.25-percentage-point interest rate cut on May 20, with a slim chance of a larger cut at that RBA meeting.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/wallabies-coach-les-kiss-joe-schmidt-2026-australian-rugby/105232498",
        "title": "How Les Kiss went from rugby league winger to the Wallabies' next coach",
        "publish_date": "Wed, 30 Apr 2025 01:29:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "For much of his career across the two rugby codes, Les Kiss has been in demand.\n\nKiss to succeed Schmidt as Wallabies coach in 2026 Photo shows Less Kiss smiles ahead of a 2025 Super Rugby Pacific match. Les Kiss will be the next Wallabies coach, but not until next year after Joe Schmidt agreed to extend his tenure.\n\nIn 1985, North Sydney Bears coach Brian \"Chicka\" Norton travelled to Brisbane on a recruitment drive during the off-season.\n\nNorton's main target was Gary Belcher, who had recently played fullback in Souths' premiership-winning team in the Brisbane Rugby League competition.\n\nThe Bears couldn't afford the asking price for Belcher, however, and he would eventually sign with the Canberra Raiders and become one of their greats.\n\nNorton, though, took note of recommendations given to him about Kiss, who was making an impression as a winger with the storied Valley Diehards club.\n\n\"Les Kiss is the man we want,\" Norton told Bears officials, who signed the Bundaberg product for the following season.\n\nIt proved to be a wise decision, with Kiss excelling to such an extent he made his Test and State of Origin debut during his first year with the Bears.\n\nFast-forward to 2025, and Kiss became the man Rugby Australia (RA) wanted to replace Joe Schmidt as Wallabies coach.\n\nJoe Schmidt (left) joined the Wallabies program in 2024. (Getty Images: Clive Rose)\n\nInitially, RA hoped for a post-Rugby Championship transition in October following Schmidt's decision to stand down for family reasons.\n\nBut after a drawn-out process, Schmidt agreed to stay on until mid-2026, from which point Kiss will be handed the reins once his three-year contract as Queensland Reds coach expires.\n\nKiss's 25-year rugby journey\n\nSnobs in the Australian rugby union community may be incredulous a former league player has been handed such a prestigious position.\n\nBut Kiss is no newcomer to the \"game they play in heaven\".\n\nHe has cut his teeth across several countries during a 25-year span in rugby union, working in both national and club programs.\n\n\"It's a long process,\" said Kiss, as he discussed his transition between the rugby codes at an RA media conference in Sydney on Wednesday.\n\n\"Coming from the 80s … changing into rugby, I think you learn a lot of things along the way but one thing that is absolutely important is you don't get anywhere on your own.\n\n\"Places that build strong people around you, that have a team focus, those are the teams that win premierships.\n\n\"Those are the teams that grow and continue to meet the challenges on any level.\"\n\nAfter holding down coaching positions in rugby league, Kiss switched codes to become a defence consultant in South Africa across 2001 and 2002.\n\nKiss's influence was evident at the Test level when the Springboks conceded just three tries during the 2001 Tri-Nations tournament.\n\nKiss (right) worked with the Waratahs early in his coaching career. (Getty Images: Mark Nolan)\n\nAssistant coach roles with the Waratahs — working under Bob Dwyer and Ewen McKenzie — and the Australia A team further consolidated Kiss's reputation as a defensive specialist.\n\nHe was recruited by Ireland head coach Declan Kidney ahead of the 2009 Six Nations, enjoying immediate success when the Irish claimed their first Grand Slam in 61 years.\n\nDuring Kidney's reign, Kiss was credited with introducing the \"choke tackle\", which was used to great effect when Ireland upset the Wallabies 15—6 at Auckland's Eden Park during the pool stage at the 2011 World Cup.\n\nWill Genia was a particular target, and he fell victim to the defensive ploy when Ireland back-rower Stephen Ferris famously wrapped up the Wallabies scrum half and drove him back more than 10 metres.\n\n\"We've focused on closing down the options Genia has,\" Kiss said before the match, giving a glimpse of his thoroughness as a coach.\n\n\"We've got to concentrate on picking the right moment to put pressure on him.\"\n\nKiss (left) was as an assistant coach under Schmidt with Ireland between 2013 and 2015. (Getty Images/Sportsfile: Seb Daly)\n\nKiss later served as Ireland's interim head coach for two Tests, following Kidney's sacking in 2013, before joining Schmidt's staff when the New Zealander was appointed to the permanent role.\n\nIreland won consecutive Six Nations crowns with Kiss working alongside Schmidt, but exited the 2015 Rugby World Cup earlier than expected in the quarterfinal stage.\n\nAfter the Rugby World Cup, Kiss joined Irish powerhouse Ulster on a full-time basis as its director of rugby, but his tenure produced inconsistent results and he departed in January 2018.\n\nKiss was named London Irish head coach two months later and while he could not avoid relegation from England's top-flight premiership, the club did win the second-tier competition the following the season to earn promotion.\n\nLondon Irish punched above its weight to finish fifth in the 2022/23 premiership before financial difficulties led to the club's demise, leading Kiss back to his home state of Queensland ahead of the 2024 Super Rugby Pacific season.\n\nDoubts over Kiss's credentials\n\nWhile Kiss's CV is bursting with international experience, there will be critics pointing to the fact he has not won a title in a top-tier domestic tournament.\n\nEddie Jones (Brumbies, 2001), Ewen McKenzie (Reds, 2011) and Michael Cheika (Waratahs, 2014) all won Super Rugby championships in the professional era prior to coaching the Wallabies.\n\nAnd Rugby World Cup-winning coaches Bob Dwyer and Rod Macqueen enjoyed great success at club and provincial level respectively before leading the national side.\n\nIn February, following Schmidt's announcement he would not lead the Wallabies through to the 2027 Rugby World Cup, Australian coaching doyen John Connolly suggested RA again look offshore to find a replacement.\n\nConnolly, who oversaw the Wallabies in 2006 and 2007, told News Corp none of the four Australian Super Rugby Pacific coaches had \"stand-out resumes\".\n\nIt contrasted with the situation in New Zealand rugby when they were choosing a successor to All Blacks coach Ian Foster after it was decided he would finish up at the 2023 Rugby World Cup.\n\nScott Robertson had won multiple Super Rugby titles with the Crusaders before being picked ahead of Jamie Joseph, who claimed silverware with the Highlanders and guided Japan to a historic Rugby World Cup quarterfinal appearance in 2019.\n\nKiss has coached the Queensland Reds the past two seasons. (Getty Images: Kai Schwoerer)\n\nIn Kiss's defence, he has time to win over sceptics.\n\nThe Reds are in finals contention in this year's Super Rugby Pacific competition, sitting in fourth place on the standings after 11 rounds.\n\nHe will have another bite of the cherry when he sees out the third season of his Reds' contract next year before linking up with the Wallabies.\n\nIn his favour as a coach, Kiss has the unwavering support of his players.\n\nThis is illustrated by several Reds stars — including Wallabies captain Harry Wilson and Fraser McReight — signing long-term contract extensions to stay at Ballymore.\n\nKiss can be described as a \"player's coach\" and this trait wouldn't have gone unnoticed when RA came chasing his services.\n\nEven though RA had hoped Schmidt would take the Wallabies through to the next Rugby World Cup, the fact the governing body agreed to Kiss seeing out his Reds deal indicates how keen they were to have the 60-year-old on board.\n\nJust like the North Sydney Bears back in the 80s, RA got the man they wanted.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/gladstone-could-miss-out-on-green-hydrogen-opportunities/105228458",
        "title": "Election could change the future of Australia's hydrogen capital",
        "publish_date": "Wed, 30 Apr 2025 00:33:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "With a view across the southern Great Barrier Reef and shrouded by state forests, it is easy to forget Gladstone is one of the most emissions-intensive places in Australia.\n\nBut the city is a major Australian producer of cement, alumina, aluminium, and ammonia, while the Gladstone Port — one of the biggest bulk commodity ports in the world — facilitates tens of billions of dollars' worth of trade annually through its exports of products like coal and gas.\n\nState and federal governments have earmarked the city's future as a possible green hydrogen powerhouse.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nThis is something some experts and residents believe would shore up its future if a government could pull it off.\n\nLast year Prime Minister Anthony Albanese announced temporary tax credits that would see producers of green hydrogen receive $2 per kilogram of renewable hydrogen produced for a period of up to 10 years.\n\nThe Gladstone port is a major exporter of coal. (ABC News: Scout Wallen)\n\nThe initiative would cost the government an estimated $8 billion across 10 years initially, and then an average of $1.2 billion per year from 2034-35 and 2040-41.\n\nThe LNP has vowed to scrap the policy if it is elected.\n\nLoading YouTube content\n\nGreen hydrogen and Gladstone\n\nGreen hydrogen can be produced when it is extracted from water through electrolysis, which is powered by a renewable energy source.\n\nGladstone resident Jade Wright is a student nurse who worked as a deckhand on boats and has done maintenance work at industrial facilities.\n\nGladstone local Jade Wright would like to see the hydrogen industry flourish in the city. (ABC News: Jasmine Hines)\n\nHaving been a teenager during Gladstone's last boom and bust cycle from LNG in the 2010s, she is worried about the city decarbonising and what it could look like.\n\n\"The way it [the bust] changed the community in town … and the hole that was left when they left, that's the kind of emotional stuff you don't really hear from the technical experts,\" she said.\n\nMs Wright said government investment should be made to kickstart the green hydrogen industry.\n\n\"If hydrogen can't get off the ground, the whole of Gladstone continues to struggle,\" she said.\n\nBut on the other side of politics, the LNP takes a different view.\n\nIts flagship election energy policy is to build small nuclear power plants around Australia.\n\nOne of these would be just over 100 kilometres to the west of Gladstone, near Biloela.\n\nLocal scaffolding business owner David Nunn co-founded the CQ Nuclear Alliance three years ago and believes it is the way forward.\n\nGladstone businessman David Nunn co-founded the CQ Nuclear Alliance. (ABC News: Jasmine Hines)\n\nHe is wary of the government support provided to the private sector for renewable projects, including for green hydrogen.\n\n\"We've got to run a business in the private sector. We have rules, people we have to deal with. [Then] other sectors suddenly get a free ride,\" he said.\n\n\"I support any industry that stacks up financially.\"\n\nMr Nunn said the nuclear industry had been proven overseas, while he believed green hydrogen was still in an experimental stage.\n\nBut if Gladstone's green hydrogen dream crumbled, and emissions-intensive industries were wound back, Ms Wright believed Gladstone would suffer.\n\n\"Without the jobs, without the heavy industry, as a town, we're kind of flailing,\" she said.\n\nFortescue has the largest hydrogen electrolyser manufacturing plant in the country in Gladstone. (Supplied: Queensland government)\n\nCQUniversity Professor Jonathan Love said the developing industry would need incentives to become competitive and give investors confidence.\n\nProfessor Love said Gladstone had the potential to be a major exporter of hydrogen, but only if the industry was incentivised by the government.\n\n\"It's just going to put a major handbrake on the industry. Investment will stall and it's going to hold things back substantially,\" he said.\n\n\"If Australia is too late getting there then there'll already be a market that the likes of Japan and South Korea will be tapping into.\"\n\nA hydrogen electrolyser. (ABC Illawarra: Tim Fernandez)\n\nA paper published by the Nature Energy journal earlier this year tracked 190 green hydrogen projects globally, finding only seven per cent were completed on time.\n\nGruen Nation — Add to watchlist Photo shows An election sign of Wil Anderson in a neighbourhood with a dog urinating on it with Gruen Nation Election edition and iview. It's election season and politicians are trying to sell you the world. The team at Gruen isn't about to buy it. They're taking a big swing at the election, showing you how the democracy sausage is made, all the sizzle and none of the meat.\n\nIt found to keep global warming at 1.5 degrees above pre-industrial levels, production needed to grow 380-fold and double each year.\n\n\"That's where these incentives are needed,\" Professor Love said.\n\nHe said current production methods using natural gas and coal were carbon-intensive, and green hydrogen was essential to meeting net zero emissions by 2050.\n\nGreen hydrogen already in use\n\nRenewable hydrogen is already being used in the city's gas network, while billionaire Andrew Forrest's company Fortescue is manufacturing hydrogen electrolysers in Gladstone.\n\nThe next stage of the company's project will see the electrolysers produce green hydrogen.\n\nAn electrolyser built by Fortescue. (Facebook: Glenn Butcher MP)\n\nA Fortescue spokesperson said incentives were critical to developing a green iron industry, which required large amounts of green hydrogen as a fuel source.\n\n\"This kind of government support will help attract large-scale investment, foster innovation, and secure thousands of new jobs in advanced manufacturing,\" it said.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/bickham-coal-walks-away-from-hunter-mining-licence/105196990",
        "title": "'Foal beats coal' in land use fight that divided a community",
        "publish_date": "Tue, 29 Apr 2025 23:25:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The company behind a controversial New South Wales Upper Hunter coal project has told the ABC it will walk away from the site almost 30 years after first looking to mine in the region.\n\nThe Bickham Coal proposal divided the small communities of Scone, Blandford, and Murrurundi during the early 2000s in a dispute dubbed \"coal versus foals\".\n\nThe decades-long fight saw the mining sector champion the Bickham Coal project and its potential economic boost, while the thoroughbred sector said its multi-billion-dollar industry would be at risk.\n\nIn 2010 the project became the first greenfield mine to be knocked back by the NSW government, but up until now the company has renewed and retained its licence.\n\nThe exploration licence to extract coal up to 900 metres underground for 25 years expires in a matter of weeks — 28 years after being granted.\n\nThe ABC can now reveal there will be no mining of any kind at the site near Murrurundi, with Bickham pulling the plug for good.\n\nBickham Coal did not agree to an interview with the ABC and instead issued a statement on its last remaining licence.\n\n\"Bickham Coal Company held two exploration licences, one granted in 1997, the other 2001,\" the statement said.\n\nThe company said one was cancelled last year and it \"intends for the remaining one to be cancelled in the near future\".\n\nAround 20 years ago Bickham Coal extracted a 25,000-tonne bulk sample of coal to determine the viability of mining in the area. (ABC Rural: David Claughton)\n\n\"Although this licence expires on 28 May 2025, Bickham will seek to have it renewed only for the purpose of having rehabilitation works completed and approved by the department,\" it said.\n\nThat is a mandatory condition before a licence cancellation.\n\nThe statement said, \"Bickham intends for this to happen in the quickest possible time frame\".\n\n\"Bickham has no intention of pursuing mining activity at the site,\" it said.\n\nCoal vs foals\n\nThe Hunter's world-renowned thoroughbred breeding industry led the campaign against the mine. (ABC News: Bridget Murphy)\n\nThe long-running interest in the Bickham project began in 1997 when the first exploration licence was granted.\n\nConsultation and talks about the proposal began in earnest five years later.\n\nBickham Coal said at the time that its 36-million-tonne project could have created almost 400 jobs and delivered $3.7 billion in revenue.\n\nThe then-mayor of the now-defunct Murrurundi Shire Council, Earl Kelaher, said it was an optimistic time.\n\n\"The owner of Bickham Coal made it very easy to talk to him,\" he said.\n\n\" I think what he offered Murrurundi was very encouraging at the time with the offer of new homes, and his workers living in those homes, instead of driving out of town to do their work. \"\n\nBut not everyone was on side.\n\nPeter Haydon said the fight against the mine took a toll. (ABC News: Tim Lee)\n\nBlandford farmer and horse breeder Peter Haydon said he spent years fighting the mine project.\n\n\"It was certainly a 10-year fight. It's culminated in a fantastic result because it actually affects all the studs that the Pages River flows through,\" he said.\n\nRetail King Gerry Harvey, who has interests in the thoroughbred breeding sector, weighed into the fight against Bickham, as did retired talkback radio host Alan Jones.\n\nWhen it came to assessing the mine in 2010 then-premier Kristina Keneally sided with the horse industry, travelling to the region to announce the Bickham application had been rejected.\n\n\"We recognise the importance of the thoroughbred industry and the significant impacts this proposal will have on groundwater,\" Ms Keneally said at the time.\n\nIt is believed to have been the first time the NSW government had rejected a greenfield mining proposal.\n\nFormer premier Kristina Keneally rejected an open cut coal mine at the Bickham site. (ABC News: Ian Cutmore)\n\nMr Haydon was thrilled.\n\n\"It was a real credit to our community how they all pulled together and came up with this amazing result,\" he said.\n\nFinal reflections\n\nBut Mr Kelaher said it was a lost opportunity for Murrurundi and surrounds.\n\n\"We did talk about the void that the mine would eventually make that could have been made into storage, water storage for Murrurundi township,\" he said.\n\n\"That made us think very clearly about what we were dealing with because we've battled for water for years and years.\"\n\nIn the end, foal won over coal.\n\nFifteen years on, as the chapter finally closes, Peter Haydon said \"the district can celebrate in a big way\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/erin-patterson-mushroom-murder-trial-leongatha-victoria-aus/105230440",
        "title": "Live: Prosecutors outline case against Erin Patterson to mushroom murder jury",
        "publish_date": "Tue, 29 Apr 2025 23:23:07 +0000",
        "category": "finance",
        "authors": [
            "Judd Boaz",
            "Joseph Dunstan",
            "Tim Callanan",
            "Kristian Silva",
            "Mikaela Ortolan"
        ],
        "text": "Reporting by Kristian Silva\n\nDr Rogers moves to the critical event of the trial — the lunch itself.\n\nShe said Ms Patterson's four guests arrived at her Leongatha home and greeted them at the door.\n\nShe showed them around the house before the group gathered around the kitchen island bench.\n\nThe meals prepared were five individual beef Wellingtons, mashed potatoes and green beans.\n\n\"They said grace and started the meal,\" Dr Rogers said.\n\nDr Rogers said the guests all ate from grey-coloured plates, while Ms Patterson's was a lighter colour, which was described as orange and smaller than the others.\n\nThe prosecution said Ian and Heather ate all of their serving of beef Wellington, while Don ate all of his serving and half of Gail's.\n\nFor dessert, they ate a cake brought by Gail and a fruit platter from Heather.\n\nDr Rogers said Ms Patterson dropped a bombshell — that she had cancer.\n\nShe wanted to know whether to tell her kids or to keep it from them.\n\nThe group prayed again, the court heard, and the guests headed home later that afternoon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/ambulance-victoria-second-funeral-gathering-during-covid/105232190",
        "title": "Ambulance Victoria admits to second illegal COVID-era gathering",
        "publish_date": "Tue, 29 Apr 2025 23:09:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "A second illegal COVID-era funeral gathering hosted by Ambulance Victoria has come to light a week after another very similar event was revealed.\n\nAmbulance Victoria (AV) has confirmed a second post-funeral honour guard took place for a deceased paramedic in 2021, which was unauthorised under lockdown restrictions at the time.\n\nThe organisation's interim chief executive officer Andrew Crisp confirmed on Wednesday that he was aware of \"two guards of honour that occurred in 2021\".\n\n\"Members of the executive team involved in organising these events are no longer at Ambulance Victoria and our current leadership team does not support these actions,\" he said.\n\nAmbulance union defends paramedics over COVID gathering cover-up Photo shows An ambulance in Melbourne's CBD. Ambulance Victoria has confirmed its staff arranged a gathering of 40 people to farewell a colleague who had died at a time when the state's COVID-19 rules capped funerals at 10.\n\n\"These events should not have happened, and we regret the impact of these historic events on our people and the broader community.\"\n\nMr Crisp said Victorians could have confidence in the state's paramedics to provide the best care to the community every day.\n\nIt is not clear what date the second honour guard event took place, or how many people were in attendance.\n\nThe event he confirmed on Wednesday has been made public a week after an anonymous submission to a parliamentary enquiry into the state's ambulance services revealed a very similar event on 30 September 2021, which was discreetly organised for a different paramedic who had died.\n\nAV said both gatherings were reported to the Independent Broad-based Anti-Corruption Commission (IBAC) in 2022.\n\nAV commissioned an independent, external body to investigate the gathering, though the result of the probe is unclear.\n\nThe other honour guard event was investigated internally.\n\nThe Victorian Ambulance Union has told the ABC the gathering took place after a funeral ceremony in the form of an 'honour guard' as the family of the deceased paramedic and the hearse drove past.\n\nThe union said there was no suggestion the family did anything wrong or that the funeral itself was conducted incorrectly.\n\nIt said paramedics put in a request to conduct the honour guard and received approval from the CEO beforehand — they wouldn't have done anything without approval.\n\nThe union said the actions of senior management and the subsequent investigation into the gathering should be questioned, not the actions of individual paramedics.\n\nThe Victorian opposition is demanding transparency.\n\n\"I want to know why the decision was made,\" Liberal MP Georgie Crozier said.\n\n",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/womens-state-of-origin-jesse-southwell-new-south-wales/105232340",
        "title": "NSW betting the house on Jesse Southwell in Origin I",
        "publish_date": "Tue, 29 Apr 2025 23:08:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jesse Southwell is too young to be making a comeback but when supreme talent and State of Origin are concerned, time has a funny way of turning.\n\nIt's not her return that's a great shock. The Blues lost the series last year and changing up the halves following an agonising Origin defeat is as much a part of New South Wales as not being able to afford real estate in Sydney.\n\nWith a new coach in John Strange, the Blues need a new approach. That can start with Southwell, who was overlooked for Rachael Pearson and Corban Baxter last year after making her Origin debut in 2023.\n\nShe has looked like the future of the sport ever since she steered the Knights to their first NRLW premiership as a 17-year-old crackerjack playmaker with no fear, all the skills and the kind of technical acumen that can only come from playing rugby league your whole life.\n\nIt gives her a prodigious command of her own abilities, a style that seems naturally assured and a seemingly limitless scope for what she can achieve in rugby league.\n\nSouthwell seemed like the future of the sport from the moment she debuted in the NRLW. (AAP: Lukas Coch)\n\nTurning around the Blues' fortunes might seem like a lot to ask of Southwell, who is still just 20 years old and whose best football, even after all she's already accomplished, may still be years away. Halfback play is more of an art than a science and a long career has peaks and valleys like a mountain range.\n\nBut she is the kind of player for whom great expectations are made, to the point that every success seems ordained, like it was always supposed to happen, and every failure is just a minor setback in a career whose trajectory seems as certain and true as anything in football can be.\n\nIt's a lot to carry and heaping the weight of the world on prodigies has been the undoing of many a young star. But when a halfback has two NRLW premierships to their name while they're still a teenager, nothing else seems to really fit.\n\nSo it makes all the sense in the world that Southwell is back here, that her clash with Ali Brigginshaw shapes as a moment where the past and the future collide in the present, as the Novocastrian tries to do what no other Blues halfback has done and deliver New South Wales their first-ever Origin series win in a multi-game format.\n\nThis is meant to be her time and, if the side named by Strange is anything to go by, it will also be her team.\n\nBlues five-eighth Tiana Penitani has experienced a career renaissance in recent years at centre, but her experience in the halves is limited to one Test for the Jillaroos where she was a late replacement and one game for Tonga.\n\nHow Brown's fire and ice create Origin field goal magic Photo shows Lauren Brown prepares to kick Queensland field-goal queen Lauren Brown, a firefighter by day and night, explains what pressure is and why she thrives in do-or-die State of Origin moments.\n\nHer move into the halves is a curious one as the Blues are hardly bereft of options.\n\nKirra Dibb, who partnered Southwell in the halves during that first Knights title and has blossomed as a playmaker since joining North Queensland, has not made the match-day 18, and Baxter and Pearson were overlooked from the squad entirely.\n\nEmma Verran nee Tonegato is in the side and has plenty of halves experience. However, barring a last-minute reshuffle, she'll come off the bench.\n\nDebutant fullback Abbi Church is better known as a runner than a creator. She did not accumulate a single try assist in last year's NRLW campaign, as excellent as it was.\n\nFrom the outside looking in, it seems that much of the creative and organising responsibility will fall on Southwell. The Blues are not just betting on her, they're betting the house.\n\nShe will not be without some play-making support. Olivia Kernick will start at lock and her passing game was a feature of New South Wales's victory in Origin I last year, and utility Jocelyn Kelleher will help off the bench. But when it comes to the killer touches, the spark that feeds the strike, it must be Southwell who leads the way.\n\nShe'll also be tasked with the majority of the kicking, which means she'll have as big a say as anyone can in closing the game out.\n\nFinding that balance between creativity and pragmatism at Origin level is among the hardest tasks any half ever faces. It is not in everyone, but that's why it's the stuff of legend.\n\nIt's what cost the Blues last year as they let the series slip through their fingers with a narrow loss in Newcastle and a comprehensive one in Townsville.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt's why Brigginshaw is counted as one of the finest female players in history and why her halves partner, Tarryn Aiken, is rapidly carving out her own place in Origin folklore.\n\nSouthwell has it in her to do the same, and it can begin on Thursday night. She has time and ability on her side, and missing last year's series and the Knights falling short of a third-straight title would have taught the important lesson that football isn't all beer and skittles, which she'll be a better player for learning.\n\nNew South Wales are asking her to put the result on her shoulders and they're asking her to do it now. It's as great an expectation as can be placed on a player, and many an Origin halfback has crumbled under the weight of the challenge, but meeting those expectations is where greatness lies.\n\nThat has always been the endgame for Southwell. Between her fast start to life in top-level football and unquestionable ability, she has always had an impossibly luminous promise.\n\nFulfilling it might take a lifetime, if it can ever happen at all, but the next step begins on Thursday at Lang Park at the moment when the howls of the Queenslanders are in her ears, the ball is in her hands and the game is on the line.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/sa-drivers-fuming-over-highways-amid-federal-funds-for-qld/105213156",
        "title": "Anger over highway 'patch jobs' amid less federal cash for SA roads",
        "publish_date": "Tue, 29 Apr 2025 22:43:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Many drivers in regional South Australia have voiced frustration with the condition of the state's roads, telling the ABC they are worried about safety.\n\nIn November 2023, the federal government announced it would be switching to a 50:50 deal when it came to funding certain national infrastructure upgrades, which included national highways, when it used to be 80:20.\n\nWhile January's announcement of a $9 billion revamp to Queensland's Bruce Highway reverted back to the 80:20 model, it looks likely SA will fall under the 50:50 model.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nSA Minister for Infrastructure and Transport Tom Koutsantonis said the state continued to work with the federal government to deliver critical safety improvements at high-risk locations.\n\n\"Discussions with the Commonwealth on cost-sharing arrangements, particularly for regional roads, are ongoing, and we recognise the significant contributions made towards major projects on a 50:50 funding split.\"\n\nTom Koutsantonis says funding-split discussions are ongoing. (ABC News: Che Chorley)\n\nOne consequence of the extra weight the SA government might be expected to carry in funding national highways could be less funding available for state and local road networks.\n\nShadow Minister for Transport Ben Hood said a 50:50 funding model would hold SA back.\n\n\"A 50:50 model puts huge pressure on the state budget — especially for regional roads,\" he said.\n\n\"The premiers of Tasmania and NSW pushed back against the government on changing the split, but we heard nothing from the SA premier or Minister Koutsantonis.\"\n\nBen Hood says the 50:50 funding split will jeopardise road projects. (ABC South East SA: Todd Lewis)\n\nThe model also has local councils concerned.\n\n\"South Australia receives the lowest amount of federal road funding of any state, both on a per capita basis and per kilometre of road,\" a spokesperson for Local Government Association SA said.\n\n\" Councils rely on ad hoc extensions of supplementary funding to make up the gap, but this lack of certainty makes it challenging to plan for long-term maintenance and infrastructure upgrades. \"\n\nThe federal government made the change after a review of government spending.\n\nA spokesperson for federal Transport Minister Catherine King said the Commonwealth's approach to infrastructure funding was recommended by an independent review.\n\n\"It means states need to undertake proper planning on projects, minimise cost blowouts, and it means we can invest in more projects in South Australia while maintaining the same amount of funding overall,\" they said.\n\nThe Coalition said it was committed to the 80:20 model used previously if successful in the upcoming federal election.\n\n'Patch jobs' washed away\n\nIn South Australia's South East, the Southern Ports Highway runs along the coast and connects busy beach towns like Robe, Beachport, and Southend.\n\nThe road is derided by locals as narrow, undulating, and rapidly deteriorating, and was named number six on the RAA's recent Risky Roads list for South Australia.\n\nMargie Bowman knows the highway as well as anyone, having recently retired from driving Beachport's school bus along the road to the nearby Kangaroo Inn Area School.\n\nMargie Bowman recently retired from driving a school bus along the Southern Ports Highway. (ABC South East SA: Sam Bradbrook)\n\n\"It's my worst nightmare — I don't have to worry about it anymore, but I worry about anyone else having to drive the bus,\" she said.\n\nPlans are in place to completely rebuild the highway between Beachport and Southend, but Ms Bowman said recent roadworks had done little to ease locals' concerns.\n\nSections of the Southern Ports Highway are slated for a $168 million upgrade. (ABC South East SA: Sam Bradbrook)\n\n\"Patch jobs aren't even compacted down anymore … so when we get rain, it just washes away again,\" she said.\n\n\"It's uneven and until you've got a decent base, it's never going to change.\"\n\nShoulder sealing is part of the work designated for the Southern Ports Highway. (ABC South East SA: Sam Bradbrook)\n\n'A bandaid fix'\n\nIt's a similar story in the Riverland.\n\nThe ongoing $87.5 million Sturt Highway Corridor Upgrade has included works along approximately 210km of the highway.\n\nJodie Harriss lives in Waikerie and drives along the Sturt Highway daily to work in Berri, approximately 60km away.\n\n\"There are several points along that road where there's been repairs, but … it's just a bandaid fix,\" she said.\n\n\"Before you know it, you've got that hole and that ditch again.\n\nThe Sturt Highway is a critical transport link between Sydney and Adelaide. (ABC Riverland: Elyse Armanini)\n\n\"For a major highway connecting interstate, it's not up to scratch at all.\n\n\"You get what you pay for, and the government says it will pump all this money into our roads — well, I don't see it on the highway … it's lethal.\"\n\nThe Sturt Highway received funding under the 80:20 model. (ABC Riverland: Will Hunter)\n\nNot a lot of wriggle room\n\nThe Flinders Highway connects the SA towns of Ceduna and Port Lincoln, past 396km of sand dunes, arid landscapes, and countless dusty offshoots leading to deserted beaches and iconic surf beaches.\n\nIn recent years, caravans and trucks have become more common.\n\nGrain trains ceased operating in the region in May 2019, when Viterra moved its business from the rail to the road, meaning a huge increase in the number of trucks in the area, especially during harvest months.\n\nStreaky Bay and Districts Road Safety Committee president Mischa Karp said tourism had increased in the area, and transport authorities needed to take a look at the width of the road.\n\nFollow the latest election news Photo shows ABC News Radio logo and the ABC Listen logo below it on a light blue background. Hear the latest election news as it happens on the Election Central Playlist. Only on the ABC listen app.\n\n\"I'm a caravan owner myself and find the most stressful part of any journey is going north and south along Flinders Highway,\" Mr Karp said.\n\n\"The roads are incredibly narrow with very small or no shoulders, and you're often competing with high numbers of cars, caravans, and grain trucks, and a number of undulating surfaces.\"\n\nABC measured the road at several sections of the Flinders Highway.\n\nThe 8.85-metre width of the road on the Western Approach Road at Duck Ponds near Port Lincoln, including bike lanes, leaves plenty of room for everyone.\n\nTwenty-five lives were lost on the Flinders Highway from 2019 to 2023. (ABC Eyre Peninsula: Tim McGlone)\n\nBut it is a different story near Talia, between Port Kenny and Elliston, where the road measures just 6.04m — from each edge of the bitumen — and near the Cummins Monument Lookout north of Mount Drummond, where it is 6.09m wide.\n\nIn Australia, caravans have a maximum legal width of 2.5 metres.\n\nIt means the common occurrence of two caravans passing each other on the Flinders Highway leaves only around a metre of wriggle room.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/tim-tszyu-vs-sebastian-fundora-rematch-confirmed-in-las-vegas/105232364",
        "title": "Major twist in Tszyu's boxing future as rival withdraws from title defence",
        "publish_date": "Tue, 29 Apr 2025 22:42:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tim Tszyu will get a chance to reclaim his super-welterweight world title in a rematch with Sebastian Fundora in Las Vegas.\n\nIn a major twist, Fundora has withdrawn from Friday's scheduled purse bid for his mandatory WBO title defence against Xander Zayas.\n\nFundora's promoter, Sampson Lewkowicz, told BoxingScene that the WBC and WBO belt holder would fight Tszyu instead with just the WBC belt up for grabs.\n\nJuly 19 is a possible date for the rematch but Lewkowicz said nothing has been finalised.\n\nIf not in July, Lewkowicz said the blockbuster would take place in August.\n\n\"This is the fight that everyone wants to see,\" he said.\n\n\"It will be raining blood.\"\n\nTszyu relinquished his WBO title when he lost a bloody split decision to Fundora in Vegas last March.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Sydney superstar had been due to fight Fundora's fellow American Keith Thurman before Thurman pulled out with a torn biceps muscle.\n\nTszyu opted for Fundora to step in on 12 days notice but copped an accidental elbow to his head late in the second round.\n\nDespite fighting for more than 10 rounds with blood streaming down his face and into his eyes, Tszyu was awarded the bout by one of the judges.\n\nThe defeat was the first of Tszyu's then-25-fight professional career.\n\nTszyu subsequently lost another world-title fight last October in Florida, battered by Russian Bakhram Murtazaliev in a one-sided IBF showdown to seemingly leave his career in tatters.\n\nBut a desperately needed victory over another American Joey Spencer in Newcastle three weeks ago restored his battered international reputation.\n\nThe 30-year-old had been expected to take on Thurman on the Gold Coast in July before Wednesday's major turn of events.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/small-businesses-regional-south-australia-slow-spending-drought/105173752",
        "title": "Record dry hurting small businesses in country SA",
        "publish_date": "Tue, 29 Apr 2025 22:12:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Small businesses in South Australia say they are struggling after some of the driest years on record in many regions.\n\nMost years, the average annual rainfall in the lush wine region of Clare, around 145 kilometres north of Adelaide, is 527 millimetres.\n\nBut according to the Bureau of Meteorology, in 2024 the Clare Valley recorded just 287mm – 53 per cent of its average.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nLowest annual average rainfalls were also recorded for Snowtown, almost the entire Yorke Peninsula and several Eyre Peninsula towns including Cummins and Ceduna, and on Kangaroo Island at Cape Willoughby.\n\nClare hair salon owner Erin Pearse said locals' spending had been \"slowing\", as clients — many of whom worked in agriculture — stretched out their regular appointments and opted for cheaper services.\n\nErin Pearse says spending around Clare has been \"slowing down\" in recent months. (ABC North and West SA: Viki Ntafillis)\n\n\"Instead of going for their six weekly appointments, they're sort of stretching out to eight to 10 weeks,\" she said.\n\nMs Pearse said she took on more cost-effective products to combat spending cuts and stay affordable, and recycled most of the rubbish from her business locally.\n\n\"It's [about] keeping everyone in business because the flow-on effect for our farmers not spending is that we're not able to spend … which is really starting to get a little bit scary,\" she said.\n\nClare retailer Buff Byrne said March was \"probably the worst month we've had in years\" for her retail and embroidery business.\n\nClare small business owner Buff Byrne says many locals are \"treading carefully\" with money. (ABC North and West SA: Viki Ntafillis)\n\n\"It was 50 per cent down,\" she said.\n\n\"Everyone's just treading carefully with how much they're spending.\n\n\"I've definitely had primary producers in talking about [the dry conditions] and it's not only them — it's everyone.\"\n\nBetting on the rain\n\nRicardo Rivas said he normally saw an influx of up to 40 new clients at his Clare gym during harvest, but there had only been about 12 this year.\n\n\"There hasn't been that much to harvest … so that tends to affect that cash flow and that trickles down to the locals,\" he said.\n\nRicardo Rivas says new gym memberships are low for this time of year. (ABC North and West SA: Viki Ntafillis)\n\n\"The first thing to go is the gym — they need to eat.\"\n\nIn early 2024, Mr Rivas began helping out the rural health initiative Fat Farmers by hosting weekly workouts.\n\n\"Mainly it's a physical activity, but … the extra 40 minutes of catch-up between all of them that they have afterwards, that keeps them coming all the time,\" he said.\n\nClare was one of several regions in SA that recorded its lowest rainfall on record in 2024. (Supplied: Bureau of Meteorology)\n\n\"It just feels good to be around more people that are doing the same and they're all struggling, and at least they help each other.\n\n\" They have bets on when the rain is going to come. \"\n\nOver on the Eyre Peninsula, Michelle Rayner in Kimba said her cafe's sales hit an unprecedented low over summer.\n\nMichelle Rayner says sales at her cafe in Kimba have been down 60 per cent. (ABC North and West SA: Viki Ntafillis)\n\n\"I had to cut down the staff and I reduced my menu as well,\" she said.\n\n\"We were down over 60 per cent.\n\n\"We're into our 10th year this year and we've never seen anything like that.\"\n\nWith a federal election around the corner, Ms Rayner said she wanted politicians to offer solutions that \"would actually help farmers get through the drought\".\n\n\"They''ll quite often offer up all these feel-good things, all this counselling … but it's not actually going to help,\" she said.\n\nHigh demand for water deliveries\n\nWater carter Grant Fidge said he had been \"pretty busy\" trying to keep up with demand, as many locals from Clare and its surrounds relied on tank water rather than mains water.\n\n\"On an average year, I sort of just work 8am-5pm and have a bit of a lunch break and keep up fairly easily,\" he said.\n\n\"This year I'm … more 7:30am-6:30pm … and I can come do the odd Saturday just to keep up.\"\n\nWater carter Grant Fidge says most locals relying on tank water are running low this year. (ABC North and West SA: Viki Ntafillis)\n\nMr Fidge said he was receiving calls from people in the Mid North who he had never delivered to before.\n\n\"A lot of people have got really big tanks and if we get good rainfall in winter, then they get through — but everybody's getting low this year,\" he said.\n\n\"Everyone's hanging out for the rain but usually it doesn't start until around June here, it seems, the last few years.\"\n\nBusiness support at capacity\n\nRural Business Support (RBS) chief executive Brett Smith said the organisation was currently assisting 540 agricultural businesses across regional South Australia, and around 15-20 small businesses not directly tied to agriculture.\n\n\"We only have half a [full-time equivalent employee] servicing the entirety of SA [for regional small businesses] and that … is at capacity,\" he said.\n\nMr Smith said with new funding from the recently announced drought relief package, RBS hoped to take on more small business clients soon, as the situation was \"quite serious\".\n\nRural Business Support CEO Brett Smith says the situation is \"quite serious\" for many small operations. (ABC Adelaide: Luke Pike)\n\n\"It's an ecosystem, everyone relies on each other,\" he said.\n\n\"Once you lose a family … if they leave town, there's less people at the school, less people at sport, and there are less people doing the volunteer things, which really make our small towns flourish.\"\n\nGovernment relief\n\nIn a joint statement, Liberal MP for Barker Tony Pasin and candidate for Grey Tom Venning said a Coalition government would commit $1.8 million over six months to extend the Rural Financial Counselling Service for eligible farmers, fishers, foresters and small related businesses \"experiencing, or at risk of, financial hardship\".\n\nFollow the latest election news Photo shows ABC News Radio logo and the ABC Listen logo below it on a light blue background. Hear the latest election news as it happens on the Election Central Playlist. Only on the ABC listen app.\n\nSouth Australian senator Karen Grogan said Labor had \"backed in\" regional resilience through the $519 million Future Drought Fund.\n\n\"We are also providing help for struggling farmers, including through concessional loans, Farm Household Allowance, and access to the Rural Financial Counselling Service,\" she said in a statement.\n\n\"Labor's National Drought Agreement with states and territories ensures a coordinated, long-term approach to resilience.\"\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/tennis-alex-de-minaur-into-fourth-round-of-madrid-open/105232176",
        "title": "De Minaur powers through at Madrid as Djokovic pulls out of Italian Open",
        "publish_date": "Tue, 29 Apr 2025 22:02:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alex de Minaur has charged into the fourth round of the Madrid Open with a powerful performance as electricity returned to Spain.\n\nThe Australian number one took fewer than 90 minutes to defuse the big-serving Canadian Denis Shapovalov with a straight-sets 6-3, 7-6 (7-3) win on Court Arantxa Sanchez Vicario.\n\nSixth seed de Minaur and Shapovalov were due to play last on Monday night but their match was one of the 22 postponed after the Iberian peninsula was hit by a blackout.\n\nThe pair returned to the same arena to open Tuesday's play, and de Minaur was soon flowing. He broke in the fifth game of the first set after Shapovalov double-faulted on break point, and again in the ninth, closing out the set with a love game.\n\nThe second set went to a tie-break, but de Minaur took that easily to draw level with Carlos Alcaraz with a tour-leading 24th win of the season.\n\n\"He's got tremendous firepower from every part of the court, and I had to do my best to neutralise it and not let him dictate as much as he could,\" said de Minaur, who has won all five matches with Shapovalov.\n\nDe Minaur is now into his fifth consecutive Masters 1000 last 16 and will next face Lorenzo Musetti, who defeated Stefanos Tsitsipas 7-5, 7-6 (7-3).\n\nIn a boilover, world number 21 Francisco Cerundolo defeated top seed and two-time Madrid winner Alexander Zverev 7-5, 6-3.\n\nBut it was perhaps not such a shock as the Argentine beat Zverev at the same stage last year and has now won all three of their meetings.\n\nGrigor Dimitrov also advanced. He had been 6-4, 5-4 up against Jacob Fearnley when the power went out with the Briton about to serve to stay in the set.\n\nHe did so successfully when play resumed but the Bulgarian won the tie-break for a 6-4, 7-6 (7-3) victory.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAmericans Tommy Paul and Frances Tiafoe also won on a morning when there were a few teething problems following the power outage.\n\nOther winners included teenager Jakub Mensic, Canada's lucky loser Gabriel Diallo, who beat a subpar Cameron Norrie 2-6, 6-4, 6-4, and Jack Draper, who progressed after Matteo Berrettini retired when a set down.\n\nThe blackout brought much of Spain and Portugal to a standstill, knocking out subway networks, phone lines, traffic lights and ATM machines.\n\nAt the Madrid Open players had to eat by candlelight and Brazilian doubles player Fernando Romboli, who was partnering Australia's John-Patrick Smith, had to be rescued after getting stuck in a lift.\n\nIt was not ideal preparation and the duo lost their match on Tuesday 6-0, 6-3 to Argentine pair Maximo Gonzalez and Andres Molteni.\n\nDjokovic pulls out of Italian Open amid losing streak\n\nNovak Djokovic pulled out of the Italian Open on Tuesday in the midst of a three-match losing streak, shedding doubt on how well he will be able to play at the upcoming French Open as he continues to seek a record 25th Grand Slam trophy and 100th tournament title overall.\n\nThe clay-court event in Rome, which will be held next month, posted on social media that Djokovic would not be participating and wrote: \"See you next year, Nole,\" referring to the 37-year-old Serbian star by his nickname.\n\nDjokovic has struggled this season, going just 12-6 and dropping his past three contests in a row — at the Miami Open, the Monte Carlos Masters and, on Saturday, at the Madrid Open.\n\nAfter losing to Matteo Arnaldi 6-3, 6-4 in Spain, Djokovic said: \"It's a completely different feeling from what I had in 20-plus years of professional tennis. It's a challenge for me mentally to really face these kinds of sensations on the court, going out early now regularly in tournaments.\"\n\nDjokovic has repeatedly said that what now matters to him is adding to his major championships. The next such event begins in Paris on May 25.\n\nHe had to withdraw during last year's tournament at Roland Garros because of a knee injury that required surgery. Djokovic also stopped during the Australian Open this January because of a torn hamstring muscle.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/hesta-super-customers-impacted-by-seven-week-outage/105225830",
        "title": "Super fund members caught out without access in seven-week freeze",
        "publish_date": "Tue, 29 Apr 2025 21:40:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Superannuation fund HESTA's seven-week outage has caused financial havoc for member Jan Massey, who says being unable to access her super almost derailed her home purchase.\n\nThe Perth retiree said she had to borrow money from her friends to pay the deposit that was due last week.\n\n\" Everybody's struggling at the moment … but also, I didn't want to lose this house. So you're kind of in a dilemma, really. \"\n\nMembers of HESTA — one of Australia's largest super funds — have expressed outrage and concern after being locked out of their accounts until June, in a planned outage affecting more than 1 million Australians.\n\nMs Massey said she only found out when she went online to check her account in mid-April, despite HESTA having first announced the outage in February.\n\nJan Massey borrowed funds from friends to pay a house deposit after her super fund went offline. (Supplied)\n\nBy the time she learnt of the freeze, it was too late for her to withdraw funds, as HESTA had advised its members to \"make any important changes\" to online accounts by the end of March.\n\nXavier O'Halloran, director of Super Consumers Australia, said many members would have found out about the planned outage late.\n\n\"Super funds don't always have up to date contacts for people and they don't do enough at the moment to make sure they keep those details up to date,\" he said.\n\n\" It's unsurprising to me that a lot of consumers are being caught unawares by this announcement. \"\n\nWith services already offline by the time Ms Massey realised, instead of contacting HESTA, she turned to her friends.\n\n\"I'm embarrassed I have to ask for money,\" she told ABC News.\n\nWhile the former health worker had retired in October last year, the lack of access to her super funds contributed to Ms Massey returning to work for a few weeks.\n\n\"I do feel a sense of panic … I'm kind of not sleeping very well and thinking, how's this all going to end?\" she said.\n\nAfter ABC News put questions to HESTA, Ms Massey said the super fund contacted her to assist with an application to withdraw funds before the planned recommencement of services in June.\n\nIn a statement, a HESTA spokesperson said, \"we're continuing to support our members through this period of change as we know that, while in the short-term it may be challenging, this transition will provide the technology platform and data capabilities to better service our members in the years ahead.\n\n\" We are sorry for the inconvenience this may cause members and we're working hard to make the transition as smooth as possible. \"\n\nHESTA says the \"planned limited services period\" is common for technology projects of this scale. (ABC News: Emilia Terzon)\n\nLength of outage 'bound to catch people out'\n\nThe reason for the outage is the super fund is changing administration providers, which it first announced in February.\n\nWhile some members wrote to ABC News saying they had received clear communication from HESTA, dozens say they were only made aware of the shutdown period after a report published on Good Friday.\n\nOne super fund member in Perth said his wife received a letter in the mail that advised her of the shutdown period — however, it arrived three days after the cut-off date for making any important changes to her account.\n\nShe filed a complaint to the Australian Prudential Regulation Authority (APRA) at the start of April, stating \"it is obvious this letter has not been posted in time to give members sufficient notice of impending important changes … it appears that the trustees have failed in their duty of care to members in this instance.\"\n\nMr O'Halloran said outsourcing administration services leaves super funds \"vulnerable to huge risk\".\n\n\"Risks of bad customer service, risks of being locked into an administrator that takes seven weeks to switch to a new administrator if you're not happy with the level of service,\" he said.\n\nConsumer advocate Xavier O'Halloran says it's unsurprising some HESTA members have been caught unawares. (ABC News: Alex McDonald)\n\n\"That risk all just flows to consumers experiencing really bad customer service.\"\n\nMr O'Halloran said the length of the planned outage is what will impact many Australians.\n\n\"It's far longer than any others that I've managed to find on record, they typically get done in less than a month or so,\" he said.\n\n\" Having seven weeks to process this was bound to catch people out and hit them when they need their money for things like buying a house or major expenses that they've got in their life. \"\n\nMarket experts warn against 'knee-jerk reactions' Photo shows Blue background with black grid and piles of coinsincreasing in height with a shadow. Around half of Australians' superannuation balances are invested in global and local stocks, meaning the tariff-induced market ructions are hitting super savings. Here's why experts say it's not time to panic.\n\nA HESTA spokesperson described it as a \"planned limited services period\" and said it was common \"with complex large-scale technology projects of this nature\".\n\n\"This is a critical phase of the project, designed to ensure the safe and secure transfer of our 1 million-plus members' accounts.\n\n\"We are confident this project will set us up to deliver better outcomes for members, allowing for more personalised experiences that can make it easier for them to manage their super.\"\n\nABC News put questions to APRA, the regulator with oversight of the super sector, but it said it does not comment on individual matters.\n\n\"I think there's serious questions to be asked about how [APRA] took into account any consumer harm that might flow from a very long limited service period,\" Mr O'Halloran said.\n\nWithdrawal requested prior to shutdown delayed\n\nAnother HESTA member, Melbourne woman Martina Neville, said she was informed of the shutdown period back in February and made plans to withdraw funds in March for upcoming bills.\n\n\"I withdrew some money because I knew I had some payments of insurance and registration and so on come up in May [and] June.\"\n\n'Depriving my future self': would-be buyers weigh up super withdrawal Photo shows Jordan looking at a real estate sign out front of a house. With home ownership more out of reach than ever for younger Australians, some are pondering whether their retirement fund would be better off used now, to buy a house.\n\nThe semi-retired occupational therapist said on March 17 she made an application to withdraw $9,000.\n\nOn March 20, she made a second application to withdraw $10,000.\n\nA few days later, Ms Neville received a text message asking her to call HESTA, as the super fund needed more information to process the request.\n\n\"I talked to the operator … who told me that one of my applications was approved, which was the second one, and I should be getting paid within three to five working days,\" she told ABC News.\n\n\"I was saying, 'how about my first application?' He wasn't so sure, but he will follow it up.\"\n\nA few days later, Ms Neville said she spoke to another consultant who said HESTA had both applications.\n\nBut when the funds landed in her account, it was only for the second application, leaving her $9,000 short of the funds she needed.\n\nWhen Ms Neville followed up again with HESTA, she said the consultant told her the matter would now have to wait until after the planned outage.\n\n\"It's an absolute pain … I feel stressed because I've got some payments coming up,\" she said.\n\n\"I've got family I could borrow money from but I hate borrowing money, you don't know exactly when you can pay it back because you don't know when the money is coming through.\"\n\nAfter ABC News put questions to HESTA, Ms Neville said the super fund contacted her and processed the application of $9,000.\n\n\"Our contact centre and member engagement teams are actively supporting members with their queries,\" said a spokesperson for HESTA.\n\n\"While there are temporary disruptions to some services, it's important to note that members can still switch investments and receive urgent and critical payments during the limited services period.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/chinese-community-urges-rethink-of-darwin-port-lease-plans/105207848",
        "title": "Chinese community urges rethink on Labor, Coalition's Darwin Port plans",
        "publish_date": "Tue, 29 Apr 2025 21:38:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Members of Darwin's Chinese community are calling for the Australian government and opposition to reconsider their election promises to take back a Chinese firm's lease of the Darwin Port.\n\nThe Northern Territory government leased the port to Chinese-owned company Landbridge for 99 years in 2015, but since then, the foreign ownership of the strategic asset has been the subject of ongoing security debate.\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nLandbridge is reported to have links to the People's Liberation Army of China, and the US's former Obama administration raised concerns with the Turnbull government after the company was awarded the port lease.\n\nDuring this year's federal election campaign, Labor and the Coalition have each promised to get the port \"back into Australian hands\" either by finding an operator to take over the facility's lease, or, if one can't be found, by compulsory acquisition.\n\nShu Qin Li says members of Darwin's Chinese community are \"disappointed\" and \"sad\" about the major parties' plans to strip the port lease from Landbridge. (ABC News: Tristan Hooft)\n\nThe Northern Territory president of the Australia-China Friendship Society, Shu Qin Li, a long-term resident of the NT, said she believed that move would do economic damage to investor confidence and the territory's economy.\n\nShe said the pledges had come without any evident national security risk, and urged both parties to reconsider.\n\nDarwin's port has been controversial for years. So why the action now? Photo shows A truck drives out of the entrance of the Darwin Port on a sunny day. Darwin Port’s lease to a Chinese-owned company has outlasted successive prime ministers. So why are the major parties talking about cancelling it now?\n\n\"I think it's too political,\" she said.\n\n\"[The NT] should try to focus and look after our own interests … I mean Darwin, we don't have any major projects, for many years.\n\n\"Darwin Port is probably the one that's still alive … what else do we have?\n\n\" For people living in the community here forever, like us, we do care, and we feel very disappointed, and very sad. \"\n\nMs Li said community groups such as the Australia-China Friendship Society would lose out on annual event funding from Landbridge if the company lost the port lease.\n\nShe also said her views were widely held within Darwin's generations-old Chinese community.\n\nMembers of Darwin's Chinese community say Landbridge supports cultural events in the city. (Supplied: Chung Wah Society)\n\nThe ABC spoke to others in the NT's Chinese community, who asked not to be named for this article.\n\nOne community member dubbed the federal promises as tapping into \"old paranoia\", while another said \"all international investors should be treated the same and given a fair go\".\n\nThey questioned why the major parties had only made the promises during a federal election campaign, and without any apparent change to national security advice regarding Landbridge's lease.\n\nLandbridge has a 99-year lease of the Darwin Port. (ABC News: Che Chorley)\n\nDefence expert says 'partisan politics' at play\n\nMultiple federal reviews have been undertaken on the Landbridge lease since it was awarded, without any announced risks to national security.\n\nDarwin-based defence expert Victor Abramowicz said it was \"hard to see [the election pledges] as anything aside from partisan politicking on both sides\".\n\n\"The sale was made in 2015, governments of both stripes have been in power over the past decade, [and] none of them have moved to get rid of Chinese ownership of the port,\" Dr Abramowicz said.\n\nVictor Abramowicz says national security advice regarding Darwin Port has not changed. (ABC News: Michael Donnelly)\n\n\"In fact, even the most recent government review in 2023, about 18 months ago, said current arrangements were entirely fine.\n\n\"It's just very hard to believe anything has changed.\n\n\"It's really just a bit of a delicate political environment.\"\n\nDr Abramowicz said if the port lease had to be compulsorily acquired from Landbridge by the Commonwealth, it would likely be a huge sting to Australian taxpayers.\n\n\"That'll be coming straight from the taxpayer's hip pocket, and for no apparent good national security reason,\" he said.\n\nBoth Peter Dutton and Anthony Albanese have pledged to bring the Darwin Port back \"into Australian hands\" this election campaign. (Supplied)\n\nMs Li said she believed any move to strip the lease from Landbridge would jeopardise future private investment in the NT, which is already facing more than $12 billion in debt.\n\nFollow the latest election news Photo shows ABC News Radio logo and the ABC Listen logo below it on a light blue background. Hear the latest election news as it happens on the Election Central Playlist. Only on the ABC listen app.\n\n\"That will make it worse,\" she said.\n\n\"Not only the business itself, but also the investor confidence.\n\n\"It doesn't paint a very good picture.\"\n\nDr Abramowicz said taking the lease back would likely make major foreign investors baulk at doing business on Australian shores.\n\n\"It would seem to raise questions in terms of how safe Australia is as an investment destination, even if you are a company that comes in, pays a good price and does a good job,\" he said.\n\nLandbridge is currently facing financial pressures, and Dr Abramowicz said that if an alternative private buyer was found to take over the Darwin Port lease, it could work out well for the company.\n\nLabor and the Coalition declined to comment.\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/asx-markets-business-news-live-updates/105232100",
        "title": "Live: Australian dollar bounces higher after inflation figures announced",
        "publish_date": "Tue, 29 Apr 2025 21:28:44 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "Stephanie Chalmers"
        ],
        "text": "The Australian dollar is enjoying a bounce in the initial aftermath of the inflation figures.\n\nHeadline inflation has remained steady, but the Reserve Bank's preferred measure of consumer prices has fallen within the RBA's target band for the first time in more than three years.\n\nFollow the day's financial news and insights from our specialist business reporters on our live blog.\n\nDisclaimer: this blog is not intended as investment advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/wa-rental-crisis-reaches-new-depths/105229790",
        "title": "WA rental crisis deepens amid 'catastrophic' price hikes, report finds",
        "publish_date": "Tue, 29 Apr 2025 21:26:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Western Australia's rental crisis has reached new depths, with data from one of the state's charities showing there's not a single property or room that is affordable for people on Jobseeker, Youth Allowance or the Disability Support Pension.\n\nAnglicare WA's 2025 Rental Affordability Snapshot shows that despite a significant increase in private rentals listed across WA, affordability is languishing with the state's median rent hitting $680 per week, up five per cent from last year and 21 per cent from 2023.\n\nThe charity defines an affordable property as one requiring less than 30 per cent of a household's income, and it says rooms across the state are well out of reach for households on income support or the minimum wage.\n\nAnglicare WA chief executive Mark Glasson said the report needed to serve as a wake-up call for governments at all levels to do more, and to have a bold vision to come up with long-term solutions.\n\nAnglicare WA chief executive Mark Glasson says affordability has tanked for those on low incomes. (ABC News: Blake Kagi)\n\n\"What this survey tells us that no other one has, is that there is absolutely nothing across the whole state if you're on Jobseeker, Youth Allowance or the Disability Pension. We have never had that experience before,\" Mr Glasson said.\n\n\"Supply has increased, so there has been a growth in the number of housing that's available … but affordability has tanked.\n\n\"We've got havoc, we're there now, we actually need to be bold, and have that vision, we need a vision that says we're going to have so much social and affordable housing.\n\nThe postcodes where rent takes half your pay cheque Photo shows Gold Coast renters Jazlyn, Melanie and Nahla Misuraca smiling at the camera These are the nation's worst postcodes for renters, as well as the places hit with the biggest rent hikes since the pandemic.\n\n\"We need a broader vision that says everyone is entitled to a house that they can afford, that's fit and safe and sustainable.\"\n\nA CommSec report this week crowned WA as the nation's best performing economy, but Mr Glasson said countless West Australians aren't seeing any benefit.\n\n\"Yes we have a bustling economy that's really kicking ahead of the rest of the country, but the question that I would have to our leaders is 'what is that for if we can't house and feed our people'?\" he said.\n\nPriced out\n\nCaitlin Beresford-Ord never imagined she and her family would find herself without a place to rent and reaching out to charities, friends and family members for assistance.\n\nCaitlin and her son Darcy could not afford an extra $190 a week for their rental. (ABC News: Blake Kagi)\n\nBut when faced with a $190 per week increase in her long-term rental in the Perth suburb of East Victoria Park, she was left with little choice.\n\nShe has been forced to move into her parents' house, with her 20-year-old son Darcy Stokes staying in a caravan provided by a friend, which is parked in the driveway of the home.\n\n\"It's catastrophic, $190 a week, it's huge,\" Ms Beresford-Ord said.\n\n\"We stopped private health insurance for quite some time, I had to make all sorts of decisions in order to accommodate that rental hike until we were able to move in here.\n\n\"I can no longer afford to rent a place and keep my family together and I regularly work seven days a week.\"\n\nDarcy Stokes is living in a caravan parked outside his grandparent's house. (ABC News: Blake Kagi)\n\nHer son is balancing his studies with work at a fast food restaurant and says his biggest fear is never being able to move out and find a place of his own.\n\n\"Probably just not being able to move out ever, unless I'm like living with 10 other people or something like that,\" Mr Stokes said.\n\nData shows chasm between rent and income Exclusive new data shows skyrocketing rents have outpaced income growth in every regional area in Australia and all but one capital city.\n\n\"None of my friends have moved out yet because it's basically impossible at this point anyway.\"\n\nMr Glasson said despite so much focus on the cost of living in this year's state and federal election campaigns, the major political parties have failed to come up with long-term solutions to the rental crisis.\n\n\"What we're seeing is lots of announcements … which are really welcome, they will put more houses on the ground,\" he said.\n\n\"But we're talking about proportionality here and the scale of growth that's being projected is nowhere near enough.\n\n\"The level of social and affordable housing in Western Australia is 3.7 per cent, it's dropped over the last 10 years, we need a bold government that says that's going to get to 6 per cent in this term.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-30/three-way-contest-for-new-federal-seat-of-bullwinkel/105228180",
        "title": "Urban fringe collides with farming in battle for Australia's newest federal seat",
        "publish_date": "Tue, 29 Apr 2025 21:17:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "It’s the only new federal seat in the country this election – and it’s anyone’s guess who will win the semi-rural seat of Bullwinkel in WA, as each of its high-profile candidates struggle to resonate across the seat's vastly different demographics.\n\nWA's 16th seat covers a whopping 9,508 square kilometres, from the outskirts of Perth to the outer edge of the Wheatbelt region, where Perth's farming fringe collides with the metropolitan area.\n\nA notionally held Labor seat on a margin of 3.3 per cent, Bullwinkel is considered up for grabs, as Labor's nurse and local councillor Trish Cook, former WA Nationals leader Mia Davies and Liberal journalist-turned Army public affairs officer Matt Moran battle it out.\n\nBut given the seat's diverse mash-up, there's an even bigger list of issues for candidates to cover — and the clock is ticking to win them over.\n\nThe rural Wheatbelt\n\nPicturesque landscapes, a line out the door for sausage rolls at the local bakery and murals of sheep on old brick buildings — this is the rural town of Beverley.\n\nBullwinkel stretches from Perth's metro fringe in the west to country towns like Beverley in the east. (ABC News: West Mateeussen)\n\nIn the Wheatbelt part of the seat, it's not hard to guess who has the upper hand of the three high-profile candidates.\n\nAlmost every person the ABC spoke to indicated they were voting for Mia Davies and had the Keep the Sheep campaign front of mind.\n\nSheep at a property in Beverly, in WA's Wheatbelt region, where the 'Keep the Sheep' movement has been campaigning hard. (ABC News: Courtney Withers)\n\nThe movement took off last year in response to Labor's decision to phase out the live sheep export industry by 2028 — disappointing many in rural towns like Beverley.\n\nBeverley Tyre Service owner Daniel Henderson fears ending the live sheep export trade would be \"an epic cost to the economy\", and said it provides a lifeline for locals.\n\nBeverley Tyre Service owner Daniel Henderson wants the live sheep trade to stay. (ABC News: Courtney Withers)\n\n\"If it gets ripped out upon us, then a lot of farmers which are my customers, my clients around here ... get money taken off them,\" he said.\n\nBeverley local Jenny Broun also indicated Keep the Sheep is influencing who she'll be voting for on May 3.\n\nBeverley local Jenny Broun wants farmers to be looked after. (ABC News: Courtney Withers)\n\n\"We have a farm in the district and I do feel concerned that the major parties aren't looking after the farmers as they should, so obviously the Nationals will be my vote,\" she said.\n\nThere's no doubt the movement has aided Davies' quest for Bullwinkel, but her decision to strongly back Labor plans for critical minerals production tax credits — breaking Coalition loyalty to do so — drew a sharp response from Opposition Leader Peter Dutton.\n\n\"Matt Moran's doing a fantastic job in Bullwinkel and I believe he'll be elected as the next member,\" Mr Dutton said on the campaign trail.\n\nVoters in the rural part also identified cost of living, access to healthcare and rural neglect as issues they're thinking about in the lead-up to the poll.\n\n\"We've got great doctors but the hospitals are just hopeless,\" Beverley local Dalene Davies said.\n\nBeverley local Dalene Davies is unhappy with the state of the area's hospitals. (ABC News: Courtney Withers)\n\n\"My friend and I drove over [to Northam Hospital at Easter] ... that's a 150-kilometre round trip.\"\n\nThe Hills\n\nIn the Perth Hills, a different kind of cost-of-living pressure is being felt among primary producers.\n\nWillow Springs Orchard owners Davin and Kate Harris are in their third season at their Bedfordale property, but are struggling with increased business costs.\n\nBullwinkel encompasses numerous orchards and farmlands. (ABC News: Courtney Withers)\n\n\"Since COVID, the cost of fertiliser, chemical input, electricity input, your packaging ... fuel,\" Mr Harris said.\n\n\"Instead of being able to get ahead and save, we're pretty much spending everything we earn.\"\n\nStay updated: Federal election live updates: Get the latest news from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\nThe pair have turned their orchard — which grows a variety of novelty fruits including persimmons, pomegranates and kiwis — into an agriculture-tourism mix with a coffee shop and fruit picking in a bid to drive more profit.\n\nWillow Springs Orchard owners Davin and Kate Harris. (ABC News: Courtney Withers)\n\nMr Harris also worries about the housing crisis and how his children — aged 14, 10 and 9 — will be able to afford a property of their own.\n\n\"I'm thinking $1 million is going to get them a unit in a suburb 30 kilometres out of Perth,\" he said.\n\nPerth suburbs\n\nIn the part of the seat closest to the city, cost of living and housing pressures are at the fore for voters.\n\nThe area includes suburbs like Forrestfield and High Wycombe — which held up for Labor at the recent state poll — and make up the most populous third.\n\nHigh Wycombe local Teriane Herald, 33, has cost-of-living concerns and plans to vote for Greens candidate Abbey Bishop.\n\nHigh Wycombe local Teriane Herald is struggling to pay her rent. (ABC News: Courtney Withers)\n\n\"Before I could do it easily by myself as a single mum, rented by myself, worked full-time ... now there's no way I could do it by myself, the rent in six years has jumped by $250 per week easily, it's hard it's really hard,\" she said.\n\nThree-horse race\n\nLabor's working hard to win over areas closer to the city with flagship policies like Midland Hospital's multi-million-dollar upgrade and bolstered telecommunication in the Hills, but is facing backlash over Keep the Sheep in rural parts.\n\nThe Nationals and Liberals are both leaning into Keep the Sheep, the Nationals promising to overturn the live export ban as a first priority if elected.\n\nThe ABC asked the three candidates during pre-polling the same question — how do you reach voters across such a large and diverse seat?\n\nLabor candidate for Bullwinkel Trish Cook. (ABC News: Courtney Withers)\n\n\"It is diverse, it's the three distinct regions but overwhelmingly people have the same issues: access to affordable healthcare, cost of living relief,\" Labor's Trish Cook said.\n\nNationals candidate Mia Davies took a grassroots approach.\n\nMia Davies is the Nationals candidate in Bullwinkel. (ABC News: Courtney Withers)\n\n\"In a nutshell, we are people and community first, politics a long way back,\" she said.\n\nAnd Liberals candidate Matt Moran was focused on practicalities.\n\nMatt Moran is the Liberal candidate for Bullwinkel and a former journalist. (ABC News: Courtney Withers)\n\n\"The number one issue is cost of living ... and that's why we're offering 25c off every litre of fuel, a tax cut of up to $1200, helping first home buyers get into houses,\" he said.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/erin-patterson-trial-live-updates-day-one-mushroom-leongatha-don-gail-ian-heather-20250429-p5lv58.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson trial LIVE updates: Alleged Leongatha mushroom cook’s relationship with ex-husband, in-laws examined in opening statements",
        "publish_date": "Wed, 30 Apr 2025 11:59:51 +1000",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Erin Pearson"
        ],
        "text": "The court heard that Simon Patterson first noticed a change in his relationship with Erin in 2022.\n\nOn one occasion, when he was dropping the children off, Erin expressed concern that he had listed himself as “separated” in his tax return.\n\nSimon offered to change that, the court heard, but Erin told him she would expect child support.\n\n“Issues arose concerning the payment of child support, including whether Simon should make additional payments outside of child support for expenses such as school fees,” Rogers said.\n\nLater, at the start of term three in 2023, Erin Patterson changed her children’s school without consulting Simon.\n\nThree or four weeks before the deadly lunch, Erin Patterson told her in-laws Don and Gail that she had a lump in her elbow that required testing, and she had an appointment at St Vincent’s Hospital on 28 June 2023, Rogers said.\n\nThe day of the appointment, Gail texted Erin to ask how the appointment had gone. The following day, Erin responded that the appointment went well. She told Gail she had had a biopsy done, and she would be returning to hospital for an MRI.\n\n“The accused later responded that there was a bit to digest with everything that’s come out, and that she might talk more about it with them in person,” Rogers said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/purcell-ban-shows-how-much-grey-exists-between-the-black-and-white-of-tennis-20250430-p5lva9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Purcell ban shows how much grey exists between the black and white of tennis",
        "publish_date": "Wed, 30 Apr 2025 11:57:25 +1000",
        "category": "sports",
        "authors": [
            "John Millman"
        ],
        "text": "Tennis players can no longer have faith in the systems that are meant to protect them – that much is clear after Australian tennis player Max Purcell was given an 18-month ban for an over-the-limit intravenous infusion.\n\nPlayers want a fair sport, they want an equal sport, but when Jannik Sinner receives a three-month ban for having a prohibited substance in his system, and Max is banned for six times that length, it’s hard not to believe the system has failed its players.\n\nAustralian tennis player Max Purcell. Credit: Getty Images\n\nI was one of Jannik’s biggest and most vocal supporters, and I still am. I believe that doping incidents need to be looked at on a case-by-case basis, and I agreed with WADA’s ruling that the tiny amount in Jannik’s system was neither performance-enhancing nor intentional.\n\nBut I have to stick up for Max. It’s hard not to think there has been some kind of preferential treatment for someone like Jannik or Iga Swiatek – another former world No. 1 player – who have comparatively gotten off lightly for having banned substances in their systems.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-albanese-cements-lead-over-dutton-as-preferred-pm-polling-finds-labor-favoured-by-voters-20250429-p5lv8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Australian inflation figures higher than expected; more than four million Australians have voted",
        "publish_date": "Wed, 30 Apr 2025 11:54:28 +1000",
        "category": "finance",
        "authors": [
            "Sarah Mcphee",
            "Olivia Ireland",
            "Josefine Ganko"
        ],
        "text": "All-important inflation figures have come in a little higher than expected, potentially throwing a spanner into Reserve Bank expectations of an interest rate cut next month.\n\nIn the March quarter, prices rose by a higher-than-expected 0.9 per cent, with the annual rate steady at 2.4 per cent.\n\nThe trimmed mean inflation rate is at its lowest level since the December quarter of 2021, and fell by 0.4 percentage points over the past three months.\n\nServices inflation fell to 3.7 per cent, its lowest level since June 2022.\n\nThe annual inflation rate for insurance, for instance, fell to 7.6 per cent after hitting 16.4 per cent a year ago. Rents inflation also eased, edging down to 5.5 per cent after being at 7.8 per cent in the March quarter of last year.\n\nFood prices were up 1.2 per cent in the quarter, housing lifted by 1.7 per cent, while there was a large 5.2 per cent jump in education.\n\nThe key measures of underlying inflation were 0.7 per cent, in line with the Reserve Bank’s own forecasts, with the trimmed mean at 2.9 per cent and the weighted median at 3 per cent.\n\nThe biggest factor in today’s figures has been the end of an electricity subsidy in Queensland.\n\nNationally, power prices jumped by 16.3 per cent in the quarter. Without the end of Queensland’s $1000 subsidy, electricity prices would have lifted by 0.4 per cent.\n\nIt meant Brisbane’s inflation rate jumped 1.9 per cent to 2.7 per cent for the year. Inflation in Sydney and Melbourne is at 2.3 per cent, while it is now at 1.4 per cent in Hobart and 1.7 per cent in Darwin.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/cherry-evans-to-the-roosters-is-on-the-cards-phil-gould-thinks-it-s-a-bad-idea-20250430-p5lvc6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cherry-Evans to the Roosters is on the cards. Phil Gould thinks it’s a bad idea",
        "publish_date": "Wed, 30 Apr 2025 11:53:05 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Phil Gould believes the Roosters would be making a mistake in signing Daly Cherry-Evans, believing the veteran halfback’s arrival could upset the development of the promising halves already on the club’s books.\n\nCherry-Evans is yet to declare where his future lies after informing the Sea Eagles he will be leaving Brookvale at the end of the season. The Maroons captain has been linked to a move to the Roosters.\n\nThe Tricolours have play-making depth in the form of Sam Walker, Sandon Smith, Hugo Savala, Chad Townsend and promising youngster Toby Rodwell.\n\nSmith’s stocks are on the rise after several eye-catching performances, most notably after earning the Ashton-Collier Medal as player of the match in his side’s Anzac Day win against the Dragons.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/list-popes-of-the-20th-and-21st-centuries-20130314-2g1lh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "List: Popes of the 20th and 21st centuries",
        "publish_date": "Wed, 30 Apr 2025 11:51:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "List: Popes of the 20th and 21st centuries\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/jumping-out-of-their-skins-joy-for-african-choir-over-visa-backflip-20250429-p5lv5j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Jumping out of their skins’: Joy for African choir over visa backflip",
        "publish_date": "Wed, 30 Apr 2025 11:51:20 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Galvin"
        ],
        "text": "A group of young performers from Uganda and Kenya will tour Australia after all, following an 11th-hour backflip from the Department of Home Affairs to issue visas that had previously been denied.\n\nThe U-turn came just three days before the group of 14 singers, dancers and instrumentalists were due to leave Africa on a tour that will take them to more than 21 venues along Australia’s east coast.\n\nUgandan singer Faith Nassande is one of the choir members finally granted a visa to travel to Australia.\n\nThe Ubuntu Africa Tour is the sixth such tour organised by KwaYa Australia, a Gold Coast-based not-for-profit group that arranges cultural exchanges and relief efforts. Three months ago, KwaYa applied for temporary visas for the performers, aged in their early to mid-20s, as well as their adult tour leaders.\n\nKwaYa president Marsha Gusti was left heartbroken when the department rejected all the young adults’ visa applications, only giving the green light to the two older members of the touring party. She said that, among the reasons given by DHA in emailed responses for each of the refusals, were that they were not convinced the performers were “genuine entertainers” and that because they had not previously visited Australia, there was no evidence that they had complied with a previous visa.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/beauty/my-wife-is-going-to-hate-it-what-has-george-clooney-done-to-his-hair-20250428-p5lut9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘My wife is going to hate it’: What has George Clooney done to his hair?",
        "publish_date": "Wed, 30 Apr 2025 11:50:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "No one serves the salt-and-pepper look quite like George Clooney. Since he started going grey in the 1990s, the actor quickly became one of the world’s favourite “silver foxes”. But after dyeing his hair black recently for a role on Broadway, no one seemed more put off by it than he.\n\n“My wife is going to hate it because nothing makes you look older than when an older guy dyes his hair,” the Good Night, and Good Luck star told The New York Times in February.\n\nGeorge Clooney hates his dyed hair. Should more men embrace their grey locks too? Credit: AP/Supplied\n\nOther Hollywood celebrities are similarly smitten with their silver fox status, including Steve Carell, Patrick Dempsey and Hugh Grant. Locally, there’s Eric Bana, rugby coach Ivan Cleary and Ben Mendelsohn, who’s currently showing off his salt-and-pepper mane in season two of Andor.\n\nIf the likes of Clooney and Mendelsohn are championing their naturally greying hair, should other men follow suit and ditch the dye?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/the-12-year-old-aussie-who-s-named-after-novak-djokovic-and-has-alex-de-minaur-on-speed-dial-20250429-p5lv2s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 12-year-old Aussie who’s named after Novak Djokovic and has Alex de Minaur on speed dial",
        "publish_date": "Wed, 30 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Novak Palombo’s parents did not have plans for world domination when they named their son after a grand slam tennis legend.\n\nHis mother, Ana Marinkovic, was born in Serbia, and she and her husband, Steven Palombo, wanted to give their son a name that honoured his heritage, so Novak Djokovic seemed as good a choice as anyone.\n\nMelbourne’s Novak Palombo is the top-ranked 12-year-old tennis player in the world. Credit: Luis Enrique Ascui\n\nThat decision has proven prophetic, with Palombo – who lives in Melbourne and trains at Melbourne Park most days – now the best 12-year-old tennis player on the planet.\n\n“We loved the name, and Novak [Djokovic] has been an inspiration to a lot of kids and people around the world,” Steven said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-queensland-s-best-and-bravest-to-receive-medals-20250429-p5lv3l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Brooki Bakehouse owner accused of stealing recipes | Queensland’s best and bravest to receive medals",
        "publish_date": "Wed, 30 Apr 2025 11:42:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "RecipeTin Eats founder Nagi Maehashi has accused Bake With Brooki author Brooke Bellamy of stealing recipes from her and other unnamed authors, claiming the similarities with two of her own recipes “are so specific and detailed that calling these a coincidence feels disingenuous”.\n\nBrooke Saward, the owner of Fortitude Valley’s viral sensation Brooki Bakehouse. Credit: Brooke Saward\n\nBake With Brooki by Bellamy – owner of Brooki Bakehouse in Brisbane – was published by Penguin in October last year and retails for $49.99.\n\nThe RecipeTin Eats recipes at issue are for caramel slice and baklava, and Maehashi has posted on Instagram side-by-side pictures of these two recipes from the two books. Penguin has denied the allegations.\n\nLoading\n\nBellamy strenuously denied the claims in a story on her Instagram. “I did not plagiarise any recipes in my book which consists of 100 recipes I have created over many years,” she wrote.\n\nIn the post Bellamy says she “immediately offered to remove both recipes from future reprints to prevent further aggravation”.\n\nHere’s the full story.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/concern-over-school-students-using-nicotine-pouches-20250430-p5lvda.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Concern over school students using nicotine pouches",
        "publish_date": "Wed, 30 Apr 2025 11:40:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Concern over school students using nicotine pouches\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/no-excuses-next-wallabies-coach-says-14-month-lead-in-to-2027-world-cup-will-be-enough-20250430-p5lv9u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘No excuses’: Next Wallabies coach says 14-month lead in to 2027 World Cup will be enough",
        "publish_date": "Wed, 30 Apr 2025 11:34:57 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Incoming Wallabies coach Les Kiss says he won’t join the national team until his contract begins in the middle of next year and believes a 14-month runway is enough time for him to get Australia ready for a home World Cup in 2027.\n\nIt comes as incumbent coach Joe Schmidt threw his full support behind Kiss, saying continuity in style and philosophy would benefit the Wallabies in the coming years.\n\nAs revealed by this masthead on Tuesday, Rugby Australia has convinced Schmidt to extend his stint as Wallabies coach from October this year - he was supposed to finish at the end of the Rugby Championship - to July next year.\n\nKiss, the current Queensland Reds coach and a former assistant under Schmidt with Ireland, will take over in July 2026 on a deal through to the end of 2028.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/the-next-djokovic-aussie-named-after-novak-taking-tennis-world-by-storm-20250430-p5lvd0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Djokovic? Aussie named after Novak taking tennis world by storm",
        "publish_date": "Wed, 30 Apr 2025 11:31:49 +1000",
        "category": "sports",
        "authors": [],
        "text": "The next Djokovic? Aussie named after Novak taking tennis world by storm\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/why-i-m-boycotting-the-democracy-sausage-and-you-should-too-20250429-p5lv5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why I’m boycotting the democracy sausage (and you should too)",
        "publish_date": "Wed, 30 Apr 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Mali Waugh"
        ],
        "text": "When I was studying for my bachelor of arts (back when people willingly went into debt to become experts on Jacobean literature), I was pretty opinionated. I loved getting into political discussions with anyone who’d engage. This mainly involved regurgitating the content of newspaper commentary pages to my grandparents and quoting articles about the failures of mutual obligations policies to creeps with darting eyes on public transport (the joke is on you, eccentrically dressed man who just wanted to sit near a human female).\n\nThis election day, every politician in the country will be filmed gnawing on some unidentified meat in limp white bread.\n\nSince I’ve had kids and life experience, I’ve left hyper-engagement behind, choosing instead to cultivate a world-weariness that matches my character-actor face. Humanity keeps pumping out novel cruelties and down in the “anus of the world” (as Jerry Seinfeld once said) we are prisoners to inertia. It is dispiriting to care too much. These days, I only pay attention when I have to vote. The entry-level Australian democratic experience – standing in line, quietly mocking the independent who’s a little too into “commonsense gun ownership”, and eventually casting your vote – is also where the democracy sausage rears its ugly, sausagey head. I hate them, and I want you to hate them too.\n\nBefore I go too deep, I should declare a potential conflict of interest: my parents – relics of the original hippy era – raised my siblings and me as vegetarians. At school, I had to bring my foil-wrapped vegetarian sausages on sausage sizzle days. The idea of sausages being remotely celebratory, given their link to a very ’90s brand of exclusionary regional Australia, has never sat quite right. But honestly, even without that particular trauma, I’d still hate them. I get that to some, the democracy sausage (democrausage?) is a quintessentially Australian tradition – but to me, it’s inauthentic, low-key jingoistic, and flat-out gross.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/hear-that-it-s-the-sound-of-live-music-dying-for-local-australian-artists-20250429-p5lv5t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hear that? It’s the sound of live music dying for local Australian artists",
        "publish_date": "Wed, 30 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Athanasia Sakoutis"
        ],
        "text": "When the offer came through for me to support a legendary international act on its Australian tour, I cried. It was the kind of moment emerging artists like me dream about: a national stage, exposure, and the chance for my music to truly be heard. In our industry, being a support act or landing a festival slot is often the only way to get traction and gain credibility.\n\nBut once the adrenaline wore off, reality hit. I’d be joining them across Australia entirely out of pocket with no support for travel, food, accommodation or even equipment. And to be clear, this wasn’t a small indie band pulling together a DIY tour, this was a huge international act.\n\nAthanasia Sakoutis performing in Coogee.\n\nSuddenly, I was weighing the difficult choice of investing thousands of dollars into a career opportunity I could not afford or decline and miss the moment I’d spent years working towards. When asking around, most people said the same thing: “that’s just the price you pay to be an artist”. Spoiler alert, I declined this opportunity – unsure if I’d ever be offered something like it again.\n\nIt’s not revolutionary to say, making it in the music industry has always been hard. That’s why the words “struggling” and “artist” are so often paired. But at what point does the struggle become unsustainable?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/breakthrough-documents-rise-of-womens-origin-20250430-p5lvcx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Breakthrough' documents rise of women's Origin",
        "publish_date": "Wed, 30 Apr 2025 11:23:15 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Breakthrough' documents rise of women's Origin\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/dembele-rocks-arsenal-early-20250430-p5lv97.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dembele rocks Arsenal early",
        "publish_date": "Wed, 30 Apr 2025 11:18:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Dembele rocks Arsenal early\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/everything-is-geared-against-me-renters-left-behind-as-report-shows-housing-crisis-deepens/f395djhb5",
        "title": "'Everything is geared against me'. Renters left behind as report shows housing crisis deepens",
        "publish_date": "Tue, 29 Apr 2025 19:44:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "In Brisbane, student Julia (not her real name) is facing an impossible choice: drop out of full-time study, or risk homelessness.\n\n\n\n\n\n\"I want to focus on study, but I am looking at dropping to part-time so that I can work more hours. It’s the only way I can live,\" Julia said.\n\n\n\n\n\nWith no affordable rooms available for someone on Youth Allowance in southern Queensland, and rent assistance policies that effectively penalise share house living, Julia feels trapped.\n\n\n\n\n\n\"I can’t get rent assistance unless I take on a bigger lease, but that will only make things worse. I feel like everything is geared against me studying to get ahead.\"\n\n\n\n\n\nIn Sydney, Cait (not her real name) has just four weeks left to find a new place to live, and nowhere to go.\n\n\n\n\n\nSingle and receiving JobSeeker payments, Cait was told her lease would not be renewed due to her landlord ending the lease for family reasons.\n\n\n\nREAD MORE Major parties promise to boost tradie numbers but will it be enough to ease the housing crisis?\n\nCait said she has struggled to keep up with rent increases for years, even though the unit she lives in is relatively affordable at $450 a week.\n\n\n\n\n\nBut finding something else she can afford has proven impossible.\n\n\n\n\n\n\"I'm trying to find somewhere to rent in Sydney but it's impossible on how much I'm living on,\" she said.\n\n\n\n\n\n\"I'm applying for everything I can find, but it's looking bleak. I have to be out in four weeks and I don't know where I'm going to. I'm thinking of setting up a crowdfund to get some help, but the uncertainty is very stressful.\"\n\n\n\nAustralia’s housing crisis is the worst it has ever been Anglicare Australia executive director Kasy Chambers\n\nCait’s situation is far from unique.\n\n\n\n\n\nOn the weekend that Anglicare Australia conducted its annual Rental Affordability Snapshot, there were no rental listings that were affordable for people on Youth Allowance.\n\n\n\n\n\nSurveying over 51,000 rental listings across the country, the snapshot also revealed that just 0.7 per cent of rentals were affordable for someone earning a full-time minimum wage and that just three rooms, all in share houses, were affordable for a person on JobSeeker.\n\n\n\n\n\n\"Australia’s housing crisis is the worst it has ever been,\" said Anglicare Australia executive director Kasy Chambers.\n\n\n\n\n\n\"We keep hearing that this election is about living costs, but housing is the biggest cost facing Australians. The housing crisis is climbing the income ladder, and people on the lowest incomes don’t stand a chance.\n\n\n\n\n\n\"Across the country, there are 74 electorates without a single affordable rental for someone on the minimum wage.\n\n\n\n\n\n\"For a person out of work it’s even grimmer. Out of 51,000 listings across the country, just three were affordable for someone on JobSeeker.\"\n\n\n\nThe Anglicare Snapshot surveyed 51,238 rental listings across Australia. Source: SBS News Chambers said voters are desperate for meaningful action, but so far political parties are offering little.\n\n\n\n\n\n\"Instead, parties are promising more of the same. At best they are overlooking those who need the most help, and at worst, they are making promises that could overheat the market and push costs up.\"\n\n\n\n\n\nShe warned that leaving housing provision to the private market has only worsened the crisis.\n\n\n\nREAD MORE The housing affordability stumbling block being ignored by both major parties\n\n\"This approach is wrong, and it’s supercharging rents and house prices,\" she said.\n\n\n\n\n\n\"These results show that housing cannot be left to the private sector. We're calling on the next parliament to ensure that rentals are affordable by building rentals people can afford, and by fixing Australia’s unfair tax system.\"\n\n\n\nAnglicare's Snapshot showed that there were 74 electorates without a single affordable rental for someone on the minimum wage. Source: SBS News The report made recommendations including ending negative gearing to reduce speculative investment, redirecting resources towards building affordable housing as well as raising the rate of income payments like JobSeeker and Youth Allowance \"above the poverty line so people have a realistic chance of securing a home.\"\n\n\n\n\n\n\"Our tax system is built to generate profit, not provide homes,\" Chambers said.\n\n\n\n\n\n\"And our social security system traps people in poverty instead of helping them find stability, if the next parliament fails to act, this crisis will only get worse.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx200-back-above-8-000-china-returns-as-dominant-australian-wine-importer/e4nvfz7xj",
        "title": "ASX200 back above 8,000 & China returns as dominant Australian wine importer",
        "publish_date": "Tue, 29 Apr 2025 08:33:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-is-a-welcome-to-country-ceremony-and-why-is-it-important/36tm9944f",
        "title": "What is a Welcome to Country ceremony, and why is it important?",
        "publish_date": "Tue, 29 Apr 2025 07:55:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Welcome to Country ceremonies have been part of Aboriginal and Torres Strait Islander cultures for thousands of years, and feature in many events in modern Australia.\n\n\n\n\n\nRecently, Opposition leader Peter Dutton suggested they are \"overdone\" , and claimed the ceremonies and Acknowledgements of Country are \"divisive\".\n\n\n\n\n\nFulbright Scholar and Wiradjuri educator Jessa Rogers told NITV she does not believe the ceremonies are divisive.\n\n\n\n\n\n\"I can't think of any time in my life where I've been welcomed somewhere and felt that I was being divided or excluded,\" she said.\n\n\n\n\n\n\"The word welcome is a generous offering, and that is exactly what's happening when people are welcomed to Country ... I don't think [it's] divisive and I can't really understand that point of view.\"\n\n\n\n\n\nHere's what you need to know about Welcome to Country ceremonies, their history, and why they are important.\n\n\n\nWhat is a Welcome to Country ceremony?\n\nA Welcome to Country is a ceremony that takes place at the beginning of an event, and is done by the traditional custodians of Country to formally welcome people onto their land.\n\n\n\n\n\nIt can include singing, dancing, a smoking ceremony and sometimes a speech.\n\n\n\n\n\nJuru Elder Randall Ross said the ceremonies are part of a cultural obligation.\n\n\n\n\n\n\"The main reason to do Welcome to Countries is about welcoming people so they're safely on your Country, or you're crossing your Country,\" he said.\n\n\n\n\n\n\"Because you want to ensure that all people are safe when either moving around on Country or visiting Country.\"\n\n\n\nREAD MORE What does Welcome to Country mean?\n\nRogers said it is important to understand the ceremonies are not about welcoming people to the country of Australia.\n\n\n\n\n\n\"We're talking about our own lands, our own people, the place that owns us,\" she said.\n\n\n\n\n\n\"So when we say Country, we're talking about something different. And I don't think many Australians actually understand that.\"\n\n\n\nWelcome to Country ceremonies are often included in sporting events. Source: AAP / Daniel Pockett Vanessa Turnbull-Roberts is a Bundjalung lawyer and advocate, and the Commissioner for Aboriginal and Torres Strait Islander Children and Young People.\n\n\n\n\n\nShe said the ceremonies are about respect and connection to Aboriginal and Torres Strait Islander culture.\n\n\n\n\n\n\"Welcome to countries are actually an opportunity to come together and seek consent on the land that we're walking on and actually be welcomed into a place of community and connection,\" she said.\n\n\n\n\n\n\"They are ultimately an invitation to the whole non-Indigenous community to participate in honouring the land and Country that we are on.\"\n\n\n\nWhat is an Acknowledgement of Country?\n\nUnlike a Welcome to Country, an Acknowledgement of Country can be done by a non-Indigenous person. It is often delivered at the start of meetings or events to pay respect to the Traditional Owners.\n\n\n\n\n\nThey are sometimes included in podcasts, film and television, and even by some flight captains when landing planes in Australia.\n\n\n\n\n\nThere is no set wording or laws for doing an Acknowledgement of Country.\n\n\n\n\n\nThey often feature phrasing such as: \"I'd like to acknowledge the Traditional Owners of the land on which we meet today. I would also like to pay my respects to Elders past and present\".\n\n\n\nWhy are Welcome to Country ceremonies being debated?\n\nIn an election debate on Sunday, Opposition leader Peter Dutton said he believes Welcome to Country ceremonies are \"overdone\".\n\n\n\n\n\nOn Monday, he said that while it is ultimately up to event organisers, he does not think the ceremonies should be included at Anzac Day services.\n\n\n\nREAD MORE Why are we debating Welcome to Country?\n\nTurnbull-Roberts told NITV Dutton is in \"no position\" to be determining when or where Welcome to Country ceremonies are conducted.\n\n\n\n\n\n\"I think Dutton as a non-Indigenous person is not the person to be having this discussion, nor should it be up for debate whether he has any buy-in to this conversation at all,\" she said.\n\n\n\n\n\n\"Our Welcome to Countries, our Acknowledgements of countries, our places when we choose to do these are on the basis of the Traditional Custodians deciding to do this.\n\n\n\n\n\n\"It is not up to Dutton, nor is it up to any other person in a leadership position to determine whether they happen or not.\"\n\n\n\nREAD MORE Nine things that cost more than Welcome to Country ceremonies\n\nLarrakia Elder Richard Fejo said the ceremonies are about being \"inclusive, not exclusive\".\n\n\n\n\n\n\"We are welcoming people to our ancient lands and we're very spiritual people,\" he said.\n\n\n\n\n\n\"When I welcome people to my land, I ask that my ancestors guide and protect us always. So we're taking you under our wing and we're introducing you to our spiritual ancestors, we're asking for them to guide and protect you.\"\n\n\n\nWelcome to Country ceremonies are not legally required, but are done as a mark of respect. Source: AAP / Daniel Pockett Fejo said the ceremonies are an important part of the protocols around community.\n\n\n\n\n\n\"For the people that are out there that say, 'Welcome to Country is overused', you don't know our culture, we know our culture,\" he said.\n\n\n\n\n\n\"We are their cultural specialists about our people. And for those of you who would talk about money, talk about all kinds of things, these are excuses not to participate.\n\n\n\n\n\n\"But we, as Aboriginal people, we know our community, we know our protocols around community and we respect and honour these protocols.\"\n\n\n\nAre Welcome to Country ceremonies required by law?\n\nWelcome to Country ceremonies are not legally required to be done at Australian events.\n\n\n\n\n\nTurnbull-Roberts said it is up to Traditional Custodians and Elders to decide whether a Welcome to Country will take place.\n\n\n\n\n\n\"For thousands and thousands of years, Welcome to Countries have been practised,\" she said.\n\n\n\n\n\n\"This isn't a new thing, this isn't a new way that we're overdoing, or it isn't something that's just come out of nowhere. Welcome to Countries have been here since the first sunrise.\"\n\n\n\n\n\nPrime Minister Anthony Albanese said it was up to the organisations hosting events whether they have a Welcome to Country or not.\n\n\n\nREAD MORE Aunty Joy's Welcome to Country was cancelled at the last minute by Melbourne Storm\n\n\"It's up to them and people will have different views, and people are entitled to their views,\" he said during Sunday's debate.\n\n\n\n\n\n\"From my perspective, for major events, it is, of course, a sign of respect.\"\n\n\n\n\n\nDutton said he thought the ceremony was appropriate for the opening of Parliament but not events like Anzac Day.\n\n\n\n\n\nRogers said she believes there is a \"deeper issue\" of people not understanding Aboriginal and Torres Strait Islander culture.\n\n\n\n\n\n\"When [people] ask the questions about what is a welcome and why is it happening, I do genuinely believe that there is a lack of knowledge,\" she said.\n\n\n\n\n\n\"And what that calls for is a greater education of the Australian population and visitors here to what those protocols and ceremonies are actually for.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/nepal-could-soon-make-climbing-mount-everest-even-harder/vz108ria5",
        "title": "Nepal could soon make climbing Mount Everest even harder",
        "publish_date": "Tue, 29 Apr 2025 05:37:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nepal will issue Everest permits only to climbers with experience of scaling at least one of the Himalayan nation's 7,000m peaks, according to the draft of a new law aimed at reducing overcrowding and improving safety.\n\n\n\n\n\nNepal, which is heavily reliant on climbing, trekking and tourism for foreign exchange, has faced criticism for permitting too many climbers, including inexperienced ones, to try to ascend the 8,849m peak.\n\n\n\n\n\nThis often results in long queues of climbers in the 'death zone', an area below the summit with insufficient natural oxygen for survival.\n\n\n\n\n\nOvercrowding has been blamed for the high number of deaths on the mountain.\n\n\n\n\n\nAt least 12 climbers died, and another five went missing on Everest's slopes in 2023, when Nepal issued 478 permits. Eight climbers died last year.\n\n\n\nLISTEN TO Deadly Everest climbing season prompts questions about safety SBS News 09/06/2023 03:49 Play\n\nUnder the proposed law, an Everest permit would be issued only after a climber provides evidence of having climbed at least one 7,000m mountain in Nepal.\n\n\n\n\n\nThe sardar, or head of local staff, and the mountain guide accompanying climbers must also be Nepali citizens.\n\n\n\n\n\nThe draft law has been registered at the National Assembly, the upper house of parliament, where the ruling alliance holds a majority required to pass the bill.\n\n\n\n\n\nInternational expedition operators have urged Nepal to allow any 7,000m peak, not just those in the Himalayan nation, for the Everest permit.\n\n\n\nMount Everest is the world's tallest mountain. Source: Getty / Paula Bronstein Lukas Furtenbach of Austria-based expedition organiser, Furtenbach Adventures, said: \"That wouldn't make any sense. And I would also add mountains that are close to 7,000m to that list and that are widely used as preparation, like Ama Dablam, Aconcagua, Denali and others.\"\n\n\n\n\n\nFurtenbach, currently leading an expedition on Everest, said mountain guides from other countries must also be allowed to work on Everest, as there are not enough qualified Nepali mountain guides.\n\n\n\nLISTEN TO Nima Rinji Sherpa on becoming youngest to climb 14 peaks: 'I was born for mountains' SBS Nepali 01/11/2024 10:55 Play\n\n\"It is important that mountain guides have a qualification like IFMGA [International Federation of Mountain Guides Associations], no matter what nationality they are. We do also welcome Nepali IFMGA guides to work in the Alps in Europe,\" Furtenbach told Reuters.\n\n\n\n\n\nGarrett Madison of the United States-based Madison Mountaineering also said a 6,500m peak anywhere in the world would be a better idea.\n\n\n\n\n\n\"It's too difficult to find a reasonable 7,000m-plus peak in Nepal,\" Madison said.\n\n\n\nThere are more than 400 mountain peaks in Nepal that are open to expeditions — of them, 74 are higher than 7,000m, according to tourism department data.\n\n\n\n\n\nHowever, not many of those peaks are popular among climbers, hiking officials said.\n\n\n\n\n\nTashi Lakpa Sherpa of the 14 Peaks Expedition, a major expedition organising company in Nepal, said: \"Only a few of the 7,000m mountains attract climbers.\"\n\n\n\n\n\nHe has climbed Everest, known officially and locally as Sagarmatha in Nepal or Qomolangma in Tibet, eight times.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/does-it-matter-which-arm-gets-a-vaccine-a-new-study-offers-some-clues/v1o5j8mpf",
        "title": "Does it matter which arm gets a vaccine? A new study offers some clues",
        "publish_date": "Tue, 29 Apr 2025 04:26:15 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Using the same arm for a booster vaccine as for a first dose may help the immune system respond effectively to a disease outbreak, according to new Australian research.\n\n\n\n\n\nThe study, published in the journal Cell on Tuesday, detailed a clinical trial in which most volunteers received two vaccination jabs in one arm, while the rest switched arms between shots.\n\n\n\n\n\nThose who received their booster dose in the same arm as their first had produced neutralising antibodies significantly faster than those who had their second shot in the opposite arm, the researchers found.\n\n\n\n\n\nThe trial involved 30 volunteers who were injected with the Pfizer-BioNTech mRNA vaccine for COVID-19.\n\n\n\n\n\nImmune cells in the lymph node near the injection site activated after the initial shot, according to the study led by the Garvan Institute of Medical Research and the Kirby Institute at the University of NSW.\n\n\n\nThese became primed to boost the immune response after the second shot was administered in the same arm.\n\n\n\n'Fundamental discovery'\n\nThe study's co-senior author, Professor Tri Phan, director of Garvan's precision immunology program, hoped the evidence would refine vaccination approaches.\n\n\n\n\n\n\"This is a fundamental discovery in how the immune system organises itself to respond better to external threats — nature has come up with this brilliant system and we're just now beginning to understand it,\" Phan said.\n\n\n\n\n\nBreaking down the complex study, Phan said vaccines stimulate the development of immune cells that make antibodies, along with immune cells that become primed to help them.\n\n\n\n\n\nThe primed cells that remember the vaccine help to make a faster response the second time around by helping memory B cells change the antibodies they make to adapt to changes in the virus.\n\n\n\nViruses can mutate, but so can memory B cells.\n\n\n\n\n\n\"What's exciting about the research is that we showed that these other cells, called macrophages, interact with these memory B cells,\" Phan said.\n\n\n\n\n\n\"By talking to the memory B cells, they can help direct them to mutate the receptor and make better antibodies.\"\n\n\n\n\n\nWhile there are no official guidelines on whether you should receive your vaccine in the same arm, Phan said the findings show there is a \"benefit\" and offer a promising avenue for enhancing the effectiveness of vaccines.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-will-election-promises-cost/lk2yzimk6",
        "title": "What will election promises cost?",
        "publish_date": "Tue, 29 Apr 2025 04:18:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nHiking international student visa fees and cutting back on consultant spending are some of Labor's plans to keep the budget in shape.\n\n\n\n\n\nIf re-elected, from the 1st of July they will raise international student visa fees from $1,600 to $2,000.\n\n\n\n\n\nIn a joint press conference, Treasurer Jim Chalmers and Finance Minister Katy Gallagher revealed a further $1 billion in savings since the pre-election economic and fiscal outlook.\n\n\n\n\n\n\"We will finish this election campaign with the budget in a stronger position than at the start of the election campaign. We have improved the budget position by more than a billion dollars, comparing the pre-election outlook to the costings that we release.\"\n\n\n\n\n\nOpposition leader Peter Dutton announced earlier in the month that he will put a cap of around 25 per cent of foreign students admitted to public universities.\n\n\n\n\n\nIn a bid to solve the housing affordability crisis in the country, the Coalition had earlier said that they will reduce the number of overseas students coming to Australia each year by around 80,000 people.\n\n\n\n\n\nLabor unveiled the cost of commitments made since March's budget on Monday, raising the pressure on the Coalition to release its costings.\n\n\n\n\n\nBut the parliamentary budget office doesn't release its full list of costings until after the election.\n\n\n\n\n\n\"So these costings show that we are managing the budget, and the economy in a responsible and a considered and a methodical way. If you think about the roughly ten billion dollars of commitments that we've made in this election campaign, four billion of that was already provided for and provisioned for either in the budget or the pre-election economic and fiscal outlook, and the other six billion dollars has been more than an offset by the two budget improvements.\"\n\n\n\n\n\nSo where do Labor's savings come from?\n\n\n\n\n\nSavings will come from student visa fees, which will increase to $2,000 from 1 July 2025.\n\n\n\n\n\nThey are anticipating to deliver $760 million to the budget over the forward estimates.\n\n\n\n\n\nBut the change will not affect arrangements for Pacific Island and Timor-Leste applicants.\n\n\n\n\n\nKaty Gallagher is the Finance Minister.\n\n\n\n\n\n\"A small uplift in student visa - again - we think that's a sensible measure that really prices I think the value of coming here and studying in Australia so that will also be used but that figure is not counted in our savings of over $100 billion dollars. So - we are very pleased that we have been able to do this hard work, we have been able to offset the commitments that we've made post-PEFO*. For those that we have announced beforehand, we've found room in the budget for those.\"\n\n\n\n\n\nAn extra $6.4 billion will come from reducing spending on consultants, contractors, and labour hire, as well as non-wage expenses such as travel, hospitality, and property.\n\n\n\n\n\nThe Minister says unlike the Coalition's pledge to cut 41,000 public jobs, these savings would not impact any services or programs that the Australian Public Service provides.\n\n\n\n\n\nThe cumulative budget deficit will reduce from $151.6 billion to $150.5 billion as a result of the changes.\n\n\n\n\n\nIt will help to cover Labor's $1,000 instant tax deduction for work expenses, which is estimated to cost the budget $2.4 billion over forward estimates.\n\n\n\n\n\n\"We got rid of a lot of the waste and the rorts that was embedded in the former government's budgets, and we returned that money to budget and it allowed us - along with finding savings, to find room for those really important cost-of-living measures, that we have been able to deliver through our budgets — our investments in Medicare, our investments in housing, the income tax cuts, and other measures like lowering HECS debt.\"\n\n\n\n\n\nThe Treasurer is urging the Coalition to come clean on their figures.\n\n\n\n\n\n\"Now we call on the Coalition now to come clean on their cuts, we've made it very clear what our costs are and how we will pay, for the commitments that we have made in the election campaign. This continues a record of responsible economic management. It is long past time for the Coalition to come clean on their secret cuts to pay for their nuclear reactors. They need to come clean on what their secret cuts for nuclear reactors means for Medicare, for pensions and payments, for skills and housing and other essential investments in the budget.\"\n\n\n\n\n\nMeanwhile Opposition treasury spokesman Angus Taylor has thrown blame on the Treasurer after a credit ratings agency warned that Australia's global credit rating could be at risk.\n\n\n\n\n\nS&P Global Ratings reported that \"off-budget\" election pledges – for which Labor shared its costings yesterday – might be compromising Australia's AAA credit rating.\n\n\n\n\n\nMr Taylor claims it is Labor, not the Coalition as the Treasurer earlier suggested, that poses the biggest risk to the economy.\n\n\n\n\n\n\"We know from the last budget that Labor is delivering 10 consecutive deficits, red ink over the course of the next decade, $180 billion of deficits over the forwards including this year and that's heading us towards $1.2 trillion of debt. The costings today only reinforce that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-29-april-2025/l4s7332dy",
        "title": "SBS News in Easy English 29 April 2025",
        "publish_date": "Tue, 29 Apr 2025 04:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nA prominent Indigenous leader has accused politicians of using Aboriginal and Torres Strait Islander people as a political \"football\" on the issue of Welcome to Country ceremonies.\n\n\n\n\n\nAlyawarre woman and co-chair of the Uluru Dialogue Pat Anderson A-O says the ceremonies are not about welcoming people to Australia, but to cultures and lands.\n\n\n\n\n\nOpposition leader Peter Dutton has described Welcome to Country ceremonies as 'overused'.\n\n\n\n\n\nHis Victorian counterpart Brad Battin has said there is a risk that constant Welcome to Country ceremonies will make them become disingenuous.\n\n\n\n\n\nBundjalung Lawyer & advocate Vanessa Turnbull-Roberts has told NITV the opposition leaders' remarks worry the community.\n\n\n\n\n\n\"He is not the person to be having that discussion, nor is he the person to be talking about whether it takes place or not. He is a non Indigenous man and it is up to the traditional owner of that land to determine whether they happen or not. When it comes to the rhetoric we've seen from the Liberal party and the conversation around what could potentially be our national leader here in this country it is quite concerning.\"\n\n\n\n\n\n.\n\n\n\n\n\nLabor has announced it will fund some of its election promises by raising visa fees for international students.\n\n\n\n\n\nThe move will mean the cost will go up from $1,600 to $2,000, if Labor is re-elected.\n\n\n\n\n\nFinance Minister Katy Gallagher says the fee hike only amounts to a small rise.\n\n\n\n\n\n\"We think that's a sensible measure that really prices I think the value of coming here and studying in Australia, so that will also be used.\"\n\n\n\n\n\n.\n\n\n\n\n\nAn advocacy group has focused on marginal seats in a gambling harm blitz in the final days of the election campaign.\n\n\n\n\n\nIt's a relatively modest campaign, with the group known as Gambling Reform spending just under $4200 on Facebook advertising in the month to April 25.\n\n\n\n\n\nBut paid posts comparing the stances of candidates on banning gambling advertisements have targeted key electorates.\n\n\n\n\n\nThey include Gilmore in New South Wales, Brisbane in Queensland, Deakin in Victoria, and the Greens-held seat of Brisbane.\n\n\n\n\n\n.\n\n\n\n\n\nThe coalition maintains it can still win the federal election despite dismal polling.\n\n\n\n\n\nA Roy Morgan poll shows Labor is on track to form a majority government, leading 53 to 47 per cent on a two-party preferred basis.\n\n\n\n\n\nPeter Dutton is hitting more than two dozen seats in the final week of campaigning ahead of Saturday's poll.\n\n\n\n\n\nHe has told Radio 4BC in Brisbane that the party's internal polling is positive, and that gives him great confidence for the final result.\n\n\n\n\n\n.\n\n\n\n\n\nMeanwhile, a woman has been arrested after the office of Peter Dutton was vandalised in Brisbane.\n\n\n\n\n\nThe 18 year old woman has been charged with one count of wilful damage after the incident.\n\n\n\n\n\nQueensland Police say officers were called to an address in Mitchelton following reports of four people in a red sedan acting suspiciously.\n\n\n\n\n\nBut while the vehicle fled the scene before police arrived, a police dog later tracked a woman to another suburb.\n\n\n\n\n\n.\n\n\n\n\n\nThe cause of a mass outage across Spain and Portugal remains unclear, hours after the power cut brought public transport and other key services to a halt.\n\n\n\n\n\nPortuguese Prime Minister Luis Montenegro says there is no indication a cyberattack is the reason for the outage.\n\n\n\n\n\nPortugal has suggested however that the issue originated in Spain, while Spain says it could be a break-up in its connection to France.\n\n\n\n\n\nSpanish Prime Minister Pedro Sanchez says an investigation is underway that he is confident will pinpoint the cause.\n\n\n\n\n\n\"It is better not to speculate. We will know the causes later. We are not ruling out any hypotheses. But for now we must focus on the most important thing, which is restoring electricity to our homes.\"\n\n\n\n\n\n.\n\n\n\n\n\nA Sydney-based music festival has been confirmed as the second site of a year long pill testing trial in New South Wales.\n\n\n\n\n\nThe Midnight Mafia event at the Sydney Showground will host the free and anonymous drug-checking service.\n\n\n\n\n\nAdvocates say pill testing is a proven harm minimisation strategy used in many countries for decades, while opponents say it sends mixed messages about the risks of using and possessing illicit drugs.\n\n\n\n\n\nHealth Minister Ryan Park has called it a crucial health intervention.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/power-outage-bring-chaos-across-spain-and-portugal/z5222st5l",
        "title": "Power outage bring chaos across Spain and Portugal",
        "publish_date": "Tue, 29 Apr 2025 03:00:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nA rare mass power outage caused chaos and disruptions in Spain and Portugal on Monday.\n\n\n\n\n\nMadrid local Claudia Garcia says there was widespread confusion.\n\n\n\n\n\n\"Well, the power has gone out. We went out to see if something had happened on the street and no. What we saw was that everyone was saying the same thing: 'No power, no power'. A man passed by in a van and said it was all over Spain, Portugal and also Belgium was without electricity. We don't know to what extent because I was listening to it on the radio.\"\n\n\n\n\n\nThe outage across the Iberian peninsula began around 12.30 pm local time, grounding planes, halting traffic and and forcing some hospitals to suspend routine operations.\n\n\n\n\n\nAt Atocha, one of Madrid's main railway stations, passengers stood waiting on platforms, with trains at a standstill.\n\n\n\n\n\nMari Carmen is a train station worker and was left stranded by the blackout. She says she needs to get home.\n\n\n\n\n\n“Very worried, because I am trying to get home. I don't know how, I have my two children at home alone. So it's terrible, I'm trying to get my husband to come in here so I can get home, but I haven't been able to get home, work or do anything. So that's what it is.”\n\n\n\n\n\nOthers were left trapped. Around 35,000 people in Spain were caught on more than 100 trains.\n\n\n\n\n\nMany were stuck in lifts for hours and pleas came over messaging services from those waiting to be rescued.\n\n\n\n\n\nThe blackout left ATM screens blank and many distressed by a loss of wifi and phone connection.\n\n\n\n\n\nPanicked by the confusion, many people in Madrid flocked to supermarkets to stock up on essential supplies such as water, eggs and milk.\n\n\n\n\n\nTwo international students in Madrid say they didn't know how much they they needed power to move around the city.\n\n\n\n\n\n\"I don’t know, it’s probably, we’re scared, it shows how dependent we are on it.\"\n\n\n\n\n\n\"We were actually most afraid of walking back home without the streetlights.\"\n\n\n\n\n\n\"And also the traffic lights.\"\n\n\n\n\n\nIn Portugal, many supermarkets in Lisbon and the resort town of Vilamoura in southern Portugal had shut.\n\n\n\n\n\nThousands of passengers were also left stranded in the capital's airport.\n\n\n\n\n\nEstefania Caquiagia, who was visiting Portugal from Angola and due to fly home, says there was a tense atmosphere as tourists sat outside the terminal and waited for news about their flights.\n\n\n\n\n\n“As you can see this is a flood of people, so boring. Nobody in, nobody out. Boring, thirsty, hungry -- we can’t do anything and here we are completely lost.\"\n\n\n\n\n\nSpain's Interior Ministry declared a national emergency and governments from the two countries convened emergency cabinet meetings as officials tried to find out what caused the mass blackout.\n\n\n\n\n\nAccording to Spain's Energy Ministry, the country's network lost 15 gigawatts of electricity generation in five seconds when the outage happened -- a loss of power supply that European systems are not designed to handle.\n\n\n\n\n\nThe drop caused Spain and France's grids to disconnect, leading to the collapse of the Spanish electricity network.\n\n\n\n\n\nHowever, the reason for the power loss is still unclear.\n\n\n\n\n\nSpain's Prime Minister Pedro Sanchez says investigations are continuing into the cause of the outage and no possibilities have been ruled out yet.\n\n\n\n\n\n\"It is better not to speculate. We will know the causes later. We are not ruling out any hypotheses. But for now we must focus on the most important thing, which is restoring electricity to our homes.\"\n\n\n\n\n\nPrime Minister Luis Montenegro says it's likely the blackout in Portugal was caused by the power collapse in Spain.\n\n\n\n\n\nRumours circulated of possible sabotage, however Mr Montenegro says there was no evidence for this theory.\n\n\n\n\n\nThe Portugese National Cybersecurity Center said in a statement there was no sign the outage was due to a cyber attack.\n\n\n\n\n\nWidespread power outages are rare in Europe.\n\n\n\n\n\nIn 2003, a problem with a hydroelectric power line between Italy and Switzerland caused a major outage across the whole Italian peninsula for around 12 hours.\n\n\n\n\n\nIn 2006, an overloaded power network in Germany caused electricity cuts across parts of Europe and as far as Morocco.\n\n\n\n\n\nAbout 43 per cent of Spain's energy comes from wind and solar power, with nuclear accounting for a further 20 per cent and fossil fuels 23 per cent, according to energy think tank Ember.\n\n\n\n\n\nBy late Monday, nearly 50 per cent of Spain's electricity supply was restored and Portugal said it was likely that power would be fully restored to the country within hours.\n\n\n\n\n\nIn Madrid, crowds cheered as the lights came back on in parts of the city.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-29-april-2025/ckspsh6w4",
        "title": "Leaders hit marginal seats in last days of federal election campaign | Midday News Bulletin 29 April 2025",
        "publish_date": "Tue, 29 Apr 2025 02:06:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nPeter Dutton and Anthony Albanese visit marginal seats in the last few days of the federal election campaign;\n\nNew South Wales confirms the second site of a pill testing trial;\n\nNo return date yet for Sam Kerr at her UK club, Chelsea.\n\nPeter Dutton is hitting more than two dozen seats in the final week of campaigning ahead of Saturday's poll.\n\n\n\n\n\nA Roy Morgan poll shows Labor is on track to form a majority government, leading 53 to 47 per cent on a two-party preferred basis.\n\n\n\n\n\nBut the coalition maintains it can still win the federal election despite dismal polling.\n\n\n\n\n\nThe opposition leader says the party's internal polling is positive, and is giving him great confidence for the final result.\n\n\n\n\n\n.\n\n\n\n\n\nMeanwhile Prime Minister Anthony Albanese is campaigning today in the Greens held seat of Griffith, an electorate Labor is hoping to reclaim.\n\n\n\n\n\nHis policy focus on the campaign stop is housing, an issue that Labor and the Greens regularly clashed over during the last term of Parliament.\n\n\n\n\n\nLabor plans to build 100,000 homes set aside for first home buyers if it's re-elected.\n\n\n\n\n\nMr Albanese says that will help address affordability issues.\n\n\n\n\n\n\"We support increased housing supply as being the key. Whether that be increased numbers of social housing, whether that be increased numbers of affordable housing, increased private rentals, or increased home ownership.\"\n\n\n\n\n\n.\n\n\n\n\n\nAn advocacy group has focused on marginal seats in a gambling harm blitz in the final days of the election campaign.\n\n\n\n\n\nIt's a relatively modest campaign, with the alliance known as Gambling Reform spending just under $4200 on Facebook advertising in the month to April 25.\n\n\n\n\n\nBut paid posts comparing the stances of candidates on banning gambling advertising have targeted three key electorates: Gilmore in New South Wales, Brisbane in Queensland, and Deakin in Victoria.\n\n\n\n\n\nThe anti-gambling alliance is also ramping up spending in the Greens-held seat of Brisbane, which Labor and the Liberals are trying to win.\n\n\n\n\n\n.\n\n\n\n\n\nA Sydney-based music festival has been confirmed as the second site of a year-long pill testing trial in New South Wales.\n\n\n\n\n\nThe Midnight Mafia event at the Sydney Showground will host the free and anonymous drug-checking service this weekend, which allows patrons to bring a small sample of substances they intend to consume for analysis.\n\n\n\n\n\nOpponents of pill testing say the service sends mixed messages about the risks of using and possessing illicit drugs, while advocates say pill testing is a proven harm minimisation strategy used in many countries for decades.\n\n\n\n\n\nHealth Minister Ryan Park has called it a crucial health intervention.\n\n\n\n\n\n\"This is not a green light for people to necessarily go and use drugs. You'll never have me standing up here and say it is safe to do so. I never will. What we are saying - what we are saying - is that we know young people use illicit drugs. We want to see whether this type of testing gives them a final chance to make a difference, to take a different path, to take a different course of action.\"\n\n\n\n\n\n.\n\n\n\n\n\nUkraine's President Volodymyr Zelensky has branded a three-day truce announced by his Russian counterpart Vladimir Putin as an attempt at manipulation.\n\n\n\n\n\n\n\n\n\nPutin ordered the ceasefire to coincide with Moscow's World War II commemorations, which will mark the 80th anniversary of the victory of the Soviet Union and its allies in 1945.\n\n\n\n\n\nBut Ukraine says that it wants an immediate truce with Russia for at least 30 days.\n\n\n\n\n\nThe President has said in his nightly address that that kind of ceasefire would provide a real chance for diplomatic efforts to end the war.\n\n\n\n\n\n\"We value human lives, not parades. That is why we believe — the world believes — that there is no reason to wait until May 8. The fire must be stopped not just for a few days, only to resume killing afterward. An immediate, complete, and unconditional ceasefire, for at least 30 days to ensure it is guaranteed and reliable, is what can provide the foundation for real diplomacy.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe cause of a mass outage across Spain and Portugal remains unclear, hours after the power cut brought public transport and other key services to a halt.\n\n\n\n\n\nPortuguese Prime Minister Luis Montenegro says there is no indication a cyberattack is the reason for the outage, which are rare in Europe on such a scale.\n\n\n\n\n\nPortugal has suggested however that the issue originated in Spain, while Spain has pointed the finger at a break-up in its connection to France.\n\n\n\n\n\nSpanish Prime Minister Pedro Sanchez says an investigation is underway that he is confident will pinpoint the cause.\n\n\n\n\n\n\"It is better not to speculate. We will know the causes later. We are not ruling out any hypotheses. But for now we must focus on the most important thing, which is restoring electricity to our homes.\"\n\n\n\n\n\n.\n\n\n\n\n\nTo sport,\n\n\n\n\n\nChelsea coach Sonia Bompastor says there's still no return date set for Sam Kerr.\n\n\n\n\n\nThe West Australian has been out of action since suffering an anterior cruciate ligament injury during warm weather training in early January 2024.\n\n\n\n\n\nKerr has been included on Chelsea's Champions League roster in the hope she would be able to play a part in their campaign, but she was never fit enough to even be named in a matchday squad prior to the English club's exit at the hands of Barcelona at the weekend.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-albanese-cements-lead-over-dutton-as-preferred-pm-polling-finds-labor-favoured-by-voters-20250429-p5lv8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Australian inflation figures higher than expected; more than four million Australians have voted",
        "publish_date": "Wed, 30 Apr 2025 12:00:49 +1000",
        "category": "finance",
        "authors": [
            "Sarah Mcphee",
            "Olivia Ireland",
            "Josefine Ganko"
        ],
        "text": "All-important inflation figures have come in a little higher than expected, potentially throwing a spanner into Reserve Bank expectations of an interest rate cut next month.\n\nIn the March quarter, prices rose by a higher-than-expected 0.9 per cent, with the annual rate steady at 2.4 per cent.\n\nThe trimmed mean inflation rate is at its lowest level since the December quarter of 2021, and fell by 0.4 percentage points over the past three months.\n\nServices inflation fell to 3.7 per cent, its lowest level since June 2022.\n\nThe annual inflation rate for insurance, for instance, fell to 7.6 per cent after hitting 16.4 per cent a year ago. Rents inflation also eased, edging down to 5.5 per cent after being at 7.8 per cent in the March quarter of last year.\n\nFood prices were up 1.2 per cent in the quarter, housing lifted by 1.7 per cent, while there was a large 5.2 per cent jump in education.\n\nThe key measures of underlying inflation were 0.7 per cent, in line with the Reserve Bank’s own forecasts, with the trimmed mean at 2.9 per cent and the weighted median at 3 per cent.\n\nThe biggest factor in today’s figures has been the end of an electricity subsidy in Queensland.\n\nNationally, power prices jumped by 16.3 per cent in the quarter. Without the end of Queensland’s $1000 subsidy, electricity prices would have lifted by 0.4 per cent.\n\nIt meant Brisbane’s inflation rate jumped 1.9 per cent to 2.7 per cent for the year. Inflation in Sydney and Melbourne is at 2.3 per cent, while it is now at 1.4 per cent in Hobart and 1.7 per cent in Darwin.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/erin-patterson-trial-live-updates-day-one-mushroom-leongatha-don-gail-ian-heather-20250429-p5lv58.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson trial LIVE updates: Alleged Leongatha mushroom cook’s relationship with ex-husband, in-laws examined in opening statements",
        "publish_date": "Wed, 30 Apr 2025 11:59:51 +1000",
        "category": "finance",
        "authors": [
            "Marta Pascual Juanola",
            "Erin Pearson"
        ],
        "text": "The court heard that Simon Patterson first noticed a change in his relationship with Erin in 2022.\n\nOn one occasion, when he was dropping the children off, Erin expressed concern that he had listed himself as “separated” in his tax return.\n\nSimon offered to change that, the court heard, but Erin told him she would expect child support.\n\n“Issues arose concerning the payment of child support, including whether Simon should make additional payments outside of child support for expenses such as school fees,” Rogers said.\n\nLater, at the start of term three in 2023, Erin Patterson changed her children’s school without consulting Simon.\n\nThree or four weeks before the deadly lunch, Erin Patterson told her in-laws Don and Gail that she had a lump in her elbow that required testing, and she had an appointment at St Vincent’s Hospital on 28 June 2023, Rogers said.\n\nThe day of the appointment, Gail texted Erin to ask how the appointment had gone. The following day, Erin responded that the appointment went well. She told Gail she had had a biopsy done, and she would be returning to hospital for an MRI.\n\n“The accused later responded that there was a bit to digest with everything that’s come out, and that she might talk more about it with them in person,” Rogers said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/purcell-ban-shows-how-much-grey-exists-between-the-black-and-white-of-tennis-20250430-p5lva9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Purcell ban shows how much grey exists between the black and white of tennis",
        "publish_date": "Wed, 30 Apr 2025 11:57:25 +1000",
        "category": "sports",
        "authors": [
            "John Millman"
        ],
        "text": "Tennis players can no longer have faith in the systems that are meant to protect them – that much is clear after Australian tennis player Max Purcell was given an 18-month ban for an over-the-limit intravenous infusion.\n\nPlayers want a fair sport, they want an equal sport, but when Jannik Sinner receives a three-month ban for having a prohibited substance in his system, and Max is banned for six times that length, it’s hard not to believe the system has failed its players.\n\nAustralian tennis player Max Purcell. Credit: Getty Images\n\nI was one of Jannik’s biggest and most vocal supporters, and I still am. I believe that doping incidents need to be looked at on a case-by-case basis, and I agreed with WADA’s ruling that the tiny amount in Jannik’s system was neither performance-enhancing nor intentional.\n\nBut I have to stick up for Max. It’s hard not to think there has been some kind of preferential treatment for someone like Jannik or Iga Swiatek – another former world No. 1 player – who have comparatively gotten off lightly for having banned substances in their systems.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/cherry-evans-to-the-roosters-is-on-the-cards-phil-gould-thinks-it-s-a-bad-idea-20250430-p5lvc6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cherry-Evans to the Roosters is on the cards. Phil Gould thinks it’s a bad idea",
        "publish_date": "Wed, 30 Apr 2025 11:53:05 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Phil Gould believes the Roosters would be making a mistake in signing Daly Cherry-Evans, believing the veteran halfback’s arrival could upset the development of the promising halves already on the club’s books.\n\nCherry-Evans is yet to declare where his future lies after informing the Sea Eagles he will be leaving Brookvale at the end of the season. The Maroons captain has been linked to a move to the Roosters.\n\nThe Tricolours have play-making depth in the form of Sam Walker, Sandon Smith, Hugo Savala, Chad Townsend and promising youngster Toby Rodwell.\n\nSmith’s stocks are on the rise after several eye-catching performances, most notably after earning the Ashton-Collier Medal as player of the match in his side’s Anzac Day win against the Dragons.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/list-popes-of-the-20th-and-21st-centuries-20130314-2g1lh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "List: Popes of the 20th and 21st centuries",
        "publish_date": "Wed, 30 Apr 2025 11:51:48 +1000",
        "category": "finance",
        "authors": [],
        "text": "List: Popes of the 20th and 21st centuries\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/jumping-out-of-their-skins-joy-for-african-choir-over-visa-backflip-20250429-p5lv5j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Jumping out of their skins’: Joy for African choir over visa backflip",
        "publish_date": "Wed, 30 Apr 2025 11:51:20 +1000",
        "category": "entertainment",
        "authors": [
            "Nick Galvin"
        ],
        "text": "A group of young performers from Uganda and Kenya will tour Australia after all, following an 11th-hour backflip from the Department of Home Affairs to issue visas that had previously been denied.\n\nThe U-turn came just three days before the group of 14 singers, dancers and instrumentalists were due to leave Africa on a tour that will take them to more than 21 venues along Australia’s east coast.\n\nUgandan singer Faith Nassande is one of the choir members finally granted a visa to travel to Australia.\n\nThe Ubuntu Africa Tour is the sixth such tour organised by KwaYa Australia, a Gold Coast-based not-for-profit group that arranges cultural exchanges and relief efforts. Three months ago, KwaYa applied for temporary visas for the performers, aged in their early to mid-20s, as well as their adult tour leaders.\n\nKwaYa president Marsha Gusti was left heartbroken when the department rejected all the young adults’ visa applications, only giving the green light to the two older members of the touring party. She said that, among the reasons given by DHA in emailed responses for each of the refusals, were that they were not convinced the performers were “genuine entertainers” and that because they had not previously visited Australia, there was no evidence that they had complied with a previous visa.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/beauty/my-wife-is-going-to-hate-it-what-has-george-clooney-done-to-his-hair-20250428-p5lut9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘My wife is going to hate it’: What has George Clooney done to his hair?",
        "publish_date": "Wed, 30 Apr 2025 11:50:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "No one serves the salt-and-pepper look quite like George Clooney. Since he started going grey in the 1990s, the actor quickly became one of the world’s favourite “silver foxes”. But after dyeing his hair black recently for a role on Broadway, no one seemed more put off by it than he.\n\n“My wife is going to hate it because nothing makes you look older than when an older guy dyes his hair,” the Good Night, and Good Luck star told The New York Times in February.\n\nGeorge Clooney hates his dyed hair. Should more men embrace their grey locks too? Credit: AP/Supplied\n\nOther Hollywood celebrities are similarly smitten with their silver fox status, including Steve Carell, Patrick Dempsey and Hugh Grant. Locally, there’s Eric Bana, rugby coach Ivan Cleary and Ben Mendelsohn, who’s currently showing off his salt-and-pepper mane in season two of Andor.\n\nIf the likes of Clooney and Mendelsohn are championing their naturally greying hair, should other men follow suit and ditch the dye?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/the-12-year-old-aussie-who-s-named-after-novak-djokovic-and-has-alex-de-minaur-on-speed-dial-20250429-p5lv2s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 12-year-old Aussie who’s named after Novak Djokovic and has Alex de Minaur on speed dial",
        "publish_date": "Wed, 30 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "Novak Palombo’s parents did not have plans for world domination when they named their son after a grand slam tennis legend.\n\nHis mother, Ana Marinkovic, was born in Serbia, and she and her husband, Steven Palombo, wanted to give their son a name that honoured his heritage, so Novak Djokovic seemed as good a choice as anyone.\n\nMelbourne’s Novak Palombo is the top-ranked 12-year-old tennis player in the world. Credit: Luis Enrique Ascui\n\nThat decision has proven prophetic, with Palombo – who lives in Melbourne and trains at Melbourne Park most days – now the best 12-year-old tennis player on the planet.\n\n“We loved the name, and Novak [Djokovic] has been an inspiration to a lot of kids and people around the world,” Steven said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-queensland-s-best-and-bravest-to-receive-medals-20250429-p5lv3l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Brooki Bakehouse owner accused of stealing recipes | Queensland’s best and bravest to receive medals",
        "publish_date": "Wed, 30 Apr 2025 11:42:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "RecipeTin Eats founder Nagi Maehashi has accused Bake With Brooki author Brooke Bellamy of stealing recipes from her and other unnamed authors, claiming the similarities with two of her own recipes “are so specific and detailed that calling these a coincidence feels disingenuous”.\n\nBrooke Saward, the owner of Fortitude Valley’s viral sensation Brooki Bakehouse. Credit: Brooke Saward\n\nBake With Brooki by Bellamy – owner of Brooki Bakehouse in Brisbane – was published by Penguin in October last year and retails for $49.99.\n\nThe RecipeTin Eats recipes at issue are for caramel slice and baklava, and Maehashi has posted on Instagram side-by-side pictures of these two recipes from the two books. Penguin has denied the allegations.\n\nLoading\n\nBellamy strenuously denied the claims in a story on her Instagram. “I did not plagiarise any recipes in my book which consists of 100 recipes I have created over many years,” she wrote.\n\nIn the post Bellamy says she “immediately offered to remove both recipes from future reprints to prevent further aggravation”.\n\nHere’s the full story.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/concern-over-school-students-using-nicotine-pouches-20250430-p5lvda.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Concern over school students using nicotine pouches",
        "publish_date": "Wed, 30 Apr 2025 11:40:34 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Concern over school students using nicotine pouches\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/no-excuses-next-wallabies-coach-says-14-month-lead-in-to-2027-world-cup-will-be-enough-20250430-p5lv9u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘No excuses’: Next Wallabies coach says 14-month lead in to 2027 World Cup will be enough",
        "publish_date": "Wed, 30 Apr 2025 11:34:57 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Incoming Wallabies coach Les Kiss says he won’t join the national team until his contract begins in the middle of next year and believes a 14-month runway is enough time for him to get Australia ready for a home World Cup in 2027.\n\nIt comes as incumbent coach Joe Schmidt threw his full support behind Kiss, saying continuity in style and philosophy would benefit the Wallabies in the coming years.\n\nAs revealed by this masthead on Tuesday, Rugby Australia has convinced Schmidt to extend his stint as Wallabies coach from October this year - he was supposed to finish at the end of the Rugby Championship - to July next year.\n\nKiss, the current Queensland Reds coach and a former assistant under Schmidt with Ireland, will take over in July 2026 on a deal through to the end of 2028.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/the-next-djokovic-aussie-named-after-novak-taking-tennis-world-by-storm-20250430-p5lvd0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The next Djokovic? Aussie named after Novak taking tennis world by storm",
        "publish_date": "Wed, 30 Apr 2025 11:31:49 +1000",
        "category": "sports",
        "authors": [],
        "text": "The next Djokovic? Aussie named after Novak taking tennis world by storm\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/why-i-m-boycotting-the-democracy-sausage-and-you-should-too-20250429-p5lv5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why I’m boycotting the democracy sausage (and you should too)",
        "publish_date": "Wed, 30 Apr 2025 11:30:00 +1000",
        "category": "entertainment",
        "authors": [
            "Mali Waugh"
        ],
        "text": "When I was studying for my bachelor of arts (back when people willingly went into debt to become experts on Jacobean literature), I was pretty opinionated. I loved getting into political discussions with anyone who’d engage. This mainly involved regurgitating the content of newspaper commentary pages to my grandparents and quoting articles about the failures of mutual obligations policies to creeps with darting eyes on public transport (the joke is on you, eccentrically dressed man who just wanted to sit near a human female).\n\nThis election day, every politician in the country will be filmed gnawing on some unidentified meat in limp white bread.\n\nSince I’ve had kids and life experience, I’ve left hyper-engagement behind, choosing instead to cultivate a world-weariness that matches my character-actor face. Humanity keeps pumping out novel cruelties and down in the “anus of the world” (as Jerry Seinfeld once said) we are prisoners to inertia. It is dispiriting to care too much. These days, I only pay attention when I have to vote. The entry-level Australian democratic experience – standing in line, quietly mocking the independent who’s a little too into “commonsense gun ownership”, and eventually casting your vote – is also where the democracy sausage rears its ugly, sausagey head. I hate them, and I want you to hate them too.\n\nBefore I go too deep, I should declare a potential conflict of interest: my parents – relics of the original hippy era – raised my siblings and me as vegetarians. At school, I had to bring my foil-wrapped vegetarian sausages on sausage sizzle days. The idea of sausages being remotely celebratory, given their link to a very ’90s brand of exclusionary regional Australia, has never sat quite right. But honestly, even without that particular trauma, I’d still hate them. I get that to some, the democracy sausage (democrausage?) is a quintessentially Australian tradition – but to me, it’s inauthentic, low-key jingoistic, and flat-out gross.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/hear-that-it-s-the-sound-of-live-music-dying-for-local-australian-artists-20250429-p5lv5t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hear that? It’s the sound of live music dying for local Australian artists",
        "publish_date": "Wed, 30 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Athanasia Sakoutis"
        ],
        "text": "When the offer came through for me to support a legendary international act on its Australian tour, I cried. It was the kind of moment emerging artists like me dream about: a national stage, exposure, and the chance for my music to truly be heard. In our industry, being a support act or landing a festival slot is often the only way to get traction and gain credibility.\n\nBut once the adrenaline wore off, reality hit. I’d be joining them across Australia entirely out of pocket with no support for travel, food, accommodation or even equipment. And to be clear, this wasn’t a small indie band pulling together a DIY tour, this was a huge international act.\n\nAthanasia Sakoutis performing in Coogee.\n\nSuddenly, I was weighing the difficult choice of investing thousands of dollars into a career opportunity I could not afford or decline and miss the moment I’d spent years working towards. When asking around, most people said the same thing: “that’s just the price you pay to be an artist”. Spoiler alert, I declined this opportunity – unsure if I’d ever be offered something like it again.\n\nIt’s not revolutionary to say, making it in the music industry has always been hard. That’s why the words “struggling” and “artist” are so often paired. But at what point does the struggle become unsustainable?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/breakthrough-documents-rise-of-womens-origin-20250430-p5lvcx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Breakthrough' documents rise of women's Origin",
        "publish_date": "Wed, 30 Apr 2025 11:23:15 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Breakthrough' documents rise of women's Origin\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/dembele-rocks-arsenal-early-20250430-p5lv97.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dembele rocks Arsenal early",
        "publish_date": "Wed, 30 Apr 2025 11:18:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Dembele rocks Arsenal early\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]