[
  {
    "url": "https://www.9news.com.au/national/hellyer-gold-mines-issued-cease-work-notice-chief-executive-graham-cox-response/73553e2c-a811-48bb-b816-da564e7c7744",
    "title": "'Madness': Mining boss issues blistering message after gold mine closure",
    "publish_date": "Thu, 13 Nov 2025 00:30:10 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A﻿ Tasmanian gold mining boss has issued a blistering message to the state government after being ordered to shut down operations over unpaid debts.\n\nHellyer Gold Mine was issued a cease work notice by the state's Resources Minister Felix Ellis earlier this week with $1 million in royalties still owing to the government.\n\nThe mine ﻿– which employs around 70 workers – has been accused of not meeting its financial obligations to the government, suppliers and contractors in the region.\n\nHellyer Gold Mine CEO Graham Cox pictured with a worker. (Supplied)\n\nHowever, owners claim its employees have been \"unfairly punished\".\n\nChief executive Graham﻿ Cox blasted the decision as \"reckless, unncecessary and completely at odds with the state's claims of being open for business\".\n\n\"This is an act of bureaucratic overreach that puts hardworking Tasmanians out of jobs and jeopardises a world-class, Australian-owned business that has worked hard to meet every obligation placed before it,\" Cox said.\n\n\"We have acted transparently, responsibly and in full cooperation with the Tasmanian government.\n\n\"To shut down a compliant, productive and environmentally responsible operation without warning is madness.\"\n\nHellyer was reopened on Tasmania's west coast a little over a year ago after being closed for more than a decade.\n\nCox claims the mining company has been transparent ﻿and has paid back \"significant\" royalties and taxes owed to the government by former owners, including $8.6 million in Royalties and Environmental Bond.\n\nHellyer was re-opened inn Tasmania's west coast a little over a year ago. (Supplied)\n\nHowever, the minister said Hellyer still owes around $1 million.\n\n\"When a company extracts and sells a Crown-owned mineral, it must meet its obligations,\" Ellis said.\n\n\"Hellyer has fallen significantly behind in paying their debts due to the crown and other compliance issues have continued to escalate.\n\n\"This action is necessary to prevent those matters worsening.\"\n\nEllis also alleges there has been a \"range\" of non-compliance issues at Hellyer, which he said the leadership team have been given a chance to address.\n\n\"We've given them multiple opportunities over an extended period of time to rectify these issues,\" he added.\n\n\"Mining operations may only resume once the company has substantively addressed its non-compliances.\"\n\nMineral Resources Tasmania (MRT) has confirmed Hellyer's authority to mine under the Mineral Resources Development Act 1995 has been revoked.\n\nEllis said he has been \"deeply disappointed\" ﻿with Hellyer's leadership.\n\n\"We've been working with them, the ownership and the mine, for more than a year to try and get them back into compliance,\" he told the ABC.\n\n\"They've failed to do so.\n\n\"It's important that mining companies are paying their way, [that] they're paying their bills.\"\n\nCox, however, remains steadfast that Hellyer has been \"blindsided\" by the decision.\n\n\"Seventy Tasmanians and their families have been blindsided by this decision, people who should be preparing for Christmas are now wondering how they'll afford it,\" he added.\n\n\"We have paid our dues, we have done everything asked of us and yet we've been shut down without warning or reason.\"\n\nTasmania's Industry and Resources Minister Felix Ellis. (Facebook)\n\nREAD MORE: Storms to hammer Australia from top of NT to bottom of SA ﻿\n\nThe mining boss is now calling on Premier Jeremy Rockliff to intervene.﻿\n\n\"Tasmania's economy depends on strong industries like mining, agriculture and energy,\" Cox said.\n\n\"If responsible businesses can be treated like this, the entire state's investment reputation is at stake.\"\n\nHellyer has been closed during a significant gold price boom in Australia.\n\n﻿The price of gold has recently surged to astronomical highs, reaching $6755 for an ounce last month.\n\nMuch of gold's rise has been attributed to its status as a safe-haven asset.\n\nThere is a large proportion of goldfields in Tasmania.﻿\n\nBeaconsfield Gold Mine, one of the biggest gold mines in the country, is located in northern Tasmania.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/safety-concerns-for-children-over-dimethoate-pesticide-used-on-berries/41af29fa-4885-4b8f-9ee4-e4beeaa186f9",
    "title": "Watchdog flags safety concerns for children over pesticide sprayed on berries",
    "publish_date": "Thu, 13 Nov 2025 00:19:46 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Australia's pesticide regulator has flagged fresh health concerns for young children over a chemical sprayed on berries.\n\nWith their high nutritional content, raspberries, blueberries and blackberries have become a favourite for families as part of healthier diets.\n\nBut the Australian Pesticides and Veterinary Medicines Authority (APVMA) says existing regulations over using dimethoate - an insecticide widely used to stop berries being spoiled by fruit fly - need strengthening to keep people safe.\n\nREAD MORE: Storms to hammer Australia from top of NT to bottom of SA\n\nBlueberries have become a regular part of the weekly shopping for many Australians. (Getty)\n\nIn a decision announced this week, the national watchdog said children aged between two and six years old who ate berries treated with dimethoate within seven days or less of harvest risked exposure of the chemical beyond safe limits.\n\nThe APVMA ruled fruit growers must now wait at least 14 days after applying the pesticide before harvesting to give it more time to degrade.\n\nIt said existing label directions needed altering to ensure dimethoate's use on berries did not present \"an undue hazard to people\".\n\nUntil now, growers had to wait one day after spraying blueberries and seven days following the treatment of raspberries and blackberries.﻿\n\nEarlier this year, the APVMA began reviewing potential health hazards from dimethoate amid the growing popularity of berries.\n\nData from Food Standards Australia and New Zealand showed Australians' consumption of blueberries, blackberries and raspberries has jumped since the last review of the pesticide in 2017.\n\nHealth concerns over ﻿dimethoate resulted in European Union countries banning the chemical in 2019.\n\nIndustry body Berries Australia told 9news.com.au that figures it collected over the past five years showed ﻿dimethoate usage had fallen.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/popular-childrens-product-sold-nationally-recalled-due-to-absestos-fears/bc246b2d-0541-4daf-a908-78c515a407a0",
    "title": "Popular children's product sold nationally recalled due to asbestos fears",
    "publish_date": "Wed, 12 Nov 2025 12:30:00 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "A range of brightly coloured children's sand products have been recalled due to asbestos fears.\n\nThe recall was issued by the supplier, Educational Colours, for three products which were sold throughout Australia at Officeworks, Educating Kids, Modern Teaching Aids and Zart Art between 2020 and 2025.\n\nThe products are labelled as Kadink Sand (1.3kg), Educational Colours - Rainbow Sand (1.3kg), and Creatistics - Coloured Sand (1kg).\n\nA range of brightly coloured children's sand products have been recalled due to asbestos fears. (ACCC)\n\nThe Australian Competition and Consumer Commission (ACCC) said the products were recalled because they may contain tremolite asbestos, a naturally occurring asbestos, which was detected in some samples after laboratory testing.\n\n\"The ACCC will continue to monitor developments in relation to the products and the recall notice may be updated as new information emerges,\" the watchdog said in a statement.\n\nAsbestos is a prohibited substance in Australia.\n\nThe recall was issued by the supplier Educational Colours. (ACCC)\n\n\"We have engaged with Officeworks, who is a major supplier of these products, and they advised that the products have been removed from sale. We expect they will take all the necessary steps to alert their customers,\" ACCC deputy chair Catriona Lowe said.\n\n\"We continue to engage with suppliers and expect all to provide appropriate support to consumers including responding to queries, and providing advice about arranging a refund.\n\n\"We urge customers who own any of the products to stop using them immediately and place the sand in a heavy-duty plastic bag and double tape it securely and keep it out of reach of children.\n\nCustomers are urged not to dispose of the product in general waste. (ACCC)\n\n\"When doing so, in an abundance of caution, customers should take precautions such as a wearing disposable gloves and a mask.\"\n\nCustomers are urged not to dispose of the product in general waste.\n\nInformation on the disposal of Asbestos waste, including disposal facilities in your state or territory can be found on The Asbestos and Silica Safety and Eradication Agency website.\n\nContact recalls@educationalvantage.com on disposal and for seeking a full refund.\n\nA voluntary recall was also issued in New Zealand today for the same products.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/urgent-call-to-ban-trans-fats-australian-food-supermarkets/093b4393-81a9-4ebd-9a9e-4b5016d5a70c",
    "title": "'Dangerous' ingredient lurking in food on Aussie supermarket shelves",
    "publish_date": "Wed, 12 Nov 2025 01:13:55 +0000",
    "category": "lifestyle",
    "authors": [
      "Nov"
    ],
    "text": "Researchers are calling for a ban on ﻿\"dangerous\" ingredient lurking in thousands of food products available at Australian supermarkets.\n\nAnd consumers have no way of knowing.\n\nNew research has revealed ﻿industrial trans fats in food could be putting Australians at increased risk of heart disease.\n\nREAD MORE: Money troubles push more and more Aussies into side hustles\n\nA 'dangerous' ingredient is lurking in food on Aussie supermarket shelves, according to research. (Getty)\n\nIndustrial trans fats are ﻿created by turning liquid vegetable oils into solid fats.\n\nThey're commonly found in ﻿cheap, fried and ultra-processed foods and can significantly raise the risk of heart attack, stroke, and premature death, even in small amounts.\n\nResearchers at The George Institute for Global Health﻿ analysed 28,000 packaged foods and drinks from major supermarket chains including Woolworths, Coles, Aldi, IGA, and Harris Farm.\n\nThey found that only four products explicitly listed partially hydrogenated oils, which are the main source of industrial trans fats.\n\nMore than 4200 products included ingredients like ﻿vegetable oils without disclosing the inclusion of industrial trans fats.\n\nREAD MORE: Russia fights for land back or compo in High Court feud\n\nMore than 500 products ﻿potentially contained industrial trans fats and voluntarily reported trans fat content.\n\nBut 181 of those ﻿exceeded the World Health Organisation's (WHO) recommended limit of total fat to reduce the risk of heart disease.\n\nMore than 30 per cent of the products that only contained potential industrial trans fats also exceeded the limit.\n\n\"This study shows that dangerous trans fats are still lurking in our food supply – and consumers have no way of knowing,\" lead author and Research Fellow at The George Institute Dr Damian Maganja said.\n\n\"Australian labelling laws don't require companies to state whether oils are partially hydrogenated or list trans fat content – making it almost impossible to assess how widespread the issue really is.\"\n\nCardiovascular disease is already the leading cause of death in Australia and hidden industrial trans fats could be making the issue worse.\n\nREAD MORE: UK halts intelligence sharing with US over drug boat attacks\n\nCardiovascular disease is already the leading cause of death in Australia. (Getty)\n\nNations around the world have started limiting industrial trans fats in food settings, including Canada, Denmark, France, Germany, Sweden, and the UK.﻿\n\nThe EU also introduced a mandatory 2 per cent limit on trans fats in food products.\n\nBut Australia doesn't currently ﻿have any mandatory regulation limiting industrial trans fats in food.\n\nResearchers are now calling on federal and state governments to ban industrial trans fats for the good of the nation.﻿\n\n\"Without regulation, Australia risks becoming a dumping ground for unhealthy products that increasingly can't be sold elsewhere,\" said Dr Maganja.\n\n\"To truly protect public health, we need mandatory regulation.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/peter-gordon-returns-to-wittenoom-for-banjima-asbestos-case/105985052",
    "title": "Top lawyer returns to unfinished business in Wittenoom asbestos saga",
    "publish_date": "Thu, 13 Nov 2025 00:52:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Few people have a resume that rivals Melbourne litigator Peter Gordon.\n\nAboriginal and Torres Strait Islander readers are advised this article includes the name and image of an Indigenous person who has died.\n\nOne of the country's most prolific lawyers, his firm Gordon Legal has just finalised what could be the biggest class-action settlement in Australian history — the robodebt scandal.\n\nBut a case he picked up 40 years ago in the rugged bushland of Western Australia stands out above the rest.\n\n\"I look back on this as being a defining moment for occupational health and safety standards in Australia,\" Mr Gordon said.\n\n\"Because it truly was Dickensian in the worst sense of the word.\"\n\nPeter Gordon has returned to the Wittenoom case, 40 years after he first came to it. (ABC News: Patrick Rocca)\n\nBlue asbestos mined between the late 1930s and mid-1960s in the remote Pilbara town of Wittenoom, 1,400 kilometres north-east of Perth, exposed thousands of people to dangerous asbestos fibres.\n\nThose fibres can cause mesothelioma, a rare but deadly form of cancer affecting the lining of the lungs.\n\nThe mine has been linked to more than 2,000 deaths and, given mesothelioma can take decades to develop, that figure will rise.\n\nThe making of a young Peter Gordon\n\nIn 1987, a 30-year-old Peter was introduced to Wittenoom.\n\nTwo years earlier he had won the first mesothelioma negligence case in Australia, drawing the attention of fellow-lawyer John Gordon, who was preparing to represent Wittenoom worker Wally Simpson.\n\nJohn and Peter Gordon first travelled to Wittenoom in 1987. (ABC News: Patrick Rocca)\n\nThe two unrelated Gordons teamed up and flew to Wittenoom to gather evidence for Mr Simpson's case.\n\nA locked gate prevented them from accessing what remained of the closed mine.\n\n\"And I thought the only way to solve that problem was to break in,\" Peter said.\n\nPeter Gordon took this photo of John Gordon in 1987, after they broke into Wittenoom mine site. (Supplied: Peter Gordon)\n\nWith no masks or protective equipment, the two lawyers and a professional photographer gathered what would later become crucial evidence of the mine's working conditions and dangerous levels of asbestos dust.\n\n\"It was a really dangerous thing to do,\" Peter said.\n\n\"Forty years later, I haven't got mesothelioma, but people have got it for much less exposure than that.\"\n\nThe trespass began what Peter describes as a years-long \"war\" with the Colonial Sugar Refining (CSR) company, which owned Wittenoom's mining operations from the early 1940s.\n\nPeter Gordon (second from right) was 30 years old when he first came to Wittenoom. (Supplied: Peter Gordon)\n\nIt is a war he thought ended in 1988, when CSR lost a major compensation case brought by German-born Wittenoom worker and mesothelioma victim Klaus Rabenalt.\n\nFor the first time in an Australian industrial negligence case, a company was forced not only to compensate a worker, but to pay extra damages as punishment for its behaviour.\n\n\"It was one of those sort of movie moments … there was pandemonium in the courtroom,\" Peter said.\n\nBut the story was far from over.\n\nUnfinished business\n\nThe impact of the Wittenoom disaster on the area's traditional owners has, until recent years, flown under the radar.\n\nBut the Banjima people continue to suffer almost 60 years after the mine's closure.\n\nMore than 3 million tonnes of deadly mining waste remain nestled in the gorges surrounding Wittenoom. (Supplied: Dale Hawkins)\n\nMore than 3 million tonnes of mining waste laced with blue asbestos fibres is yet to be cleaned up.\n\nWittenoom now sits within a 46,000-hectare exclusion zone, preventing the Banjima people from accessing part of their traditional land.\n\nDespite years of lobbying from the Banjima Native Title Aboriginal Corporation (BNTAC), the WA government is yet to commit to a full remediation of the site.\n\nIn 2023, Banjima elders gave the BNTAC board permission to prepare for litigation to force the government to act.\n\nPeter soon got a call from BNTAC chief executive Ed Armstrong.\n\n\"I was of course delighted to help and felt an obligation to help,\" he said.\n\n\" The Banjima people have the highest per capita incidence of mesothelioma in the world. \"\n\nLegal fight moving closer\n\nIn September, Peter and Banjima representatives sat face-to-face with West Australian Premier Roger Cook.\n\nThey laid out a detailed proposal, informed by expert analysis, for the remediation of the contaminated zone.\n\nThey also came with a warning — if the government did not agree to take substantive action before the end of the year, they would take the matter to court.\n\nThe campaign to clean up Wittenoom is the subject of a new documentary, Yurlu Country, featuring the late Banjima elder Maitland Parker (pictured). (Supplied: Illuminate Films)\n\n\"We can't wait forever,\" Peter said.\n\n\"The Banjima people are entitled not to have a cheap and nasty solution to this.\n\n\"If it costs billions of dollars to do, then so be it.\n\n\"That's the [government's] obligation.\"\n\nPeter said he believed the premier wanted to do the right thing by the Banjima people.\n\n\"Sometimes you can look into the eyes of someone and believe they've got goodness in their heart,\" he said.\n\n\"And that's the impression I formed of him.\"\n\nWA Premier Roger Cook has called Wittenoom a \"tragedy on a massive scale\". (ABC News: Courtney Withers)\n\nIn public statements since the Banjima meeting, the premier has acknowledged the situation.\n\n\"Wittenoom is a tragedy on a massive scale,\" he told reporters earlier this month.\n\n\"[Banjima] put to us a rather ambitious proposal — we've asked our teams to look at that and see how we might help out.\"\n\nTo right a wrong\n\nPeter said he hoped the premier would recognise that Wittenoom did not have to be a burden for his government.\n\n\"This is a responsibility but it's also a privilege; it's a privilege to have the opportunity to right a wrong,\" he said.\n\n\"I've had the privilege of acting in a large number of very big and important cases … but I don't think there's been a more important one than this.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/oscar-piastri-f1-beyond-the-grid-mclaren-team-orders-buku-gp/106004458",
    "title": "McLaren orders part of 'perfect storm' that began Piastri's F1 form slump",
    "publish_date": "Thu, 13 Nov 2025 00:45:12 +0000",
    "category": "sports",
    "authors": [],
    "text": "Oscar Piastri has described his Azerbaijan Grand Prix weekend, where he committed a false start and crashed on the first lap, as \"the worst weekend I've ever had in racing\".\n\nSpeaking on F1's Beyond The Grid Podcast released Thursday morning (AEDT) after being recorded before last weekend's São Paulo Grand Prix, Piastri also suggested several factors, including McLaren's team orders from the previous race, may have contributed to it.\n\nIn a wide-ranging interview he spoke about his battle for the drivers' championship, advice he received from manager Mark Webber, and his thoughts on the upcoming Ashes series which begins in Perth next week.\n\nBut one of the more intriguing moments of the hour-long podcast was Piastri discussing his disastrous Azerbaijan Grand Prix and how the lingering effects of the previous weekend were still on his mind.\n\nIn Azerbaijan, Piastri crashed in qualifying, committed a false start in the race, then crashed on the first lap.\n\nAll this happened while the Australian held a 31-point lead in the drivers' championship over Lando Norris.\n\nPiastri hinted that the controversy of the previous round may have played a role in the poor weekend in Baku.\n\nAt Monza, Max Verstappen was a runaway leader while Norris was comfortably second and Piastri a few seconds behind in third.\n\nLate in the race and needing to make a pit stop for both drivers, McLaren made the decision to pit Piastri first and then Norris after.\n\nPiastri's stop was perfect, but an agonisingly slow stop for Norris meant the Australian was able to overtake him with less than 10 laps remaining in the grand prix.\n\nPiastri, who held a season-high 34-point lead in the championship, was ordered by McLaren to hand the position back to Norris.\n\n\"So I don't really get what's changed here, but if you really want me to do it then I'll do it,\" Piastri protested during in the race, before ceding the position.\n\nThat moment trimmed Piastri's lead down to 31 points and became one of the season's most talked-about moments.\n\nIn the aftermath, Piastri said McLaren's decision was fair, but on the Beyond The Grid Podcast the Australian said it was one of many things that he believes contributed to his horror weekend in Baku a fortnight later.\n\nPiastri set for test of 'character' Oscar Piastri will have to show \"character\" after his recent F1 disappointments says his manager, former Australian ace Mark Webber.\n\n\"Ultimately [it's] a combination of quite a few things,\" Piastri said.\n\n\"Obviously the race before that was Monza, which I didn't feel was a particularly great weekend from my own performance, and there was obviously what happened with the pit stops.\n\n\"But then also in Baku itself, Friday was tough, things weren't working. I was overdriving, I wasn't very happy with how I was driving and ultimately probably trying to make up for that a little bit on Saturday.\n\n\"I think there was kind of some things in the lead-up, let's say, that were maybe not the most helpful and then things that happened on the weekend.\n\n\"We had an engine problem in FP1 that kind of unsettled things a bit, and then I was driving not that well. We were on C6 tyres [Pirelli's softest compound] that weekend, which are notoriously tricky to handle. There were just a lot of little things that eventually kind of added up.\n\n\"Baku was the perfect storm of quite a few things which obviously was a pretty terrible weekend.\n\n\"There's no beating around the bush. That's the worst weekend I've had in racing.\"\n\nThe Australian added that his weekend in Baku was also \"useful\", stating that he was able to learn a lot from his experience.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nPiastri has not stood on the podium since that day in Monza, after finishing in the top three 14 times in the 16 grands prix to that point.\n\nHe is also yet to finish ahead of Norris or Verstappen in a grand prix since then.\n\nPiastri was denied the chance to finish on the podium in Brazil after being handed a controversial 10-second penalty for a collision with Mercedes driver Kimi Antonelli, despite several in the paddock believing the Australian was not wholly responsible for the crash.\n\nPiastri is now 24 points behind Norris with three rounds — or three grands prix, one sprint — remaining in the season.\n\nThe margin is Norris's largest lead in the drivers' championship this season.\n\nHe could finish second in all remaining races and win the drivers' championship.\n\nF1 returns to the United States on November 20-22 for the third-last round of the championship.\n\nThe Las Vegas Grand Prix will begin at 3pm AEDT on Sunday, November 22.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/australia-unemployment-rate-october-2025/106004258",
    "title": "Australia's unemployment rate slips to 4.3 per cent",
    "publish_date": "Thu, 13 Nov 2025 00:39:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's unemployment rate declined to 4.3 per cent in October, down from 4.5 per cent in September, in seasonally adjusted terms.\n\nEconomists say it has dashed the chances of any near-term interest rate cut.\n\n\"If there was ever the slightest chance the RBA could have played Santa and delivered a surprise rate cut at its final meeting of the year next month, it was effectively wiped out following today's firm labour market report,\" said BetaShares chief economist David Bassanese.\n\nRBA warns economy in danger of being 'boxed in' to slow growth The central bank's deputy governor says it's \"more plausible\" to wonder whether rates can go much further than to forecast further cuts.\n\nBureau of Statistics data show the number of employed people increased by 42,200 last month, and the number of unemployed fell by 17,000.\n\nBy dropping back to 4.3 per cent, the unemployment rate has returned to the level it was sitting at in June, July, and August, before it popped higher in September.\n\n\"This supports the view that last month's increase was more likely a statistical variation than the start of a labour market downturn,\" BDO chief economist Anders Magnusson said.\n\n\"The October result reflects strong job creation and reducing unemployment in a healthy labour market.\"\n\nThe participation rate remained steady at 67 per cent in October, and the employment-to-population ratio remained at 64 per cent, in seasonally adjusted terms.\n\nThe underemployment rate fell by 0.2 percentage points to 5.7 per cent.\n\nWhat does it mean for interest rates?\n\nFederal Treasurer Jim Chalmers said the decline in the unemployment rate in October was a \"very positive result\".\n\n\"Unemployment is down again, 1.2 million jobs have now been created on our watch, and in the past month alone we saw 55,000 new full time jobs,\" he said.\n\n\"This is a very positive result that shows the progress we've made together on the economy despite difficult global circumstances.\"\n\nRBA holds interest rates in November The Reserve Bank has kept interest rates on hold at 3.6pc after hotter-than-expected inflation in the September quarter squashed hopes of a rate cut.\n\nBut economists say it's clear that there won't be any rate cuts on the RBA's near-term agenda.\n\n\"Today's report will affirm the RBA's view that the labour market and the economy more generally remain relatively \"tight\", limiting its ability to support stronger economic growth though lower interest rates anytime soon,\" Mr Bassanese said.\n\n\"Rates can be cut next year, though it will require strong evidence of an easing in inflationary pressures despite the tight economy, or a greater weakening in the economy than seen to date.\"\n\nLast week, the Reserve Bank released official forecasts projecting that the unemployment rate would stabilise around 4.4 per cent through to the end of next year, which was a slight upward revision from its previous forecast of 4.3 per cent.\n\n\"That view appears broadly consistent with today's figures,\" Mr Magnusson said.\n\nEmployment growth still gradually slowing down\n\nEY chief economist Cherelle Murphy said the RBA had already highlighted that the economy may be close to its supply capacity, which means it could not cut the cash rate much further, if at all, without generating inflation.\n\n\"Recent data showing a surprise uptick in underlying inflation and a continuation of the tight jobs market means there may be no more interest rate cuts in the foreseeable future,\" she said.\n\nHowever, she said it was also clear that the rate of growth in employment had been slowing down over the last two years.\n\nNational property prices rise Australia's property market is seeing rising demand, with a rise in both first home buyers and investors pushing up house prices.\n\n\"Employment growth has slowed to 1.6 per cent in annual terms, likely reflecting an easing in demand for labour in the non-market sector, such as health, education, and general government services from elevated levels,\" she said.\n\nCallam Pickering, Asia Pacific economist at global job site indeed, agreed with that assessment.\n\n\"Australian employment growth has been sluggish this year,\" he said.\n\n\"Even after adding another 42,000 people in October, employment has increased by just 160,000 people over the first 10 months of the year. That compares to a gain of 325,000 people over the same period last year.\n\n\"The main reason for this slowdown has been reduced hiring in health care and social assistance — the industry that drove so much of Australia's post-pandemic job boom.\n\n\"Thus far the private sector, which has been heavily impacted by a challenging economic environment, hasn't been able to fill the gap created by reduced hiring elsewhere,\" he said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/science/2025-11-13/fossil-fuel-emissions-still-rising-in-global-carbon-budget/105996984",
    "title": "Fossil fuel emissions still rising despite renewable energy growth: report",
    "publish_date": "Thu, 13 Nov 2025 00:04:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Global fossil fuel emissions are projected to hit another record high in 2025, according to an annual stocktake of carbon dioxide (CO2) levels.\n\nThat is despite an anticipated drop in overall human-caused emissions thanks to a reduction in practices like deforestation.\n\nThe latest CO2 budget from the Global Carbon Project expects a 1.1 per cent increase in fossil fuel emissions, compared to 2024, driven by continued growth in the use of coal, oil and gas.\n\nThe budget has been released as nations gather in Brazil for the COP30 meeting to discuss ways of reducing emissions.\n\nIf emissions stay on this trend, it could mean the world locks in an average temperature rise greater than 1.5 degrees Celsius compared to pre-industrial levels within four years.\n\nA global target of keeping warming to a 1.5C long-term average would limit the severity of the extreme weather changes that come with every extra 0.1 degrees of heat.\n\nAustralian climate scientist Pep Canadell, who is the executive director of the project and also works at the CSIRO, said year-to-year growth of fossil fuel emissions was a concerning trend.\n\n\"There's now a very urgent requirement of a peak and decline [in CO2 emissions] to really start the climate stabilisation path,\" he said.\n\nPep Canadell is the executive director of the Global Carbon Project and a chief research scientist in CSIRO's environment team. (Supplied: CSIRO)\n\nBut while Dr Canadell said there might be \"doom and gloom\" in the latest figures, there was some good news.\n\nAustralia was recognised in the carbon budget for the first time as one of 35 countries significantly decarbonising, while lifting its economy, and some of the world's biggest CO2 emitters have been hitting major green energy milestones.\n\n\"China might be peaking [its CO2 emissions], this is not a small thing, this is a humungous thing,\" Dr Canadell said.\n\n\"India is participating in the revolution of green energy.\n\n\"We're certainly building towards that infrastructure revolution of low- and no-carbon energy systems.\"\n\nIt's an \"infrastructure revolution\" that Australia is being encouraged to take advantage of to meet growing electricity demand, as some of its politicians argue over the merits of \"net zero\" emissions.\n\nWhat is the Global Carbon Project?\n\nThe Global Carbon Project is an international science effort to understand Earth's carbon cycle.\n\n\"Budgets\" for the three main greenhouse gases — CO2, methane and nitrous oxide — are created by the group to help inform global emissions reduction policies.\n\nThe carbon budget counts up human-produced emissions — such as fossil fuel combustion and deforestation — and then subtracts the amount of CO2 stored in carbon sinks like oceans and forests.\n\nWhat remains from this equation is the CO2 that goes into the atmosphere and contributes to the greenhouse gas effect.\n\nOne of the big takeaways from the 2025 budget is that while fossil fuel emissions are projected to increase, total human-caused CO2 emissions are expected to dip slightly by the end of the year.\n\nThat is because there has been a decline in changes to land use like deforestation, which removes CO2-storing vegetation from a landscape.\n\nBut, despite this decline, the CO2 budget stated the combined effects of a warming climate and deforestation had still turned tropical forests in South-East Asia and parts of South America from sinks of CO2 to sources.\n\nThe finding reinforced the need, according to the budget authors, to halt deforestation to prevent further sink-to-source transitions.\n\nStopping these sorts of transitions can help prevent emissions caused by a \"climate feedback\" — a phenomenon where direct human-caused CO2 emissions change the natural environment to the extent extra emissions are created.\n\nAbout 8 per cent of CO2 emissions to make it into the atmosphere since 1960 have been due to climate feedback, the latest CO2 budget found.\n\nGreen shoots in China and India\n\nWhile fossil fuel emissions are increasing globally, there are positive signs from major emitters like China and India.\n\nDr Canadell said India was bypassing fossil fuels like gas in adopting more renewable energy.\n\nMeanwhile, China's total CO2 emissions appear to have plateaued over the past three years.\n\nFrank Jotzo, a professor of environmental and climate change economics at the Australian National University, said China was pushing the world towards more clean energy.\n\n\"The amount of wind turbine and solar transmission investment in China is staggering … it's well over half of global investment,\" he said.\n\nProfessor Jotzo said countries like Australia should take advantage of the low cost of clean energy equipment.\n\n\"What can we learn from it? Well, deploy, deploy, deploy,\" he said.\n\n\" Solar panels are now so cheap, you might as well use it as a fencing. \"\n\nWhat does net zero mean? The Coalition is debating whether to dump its commitment to the net zero climate target. Here's what that term actually means.\n\nHowever, the United States appears on track to experience a 1.9 per cent increase in emissions compared to 2024.\n\nThat has been attributed to a cold start to the year lifting the demand for heating, which was filled by coal because of high gas prices.\n\nDr Canadell said the emissions story in the US was complex.\n\n\"The current administration has changed some of the legislation that was put in place by the previous one and it will have an effect,\" he said.\n\n\"[But] I don't think that's going to reverse the decarbonisation path that the US has already engaged heavily in the past 15 years.\"\n\nThirty-five countries decreasing emissions and boosting economies\n\nAnother positive out of the CO2 budget is the increase in countries that are considered to be achieving significant decreases in emissions while seeing a lift in their economy over a 10-year period.\n\nAustralia joined what became a list of 35 countries for the first time this CO2 budget, compared to 18 countries in the previous 10-year period (2005‒2014).\n\nProfessor Jotzo said Australia still needed more rapid progress if it was to meet its national emissions reduction targets.\n\nMeanwhile, an analysis by the international energy think tank Ember, also released today, forecasts that 2025 will be the first year without growth for fossil fuel-derived electricity globally.\n\nReport author Nicolas Fulghum, a senior data analyst for Ember, said extraordinary growth in solar generation had enabled clean power sources to increase fast enough to cover all new electricity demand.\n\n\"This resulted in the expected stagnation in fossil generation in 2025,\" he said.\n\n\"Whether fossil generation will fall, or show a minor rise again next year, depends on the speed of demand growth and conditions in 2026 and beyond.\n\n\"Structurally, we are now at the point where clean power is growing fast enough to keep fossil fuels from rising further.\"\n\nBut as global electricity demand rises, thanks to factors like electric vehicle uptake and a need for more data centres, Mr Fulghum said there would need to be a faster build-out of solar and wind power to meet more ambitious climate targets.\n\n\"[This needs to happen] to not only meet, but exceed demand growth consistently and displace existing fossil fuel generation,\" he said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/ceduna-heavy-metal-band-knaw-live-music-regional-sa/105948704",
    "title": "Heavy metal band embarks on 16-hour round trip for 40-minute gig",
    "publish_date": "Wed, 12 Nov 2025 23:54:08 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In the quiet town of Ceduna on the far west coast of the Eyre Peninsula, the beating of drums and scream of guitars echoes throughout the old Scout and Guide Hall.\n\nSitting across the road from a cemetery, the hall serves as a rehearsal space for the town's only heavy metal band, KNAW.\n\nThe band is gearing up for its first capital city show in Adelaide, which will involve a 16-hour round trip for the chance to play a 40-minute set.\n\nRobert Pav belts out a scream. (ABC Eyre Peninsula: Emma Pedler)\n\nLead guitarist Callan Slattery, 20, said it might seem \"a little extreme\".\n\n\"But for us, it's a thing we've got to do,\" he said.\n\n\"Bands from cities won't come out to regional areas like this often.\"\n\nThe band has big dreams of playing on a festival stage one day.\n\nBut being so isolated from the heavy metal community creates unique roadblocks.\n\nKNAW rehearse in the town's old Scouts hall. (ABC Eyre Peninsula: Emma Pedler)\n\n\"We've talked to a few festivals and put our names out there,\" Slattery said.\n\n\"I think because they see we're from the middle of nowhere … I don't think it excites them for whatever reason, it seems to be a bit of a thing with small bands, especially from rural areas like this.\"\n\nWith limited venues to play at in Ceduna, the band will play anywhere that lets them — often for free.\n\n\"You might get a tab on the bar, but we get up there and make our noise,\" Slattery said.\n\nMakenzi Harrison plays some heavy riffs during a rehearsal session. (ABC Eyre Peninsula: Emma Pedler)\n\n\"That's the hardest thing; finding places that are happy to have such extreme music and such energetic and loud shows.\n\n\"There is a fair bit of music [in Ceduna] but it's more so around the poppy, country stuff.\n\n\"It's hard to end up on the same bill as that sort of thing.\"\n\nBreaking through\n\nIn the Melbourne triple j studio, Jack Bergin pores over the latest alternative music coming in from across the country.\n\nAfter more than a decade touring as the vocalist for hardcore outfit Void of Vision, Bergin is the host of the station's flagship heavy music program, CORE.\n\nJack Bergin says he has seen a shift in heavy bands playing more in the regions. (ABC News: Billy Draper)\n\nHe said it could be hard for regional bands to find their audience.\n\n\"It's very limited to what you can do in a regional town; I dare say it's quite a niche genre, especially in heavy music where you can only meet a handful of people,\" he said.\n\n\"And you've reached your ceiling quite early on in terms of that.\"\n\nWhile many bands from regional towns hope to move to a major city to record and play bigger capacity venues, Bergin said cost-of-living pressures often made that unrealistic.\n\n\"It's a very tricky situation for a lot of regional acts that they find themselves in at the moment,\" he said.\n\nWhile capital city shows were needed for exposure, Bergin said he had seen renewed interest in regional touring from heavier bands.\n\n\"I think we're starting to see a bit of a change, I know regional touring in a larger aspect for some of our more household names is coming back big,\" Bergin said.\n\nKNAW members meet to rehearse at the former Guides and Scouts hall in Ceduna. (ABC Eyre Peninsula: Emma Pedler)\n\n\"If we can keep continuing to reintroduce these smaller towns and have more of these flagship acts come through, a lot of the locals will see that and they will respond to that.\"\n\nA nursery for the music industry\n\nFour hundred kilometres south of Ceduna in Port Lincoln, Sound City owner Mike Pearson has been gearing up for a busy summer of hosting shows.\n\nMike Pearson says local venues across Australia are struggling with rising insurance costs. (ABC Eyre Peninsula: Duncan Bailey)\n\nHe said alternative music venues were needed to showcase different genres.\n\n\"It's the nursery for the whole music industry … reducing the number of venues that alternative bands can play in, they've got nowhere to play and have to invent their own gigs,\" Pearson said.\n\n\"The flow-on effect is to the wider music industry.\n\n\" Without alternative music venues and places for artists to express different types of music, it threatens the whole industry. \"\n\nPearson said the challenges faced by live music venues were not exclusive to the regions.\n\nJuran Miller, Robert Pav and Callan Slattery hang out in their Ceduna rehearsal space. (ABC Eyre Peninsula: Emma Pedler)\n\n\"Live music venues are struggling everywhere; there's a multitude of reasons for that,\" he said.\n\nHe said costs such as insurance had become out of reach for a lot of venues.\n\n\"But with a struggle comes an opportunity that forces venues to be a point of difference and offer things that people want to see and hear and do,\" he said.\n\nSlattery said KNAW had no plans of giving up anytime soon.\n\nCallan Slattery says the band will not throw in the towel just because of the long distances. (ABC Eyre Peninsula: Emma Pedler)\n\n\"I don't think there is really much that would stop us,\" he said.\n\n\"We all really want to do it and will jump at any chance we get to do something like this.\n\n\"We would really love to have more heavy music festivals close to home … that's the hardest thing, finding the places that will want to have you there.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/hervey-bay-residents-protest-to-retain-popular-caravan-park/105999958",
    "title": "Queensland town fights to keep beloved caravan park",
    "publish_date": "Wed, 12 Nov 2025 22:47:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Standing next her humble caravan with an unobstructed view of the glassy waters of Hervey Bay, retiree Pamela Dibbon reflects on some of her fondest memories of the town.\n\n\"It's a lovely place — it's the best beach along here,\" she says.\n\nEvery summer for the past eight years, Ms Dibbon and her husband have travelled from Victoria to Hervey Bay, a three-hour drive north of Brisbane, to stay at Torquay Caravan Park.\n\nPamela Dibbon says she will reconsider coming back to Hervey Bay if the caravan park shuts. (ABC Wide Bay: James Taylor)\n\nBut now the council is considering whether to close the park, one of four it runs in the town.\n\n\"I'm just so used to this park and we just sort of feel like it's the only place we'd go,\" Ms Dibbon says.\n\nExperts say her dilemma is experienced by many travellers as more councils look to walk away from caravan parks, despite growing demand.\n\nGreen space or caravan parks?\n\nLast year, Fraser Coast Regional Council unanimously passed a motion to suspend a planned $8 million upgrade of the caravan park.\n\nCouncillor Zane O'Keefe said the park was taking up valuable space on Hervey Bay's seaside esplanade, which should be accessible to the public.\n\nBut ex-councillor Sue Brooks said residents had not complained about feeling crowded.\n\n\"The only time you can't access the barbecue is if someone's having a wedding or a celebration and there's other ones close by that people can access,\" she said.\n\nThe Torquay Caravan Park has been a popular spot for many years. (Supplied: Hervey Bay Historical Village & Museum)\n\nThe council proposed alternative uses for the site, including an open green space or a playground.\n\nBut these proposals led to a public outcry and community group Save the Torquay Caravan Park launched a petition and held protests calling for the council to reconsider its decision.\n\nThe petition has about 12,000 signatures.\n\nSue Brooks says the caravan park issue has \"united\" the people of Hervey Bay. (ABC Wide Bay: James Taylor)\n\nMs Brooks said she was surprised by the strength of the public's support.\n\n\"The issue has united our community like none other,\" she said.\n\nA council survey attracted 4,385 responses, the most for any community engagement process, with 76 per cent of respondents preferring to retain the caravan park.\n\nCouncil will consider the survey results at a meeting next month.\n\nClosure concerns\n\nBusiness owners operating near the park said they could be forced to close if the caravan park was turned into public parkland.\n\nA Caravan Parks Association of Queensland report estimated the site supported about 45 jobs and could contribute $5.56 million to the local economy.\n\nAimee Chapman says the closure of the caravan park could have detrimental impacts on her pharmacy. (ABC Wide Bay: James Taylor)\n\nPharmacy manager Aimee Chapman said she provided medication to grey nomads visiting from the southern states in summer and was worried about the \"detrimental\" impact its closure could have on her business.\n\nShe worries about the potential \"let go of staff because we wouldn't be able to stay afloat without the influx of people coming through\".\n\nSaving ratepayers\n\nIn September, the North Burnett Regional Council said it would relinquish ownership of four caravan parks.\n\nA spokesperson said operating caravan parks was outside the scope of local government and that the council would seek to transfer the ownership and management of the parks to private operators.\n\nThe decision was made to \"improve council's financial sustainability in the long-term\", the spokesperson said.\n\nIn July, North Burnett Regional Council handed down a 25 per cent rate increase to cover increasing costs of utilities and services.\n\nExperts say rising rates to fund the caravan parks could cause friction with local residents. (ABC Wide Bay: James Taylor)\n\nSouthern Cross University tourism researcher Rodney Caldicott said many councils were looking to offload caravan parks for that reason.\n\nHe said councils passing on rising maintenance costs for caravan parks to ratepayers could drive resentment in the community, although that did not appear to be the case in Hervey Bay.\n\n\"So the local ratepayers say, 'We just got a rate rise so that we can look after these Victorians to come up here and have a great time in the prime location and I can't afford to live beside the coast,'\" Mr Caldicott said.\n\n\"So you get all that community feeling.\"\n\nHe said councils had to choose between revenue and residents.\n\n\"They've got to think, if they've not got the revenue from the caravan park to help support or even subsidise the maintenance of their parkland, it's got to come from the ratepayers somewhere, somehow,\" Mr Caldicott said.\n\nMichelle Weston says closing down caravan parks could deter visitors from staying in regional areas. (Supplied: Michelle Weston)\n\nCaravan Parks Association of Queensland chief executive Michelle Weston said more councils were looking at alternative management options for caravan parks rather than closing them altogether.\n\n\"It's not unusual for councils to switch between leasing their caravan parks out and having a management contract in place,\" she said.\n\nBut she said the closures of caravan parks could affect tourist numbers in regional areas.\n\n\"There just wouldn't be the capacity for them to stay in the commercial caravan parks in the region, particularly during the peak periods,\" Ms Weston said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/asic-action-financial-planners-shield-first-guardian/106004042",
    "title": "Players in First Guardian, Shield sued after Australians lose more than $1b",
    "publish_date": "Wed, 12 Nov 2025 22:38:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's corporate watchdog is suing Interprac — the licensee that oversaw financial planners — over alleged failures that led to the collapses of the Shield and First Guardian schemes.\n\nThe Australian Securities and Investments Commission (ASIC) is also suing ratings agency SQM Research, saying its \"processes fell short of expected standards when it published 'favourable' ratings for the Shield Master Fund\".\n\nASIC is also taking action against MWL Financial Services, former director Nicholas Maikousis, and lead generator Imperial Capital Group Australia over alleged Shield advice failures.\n\nOn the day ASIC unveiled its hit list for the year ahead, it said a key focus was prosecuting people involved in the collapses of the First Guardian and Shield schemes, which led to people losing over $1 billion of their retirement savings.\n\nASIC alleges thousands of Australians were exposed to poor financial advice and significant risks from the Shield and First Guardian schemes through critical oversight and compliance failures by Interprac.\n\nLoading...\n\nASIC alleges Interprac representatives gave 'poor advice'\n\nASIC has commenced civil penalty proceedings in the Federal Court against Interprac, saying that the licensee failed to ensure its former authorised representatives — Ferras Merhi's Venture Egg and former financial adviser Rhys Reilly — who gave thousands of people financial advice, complied with the best interests obligations and had adequate risk management systems.\n\nASIC said together, the Interprac representatives advised about 6,843 clients to invest about $677 million of their superannuation into Shield and First Guardian.\n\nInterprac sits under ASX-listed Sequoia, which on Thursday entered a trading halt after the ASIC announcement.\n\nASIC has commenced separate proceedings against Mr Merhi over Shield and First Guardian, recently securing Federal Court interim orders restraining Mr Merhi from operating within the financial services industry.\n\nMr Merhi has previously told ABC News: \"Every allegation of unlawful conduct that ASIC has made, and any allegation it might yet make, will be strenuously defended in the court proceedings\".\n\nFerras Merhi is himself under ASIC investigation for placing thousands of people into the First Guardian and Shield products, and says allegations \"will be strenuously defended\". (Supplied.)\n\nMr Reilly has previously denied preparing, providing, or presenting the Statement of Advice that led to some individuals investing in First Guardian. He has been contacted for comment on ASIC's latest action against Interprac.\n\nASIC deputy chair Sarah Court said Interprac's alleged oversight and compliance failures \"exposed thousands of Australians to poor advice and significant financial risk\".\n\n\"We allege Interprac failed to ensure certain authorised representatives acted in their clients' best interests, contributing to hundreds of millions of dollars of superannuation being invested in products that were unsuitable, high risk and costly,\" Ms Court said.\n\n\"We allege that no competent financial adviser could have recommended Australians invest large amounts of their superannuation in these funds, and that Interprac — as licensee — should have been alert and responsive to the significant risk this conduct posed to clients, but it failed on many levels.\"\n\nSarah Court says ASIC alleges no competent financial adviser could have recommended Australians invest large amounts of their superannuation in Shield and First Guardian.\n\nASIC alleges Interprac failed to have in place an adequate process for approving financial products it allowed onto its approved product list, including Shield and First Guardian, and relied entirely on external research to add those funds to its approved investments list for advisers.\n\nIt also alleges the license failed to respond appropriately to the use of lead generators Imperial Capital Group Australia and AGAT Business, and alleges it failed to respond adequately to news that payments had been made to Mr Merhi's companies by entities associated with First Guardian and Shield.\n\nIt also alleges Interprac failed to enforce or maintain a hold on new investments into Shield and First Guardian after Interprac's managing director and responsible manager, Garry Crole, acknowledged serious issues with both funds.\n\nIn a recent exclusive interview with ABC News, Mr Crole admitted that \"maybe we could have done more\" to prevent First Guardian and Shield losses.\n\nLoading...\n\nASIC also alleges Interprac failed to prevent the use of a \"negative consent\" practice, which led to some clients' superannuation being invested in Shield and/or First Guardian without express consent from those clients.\n\nIt alleges the licensee failed to respond adequately to significant inflows of investment into Shield and First Guardian.\n\nThe corporate cop also alleges it failed to provide adequate responses to client complaints about advice from its representatives to invest in Shield or First Guardian and instead relied on a \"template\" response which often failed to consider the appropriateness of the advice.\n\nIt alleges that Interpac failed to respond adequately or impose meaningful consequences in response to serious compliance issues, including failings repeatedly identified in audits.\n\nASIC is seeking declarations, civil penalties, and orders to restrain Interprac from carrying on a financial services business.\n\nInterPrac said it had received notification from ASIC.\n\n\"InterPrac is unable to provide further information at this time and will defend its position on such allegations vigorously,\" a spokesman said.\n\nASIC sues SQM Research, alleging misleading reports related to Shield\n\nASIC is also taking action against ratings agency SQM Research, alleging it prepared reports containing misleading representations and its processes fell short of expected standards when it published \"favourable\" ratings for the Shield Master Fund.\n\nDeep flaws in Australia's $4.3 trillion system exposed The collapses of the First Guardian and Shield schemes have exposed deep flaws in the regulation of Australia's $4.3 trillion superannuation sector.\n\nSQM Research published reports in October 2021, March 2022 and October 2022, that rated the different classes of Shield as \"3¾ stars, Favourable\".\n\nThe SQM Research reports were provided to financial advisers and superannuation trustees who recommended or on-boarded Shield onto Australians.\n\nAbout 5,800 people invested their superannuation savings into Shield, in many cases, after receiving advice from financial advisers.\n\nSQM Research's owner and managing director, Louis Christopher, told ABC News: \"We are assessing the claim and will let our position [be] known in due course\".\n\nLouis Christopher says SQM is assessing ASIC's claim. (ABC News: John Gunn)\n\nThe advisers often told investors to roll over their existing superannuation balances into a choice superannuation fund available on a platform which had on-boarded Shield.\n\nASIC alleges that SQM Research failed to obtain the information it needed to properly assess Shield and alleges it failed to properly consider inconsistencies in information it received when preparing its reports about Shield.\n\nThe corporate watchdog also alleges that SQM \"misrepresented\" that it had a reasonable basis for giving Shield a \"favourable\" rating and had exercised reasonable care and skill in doing so.\n\nIt alleges SQM made misrepresentations that understated the percentage of funds managed by parties related to Shield and the asset allocation of Shield.\n\nASIC also alleges that the SQM Research reports did not accurately depict the standard, quality, value or grade of Shield, and that reflected deficiencies in the processes SQM followed.\n\nASIC deputy chair Sarah Court said the civil penalty proceedings against SQM Research marked the first time the regulator had taken action against a research house.\n\n\"Research houses have a responsibility to ensure they obtain the information needed to prepare their reports, take real care and skill in assessing that information and to present that information accurately,\" she said.\n\n\"We believe research houses are important gatekeepers and form part of a critical line of defence against poor quality investments or unsuitable products … the community is entitled to expect that their reports will be accurate and based on appropriate information and analysis.\"\n\nASIC is seeking declarations and civil penalties from the Court.\n\nASIC takes action against MWL Financial Services, Imperial Capital Group\n\nASIC will also seek to allege MWL Financial Services operated a business model, involving its former director Nicholas Maikousis and lead generator Imperial Capital Group Australia, that \"provided inappropriate financial advice to clients to invest their superannuation into the Shield Master Fund\".\n\nCall for greater protections for super savings Compulsory super has led to higher levels of national savings, but, as the pool of savings grows, many argue that stricter supervision is needed to protect Australians' retirement savings.\n\nASIC has sought leave to commence the proceeding to allege serious failings in relation to Imperial's referral of clients to MWL and the financial advice given by MWL advisers.\n\nASIC has already cancelled the Australian Financial Services licence of MWL and banned Mr Maikousis from providing financial services for 10 years over conduct in relation to Shield.\n\nASIC has also already banned MWL's responsible manager and six former MWL financial advisers in respect of advice provided in relation to Shield.\n\nBecause MWL is in administration, ASIC's application to make its latest allegations is subject to the court's approval, or the consent of MWL's administrators, Daniel Juratowitch and Rachel Burdett of Cor Cordis.\n\nIf allowed to proceed, ASIC will seek declarations and civil penalties against all defendants, and orders disqualifying Mr Maikousis from managing corporations.\n\nASIC will seek to allege that between May 2022 and February 2024, nine MWL representatives advised at least 556 clients to make initial investments of about $114 million of their superannuation into Shield.\n\nIt will seek to allege that MWL failed to take reasonable steps to ensure its representatives acted in the best interests of its clients and provided appropriate advice in respect of recommendations that clients roll over their superannuation to invest into Shield as the pre-selected investment option.\n\nASIC will seek to allege MWL failed to ensure its financial services were provided efficiently, honestly and fairly and failed to have in place adequate arrangements to manage conflicts of interest.\n\nIt will also seek to allege that Imperial, acting as a lead generator, made misleading representations to prospective clients about the standard, quality and benefits of MWL's financial services and was involved in MWL's alleged contravention of its obligation to provide financial services efficiently, honestly and fairly.\n\nMWL director Nicholas Maikousis was, ASIC will seek to allege, involved in MWL's alleged contraventions of its general licensee obligations and its obligation to take reasonable steps to ensure its authorised representatives complied with their best interests and related duties.\n\nMWL, ASIC will seek to allege, received advice fees charged to clients for preparing Statements of Advice recommending investment in Shield.\n\nImperial received (through a related entity) about $12.8 million in payments from entities associated with Shield for client referrals and the promotion of Shield, ASIC will seek to allege.\n\nMs Court said the superannuation of many Australians was put at risk by the conduct proposed to be alleged in this proceeding.\n\n\"ASIC will seek to allege that MWL and Imperial were involved in a project which resulted in the superannuation of hundreds of Australians being invested into a high-risk scheme,\" she said.\n\nThe project allegedly involved Imperial referring prospective clients to MWL for what Imperial represented would be tailored financial advice, but which instead put clients into a pre-selected investment, Shield.\n\n\"Instead of the tailored financial advice that was promised, we will seek to allege MWL provided pre-determined advice that was not in clients' best interests,\" Ms Court said.\n\n\"Despite Shield having no proven track record, we will seek to allege clients were advised to invest most or almost all of their retirement savings into the fund, irrespective of their individual circumstances.\"\n\nMWL and Mr Maikousis, and Imperial, were contacted for comment.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/piastri-set-for-test-of-character-as-f1-season-unravels/106004050",
    "title": "Piastri set for test of 'character' as F1 season unravels",
    "publish_date": "Wed, 12 Nov 2025 22:27:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mark Webber says his Formula 1 charge Oscar Piastri will have to find \"deep motivations\" and \"character\" to rebound from his recent championship woes and provide a rousing end to his 2025 season.\n\nBut even if this year's drivers' crown may now be beyond Piastri, with McLaren teammate Lando Norris 24 points clear with three grands prix remaining, manager Webber is also quick to remind everyone of the near \"unprecedented\" achievements of the man who is still a relative three-season novice.\n\nPiastri finished fifth in the São Paulo Grand Prix while Norris won — the fifth race running in which the Australian missed the podium.\n\n\"I don't think he's low on motivation, put it that way,\" Webber said.\n\n\"He's had a tough run, but this is about character, about finding those deep motivations that you need at this point to come back.\"\n\nOscar Piastri has lost his lead to McLaren teammate Lando Norris. (Getty Images: Formula 1/Mark Sutton)\n\nWebber, a nine-time grand prix winner who had a near-miss for the title himself in 2010 when leading with three races to go before eventually finishing third behind champion Sebastian Vettel, knows all about the pressures of a title run-in.\n\nWhy Piastri was handed a controversial 10-second penalty in Brazil Oscar Piastri was involved in the biggest flashpoint of the Formula 1 São Paulo Grand Prix, earning him a costly penalty and damaging his chances of winning the drivers' championship.\n\nBut, whatever the result of the 2025 campaign, Webber felt it should still be considered just what an achievement it has been for Piastri to win seven grands prix in only his third season of F1.\n\n\"It's obviously an incredible journey so early in his career to fight for a world title. Year three is pretty unprecedented — I think there was Lewis [Hamilton] but there haven't been many people that have done this so early in his career,\" he said.\n\n\"When I went for my championship, I was an old dog. I was really old at the end of my career. He's early in his career, so there's different nuances there.\"\n\nWebber said he was working to ensure Piastri's head did not drop despite the recent disappointments.\n\n\"There's a bit of everything — arm around him, a bit of encouragement here and there, opportunities. You can see his pecker's up, he's still working hard, and it's early in his career.\n\n\"To see him so young, year three, fighting for a world title quite quickly, it's pretty surreal and bizarre. A lot of drivers don't fight for a title once in their career, so you've got to try and find the positives.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/gold-coast-officers-pull-up-world-record-marred-online-abuse/106002472",
    "title": "Gold Coast police officer's pull-up world record marred by online abuse",
    "publish_date": "Wed, 12 Nov 2025 21:51:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Gold Coast police officer Jade Henderson is used to dealing with challenging situations, but she wasn't prepared for the barrage of abuse she received after breaking the Guinness World Record for the most pull-ups in an hour.\n\n\"I wasn't expecting to receive half the amount of attention I have received already, so when I saw that a lot of it was negative comments accusing me of being on steroids or cheating, it's quite disheartening to see that,\" she said.\n\nThe 32-year-old set a new world record on August 22 this year with 733 pull-ups, beating the previous record of 725 set in 2016.\n\nJade initially went for the 24-hour pull-up record but got injured. (Supplied: Jade Henderson)\n\nThe senior constable had originally aimed for the 24-hour pull-up record but set a smaller goal after tearing her biceps.\n\n\"I had to have a couple of weeks off to recover — it was around five weeks — and then I thought, 'Why not attempt the one-hour record instead?' Because … that prevents me from re-injuring myself and it's more manageable for my body,\" she said.\n\nHenderson said she was confident she would be able to break the record, but the final 20 minutes of her attempt was tough.\n\n\"I felt my hands just rip and I just thought, 'They're already ripped. They can't get any worse, so you've got to make it worth it,\" she said.\n\nIn late September, she received official confirmation from Guinness World Records that her attempt had been verified as successful.\n\nJade Henderson secured the world record with 733 pull-ups. (Supplied: Jade Henderson)\n\nHenderson was overwhelmed, but said her achievement had been marred by personal insults online.\n\n\"It discredits the amount of work that's actually gone into doing this record,\" she said.\n\n\"But I try not to focus on it, and those who love me, my family, friends, they know that I have not cheated.\n\n\"I've never done steroids, so I don't have anything to prove to anyone else.\"\n\nWomen in sport often targeted\n\nDeakin University associate professor Kim Toffoletti said Henderson's experience mirrored findings from research she co-authored about sportswomen being subjected to online harm.\n\n\"When women succeed in these kinds of spaces, there is that online backlash, that desire to bring women down and to challenge that they potentially can succeed in these spaces and, in some instances, actually do better than men,\" she said.\n\n\"And that really poses a threat to social ideas of the natural order or that men are naturally superior in sport.\"\n\nKim Toffoletti says the abuse of female athletes online is all too common. (Supplied)\n\nThe Deakin study — which surveyed 138 professional and semi-professional athletes from 32 sports — found the most common examples of gendered online harm were personal insults (81 per cent), hate speech (62 per cent), attempts to embarrass (60 per cent) and general and sexual harassment (50 per cent and 39 per cent respectively).\n\nBut Dr Toffoletti said the most significant finding was that an overwhelming majority of sportswomen said online abuse impacted their well-being.\n\n\"Even if athletes themselves aren't being targeted personally, if they're witnessing other women who are succeeding in sport spaces and places being attacked, that also impacts their wellbeing because it says something about the fact that they're not welcome or they're seen as their achievements are not being recognised,\" she said.\n\nNot backing down\n\nHenderson said she was not going let the online trolls stop her from achieving her next goal.\n\n\"I'd like to achieve the Guinness World Record for the most pull-ups in one minute before the end of this year,\" she said.\n\nShe hopes to inspire others to chase their dreams, no matter what opposition they may face.\n\n\"Just believe in yourself,\" Henderson said.\n\n\"I know it sounds corny, but the mental aspect of it makes such a huge difference, and the saying is, 'Believe you can and you're halfway there' — and I think that's very true.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/nt-inpex-worker-speaks-out-toxic-chemical-emissions-oil-spills/105965424",
    "title": "Inpex gas plant worker speaks out over fears he's breathing in toxic chemicals",
    "publish_date": "Wed, 12 Nov 2025 21:50:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "A worker at gas giant Inpex claims he was exposed to dangerous air pollutants and made to clean up an oil spill — alleging that inside one of Australia's biggest gas companies, complaints about health and safety are being brushed aside.\n\nJames — whose name has been changed for privacy and security reasons — has worked at the Ichthys onshore gas processing facility, operated by Japanese company Inpex, on Darwin Harbour for several years.\n\nHe said workers had repeatedly raised concerns about toxic chemical emissions, oil spills and maintenance in recent years, only to be dismissed.\n\n\"They've prioritised production over the environment and over safety,\" he said.\n\n\" I've seen the attitude and the way management treats environmental issues ... it's all a bit of a joke. \"\n\nJames's concerns echo those of other Inpex workers who have contacted the Australian Workers' Union (AWU) with similar worries about the air they are breathing at the facility.\n\nCaleb Burke from the AWU said some workers had reported being burnt from oil spills and described a toxic workplace culture where employees feared speaking out.\n\nBut Inpex senior vice president Bill Townsend insisted the company was committed to the safety of workers and the broader community, and the protection of the environment.\n\nInpex's Ichthys LNG onshore facility on Darwin Harbour processes gas. (ABC News: Dane Hirst)\n\nDocuments show that in April 2023, Inpex reported a 30,000 litre \"heating medium\" oil spill, some of which leached into stormwater drains and mangroves at Darwin Harbour where locals fish.\n\nA separate report lodged two weeks earlier disclosed a 75,000 litre oil spill.\n\nJames claimed that after those spills, the problem tubes, towering roughly 30 metres high, were merely \"bandaided with a series of plugs\" by the company, instead of being properly maintained — a fix he described as a \"ticking time bomb\" that left many workers uneasy.\n\nInpex did not respond to questions from the ABC about staff warnings being ignored and concerns about maintenance on the tubes.\n\nOn October 12, 2025, Inpex reported a \"heating medium\" oil spill at the Ichthys facility, some of which leaked into mangroves at Darwin Harbour. (Supplied. )\n\n'No increased health risks', Inpex says\n\nInpex is currently under federal investigation, following another oil spill in October this year and revelations it under-reported emissions of toxic chemicals in 2023-24.\n\nInpex originally reported it only emitted four tonnes of benzene, classified by the World Health Organization as a class 1 carcinogen known to cause some cancers. But last month the company admitted the true figure was more than 500 tonnes — a more than 13,000 per cent increase.\n\nOther volatile organic compounds (VOCs) linked with health risks, including toluene, were also drastically revised up.\n\nInpex's senior vice president has maintained there is no increased health risk to workers and the public from the emissions.\n\n\"Inpex's workforce has been briefed there is no cause for health concern, given ongoing air quality monitoring — both on site and in the Darwin region — has consistently shown emissions levels are well within government guidelines,\" Mr Townsend said.\n\nHe said Inpex's monitoring sites were independently verified and its \"worker health monitoring program\" had never detected benzene.\n\nOn top of that, he noted that on October 31, the NT Chief Health Officer Paul Burgess had concluded \"there is no evidence of increased health risks\".\n\nInpex ships gas to Japan. (Supplied: Inpex)\n\nHowever, the NT government's own air quality monitors cannot detect benzene or other VOCs.\n\nIn response to questions from the ABC, the NT Department of Health conceded the chief health officer had come to his conclusion using data provided by Inpex.\n\n\"This data was from Inpex's monthly and continuous ambient air monitoring at several locations required under NT environmental and work health and safety laws,\" a health department spokesperson told the ABC.\n\nThe spokesperson said the NT EPA and chief health officer had ordered an independent review of Inpex's data \"to verify that previous emissions did not pose a risk to the community\".\n\n'Smells like rotten eggs', worker claims\n\nMr Burke from the AWU, which represents Inpex employees, said workers at the Darwin facility had \"repeatedly\" raised health and safety concerns with Inpex's management, but felt like \"nothing was being done\".\n\nFederal investigation into Inpex An oil spill that leaked into Darwin Harbour and the substantial under-reporting of toxic chemical emissions have put one of Australia's biggest gas companies under federal investigation.\n\nHe said workers alleged that in the aftermath of the oil spill in October this year, \"it wasn't uncommon\" for people working in the vicinity to suffer burns from hot oil dropping on them.\n\nOthers who had reached out to him raising fears about exposure to pollution and safety standards in recent weeks feared voicing their concerns and had asked to remain anonymous.\n\n\"A lot of [members] worry that their job is going to be put in jeopardy because they're speaking out,\" he said.\n\nJames said he was not convinced by Inpex's assurances that emission levels are safe at the facility. When he reports for work, he said, he worries about the air he is breathing.\n\n\"When the wind's blowing the wrong way you can smell the gasses,\" he said.\n\n\"H2S (hydrogen sulphide) is probably the most pungent, it's a sulphury smell like rotten eggs … if you can smell that, there's others as well.\"\n\n\" It makes your eyes water. \"\n\nInpex is Japan's largest oil and gas exploration and production company. (Supplied: Inpex)\n\nHe said when he complained to management, he was told \"not to worry about it\".\n\n\"My partner is deeply concerned,\" he said.\n\n\"We've all got families and kids.\"\n\nThe ABC put multiple questions to Inpex about worker complaints and accounts of a toxic workplace, but did not receive a direct response.\n\nIn response to workers' claims about emissions, Mr Townsend said routine monitoring demonstrated the facility was \"well below Safe Work Australia’s hydrogen sulphide 10 parts per million exposure limit\".\n\n'Nothing to worry about here', not adequate, expert says\n\nDocuments submitted to a Senate inquiry last year revealed that Inpex's acid gas incinerators — anti-pollution systems designed to burn off toxic chemicals — had been out of service for extended periods since 2019, including a stretch of 323 days in 2023 and more than 143 days last year.\n\n\"When they are not running you can actually smell the hydrogen sulphide,\" James said.\n\nShay Dougall, a workplace health and safety expert, said it was likely the incinerators had been neglected because of the high cost of fixing them, but she said letting them break down was \"unacceptable\".\n\nShe said if emissions of toxic chemicals could not be controlled by some other means, the facility should be shut down.\n\n\"[For Inpex to say], 'Oh, there's nothing to worry about here', is not adequate when you're talking about a class 1 carcinogen [benzene],\" she said.\n\nJohn Zorbas is the president of the Australian Medical Association NT. (ABC News: Pete Garnish)\n\nAustralian Medical Association NT president John Zorbas also said he was worried about the chemicals being discharged into the air from the facility and expressed concerns for the health of residents in nearby Darwin and Palmerston.\n\nHe said he was calling for the NT chief health officer to do his own investigation, separate from the EPA, to rule out long-term cancer risks.\n\n\"This is a significant public health issue,\" he said.\n\nIn September, a \"scandal\" surrounding a Santos gas tank exposed years of inaction and a potential conflict of interest inside the territory's environmental regulator, which some critics believe has shattered trust in its ability to oversee northern Australia's rapidly expanding gas industry.\n\nBut an NT EPA spokesperson said it was \"committed to conducting a thorough investigation into environmental and human health risks\" at the Inpex facility.\n\nThe NT EPA has appointed independent investigators to examine Inpex's reporting failures and possible breaches of legislation, the spokesperson said.\n\nNT EPA chair Paul Vogel was taken off the investigation last month to rule out a conflict of interest, though he denies any conflict.\n\nInpex did not answer detailed questions from the ABC, but in a statement Mr Townsend said \"working safely is Inpex's priority, always. This commitment underpins our approach to protecting people and the environment.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/vault-artist-says-mildura-council-pr-stunt-is-silly/106000354",
    "title": "'Vault' sculptor denies backing council's 'silly' PR stunt",
    "publish_date": "Wed, 12 Nov 2025 21:15:08 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The artist whose controversial sculpture Vault headlines the regional Victorian town of Mildura's new tourism campaign says it is a \"profoundly silly\" PR stunt.\n\nLast week Mildura Rural City Council unveiled a Bring Vault Home campaign which intends to take Ron Robertson-Swann's yellow sculpture from outside the Australian Centre for Contemporary Art in Southbank and place it on the lawns of the Mildura Arts Centre.\n\nThe controversial sculpture was installed in Melbourne's City Square in 1980 and moved to its current site in 2002.\n\nLast week the Mildura council said Mr Robertson-Swann had \"welcomed the proposal\" but that seems not to be the case.\n\nRon Robertson Swann, in an undated photo with Vault at its present site, says the \"silliness\" of the campaign frustrates him. (Supplied: Australian Galleries)\n\nSpeaking to the ABC, the artist said the campaign was \"a silly beat up to get publicity\".\n\n\"I thought it was silly but they went ahead with it,\" Mr Robertson-Swann said.\n\n\"I couldn't stop them from doing that. That's their business.\n\n\"They're happy, I think, because this is all going on now and they feel they've really seriously generated something, but it's hollow.\n\n\"It's completely hollow and it's probably, if anything, exposing the stupidity.\n\n\" The silliness of it frustrates me. \"\n\nThe sculpture Vault by artist Ron Robertson-Swann in Melbourne. (774 ABC Melbourne: Simon Leo Brown)\n\nAI used in campaign video\n\nThe Bring Vault Home campaign is the beginning of a wider tourism promotion portraying Mildura as regional Victoria's new arts and culture capital.\n\nIt included a video fronted by actor and Mildura's tourism ambassador, Shane Jacobson.\n\nThe video, which the council confirmed used AI, shows a crowd gathered in front of the sculpture wanting to bring it \"home\".\n\nMildura's \"Bring Vault Home\" campaign shows distortions that are a hallmark of some AI-generated videos. (Supplied: Facebook )\n\n\"The Vault has been under-appreciated, undervalued, unloved. It's even been mocked in Melbourne for way too long — we are talking decades,\" Jacobson says in the video.\n\nBeethoven is displayed in front of the Mildura Arts Centre. (ABC News: Nethma Dandeniya)\n\nCost to relocate Vault\n\nMr Robertson-Swann said the City of Melbourne owned Vault and it would cost well over $1 million to move it to Mildura.\n\n\"I think it's profoundly silly, because ... Mildura has no intention of spending any money,\" he said.\n\n\"The only money they spent was on phone calls to start this beat up.\n\n\" If Mildura council was at all serious, they should start purchasing a few more sculptures for ... the gallery. \"\n\nIn response, Mildura Rural City Council said Mr Robertson-Swann had \"indicated he was supportive of the initiative\" when consulted.\n\n\"We have enormous respect for Ron Robertson-Swann's artwork, which is why we are asking for Vault to join its little brother, [the sculpture] Beethoven, and we'd certainly like to see more sculptures in Mildura and the broader region,\" said the council's strategy and growth general manager Phil Stone.\n\n\"We have invited Ron and his wife to visit Mildura and we're looking forward to hosting them when they arrive.\"\n\nCouncillor dissent\n\nCity of Melbourne Lord Mayor Nick Reece has rejected Mildura's Vault heist attempt, saying the sculpture belongs in Melbourne.\n\nHowever, fellow councillor and portfolio lead for creative and arts Philip Lui disagreed.\n\n\"If there is a serious proposal, if there is a serious interest, I don't think we should be just putting up a straight 'no',\" Cr Lui said.\n\n\"I want to hear what the reason is, what's the proposal, how they're going to look after it, what's the interest?\n\n\"Because ultimately public art is for the public, if there is interest in it, and given that we are the leaders in the local government sector we do, I think, have to show leadership.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/families-and-single-parents-seeking-food-relief-ozharvest/105969940",
    "title": "Cost of living crisis affecting single parents and families most",
    "publish_date": "Wed, 12 Nov 2025 20:58:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Single mum Tara Weldon holds a well-paid job working four days a week, but admits she sometimes struggles to put food on the table for her two kids.\n\nThe Redfern mother says she spends at least $250 a week on food for herself and her children.\n\n\"That would normally be someone's fortnightly shopping back a good six years ago, and now it's like, it's pretty much doubled.\"\n\nTara Weldon admits it is getting harder to put food on the table for her two children. (ABC Radio Sydney: Declan Bowring)\n\nTo help with the cost of groceries, she picks up a free bag of fruit and vegetables from food relief charity OzHarvest at the Redfern Community Centre every week.\n\nThe bags usually contain fresh fruit, vegetables and occasionally meat, eggs and pastries.\n\nThe majority of deliveries are fresh fruit and vegetables, but occasionally there is also meat and eggs. (Supplied: OzHarvest)\n\n\"For some reason on Mondays, I'm always in need, or a bit short, or haven't done the groceries,\" Ms Weldon said.\n\n\"If I didn't have that pick-up … I don't know what I'd be going home to feed my children with, like, they'd be having Weet-Bix, or probably two-minute noodles instead of nutritional food.\n\n\" It goes a long way. \"\n\nMother-of-three Dominica Siu, who also occasionally collects a food bag from the community centre, says she is feeling the pinch from the rising cost of living. Her weekly grocery bill amounts to about $300.\n\n\"It's tough with three kids, expenses and school expenses,\" Ms Siu said.\n\nDominica Siu says the grocery bill is now around $300 a week for her family. (ABC News: Declan Bowring)\n\n\"If I haven't done my shopping, it [the OzHarvest pack] will last for my lunches, and midweek I've got enough food for school lunches and breakfasts.\n\n\"It assists with what I can currently afford and support.\"\n\nAs well as providing produce for the grocery bags, OzHarvest also runs a monthly food truck that serves free lunches outside the community centre.\n\nAbout 20 to 40 people come to the community centre to collect grocery bags every week, says Tracey Duncan, who manages Aboriginal city spaces with the City of Sydney, including Redfern Community Centre.\n\nOzHarvest delivers more than 200kg of food per week to the community centre. (Supplied: OzHarvest)\n\nMs Duncan says the bags are often gone by the end of the afternoon.\n\nShe says occasionally the grocery bags have meat in them, which is often what members of the community are cutting back on because of how much it costs.\n\n\"The cost of living is absolutely crazy,\" Ms Duncan said.\n\n\"People are cutting back on the essentials, and meat is probably one of the first things that they cross off.\n\n\"What people are saying is that it's [OzHarvest grocery bags] really helping them make it to the next payday.\"\n\nOzHarvest runs a regular food truck at Redfern Community Centre. (ABC Radio Sydney: Declan Bowring)\n\nOzHarvest also ran a cooking class out of the community centre earlier this year, teaching adults about healthy cooking on a budget. Ms Duncan said this gave the community important skills and knowledge about nutrition.\n\nRising cost of living is biting\n\nThis year's cuts to interest rates by the Reserve Bank may have eased pressure on mortgage holders, but the price of food has continued to rise.\n\nRecent national data shows the price of food and non-alcoholic beverages went up by 3 per cent in the 13 months to July 2025.\n\nABC Gives NSW Everyone should have access to food no matter their situation and everyday Australians shouldn't have to go without. ABC Radio is joining with OzHarvest in the ABC Gives appeal to help provide food and grocery relief for people in need.\n\nMeanwhile, the price of fruit and vegetables rose by 4.8 per cent for the same period, the Australian Bureau of Statistics reported.\n\nThe rising cost of living has pushed many families to seek relief from food charities in the past few years.\n\nAn OzHarvest survey published earlier this year says families and single parents are among the biggest groups that are seeking food relief.\n\nThe survey of about 870 charities OzHarvest provides for, also found that a third of people who came to them for food relief were seeking help for the first time in their lives.\n\n\"They have employment, but their salaries are just not covering the costs,\" OzHarvest founder Ronni Kahn said.\n\n\"By the time they pay rent, by the time they pay fuel, by the time they pay health, by the time they pay education, the cost of living is too high for their wages.\n\n\"Every charity is telling us that there's an uplift of both that demographic of single parents, but working families who are not making ends meet with the current crisis.\"\n\nThose findings are backed up by a recent report by Foodbank that found more than 1 million households were experiencing food insecurity, and single-parent families were disproportionately affected.\n\nABC Gives is partnering with OzHarvest to raise awareness of the hunger and food waste crisis in Australia.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/solar-power-panel-damage-giant-hail-queensland/105992850",
    "title": "Giant hail laid waste to solar panels. Is it time standards changed?",
    "publish_date": "Wed, 12 Nov 2025 20:53:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Prue and Jamie Rogers moved from Brisbane to a rural property on Queensland's Darling Downs a year ago to fulfil their dream of a peaceful life away from it all.\n\n\"We wanted to be out here to be off the grid, not worry about bills, to live our life the best we could without forking out money all the time,\" Ms Rogers said.\n\nDespite their best efforts, nature had other plans.\n\nPrue and Jamie Rogers moved to the small town outside Toowoomba to live a quiet life off the grid. (ABC Southern Qld: Grace Nakamura)\n\nGiant hailstones from two destructive storm supercells in the south-east in early November smashed all 21 of their solar panels, which they were entirely reliant upon for power.\n\n\"Everything in the house is connected through solar — we have no power through main sources,\" Ms Rogers said.\n\n\" It was literally the worst experience of my life. I've never seen hail so bad. \"\n\nLoading...\n\nAll five of their vehicles, including work cars, were damaged by the hail that fell on November 1.\n\nThe couple estimates the damage bill will be in the six figures and, like other residents in the town of Pratten, 185 kilometres west of Brisbane, they do not have insurance.\n\n\"It costs so much for insurance that you can't even insure your place for these kinds of things,\" Ms Rogers said.\n\nThey have managed to negotiate a payment plan with their solar provider, which bumped the job of replacing the panels to the top of the queue.\n\n\"We're grateful for that … otherwise we would have had to wait until May next year — that's how long they're booked out to,\" Ms Rogers said.\n\nHailstorms more common\n\nSouthern Queensland residents told the ABC the hail came \"like bullets\", punching through windscreens and garden furniture and leaving deep dents in tin sheds.\n\nIn Pratten, population 229, nearly every property reported damaged solar panels.\n\nHailstones smashed through the windscreen of Prue and Jamie Rogers' car. (ABC Southern Qld: Grace Nakamura)\n\nThere have been 28,250 insurance claims lodged following the severe weather event in south-east Queensland, according to the Insurance Council of Australia.\n\nA little more than half the claims related to motor vehicles, 43 per cent were for homes, and the remainder were for commercial properties.\n\nThere is no breakdown on the number of claims relating to solar panel damage.\n\nTim Raupach says infrastructure needs to be designed with extreme weather in mind. (Supplied: UNSW)\n\nUniversity of New South Wales Institute for Climate Risk and Response researcher Tim Raupach said modelling showed severe hailstorms were likely to occur more frequently as the atmosphere got warmer.\n\n\"In some cities such as Sydney, Canberra and Melbourne, we did see really significant increases in future simulated hailstone sizes,\" Dr Raupach said.\n\n\"In places like Brisbane we actually saw increases in frequency in hailstorms but not a significant change in hailstone sizes.\n\n\"We should be keeping in mind, as we're building our cities, that we should be resilient to these kinds of threats.\"\n\nThe giant hail wreaked havoc in Pratten. (Supplied: Glen and Jo Potter)\n\nHow resilient are solar panels?\n\nSolar panels must meet a national minimum standard that requires them to withstand the impact of a 2.5 centimetre hailstone.\n\nThe Darling Downs recently recorded hailstones with a diameter of 9cm.\n\nStandards Australia chief development officer Adam Stingemore said Australia had adopted the international standard, which also allowed for testing of hail up to 7.5cm.\n\n\"A solar panel on a roof has to deal with all sorts of weather — sun, wind, hail, rain … they're made to standards that give them a design life in most parts of between 20 and 25 years,\" he said.\n\n\"However, there are a lot of products coming onto the market now that go above the minimum standard to provide more hail protection.\"\n\nInsurers recommend solar systems be switched off during a storm. (Reuters: Tim Wimborne/file photo)\n\nMr Stingemore said changing the minimum requirement of hail resilience would need to be coordinated between Standards Australia, governments, communities and industry.\n\n\"Standards revisions generally run between three to five years at the international level and are very much based on data,\" he said.\n\n\"As conditions change, the standards change to meet those conditions.\"\n\nMs Rogers said she and her husband were counting their blessings, despite the damage.\n\n\"We're one of the lucky ones that have been able to get our panels put back on,\" she said, adding that she still thought solar panels were the best way to go.\n\nBut if there are more severe hailstorms, they have concerns about how they will keep their panels safe.\n\n\"We don't have the money to pay for [solar repairs],\" Mr Rogers said.\n\nFor now, they say they will be \"soldiering on\" and keeping one eye on the sky.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-13/asx-markets-business-live-news-month-nov-13/106002198",
    "title": "Live: ASX tumbles as stronger jobs figures quash rate cut prospects",
    "publish_date": "Wed, 12 Nov 2025 20:32:10 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Yiying Li",
      "Michael Janda"
    ],
    "text": "Callam Pickering, economist at global jobs site Indeed, says most major metrics of the jobs market improved in October, which will be enough to keep the RBA on the sidelines for a couple of months yet.\n\n\"Labour market conditions have clearly eased this year,\" Mr Pickering wrote in a note.\n\n\"The headline figures in October were all very positive. Employment up strongly, the unemployment and underemployment rates down, hours worked up.\"\n\nDespite the bounce back from September's 4.5% unemployment rate, Mr Pickering says there are still some concerns, as employment growth has been sluggish this year.\n\n\"Even after adding another 42,000 people in October, employment has increased by just 160,000 people over the first 10 months of the year. \"That compares to a gain of 325,000 people over the same period last year. \"The main reason for this slowdown has been reduced hiring in healthcare & social assistance — the industry that drove so much of Australia’s post-pandemic job boom. \"Thus far, the private sector, which has been heavily impacted by a challenging economic environment, hasn't been able to fill the gap created by reduced hiring elsewhere.\"\n\nMr Pickering notes that forward-looking metrics, like job advertisements, remain positive but have eased back.\n\nHe says the data will \"offer vindication\" for the Reserve Bank and guarantees the cash rate will remain on hold for the next few meetings.\n\n\"The RBA's primary focus at the moment is on inflation and they won't lower rates further until they are convinced that the current outbreak is under control. \"The labour market would have to deteriorate considerably for the RBA to overlook relatively high inflation.\"\n\nThe central bank's monetary policy board next meets in early December, and then again in February.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-ley-prepares-to-dump-net-zero-targets-as-liberals-reject-policy-fresh-epstein-emails-allege-that-trump-knew-about-the-girls-20251113-p5nf0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Net zero Australia LIVE updates: Liberals agree to dump 2050 target but open to carbon-neutral future; Sussan Ley, Dan Tehan to address media this afternoon",
    "publish_date": "Thu, 13 Nov 2025 13:01:45 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling",
      "Emily Kaine"
    ],
    "text": "Independent MP for the Sydney seat of Mackellar Sophie Scamps has labelled the Liberal Party as rudderless and “without conviction” as she slams the party for abandoning net zero targets.\n\n“Their net zero backdown shows they are a party without conviction, who no longer know what they stand for, or understand who they represent,” Scamps said in a statement.\n\n“For three decades now, the Liberal Party has not only failed to show leadership on the defining issue of our time but have purposefully obstructed action – which is why the clean energy transition is now so urgent. The modern-day Liberal Party is pusillanimous, duplicitous, and lacking vision,” Scamps said.\n\nIndependent MP Sophie Scamps. Credit: Peter Rae\n\nScamps won her seat at the 2022 election alongside a cohort of urban independents who challenged Moderate Liberals on a platform of climate advocacy.\n\n“They’re trying to take the country back to the coal era of the 1980s, leaving us behind the rest of the world and passing up the opportunity to be at the forefront of the global clean energy transition,” Scamps said.\n\n“The people of Australia expect their political representatives to show courage, leadership, and stability. The Liberal party is instead doing the bidding of billionaires and multinational fossil fuel corporations and being led around by the nose of the National Party.”",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/this-eastwood-restaurant-is-the-place-to-go-for-hoe-korean-raw-seafood-20251113-p5nf6t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Eastwood restaurant is the place to go for hoe (Korean raw seafood)",
    "publish_date": "Thu, 13 Nov 2025 12:55:24 +1100",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 7 An array of dishes at GetBawi. Jennifer Soo 2 / 7 Raw seafood platter. Jennifer Soo 3 / 7 Spicy squid and jarubi jjamppong. Jennifer Soo 4 / 7 The restaurant serves live seafood. Jennifer Soo 5 / 7 The dining room. Jennifer Soo 6 / 7 Unagi. Jennifer Soo 7 / 7 Getbawi specialises in hoe, or raw seafood. Jennifer Soo Previous Slide Next Slide\n\nKorean$$$$\n\nUp the hill from K-bakery La Vigne and tucked into a shopping mall, newcomer Getbawi has quickly garnered a dedicated following. The reason? It’s one of the few Sydney restaurants specialising in hoe, or raw seafood, served here on platters with the likes of perilla leaves for wrapping. Other highlights include spicy blue swimmer crab hotpot and the textural masterpiece that is yukhoe tang tang, featuring high-grade raw beef strewn with umami-rich octopus.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/western-australia/heated-debate-in-wa-parliament-20251113-p5nf7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heated debate in WA Parliament",
    "publish_date": "Thu, 13 Nov 2025 12:52:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Heated debate in WA Parliament\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/the-afl-is-selling-controversy-with-its-2026-fixture-as-two-tiers-of-supporter-groups-emerge-20251113-p5nf5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The AFL is selling controversy with its 2026 fixture as two tiers of supporter groups emerge",
    "publish_date": "Thu, 13 Nov 2025 12:41:45 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "The former rule, which was used for the first time in 2014, meant that the ladder from the previous year was split into three groups of six teams: first to six, seventh to 12th and 13th to 18th. Teams could be scheduled to play opponents within their group of six twice a maximum of three times in the next season. They then played one or two games against teams within the other grouping twice. However, on Monday AFL Media reported that rule had changed, so teams could be scheduled (don’t say drawn, because nothing about the fixture is random) to play opponents within their group of six four times. The AFL said the change added more flexibility to the fixture, but the real impact will be a bolstering of the equalisation measure. And they didn’t miss last year’s grand finalists and perennial top four aspirants Geelong with their first swing. Five of the Cats’ double-ups are against teams who finished in the top seven last season. They will play top six teams Brisbane Lions, Collingwood, Adelaide and Gold Coast twice.\n\nBrisbane Lions, the reigning premiers, only play two teams that finished in the top eight last year in their first nine matches after enduring the toughest draw last season. Of course, the top six never repeats itself and a team always rises unexpectably from the bottom of the ladder. But on face value, the drive to get a different mix at the top of the ladder is on. Again, it’s clear which teams the league and the broadcasters expect to shine and which they expect to stumble. Wanganeen-Milera remains a huge St Kilda drawcard Credit: AFL Photos via Getty Images Poor old North Melbourne fans have not been done any favours; their poor form has not won enough of an audience to find primetime slots, while West Coast are a sleeping giant that has been asleep so long the free-to air-broadcasters put them in the sin bin.\n\nThe Bombers have been sent away from primetime to regroup. They have only two Friday night clashed handed to them – the first cashing in on Zach Merrett’s failed attempt to get to the Hawks, the second the traditional Dreamtime at the ’G clash against Richmond. Merrett will face footy’s unrequited love match on Friday night at the MCG in round one. Loading St Kilda will unleash their recruits Tom De Koning and Jack Silvagni against Carlton in round eight, while the Leek Aleer controversy might fuel emotions when they play the Giants in round three at Engie Stadium. Carlton have been given a chance but won’t be seen again if the wheels fall off their season early without Charlie Curnow. The Blues play in four of the first seven Thursday night clashes, plus Good Friday against the Kangaroos, but there are no primetime promises thereafter. Hawthorn are the biggest drawcard in town as their watchable and sometimes controversial style attracts viewers in primetime spots while Collingwood just get the job done every season. Their opening round Saints blockbuster will be backed up by a grudge match at the MCG against the Crows in round one.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/australia-s-spearheads-fell-but-an-ashes-cult-hero-rubbishes-transition-fears-20251112-p5nes5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia’s spearheads fell, but an Ashes cult hero rubbishes transition fears",
    "publish_date": "Thu, 13 Nov 2025 12:40:03 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Former Test paceman Michael Kasprowicz says Ashes-hopeful Brendan Doggett is ready to answer an Australian SOS if called upon, rubbishing fears the national set-up would be caught reeling from a transition crisis.\n\nDoggett – named in the first Test squad to face England as cover for Mitchell Starc, Josh Hazlewood and Scott Boland – showed why he was being groomed as the next fast bowler in line, taking six wickets against Tasmania this week.\n\nA debut could arrive earlier than expected, after Hazlewood and fellow squad member Sean Abbott failed to finish NSW’s Sheffield Shield clash against Victoria. Abbott has been ruled out, while Hazlewood was cleared to play the series opener.\n\nBrendan Doggett continues to push his case for a baggy green. Credit: Getty Images\n\nDoggett’s career has surged since moving from Queensland to South Australia, with his first innings five-wicket haul his second in two matches. Those efforts followed 11 scalps in last summer’s Shield final.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-drifts-higher-20251113-p5nf0g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX stumbles after surprise jobs report; Webjet slumps",
    "publish_date": "Thu, 13 Nov 2025 12:37:18 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket has dropped sharply after a surprise fall in the unemployment rate further dampened chances of an interest rate cut in the near term.\n\nThe S&P/ASX 200 was marginally in the red heading into the announcement but dropped steeply when the report came in, losing more than 1 per cent at one stage. It was down 64.7 points, or 0.7 per cent, at 8734.8 just after midday, with energy stocks and tech firms pacing the losses. The news boosted the Australian dollar. It was trading at US65.53¢.\n\nThe Australian sharemarket had a negative start to the trading day. Credit: Louie Douvis\n\nThe unemployment rate dropped to 4.3 per cent in October, while fresh data from the Australian Bureau of Statistics showed the number of people in jobs jumped by 42,200 as the number of unemployed people fell by 17,000.\n\nThe news comes after last month’s rise in unemployment to 4.5 per cent, the highest in four years - although that figure was revised down to 4.4 per cent in the latest release. Reserve Bank governor Michele Bullock earlier this month kept rates on hold, saying the unemployment figure could be volatile and that there were signs the labour market was stronger than the bank had expected.",
    "source": "SMH",
    "cluster_id": 6
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/settle-in-for-the-weekend-at-a-renovated-cottage-in-the-dandenong-ranges-20251113-p5nf6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Settle in for the weekend at a renovated cottage in the Dandenong Ranges",
    "publish_date": "Thu, 13 Nov 2025 12:07:26 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nMicawber Quarters is just a stone’s throw from sibling pub the Micawber Tavern.\n\nMicawber Tavern in Belgrave even has accommodation attached.\n\nPub dining$$$$\n\nFancy a tranquil group getaway that’s not too far from the city and has a pub within walking distance? Book Belgrave’s recently renovated Micawber Quarters, a well-appointed four-bedroom house in leafy surrounds, a stone’s throw from sibling pub the Micawber Tavern.\n\nIt’s been acquired by Julien Moussi, whose Only Hospitality group includes the Beehive Hotel in Hawthorn and Hotel Collingwood. An “Irish parma” with black pudding and McDonnells curry sauce is a star of the tavern’s winter menu.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/politics/nsw/sydney-trains-employee-stood-down-after-attending-neo-nazi-rally-20251113-p5nf63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney Trains employee stood down after attending neo-Nazi rally",
    "publish_date": "Thu, 13 Nov 2025 12:06:23 +1100",
    "category": "finance",
    "authors": [
      "Michael Mcgowan"
    ],
    "text": "A Sydney Trains employee has been stood down while the agency investigates his involvement in an anti-Jewish protest outside NSW Parliament organised by a group of neo-Nazis.\n\nCooper Stephens was among the 60-odd black-clad members of the National Socialist Network who rallied alongside a banner reading “Abolish the Jewish lobby” and shouted Hitler Youth slogans last Saturday.\n\nSydney Trains have stood down Cooper Stephens (front centre) after he participated in Saturday’s rally outside NSW Parliament House.\n\nThe Herald understands Stephens, based in south-west Sydney, works as a train guard for the state government agency. In a statement, a spokesman for Sydney Trains said it was “very concerned with the matter”.\n\n“In the interim, Sydney Trains has directed the employee not to attend work while the matter is examined,” the spokesman said.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/china-s-pilbara-killer-is-finally-on-the-prowl-20251113-p5nf1z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "China’s ‘Pilbara Killer’ is finally on the prowl",
    "publish_date": "Thu, 13 Nov 2025 12:04:43 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "In commodities, the cost curve dictates competitiveness. Simandou might be a big resource, and the ferrous content of its ore – which is between 64 and 67 per cent compared with the two biggest Pilbara producers’ 60 to 62 per cent – makes it attractive in an emissions-reducing environment. Loading It won’t, however, be a low-cost producer. Its “all-in” costs, because of the capital intensity of the infrastructure needed to get it to the port, are around $US55 to $US60 a tonne. It’s also about 14,000 kilometres further from China than the Pilbara, so shipping costs will be greater. BHP, the industry’s low-cost producer, has all-in costs of just under $US20 a tonne. Rio’s are about $US25 a tonne and Fortescue’s about $US35 a tonne, although the quality of its ore, at about 56 per cent Fe, is lower than its main Pilbara rivals’ ore and attracts discounts.\n\nThat means, while it might be able to gain higher margins selling its ore to “green steel” producers, Simandou won’t be able to drive the ore coming from BHP, Rio or Fortescue out of the market, even if China would like to do so. The Guinean government’s 15 per cent stake in Rio and Chinalco’s two of the project’s four blocks, and a similar interest in the infrastructure, is also an inhibitor to any attempts to drive prices down beyond the impact of the extra tonnes. Unlike China, Guinea wants to maximise the prices received, not diminish them. It would prefer to see Simandou targeting green steel producers in Europe, rather than compete with the Pilbara producers in supplying China, although most of Simandou’s volumes will inevitably go to Chinese mills. China this year lifted the pressure on Australia’s iron ore miners, with its iron ore bargaining group – China Minerals Resources Group – halting purchases of BHP’s Jimblebar blend in September. Credit: Bloomberg While there will almost certainly be price impacts from introducing big volumes of new ore to the market, the positions of the Australian producers on the industry cost curve means that they can still generate big margins and profits, even if prices sink.\n\nIt is the marginal producers – the Chinese domestic producers and Indian miners whose costs are closer to $US80 a tonne – whose survival could be at risk from Simandou. BHP would still be generating gross margins of 60 per cent at those price levels. The introduction of Simandou’s ore to the market, and China’s interests in the project, will, however, give China more leverage in price negotiations with the Australian miners. Loading China has long sought to blunt the pricing power the miners gained in 2010 when BHP’s Marius Kloppers effectively forced the industry into adopting market-related pricing. Before 2010, the industry norm saw Japanese and Chinese buyers (usually led by the Japanese) negotiating directly with each miner and then using the lowest price as the benchmark for all the West Australian miners.\n\nThis year, with steel production and therefore demand for iron ore softening, China’s iron ore bargaining group – China Minerals Resources Group – halted purchases of BHP’s Jimblebar blend in September and told mills and traders not to buy US-denominated cargoes at China’s ports in an attempt to gain lower prices and force BHP and the other Australian producers to trade in Chinese renminbi, not US dollars. Last month, BHP is reported to have agreed to settle 30 per cent of its iron ore spot trading in RMB. For China, that reduces exchange rate risks and transaction costs, possibly gives it another point of leverage in pricing negotiations and adds to its efforts to make its currency a viable alternative to the US dollar in commodity trades. Throw the Simandou ore into the mix and the Pilbara miners are entering a new phase in the iron ore market’s development, one in which – in a market with more supply, where demand is weakening – they lose some negotiating leverage and China gains some.\n\nSimandou may also factor in a different power play. Before the 2008 financial crisis, Rio, concerned that BHP was stalking it for a takeover, made a massively over-priced, debt-funded acquisition of Alcan that undermined its financial stability. BHP still made a bid, but China’s Chinalco seized the moment and bought 14.9 per cent of the shares in Rio’s London-listed entity (about 11 per cent of the dual-listed entity’s total issued capital). The companies later announced a series of deals through which Chinalco would take up minority interests, whether directly or indirectly, and have representation at both the board and assets levels in most of Rio’s major businesses. A BHP bid for Rio did eventuate, but it was later pulled as the extent of the financial crisis became clear.\n\nA subsequent proposal to combine BHP’s Pilbara assets with Rio’s in a joint venture eventually torpedoed the Chinalco deals. While the joint venture never eventuated, its proposal had served BHP’s purpose of keeping Rio, and its WA iron ore assets in particular, out of China Inc’s clutches. Loading The Chinalco shareholding in Rio, however, has remained and has been an obstacle to any Rio ambition to undertake capital management, or use its shares in an acquisition. Chinalco can’t increase its $20 billion holding (which would be the effect of a share buyback) without regulatory approvals it would be unlikely to gain, and doesn’t want to be diluted. There have, however, been recent reports that with Rio now being led by a new chief executive, Simon Trott, the companies have been discussing a potential equity-for-assets swap, under which Rio would exchange direct interests in some assets for Chinalco’s shareholding and free up its balance sheet options. It seems a reasonable assumption that Rio’s 42.5 per cent interest in its half of the Simandou project would be one of the earlier starting points for any serious discussions.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/afl/see-the-full-2026-fixture-magpies-the-afl-s-primetime-kings-and-rankine-will-return-to-face-them-20251113-p5nf5d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL fixture 2026: Magpies the primetime kings – and Rankine will return to face them",
    "publish_date": "Thu, 13 Nov 2025 12:00:00 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "The AFL is banking on Collingwood and Carlton being primetime kings once again, while North Melbourne have been banished from the spotlight as the league released the full 2026 fixture on Thursday.\n\nThe Magpies have emerged as primetime darlings, appearing on either a Thursday or Friday in six of their opening 10 rounds. Collingwood will face Adelaide in round one at the MCG – a highly anticipated grudge match that will likely mark the return of Izak Rankine for the first time since his suspension for using homophobic language against a Pies opponent the last time they met.\n\nPatrick Cripps evades a Harry Perryman tackle. Credit: Getty Images\n\nThe Blues have four of the first seven Thursday night matches and Good Friday match against North Melbourne. That includes new Swan Charlie Curnow’s first-up match against his old side in the opening round clash between Carlton and Sydney on March 5.\n\nNorth Melbourne – who finished the 2025 season with only five wins – have no free-to-air matches in the first 15 rounds except for their Good Friday match against Carlton.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/liberal-party-dumps-net-zero-by-2050-target-from-policy-platform/vol0x5gcq",
    "title": "Liberal Party dumps net zero by 2050 target from policy platform",
    "publish_date": "Thu, 13 Nov 2025 01:58:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Liberal Party has dumped the net zero by 2050 emissions reduction target from its policy platform, four years after adopting it under former leader Scott Morrison.\n\n\n\n\n\nThe position now aligns with its junior coalition partner, the Nationals, who officially dropped the target earlier this month after their post-election policy review.\n\n\n\n\n\nIt signifies a break in bipartisan support for net zero, which was legislated by Prime Minister Anthony Albanese in 2022.\n\n\n\n\n\nThe exact wording of their commitment will be revealed by Opposition leader Sussan Ley at about 2pm on Thursday, but the platform will not mention the 2050 emissions reduction deadline, according to a senior Liberal source.\n\n\n\n\n\nIt follows a three-hour meeting of the Liberal frontbench, a day after a five-hour wider party room debate, during which each party member articulated their views.\n\n\n\nA senior Liberal source revealed that 28 Liberal members opposed any reference to net zero in the party's future policy.\n\n\n\n\n\nSBS News understands 17 members championed the net zero target, and the position of four members was unclear.\n\n\n\n\n\nDuring the meeting, the party room backed a set of principles to underpin their climate and energy agenda, with climate change and energy spokesperson Dan Tehan revealing that \"energy affordability\" was its first focus.\n\n\n\n\n\n\"The second principle is that we have to be serious when it comes to addressing emissions reduction, because we want to be able to show very clearly that this is an issue, that the whole party room takes seriously,\" Tehan told reporters on Wednesday.\n\n\n\nTehan, who has lead a committee into the policy area, is now expected to enter talks about the Coalition's policy more broadly with Nationals negotiators, including Senator Matt Canavan, Ross Cadell and Susan McDonald.\n\n\n\n\n\nIt is unclear how the Coalition will navigate the discussion with voters in urban seats, where a larger portion of voters demand action on climate change and net zero is seen as a proxy for the issue.\n\n\n\nAlbanese says Coalition taking 'Australia backwards'\n\nPrime Minister Anthony Albanese was critical of the Coalition infighting, stating industry needs certainty for long-term investment.\n\n\n\n\n\n\"The Coalition are choosing to take Australia backwards. They’re walking away from jobs for Australians, and investment certainty for business,\" he told reporters on Thursday morning.\n\n\n\n\n\n\"They’re walking away from climate action because they fundamentally do not believe in the science of climate change.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/tax-evasion-ato-tip-offs-whistle-blowers/76liegaum",
    "title": "Nearly 1,000 a week: The 'dodgy' behaviours Australians are tipping off the tax office about",
    "publish_date": "Thu, 13 Nov 2025 00:30:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians made almost 50,000 tip-offs about tax evasion in the 2024-2025 financial year, according to the Australian Taxation Office (ATO).\n\n\n\n\n\nBack in July 2019, the ATO launched its public whistleblower service, encouraging Australians to report businesses and individuals they suspected of committing tax evasion or other similar conduct.\n\n\n\n\n\nOn Thursday, the ATO said there had been more than 300,000 tip-offs from the Australian public about tax avoidance and \"other dishonest behaviours\" since it launched the service six years ago.\n\n\n\n\n\nThe tax office said it receives almost 1,000 tip-offs every week from people who know or strongly suspect a business or individual is committing tax evasion.\n\n\n\nWhat behaviours did Australians tip off the ATO about?\n\nAccording to the ATO, the behaviours that people reported to the tax office in the last financial year included businesses and individuals who didn’t declare their income, lived lifestyles that didn't match their known income, or failed to report all sales.\n\n\n\n\n\nBut the ATO said the majority of tip-offs related to the 'shadow economy' — economic activity that is not reported or taxed, such as demanding cash payment for work or incorrectly claiming business expenses.\n\n\n\nThe ATO said this behaviour results in billions of dollars in lost taxes every year.\n\n\n\n\n\nATO assistant commissioner Tony Goding said businesses that dodge tax and super obligations were stealing from fellow Australians: \"freeloading on honest businesses and the rest of the community\".\n\n\n\n\n\n\"It's unfair competition and it's illegal. And when you’re caught, you don’t just have to cough up the tax. You’ll also face significant penalties plus interest on unpaid taxes and possibly even criminal sanctions.\"\n\n\n\nWhere did most tip-offs come from?\n\nNSW was the state with the highest number of tip-offs in 2024-25, at 15,907.\n\n\n\n\n\nVictorians lodged 11,890 tip-offs, with Queensland behind at 10,630.\n\n\n\nREAD MORE Sussan Ley announces plan to give Australians income tax cuts, without details or costings\n\nThe ATO said that while Sydney and Melbourne attracted the highest number of tip-offs, of the top five regional areas for tip-offs, most were in Queensland.\n\n\n\n\n\nNewcastle, NSW, topped the list of regional areas for tip-offs, before Robina, the Sunshine Coast hinterland, Townsville and Toowoomba — all in Queensland.\n\n\n\nWhat industries have had an increase in tip-offs?\n\nThe ATO said three industries had experienced a surge in red flags this year.\n\n\n\n\n\nThose were the building and construction industry, hospitality businesses such as cafés and restaurants, and hairdressing and beauty services.\n\n\n\n\"With tip-offs often coming from customers, employees, other businesses, and even family and friends, the community is clearly fed up with dodgy behaviours and is stepping up to help us make things fairer,\" Goding said.\n\n\n\nWhat happens when the ATO receives a tip-off?\n\nGoding said that when the ATO receives information through a tip-off, it cross-checks that information and assesses whether further action is required.\n\n\n\n\n\nIn the last financial year, around 85 per cent of tip-offs the ATO analysed were found to be suitable for further investigation.\n\n\n\n\n\nGoding said investigations were carried out by specialised teams within the ATO who then shared information with cross-agency partners, including the Shadow Economy Taskforce.\n\n\n\n\n\nThe taskforce is an ATO-led joint agency that also includes the Australian Federal Police, Australian Border Force, Fair Work Ombudsman and others.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ukraines-zelenskyy-orders-ministers-to-quit-over-100-million-energy-scandal/9kvi1z57o",
    "title": "Ukraine's Zelenskyy orders ministers to quit over $100 million energy scandal",
    "publish_date": "Wed, 12 Nov 2025 23:57:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUkrainian President Volodymyr Zelenskyy has called for the removal of Ukraine’s justice and energy ministers amid a wide-reaching corruption scandal involving the state nuclear power company.\n\n\n\n\n\n\"I believe that the Minister of Justice and the Minister of Energy cannot remain in office. This is, among other things, a matter of trust. If there are accusations, they must be addressed. The decision on suspension from office is prompt, as swift as possible. I have asked the Prime Minister of Ukraine to ensure that these ministers submit their resignations. I ask the MPs to support these resignations.\"\n\n\n\n\n\nThe announcement came after Ukraine’s anti-corruption agency detained five people and identified seven other suspects in a major graft investigation involving alleged kickbacks worth around $100 million in the energy sector.\n\n\n\n\n\nThe National Anti-Corruption Bureau did not identify the suspects but said they include a businessman believed to be the mastermind, a former adviser to the energy minister, and an executive with the power company Energoatom.\n\n\n\n\n\nThe agency also accused eight people of bribery, abuse of office and possession of disproportionate assets on Tuesday.\n\n\n\n\n\nPresident Zelenskyy says the existence of any type of illegal schemes in country’s energy sector is “absolutely unacceptable.”\n\n\n\n\n\n\"Right now, it is extremely difficult for everyone in Ukraine – enduring power outages, Russian strikes, and losses. It is absolutely unacceptable that, amid all this, there are also some schemes in the energy sector. I will sign a decree to impose sanctions on two individuals implicated in the NABU (National Anti-Corruption Bureau) case concerning Energoatom (national atomic Energy company).\"\n\n\n\n\n\nKyiv resident Dr Ohla Mylanevska says it's hard for the Ukrainian people to hear about this.\n\n\n\n\n\n\"There's a very unpleasant feeling of what awaits us. We do not understand. This is especially true for elderly people who live in apartment buildings and do not have the means to buy themselves any kind of power generators, can't even use simple oil radiators to keep themselves warm because they can't afford it. And so the people are really stressed.\"\n\n\n\n\n\nTop government officials and associates close to Mr Zelenskyy are implicated in the scandal.\n\n\n\n\n\nPrime Minister Yuliia Svyrydenko says Justice Minister Herman Halushchenko would be suspended from his post, and Energy Minister Svitlana Hrynchuk has submitted her resignation.\n\n\n\n\n\nKyiv-based political analyst Oleh Saakian says this is a test of the effectiveness of Ukraine's law enforcement agencies.\n\n\n\n\n\n\"We are talking about a vertically integrated corruption scheme that concerns the energy sector. And maybe we will even learn about the defence sector. The only thing to note is that so far this is just gossip, it is a media war, and evidence must be provided in the court process. So let's see how effectively law enforcement agencies and anti-corruption agencies are able to do their job.\"\n\n\n\n\n\nZelenskyy was pressured to restore the independence of Ukraine's anti-graft agencies last summer, overturning a short-lived law that would have undermined their independence and which provoked mass protests.\n\n\n\n\n\nMr Saakian says for Ukraine's anti-corruption agencies, it's a battle for survival.\n\n\n\n\n\nAnd he says it is important for Ukraine to be seen to be capable of fighting corruption if it is to be fully accepted as a democratic European state.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/victoria-aboriginal-treaty-agreement-signed-into-law/qy0tg1sv2",
    "title": "'Side by side': Australia's first treaty with Aboriginal people signed into law in Victoria",
    "publish_date": "Wed, 12 Nov 2025 23:50:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "The signing of Australia's first treaty with Aboriginal people has been hailed as a historic moment and just the beginning of hard work still to come.\n\n\n\n\n\nThat's according to Victorian Premier Jacinta Allan, who described finalising a Statewide Treaty Agreement as the start of a new chapter in Victoria's story and something once thought impossible.\n\n\n\n\n\nAllan and First Peoples' Assembly of Victoria co-chairs Ngarra Murray and Rueben Berg signed the agreement at a formal ceremony at Government House on Thursday morning.\n\n\n\n\n\nIt then received Royal Assent from the state's Governor Margaret Gardner.\n\n\n\nREAD MORE Victoria makes history as Treaty legislation passes Parliament\n\nWhat does the bill do?\n\nUnder the bill, the state's Indigenous representative body has been granted expanded powers and acts as a voice to parliament which the government must consult on laws and policies affecting Aboriginal Victorians.\n\n\n\n\n\nThe body, elected by Aboriginal people in Victoria, is independent from government and will operate out of a dedicated room at Parliament House.\n\n\n\n\n\nThe treaty applies to the entire state but also allows for local groups to negotiate their own agreements.\n\n\n\nAllan said the treaty created a partnership of the oldest continuing culture in the world with modern institutions.\n\n\n\n\n\n\"Today is a recognition that ancient systems of law and the modern institutions of our democracy can stand side by side,\" Allan told a crowd at Government House.\n\n\n\n\n\n\"But today also carries a deeper meaning, it is quite literally two worlds meeting in respect and in partnership.\"\n\n\n\n'These words cannot disappear'\n\nBerg thanked people who had advocated for treaty \"across generations\" and said Victoria now sat equal among other Commonwealth jurisdictions internationally that already had agreements in place.\n\n\n\n\n\n\"Words are cheap, but these words now in a treaty in legislation, these words cannot disappear,\" he said.\n\n\n\n\n\n\"We will make sure that we deliver on these promises that are set out in this process.\"\n\n\n\nGardner said the treaty was an expression of the democratic will of Victorian people and a historic achievement of modern parliamentary democracy.\n\n\n\n\n\nCheers rang out in the state parliament as the legislation formally passed the upper house late last month.\n\n\n\n\n\nIt came after about a year of negotiations between the government and First Peoples' Assembly of Victoria following a truth-telling inquiry exposing the mistreatment of Aboriginal people since colonisation.\n\n\n\nState coalition opposes treaty\n\nVictoria's coalition opposition does not support the treaty and vowed to repeal it if it wins government at the next state election in November 2026.\n\n\n\n\n\nNationals MP and opposition spokeswoman for Aboriginal affairs Melina Bath said the coalition instead favoured the creation of a standalone body overseen by a minister.\n\n\n\n\n\n\"The legislation speaks about closing the gap twice,\" Bath said.\n\n\n\nREAD MORE Victorian Coalition pledges to tear up Treaty laws if elected in 2026\n\n\"The Liberals and Nationals focus needs to be on supporting those Victorians, our Victorians, our First Nations people to close the gap and bring a better outcome for indigenous people.\"\n\n\n\n\n\nA public celebration marking the treaty's signing is due to be held in December.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/ukrainian-ministers-resign-over-alleged-involvement-in-corruption-scandal/8yn7t9426",
    "title": "Ukrainian ministers resign over alleged involvement in corruption scandal",
    "publish_date": "Wed, 12 Nov 2025 20:20:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ukraine's energy and justice ministers resigned on Wednesday, the government said, over their alleged involvement in a sweeping corruption scandal in the country's energy sector.\n\n\n\n\n\nInvestigators alleged a key ally of President Volodymyr Zelenskyy orchestrated a $100-million kickback scheme to siphon off funds, triggering public anger at a time of widespread power outages caused by Russian attacks.\n\n\n\n\n\nUkraine has long been plagued by corruption and cracking down is seen as a key requirement of its bid to join the European Union.\n\n\n\n\n\nZelenskyy earlier called for the resignation of his justice minister German Galushchenko, who investigators alleged received \"personal benefits\" in the scheme, as well as energy minister Svitlana Grynchuk.\n\n\n\n\n\nNeither is known to have been charged and Grynchuk has not been mentioned as having profited from the scheme.\n\n\n\n\n\n\"The minister of justice and the minister of energy cannot remain in their positions,\" Zelenskyy said in a video posted on social media.\n\n\n\nShortly afterwards, both submitted letters of resignation, Ukraine's Prime Minister Yulia Svyrydenko said.\n\n\n\nOutcry from Ukrainian people\n\nThe scandal has triggered outcry among Ukrainians, who are suffering frequent heating and electricity outages from the Russian bombings.\n\n\n\n\n\n\"It's disgusting,\" Davyd, a 24-year-old content creator, told the Agence France-Presse news agency, declining to give his surname.\n\n\n\n\n\n\"They're destroying us, our reputation, and our future. We won't have a future if we have crooks like that,\" he said, expressing concern over how the scandal would play among Ukraine's crucial backers in the EU.\n\n\n\n\n\nThe allegations, unveiled earlier this week, centre on kickbacks from contracts involving Energoatom, the state nuclear operator and country's most important electricity provider.\n\n\n\n\n\nGrynchuk replaced Galushchenko as energy minister in the summer.\n\n\n\nUkraine's parliament needs to formally approve both their resignations.\n\n\n\n\n\nThe opposition party of former president Petro Poroshenko called for the government to resign.\n\n\n\n\n\nThis week, anti-corruption officials have detained several people in the operation.\n\n\n\n\n\nOlena Boikova, 57, a retiree, said she felt \"indignation\" and called those implicated in the scheme \"internal enemies\".\n\n\n\nOrdering the ministers to step down, Zelenskyy said it was \"absolutely unacceptable that there are still some [corruption] schemes in the energy sector\" while Ukrainians are suffering daily outages.\n\n\n\n\n\nRussia has battered Ukraine's energy grid with nightly drone and missile strikes in what Ukraine calls cynical attacks that seek to plunge millions of Ukrainians into the darkness and cold through the winter.\n\n\n\nScandal presents test for Zelenskyy\n\nInvestigators say the scheme was masterminded by Timur Mindich, a former business associate of Zelenskyy.\n\n\n\n\n\nMindich co-owns the production company Kvartal 95, founded by Zelenskyy when he was a star comedian before entering politics.\n\n\n\n\n\nMindich fled the country shortly before the allegations were announced on Monday, the state border service said.\n\n\n\n\n\nZelenskyy has not commented on Mindich's role in the scheme, but Svyrydenko said she was imposing personal sanctions on him and another businessman charged, Oleksandr Tsukerman.\n\n\n\n\n\nKvartal 95, which produced Zelenskyy's Servant of the People TV series, said the investigation was not \"related to the work of the studio\".\n\n\n\nThe scandal presents a major test for Zelenskyy, who faces accusations of centralising power and silencing critics after the Russian invasion.\n\n\n\n\n\nEarlier this year, there was a massive backlash from the public and in Brussels over attempts to strip the independence of the two anti-corruption bodies that are investigating and prosecuting this case.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/cancer-survival-rates-disadvantaged-patients-study/p1od389mp",
    "title": "'Demands urgent attention': Study finds widening disparities in cancer survival rates",
    "publish_date": "Wed, 12 Nov 2025 19:44:10 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Cancer patients in disadvantaged areas are dying at higher rates than those in privileged communities as differences in survivorship grow.\n\n\n\n\n\nMedical advancements have significantly improved Australians' survival rates from one in two dying from cancer within five years in the 1980s, compared with one in four during the 2010s.\n\n\n\n\n\nBut these gains are not equally shared, according to research from the Daffodil Centre.\n\n\n\n\n\nBetween 1980 and 1989, the death rate of cancer patients living in the most disadvantaged parts of NSW was four per cent higher than those in the most advantaged areas.\n\n\n\nREAD MORE This new Australian skin cancer test takes seconds — and could save thousands of lives\n\nBy the 2010s, the difference had swelled to 35 per cent.\n\n\n\n\n\n\"There's a really big equity gap that demands urgent attention,\" author and Daffodil Centre research stream lead Julia Steinberg told AAP.\n\n\n\n\n\nThe study analysed data from almost one million people diagnosed with cancer in NSW across four decades.\n\n\n\nIt found widening disparities across a range of cancers including breast, melanoma, colorectal, lung and stomach.\n\n\n\n\n\nWhile the gaps were driven by a number of factors, early detection played a key role, Associate Professor Steinberg said.\n\n\n\n\n\nThe introduction of early cancer screening programs in the past two decades has significantly improved survival.\n\n\n\n\n\nMore than half of those whose cancer had spread to other parts of the body at time of diagnosis died within a year.\n\n\n\nBut only four per cent of people whose cancer is limited to a certain part of the body at diagnosis died during that period.\n\n\n\n\n\nPeople in more disadvantaged areas are, however, less likely to take part in these screening programs and are more often diagnosed with advanced cancer.\n\n\n\n\n\nSome of this could be attributed to language barriers, according to Cancer Council NSW policy advocacy manager Brad Gellert.\n\n\n\n\n\nEnglish is not a first language for many living in disadvantaged communities, which means they struggle to access or understand Australia's health system, and can experience medical racism.\n\n\n\n\n\nDisadvantaged Australians are more likely to have other conditions such as heart disease, that can affect cancer treatment decisions and survival.\n\n\n\nMany less advantaged places can also be more remote, reducing patients' access to cancer care due to distance and the associated higher costs.\n\n\n\n\n\n\"Whilst overall cancer survival rates are improving, this research makes it clear that some groups are being left behind,\" Mr Gellert said.\n\n\n\n\n\nHe has urged the government to focus on strategies lift screening rates for low socioeconomic status communities and offer support to address financial barriers to treatment.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-sbs-portuguese-speaks-to-assistant-climate-change-minister-josh-wilson-at-cop30/oaze4njh7",
    "title": "INTERVIEW: SBS Portuguese speaks to Assistant Climate Change Minister Josh Wilson at COP30",
    "publish_date": "Wed, 12 Nov 2025 07:08:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/property-investor-loans-at-record-market-sentiment-bullish-despite-down-day/zzimwrjub",
    "title": "Property investor loans at record & market sentiment bullish despite down day",
    "publish_date": "Wed, 12 Nov 2025 06:54:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/adhd-medications-are-poisoning-more-australians/62fnke95i",
    "title": "As ADHD medications cause a rise in poisonings, experts call for a key change",
    "publish_date": "Wed, 12 Nov 2025 04:46:48 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Key Points The number of Australians being poisoned by ADHD medication was four times higher in 2023 compared to 2014.\n\nResearchers say the majority of poisonings were accidental.\n\nClonidine resulted in a disproportionately high number of poisonings and hospital admissions, according to data.\n\nThe number of Australians being poisoned by attention-deficit hyperactivity disorder (ADHD) medications is on the rise , with experts warning of \"serious\" side effects such as breathing difficulties and low blood pressure.\n\n\n\n\n\nAt least 3,242 cases were recorded in 2023, and more than 8,000 people sought hospital treatment for ADHD medication poisoning in the decade leading up to that year, according to new research from the University of Sydney based on national data from the NSW Poisons Information Centre.\n\n\n\n\n\nDuring 2023–24 there were over 4.6 million prescriptions for ADHD-related medications dispensed to just under 600,000 patients (an average of 8 prescriptions per patient), according to the Australian Institute of Health and Welfare. The vast majority of those prescriptions, 87 per cent, were for psychostimulants including Ritalin.\n\n\n\n\n\nAmy Thompson, a PhD candidate at the University of Sydney's school of pharmacy, told SBS News ADHD medication poisoning can cause \"respiratory issues, hypotension and dizziness\".\n\n\n\n\n\nChildren were more likely to have an \"adverse exposure\" to ADHD medication, with 72 per cent of accidental poisonings affecting children under 15 years of age.\n\n\n\nWhat is considered poisoning?\n\nDr Greg Kyle, a clinical pharmacist at Metro South Health in Queensland, told SBS News: \"Poisoning occurs when you have an effect that goes beyond what you would normally expect from that medication.\"\n\n\n\nKyle said poisoning is different to receiving too high a dose, as not everyone will react the same way.\n\n\n\n\n\nDetermining the correct dose and type of medication to give someone goes beyond metrics like body weight.\n\n\n\n\n\n\"We need to adjust dosages according to people's different characteristics, and that's why we don't have a one-size-fits-all approach to dosing,\" he said.\n\n\n\n\n\n\"It's not just a case of saying 'we've got a 50 kilo 12-year-old, we will give them half the dose of a 100 kilo adult', it doesn't always work that way.\"\n\n\n\nWhat's behind the rise in cases?\n\nThe number of Australians diagnosed with ADHD more than doubled between 2013 and 2020, which partly explains why poisonings are on the rise, Thompson said.\n\n\n\n\n\nBut poisonings related to the medication — clonidine — are \"disproportionately high\".\n\n\n\n\n\n\"Just one double dose of clonidine can put a child in hospital and with side effects this serious, it's vital that both families and healthcare professionals are aware of the dangers and providing families with guidance,\" Thompson said.\n\n\n\nClonidine is one of six medications used in the treatment of ADHD, along with atomoxetine, dexamphetamine, guanfacine, lisdexamfetamine and methylphenidate (known under the brand name Ritalin).\n\n\n\n\n\nClonidine and methylphenidate were the two most common medications implicated in poisonings, each resulting in 35 per cent of all reports, respectively.\n\n\n\n\n\n\"One problem can be that medicines are sometimes prescribed at quarter or half-doses of tablets, which can be tricky to administer accurately,\" Thompson said.\n\n\n\n\n\n\"Another reason can be miscommunication within the family, typically where both parents give their child a dose of medication, not realising the other has already done it.\n\n\n\n\n\n\"Children can also be curious and try out their siblings' medication, underscoring the importance of storing medicines safely out of reach.\"\n\n\n\nCall for better dosing options\n\nWhile the reasons clonidine poisonings are overrepresented in the data are unknown, Kyle said the small tablets can be harder to administer.\n\n\n\n\n\n\"It's very, very small doses that can be hard to administer because these tablets are not huge,\" he said.\n\n\n\n\n\n\"There's no clonidine mixture available on the Pharmaceutical Benefits Scheme to enable much finer control of dosing for ADHD.\"\n\n\n\nREAD MORE ADHD and autism: Experts urge caution as social media blurs diagnostic boundaries\n\nWhile historically used to relieve blood pressure, clonidine is now also used to treat migraines, besides ADHD.\n\n\n\n\n\nKyle suggested the industry should explore whether a more suitable alternative form of clonidine dosing could be made available.\n\n\n\n\n\nExperts stress ADHD medication is safe in the recommended dose.\n\n\n\n\n\nThompson and Kyle both recommended keeping medications out of reach of children, and to call poison control on 13 11 26 if you suspect someone is having adverse effects from medication.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/delivery-service-menulog-closing-services-in-australia/cdgf5v387",
    "title": "Food delivery service Menulog closing down after nearly two decades",
    "publish_date": "Wed, 12 Nov 2025 03:49:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "After 20 years delivering meals and ad campaigns featuring stars such as Snoop Dogg and Katy Perry, Menulog is shutting down its Australian operations.\n\n\n\n\n\nThe popular food delivery service will stop trading on 26 November, the company announced on Wednesday, in a move that will cut 120 jobs and reduce competition in the market.\n\n\n\n\n\nThe Transport Workers Union (TWU) said the closure would come as a shock to delivery workers, who had been fighting for better employment conditions.\n\n\n\n\n\nThe announcement also follows the closure of Deliveroo in 2022 and Foodora in 2018, despite growth in the food delivery market.\n\n\n\n'Workers are still languishing'\n\nMenulog, which was founded in Sydney in 2006, was one of Australia's most popular food-delivery apps, according to Roy Morgan, second only to Uber Eats in 2022.\n\n\n\n\n\nThe decision to close the business had been challenging, Menulog managing director Morten Belling said, and the two-week notice of its closure was designed to allow customers to redeem vouchers and credits.\n\n\n\n\n\n\"Today is a tough day for the Menulog business, and I would like to reassure everyone this decision was not taken lightly,\" he said.\n\n\n\n\n\n\"Our priority now is to support our customers, couriers and partners.\"\n\n\n\n\n\nThe company, which was acquired by Dutch firm Just Eat Takeaway.com in 2020, will offer some of its delivery couriers four-week redundancy payouts.\n\n\n\n\n\nThe news would come as a shock to thousands of couriers, TWU national secretary Michael Kaine said, and highlighted employment instability in the industry.\n\n\n\n\n\n\"We will be working to ensure those workers receive pay for their work and fair exit payments over the coming weeks,\" he said.\n\n\n\n\n\n\"In the gig economy, workers are still languishing with below-minimum wage rates, no sick leave or superannuation and deadly pressure to rush to make a living and avoid being deactivated.\"\n\n\n\nThe federal government introduced closing loopholes laws in 2024 that introduced minimum standards for employee-like workers, and allowed the Fair Work Commission to set minimum standards for gig economy workers.\n\n\n\n\n\nRemaining delivery services should back the changes urgently, Kaine said, to ensure couriers have confidence in their employment conditions.\n\n\n\n\n\n\"DoorDash, Uber Eats, Hungry Panda and Easi now need to come to the table to ensure we get standards in place as soon as possible,\" he said.\n\n\n\n\n\nMenulog's closure will see the departure of the only food-delivery service that began in Australia, and comes after the withdrawal of Deliveroo in November 2022, which impacted 120 jobs.\n\n\n\n\n\nThe closures come despite growth in the market, with Statista reporting more than 8.3 million Australians used food delivery services in 2024 and predictions from Mordor Intelligence that the food service market would grow by 11.45 per cent annually.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-ley-prepares-to-dump-net-zero-targets-as-liberals-reject-policy-fresh-epstein-emails-allege-that-trump-knew-about-the-girls-20251113-p5nf0t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Net zero Australia LIVE updates: Liberals agree to dump 2050 target but open to carbon-neutral future; Sussan Ley, Dan Tehan to address media this afternoon",
    "publish_date": "Thu, 13 Nov 2025 13:01:45 +1100",
    "category": "finance",
    "authors": [
      "Alexander Darling",
      "Emily Kaine"
    ],
    "text": "Independent MP for the Sydney seat of Mackellar Sophie Scamps has labelled the Liberal Party as rudderless and “without conviction” as she slams the party for abandoning net zero targets.\n\n“Their net zero backdown shows they are a party without conviction, who no longer know what they stand for, or understand who they represent,” Scamps said in a statement.\n\n“For three decades now, the Liberal Party has not only failed to show leadership on the defining issue of our time but have purposefully obstructed action – which is why the clean energy transition is now so urgent. The modern-day Liberal Party is pusillanimous, duplicitous, and lacking vision,” Scamps said.\n\nIndependent MP Sophie Scamps. Credit: Peter Rae\n\nScamps won her seat at the 2022 election alongside a cohort of urban independents who challenged Moderate Liberals on a platform of climate advocacy.\n\n“They’re trying to take the country back to the coal era of the 1980s, leaving us behind the rest of the world and passing up the opportunity to be at the forefront of the global clean energy transition,” Scamps said.\n\n“The people of Australia expect their political representatives to show courage, leadership, and stability. The Liberal party is instead doing the bidding of billionaires and multinational fossil fuel corporations and being led around by the nose of the National Party.”",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/this-eastwood-restaurant-is-the-place-to-go-for-hoe-korean-raw-seafood-20251113-p5nf6t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Eastwood restaurant is the place to go for hoe (Korean raw seafood)",
    "publish_date": "Thu, 13 Nov 2025 12:55:24 +1100",
    "category": "finance",
    "authors": [
      "David Matthews"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 7 An array of dishes at GetBawi. Jennifer Soo 2 / 7 Raw seafood platter. Jennifer Soo 3 / 7 Spicy squid and jarubi jjamppong. Jennifer Soo 4 / 7 The restaurant serves live seafood. Jennifer Soo 5 / 7 The dining room. Jennifer Soo 6 / 7 Unagi. Jennifer Soo 7 / 7 Getbawi specialises in hoe, or raw seafood. Jennifer Soo Previous Slide Next Slide\n\nKorean$$$$\n\nUp the hill from K-bakery La Vigne and tucked into a shopping mall, newcomer Getbawi has quickly garnered a dedicated following. The reason? It’s one of the few Sydney restaurants specialising in hoe, or raw seafood, served here on platters with the likes of perilla leaves for wrapping. Other highlights include spicy blue swimmer crab hotpot and the textural masterpiece that is yukhoe tang tang, featuring high-grade raw beef strewn with umami-rich octopus.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/politics/western-australia/heated-debate-in-wa-parliament-20251113-p5nf7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heated debate in WA Parliament",
    "publish_date": "Thu, 13 Nov 2025 12:52:42 +1100",
    "category": "finance",
    "authors": [],
    "text": "Heated debate in WA Parliament\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/the-afl-is-selling-controversy-with-its-2026-fixture-as-two-tiers-of-supporter-groups-emerge-20251113-p5nf5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The AFL is selling controversy with its 2026 fixture as two tiers of supporter groups emerge",
    "publish_date": "Thu, 13 Nov 2025 12:41:45 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "The former rule, which was used for the first time in 2014, meant that the ladder from the previous year was split into three groups of six teams: first to six, seventh to 12th and 13th to 18th. Teams could be scheduled to play opponents within their group of six twice a maximum of three times in the next season. They then played one or two games against teams within the other grouping twice. However, on Monday AFL Media reported that rule had changed, so teams could be scheduled (don’t say drawn, because nothing about the fixture is random) to play opponents within their group of six four times. The AFL said the change added more flexibility to the fixture, but the real impact will be a bolstering of the equalisation measure. And they didn’t miss last year’s grand finalists and perennial top four aspirants Geelong with their first swing. Five of the Cats’ double-ups are against teams who finished in the top seven last season. They will play top six teams Brisbane Lions, Collingwood, Adelaide and Gold Coast twice.\n\nBrisbane Lions, the reigning premiers, only play two teams that finished in the top eight last year in their first nine matches after enduring the toughest draw last season. Of course, the top six never repeats itself and a team always rises unexpectably from the bottom of the ladder. But on face value, the drive to get a different mix at the top of the ladder is on. Again, it’s clear which teams the league and the broadcasters expect to shine and which they expect to stumble. Wanganeen-Milera remains a huge St Kilda drawcard Credit: AFL Photos via Getty Images Poor old North Melbourne fans have not been done any favours; their poor form has not won enough of an audience to find primetime slots, while West Coast are a sleeping giant that has been asleep so long the free-to air-broadcasters put them in the sin bin.\n\nThe Bombers have been sent away from primetime to regroup. They have only two Friday night clashed handed to them – the first cashing in on Zach Merrett’s failed attempt to get to the Hawks, the second the traditional Dreamtime at the ’G clash against Richmond. Merrett will face footy’s unrequited love match on Friday night at the MCG in round one. Loading St Kilda will unleash their recruits Tom De Koning and Jack Silvagni against Carlton in round eight, while the Leek Aleer controversy might fuel emotions when they play the Giants in round three at Engie Stadium. Carlton have been given a chance but won’t be seen again if the wheels fall off their season early without Charlie Curnow. The Blues play in four of the first seven Thursday night clashes, plus Good Friday against the Kangaroos, but there are no primetime promises thereafter. Hawthorn are the biggest drawcard in town as their watchable and sometimes controversial style attracts viewers in primetime spots while Collingwood just get the job done every season. Their opening round Saints blockbuster will be backed up by a grudge match at the MCG against the Crows in round one.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/australia-s-spearheads-fell-but-an-ashes-cult-hero-rubbishes-transition-fears-20251112-p5nes5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia’s spearheads fell, but an Ashes cult hero rubbishes transition fears",
    "publish_date": "Thu, 13 Nov 2025 12:40:03 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Former Test paceman Michael Kasprowicz says Ashes-hopeful Brendan Doggett is ready to answer an Australian SOS if called upon, rubbishing fears the national set-up would be caught reeling from a transition crisis.\n\nDoggett – named in the first Test squad to face England as cover for Mitchell Starc, Josh Hazlewood and Scott Boland – showed why he was being groomed as the next fast bowler in line, taking six wickets against Tasmania this week.\n\nA debut could arrive earlier than expected, after Hazlewood and fellow squad member Sean Abbott failed to finish NSW’s Sheffield Shield clash against Victoria. Abbott has been ruled out, while Hazlewood was cleared to play the series opener.\n\nBrendan Doggett continues to push his case for a baggy green. Credit: Getty Images\n\nDoggett’s career has surged since moving from Queensland to South Australia, with his first innings five-wicket haul his second in two matches. Those efforts followed 11 scalps in last summer’s Shield final.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-drifts-higher-20251113-p5nf0g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX stumbles after surprise jobs report; Webjet slumps",
    "publish_date": "Thu, 13 Nov 2025 12:37:18 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket has dropped sharply after a surprise fall in the unemployment rate further dampened chances of an interest rate cut in the near term.\n\nThe S&P/ASX 200 was marginally in the red heading into the announcement but dropped steeply when the report came in, losing more than 1 per cent at one stage. It was down 64.7 points, or 0.7 per cent, at 8734.8 just after midday, with energy stocks and tech firms pacing the losses. The news boosted the Australian dollar. It was trading at US65.53¢.\n\nThe Australian sharemarket had a negative start to the trading day. Credit: Louie Douvis\n\nThe unemployment rate dropped to 4.3 per cent in October, while fresh data from the Australian Bureau of Statistics showed the number of people in jobs jumped by 42,200 as the number of unemployed people fell by 17,000.\n\nThe news comes after last month’s rise in unemployment to 4.5 per cent, the highest in four years - although that figure was revised down to 4.4 per cent in the latest release. Reserve Bank governor Michele Bullock earlier this month kept rates on hold, saying the unemployment figure could be volatile and that there were signs the labour market was stronger than the bank had expected.",
    "source": "TheAge",
    "cluster_id": 6
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/settle-in-for-the-weekend-at-a-renovated-cottage-in-the-dandenong-ranges-20251113-p5nf6g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Settle in for the weekend at a renovated cottage in the Dandenong Ranges",
    "publish_date": "Thu, 13 Nov 2025 12:07:26 +1100",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nMicawber Quarters is just a stone’s throw from sibling pub the Micawber Tavern.\n\nMicawber Tavern in Belgrave even has accommodation attached.\n\nPub dining$$$$\n\nFancy a tranquil group getaway that’s not too far from the city and has a pub within walking distance? Book Belgrave’s recently renovated Micawber Quarters, a well-appointed four-bedroom house in leafy surrounds, a stone’s throw from sibling pub the Micawber Tavern.\n\nIt’s been acquired by Julien Moussi, whose Only Hospitality group includes the Beehive Hotel in Hawthorn and Hotel Collingwood. An “Irish parma” with black pudding and McDonnells curry sauce is a star of the tavern’s winter menu.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/politics/nsw/sydney-trains-employee-stood-down-after-attending-neo-nazi-rally-20251113-p5nf63.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney Trains employee stood down after attending neo-Nazi rally",
    "publish_date": "Thu, 13 Nov 2025 12:06:23 +1100",
    "category": "finance",
    "authors": [
      "Michael Mcgowan"
    ],
    "text": "A Sydney Trains employee has been stood down while the agency investigates his involvement in an anti-Jewish protest outside NSW Parliament organised by a group of neo-Nazis.\n\nCooper Stephens was among the 60-odd black-clad members of the National Socialist Network who rallied alongside a banner reading “Abolish the Jewish lobby” and shouted Hitler Youth slogans last Saturday.\n\nSydney Trains have stood down Cooper Stephens (front centre) after he participated in Saturday’s rally outside NSW Parliament House.\n\nThe Herald understands Stephens, based in south-west Sydney, works as a train guard for the state government agency. In a statement, a spokesman for Sydney Trains said it was “very concerned with the matter”.\n\n“In the interim, Sydney Trains has directed the employee not to attend work while the matter is examined,” the spokesman said.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/china-s-pilbara-killer-is-finally-on-the-prowl-20251113-p5nf1z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "China’s ‘Pilbara Killer’ is finally on the prowl",
    "publish_date": "Thu, 13 Nov 2025 12:04:43 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "In commodities, the cost curve dictates competitiveness. Simandou might be a big resource, and the ferrous content of its ore – which is between 64 and 67 per cent compared with the two biggest Pilbara producers’ 60 to 62 per cent – makes it attractive in an emissions-reducing environment. Loading It won’t, however, be a low-cost producer. Its “all-in” costs, because of the capital intensity of the infrastructure needed to get it to the port, are around $US55 to $US60 a tonne. It’s also about 14,000 kilometres further from China than the Pilbara, so shipping costs will be greater. BHP, the industry’s low-cost producer, has all-in costs of just under $US20 a tonne. Rio’s are about $US25 a tonne and Fortescue’s about $US35 a tonne, although the quality of its ore, at about 56 per cent Fe, is lower than its main Pilbara rivals’ ore and attracts discounts.\n\nThat means, while it might be able to gain higher margins selling its ore to “green steel” producers, Simandou won’t be able to drive the ore coming from BHP, Rio or Fortescue out of the market, even if China would like to do so. The Guinean government’s 15 per cent stake in Rio and Chinalco’s two of the project’s four blocks, and a similar interest in the infrastructure, is also an inhibitor to any attempts to drive prices down beyond the impact of the extra tonnes. Unlike China, Guinea wants to maximise the prices received, not diminish them. It would prefer to see Simandou targeting green steel producers in Europe, rather than compete with the Pilbara producers in supplying China, although most of Simandou’s volumes will inevitably go to Chinese mills. China this year lifted the pressure on Australia’s iron ore miners, with its iron ore bargaining group – China Minerals Resources Group – halting purchases of BHP’s Jimblebar blend in September. Credit: Bloomberg While there will almost certainly be price impacts from introducing big volumes of new ore to the market, the positions of the Australian producers on the industry cost curve means that they can still generate big margins and profits, even if prices sink.\n\nIt is the marginal producers – the Chinese domestic producers and Indian miners whose costs are closer to $US80 a tonne – whose survival could be at risk from Simandou. BHP would still be generating gross margins of 60 per cent at those price levels. The introduction of Simandou’s ore to the market, and China’s interests in the project, will, however, give China more leverage in price negotiations with the Australian miners. Loading China has long sought to blunt the pricing power the miners gained in 2010 when BHP’s Marius Kloppers effectively forced the industry into adopting market-related pricing. Before 2010, the industry norm saw Japanese and Chinese buyers (usually led by the Japanese) negotiating directly with each miner and then using the lowest price as the benchmark for all the West Australian miners.\n\nThis year, with steel production and therefore demand for iron ore softening, China’s iron ore bargaining group – China Minerals Resources Group – halted purchases of BHP’s Jimblebar blend in September and told mills and traders not to buy US-denominated cargoes at China’s ports in an attempt to gain lower prices and force BHP and the other Australian producers to trade in Chinese renminbi, not US dollars. Last month, BHP is reported to have agreed to settle 30 per cent of its iron ore spot trading in RMB. For China, that reduces exchange rate risks and transaction costs, possibly gives it another point of leverage in pricing negotiations and adds to its efforts to make its currency a viable alternative to the US dollar in commodity trades. Throw the Simandou ore into the mix and the Pilbara miners are entering a new phase in the iron ore market’s development, one in which – in a market with more supply, where demand is weakening – they lose some negotiating leverage and China gains some.\n\nSimandou may also factor in a different power play. Before the 2008 financial crisis, Rio, concerned that BHP was stalking it for a takeover, made a massively over-priced, debt-funded acquisition of Alcan that undermined its financial stability. BHP still made a bid, but China’s Chinalco seized the moment and bought 14.9 per cent of the shares in Rio’s London-listed entity (about 11 per cent of the dual-listed entity’s total issued capital). The companies later announced a series of deals through which Chinalco would take up minority interests, whether directly or indirectly, and have representation at both the board and assets levels in most of Rio’s major businesses. A BHP bid for Rio did eventuate, but it was later pulled as the extent of the financial crisis became clear.\n\nA subsequent proposal to combine BHP’s Pilbara assets with Rio’s in a joint venture eventually torpedoed the Chinalco deals. While the joint venture never eventuated, its proposal had served BHP’s purpose of keeping Rio, and its WA iron ore assets in particular, out of China Inc’s clutches. Loading The Chinalco shareholding in Rio, however, has remained and has been an obstacle to any Rio ambition to undertake capital management, or use its shares in an acquisition. Chinalco can’t increase its $20 billion holding (which would be the effect of a share buyback) without regulatory approvals it would be unlikely to gain, and doesn’t want to be diluted. There have, however, been recent reports that with Rio now being led by a new chief executive, Simon Trott, the companies have been discussing a potential equity-for-assets swap, under which Rio would exchange direct interests in some assets for Chinalco’s shareholding and free up its balance sheet options. It seems a reasonable assumption that Rio’s 42.5 per cent interest in its half of the Simandou project would be one of the earlier starting points for any serious discussions.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/afl/see-the-full-2026-fixture-magpies-the-afl-s-primetime-kings-and-rankine-will-return-to-face-them-20251113-p5nf5d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL fixture 2026: Magpies the primetime kings – and Rankine will return to face them",
    "publish_date": "Thu, 13 Nov 2025 12:00:00 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "The AFL is banking on Collingwood and Carlton being primetime kings once again, while North Melbourne have been banished from the spotlight as the league released the full 2026 fixture on Thursday.\n\nThe Magpies have emerged as primetime darlings, appearing on either a Thursday or Friday in six of their opening 10 rounds. Collingwood will face Adelaide in round one at the MCG – a highly anticipated grudge match that will likely mark the return of Izak Rankine for the first time since his suspension for using homophobic language against a Pies opponent the last time they met.\n\nPatrick Cripps evades a Harry Perryman tackle. Credit: Getty Images\n\nThe Blues have four of the first seven Thursday night matches and Good Friday match against North Melbourne. That includes new Swan Charlie Curnow’s first-up match against his old side in the opening round clash between Carlton and Sydney on March 5.\n\nNorth Melbourne – who finished the 2025 season with only five wins – have no free-to-air matches in the first 15 rounds except for their Good Friday match against Carlton.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/priceline-considering-pulling-popular-supplement-from-shelves-as-chemist-warehouse-remains-silent-015646738.html",
    "title": "Priceline 'considering' pulling popular supplement from shelves as Chemist Warehouse remains silent",
    "publish_date": "2025-11-13T01:56:46Z",
    "category": "finance",
    "authors": [],
    "text": "Priceline, one of Australia’s biggest pharmacy chains, is “actively considering” whether to continue stocking a controversial supplement. At the centre of its review is krill oil, which is caught in Antarctica and sold as an alternative to fish oil.\n\nWorld Wide Fund for Nature-Australia (WWF) has called for a moratorium on its harvest, and the Bob Brown Foundation has launched a billboard and internet campaign against one of the most well-known suppliers, Swisse, a subsidiary of China’s Health and Happiness Group. And in Europe, one high-profile retailer, Holland & Barrett, has already pulled krill from its shelves.\n\nBut the world’s biggest harvester, Aker BioMarine, argues the major problems facing krill products are “perception issues” and not its environmental credentials. “It is actually one of the most sustainable fisheries in the world,” its CEO Matts Johansen told Yahoo News.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDespite Priceline only selling a “small range” of krill oil, controversy surrounding the product hasn’t escaped the Wesfarmers-owned pharmacy chain's attention.\n\n“We are actively considering our krill oil products as we review evidence around the sustainability impact of these products,” a spokesperson said.\n\nThe Priceline announcement was welcomed by Bob Brown Foundation, and it has anticipated outlets that continue to stock it could face protest action.\n\nIts Antarctic marine campaigner Alistair Allan said other merchants like Chemist Warehouse risked being “left behind as other retailers make decisions” about what he said was “an environmentally damaging product”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn Australia, major retail chains dominate the pharmacy space. Chemist Warehouse is the largest, with more than 500 outlets across the country — to put that in perspective, that’s roughly half the number of McDonald’s restaurants.\n\nIt stocks several krill oil products, but declined to respond to questions from Yahoo News about the matter.\n\nSwisse has a popular krill oil supplement. Source: Yahoo\n\nSwisse previously told Yahoo News it is committed to using “sustainably-sourced ingredients” and its krill oil is MSC-certified, but it declined to provide further comment.\n\nSwisse claims its krill oil can provide mild improvement in symptoms of mild to moderate osteoarthritis and has been linked to supporting cardiovascular health.\n\nWhy is krill harvesting controversial?\n\nSustainable harvesting of krill had been implemented by the International Commission for the Conservation of Antarctic Marine Living Resources.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nA key rule, Conservation Measure 51-07, had ensured that hotspots where whales, seals, and birds feed were not overfished by the large supertrawlers that operate in the region. It did this by forcing them to harvest in a spatially distributed way.\n\nBut in 2024, the measure lapsed, reportedly after being blocked by Russia and China, and a follow-up meeting in Hobart this year failed to reach a consensus between its 27 member countries.\n\nDuring 2025, something unprecedented happened in Antarctica — trawlers reached their harvest quota in August, and they were forced to go home early.\n\nWWF believes there’s a clear link between this and the lapsing of the fishing rule, because it allowed them to concentrate fishing efforts where most of the krill are located, saving time and money.\n\nThe harvesting of krill occurs in Antarctica’s fragile marine environment. Source: Getty\n\nKrill industry argues issue is complex\n\nAker BioMarine, the supplier to Swisse, argues the issue is more complex. In an interview with Yahoo this week, its CEO Matts Johansen claimed the biggest contributor was that the vessels started harvesting earlier.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“That is a main factor. But it could also be that, since we were fishing more in area 48.1, that also had an impact,” Johansen said.\n\nThe 48.1 Johansen is referring to is a zone with a high concentration of krill on the Antarctic Peninsula, an important wildlife feeding zone. This year, after the lapse of Conservation Measure 51-07, harvesters could concentrate their nets in this area.\n\nMore krill was caught in 48.1 than the previous year by Aker BioMarine. But Johansen stresses that every year is different, because sea ice and weather change fishing patterns.\n\nUnder Conservation Measure 51-07, harvesters had to split their harvest among the four 48 zones – 48.1 to 48.4 (highlighted in green). But now there are concerns trawlers are concentrating their fishing on 48.1. Source: Commission for the Conservation of Antarctic Marine Living Resources\n\nCan conservationists and industry agree on krill harvesting?\n\nWhen Johansen was in Hobart in October, he met with Bob Brown in person, because he wants to drive dialogue between conservation groups and the industry.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut he said discussions can face hurdles when environmentalists want to see his entire industry phased out.\n\n“Some people have a values-based approach. And that’s a problem for us that quite a lot have the opinion for Antarctica that we shouldn’t be there,” he said.\n\nJohansen believes krill is a “resource” that should be harvested sustainably to feed the growing human population.\n\nBut he concedes that ongoing debate around the lapsing of 51.07 is harming the industry’s reputation.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/aus-big-move-us-tech-015057613.html",
    "title": "Aus’ big move on US tech titans",
    "publish_date": "2025-11-13T01:50:57Z",
    "category": "finance",
    "authors": [],
    "text": "Tech firms could be slapped with millions in new fines if they fail to ink content deals with Australian media under a new regime proposed by Labor.\n\nThe Albanese government on Thursday released a consultation paper on its News Bargaining Incentive.\n\nBuilding on the News Media and Digital Platforms Mandatory Bargaining Code introduced by the Coalition in 2021, platforms that make at least $250m in revenue from Australian sources would be covered.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThey may not even need to host Australian news content.\n\nNews Corp Australiasia executive chairman Michael Miller welcomed the update.\n\n“The News Bargaining Incentive’s importance has only escalated since it was announced almost a year ago in terms of how we function successfully as a nation,” Mr Miller said.\n\n“This is the clearest indication yet that the government will continue its good work to stand up for local Australian communities by asserting news media’s enduring importance in shaping our national stories, identity and, ultimately, our democratic way of life.”\n\nAssistant Treasurer Dan Mulino has played down concerns Labor’s proposal could draw ire from US President Donald Trump. Picture: NewsWire / Monique Harmer\n\nMeanwhile, the minister spearheading the incentive played down concerns it could draw ire from Donald Trump.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe US President has long-warned countries against digital taxes and regulations that could, as he sees it, rip off American tech titans.\n\nBut Assistant Treasurer and Finance Minister Dan Mulino said the proposal took an “agnostic” approach to a company’s country of origin.\n\n“I want to stress that this is agnostic as to the location of the companies,” he told reporters in Sydney.\n\n“Based upon the coverage criteria that are spelt out in this consultation paper, we expect that the companies that will be covered will include Meta, Google and TikTok.\n\n“So there are two US companies and one company not based in the US.\n\n“So this is not about where companies are located – this is about issues relating to market power and the use of news content without appropriate, fair compensation.”",
    "source": "Yahoo",
    "cluster_id": 36
  },
  {
    "url": "https://au.news.yahoo.com/details-secret-lib-meeting-220805288.html",
    "title": "Libs scrap net zero after secret meeting",
    "publish_date": "2025-11-13T01:45:22Z",
    "category": "finance",
    "authors": [],
    "text": "The Liberal Party has followed the Nationals in scrapping Australia’s target of net zero emissions by 2050, bringing the Coalition a step closer to unity on climate policy.\n\nSussan Ley convened Liberal members of her shadow cabinet on Thursday to finalise a formal position and put an end to months of bitter infighting.\n\nNewsWire understands participants agreed to dump the target in favour of short-term targets.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThey also agreed to stay in the Paris Agreement.\n\nOpposition energy spokesman Dan Tehan is set to hold a press conference to formally announce the position before a Liberal delegation meets with National Party counterparts to hash out a joint position.\n\nThe Coalition signed Australia up to net zero by 2050 under the Scott Morrison in 2021.\n\nMore to come.\n\n‘Clownshow’\n\nEarlier, Anthony Albanese slammed the Liberals’ internal divisions over net zero as a “clownshow”, accusing the party of climate denialism.\n\nOn Wednesday, Liberal MPs and senators emerged from a mammoth meeting designed for the party room to express their views on the emissions target, which was adopted under the Scott Morrison-led Coalition.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe policy was put under review by Sussan Ley after the opposition’s historic loss at polling booths in May, and has since fractured the Coalition across party lines.\n\nThe Prime Minister told reporters in Sydney on Thursday the opposition was considering walking away from net zero because “they fundamentally do not believe in the science in climate change”.\n\nThe Coalition approach to energy would “hurt Australians”, Anthony Albanese said. Picture: NewsWire / Martin Ollman\n\n“Australians cannot afford to keep paying the price of Coalition infighting when it comes to climate policy and energy policy,” he said.\n\nScenes of the Liberal Party’s right faction, entering the Wednesday party room meeting as a bloc, was a sign the opposition were “a divided rabble”, Mr Albanese said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It’s a show of division,” he said.\n\n“These were people who, many of whom, have either challenged or resigned from the front bench.\n\n“You had Angus Taylor walking with his counterparts - this was a sign of opposition to Sussan Ley’s leadership, and it was a rather extraordinary moment.\n\n“And the pictures (were) very deliberate for people to gather beforehand in formation in order to send that message, and that message was surely received, not so much by the party room, because that’s a matter for them, their clownshow that they’ve become.\n\n“It was a sign for the Australian people, of how divided they are.”\n\nLibs ‘optimistic’ after meeting\n\nA Liberal backbencher has revealed details about the highly secretive, marathon meeting in Parliament House, following reports the party room majority expressed views to drop net zero.\n\nThe right faction, led by Sarah Henderson and Jacinta Nampijinpa Price, showed up to the Wednesday meeting as a unit. Picture: NewsWire / Martin Ollman\n\nOpposition communications spokeswoman Melissa McIntosh, who has publicly advocated for the party to abandon the emissions target, said the meeting left MPs and senators feeling “optimistic”, adding that she had a “spring in (her) step”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It was really civilised, and people got to have their say, it did go for five hours,” she told Sky News on Thursday.\n\n“We all had about five minutes each to express our views.\n\n“So it was a productive day, and we’ve still got another session today with the shadow ministry.’\n\nAsked point-blank whether the party had formally dumped net zero, Ms McIntosh said she was feeling “quite optimistic” and hoped the final policy would take that position.\n\n“I can’t say formally yet, because we do have to go into the shadow ministry meeting, and there are people in that meeting who probably support net zero for their various reasons, and it will be up to Dan (Tehan) and Sussan (Ley) to negotiate our way through that.\n\nMelissa McIntosh has been an outspoken critic of net zero. Picture: NewsWire / Martin Ollman\n\n“But yesterday’s purpose was for everyone to express their views, their opinions about it, and some people like myself went in strong on the basis that that’s what their community wants.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Paris Agreement was also brought up in the party room meeting, she said, with “strong support” for a commitment to stay in the international climate treaty, “across the board”.\n\n“There was no dissenting issues around Paris.\n\n“I think it’s important for us to continue to uphold our international obligations when it comes to climate and emissions reduction.\n\n“Everyone that stood up against net zero still stood up and said that we do have a role to play in bringing down emissions, just not this harder, faster, deeper pace that we’re going (at), that the Albanese Labor Government has set us on.”\n\nDan Tehan is responsible for drafting the Liberal Party’s official energy policy. Picture: NewsWire / Martin Ollman\n\nAsked how the party would argue that dropping net zero wasn’t synonymous with climate denialism, Ms McIntosh said: “It’s going to be up to us as a party to strongly articulate the reasons why we are making these decisions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We’d have to be have our head in the sand to think that we’re not going to receive attacks from all sorts of angles on this.\n\n“But the intent is strong. We do care about the environment, we do care about climate policy, and we do care about Australians, but when people are suffering so badly right now … we can’t expect that things are going to change if we don’t change direction.\n\nMost Liberals, including opposition energy spokesman Dan Tehan, who is drafting the party’s official position, have hinted coal and gas will play a role in the new policy platform.\n\nHowever, Ms McIntosh said it would be up to Mr Tehan and Ms Ley to determine the “nuts and bolts” of the Liberal Party’s final policy platform, which is due to be announced on Thursday afternoon.",
    "source": "Yahoo",
    "cluster_id": 27
  }
]