[
  {
    "url": "https://www.9news.com.au/national/ebikes-and-escooters-could-be-banned-in-newly-proposed-law-due-to-growing-fire-risks/08e992cd-a507-4498-867e-ce1bacb76e6d",
    "title": "E-rideables may soon be illegal on public transport, Here are the current state laws",
    "publish_date": "Fri, 01 Aug 2025 23:43:04 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "As fires caused by e-bikes are becoming more common by the week, state governments are re-evaluating laws surrounding the vehicles on public transport.\n\nE-bikes and e-scooters are only growing in popularity, but that uptake has also seen a rise in fires due to lithium-ion battery combustion.\n\nStates and Territories have now started to look into the potential risks of e-vehicles on public transport. If passed, some bans could be enacted as soon as September this year.﻿\n\nA fire on a Melbourne train caused by an e-bike earlier this year (Reddit)\n\nHowever, cycle advocates say﻿ any ban would put people off taking public transport and instead legislation should focus on battery standards.\n\nHere's what we know about each state's current laws surrounding e-rideables on public transport.\n\nNew South Wales\n\nPassenger update spotted in Sydney (X)\n\nAs of now, there are no limitations on e-rideables on public transport in NSW.\n\nHowever, the NSW Secretary of Transport has recently declared that the government is exploring the possibility of a ban.\n\nSigns encouraging travellers to leave their e-rideables at home have already begun to pop up around Sydney as bans could come into effect as soon as September.\n\nVictoria\n\nVictoria currently has no bans or restrictions on any e-rideables being taken on public transport; however, after multiple instances of lithium-ion powered e-bikes bursting into flames on trains, a ban has been proposed.\n\nIf passed, the new ban could be imposed as soon as September 30.﻿\n\nQueensland\n\nThe state has designated entry points on trains at the front and back of carriages for people using the vehicles to safely enter and exit.\n\nE-rideables are currently not permitted on trams or buses.\n\nThere is currently an inquiry into e-rideable safety and use in the state, so laws may be subject to change.\n\nAustralian Capital Territory﻿\n\nE-bikes and e-scooters are allowed on Canberra light rails and trains, ensuring that they don't obstruct walkways and are safely stowed away.\n\nE-rideables can be brought on buses at the driver's discretion, ensuring they are stored safely and securely within the passenger area.\n\nTasmania\n\nTasmania currently allows non-modified e-bikes on trains but not buses or trams.\n\nThe state has banned e-scooters on buses.\n\nNorthern Territory\n\nAs of now, there are no restrictions on e-scooters or e-bikes on public transport in the Northern Territory.\n\nPrivately-owned e-scooters can only be ridden on private property in the Northern Territory.\n\nSouth Australia\n\nE-scooters and e-bikes are currently not allowed on any public transportation in South Australia.\n\nThis is due to instances in other states where they have caught fire or exploded in trains.\n\nThe state has said that they're working towards a solution that allows motorised vehicles to safely be brought onto trains, trams, and buses.\n\nWestern Australia﻿\n\nWestern Australia has no restrictions on e-rideables being taken on public transport.\n\nTransperth has stated that e-bike and e-scooter owners can travel in the non-peak direction during peak hours.\n\nThey do note that Perth Public Transport Authorities do have the discretion to restrict passengers with e-scooters from travelling if they identify safety concerns, such as overcrowding.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/tesla-elon-musk-jury-orders-tesla-to-pay-more-than-240-million-autopilot-crash-case/cdc4ec11-7f5f-4421-860b-2d231a195154",
    "title": "Jury orders Tesla to pay more than $370 million in Autopilot crash case",
    "publish_date": "Sat, 02 Aug 2025 01:29:29 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A Miami jury decided that Elon Musk’s car company Tesla was partly responsible for a deadly crash in Florida involving its Autopilot driver assist technology and must pay the victims more than $370 million ($US240 million) in damages.\n\nThe federal jury held that Tesla bore significant responsibility because its technology failed and that not all the blame can be put on a reckless driver, even one who admitted he was distracted by his cellphone before hitting a young couple out gazing at the stars.\n\nThe decision comes as Musk seeks to convince Americans his cars are safe enough to drive on their own as he plans to roll out a driverless taxi service in several cities in the coming months.\n\nThis photo provided by Neima Benavides, right, shows her and her sister, Naibel Benavides Leon in the Dominican Republic in 2018, celebrating Naibel's 21st birthday. (Neima Benavides via AP)\n\nThe decision ends a four-year long case remarkable not just in its outcome but that it even made it to trial.\n\nMany similar cases against Tesla have been dismissed and, when that didn't happen, settled by the company to avoid the spotlight of a trial.\n\n“This will open the floodgates,” said Miguel Custodio, a car crash lawyer not involved in the Tesla case. “It will embolden a lot of people to come to court.”\n\nThe case also included startling charges by lawyers for the family of the deceased, 22-year-old, Naibel Benavides Leon, and for her injured boyfriend, Dillon Angulo.\n\nThey claimed Tesla either hid or lost key evidence, including data and video recorded seconds before the accident.\n\nTesla said it made a mistake after being shown the evidence and honestly hadn’t thought it was there.\n\n“We finally learned what happened that night, that the car was actually defective,” said Benavides' sister, Neima Benavides. “Justice was achieved.”\n\nA Tesla Model S is plugged in at a vehicle Supercharging station (AP)\n\nTesla has previously faced criticism that it is slow to cough up crucial data by relatives of other victims in Tesla crashes, accusations that the car company has denied. In this case, the plaintiffs showed Tesla had the evidence all along, despite its repeated denials, by hiring a forensic data expert who dug it up.\n\n“Today’s verdict is wrong,\" Tesla said in a statement, “and only works to set back automotive safety and jeopardise Tesla’s and the entire industry’s efforts to develop and implement lifesaving technology.\"\n\nThey said the plaintiffs concocted a story ”blaming the car when the driver – from day one – admitted and accepted responsibility.”\n\nIn addition to a punitive award of $309 million, the jury said Tesla must also pay $66 million of a total $199 million in compensatory damages for the crash, bringing the total borne by the company to $375 million.\n\n“It's a big number that will send shock waves to others in the industry,” said financial analyst Dan Ives of Wedbush Securities. “It's not a good day for Tesla.”\n\nTesla said it will appeal.\n\nREAD MORE: Homicide investigation in country Victoria after woman stabbed ﻿\n\nNo-one noticed when Australia's most expensive painting was stolen View Gallery\n\nEven if that fails, the company says it will end up paying far less than what the jury decided because of a pre-trial agreement that limits punitive damages to three times Tesla’s compensatory damages.\n\nTranslation: $165 million, not $375 million.\n\nBut the plaintiff says their deal was based on a multiple of all compensatory damages, not just Tesla’s, and the figure the jury awarded is the one the company will have to pay.\n\nIt’s not clear how much of a hit to Tesla’s reputation for safety the verdict in the Miami case will make.\n\nTesla has vastly improved its technology since the crash on a dark, rural road in Key Largo, Florida, in 2019.\n\nBut the issue of trust generally in the company came up several times in the case, including in closing arguments on Thursday.\n\nThe decision comes as Musk seeks to convince Americans his cars are safe enough to drive on their own as he plans to roll out a driverless taxi service in several cities in the coming months. (AP)\n\nThe plaintiffs’ lead lawyer, Brett Schreiber, said Tesla’s decision to even use the term Autopilot showed it was willing to mislead people and take big risks with their lives because the system only helps drivers with lane changes, slowing a car and other tasks, falling far short of driving the car itself.\n\nSchreiber said other automakers use terms like “driver assist” and “copilot” to make sure drivers don’t rely too much on the technology.\n\n“Words matter,” Schreiber said. “And if someone is playing fast and lose with words, they’re playing fast and lose with information and facts.”\n\nSchreiber acknowledged that the driver, George McGee, was negligent when he blew through flashing lights, a stop sign and a T-intersection at 99km miles an hour before slamming into a Chevrolet Tahoe that the couple had parked to get a look at the stars.\n\nThe Tahoe spun around so hard it was able to launch Benavides 23m through the air into nearby woods where her body was later found.\n\nIt also left Angulo, who walked into the courtroom on Friday with a limp and cushion to sit on, with broken bones and a traumatic brain injury.\n\nBut Schreiber said Tesla was at fault nonetheless.\n\nHe said Tesla allowed drivers to act recklessly by not disengaging the Autopilot as soon as they begin to show signs of distraction and by allowing them to use the system on smaller roads that it was not designed for, like the one McGee was driving on.\n\n“I trusted the technology too much,” said McGee at one point in his testimony. “I believed that if the car saw something in front of it, it would provide a warning and apply the brakes.”\n\nThe lead defence lawyer in the Miami case, Joel Smith, countered that Tesla warns drivers that they must keep their eyes on the road and hands on the wheel yet McGee chose not to do that while he looked for a dropped cellphone, adding to the danger by speeding.\n\nNoting that McGee had gone through the same intersection 30 or 40 times previously and hadn’t crashed during any of those trips, Smith said that isolated the cause to one thing alone: “The cause is that he dropped his cellphone.”",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/trump-removes-official-overseeing-jobs-data-after-dismal-employment-report/3193cfe6-34dc-4c28-8e90-379c68dfd8ff",
    "title": "Trump fires official overseeing jobs data after dismal employment report",
    "publish_date": "Fri, 01 Aug 2025 21:35:51 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "President Donald Trump has removed the head of the agency that produces the monthly jobs figures after a report showed hiring slowed in July and was much weaker in May and June than previously reported.\n\nTrump, in a post on his social media platform, alleged that the figures were manipulated for political reasons and said that Erika McEntarfer, the director of the Bureau of Labor Statistics, who was appointed by former President Joe Biden, should be fired. He provided no evidence for the charge.\n\n\"I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,\" Trump said on Truth Social. \"She will be replaced with someone much more competent and qualified.\"\n\nDonald Trump has fired the woman responsible for gathering jobs data after a disappointing result last month. (AP)\n\nTrump later posted: \"In my opinion, today's Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad.\"\n\nThe charge that the data was faked is an explosive one that threatens to undercut the political legitimacy of the US government's economic data, which has long been seen as the \"gold standard\" of economic measurement globally. Economists and Wall Street investors have long accepted the data as free from political bias.\n\nTrump's move to fire McEntarfer represented another extraordinary assertion of presidential power. He has wielded the authority of the White House to try to control the world's international trade system, media companies, America's top universities and Congress' constitutional power of the purse, among other institutions.\n\n\"Firing the Commissioner ... when the BLS revises jobs numbers down (as it routinely does) threatens to destroy trust in core American institutions, and all government statistics,\" Arin Dube, an economist at the University of Massachusetts-Amherst, said on X. \"I can't stress how damaging this is.\"\n\nAfter Trump's initial post, Labor Secretary Lori Chavez-DeRemer said on X that McEntarfer was no longer leading the bureau and that William Wiatrowski, the deputy commissioner, would serve as the acting director.\n\n\"I support the President's decision to replace Biden's Commissioner and ensure the American People can trust the important and influential data coming from BLS,\" Chavez-DeRemer said.\n\nDonald Trump. (AP)\n\nFriday's jobs report showed that just 73,000 jobs were added last month and that 258,000 fewer jobs were created in May and June than previously estimated. The report suggested that the economy has sharply weakened during Trump's tenure, a pattern consistent with a slowdown in economic growth during the first half of the year and an increase in inflation during June that appeared to reflect the price pressures created by the president's tariffs.\n\n\"What does a bad leader do when they get bad news? Shoot the messenger,\" Democratic Senate Leader Chuck Schumer of New York said in a Friday speech.\n\nMcEntarfer was nominated by Biden in 2023 and became the Commissioner of the Bureau of Labor Statistics in January 2024. Commissioners typically serve four-year terms but since they are political appointees can be fired. The commissioner is the only political appointee of the agency, which has hundreds of career civil servants.\n\nThe Senate confirmed McEntarfer to her post 86-8, with now Vice President J.D. Vance among the yea votes.\n\nTrump focused much of his ire on the revisions the agency made to previous hiring data. Job gains in May were revised down to just 19,000 from a previously revised 125,000, and for June they were cut to 14,000 from 147,000. In July, only 73,000 positions were added. The unemployment rate ticked up to a still-low 4.2 percent from 4.1 percent.\n\n\"No one can be that wrong? We need accurate Jobs Numbers,\" Trump wrote. \"She will be replaced with someone much more competent and qualified. Important numbers like this must be fair and accurate, they can't be manipulated for political purposes.\"\n\nTrump has not always been so suspicious of the monthly jobs report and responded enthusiastically after the initial May figures came out on June 6 when it was initially reported that the economy added 139,000 jobs.\n\n\"GREAT JOB NUMBERS, STOCK MARKET UP BIG!\" Trump posted at the time.\n\nThat estimate was later revised down to 125,000 jobs, prior to the most-recent revision down to just 19,000.\n\nThe monthly employment report is one of the most closely-watched pieces of government economic data and can cause sharp swings in financial markets. The disappointing figure sent US market indexes about 1.5 percent lower on Friday.\n\nThe revisions to the May and June numbers were quite large and surprising to many economists. At the same time, every monthly jobs report includes revisions to the prior two months' figures. Those revisions occur as the government receives more responses to its survey, which help provide a more complete picture of employment trends each month.\n\nIn the past decade, companies have taken longer to respond, which may have contributed to larger monthly revisions.\n\nThe monthly jobs report has long been closely guarded within the BLS, with early copies held in safes under lock and key to prevent any leaks or early dissemination.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/just-a-jumble-of-bones-how-a-baby-grave-discovery-has-grown-to-haunt-ireland/9fb7a915-6a4a-4f4b-b629-606d87815f1f",
    "title": "'Just a jumble of bones': How a baby grave discovery has grown to haunt Ireland",
    "publish_date": "Fri, 01 Aug 2025 21:09:08 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "This story begins with a forbidden fruit.\n\nIn the 1970s, in a small town in Western Ireland, an orchard owner chased off two boys stealing his apples.\n\nThe youngsters avoided being caught by clambering over the stone wall of the derelict Bon Secours Mother and Baby Home.\n\nREAD MORE: Australian exporters watch anxiously as Trump tariff deadline nears\n\nIt is expected to take two years to collect bones. (AP)\n\nWhen they landed, they discovered a dark secret that has grown to haunt Ireland .\n\nOne of the boys, Franny Hopkins, remembers the hollow sound as his feet hit the ground.\n\nHe and Barry Sweeney pushed back some briars to reveal a concrete slab they pried open.\n\n\"There was just a jumble of bones,\" Hopkins said.\n\n\"We didn't know if we'd found a treasure or a nightmare.\"\n\nHopkins didn't realise they'd found a mass unmarked baby grave in a former septic tank in a town whose name is derived from the Irish word meaning burial place.\n\nIt took four decades and a persistent local historian to unearth a more troubling truth that led this month to the start of an excavation that could exhume the remains of almost 800 infants and young children.\n\nThe Tuam grave has compelled a broader reckoning that extends to the highest levels of government in Dublin and the Vatican.\n\nIreland and the Catholic Church, once central to its identity, are grappling with the legacy of ostracising unmarried women who they believed committed a mortal sin and separating them from children left at the mercy of a cruel system.\n\nAn unlikely investigator\n\nWord of Hopkins' discovery may never have travelled beyond what is left of the home's walls if not for the work of Catherine Corless, a homemaker with an interest in history.\n\nCorless, who grew up in town and vividly remembers children from the home being shunned at school, set out to write an article about the site for the local historical society.\n\nBut she soon found herself chasing ghosts of lost children.\n\nHistorian Catherine Corless made a grim discovery in her research (AP)\n\n\"I thought I was doing a nice story about orphans and all that, and the more I dug, the worse it was getting,\" she said.\n\nMother and baby homes were not unique to Ireland, but the church's influence on social values magnified the stigma on women and girls who became pregnant outside marriage.\n\nThe homes were opened in the 1920s after Ireland won its independence from Britain.\n\nMost were run by Catholic nuns.\n\nIn Tuam's case, the mother and baby home opened in a former workhouse built in the 1840s for poor Irish where many famine victims died.\n\nIt had been taken over by British troops during the Irish Civil War of 1922-23.\n\nSix members of an Irish Republican Army faction that opposed the treaty ending the war were executed there in 1923.\n\nTwo years later, the imposing three-story gray buildings on the outskirts of town reopened as a home for expectant and young mothers and orphans.\n\nIt was run for County Galway by the Bon Secours Sisters, a Catholic order of nuns.\n\nThe buildings were primitive, poorly heated, with running water only in the kitchen and maternity ward.\n\nLarge dormitories housed upward of 200 children and 100 mothers at a time.\n\nCorless found a dearth of information in her local library, but was horrified to learn that women banished by their families were essentially incarcerated there.\n\nThey worked for up to a year before being cast out, most of them forever separated from their children.\n\nSo deep was the shame of being pregnant outside marriage that women were often brought there surreptitiously.\n\nPeter Mulryan, who grew up in the home, learned decades later that his mother was six months pregnant when she was taken by bicycle from her home under the cover of darkness.\n\nThe local priest arranged it after telling her father she was \"causing a scandal in the parish\".\n\nMothers and their children carried that stigma most of their lives.\n\nBut there was no accountability for the men who got them pregnant, whether by romantic encounter, rape, or incest.\n\nMore shocking, though, was the high number of deaths Corless found.\n\nWhen she searched the local cemetery for a plot for the home's babies, she found nothing.\n\nLong-lost brothers\n\nAround the time Corless was unearthing the sad history, Anna Corrigan was in Dublin discovering a secret of her own.\n\nCorrigan, raised as an only child, vaguely remembered a time as a girl when her uncle was angry at her mother and blurted out that she had given birth to two sons.\n\nTo this day, she's unsure if it's a memory or a dream.\n\nWhile researching her late father's traumatic childhood confined in an industrial school for abandoned, orphaned, or troubled children, she asked a woman helping her for any records about her deceased mum.\n\nCorrigan was devastated when she got the news: before she was born, her mother had two boys in the Tuam home.\n\nAnna Corrigan suspects that her two lost brothers may be buried at the former mother and baby home. (AP)\n\n\"I cried for brothers I didn't know, because now I had siblings, but I never knew them,\" she said.\n\nHer mother never spoke a word about it.\n\nA 1947 inspection record provided insights into a crowded and deadly environment.\n\nTwelve of 31 infants in a nursery were emaciated.\n\nOther children were described as \"delicate,\" \"wasted,\" or with \"wizened limbs\".\n\nCorrigan's brother, John Dolan, weighed almost 9 pounds (4.08kg) when he was born but was described as \"a miserable, emaciated child with voracious appetite and no control over his bodily functions, probably mentally defective\".\n\nHe died two months later in a measles outbreak.\n\nDespite a high death rate, the report said infants were well cared for and diets were excellent.\n\nCorrigan's brother, William, was born in May 1950 and listed as dying about eight months later. There was no death certificate, though, and his date of birth was altered on the ledger, which was sometimes done to mask adoptions, Corrigan said.\n\nIreland was very poor at the time, and infant mortality rates were high.\n\nSome 9000 babies or 15 per cent died in 18 mother and baby homes that were open as late as 1998, a government commission found.\n\nIn the 1930s and 1940s, more than 40 per cent of children died some years in their homes before their first birthday.\n\nTuam recorded the highest death percentage before closing in 1961.\n\nNearly a third of the children died there.\n\nIn a hunt for graves, the cemetery caretaker led Corless across the street to the neighbourhood and playground where the home once stood.\n\nA well-tended garden with flowers, a grotto, and a Virgin Mary statue was walled off in the corner. It was created by a couple living next door to memorialise the place where Hopkins found the bones.\n\nSome were thought to be famine remains.\n\nBut that was before Corless discovered the garden sat atop the septic tank installed after the famine.\n\nShe wondered if the nuns had used the tank as a convenient burial place after it went out of service in 1937, hidden behind the home's three-metre-high walls.\n\n\"It saved them admitting that so, so many babies were dying,\" she said.\n\n\"Nobody knew what they were doing.\"\n\nA sensational story\n\nWhen she published her article in the Journal of the Old Tuam Society in 2012, she braced for outrage. Instead, she heard almost nothing.\n\nThat changed, though, after Corrigan, who had been busy pursuing records and contacting officials from the prime minister to the police, found Corless.\n\nCorrigan connected her with journalist Alison O'Reilly and the international media took notice after her May 25, 2014, article on the Sunday front page of the Irish Mail with the headline: \"A Mass Grave of 800 Babies.\"\n\nThe article caused a firestorm, followed by some blowback.\n\nSome news outlets, including The Associated Press , highlighted sensational reporting and questioned whether a septic tank could have been used as a grave.\n\nThe Bon Secours sisters hired public relations consultant Terry Prone, who tried to steer journalists away.\n\nA replica of the home built by Catherine Corless. (AP)\n\n\"If you come here, you'll find no mass grave,\" she said in an email to a French TV company.\n\n\"No evidence that children were ever so buried, and a local police force casting their eyes to heaven and saying, 'Yeah, a few bones were found, but this was an area where famine victims were buried. So?'\"\n\nDespite the doubters, there was widespread outrage.\n\nCorless was inundated by people looking for relatives on the list of 796 deaths she compiled.\n\nThose reared with the stain of being \"illegitimate\" found their voice.\n\nMulryan, who lived in the home until he was 4 and a half, spoke about being abused as a foster child working on a farm, shoeless for much of the year, barely schooled, underfed, and starved for kindness.\n\n\"We were afraid to open our mouths, you know, we were told to mind our own business,\" Mulryan said.\n\n\"It's a disgrace. This church and the state had so much power, they could do what they liked, and there was nobody to question them.\"\n\nThen-Prime Minister Enda Kenny said the children were treated as an \"inferior subspecies\" as he announced an investigation into mother and baby homes.\n\nWhen a test excavation confirmed in 2017 that skeletons of babies and toddlers were in the old septic tank, Kenny dubbed it a \"chamber of horrors.\"\n\nPope Francis acknowledged the scandal during his 2018 visit to Ireland when he apologised for the church's \"crimes\" that included child abuse and forcing unmarried mothers to give up their children.\n\nIt took five years before the government probe primarily blamed the children's fathers and women's families in its expansive 2021 report.\n\nThe state and churches played a supporting role in the harsh treatment, but it noted that the institutions, despite their failings, provided a refuge when families would not.\n\nSome survivors saw the report as a damning vindication, while others branded it a whitewash.\n\nPrime Minister Micheál Martin apologised, saying mothers and children paid a terrible price for the nation's \"perverse religious morality.\"\n\n\"The shame was not theirs, it was ours,\" Martin said.\n\nThe Bon Secours sisters offered a profound apology and acknowledged that children were disrespectfully buried.\n\n\"We failed to respect the inherent dignity of the women and children,\" Sister Eileen O'Connor said. \"We failed to offer them the compassion that they so badly needed.\"\n\nThe dig\n\nWhen a crew including forensic scientists and archaeologists began digging at the site two weeks ago, Corless was \"on a different planet,\" amazed that the work was underway after so many years.\n\nIt is expected to take two years to collect bones, many of which are commingled, sort them, and use DNA to try to identify them with relatives like Corrigan.\n\nDig director Daniel MacSweeney, who previously worked for the International Committee of the Red Cross to identify missing persons in conflict zones in Afghanistan and Lebanon, said it is a uniquely difficult undertaking.\n\n\"We cannot underestimate the complexity of the task before us, the challenging nature of the site, as you will see, the age of the remains, the location of the burials, the dearth of information about these children and their lives,\" MacSweeney said.\n\nNearly 100 people, some from the US, Britain, Australia, and Canada, have either provided DNA or contacted them about doing so.\n\nSome people in town believe the remains should be left undisturbed.\n\nPatrick McDonagh, who grew up in the neighbourhood, said a priest had blessed the ground after Hopkins' discovery and Masses were held there regularly.\n\n\"It should be left as it is,\" McDonagh said. \"It was always a graveyard.\" (AP)\n\nA week before ground was broken, a bus delivered a group of the home's aging survivors and relatives of mothers who toiled there to the neighbourhood of rowhouses that ring the playground and memorial garden.\n\nA passageway between two homes led them through a gate in metal fencing erected to hide the site that has taken on an industrial look.\n\nBeyond grass, where children once played and beneath which children may be buried, were storage containers, a dumpster, and an excavator poised for digging.\n\nIt would be their last chance to see it before it's torn up, and maybe the bones of their kin recovered so they can be properly buried.\n\nCorrigan, who likes to say that justice delayed Irish-style is \"delay, deny 'til we all go home and die,\" hopes each child is found.\n\n\"They were denied dignity in life, and they were denied dignity and respect in death,\" she said.\n\n\"So we're hoping that today maybe will be the start of hearing them because I think they've been crying for an awful long time to be heard.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/rba-interchange-fee-cap-proposed-how-this-could-impact-credit-card-perks-reward-points/2eb51926-15ae-4f3b-831f-1cef804272b5",
    "title": "Aussies can breathe sigh of relief after $900 million credit card warning",
    "publish_date": "Fri, 01 Aug 2025 21:08:07 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A payments expert has watered down fears the Reserve Bank's proposed ban on card surcharges and accompanying cap on interchange fees will force banks to roll back credit card perks like frequent flyer points.\n\nThe RBA's consultation paper on surcharges suggests capping the maximum interchange fee banks and service providers charge for card transactions.\n\nIt said the current fees paid by businesses to card providers are \"too high\".﻿\n\nThe RBA proposed a cap for interchange fees after claiming the current ones are \"too high\". (Nine/The Age)\n\nThose fees﻿ form large parts of bank and card provider revenue streams and pay for credit card perks like frequent flyer points.\n\nThe rewards are incredibly popular – more than a third of credit card spending in Australia is done on Qantas frequent flyer points-earning cards alone, according to the airline.\n\nThe RBA itself warned the programs could be scaled back in response to an interchange fee cap, which could deliver a hit of almost $1 billion.\n\nIt is important to note that American Express credit cards do not fall under the RBA's remit and won't be impacted.﻿\n\n\"Issuers are expected to experience a reduction in interchange revenue of around $900 million under the preferred package and $800 million under the alternate option,\" its consultation paper states.\n\n\"Some issuers may choose to increase cardholder fees or reduce benefits such as rewards points, particularly on credit cards, to boost their profitability in response to reductions in interchange settings,\" it adds.\n\nPayment Services managing director Brad Kelly told 9news.com.au the interchange fee is the \"holy grail\" for financial institutions.\n\nHe said the proposed cap could have a flow-on impact for customers but doesn't expect perks like Qantas points will be stripped back.\n\n\"What it will mean is that revenue bucket is just not big enough anymore to pay for rewards, so they're going to have to work out a different way to pay for it,\" Kelly explained.\n\n\"Potentially what will happen is is that rewards cards will evolve. It's not the end of frequent flyer points on rewards cards. Far from it.\"\n\nKelly said reward points may be offered to customers directly via merchants instead.\n\nBecause this, it could result in increased competition and better perks for spending money on credit cards.\n\n\"The customer could be better off,\" Kelly said.\n\nMoney saving expert Joel Gibson said rewards perks are often overvalued. (Today Extra)\n\n\"I also think there's opportunity for alternatives, where you still get your rewards per spend, but it's handled differently.\"\n\nMoney saving expert Joel Gibson said customers shouldn't be wary of losing perks.\n\nInstead, he warned other key features like scam protection could be impacted.﻿\n\n\"Reducing fraud protection would be a serious downside, for example,\" he said.\n\n\"But reducing the value of rewards programs would probably leave most people better off in my view.\"\n\nGibson said the average punter overvalues rewards.\n\nThe average credit limit in Australia is $10,439,﻿ which isn't a lot if you're hoping to score business-class flights on points alone.\n\n\"Most of us pay more in annual fees, merchant fees and interest than we get back in points, even if we don't realise it,\" he said.\n\n\"And most of us have no idea what a point is worth and the rewards programs make it hard to work out by giving them different values for different purchases.\"\n\nNone of the major banks approached by 9news.com.au said whether or not they are considering reducing card perks in response to the RBA reforms.\n\nIt has been suggested Apple Pay may be under threat if the surcharge ban goes ahead.\n\nAt least one major bank is considering pulling the pin on Apple Pay, the Australian Financial Review reported this month.\n\nKelly said banks won't pull the pin on Apple Pay. (Getty)\n\nKelly said he doubts any bank would risk such a huge chunk of their transactions.\n\n\"﻿Apple Pay now represents about 40 per cent of card payments in Australia,\" he said.\n\n\"There's no way [a bank] would switch off 40 per cent of its payment traffic.\"\n\nA feedback window on the RBA's proposals is open until August 26 this year, before the reforms are finalised.\n\nThey are scheduled to come into effect next July.﻿\n\nThere is a ﻿chance the surcharge fee ban could be passed onto customers, some business owners have warned.\n\nThe RBA has also proposed more transparency around fees by requiring providers to display their wholesale charges clearly.\n\n9news.com.au has contacted the Australian Banking Association for comment.﻿",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/star-entertainment-group-to-pay-back-41-million-after-lifeline-casino-deal-collapses/3a514c1a-8992-4c26-86a7-1c583b17ff1e",
    "title": "Star to pay back $41 million after lifeline casino deal collapses",
    "publish_date": "Fri, 01 Aug 2025 05:55:20 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Embattled casino giant Star Entertainment will have to pay back $41 million after a lifeline deal to offload its stake in the Brisbane Queen's Wharf development to overseas partners fell through.\n\nIn a statement to the ASX today, Star announced it had failed to reach an agreement with its Hong Kong-based joint venture partners ﻿Chow Tai Fook Enterprises and Far East Consortium.\n\n\"As of this morning, the parties have been unable to reach agreement on a number of outstanding commercial issues which in turn prevent the finalisation of long form documents,\" it said.\n\nStar Entertainment will have to pay back $41 million. (AFR/Louie Douvis)\n\nStar's shares dropped to ﻿10 cents this morning off the back of the announcement.\n\nThe casino operator's proposed extension for negotiations to August 6 had also been rejected.\n\nThe heads of agreement have been terminated, and Star will retain 50 per cent equity in ﻿Destination Brisbane Consortium, Destination Gold Coast Consortium, and the Treasury Hotel in Brisbane.\n\nStar will have to repay ﻿the joint venture partners $10 million in proceeds by August 6 and $31 million in equity contributions by September 5.\n\nThe Brisbane Queen's Wharf development deal announced in March consisted of Star's 50 per cent stake in exchange for a $50 million cash injection.\n\nREAD MORE: ﻿ Suspect named in chilling quadruple murder\n\nThe Star at Queen's Wharf Brisbane. (Nine)\n\nThe deal, as well as ﻿a $250 million cash injection secured from US casino giant Bally's Corporation in April, helped Star stave off administration.\n\nStar said it is continuing to engage with joint venture partners and will provide an update if there are any material developments. ﻿\n\nIt is also ﻿\"considering what alternative options may be available\".\n\nStar runs three casinos in Brisbane, the Gold Coast, and Sydney and has been struggling to remain afloat since last year.\n\nIt is also awaiting a court decision over alleged breaches of anti-money-laundering laws, and could owe hundreds of millions of dollars.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/finance/donald-trump-tariffs-announcement-australia-impacts-economy/7063ae38-48d9-4916-9896-a35c826ed1c5",
    "title": "Australia dodged one tariff bullet but a second could do the damage",
    "publish_date": "Fri, 01 Aug 2025 05:21:05 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Australia appeared to emerge from US President Donald Trump's latest tariff announcement relatively unscathed, with its 10 per cent rate unchanged.﻿\n\nWhile that's a far cry from the host of nations that were hit with higher duties, economists have warned Australia still faces a significant economic hit from the announcement.\n\nThe concerns – which were reflected in the Australian share market, which plunged about one per cent following the news – stem from the fact that several major economies, including key trading partners, received no such reprieve.﻿\n\nAustralia has dodged a direct hit, but it's the indirect impact that could damage the economy. (AP Photo/Alex Brandon)\n\nIndia received 25 per cent, and Canada's rate was hiked up to 35 per cent.\n\nJapan and South Korea both secured deals to reduce their tariffs, but they're still sitting higher than Australia's at 15 per cent.﻿\n\nThat could hamper global growth, which would in turn hit the Australian economy.\n\n\"The bad news is that other countries appear to be facing higher tariffs than many had come to expect, which will push the average US tariff up to around 20 per cent, which is way up from 2-3 per cent at the start of the year,\" AMP chief economist Shane Oliver said.\n\n\"This risks weaker US and global growth which could mean less demand for our exports, threatening Australian growth.\"\n\nThere's also plenty of uncertainty surrounding the situation.\n\nThe ASX200 fell following the tariff announcement. (Louie Douvis)\n\nAfter initially promising the new tariffs would come into effect now, Trump has pushed the start date back a week to August 7 – inviting more \"TACO\" (Trump Always Chickens Out) accusations – and there is a legal challenge against the duties in the US that is expected to eventually reach the Supreme Court.\n\nThere was also no announcement on what rate the US will slap on Chinese goods, leaving open the chance that tariffs could spike between the world's two largest economies again when the current pause expires on August 12.\n\nThe concern ﻿about the economic damage caused by the tariffs and the accompanying uncertainty was raised by RBA deputy governor Andrew Hauser early last month.\n\n\"The level of uncertainty is clearly elevated and the implications... for a global trading economy like Australia with these fundamental changes are very profound,\" he said, before drawing parallels to some of the long-term economic impacts caused by Brexit.\n\n\"The first-round effects of US tariffs are probably minor,\" he said.\n\n\"The effects on the global economy are profound... what is interesting about the data I would say globally as well as in Australia so far – and it's very early days – is perhaps some of the worst predictions of what this might mean have not yet come to pass...\n\n\"The day after Brexit happened, everyone thought the world would end and it didn't.\n\n\"Ten years on, you're seeing some of the profound effects of some of those changes for sustainable growth rates and some of the fundamental things in the economy.\n\n\"Going back to the things at the beginning will have more and lasting effects than 'here today, gone tomorrow'.\"\n\nREAD MORE: Australia spared any new tariffs as Trump announces new import taxes ﻿\n\nThe RBA is keeping a close eye on the tariff developments. (AFR)\n\nWhy was Australia spared a tariff hike?\n\nMuch has been made of Australia's tariff remaining steady shortly after the federal government paused ﻿biosecurity restrictions on US beef exports, which had been singled out by Trump during his so-called Liberation Day announcement.\n\nThe government insists that wasn't a form of bargaining, and the decision was made purely on scientific evidence.﻿\n\nWhether that played a role in Trump's decision or was just a coincidence probably won't be known for certain.\n\nHowever, it appears the (relative) reprieve largely comes down to the fact Australia runs a trade deficit with the United States – that is, it buys more goods and services from the US than it sells.\n\nBloomberg has reported the White House put nations into three groups: those who run a trade deficit with the US; those who either have a small trade surplus or a deal with the US; and those without a deal and with a big trade surplus with the US.\n\nThat last group ﻿was slapped with high tariffs, the middle group copped around about 15 per cent, while the first – including Australia – received 10 per cent.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/australia-breast-cancer-samuel-johnson/c8ffe4c4-107d-4a9e-806a-33b9a363bb63",
    "title": "The breast cancer survivor who has Aussie actor to thank",
    "publish_date": "Fri, 01 Aug 2025 09:17:00 +0000",
    "category": "lifestyle",
    "authors": [
      "Aug"
    ],
    "text": "A breast cancer survivor who was inspired by an Aussie actor to get a mammogram is urging others to do the same.\n\nLuan Lawrenson-Woods said seeing actor and advocate Samuel Johnson discussing breast cancer on an episode of The Project in 2017 inspired her to get a mammogram.\n\nIt turned out Lawrenson-Woods was in the early stages of breast cancer, and she admits she didn't catch the signs.\n\nLawrenson-Woods underwent years of radiotherapy, chemotherapy and surgery followed, before she was declared cancer-free. (Nine)\n\n\"I hadn't noticed any lumps or bumps - just been like coughing and just generally unwell,\" she told 9News.\n\n\"I just thought, you know what mammograms are free for over 40s. It was just like going to get my car checked.\"\n\nShe also said it wasn't until seeing Johnson on television that she made the call.\n\nJohnson's sister Connie was diagnosed with breast cancer and later passed away in 2017.\n\nJohnson's sister Connie was diagnosed with breast cancer and later passed away in 2017. (Nine)\n\nHe started the charity Love Your Sister, which is dedicated to supporting cancer research.\n\nLawrenson-Woods underwent years of radiotherapy, chemotherapy and surgery followed, before she was declared cancer-free.\n\nThe experience turned her into an advocate as well, but she never had the chance to thank Johnson until they met at a Patients Australia gala in Melbourne.\n\nThe experience turned her into an advocate as well, but she never had the chance to thank Johnson until they met at a Patients Australia gala in Melbourne. (Nine)\n\nJohnson said he was proud of Lawrenson-Woods taking initiative and catching the cancer early.\n\n\"My sister would be so thankful you were so vigilant because she was kicking herself because she knew something was wrong,\" he said.\n\nLawrenson-Woods used the gala to highlight the importance of early detection in helping treat breast cancer.\n\n\"You know you best; if something isn't right - go and get it checked out,\" she said.\n\nThe pair continue to be strong advocates for supporting breast cancer sufferers and survivors, and Johnson said it is a collective effort.\n\n\"My sister used to love saying Sam this is bigger than us - it's not about us, it's about everyone out there,\" he said.\n\n\"Hopefully they're listening and speaking to their doctors.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/new-sunshine-coast-marathon-track-trial-for-2032/105600938",
    "title": "Pacers help runners reach personal best in Sunshine Coast Marathon",
    "publish_date": "Sat, 02 Aug 2025 02:00:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "More than 15,000 runners will take to a new-look Sunshine Coast Marathon course on Sunday in what organisers say will be a sneak peek into what the 2032 Olympics course could look like.\n\nThe course will have runners of all levels itching to give it a crack and potentially set a new personal best.\n\nBut, as always, there will be a collection of runners like Ian Chang, known as pacers, who put their own ambitions aside to help others have a better run.\n\n\"It was a natural calling after years of running,\" said Mr Chang, who has been a pacer for three years.\n\nDressed in yellow with a helium balloon and a designated time tied above their heads, pacers are experienced runners who help guide participants towards their goals.\n\nIan Chang (middle) says pacing gives him more joy than trying to set his own personal best time. (Supplied: Ian Chang)\n\nMr Chang, who will help runners aiming for a 4-hour 15-minute time, said he found it more rewarding after running marathons for five years.\n\n\"I suddenly just felt like it was time for me to contribute to the running community and think about how I can help the beginner and guide them across the finish line,\" he said.\n\n\"It's more enjoyable. To help a group of people achieve their goal brings me so much happiness.\"\n\nBeginners beware\n\nMr Chang said getting too excited was a common rookie error.\n\n\"It is easy for beginners to lose their focus,\" he said.\n\nThe new loop course will take in the best sights across the Sunshine Coast. (Supplied: Sunshine Coast Marathon)\n\n\"Once the race starts, there are a lot of runners, and they tend to just follow someone because they're excited, and if they follow the wrong person — who is going too fast for their target — they will lose sight of the goal.\"\n\nHe said keeping an eye on the pacer with their goal time could avoid a lot of pain and heartache.\n\n\"Run with a pacer because what's the pacer's job? To make sure that you can cross the finish line easily,\" he said.\n\n\"That is what we try to convince the runner: always follow the plan and remember you're not alone.\"\n\nA sneak peek of 2032\n\nThe Sunshine Coast Marathon course was redesigned this year to feature a single-lap route taking in picturesque sights.\n\nRunners will start at Alexandra Headland and run north to Mudjimba and back, which could form a blueprint for the Brisbane Olympic and Paralympic marathon course.\n\nEvent managing director Jason Crowther believed it was the best course for the city.\n\nMore than 15,000 runners will take part in the Sunshine Coast Marathon this year. (Supplied Sunshine Coast Marathon)\n\n\"It's flat, fast and takes in the best parts of the coast,\" Mr Crowther said.\n\nHe said the 2032 course would not be confirmed by the International Olympic Committee until four years before the games, but he said the city would like to host world championship events.\n\n\"Then we can bring international athletes to the event and have it as a training run for when we do know where that 2032 course is going to be,\" he said.\n\nInjection during off-peak\n\nIt is estimated that the race weekend will generate about $10.5 million for the local economy, according to Visit Sunshine Coast.\n\nChief executive Matt Stoeckel said the event was a major boost to tourism during the winter months, with more than half of all participants coming from outside the region.\n\n\"Our hotel occupancy rate is 70 per cent this weekend and that's up more than 8 per cent year on year,\" he said.\n\n\"We sure hope it continues to grow in future years.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/canadian-open-champion-jessica-pegula-beaten-by-world-number-386/105604618",
    "title": "Canadian Open champion Jessica Pegula beaten by world number 386 in Montreal",
    "publish_date": "Sat, 02 Aug 2025 01:53:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Two-time defending champion Jessica Pegula was eliminated in the third round of the Canadian Open, falling 3-6, 6-4, 6-1 to Anastasija Sevastova in Montreal.\n\nSevastova, a 35-year-old from Latvia who was ranked 11th in 2018 but has fallen to 386th, broke the third-seeded Pegula six times on 10 chances.\n\n\"Somehow, I was down 2-0 in the second set and started to play better and better,\" Sevastova said. \"Third set, I played really good. \"Just trying to stay on the court as long as possible.\"\n\nIn the night session, Wimbledon champion Iga Świątek of Poland routed Eva Lys of Germany 6-2, 6-2. The second-seeded Świątek advanced to face 16th-seeded Clara Tauson of Denmark, a 6-3, 6-0 winner over Ukraine's Yuliia Starodubtseva.\n\nSevastova has played 24 WTA Tour-level matches in four years. She got a spot in the main draw with a protected ranking because of a knee injury. In March 2024, in her fourth tournament back from maternity leave, she tore her ACL in a tour event in Austin, Texas.\n\n\"It's tough, but I think I'm a fighter, also on court,\" Sevastova said. \"I didn't want to give up. This was really about coming back and showing that you can do it after a torn ACL, after such a setback. It was like unfinished business.\"\n\nSevastova is the lowest-ranked player to beat a top-10 player since Angelique Kerber edged Jelena Ostapenko last year at Indian Wells.\n\nShe beat Australian Ajla Tomljanovic in three sets in the opening round at the Canadian Open, before eliminating Polish 25th seed Magda Linette to set up the match against Pegula.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nThe loss continued a poor run for the fourth-ranked Pegula, who won her opener in Montreal over Maria Sakkari of Greece, but exited Wimbledon and the D.C. Open after one match in July.\n\n\"It hasn't been great, to be honest,\" Pegula said. \"I don't really feel like I'm playing great tennis. At times I am, but I feel very up and down, kind of sloppy, which I don't like. It really bothers me.\"\n\nSevastova will take on Naomi Osaka, who moved to the fourth round with a 6-2, 6-4 victory over Jelena Ostapenko of Latvia.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nOsaka, a former world number one from Japan, is playing her first tournament with coach Tomasz Wiktorowski, She had five aces and converted six of nine break-point opportunities to win the match in one hour, 12 minutes.\n\n\"She broke me a couple times, but she's a really good returner, so I can't take that personally,\" Osaka said.\n\n\"I went in there knowing she's a great player, and if I give her a chance she's going to hit a winner on me, so I just tried to keep my pace and stay as solid as I could.\"\n\nSixth-seeded Madison Keys beat fellow American Caty McNally 2-6, 6-3, 6-3.\n\n\"Today I did a good job of bouncing back after the first set,\" Keys said. \"Let go of the first set and move on. Happy I was able to do that.\"\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/triple-transplant-family-leads-calls-for-more-organ-donation/105470494",
    "title": "Organ transplants gave family the 'gift of life' three times",
    "publish_date": "Sat, 02 Aug 2025 01:38:12 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The anxious wait for an organ transplant is something no family wants to experience, but the Stolker family has endured it three times.\n\nJoe Stolker has had a kidney transplant and his wife Leonnee and their son Levi have both had heart transplants.\n\n\"It's an emotional rollercoaster, it doesn't get easier,\" Ms Stolker said.\n\nShe said waiting for an available organ and undergoing transplant surgery were incredibly difficult and having to watch her child go through the same process was even harder.\n\nDonateLife says there were 105 heart transplants performed in Australia in 2024. (ABC New England North West: James Paras)\n\nBut after three successful organ transplants, the Stolkers say they've been given a new lease on life.\n\nThe Tamworth family is campaigning for organ donation awareness for the 1,800 other Australians who remain on the transplant waitlist.\n\nRare genetic mutation\n\nIn 2011, Ms Stolker began suffering heart failure just weeks before giving birth to her son.\n\nDoctors informed her she would require a heart transplant after she gave birth.\n\n\"We spent almost six weeks in the hospital after Levi was born, doctors couldn't figure out why a young fit mum suddenly had heart failure,\" Ms Stolker said.\n\nShe said she could barely nurse her newborn as doctors searched for a new heart.\n\nIt took roughly eight months after Levi was born for a suitable heart to be found.\n\n\"It was scary, there was lots of unknowns, what was causing it or why,\" Ms Stolker said.\n\nLevi was diagnosed with the same genetic mutation as his mother. (Supplied: Leonnee Stolker)\n\n\"I almost felt selfish in a way. You are so looking forward to that call but at the same time, you know what needs to happen for that organ to become available.\n\n\"You definitely feel the grief, excited isn't the right word, but it gives you a chance at a future.\"\n\nMs Stolker later underwent genetic testing in 2016 and was diagnosed with a rare genetic mutation of the phospholamban (PLN) gene in the heart.\n\nThe condition occurs when the heart is missing an essential protein, making it pump harder and become enlarged.\n\nLeonnee Stolker with Levi after her heart transplant. (Supplied: Leonnee Stolker)\n\nMs Stolker's sister was also diagnosed with the rare condition and had to have a heart transplant.\n\nMs Stolker said it was likely their father died from the same disease.\n\nSon suffers same condition\n\nEarlier this year, Ms Stolker and her husband discovered Levi was suffering from similar heart failure symptoms.\n\nMs Stolker found out her son Levi had inherited the mutation.\n\n\"I always hoped I would never have to go through it again with Levi … emotionally it's different when it's your own child,\" she said.\n\nLevi had experienced shortness of breath after a school hike, prompting a visit to the hospital where doctors told him he would need to be placed on the transplant list.\n\n\"It was pretty scary, I was anxious, but I felt like I was more confident it would be fine after having two parents who were transplant patients,\" Levi said.\n\nLevi Stolker is counting down the days until he can return to the footy field. (Supplied: Leonnee Stolker)\n\nMs Stolker said the doctors gave them a timeframe of 12 to 18 months for a new heart.\n\nLuckily, it only took a fraction of that time.\n\n\"We tried to suppress our emotions [during the wait], just so we could be there for Levi and support him,\" Ms Stolker said.\n\nAfter undergoing the lifesaving transplant in May, the 14-year-old is checking off recovery milestones quicker than anyone could have expected.\n\n\"People think life would be pretty different now, but it's pretty normal besides all the medication I have to take,\" Levi said.\n\nLevi Stolker plays rugby for his school and also the Pirates Rugby Club, Tamworth. (ABC New England North West: James Paras)\n\nA keen rugby union player, Levi hopes he'll be back on the football field as early as next month.\n\n\"I love being active, getting around, playing sports and just getting amongst it all,\" he said.\n\nNew lease on life\n\nMr Stolker knows all too well the experience of an organ transplant, not only from watching his wife and son go through it, but from his own experience having a kidney transplant in 2017.\n\nHe had focal segmental glomerulosclerosis (FSGS), which led to kidney failure and being placed on dialysis for six years.\n\n\"My kidneys basically deteriorated over time … it might have been hereditary, it might have been because of a knock to the kidneys,\" he said.\n\nJoe Stolker was on dialysis for six years before his transplant. (Supplied: Leonnee Stolker)\n\nMr Stolker said the entire family was incredibly grateful to the people who donated their organs and the medical staff who ensured they had successful transplants.\n\n\"Words can't express how grateful we are, how crazy it is, the change in our life that it has created, not just once, twice, but three times,\" he said.\n\nMr Stolker said the family wanted to raise awareness of the life-changing impact an organ donation could have and encourage Australians to be donors.\n\nThe Stolkers are launching a rugby union match next month in Tamworth, with all the proceeds going towards Transplant Australia.\n\nDonateLife encourages families to talk about organ donation. (Supplied: Leonnee Stolker)\n\nNot-for-profit organ donation awareness organisation DonateLife said just a small conversation could lead to amazing stories like the Stolker family's.\n\n\"On average, 50 people a year will die whilst waiting on the transplant list,\" said Juliana Celcer, DonateLife's director of nursing.\n\nShe encouraged people to have a conversation with their family about becoming an organ donor.\n\nWhen a family member is a registered donor, eight out of 10 families agree to donation.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/tesla-ordered-to-pay-375-million-in-fatal-autopilot-crash/105604508",
    "title": "Tesla ordered to pay $375 million in fatal autopilot crash",
    "publish_date": "Sat, 02 Aug 2025 01:34:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victims of a fatal 2019 crash caused by an autopilot failure in a Tesla Model S will receive $US243 million ($375 million) in damages after a jury found Elon Musk's electric vehicle company liable.\n\nJurors in a Miami federal court on Friday, local time, awarded the estate of Naibel Benavides Leon and her former boyfriend, Dillon Angulo, $US129 million in compensatory damages, plus $US200 million in punitive damages, according to a verdict sheet.\n\nTesla was held liable for 33 per cent of the compensatory damages, or $US42.6 million.\n\nJurors found the driver, George McGee, liable for 67 per cent, but he was not a defendant and will not have to pay his share.\n\n\"Tesla designed Autopilot only for controlled-access highways yet deliberately chose not to restrict drivers from using it elsewhere, alongside Elon Musk telling the world Autopilot drove better than humans,\" Brett Schreiber, a lawyer for the plaintiffs, said in a statement.\n\n\"Today's verdict represents justice for Naibel's tragic death and Dillon's lifelong injuries,\" he added.\n\nTesla said it will appeal.\n\n\"Today's verdict is wrong and only works to set back automotive safety and jeopardise Tesla's and the entire industry's efforts to develop and implement life-saving technology,\" the company said.\n\nTesla shares fell 1.8 per cent on Friday, and are down 25 per cent this year.\n\nThe plaintiffs had sought $US345 million in damages. Their lawyers said the trial was the first involving the wrongful death of a third party resulting from Autopilot.\n\nImpact on future cases\n\nElon Musk wants to make the company a world leader in autopilot vehicles. (Reuters: Carlos Barria)\n\nTesla has faced many similar lawsuits over its vehicles' self-driving capabilities, but they have been resolved or dismissed without going to trial.\n\nIn June, a judge rejected Tesla's bid to dismiss the Florida case. Experts said Friday's verdict may spur more lawsuits, and could make future settlements more costly.\n\n\"It's a big deal,\" said Alex Lemann, a law professor at Marquette University.\n\n\"This is the first time that Tesla has been hit with a judgement in one of the many, many fatalities that have happened as a result of its Autopilot technology.\"\n\nThe verdict could also impede efforts by Mr Musk, the world's richest person, to convince investors that Tesla can become a leader in so-called autonomous driving for private vehicles and robotaxis it plans to start producing next year.\n\nAs Tesla's electric vehicle sales fall, much of its nearly $US1 trillion market value hinges on Mr Musk's ability to pivot the company into robotics and artificial intelligence.\n\nDriver's role\n\nThe trial concerned an April 25, 2019, incident where Mr McGee drove his 2019 Model S about 100 kilometres per hour through an intersection into the victims' parked Chevrolet Tahoe as they were standing beside it on a shoulder.\n\nMr McGee had reached down to pick up a cell phone he dropped on his car's floorboard and allegedly received no alerts as he ran a stop sign and stop light before hitting the victims' SUV.\n\nMs Benavides Leon was allegedly thrown 23 metres to her death, while Mr Angulo suffered serious injuries.\n\nMusk warns of 'rough few quarters' Photo shows The Tesla brand logo. Tesla's electric vehicle business faces challenges before its move into autonomous technology ramps up.\n\n\"We have a driver who was acting less than perfectly, and yet the jury still found Tesla contributed to the crash,\" said Philip Koopman, a Carnegie Mellon University engineering professor and expert in autonomous technology.\n\n\"The only way the jury could have possibly ruled against Tesla was by finding a defect with the Autopilot software,\" he said.\n\n\"That's a big deal.\"\n\nTesla, in its statement, said Mr McGee was entirely at fault.\n\n\"To be clear, no car in 2019, and none today, would have prevented this crash,\" the company said.\n\n\"This was never about Autopilot; it was a fiction concocted by plaintiffs' lawyers blaming the car when the driver — from day one — admitted and accepted responsibility.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/australian-cow-market-up-as-tariffs-loom-burger-price-roars/105599526",
    "title": "Aussie cow market takes off as tariffs loom and US burger prices rise",
    "publish_date": "Sat, 02 Aug 2025 01:20:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the world waited this week to see what US President Donald Trump's next move on tariffs would be, the value of cows in Australian saleyards started to soar.\n\nHeavy cows, light cows, it didn't matter. If they had four legs, they were in hot demand.\n\nAt Roma on Tuesday, processors forked out $4.40 a kilogram for heavy cows, which livestock agent Geoffrey Maslen said was incredible.\n\n\"Records were smashed here at Roma. In my 21 years, I can't remember cows getting $4.40 a kilo,\" he said.\n\n\" It was just magnificent … our cow market matched all the southern markets and it was quite exciting. \"\n\nThe national processor cow indicator jumped 46 cents a kilogram this week and is close to its record high reached in 2022.\n\nMeanwhile, the national dairy cow indicator is at an all-time high of $3.51 per kilogram.\n\nAt Echuca on Wednesday, some dairy cows made $3.90/kg, selling for nearly $3,000 each.\n\nThe dairy cow indicator has reached a record high, and the processor cow indicator is close to its record too. (ABC Landline)\n\nWhat's driving the cow market?\n\nProcessors are forking out record money for Australian cows, while the US is handing over record money for lean imported beef.\n\nThe US cattle herd is at its lowest point since the 1950s due to drought, and its supply of beef for making hamburgers is tight.\n\nLabor claims 'vindication' after escaping higher US tariff rate Photo shows An older man in a suit and red, spotted tie, speaks into a microphone on a podium during an address. With Australia now enjoying one of the world's lowest \"baseline\" tariff rates enacted by US President Donald Trump, the federal government is claiming vindication of its strategy, and vowing to send more goods into the United States.\n\nStoneX Australian livestock and commodities manager Ripley Atkinson said US demand for beef was strong, but Aussie processors were worried about the pipeline of cattle available.\n\n\"What's fundamentally driving the cow market at the moment is the southern processors and exporters looking to source slaughter stock to maintain kill chains [in abattoirs], maintain their workforce and operate their facilities,\" he told ABC Landline.\n\n\"The recent rain in southern Australia, on the edge of spring, has tightened the physical cattle supply and forced those processors to compete harder in northern markets — and that added competition is driving the market.\"\n\nThe national dairy cow indicator is at a record high. (ABC Rural: Annie Brown)\n\nIs Brazil about to bow out?\n\nThe US has relied heavily on beef imports from Australia and Brazil this year, but is now getting ready to enforce a 50 per cent tariff on Brazilian beef.\n\nThe tariff is due to take effect on August 7.\n\nEpisode3.net analyst Matt Dalgleish said the Brazil tariff would bring its beef trade with the US to a halt.\n\n\"I don't think we're going to see too much Brazilian beef go into the US for the rest of this year, and that will provide opportunities for Australia because our tariff is still at 10 per cent,\" he told the Country Hour.\n\n\"So it puts Australia in an even better position.\n\n\" The US needs that lean beef coming in so it can make burger patties at the right ratio. \"\n\nABC Landline has been told some Australian processors may have paid extra for cows this week in expectation of tariffs stopping the Brazil beef trade to the US.\n\nGlobal Agritrends analyst Simon Quilty said the cow price hike was \"not really about burgers, it's about the lack of throughput for southern processors\".\n\nHe also said the federal government's controversial decision to allow US beef imports looked to have \"paid off\", with Australia avoiding a Trump tariff hike — for now.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/us-corporation-for-public-broadcasting-to-close/105604428",
    "title": "Major public broadcasting group to close after Trump-led funding cuts",
    "publish_date": "Sat, 02 Aug 2025 01:09:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Corporation for Public Broadcasting has announced it will shut down operations in a massive blow to the public media network in the United States.\n\nThe Republican-controlled House of Representatives last month voted to pull $US1.1 billion ($1.71 billion) in funding over two years.\n\nThe demise of the corporation, known as CPB, is a direct result of President Donald Trump's targeting of public media, which he has repeatedly said is spreading political and cultural views opposite to those the US should be promoting.\n\nTrump's $9b public spending cuts approved by US House Photo shows Donald Trump in a blue suit and pink tie pointing with his left index finger while speaking The United States House of Representatives has approved the Trump administration's $US9 billion in cuts to public broadcasting and foreign aid programs.\n\nMr Trump has long claimed public broadcasting displays an extreme liberal bias and has generated an anti-public broadcasting groundswell among supporters in recent months.\n\nThe closure is expected to have a profound impact on journalism and the cultural landscape in the US.\n\nCPB helps fund both PBS and NPR, but most of its funding is distributed to more than 1,500 local public radio and television stations in small communities around the country.\n\nStations rely on public donations, sponsorships and local government funding to make up the remainder of their budgets.\n\nBut without federal funding, many rural stations could be at risk, which would impact educational programming, local news coverage and emergency broadcasts.\n\nCPB has deep ties with much of the nation's familiar programming, including NPR's All Things Considered, Sesame Street, and historically, Mister Rogers' Neighborhood and Ken Burns's documentaries.\n\nSesame Street has aired on PBS since its debut in 1969. (AP: Katie Oyan)\n\nCPB said its end, 58 years after being signed into law by President Lyndon B Johnson, would come in an \"orderly wind-down\".\n\nIn a statement, it said the decision was made in response to the funding cuts by Congress.\n\n\"Despite the extraordinary efforts of millions of Americans who called, wrote, and petitioned Congress to preserve federal funding for CPB, we now face the difficult reality of closing our operations,\" said Patricia Harrison, the corporation's president and CEO.\n\nA last-grasp attempt at funding fails\n\nDemocrats on the Senate Appropriations Committee made a last-ditch effort this week to save the CPB's funding.\n\nAs part of committee deliberations on Thursday, senator Tammy Baldwin authored, but then withdrew, an amendment to restore CPB funding for the coming budget year.\n\nShe said she still believed there was a path forward \"to fix this before there are devastating consequences for public radio and television stations across the country\".\n\n\"It's hard to believe we've ended up in the situation we're in,\" she said.\n\n\"And I'm going to continue to work with my colleagues to fix it.\"\n\nCPB's closure follows a decision by Republicans in the House of Representatives to claw back $US1.1 billion in funding. (AP: Julia Demaree Nikhinson)\n\nBut senator Shelley Moore Capito sounded a less optimistic tone.\n\n\"I understand your concerns, but we all know we litigated this two weeks ago,\" she said.\n\nClosure will come in phases\n\nCPB said it informed employees on Friday, local time, that most staff positions will end on September 30.\n\nIt said a small transition team will stay in place until January to finish any remaining work, including \"ensuring continuity for music rights and royalties that remain essential to the public media system\".\n\n\"Public media has been one of the most trusted institutions in American life, providing educational opportunity, emergency alerts, civil discourse, and cultural connection to every corner of the country,\" Ms Harrison said.\n\n\"We are deeply grateful to our partners across the system for their resilience, leadership, and unwavering dedication to serving the American people.\"\n\nNPR stations use millions of dollars in federal money to pay music licensing fees.\n\nNow, many will have to renegotiate these deals.\n\nNPR president and CEO Katherine Maher estimated recently that 96 per cent of all classical music broadcast in the US is on public radio stations.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/protecting-mangalagun-place-of-the-giants-at-crab-creek/105573478",
    "title": "Call for greater protection of WA's 'place of the giants'",
    "publish_date": "Sat, 02 Aug 2025 01:01:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "During the dry season in Western Australia's far north, caravans crowd the dusty track that leads to a place where red dirt meets the turquoise sea.\n\nIt's where residents and tourists in Broome, 2,200 kilometres north of Perth, visit to catch a glimpse of migratory shorebirds that dot the sand.\n\nOthers come to cast a line in an attempt to catch the abundant fish that ripple the still water of Roebuck Bay.\n\nMost know the popular spot as Crab Creek, but for Yawuru elder Dianne Appleby it's Mangalagun, a place strong in resources and spiritual importance for traditional owners.\n\nDianne Appleby says Mangalagun needs to be protected for future generations. (ABC Kimberley: Dunja Karagic)\n\n\"It's very rich in culture, very rich in story, very rich in all the feeding for birds,\" she says, as she looks over the water.\n\nThe giant spirit bird\n\nAs the setting sun peers through the red cliffs, Ms Appleby points to a rock separated from the rest, which she says is the beak of a giant bird.\n\nDianne Appleby says the story of Jibi the giant spirit bird emphasises the importance of looking after children. (ABC Kimberley: Dunja Karagic)\n\n\"This is the story of Jibi, a big spirit bird for us and it looks after country for us,\" she says.\n\n\" The bird story came from many generations and has been handed down and looked after by our old people. \"\n\nThe spirit bird travelled throughout the night, searching for children to take \"far, far away\" if their parents weren't watching over them.\n\nWhen Ms Appleby was outside as a young child, she says her mother would often think of Jibi when the sun would begin to set.\n\n\"'Hey, where them kids? Sun going down now', that's what my mother and father used to say,\" Ms Appleby says.\n\nMangalagun (Crab Creek) is a popular fishing spot in the Kimberley. (ABC Kimberley: Dunja Karagic)\n\n\" The watchful eye of parents and grandparents, that's the passing on and teaching of the spiritual meaning of family and care and respect for this place. \"\n\nMs Appleby says Jibi's dreaming story serves as an important lesson for families.\n\n\"Mothers we say, 'Look after your kids, don't neglect them,'\" she says.\n\n\" Children listen to your mother, that bird will come, come take you. \"\n\n'Place of the giants'\n\nAs Ms Appleby walks along the beach at Mangalagun, she says Jibi was not the only giant that once roamed the landscape.\n\nShe points out fossilised dinosaur footprints and other imprints, which she says belonged to giant beings.\n\n\"This is the place of the giants,\" Ms Appleby says.\n\n\"Yawuru has spiritual giants, physical giants, they are here to protect this country.\n\n\"This is the country of the giants. It was a forest of wonderful plants, animals and the flowing water, wulla means water.\"\n\nWhile giants may no longer roam Mangalagun, today the area remains rich in bush tucker, which Ms Appleby collects.\n\nDianne Appleby says Mangalagun is rich in bush tucker. (ABC Kimberley: Dunja Karagic)\n\nOver a decade ago, a management plan published for Mangalagun identified an increase in extreme weather events, populations and industries were stressors to the environmental quality and cultural values of the area.\n\nMs Appleby says it is crucial the area is protected for future generations.\n\n\"Our people were giants, the spirits of them are giants … and we carry that in our hearts and have to look after it,\" she says.\n\n\" If we don't look after it and we just neglect our responsibility, we are going to find it hard for the next generation to understand the significance of this place and the stories that come with it. \"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/baby-born-from-the-oldest-embryo/105600756",
    "title": "Baby born in US from an over‑30‑year‑old embryo breaks record",
    "publish_date": "Sat, 02 Aug 2025 00:24:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "A US baby boy born from an embryo that had been in storage for more than 30 years is believed to have broken the record for the world's \"oldest\" baby.\n\nThe embryo of Thaddeus Daniel Pierce, who was born on July 26, had been cryopreserved since 1994, according to MIT Technology Review, which broke the story.\n\nHis parents, Lindsey and Tim Pierce, who live in the US state of Ohio, \"adopted\" the embryo from the 62-year-old woman who created it.\n\nThe couple said those in their lives had likened it to \"something from a sci-fi movie\".\n\nWhat's IVF, and how did a provider get an embryo transfer wrong twice? Photo shows A white sign on a building reading \"Monash IVF\" Monash IVF has reported two bungles in as many months. So what is IVF, how is the process managed, and how can it go wrong?\n\nMr Pierce was a toddler when his son's embryo was first created, and Thaddeus also has a 30-year-old sister.\n\nThe previous record-holder for an embryo that was frozen before a successful live birth was a pair of twins who were born in 2022 from embryos frozen in 1992.\n\nLinda Archerd, who donated the embryo, said it had been \"pretty surreal\".\n\n\"It's hard to even believe,\" she told the US journal.\n\nThe birth was made possible with the assistance of a Christian embryo adoption service.\n\nThese services believe an embryo is equivalent to a born child and look to reduce the number of discarded embryos.\n\nThis includes the case of frozen embryos that have been stored in outdated ways.\n\nChristian embryo adoption services look to reduce the number of embryos that are discarded. (AP: Michael Wyke)\n\nMs Archerd originally froze four embryos with the Snowflakes Embryo Adoption Program run by the Nightlight Christian Adoptions agency.\n\nAfter having her own daughter, the other three were left in storage, and despite divorcing her husband, she did not want to discard the embryos.\n\nThe program Ms Archerd used also allows donors to choose a couple, and can state religious, racial and nationality preferences.\n\nShe wanted a white, married Christian couple from the US.\n\n\"I didn't want them to go out of the country,\" Mr Archerd told the journal.\n\n\"And being Christian is very important to me, because I am.\"\n\nNo plans to break records\n\nMs Archerd finally found her match in the Pierces, who had been trying to have a child for seven years.\n\nA hospital patient dropped frozen embryos onto a clinic floor. What followed has rocked IVF in the US Photo shows Sperm injection process When a hospital patient wandered into a US fertility clinic in 2020, they caused a chain of events that led to a major court ruling this week. It's left the IVF sector reeling, and patients in limbo.\n\n\"We didn't go into it thinking we would break any records,\" Mrs Pierce told the journal.\n\n\"We just wanted to have a baby.\"\n\nThe pair say, despite a rough birth, both Mrs Pierce and Thaddeus are doing well.\n\nMs Archerd said he looks just like her own daughter as a baby.\n\n\"I pulled out my baby book and compared them side by side, and there is no doubt that they are siblings.\"\n\nSnowflakes' vice-president Elizabeth Button said the embryo adoption program honours Ms Archerd for donating her remaining embryos, and Mr and Mrs Pierce for adopting embryos that many fertility clinics would not have taken a chance on.\n\n\"Though we encourage placing families to make decisions sooner rather than later regarding their remaining embryos, this story affirms that frozen embryos do not have a 'shelf life'. All are deserving of the opportunity to be born.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/hannah-beazley-stateline-local-government-law-reforms/105597736",
    "title": "After recent scandals, government welcomes increased power over councils",
    "publish_date": "Sat, 02 Aug 2025 00:06:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "If keeping up to date with what your local council is doing isn't that high on your to-do list, you're probably not alone.\n\nThe often mundane cogs of local government turn without much scrutiny, because the vast majority function as they should.\n\nBut if the recent string of council dramas across Perth has taught us anything, it's that we need to look a lot closer.\n\nProblem-plagued local government referred to corruption watchdog Photo shows A photo of the City of Nedlands sign with the postcode 6009 included The referral is for a separate matter aside from recent controversies including the council refusing to give up land for a children's hospice and four councillors resigning in a day.\n\nThe state government is watching, and is unapologetic about plans to beef up its powers to intervene.\n\nBut tinkering with other branches of democracy can put governments on dangerous ground.\n\nWho can forget former Liberal premier Colin Barnett being forced to wave the white flag after attempting to slash the number of Perth councils in half back in 2015, not long before he left office for good.\n\nIt's a lesson Local Government Minister Hannah Beazley is likely to be keeping front of mind.\n\nMore councils under spotlight\n\nThere's no hiding how ticked off Ms Beazley has been with Nedlands council.\n\nWhat started off as a spot fire of dysfunction turned into raging flames of controversy.\n\nHannah Beazley says she would have loved to act on the City of Nedlands sooner. (ABC News: Kenith Png)\n\n\"It's been incredibly frustrating,\" she told Stateline.\n\n\" It's been really frustrating across the sector … when you have an outlier like the City of Nedlands, which is publicly behaving badly, not being able to make decisions and being highly dysfunctional, it casts a poor pallor over the whole sector. \"\n\nWhile she describes it as an outlier, there are clear recent examples of dysfunction gripping other councils.\n\nThe City of Nedlands is made up of some of the most expensive real estate in Perth. (ABC News: Mitchell Edgar)\n\nAs recently as April, a commissioner had to be brought in to run the Shire of Derby/West Kimberley after five council members resigned.\n\nIn Port Hedland, councillors have been walking out the door amid allegations of \"extreme views\" — including one councillor who made national headlines praising Russia's elections as the most \"transparent\" in the world and congratulating Vladimir Putin.\n\nNedlands mayor delivers extraordinary broadside after councillors resign Photo shows A woman in a powder pink suit stands in a council office City of Nedlands Mayor Fiona Argyle launches an extraordinary broadside against some members of her council, on a day when four of them resigned.\n\nAnd who can forget the \"soap opera\" saga of the City of Perth?\n\nThat culminated in the sacking of the entire council back in 2018 amid backbiting and a Corruption and Crime Commission finding that former lord mayor Lisa Scaffidi \"signally failed in her duties … by not disclosing gifts and contributions to travel\" she received while in her role.\n\nMs Beazley said she would have preferred to act sooner on Nedlands, but the Local Government Act places clear limits on the minister's power.\n\n\"The sector has been talking to me for months about, you know, when can you step in, what can you do, because it is incredibly frustrating, not just for me as minister, but for all well-functioning local governments,\" Ms Beazley said.\n\nBut she is hopeful law changes passed late last year, which she describes as the \"biggest reform to the sector in 25 years\", will ensure earlier intervention is possible.\n\nHannah Beazley says the reforms of local government laws are the biggest in a quarter of a century. (ABC News: Kenith Png)\n\nAmong many things, they will see the establishment of a new local government inspector to oversee WA's 137 local governments.\n\nThe inspector will have broad powers to investigate allegations of bad behaviour, reminiscent of those wielded by the state's corruption watchdog or those tasked with independently investigating the state's prison sector.\n\nThe new inspector will be able to demand someone appear and give evidence, produce documents and information, and enter local government property without a warrant.\n\nNo reduction in local governments\n\nBut when it comes to broader reform, Ms Beazley is not planning on taking a leaf out of the Liberal playbook under Colin Barnett.\n\n\"I'm not going to go down the route of forcibly merging local governments, as what happened in the previous government,\" Ms Beazley said.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nHowever, she said she would be open to \"boundary adjustments\" in the case of councils facing financial viability issues.\n\nThe premier is also on the record saying while he thinks there are too many local governments in WA, the \"system that we have is what it is\" and it's not his policy to try to slash that number.\n\nPerhaps the best way to ensure the viability of this often unloved branch of democracy is for us to all pay more attention, and not just when local councils hit the headlines for all the wrong reasons.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/tour-de-france-femmes-stage-seven-maeva-squiban/105604372",
    "title": "'I just wanted to lie down': Squiban wins second straight Tour de France Femmes stage",
    "publish_date": "Sat, 02 Aug 2025 00:00:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "France's Maeva Squiban has delighted home fans with a solo victory on stage seven of the Tour de France Femmes, her second win in two days, becoming only the fourth rider to claim back-to-back stages at the race.\n\nThe 23-year-old attacked on the upper slopes of the Col du Granier (8.9km at 5.4 per cent) on Friday, local time, to reach the finish of the hilly stage alone, which lifted the UAE Team ADQ rider to second in the polka dot jersey standings, level on 17 points with Dutchwoman Silke Smulders.\n\n\"Honestly, winning once on the Tour is already huge and now a second win … It was an incredible day. I think it was one of the hardest days of my life, mentally as well as physically. But you have to give everything,\" Squiban said.\n\n\"On the last climb, I just wanted to lie down on the ground, and by the end, I think for the last 15 kilometres, I was barely present — I couldn't hear anything in my ear.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nIt was another French one-two as Cedrine Kerbaol (EF Education-Oatly) crossed the line 51 seconds behind Squiban to take second place, and American Ruth Edwards claimed third.\n\nAustralia's Sarah Gigante came 16th on the stage, 1 minute 11 seconds behind the stage winner.\n\nShe now sits in eighth place in the overall standings, 1:14 behind the yellow jersey, Mauritian rider Kimberley Le Court Pienaar (AG Insurance-Soudal).\n\nA 17-rider breakaway had lit up the 159.7km stage from Bourg-en-Bresse, with Fiona Mangan (Winspace Orange Seal) becoming the first Irish rider to win an intermediate sprint at the Tour.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe move split on the Cote de Saint-Franc before Squiban's decisive attack on the final climb. Le Court Pienaar lost ground on the Granier but finished sixth to retain the yellow jersey.\n\nLe Court is ahead of Frenchwoman Pauline Ferrand-Prevot (Visma-Lease a Bike) by 26 seconds and Poland's Katarzyna Niewiadoma Phinney (Canyon-SRAM) by 30 seconds.\n\nMountains classification leader Elise Chabbey (FDJ-Suez) endured a difficult day and was distanced from the peloton before Squiban's climb.\n\nSaturday's mountain stage will be from Chambery to Saint-Francois-Longchamp.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/rural-newspaper-the-buloke-times-turns-150/105595032",
    "title": "After 150 years, Australia's longest newspaper dynasty is set to change hands",
    "publish_date": "Fri, 01 Aug 2025 22:54:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "For 150 years, The Buloke Times has rolled off the press in Donald, a small town of 1,500 in regional Victoria.\n\nAnd for that entire time, it's been run by one devoted family.\n\nNow aged 95, editor Robin Letts has been at the helm of the newspaper for more than half that history.\n\n\"Robin has been here 76 years,\" said Quill McQuilty, a journalist with The Buloke Times.\n\n\"That's half, over half [the newspaper's history] that he's been involved in this paper.\n\n\"That's just amazing.\"\n\nQuill McQuilty reads an edition of The Buloke Times. (ABC Landline: Tim Lee)\n\n\"Running a bi-weekly newspaper, it's seven days a week,\" Robin Letts said.\n\nHis busy week involves deciding on each edition's content, proofreading pages prior to publication and writing the odd editorial.\n\nThough he admits his age is catching up.\n\n\" I no longer can read the numbers on the backs of players, which is pretty hard when you're trying to identify them and write a footy report. \"\n\nA family legacy in newsprint\n\nThe Buloke Times masthead arose when council amalgamations in the mid-1990s formed the Buloke Shire, which the paper mostly serves.\n\nThe paper began as The Donald Times in 1875, founded by the entrepreneurial Godfrey Morgan.\n\nGodfrey Morgan first moved to Australia with a letter of support from Charles Dickens. (Supplied)\n\nIn 1852, aged 18, Mr Morgan arrived in Australia from England with a letter of introduction from literary great Charles Dickens to report on the gold rush.\n\n\"He [Godfrey Morgan] was Dad's grandfather, so that would make him my great-grandfather and David's great-great-grandfather,\" Robin Letts explained.\n\nRobin's son David Letts is the newspaper's general manager — a somewhat inadequate job description.\n\nRobin Letts's newspaper career began in 1947 when he was 17 years old. (ABC Landline: Tim Lee)\n\nHe's also the principal printer, typesetter, sometime photographer and journalist.\n\nOn its twice-weekly publication day he's also the principal paper boy, delivering the freshly printed newspaper to the Wimmera region's towns of Donald, St Arnaud, Wycheproof, Watchem, Birchip and Charlton.\n\nA young Robin Letts pictured with his father and then editor Goff Letts circa 1985. (Supplied)\n\nFor The Buloke Times staff, like in all small newspapers, versatility is essential.\n\n\"Anyone could be called to grab a camera and go out and take a photo or do a couple of paragraphs or hunt someone down to identify a photograph,\" David Letts said.\n\nDecades at the desk\n\nFamily involvement has been pivotal to the newspaper's survival and newsprint runs deep in the family's DNA.\n\nIn 1922 the Morgan family appointed G.W.L. \"Goff\" Letts, Robin's father, as editor.\n\nGoff Letts was editor from 1922 until his death in 1987. (Supplied)\n\n\"He spent 66 years as the editor and as a matter of fact history has it he wrote his final editorial just before he died in hospital in Donald,\" Robin Letts said.\n\nDavid Letts said working alongside both his father and grandfather was special.\n\n\"It was a lot of fun to have the three of us here and then grandpa or Goff, when he passed away, then of course Robin took over the editorship,\" he said.\n\n\"It chalked up a lot of years as editor between the two of them.\"\n\nDavid Letts checks a newly printed page of the newspaper. (ABC Landline: Tim Lee)\n\nRobin Letts's newspaper career began in 1947 at age 17.\n\nInitially focused on sports reporting, he soon covered all the essential topics of a good local newspaper, namely news, sport and opinion pieces.\n\n\"With a pen in his hand he was a giant,\" said former employee Brian Bayles.\n\n\"Mind you I don't think he has ever lifted the bonnet of a car and wouldn't have the faintest idea of how to change a tyre, but put a pen in his hand and he was very much above average,\" Mr Bayles said.\n\nBrian Bayles, now 81 and retired, spent 59 years at the newspaper. (ABC Landline: Tim Lee)\n\nRobin Letts's unwavering passion, energy and commitment to the newspaper continues to astound everybody.\n\n\"He runs circles around us. It's just amazing at his age to still be so driven and dedicated to his job,\" colleague Ms McQuilty said.\n\nTurning the page after 150 years\n\nThe newspaper this week celebrated its 150th anniversary with a commemorative edition for its readers and a birthday cake for its staff.\n\nThe Buloke Times has been published in several iterations since 1875. (ABC Landline: Tim Lee)\n\nThe Letts family's 150 years of continuous family ownership now eclipses that of the famous Fairfax family who bought into the then Sydney Herald, now The Sydney Morning Herald, in 1841, but lost ownership in 1990.\n\nHowever, in its milestone year the Letts family's unbroken century and a half proprietorship of the newspaper will also end.\n\nDavid Letts, who started at the paper after trade school in 1980 and has spent his entire working life at The Buloke Times, plans to retire.\n\n\"I don't think there's any other family members keen to take it on,\" he said.\n\n\"They've all got their own careers and everything else.\"\n\nRobin Letts will continue as editor, and there are discussions about who will take over The Buloke Times.\n\nGoff Letts wrote his last editorial from his deathbed. (Supplied)\n\n\"His father kept going until the end and I think Robin will just keep going,\" David Letts said.\n\n\"It's great for him because it keeps his mind active.\"\n\nThe ever modest Robin Letts protests that his role in the paper's ongoing success is overstated.\n\n\"It wouldn't be without the people I've got now,\" he said.\n\n\"And ones that we've had through the years. Absolutely wonderful people.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-02/sporting-clubs-fold-in-queensland-mining-towns-fifo-work-demand/105582446",
    "title": "In bleeding mining towns it's all work, no play as clubs forced to fold",
    "publish_date": "Fri, 01 Aug 2025 22:33:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's Saturday afternoon in the small, rural mining town of Tieri in central Queensland and the local footy field at Langerak Park should be packed.\n\nThe Peak Downs Pirates Rugby League Club is the social fabric of this 700-person town, and fans would normally be hustling to get a prime spot next to the bar, where they could flip open their camp chairs and cheer.\n\nBut today, there is no game.\n\n\"I've cried and I'm looking at grown men with tears in their eyes,\" said long-serving Pirates committee member Samantha Reinke, as she looks over an empty field from the clubhouse and grassed hill.\n\nAn empty Langerak Park, the home of rugby league in Tieri. (ABC Capricornia: Aaron Kelly)\n\nThe combination of two mines closing, seven-day rosters and a dwindling population have led to the club folding.\n\n\"Everybody looked forward to a home game and a lot of people also followed us to the other towns as well, which can be up to two and a half hour's drive,\" Ms Reinke said.\n\n\"That's all gone now and there's nothing else to do, so it's very demoralising for the community to lose something like this.\"\n\nImpacts of FIFO work\n\nThe town of Tieri, about 900 kilometres north-west of Brisbane, was established in 1983 as a service centre for the three local coal mines open at the time.\n\nNow there's just one.\n\nThe Glencore-owned Oaky Creek North Coal Mine in Tieri employs about 800 workers and is one of the most productive underground coal operations in the Bowen Basin.\n\nMitch Reinke grew up playing footy in Tieri. (ABC Capricornia: Aaron Kelly)\n\nBut with each new census, Tieri's population declines due to the impacts of fly-in fly-out (FIFO) work.\n\nHalf of the mine's workforce is FIFO and as the town shrinks, its sporting clubs are rapidly disappearing.\n\nOnce a hive of sporting activity, touch football, hockey, soccer, gymnastics, indoor cricket, tennis and lawn bowls are all things of the past.\n\nThe Pirates are the latest casualty.\n\nThe Peak Downs Pirates celebrate a win earlier this year. (Supplied: Peak Downs Pirates)\n\n\"As the years have gone by, and you see it with all the mining communities, especially the small ones like ours, it's almost impossible to get a full side,\" Ms Reinke said.\n\nThe disappointment and heartbreak are echoed by club president Mitch Reinke and coach Ben Liddell.\n\n\"We had over 50 people registered to play this season, which was promising, but with injuries and shift work it was very challenging,\" Mr Reinke said.\n\nBen Liddell is determined to keep rugby league alive in Tieri. (ABC Capricornia: Aaron Kelly)\n\nBefore the agonising decision to fold, the Pirates could only field five players for their last match.\n\nMr Liddell was devastated.\n\n\"The town's got a real thirst for rugby league and to have to pull the pin it was a really hard decision,\" he said.\n\nPirates diehards hope at some stage in the future the club can be resurrected and return to its glory days.\n\nFlow-on effects felt\n\nQueensland's Central Highlands are the cattle and coal capital of Australia, and in the neighbouring town of Capella, it is a similar story.\n\nThe race club and bowls club no longer exist while the tennis club is barely surviving.\n\nCathy Murray and Kate Sullivan have introduced pickleball to attract more people to the tennis courts. (ABC Capricornia: Aaron Kelly)\n\n\"Tennis started in about the 1930s here with two ant-bed courts,\" said Capella Tennis Club's Cathy Murray.\n\n\"In 1981, we started night fixtures and it was every night of the week and we had 100 people playing but it slowed down during COVID and we couldn't get any tennis players back to play.\"\n\nThe introduction of pickleball this year has the kept the gates to the now six courts open.\n\n\"We've lost our grocery store, we've lost our only doctor, it's a dying town really,\" she said.\n\nAndrew Jansen is a karate instructor on the Central Highlands and teaches classes in Capella and in nearby Emerald.\n\nAndrew Jansen has seen participation rates drop in karate. (ABC Capricornia: Aaron Kelly)\n\nHe said roster cycles and cost-of-living were the main impacts behind a decline in numbers.\n\n\"The bigger hours people are working, quite often we'll get a phone call to say, 'We can't make it, I'm at work still.'\"\n\nPain of dwindling numbers\n\nAccording to researchers, country clubs and competitions are coming under increased pressure from not only the fluctuating presence of workers and financial strain, but also population drift and impacts on rural life.\n\nDean Miller, a senior lecturer in psychology at CQUniversity, said social sport and sporting clubs were the hub of small, close-knit communities.\n\n\"The engagement in community and getting more people into sports out there can really help the morale and engagement with social circles … and sport is a really great avenue to do that,\" Dr Miller said.\n\nDean Miller says social and sporting clubs are important for community morale. (Supplied: CQUniversity)\n\nParticipation in sports-related activities offered significant mental and health benefits for FIFO workers, he said.\n\n\"It can be quite difficult to follow through on those commitments as players or as officials and that will fluctuate depending on their availability and how their workload is at that certain period of time.\n\n\"We know in terms of mental health and health in general, engaging in physical exercise and activity with social sporting groups or competitive sporting clubs, it's really important.\"\n\nThe sad demise of the Pirates is the latest hit for the small mining town. (ABC Capricornia: Aaron Kelly)\n\nAs small communities across the country feel the pain of dwindling numbers and seek solutions to the effects of swing shifts, people such as Samantha Reinke are determined to keep theirs alive.\n\n\"My goal is to create awareness and perhaps get the NRL [National Rugby League] involved more in helping out the smaller communities,\" she said.\n\n\"It would be good to have some sort of incentive for players to come out here and play because it would just boost the town's morale.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/rule-change-to-deny-nawaqanitawase-shot-at-rookie-of-the-year-title-20250801-p5mjoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rule change to deny Nawaqanitawase shot at rookie of the year title",
    "publish_date": "Sat, 02 Aug 2025 12:00:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Outstanding Sydney Roosters centre Mark Nawaqanitawase has been denied the chance to win this year’s NRL rookie of the year award.\n\nThe ARL Commission this week changed the eligibility rules, which state a player is only a rookie if they have played less than five professional matches in any sporting code – not just the NRL.\n\nNawaqanitawase has represented the Wallabies, played rugby sevens for Australia at the Paris Olympics and had been a professional sportsman for the past seven years before causing all sorts of damage out wide for the Roosters this season with his speed, height and power. He produced the try of the year against the Bulldogs in round 11.\n\nRoosters fans will argue Nawaqanitawase, 24, should be honoured for his first-year feats to recognise how well he has adjusted to rugby league.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/collingwood-s-star-recruit-was-struggling-how-shooter-d-mac-and-fly-came-to-the-rescue-20250731-p5mjd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood’s star recruit was struggling. How Shooter, D-Mac and Fly came to the rescue",
    "publish_date": "Sat, 02 Aug 2025 11:32:19 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Collingwood coach Craig McRae can see the wheel starting to turn for high-profile recruit Dan Houston.\n\nHis positioning is becoming sharper. His running patterns are becoming more instinctive. And his mind seems less cluttered.\n\nThe Magpies want to find ways to give Dan Houston more of the ball Credit: AFL Photos via Getty Images\n\nAlthough such shifts are often barely recognisable to anyone but the trained coach’s eye, there were positive signs in the second half against Richmond, when he helped Collingwood open up a break on the Tigers.\n\n“He is going forward,” McRae said. “If you watch him closely enough he is heading towards [becoming] a player who could have a significant impact for the rest of the year.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/afl/st-kildas-desperate-move-to-keep-superstar-20250802-p5mjr3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "St Kilda's desperate move to keep superstar",
    "publish_date": "Sat, 02 Aug 2025 10:58:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "St Kilda's desperate move to keep superstar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/world/europe/cheesed-off-swiss-meltdown-over-trump-s-incomprehensible-tariff-whack-20250802-p5mjq3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cheesed off: Swiss meltdown over Trump’s ‘incomprehensible’ tariff whack",
    "publish_date": "Sat, 02 Aug 2025 09:57:00 +1000",
    "category": "finance",
    "authors": [
      "David Crowe"
    ],
    "text": "London: Swiss companies are reeling from a shock move by US President Donald Trump to slap a 39 per cent tariff on their exports, stunning brand-name suppliers of luxury watches, jewellery, cheese and chocolate.\n\nSwiss chocolate makers have declared the move “incomprehensible” and are warning it will hit them hard, as the changes flow through to higher prices for American customers.\n\nA woman walks by a store selling Rolex watches in Lucerne, Switzerland. Credit: AP\n\nThe biggest names in luxury watches, already suffering a slowdown in America after Trump’s previous trade decisions, now confront extraordinary price hikes that could lead them to expand sales in other markets.\n\nTrump spared Australia from higher penalties in his sweeping trade decision on Thursday, leaving tariffs at 10 per cent for most Australian exports, but he singled out Switzerland with the biggest blow to any European country.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/verstappen-throws-towel-on-track-20250802-p5mjqr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Verstappen throws towel on track",
    "publish_date": "Sat, 02 Aug 2025 09:46:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Verstappen throws towel on track\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/afl/round-21-afl-teams-and-expert-tips-bulldogs-giants-name-sides-for-next-chapter-of-their-rivalry-20250730-p5mix2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL teams and tips: Kangaroos bolstered by Larkey, Wardlaw",
    "publish_date": "Sat, 02 Aug 2025 09:42:57 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Loading\n\nGWS B: C.Idun, S.Taylor, H.Himmelberg HB: L.Whitfield, L.Aleer, L.Ash C: X.O’Halloran, S.Coniglio, R.Angwin HF: T.Bedford, A.Cadman, D.Jones F: J.Stringer, J.Hogan, H.Thomas FOLL: K.Briggs, F.Callaghan, T.Green I/C: J.Fonti, J.Riccardi, C.Brown, H.Rowston, T.McMullin EMG: J.Delana, J.Leake, M.Gruzewski IN: L.Aleer, H.Thomas, H.Rowston OUT: J.Buckley (injured), J.Kelly (injured), T.Greene (suspension)\n\nWESTERN BULLDOGS B: L.Bramble, J.Busslinger, J.O’Donnell HB: L.Cleary, R.Lobb, J.Johannisen C: B.Williams, E.Richards, B.Dale HF: R.Sanders, A.Naughton, M.Kennedy F: R.Garcia, S.Darcy, R.West FOLL: T.English, M.Bontempelli, T.Liberatore I/C: O.Baker, J.Freijah, L.McNeil, C.Poulter, L.Vandermeer EMG: S.Davidson, C.Hynes, B.Khamis IN: Nil OUT: Nil\n\nADELAIDE\n\nB: J.Worrell, N.Murray, B.Smith\n\nHB: W.Milera, M.Keane, I.Cumming\n\nC: B.Cook J.Dawson, D.Curtin\n\nHF: B.Keays, R.Thilthorpe, Z.Taylor\n\nF: I.Rankine, D.Fogarty, T.Walker\n\nFOLL: R.O’Brien, J.Peatling, J.Soligo\n\nI/C: C.Jones, A.Neal-Bullen, S.Berry, M.Hinge, H.Bond\n\nEMG: L.Nankervis, L.Pedlar, C.Burgess\n\nIN: B.Smith, I.Cumming, H.Bond\n\nOUT: R.Laird (managed), M.Michalanney (injured), L.Pedlar (omitted)\n\nHAWTHORN\n\nB: J.Battle, T.Barrass, B.Hardwick\n\nHB: J.Impey, J.Sicily, J.Scrimshaw\n\nC: H.Morrison, J.Ward, K.Amon\n\nHF: J.Gunston, M.Chol, N.Watson\n\nF: J.Ginnivan, M.Lewis, D.Moore\n\nFOLL: L.Meek, J.Newcombe, W.Day\n\nI/C: M.D’Ambrosio, C.Nash, C.Dear, C.Macdonald, J.Worpel\n\nEMG: L.Breust, S.Butler, B.Macdonald\n\nIN: M.Chol\n\nOUT: B.Macdonald (omitted)\n\nMELBOURNE\n\nB: J.Bowey, T.McDonald, J.McVee\n\nHB: C.Windsor, D.Turner, B.Howes\n\nC: K.Chandler, C.Petracca, H.Langford\n\nHF: J.Viney, B.Fritsch, T.Sparrow\n\nF: J.Melksham H.Petty, K.Pickett\n\nFOLL: M.Gawn, T.Rivers, E.Langdon\n\nI/C: J.van Rooyen, C.Salem, C.Oliver, H.Sharp, J.Culley\n\nEMG: X.Lindsay, J.Adams, T.Campbell\n\nIN: H.Sharp, J.Culley\n\nOUT: X.Lindsay (managed), C.Spargo (omitted)\n\nWEST COAST\n\nB: R.Ginbey H.Edwards, T.Cole\n\nHB: L.Duggan, R.Bazzo, T.McCarthy\n\nC: R.Maric, B.Hough, C.Hall\n\nHF: J.Cripps, J.Shanahan, E.Hewett\n\nF: T.Brockman, A.Reid, L.Ryan\n\nR: B.Williams, T.Kelly, L.Baker\n\nI/C: M.Owies, C.Chesser, T.Gross, H.Davis, T.Dewar\n\nEMG: J.Petruccelle, M.Flynn, L.Rawlinson\n\nIN: H.Edwards, C.Chesser, T.Gross, H.Davis\n\nOUT: S.Brock (omitted), J.Hutchinson (omitted), M.Flynn (omitted), H.Reid (injured)",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/health-and-wellness/the-whole-crew-is-there-city2surf-becomes-race-of-the-run-clubs-20250801-p5mjk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The whole crew is there’: City2Surf becomes race of the run clubs",
    "publish_date": "Sat, 02 Aug 2025 09:30:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Sarah Berry"
    ],
    "text": "Before sunrise on Friday morning, a committed group of about 50 runners huddle beneath the Harbour Bridge before starting to run, jog or walk a six-and-a-half kilometre route to the Opera House and back.\n\nIt is 10 degrees and droplets of icy rain start to fall, but the mood is warm at the Unofficial Run Club, among the most popular of the hundreds of running clubs that have popped up across the country.\n\nClub co-founder Sam Dreyfus addresses members of the Unofficial Run Club before their 6.5-kilometre dash. Credit: Sam Mooy\n\nAt their peak in 2024, the club had as many as 1600 runners coming from different parts of Sydney.\n\n“People are just hungry for in-person connection,” said co-founder Sander Dalhuisen.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/i-want-to-protect-my-team-why-the-wallabies-wrecking-ball-is-a-force-of-nurture-20250801-p5mjmi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I want to protect my team’: Why the Wallabies’ wrecking ball is a force of nurture",
    "publish_date": "Sat, 02 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "The same first-half recipe must be the same (and last longer) on Saturday for the Wallabies to win, only this time Valetini won’t be there due to injury. Skelton has a job on his massive hands. “We saw that when we’re physical from the off, we can score points, we can play our game,” Skelton says. “We saw that in the first Test, that first 30, they dictated everything. And then we sort of switched it again, on the weekend [in Melbourne]. It’ll be our job out there on Saturday to do the same. Will Skelton tackles Tommy Freeman at the MCG. Credit: Getty Images “I just wanted to do my job [at the MCG], that was it. Try and get my hands on the ball, and I focus really hard on my set-piece. I’m very aware that if I do play, I’m not the best jumping option, so things around me change. So I try and make sure that I give as much as I can in other areas of the game. “I thought I played OK. But I’ve got really high standards, too. I know I am going to be able to push out longer for the team this weekend as well.”\n\nAfter drawing criticism for not firing up in response to Tom Lynagh getting tackled midair in Brisbane, the Wallabies were far more combative in the second Test. And Skelton was right in the middle of most flare-ups, particularly when taking on Lions captain Maro Itoje. But it wasn’t a deliberate focus, he said. Will Skelton of the Wallabies evades a tackle. Credit: Getty Images “That’s just in the moment, mate,” Skelton says. “I don’t go out there thinking I’m trying to rough someone up. I want to protect my team, but if I’m not doing my job after that, then I shouldn’t be doing that at all. “That’s probably what I used to do when I was a bit younger. Try and look for scraps which aren’t there, and then I am not thinking about what I’ve got to do on the field. There is definitely a balance.”\n\nBut in what many say what his best Test performance, the sight of Skelton at his best at the MCG was a double-edged sword for Wallabies fans. It served to remind how rarely the big man has been seen, in his prime, in a gold jersey across an 11-year Test career. Having departed Australia in 2017 to play in England, and now France, Skelton has just 34 Test caps - and only 16 as a starter. Since he debuted in 2014, Skelton has only played in 25 per cent of the 135 Wallabies Tests that have been staged. Will Skelton after scoring a try on Wallabies debut against France in 2014. Credit: AP Skelton performs a delicate balance between club and country, trying to keep both mostly happy with partial presence. As such, he is likely to return to France and his club side La Rochelle, after the weekend and not carry on and play in The Rugby Championship. “That’s the plan, yeah. So I’ll go back, have a few weeks off and then do a small pre-season were before I start again in Top 14,” he says.\n\nSkelton clarifies he still has some final discussions to come with Joe Schmidt, but with his small family currently camped up at his parents place in western Sydney, is a return to their home in France is likely, before a possible reunion with the Wallabies for the spring tour. Loading “Hopefully, if I’m playing well enough,” Skelton says. “Because they’re coming to sort of my neck of the woods, too [the Wallabies play games in France and Italy]. I’m already there and like I said, if the body’s right and I’m playing well, if I am in form, and I get picked, I’d love to play. “I love playing for the Wallabies. It’s always refreshing coming back into camp. I learn so much as well from the coaches and from the boys. You always want to be a part of it.” At 33, Skelton feels in great shape. Unlike in the grind of a Top 14 season, where the focus is to be fresh for games, the demands of Wallabies training always shocks Skelton.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/culture/books/the-rarest-of-rare-books-and-letters-on-show-at-melbourne-fair-20250801-p5mjjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rarest of rare books and letters on show at Melbourne fair",
    "publish_date": "Sat, 02 Aug 2025 09:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Saria Ratnam"
    ],
    "text": "Where might you find the world’s oldest printed object, the first illustrated edition of Pride and Prejudice, and one of Sigmund Freud’s personal letters – all in one room – this weekend?\n\nRight here in Melbourne.\n\nThe world’s oldest printed object – a 1250-year-old print of Buddhist prayers – at the Melbourne Rare Book Fair. Credit: Joe Armao\n\nSaturday is the final day of the Melbourne Rare Book Fair, which runs for three days at the University of Melbourne’s Wilson Hall. Despite this being the 55th instalment of the event – the largest rare book fair in the southern hemisphere – it remains one of Melbourne’s best-kept literary secrets.\n\nThere are some truly special items on display this year, including the Hyakumanto Dharani (One Million Pagodas and Dharani Prayers), the world’s oldest printed object, created in 8th century Japan. There’s also a page of the first print run of the Gutenberg Bible, the Western world’s first piece of print.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/england-batter-taunted-after-dismissal-20250802-p5mjqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "England batter taunted after dismissal",
    "publish_date": "Sat, 02 Aug 2025 08:21:15 +1000",
    "category": "sports",
    "authors": [],
    "text": "England batter taunted after dismissal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/world/north-america/trump-fires-statistician-after-weak-employment-data-claiming-it-was-rigged-20250802-p5mjqa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Rigged’: The jobs numbers came in and they were bad. Trump fired the stats boss",
    "publish_date": "Sat, 02 Aug 2025 08:15:58 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: US President Donald Trump ordered the dismissal of the country’s labour statistics commissioner following a shock employment report which he alleged, without evidence, was “rigged” for political purposes.\n\nThe Bureau of Labour Statistics found only 73,000 jobs were created in the world’s biggest economy in July, well below market expectations, and significantly revised down the figures for May and June.\n\nPresident Donald Trump, leaving the White House for his New Jersey golf club on Friday, ordered the statistician be sacked. Credit: AP\n\n“Larger than normal” revisions concluded only 19,000 jobs were created in May, not 144,000, and only 14,000 jobs were created in June, not 147,000. In total, the numbers were revised down by 258,000 over two months.\n\nTrump – who spent much of the week saying the US was “the hottest country in the world” after gross domestic product figures showed the economy rebounded to grow 3 per cent in the June quarter – immediately went on the attack and ordered the sacking of the commissioner, Erika McEntarfer.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-arrente-artist-amunda-gorey-on-kinship-connection-and-deep-listening/vde78r76j",
    "title": "INTERVIEW: Arrente artist Amunda Gorey on kinship, connection and deep listening",
    "publish_date": "Fri, 1 Aug 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/tour-de-france-femmes-stage-seven-squiban-second-win/vq8ga5ziq",
    "title": "Tour de France Femmes: Local hero Squiban claims back-to-back wins",
    "publish_date": "Fri, 1 Aug 2025 21:50:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Sarah Gigante has kept pace with the Tour de France Femmes leaders as France's Maeva Squiban delighted home fans with a solo victory in the seventh stage.\n\n\n\n\n\nThe overnight victory was Squiban's second in two days, making her only the fourth rider to claim back-to-back stages at the race.\n\n\n\n\n\nGigante, who moved into the leading group after finishing in the leading pack on Thursday AEST, came home in 16th place for the second day running, one minute and 11 seconds behind the winner.\n\n\n\nThe result meant the AG Insurance-Soudal rider slipped a place to eighth in the general classification, one minute and 14 seconds behind yellow jersey wearer Kimberley Le Court Pienaar.\n\n\n\n\n\nSquiban, 23, made pace on the upper slopes of the Col du Granier to reach the finish of the hilly stage alone, which lifted the UAE Team ADQ rider to second in the polka dot jersey standings, level on 17 points with Dutchwoman Silke Smulders.\n\n\n\n'You have to give everything'\n\n\"Honestly, winning once on the Tour is already huge and now a second win...It was an incredible day. I think it was one of the hardest days of my life, mentally as well as physically. But you have to give everything,\" Squiban said.\n\n\n\n\n\n\"On the last climb, I just wanted to lie down on the ground, and by the end, I think for the last 15 kilometres, I was barely present — I couldn't hear anything in my ear.\"\n\n\n\n\n\nIt was another French one-two as Cedrine Kerbaol (EF Education-Oatly) crossed the line 51 seconds behind Squiban to take second place, and American Ruth Edwards was third.\n\n\n\nREAD MORE Tour de France Femmes: Gigante keeps pace as Squiban delights home crowd\n\nA 17-rider breakaway had lit up the 159.7 kilometre stage from Bourg-en-Bresse, with Fiona Mangan (Winspace Orange Seal) becoming the first Irish rider to win an intermediate sprint at the Tour.\n\n\n\n\n\nThe move split on the Cote de Saint-Franc before Squiban's decisive attack on the final climb. Mauritian rider Le Court Pienaar (AG Insurance-Soudal) lost ground on the Granier but finished sixth to retain the yellow jersey.\n\n\n\nLe Court is ahead of Frenchwoman Pauline Ferrand-Prevot (Visma-Lease a Bike) by 26 seconds and Poland's Katarzyna Niewiadoma Phinney (Canyon-SRAM) by 30 seconds.\n\n\n\n\n\nMountains classification leader Elise Chabbey (FDJ-Suez) endured a difficult day and was distanced from the peloton before Squiban's climb.\n\n\n\n\n\nRuby Roseman-Gannon was the only other Australian rider to finish inside the top 100 and she is 68th overall.\n\n\n\n\n\nSunday's mountain stage will be from Chambery to Saint-Francois-Longchamp.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 16
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-high-hopes-for-new-hiv-vaccine/uqlh9ezo4",
    "title": "INTERVIEW: High hopes for new HIV vaccine",
    "publish_date": "Fri, 1 Aug 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/video/perth-poised-to-host-historic-serie-a-match-as-ac-milan-eyes-clash-with-como/gquv74722",
    "title": "Perth poised to host historic Serie A match as AC Milan eyes clash with Como",
    "publish_date": "Fri, 1 Aug 2025 11:15:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-spared-tariff-hike-as-donald-trump-raises-rates-for-92-nations/dakvmxg5h",
    "title": "Australia spared tariff hike as Donald Trump raises rates for 92 nations",
    "publish_date": "Fri, 1 Aug 2025 07:46:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"Trump likes tariffs and he thinks they're useful for his policy goals. A lot of economists will disagree with a lot of those with a lot of those conclusions, especially that tariffs are an effective way to deal with trade deficits. And most of all, that tariffs are are useful in... or that these bilateral trade deficits that Trump seems to be worried about - are even something to be concerned about.\"\n\n\n\n\n\nThat's Dr Scott French who's a senior lecturer in economics at the University of New South Wales.\n\n\n\n\n\nJust hours before a pause on US tariffs was due to be lifted, US President Donald Trump signed an order for new tariffs on selected trading partners.\n\n\n\n\n\nAustralia managed to avoid an increase in the tariffs imposed by the US.\n\n\n\n\n\nThe rate remains at the lowest level of 10 per cent.\n\n\n\n\n\nThat is a relief for Australian exporters who had been warned that the tariffs could go as high as 20 per cent.\n\n\n\n\n\nBut the overall impacts of the tariff changes announced by President Trump, including on inflation, is something that remains to be seen.\n\n\n\n\n\nDr French again.\n\n\n\n\n\n\"The United States continues to sort of cut itself off from the rest of the world. So we've already seen the recent the US inflation numbers just recently came in and then was a little bit higher than expected. We're starting to see some of those higher import prices work their way through after companies are running down their inventories that they built up during the pause after April 2nd.\"\n\n\n\n\n\nMost of the new tariff hikes were first announced in April when President Trump imposed a baseline 10 per cent levy on goods from almost every country in the world, citing unfair trade practices and US deficits.\n\n\n\n\n\nHe then announced a pause on the implementation of tariffs to allow for negotiations.\n\n\n\n\n\nNow, the new country-specific tariffs will come into effect from August 7.\n\n\n\n\n\nThe hardest-hit countries are now subject to tariffs of between 39 and 41 per cent: including Syria, Myanmar, Laos and Switzerland.\n\n\n\n\n\nIn a statement, the White House says higher rates were imposed on countries that it viewed as failing to engage in negotiations, or not aligning sufficiently with the US on on economic and national security matters.\n\n\n\n\n\nAnd all goods that are considered to have been what's called \"transshipped\" - to avoid applicable duties - will be subject to an additional 40 per cent tariff.\n\n\n\n\n\n\"That means that if the United States customs determines that you are just shipping a good via a third country in order to avoid the tariff, then they're going to put a 40 per cent tariff on that I, the way it's worded, I think gives a lot of discretion. To customs officials to make that determination. So that's introducing a lot of uncertainty.\"\n\n\n\n\n\nDr French says there's still a lot of details to be worked out - and it's still going to be highly disruptive to the global economy.\n\n\n\n\n\n\"That gives Australian producers a bit of a advantage, exporting to the US market still what it's going to mean is that the US is just going to be less engaged in global trade. And so I think where that's most disruptive is the North American trade.\"\n\n\n\n\n\nAustralia's neighbours - New Zealand, Fiji, and Papua New Guinea - were hit with a tariff of 15 per cent.\n\n\n\n\n\nThe Trump administration is still considering a possible 200 per cent tariff on Australian pharmaceuticals.\n\n\n\n\n\nTrade Minister Don Farrell says the government's approach has proven to be the right one - and he hopes that this is now the end of the matter.\n\n\n\n\n\n\"I think this is a vindication for the Albanese government and particularly the Prime Minister in a cool and calm way that we have conducted diplomacy with the United States. What this decision means in conjunction with all of the other changes to other countries is that Australian products are now more competitive into the America market.\"\n\n\n\n\n\nHistorically, Australia has had an annual trade deficit with the US of about $30 billion - which means Australia imports more from the nation, than it exports.\n\n\n\n\n\nHowever, there are Australian exports impacted such as meat, gold and pharmaceutical products.\n\n\n\n\n\nMinister Farrell says Australia will continue to diversify its trade relationships and support Australian exporters.\n\n\n\n\n\n\"We believe in free and fair trade and we will continue to put the argument to the United States that they should remove all tariffs on Australian products in accordance with our free trade agreement and we will continue to prosecute that argument. In fact I’ve invited Commerce Secretary Lutnick to Australia to continue the discussions.\"\n\n\n\n\n\n92 nations were listed by President Trump as being subject to higher tariffs.\n\n\n\n\n\nThere were nations who were pleased with a revised tariff rate.\n\n\n\n\n\nCambodia says it is glad to see the rate has been reduced for the previous rate of up to 49 per cent - to a new rate of 19 per cent.\n\n\n\n\n\nCambodia's Deputy Prime Minister Sun Chanthol says that will better support the country's garment manufacturing industry, which would have faced collapse under the higher rate.\n\n\n\n\n\nHowever, other nations have not fared so well.\n\n\n\n\n\nCanada's Prime Minister, Mark Carney, says he is disappointed that the tariffs for his country were increased by another 10 per cent to 35 per cent for products not covered by the US-Mexico-Canada trade deal.\n\n\n\n\n\nMexico has been granted a 90-day reprieve from higher tariffs of 30 per cent to provide more time to negotiate a broader trade pact.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 6
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-does-a-10-us-import-tariff-on-australian-products-mean-for-the-economy-and-markets/t2sacybnd",
    "title": "What does a 10% US import tariff on Australian products mean for the economy and markets?",
    "publish_date": "Fri, 1 Aug 2025 07:22:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-story-behind-this-viral-image-of-a-child-in-gaza/xzndrsear",
    "title": "The story behind this viral image of a child in Gaza",
    "publish_date": "Fri, 1 Aug 2025 06:59:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's a shocking image of despair and anguish; at the centre is toddler Muhammad Zakariya Ayyoub al-Matouq, a child in Gaza.\n\n\n\n\n\nThe frail toddler has a starkly pronounced spine and shoulder blades, wears a plastic bag nappy, and is being held by his mother.\n\n\n\n\n\nThe photograph was published widely by several media outlets, including SBS News, as a depiction of reports of spreading starvation in Gaza.\n\n\n\n\n\nIn one of his strongest statements yet on the issue , Prime Minister Anthony Albanese said scenes of starvation in Gaza \"break your heart\", singling out a picture of Matouq on Sunday.\n\n\n\n\n\nHe said civilian casualties and deaths in Gaza were \"completely unacceptable\" and \"completely indefensible\".\n\n\n\nBut a British journalist and antisemitism researcher has said the image is \"misleading\", prompting the New York Times to issue a clarification about its publication after \"new information\" surfaced.\n\n\n\nClaims of 'misleading' image\n\nIndependent investigative journalist David Collier has accused the mainstream media of publishing the image of Matouq without acknowledging the 18-month-old's pre-existing medical conditions.\n\n\n\n\n\nGetty Images, which hosts several photos of Matouq, described the child as \"sick\" and \"also displaying signs of malnutrition\" in its captions.\n\n\n\n\n\nCollier, who is a critic of Hamas — the political and military group that rules Gaza — and describes himself as a Zionist on his website , said that's not the whole story.\n\n\n\n\n\nHe wrote on X that he has seen medical reports and spoken to Matouq's mother, Hedaya, to uncover that the child has required specialist care in the past.\n\n\n\n\n\n\"Mohammed is medically vulnerable; he needs specialised formula and medication,\" he wrote.\n\n\n\n\n\nOn his website, he says that in other pictures of the family, his mother and older brother \"look healthy and are not suffering from any type of starvation that would be necessary to cause the thinness suffered by Mohammed\".\n\n\n\nCollier took aim at \"most legacy media\", which he said \"need to own up to using deceitful photos\".\n\n\n\n\n\n\"You exploited the image of a child with cerebral palsy to push a lie about famine,\" he wrote.\n\n\n\n\n\n\"You did this because you are all running campaigns to demonise Israel. You did not care anything about the truth. You saw an image you could use — or abuse — and ran with it.\"\n\n\n\n\n\nCollier told The Australian it is the \"basic role of a journalist to verify and check the facts\" before writing a story.\n\n\n\n\n\n\"I'm not waving an Israeli flag, saying everything is perfect, that's not what I'm doing. What I'm saying is that it's vital that the media maintains its standards, because if it can't, then what is the point?\" he said.\n\n\n\n\n\nThe New York Times said it learned about the \"pre-existing health problems\" after it had published the image.\n\n\n\n\n\n\"We have since learned new information, including from the hospital that treated him [Matouq] and his medical records, and have updated our story to add context about his pre-existing health problems,\" a spokesperson said on Wednesday.\n\n\n\nLucia Goldsmith, Oxfam Australia's head of humanitarian, told SBS News children with pre-existing conditions may already face difficulties in processing nutrients.\n\n\n\n\n\n\"Many of these children may be experiencing immune deficiencies, so they are often most affected by lack of food,\" Goldsmith said.\n\n\n\n\n\nMarko Kerac, who helped draw up the World Health Organization's treatment guidelines for severe acute malnutrition, also said it was typical in the early stages of a hunger crisis that those most impacted suffered from pre-existing illnesses.\n\n\n\n\n\n\"Children with underlying conditions are more vulnerable,\" Kerac, clinical associate professor at the London School of Hygiene and Tropical Medicine, told the Reuters news agency.\n\n\n\n\n\n\"They get affected earlier.\"\n\n\n\nReporting from Gaza comes with challenges\n\nThe photos originally come from the Turkish news agency Anadolu, whose photographers are some of the few on the ground in Gaza. It was then circulated via Getty Images.\n\n\n\n\n\nGathering and verifying information and photographs from the region is complex, and Israel has prevented international media from entering Gaza to report from there, except in cases where media have been embedded with the Israel Defense Forces. CNN reporter Clarissa Ward is one of the few Western journalists who have been able to gain independent access, and only fleetingly.\n\n\n\n\n\nLike most news organisations around the world, SBS News does not have its own reporters on the ground in Gaza, and sources information, photography and footage from various news agencies such as Reuters, Agence France-Presse and Getty as well as directly from freelance operators.\n\n\n\nWhen SBS News sent an inquiry to Getty Images about the photograph, a statement from the Anadolu Agency was provided in response. It said the agency had reviewed the photograph of Matouq, which was taken by freelance journalist Ahmed Jihad Ibrahim al-Arini.\n\n\n\n\n\nThe response included a statement attributed to the child's mother to clarify the situation.\n\n\n\n\n\n\"At three months old, he suffered from muscle weakness [hypotonia]. Through physiotherapy, he fully recovered and continued normal development. Before we were displaced from Jabalia, he was healthy, smiling, and cheerful,\" the statement said.\n\n\n\n\n\n\"However, after displacement, due to the food and medicine crisis —particularly the lack of milk — his condition began to deteriorate.\"\n\n\n\n\n\nThe statement included notes from an interview with nutrition specialist Dr Suzan Mohammed Marouf, who Anadolu Agency said confirmed Matouq is suffering from severe malnutrition as well as a muscle-related illness.\n\n\n\n\n\nThe agency also provided a series of photographs of Matouq throughout his life showing him previously at a higher weight than in the series of viral photos as well as images of other children in similar conditions.\n\n\n\nA family member holds up a phone displaying an earlier photo of Muhammad Zakariya Ayyoub al-Matouq, showing his physical health has declined rapidly. Source: Anadolu / via Getty Images \"As Anadolu Agency, our mission is not to provide medical assessments but to document and report the situation on the ground objectively for the international public,\" the statement said.\n\n\n\n\n\n\"Our photographs reflect the humanitarian crisis we witness in Gaza in its starkest form.\"\n\n\n\n\n\nSBS News has not been able to independently verify the details of pre-existing health conditions supplied by Anadolu or Collier.\n\n\n\n'Full-scale famine'\n\nPhotos of Matouq and dozens of other emaciated children have made headlines in recent weeks, with Israeli officials denying starvation in Gaza.\n\n\n\n\n\n\"We don't recognise any famine or any starvation in the Gaza Strip,\" Israel's deputy chief of mission in its Canberra embassy, Amir Meron, told a group of reporters, including SBS News, on Monday.\n\n\n\n\n\nIsraeli officials have instead blamed either the United Nations' inefficiency or Hamas for aid not reaching people in areas it has claimed to control for much of the war.\n\n\n\n\n\nHowever, humanitarian groups like UNICEF have described the region as \"on the brink of a full-scale famine\".\n\n\n\nREAD MORE DFAT meets with Israel's ambassador after statements denying starvation in Gaza\n\nUNICEF, citing data from the Palestinian health ministry, said last week the number of children in Gaza who have died from malnutrition jumped from 52 to 80 — a 54 per cent increase in less than three months.\n\n\n\n\n\nIn a statement made on Wednesday, they said: \"Acute malnutrition and reports of starvation-related deaths — the third core famine indicator — are increasingly common but collecting robust data under current circumstances in Gaza remains very difficult as health systems, already decimated by nearly two years of conflict, are collapsing.\"\n\n\n\n\n\nOther news agencies, such as Reuters, have published reports from Gaza on malnutrition cases presented at clinics and images of emaciated children.\n\n\n\n\n\nIn a separate interview published on the BBC published late last week, his mother said Matouq used to weigh 9kg but now weighs 6kg. She said: \"He used to eat and drink normally but because of lack of food and the situation we're in, he became malnourished.\"\n\n\n\n\n\nIn the video interview, she mentions her son has hypotonia.\n\n\n\n\n\nAssociate professor Nina Sivertsen, a nursing and family health lecturer at Flinders University, told SBS News children in Gaza are at the most severe risk of the effects of starvation.\n\n\n\n\n\n\"They're more likely to die, especially from common infections like diarrhoea and pneumonia, because starvation already weakens their really fragile immune system,\" Sivertsen said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-strangest-press-conference-palestine-recognition-thai-cambodian-feud/mdjerqhjv",
    "title": "The ‘strangest’ press conference, Palestine recognition & Thai-Cambodian feud",
    "publish_date": "Fri, 1 Aug 2025 06:36:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-spared-tariff-hike-as-trump-raises-rates-on-others/vv8pf600r",
    "title": "See the list: Australia spared tariff hike as Trump raises rates on others",
    "publish_date": "Fri, 1 Aug 2025 03:25:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump has imposed new tariff rates on dozens of America's trading partners, but Australia's exports to the US have been spared a hike.\n\n\n\n\n\nMost of these new tariff hikes were first announced in April when Trump imposed a minimum 10 per cent levy on goods from almost every country in the world, citing unfair trade practices and US deficits.\n\n\n\n\n\nHowever, the US then postponed implementation, amid a frantic series of negotiations, alongside announcements of new duties and deals with some partners.\n\n\n\n\n\nThe new tariffs are due to take effect on 7 August.\n\n\n\n\n\nA spokesperson for Trade Minister Don Farrell said Australia had been left in the \"best possible position\" after it was revealed the 10 per cent baseline tariff would not be increased.\n\n\n\n\n\n\"While we remain in the best possible position under the United States' new tariff regime, we will continue to advocate for the removal of all tariffs in line with our free-trade agreement,\" the spokesperson said.\n\n\n\nREAD MORE What to know about tariffs and how they work\n\nExports from Australia's neighbours — New Zealand, Fiji, and Papua New Guinea — were hit with greater 15 per cent tariff.\n\n\n\n\n\nAnd those from other countries face an ever higher rate, including India (25 per cent), South Africa (35 per cent) and Syria (41 per cent).\n\n\n\n\n\nThere was a frantic series of negotiations ahead of the US' self-imposed deadline of 1 August, alongside announcements of new duties and deals with some partners, including the European Union . Other trading partners had no opportunity to negotiate with the Trump administration.\n\n\n\n\n\nIn a statement, the White House said the so-called \"reciprocal tariffs\" were increased on countries that failed to engage in negotiations with the US or to take adequate steps to align sufficiently on economic and national security matters.\n\n\n\n\n\nThe order said goods from all other countries not listed in an annex would be subject to a 10 per cent US tariff rate.\n\n\n\n\n\nA US official told reporters more trade deals were yet to be announced as Trump's higher \"reciprocal\" tariff rates were set to take effect.\n\n\n\n\n\n\"We have some deals,\" the official said. \"And I don't want to get ahead of the President of the United States in announcing those deals.\"\n\n\n\n\n\nAustralia has yet to sign a formal trade deal with the US following the introduction of the tariffs.\n\n\n\nList of US tariffs\n\nSome countries face higher tariffs but were not included in the list published on Friday AEST.\n\n\n\n\n\nThat includes Canada (35 per cent), with Trump this week saying that Canadian government's move to recognise Palestinian statehood would make a trade deal \"very hard\".\n\n\n\n\n\nBrazil was listed as 10 per cent, but an additional 40 per cent tariff has been applied. However, some sectors — including aircraft and energy — have been spared.\n\n\n\n\n\nMexico has been granted a 90-day reprieve from higher tariffs of 30 per cent to provide more time to negotiate a broader trade pact.\n\n\n\n\n\nChina was also excluded. It faces a 12 August deadline for a deal, after which duties could bounce back to higher levels if one isn't reached.\n\n\n\n\n\nWashington and Beijing had slapped tit-for-tat tariffs on each other's goods, bringing them to triple-digit levels before both countries reached agreement in May to temporarily lower these duties .\n\n\n\nSource: SBS News There had been speculation that Australian goods would be hit with a higher levy, given Prime Minister Anthony Albanese has so far failed to secure a face-to-face meeting with the president and after Trump on Tuesday said he was planning a new tariff \"for the world\" in the 15-20 per cent range.\n\n\n\n\n\nAustralia will keep pushing for a full exemption from the US tariffs, with Farrell inviting US Commerce Secretary Howard Lutnick to continue discussions.\n\n\n\n\n\nBut it's unclear if the government will be successful.\n\n\n\n\n\nThe Albanese government recently wound back biosecurity restrictions on US beef imports , although ministers insist the move was a coincidence and not in response to the tariffs.\n\n\n\n\n\nThe US has complained to Australia about non-tariff trade barriers including longstanding restrictions on beef following a prior outbreak of mad cow disease, and the federal government's decision to lift restrictions on US beef imports was hailed as a victory by Trump.\n\n\n\n\n\nThe Trump administration's latest announcement is also separate to sector-specific tariffs, such as the 50 per cent levy Australian steel is subject to .\n\n\n\n\n\nA tariff (or import duty) is a tax imposed on foreign goods imported into a country.\n\n\n\n\n\nTariffs aren't paid by the foreign countries they target. Instead, they're charged to the buyer of those goods and the money goes to — in this case — the US treasury.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 6
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-avoids-latest-round-of-us-tariffs-midday-news-bulletin-1-august-2025/wgkpdt8ya",
    "title": "Australia avoids latest round of US tariffs | Midday News Bulletin 1 August 2025",
    "publish_date": "Fri, 1 Aug 2025 01:59:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Australia avoids latest round of US tariffs\n\nUluru Dialogue condemns lack of progress on Closing the Gap targets\n\nAustralia wins women's 200 metre freestyle final at World Championships\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has avoided a fresh wave of tariffs, after the Trump administration announced new import taxes targeting dozens of other countries.\n\n\n\n\n\nThe White House confirmed that President Trump would raise tariffs on products from nations that, in his words, failed to engage in negotiations with the United States or to align on economic and national security matters.\n\n\n\n\n\nAustralia has been spared, with its goods to remain under a baseline 10 per cent tariff.\n\n\n\n\n\nBy contrast, New Zealand imports will face a 15 per cent rate, while Canada and others have been hit with even harsher penalties.\n\n\n\n\n\nThe decision comes amid ongoing U-S concerns over non-tariff trade barriers, including Australia’s biosecurity rules.\n\n\n\n\n\nCanberra recently eased restrictions on American beef, but ministers insist the timing was unrelated to the tariff announcement.\n\n\n\n---\n\n\n\n\n\nThe Uluru Dialogue has issued a strong statement ahead of the Garma Festival, declaring 'enough is enough' on Closing the Gap.\n\n\n\n\n\nIt says progress has stalled, and in some areas, is going backwards.\n\n\n\n\n\nIt blames government inaction, outdated bureaucracy, and the ongoing exclusion of Indigenous voices.\n\n\n\n\n\nIn a statement, the Uluru Dialogue says without a Voice to Parliament, decisions are still being made without Indigenous input.\n\n\n\n\n\n\"We continue to be sold the status quo as the solution, but how can we see any progress on Closing the Gap by doing more of the same? Our children are being locked up, our Elders are dying, and our people are continuing to live in a country where their rights are neglected. Their voices and calls for help falling on deaf ears.\"\n\n\n\n\n\nClosing the Gap is a national plan to improve health, education, and life expectancy for First Nations people, but only four of 19 targets are on track.\n\n\n\n\n\nThe government is expected to highlight progress on 10 of 15 measures at Garma, but the group says that won’t resonate with struggling communities.\n\n\n\n\n\nThe Garma Festival runs from today to the 4th of August in northeast Arnhem Land, on Yolngu country.\n\n\n\n---\n\n\n\n\n\nAn underworld war looms in Melbourne after the daylight execution of 26-year-old Athan Boursinos, who had known links to organised crime.\n\n\n\n\n\nThe son of a former police officer, he was gunned down around 9:30am yesterday outside his home in Wollert as he was heading to court, a tactic often used by gangs to ambush rivals.\n\n\n\n\n\nEight shots were heard by neighbours.\n\n\n\n\n\nDetective Inspector Dean Thomas is with the Victoria Police.\n\n\n\n\n\n\"This is deliberate and obviously targeted. We will work now to piece together what has gone on.\"\n\n\n\n\n\nAthan Boursinos had been a person of interest in the killing of underworld figure Sam Abdul Rahim, and his death has sparked concerns of violent retaliation linked to the ongoing illicit tobacco wars.\n\n\n\n\n\nPolice says investigators are now working to prevent further bloodshed.\n\n\n\n---\n\n\n\n\n\nRussian missile and drone attacks have killed at least 15 people and injured 155 others in Kyiv, as Russia's President defies United States President Donald Trump's ceasefire deadline.\n\n\n\n\n\nRescue crews were seen sifting through the debris following attacks on 27 locations across four Kyiv districts Thursday night.\n\n\n\n\n\nSenior US diplomat John Kelley tells the 15-member United Nations Security Council that President Trump wants a deal to end Russia’s war in Ukraine within one week.\n\n\n\n\n\n\"Both Russia and Ukraine must negotiate a ceasefire and durable peace. It is time to make a deal. President Trump has made clear this must be done by August 8. The United States is prepared to implement additional measures to secure peace.\"\n\n\n\n---\n\n\n\n\n\nTwo Australians arrested by Israeli forces aboard the Freedom Flotilla boat Handala have returned safely to Australia.\n\n\n\n\n\nTan Safi and Robert Martin were among 19 activists trying to breach Israel’s blockade of Gaza to deliver aid including nappies and baby formula.\n\n\n\n\n\nThe boat was intercepted in international waters on the 26th of July by Israeli soldiers and towed to Ashdod.\n\n\n\n\n\nThis morning, supporters greeted them at the airport waving Palestinian flags and chanting as they reunited with loved ones.\n\n\n\n\n\nMs Safi describes the treatment they faced in Israeli custody, especially that of fellow activist Chris Smalls, co-founder of the Amazon Labor Union.\n\n\n\n\n\n\"They pinned him down on the floor, seven or eight of them, and when i asked about him, they came into the room and dragged me out by my arms. I'm still bruised here on my arms from it. They pulled me out and threw me down on the floor, and they made me take off all my clothes. They strip searched me right there, made me, squat, up and down, and then go through all my things. And after that, maybe an hour passed, and we were able to see someone from the Australian Embassy.\"\n\n\n\n\n\nThe Handala was part of a wider Freedom Flotilla effort to raise awareness about conditions in Gaza.\n\n\n\n\n\nAll foreign nationals have since been deported from Israel.\n\n\n\n---\n\n\n\n\n\nTo sport and in swimming, Australia has won the women’s four by 200 metre freestyle relay final at the World Championships in Singapore.\n\n\n\n\n\nThe victory, securing Mollie O’Callaghan 11 world titles - equal to the record set by legend of the pool, fellow Australian Ian Thorpe.\n\n\n\n\n\nKyle Chalmers placed third 100 metres freestyle final at the event overnight.\n\n\n\n\n\nThe Australian came close to breaking the 46-second barrier in the race but fell just short of the mark.\n\n\n\n\n\nChalmers tells Channel 9 he is content with the result as he focuses on the arrival of his child.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/why-gaza-is-dominating-australian-politics-right-now/pbrq3t8ba",
    "title": "Why Gaza is dominating Australian politics right now",
    "publish_date": "Thu, 31 Jul 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/rule-change-to-deny-nawaqanitawase-shot-at-rookie-of-the-year-title-20250801-p5mjoy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rule change to deny Nawaqanitawase shot at rookie of the year title",
    "publish_date": "Sat, 02 Aug 2025 12:00:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Outstanding Sydney Roosters centre Mark Nawaqanitawase has been denied the chance to win this year’s NRL rookie of the year award.\n\nThe ARL Commission this week changed the eligibility rules, which state a player is only a rookie if they have played less than five professional matches in any sporting code – not just the NRL.\n\nNawaqanitawase has represented the Wallabies, played rugby sevens for Australia at the Paris Olympics and had been a professional sportsman for the past seven years before causing all sorts of damage out wide for the Roosters this season with his speed, height and power. He produced the try of the year against the Bulldogs in round 11.\n\nRoosters fans will argue Nawaqanitawase, 24, should be honoured for his first-year feats to recognise how well he has adjusted to rugby league.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/collingwood-s-star-recruit-was-struggling-how-shooter-d-mac-and-fly-came-to-the-rescue-20250731-p5mjd1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Collingwood’s star recruit was struggling. How Shooter, D-Mac and Fly came to the rescue",
    "publish_date": "Sat, 02 Aug 2025 11:32:19 +1000",
    "category": "sports",
    "authors": [
      "Peter Ryan"
    ],
    "text": "Collingwood coach Craig McRae can see the wheel starting to turn for high-profile recruit Dan Houston.\n\nHis positioning is becoming sharper. His running patterns are becoming more instinctive. And his mind seems less cluttered.\n\nThe Magpies want to find ways to give Dan Houston more of the ball Credit: AFL Photos via Getty Images\n\nAlthough such shifts are often barely recognisable to anyone but the trained coach’s eye, there were positive signs in the second half against Richmond, when he helped Collingwood open up a break on the Tigers.\n\n“He is going forward,” McRae said. “If you watch him closely enough he is heading towards [becoming] a player who could have a significant impact for the rest of the year.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/afl/st-kildas-desperate-move-to-keep-superstar-20250802-p5mjr3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "St Kilda's desperate move to keep superstar",
    "publish_date": "Sat, 02 Aug 2025 10:58:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "St Kilda's desperate move to keep superstar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/world/europe/cheesed-off-swiss-meltdown-over-trump-s-incomprehensible-tariff-whack-20250802-p5mjq3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Cheesed off: Swiss meltdown over Trump’s ‘incomprehensible’ tariff whack",
    "publish_date": "Sat, 02 Aug 2025 09:57:00 +1000",
    "category": "finance",
    "authors": [
      "David Crowe"
    ],
    "text": "London: Swiss companies are reeling from a shock move by US President Donald Trump to slap a 39 per cent tariff on their exports, stunning brand-name suppliers of luxury watches, jewellery, cheese and chocolate.\n\nSwiss chocolate makers have declared the move “incomprehensible” and are warning it will hit them hard, as the changes flow through to higher prices for American customers.\n\nA woman walks by a store selling Rolex watches in Lucerne, Switzerland. Credit: AP\n\nThe biggest names in luxury watches, already suffering a slowdown in America after Trump’s previous trade decisions, now confront extraordinary price hikes that could lead them to expand sales in other markets.\n\nTrump spared Australia from higher penalties in his sweeping trade decision on Thursday, leaving tariffs at 10 per cent for most Australian exports, but he singled out Switzerland with the biggest blow to any European country.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/verstappen-throws-towel-on-track-20250802-p5mjqr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Verstappen throws towel on track",
    "publish_date": "Sat, 02 Aug 2025 09:46:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Verstappen throws towel on track\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/afl/round-21-afl-teams-and-expert-tips-bulldogs-giants-name-sides-for-next-chapter-of-their-rivalry-20250730-p5mix2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL teams and tips: Kangaroos bolstered by Larkey, Wardlaw",
    "publish_date": "Sat, 02 Aug 2025 09:42:57 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Loading\n\nGWS B: C.Idun, S.Taylor, H.Himmelberg HB: L.Whitfield, L.Aleer, L.Ash C: X.O’Halloran, S.Coniglio, R.Angwin HF: T.Bedford, A.Cadman, D.Jones F: J.Stringer, J.Hogan, H.Thomas FOLL: K.Briggs, F.Callaghan, T.Green I/C: J.Fonti, J.Riccardi, C.Brown, H.Rowston, T.McMullin EMG: J.Delana, J.Leake, M.Gruzewski IN: L.Aleer, H.Thomas, H.Rowston OUT: J.Buckley (injured), J.Kelly (injured), T.Greene (suspension)\n\nWESTERN BULLDOGS B: L.Bramble, J.Busslinger, J.O’Donnell HB: L.Cleary, R.Lobb, J.Johannisen C: B.Williams, E.Richards, B.Dale HF: R.Sanders, A.Naughton, M.Kennedy F: R.Garcia, S.Darcy, R.West FOLL: T.English, M.Bontempelli, T.Liberatore I/C: O.Baker, J.Freijah, L.McNeil, C.Poulter, L.Vandermeer EMG: S.Davidson, C.Hynes, B.Khamis IN: Nil OUT: Nil\n\nADELAIDE\n\nB: J.Worrell, N.Murray, B.Smith\n\nHB: W.Milera, M.Keane, I.Cumming\n\nC: B.Cook J.Dawson, D.Curtin\n\nHF: B.Keays, R.Thilthorpe, Z.Taylor\n\nF: I.Rankine, D.Fogarty, T.Walker\n\nFOLL: R.O’Brien, J.Peatling, J.Soligo\n\nI/C: C.Jones, A.Neal-Bullen, S.Berry, M.Hinge, H.Bond\n\nEMG: L.Nankervis, L.Pedlar, C.Burgess\n\nIN: B.Smith, I.Cumming, H.Bond\n\nOUT: R.Laird (managed), M.Michalanney (injured), L.Pedlar (omitted)\n\nHAWTHORN\n\nB: J.Battle, T.Barrass, B.Hardwick\n\nHB: J.Impey, J.Sicily, J.Scrimshaw\n\nC: H.Morrison, J.Ward, K.Amon\n\nHF: J.Gunston, M.Chol, N.Watson\n\nF: J.Ginnivan, M.Lewis, D.Moore\n\nFOLL: L.Meek, J.Newcombe, W.Day\n\nI/C: M.D’Ambrosio, C.Nash, C.Dear, C.Macdonald, J.Worpel\n\nEMG: L.Breust, S.Butler, B.Macdonald\n\nIN: M.Chol\n\nOUT: B.Macdonald (omitted)\n\nMELBOURNE\n\nB: J.Bowey, T.McDonald, J.McVee\n\nHB: C.Windsor, D.Turner, B.Howes\n\nC: K.Chandler, C.Petracca, H.Langford\n\nHF: J.Viney, B.Fritsch, T.Sparrow\n\nF: J.Melksham H.Petty, K.Pickett\n\nFOLL: M.Gawn, T.Rivers, E.Langdon\n\nI/C: J.van Rooyen, C.Salem, C.Oliver, H.Sharp, J.Culley\n\nEMG: X.Lindsay, J.Adams, T.Campbell\n\nIN: H.Sharp, J.Culley\n\nOUT: X.Lindsay (managed), C.Spargo (omitted)\n\nWEST COAST\n\nB: R.Ginbey H.Edwards, T.Cole\n\nHB: L.Duggan, R.Bazzo, T.McCarthy\n\nC: R.Maric, B.Hough, C.Hall\n\nHF: J.Cripps, J.Shanahan, E.Hewett\n\nF: T.Brockman, A.Reid, L.Ryan\n\nR: B.Williams, T.Kelly, L.Baker\n\nI/C: M.Owies, C.Chesser, T.Gross, H.Davis, T.Dewar\n\nEMG: J.Petruccelle, M.Flynn, L.Rawlinson\n\nIN: H.Edwards, C.Chesser, T.Gross, H.Davis\n\nOUT: S.Brock (omitted), J.Hutchinson (omitted), M.Flynn (omitted), H.Reid (injured)",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/health-and-wellness/the-whole-crew-is-there-city2surf-becomes-race-of-the-run-clubs-20250801-p5mjk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘The whole crew is there’: City2Surf becomes race of the run clubs",
    "publish_date": "Sat, 02 Aug 2025 09:30:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Sarah Berry"
    ],
    "text": "Before sunrise on Friday morning, a committed group of about 50 runners huddle beneath the Harbour Bridge before starting to run, jog or walk a six-and-a-half kilometre route to the Opera House and back.\n\nIt is 10 degrees and droplets of icy rain start to fall, but the mood is warm at the Unofficial Run Club, among the most popular of the hundreds of running clubs that have popped up across the country.\n\nClub co-founder Sam Dreyfus addresses members of the Unofficial Run Club before their 6.5-kilometre dash. Credit: Sam Mooy\n\nAt their peak in 2024, the club had as many as 1600 runners coming from different parts of Sydney.\n\n“People are just hungry for in-person connection,” said co-founder Sander Dalhuisen.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/i-want-to-protect-my-team-why-the-wallabies-wrecking-ball-is-a-force-of-nurture-20250801-p5mjmi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I want to protect my team’: Why the Wallabies’ wrecking ball is a force of nurture",
    "publish_date": "Sat, 02 Aug 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "The same first-half recipe must be the same (and last longer) on Saturday for the Wallabies to win, only this time Valetini won’t be there due to injury. Skelton has a job on his massive hands. “We saw that when we’re physical from the off, we can score points, we can play our game,” Skelton says. “We saw that in the first Test, that first 30, they dictated everything. And then we sort of switched it again, on the weekend [in Melbourne]. It’ll be our job out there on Saturday to do the same. Will Skelton tackles Tommy Freeman at the MCG. Credit: Getty Images “I just wanted to do my job [at the MCG], that was it. Try and get my hands on the ball, and I focus really hard on my set-piece. I’m very aware that if I do play, I’m not the best jumping option, so things around me change. So I try and make sure that I give as much as I can in other areas of the game. “I thought I played OK. But I’ve got really high standards, too. I know I am going to be able to push out longer for the team this weekend as well.”\n\nAfter drawing criticism for not firing up in response to Tom Lynagh getting tackled midair in Brisbane, the Wallabies were far more combative in the second Test. And Skelton was right in the middle of most flare-ups, particularly when taking on Lions captain Maro Itoje. But it wasn’t a deliberate focus, he said. Will Skelton of the Wallabies evades a tackle. Credit: Getty Images “That’s just in the moment, mate,” Skelton says. “I don’t go out there thinking I’m trying to rough someone up. I want to protect my team, but if I’m not doing my job after that, then I shouldn’t be doing that at all. “That’s probably what I used to do when I was a bit younger. Try and look for scraps which aren’t there, and then I am not thinking about what I’ve got to do on the field. There is definitely a balance.”\n\nBut in what many say what his best Test performance, the sight of Skelton at his best at the MCG was a double-edged sword for Wallabies fans. It served to remind how rarely the big man has been seen, in his prime, in a gold jersey across an 11-year Test career. Having departed Australia in 2017 to play in England, and now France, Skelton has just 34 Test caps - and only 16 as a starter. Since he debuted in 2014, Skelton has only played in 25 per cent of the 135 Wallabies Tests that have been staged. Will Skelton after scoring a try on Wallabies debut against France in 2014. Credit: AP Skelton performs a delicate balance between club and country, trying to keep both mostly happy with partial presence. As such, he is likely to return to France and his club side La Rochelle, after the weekend and not carry on and play in The Rugby Championship. “That’s the plan, yeah. So I’ll go back, have a few weeks off and then do a small pre-season were before I start again in Top 14,” he says.\n\nSkelton clarifies he still has some final discussions to come with Joe Schmidt, but with his small family currently camped up at his parents place in western Sydney, is a return to their home in France is likely, before a possible reunion with the Wallabies for the spring tour. Loading “Hopefully, if I’m playing well enough,” Skelton says. “Because they’re coming to sort of my neck of the woods, too [the Wallabies play games in France and Italy]. I’m already there and like I said, if the body’s right and I’m playing well, if I am in form, and I get picked, I’d love to play. “I love playing for the Wallabies. It’s always refreshing coming back into camp. I learn so much as well from the coaches and from the boys. You always want to be a part of it.” At 33, Skelton feels in great shape. Unlike in the grind of a Top 14 season, where the focus is to be fresh for games, the demands of Wallabies training always shocks Skelton.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/culture/books/the-rarest-of-rare-books-and-letters-on-show-at-melbourne-fair-20250801-p5mjjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rarest of rare books and letters on show at Melbourne fair",
    "publish_date": "Sat, 02 Aug 2025 09:00:00 +1000",
    "category": "entertainment",
    "authors": [
      "Saria Ratnam"
    ],
    "text": "Where might you find the world’s oldest printed object, the first illustrated edition of Pride and Prejudice, and one of Sigmund Freud’s personal letters – all in one room – this weekend?\n\nRight here in Melbourne.\n\nThe world’s oldest printed object – a 1250-year-old print of Buddhist prayers – at the Melbourne Rare Book Fair. Credit: Joe Armao\n\nSaturday is the final day of the Melbourne Rare Book Fair, which runs for three days at the University of Melbourne’s Wilson Hall. Despite this being the 55th instalment of the event – the largest rare book fair in the southern hemisphere – it remains one of Melbourne’s best-kept literary secrets.\n\nThere are some truly special items on display this year, including the Hyakumanto Dharani (One Million Pagodas and Dharani Prayers), the world’s oldest printed object, created in 8th century Japan. There’s also a page of the first print run of the Gutenberg Bible, the Western world’s first piece of print.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/england-batter-taunted-after-dismissal-20250802-p5mjqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "England batter taunted after dismissal",
    "publish_date": "Sat, 02 Aug 2025 08:21:15 +1000",
    "category": "sports",
    "authors": [],
    "text": "England batter taunted after dismissal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/world/north-america/trump-fires-statistician-after-weak-employment-data-claiming-it-was-rigged-20250802-p5mjqa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Rigged’: The jobs numbers came in and they were bad. Trump fired the stats boss",
    "publish_date": "Sat, 02 Aug 2025 08:15:58 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: US President Donald Trump ordered the dismissal of the country’s labour statistics commissioner following a shock employment report which he alleged, without evidence, was “rigged” for political purposes.\n\nThe Bureau of Labour Statistics found only 73,000 jobs were created in the world’s biggest economy in July, well below market expectations, and significantly revised down the figures for May and June.\n\nPresident Donald Trump, leaving the White House for his New Jersey golf club on Friday, ordered the statistician be sacked. Credit: AP\n\n“Larger than normal” revisions concluded only 19,000 jobs were created in May, not 144,000, and only 14,000 jobs were created in June, not 147,000. In total, the numbers were revised down by 258,000 over two months.\n\nTrump – who spent much of the week saying the US was “the hottest country in the world” after gross domestic product figures showed the economy rebounded to grow 3 per cent in the June quarter – immediately went on the attack and ordered the sacking of the commissioner, Erika McEntarfer.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/aussies-warned-over-impending-caravan-rule-change-amid-national-trend-dont-wait-003508464.html",
    "title": "Aussies warned over impending caravan rule change amid national trend: 'Don't wait'",
    "publish_date": "2025-08-02T00:35:08Z",
    "category": "finance",
    "authors": [],
    "text": "Caravan and RV owners are being urged to get ahead of the change as Queensland joins other states in the blanket safety mandate.\n\nIsabelle and parter Dave lost their caravan to a fire just days into their dream trip earlier this year after they heard the fire alarm go off. Source: GoFundMe\n\nCaravan owners are being reminded to make a potentially life-saving change ahead of new rules coming into effect in one Aussie state.\n\nIf they don't already have one, all caravans and motorhomes in Queensland will soon be mandated to have a working photoelectric smoke alarm installed in them, brining the state into line with other major jurisdictions.\n\nWith more than 900,000 caravans and motorhomes registered across the country, more Australians are relying on mobile homes for holidays as well as full-time accomodation during an ongoing housing shortage in parts of the nation. And a number of devastating caravan fires have made headlines in recent months, bringing the issue into focus.\n\nFrom 2027, all caravans and motorhomes must be fitted with a photoelectric smoke alarm on the ceiling. It comes after the rule was already imposed on newly registered caravans in the state last year.\n\nADVERTISEMENT\n\nJason Plant, the CEO of Caravan Trade and Industry Association Queensland, told Yahoo News the broader mandate is \"a welcome and responsible move\".\n\nThe long lead time on making the alarms mandatory in all existing vehicles is about \"allowing owners, manufacturers, and retailers sufficient time to adapt, retrofit, and educate consumers,\" Jason said.\n\n\"It also ensures supply chains can meet demand, particularly for alarms designed to withstand the unique conditions of on-the-road conditions, such as vibration and temperature fluctuations.\"\n\nQueensland's Department of Transport and Main Roads as well as the state's Housing Department has been reminding residents of the impending law change on social media in recent weeks, urging owners to get ahead of the change. \"Don't wait for the law – or a fire – to catch up,\" they warned.\n\nRelated: Family 'lucky to be alive' after caravan home erupts in flames\n\nOwners have been urged to get ahead of the change, which is still more than a year away from being enforced. Source: Queensland Department of Transport and Main Roads/Facebook\n\nDifferent rules across states but caravan 'trend is clear'\n\nCaravan owners in NSW must have a smoke alarm installed in their vehicles, in any section where occupants will sleep.\n\nADVERTISEMENT\n\n\"NSW legislation stipulates that you must have at least one working smoke alarm inside the van where the bed is, and one in the annex if people are sleeping there,\" NSW Fire and Rescue says. \"Caravans and campervans have limited escape options in the event of a fire. You have just a few seconds to get out of a burning caravan, as they are constructed of lightweight and highly combustible fittings. A working smoke alarm can mean the difference between life and death.\"\n\nA majority of domestic caravan manufacturing takes place in Victoria, which has also had a similar mandate on the books from July last year. As a result, modern smoke alarms have increasingly become a standard inclusion for most new caravan builds.\n\nWestern Australia and Tasmania have not mandated smoke alarms in mobile homes, but in general, \"the national trend toward stronger safety standards is clear,\" Jason told Yahoo.\n\n\"It's likely that smoke alarms will become a default feature in caravans across Australia. Over time, consumer expectations and manufacturer practices will help close the gap, even in states without formal mandates,\" he said\n\nCrews were unable to save the 12-month-old caravan after the fire ripped through it at the Auburn Community Caravan Park in SA in March. Source: SA Country Fire Service\n\nCaravan and campervan owners will need to retrofit devices\n\nFor those with older models of RVs and caravans, retrofitting photoelectric smoke alarms is generally straightforward, Jason said. Typically the devices don't require any hardwiring and can be found at specialist caravan retailers and even some hardware stores. Alternatively, owners can have them installed at caravan service centres, \"which offer retrofitting as part of broader safety upgrade services\".\n\nADVERTISEMENT\n\n\"The industry has also seen strong uptake of caravan-specific alarms featuring hush buttons and 10-year non-removable batteries, products that meet both regulatory requirements and the practical needs of mobile living,\" he said.\n\nWhile the smoke alarm might not save the caravan, it could save your life. In March, a new $175,000 caravan was completely destroyed in South Australia after lithium-ion batteries inside caught fire. SA's Country Fire Service said the occupants spotted smoke \"coming out of the batteries\" before the fire had started. They were able to exit the vehicle safely but it was too late for the caravan. In the same month, a young couple lost their caravan after hearing the smoke alarm go off while driving.\n\nLast year, one family told Yahoo News they were lucky to be alive after their caravan went up in flames in Victoria, believed to be started by a diesel heater inside the vehicle.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/wfh-could-become-legal-231816569.html",
    "title": "WFH could become legal right",
    "publish_date": "2025-08-01T23:46:01Z",
    "category": "finance",
    "authors": [
      "Amelia Swan"
    ],
    "text": "Victorian Premier Jacinta Allan is set to announce the law on Saturday. Picture: NewsWire / Nadir Kinani\n\nWorking from home for two days a week could become a legal right in Victoria, under new plans proposed by Premier Jacinta Allan.\n\nThe state government is promising to introduce the law — covering both public and private sectors — by next year, with it applying to anyone who can “reasonably” carry out their work away from the office.\n\nMs Allan will tell the annual state Labor conference: “Working from home works for families and it’s good for the economy.\n\n“Day after day, unions are being contacted by workers who have been denied reasonable requests to work from home, and across the country, Liberals are drawing up plans to abolish work-from-home and force workers back to the office and back to the past.\n\nADVERTISEMENT\n\n“That’s why the Allan Labor government is acting. Enshrining work from home in law means this life-changing practice isn’t something you or your loved ones have to politely ask for. It’s a right you’ll be entitled to.”\n\nThe plan would make working from home two days a week a legal right in Victoria.\n\nShe will add that a consultation will take place on the proposed Australia-first law, but added it won’t determine if the plans should go ahead.\n\n“We’re already clear on that: it should be. We just need the appropriate laws to reflect it,” she said.\n\nMs Allan said the new policy is aimed directly at supporting families, promising average savings of $110 per week, or $5308 annually in commuting costs.\n\n“Work from home supports women with children, carers and people with a disability to work,” Ms Allan said.\n\n“Thanks to work from home, workforce participation is 4.4 per cent higher than before the pandemic.”\n\nADVERTISEMENT\n\nThe legislation is expected to be introduced later this year.\n\nThe move follows significant debate about work from home policies during the federal election, with Peter Dutton forced to backtrack on a proposed policy to limit remote work for public servants due to public backlash.",
    "source": "Yahoo",
    "cluster_id": 34
  }
]