[
  {
    "url": "https://www.9news.com.au/national/melbourne-factory-fire-building-up-in-flames-overnight/afb82011-9a43-4d3f-9c61-5c56f8127d05",
    "title": "Suspicious blaze tears through Melbourne factory",
    "publish_date": "Wed, 25 Jun 2025 20:12:25 +0000",
    "category": "sports",
    "authors": [
      "Jun"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/robert-f-kennedys-new-vaccine-panel-alarms-pediatricians-with-inquiries-into-long-settled-questions/4d8d9c1e-83f3-4543-b444-dceae18ccac7",
    "title": "Robert F. Kennedy's new vaccine panel alarms pediatricians",
    "publish_date": "Wed, 25 Jun 2025 21:52:53 +0000",
    "category": "lifestyle",
    "authors": [
      "Jun"
    ],
    "text": "US Health Secretary Robert F Kennedy Jnr's new vaccine advisers have alarmed paediatricians after announcing inquiries into some long-settled questions about children's shots.\n\nOpening the first meeting of Kennedy's handpicked seven-member panel, committee chairman Martin Kulldorff said he was appointing a work group to evaluate the \"cumulative effect\" of the children's vaccine schedule — the list of immunisations given at different times throughout childhood.\n\nAlso to be evaluated, he said, was how two other shots were administered — one that guards against liver-destroying hepatitis B and another that combines chickenpox protection with MMR, the measles, mumps and rubella vaccine.\n\nUS Health Secretary Robert F. Kennedy Jr.'s new vaccine advisers alarmed pediatricians Wednesday by announcing inquiries into some long-settled questions about children's shots. (AP)\n\nIt was an early sign of how the Advisory Committee on Immunisation Practices is being reshaped by Kennedy, a leading anti-vaccine activist before becoming the nation's top health official.\n\nHe fired the entire 17-member panel this month and replaced it with a group that includes several anti-vaccine voices.\n\n\"Vaccines are not all good or bad,\" Kulldorff said. \"We are learning more about vaccines over time\" and must \"keep up to date.\"\n\nHis announcement reflected a common message of vaccine skeptics: that too many shots may overwhelm kids' immune systems or that the ingredients may build up to cause harm.\n\nScientists say those claims have been repeatedly investigated with no signs of concern.\n\nDr. Martin Kulldorf speaks during a meeting of the Advisory Committee in Immunization Practices at the CDC. (AP)\n\nKids today are exposed to fewer antigens — immune-revving components — than their grandparents despite getting more doses, because of improved vaccine technology, said Dr Paul Offit, a vaccine expert at the Children's Hospital of Philadelphia.\n\nThe American Academy of Paediatrics announced that it would continue publishing its own vaccine schedule for children but now would do so independently of the ACIP, calling it \"no longer a credible process\".\n\n\"The narrative that current vaccine policies are flawed and need 'fixing' is a distortion,\" said the AAP's Dr Sean O'Leary.\n\n\"These policies have saved trillions of dollars and millions of lives.\"\n\nThe ACIP, created more than 60 years ago, helps the Centres for Disease Control and Prevention determine who should be vaccinated against a long list of diseases, and when.\n\nThose recommendations have a big impact on whether insurance covers vaccinations and where they're available, such as at pharmacies.\n\nREAD MORE: ﻿ Jeff Bezos and Lauren Sanchez arrive for Venice wedding amid protests\n\nParticipants listen during a meeting of the Advisory Committee in Immunization Practices at the CDC. (AP)\n\nAfter Kennedy's abrupt dismissal of the existing expert panel, a number of the CDC's top vaccine scientists — including some who lead the reporting of data and the vetting of presentations at ACIP meetings — have resigned or been moved out of previous positions.\n\nAnd shortly before Wednesday's meeting, a Virginia-based obstetrician and gynecologist appointed to the committee stepped down.\n\nAccording to the Trump administration, he withdrew during a customary review of members' financial holdings.\n\nScientists show data that COVID-19 vaccines protect pregnant women and kids\n\nFirst on the committee's agenda were COVID-19 vaccinations.\n\nKennedy already sidestepped the panel and announced the vaccine would no longer be recommended for healthy children or pregnant women.\n\nYet CDC scientists told the panel that vaccination was \"the best protection\" during pregnancy, and said most children hospitalised for COVID-19 over the past year were unvaccinated.\n\nCOVID-19 remains a public health threat, resulting in 32,000 to 51,000 US deaths and more than 250,000 hospitalisations since last fall, according to the CDC.\n\nKennedy already sidestepped the panel and announced the vaccine will no longer be recommended for healthy children or pregnant women. (Getty images)\n\nMost at risk for hospitalisation are seniors and children under two — especially infants under 6 months who could have some protection if their mother got vaccinated during pregnancy, according to the CDC's presentation.\n\nThe new advisers weren't asked to vote on Kennedy's recommendations, which raise uncertainty about how easily people will be able to access COVID-19 vaccinations this fall.\n\nAfter CDC staff outlined multiple overlapping systems that continue to track the vaccines' safety, several advisers questioned if the real-world data really is trustworthy.\n\nCommittee will vote on RSV protections\n\nNext, the committee took up RSV, or respiratory syncytial virus, a common cause of cold-like symptoms that can be dangerous for infants.\n\nIn 2023, US health officials began recommending two new measures to protect infants — a lab-made antibody for newborns and a vaccine for pregnant women — that experts say likely drove an improvement in infant mortality.\n\nThe committee will discuss another company's newly approved antibody shot and vote on updated recommendations.\n\nThe committee will discuss another company's newly approved antibody shot and vote on updated recommendations. (AP)\n\nFlu shot recommendations to be debated\n\nAt its June meetings, the committee usually refreshes guidance for Americans 6 months and older to get a flu shot, and helps green light the annual fall vaccination campaign.\n\nBut a vote set for Thursday that also promises controversy.\n\nThe panel is set to consider a preservative in a subset of flu shots that Kennedy and some antivaccine groups have falsely contended is tied to autism.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/jeff-bezos-lauren-sanchez-wedding-amazon-founder-arrives-in-venice-amid-protests/05f56aed-938f-44dd-9c64-d4fbfc67f97a",
    "title": "Jeff Bezos and Lauren Sanchez arrive for Venice wedding amid protests",
    "publish_date": "Wed, 25 Jun 2025 14:31:59 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "Multibillionaire Amazon founder Jeff Bezos and Lauren Sanchez arrived in Venice on Wednesday ahead of their star-studded weekend wedding, an event that has galvanised a wide assortment of activist groups protesting it.\n\nBezos waved from a water taxi as he and Sanchez arrived at the dock of the Aman Hotel, a five-star hotel on the Grand Canal, with two security boats in tow.\n\nThe event has drawn protests by groups who view it as a sign of the growing disparity between the haves and have-nots, while residents complain it exemplifies the way their needs are disregarded in the era of mass tourism to the historic lagoon city.\n\nBezos waved from a water taxi as he and Sanchez arrived at the dock of the Aman Hotel. (AP)\n\nLocal activists have planned a more organised protest for Saturday, aiming to obstruct access to canals with boats to prevent guests from reaching a wedding venue. (AP)\n\nAbout a dozen Venetian organisations — including housing advocates, anti-cruise ship campaigners and university groups — have united to protest the multi-day event under the banner \"No Space for Bezos\", a play on words also referring to the groom's space tourism venture and the bride's recent space flight.\n\nThey have staged small-scale protests, unfurling anti-Bezos banners on iconic Venetian sites. They were joined on Monday by Greenpeace and the British group \"Everyone Hates Elon\", which has smashed Teslas to protest Elon Musk, to unfurl a giant banner in St Mark's Square protesting purported tax breaks for billionaires.\n\nOn Wednesday, other activists launched a float down the Grand Canal featuring a mannequin of Bezos clinging onto an Amazon box, his fists full of fake dollars. The British publicity firm that announced the stunt said it wasn't a protest of the wedding \"but against unchecked wealth, media control, and the growing privatisation of public spaces\".\n\nThere has been no comment from Bezos' representatives on the protests.\n\nThe local activists had planned a more organised protest for Saturday, aiming to obstruct access to canals with boats to prevent guests from reaching a wedding venue. They modified the protest to a march from the train station after claiming a victory, asserting that their pressure forced organisers to change the venue to the Arsenale, a more easily secured site beyond Venice's congested centre.\n\nThe event has drawn protests by groups who view it as a sign of the growing disparity between the haves and have-nots. (AP)\n\n\"It will be a strong, decisive protest, but peaceful,\" said Federica Toninello, an activist with the Social Housing Assembly network. \"We want it to be like a party, with music, to make clear what we want our Venice to look like.\"\n\nAmong the 200 guests confirmed to be attending the wedding are Mick Jagger, Ivanka Trump, Oprah Winfrey, Katy Perry and Leonardo DiCaprio.\n\nVenice, renowned for its romantic canal vistas, hosts hundreds of weddings each year, not infrequently those of the rich and famous. Previous celebrity weddings, like that of George Clooney to human rights lawyer Amal Alamuddin in 2014, were embraced by the public. Hundreds turned out to wish the couple well at City Hall.\n\nBezos has a different political and business profile, said Tommaso Cacciari, a prominent figure in the movement that successfully pushed for a ban on cruise ships over 25,000 tonnes traveling through the Giudecca Canal in central Venice.\n\n\"Bezos is not a Hollywood actor,\" Cacciari said. \"He is an ultra-billionaire who sat next to Donald Trump during the inauguration, who contributed to his re-election and is contributing in a direct and heavy way to this new global obscurantism.\"\n\nLauren Sanchez arrives at a five-star hotel on the Grand Canal, with two security boats in tow. (AP)\n\nLauren Sanchez and Jeff Bezos at the Vanity Fair Oscar Party in March. (Evan Agostini/Invision/AP)\n\nCritics cite Amazon's labor practices, ongoing tax disputes with European governments and Bezos' political associations as reasons for concern.\n\nActivists also argue that the Bezos wedding exemplifies broader failures in municipal governance, particularly the prioritisation of tourism over residents' needs. They cite measures such as the day-tripper tax — which critics argue reinforces Venice's image as a theme park — as ineffective. Chief among their concerns is the lack of investment in affordable housing and essential services.\n\nCity officials have defended the wedding. Mayor Luigi Brugnaro called the event an honour for Venice, and the city denied the wedding would cause disruptions.\n\n\"Venice once again reveals itself to be a global stage,\" Brugnaro told The Associated Press, adding he hoped to meet Bezos while he was in town.\n\nMeanwhile, a Venetian environmental research association, Corila, issued a statement saying Bezos' Earth Fund was supporting its work with an \"important donation\".\n\nCorila, which unites university scholars and Italy's main national research council in researching Venetian protection strategies, wouldn't say how much Bezos was donating but said contact began in April, well before the protests started.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/weather-forecast-news-cold-front-brings-icy-polar-blast-to-parts-of-south-eastern-australia-victoria-new-south-wales/d7467f01-c0af-45ee-ad2d-818246f1dce2",
    "title": "Australians left shivering as icy polar blast sweeps through",
    "publish_date": "Wed, 25 Jun 2025 10:22:07 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "﻿A cold front moving across south-eastern Australia is expected to bring an icy polar blast and chilly nights across several states and territories over the next few days.\n\nA powerful cold front and cooling showers will make the temperature feel three to seven degrees colder than the actual temperature in the coming days, Weatherzone reports .\n\nVictoria and southern NSW are experiencing their coldest days of the spell today.\n\n﻿A cold front moving across south-eastern Australia is expected to bring an icy polar blast and chilly nights across several states and territories. (Weatherzone)\n\nEastern parts of the country are expected to shiver throughout tomorrow.﻿\n\n\"Chilly mornings will take hold into the weekend as this polar airmass slowly dissipates and high pressure brings clearer skies and lighter winds,\" Weatherzone meteorologist Felix Levesque said.﻿\n\nThe polar blast brought snow to some parts of Victoria today including Mount Macedon, Mount Kaye, Mount Buangor, Mount Elizabeth, Mount William and Mount Stanley.\n\n﻿Strong winds resulted in the cancellation of some flights this morning , while others were delayed due to the conditions.\n\n\"Due to high winds, airport operations may be affected throughout the day,\" a spokesperson for Sydney Airport said.\n\n\"We recommend passengers check the status of their flight with their airline before travelling to the airport and we thank passengers for their patience and understanding.\"﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/grocery-prices-australia-the-most-expensive-and-most-affordable-supermarkets-in-australia-revealed-by-choice/0fc22623-52d3-43c4-b125-8c33faeb8b75",
    "title": "Receipts lay bare huge difference between Aussie grocery giants",
    "publish_date": "Wed, 25 Jun 2025 00:53:09 +0000",
    "category": "finance",
    "authors": [
      "Jun"
    ],
    "text": "A government-funded comparison of the country's biggest supermarket chains has revealed where shoppers are spending the most cash.\n\nConsumer group Choice released its quarterly report on grocery prices at Aldi, Woolworths, Coles and IGA, which looked at the combined total of 14 popular winter items.\n\nChoice priced essential items such as milk, Weet-Bix, apples, chicken breast, oats, onions and bananas across 104 stores in 27 locations during March 2025 and found Aldi came out on top with the most affordable receipt.\n\nREAD MORE: Trump explodes in tirade against warring nations\n\nSupermarket comparison of grocery prices by Choice. (CHOICE)\n\nA basket of these items at Aldi costs $55.35, while Woolworths trailed closely behind with the price just over $3 more expensive at $58.92.\n\nColes was slightly pricier at $59.22 for the total basket of items.\n\nMeanwhile, IGA was the most expensive of all four supermarket chains at $69.74.\n\nThat's a difference of $14.42 between the basket at Aldi and one at IGA.﻿\n\nREAD MORE: Bombshell report reveals truth about US raid on Iranian nuclear sites\n\nA cost breakdown released by the office of Andrew Leigh, assistant minister for productivity, competition, charities and treasury, found IGA was the most expensive option in every state and territory.\n\nAldi was the most affordable in every state and territory where the German supermarket is available.\n\nAldi was the most affordable place to shop in every state and territory. (Getty)\n\n\"We're continuing to crack down on unfair prices at the big supermarkets to ensure Australian consumers and farmers get the best deal at the checkout,\" Leigh said.\n\n\"This latest Choice quarterly supermarket report funded by our government, provides a comparison of everyday grocery items for shoppers to make informed purchase decisions and save money.\"\n\nChoice chief executive Ashley de Silva said item costs varied between supermarkets, however Aldi still came out on top even when comparing against specials.\n\n\"Without specials, Woolworths had the cheapest chicken breasts and pumpkin, while Coles had the best deal on apples,\" de Silva said.\n\n\"At IGA, you paid less for carrots and garlic than at the three other supermarkets. For all other products in our basket, Aldi is your best bet.\"\n\nChoice is set to release its next quarterly supermarket report in September.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/limit-spread-viruses-sickness-covid-at-home/105455676",
    "title": "What you can do to stop the spread of illness in your home",
    "publish_date": "Thu, 26 Jun 2025 01:05:45 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Winter can be a contagious time of year for everything from COVID-19 to the common cold.\n\nOnce someone in your household feels the first ominous tickle at the back of their throat, everyone else can feel doomed to follow.\n\n\"It's always a challenge within households because we know households are the place where viruses like respiratory viruses spread really efficiently,\" says Catherine Bennett, Deakin University's chair of epidemiology.\n\nBut there are ways to limit the risk of illnesses spreading from one family member or housemate to another, she says.\n\nShould you isolate at home?\n\nProfessor Bennett says if someone within your household becomes sick, it is possible you have already been exposed before they had any symptoms.\n\nHowever, if the sick person can isolate from the rest of household it's still worth it, she says. Ideally this would look like using a separate bedroom and bathroom to others.\n\nShe says this degree of isolation is not possible or realistic for many households.\n\nDarran Foo says advice on isolating from the rest of the household can vary, depending on the infection or virus someone has. (Supplied: Healthdirect)\n\nIsolation can also look like someone sleeping on the couch to \"reduce their risk of inhaling the virus\" from their unwell partner overnight, she says.\n\nMedical director for government-funded online public health information service Healthdirect Darran Foo says if possible, the symptomatic person should remain isolated from the rest of the household until they no longer have active symptoms.\n\nFor example, \"no more ongoing fevers, no more coughing up lots of phlegm\".\n\nConsider wearing a mask\n\nIf someone in the household is symptomatic, and isolating completely is not possible, Professor Bennett says a mask can help protect the rest of the household.\n\n\"Wearing a mask if you're unwell can reduce your risk of passing it on to other people.\"\n\nDr Foo also advises wearing a mask if it's possible and practical, particularly if you live in a smaller home like an apartment.\n\nSanitise contaminated surfaces and wash hands\n\nDr Foo recommends throwing used tissues away immediately and avoiding sharing cups, plates and cutlery in the household when someone is unwell, whether from a cold or COVID-19.\n\n\"The biggest thing really is to maintain good hygiene, especially good hand hygiene,\" Dr Foo says.\n\n\"Lots of hand washing and using sanitisers as much as possible.\"\n\nProfessor Benett also says you should \"wash your own hands more often in between touching things, even around the home\" when you or someone else is sick.\n\nShe recommends wiping down commonly used surfaces — such as the bathroom — more often. Any surfaces where someone has coughed may have droplets over them, she says.\n\nFind ways to boost ventilation\n\nProfessor Bennett says \"bugs do so well [in winter because] we can't air our houses out\".\n\nPoor ventilation will make it easier for viruses to spread, but she says increasing air turnover and introducing outdoor air can help.\n\nOpen doors and windows when you can \"so it's not the same air pushing right through the household that's around the person who's unwell.\"\n\nDr Foo also says the more ventilation you can get at home the better, while of course avoiding hypothermia.\n\nCatherine Bennett says there is often a trade-off between ventilation and keeping warm. (Supplied)\n\nWhat should you do if someone in the house is immunocompromised?\n\nDr Foo says \"the general advice all remains the same\" if someone in the household is potentially more vulnerable.\n\nThe rules around isolating when you're sick with COVID or the flu Photo shows A man and woman wearing a mask, sitting on a park bench with distance between them What has changed since the pandemic when it comes to isolating when sick, whether it's COVID or a bad cold?\n\nHowever, he says people more at risk of becoming seriously unwell may want to consult their regular healthcare professional who knows their medical history.\n\n\"It really depends on that person's risk, their comorbidities and what ongoing conditions they have — and also to identify whether it's appropriate to use antiviral medication at that point in time.\"\n\nProfessor Bennett says being diligent with mask wearing, hand washing and sanitising surfaces is particularly worth doing if someone in the house is vulnerable.\n\nMake sure your vaccinations are up to date\n\nProfessor Bennett says being up to date with COVID-19 and influenza vaccinations will offer another layer of protection.\n\n\"If you can't avoid infection in the household — and that's the hardest place to do it — then actually having some protection from severe illness is really important in influenza.\"\n\nIn larger shared households there are more people to bring viruses home and that extra protection from vaccination is even more important, \"particularly from severe illness in the vulnerable people in our households\", Professor Bennett says.\n\nDr Foo also encourages people to stay up to date with their vaccinations, \"especially their annual flu vaccination and their COVID booster shots\".\n\nThis is general information only. For personal advice, you should see a qualified medical practitioner.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/albany-grasmere-wind-farm-future-nearing-end-of-life/105455470",
    "title": "Operators flag new plans for WA's oldest operating wind farm",
    "publish_date": "Thu, 26 Jun 2025 00:52:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of the country's first wind farms could break new ground with the owners of the Albany Grasmere Wind Farm considering the largest domestic upgrade of its heritage infrastructure.\n\nThe 18-turbine wind farm, 420 kilometres south of Perth on Western Australia's south coast, was commissioned in 2001 with 12 turbines.\n\nThe existing turbines — an additional six were added in 2011 — stand about 60 metres tall with a blade diameter of 70 metres.\n\nWA's state-run power provider, Synergy, estimates it generates about 80 per cent of Albany's electricity needs.\n\nIn addition to generating power for Albany, the farm is visited by an estimated 200,000 visitors each year.\n\nThe Albany Grasmere Wind Farm is home to 18 turbines. (ABC News: Gian De Poloni)\n\nOnce the largest commercial wind farm in Australia, its aging technology means it is a comparative minnow.\n\n\"It was a 35-megawatt facility, which was huge at the time. It was nation-leading,\" said energy analyst Tom Quinn.\n\n\"Today, your biggest wind farm in WA is the Warradarge wind farm, which is 283MW in size, almost 10 times as big.\n\n\" While it was groundbreaking at the time the technology has moved on. \"\n\nHeritage wind farms look to new tech\n\nOn average, wind farms have a 30-year shelf life.\n\nWhile no commercial projects have reached the milestone, Albany Grasmere is one of three across the country approaching the end of its predicted operating life.\n\nAustralia's oldest commercial wind farm in Codrington, Victoria, was commissioned three months before Albany Grasmere and was marked for decommissioning with owners Pacific Blue citing high re-powering costs.\n\nEnergy analyst Tom Quinn says modern turbines produce a lot more energy for the same turbine footprint. (Supplied)\n\nThe Huxley Hill wind farm, built on King Island in Tasmania in 1998, is undergoing an $11 million restoration to its existing turbines.\n\nRecent approval for a meteorological mast to measure wind data at Albany Grasmere could indicate that a wholesale expansion of the WA facility may be on the cards.\n\nMr Quinn said Albany's power generation was about 1.5 to 1.8MW per wind tower, while modern towers can deliver 6-7MW per tower.\n\n\"I would suspect they'll swap out the entire unit,\" Mr Quinn said.\n\n\"Modern turbines give you a lot more grunt for the same turbine footprint.\n\n\"I think that's probably going to be the most likely pathway the company will take.\"\n\nThe Codrington wind farm was Australia's first wind farm. (Supplied: Pacific Blue)\n\nOwner Bright Energy Investments, which jointly runs the site with Synergy, said a plan for the future of the site was underway.\n\nGeneral manager Tom Frood said data from the yet-to-be-built meteorological mast would determine the future of the site.\n\n\"[It includes] the option to rebuild the wind turbines with newer technology increasing the generation capacity,\" he said.\n\nMr Frood said the wind farm was an \"iconic landmark\" that would play a significant role in Western Australia's sustainable energy future.\n\nCity council backs facility\n\nMore modern turbines used in newer developments across the region are double the size of those used near Albany.\n\nCity of Albany executive director of infrastructure, development and environment Paul Camins said the city was supportive of redeveloping the facility.\n\n\"Albany was one of the first regional cities in Australia to embrace wind power and we are proud of the role we have played in advancing renewable energy,\" he said.\n\nAlbany's wind farm is listed as a top attraction by Tourism WA. (Supplied: Tourism WA)\n\n\"We know our community values Albany's unique natural and coastal landscapes, so any proposal would need to be carefully assessed and considered.\"\n\nMr Quinn said the Albany Grasmere site could act as a litmus test for other aging facilities around the country.\n\n\"It's one of the oldest, and it'll be really interesting to see how they go about this process,\" Mr Quinn said.\n\n\"We're going to see more of it, and I think there's an opportunity to get it right and set that template for how to do this.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/the-winter-game-how-australian-rules-football-adapts-to-weather/105462202",
    "title": "How Australian Rules football adapts to the weather, and who's best in the wet",
    "publish_date": "Thu, 26 Jun 2025 00:52:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "Football is a game for all seasons. The ball is first bounced for the year in the waning hours of summer, with play continuing through autumn, winter and spring.\n\nThe conditions of any two (non-indoor) football games are rarely the same. Football is played at all hours of the day across all corners of the country. It's not just rain, hail or shine — it's also blustery gales and sunny days, steamy nights and even snow.\n\nPreparing to beat the conditions along with opponents has been an obsession for footballers for generations. Over time, different game styles have emerged to conquer the elements, whatever they are.\n\nPlayers, teams and businesses have also attempted technological solutions — from sticky substances to more stable boots, waterproof footies to ice vests — to try to get an edge.\n\nAt the same time, football is spanning across more of the year than ever before. That means an extra element — high heat — is getting more common in footy games.\n\nDifferent teams tend to excel in different conditions, leading to wild swings depending on the weather.\n\nSo, how does football change depending on the season? And what teams do better in different conditions?\n\nCold and wet winters\n\nIn its development as a sport, Australian Football was designed as a winter game, a counterpart to the summer pursuit of cricket. For most of the game's history, footy took the grounds when it was too wet or cold to play cricket.\n\nIn its suburban past (and grassroots present), mud, sweat and tears were common elements of football.\n\nAlthough the grounds have improved over time, rain still affects play. Teams still need to consider how to approach the game when the ground becomes slippery or sodden.\n\nWet-weather footy has its own lexicon, separate and different from how the game is played in the dry.\n\nThen-Richmond VFL coach and current Collingwood coach Craig McRae broke down the basics of wet-weather football in 2017 when talking to Richmond great Matthew Richardson.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\n\"[It's about] just doing the fundamentals right, not trying to overuse it — which we do sometimes,\" McRae explained.\n\n\"It's a subtle change. We're playing a lot of contested footy, kicking long down the line … it sort of plays into wet-weather conditions well.\"\n\n\"We want to get territory … Even just punching the ball off the ground — just keep the ball going forward. Sometimes it doesn't look pretty.\"\n\nMcRae might be one of the best judges of how to play in the wet. Since 2022, no side has been better in wet weather conditions than the Pies.\n\nNot every team plays the same amount of time in the wet. Docklands home teams have less chance to experience such conditions.\n\nPerth tends to be sunnier and drier. Sydney teams and outdoor Victorian teams can spend nearly one in six games dealing with the rain.\n\nThat means that getting to know how to play in the wet can be tougher for some teams.\n\nTackles, pressure and turnovers go up when the rain falls, and scoring shots diminish. There are more contested possessions across the ground and less ball in space.\n\nMarks go down generally but stoppages jump a ton. Defenders also have an easier time winning their one-on-one contests and spoils tend to spike.\n\nIf you win the contested possession battle in the dry, you win about 64 per cent of the time. In the wet, it jumps to 69 per cent. There's an even larger increase for teams that win forward 50 ground ball gets (61 per cent to 72 per cent).\n\nIf all this sounds like a bit of a throwback, then you are probably right.\n\nWet-weather footy now tends to resemble footy — wet or dry — of the past. In the wet, the game tends to be played more in a straight line, with the field stretched out. Teams use the corridor significantly less (around 20 per cent less) when transitioning from defence in the wet, and are often reluctant to switch.\n\nHow Collingwood has reinvented itself to become this season's team to beat Photo shows GettyImages-2214886183 They went from winning the flag in 2023 to missing finals last year, and as they lead the AFL pack in 2025, the data shows this isn't just good old Collingwood forever.\n\nWidth is used less and positions are adhered to more. Even with the improvements to boots, grounds and the football itself, the first principles of footy — ground position and possession — come to the fore.\n\nIn short, it's a bit like 80s footy. Staying in front of the ball — and your opponent — is critical.\n\n\"It's one of the things you learn as a kid coming through, you don't let the ball over the back in wet conditions,\" Sydney coach John Longmire stated in 2014.\n\nLongmire's Swans played in one of the wettest games in recent memory just two years later when over 250mm of rain hit the Gold Coast before and during their game against the Suns.\n\nA deluge of rain at Carrara in 2016 made visibility, never mind ball control, extremely difficult for the Suns and Swans. (Getty Images: Chris Hyde)\n\nThere's also a significant increase in the amount of contested knock-ons and ground kicks in the wet — almost a quarter more, this year. That ability to gain territory at all costs is still the main fundamental for teams when rain strikes.\n\nThere's some school of thought that teams may be a little too conservative when adapting to the wet these days. Brisbane, for example, was slick in handling the ball in slippery conditions at Kardinia Park last week. The Lions were willing to stretch the ground and switch the ball where possible.\n\n\"It was quite slippery out there. It looked slippery for us — didn't look as slippery for them,\" quipped Geelong coach Chris Scott to ABC Sport after their loss last week.\n\nBut the wet isn't the only type of weather footy players have to deal with.\n\nFour seasons in one competition\n\nWhile wet weather takes much of the attention, other weather conditions can significantly impact how football is played.\n\nTake that Geelong-Brisbane match that Scott was talking about last week. That game was played in slippery conditions — but it didn't rain before or during the game. Instead, it was a combination of cold and humid conditions that created dew on the field and ball.\n\nMoisture — whether dew, frost or general greasiness — tends to occur when the relative humidity starts to approach 100 per cent.\n\nABC AFL Daily podcast Host Catherine Murphy is joined by premiership-winning coach Paul Roos to bring you your daily dose of AFL conversation. The team give you context and depth beyond the headlines in this footy conversation that's equal parts thoughtful, insightful and fun.\n\nAs the air saturates with moisture, the game starts to look soggy — similar to a wet-weather game. Contested ball becomes more important, and it becomes significantly harder to mark the ball.\n\n\"It wasn't a pretty game of footy but it's not a 'pretty game of footy weekend'. It was pretty slippery all over the place this weekend,\" Port coach Ken Hinkley explained to ABC Sport after their win over GWS in Canberra earlier this month.\n\n\"Of course you have to adjust to what you play [to] what the conditions are so, you know, it's something we had to do.\"\n\nThat game was also quite cold, peaking at just 6 degrees. Surprisingly that's not the coldest game this year — with the Adelaide-Hawthorn match-up at Launceston dropping slightly closer to freezing. Both games were low-scoring slogs.\n\nCold-weather footy is often accompanied by rain or dew. Even when it's dry, it's unpleasant. It's something that the league doesn't experience too often, but the introduction of the Tassie Devils might see it become more commonplace.\n\nCold-weather footy sees some impacts to scoring and ball movement but not much difference in contest around the ball, unlike wet weather.\n\nTasmania — and Hobart in particular — often also sees blustery conditions and howling winds. That also can significantly affect the way the game is played.\n\nWindy games see far fewer marks taken but more territory gained in total. There are also more turnovers, and targets are harder to hit by hand or foot.\n\nUnsurprisingly, Fremantle with their famous \"doctor\" play in gusty winds the most. More surprisingly, Essendon doesn't play in the wind much — showing their distance from their Windy Hill days.\n\nThe introduction of Tassie will also exacerbate something alluded to above: the length of the season.\n\nThe ever-increasing length of the season has seen an increase of games in warm and very hot conditions. The first four rounds of the season saw the AFL Heat Policy enacted each week, with extended quarter-time breaks and additional water carriers permitted.\n\nThat's something the AFLW has had to deal with as it has expanded and something that players in that competition have struggled with.\n\nLions question midday start time Photo shows Will McLachlan of the Brisbane Lions stands on the Gabba with his hands on his hips. The decision to start the AFL clash between the Lions and Eagles at midday in late March in Brisbane is questioned by coach Chris Fagan and club legend Jason Akermanis.\n\nHot-weather games tend to see faster, freer-flowing football with more uncontested marks and bounces than in colder conditions. There's more uncontested ball and fewer stoppages. Ball retention becomes easier in general.\n\nBut there are also other real risks to playing in heat. After his team played a midday game against West Coast in the blazing sun, Brisbane coach Chris Fagan was blunt about how it negatively affected the players.\n\n\"They were pretty cooked, and you could tell just walking out onto the ground after — probably a record number of cramps, I don't know.\" Fagan mused.\n\n\"I haven't seen that many of our blokes struggle like that [before].\"\n\nRegardless of the heat, cold, rain, wind or even snow, footy can change at the drop of a weather forecast — and your team might just be the one to capitalise.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/usman-khawaja-refuses-to-speak-to-sen-peter-lalor/105462370",
    "title": "Khawaja refuses radio interview after SEN axes journalist over Gaza posts",
    "publish_date": "Thu, 26 Jun 2025 00:46:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Usman Khawaja has refused to speak to radio broadcaster SEN after day one of the first Test against the West Indies in Bridgetown.\n\nIt has been reported the Australia opener's decision was in response to SEN standing down cricket journalist Peter Lalor earlier this year over pro-Palestinian social media posts.\n\nLalor, covering the West Indies series for his Cricket Et Al podcast, said he was grateful for Khawaja's support.\n\n\"Usman is a man of principle whose support I valued greatly when I was dismissed and whose ongoing support I appreciate,\" he said in a statement.\n\nCricket Australia has been contacted for comment.\n\nKhawaja was a vocal supporter of Lalor after he was let go by SEN during Australia's Test tour of Sri Lanka.\n\n\"Standing up for the people of Gaza is not antisemitic nor does it have anything to do with my Jewish brothers and sisters in Australia, but everything to do with the Israeli government and their deplorable actions,\" Khawaja wrote on Instagram.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It has everything to do with justice and human rights. Unfortunately hatred towards the Jewish and Muslim community will always exist.\n\n\"Pete is a good guy with a good heart. He deserves better.\"\n\nKhawaja has made several statements on social media and tried to do the same on the field in the past.\n\nThe 38-year-old was banned by the ICC from displaying the message \"All lives are equal\" and \"Freedom is a human right\" on his shoes during a 2023 Test against Pakistan.\n\nHe opted to wear a black armband and tape over the messages on his playing kit.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/phil-gore-backyard-ultra-world-record-at-dead-cow-gully/105461266",
    "title": "Aussie sets world record with 800km run in five days",
    "publish_date": "Wed, 25 Jun 2025 23:15:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian endurance athlete Phil Gore has broken the world record for the Backyard Ultra marathon after running almost 800 kilometres in five days on a southern Queensland cattle farm.\n\nThe West Australian ran 119 laps of the 6.7-kilometre course at the Dead Cow Gully Backyard Masters event outside Nanango, 180km north-west of Brisbane.\n\n\"It's amazing,\" Gore said after crossing the line in the early hours of Thursday morning.\n\n\"The bar keeps getting raised higher and higher and I'm glad that I'm still able to keep up with it.\n\n\" But I'm sure it'll be beaten again within a year. \"\n\nGore ran 797.3km to break the previous world record of 116 loops, which was held by Belgian Łukasz Wróbel.\n\nRunner-up Sam Harvey said his Achilles tendon \"blew up\" during the event. (ABC Southern Qld: Peter Gunders)\n\nGravity no friend to runner-up\n\nBilled as a race with no finish line, the Backyard Ultra format has no predefined length or time but requires runners to complete a 6.7km loop every hour.\n\nAustralia's backyard ultramarathon champion Photo shows TOM phil run Phil Gore knows more about pushing his mind and body to the limit than most — and now the unassuming ultramarathon runner from WA is taking on the world.\n\nThe competition is over when only one runner remains to complete a loop.\n\nA field of 263 runners set off at 7am on Saturday and the final two competitors were still running before daybreak early on Thursday.\n\nSam Harvey from New Zealand was the final runner to drop out of the race at the start of the 118th loop, which set a New Zealand national record for the Backyard Ultra distance.\n\n\"I wanted to get to sun-up … and 500 miles, but gravity wasn't my friend,\" Harvey said, adding that his Achilles tendon \"blew up\" on Tuesday night.\n\n\" Instead of running nice fast loops and coming in and going to sleep for 10 to 15 minutes, I've been out all night and hadn't had any sleep. \"\n\nPhil Gore leading the pack during his record-breaking win. (ABC Southern Qld: Peter Gunders)\n\nWomen set national records\n\nDuring the event two female national records were broken.\n\nAustralia's Holly Ranson ran 61 loops (408km) and New Zealand's Jane McAlpine ran 53 loops (355km).\n\nRace director and fourth-generation cattle farmer Tim Walsh said the event, which attracted runners from Japan, Belgium, Spain and the United States, was now a fixture on the international running calendar.\n\nAfter running for five days straight, Gore joked that his next race will be shorter.\n\n\"I might do a 24-hour instead,\" he laughed.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/tas-spirit-of-tasmania-v-officially-handed-over/105462100",
    "title": "Spirit of Tasmania V officially handed over to ferry operator TT-Line",
    "publish_date": "Wed, 25 Jun 2025 23:07:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "The second of the two new Spirit of Tasmania ships has been handed over to TT-Line by Finnish ship-building company Rauma Marine Constructions (RMC).\n\nSpirit of Tasmania V was officially accepted by one of the Tasmanian ferry operator's directors, retired Rear Admiral Steve Gilmore, on Wednesday evening.\n\nTT-Line chief executive Chris Carbone said it marked \"a significant milestone in our journey\".\n\n\"We would like to extend our heartfelt thanks to the dedicated project team members who have overseen the design, construction and delivery of the vessel, both in Australia and Finland,\" he said.\n\nTT-Line's director, retired Rear Admiral Steve Gilmore (left), raised the flag on Spirit V. (Supplied: TT-Line)\n\nIt is not clear when the ship will arrive in Tasmania. (Supplied: RMC)\n\nA TT-Line spokesperson did not say when Spirit V was expected to set sail for Tasmania, or whether any further works or sea trials needed to be completed before it did.\n\nOn Sunday, Tasmanian Premier Jeremy Rockliff said the other new ferry, Spirit of Tasmania IV, would arrive in Australia from Scotland in August.\n\nIt follows a lengthy infrastructure debacle, when it emerged last year that TT-Line had failed to build a berth for the vessels in Devonport on time.\n\nIt is not expected to be completed until at least October 2026.\n\nJeremy Rockliff said Spirit IV was expected to arrive in August. (ABC News: Jordan Young)\n\nSpirit of Tasmania IV was then moved to a port in Scotland while the Liberal state government explored options to lease it out.\n\nIt was expected to leave for Australia in May, but an issue was detected with its liquid natural gas system.\n\nRMC has since managed to modify the system, and the ship has been undertaking sea trials.\n\nLate last week, Mr Rockliff said Spirit IV's journey back to Australia would take about 10 weeks.\n\nThe ship will head to Hobart where it will receive final fit-outs.\n\nTT-Line said as of late April, storing the vessel in Scotland had cost the Tasmanian government $4.3 million, including fuel, crew and port costs.\n\nLoading...\n\nLabor promises both ships to be home before Christmas\n\nThe Spirit of Tasmania saga was one of three reasons listed on Labor's successful no-confidence motion against Mr Rockliff, which has led to the calling of a state election.\n\nCritics lash ads about Spirit ferries Photo shows Spirit of Tasmania IV ship in port. Tasmania's government has paid for double-page ads across three newspapers to address \"frequently asked questions\" about why the Spirit of Tasmania ferries are still a long way off operating.\n\nDuring the election campaign, Labor has drawn attention to the many issues with the project and promised that both ships would be home before Christmas.\n\nOn Sunday, Labor leader Dean Winter also said he would make sure the new ferries could refuel with locally produced LNG at their home port.\n\n\"Refuelling with LNG is good for the environment, it's better for Devonport, it's better for passengers,\" he said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/sport-west-indies-vs-australia-first-test-day-one-analysis/105461652",
    "title": "Same old saviours rescue Aussies after 'woeful' top-order batting",
    "publish_date": "Wed, 25 Jun 2025 22:57:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "There had been a lot of change in Australia's batting line up coming into this Test.\n\nThere was a suggestion that this was the start of Australia's new batting era.\n\nWith Steve Smith injured, Marnus Labuschagne dropped and Australia stinging after a South African ambush in north west London, now was the time to chance one's arm.\n\nAnd with these three Tests the only trials before the Ashes, it really is now or never.\n\nWith Sam Konstas and Josh Inglis thrown into the side together, there was a feeling that this was the start of the much-needed renewal of this Australian top order.\n\nBut as much as things change, they remain the same and, after a horror first hour that saw the Aussies reduced to 3-22 in the 16th over, it took two settled veterans to rescue the Australian blushes.\n\nSam Konstas never got into his groove. (AP Photo: Ricardo Mazalan)\n\nThat opening hour was, in short, a complete disaster for Australia.\n\nKonstas was out for three. Green was out for three — having already been dropped on zero. Inglis was out for five.\n\nHad Windies debutant Brandon King not suffered a case of the butter fingers at gully, Khawaja would had been added to that list for a total of just six as well — a dismissal that would have added to a trend of low scores for Australia's only stable column at the top of the order.\n\nIt was a desperately nervous start, the batters twitchy and uncertain on a deck that offered plenty of movement.\n\nThose nerves may be understandable — but none of the problems are new.\n\nMuch in the way that Australia was struggling to reorder its batters the last time these two sides met in a Test series in 2024 following the retirement of David Warner, the Aussies were still in almost exactly the same place, none the wiser as to who should sit at the top of the order.\n\nSince Warner's retirement the opening partners have come and gone for Khawaja — Smith, Labuschagne, Travis Head, Konstas and Nathan McSweeney — all taking their turns, a confused conveyor of curious options, none of which ever quite fitted.\n\nSam Konstas looked nervous and unsure in his first Carribean Test. (AP Photo: Ricardo Mazalan)\n\nMaking a snap judgement of the prospects of this line up off the basis of one innings on a tough pitch away from home is absurd. On flatter Australian pitches this line up would likely excel.\n\nBut even a two-paced pitch could not excuse some of the woeful top-order batting on display from some of Australia's new guard.\n\nThe hype around Konstas over the past 12 months meant that his return to the side to partner Khawaja was given a similar vibe to the Special Ks from the tennis world, but in its first iteration this series they ended up looking just as flaky as the breakfast cereal.\n\nKonstas looked cagey, lasting just 14 nervous deliveries where he barely middled a single ball before being trapped LBW by the brilliant Shamar Joseph — albeit by a superb, seaming delivery of the type that openers are liable to be faced with.\n\nProponents of the 19-year-old's premature promotion to the Test side — this is just his 31st first-class innings from 17 matches and only his third Test match — will say his development into a free-hitting David Warner-esque opener needs challenges like this.\n\nAnd they are right.\n\nThere is enough development to come from Konstas that making sweeping, grandiose statements based on a single innings in unfamiliar conditions in Bridgetown would be to assume every game he plays will be like that Boxing Day blast with which he flustered Jasprit Bumrah six months ago is his default, and unless he reverse sweeps every ball he faces, every innings is a failure.\n\nJoseph was exceptional throughout the day, bowling to a plan and hitting a testing length to everyone, Australia's Gabba golem back to torment the Australian batters once again.\n\nShamar Joseph, left, took two wickets in the opening hour. (AP Photo: Ricardo Mazalan)\n\nHis delivery to bowl Beau Webster for 11 before tea was just about unplayable, deviating away and clipping the top of the off bail.\n\nHe should have had a second wicket in the same over he dismissed Konstas, finding the edge of Green's bat only to see debutant Brandon King shell a simple chance at gully.\n\nJoseph tormented Green, beating his edge repeatedly, the West Australian guilty of playing way outside his body with the hard hands that cost him against South Africa at Lord's.\n\nDespite seeing Khawaja dropped by his skipper at first slip during that spell, Joseph didn't let his head drop, finding the edge of Green's bat again to end his erratic stay, Justin Greaves taking a brilliant low catch at second slip.\n\nThe manner of the Australians' dismissals should give rise to some concerns about their suitability of batting at the top of the order against anything close to resembling a moving ball.\n\nJayden Seales took five wickets as Australia imploded on day one in Barbados. (AP Photo: Ricardo Mazalan)\n\nOn a pitch that was clearly not as placid as had been advertised, all of Australia's top three were guilty of playing a long way from their bodies, inviting the edges that eventually cost Konstas and Green their wickets.\n\nKonstas was trapped on the crease, non-existent footwork again his weakness, while Green was too desperate to get bat on ball, pushing his hands way outside the line and paid the price as a result.\n\nInglis had looked relatively comfortable while he was at the crease but a lack of patience saw him swing wildly at a short delivery that he skied, Shai Hope taking a simple catch.\n\nAustralia hadn't scored a single boundary inside the opening 15 overs, trapped inside a cage of doubt built by a muddled selection strategy and reinforced by the failures of the top order.\n\nAs is so often the case, it took Travis Head to come in and change the narrative with yet another magnificent 53.\n\nTravis Head led Australia's recovery before lunch. (AP Photo: Ricardo Mazalan)\n\nAs is his wont, Head dropped to one knee and slapped a wide delivery through the covers with a conviction that had been entirely lacking from the Aussie batters before him for his first runs off just the fifth delivery he faced.\n\nThat, the first boundary of the innings, came off the 96th ball of the match.\n\nHead's masterful application of controlled aggression, cutting and scything anything wide of the stumps seemed to offer the necessary reset to Khawaja, who launched Alzarri Joseph over square leg for a massive six just three balls after Australia broke its boundary duck.\n\nIn all, Australia scored five boundaries in the next 16 balls, the shackles finally released by the old stagers.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nKhawaja was far from his vintage best, his cagey footwork and instability in the shot lending itself to some muddled decisions and a host of false shots he was fortunate did not result in him losing his wicket long before he eventually departed for 47 — especially as he was dropped on 45.\n\nHis 128-ball stay was exactly what Australia needed, but you'd be hard pushed to say it was all plain sailing, and reflects an increasingly worrying trend.\n\nThe 38-year-old has scored just two centuries in his last 42 innings — although to be fair one of those was a massive double in Galle earlier this year.\n\nThe progression is only trending one way now, sadly.\n\nHead though, was exceptional. Again.\n\nLast time he played the West Indies he got a king pair for the first and only time in his Test career, the start of a rare slump when he scored just 80 runs in seven innings.\n\nThere was a degree of luck in his extended stay, the South Australian surviving a fearsome barrage from Shamar Joseph shortly before tea and only avoiding being given out for 53 by a charitable decision by third umpire Adrian Holdstock.\n\nIt was a good job that Head's luck held though, because outside him it was slim pickings from a batting perspective.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/miley-cyrus-something-beautiful/105458008",
    "title": "Miley Cyrus can't tour anymore. Does this cinema spectacular make up for it?",
    "publish_date": "Wed, 25 Jun 2025 22:49:41 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Miley Cyrus has one of the best voices in contemporary pop. And in 2023, she showed it off with signature, inescapable hit 'Flowers', a break-up survival anthem perfectly suited to her voice's lived-in smokiness.\n\nFast Facts about Miley Cyrus: Something Beautiful What: Miley Cyrus's \"pop opera\" visual album for her excellent ninth release. Starring: Miley Cyrus Directed by: Miley Cyrus, Jacob Bixenham, Brendan Walter Where: In cinemas June 27, one night only Likely to make you feel: Like the term \"pop opera\" is a stretch\n\nBut the reason for that wonderful texture and grit is also why the former Disney star isn't taking a victory lap tour of her 9th album, Something Beautiful, released this June to some of the most glowing reviews of her career.\n\nThe 32-year-old has Reinke's edema, a swelling of her vocal cords that has given her a large polyp, producing the gritty texture to her voice. Surgery could ruin her voice entirely.\n\nAs she recently told Apple Music interviewer Zane Lowe, the condition most affects performing, making it \"like running a marathon with ankle weights on\", which is why her last global tour was more than a decade ago.\n\nInstead of touring, Cyrus has created a cinema-exclusive (for now) \"pop opera\" and visual album for Something Beautiful, screening for one night only across Australia this Friday.\n\nShe describes the hour-long film as a conceptual album about healing, telling Harper's Bazaar it was like Pink Floyd's The Wall \"but with a better wardrobe and more glamorous, and filled with pop culture\".\n\nMoving on from Hannah\n\nA large-scale statement like a visual album offers an interesting artistic opportunity for Cyrus, a fascinating figure who hasn't necessarily found a creative through line to match her natural charisma, perhaps more concerned with wrestling off her Disney star beginnings as Hannah Montana.\n\nThe album Something Beautiful was described by Variety as \"equal parts thrilling and challenging\". (Supplied: Photo by Glen Luchford)\n\nFifteen years on from hanging up Hannah's golden wig, Cyrus has certainly created distance, most pointedly with the boisterous, hyper-sexual R&B rebellion of 2013's Bangerz, which generated plenty of controversy.\n\nIn recent years, she's largely settled on a series of more mature pop albums tinged with different genres, including country (2017's Younger Now), glam rock (2020's Plastic Hearts) and light synth-pop (2023's Endless Summer Vacation).\n\nSonically, Something Beautiful is a coalescence of those recent albums — a mixture of prog-rock, soul, jazz, disco and R&B united by a grand air and a timeless feel, with lots of belting and big, cinematic sounds.\n\nIt's everything a pop album should offer, with break-up ballads ('More To Lose'), love songs ('End of the World'), empowerment anthems ('Walk of Fame') and campy disco diva moments ('Every Girl You've Ever Loved', featuring spoken word from Naomi Campbell).\n\nThe healing concept doesn't exactly come through the music, though — unlike Lady Gaga's similarly themed 2020 album Chromatica, there's no clear lyrical through line or leitmotifs. This has led fans — and critics — to assume that the visuals, arriving weeks after the album, would tie things together.\n\n\"The film is my way of touring,\" Cyrus told Apple Music. \"You get a feel like you're a part of a performance, but I don't have to tax myself in that way.\" (Supplied: Trafalgar Releasing)\n\nUnfortunately, there's next to no narrative to Something Beautiful, an hour-long set of music videos that neither hone nor expand the album's world in the way that \"visual album\" has come to signify after Beyoncé changed the game with that digital drop.\n\nSomething Beautiful — and not much else\n\nDirected by Cyrus with longtime collaborators Jacob Bixenman and Brendan Walter, the film starts strong but sidesteps much depth.\n\nRunning through the album in order, it opens with a series of ethereal shots set to Prelude, where Cyrus approximates Laurie Anderson's spoken word (\"Aching to be seen/Aching to become real\") over glitching synths.\n\nWe see a flower twisting, shadows and smoke, close-ups of Cyrus's body enclosed in crystal strands like a spider web as she wears the archival Thierry Mugler look from the album cover. Eerie, creepy, interesting.\n\nLoading Instagram content\n\nIt leads into the title track music video already available online, where Cyrus performs with a band on a smoky sound stage while in a custom feathery green snood by Mugler. Any sense of old-school, jazzy glamour is disrupted by the dual explosion of set lights and prog-rock in its chorus.\n\nThe premise of pristine beauty is muddied in favour of something grittier, more dangerous by these videos — an idea quickly abandoned. Instead, for most of Something Beautiful, we see Cyrus strut, lip-sync and play showgirl on various sound stages, donning extravagant archival looks by Mugler, as well as Bob Mackie and Jean Paul Gaultier.\n\nHalfway-point track 'Easy Lover' sees Cyrus walk through the Paramount lot between sets in a tracking shot, highlighting the artificiality of what we see as she moves from make-up to an elaborate set with dancers, always performing for us.\n\nThere's a charm to sitting with these songs and letting them wash over us, but Something Beautiful lacks the imagination to add much beyond pretty visuals, seeming more like the interstitial videos between numbers at a concert than a stand-in for a concert itself.\n\nWhile that might be expecting too much, the film debuted at Tribeca and is being touted as a cinematic event, but the closest Something Beautiful gets to The Wall is a creative block.\n\nHarrison Ford convinced Cyrus not to hold intimate performances in forests and other remote places. (Supplied: Photo by Glen Luchford)\n\nIt's a missed opportunity, whether limited by budget constraints or a lack of imagination.\n\nCompare it to Jennifer Lopez's completely over-the-top visual album from last year, This Is Me: Now… A Love Story, which was self-funded for $US20 million. A meta-narrative about Lopez and Ben Affleck's tumultuous love affair, it's also a convoluted sci-fi narrative featuring endless celebrity cameos and a steampunk heart factory at risk of explosion.\n\nCyrus didn't need to go full Lopez (nor should she), but at least This Is Me was ambitious, guided by a frenetic sense that Lopez needed to express whatever that film was.\n\nWithout that drive, Something Beautiful lacks energy: even if it is visually beautiful, anyone but devout fans will find themselves wishing for something more.\n\nMiley Cyrus: Something Beautiful is in cinemas for one night only on Friday June 27.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/neighbour-centre-cunnamulla-gives-teenagers-place-to-go/105442222",
    "title": "After lacking somewhere safe growing up, youth worker creates a space for kids",
    "publish_date": "Wed, 25 Jun 2025 22:42:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Queensland town of Cunnamulla is a peaceful place but the nearest big town is two hours away by road and after-school activities are limited.\n\n\"A lot of people in town, a lot of kids, they don't have anything to do outside of school,\" youth support officer Jarib Branfield-Bradshaw said.\n\n\"There's not much sport or anything like that to take their mind off what is actually going on at home.\"\n\nCunnamulla has a population of 1,200 and its location means activities for young people are limited. (ABC Western Qld: Grace Nakamura)\n\nCunnamulla has a population of about 1,200 people and 44 per cent are Indigenous, according to the Australian Bureau of Statistics.\n\nMr Branfield-Bradshaw, a 21-year-old Guwamu/Kooma man, grew up in the town.\n\n\"I didn't have somewhere safe … I didn't have that growing up,\" he said.\n\nJarib lets the kids use his own PlayStation. (ABC Western Qld: Hannah Walsh)\n\nShortly after starting in his youth support role with Paroo Shire Council in 2023, Mr Branfield-Bradshaw noticed many young people were looking for direction after school.\n\nBut he saw potential in an empty council building that was previously a student hostel and after pitching the idea to council the neighbourhood centre was running within a month.\n\nIt didn't take long to get the former hostel up and running after Jarib's suggestion. (ABC Western Qld: Hannah Walsh)\n\n\"I went to the school and spoke to the young people to see what they actually wanted, not just what we wanted for them,\" Mr Branfield-Bradshaw said.\n\n\" The ideas that came back from them was a safe space, somewhere they can have safe chats, have food, be entertained. \"\n\nThe teenagers enjoy playing games such as Uno. (ABC Western Qld: Hannah Walsh)\n\nSomeone to talk to, something to do\n\nAbout 10 to 20 kids attend the centre every weekday and Mr Branfield-Bradshaw has designed a program to meet their needs.\n\nThere's chatter and laughter as the teens play cards, video games and table tennis and the Vegemite jar in the kitchen is almost empty.\n\n\"It's really chill and there's lots of good food here,\" 15-year-old Mikeala Brown said.\n\nSome of the kids had little to do but to ride their bikes around town before the centre opened.\n\nIsaac Hatchman and Mikeala Brown enjoy the company, food and activities on offer at the centre. (ABC Western Qld: Grace Nakamura)\n\n\"I started coming here because you have someone to talk to and something to do,\" 16-year-old Isaac Hatchman said.\n\nMr Branfield-Bradshaw says he tries to give the young people lessons they can carry into adulthood.\n\n\"We teach life skills, how to make food, how to clean up after yourself, no play-fighting,\" he said.\n\nJarib says the job does not feel like work. (ABC Western Qld: Hannah Walsh)\n\nMr Branfield-Bradshaw knows from his own experience that growing up in the bush can be hard.\n\n\"It's good because you learn a lot of skills that you don't learn in the city — you learn how to be resilient and to be strong … but you don't have the some of the facilities that everyone else has,\" he said.\n\nOver the last year, the centre – which is open after school until 5pm from Monday to Thursday and until 9pm on Fridays – has welcomed more than 200 young people through the door.\n\nPolice praise for 'phenomenal' work\n\nCunnamulla Police Senior Sergeant Rob Hanbridge said Mr Branfield-Bradshaw's work was \"phenomenal\".\n\n\"It's given the youth of Cunnamulla somewhere else they can go after school … that is not going to get them into any trouble or wandering around the streets,\" Senior Sergeant Hanbridge said.\n\nThe centre stays is open until 8pm during the school holidays. (ABC Western Qld: Hannah Walsh)\n\nMr Branfield-Bradshaw attributed the program's success to the active involvement of the town's youth, who had made clear what they wanted in their community.\n\n\"Being able to provide that for the young people is the biggest service that I can do,\" he said.\n\n\"It's not just a space for them … it's their space.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/wallabies-british-and-irish-lions-fiji-test/105462116",
    "title": "Wallabies not dwelling on World Cup loss to Fiji ahead of Lions series warm-up",
    "publish_date": "Wed, 25 Jun 2025 22:28:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Wallabies insist they bear no scars from their last Test against Fiji as they continue preparations for the upcoming British and Irish Lions series.\n\nA one-off Test against the island nation in Newcastle on July 6 will be the Wallabies' sole hit-out before facing the Lions in the series opener in Brisbane.\n\nABC Sport will have live blog coverage of the British and Irish Lions' tour of Australia this July and August.\n\nIn their last clash at the 2023 Rugby World Cup, the Fijians effectively derailed Australia's campaign in their pool match, recording their first win since 1954.\n\nBen Donaldson is one of 10 players left in the Wallabies' squad that crashed 23-15 in Saint-Étienne.\n\nFly half Donaldson said the Wallabies had moved on from the defeat to Fiji.\n\n\"It wasn't a great day for us or Australian rugby, but that's in the past now, and we just look forward,\" Donaldson said from the Wallabies' training camp in Sydney.\n\n\"We haven't really talked about the past. It's just about what's coming day by day, getting better each day as an individual and as a team as well.\n\nWallabies name squad to face Fiji, ahead of British and Irish Lions Test series Photo shows James O'Connor of the Wallabies kicks in a rugby Test match Wallabies coach Joe Schmidt announces a 36-player squad for Australia's Test match against Fiji.\n\n\"It's been two years now … a lot of boys have had a lot of growth since then and played superbly in Super Rugby and had Test match experience, we're full of confidence and we back everyone here in the squad.\"\n\nDonaldson is in a three-way battle to wear the Wallabies' number 10 jersey in the opening Lions Test on July 19.\n\nThe Western Force playmaker is up against the Queensland Reds' Tom Lynagh and ACT Brumbies incumbent Noah Lolesio.\n\n\"This week's been pretty tough, and there's been some high expectations already from the coaches,\" Donaldson said.\n\n\"Obviously, people always say there's great competition for spots in this squad, and that's the only way you get better.\n\n\"For us, it's just about working hard, knuckling down, getting over our knowledge, and really driving this team around.\n\n\"We can't use the excuse that we're young anymore because we've been here for a fair few years, so really trying to have that voice in the squad.\"\n\nDonaldson will get his first look at the Lions after being called up to the Force squad for Saturday evening's tour match in Perth.\n\nHe was to sit out the match, but has been named to replace the injured Kurtley Beale.\n\nThe Lions lost 28-24 to Argentina in Dublin last Saturday AEST before departing for Australia.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/wa-dairy-mundella-administration-workers-claim-super-missing/105443940",
    "title": "Mundella workers, suppliers owed thousands as administrators take over",
    "publish_date": "Wed, 25 Jun 2025 22:13:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "It took just 18 months for two well-known dairy companies in southern Western Australia to come crashing down into administration after a local family took them over from Chinese ownership.\n\nWhen lead proprietor Hayden Russell took over Mundella Foods and Margaret River Dairy Co it was hailed as a coup for the parochial WA dairy industry.\n\nHowever, some of the employees are now claiming they are missing thousands of dollars in superannuation.\n\nMr Russell reportedly said the financial issues arose due to \"short milk supply\".\n\nSuppliers and employees have told the ABC there was deeper dysfunction at play.\n\nFormer and current staff describe a \"toxic\" workplace, \"cutting corners\", and delays or failure to pay some bills and staff superannuation.\n\nThe environmental regulator is also investigating Mundella Foods amid reports of alleged dumping of wastewater containing commercial cleaning chemicals at Mundella's yoghurt factory.\n\nThe ABC has repeatedly attempted to contact Mr Russell for comment and was told via text that it was \"business as usual\".\n\nThe Department of Water and Environmental Regulation is investigating Mundella Foods' operations. (ABC South West WA: Jon Daly)\n\n'Dairy done better'\n\nMr Russell's ambitions in WA's micro-dairy sector began in 2022 when he purchased The Cheeky Cow Dairy, branding the company as \"wanting dairy done differently, dairy done better\".\n\nIn late 2023, the Busselton dairy farmer expanded by purchasing yoghurt producer, Mundella Foods, and Margaret River Dairy Co. from Chinese food giant, Bright Foods Group.\n\nDamien Maring worked as a pasteuriser at Mundella's yoghurt factory at Mundijong, on the outskirts of Perth, from 2022 before quitting in 2024.\n\n\"When Hayden took over, he changed everything,\" he said.\n\nMr Maring said the factory began to experience regular interruptions to production.\n\nThe ABC understands the yoghurt factory is being investigated following reports wastewater was dumped in a paddock. (Supplied)\n\n\"I had to stop making things in the morning because they had run out of buckets, run out of tubs, run out of labels because they just hadn't been ordered,\" he said.\n\nThe Department of Water and Environmental Regulations has told the ABC it is actively investigating Mundella Foods.\n\nThe ABC understands the regulator's investigation was in response to reports of alleged dumping of wastewater contaminated with commercial cleaning chemicals used to disinfect pasteurising equipment.\n\nA photo provided to the ABC appears to show water, said to be the alleged wastewater, being released in a nearby paddock.\n\nUnpaid bills and super\n\nAlong with the \"toxic\" workplace culture, several staff have said they were still owed superannuation.\n\n\"[Mr Russell] said at the start that he wanted it to be like a family, and I don't know what kind of family he was raised in, because this was a pretty s**t one,\" Mr Maring said.\n\nMr Maring said he was still owed about $2,500 in superannuation, which was yet to be paid by the company in the 2024-'25 financial year.\n\nFormer maintenance technician Christopher Hobson claims he is also missing about $5,000 in superannuation from Mundella Foods.\n\n\"I've emailed them maybe three or four times since I left, and now I've proceeded to the ATO to follow up,\" he said.\n\n\"I don't think people go to work to not get paid super.\"\n\nMr Hobson worked at the yoghurt factory from June until his resignation in November last year.\n\nHe said it was the \"worst\" workplace culture he had experienced.\n\n\"I could see something coming,\" Mr Hobson said.\n\n\"I didn't think it would actually last this long.\"\n\nThe Australian Taxation Office told the ABC it was unable to comment due to obligations under taxpayer confidentiality laws.\n\nThe administrators of the dairy companies are still operating the business and fulfilling orders. (ABC South West WA: Jon Daly)\n\nAdministrators assess situation\n\nAdministrator of the dairy companies, Mackay Goodwin, is still keeping the business operational.\n\nThe administration is yet to confirm the number of creditors or how much they are owed.\n\n\"The administrators are still receiving claims and, importantly, assessing the direction of the business,\" a Mackay Goodwin spokesperson said in a statement.\n\n\"It would be difficult to state certain figures in isolation and out of context [due to commercial sensitivities].\"\n\nSuppliers claim previous, repeated attempts to contact Mr Russell and management about outstanding bills had been met with silence.\n\nRedgate Contracting owner Mick Kelly is among those who say they are still owed money.\n\nHayden Russell bought Margaret River Dairy Co. and Mundella Foods early last year. (Supplied: Kira Price)\n\nMr Kelly said he was still owed about $40,000 for a range of services carried out at Mr Russell's dairy farm in Busselton early last year.\n\n\"I've tried ringing him, got text messages that I've texted him, rang his bookkeeper,\" Mr Kelly said.\n\n\"That was probably six months ago and nothing.\"\n\nThe deteriorating situation at Mundella Foods has saddened employees, who say they had taken pride in building a beloved dairy brand, originally established in 1974.\n\n\"I hate that,\" Mr Maring said.\n\n\"It was the best place ever.\"\n\nThe administrator said it was obligated to \"gather and investigate\" claims of unpaid bills and superannuation, and would report back to creditors in several weeks.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/five-quick-hits-west-indies-australia-day-one/105455408",
    "title": "Five quick hits: Trav's controversial lucky break and Shamar shines again",
    "publish_date": "Wed, 25 Jun 2025 21:56:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Travis Head gets a life, Usman Khawaja leads a charmed existence and Shamar Joseph rips through Australia once again, with the Aussies dismissed for 180 before taking 4-57 in the West Indies's first innings.\n\nHere are five quick hits from day one of Australia's first Test in the West Indies in a decade.\n\n1. Head's contentious non-dismissal\n\nThe home fans were in no doubt.\n\nNeither was Shamar Joseph.\n\nWicketkeeper Shai Hope was not certain though, looking to square leg umpire Nitin Menon with a question on his face as to whether the ball, bottom-edged by Travis Head, had carried into his gloves behind the stumps.\n\nIt turns out, third umpire Adrian Holdstock wasn't entirely sure either.\n\nThe South African said there was \"no clear evidence,\" to give Head out, despite footage appearing to show a slither of material between the ball and turf.\n\nThe \"NOT OUT\" sign on the big screen was greeted with relieved cheers from the Aussies and bemusement from the home supporters.\n\nJoseph could only laugh, incredulous along with the majority of the crowd who felt their man had been robbed of a fifth wicket of the innings.\n\nHead was on 53 at the time.\n\n2. Joseph rips through Aussies again\n\nJoseph wreaked havoc with the new ball on day one in Bridgetown. (AP: Ricardo Mazalan)\n\nHe was the architect of that famous Gabba victory in 2024, and once again, Joseph was all over Australia on day one at Kensington Oval.\n\nHis first job was to ensure Sam Konstas's return to the Test match crease was a short one.\n\nThere were no sparkles or scoops in the 19-year-old's nervous three from 14 deliveries, which was over when he was caught plumb in front by an excellent Joseph delivery in the fourth over.\n\nAfter dismissing Konstas, the skiddy right arm pacer could have had both Cameron Green and Usman Khawaja in consecutive overs had it not been for some poor catching from his teammates.\n\nHowever, Green never looked comfortable against Joseph, and he was eventually dismissed for an indecisive three from 21 balls.\n\nJosh Inglis — the third new face in Australia's new look top four — didn't fair any better.\n\nJoseph bowled a near perfect delivery to dismiss Beau Webster. (AP: Ricardo Mazalan)\n\nHe was out for five after horribly mistiming one off Jayden Seales.\n\nBut Joseph's finest moment came midway through the second session.\n\nBeau Webster played back to a good length ball that gathered pace and moved away from him off the pitch. The big Tasmanian's bat got nowhere near it and the ball kissed the top of off.\n\nThe perfect ball to cap a near-perfect day of bowling.\n\n3. Butter fingers in Barbados\n\nAs bad as things were for Australia in the opening hour, it could have been worse.\n\nGreen may have only made three runs, but he was dropped on zero by debutant Brandon King at gully.\n\nKhawaja's recovery effort with Head was vital, but the veteran, too, should have been back in the sheds in that first session, dropped on six by Roston Chase at first slip.\n\nBoth chances came off the bowling of Joseph.\n\nIt would be charitable to say that both catches were easy. It's far more accurate to say they were absolute sitters.\n\nKhawaja was later dropped on 45 too, this time off the bowling of Jayden Seales but by King again at gully, the Jamaican's dream debut turning desperately sour.\n\n4. Khawaja's charmed life\n\nUsman Khawaja was far from fluent in his 47. (AP: Ricardo Mazalan)\n\nSometimes, it's just your day.\n\nAfter being put down, Khawaja continued to ride his luck for the entirety of his innings steadying knock.\n\nHe threaded an edge through the slips, built a catalogue of plays and misses and almost deflected one off his thigh pad onto the stumps.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nBut the most inexplicable moment of the lot came in the third over after lunch.\n\nTrying to work away a straight Justin Greaves delivery, Khawaja lost sight of the ball as it bobbled up off his pad and dropped at his feet.\n\nHe then proceeded to backheel the ball towards the stumps, before turning around and wildly swiping at it with his bat.\n\nHe missed the ball by some distance, and thankfully for Khawaja, just about missed his stumps as well.\n\nThe ball, almost forgotten in the melee, trickled harmlessly wide of the sticks.\n\nHowever, the 38-year-old wasn't able to make the most of his charmed existence, eventually being removed for 47 by the irrepressible Joseph.\n\n5. Starc strikes late on\n\nMitchell Starc took two wickets. (AP Photo: Ricardo Mazalan)\n\nAs he so often does, it was Mitchell Starc who delivered late on for Australia.\n\nBowled out for 180, the tourists desperately needed something in the final hour and a half of play.\n\nThe experienced Kraigg Braithwaite edged to a tumbling Webster at second slip to get the ball rolling, before he had John Campbell edging behind to Alex Carey.\n\nThat left the West Indies 2-16 and under pressure.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/matildas-clare-wheeler-joe-montemurro-slovenia/105462040",
    "title": "Matildas midfielder ruled out of Montemurro's debut against Slovenia",
    "publish_date": "Wed, 25 Jun 2025 21:53:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Everton midfielder Clare Wheeler has become the latest Matildas squad member to be ruled out of the current international window ahead of Joe Montemurro's debut as head coach.\n\nWheeler arrived in Perth earlier this week but on Wednesday withdrew from the squad due to personal reasons.\n\nABC Sport will be live blogging the Matildas' friendly against Slovenia on Thursday evening.\n\nChloe Berryhill and Jessika Nash have since been added to the Matildas squad.\n\nStriker Sam Kerr is in camp but still recovering from the ACL rupture she suffered more than 17 months ago.\n\nMary Fowler (knee) and Tameka Yallop (leg) are also out injured, while Steph Catley, Caitlin Foord, Katrina Gorry and Cortnee Vine are all on personal leave.\n\nMontemurro will get his first taste of life in the Matildas hot seat when he takes the reins for Thursday night's friendly with Slovenia in Perth.\n\nThe teams will lock horns again on Sunday, before the Matildas face Panama in Bunbury on July 5 and in Perth on July 8.\n\nThe four matches mark an important building block for Montemurro as he attempts to bed down a new game plan ahead of next year's Asian Cup in Australia, which begins on March 1.\n\nJoe Montemurro will debut as Matildas head coach against Slovenia. (AAP Photos: Dean Lewins)\n\nMontemurro enjoyed successful coaching stints at Arsenal, Juventus and Lyon.\n\nHe wants to implement an attacking, possession-based style at the Matildas, who have slipped to 15th on the world rankings.\n\n\"It's the official start of our build-up for the Asian Cup,\" Montemurro said on Wednesday.\n\n\"Yes, I am looking at a lot of players. Yes, I am trying to instil some language. Yes, I am trying to instil some new ideas.\n\n\"But the approach to the game is still the same … it's a game that we want to win.\"\n\nDefender Ellie Carpenter played under Montemurro at Lyon and was thrilled when he landed the top job at the Matildas.\n\n\"I think we're going to really thrive under Joe,\" Carpenter said.\n\n\"You can see already, by day three we've implemented a new style of play, a new rhythm.\n\n\"Joe's really experienced internationally. He's coached at the biggest clubs and I think the most important thing that he's implemented so far is possession-based football.\n\n\"I think we're very capable of doing that.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/asx-markets-business-live-news-jun-26-2025/105462026",
    "title": "Live: ASX falls, ACCC sues Australian Gas over 'greenwashing'",
    "publish_date": "Wed, 25 Jun 2025 21:45:38 +0000",
    "category": "finance",
    "authors": [
      "Samuel Yang"
    ],
    "text": "Reporting by chief business correspondent Ian Verrender\n\nIt has become one of the great mysteries of life.\n\nAlong with age old anomalies like, why does sour cream have a use-by date or, how does the snow plough man get to work, big professional investors are grappling with the incredible Commonwealth Bank conundrum.\n\nWhy is the Commonwealth the world’s most expensive bank? And why does the share price keep rising?\n\nThe big institutional investors are angry. And with good reason. For much of the past year, they’ve resisted buying more CBA shares because all their models are unanimous. As a stock, it’s horribly overvalued.\n\nBy refusing to jump aboard, many are now underperforming the market, which has largely been driven by the incredible run from CBA, now the biggest stock on the Australian Securities Exchange and leaving all others in the dust.\n\nWhile it’s off a touch this morning, it breached $180 a share in the past week and yesterday passed through $190, as it canters towards a double ton.\n\nThe gains have been spectacular. It’s added 55 per cent in the past year and more than 30 per cent since mid-March. Retail investors, ordinary punters, love it and appear to be the biggest cohort of buyers.\n\nCBA appears to be in the happy position of doing well when markets turn sour and doing well when markets are running hot.\n\nIt’s been identified as a safe haven by foreign investors looking to lighten their exposure to Wall Street, especially with the US dollar in decline. That’s because it isn’t exposed to Trump’s tariff war or the China trade.\n\nAnd when markets are going up, it does too.\n\nNo-one is happier than CBA boss Matt Comyn who is on track to haul in a massive bonus this year given CBA’s outperformance. On some estimates, he could be in line for a $40 million payday.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/up-to-four-inmates-crammed-into-one-cell-in-wa-prisons/105461438",
    "title": "Up to four inmates being crammed into a cell in WA prisons",
    "publish_date": "Wed, 25 Jun 2025 21:40:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's jails are so overcrowded that as many as four prisoners have been left crammed into one cell hundreds of times in the past two months.\n\nThe scale of the problem has been laid bare in figures presented to parliament, which showed the state reached a record-high prison population in early June, with 8,545 people behind bars, easing only slightly in the weeks since.\n\nThe crisis has been brewing for months, with dozens of inmates forced to sleep on mattresses on the floor in conditions where three prisoners were crammed into cells in October last year.\n\nAnswers to questions from WA Greens leader Brad Pettitt in parliament last night showed the problem has only worsened since then.\n\nBed shortages force prisoners to sleep on floors Photo shows Barbed wire and a high fence pictured against a sunset Overcrowding forces dozens of prisoners at two of Perth's largest jails to sleep on mattresses on the floor in \"Dickensian\" conditions.\n\nMedium-security Acacia Prison had the highest number of prisoners who had been in cells with a total of four people in them, at 65 inmates between the start of the month and Monday.\n\nBut the problem appears worst in regional WA with Broome (59), Bunbury (43) and West Kimberley (41) prisons also reporting high numbers of inmates sleeping in cells with three others.\n\nThe state's two largest prisons had the highest number of inmates who had been in cells with three people sleeping in them — Hakea with 644 and Casuarina with 380 over the same period.\n\nThere are hundreds of inmates in Hakea crowded into a room with three total occupants. (Supplied: Office of the Inspector of Custodial Services)\n\nIn February, the Inspector of Custodial Services described conditions in Hakea as \"substandard and inhumane\", in part because of overcrowding.\n\nThe Justice Department said it had implemented \"a range of strategies\" to address \"short-term pressures caused by increased remand numbers\".\n\n\"These arrangements are carefully managed in line with operational risk assessments and individual welfare considerations,\" a spokesperson said.\n\n\"The department continues to monitor population trends as part of its long-term custodial infrastructure plan.\"\n\nPerth maximum security prison 'under great strain', report says Photo shows An aerial shot of the grounds of Hakea Prison WA's prisons watchdog puts the government on notice over the \"bleak\" situation inside Hakea Prison, which is buckling under overcrowded conditions.\n\nThe Justice Department told the ABC there had been 18 deaths in custody in the last year.\n\nDr Pettitt said the situation had reached crisis levels.\n\n\"The overcrowding in our prisons is jeopardising the safety of prison staff and prisoners, whilst undermining rehabilitation efforts and programs,\" he said.\n\n\"It should be a wake-up call and an opportunity for government to focus more strongly on preventative and rehabilitative programs, otherwise they will need to spend billions on more prisons.\"\n\nImprisonment rate due to FDV\n\nData from the Australian Bureau of Statistics suggests pressures on WA's prisons are not a new phenomenon.\n\nThose figures show WA's imprisonment rate, which was already the second highest in the country, increasing by 18 per cent between 2022 and earlier this year — more than three times the national average.\n\nThe government is allocating millions of dollars towards prisons like Casuarina. (ABC News: Jake Sturmer)\n\n\"One factor is an increase in the number of people charged with family and domestic violence offences,\" a Justice Department spokesperson said.\n\n\"This is a result of new FDV-related laws, a shift in community attitudes and increased confidence among victims to report offending.\"\n\nFormer inmate calls for change Photo shows A man with black hair and a long black beard in a shirt with glasses stands in front of buildings The death of a friend in jail by suicide prompted former inmate Kelvin Whitwell to become a counsellor on the outside. He wants reform to WA's prison system.\n\nBudget papers describe it as \"unprecedented growth\", with the department hoping to add more than 100 beds through \"internal expansions of prisons\".\n\n\"The government has also allocated $4.7 million towards custodial infrastructure planning for the delivery of a new long-term custodial infrastructure plan, and to commence planning to expand Acacia Prison and Casuarina Prison,\" it notes.\n\nHilde Tubex, director of criminology at the University of Western Australia's law school, said those high rates of imprisonment were a result of WA being \"quite a punitive state\".\n\nBut she warned building more and bigger prisons was not the solution.\n\n\"We believe that punishing people and putting people in prison, that that will make the society safer,\" she said.\n\n\"There's actually a lot of evidence to prove to us that that is not the case, that imprisonment is very expensive and that it's not very effective, as about 60 per cent of the people in prison have been in prison before.\n\nCriminology professor Hilde Tubex is highlighting the high cost of incarceration. (Supplied: UWA)\n\n\"We know that if we leave people in the community and give them support and therapy to do something about their problems and just the basics like a job, a safe place to go to in the evening, that they do a lot better and that that's a lot cheaper.\"\n\nFor Professor Tubex, the fact a high proportion of the prison population is on remand — meaning they have not been sentenced — is a big concern.\n\n\"They don't have access to any programs at all, we just warehouse them for a time at a very high cost, and then we release them,\" she said.\n\nJustice reinvestment highlighted\n\nDr Pettitt said overcrowding and poor treatment of prisoners were choices of government.\n\nWA Greens leader Brad Pettitt wants to see more investment to keep people out of prison. (ABC News: Keane Bourke)\n\n\"We could choose to do something different and actually do that justice reinvestment that actually gets in front, keeps people out of prison, invests in young people, invests in communities,\" he said.\n\n\"That actually can see that over the long term, our prison population decline.\n\n\"And unfortunately, we're not seeing that.\n\n\"We're instead just seeing this doubling down on harder policing and building more prisons, and that comes at a huge cost to the community, to the taxpayer, but ultimately to all of us — because we're not actually dealing with the fundamentals around stopping people committing crimes.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-06-26/nsw-state-budget-broken-hill-high-school-rebuild-funding-/105458546",
    "title": "Mouldy Broken Hill high school rebuild closer after state budget",
    "publish_date": "Wed, 25 Jun 2025 21:37:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "The New South Wales government has reaffirmed its plan for a state-of-the-art secondary school in the state's far west, allocating more than $55 million towards the project in the latest state budget.\n\nBroken Hill's Willyama High School has been closed for more than 18 months due to a significant mould outbreak, with the state government marking it for demolition and rebuild.\n\nMould ridden high school in Broken hill to be torn down Photo shows A ceiling inside a classroom with mould growth. A public high school in Broken Hill will be torn down and completely rebuilt after a severe mould infestation.\n\nConstruction crews and equipment are now on site and demolition is expected to begin soon but, until recently, the rebuild plans have been contentious.\n\nRedesign 'bigger and better'\n\nA Willyama P&C group formed this year led several local concerns, including inadequate classroom layouts and limited learning resources.\n\nBut president Kirby Allen, whose son will start year 7 at Willyama next year, said these issues seemed to have been addressed in a redesign released to the community last week.\n\n\"In comparison to what was shown in March, it's bigger [and] laid out a lot better,\" Ms Allen said.\n\n\"It was very evident that the feedback has been taken on board. Everyone's happy it's going in the right direction.\"\n\nThe school has been quarantined for more than a year and a half due to toxic mould within its walls. (ABC News: Oliver Brown)\n\nThe formal consultation process for the new school design is believed to be finished and the rebuild is likely to be put out to tender in the coming weeks.\n\nFormal budget allocated\n\nThe government plans to begin construction early next year and have the school open to more than 730 students by early 2027.\n\nWhile the rebuild has been more than a year in the making the government has now allocated $56.4 million of the 2025-'26 state budget to it.\n\nAn impression of the proposed state-of-the-art Willyama High School. (Supplied: School Infrastructure NSW)\n\nBarwon MP Roy Butler said this would not cover the whole build, but it was government practice to stagger funding for major infrastructure projects.\n\n\"Probably eight-to-10 months ago we knew it was a $90 million build, but you can't build these things instantly,\" Mr Butler said.\n\n\"I think by the time we actually finish it, you're probably looking at $100 million to build that school.\"\n\nThe Department of Education's Peter Macbeth said community safety has been paramount throughout the process. (Supplied: Peter Macbeth)\n\nThe Department of Education's Far West Director of Educational Leadership, Peter Macbeth, said he looked forward to working with the community on a school everyone could be proud of.\n\n\"It's a really exciting and incredible thing for the community and it's gaining lots of positive momentum,\" Mr Macbeth said.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/agnes-bakery-successor-unveiled-in-new-farm-20250626-p5mahl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Agnes Bakery successor unveiled in New Farm",
    "publish_date": "Thu, 26 Jun 2025 12:05:30 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Agnes Bakery successor unveiled in New Farm Regulars can expect all the fire-licked breads and pastries they’ve become accustomed to queueing for, but also a full-service cafe menu featuring elevated brunch items. Matt Shea June 26, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOn a Sunday earlier this month, Ben Williamson and Tyron Simon sat on a patch of grass and looked across James Street. It was Agnes Bakery’s final day of trade. “I brought the kids and the family and the dogs down, and then Ty came down and we got a couple of pastries and a coffee and sat and just looked at it,” Williamson says. Idle opened on Merthyr Road last weekend. Markus Ravik Until that moment, the celebrated chef hadn’t considered what the closure of Agnes Bakery meant to him and what came to be known as Anyday, the restaurant group he co-owns with Simon, Bianca Marchi and Frank Li.\n\nAdvertisement\n\n“We started talking about it and it all kind of hit me,” Williamson says, “‘Man, what a journey to get to this point.’ ” Related Article Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender Agnes Bakery started as a hail Mary – an unfettered dice roll in the face of a global pandemic. This was back in the final week of March in 2020 in the Spring Hill premises of Agnes the restaurant, which had been due to open the same week. Seemingly against the odds, it was a hit, with locked-down punters queueing around the block for woodfired bread and pastries (and perhaps a little human interaction outside of their own four walls). Unlike its predecessor, Agnes Bakery, Idle is a full-service cafe. Markus Ravik\n\nAdvertisement\n\nWhen lockdown restrictions eased and the group geared up to open Agnes as a restaurant, it made sense to move the bakery to its own space on the corner of James and Harcourt streets. There, it established itself as a local favourite, with the lines this time stretching down the hill towards The Calile hotel. In the meantime, Williamson, Simon, Li and Marchi had opened Bianca on Ada Lane, opposite The Calile, which became another roaring success, and then went on to formalise their identity as Anyday. Behind the counter, regulars will find all the breads and pastries they’ve become accustomed to queueing for at Agnes Bakery. Markus Ravik So the word “journey” feels appropriate. When Agnes Bakery wrapped at the end of that Sunday, the staff would begin the process of packing down and migrating over to Merthyr Road in New Farm to Idle, its full-service successor, which opened last weekend.\n\nAdvertisement\n\nWhich makes you wonder: why call time on this little bakery (or brand, perhaps) that could, which has come to mean so much to so many people, not least of all Williamson, Simon, Li and Marchi themselves? Harissa egg danish. Markus Ravik “It had sort of become its own thing anyway,” Williamson says. “Especially when Mitch [Suchowacki] came on board as head baker. It really started to evolve. “It was like this little sibling constantly living in the shadow of Agnes [the restaurant], which had become such a beast of its own that it didn’t make sense any more to keep them connected. So this was a great opportunity for us to give it its own identity.” If the closure of Agnes Bakery is the end of one chapter, Idle is the start of another.\n\nAdvertisement\n\nLater this year, Anyday will open a clutch of venues in the heritage-listed Coal Board Building in the guts of Brisbane’s CBD. It will be the group’s most ambitious project yet. Idle sourdough crumpets with creme fraiche and berry compote. Markus Ravik In that sense, Idle feels like something of a test run. When this masthead visits on a busy Tuesday morning, Williamson, Simon and Marchi are all there, overseeing service, and running food to the al fresco tables lined along Merthyr Road and up a brick-lined side lane. The tables are gathered around an indoor service area designed by Tamsin Johnson, best known locally for her work on Raes on Watego and the Sir boutique on James Street. She’s given the venue a light and bright treatment, with plenty of stainless-steel and custom terrazzo, the standout feature some Italian futurist light fittings. It feels sleek and modern without drifting into the austere.\n\nAdvertisement\n\nIdle features a design by in-demand Tamsin Johnson. Markus Ravik Idle serves everything regulars have become accustomed to at Agnes Bakery – fire-licked sourdough loaves, Basque cheesecakes, caneles, kouign-amanns and so on – but also a relatively expansive brunch menu designed by Williamson Suchowacki. There are your usual cafe go-tos given an Idle twist: sourdough crumpets with crème fraîche and a berry compote, porridge with white miso, cinnamon poached quince, coconut and walnut, and a bacon and fried egg roll with waffle fries and relish. “We started talking about it and it all kind of hit me: ‘Man, what a journey to get to this point.’ ” Idle co-owner Ben Williamson But there’s also more elevated dishes such as Baghdad eggs with a cumin burnt butter, smoked almond, a flaky flatbread and mint; a steamed spanner crab omelette with chilli, choron (a tomato-spiked béarnaise), salmon roe and toast; and a continental-style breakfast with ham, asiago, house-made butter, and a cucumber and fennel pickle, served with a baguette and soft-boiled egg.\n\nAdvertisement\n\nIt’s all about as thoughtful as you’d expect from Anyday, and from 11am, free-range charcoal chicken, fries, and daily salads and sandwiches are added to the mix. Beyond pastries and brunch, Idle stocks a bunch of pantry items on its back wall. Markus Ravik Idle serves specialty coffee by Single O, and shelving on the back wall stocks a bunch of pantry items including wine, house-made granola and condiments, and fancy Torres potato chips from Spain. Beyond its meaning for Anyday, Idle is a welcome addition in New Farm but also the city generally, where full-service cafe openings have become increasingly rare in the post-pandemic age. “We’ve had a lot of Agnes Bakery clientele coming down, but also a lot of locals, who are often people in their 50s and 60s,” Williamson says. “We thought it might be a challenge to get some of [them] across the line, but they’ve responded well. It’s been really great.”\n\nAdvertisement\n\nOpen Mon-Sun 7am-2pm. 84 Merthyr Road, New Farm, (07) 3062 2346. anyday.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/environment/climate-change/minns-criticised-council-s-gas-ban-as-an-overstep-developers-say-it-s-a-no-brainer-20250625-p5ma6p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Minns criticised council’s gas ban as an ‘overstep’. Developers say it’s a no-brainer",
    "publish_date": "Thu, 26 Jun 2025 11:55:21 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "Property developers and apartment owners have strongly backed in the City of Sydney’s ban on gas connections for new builds, contradicting the NSW premier who branded the policy as an “overstep”.\n\nThe City of Sydney has mandated that new residential developments will have to use electric cooktops, ovens and space heating from January 1, 2026, and be entirely gas free from the following year.\n\nApartment buildings under construction in Sydney. Credit: Bloomberg\n\nFive other NSW councils have already mandated electrification in new builds, though some have exceptions for hot water heaters. Lane Cove Council has fully banned the use of gas appliances in new builds from October 2023.\n\nFrankie Muskovic, national policy director for the Property Council of Australia, said targeting new builds made sense because the change was easier and more cost-effective than retrofitting existing buildings.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/traveller/inspiration/celebrity-solstice-first-ship-to-undergo-400m-upgrade-20250624-p5m9zz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Celebrity Solstice first ship to undergo $400m upgrade",
    "publish_date": "Thu, 26 Jun 2025 11:49:46 +1000",
    "category": "finance",
    "authors": [
      "Julietta Jameson"
    ],
    "text": "A lot of water has flowed under the Sydney Harbour Bridge since Celebrity Solstice took out the best cruise ship gong as voted by Australian travel agents in 2015.\n\nLaunched in 2008, Solstice is no longer the bellwether of ship trends in our seas, though she’s garnered 18 awards across her lifetime, had a big redo in 2016, and remains hugely popular with Australian cruisers. But the ship’s once groundbreaking features have been overshadowed by the bells and whistles of bigger, glitzier ships.\n\nThe ship’s Retreat Lounge.\n\nHowever, when she returns in 2026, Celebrity is confident fans will fall in love with her once more – not for any added gimmickry, more for the enhancement of the things she does best, like dining, relaxing and offering beautiful accommodation.\n\nCelebrity is investing almost $400 million to modernise its entire fleet of Solstice Class ships, with the flagship Celebrity Solstice the first to “be made new again” as the line puts it.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/nsw/this-sydney-landmark-is-crossed-16-000-times-a-day-it-s-about-to-get-a-60m-makeover-20250625-p5ma5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Sydney landmark is crossed 16,000 times a day. It’s about to get a $60m makeover",
    "publish_date": "Thu, 26 Jun 2025 11:42:56 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "It’s the linchpin that has connected Sydney’s city centre to the inner west for more than a century.\n\nBut the strain of old age, its watery location spanning Cockle Bay, and 6 million pedestrian and bike crossings a year have necessitated a multimillion-dollar upgrade for the historic Pyrmont Bridge, which will coincide with plans for more intensive development around the western harbour.\n\nPyrmont Bridge has long been a crucial connection between Sydney’s CBD and Pyrmont. Credit: Oscar Colman\n\nThe NSW government will spend $59.8 million over the next 10 years to refurbish the state heritage-listed bridge and maintain the structure as a critical active transport route in and out of the CBD.\n\nPlanning and Public Spaces Minister Paul Scully said the 123-year-old structure, which is one of the world’s oldest surviving electrically operated swing span bridges, desperately needed restoration.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/i-spent-an-evening-with-nick-kyrgios-it-was-bleaker-than-expected-20250626-p5maeo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "I spent an evening with Nick Kyrgios. It was bleaker than expected",
    "publish_date": "Thu, 26 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Thom Gibbs"
    ],
    "text": "Clearly this is at odds with many years of ugly tantrums, and indeed his own marketing as a maverick. “I just enjoy being a little s--- sometimes, I like causing mischief” he said, growing into the evening. But also: “I’ve never been this nervous for anything in my life. Playing in front of the Royal Box has nothing on this.” He claimed he had “four vodkas out the back” beforehand.\n\nKyrgios likes a drink. It runs through this show and came up in an interview with Louis Theroux earlier this year, when he said he used to indulge five or six nights a week with up to 30 drinks a night. He has also suffered with depression and self-harm. It sounds like there are some unresolved issues about tennis being foisted upon him by his family, who saw a less promising future in Kyrgios’s favoured sport of basketball.\n\nNick Kyrgios practising at the All England club on Thursday. Credit: Getty Images\n\nHe has said repeatedly he is far from in love with the sport which made his name and it is worth viewing his angry behaviour through this prism. Perhaps only golf is more fury-inducing for its competitors. Imagine playing all that tennis when you are not even sure you like it.\n\nThings turn south after the interval. When this tour was announced audiences were promised “a HUGE surprise guest for a candid, unscripted exchange”. In Wimbledon this was Daniel “Horse” Horsfall, Kyrgios’s manager, business partner and childhood friend. He is charismatic enough but his memories of teenage Pokemon sessions and knowledge of Kyrgios’s many fines is not enough to carry a show. There is an interactive quiz, as bad and momentum-killing an idea in a theatre as it is at a wedding reception.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/vale-the-back-page-a-rare-and-beautiful-exception-to-hunter-s-thompson-s-tv-dictum-20250625-p5ma4s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vale The Back Page, a rare and beautiful exception to Hunter S Thompson’s TV dictum",
    "publish_date": "Thu, 26 Jun 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "But there are many exceptions. One of them was The Back Page, the sports panel show which has finished up this week after a 29-year run. As one who was on it for its first decade and a bitty, I have been inundated with emails, texts and calls this week, from those lamenting its demise.\n\n“It is normally perceived as some kind of cruel and shallow money trench through the heart of the journalism industry, a long plastic hallway where thieves and pimps run free and good men die like dogs, for no good reason. Which is more or less true. For the most part, they are dirty little animals with huge brains and no pulse.”\n\nInevitably, many of the obits have focused on its latter years – which is fair enough because, to my amazement, it has been bloody successful for the last two decades, too, and really was a great show. With its latter-day incarnation hosted by Tony Squires and boasting panellists such as Crash Craddock, Adam Spencer and Candice Warner, the thing was still working and doing great box office.\n\nI have no clue why Fox Sports has cut it off at the knees, save the possibility its new owners, the British-based DAZN, intend to channel more foreign content to this small outpost on the other side of the planet at the expense of local content.\n\nThe Back Page team, Christmas drinks, circa 1998. Back row: Peter Frilingos, Keeley Devery, Billy Birmingham. Front row: Mike Gibson, Saul Shtein, Peter FitzSimons.\n\nBut I digress. For my obit, let me focus a little on the first decade, when The Back Page proved the antithesis of Thompson’s dictum. It was a terrific show because we all really liked each other, and were close friends well beyond whatever we put to air.\n\nThe show was the idea of the veteran sports producer Saul Shtein. Knowing that Mike Gibson, the iconic sports broadcaster from Wide World of Sports, would be at the Atlanta Olympics at the same time as me, Saul asked me to duchess him on the idea of the show, after Mike had politely rejected his first approach. Mike and I got together one day at the beach volleyball, when Australia had just got the gold medal, and I pitched again.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/flagg-flies-to-dallas-as-nba-s-no-1-pick-but-fixed-chants-rock-brooklyn-20250626-p5mai1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flagg flies to Dallas as NBA’s No.1 pick as heckler disrupts draft",
    "publish_date": "Thu, 26 Jun 2025 11:29:15 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "Cooper Flagg is on his way to the Dallas Mavericks as the No.1 pick of the NBA draft, being held in Brooklyn, New York on Thursday morning (AEST).\n\nThe Maine native and Duke University forward was a certainty to be the first pick after stellar season with Duke University in the US college basketball system, but some conspiracy theorists in the crowd had their say at the start of the event.\n\nCooper Flagg (right) shakes hands with NBA commissioner Adam Silver after being drafted first overall by the Dallas Mavericks. Credit: Getty Images\n\nA fan could be heard screaming “Dallas was fixed” just before NBA commissioner Adam Silver was walking on stage to open the draft.\n\nThere is an unfounded conspiracy theory among some fans that the Mavericks were awarded the top pick in the NBA draft lottery in return for the shock mid-season trade that resulted in Dallas sending superstar Luka Doncic to the LA Lakers in return for Anthony Davis.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/beautiful-community-of-nerds-the-fight-to-keep-a-beloved-radio-station-alive-20250616-p5m7rb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Beautiful community of nerds’: The fight to keep a beloved radio station alive",
    "publish_date": "Thu, 26 Jun 2025 11:26:52 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "According to its most recent annual report, between 2023 and 2024 FBi’s operating deficit jumped sixfold, from $41,000 to $276,000 on a $1.6 million budget. Sponsorship revenue fell by $184,000 in the same period. Between 2021 and 2024 station membership declined by 36 per cent. FBi president Angela Stengel pointed to investments in the station’s digital presence, as well as declining sponsorships and memberships to explain the jump in the deficit. Stengel says the fall in sponsorships was tied to economic pain being felt by “cultural organisations, hospitality, and other community-based groups”, which make up a “significant portion” of partners. The financial struggles faced by the station are not new. In 2009, FBi ran a campaign targeting Virgin Group billionaire Richard Branson, seeking a million-dollar donation to support the struggling station. The campaign resulted in an interview with Branson, in which host Alison Piotrowski requested the funds live on air. “We didn’t get the million from Branson, but we did live to fight on, and fight hard. I just hope FBi is able to do it again,” says Piotrowski, who went on to serve as Nine’s US correspondent, and is now a senior reporter for the network and presenter on Weekend Today*.\n\n“FBi gave me the opportunity to find my voice, but most importantly it gave me the space to make mistakes on air, to fail … and I became a better broadcaster as a result,” she says. “When I look around the industry today there are very few places that nurture young talent, give them communities and networks for their future careers, and provide on-the-job experience without a paid internship – which just isn’t realistic for most music and media companies.” Journalists Alison Piotrowski and Marc Fennell both got their start at FBi Radio. Credit: Instagram and SBS Another darling of the station’s alumni is globetrotting journalist and presenter of SBS’s Mastermind, Marc Fennell, who got his start at FBi as the station’s film critic. He said the station “utterly and completely changed” his life. “I was a 17-year-old who walked in the door with no skills, I didn’t know anybody that worked in media, music, culture … they genuinely taught me broadcasting from scratch,” says Fennell, who later met his wife at the station.\n\n“It’s an incredible place for creativity. You can come, there’s equipment there, you can play, you can create new things, you can try new things. I think having environments were people can play and find partnerships is really crucial. Without those spaces, we become much poorer as listeners, as a community, as a city.” Loading Fennell says in the 22 years FBi had been on the air, social media had fundamentally changed the way people start media careers. He says, however, the emphasis on teamwork and the focus on audience were crucial elements that were reinforced by training in the station environment. “In radio and television and publishing it’s extraordinarily rare to do anything by yourself. What you have to learn is how to work in teams and find your tribe. I work now with people that I met at FBi because of the creative partnerships we formed back then,” he says. “It doesn’t seem very obvious, but that’s actually a crucial component to what FBi offers. It creates creative partnerships that have now proliferated what people watch, what people read, what people listen to … if you take that away from Sydney, in particular, you end up with a very different-sounding media that I don’t think serves the audience.”\n\nNewly minted managing director Tyson Koh, who made a name for himself by leading the Keep Sydney Open movement during the city’s controversial lockout law period, has been tasked with keeping the station afloat – a job he says is both exciting and daunting. Exciting because of FBi’s cultural importance in Australia’s music scene; daunting because “the station is going through a tough time, and it’s been a struggle to get the message out”. Managing director Tyson Koh said it had been “a struggle to get the message out” on the station’s financial hardship. Credit: Sam Mooy “Whilst the station has been around for a long time, it relies on people’s financial support in order to stay on the air. Especially with a new generation of community radio listeners who might not be aware of the model that FBi operates under,” says Koh, who first volunteered for the station in 1999, before it had a broadcasting license. Koh says that FBi’s financial issues are reflective of a “wider struggle” creatives and art lovers are experiencing across the city.\n\n“People these days are overextended with their financial obligations, whether it’s rent or mortgages, but also the litany of subscriptions that we’re being funnelled towards on a daily basis. I think what I would like people to be aware of is that FBi isn’t a multinational tech company. It’s an organisation that has a very tangible effect on the cultural life in Sydney,” says Koh. Loading FBi was an early champion of Australian artists Flume, the Kid Laroi, Nina Las Vegas and Genesis Owusu, and there is concern among the station’s faithful that a weakening of the business may hurt upcoming talent. With ongoing costs such as rent, broadcasting fees and staffing expenses continuing to pinch FBi’s bottom line, Koh said that “nothing is off the table” in ensuring the station’s sustainability. “We’ve already had to make staff redundant, unfortunately, earlier in the year. So we’re doing the best that we can to tighten our belts … we do need to look at our revenue model and see what can be developed and what can be improved, and we’re doing all those things.”",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/jakara-anthony-completes-mind-boggling-season-20240321-p5fe4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jakara Anthony completes mind-boggling season",
    "publish_date": "Thu, 26 Jun 2025 11:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jakara Anthony completes mind-boggling season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/i-don-t-lose-sleep-about-it-tana-umaga-on-two-decades-of-o-driscoll-controversy-20250624-p5m9sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Become the next Ardie: Umaga’s pitch to recruit Tupou to Moana Pasifika",
    "publish_date": "Thu, 26 Jun 2025 11:15:06 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "“It’s around, ‘how can he make it work?’ I don’t know what that would mean around his Wallabies place and what he wants to do. There’s still two seasons to go before he has to play in the World Cup. If he wants to put that at jeopardy, it’s all those things. I haven’t spoken to him. He’s definitely someone of interest to us if he’s available. Ardie Savea won the Super Rugby Pacific MVP award this year at Moana Pasifika. Credit: Getty Images “I don’t know how many pigs I’d have to get to try and get him over there.” Tupou moving to a New Zealand club would not rule out involvement for the Wallabies at the 2027 Rugby World Cup. RA have the “Giteau Law” for offshore player selection, but Phil Waugh has previously indicated Australian players in New Zealand, like James O’Connor at the Crusaders, would be automatically eligible anyway, given they’re still playing in Super Rugby. Moana Pasifika’s deliberate, and deep, connection to Pacific Island culture might suit Tupou, as it did with Savea, said Umaga.\n\nSekope Kepu was the first captain of Moana Pasifika. Credit: Getty “Sekope Kepu and Christian Lealiifano were two of the pillars of our club, who started a lot of that (cultural connection) off. We’re just continuing with that work,” Umaga said. “I think I might just make a few calls after this.” Kepu, who played with Tupou at the 2019 Rugby World Cup, was asked about the prospect of his former teammate playing at Moana Pasifika earlier in the year. “He’d definitely fit right in and he’ll inspire guys if he was to go there, definitely,” Kepu said. “They’ll have to break the bank to get him over there.\n\nLoading “I think he loves Oz and he’s shown that with his decision to move over there from a young age. I hope that he can actually just play like he knows he can and just enjoy himself. I know when he’s happy, he plays well. It’d be massive for Moana if he was to go over there, but I think he’s happier in Oz.” Umaga and Kepu are both assistant coaches for the First Nations & Pasifika XV, who will play against the Lions in Melbourne on July 22. ‘I don’t lose sleep about it’: Tana Umaga on two decades of O’Driscoll controversy Tana Umaga probably doesn’t realise that Wednesday marks two decades to the day since he and Keven Mealamu hoisted Lions captain Brian O’Driscoll aloft in a ruck and unleashed a cyclone of controversy.\n\nWhen you are reminded about the incident every couple of weeks – and every couple of days, when a Lions tour rolls around – the passing years merge into a blur. “There’s not much you can do about it. I don’t lose sleep about it,” Umaga said. “It’s just something that keeps coming up, and you can’t do much about that.” The infamous incident, which if you’re Irish barely needs recapping, occurred in the first minute of the first Test of the Lions tour of New Zealand in 2005. At an early ruck, All Blacks stars Umaga and Mealamu attempted to clean O’Driscoll out of the way, but it all went wrong. The legs of the Irish superstar were lifted and “BOD” speared down into the ground, dislocating his shoulder and ended his tour.\n\nThe All Blacks went on to thump the Lions 3-0 and the controversy around O’Driscoll’s foul play injury raged. And raged and raged and raged. Neither All Black player received any punishment, and amid a tsunami of outrage, Umaga became public enemy No.1 in Ireland and Britain. His face was even on a T-shirt: “Wanted: For the Assassination of Brian O’Driscoll”. Thirteen years later, in 2018, the pair finally made peace over dinner in Ireland, ahead of a promotional shoot for Guinness, where they spoke about having finally left it behind them. “I’ve been back to Ireland a couple of times, quite a few times, and I’ve had no issues,” Umaga said. “It’s probably a pretty small number [who are still upset] because, as I said, no one mentions it to me when I’m there. I suppose with the advent of social media, that’s what keeps it alive. And the meaning as well.\n\n“All of us have moved forward on it. It’s part of the rugby fabric now. The British and Irish Lions are such a formidable team. This is etched in the memory and the fabric of that team. I’m connected to that. “People are passionate about their team, about right and wrong and what they feel should have happened. But yeah, 20 years later, we’ve dealt with it many moons ago. “No doubt we’ll catch up when we’re both together in Melbourne. We’ll just have another laugh about it, as we always do.” Umaga will see O’Driscoll when the Lions circus rolls into Victoria next month, having signed on to coach against them next month as an assistant for the First Nations and Pasifika XV at Melbourne’s Marvel Stadium on July 22.\n\nIt’s not the first time – Umaga coached the Auckland Blues against the Lions on their 2017 tour of New Zealand – but the opportunity to be an assistant to head coach Toutai Kefu was worth another wearying round of interviews on that 2005 moment. Moana Pasifika coach Tana Umaga looks on during the round 14 Super Rugby Pacific match between Moana Pasifika and Blues. Credit: Getty Images Umaga, who now coaches Moana Pasifika in Super Rugby Pacific, will be on a staff also containing Glen Ella, Sekope Kepu and Simon Raiwalui. “When I got the request, I didn’t have to think about it too long – I thought it was a huge honour,” Umaga said. “You see who else is involved in that coaching group. You know, there’s a lot of people that I respect. Glen Ella – I was a fan of his when I was growing up, so I’m looking forward to learning something off him and trying to bring back some of the 80s rugby that he played with his brothers, and those Wallaby days.”\n\nThe First Nations and Pasifika XV was created to fill the empty slot left when the Rebels shut down last year, and will feature not only Australian players with First Nations and Pacific Island heritage, but likely a handful from the Moana and Fijian Drua sides as well. Umaga said it was a rare opportunity for some players to face the Lions. “Not everyone gets it. It [a Lions tour] is held in such a high esteem,” he said. “For some, they may never usually get that opportunity, like not just the First Nations and Pacific Island players in Australia, but the possibility of Drua players as well as some Moana Pasifika players. That’ll be huge for those individuals if they get that chance.” Loading",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-33-problem-thats-pushing-some-australians-to-the-brink/sk6c0sw1o",
    "title": "'Bleak': The $33 problem that's pushing some Australians 'to the brink'",
    "publish_date": "Wed, 25 Jun 2025 15:30:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "A full‑time worker on the minimum wage has just $33 spare each week after rent, food and transport, according to a new report.\n\n\n\n\n\nAnglicare Australia's 2025 Cost of Living Index, released on Thursday, also said a single parent would have $1 left, even after government assistance, while a two‑income family with two children is left with only $5.\n\n\n\n\n\nThis analysis examined how far the minimum wage would stretch when covering essential weekly costs like rent, food, transport, childcare and education.\n\n\n\n\n\nBased on recent data from the Australian Bureau of Statistics' Household Expenditure Survey and rent costs from SQM Research's Weekly Rent Report, it compared these expenses to a full-time worker’s take-home pay of $822 a week from 1 July, when the latest minimum wage increase takes effect .\n\n\n\n\n\nA separate example included government support available to single parents.\n\n\n\n\n\nThe report, Anglicare says, shows that \"full-time work no longer guarantees a decent standard of living\", with minimum wage workers \"being pushed to the brink\".\n\n\n\nAnglicare executive director Kasy Chambers labelled the results of this year's index as \"bleak\".\n\n\n\n\n\n\"After paying for the basics, minimum‑wage workers are left with almost nothing. In many cases, there's no money left for energy bills at all,\" Chambers said.\n\n\n\n\n\n\"We're seeing more people trapped in energy debt. They are skipping meals, going without heating, and falling behind on bills they'll never be able to repay.\"\n\n\n\n\n\nMore than 330,000 customers owed a combined $300 million to energy retailers and debts above $3,000 were \"surging\", Chambers said, referencing the Australian Energy Regulator's 2024 annual retail markets report.\n\n\n\nPayment plans unsustainable, Anglicare says\n\nChambers said many people are locked into payment plans they cannot sustain, \"even though energy retailers are making record profits\".\n\n\n\n\n\nAnglicare says it wants more energy debt relief for people in hardship and governments to better regulate what it says is \"the gauging of energy costs\".\n\n\n\n\"Energy is not a luxury. It is essential to running a household, staying healthy, and living with dignity,\" Chambers said.\n\n\n\nChanges are coming, but not until next year\n\nRule changes announced by the Australian Energy Market Commission earlier this month will stop retailers from raising prices more than once a year, ban most late‑payment penalties and require companies to move vulnerable customers onto their best available deal.\n\n\n\n\n\nThe reforms are meant to stop retailers from \"luring customers in with cheap deals, only to move them onto higher-cost plans\", Energy Minister Chris Bowen said last week.\n\n\n\n\n\n\"There are many, many Australians, either in hardship or not in hardship, who aren't on their best possible plan. That's not their fault. We need to make it as easy as possible for them to change,\" Bowen told ABC Radio National.\n\n\n\n\n\nThe federal government also extended energy bill relief as part of its March federal budget .\n\n\n\n\n\nEvery residence and one million small businesses across the nation will receive a $75 quarterly rebate automatically applied to their electricity bill from 1 July until the end of 2025.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/economists-tip-july-rate-cut-as-inflation-continues-to-ease/6ws0epj4d",
    "title": "Economists tip July rate cut as inflation continues to ease",
    "publish_date": "Wed, 25 Jun 2025 07:47:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/agnes-bakery-successor-unveiled-in-new-farm-20250626-p5mahl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Agnes Bakery successor unveiled in New Farm",
    "publish_date": "Thu, 26 Jun 2025 12:05:30 +1000",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Agnes Bakery successor unveiled in New Farm Regulars can expect all the fire-licked breads and pastries they’ve become accustomed to queueing for, but also a full-service cafe menu featuring elevated brunch items. Matt Shea June 26, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nOn a Sunday earlier this month, Ben Williamson and Tyron Simon sat on a patch of grass and looked across James Street. It was Agnes Bakery’s final day of trade. “I brought the kids and the family and the dogs down, and then Ty came down and we got a couple of pastries and a coffee and sat and just looked at it,” Williamson says. Idle opened on Merthyr Road last weekend. Markus Ravik Until that moment, the celebrated chef hadn’t considered what the closure of Agnes Bakery meant to him and what came to be known as Anyday, the restaurant group he co-owns with Simon, Bianca Marchi and Frank Li.\n\nAdvertisement\n\n“We started talking about it and it all kind of hit me,” Williamson says, “‘Man, what a journey to get to this point.’ ” Related Article Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender Agnes Bakery started as a hail Mary – an unfettered dice roll in the face of a global pandemic. This was back in the final week of March in 2020 in the Spring Hill premises of Agnes the restaurant, which had been due to open the same week. Seemingly against the odds, it was a hit, with locked-down punters queueing around the block for woodfired bread and pastries (and perhaps a little human interaction outside of their own four walls). Unlike its predecessor, Agnes Bakery, Idle is a full-service cafe. Markus Ravik\n\nAdvertisement\n\nWhen lockdown restrictions eased and the group geared up to open Agnes as a restaurant, it made sense to move the bakery to its own space on the corner of James and Harcourt streets. There, it established itself as a local favourite, with the lines this time stretching down the hill towards The Calile hotel. In the meantime, Williamson, Simon, Li and Marchi had opened Bianca on Ada Lane, opposite The Calile, which became another roaring success, and then went on to formalise their identity as Anyday. Behind the counter, regulars will find all the breads and pastries they’ve become accustomed to queueing for at Agnes Bakery. Markus Ravik So the word “journey” feels appropriate. When Agnes Bakery wrapped at the end of that Sunday, the staff would begin the process of packing down and migrating over to Merthyr Road in New Farm to Idle, its full-service successor, which opened last weekend.\n\nAdvertisement\n\nWhich makes you wonder: why call time on this little bakery (or brand, perhaps) that could, which has come to mean so much to so many people, not least of all Williamson, Simon, Li and Marchi themselves? Harissa egg danish. Markus Ravik “It had sort of become its own thing anyway,” Williamson says. “Especially when Mitch [Suchowacki] came on board as head baker. It really started to evolve. “It was like this little sibling constantly living in the shadow of Agnes [the restaurant], which had become such a beast of its own that it didn’t make sense any more to keep them connected. So this was a great opportunity for us to give it its own identity.” If the closure of Agnes Bakery is the end of one chapter, Idle is the start of another.\n\nAdvertisement\n\nLater this year, Anyday will open a clutch of venues in the heritage-listed Coal Board Building in the guts of Brisbane’s CBD. It will be the group’s most ambitious project yet. Idle sourdough crumpets with creme fraiche and berry compote. Markus Ravik In that sense, Idle feels like something of a test run. When this masthead visits on a busy Tuesday morning, Williamson, Simon and Marchi are all there, overseeing service, and running food to the al fresco tables lined along Merthyr Road and up a brick-lined side lane. The tables are gathered around an indoor service area designed by Tamsin Johnson, best known locally for her work on Raes on Watego and the Sir boutique on James Street. She’s given the venue a light and bright treatment, with plenty of stainless-steel and custom terrazzo, the standout feature some Italian futurist light fittings. It feels sleek and modern without drifting into the austere.\n\nAdvertisement\n\nIdle features a design by in-demand Tamsin Johnson. Markus Ravik Idle serves everything regulars have become accustomed to at Agnes Bakery – fire-licked sourdough loaves, Basque cheesecakes, caneles, kouign-amanns and so on – but also a relatively expansive brunch menu designed by Williamson Suchowacki. There are your usual cafe go-tos given an Idle twist: sourdough crumpets with crème fraîche and a berry compote, porridge with white miso, cinnamon poached quince, coconut and walnut, and a bacon and fried egg roll with waffle fries and relish. “We started talking about it and it all kind of hit me: ‘Man, what a journey to get to this point.’ ” Idle co-owner Ben Williamson But there’s also more elevated dishes such as Baghdad eggs with a cumin burnt butter, smoked almond, a flaky flatbread and mint; a steamed spanner crab omelette with chilli, choron (a tomato-spiked béarnaise), salmon roe and toast; and a continental-style breakfast with ham, asiago, house-made butter, and a cucumber and fennel pickle, served with a baguette and soft-boiled egg.\n\nAdvertisement\n\nIt’s all about as thoughtful as you’d expect from Anyday, and from 11am, free-range charcoal chicken, fries, and daily salads and sandwiches are added to the mix. Beyond pastries and brunch, Idle stocks a bunch of pantry items on its back wall. Markus Ravik Idle serves specialty coffee by Single O, and shelving on the back wall stocks a bunch of pantry items including wine, house-made granola and condiments, and fancy Torres potato chips from Spain. Beyond its meaning for Anyday, Idle is a welcome addition in New Farm but also the city generally, where full-service cafe openings have become increasingly rare in the post-pandemic age. “We’ve had a lot of Agnes Bakery clientele coming down, but also a lot of locals, who are often people in their 50s and 60s,” Williamson says. “We thought it might be a challenge to get some of [them] across the line, but they’ve responded well. It’s been really great.”\n\nAdvertisement\n\nOpen Mon-Sun 7am-2pm. 84 Merthyr Road, New Farm, (07) 3062 2346. anyday.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/environment/climate-change/minns-criticised-council-s-gas-ban-as-an-overstep-developers-say-it-s-a-no-brainer-20250625-p5ma6p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Minns criticised council’s gas ban as an ‘overstep’. Developers say it’s a no-brainer",
    "publish_date": "Thu, 26 Jun 2025 11:55:21 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "Property developers and apartment owners have strongly backed in the City of Sydney’s ban on gas connections for new builds, contradicting the NSW premier who branded the policy as an “overstep”.\n\nThe City of Sydney has mandated that new residential developments will have to use electric cooktops, ovens and space heating from January 1, 2026, and be entirely gas free from the following year.\n\nApartment buildings under construction in Sydney. Credit: Bloomberg\n\nFive other NSW councils have already mandated electrification in new builds, though some have exceptions for hot water heaters. Lane Cove Council fully banned the use of gas appliances in new builds from October 2023.\n\nFrankie Muskovic, national policy director for the Property Council of Australia, said targeting new builds made sense because the change was easier and more cost-effective than retrofitting existing buildings.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/traveller/inspiration/celebrity-solstice-first-ship-to-undergo-400m-upgrade-20250624-p5m9zz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Celebrity Solstice first ship to undergo $400m upgrade",
    "publish_date": "Thu, 26 Jun 2025 11:49:46 +1000",
    "category": "finance",
    "authors": [
      "Julietta Jameson"
    ],
    "text": "A lot of water has flowed under the Sydney Harbour Bridge since Celebrity Solstice took out the best cruise ship gong as voted by Australian travel agents in 2015.\n\nLaunched in 2008, Solstice is no longer the bellwether of ship trends in our seas, though she’s garnered 18 awards across her lifetime, had a big redo in 2016, and remains hugely popular with Australian cruisers. But the ship’s once groundbreaking features have been overshadowed by the bells and whistles of bigger, glitzier ships.\n\nThe ship’s Retreat Lounge.\n\nHowever, when she returns in 2026, Celebrity is confident fans will fall in love with her once more – not for any added gimmickry, more for the enhancement of the things she does best, like dining, relaxing and offering beautiful accommodation.\n\nCelebrity is investing almost $400 million to modernise its entire fleet of Solstice Class ships, with the flagship Celebrity Solstice the first to “be made new again” as the line puts it.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/nsw/this-sydney-landmark-is-crossed-16-000-times-a-day-it-s-about-to-get-a-60m-makeover-20250625-p5ma5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Sydney landmark is crossed 16,000 times a day. It’s about to get a $60m makeover",
    "publish_date": "Thu, 26 Jun 2025 11:42:56 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "It’s the linchpin that has connected Sydney’s city centre to the inner west for more than a century.\n\nBut the strain of old age, its watery location spanning Cockle Bay, and 6 million pedestrian and bike crossings a year have necessitated a multimillion-dollar upgrade for the historic Pyrmont Bridge, which will coincide with plans for more intensive development around the western harbour.\n\nPyrmont Bridge has long been a crucial connection between Sydney’s CBD and Pyrmont. Credit: Oscar Colman\n\nThe NSW government will spend $59.8 million over the next 10 years to refurbish the state heritage-listed bridge and maintain the structure as a critical active transport route in and out of the CBD.\n\nPlanning and Public Spaces Minister Paul Scully said the 123-year-old structure, which is one of the world’s oldest surviving electrically operated swing span bridges, desperately needed restoration.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/i-spent-an-evening-with-nick-kyrgios-it-was-bleaker-than-expected-20250626-p5maeo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "I spent an evening with Nick Kyrgios. It was bleaker than expected",
    "publish_date": "Thu, 26 Jun 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Thom Gibbs"
    ],
    "text": "Clearly this is at odds with many years of ugly tantrums, and indeed his own marketing as a maverick. “I just enjoy being a little s--- sometimes, I like causing mischief” he said, growing into the evening. But also: “I’ve never been this nervous for anything in my life. Playing in front of the Royal Box has nothing on this.” He claimed he had “four vodkas out the back” beforehand.\n\nKyrgios likes a drink. It runs through this show and came up in an interview with Louis Theroux earlier this year, when he said he used to indulge five or six nights a week with up to 30 drinks a night. He has also suffered with depression and self-harm. It sounds like there are some unresolved issues about tennis being foisted upon him by his family, who saw a less promising future in Kyrgios’s favoured sport of basketball.\n\nNick Kyrgios practising at the All England club on Thursday. Credit: Getty Images\n\nHe has said repeatedly he is far from in love with the sport which made his name and it is worth viewing his angry behaviour through this prism. Perhaps only golf is more fury-inducing for its competitors. Imagine playing all that tennis when you are not even sure you like it.\n\nThings turn south after the interval. When this tour was announced audiences were promised “a HUGE surprise guest for a candid, unscripted exchange”. In Wimbledon this was Daniel “Horse” Horsfall, Kyrgios’s manager, business partner and childhood friend. He is charismatic enough but his memories of teenage Pokemon sessions and knowledge of Kyrgios’s many fines is not enough to carry a show. There is an interactive quiz, as bad and momentum-killing an idea in a theatre as it is at a wedding reception.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/vale-the-back-page-a-rare-and-beautiful-exception-to-hunter-s-thompson-s-tv-dictum-20250625-p5ma4s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Vale The Back Page, a rare and beautiful exception to Hunter S Thompson’s TV dictum",
    "publish_date": "Thu, 26 Jun 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Peter Fitzsimons"
    ],
    "text": "But there are many exceptions. One of them was The Back Page, the sports panel show which has finished up this week after a 29-year run. As one who was on it for its first decade and a bitty, I have been inundated with emails, texts and calls this week, from those lamenting its demise.\n\n“It is normally perceived as some kind of cruel and shallow money trench through the heart of the journalism industry, a long plastic hallway where thieves and pimps run free and good men die like dogs, for no good reason. Which is more or less true. For the most part, they are dirty little animals with huge brains and no pulse.”\n\nInevitably, many of the obits have focused on its latter years – which is fair enough because, to my amazement, it has been bloody successful for the last two decades, too, and really was a great show. With its latter-day incarnation hosted by Tony Squires and boasting panellists such as Crash Craddock, Adam Spencer and Candice Warner, the thing was still working and doing great box office.\n\nI have no clue why Fox Sports has cut it off at the knees, save the possibility its new owners, the British-based DAZN, intend to channel more foreign content to this small outpost on the other side of the planet at the expense of local content.\n\nThe Back Page team, Christmas drinks, circa 1998. Back row: Peter Frilingos, Keeley Devery, Billy Birmingham. Front row: Mike Gibson, Saul Shtein, Peter FitzSimons.\n\nBut I digress. For my obit, let me focus a little on the first decade, when The Back Page proved the antithesis of Thompson’s dictum. It was a terrific show because we all really liked each other, and were close friends well beyond whatever we put to air.\n\nThe show was the idea of the veteran sports producer Saul Shtein. Knowing that Mike Gibson, the iconic sports broadcaster from Wide World of Sports, would be at the Atlanta Olympics at the same time as me, Saul asked me to duchess him on the idea of the show, after Mike had politely rejected his first approach. Mike and I got together one day at the beach volleyball, when Australia had just got the gold medal, and I pitched again.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/flagg-flies-to-dallas-as-nba-s-no-1-pick-but-fixed-chants-rock-brooklyn-20250626-p5mai1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Flagg flies to Dallas as NBA’s No.1 pick as heckler disrupts draft",
    "publish_date": "Thu, 26 Jun 2025 11:29:15 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "Cooper Flagg is on his way to the Dallas Mavericks as the No.1 pick of the NBA draft, being held in Brooklyn, New York on Thursday morning (AEST).\n\nThe Maine native and Duke University forward was a certainty to be the first pick after stellar season with Duke University in the US college basketball system, but some conspiracy theorists in the crowd had their say at the start of the event.\n\nCooper Flagg (right) shakes hands with NBA commissioner Adam Silver after being drafted first overall by the Dallas Mavericks. Credit: Getty Images\n\nA fan could be heard screaming “Dallas was fixed” just before NBA commissioner Adam Silver was walking on stage to open the draft.\n\nThere is an unfounded conspiracy theory among some fans that the Mavericks were awarded the top pick in the NBA draft lottery in return for the shock mid-season trade that resulted in Dallas sending superstar Luka Doncic to the LA Lakers in return for Anthony Davis.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/beautiful-community-of-nerds-the-fight-to-keep-a-beloved-radio-station-alive-20250616-p5m7rb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Beautiful community of nerds’: The fight to keep a beloved radio station alive",
    "publish_date": "Thu, 26 Jun 2025 11:26:52 +1000",
    "category": "finance",
    "authors": [
      "Nick Newling"
    ],
    "text": "According to its most recent annual report, between 2023 and 2024 FBi’s operating deficit jumped sixfold, from $41,000 to $276,000 on a $1.6 million budget. Sponsorship revenue fell by $184,000 in the same period. Between 2021 and 2024 station membership declined by 36 per cent. FBi president Angela Stengel pointed to investments in the station’s digital presence, as well as declining sponsorships and memberships to explain the jump in the deficit. Stengel says the fall in sponsorships was tied to economic pain being felt by “cultural organisations, hospitality, and other community-based groups”, which make up a “significant portion” of partners. The financial struggles faced by the station are not new. In 2009, FBi ran a campaign targeting Virgin Group billionaire Richard Branson, seeking a million-dollar donation to support the struggling station. The campaign resulted in an interview with Branson, in which host Alison Piotrowski requested the funds live on air. “We didn’t get the million from Branson, but we did live to fight on, and fight hard. I just hope FBi is able to do it again,” says Piotrowski, who went on to serve as Nine’s US correspondent, and is now a senior reporter for the network and presenter on Weekend Today*.\n\n“FBi gave me the opportunity to find my voice, but most importantly it gave me the space to make mistakes on air, to fail … and I became a better broadcaster as a result,” she says. “When I look around the industry today there are very few places that nurture young talent, give them communities and networks for their future careers, and provide on-the-job experience without a paid internship – which just isn’t realistic for most music and media companies.” Journalists Alison Piotrowski and Marc Fennell both got their start at FBi Radio. Credit: Instagram and SBS Another darling of the station’s alumni is globetrotting journalist and presenter of SBS’s Mastermind, Marc Fennell, who got his start at FBi as the station’s film critic. He said the station “utterly and completely changed” his life. “I was a 17-year-old who walked in the door with no skills, I didn’t know anybody that worked in media, music, culture … they genuinely taught me broadcasting from scratch,” says Fennell, who later met his wife at the station.\n\n“It’s an incredible place for creativity. You can come, there’s equipment there, you can play, you can create new things, you can try new things. I think having environments were people can play and find partnerships is really crucial. Without those spaces, we become much poorer as listeners, as a community, as a city.” Loading Fennell says in the 22 years FBi had been on the air, social media had fundamentally changed the way people start media careers. He says, however, the emphasis on teamwork and the focus on audience were crucial elements that were reinforced by training in the station environment. “In radio and television and publishing it’s extraordinarily rare to do anything by yourself. What you have to learn is how to work in teams and find your tribe. I work now with people that I met at FBi because of the creative partnerships we formed back then,” he says. “It doesn’t seem very obvious, but that’s actually a crucial component to what FBi offers. It creates creative partnerships that have now proliferated what people watch, what people read, what people listen to … if you take that away from Sydney, in particular, you end up with a very different-sounding media that I don’t think serves the audience.”\n\nNewly minted managing director Tyson Koh, who made a name for himself by leading the Keep Sydney Open movement during the city’s controversial lockout law period, has been tasked with keeping the station afloat – a job he says is both exciting and daunting. Exciting because of FBi’s cultural importance in Australia’s music scene; daunting because “the station is going through a tough time, and it’s been a struggle to get the message out”. Managing director Tyson Koh said it had been “a struggle to get the message out” on the station’s financial hardship. Credit: Sam Mooy “Whilst the station has been around for a long time, it relies on people’s financial support in order to stay on the air. Especially with a new generation of community radio listeners who might not be aware of the model that FBi operates under,” says Koh, who first volunteered for the station in 1999, before it had a broadcasting license. Koh says that FBi’s financial issues are reflective of a “wider struggle” creatives and art lovers are experiencing across the city.\n\n“People these days are overextended with their financial obligations, whether it’s rent or mortgages, but also the litany of subscriptions that we’re being funnelled towards on a daily basis. I think what I would like people to be aware of is that FBi isn’t a multinational tech company. It’s an organisation that has a very tangible effect on the cultural life in Sydney,” says Koh. Loading FBi was an early champion of Australian artists Flume, the Kid Laroi, Nina Las Vegas and Genesis Owusu, and there is concern among the station’s faithful that a weakening of the business may hurt upcoming talent. With ongoing costs such as rent, broadcasting fees and staffing expenses continuing to pinch FBi’s bottom line, Koh said that “nothing is off the table” in ensuring the station’s sustainability. “We’ve already had to make staff redundant, unfortunately, earlier in the year. So we’re doing the best that we can to tighten our belts … we do need to look at our revenue model and see what can be developed and what can be improved, and we’re doing all those things.”",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/jakara-anthony-completes-mind-boggling-season-20240321-p5fe4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jakara Anthony completes mind-boggling season",
    "publish_date": "Thu, 26 Jun 2025 11:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Jakara Anthony completes mind-boggling season\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/i-don-t-lose-sleep-about-it-tana-umaga-on-two-decades-of-o-driscoll-controversy-20250624-p5m9sc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Become the next Ardie: Umaga’s pitch to recruit Tupou to Moana Pasifika",
    "publish_date": "Thu, 26 Jun 2025 11:15:06 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "“It’s around, ‘how can he make it work?’ I don’t know what that would mean around his Wallabies place and what he wants to do. There’s still two seasons to go before he has to play in the World Cup. If he wants to put that at jeopardy, it’s all those things. I haven’t spoken to him. He’s definitely someone of interest to us if he’s available. Ardie Savea won the Super Rugby Pacific MVP award this year at Moana Pasifika. Credit: Getty Images “I don’t know how many pigs I’d have to get to try and get him over there.” Tupou moving to a New Zealand club would not rule out involvement for the Wallabies at the 2027 Rugby World Cup. RA have the “Giteau Law” for offshore player selection, but Phil Waugh has previously indicated Australian players in New Zealand, like James O’Connor at the Crusaders, would be automatically eligible anyway, given they’re still playing in Super Rugby. Moana Pasifika’s deliberate, and deep, connection to Pacific Island culture might suit Tupou, as it did with Savea, said Umaga.\n\nSekope Kepu was the first captain of Moana Pasifika. Credit: Getty “Sekope Kepu and Christian Lealiifano were two of the pillars of our club, who started a lot of that (cultural connection) off. We’re just continuing with that work,” Umaga said. “I think I might just make a few calls after this.” Kepu, who played with Tupou at the 2019 Rugby World Cup, was asked about the prospect of his former teammate playing at Moana Pasifika earlier in the year. “He’d definitely fit right in and he’ll inspire guys if he was to go there, definitely,” Kepu said. “They’ll have to break the bank to get him over there.\n\nLoading “I think he loves Oz and he’s shown that with his decision to move over there from a young age. I hope that he can actually just play like he knows he can and just enjoy himself. I know when he’s happy, he plays well. It’d be massive for Moana if he was to go over there, but I think he’s happier in Oz.” Umaga and Kepu are both assistant coaches for the First Nations & Pasifika XV, who will play against the Lions in Melbourne on July 22. ‘I don’t lose sleep about it’: Tana Umaga on two decades of O’Driscoll controversy Tana Umaga probably doesn’t realise that Wednesday marks two decades to the day since he and Keven Mealamu hoisted Lions captain Brian O’Driscoll aloft in a ruck and unleashed a cyclone of controversy.\n\nWhen you are reminded about the incident every couple of weeks – and every couple of days, when a Lions tour rolls around – the passing years merge into a blur. “There’s not much you can do about it. I don’t lose sleep about it,” Umaga said. “It’s just something that keeps coming up, and you can’t do much about that.” The infamous incident, which if you’re Irish barely needs recapping, occurred in the first minute of the first Test of the Lions tour of New Zealand in 2005. At an early ruck, All Blacks stars Umaga and Mealamu attempted to clean O’Driscoll out of the way, but it all went wrong. The legs of the Irish superstar were lifted and “BOD” speared down into the ground, dislocating his shoulder and ended his tour.\n\nThe All Blacks went on to thump the Lions 3-0 and the controversy around O’Driscoll’s foul play injury raged. And raged and raged and raged. Neither All Black player received any punishment, and amid a tsunami of outrage, Umaga became public enemy No.1 in Ireland and Britain. His face was even on a T-shirt: “Wanted: For the Assassination of Brian O’Driscoll”. Thirteen years later, in 2018, the pair finally made peace over dinner in Ireland, ahead of a promotional shoot for Guinness, where they spoke about having finally left it behind them. “I’ve been back to Ireland a couple of times, quite a few times, and I’ve had no issues,” Umaga said. “It’s probably a pretty small number [who are still upset] because, as I said, no one mentions it to me when I’m there. I suppose with the advent of social media, that’s what keeps it alive. And the meaning as well.\n\n“All of us have moved forward on it. It’s part of the rugby fabric now. The British and Irish Lions are such a formidable team. This is etched in the memory and the fabric of that team. I’m connected to that. “People are passionate about their team, about right and wrong and what they feel should have happened. But yeah, 20 years later, we’ve dealt with it many moons ago. “No doubt we’ll catch up when we’re both together in Melbourne. We’ll just have another laugh about it, as we always do.” Umaga will see O’Driscoll when the Lions circus rolls into Victoria next month, having signed on to coach against them next month as an assistant for the First Nations and Pasifika XV at Melbourne’s Marvel Stadium on July 22.\n\nIt’s not the first time – Umaga coached the Auckland Blues against the Lions on their 2017 tour of New Zealand – but the opportunity to be an assistant to head coach Toutai Kefu was worth another wearying round of interviews on that 2005 moment. Moana Pasifika coach Tana Umaga looks on during the round 14 Super Rugby Pacific match between Moana Pasifika and Blues. Credit: Getty Images Umaga, who now coaches Moana Pasifika in Super Rugby Pacific, will be on a staff also containing Glen Ella, Sekope Kepu and Simon Raiwalui. “When I got the request, I didn’t have to think about it too long – I thought it was a huge honour,” Umaga said. “You see who else is involved in that coaching group. You know, there’s a lot of people that I respect. Glen Ella – I was a fan of his when I was growing up, so I’m looking forward to learning something off him and trying to bring back some of the 80s rugby that he played with his brothers, and those Wallaby days.”\n\nThe First Nations and Pasifika XV was created to fill the empty slot left when the Rebels shut down last year, and will feature not only Australian players with First Nations and Pacific Island heritage, but likely a handful from the Moana and Fijian Drua sides as well. Umaga said it was a rare opportunity for some players to face the Lions. “Not everyone gets it. It [a Lions tour] is held in such a high esteem,” he said. “For some, they may never usually get that opportunity, like not just the First Nations and Pacific Island players in Australia, but the possibility of Drua players as well as some Moana Pasifika players. That’ll be huge for those individuals if they get that chance.” Loading",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/aussies-230-hotel-bill-after-being-stranded-outside-home-highlights-sad-problem-073137113.html",
    "title": "Aussie's $230 hotel bill after being stranded outside home highlights 'sad' problem",
    "publish_date": "2025-06-25T07:31:37Z",
    "category": "finance",
    "authors": [],
    "text": "A Melbourne man in a wheelchair couldn't access his apartment when the lift was broken down overnight and he was forced to pay for a hotel room.\n\nShane Hryhorec was forced to pay for overnight accommodation after he was unable to access his home. Source: Supplied & GoogleMaps\n\nAfter a long day at work, most Aussies just desperately want to get home and switch off. But for one Melbourne man, he simply couldn't. Instead, he was stranded outside his home and forced to fork out $230 for overnight accommodation — all because the lift was out of service.\n\n\"Long story short, I saw in our residential Facebook group that the lift had broken down. I called the lift company to let them know that I'm in a wheelchair and I need to get into my building. They said it had already been logged and someone was on their way,\" Shane Hryhorec told Yahoo News. \"But I didn't hear anything back, and when I got home at 9.30 pm, the lift was out, no signs and no communication.\n\n\"I had to book a hotel and wear the same clothes for two days.\"\n\nDespite constantly communicating with lift company Schindler, very little information was allegedly given to Shane regarding access to his home. He was eventually able to get in the following evening, but was then stuck inside his apartment as further repair work was carried out.\n\nADVERTISEMENT\n\n\"The next day they confirmed the lift was working and they let me into my apartment. They then had to continue working on it, which meant I couldn't then leave the building until it was resolved,\" he said, raising concerns about safety.\n\nGroceries 'ditched' after Aussie couldn't access home\n\nOn top of the $230 hotel fee, Shane had to also throw out the majority of his weekly shop he had bought the day he was unable to access his home.\n\n\"The other thing that really upset me is I had gone shopping, so all $60 worth of food that needed to go in the fridge was ditched,\" he said. \"Dairy and meat products had to go in the bin.\"\n\nDespite being a member of his building's strata committee and speaking to the lift company, Shane feels defeated knowing there is no avenue in which he can claim compensation for all the money he had to spend due to the incident.\n\nADVERTISEMENT\n\n\"What compensation is there for people with disabilities who get trapped in the lift but also can't get inside their building and have to book accommodation? None,\" he said.\n\n\"That's what happened to me and I'm still out of pocket,\" he said, adding that while this is the first time he's required overnight accommodation, the lift has broken down many times during the seven years he's lived in the building.\n\nShane claims the lift frequently breaks down. Source: Supplied\n\nLift company respond to Aussie being stranded outside home\n\nSchindler's Regional General Manager Callum Joyce told Yahoo News the company \"continuously works to minimise elevator outages\" and \"understands the critical nature of elevators for mobility throughout residential buildings, especially buildings with a single elevator.\"\n\nHe claims the lift had not broken down and instead the repairs were planned with the building's strata company.\n\nADVERTISEMENT\n\n\"During the planned upgrade, a part failed, which required replacement,\" he said, explaining this is why the lift was out of order overnight.\n\n\"The part was sourced from our warehouse in NSW, air-freighted overnight and delivered to site Friday morning... We provided regular updates and continued to communicate the status of the repair through to its completion,\" he said.\n\nDisabled Aussies continue to be 'overlooked'\n\nThe incident is much more than a residential building simply needing repairs, Megan Spindler-Smith, the Deputy CEO of People with Disability Australia told Yahoo News. It's an everyday situation, and impacts ripple far and wide for those living with a disability.\n\n\"Sadly, this isn’t the first time we've heard of people with disability — including wheelchair users — being overlooked during emergencies. Lifts break down and things go wrong, but that’s exactly why buildings must have effective, inclusive plans in place,\" she said.\n\nADVERTISEMENT\n\n\"Everyone has the basic human right to access their home — or, at the very least, be provided with safe and reasonable alternatives.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 33
  }
]