[
    {
        "url": "https://www.9news.com.au/world/world-news-donald-trump-tariffs-inside-his-90-day-pause-on-reciprocal-taxes/d0fbd894-ca0a-462a-8eb4-ce93d684f9fb",
        "title": "The truth behind Trump's stunning backflip",
        "publish_date": "Wed, 09 Apr 2025 23:37:17 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "President Donald Trump's abrupt decision to reverse course on his sweeping tariff plan by announcing a three-month pause revealed his threshold for political pain: One week.\n\n\"They were getting yippy,\" Trump said, explaining the rising criticism raining down on the White House over the last week. \"They were getting a little bit yippy, a little afraid.\"\n\nEven for a president famous for his policy bobs and weaves, this morning's announcement he was pausing his long-touted reciprocal tariffs for three months amounted to a stunning reversal of a plan he had appeared only a day earlier to be fully behind.\n\nDonald Trump has backflipped on his sweeping tariffs in less than a week, leaving experts puzzled. (AP)\n\nIt also came as his own trade representative was testifying on Capitol Hill to the benefits of the tariffs, seemingly catching him unaware of the pause.\n\nDays of pressure from fellow Republicans, business executives and even his close friends hadn't appeared to move Trump, who insisted last week: \"MY POLICIES WILL NEVER CHANGE.\"\n\nBy this morning, however, it had become evident the campaign to convince Trump to change course would not let up. It had also become plain after a sharp sell-off in US government bond markets — usually a safe corner for investors — that the economic ramifications of the president's strategy were potentially catastrophic/worse than his advisers had previously predicted.\n\nThe growing alarm inside the Treasury Department over developments in the bond market was a central factor in Trump's decision to hit pause on his \"reciprocal\" tariff regime, according to three people familiar with the matter.\n\nTreasury Secretary Scott Bessent raised those concerns directly to Trump on Wednesday (Thursday AEST) in a meeting that preceded the pause announcement, underscoring concerns shared by White House economic officials who had briefed Trump on the accelerating sell-off in the US Treasury market earlier in the day.\n\nCalls to top White House advisors from key business community allies also increasingly focused on the troubling developments in the bond market as they made the case for Trump to pull back.\n\nTrump was posting in favour of his tariffs just hours before his backflip. (Bloomberg)\n\nTrump had not yet made the decision to pause the dramatic new tariff rates when he was posting on social media about the stock market on Wednesday morning, two of the people said.\n\nBut he acknowledged later in the afternoon that he'd been watching the bond market turmoil closely.\n\n\"The bond market is very tricky, I was watching it,\" Trump told reporters. \"The bond market right now is beautiful. But yeah, I saw last night where people were getting a little queasy.\"\n\nSitting in the Oval Office to tap out his announcement, Trump was joined by two advisers who had become dueling faces of the tariff plan: Bessent and Commerce Secretary Howard Lutnick.\n\n\"We didn't have access to lawyers or – it was just wrote up. We wrote it up from our hearts, right? It was written from the heart, and I think it was well written too, but it was written from the heart,\" Trump said afterward, describing a process driven more by impulse than mapped-out strategy.\n\nEven as Trump calmed the markets – for now, at least – he also raised new questions by suggesting he would consider exempting some US companies from tariffs, saying he would make any such decisions \"instinctively\".\n\nWhirlwind Wednesday\n\nIt was another whirlwind Wednesday at the White House, with advisers scrambling to keep pace with the president's decisions. He sought to take a victory lap after one of the most humbling retreats of his presidency, eager to take credit for the stock market gains – without mentioning the record-setting, trillion-dollar losses over the last week.\n\n\"It's the biggest increase in the history of the stock market. That's pretty good,\" Trump told reporters in the Oval Office. \"If you keep going, you're going to be back to where it was four weeks ago.\"\n\nIf Trump was planning early on Wednesday to pause his new tariffs after days of market turmoil, he did not reveal his intentions widely. Many White House officials heard of his decision at the same time the world learnt, via post on Truth Social, that the new tariffs were on pause.\n\nREAD MORE:﻿\n\nAnthony Matesic works on the floor at the New York Stock Exchange in New York, on Wednesday, April 9. (AP Photo/Seth Wenig)\n\nEven his own top trade official seemed only vaguely aware the change was possible by the time Trump announced the reversal on social media.\n\n\"It looks like your boss just pulled out the rug from under you and paused the tariffs,\" Democrat Steven Horsford of Nevada told US Trade Representative Jamieson Greer during a hearing that was underway on Capitol Hill when Trump made his announcement. Greer had offered zero indication to that point the major shift was coming.\n\nBessent and other officials insisted the decision to pause the new tariffs on all nations except China was not a backdown; instead, they framed the move as all part of Trump's master plan to bring nations to the negotiating table.\n\n\"It took great courage, great courage for him to stay the course until this moment,\" said Bessent, who flew to Palm Beach last weekend for a lengthy discussion with Trump on the endgame of the tariffs.\n\nEven as his advisers danced around it, though, the president acknowledged that the rising criticism, deepening angst and mounting losses in the financial markets contributed to his abrupt decision on Wednesday afternoon to impose a three-month pause on many of the tariffs.\n\n\"I thought that people were jumping a little bit out of line,\" Trump told reporters.\n\nAlarm over bond sell-off\n\nThe administration's economic team spent Wednesday morning intensely focused on the bond sell-off that had intensified a day earlier and accelerated aggressively overnight, driving yields higher and, in effect, demonstrating the exact opposite of what would normally happen during such an unstable and volatile moment in the global economy.\n\nHistorically, Treasurys rally in moments of stock market sell-offs as investors rush to shift assets to a global safehaven, the longstanding status due to the safety and liquidity provided by the US market.\n\nWatching the inverse play out, then accelerate after unexpectedly weak demand at the first Treasury Department auction to take place since Trump's announced his tariff regime, led to growing alarm even as Bessent dismissed it as \"uncomfortable, but normal\" in a Wednesday morning television interview.\n\nREAD MORE: ﻿ Eight sought after woman knocked out at football match\n\nJPMorgan CEO Jamie Dimon, left, is interviewed by Maria Bartiromo on the \"Mornings with Maria Bartiromo\" program on the Fox Business Network. (AP)\n\nBut for Bessent, whose finance career was deeply intertwined with the bond market and who has been fixated on driving down the 10-year yields in his cabinet post, the alarm relayed by senior Treasury officials was understood and reflected in the later conversation with Trump.\n\nThe president, who is a close monitor of his own coverage on television, had seen even some of his close allies issue dire warnings about the prospects of a recession as a result of the tariffs. He was watching Fox Business channel on Wednesday morning when JPMorgan Chase CEO Jamie Dimon said a recession was \"a likely outcome\" of an escalating trade war resulting from Trump's tariff policies.\n\n\"Markets aren't always right, but sometimes they are right,\" Dimon told Fox Business' Maria Bartiromo.\n\nExecutives light up White House phones\n\nInside the White House, telephone calls had been coming quickly from business executives, Republicans and other allies of the president urging him to reconsider his tariffs, but they received little indication a pause was in the works.\n\nExecutives had been lighting up the phone lines of chief of staff Susie Wiles, Vice President JD Vance, and Treasury secretary Scott Bessent to make the case to Trump directly as trade hawks continued to promote Trump's tariffs-at-all-costs approach on television as the market continued to sink.\n\nWiles, these sources said, had been particularly effective in convincing Trump that the market rout was costing considerable political capital that he would need for future agenda items, with legislators fielding increasingly angry constituent calls as the market continued sinking.\n\nBessent, whose conversation with Trump in Florida over the weekend focused on zeroing in on the overall goal of the tariffs, also appeared to assume more of a role in the public messaging, talking frequently about the dozens of countries now jockeying for trade deals.\n\n\"This was driven by the President's strategy. He and I had a long talk on Sunday, and this was his strategy all along,\" Bessent said on Wednesday.\n\nTrump, however, acknowledged he'd been keeping a close eye on markets, calling their performance \"glum\" over the last few days.\n\nA week after making a tariff announcement that upended the global trading system, the president stood outside the White House in front of three colorful race cars and reflected on what led to his retreat. He sought to take credit for a problem largely of his own making, saying his credibility was not eroded by the whiplash.\n\nWill you boycott American products over Donald Trump's tariffs? Yes 12502 No 2691",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/easter-long-weekend-2025-whats-open-good-friday-trading-hours-coles-woolworths-aldi-explainer/34212232-e6aa-477a-bf68-b7d8d97c9035",
        "title": "When shops will be open and closed this Easter around the country",
        "publish_date": "Thu, 10 Apr 2025 01:00:30 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "D﻿ashing to the shops for a quick pick-up becomes more complicated during the Easter long weekend, with supermarkets and big stores shutting down around the country.\n\nIt's best to shop early and be prepared, but that can be difficult with different shops shutting at different times depending on where you are in the country.\n\nHere's what you need to know about when and where you can shop.﻿\n\nMajor shops will operate on different schedules over the Easter long weekend. (Alex Ellinghausen)\n\nWhat's open on Good Friday?\n\nWoolworths confirmed it would close stores around the country on Good Friday, April ﻿18 - with some exceptions.\n\nThose exceptions include the stores at Brisbane Airport in Queensland; Mount Barker, Mount Barker South, and Murray Bridge Marketplace Victor Harbo﻿r in South Australia; Dunsborough, Perth Airport, Eaton Fair, Margaret River, Busselton, and Dalyellup in Western Australia.\n\nColes will close all its stores except for those at Victor Harbor, Murray Bridge Green, and Mount Barker in South Australia.\n\nBunnings and Aldi stores will be shut for the day nationwide.﻿\n\nREAD MORE: China makes extraordinary offer to Australia\n\nPeople are urged to get their shopping done early. (Getty)\n\nWhat's open on Easter Saturday?﻿\n\nAll Woolworths stores will reopen for Easter Saturday, except for several Metro outlets around the country.﻿\n\nColes will likewise be open nationwide, though some stores will be operating with reduced trading hours.\n\nAldi and Bunnings stores will be open as well.\n\nWhat's open on Easter Sunday?\n\n﻿Aldi stores will all open in Victoria and Western Australia, but it will vary around the rest of the country. Some shops will open, some won't.\n\nBunnings will also be open on Easter Sunday, though trading hours will be reduced in New South Wales.﻿\n\nWoolworths' status will vary state to state. All stores will be open in Queensland, Victoria, Tasmania, and Western Australia, with a couple of exceptions (Esperance in Western Australia, Moama in Victoria, Hervey Bay Pialba and some Metro stores in Queensland).\n\nREAD MORE: Eight football fans wanted after woman knocked out in ugly scenes\n\nShops will be closed for multiple days. (Getty)\n\nIn NSW, the ACT, South Australia, and the Northern Territory, \"a handful\" of Woolies stores will open, with people encouraged to check the opening hours of their local outlet online .﻿\n\n﻿Similarly, Coles stores will operate differently around the country.\n\nShops will be closed in NSW, and open in Tasmania and the ACT.\n\nOutlets in Victoria, Queensland, and Western Australia will be open, but some will operate within reduced trading hours.\n\nAll shops will be open for reduced ours in the NT.\n\nIn South Australia, all stores will be closed except for Port Lincoln, Port Pirie, Port Augusta, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier, Victor Harbor, and Mount Barker.﻿\n\nHonking goose at the centre of high-profile divorce case View Gallery\n\nWhat's open on Easter Monday?\n\nWoolworths will open their doors again for NSW, the ACT, Victoria, Western Australia, and Tasmania.﻿\n\nStores will reopen in Queensland except for Hervey Bay Pialba.\n\nA handful of stores will be open in South Australia and the NT.﻿\n\nColes will reopen stores in every state and territory except South Australia, though in most areas (NSW, Queensland, Victoria, Western Australia, and the NT) trading hours will be reduced.\n\nTasmania and the ACT will trade unrestricted.\n\nSouth Australian stores will be closed except for Port Lincoln, Port Pirie, Port Augusta, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier, Victor Harbor, Mount Barker, and Berri.﻿\n\nAldi outlets will be open in most states and territories, but it will vary store to store in South Australia.﻿\n\nBunnings stores will be open around the country.\n\nThe provided trading hours and information are subject to change according to individual stores. We highly encourage readers to check the operating hours of their local stores online before making the venture. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-china-smashes-us-84-per-cent-tariffs-begin-april-10/fe377611-f535-408f-b7ff-31e028515476",
        "title": "Trump announces '90-day pause' but hits China even harder",
        "publish_date": "Wed, 09 Apr 2025 22:04:57 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "US President Donald Trump has announced a pause on much of his so-called \"reciprocal\" tariffs, while raising the rate against China further to 125 per cent.\n\nThe abrupt backdown in the face of a global market meltdown﻿ sent US stocks soaring in what was seemingly an attempt to narrow what had been an unprecedented trade war between the US and most of the world to a showdown between the US and China.\n\nIn a Truth Social post early this morning he said he had authorised a \"90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately\".\n\nPresident Donald Trump speaks at the National Republican Congressional Committee dinner. (AP)\n\nBut he hit out at China for what he called a \"lack of respect that China has shown to the World's Markets\" in justifying yet another tax increase on goods coming from Beijing.\n\n\"At some point, hopefully in the near future, China will realise that the days of ripping off the USA, and other countries, is no longer sustainable or acceptable,\" he said.\n\nIt comes less than 24 hours after White House press secretary Karoline Leavitt said the president would not back down on tariffs.\n\n﻿\"President Trump has a spine of steel, and he will not break,\" she told reporters yesterday. \"The Chinese want to make a deal, they just don't know how to do it.\"\n\nTreasury Secretary Scott Bessent said Trump would keep the 10 per cent so-called \"baseline\" tariff on most countries.\n\nThe 10 per cent figure had been applied to Australia and several other countries based on the US' trade surplus with them but was meaningfully lower than the 20 per cent tariff Trump had set for goods from the European Union, 24 per cent on imports from Japan and 25 per cent on products from South Korea.\n\nStill, 10 per cent would represent an increase in the tariffs previously charged by the US government.\n\nThe significant backdown came after China further lifted its retaliatory tariffs on US goods from 34 per cent to 84 per cent and European Union countries voted in favour of 25 per cent charges on $US23 billion ($38 billion) in goods coming from the US.\n\nAlex Weitzman works on the floor at the New York Stock Exchange in New York, on Wednesday, April 9, 2025. (AP Photo/Seth Wenig)\n\nChina had last night vowed to \"fight to the end\" in an escalating trade war with the US, as it announced it would raise tariffs on American goods to 84 per cent from today.\n\nBeijing added an array of countermeasures after US President Donald Trump raised the total tariff on imports from China to 104 per cent .\n\nPresident Donald Trump, left, shakes hands with China's President Xi Jinping during a meeting on the sidelines of the G20 summit in Osaka, Japan, June 29, 2019. (AP)\n\nIt was yet to react to the latest Trump tariff hike adding further 21 percentage points.﻿\n\n\"If the US insists on further escalating its economic and trade restrictions, China has the firm will and abundant means to take necessary countermeasures and fight to the end,\" the Ministry of Commerce wrote in a statement introducing its white paper on trade with the US.\n\nThe Chinese government declined to say whether it would negotiate with the White House, as many other countries have started doing.\n\nOn Friday, China announced a 34 per cent tariff on all goods imported from the US, export controls on rare earths minerals, and a slew of other measures in response to Trump's \"Liberation Day\" tariffs.\n\nTrump then added an additional 50 per cent tariff on goods from China, saying negotiations with them were terminated.\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nSo far, China has not appeared interested in bargaining.\n\n\"If the US truly wants to resolve issues through dialogue and negotiation, it should adopt an attitude of equality, respect and mutual benefit,\" Ministry of Foreign Affairs spokesman Lin Jian said.\n\nThe paper says that the US has not honoured the promises it made in the phase 1 trade deal concluded during Trump's first term. As an example, it said that a US law that would ban TikTok unless it is sold by its Chinese parent company violates a promise that neither would \"pressure the other party to transfer technology to its own individuals\".\n\nTrump last week signed an order to keep TikTok running for another 75 days after a potential deal to sell the app to American owners was put on ice. ByteDance representatives called the White House to indicate that China would no longer approve the deal until there could be negotiations about trade and tariffs.\n\nChinese President Xi Jinping and US President Donald Trump in Beijing in 2017. (AP)\n\nThe paper also argued that taking into account trade in services and US companies' domestic Chinese branches, economic exchange between the two countries is \"roughly in balance\".\n\nIt says that China had a trade in services deficit with the US of $US26.57 billion ($44 billion) in 2023, which is composed of industries like insurance, banking and accounting. Trump's tariffs were designed to close trade deficits with foreign countries, but those were calculated only based on trades in physical, tangible goods.\n\n\"History and facts have proven that the United States' increase in tariffs will not solve its own problems,\" said the statement from the Chinese commerce ministry.\n\n\"Instead, it will trigger sharp fluctuations in financial markets, push up US inflation pressure, weaken the US industrial base and increase the risk of a US economic recession, which will ultimately only backfire on itself.\"\n\nPresident Donald Trump holds a signed executive order during an event to announce new tariffs in the Rose Garden of the White House, Wednesday, April 2, 2025, in Washington. (AP Photo/Evan Vucci) (AP)\n\nEU imposes new tariffs in retaliation\n\nBefore Trump's backdown, the European Union said its tariffs would go into effect in stages, with some on April 15 and others on May 15 and December 1. The EU executive commission didn't immediately provide a list of the goods.\n\nMembers of the 27-country bloc repeated their preference for a negotiated deal to settle trade issues\n\n\"The EU considers US tariffs unjustified and damaging, causing economic harm to both sides, as well as the global economy,\" they said.\n\n\"The EU has stated its clear preference to find negotiated outcomes with the US, which would be balanced and mutually beneficial.\"\n\nThe head of the EU's executive commission, Ursula von der Leyen, has offered a zero-for-zero tariffs deal on industrial goods including cars. But Trump has said that's not enough to satisfy US concerns.﻿\n\nThe EU was also yet to comment on Trump's latest tariff pronouncement.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/legionnaires-disease-alert-issued-for-sydney-cbd/eeb5c1b8-e9d5-46d4-accd-963e41325599",
        "title": "Legionnaires' disease alert for Sydney CBD",
        "publish_date": "Wed, 09 Apr 2025 22:48:54 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "N﻿SW Health today issued a public alert for Legionnaires' disease in the Sydney CBD, urging people to be wary of symptoms.\n\nSix people, who are not known to each other, have developed Legionnaires' disease after visiting the city centre over the past three weeks.\n\nLegionnaires' disease is caused by infection with Legionella bacteria. Symptoms can develop up to 10 days after exposure and include fever, chills, a cough and shortness of breath.\n\nExposure to the the Legionella bacterium can lead to Legionnaires' disease. (AP)\n\nInfections may lead to severe chest infections such as pneumonia.﻿\n\nOutbreaks sometimes occur when bacteria from environmental sources such as cooling towers atop large buildings become contaminated.\n\nLegionnaires' disease is not spread from person to person.\n\nSouth-Eastern Sydney Local Heath District Public Health Unit director Vicky Sheppeard said the six people have been admitted to hospital.\n\nShe said the source of the infection is not yet known and it is possible not all the cases are linked.\n\nREAD MORE: Multiple eagles shot dead on NSW property\n\nSix people who visited Sydney CBD developed Legionnaires' disease. (Nine)\n\n\"People are exposed if contaminated water particles from a cooling system are in the air and then breathed in,\" Sheppeard said.\n\n\"Those most at risk include elderly people, people with underlying lung or other serious health conditions and smokers.\"\n\nNSW Health is working closely with the City of Sydney, reviewing maintenance records of cooling towers in the CBD area to prioritise towers to be inspected and sampled.\n\nBuilding owners should ensure that their cooling towers are operated and maintained in compliance with regulations,\n\nAnyone feeling unwell should seek medical advice. For non-life-threatening health concerns, call the free service healthdirect on 1800 022 222, available 24 hours a day.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/china-offers-to-work-with-australia-in-response-to-donald-trump-tariffs/4e6908a6-dec1-44fc-ae4c-ad586eafe0ca",
        "title": "China seeks to 'join hands' with Australia to resist Trump",
        "publish_date": "Wed, 09 Apr 2025 20:17:29 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "China wants to join forces with Australia in a bid to boost global trade amid the disruption caused by US President Donald Trump's sweeping tariffs.\n\nThe Chinese government offered overnight to \"join hands\" with Australia in the face of the uncertainty, reports the Sydney Morning Herald .\n\nThe move came as Trump raised the tariffs on Chinese imports to 125 per cent, while announcing a pause on his \"reciprocal\" tariffs to other nations.\n\nChina's ambassador to Australia, Xiao Qian, says his government is willing to work with Australia. Photo: Alex Ellinghausen (The Sydney Morning Herald)\n\nAustralian goods entering the US have been hit with a 10 per cent figure, described by the White House as a \"baseline\" tariff.\n\nNow China's ambassador to Australia Xiao Qian has called for Beijing and Canberra to work together in the hope of defending global free trade.\n\n\"Under the circumstances, China stands ready to join hands with Australia and the international community to jointly respond to the changes of the world,\" he said.\n\n\"In the meantime, China is also committed to working with Australia to implement the strategic consensus reached by the leaders of our two countries.\"\n\nThe ambassador said the Trump administration had \"weaponised\" trade issues and that tweaks to the tariffs imposed on other nations would not be enough to halt the damage to their economies.\n\nUS President Donald Trump speaks at the White House on Wednesday, April 9, 2025, in Washington, after raising tariffs on Chinese imports. (Pool via AP) (AP)\n\nChina's offer to work with Australia comes just five years after it imposed trade sanctions on Australian imports, which targeted goods such as barley, wine, beef, coal and seafood.\n\nTrump's escalating trade war also sparked an emergency meeting between the treasurer and the head of the Reserve Bank of Australia as interest rate cuts appear more and more certain.\n\nJim Chalmers yesterday stepped off the federal election campaign trail to meet with Michele Bullock as markets continued to roil in the face of Trump's global tariffs.\n\nOn Friday, China announced a 34 per cent tariff on all goods imported from the US, export controls on rare earths minerals, and a slew of other measures in response to Trump's \"Liberation Day\" tariffs.\n\nTrump then added an additional 50 per cent tariff on goods from China, saying negotiations with them were terminated.\n\nSo far, China has not appeared interested in bargaining.\n\n\"If the US truly wants to resolve issues through dialogue and negotiation, it should adopt an attitude of equality, respect and mutual benefit,\" Ministry of Foreign Affairs spokesman Lin Jian said.\n\nEU imposes new tariffs in retaliation\n\nBefore Trump's backdown, the European Union said its tariffs would go into effect in stages, with some on April 15 and others on May 15 and December 1. The EU executive commission didn't immediately provide a list of the goods.\n\nMembers of the 27-country bloc repeated their preference for a negotiated deal to settle trade issues\n\n\"The EU considers US tariffs unjustified and damaging, causing economic harm to both sides, as well as the global economy,\" they said.\n\n\"The EU has stated its clear preference to find negotiated outcomes with the US, which would be balanced and mutually beneficial.\"\n\nThe head of the EU's executive commission, Ursula von der Leyen, has offered a zero-for-zero tariffs deal on industrial goods including cars. But Trump has said that's not enough to satisfy US concerns.﻿\n\nThe EU was also yet to comment on Trump's latest tariff pronouncement.﻿\n\n-with Associated Press\n\nShould Australia increase its trade with China? Yes 3431 No 2097",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jeanswest-fire-sale-customers-flock-to-closing-stores/b7a340a7-ccbc-494c-897f-9d1a1b14756b",
        "title": "Three pairs of jeans a minute sold as retailer dumps $20m in stock",
        "publish_date": "Wed, 09 Apr 2025 22:36:08 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "More than 53,000 pairs of jeans have flown off the shelves as customers flock to Jeanswest stores before doors close for good.\n\nThe company is shifting to an online-only platform and closing its bricks-and-mortar stores after entering voluntary administration in March.\n\nSince then, a fire sale to offload existing stock has drawn hordes of customers in, with jeans selling at a rate of almost three per minute, administrators Pitcher Partners said in a media release.﻿\n\nREAD MORE: Multiple eagles shot dead on NSW property ﻿\n\nJeanswest is closing its stores and moving fully online. (Westfield)\n\nA total of 160,000 items have been sold, with 184,000 customers visiting stores and more than 540,000 jumping on the Jeanswest website.﻿\n\nDiscounts are set to continue in the coming weeks as administrators look to shift more than $20 million worth of stock.\n\nThe physical stores will all remain open as the sale continues.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/donald-trump-tariffs-update-us-stocks-shake-in-twitchy-trading-as-bonds-show-more-stress/509e28f1-b4c9-41d3-a05e-8ebaf8baf01f",
        "title": "US stocks soar 7% after Trump pauses some of his tariffs",
        "publish_date": "Wed, 09 Apr 2025 18:08:53 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The S&P 500 was up 7.8 per cent in afternoon trading after the ASX dropped 1.8 per cent to 7375 points by the bell , shaving $40 billion off the market.\n\nThe key American index had been down earlier in the morning amid worries about Trump's trade war and whether it would cause a recession as economists fear. But it spiked immediately after Trump sent the social-media posting that investors have been waiting for.\n\nTraders works on the floor at the New York Stock Exchange in New York, on Wednesday, April 9, 2025. (AP Photo/Seth Wenig)\n\nTrump said that because so many countries had \"not retaliated\" against his latest crank higher in tariffs, he had \"authorised a 90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately. Thank you for your attention to this matter!\"\n\nThe Dow Jones Industrial Average was up 2476 points, or 6.6 per cent, as of 1.35pm Eastern time (3.35am AEST), and the Nasdaq composite was 9 per cent higher.\n\nTrump, though, also said that he was raising tariffs even higher against China, up to 125 per cent.\n\nHuge swings have become routine for financial markets worldwide recently, not just day to day but hour to hour, as investors struggle to game out what Trump's trade war will do to the economy. On Tuesday, the S&P 500 careened between a gain of 4.1 per cent and a loss of 3 per cent for a second straight day of shocking reversals.\n\nWall Street's latest moves came after Trump's latest round of tariffs kicked in after midnight for imports from around the world.\n\nThat included a 104 per cent tax on things coming from China, and the world's second-largest economy quickly retaliated by saying it would raise tariffs on US goods to 84 per cent on Thursday.\n\nPresident Donald Trump speaks at the National Republican Congressional Committee (NRCC) dinner at the National Building Museum in Washington, Tuesday, April 8, 2025. (Pool via AP) (AP)\n\n\"If the US insists on further escalating its economic and trade restrictions, China has the firm will and abundant means to take necessary countermeasures and fight to the end\" the Ministry of Commerce said.\n\nSuch aggressive brinkmanship between the world's two largest economies is raising fears that tariffs will stick around for a while, which economists and investors expect would create a recession. The European Union on Wednesday also approved tariffs affecting $US23 billion ($38 billion) in US goods in its own retaliatory move.\n\nSome hope still does remain on Wall Street that Trump could lower his tariffs following negotiations with other countries, which is what's helping to send stock prices upward at times.\n\nREAD MORE: Treasurer and RBA in emergency meeting\n\nTraders work on the floor at the New York Stock Exchange in New York, Tuesday, April 8, 2025. (AP Photo/Seth Wenig) (AP)\n\n\"BE COOL!\" Trump said on his Truth Social platform shortly after trading began on Wall Street.\n\n\"Everything is going to work out well. The USA will be bigger and better than ever before!\"\n\nSome of Wednesday's strongest action was in the US bond market, where Treasury yields rose sharply again. The yield on the 10-year Treasury climbed to 4.37 per cent from 4.26 per cent late Tuesday and from just 4.01 per cent at the end of last week. It approached 4.50 per cent earlier in the morning. That's a huge move for the bond market and could be an indication of stress.\n\nAnalysts say several reasons could be behind the move, including hedge funds and other investors having to sell their Treasury bonds to raise cash in order to make up for sharp losses in the stock market. Investors outside the United States may also be selling their US Treasurys because of the trade war. Both actions would push down prices for Treasurys, which in turn would push up their yields.\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nRegardless of the reasons behind it, the higher yields on Treasurys add pressure on the stock market and will likely push up rates for mortgages and other loans for US households.\n\nAll the uncertainty about tariffs is already making planning more difficult for big US companies.\n\nDelta Air Lines pulled financial forecasts for 2025 Wednesday as the trade war scrambles expectations for business and household spending and depresses bookings across the travel sector.\n\n\"With broad economic uncertainty around global trade, growth has largely stalled,\" CEO Ed Bastian said in a statement on Wednesday.\n\nTraders work on the floor at the New York Stock Exchange in New York, Tuesday, April 8, 2025. (AP Photo/Seth Wenig) (AP)\n\n\"In this slower-growth environment, we are protecting margins and cash flow by focusing on what we can control.\"\n\nWalmart, though, said it's sticking with its forecasts for sales and operating income over the full year.\n\nIn stock markets abroad, indexes tumbled across most of Europe and much of Asia.\n\nLondon's FTSE 100 dropped 2.2 per cent, Tokyo's Nikkei 225 sank 3.9 per cent and the CAC 40 fell 2.6 per cent in Paris.\n\nChinese stocks were an outlier, and indexes rose 0.7 per cent in Hong Kong and 1.3 per cent in Shanghai.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/greens-leader-adam-bandt-press-club-speech-blames-former-prime-minister-john-howard-for-house-prices/56987aab-033c-4ad0-89ca-5f050eb5a697",
        "title": "Greens leader's scathing insult against former PM",
        "publish_date": "Wed, 09 Apr 2025 06:34:32 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Greens leader Adam Bandt has vowed to compel a potential minority Labor government to fight to reverse \"political bastardy\" from previous leaders, which he claims has led to a housing market crisis.\n\nBandt spoke today at the National Press Club and singled out former Prime Minister John Howard as \"perhaps the biggest bastard of them all\" as he pledged action on skyrocketing house prices and fixing capital gains tax.\n\nHoward halved capital gains tax for individuals in 1999, effectively making it easier for investors to snap up multiple properties.\n\nGreens leader Adam Bandt said a minority Labor government would focus on capital gains tax and negative gearing. (ABC News)\n\nBandt said in the event of a hung parliament, priority would be implementing the Greens proposal of grandfathering and restricting negative gearing and the 50 per cent capital gains tax to one property by the end of this year.\n\nBandt slammed Howard's move to introduce the capital gains tax discount as the reason why house prices are now eight times the average person's income.\n\n\"Former Treasury Secretary Ken Henry warned us that willful acts of bastardry from successive governments - including failing to fix capital gains tax to make housing more affordable - are robbing young people of their future,\" Bandt said.\n\n\"If we don't stop the bastards, house prices will get further and further out of reach. Rents will continue to keep rising.\n\n\"And there will be fewer and fewer genuinely affordable places to live.\"\n\nFormer PM John Howard halved capital gains tax for individuals in 1999. (The Sydney Morning Herald)\n\nREAD MORE: Trump pushes tariffs on China to shocking 104 per cent\n\nBandt then touched on arguably the second biggest election issue of the moment: Trump's ongoing trade war and the Australian markets going into meltdown.\n\nHe said Trump's tariffs and the market volatility it has spurred could further push house prices up unless something is done post-election.\n\n\"This reform has always been urgent, but the threat of a Trump-fuelled attack on Australian renters and first home buyers in the next few months now makes this a matter of housing life and death,\" Bandt continued.\n\n\"The Greens' plan would see negative gearing and capital gains tax discounts scrapped for wealthy property investors but preserved for what are often called mum-and-dad investors, with one investment property.\n\n\"John Howard left us a time bomb. It needs to be defused.\"\n\nBandt slammed Howard's move to introduce the capital gains tax, which he said has led to unaffordable homes. (Henry Zwartz)\n\nHe said a minority government would untether itself to Trump and the US, including re-assessing its relationship with the current US administration.\n\nBandt's fiery speech ended with a declaration that Trump is among the \"powerful losers\" making the world burn.\n\n\"At the moment, I get that a lot of people are really worried about what is coming out of the White House. There is a great deal of fear and apprehension,\" he said.\n\n\"To paraphrase Bec [Shaw], we're watching the world being burned down by powerful men - we just didn't know they would be such losers.\"\n\nBandt quoted a January headline written by freelance journalist Shaw in The Guardian which read: \"I knew one day I'd have to watch powerful men burn the world down – I just didn't expect them to be such losers.\"\n\nHis reference drew laughter in the press club before Bandt switched to a more serious note.\n\n\"But seriously – people are holding their loved ones close,\" the Greens leader said.\n\n\"People are flicking through news articles in their feeds because it is too distressing.\n\n\"People are thinking about their future. And my message would be – you're not alone.\"\n\n9news.com.au has reached out to Howard for comment.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/high-court-native-timber-logging-tiny-marsupials-win-big/223058be-3564-4d34-9b7e-9d425bf4b104",
        "title": "Three tiny marsupials win big against major industry in High Court",
        "publish_date": "Wed, 09 Apr 2025 03:34:26 +0000",
        "category": "finance",
        "authors": [
            "Luke Costin",
            "Apr"
        ],
        "text": "The native timber industry has been dealt a blow by the High Court as it kept the door open for environmental groups to prosecute law-breaking loggers.\n\nToday's decision, centring on a battle to protect habitat for three types of gliders, was immediately described as a \"huge win\" for native forests and the community at large.\n\nThe nation's highest court upheld a NSW court's decision allowing private people or entities to bring cases to enforce state forestry laws.\n\nThe native timber industry has been dealt a blow by the High Court as it kept the door open for environmental groups to prosecute law-breaking loggers. (Rick Stevens)\n\n\"This marks the end of the rule that only the Environment Protection Authority can prosecute the Forestry Corporation for their illegal logging,\" environmental law expert and Greens MP Sue Higginson told AAP.\n\n\"No longer will internal government deals protect the Forestry Corporation from being prosecuted for their illegal actions.\n\n\"This is a huge win for South East Forest Rescue, the community at large, and especially for our precious native forests.\"\n\nSEFR says it has damning evidence of illegal activities in NSW state forests and the High Court challenge by Forestry Corporation was an attempt to avoid answering it.\n\nIts case sought to minimise the effects of forestry operations on three forest-dependent marsupials living in southeast Australia: the southern greater glider, yellow-bellied glider and squirrel glider.\n\nThe southern greater glider, which is about the size of a house cat, is listed as endangered while the other two are considered endangered in some areas and vulnerable elsewhere.\n\nForestry Corporation, which manages NSW's native timber and plantation industry, had argued third parties had no standing to bring civil enforcement proceedings.\n\nREAD MORE: ﻿ Australian home values climb by 39 per cent over the past five years\n\nForestry Corporation had argued third parties had no standing to bring civil enforcement proceedings. (AP)\n\nBut the High Court found cases could be brought by people whose private interests were affected or who has a special interest, such as long-standing concern about logging and its effect on certain species.\n\nThe case will now return to the Land and Environment Court later this year.\n\nSEFR is seeking court orders to restrain Forestry Corporation from logging in NSW north and south coast state forests unless proper surveys for greater gliders, yellow-bellied gliders, and squirrel gliders are completed, and appropriate protections around their den trees are put in place.\n\nThe High Court judgment is another blow to the native logging industry in Australia.\n\nThe industry has been haemorrhaged money in NSW amid environmental court battles and faces large swathes of forest being protected from logging in a proposed Great Koala National Park.\n\nVictoria ended native forest logging in 2024, as did Western Australia, the home of sought-after karri, jarrah and wandoo woods.\n\nThe WA government said the closure reflected the changing climate and community attitudes about an \"unsustainable\" part of the industry.\n\nTasmania plans, however, to capitalise on mainland jitters, pledging to let loggers into up to 40,000 hectares of native forest previously set aside as a \"wood bank\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/markets-today-what-to-do-in-the-face-of-financial-market-uncertainty/c7a59493-708d-4139-a8ef-eca23aa4ab17",
        "title": "What to do in the face of financial market uncertainty",
        "publish_date": "Wed, 09 Apr 2025 04:55:32 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Financial markets don't like fear and uncertainty, which become a vicious self fulfilling prophecy. The more value that's shed, the greater the fear and uncertainty, as the markets tumble lower and lower.\n\nThe falls we're seeing on global share markets right now are on a scale not seen since the dark days of the Covid induced lockdowns five years ago. This time the panic is being triggered by one thing - US President Donald Trump's tariffs that he calls \"beautiful\".\n\nBeauty of course is in the eye of the beholder, and there's nothing beautiful about the bloodbath of Wall Street shedding around 10 per cent, or Australian losses of more than 7 per cent since the global reciprocal tariffs from the US were announced.\n\nFinancial markets globally have collapsed in recent days. (AP)\n\nThe tariffs themselves are not a surprise. They were a major part of Donald Trump's re-election platform where he repeatedly vowed to impose tariffs to pay for tax cuts for all Americans.\n\nThe size of the tariffs though has come as a surprise. Many traders also wrongly assumed that tariffs would simply be used as a bargaining tool to get what Donald Trump wants because bluff and bluster is the way he's previously done business.\n\nThis time though the threat is being delivered, with no exceptions. Tariffs are being imposed on every country around the world, friend or foe.\n\nIn a direct sense, Australia has gotten off pretty lightly. America is not a big market for our exports, making up around 6 per cent of our trade, so the 10 per cent tariffs we've been hit with won't do much damage to our economy.\n\nThe real damage will come from the impact of much higher tariffs on our largest trading China, which has escalated the trade war with the US by imposing retaliatory tariffs on US goods, and now Donald Trump is threatening to hit China again.\n\nThat vicious cycle rears its ugly head again, and there are no winners from a trade war, only the prospect of a global recession.\n\nREAD MORE: Trump pushes tariffs on China to shocking 104 per cent\n\nWall Street has lost a tremendous amount of money in the past week. (AP)\n\nSo as fear and uncertainty sends financial markets into freefall, what should investors and retirees, or those approaching retirement be doing, as we see the value of share portfolios and superannuation accounts also plummet?\n\nWhat we shouldn't do is panic - which is easier said than done if you don't have time on your side to wait for markets to come back up, which they will do eventually. History shows that as economies and wages grow, markets rise, despite the periodic falls triggered by wars or pandemics or the complete upheaval of global trade that Donald Trump is trying to engineer.\n\nDo you think the world is heading towards a recession? Yes 12974 No 1660\n\nIf you manage your own investments, this is a timely reminder to consider dialling down the amount of risky assets you hold, particularly if you're approaching retirement age. Having a cash buffer can also help to avoid having to sell off assets that have seen their value plunge.\n\nInvestments are for the long term, and the trend is your friend when it comes to financial markets. What goes down should eventually come back up. It's just a matter of when and not panicking, so you miss out when the uptick begins.\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/outback-mates-save-lizard-trapped-in-softdrink-can/105159634",
        "title": "Lizard rescued from drink can by sharp-eyed outback mates",
        "publish_date": "Thu, 10 Apr 2025 01:55:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Travelling along a dusty outback road in north-west Queensland, a peculiar sight caught Finn Cain's eye.\n\nNot a tumbleweed, but a soft drink can seemingly blowing across the track.\n\nThe 18-year-old apprentice boilermaker felt something about the scene did not look quite right.\n\nHe urged his friend Clayton Tait, 19, who was driving, to pull over.\n\n\"I was like 'Don't run over that can — there's a lizard in it',\" Mr Cain said.\n\n\"He hit the brakes and swerved out of the way.\"\n\nThe young men quickly reversed and hopped out the car to find there was, indeed, a lizard stuck in a can.\n\nFinn Cain and Clayton Tait discovered the lizard while driving in the outback. (Supplied: Finn Cain)\n\nThey grabbed the can as the lizard thrashed trying to dislodge itself, its head fully engulfed.\n\n\"It was pretty distressed, obviously couldn't see where it was going,\" Mr Cain said.\n\nMr Cain initially suggested taking the reptile to a local vet, but seeing it had \"no cutting or scarring\", it was Mr Tait, a station hand, who decided to take action.\n\n\"Luckily Clayton has some wire cutters in the car, and we cut of a hole in the can at first so it could see, making sure we didn't put it in any more danger than it was already in,\" Mr Cain said.\n\n\"He was brave enough to pick it up and cut the can off its head.\"\n\nAfter quickly releasing the captive from the can, the young men sent the lizard on its way.\n\nThe scared lizard quickly ran back into the scrub after its release. (Supplied: Finn Cain)\n\n\"He looked pretty unscathed, and he was happy to run back into the scrub,\" Mr Cain said.\n\n\"A one-in-a-million chance to be there at the same time that he's crossing the road.\"\n\n'Make an effort', don't litter\n\nMr Cain said he posted the video of the rescue on social media to remind people of the consequences of littering.\n\n\"It's important to spread that sort of thing, that we shouldn't just be mindlessly, throwing things out of the window,\" he said.\n\nFinn Cain credits his family for his attitude towards the environment. (Supplied: Finn Cain)\n\n\" It's just going to destroy the world, if we don't recycle and dispose of rubbish correctly. \"\n\nMr Cain credits his grandparents and camping trips with the \"older parts of the family\" for instilling in him a sense of care for the environment.\n\n\"They always drill it into you,\" he said.\n\n\"I go out hunting with my uncle, and he says, 'If people keep coming onto these properties and are going to mindlessly wreck it by littering, they're just going to shut and lock the gates.'\n\n\"We need to definitely make an effort not to wreck it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/why-donald-trump-blinked-on-tariffs/105159270",
        "title": "The White House is spinning this as 'the art of the deal', but Trump isn't",
        "publish_date": "Thu, 10 Apr 2025 01:17:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The way one Republican senator sees it, angels and demons have both been whispering in Donald Trump's ears lately.\n\nPerched on one shoulder, the demons have been appealing to Trump's long-held love of tariffs. They've been telling him to keep even his toughest tariffs in place for the long haul, to wall out cheap imports, raise trillions in taxes and revive American manufacturing.\n\nOn the other side, the angels have been appealing to Trump's long-held love of deal-making. They've been telling him to take advantage of world leaders' desperation to appease him, and to reduce some of his biggest tariffs in return for their offers soon.\n\nTexan senator Ted Cruz has been using the angels-and-demons analogy to illustrate the two competing schools of thought in the White House.\n\nSome Trump advisers see tariffs as temporary bargaining chips. Others want more permanent protectionism.\n\nCruz has been in the angels' camp.\n\nTexas senator Ted Cruz has been using the angels-and-demons analogy to illustrate the two competing schools of thought in the White House on tariffs. (Reuters: Randall Hill)\n\n\"What I'm urging is for the president to come and make major deals and make them quickly,\" he said on his podcast on Monday. \"To calm the stock market down, a few major deals quickly would really, really help.\"\n\nBut it's been hard to know where the president's thinking sits. Plummeting markets had clearly been fearing the \"demon\" approach.\n\nWhen Trump was asked earlier this week if his tariffs were locked in or up for negotiation, he said both things could be true.\n\n\"There can be permanent tariffs and there can also be negotiations,\" Trump said.\n\nGoing around the wall\n\nShortly after Trump paused his \"reciprocal\" (but not actually reciprocal) tariffs, the White House began framing the move as part of a master plan.\n\nTreasury Secretary Scott Bessent described Donald Trump's \"reciprocal\" tariffs regime as a \"successful negotiating strategy\". (Reuters: Nathan Howard)\n\n\"We saw the successful negotiating strategy that President Trump implemented a week ago today,\" said Treasury Secretary Scott Bessent, who is known to favour a more targeted approach to tariffs.\n\nWhat is a tariff? A tariff is a tax on a product imported from another country\n\nfrom another country It is paid to the government by the company that imports the product\n\nthat imports the product A tariff is generally calculated as a percentage of the price paid by the importer to the foreign seller\n\npaid by the importer to the foreign seller Historically, tariffs have pushed up prices because higher product costs are often passed on to consumers\n\nPress secretary Karoline Leavitt — who on Monday called reports of a possible pause \"fake news\" — told reporters they'd \"clearly failed to see what President Trump is doing here\".\n\n\"Many of you in the media clearly missed The Art of the Deal,\" she said, a reference to Trump's 1987 business memoir, in which he advocates doing \"anything within legal bounds to win\".\n\nBut later, when Trump himself was asked why he'd hit the pause button, he said it was because \"people were jumping a bit out of line\".\n\n\"They were getting a little bit yippy, a little bit afraid,\" he said outside the White House.\n\nAnd when he was asked if the markets had anything to do with the decision, he responded by saying he'd been \"watching the bond market\".\n\n\"The bond market right now is beautiful,\" he said. \"But, yeah, I saw last night where people were getting a little queasy.\"\n\nHe was also asked about his credibility after the \"fake news\" pause became real news.\n\n\"You have to have flexibility,\" Trump said.\n\n\"I could say, 'Here's a wall and I'm going to go through that wall. I'm going to go through it no matter what.' Keep going and you can't go through the wall. Sometimes you have to be able to go under the wall, around the wall, or over the wall.\"\n\nA win for the angels?\n\nEven if we accept today's turnaround was always on the cards, there's clearly been tension in Trumpland over which path the president should take.\n\nLoading...\n\nOne of Trump's \"angels\", Cruz says, is Elon Musk, the president's DOGE sidekick who has been making his reservations about tariffs well known.\n\nThat would make Trump's trade adviser Peter Navarro a \"demon\".\n\nNavarro is known to be tariffs hardliner. He's likely a big part of the reason Australia's found it so hard to get any exemptions despite its trade deficit with the US.\n\nHe's also a \"moron\", according to Musk.\n\n\"Navarro is dumber than a sack of bricks,\" he tweeted this week, leading to Leavitt's \"boys will be boys\" press briefing in which she acknowledged the \"diverse\" competing voices in Trump's inner circle.\n\nTrump loyalist Peter Navarro is a big believer in tariffs. (Reuters: Kevin Lamarque)\n\nThe pause could be seen as a win for the White House \"angels\".\n\nThey will now be hoping to see some deals struck soon, with concessions from trade partners Trump will be able to portray as big wins.\n\nTrump says more than 75 countries now want to negotiate. Strategic Asian partners such as Japan and South Korea look to be near the head of the queue for talks.\n\nAustralia is in a good position too, though the 10 per cent minimum tariff still could prove tricky to negotiate away.\n\nBut a big part of what happens next will come down to which voices Trump chooses to listen to.\n\nAn awful lot can happen in 90 days.\n\nJust look at how Trump's changed America and the world in the 80 since he became president.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/olympic-games-increases-women-s-quota-places-to-outnumber-men/105159386",
        "title": "Women to be in majority at Olympics for first time in LA",
        "publish_date": "Thu, 10 Apr 2025 01:12:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Female athletes will be in the majority at an Olympics for the first time at the 2028 Los Angeles Summer Games.\n\nThe International Olympic Committee (IOC) confirmed that there would be 5,333 core quota spots for female athletes (50.7 per cent) and 5,167 for men.\n\nThe landmark announcement saw the women's football tournament expanded to 16 teams from 12, while the men's competition would shrink from 16 to 12.\n\nFootball has been a key part of the Games since being held as a demonstration sport at the 1900 and 1904 Games and officially becoming a medal sport in 1908.\n\nThe Games of 1924 and 1928, both won by Uruguay, were considered by FIFA as the official championships of the world but, spurred into action by the popularity of football matches at the Games and the increasing professionalism of the game — which was at odds with the Olympic ideal of amateurism — FIFA swiftly arranged its own tournament in 1930.\n\nWomen's football has long considered the Olympics a major part of the international calendar, while on the men's side it has long paled in comparison to the FIFA World Cup.\n\nWhile women's teams regularly appear at full strength, the men's tournament is limited to a majority under-23 squad, with only three over-age players permitted per squad.\n\nThe USA won their fifth Olympic gold medal — most of any nation in men's or women's football — in Paris. (Getty Images: ISI/John Todd)\n\nThe IOC said the reason for the sharp increase in women's soccer teams was the rapidly growing popularity of women's team sports, especially in the United States, and that change in the competition format reflected that rapid growth.\n\n\"We wanted to do something to reflect that growth and equally with the United States being the home of the highest level of popularity of women's football,\" IOC sports director Kit McConnell told a press conference.\n\nThe ascendancy of the women's tournament will take place 32 years on from the first women's Olympic football tournament which took place in Atlanta in 1996.\n\nThat was won by the USA, the first of their record five titles, including the gold they won in Paris last year.\n\nMcConnell said the IOC had discussed the issue with both LA Games organisers and world soccer's governing body FIFA before going through with the changes.\n\nAdditionally, two more women's teams were added in water polo — which Australia won the silver medal in Paris — so it would gain parity with the men's event at 12 nations each.\n\nAustralia's women's water polo team won silver in Paris. (Getty Images: Adam Pretty)\n\nWater polo was first contested by women at an Olympics in 2000, where Australia won gold in the six-team tournament at Sydney.\n\nMen's water polo has appeared at every Olympics since 1900 and has featured 12 teams since 1976.\n\nBoxing, which only recently had its continued status as an Olympic sport confirmed, will have one extra women's weight class to equal the men's line-up of seven medal events.\n\n\"The message of gender equality is a really important one for us,\" McConnell said.\n\n\"We really thank LA 28 for supporting this. It's central to their vision as well.\"\n\nThe Paris Olympics saw an equal number of events for men and women for the first time at a Games, the culmination of a 128-year battle for equality.\n\nHow one woman changed the course of Olympic equality Photo shows Alice Milliat sits and looks to one side At the Paris 2024 Olympic Games, men and women are represented equally for the first time, thanks in part to a French pioneer who helped force the IOC and World Athletics to recognise female athletes.\n\nAfter first competing at the 1900 Games, women were only able to compete for a medal in every event at a Games in 2012.\n\nThe LA Games will have a total of 351 medal events in all sports, a new record for a Summer Games and 22 more than at the Paris 2024 Olympics.\n\nOf those, 161 will be for women, 165 for men, with 25 mixed events — an increase on six from Paris.\n\nThe total number of athletes is unchanged at 10,500.\n\nThose mixed events include the expansion of the Olympic golf competition to include a mixed teams event, which could see Aussie siblings Min Woo and Minjee Lee team up.\n\nBoth Lee siblings competed in Paris, but with a men's and women's tournament organised separately, were unable to compete together.\n\nMinjee Lee and Min Woo Lee were both selected to compete at the Paris Olympics. (Getty Images: David Cannon)\n\n\"The International Golf Federation is thrilled with the IOC Executive Board's decision to approve the addition of a mixed-team event to the Olympic Golf program,\" the IGF said in a statement, adding that more details would be released next week.\n\nAnother key addition includes a mixed 4x100m relay on the athletics track to go alongside the existing 4x400m mixed relay.\n\nArtistic gymnastics, coastal rowing, table tennis and archery will also feature new mixed team events.\n\nSwimming, meanwhile, will feature 50m sprints across butterfly, breaststroke and backstroke for the first time, not just freestyle.\n\nAt the last World Aquatics Championships in Doha in 2024, Australia won four medals across the six finals, including two golds: Isaac Cooper (50m back gold), Iona Anderson (50m back silver), Sam Williamson (50m breaststroke gold) and Cameron McEvoy (50m fly bronze).\n\nKaylee McKeown is the world record holder in the 50 metre backstroke. (Getty Images: Maddie Meyer)\n\nKaylee McKeown, who did not compete at the Worlds in 2024, is the current 50m backstroke world record holder.\n\nThe five sports proposed by the LA Games organising committee — baseball/softball, cricket, flag football, lacrosse and squash — will have an extra 698 quota places.\n\nThe landmark progress for women athletes was made at an online board meeting on Wednesday co-chaired in Lausanne for the first time by Kirsty Coventry as president-elect since her win last month.\n\nIn June she will formally replace her mentor Thomas Bach and become the IOC's first female leader in its 131-year history.\n\nABC/Wires\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/nsw-legionnaires-disease-alert-sydney-cbd/105159464",
        "title": "Health warning for people who have been in Sydney CBD over past 10 days",
        "publish_date": "Thu, 10 Apr 2025 01:05:31 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Anyone who has visited Sydney's CBD in the past 10 days has been told to monitor for symptoms of the potentially deadly Legionnaires' disease after six people were hospitalised.\n\nLegionnaires' disease is a severe form of pneumonia that typically develops once a strain of bacteria named Legionella pneumophila (Legionella) infects the lungs.\n\nThis bacteria is not spread from person to person but through aerosols.\n\nNSW Health South Eastern Sydney Local Heath District Public Health Unit director Vicky Sheppeard said the six cases \"have a common factor of being in the Sydney CBD during their exposure period\".\n\nA microscopic close up of Legionella pneumophila, the strain of bacteria largely associated with legionnaires' disease. (Supplied: Centers for Disease Control and Prevention)\n\nThose who have been in the CBD over the past week and a half are urged to remain alert for any symptoms of the disease including fever, chills, a cough and shortness of breath.\n\nLegionnaires' disease takes between two to 10 days to develop following exposure, according to Dr Sheppeard.\n\nPeople who have been in the CBD who develop symptoms during this period are urged to visit their GP to get tested and receive treatment.\n\nInvestigation into source\n\nMore than 500,000 people work in the CBD area, according to the Australian Bureau of Statistics.\n\nOutbreaks sometimes occur when bacteria from cooling towers in large buildings become contaminated.\n\nWhy are cases of legionnaires' disease growing in Australia? Photo shows Adelaide researcher Dr Michael Taylor has found legionella bacteria can live on their own Over the last three decades, legionnaires' disease has surged both in Australia and across the world, with experts not certain what's behind the increase.\n\nDr Sheppeard said NSW Health was working with the City of Sydney to investigating cooling towers in the city.\n\n\"When we see a cluster of new infections like this, we often find that there's a cooling tower that is contaminated with the bacteria,\" she said.\n\n\"We're actively taking steps to identify that tower and have it cleaned so other people don't become ill.\"\n\nNSW Health has advised building owners to ensure their cooling towers are operated and maintained in compliance with health regulations.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/how-to-wash-school-backpacks-insulated-lunch-boxes-bags/105146786",
        "title": "Machine or hand wash? How to clean backpacks and fabric lunch boxes",
        "publish_date": "Thu, 10 Apr 2025 01:05:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Leaking water bottles, pen ink, the rotting juice from an old banana, school backpacks and lunch boxes can get pretty grotty.\n\nWestern Sydney mother-of-two Minakshi Gajera has cleaned all kinds of stains and spills in her children's school bags and fabric lunch boxes.\n\nThe home cleaning enthusiast and content creator from Dharawal lands says she likes to give them a thorough clean at the end of each term.\n\n\"It's like full of crumbs, sticky wrappers and God knows the mysterious stains in it, they even smell bad,\" she says.\n\nHere's some expert advice on the best and easiest way to clean backpacks and fabric lunch boxes so they're ready for when school returns.\n\nRead the bag's label\n\nThis is the first step before cleaning any materials, according to textiles expert Dr Rebecca Van Amber from RMIT's School of Fashion and Textiles in Melbourne, on Taungurung lands.\n\n\"You don't always know what the bag is made of, so it's definitely best to have a look and see what the manufacturer's instructions are,\" she says.\n\nExperts say you should always read the care instructions on bags and lunch boxes before washing them. (Supplied: Minakshi Gajera)\n\n\"There might be materials in the bag that shouldn't be dry cleaned, or maybe they shouldn't be submerged or soaked, that sort of thing.\n\n\"If you have a bag that has any sort of smart capabilities, that means it probably has some electronic components and you definitely don't want those to get wet.\"\n\nShe says if you are in any doubt, you can contact the manufacturer to see what they recommend.\n\nCan I use a washing machine?\n\nOur experts say this method can be OK, but it is not recommended for all types of bags or washing machines.\n\n\"Sometimes backpacks have internal frames,\" says Dr Van Amber. \"You wouldn't want to put anything like that in your washing machine.\"\n\n\"[But] I put makeup bags and things through my washing machine all the time, because they're small, they're soft, they're pretty much fabric.\"\n\nSydney content creator Minakshi Gajera has cleaned all kinds of stains and spills in her children’s school bags and fabric lunch boxes. (Supplied: Minakshi Gajera)\n\n\"Especially if it's like an old school sort of canvas backpack or something that's maybe a lightweight nylon backpack.\n\n\"They're very much in that textile category and I think those will be fine to put through your washing machine.\"\n\nBut she says to avoid using washing machines with a central agitator as that may damage the bag.\n\nMinakshi starts by emptying the bag completely, removing any tags or key rings and giving it a good shake to get rid of dust and crumbs.\n\n\"I put it inside a pillowcase or laundry bag and then wash it on a gentle or delicate cycle,\" she says.\n\nDr Van Amber says any regular laundry detergent is fine, but you could opt for detergent designed specifically for sports clothes.\n\n\"Something that would be suitable for like your athletic wear, is going to be probably suitable for your backpack as well because they're essentially made out of the same types of materials,\" she says.\n\nHow do I hand wash and remove stains?\n\nBrisbane mother Susie Myers designs and develops schoolbags and lunch boxes for a living.\n\nShe recommends starting with a small vacuum cleaner to get out any built-up dirt or crumbs in the bags before washing.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\n\"On our backpacks, we have care labels which specify sponge cleaning and on our lunch bags we say machine washable,\" she says,\n\nFor sponge cleaning she suggests \"using a damp cloth, a bit of mild detergent or soap in water and doing a spot clean\".\n\n\"That means just getting in where there's any heavy use areas like … straps and the bottom of the bags or internally giving it really good wipe out,\" she says.\n\nShe recommends wiping out insulated, fabric lunch boxes every day and giving them a heavier clean in the washing machine every three weeks.\n\nDr Van Amber says hand washing is a good method for most types of bags and lunch boxes.\n\nDr Van Amber says hand washing is a good method for most types of bags and lunch boxes. (ABC Lifestyle: Jo Joyce)\n\n\"I would probably be soaking it in my bathtub (or laundry tub) with a bit of regular laundry detergent for a couple of hours,\" she says.\n\n\"Then give it a rinse and let it dry outside.\"\n\nIf it needs more than that, she suggests using a soft brush on it after soaking, rinsing then repeating the process with fresh water.\n\nMs Myers says for mould prevention and mould stains; you can also add a cup of white vinegar into the wash itself.\n\nIf there are ink or other stains Dr Van Amber says you can use a laundry stain removal stick and a toothbrush.\n\n\"Like you would do with clothing if you had a really difficult stain on an item.\"\n\nBe cautious of scrubbing screen-printed images or logos, as you risk removing them.\n\nHow do I dry the bags?\n\nOnce washed, Dr Van Amber says it is best to let bags dry outside.\n\n\"Line drying outside is definitely the best way to go,\" she says.\n\n\"If it's not in your washing machine and going through a spin cycle, it's going to be really saturated with water.\"\n\nMs Myers says making sure bags dry completely is important to prevent mould growing. (ABC Lifestyle: Jo Joyce)\n\nShe says the dryer and iron should be avoided as \"bags are often made of synthetic materials that will melt\".\n\nMs Myers says making sure bags dry completely is important.\n\n\"You've really got to make sure that there's a lot of ventilation [and] you're getting the internal parts as dry as the external parts, because any moisture is going to cause potential growth of mould.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/north-coast-white-spot-detection-prawns/105154396",
        "title": "Prawn disease resurfaces just as two-year bans were about to end",
        "publish_date": "Thu, 10 Apr 2025 01:05:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prawn fishers on the New South Wales North Coast are devastated after white spot disease was discovered in wild offshore populations just as a two-year ban was set to come to an end.\n\nThe NSW Department of Primary Industries and Regional Development (DPIRD) has been undertaking surveillance on the Clarence, Richmond and Evans river zones to prove the areas were free of the disease.\n\nNSW DPIRD says it has been undertaking a rigorous sampling regime for white spot. (Supplied: Department of Primary Industries, Ian Boutell)\n\nA positive detection of white spot in the Clarence offshore area was confirmed on Friday, while preliminary positive results have been returned from the Richmond and Evans offshore zones.\n\nA control order placed on the Clarence River was due to lift in June, but the latest detection has put those plans on ice.\n\nWhite spot has been detected in wild-caught prawns sampled from offshore areas on the North Coast. (Supplied: DigsFish Services)\n\nThe two-year proof of freedom process began for the Evans and Richmond Rivers in October last year.\n\nLocal fishers devastated\n\nClarence River Prawn Committee chair Glenn Dawson said the news broke as fishers were gearing up to get back into business after nearly two years of being unable to sell green prawns.\n\nWith about 70 prawn fishers in the affected area, he said the local industry might not survive another two years of shutdown.\n\n\"There's a lot of the vessels that are still sitting in the water for two-and-a-half years and they will have to come out this year at some stage to be maintained,\" he said.\n\nPrawn fishermen were hoping to be back on the Clarence River in June. (ABC Rural: Kim Honan)\n\n\" The fishermen are doing it tough now after two years, so where that money's going to come from is unknown. \"\n\nA ban on the sale of green prawns from the affected areas will remain in place until it can be confirmed the area is free of the disease.\n\n\"The thought at the moment is that it's come from the north during the catastrophic weather event that we've just had,\" Mr Dawson said.\n\n\"But that's yet to be determined where it's come from, the genomic strains will be identified in the next week or so and we can identify which strain it's linked to.\"\n\nDPIRD executive director of biosecurity and food safety, Lisa Szabo, said the department \"might have to consider\" extending the bans.\n\n\"We haven't been able to gather all of the negative results which we needed to show that we have proof of freedom of white spot disease in this area,\" she said.\n\n\" Until we get that proof of freedom, those control orders will remain in place. \"\n\nYamba-based fisherman Troy Billin said the detections came as a shock.\n\nTroy Billin says the white spot detection will bring the local prawn industry to its knees. (Landline: Sean Murphy)\n\n\"It's taken its toll on a lot of people, it's ruined a lot of businesses and now the possibility of another two years,\" he said.\n\n\"The school prawns are a small part of my business, I usually do green school prawns, so that wipes that part of my business out.\"\n\nMr Billin said affected prawn fishers should be compensated.\n\n\"It stems from a biosecurity issue that happened a while ago where the ball was the dropped, definitely not by the fishermen but the fishermen pay the price,\" he said.\n\n\" It's been a sustainable fishery for 80 odd years, the school prawn fishery here in the Clarence, and this is just going to bring it to its knees. \"\n\nFuture unclear\n\nNSW DPIRD is considering options to continue seeking proof of freedom for river fishing, while excluding the offshore area.\n\n\"That's the only hope that we've got of going back to work in the next two years,\" Mr Dawson said.\n\nPrawn fishermen met with representatives from the NSW Department of Primary Industries and Regional Development. (Supplied: Richie Williamson)\n\nMs Szabo said that plan would require federal approval and would not be possible by June.\n\n\"We will need to present a whole lot of evidence to our national colleagues and then ultimately it would be the Australian government that needs to be satisfied that the evidence is very sound, that they could make a declaration of proof of freedom and take that to the World Organisation for Animal Health,\" she said.\n\n\"So that's quite a few months' work ahead of us.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/matthew-dellavedova-signs-with-sydney-kings-in-nbl-free-agency/105159778",
        "title": "Dellavedova signs with the Kings in major coup for NBL heavyweights",
        "publish_date": "Thu, 10 Apr 2025 00:35:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Sydney Kings have taken a huge leap to regaining NBL heavyweight status by signing NBA champion Matthew Dellavedova on a three-year deal.\n\nRecently crowned MVP of the NBL championship series, Dellavedova left Melbourne United after two seasons to join the Kings, shunning interest from the Brisbane Bullets and Perth Wildcats.\n\nThe contract is the NBL's most significant since the free agency period officially began on April 4.\n\nDellavedova is one of the NBL's only out-and-out point guards and is highly-regarded for his defensive grit and on-court effort.\n\nThe 34-year-old country Victoria product joins a Kings roster smarting from its sudden-death loss in last year's play-in tournament in Brian Goorjian's first season back at the helm.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe lines up alongside the likes of Xavier Cooks, Shaun Bruce and Bul Kuol on the roster for the upcoming campaign, set to tip off in September.\n\n\"It's going to be a fun and exciting next chapter for me, and being the competitor I am, I'll do everything I can to make it a successful one,\" Dellavedova said.\n\nDellavedova was a member of the Cleveland Cavaliers team that won the 2016 NBA championship alongside LeBron James and a bronze medallist with the Boomers at the Tokyo Olympics.\n\nThe Kings now turn their attention to the remainder of their roster, with a centre looming as a high priority for Goorjian's second season at the helm.\n\nThe club must also make a decision on the future of free agent role player Makuach Maluach and whether or not to make a play at re-signing imports Cam Oliver and Jaylen Adams.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/small-things-like-these-review-cillian-murphy-claire-keegan/105146088",
        "title": "Cillian Murphy has used his fame to tell a very Irish tragic tale",
        "publish_date": "Thu, 10 Apr 2025 00:16:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "If Hollywood works the way it does in the popular imagination, then Cillian Murphy presumably could have cashed in his Oscar-winning performance in Oppenheimer for any number of leading-man offers: the dreamy, conflicted man of science presiding over an apocalyptic thriller; a brooding hit-man dispensing existential bon mots over bone-crunching beat-downs; a galaxy-eyed supervillain in the next multi-million dollar Marvel movie that nobody in particular cares about.\n\nFast facts about Small Things Like These What: In 1985, an Irish coal merchant discovers a dark secret at a convent whose sisters wield power over the town. Starring: Cillian Murphy, Emily Watson, Eileen Walsh, Zara Devlin Director: Tim Mielants When: In cinemas now Likely to make you feel: Quietly moved\n\nInstead, he's done what any self-respecting Irishman with limited interest in stardom might do, and returned to his homeland — and to his old collaborators — for a sombre, knitwear-clad drama about a family man wrestling with the dark secrets preying on a small town. (Proving his dedication, Murphy actually pitched the project to co-producer Matt Damon while on the set of Christopher Nolan's blockbuster.)\n\nIn Small Things Like These — which is based on Claire Keegan's acclaimed, prize-winning 2020 novel — Murphy is all gloomy grey beanies and dirty fingernails as Bill Furlong, a hardworking coal merchant and well-loved father of five girls in the quiet, drizzly Irish town of New Ross.\n\nIt's Christmas 1985, although aside from the sound of 'Come On Eileen' squeaking from a pub jukebox, the sleepy port town might as well exist out of time.\n\n\"[Author Claire Keegan] is so precise in what she chooses to say ... and that's perfect for [director Tim Mielant]'s way of working,\" Eileen Walsh (pictured) told Radio Times. (Supplied: Roadshow)\n\nBill himself is a man adrift, increasingly unmoored from a clockwork life and otherwise loving family. It's an impression that Murphy's boyishness, even in middle age, lends itself to perfectly; he's a man with one foot in childhood, haunted by memories to his life as a lonely, bullied child back in the 1950s, when he lived with his single mother.\n\nThe flashbacks are beginning to worry his wife, Eileen (Eileen Walsh), who fears her husband is on the verge of a breakdown, and Bill's episodes are only exacerbated after he stumbles upon Sarah (Zara Devlin), a young woman five months pregnant and locked, shivering and distressed, in a freezing shed.\n\n\"[These women] were just taken out of society, sometimes for just being too attractive,\" Murphy told CBC. (Supplied: Roadshow)\n\nBill delivers Sarah to the local convent, where the sisters' veneer of compassion can barely disguise their sinister motives. When he meets the mother superior (Emily Watson), by turns warm and secretive, it's apparent that something untoward is afoot.\n\nDespite a title that sounds suspiciously similar to (and most likely inspired) this classic tweet, Small Things Like These is anything but twee contemporary fiction.\n\nKeegan, the writer behind 2022's sleeper hit The Quiet Girl, drew her tale from the notorious Magdalene Laundries scandal in Ireland, in which asylums set up for \"fallen women\" were exposed to have engaged in decades of abuse.\n\n\"It's the most unholy, un-Christian thing that she [Sister Mary] presides over,\" Emily Watson told Deadline. (Supplied: Roadshow)\n\nThere's menace rippling under the movie's slow-burn exterior. As in the real-life events, the members of the convent wield enormous influence over the good Catholic townsfolk, and at one point even threaten the education of Bill's kids — to every effect, they're mafia with a habit.\n\nThe knowledge that the Catholic Church was up to no good is hardly breaking news, but the movie nonetheless has a quiet power and grace, telling a story of corruption and control that remains resonant.\n\nDeftly written by Irish playwright Enda Walsh — whose stage play (and later, film) Disco Pigs gave Murphy his early career breakout — and directed with unfussy modesty by Tim Mielants (Peaky Blinders), the film is empathic and clear-eyed, in spite of material that could easily have lent itself to cliché.\n\n\"It's a book written by a woman about a man ... but it's actually a story about women, really,\" Murphy told Radio Times. (Supplied: Roadshow)\n\nMurphy is the essential element here; he holds the movie together through sheer force of presence, even as it sometimes threatens to tread familiar terrain.\n\nHis performance is a study in compassion and survival, in the ways one's own traumatic experience might lead to empathy instead of cyclical abuse. Here's a man raised by a single mother, and a foster mother, a man who has possibly been abused himself, who has taken his own pain and transformed it into something almost maternal.\n\nIt's all there in Murphy's silence; he's one of the rare modern actors capable of conveying emotional depth while speaking very little, of suggesting decades of repressed trauma with a look. Of course, those expressively opaque eyes, popping like street lamps against the Irish winter, don't go astray, either.\n\nAs he did in Oppenheimer, Murphy suggests worlds of conflict beyond the word. In repose, his stillness says so much.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/harry-mckay-opens-up-mental-health-carlton/105159422",
        "title": "'It was really scary': Carlton star opens up on mental health struggles",
        "publish_date": "Thu, 10 Apr 2025 00:12:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Star Carlton forward Harry McKay has opened up about his mental health struggles and said he is glad he put his hand up for help after weeks of trying to push through.\n\n\"Five or six weeks ago, (in) late Feb, (I) started feeling in not a great place mentally,\" McKay said in a touching conversation with his twin brother and Essendon defender Ben on the Ben and Harry podcast.\n\n\"And I think the most challenging part of that was me thinking I shouldn't be feeling the way I was ... everything in my world was in such a great place and that's why it was really scary. I guess you could say it was really irrational to feel like that.\"\n\nAs what he was grappling with worsened, McKay said he felt like he had to \"put on a bit of a facade to pretend to be OK when I really wasn't\".\n\n\"And that was really hard,\" McKay said.\n\n\"Especially as someone, as you'd know, as a male and as someone who would hang their hat on always turning up, being stoic, pushing through … but I had to put my hand up and say I needed some help.\"\n\nHarry McKay of the Blues prepares to return for the Blues after a three-week absence. (Getty Images: Robert Cianflone)\n\nThe 27-year-old said the support he has received has been beyond his expectations, including from the club, those close to him, and the wider football world.\n\nAfter three weeks away from AFL, he is preparing to make a return during Gather Round for Carlton's Saturday afternoon clash with West Coast.\n\nHe was a late withdrawal from the Blues' round two clash against Hawthorn, listed by the club as illness, and played last Saturday night for Carlton's VFL side. He has been back at training for more than a week.\n\n\"We can try and be stoic and push through and that's definitely how I'm wired a bit … on paper it made no sense, which probably added to the want to keep pushing through kind of thing, but the more you did (that), the worse you felt,\" McKay said.\n\nLoading...\n\n\"So, I had to put my hand and say I needed some help and the moment I did that, the support has been so beautiful from partner, family, the wider football community and definitely everyone involved in my club.\n\n\"And I knew everyone would be great but it's blown me away how loving and caring and supportive everyone's been.\n\nIf you or anyone you know needs help: Lifeline on 13 11 14\n\nAboriginal & Torres Strait Islander crisis support line 13YARN on 13 92 76\n\nBeyond Blue on 1300 224 636\n\n\"And I know there might be a lot of people listening to this who might be in similar situations or have been in similar situations, and knowing that there's so many people that care and love you and (are there to) put their arms around you, makes the world of difference.\"\n\nCarlton coach Michael Voss has been a staunch defender of McKay taking time away from the game.\n\nAhead of the Blues' clash with Collingwood last Thursday night, Voss told reporters he won't \"go into the 'H' stuff\".\n\n“The important thing for us is that we don’t get into dialogue weekly about where he’s at,\" Voss said.\n\n\"I think we’ve been pretty sound on our position as a club, that when he’s named in the team, he’ll be ready to go.”",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/what-is-the-mar-a-lago-accord-donald-trump-tariff-policy/105153862",
        "title": "What is Trump up to? The so-called 'Mar-A-Lago Accord' could be a clue",
        "publish_date": "Thu, 10 Apr 2025 00:12:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Donald Trump's so-called \"Liberation Day\" tariffs have caused chaos, up-ending stock markets and sending world leaders scrambling.\n\nAccording to the Trump administration, more than 70 countries are lining up to try and negotiate their way out of the new levies of up to 49 per cent — which have mostly now been \"paused\".\n\n\"These countries are calling us up, kissing my ass,\" the US president told a Republican event this week in Washington.\n\nMany have pre-emptively offered to cut their tariffs on US imports and start buying more American exports.\n\nBut Mr Trump and his advisers may have a much bigger prize in mind.\n\nSome believe the tariffs are just the first step in a grand strategy to reshape global trade, boost US manufacturing, reduce the US budget deficit and make America's allies pay for the US security umbrella.\n\nIt's being called the Mar-a-Lago Accord.\n\nIt's never been confirmed by the Trump administration and is widely regarded by economists as a terrible idea that won't work.\n\nBut that doesn't necessarily mean that Mr Trump isn't going to try and make it happen.\n\nWhat is the Mar-a-Lago Accord?\n\nThe details are complicated and involve a lot of finance theory.\n\nPut simply, the plan is essentially to get other key economies to agree to pump up their own currencies and help devalue the US dollar.\n\nThis would hopefully achieve the US administration's stated goals of making goods produced in America more competitive and boost its manufacturing industry.\n\nHowever, it would also make participants' exports less competitive.\n\nThe accord was outlined among a range of options in an essay last year by economist Stephen Miran, who has since been appointed chairperson of the US Council of Economic Advisers.\n\nStephen Miran's essay has been seen by some as a possible blueprint for Donald Trump's economic plans. (Reuters: Annabelle Gordon/file)\n\nIn the paper, Mr Miran argues the \"overvaluation\" of the US dollar is the reason for America's large trade deficit.\n\n\"Such overvaluation makes US exports less competitive, US imports cheaper, and handicaps American manufacturing,\" Mr Miran wrote.\n\nThe Mar-A-Lago Accord references Mr Trump's Florida resort Mar-a-Lago and the Plaza Accord of 1985 in which America's allies Germany, Japan, the UK and France agreed at New York's Plaza Hotel to jointly devalue the US dollar to boost America's industrial performance.\n\nMr Miran wrote that important economies such as China's and those in Europe would be less willing now to join a new accord, but tariffs could be a useful \"stick\".\n\n\"President Trump views tariffs as generating negotiating leverage for making deals,\" Mr Miran wrote.\n\n\" It is easier to imagine that after a series of punitive tariffs, trading partners like Europe and China become more receptive to some manner of currency accord in exchange for a reduction of tariffs. \"\n\nHe wrote that a currency accord with major economies could involve partner countries selling US dollar assets and swapping short-term US treasuries for century bonds.\n\nUS treasuries, or treasury bonds, pay interest over their term while century bonds don't and are only returned with an increased value once they mature after 50 or 100 years.\n\nThis could help finance the staggering costs of America's world-spanning military, he said.\n\nChina and EU retaliate against US tariffs as trade war escalates Photo shows close up of china president xi jinping in front of us flag Stock markets dropped following Beijing and the European Union's announcement of new tariffs on US imports.\n\nMr Miran said that under a currency accord plan, both tariffs and the threat of the US withdrawing security guarantees from countries involved in the deal would be used to ensure compliance with it.\n\nHe suggested that US security, trade and finance are joined, and that there was interest in getting countries to pay for America's security guarantees.\n\nMr Miran has described his paper as a \"menu\" of options, and said he wasn't advocating any particular option.\n\nWhen asked by Bloomberg last month if some kind of currency accord was in the works, Mr Miran said Mr Trump was \"very clear that he wants to start with tariffs\".\n\n\"We are starting with tariffs,\" he said.\n\n\"Could a [currency pact] be something that is entertained down the road? Sure it could. But right now the president is focused on tariffs.\"\n\nDonald Trump has hosted world leaders at Mar-a-Lago previously. (Reuters: Kevin Lamarque/file)\n\n'A new economic golden age'\n\nComments from Mr Trump's team seem to hint it has something big planned.\n\nSecretary of the Treasury Scott Bessent said during a Senate Finance Committee hearing in January that Mr Trump has a \"generational opportunity to unleash a new economic golden age that will create more jobs, wealth and prosperity for all Americans\".\n\n\"We can usher in a new, more balanced era of prosperity that will lift up all Americans and rebuild communities and families across the country,\" he added.\n\nPeter Navarro, Mr Trump's senior counsellor for trade and manufacturing, has made it clear that other countries offering to lower their tariffs will not be enough.\n\nWhat is a tariff? A tariff is a tax on a product imported from another country\n\nfrom another country It is paid to the government by the company that imports the product\n\nthat imports the product A tariff is generally calculated as a percentage of the price paid by the importer to the foreign seller\n\npaid by the importer to the foreign seller Historically, tariffs have pushed up prices because higher product costs are often passed on to consumers\n\n\"They're coming now and saying we want to talk, we'll lower our tariffs to zero if you lower your tariffs,\" he told Fox News this week. \"That's not the problem. Vietnam is a great example.\"\n\n\"They sell us $15 for every one we sell them. Zero tariffs would get us no reduction in the $123 billion deficit we have.\"\n\nDespite this, not everyone is convinced there's a strategy in the works.\n\nDavid Henig, from the European Centre of International Political Economy, told the ABC there were a lot of people pushing their ideas for how the world economic system could change.\n\n\"None of them obviously to me have captured the attention of President Trump,\" Mr Henig said.\n\nMr Henig said while it wasn't impossible, it was hard to see the tariffs now \"as a first step in some bigger strategy\" toward a complex currency accord.\n\n\"I'm not sure there's enough skill and analytical capacity in the current White House to pull this [currency accord] off,\" he said.\n\n\"I think you would need some nifty footwork of the likes we haven't really seen from this administration … to get to a point where countries want to do deals with you like the really sophisticated Plaza Accord.\"\n\nUS Treasury Secretary Scott Bessent is now leading tarrif negotiations for the Trump administration. (ABC News: Bradley McLennan)\n\nWhy wouldn't the Mar-a-Lago Accord work?\n\nIn an opinion piece for the Lowy Interpreter, former chief economist at the Department of Foreign Affairs and Trade Jenny Gordon wrote that the ideas outlined by Mr Miran were unlikely to deliver the reduced deficits and bring back the good jobs that were the primary motivation.\n\nDr Gordon said the logic was flawed for a number of reasons including that:\n\nThe US would need to borrow money to reinvest in its manufacturing sector, which would increase the value of the US dollar — the opposite of what the accord aims to do;\n\nChanging consumer patterns, technology and aging populations had done as much, if not more than global trade, to drive well-paying jobs out of America's industrial heartland; and\n\nThe plan would see countries move away from the US dollar as the reserve currency, and Mr Trump has said he doesn't want that.\n\nShe concluded that countries were not likely to want to sign up to any deal because of Mr Trump's conduct.\n\n\"Trump's treatment of allies will hardly provide reassurance that complying with such an accord will buy stability. Even if quite a few countries do comply, it will not solve the US deficit problem,\" she said.\n\nLord Daniel Hannan, president of the Initiative for Free Trade and a member of the UK House of Lords, told the ABC Mr Trump's policy was \"the most damaging policy and utterly needless\".\n\n\"It's completely self-inflicted,\" Lord Hannan said.\n\n\"If you did think that manufacturing deficits were a problem this is not how you would go about fixing it.\n\n\"It's not possible to simultaneously to tackle the deficit problem and to keep a devalued US dollar as the world's currency.\"\n\nHe said countries around the world wouldn't agree to things that weren't in their economic interest because the US wanted them to.\n\n\" The people who are claiming that there is some clever nine-dimensional chess going on here are deluding themselves because they don't want to face up to the banal reality that this is a needless policy that will impoverish people. \"\n\nIn his essay, Mr Miran said that the US needed to offer incentives for trading partners to come on board with the currency accord.\n\nSo far, Mr Trump has used tariffs only as a bargaining tool to reduce import levies on US goods abroad and raise revenue at home.\n\nDonald Trump has remained defiant as his tariff policy has caused global market chaos. (Reuters: Kevin Lamarque)\n\nJapan first to negotiate US tariffs\n\nAmong the first countries Mr Trump's team has agreed to meet with is Japan.\n\nThe United States is Japan's biggest export destination, with roughly 28 per cent of the total comprised of automobile shipments.\n\nMr Trump's decision to slap a 25 per cent levy on auto imports, and a reciprocal 24 per cent tariff on other Japanese goods is expected to deal a huge blow to Japan's economy.\n\nSome analysts predict the higher duties could knock up to 0.8 percentage points off economic growth.\n\nJapan also depends on the US military for protection.\n\nUnusually, US Treasury Secretary Scott Bessent is leading the negotiating team, posting on X that the US would \"work to enact the President's vision for a new Golden Age of Global Trade\".\n\nUS breaks with reality on tariffs Photo shows Donald Trump wears a blue suit, white shirt and red tie holding a booklet showing off his signature to the camera The Australian government after May 3 will no doubt want to try to negotiate with the Trump administration about our 10 per cent tariff, but they might be better off to just work around it and move on.\n\nTrade talks are usually led by the US trade representative.\n\nJapan's former top currency diplomat, Naoyuki Shinohara, told Reuters any US attempt to secure a coordinated depreciation of the US dollar through a 1985 Plaza Accord-type deal likely wouldn't work, because it would require the consent of China and Europe.\n\nMr Shinohara said unlike the Plaza Accord, when the United States worked only with close allies, Washington would need to engage more countries — including the China and European Union — to weaken the dollar effectively in a globalised market.\n\n\"Currency intervention, even if coordinated among nations, has become less effective because markets have become so big,\" he said.\n\nHe added that Mr Trump's decision to impose levies on China and Europe would make it extremely difficult to gain their consent.\n\nBoth have responded with tariffs of their own, with the US and China involved in an escalating tit-for-tat battle.\n\n\"In times like now, you need China to be in the loop, as well as European nations. That would be quite hard under the current circumstances,\" Mr Shinohara told Reuters in an interview.\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/facial-prosthetics-funding-push-ahead-of-federal-election/105156052",
        "title": "Unequal prosthetic rules leave cancer survivor unable to afford new nose",
        "publish_date": "Wed, 09 Apr 2025 23:20:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tracey David has a simple message for the politicians and bureaucrats who have so far refused to approve funding for her prosthetic nose.\n\n\"We are not cosmetic, we are not looking to enhance our face. We are looking to live with dignity,\" she said.\n\nThe New South Wales south coast grandmother received life-saving surgery to remove a malignant tumour from her face last year but was disappointed to learn there was no federal funding to help her cover the cost of a prosthetic.\n\n\"We desperately need the funding for head and neck cancer, for all people who need prostheses,\" she said.\n\nFace and neck prosthetics patients seek equal funding Photo shows Mark looks at himself in a mirror and adjusts his nose while wearing a blue polo shirt. In Australia, anyone needing a facial prosthetic must pay for it themselves. However, those below the neck can be paid for through government funding or private health insurance.\n\nMs David received a one-off payment through a NSW charity based at St Vincent's Hospital in Sydney, but said that funding would not last.\n\n\"What do I do in two to three years time when I need a new nose?\" she said.\n\n\"It's only plastic — it gets dirty, it needs to be cleaned. They don't last long.\n\n\"So there you go, there's another $6–7,000.\"\n\nCancer patients like Ms David are still waiting for answers ahead of the federal election.\n\nHead and Neck Cancer Australia, which represents a relatively small number of patients seeking public funding to bring them into line with other prosthetic recipients, has been unable to secure a commitment before the May 3 election.\n\nThis is despite a 2024 Senate inquiry into rare cancers making it clear these patients were not being supported in accessing rehabilitation options.\n\nFunding anxiety\n\nSydney pensioner Paolo Abate had his nose removed in an operation 10 years ago due to cancer.\n\nHe received funding through a Sydney Dental Hospital service but has now been told the funding is no longer available, causing him great anxiety.\n\nPaolo Abate has a prosthetic nose but cannot fund a replacement. (Supplied: Paolo Abate)\n\n\"I am a pensioner. You can understand what life is like at the moment with the way things are going, so for me to save $5,000, it's a struggle,\" Mr Abate said.\n\n\" I think it would be the best thing if it was covered by Medicare. It would be great. \"\n\n\"Because without a prosthesis I can't get out of the house. People without a nose, they don't look great.\n\n\"We scare people.\"\n\nSeeking a political solution\n\nHead and Neck Cancer Australia chief executive Nadia Rosen said even after the federal government had completed a review of funding, due later this year, there were no guarantees.\n\nNadia Rosen wants equity in prosthetics access. (Supplied: Nadia Rosen)\n\n\"We need it to happen sooner rather than later,\" she said.\n\n\"For people like Tracey and Paolo, some of our patients who are missing their nose, they are already living with devastating facial disfigurement and waiting any longer is simply not acceptable.\n\n\"We have asked for a very modest investment of around $13 million a year for people who are literally needing part of their face replaced.\n\n\"We have also provided the government and the opposition literally with a costed shovel-ready program that is based on the already existing breast prosthesis program.\"\n\nHealth Minister Mark Butler said the federal government launched an independent review into the availability of prostheses programs to identify gaps in coverage.\n\nMark Butler says an independent prostheses programs review is underway. (ABC News)\n\nHe said the review was expected to be completed in July.\n\n\"I will be working closely with patients and consumer groups to improve access to the healthcare services they need and deserve,\" he said.\n\nLiberal senator Wendy Askew said she and Shadow Health Minister Anne Ruston had been briefed by Head and Neck Cancer Australia about its proposal for providing prosthetics to those in need.\n\n\"During last year's Senate inquiry into rare cancers, it became clear that many patients are not being supported in accessing these rehabilitation options and that improvements need to be made,\" Senator Askew said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/sydney-royal-easter-show-celebrates-district-exhibits-125-years/105147058",
        "title": "Easter show mainstay captures resilience of those who work the land",
        "publish_date": "Wed, 09 Apr 2025 23:17:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sydneysiders have been marvelling at the district exhibits at the Sydney Royal Easter Show for 125 years.\n\nThey are often spectacular affairs, built by large teams featuring thousands of items of fresh produce.\n\nThe job is a complex and challenging as it was 125 years ago.\n\nThe style of the exhibits has changed over the years. (Supplied: Royal Agricultural Society)\n\nDistrict Exhibits history\n\nThe idea for an exhibition started in 1876 when three areas or \"courts\" were set up in the Prince Alfred Exhibition Hall to display produce from several parts of the colony in the years before Australia became a federation.\n\nGetting the produce to Sydney was a huge challenge, with much of it going by steamship and rail.\n\nIn 1899 Frederick Webster, secretary of the Royal Agricultural Society, travelled to the regions to determine the support for a competition between regional societies.\n\nThe first one was scheduled for the following year.\n\nArchival documents from the Royal Agricultural Society record Mr Webster's thinking about the idea.\n\nThe District Shield was first awarded in 1911. (Supplied: Royal Agricultural Society)\n\n\"[Metropolitan] manufacturers, exporters and wholesale merchants, who know little or nothing of the abundant products of the country, will become familiar with the specific capabilities of each district, following which the enterprise and industry of producers will be stimulated and rewarded,\" he wrote.\n\nHe expected the exhibit to be \"one of the grand events of 1900 … which will surpass in general excellence and grandeur all previous gatherings of the kind held in Australia\".\n\nPreserves were a crucial way to keep summer fruit to eat during winter. (Supplied: Royal Agricultural Society of NSW)\n\nChanging exhibits\n\nThe first regions to compete were Clarence, Central New England, Grenfell, Mudgee, Nepean, Orange and Tumut.\n\nThe districts have since changed to Western, Northern, South-East Queensland, and Southern & Central.\n\nLindy Pollock and Brooke Beales taste cherry jam at the 2025 Royal Easter Show. (ABC Rural: David Claughton)\n\nRoyal Agricultural Society of NSW Agricultural Committee chair Hunter White said initial produce displays were simple.\n\n\"When they first started, if you see some old pictures, they're very structured and there's pyramids of apples, things in nice rows, and even the people standing in a military line,\" he said.\n\nOver the decades they evolved to mark important events, anniversaries, good seasons and bad ones, as well as the spirit of the land and the resilience of those who worked it.\n\n\"Today, environmental themes are quite strong,\" Mr White said.\n\nModern exhibits focus on key messages. (Supplied: Royal Agricultural Society)\n\nLook closely at the produce\n\nBut the key to the District Exhibits is not the theme, but the produce that is in the display.\n\nMr White said 90 per cent of the judge's score was determined by the quality of the fruit, vegetables, grains, and how well they performed on farm as opposed to how the exhibit looked.\n\nHunter White oversees the produce going into the 125th District Exhibit at the Sydney Royal Easter Show. (ABC Rural: David Claughton)\n\n\"What they look out for at the end of the day is the nutritional value, and as agriculturalists, maximising the yield to the inputs,\" he said.\n\n\"It's quite a tradition.\"\n\nThere are more than 50 judges involved.\n\nThey assess thousands of items of fresh produce that may have been stored for months and transported thousands of kilometres before being placed on display.\n\nLeigh James and Roweena Peetree are judging heritage root vegetables. (ABC Rural: David Claughton)\n\nHeritage plants\n\nThe exhibits are also a window into foods grown in the past.\n\nMr White said some root vegetables in the display were not in widespread production, although they were making a return.\n\nHe said produce such as cattle pumpkins, grammas, unusual varieties of watermelons, pie melons, squash and zucchinis were grown as feed, not for human consumption.\n\n\"They were an important part of agriculture in the in the past; conserving fodder for winter time is really their purpose, and the one that stands out are the giant pumpkins,\" he said.\n\nPumpkin bowls\n\nMr White said there were also some unofficial awards given out each year, behind the scenes.\n\nThe Beer Can Trophy goes to the best Merino Fleece in the District Exhibit while the Pumpkin-Bowling Trophy involves a game of bowls played on Good Friday with some of the produce.\n\n\"The proliferation of pumpkins that are just grown for this competition need to go to some good use,\" Mr White said.\n\n\"It's just one of the things the courts do after the competition, we come together and we celebrate.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/australia-will-not-join-hands-with-china-against-trump/105159274",
        "title": "Marles says Australia will not 'join hands' with China against Trump",
        "publish_date": "Wed, 09 Apr 2025 23:15:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia will not work with China to resist Donald Trump's tariffs, even as his latest escalation threatens to damage both countries.\n\nDeputy Prime Minister Richard Marles has rejected an invitation from ambassador Xiao Qian to \"join hands\" with Beijing in \"solidarity\" after the US president threatened its rival with 125 per cent tariffs.\n\n\"The only way to stop the hegemonic and bullying behaviour of the US in harvesting the whole world is to strengthen solidarity and collaboration, and to jointly resist,\" the ambassador wrote in an op-ed for Nine newspapers.\n\n\"Under the new circumstances, China stands ready to join hands with Australia and the international community to jointly respond to the changes of the world.\"\n\nTrump pauses 'reciprocal' tariffs but hikes China rate to 125pc Photo shows Donald Trump smiles and holds up a finger. Almost all countries will now be subject to a 10 per cent tariff, rather than the larger \"liberation day\" rates announced last week. But China will be hit with an extraordinary tariff of 125 per cent.\n\nMr Marles said Australia would pursue its own interests and focus on diversifying its trade, pursuing greater ties with Indonesia, India, the UK and the United Arab Emirates.\n\n\"I don't think we'll be holding China's hand,\" he said.\n\n\"We obviously don't want to see a trade war between China and the US … [but] it's about pursuing Australia's national interests, not about making common calls with China.\"\n\nPrime Minister Anthony Albanese brushed off the suggestion of \"joining hands\", saying Australia would \"speak for ourselves\", but struck a more accommodating tone.\n\n\"Our trade relationship with China is an important one. Trade represents one in four of Australian jobs and China is by a long distance our major trading partner,\" he told reporters.\n\n\"These trade issues affect 20 per cent of the global market. 80 per cent of trade does not involve the United States. There are opportunities for Australia and we intend to seize them.\"\n\nMr Trump's latest reversal, which reverted all countries except China to a 10 per cent tariff, amplifies the economic threat to Australia because of its reliance on China.\n\nTreasury and RBA modelling suggest the \"China channel\" is the main way the Trump tariffs will affect Australia, with a hit to our exports likely unless China does enough to stimulate its own economy and prop up its demand.\n\nBeijing responded to the first round of tariffs last week with retaliatory tariffs, and Mr Xiao hinted a further response was likely.\n\nChinese ambassador to Australia Xiao Qian said the international community should show solidarity against Donald Trump's tariffs. (ABC News)\n\n\"China has firmly taken countermeasures to protect its legitimate rights and interests and will resolutely continue to do that,\" he said.\n\n\"There is no winner in a trade or tariff war and protectionism leads nowhere.\"\n\nWhat is a tariff? A tariff is a tax on a product imported from another country\n\nfrom another country It is paid to the government by the company that imports the product\n\nthat imports the product A tariff is generally calculated as a percentage of the price paid by the importer to the foreign seller\n\npaid by the importer to the foreign seller Historically, tariffs have pushed up prices because higher product costs are often passed on to consumers\n\nMr Marles said more diverse trade, with less reliance on China, would strengthen Australia's \"economic resilience\".\n\n\"That's really been the lesson not just in the last couple of weeks, but really over the last five or 10 years, about the importance of making sure that we have got strong, diversified trade around the world, and that's our focus,\" he said.\n\n'Focused on what we can control'\n\nThe response reflects how deeply Australia's attitudes towards China have been shaped by Beijing's campaign of economic punishment against the Morrison government from 2020 to 2022.\n\nOne federal government source stressed that Australia valued its economic ties with China, and didn't believe that Trump's tariffs against Beijing — or any country — were justifiable.\n\nBut they said Australia did not want to be drawn directly into an economic confrontation between the two great powers, and pointed out that there was still no strategic trust between Australia and China.\n\n\"What China did back then was not justifiable, and neither is what Trump is doing now,\" they said.\n\n\"So we're focused on what we can control, and what we can do to give ourselves as many options as possible. Where it makes sense to deepen trade ties with China, on terms we are comfortable with… we will do that. But this isn't about holding hands.\"\n\nBrewing economic storm dominates election week two\n\nTrade Minister Don Farrell met overnight with his EU counterpart to reopen stalled talks on a free trade deal between Australia and the European bloc, and the government continues to lobby for an exemption from the American 10 per cent tariff.\n\nBut with risks to the Australian economy from the broader global uncertainty, the government's economic response featured heavily in last night's first election debate between Treasurer Jim Chalmers and his shadow Angus Taylor.\n\nChalmers and Taylor go head-to-head Photo shows jim angus Jim Chalmers and Angus Taylor clash in an evenly matched TV debate over the budget, productivity, Donald Trump's trade war and their personal weaknesses.\n\nMr Chalmers said the government was \"well placed and well prepared\" for uncertainty.\n\n\"Our response is all about making our economy more resilient, our markets more diverse, and engaging with the world …\n\n\"We've got an opposition leader and an opposition which is absolutely full of these kind of DOGE-y sycophants who have hitched their wagon to American-style slogans and policies and especially cuts which would make Australians worse off,\" he said, referencing Elon Musk's Department of Government Efficiency [DOGE].\n\nMr said in \"tumultuous times\" the Coalition was better placed to manage the economy. \"When we were last in government, of course, we did take on the Trump administration, and we avoided tariffs,\" he said.\n\nMr Taylor said the government had \"no plans\".\n\n\"Your plan that you put out in your own budget doesn't have our standard of living going back to where it was when you came into government until 2030 or beyond,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/the-masters-golf-kids-steal-the-show-in-par-3-comp/105159202",
        "title": "Crowd goes wild as champ's kid holes long putt, as golfers avoid winning 'jinxed' competition",
        "publish_date": "Wed, 09 Apr 2025 22:56:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Sammy Spieth, age three, hit a better tee shot by his standards than playing partners Justin Thomas and Max Homa did by theirs on the second hole of the Par 3 Contest at the Masters.\n\nHe teed up a driver, gripped it cross-handed and sent his ball about 30 yards down the middle, while Thomas and Homa hit their wedges short and right into a bunker.\n\nSammy's dad, 2015 Masters champion Jordan Spieth, didn't bother to tee off. He had enough to manage with a team of caddies — all wearing white Augusta National coveralls — that included Sammy, one-year-old daughter Sophie, and wife Annie, who is expecting a third child in July.\n\nThe record book will show that Masters rookie Nico Echavarria won the Par 3, beating J.J. Spaun with a birdie on the second playoff hole after each shot 5-under 22.\n\nWhile the Masters is arguably the easiest major to win because of its small field that includes aging past champions, the Par 3 is much easier, because most players don't even try.\n\nGary Player certainly does. The oldest living Masters champion at age 89, he made three straight birdies — flirting with aces on holes 6 and 7 — to get his name onto the leaderboard, although he ultimately didn't post an official score.\n\nThe daughter of Belgian golfer Thomas Detry walks on the ninth hole during the Par 3 Contest. (Getty Images: Harry How)\n\nThe same was true of 70 players in the field of 90. That trend likely will continue as long as the winner on Augusta National's tranquil, 1,090-yard par-3 course fails to win the green jacket.\n\nThe contest began in 1960 and no one who has won it and the Masters in the same year.\n\n\"I never really buy into the jinx too much, but I also don't think I've ever turned in a card,\" Thomas said.\n\nRory McIlroy was joined by wife Erica and four-year-old daughter Poppy, who holed a birdie putt on the ninth hole when she nudged the ball with her dad's putter and it nearly stopped before it caught a slope and ran into the hole.\n\nMcIlroy, who would complete the career Grand Slam with a victory on Monday morning (AEST), appreciated the chance to focus on his daughter, who interrupted his on-course interview with ESPN.\n\n\"The build-up to this event is a lot, and the sort of anticipation and we're waiting eight or nine months for the next major to roll around from the Open Championship,\" McIlroy said.\n\n\"To end your preparation with an afternoon like this … it's such a fun afternoon.\"\n\nHoles-in-one and other highlights\n\nKeegan Bradley made the first ace of the day when his approach on the 140-yard sixth hole caught a ridge and trickled into the cup.\n\nHe hoisted each of his sons in the air, and when the family got to the green, Bradley's younger boy, four-year-old Cooper, ran to the hole, looked down and clapped his hands together at the sight of the ball.\n\nHe lifted it out and raised his arm in triumph.\n\nEarlier, when the Bradley family made its way down the first hole, seven-year-old Logan showed an impressive grasp of Masters patron etiquette when he yelled at his younger brother, \"you can't run!\"\n\nByeong Hun An's five-year-old son, Sun-woo, got a cheer worthy of an ace when he bombed a drive about halfway to the green on the 130-yard first hole.\n\nLee urged to consider 'lifestyle change' in order to conquer Masters Photo shows Min Woo Lee plays a shot at Masters practice Jason Day hopes compatriot Min Woo Lee heeds advice given by golf legend Karrie Webb as Lee heads into the Masters as Australia's best bet.\n\nSun-woo then took out an iron and after a couple of whiffs — er, practice swings — he hit a worm-burner that scooted into a greenside bunker.\n\nScottie Scheffler holed a 3-footer for birdie on the first hole, a feat more impressive because he did it one-handed while holding his 11-month-old son, Bennett.\n\nTom Hoge gave been-there, done-that high-fives to the players and caddies in his group when he aced the 90-yard fourth with a shot that spun back and slammed into the flagstick. Brooks Koepka used the slope behind the hole on the sixth for the last hole-in-one of the day and 115th in the contest's history.\n\nParticipation in the Par 3 is optional, and a handful players — including Xander Schauffele, Patrick Cantlay and Phil Mickelson — opted out, choosing to grind on the range or play practice rounds well into the afternoon ahead of the opening round.\n\n\"If you're not ready by now, then you don't really have a chance. This week takes a lot of energy,\" McIlroy said.\n\n\"It's a tough walk, it's hilly, and the mental energy you're expending as well. Get this done, and then just go home, have dinner, relax and get ready for tomorrow.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/karratha-locals-discuss-north-west-shelf-project/105143500",
        "title": "This WA gas project is a big election issue, but what do locals think?",
        "publish_date": "Wed, 09 Apr 2025 22:06:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the northern West Australian city of Karratha, the gas industry is never far from sight.\n\nFlares from Woodside's towers, at the country's largest mainland gas plant, can be seen from many vantage points across the city, 1,500 kilometres north of Perth.\n\nThe project's numerous flare towers are visible from many vantage points across Karratha and Dampier. (ABC Pilbara: Charlie McLean)\n\nWoodside wants to extend the life of its North West Shelf project until 2070, prompting a heated national debate that could determine who forms the next government.\n\nMajor political leaders have been outspoken about their views, and the sentiment is mixed among those who live and work near the gas plant.\n\nAyla Petersen moved to Karratha 14 years ago and said trying to understand the debate about the project was overwhelming.\n\n\"There's so much information out there and it's really hard to know what's true and what's misinformation,\" she said.\n\nAyla Petersen says it is difficult to separate fact from fiction when it comes to the North West Shelf. (ABC Pilbara: Mietta Adams)\n\nA federal government decision about the North West Shelf extension was due to be handed down before the end of March but was delayed for a second time until after the federal election.\n\nOpposition Leader Peter Dutton has promised to green light the 40-year extension within 30 days if he becomes prime minister.\n\nAnd Greens Leader Adam Bandt has said if Labor does not win a majority of seats, the Greens will only back Anthony Albanese to form a minority government if the Woodside project is scrapped.\n\nCity residents don't understand, publican says\n\nWoodside is one of the biggest employers in Karratha, with more than 280 workers living locally.\n\nAt the Mermaid Hotel in nearby Dampier, made famous by the iconic Australian film Red Dog, publican Nick Bond is a supporter.\n\n\"I really do think the people who live in the cities across this country do not understand how much our economy relies on the investment from these big companies,\" Mr Bond said.\n\nNick Bond says approving the project is important for the local and national economy. (ABC Pilbara: Alistair Bates)\n\n\"Whether that be gold, coal, gas, iron ore — the whole lot of them.\n\n\"If we did not have them we would not be able to afford our welfare system.\"\n\nGary Lewis, who works in the water industry, said he would be happy to see the project proceed if the proper process was followed.\n\nGary Lewis at the Dampier Markets. (ABC Pilbara: Mietta Adams)\n\n\"As long as they follow their criteria and they get it ticked off to do it right, it should be allowed to happen,\" Mr Lewis said.\n\n\"Renewables aren't going to cover what we got now and what we need now.\n\n\"I think we are pushing ourselves in a big hole and it's costing us more and more with our electricity bills.\"\n\nLocals concerned about environment\n\nAt a local weekend market in Dampier, the ABC canvassed the opinions of 20 people.\n\nRoughly half said they had not heard the name of the project before, or if they had, they did not know enough to form a strong opinion.\n\nThe other half raised concerns about the project's expected environmental impacts.\n\nSmall business owner Estelle Hill said she was torn between what an approval would mean for her community, and for the planet.\n\n\"It's not really good for the environment, but then it's good for our livelihood up here,\" she said.\n\nEstelle Hill is torn between the project's environmental impact and its benefit to Karratha's economy. (ABC Pilbara: Mietta Adams)\n\n\"They've got to be very careful about the way in which they look after the environment.\"\n\nIndependent environmental assessments have calculated the project would produce around 4.3 billion tonnes of carbon dioxide equivalent emissions over its lifetime if approved.\n\nEnvironmental groups argue that would jeopardise global efforts to achieve net-zero emissions by 2050.\n\nFears for rock art\n\nIn the nearby town of Roebourne, known as Ieramagadu by traditional owners, the idea of 40 more years of gas production on the peninsula has frightened Ngarluma woman Kaylene Daniel.\n\n\"Industry needs to stop now. They've already damaged the country, do they not want that country out there?\" Ms Daniel said.\n\nKaylene Daniel wants the project rejected to safeguard the future of the Murujuga rock art. (ABC Pilbara: Charlie Mclean)\n\nThere has been a long-running debate about whether industrial projects on the Burrup Peninsula, including Woodside's gas operations, are accelerating the deterioration of more than a million ancient petroglyphs across the wider region, also known as Murujuga.\n\nMs Daniel's parents were among the most high-profile advocates for protecting the engravings.\n\n\"It's our library, our history. It tells you things about what's been happening out there even since the first colonisation,\" she said.\n\n\"It's the story of what happened then and what's happening now.\"\n\nCalls to reduce offshore revenue\n\nAccording to Woodside, the North West Shelf has contributed more than $40 billion in royalties over the past four decades.\n\nKarratha Mayor Dan Scott said extending the project would be welcome news for small businesses that relied on lucrative contracts from Woodside.\n\nDan Scott says extending the North West Shelf project would be good for local businesses. (ABC News: Charlie Mclean)\n\nBut longtime resident Cathy McDonald said she wanted to see more revenue go back into the community, if the extension was approved.\n\n\"I think it needs to be developed in a way that Australians get a good cut from it, instead of it being developed and shipped overseas and we get nothing from it,\" she said.\n\n\" I do think there needs to be some sensitivity around its development and I think it needs a lot of consultation from Indigenous Australians or local people up here. \"\n\nBut given the political stakes attached to the project, it is what voters across the country think should happen that will determine its fate.\n\nA final decision on the project is due on May 31.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/tennis-monte-carlo-masters-novak-djokovic-knocked-out-early/105159098",
        "title": "'It was horrible': Djokovic rolled in Monte Carlo as Aussies win through",
        "publish_date": "Wed, 09 Apr 2025 21:51:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Novak Djokovic's uneven season has plunged to another \"horrible\" low in the Monte Carlo Masters, as Australia's top men's duo of Alex de Minaur and Alexei Popyrin both enjoyed notable comeback triumphs at Monaco's celebrated Country Club.\n\nDjokovic's quest for a 100th career title bit the red dust on Wednesday, with the 24-time grand slam champ being handed another surprising loss, 6-3 6-4, at the hands of Chilean Alejandro Tabilo, who also beat the great man in Rome last year.\n\nIt was such a sub-standard performance in his first clay-court outing since winning the Olympics that Djokovic could only sound embarrassed as he sighed to the crowd on Court Rainier III.\n\n\"I expected myself at least to have put in a decent performance. Not like this. It was horrible,\" he said.\n\n\"I did not have high expectations. I knew I'm going to have a tough opponent and I knew I'm going to probably play pretty bad. But this bad, I didn't expect.\"\n\nYet in the first major European clay-court event of the post-Rafa Nadal era, both de Minaur and Popyrin offered glimpses that they could enjoy their best seasons yet on the surface as they came from a set down in their matches to book last-16 places.\n\nAlex de Minaur plays a backhand on his way to victory over against Tomas Machac of Czechia. (Getty Images: Clive Brunskill)\n\nIn the year after de Minaur finally began to feel like a clay-courter by reaching the French Open quarterfinals, Australia's world number 10 produced an emphatic comeback to subdue Czech Tomas Machac 3-6, 6-0, 6-3.\n\nBased on his fine returning grinding down the Czech, de Minaur's win set up the eighth seed with a round-of-16 date against ninth seed Daniil Medvedev, who came through a testing encounter with Frenchman Alexandre Muller 7-6 (8-6), 5-7, 6-2.\n\nIt will be de Minaur's first encounter with Medvedev since the Aussie was defeated in last year's ATP Finals, but he will be keen to repeat his shock victory over the Russian at Roland Garros, which earned him his first French Open last-eight berth.\n\nPopyrin has had a poor season following his breakthrough 2024 campaign, but there were signs of real promise from the former Roland Garros boys' champ that a decent clay-court campaign awaits as he won his second match in two days from a set down, 3-6, 6-3, 6-3, against US 14th seed Frances Tiafoe.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt gave the 25-year-old Sydneysider, who blasted 27 winners, a measure of revenge for his defeat by Tiafoe in last year's US Open.\n\nIt's also the first tournament in 2025 in which Popyrin has won two matches, after going into Monte Carlo with a dismal 2-7 record.\n\nA real measure of his improvement, though, may now await when he faces fourth seed, two-time French Open finalist Casper Ruud, in the last-16 after the Norwegian hammered Roberto Bautista Agut 6-2, 6-1.\n\nFrench Open champion Carlos Alcaraz began his clay campaign, which he hopes will lead to a successful French Open title defence, by rallying to a 3-6, 6-0, 6-1 victory over Argentine world number 22 Francisco Cerundolo.\n\nThere was also plenty of emotion as Monte Carlo said farewell to French favourite Richard Gasquet, playing his last event there a 25 years since he played in Monte Carlo as a 15-year-old wildcard. At 38, he lost to German qualifier Daniel Altmaier 7-5, 5-7, 6-2.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-10/aviation-expert-responds-to-sea-world-helicopter-crash-findings/105157454",
        "title": "Sea World choppers 'shouldn't have operated' at time of tragedy, expert says",
        "publish_date": "Wed, 09 Apr 2025 21:51:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "An industry expert says the aviation watchdog should have identified the faulty radio that contributed to a fatal mid-air helicopter crash at Sea World on the Gold Coast.\n\nIn a report released on Wednesday, the Australian Transport Safety Bureau (ATSB) found a litany of safety issues led to the joy-flight collision, which claimed the lives of four people and injured nine others on the Southport Broadwater in 2023.\n\nSea World Helicopters chief pilot Ashley Jenkinson, New South Wales woman Vanessa Tadros, and UK couple Diane and Ron Hughes died when the two choppers crashed into each other as one took off and the other came in to land.\n\nThree passengers — including two children — were critically injured in the tragedy.\n\nDiane and Ron Hughes died in the crash. (Supplied: Hughes family)\n\nSecond pilot Michael James survived the crash but died of cancer in 2024.\n\nThe ATSB report found a faulty radio antenna in part led to the crash, along with the placement of a new helipad, which created a \"conflict point\" for the aircraft.\n\nInvestigators found it was likely Mr Jenkinson made a taxiing radio call to incoming pilot Mr James but it was unclear if it was ever received.\n\nATSB Chief Commissioner Angus Mitchell says the radio antenna was faulty. (ABC News)\n\nThe report found the radio system in the helicopter being flown by Mr Jenkinson had \"defects that limited transmission range\", and \"it is almost certain that a taxi call was not successfully broadcast\".\n\nThe report said pilots largely relied on a \"see-and-avoid\" strategy to judge the distance between the helicopters.\n\n'Shouldn't have operated with faulty radio'\n\nNeil Hansford, who is an international aviation consultant, said issues with the radio transmission should have been enough to ground the operation.\n\nNeil Hansford says radios should always be sending and receiving signals. (ABC News)\n\n\"It's a motherhood issue that the radios are sending and receiving, let alone in a tight, high-volume, short turn-around operation like this,\" he said.\n\n\" If anything should have been working with a full function, it's the radios and if the radios aren't working, it shouldn't have operated. \"\n\nAccording to the ATSB report, Sea World Helicopters ran high-frequency, low-duration flights.\n\nIn the two weeks prior to the accident, the route where the collision occurred was traversed more than 200 times, the report said.\n\nVanessa Tadros was killed in the crash and her son Nicholas, 10, was seriously injured. (Supplied)\n\nMr Hansford said issues with the radio should have been identified by the Civil Aviation Safety Authority (CASA) in routine inspections of the joy-flight operator.\n\n\"CASA has an absolute responsibility, at law and by regulation, that all of its operators throughout Australia operate to the approved operating procedures,\" he said.\n\n\"In the end, CASA allowed this operation. They had a responsibility to supervise it and there was an activity that was not compliant because the radio calling was deficient.\"\n\nA Sea World helicopter in the air after being cleared to resume joy flights. (ABC News: Steve Keen)\n\nSea World dedicated to high safety standards\n\nIn a statement, Sea World Helicopters said the accident was a \"devastating tragedy\".\n\n\"Our deepest sympathies rest with the victims, their families, and our staff who have been profoundly impacted by it,\" the operator said.\n\nAsh Jenkinson delivered supplies to flood-affected communities in 2022. (Facebook: Sea World Helicopters)\n\nThe company acknowledged the ATSB's recommendations and said it would \"respond within the allocated time frame\".\n\n\"The accident occurred within a compliant and professionally-managed organisation, which exceeded the minimum regulatory requirements of the general aviation sector,\" the statement said.\n\n\"Our company maintains robust safety systems, dedicated support staff and rigorous oversight protocols to uphold the highest standards of aviation safety.\"\n\nIt said the operator remained \"committed to consistently evolving our safety measures\".\n\nCASA regularly audits Sea World\n\nA CASA spokesperson said in a statement it welcomed the ATSB report and \"will review it in detail for potential safety improvements that can be adopted in addition to action we've already taken\".\n\nIt said action already taken included regulatory, oversight and compliance monitoring of Sea World Helicopters.\n\nCASA says Sea World Helicopters is complying with regulatory requirements. (ABC News: Kirsten Webster)\n\n\"As part of that oversight, CASA conducts routine operational surveillance to ensure the company is complying with regulatory requirements and company procedures, the last audit being completed in October 2024,\" the spokesperson said.\n\n\"CASA is satisfied Sea World Helicopters is complying with relevant regulations to conduct passenger flights.\"\n\nCASA also conducted a review of the airspace around Southport following the tragedy, which \"found it was appropriate and safe\".\n\nThere has also been an update to passenger safety information regarding the fitting of multi-point restraints when fitted with constant wear life jackets, the CASA spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/it-s-unbelievable-aussies-aim-for-gold-medal-haul-in-la-after-new-olympic-events-added-20250410-p5lqn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s unbelievable’: Aussies aim for gold medal haul in LA after new Olympic events added",
        "publish_date": "Thu, 10 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australia’s top swimmers are celebrating a potential Olympic gold medal windfall after six extra 50-metre sprint events were added to the program for the 2028 Los Angeles Games.\n\nThe International Olympic Committee confirmed overnight there will be 351 medal events in LA — 22 more than at Paris 2024 — including new mixed-gender competitions in athletics, golf and artistic swimming. Among them is a mixed 4x100m relay on the track, which rising star Gout Gout could feature in.\n\nThe IOC’s announcement also brings changes to soccer, expanding the women’s tournament from 12 to 16 teams and reducing the men’s from 16 to 12 — a shift that will impact the Matildas and Olyroos.\n\nBut the major win for Australia is the inclusion of men’s and women’s 50m backstroke, breaststroke and butterfly events — an unprecedented opportunity for the nation’s top sprinters to chase multiple medals.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-joey-manu-could-be-on-the-verge-of-an-nrl-return-20250409-p5lqin.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Joey Manu could be on the verge of an NRL return",
        "publish_date": "Thu, 10 Apr 2025 11:44:30 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Cross-code superstar Joey Manu is considering asking for a release from his French Rugby contract on compassionate grounds to return home – a move that could open the door for an NRL return.\n\nManu, who is currently playing Japanese Rugby for Toyota Verblitz, has signed a deal with French Rugby club Racing 92 and is scheduled to join them for pre-season training in July ahead of the season start in August.\n\nFormer Roosters star and New Zealand international Joey Manu. Credit: Getty Images\n\nSources with knowledge of the situation, talking on the condition of anonymity due to confidentiality, said the 28-year-old was now reconsidering his future and was weighing up a return to either Sydney or New Zealand due to family reasons.\n\nShould Manu return home, he would also attract attention from Super Rugby clubs, opening the door for him to fulfil an ambition to play for the New Zealand All Blacks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/wall-street-surges-after-trump-pauses-some-of-his-tariffs-20250410-p5lqly.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX gains more than $110 billion as market goes from fear to frenzy",
        "publish_date": "Thu, 10 Apr 2025 11:24:57 +1000",
        "category": "finance",
        "authors": [
            "Miriam Steffens",
            "Nick Newling"
        ],
        "text": "“I have authorised a 90-day PAUSE,” Trump said in his post on his social platform Truth Social, after recognising the more than 75 countries that he said had been negotiating on trade and had not retaliated against his latest increases in tariffs. US Treasury Secretary Scott Bessent later told reporters that Trump was pausing his so-called “reciprocal” tariffs on most of the country’s biggest trading partners, but maintaining his 10 per cent tariff on nearly all global imports, including those from Australia. ‘As welcome as the announcement was, investors can’t assume it’s the end of the tariff story, or that the market’s day-to-day volatility will disappear.’ Daniel Skelly, Morgan Stanley It was a starkly different story for China though, though, with Trump saying tariffs were going up to 125 per cent against its products. That raises the possibility of more swings ahead that could stun financial markets. The trade war is not over, and an escalating battle between the world’s two largest economies can create plenty of damage. US stocks are also still below where they were just a week ago, when Trump announced worldwide tariffs in what he called “Liberation Day”. But overnight, at least, the focus on Wall Street was on the positive.\n\n“The tariff clouds parted for the first time today,” said Daniel Skelly, head of the wealth management market research and strategy team at Morgan Stanley. “But it’s too soon to know how sunny the skies will be tomorrow – or 90 days from now … As welcome as the announcement was, investors can’t assume it’s the end of the tariff story, or that the market’s day-to-day volatility will disappear.” Huge swings have become routine for financial markets worldwide recently, not just day to day but hour to hour, as investors struggle to game out what Trump’s trade war will do to the economy. Credit: AP The relief came after doubts had crept in about whether Trump cared about the financial pain the US stock market was taking because of his tariffs. The S&P 500, which sits at the centre of many pension fund accounts, came into the day nearly 19 per cent below its record set less than two months ago. That surprised many professional investors, who had long thought that a president who used to crow about records for the Dow under his watch would pull back on policies if they sent markets reeling.\n\nWednesday’s rally pulled the S&P 500 index away from the edge of what’s called a “bear market”. That’s what professionals call it when a run-of-the-mill drop of 10 per cent for US stocks, which happens every year or so, graduates into a more vicious fall of 20 per cent. The index is now down 11.2 per cent from its record. Loading Wall Street also got a boost from a relatively smooth auction of US Treasurys in the bond market on Wednesday. Earlier jumps in Treasury yields had rattled the market, indicating increasing levels of stress. Trump himself said on Wednesday that he had been watching the bond market “getting a little queasy”. Analysts say several reasons could be behind the rise in yields, including hedge funds and other investors having to sell their Treasury bonds to raise cash to make up for losses in the stock market. Investors outside the United States may also be selling their US Treasurys because of the trade war. Such actions would push down prices for Treasurys, which in turn would push up their yields. Regardless of the reasons behind it, higher yields on Treasurys add pressure on the sharemarket and push upwards on rates for mortgages and other loans for US households and businesses.\n\nThe moves are particularly notable because US Treasury yields have historically dropped – not risen – during scary times for the market because the bonds are usually seen as some of the safest possible investments. This week’s sharp rise had brought the yield on the 10-year Treasury back to where it was in late February. Loading After approaching 4.5 per cent in the morning, the 10-year yield pulled back to 4.34 per cent following Trump’s pause and the Treasury’s auction. That’s still up from 4.26 per cent late on Tuesday and from just 4.01 per cent at the end of last week. Of course, the trade war is not over. Bessent and Trump clearly showed their anger at China, which has been ratcheting up its own tariffs on US goods and announcing other countermeasures with each move Trump has made. China said earlier it would raise tariffs on US goods to 84 per cent on Thursday. “If the US insists on further escalating its economic and trade restrictions, China has the firm will and abundant means to take necessary countermeasures and fight to the end” the Ministry of Commerce said.\n\nLater the US Treasury secretary said in a message to countries worldwide, but perhaps most directly aimed at China: “Do not retaliate, and you will be rewarded.” On Wall Street, the gains were widespread across the US sharemarket, and 98 per cent of the stocks in the S&P 500 index rallied. Leading the way were airlines and other stocks that need customers feeling confident enough to travel for work or for vacation. Delta Air Lines soared 23.4 per cent. Earlier in the day, it had pulled financial forecasts for 2025 as the trade war scrambles expectations for business and household spending and depresses bookings across the travel sector. In other international markets, indexes tumbled across most of Europe and much of Asia after they closed before Trump’s announcement. London’s FTSE 100 dropped 2.9 per cent, Tokyo’s Nikkei 225 sank 3.9 per cent and the CAC 40 fell 3.3 per cent in Paris. Chinese stocks were an outlier, and indexes rose 0.7 per cent in Hong Kong and 1.3 per cent in Shanghai.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-man-accused-of-orchestrating-partner-s-hit-and-run-murder-denied-bail-20250409-p5lqhd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: No bail for man accused of orchestrating partner’s hit-and-run murder | Boy suffers life-threatening burns in backyard | PM visits Great Barrier Reef",
        "publish_date": "Thu, 10 Apr 2025 11:24:27 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "Last month, CBD revealed that mining giant Rio Tinto was bankrolling the Mabo Centre at the University of Melbourne, an initiative to support traditional owners and First Nations youth that is named after renowned Indigenous land rights campaigner Eddie Mabo, whose High Court case ended the doctrine of terra nullius.\n\nA 1990 photo of Eddie Mabo. Credit: Jim McEwan\n\nFor the company, funding the centre is the next step in a campaign to repair its relationship with First Nations Australians, which was tainted by its destruction of 46,000-year-old Indigenous rock shelters at Juukan Gorge in 2020. The incident brought Rio worldwide opprobrium and led to the resignation of its chief executive, Jean-Sébastien Jacques.\n\nDespite efforts to buy back goodwill with Indigenous communities – the company donated millions to the Yes campaign in the 2023 Voice referendum – not everyone has forgotten Rio’s recent past. This week, six of Mabo’s grandchildren signed a scathing statement condemning the company’s backing of the Mabo Centre, which the statement accuses of betraying the late Eddie Mabo’s vision.\n\n“We are mortified that the Mabo name is tied to something so hypocritical,” says the statement, written by artist Neta-Rie Mabo, and co-signed by her cousins Mahalia, Maria, Hannah, Cathryn and Peta.\n\n“We cannot reconcile our family’s name being tied to a centre funded by the very forces our grandfather fought against. A centre in his name now accepts money from Rio Tinto, a corporation that has desecrated sacred sites and disregarded Indigenous sovereignty. He would be appalled.”\n\nThe statement exposes a division among Mabo’s descendants. His daughter Gail Mabo and grandson Kaleb Mabo both attended the centre’s launch. Gail, a prominent artist, was also featured in an article in The Australian about the centre.\n\nThe six Mabo grandchildren who signed the statement want the centre to cut all ties with Rio Tinto.\n\n“Anything less is a betrayal. Our grandfather’s name deserves better. His legacy is not for sale,” they say.\n\nThe centre’s advisory board issued a statement on Wednesday night saying it was aware of the criticisms but noting the centre’s name was “gifted by senior members of the Mabo family following extensive engagement with them”.\n\nIt said those senior family members were aware of the Rio Tinto investment before deciding whether to gift the name and added that the money did not come with a governance role for the mining giant at the centre. The company declined to comment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/bradley-nails-ace-in-masters-par-3-contest-20250410-p5lqqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bradley nails ace in Masters par-3 contest",
        "publish_date": "Thu, 10 Apr 2025 11:20:16 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bradley nails ace in Masters par-3 contest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/hello-darkness-my-old-friend-welcome-to-wall-street-s-infamous-private-rooms-20250318-p5lkar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hello darkness, my old friend: Welcome to Wall Street’s infamous ‘private rooms’",
        "publish_date": "Thu, 10 Apr 2025 11:19:00 +1000",
        "category": "finance",
        "authors": [
            "Katherine Doherty"
        ],
        "text": "“It’s about exercising control, what liquidity a broker wants to interact with to achieve better execution quality,” says Roman Ginis, CEO of Imperative Execution, the parent company of IntelligentCross. There are myriad reasons why users may opt for private rooms. Take the case of CastleOak Securities, a New York-based minority-run brokerage. The firm wants to trade with similarly minded businesses, so it uses a private room provided by the ATS operator OneChronos. Credit: Bloomberg Intelligence Carlos Cabana, head of equity sales and trading at CastleOak, dubs the room a “diversity pool,” because the participants are all minority-operated brokerage firms. While in this instance CastleOak doesn’t know specifically who is on the other side of every trade, it knows it will be one of about 10 counterparties who meet certain eligibility criteria related to ownership and investment goals. “Think of it as an apartment that’s hosting a party, and there’s one purpose for the party with only invited guests,” says Cabana.\n\nThanks to CastleOak’s increasing use of the diversity pool, OneChronos is now its third most-used trading venue, behind only the New York Stock Exchange and Nasdaq, Cabana says. Execution excellence Private rooms are known by a slew of other names including hosted pools, restricted-access rooms, ATS pools, and custom counterparty groups. They’re gaining popularity in the huge, ultra-fast modern market as a way to help firms avoid losing out against players who may be able to move quicker or who have access to superior information. Dark pools are so-called because the trades they handle happen away from the “lit” public exchange. Credit: Bloomberg For instance, many brokers and market makers are keen to take the other side of retail investor orders. Those small, less volatile trades are generally unlikely to impact prices — so a market maker won’t see an adverse move occur the instant it agrees to fill an order, as might happen with another type of counterparty.\n\nBrokers who take orders to private rooms typically expect to fill the order at the midpoint of the national-best-bid and offer, or NBBO (assuming the rule of the room is set up that way, which is usually the case). If for some reason the order is not filled in the room at the midpoint, it can move to the broader ATS where multiple other parties can compete to fill it. And if a broker has bad experiences with a private room, they can change to another in the future, avoiding those counterparties. “The problem we have is, how do we identify good versus bad liquidity?” says Jatin Suryawanshi, global head of quant strategy at Jefferies, who estimates that 15 in every 100 shares executed by the firm’s algorithms currently move via a room. “In using private rooms, you can prioritize who you want to interact with.” The growth of private rooms has accelerated as their use has become more common and as stock trading has migrated away from public exchanges. Off-exchange activity has been rising for years in the US, and now frequently accounts for more than half of all recorded volume. Private rooms emerged at the ATS firm LeveL as far back as 18 years ago. LeveL started by allowing firms to match their own orders, in what’s known as internalization. That expanded to other forms of segmentation, including bi-lateral and multi-lateral agreements, where one party agrees to trade with another, or multiple parties agree to only interact with each other, within the same ATS. Following requests from its own clients, IntelligentCross started offering its version of private rooms about a year-and-a-half ago, and OneChronos joined the party last year.\n\nPrivate rooms are not generally needed by big banks or brokers who have the resources to create their own ATS or what are called single-dealer platforms. That’s another breed of off-exchange trading venue where the operator is always the counterparty to any trade. But for smaller players, it’s too expensive and cumbersome to build and manage an ATS or SDP, meet the associated regulatory reporting requirements and set up the necessary connections. Arranging a private room at an established ATS is a solution. Loading “There are various factors of why a firm would want to outsource this activity than keep it in house,” says Steve Miele, CEO of Kezar Markets, the parent of LeveL. “It could be a cost, an overhead they don’t necessarily have to take on if we can build it, then scale it” using the existing network, he says. “We lower the barrier to entry.” At IntelligentCross, the majority of rooms currently offered serve institutional brokers that don’t have capacity to conduct similar activities internally. Jefferies trades in a private room provided by the firm where it interacts with seven other brokers who don’t have their own ATS, but have institutional orders, according to Suryawanshi.\n\n“These are always created at the request of a subscriber, who is the host that invites others to be guests in their book,” says Ginis at Imperative Execution. Dark disclosure Not every ATS is rushing to embrace private rooms. New York-based PureStream offers “pools” that operate like rooms, but they are disclosed to all subscribers if they are created, and anyone can join. In essence, the room is open to all. Credit: Bloomberg So far no one has asked to set up a pool at PureStream, so there is zero volume in so-called sub-pools, according to CEO Armando Diaz. He says offering a private room that isn’t open to all subscribers raises questions about the regulation. “The more the host controls the room, the more they are operating an ATS, and that opens up regulatory risk,” he says.\n\nPerhaps the biggest criticism of private rooms is that they create phantom liquidity, because transactions taking place inside a room are simply lumped in with the total activity reported by its dark pool parent. That creates a misleading picture for anyone trying to gauge market depth, since reported trading volumes include activity not available to those outside the room. ATS are regulated trading venues, overseen by the Securities and Exchange Commission, which in 2018 enhanced its supervision of such venues by imposing new disclosure requirements. Each dark pool must now file a form, ATS-N, which gives an overview about the specific trading mechanisms on its platform. These publicly available forms go into various details, including whether private rooms are available. But they don’t say how many exist or who is in them, and the varying language and levels of disclosure used mean it can sometimes be difficult to determine if an ATS is even hosting any rooms. ‘They are innovative, and here to stay. There is more going on there than most people know.’ Mark Gurliacci, former NYSE employee and now senior vice president and senior quantitative trader at AllianceBernstein “There are no rules to force ATS to break out the identity of single-dealer rooms or their volume,” Larry Tabb, head of market structure at Bloomberg Intelligence, wrote in a May note. The Financial Industry Regulatory Authority “does a good job of ATS volume reporting on a post-execution basis. Yet there are no rules to aid analysts or users looking to break down the percentage of ATS volume executed in the open pool vs. the private room, or the volume executed using segmentation strategies,” he wrote.\n\nDark pools are no strangers to transparency worries. Their opacity provoked extensive media coverage and regulatory scrutiny about a decade ago amid speculation they gave high-frequency firms advantages against other investors — attention partly prompted by the bestselling book Flash Boys. Representatives for both Finra and the SEC declined to comment. ‘Growth mode’ For their users, private rooms are a handy tool, but still one of a set. Hosted pools represent a single-digit percentage of IntelligentCross’s overall volumes for now — an average of about 5.4 per cent last year — because they’re so new, according to Ginis. “It will take brokers some time to optimise for this,” he says. CEO of OneChronos Capital Markets Vlad Khandros says its rooms represent less than 5 per cent of volume at present as “it’s newer for us, so it’s still in growth mode.” But demand is strong. “We’ve seen increased interest from both retail and institutional brokers,” Khandros says. “The focus on execution quality will continue to grow.”\n\nLoading LeveL declined to disclose the number of rooms it operates or how much activity takes place in them, with Miele saying the absence of industry-wide criteria for categorising rooms means it could be “misleading to quantify.” Mark Gurliacci, senior vice president and senior quantitative trader at AllianceBernstein, reckons up to 75 per cent of the firm’s activity is now happening off-exchange, including in private rooms. While the latter is a small slice of their trading at present, he thinks it’s set to grow. “Many firms are setting up private rooms these days,” says Gurliacci, who used to work for the NYSE. “They are innovative, and here to stay. There is more going on there than most people know.” Bloomberg",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/ophelia-westgarth-20250403-p5loz1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ophelia Westgarth",
        "publish_date": "Thu, 10 Apr 2025 11:18:44 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGo from coffee to cocktails at this part-cafe, part-wine bar.\n\n1 / 9 The bullhorn peppers and tartine at Ophelia. Dave Green 2 / 9 The statement record wall at Opehlia. Dave Green 3 / 9 The tartine with la fontella, Raffa farm asparagus and pink pepper gremolata. Dave Green 4 / 9 Pickled goods. Supplied 5 / 9 Fried milk bread with cardamom sugar, orange, citrus curd and mint. Dave Green 6 / 9 Having a vinyl time at Ophelia. Dave Green 7 / 9 The Michelxada Verde cocktail. Dave Green 8 / 9 Ophelia ups Westgarth’s outdoor dining game. Dave Green 9 / 9 Goodies to go. Dave Green Previous Slide Next Slide\n\nCafe$$$$\n\nNext to Northcote’s Palace Westgarth cinema, Ophelia is part-cafe, part-wine bar, by the team behind Terror Twilight, Convoyand Tinker. The old Barry cafe corner site has been rejigged with day-to-night flexibility in mind.\n\nGo from coffee to cocktails at the curvy new bar. There’s also a statement record wall with refurbed vintage speakers, and the original maroon-ish terrazzo floor is back on display. A glass cabinet houses the grab-and-go sandwiches and salads of the day, as well as the rotating savoury scone and baked goods galore.\n\nJust as sweet is the miso-butterscotch iced latte, a hot new player in Melbourne’s iced-coffee game. A handful of cocktails and a locally charged wine list are available until Ophelia closes, which is currently 4pm, but there are plans to extend to nighttime trade in the future, giving cinema-goers somewhere to snack and sip either side of later sessions.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/virgin-to-refund-61-000-customers-for-pricing-error-on-ticket-changes-20250410-p5lqpk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Virgin to refund 61,000 customers for pricing error on ticket changes",
        "publish_date": "Thu, 10 Apr 2025 11:15:44 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Virgin Australia is refunding 61,000 customers who had been overcharged after an error was discovered in the company’s pricing systems.\n\nThe airline said the transactions occurred when tickets were repriced in response to customer changes to itineraries.\n\nVirgin Australia has discovered a pricing error on ticket changes. Credit: Paul Rovere\n\n“We have policies that determine when and how we reprice a guest’s booking when they make a change to their itinerary,” a Virgin spokesperson said.\n\nIn “some instances...some bookings were repriced in a way that does not align with our policy,” a spokesperson said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/in-a-really-bad-place-mckay-opens-up-on-mental-health-struggles-20250410-p5lqnu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Really scary’: McKay opens up on mental health struggles",
        "publish_date": "Thu, 10 Apr 2025 11:10:05 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Star forward Harry McKay has opened up about his decision to take three weeks personal leave away from Carlton’s struggling senior outfit, revealing he was in such a bad place he had to put his hand up for help.\n\nAs the 2021 Coleman Medallist prepares for his senior return against West Coast Eagles on Saturday during Gather Round, he said his mental health started to suffer on the eve of the AFL season.\n\n“I guess five or six weeks ago, late Feb, I started feeling in not a great place mentally,” McKay told The Ben and Harry Podcast.\n\nMcKay played the first round in Carlton’s shock loss to a rebuilding Richmond outfit and then stood himself down for the following three weeks - losses to Hawthorn, Western Bulldogs and Collingwood.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-will-they-break-the-10-second-barrier-australia-s-young-sprint-stars-descend-on-perth-20250410-p5lqo1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Will they break the 10-second barrier? Australia’s young sprint stars descend on Perth",
        "publish_date": "Thu, 10 Apr 2025 11:04:56 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hopes are high the magical 10-second barrier will be broken as Australia’s next wave of sprint stars converge in Perth for the Australian Athletics Championships, which get underway today.\n\nThe rapid emergence of Gout Gout has already set tongues wagging around the world, with the 17-year-old Queenslander even drawing comparisons with the great Usain Bolt.\n\nLachie Kennedy beats Gout Gout in the 200m sprint at the Maurie Plant meet in Melbourne on March 29, 2025. Credit: Seven\n\nBut it seems Gout is just part of what is shaping up to be a golden generation of Australian sprinting.\n\nWorld Indoor 60m silver medallist Lachlan Kennedy put his name up in lights by beating Gout last month in the men’s 200m at the Maurie Plant Meet in Melbourne.\n\nGout and 21-year-old Kennedy will again go head-to-head in the 200m, with the final to be run in Floreat on Sunday.\n\nUnfortunately for sprint fans, Kennedy won’t be head-to-head with Gout in the 100m, given Gout will compete in the U20s sprint on Thursday evening and Kennedy in the Open category on Friday and Saturday.\n\nNevertheless, both stars are aiming to crack the 10-second barrier, meaning it could be a double dose of joy for Australian sprinting at the meet.\n\nThe current Australian men’s record is 9.93 seconds, which was set by Patrick Johnson in Mito, Japan in 2003.\n\n“I’m aiming for a sub-10 time for sure,” Kennedy said.\n\n“In one of the rounds, I’ll do it and then I want to try and break the Australian record in the 100m and I really want to go for 19 seconds in the 200m.\n\n“I think that’s more than possible, it’ll just be how my body can handle the rounds.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-trump-escalates-trade-war-with-china-while-pausing-tariffs-on-other-nations-dutton-albanese-continue-campaigns-20250409-p5lqiv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: ASX lifts 5.9 per cent after Trump pauses tariffs with other nations, escalates trade war with China; Dutton, Albanese campaigns continue",
        "publish_date": "Thu, 10 Apr 2025 10:23:39 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko"
        ],
        "text": "An increasingly confident Prime Minister is emerging on the campaign trail.\n\nWhile the opposition has executed a backflip on its work from home policy, and ditched a candidate due to controversial views, it was all plain sailing for Anthony Albanese as he visited Green Island on the Great Barrier Reef.\n\nBut despite the PM’s optimism, which today extended far enough to raise the prospect of Labor beating opposition leader Peter Dutton in his own seat of Dickson, in Brisbane, he is being careful not to get too far ahead of himself.\n\nWhen asked if a second term Labor government would set even more ambitious climate goals than it did in its first term, Albanese reiterated Australia’s current goal to cut greenhouse emissions by 43 per cent.\n\n“What you need is a certainty,” he said. “The business community asked for certainty. We’ve given it that.”\n\nIt’s a reminder that cost of living pressures remain key to the election. Labor promised in 2022 that its renewable energy policy would cut power bills by $275 by 2025. In reality, power bills have shot up $500 for the hardest hit households and Labor is under pressure to explain how more renewables will provide bill relief.\n\nDon’t expect to see any more ambitious promises from the PM this time around.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/workplace/the-barbershop-that-s-cutting-hair-not-corners-20250403-p5losu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The barbershop that’s cutting hair – not corners",
        "publish_date": "Thu, 10 Apr 2025 10:15:29 +1000",
        "category": "finance",
        "authors": [
            "Katie Cunningham"
        ],
        "text": "Some barber shops get customers in and out as quickly as possible. A speedy cut with the clippers, a dust off the shoulder, and you’re on your way. But not Tate & Lyle.\n\nFor the past five years, the Sydney CBD-based barbershop has offered a very different experience to its clients. They prioritise quality, craftsmanship and offer luxury treatments as well as the standard cuts, all in a calming and stylish space. You can expect to be served a premium drink while you’re there, and to truly savour your time in the chair.\n\nPrecision, craftsmanship, and a touch of luxury. Tate & Lyle has been redefining the barbershop experience in Sydney’s CBD for five years.\n\nIt’s an approach that’s seen them cultivate a loyal following, and be named the city’s most outstanding barbershop multiple times.\n\nAs founder Jacob Martin tells, one simple ethos underpins it all. “Whether it’s a regular trim or a complete restyle, we make sure every visit is more than just a haircut – it’s an experience,” he says.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/health-alert-for-sydney-after-six-hospitalised-with-potentially-deadly-disease/7uy5cal22",
        "title": "Health alert for Sydney after six hospitalised with potentially deadly disease",
        "publish_date": "Thu, 10 Apr 2025 01:35:39 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Six people have been hospitalised as hundreds of thousands are warned to monitor for symptoms after a Legionnaires' disease outbreak in Sydney's busy city centre.\n\n\n\n\n\nHealth authorities are yet to trace the source of the outbreak but say each person who developed Legionnaires' disease had spent time in Sydney's CBD over the past three weeks.\n\n\n\n\n\nNSW Health has advised people who have been in the area in the past 10 days — numbering many hundreds of thousands — to be on the lookout for symptoms of the disease, including fever, chills, cough and shortness of breath.\n\n\n\nWho's most at risk?\n\nLegionnaires' disease can lead to severe chest infections, such as pneumonia.\n\n\n\n\n\nPublic health physician Vicky Sheppeard said symptoms can develop up to 10 days after exposure to the bacteria, often caused by contaminated water particles in cooling systems entering the air and being breathed in.\n\n\n\n\"Those most at risk include elderly people, people with underlying lung or other serious health conditions, and smokers,\" Sheppeard said.\n\n\n\nWhat happens next?\n\nAuthorities are reviewing maintenance records for cooling towers to prioritise inspections and sampling to trace the source.\n\n\n\n\n\nMore than 100 people developed the disease after an outbreak from cooling towers in Melbourne in August.\n\n\n\n\n\nTwo people, a man in his 60s and a woman in her 90s, died.\n\n\n\n\n\nAt least seven people were hospitalised from a Sydney outbreak in January 2024, while another three were diagnosed with the disease from an outbreak near The University of Sydney a month later.\n\n\n\n\n\nThe disease is not spread from person to person but has a fatality rate of about 10 per cent.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-insurance/dygiuv7rw",
        "title": "Cost of Living Secrets: Insurance",
        "publish_date": "Wed, 9 Apr 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/our-ancestors-didnt-eat-3-meals-a-day-so-why-do-we/isv9kgl2m",
        "title": "Our ancestors didn't eat three meals a day. So why do we?",
        "publish_date": "Wed, 9 Apr 2025 21:10:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Pop quiz: What's the name of the world's most famous trio? If you're a foodie, then your answer might have been breakfast, lunch and dinner.\n\n\n\n\n\nIt's an almost universally accepted trinity — particularly in the Western world.\n\n\n\n\n\nBut how did it come about?\n\n\n\nThe first meals\n\nEarly humans were nomadic. Forming small communities, they would travel with the seasons, following local food sources.\n\n\n\n\n\nWhile we can only guess what daily mealtimes rhythms looked like, evidence dating back 30,000 years from the South Moravia region, Czech Republic, shows people visited specific settlements time and again.\n\n\n\nThe fertile crescent covers the rich, biodiverse valleys of the Tigris, Euphrates and Jordan rivers. Source: Shutterstock / The Conversation They gathered around hearths, cooking and sharing food: the first signs of human \"commensality\", the practice of eating together.\n\n\n\n\n\nOne of the best-preserved hunter-gatherer sites we've found is located on the shores of the modern-day Sea of Galilee (also called Lake Tiberias or Lake Kinneret) in Israel, and it dates back some 23,000 years.\n\n\n\n\n\nIn addition to several small dwellings with hearths, it provides evidence of diverse food sources, including more than 140 types of seeds and nuts, and various birds, fish and mammals.\n\n\n\n\n\nThe development of agricultural knowledge some 12,000 years ago gave rise to permanent settlements. The earliest were in the Levant region (across modern-day Iraq, south-western Iran and eastern Türkiye), in an area called the Fertile Crescent.\n\n\n\n\n\nPermanent agriculture led to the production of a surplus of food. The ability to stay in one place with food on hand meant the time it took to cook no longer mattered as much.\n\n\n\n\n\nIt quickly became common to eat one light meal early in the day, followed by a larger hearth-prepared meal later on. The specific timings would have varied between groups.\n\n\n\nEating together as a rule\n\nThe communal nature of foraging and hunting, and later farming, meant humans almost always ate their meals in the company of others.\n\n\n\n\n\nIn the ancient city-state of Sparta, in the fourth century BCE, these practices were codified as common main meals called syssitia (eating together).\n\n\n\n\n\nThese meals were consumed at the end of the day in communal dining halls. Food was served by young boys to tables of 15 or so men who lived together and fought in the same military division.\n\n\n\n\n\nThe men gradually shared generational knowledge with the young boys, who themselves would join the tables by age 20.\n\n\n\n\n\nIn the fifth century BCE, Greek historian Herodotus wrote about how syssitia evolved from a Spartan military practice to having deep political meaning in society.\n\n\n\n\n\nSimilarly, Plato wrote common meals were an integral component of civil society and that missing a meal without good reason was a civic offence.\n\n\n\n\n\nBy dining in with the rest of society, citizens were compelled to maintain self-discipline. Mealtime was also an opportunity for social linkage and important discussions ranging from business deals to politics.\n\n\n\n\n\nThe eating habits of Spartan women are missing in the texts, although it is implied they ate at home.\n\n\n\nREAD MORE Sharing a meal really can make us happier people\n\nBunches of lunches\n\nCounter to the tough Spartan way of life, the Romans enjoyed their main meal earlier in the day, followed by a lighter meal just before bed.\n\n\n\n\n\nThe northern European tribes tended towards two larger meals per day, as more sustenance is required in colder climes. To the Vikings, these meals were known as dagmal and nattmal, or day meal and night meal.\n\n\n\n\n\nNattmal was the cooked evening meal, while dagmal usually consisted of leftover nattmal with the addition of bread and beer or mead.\n\n\n\nREAD MORE This Chinese restaurant will tell our Indigenous and Asian history through food\n\nIn Australia, evidence suggests Aboriginal peoples tended toward a daily single meal, which aligns with the predominant method of cookery: slow-cooking with hot coals or rocks in an earth oven.\n\n\n\n\n\nThis underground oven, used by Aboriginal and Torres Strait Islander communities, was referred to as a kup murri or kap mauri by some groups.\n\n\n\n\n\nThis is similar to other Indigenous preparations throughout the Pacific, such as the New Zealand Māori hāngī, Hawaiian imu, Fijian lovo, and even the Mayan píib.\n\n\n\n\n\nThe once-daily meal would have been supplemented with snacks throughout the day.\n\n\n\nThree's the magic number\n\nThe timing of meals was heavily influenced by class structure, local climate and people's daily activities. Practicality also played a part.\n\n\n\n\n\nWithout reliable lighting, meals had to be prepared and eaten before dark. In settled parts of northern Europe, this could be as early as 3pm.\n\n\n\n\n\nSo how did we go from one or two main meals to three? The answer may lie with the British Royal Navy.\n\n\n\n\n\nSince its inception in the 16th century, the navy has served three regular meals to align with the shipboard routine. This included a simple breakfast of ship's biscuits, lunch as the main meal, and dinner as more of a light supper.\n\n\n\n\n\nSome sources suggest the term square meal may have come from the square wooden trays meals were served in.\n\n\n\nInitially, sailors received a gallon of beer with meals daily. This was later changed to watered-down rum, the infamous \"grog\" which is being handed out in this 1940 photo taken aboard HMS King George V. Credit: Imperial War Museums The Industrial Revolution, which started around 1760, arguably also played a role in formalising the concept of three specific mealtimes across the Western world.\n\n\n\n\n\nThe cadence of breakfast, lunch and dinner matched the routine of the longer, standardised workdays. Workers ate breakfast and dinner at home, before and after work, while lunch was eaten with coworkers at a set time.\n\n\n\n\n\nWith minimal breaks and no time for snacking, three substantial meals became necessary.\n\n\n\nThe fall of the holy trinity\n\nToday, many factors impact the time and frequency of our meals, from long work commutes to juggling hobbies and social obligations.\n\n\n\nThe ways in which we eat and share food continue to evolve alongside our societies and cultures. Source: Shutterstock / The Conversation The COVID-19 pandemic also impacted how and what we eat, leading us to eat larger amounts of higher-calorie foods. The rapid growth of delivery services also means a meal is no more than a few minutes away from most people.\n\n\n\n\n\nAll of this has resulted in mealtimes becoming less rigid, with social meals such as brunch, elevenses and afternoon teas expanding how we connect over food. And mealtimes will continue to evolve as our schedules become ever more complicated.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-announces-90-day-tariff-pause-but-hits-china-with-even-higher-rate-of-125-per-cent/ar67a5xmb",
        "title": "Trump announces 90-day tariff 'pause' but hits China with even higher rate of 125 per cent",
        "publish_date": "Wed, 9 Apr 2025 20:19:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Donald Trump has announced a 90-day pause on most country-specific tariffs.\n\nTrump said he would raise the tariff on Chinese imports to 125 per cent.\n\nUS treasury secretary Scott Bessent said \"this was his strategy all along\".\n\nIn a stunning reversal, United States President Donald Trump said on Thursday he would temporarily lower new tariffs on many countries, even as he raised them further on imports from China.\n\n\n\n\n\nTrump's turnabout, which came less than 24 hours after steep new tariffs kicked in on most trading partners, followed the most intense episode of financial market volatility since the early days of the COVID-19 pandemic. The upheaval erased trillions of dollars from stock markets and led to an unsettling surge in US government bond yields that appeared to catch Trump's attention.\n\n\n\n\n\n\"I saw last night that people were getting a little queasy,\" Trump told reporters following his announcement. \"The bond market right now is beautiful.\"\n\n\n\nTrump said he would raise the tariff on Chinese imports to 125 per cent from the 104 per cent level that took effect at midnight, further escalating a high-stakes confrontation between the world's two largest economies.\n\n\n\n\n\nIn the latest twist, Trump said he would suspend targeted tariffs on other countries for three months to allow time for US officials to negotiate with countries that have sought to reduce them.\n\n\n\n\n\nTrump's reversal on the country-specific tariffs is not absolute. A 10 per cent blanket duty on almost all US imports will remain in effect, the White House said. The announcement also does not appear to affect duties on autos, steel and aluminum that are already in place.\n\n\n\nWall Street soars on tariff pause\n\nUS stock indexes shot higher on the news, with the Dow Jones Industrial Average surging 7.9 per cent to 40,608.45 and the broad-based S&P 500 Index rallying 9.5 per cent to 5,456.90.\n\n\n\n\n\nThe tech-focused Nasdaq Composite Index jumped 12.2 per cent to 17,124.97.\n\n\n\n\n\nArt Hogan, managing director of stock picking firm B. Riley Financial, said: \"When markets are pricing in worst-case scenarios, it doesn't take much good news to turn that opinion around.\"\n\n\n\n\n\nHe said investors were waiting for any sign of a more reasonable trade process, adding the situation might \"be less of a drag on economic activity and earnings\".\n\n\n\n\n\nBut he cautioned that \"China will become hyper-aware of the fact that they're now being isolated in this process\".\n\n\n\n\n\nGoldman Sachs cut its probability for a recession back to 45 per cent after Trump's move, down from 65 per cent, saying the tariffs left in place were still likely to result in a 15 per cent increase in the overall tariff rate.\n\n\n\n'Maximum leverage'\n\nUS treasury secretary Scott Bessent said the administration needed time to negotiate with more than 75 countries that had reached out and suggested Trump had used the tariffs to create \"maximum negotiating leverage for himself\".\n\n\n\n\n\n\"This was his strategy all along,\" he told reporters at the White House. \"And you might even say that he goaded China into a bad position. They responded. They have shown themselves to the world to be the bad actor.\"\n\n\n\n\n\nBessent is the point person in the country-by-country negotiations that could address foreign aid and military cooperation as well as economic matters.\n\n\n\nTrump has spoken with leaders of Japan and South Korea, and a delegation from Vietnam was due to meet with US officials on Wednesday.\n\n\n\n\n\nTrump's announcement appeared to surprise US trade representative Jamieson Greer, who was testifying on Capitol Hill.\n\n\n\n\n\n\"I understand it's 90 days, I haven't spoken to the president,\" he told politicians.\n\n\n\n\n\nSteven Horsford, a Democratic US representative, said: \"It looks like your boss just pulled the rug out from under you and paused the tariffs, the taxes on the American people. There's no strategy.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/could-global-tariffs-and-interest-rate-cuts-shake-up-australias-housing-market/i2dgh4q5d",
        "title": "Could global tariffs and interest rate cuts shake up Australia’s housing market?",
        "publish_date": "Wed, 9 Apr 2025 19:45:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "The past week has featured worldwide economic turmoil. Global share markets have plunged, the Australian dollar is sliding, and fresh tariffs are on the table for every country around the world, courtesy of United States President Donald Trump.\n\n\n\n\n\nThe prospect of weaker global growth has people jittery — and central banks, including the Reserve Bank of Australia (RBA), are back on rate-cut watch.\n\n\n\n\n\nBut what does that mean for Australia's ever-growing housing market?\n\n\n\n\n\nWe asked experts how the latest economic ructions could impact house prices — and who's most likely to benefit or lose out.\n\n\n\nRate cuts would matter more than tariffs\n\nWhile Trump's tariffs aren't about housing, their ripple effects could eventually touch it, even here in Australia.\n\n\n\n\n\nTrump has imposed a 10 per cent tariff on Australia, while other countries faced even steeper tariffs, with China hit hardest at 104 per cent .\n\n\n\nAlthough tariffs themselves don't directly impact the housing market, they can shape global trade, affect employment, and dampen economic growth.\n\n\n\n\n\nThis can influence how confident Australians feel about making big financial decisions like buying property — and prompt movement from central banks.\n\n\n\n\n\nBoth experts SBS News spoke to agreed that it wasn't the tariffs themselves that would impact housing, it's how governments and central banks respond.\n\n\n\n\n\n\"Generally, when we see an economic shock, like what we seem to be moving into at the moment, the next thing we see is some level of stimulus,\" said Tim Lawless, head of research at property market analysts CoreLogic.\n\n\n\n\n\nIn other words, if global growth falters, interest rate cuts are likely to follow — and that's where housing starts to react.\n\n\n\n\n\n\"If we do see interest rates coming down potentially 50 basis points (0.5 per cent) in May and maybe another 100 basis points (1 per cent) by the end of the year, it may be a positive factor for housing markets,\" Lawless said.\n\n\n\nLower interest rates tend to make mortgages cheaper, boost borrowing capacity and free up cash. That can push more buyers into the market and drive prices higher — especially when supply is already tight.\n\n\n\n\n\nLawless adds that any interest rate cuts won't meaningfully change housing affordability, but it may boost confidence.\n\n\n\nJobs are the real anchor\n\nFor Dr Luke Hartigan, an economist at the University of Sydney and former adviser at the Reserve Bank, the bigger concern is the labour market.\n\n\n\n\n\n\"Labour market is the key for house prices,\" he said. \"If you don’t see a substantial deterioration in the labour market, then house prices should be okay.\"\n\n\n\nREAD MORE What the latest inflation data could mean for your interest rate\n\nEven if the global economy takes a hit, Hartigan says, the impact on housing will be limited unless unemployment starts to rise.\n\n\n\n\n\n\"Australians are unlikely to just abandon their homes,\" he adds. \"They wear the debt. If you have your job, you keep making repayments.\"\n\n\n\nPrices may keep rising — but not fast\n\nDespite stock market jitters, neither expert sees a housing crash on the cards. If anything, lowering interest rates could mean prices may rise further, albeit more slowly than before.\n\n\n\n\n\n\"Housing [price growth] probably won’t be as steep just because of the increased uncertainty,\" Hartigan said. \"If people are concerned about their job, then they’re more likely to not want to take on debt.\"\n\n\n\n\n\n\"If they’re not likely to take on debt, there’s going to be fewer people who are keen to bid up prices.\"\n\n\n\n\n\nIn short, rate cuts could support the market, but uncertainty might keep buyers cautious — especially those on the edge of affordability.\n\n\n\nAustralia's property market has already lifted off the back of the Reserve Bank's interest rate cut. Source: SBS News The RBA's February interest rate cut , its first since 2020, has coincided with a lift in the housing market.\n\n\n\n\n\nAccording to CoreLogic's latest Hedonic Home Value Index report, Australian property values reached new heights in March with an increase of 0.4 per cent, reversing a recent downward trend.\n\n\n\n\n\n\"We're seeing some changing gears in the housing market,\" Lawless explained.\n\n\n\n\n\n\"From October last year, we started to see our home value index really flatten out … then as of February, the market started to bounce back a little bit on the back of the February cash rate cut back to near record highs by the time we saw March data come through.\"\n\n\n\n\n\nHowever, due to factors like housing affordability and high household debt, Lawless doesn't expect a strong rebound in prices.\n\n\n\n\n\n\"The fact that house affordability is quite stretched will naturally just keep a bit of a ceiling on how high prices can go.\"\n\n\n\nWho wins and who loses?\n\nPut simply, those who already own homes are likely to benefit — again.\n\n\n\n\n\n\"If you already own a home and we start to see housing prices rising again, that’s a great thing for household wealth,\" Lawless said. \"But for those looking to get into the marketplace, affordability becomes even more stretched.\"\n\n\n\n\n\nHartigan agrees. \"It’s probably going to be the people who already own homes, or people who are looking to just get in now and they have the cash.\"\n\n\n\nFirst-home buyers, on the other hand, could be squeezed out yet again — especially if they've put their savings into riskier investments.\n\n\n\n\n\n\"If house prices start to rise, it’s probably not going to be very good for first-home buyers, depending on how people have put their deposits,\" Hartigan said.\n\n\n\n\n\n\"Maybe many of them, like myself, have put them into a managed fund — and now it’s worth less.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-at-fresh-5-year-low-on-us-china-trade-dispute-how-companies-are-tackling-dei-now/92z1go7yv",
        "title": "A$ at fresh 5 year low on US-China trade dispute & how companies are tackling DEI now",
        "publish_date": "Wed, 9 Apr 2025 08:07:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/us-president-donald-trumps-second-wave-of-global-tariffs-take-effect/ru5fm68k8",
        "title": "US President Donald Trump's second wave of global tariffs take effect | Evening News Bulletin 9 April 2025",
        "publish_date": "Wed, 9 Apr 2025 06:16:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUS President Donald Trump's second wave of global tariffs take effect...\n\nThe Greens announce new plan to scrap tax incentives for wealthy property investors...\n\nArsenal thump Real Madrid three-nil courtesy of two stunning freekicks from Declan Rice.\n\n\n\nThe second round of United States President Donald Trump's global trade tariffs have now come into effect.\n\n\n\n\n\nThat means 10 per cent blanket tariffs on Australian exports to the US and 104 per cent levies on Chinese goods, as trade tensions escalate between Beijing and the U-S.\n\n\n\n\n\nIn South Korea, 25 per cent tariffs have come into force despite a free trade agreement.\n\n\n\n\n\n24-year-old South Korean job seeker Shin Ye-Ji says the U-S is not considering the broad impact they're having on the world including South Korea's struggling economy.\n\n\n\n\n\n“It feels disappointing that only the interests of the United States are being prioritised, rather than each country or company striving for mutual prosperity.”\n\n\n\n\n\nGreens leader Adam Bandt says his party will prioritise reforming negative gearing and the 50 per cent capital gains tax discount in the next Parliament while protecting small investors.\n\n\n\n\n\nWhile the Greens have put up similar policies in previous elections, Mr Bandt says this time, they plan on using the proposal as a bargaining chip for Labor if it wants his party's support to form government after the May 3rd election.\n\n\n\n\n\nMr Bandt says negative gearing and the capital gains tax discount have seen property prices rise dramatically, pricing many first homebuyers out of the market and rewarding the mega-wealthy.\n\n\n\n\n\nBut he says, in scrapping these schemes, his party pledges to protect middle-class Australians who are using an investment property to help secure their retirement.\n\n\n\n\n\n\"There are a huge number of people who are using this scheme to look after their retirement, people who have made plans for their future based on the levers available to them. These people aren’t billionaires or wealthy property investors, it’s not their fault the system is so broken and they make up more than two thirds of people who use negative gearing. We will protect existing Mum and Dad investors by grandfathering negative gearing and capital gains tax for people with one investment property. That remains for them forever.\"\n\n\n\n\n\nOpposition Leader Peter Dutton says the Coalition will reduce net migration to Australia by 100,000 if they are elected.\n\n\n\n\n\nThe latest figures from the Australian Bureau of Statistics indicate net migration dropped to 379,000 in the year to last September and is forecast to fall further.\n\n\n\n\n\nThe Labor government has pledged to further reduce overseas net migration, which has been declining from post-COVID highs.\n\n\n\n\n\nBut Mr Dutton says the government is not doing enough to meet its own migration targets and it is hurting Australians.\n\n\n\n\n\n\" People who started with nothing and amassed a fortune or people who have come here as builders and bricklayers and the rest of it, we are a net beneficiary about but I think the concentration at the moment is on how canal migration program work best for us? It doesn't work best for us when you see an escalation in numbers to a record high. This whole big Australia policy that has led to Anthony Albanese 's housing crisis and the reason young Australians can't get into housing is because of the decisions the prime has made.\"\n\n\n\n\n\nAnother 3,000 doctors have walked off the job to take part in the second day of industrial action in New South Wales, demanding higher wages and safer working conditions.\n\n\n\n\n\nThe doctors' union maintains that emergency departments and critical care have not been compromised by the three-day strike.\n\n\n\n\n\nBut New South Wales Health Minister Ryan Park says the walkout has forced the cancellation of more than 600 elective surgeries and 4000 outpatient appointments since yesterday [[Tues]] morning.\n\n\n\n\n\nDoctors are demanding pay parity with other states and guaranteed 10 hour breaks between shifts.\n\n\n\n\n\nRyan Park says the state government is trying to address the discrepancy in wages but it will take time.\n\n\n\n\n\n\"No one is hiding under a rock and pretending that we’re not aware of discrepancies. But trying to make up 12 years of wage suppression in 12 months is also not feasible and I want doctors to understand that.\"\n\n\n\n\n\nIn football,\n\n\n\n\n\nDeclan Rice's two fantastic freekicks helped Arsenal to an emphatic 3-0 victory over Real Madrid in the first leg of their Champions League quarter-final.\n\n\n\n\n\nDespite a number of heroic saves from Real Madrid's goalkeeper Thibault Courtois there was no stopping Rice's stunning opener in the 58th minute - the midfielder's first senior goal from a direct freekick.\n\n\n\n\n\nAnd Rice's second freekick was even better than the first, curled straight into the top corner in the 70th minute, to leave the 15-time European champions looking stunned.\n\n\n\n\n\nAnd a striker's finish from Mikel Merino gave Arsenal their third goal.\n\n\n\n\n\nArsenal Manager Mikel Arteta says he was amazed by Declan Rice's goals.\n\n\n\n\n\n“To score two goals in 12 minutes of that magnitude and that quality from the same player, a player who has never scored from a free kick before in his career, I mean, what are the odds? But he's done it tonight. I'm a big believer. I think the crowd played something with the energy that they put in and it helped us massively to win the game.”\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-this-premier-league-footballer-had-to-wear-a-different-kit-from-his-teammates/qnet2vzxe",
        "title": "Why this Premier League footballer had to wear a different kit from his teammates",
        "publish_date": "Wed, 9 Apr 2025 03:22:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "A 15-year-old footballer has become one of the youngest to play in the Premier League — but it was a detail on his shirt that raised questions.\n\n\n\n\n\nJeremy Monga was substituted on for Leicester City in their 3-0 loss to Newcastle United and played 16 minutes of the game.\n\n\n\n\n\nBut Monga's jersey was notably different from that of his Leicester teammates due to restrictions on gambling advertising in the United Kingdom.\n\n\n\nWhat happened with Jeremy Monga?\n\nAn online cryptocurrency gaming platform sponsors Leicester, and the company's logo is featured on the front of their shirts.\n\n\n\n\n\nBut the Gambling Act 2005, which underwent a review in 2020, prohibits players under 18 from wearing kits displaying gambling sponsors.\n\n\n\n\n\nMonga, an England U16 international, made his senior debut at 15 years and 271 days old.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-9-april-2025/ojeaxiao7",
        "title": "SBS News in Easy English 9 April 2025",
        "publish_date": "Wed, 9 Apr 2025 02:57:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia's major party leaders have had their first leaders' debate of the federal election campaign.\n\n\n\n\n\nAnthony Albanese and Peter Dutton were asked by the group of 100 voters in the Western Sydney region about education, healthcare costs, and energy bill relief, among other issues.\n\n\n\n\n\nAbout half the audience raised their hands when asked if they were struggling with the cost of living.\n\n\n\n\n\nThe Prime Minister and Opposition leader focused on cost of living issues as one of the most pressing election matters in the closing statements of their debate on Sky News.\n\n\n\n\n\nTreasurer Jim Chalmers is to meet financial regulators to discuss the impact of United States President Donald Trump's tariffs.\n\n\n\n\n\nThe high-powered meeting is expected to take place on Wednesday [[9/4]] and include the heads of the central bank and the banking, business and consumer watchdogs.\n\n\n\n\n\nEx-ambassador to the U-S Arthur Sinodinos told Nine's Today program it's a confidence-building measure.\n\n\n\n\n\n\"We're getting our best brains together to work out how we diversify our markets, how we adjust our economy, how we get ready for this. It's the sort of thing you'd expect any government to do and with the pressure of an election, governments in particular have to be seen to be in control. The reality is this has a long way to play. We dunno whether the tariffs are coming. We dunno what tariffs will stick. There's a lot of uncertainty in the global economy.\"\n\n\n\n\n\nThe United States is imposing a 104 per cent tariff on China from tonight after the Chinese government refused to lift its retaliatory tariffs on U-S goods by the Tuesday deadline set by President Trump.\n\n\n\n\n\nWhite House press secretary Karoline Leavitt has confirmed the decision in a news briefing.\n\n\n\n\n\nMs Leavitt says President Trump believes China has to make a deal with the U-S, and went on to say he would be incredibly gracious but is going to do what's best for the American people.\n\n\n\n\n\nUnited Nations Secretary-General Antonio Guterres has described conditions in Gaza since the collapse of the ceasefire in March as re-opening the floodgates of horror.\n\n\n\n\n\nNo aid has been delivered to the Palestinian enclave of some 2.1 million people since March 2nd.\n\n\n\n\n\nIsrael has said it won't allow the entry of any goods and supplies into Gaza until Hamas releases all the remaining hostages.\n\n\n\n\n\nMr Guterres says the impact of Israel's actions have resulted in suffering.\n\n\n\n\n\n\"More than an entire month has passed without a drop of aid into Gaza - no food, no fuel, no medicine, no commercial supplies. As aid has dried up, the floodgates of horror have reopened. Gaza is a killing field, and civilians are in an endless death loop.\"\n\n\n\n\n\nThe heads of six UN agencies have appealed to world leaders to act urgently to ensure food and supplies reach Palestinians there.\n\n\n\n\n\nAt least 58 people are confirmed dead after the collapse of the roof of a nightclub in the Dominican Republic capital on Monday [[7/4]].\n\n\n\n\n\nOfficials said 146 people were injured and emergency crews are still working to pull survivors from the rubble as families of the victims gathered at the site searching for their loved ones.\n\n\n\n\n\nThe disaster struck during a concert attended by politicians, athletes and other prominent figures, while the cause of the collapse remains under investigation.\n\n\n\n\n\nIn athletics, a 57-year-old record held by Olympic great Raelene Boyle has been broken by 17-year-old Leah O'Brien.\n\n\n\n\n\nShe recorded 11.14 seconds in the 100-metre event at the Australian Junior Athletics Championships in her home city of Perth [[on Tuesday 9 April]].\n\n\n\n\n\nThat time has beaten the national under-18 record set by Boyle in her Olympic debut at the 1968 Mexico Games.\n\n\n\n\n\nShe achieved a time of 11.20 seconds.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/a-fiery-us-senate-exchange-over-tariffs-on-australia-midday-news-bulletin-9-april-2025/674evxcw0",
        "title": "A fiery US senate exchange over tariffs on Australia | Midday News Bulletin 9 April 2025",
        "publish_date": "Wed, 9 Apr 2025 02:05:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nLabor critical of Coalition's gas policy as details released...\n\nA fiery US senate exchange over tariffs on Australia...\n\nRugby Australia renew broadcast deal with Channel Nine for another 5 years.\n\nThe Coalition have released further details on their gas policy, after the leaders of the two major parties debated their election policies on Sky News last night.\n\n\n\n\n\nA key element of the Opposition's gas policy is establishing an east coast reservation that ensures the reservation of a volume of gas for the domestic market.\n\n\n\n\n\nOpposition finance minister Jane Hume told Sunrise the Coalition estimates their plan will drop wholesale gas prices by 23 per cent, as reported by Frontier Economics.\n\n\n\n\n\n\"That will feed through to industrial gas, to retail gas, and also to electricity prices. You'll recall at the last election, Anthony Albanese promised $275 off power bills. Well, that never came to pass.\"\n\n\n\n\n\nBut Minister for Housing Clare O'Neil says there are significant flaws in the Coalition's policy, criticising what she describes as the Opposition's lack of commitment to the government's cost of living relief measures.\n\n\n\n\n\n\"We've been waiting months for the coalition to bring forward detail on what they promised would be meaningful cost of living support for Australian households on energy, and we wake up this morning to find that they're talking about maybe a $60 a year reduction on energy bills for people in two years time.\"\n\n\n\n\n\nPrime Minister Anthony Albanese did not confirm whether his party would consider a deal with the Greens on rental caps and negative gearing, but insists his government is looking to win a majority at the election.\n\n\n\n\n\nGreens leader Adam Bandt is set to reiterate calls to scrap negative gearing and discounts to capital gains taxes for investors, as well as put a freeze on rent, at National Press Club today [[9/4]].\n\n\n\n\n\nSpeaking at the opening of Hay St Market at Sydney's renowned Paddy Markets, Mr Albanese says the Greens are looking for media attention.\n\n\n\n\n\n\"We been, there's nothing new about the greens talking themselves up, because sometimes the media follow that up for whatever reason. It makes things a bit more interesting. But the truth is that our objective is to hold onto the 78 seats that we currently hold and build on it.\"\n\n\n\n\n\nEducation Minister Jason Clare ruled out supporting the Greens policy to scrap negative gearing and discounts to capital gains taxes for housing investors on Sky News today.\n\n\n\n\n\nTreasurer Jim Chalmers is meeting with heads of the central bank and the banking, business and consumer regulators to construct a plan to mitigate the economic damage caused by tariffs.\n\n\n\n\n\nThis comes as a US Democratic Senator condemned President Donald Trump's decision to impose a baseline 10 per cent tariff on Australian goods.\n\n\n\n\n\nThe fiery exchange between Mark Warner and US trade representative Jamieson Greer took place during a US Senate Finance Committee on Tuesday.\n\n\n\n\n\nMr Greer responded to Mr Warner's question about why Australia was hit with a 10 per cent tariff before the Democratic Senator interrupted his reply.\n\n\n\n\n\nGREER: \"Senator, Australia has the lowest rate available under the new program. They -\"\n\n\n\n\n\nWARNER: \"We already have a free trade agreement, we have a trade surplus. So getting the least bad - why did they get whacked in the first place?\"\n\n\n\n\n\nAt least 58 people are confirmed dead after the collapse of the roof of a nightclub in the Dominican Republic capital on Monday.\n\n\n\n\n\nOfficials said 146 people were injured and emergency crews are still working to pull survivors from the rubble as families of the victims gathered at the site searching for their loved ones.\n\n\n\n\n\nThe disaster struck during a concert attended by politicians, athletes and other prominent figures, while the cause of the collapse remains under investigation.\n\n\n\n\n\nNorth Korean state media reports the country's status as a nuclear weapons state can never be reversed, despite the demands of the United States and its Asian allies.\n\n\n\n\n\nThe comments on Wednesday were likely a response to a joint statement by the foreign ministers of South Korea, Japan and the US made on the sidelines of a NATO meeting last week.\n\n\n\n\n\nThe three foreign ministers in a joint statement reaffirmed the \"commitment to the complete denuclearisation\" of North Korea.\n\n\n\n\n\nBut sister of North Korean leader Kim Jong-un, Kim Yo-jong, says the position of North Korea's nuclear weapons state is a result of outside hostile threats, with not changes to planned.\n\n\n\n\n\nNorth Korea has pursued nuclear weapons despite sanctions by the United Nations Security Council since it first conducted an underground nuclear detonation test in 2006.\n\n\n\n\n\nAnd in sport,\n\n\n\n\n\nRugby Australia has confirmed the renewal of its landmark broadcast partnership with Nine through to 2030.\n\n\n\n\n\nRugby Australia said the new deal spanning 2026-2030, valued at up to $240 million, represents a significant uplift on their current broadcast agreement and follows a successful organisational reset in 2024.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/it-s-unbelievable-aussies-aim-for-gold-medal-haul-in-la-after-new-olympic-events-added-20250410-p5lqn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s unbelievable’: Aussies aim for gold medal haul in LA after new Olympic events added",
        "publish_date": "Thu, 10 Apr 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Australia’s top swimmers are celebrating a potential Olympic gold medal windfall after six extra 50-metre sprint events were added to the program for the 2028 Los Angeles Games.\n\nThe International Olympic Committee confirmed overnight there will be 351 medal events in LA — 22 more than at Paris 2024 — including new mixed-gender competitions in athletics, golf and artistic swimming. Among them is a mixed 4x100m relay on the track, which rising star Gout Gout could feature in.\n\nThe IOC’s announcement also brings changes to soccer, expanding the women’s tournament from 12 to 16 teams and reducing the men’s from 16 to 12 — a shift that will impact the Matildas and Olyroos.\n\nBut the major win for Australia is the inclusion of men’s and women’s 50m backstroke, breaststroke and butterfly events — an unprecedented opportunity for the nation’s top sprinters to chase multiple medals.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-joey-manu-could-be-on-the-verge-of-an-nrl-return-20250409-p5lqin.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Joey Manu could be on the verge of an NRL return",
        "publish_date": "Thu, 10 Apr 2025 11:44:30 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Cross-code superstar Joey Manu is considering asking for a release from his French Rugby contract on compassionate grounds to return home – a move that could open the door for an NRL return.\n\nManu, who is currently playing Japanese Rugby for Toyota Verblitz, has signed a deal with French Rugby club Racing 92 and is scheduled to join them for pre-season training in July ahead of the season start in August.\n\nFormer Roosters star and New Zealand international Joey Manu. Credit: Getty Images\n\nSources with knowledge of the situation, talking on the condition of anonymity due to confidentiality, said the 28-year-old was now reconsidering his future and was weighing up a return to either Sydney or New Zealand due to family reasons.\n\nShould Manu return home, he would also attract attention from Super Rugby clubs, opening the door for him to fulfil an ambition to play for the New Zealand All Blacks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/wall-street-surges-after-trump-pauses-some-of-his-tariffs-20250410-p5lqly.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX gains more than $110 billion as market goes from fear to frenzy",
        "publish_date": "Thu, 10 Apr 2025 11:24:57 +1000",
        "category": "finance",
        "authors": [
            "Miriam Steffens",
            "Nick Newling"
        ],
        "text": "“I have authorised a 90-day PAUSE,” Trump said in his post on his social platform Truth Social, after recognising the more than 75 countries that he said had been negotiating on trade and had not retaliated against his latest increases in tariffs. US Treasury Secretary Scott Bessent later told reporters that Trump was pausing his so-called “reciprocal” tariffs on most of the country’s biggest trading partners, but maintaining his 10 per cent tariff on nearly all global imports, including those from Australia. ‘As welcome as the announcement was, investors can’t assume it’s the end of the tariff story, or that the market’s day-to-day volatility will disappear.’ Daniel Skelly, Morgan Stanley It was a starkly different story for China though, though, with Trump saying tariffs were going up to 125 per cent against its products. That raises the possibility of more swings ahead that could stun financial markets. The trade war is not over, and an escalating battle between the world’s two largest economies can create plenty of damage. US stocks are also still below where they were just a week ago, when Trump announced worldwide tariffs in what he called “Liberation Day”. But overnight, at least, the focus on Wall Street was on the positive.\n\n“The tariff clouds parted for the first time today,” said Daniel Skelly, head of the wealth management market research and strategy team at Morgan Stanley. “But it’s too soon to know how sunny the skies will be tomorrow – or 90 days from now … As welcome as the announcement was, investors can’t assume it’s the end of the tariff story, or that the market’s day-to-day volatility will disappear.” Huge swings have become routine for financial markets worldwide recently, not just day to day but hour to hour, as investors struggle to game out what Trump’s trade war will do to the economy. Credit: AP The relief came after doubts had crept in about whether Trump cared about the financial pain the US stock market was taking because of his tariffs. The S&P 500, which sits at the centre of many pension fund accounts, came into the day nearly 19 per cent below its record set less than two months ago. That surprised many professional investors, who had long thought that a president who used to crow about records for the Dow under his watch would pull back on policies if they sent markets reeling.\n\nWednesday’s rally pulled the S&P 500 index away from the edge of what’s called a “bear market”. That’s what professionals call it when a run-of-the-mill drop of 10 per cent for US stocks, which happens every year or so, graduates into a more vicious fall of 20 per cent. The index is now down 11.2 per cent from its record. Loading Wall Street also got a boost from a relatively smooth auction of US Treasurys in the bond market on Wednesday. Earlier jumps in Treasury yields had rattled the market, indicating increasing levels of stress. Trump himself said on Wednesday that he had been watching the bond market “getting a little queasy”. Analysts say several reasons could be behind the rise in yields, including hedge funds and other investors having to sell their Treasury bonds to raise cash to make up for losses in the stock market. Investors outside the United States may also be selling their US Treasurys because of the trade war. Such actions would push down prices for Treasurys, which in turn would push up their yields. Regardless of the reasons behind it, higher yields on Treasurys add pressure on the sharemarket and push upwards on rates for mortgages and other loans for US households and businesses.\n\nThe moves are particularly notable because US Treasury yields have historically dropped – not risen – during scary times for the market because the bonds are usually seen as some of the safest possible investments. This week’s sharp rise had brought the yield on the 10-year Treasury back to where it was in late February. Loading After approaching 4.5 per cent in the morning, the 10-year yield pulled back to 4.34 per cent following Trump’s pause and the Treasury’s auction. That’s still up from 4.26 per cent late on Tuesday and from just 4.01 per cent at the end of last week. Of course, the trade war is not over. Bessent and Trump clearly showed their anger at China, which has been ratcheting up its own tariffs on US goods and announcing other countermeasures with each move Trump has made. China said earlier it would raise tariffs on US goods to 84 per cent on Thursday. “If the US insists on further escalating its economic and trade restrictions, China has the firm will and abundant means to take necessary countermeasures and fight to the end” the Ministry of Commerce said.\n\nLater the US Treasury secretary said in a message to countries worldwide, but perhaps most directly aimed at China: “Do not retaliate, and you will be rewarded.” On Wall Street, the gains were widespread across the US sharemarket, and 98 per cent of the stocks in the S&P 500 index rallied. Leading the way were airlines and other stocks that need customers feeling confident enough to travel for work or for vacation. Delta Air Lines soared 23.4 per cent. Earlier in the day, it had pulled financial forecasts for 2025 as the trade war scrambles expectations for business and household spending and depresses bookings across the travel sector. In other international markets, indexes tumbled across most of Europe and much of Asia after they closed before Trump’s announcement. London’s FTSE 100 dropped 2.9 per cent, Tokyo’s Nikkei 225 sank 3.9 per cent and the CAC 40 fell 3.3 per cent in Paris. Chinese stocks were an outlier, and indexes rose 0.7 per cent in Hong Kong and 1.3 per cent in Shanghai.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-man-accused-of-orchestrating-partner-s-hit-and-run-murder-denied-bail-20250409-p5lqhd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: No bail for man accused of orchestrating partner’s hit-and-run murder | Boy suffers life-threatening burns in backyard | PM visits Great Barrier Reef",
        "publish_date": "Thu, 10 Apr 2025 11:24:27 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "Last month, CBD revealed that mining giant Rio Tinto was bankrolling the Mabo Centre at the University of Melbourne, an initiative to support traditional owners and First Nations youth that is named after renowned Indigenous land rights campaigner Eddie Mabo, whose High Court case ended the doctrine of terra nullius.\n\nA 1990 photo of Eddie Mabo. Credit: Jim McEwan\n\nFor the company, funding the centre is the next step in a campaign to repair its relationship with First Nations Australians, which was tainted by its destruction of 46,000-year-old Indigenous rock shelters at Juukan Gorge in 2020. The incident brought Rio worldwide opprobrium and led to the resignation of its chief executive, Jean-Sébastien Jacques.\n\nDespite efforts to buy back goodwill with Indigenous communities – the company donated millions to the Yes campaign in the 2023 Voice referendum – not everyone has forgotten Rio’s recent past. This week, six of Mabo’s grandchildren signed a scathing statement condemning the company’s backing of the Mabo Centre, which the statement accuses of betraying the late Eddie Mabo’s vision.\n\n“We are mortified that the Mabo name is tied to something so hypocritical,” says the statement, written by artist Neta-Rie Mabo, and co-signed by her cousins Mahalia, Maria, Hannah, Cathryn and Peta.\n\n“We cannot reconcile our family’s name being tied to a centre funded by the very forces our grandfather fought against. A centre in his name now accepts money from Rio Tinto, a corporation that has desecrated sacred sites and disregarded Indigenous sovereignty. He would be appalled.”\n\nThe statement exposes a division among Mabo’s descendants. His daughter Gail Mabo and grandson Kaleb Mabo both attended the centre’s launch. Gail, a prominent artist, was also featured in an article in The Australian about the centre.\n\nThe six Mabo grandchildren who signed the statement want the centre to cut all ties with Rio Tinto.\n\n“Anything less is a betrayal. Our grandfather’s name deserves better. His legacy is not for sale,” they say.\n\nThe centre’s advisory board issued a statement on Wednesday night saying it was aware of the criticisms but noting the centre’s name was “gifted by senior members of the Mabo family following extensive engagement with them”.\n\nIt said those senior family members were aware of the Rio Tinto investment before deciding whether to gift the name and added that the money did not come with a governance role for the mining giant at the centre. The company declined to comment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/bradley-nails-ace-in-masters-par-3-contest-20250410-p5lqqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bradley nails ace in Masters par-3 contest",
        "publish_date": "Thu, 10 Apr 2025 11:20:16 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bradley nails ace in Masters par-3 contest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/hello-darkness-my-old-friend-welcome-to-wall-street-s-infamous-private-rooms-20250318-p5lkar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hello darkness, my old friend: Welcome to Wall Street’s infamous ‘private rooms’",
        "publish_date": "Thu, 10 Apr 2025 11:19:00 +1000",
        "category": "finance",
        "authors": [
            "Katherine Doherty"
        ],
        "text": "“It’s about exercising control, what liquidity a broker wants to interact with to achieve better execution quality,” says Roman Ginis, CEO of Imperative Execution, the parent company of IntelligentCross. There are myriad reasons why users may opt for private rooms. Take the case of CastleOak Securities, a New York-based minority-run brokerage. The firm wants to trade with similarly minded businesses, so it uses a private room provided by the ATS operator OneChronos. Credit: Bloomberg Intelligence Carlos Cabana, head of equity sales and trading at CastleOak, dubs the room a “diversity pool,” because the participants are all minority-operated brokerage firms. While in this instance CastleOak doesn’t know specifically who is on the other side of every trade, it knows it will be one of about 10 counterparties who meet certain eligibility criteria related to ownership and investment goals. “Think of it as an apartment that’s hosting a party, and there’s one purpose for the party with only invited guests,” says Cabana.\n\nThanks to CastleOak’s increasing use of the diversity pool, OneChronos is now its third most-used trading venue, behind only the New York Stock Exchange and Nasdaq, Cabana says. Execution excellence Private rooms are known by a slew of other names including hosted pools, restricted-access rooms, ATS pools, and custom counterparty groups. They’re gaining popularity in the huge, ultra-fast modern market as a way to help firms avoid losing out against players who may be able to move quicker or who have access to superior information. Dark pools are so-called because the trades they handle happen away from the “lit” public exchange. Credit: Bloomberg For instance, many brokers and market makers are keen to take the other side of retail investor orders. Those small, less volatile trades are generally unlikely to impact prices — so a market maker won’t see an adverse move occur the instant it agrees to fill an order, as might happen with another type of counterparty.\n\nBrokers who take orders to private rooms typically expect to fill the order at the midpoint of the national-best-bid and offer, or NBBO (assuming the rule of the room is set up that way, which is usually the case). If for some reason the order is not filled in the room at the midpoint, it can move to the broader ATS where multiple other parties can compete to fill it. And if a broker has bad experiences with a private room, they can change to another in the future, avoiding those counterparties. “The problem we have is, how do we identify good versus bad liquidity?” says Jatin Suryawanshi, global head of quant strategy at Jefferies, who estimates that 15 in every 100 shares executed by the firm’s algorithms currently move via a room. “In using private rooms, you can prioritize who you want to interact with.” The growth of private rooms has accelerated as their use has become more common and as stock trading has migrated away from public exchanges. Off-exchange activity has been rising for years in the US, and now frequently accounts for more than half of all recorded volume. Private rooms emerged at the ATS firm LeveL as far back as 18 years ago. LeveL started by allowing firms to match their own orders, in what’s known as internalization. That expanded to other forms of segmentation, including bi-lateral and multi-lateral agreements, where one party agrees to trade with another, or multiple parties agree to only interact with each other, within the same ATS. Following requests from its own clients, IntelligentCross started offering its version of private rooms about a year-and-a-half ago, and OneChronos joined the party last year.\n\nPrivate rooms are not generally needed by big banks or brokers who have the resources to create their own ATS or what are called single-dealer platforms. That’s another breed of off-exchange trading venue where the operator is always the counterparty to any trade. But for smaller players, it’s too expensive and cumbersome to build and manage an ATS or SDP, meet the associated regulatory reporting requirements and set up the necessary connections. Arranging a private room at an established ATS is a solution. Loading “There are various factors of why a firm would want to outsource this activity than keep it in house,” says Steve Miele, CEO of Kezar Markets, the parent of LeveL. “It could be a cost, an overhead they don’t necessarily have to take on if we can build it, then scale it” using the existing network, he says. “We lower the barrier to entry.” At IntelligentCross, the majority of rooms currently offered serve institutional brokers that don’t have capacity to conduct similar activities internally. Jefferies trades in a private room provided by the firm where it interacts with seven other brokers who don’t have their own ATS, but have institutional orders, according to Suryawanshi.\n\n“These are always created at the request of a subscriber, who is the host that invites others to be guests in their book,” says Ginis at Imperative Execution. Dark disclosure Not every ATS is rushing to embrace private rooms. New York-based PureStream offers “pools” that operate like rooms, but they are disclosed to all subscribers if they are created, and anyone can join. In essence, the room is open to all. Credit: Bloomberg So far no one has asked to set up a pool at PureStream, so there is zero volume in so-called sub-pools, according to CEO Armando Diaz. He says offering a private room that isn’t open to all subscribers raises questions about the regulation. “The more the host controls the room, the more they are operating an ATS, and that opens up regulatory risk,” he says.\n\nPerhaps the biggest criticism of private rooms is that they create phantom liquidity, because transactions taking place inside a room are simply lumped in with the total activity reported by its dark pool parent. That creates a misleading picture for anyone trying to gauge market depth, since reported trading volumes include activity not available to those outside the room. ATS are regulated trading venues, overseen by the Securities and Exchange Commission, which in 2018 enhanced its supervision of such venues by imposing new disclosure requirements. Each dark pool must now file a form, ATS-N, which gives an overview about the specific trading mechanisms on its platform. These publicly available forms go into various details, including whether private rooms are available. But they don’t say how many exist or who is in them, and the varying language and levels of disclosure used mean it can sometimes be difficult to determine if an ATS is even hosting any rooms. ‘They are innovative, and here to stay. There is more going on there than most people know.’ Mark Gurliacci, former NYSE employee and now senior vice president and senior quantitative trader at AllianceBernstein “There are no rules to force ATS to break out the identity of single-dealer rooms or their volume,” Larry Tabb, head of market structure at Bloomberg Intelligence, wrote in a May note. The Financial Industry Regulatory Authority “does a good job of ATS volume reporting on a post-execution basis. Yet there are no rules to aid analysts or users looking to break down the percentage of ATS volume executed in the open pool vs. the private room, or the volume executed using segmentation strategies,” he wrote.\n\nDark pools are no strangers to transparency worries. Their opacity provoked extensive media coverage and regulatory scrutiny about a decade ago amid speculation they gave high-frequency firms advantages against other investors — attention partly prompted by the bestselling book Flash Boys. Representatives for both Finra and the SEC declined to comment. ‘Growth mode’ For their users, private rooms are a handy tool, but still one of a set. Hosted pools represent a single-digit percentage of IntelligentCross’s overall volumes for now — an average of about 5.4 per cent last year — because they’re so new, according to Ginis. “It will take brokers some time to optimise for this,” he says. CEO of OneChronos Capital Markets Vlad Khandros says its rooms represent less than 5 per cent of volume at present as “it’s newer for us, so it’s still in growth mode.” But demand is strong. “We’ve seen increased interest from both retail and institutional brokers,” Khandros says. “The focus on execution quality will continue to grow.”\n\nLoading LeveL declined to disclose the number of rooms it operates or how much activity takes place in them, with Miele saying the absence of industry-wide criteria for categorising rooms means it could be “misleading to quantify.” Mark Gurliacci, senior vice president and senior quantitative trader at AllianceBernstein, reckons up to 75 per cent of the firm’s activity is now happening off-exchange, including in private rooms. While the latter is a small slice of their trading at present, he thinks it’s set to grow. “Many firms are setting up private rooms these days,” says Gurliacci, who used to work for the NYSE. “They are innovative, and here to stay. There is more going on there than most people know.” Bloomberg",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/ophelia-westgarth-20250403-p5loz1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ophelia Westgarth",
        "publish_date": "Thu, 10 Apr 2025 11:18:44 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGo from coffee to cocktails at this part-cafe, part-wine bar.\n\n1 / 9 The bullhorn peppers and tartine at Ophelia. Dave Green 2 / 9 The statement record wall at Opehlia. Dave Green 3 / 9 The tartine with la fontella, Raffa farm asparagus and pink pepper gremolata. Dave Green 4 / 9 Pickled goods. Supplied 5 / 9 Fried milk bread with cardamom sugar, orange, citrus curd and mint. Dave Green 6 / 9 Having a vinyl time at Ophelia. Dave Green 7 / 9 The Michelxada Verde cocktail. Dave Green 8 / 9 Ophelia ups Westgarth’s outdoor dining game. Dave Green 9 / 9 Goodies to go. Dave Green Previous Slide Next Slide\n\nCafe$$$$\n\nNext to Northcote’s Palace Westgarth cinema, Ophelia is part-cafe, part-wine bar, by the team behind Terror Twilight, Convoyand Tinker. The old Barry cafe corner site has been rejigged with day-to-night flexibility in mind.\n\nGo from coffee to cocktails at the curvy new bar. There’s also a statement record wall with refurbed vintage speakers, and the original maroon-ish terrazzo floor is back on display. A glass cabinet houses the grab-and-go sandwiches and salads of the day, as well as the rotating savoury scone and baked goods galore.\n\nJust as sweet is the miso-butterscotch iced latte, a hot new player in Melbourne’s iced-coffee game. A handful of cocktails and a locally charged wine list are available until Ophelia closes, which is currently 4pm, but there are plans to extend to nighttime trade in the future, giving cinema-goers somewhere to snack and sip either side of later sessions.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/virgin-to-refund-61-000-customers-for-pricing-error-on-ticket-changes-20250410-p5lqpk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Virgin to refund 61,000 customers for pricing error on ticket changes",
        "publish_date": "Thu, 10 Apr 2025 11:15:44 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Virgin Australia is refunding 61,000 customers who had been overcharged after an error was discovered in the company’s pricing systems.\n\nThe airline said the transactions occurred when tickets were repriced in response to customer changes to itineraries.\n\nVirgin Australia has discovered a pricing error on ticket changes. Credit: Paul Rovere\n\n“We have policies that determine when and how we reprice a guest’s booking when they make a change to their itinerary,” a Virgin spokesperson said.\n\nIn “some instances...some bookings were repriced in a way that does not align with our policy,” a spokesperson said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/in-a-really-bad-place-mckay-opens-up-on-mental-health-struggles-20250410-p5lqnu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Really scary’: McKay opens up on mental health struggles",
        "publish_date": "Thu, 10 Apr 2025 11:10:05 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Star forward Harry McKay has opened up about his decision to take three weeks personal leave away from Carlton’s struggling senior outfit, revealing he was in such a bad place he had to put his hand up for help.\n\nAs the 2021 Coleman Medallist prepares for his senior return against West Coast Eagles on Saturday during Gather Round, he said his mental health started to suffer on the eve of the AFL season.\n\n“I guess five or six weeks ago, late Feb, I started feeling in not a great place mentally,” McKay told The Ben and Harry Podcast.\n\nMcKay played the first round in Carlton’s shock loss to a rebuilding Richmond outfit and then stood himself down for the following three weeks - losses to Hawthorn, Western Bulldogs and Collingwood.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-will-they-break-the-10-second-barrier-australia-s-young-sprint-stars-descend-on-perth-20250410-p5lqo1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Will they break the 10-second barrier? Australia’s young sprint stars descend on Perth",
        "publish_date": "Thu, 10 Apr 2025 11:04:56 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hopes are high the magical 10-second barrier will be broken as Australia’s next wave of sprint stars converge in Perth for the Australian Athletics Championships, which get underway today.\n\nThe rapid emergence of Gout Gout has already set tongues wagging around the world, with the 17-year-old Queenslander even drawing comparisons with the great Usain Bolt.\n\nLachie Kennedy beats Gout Gout in the 200m sprint at the Maurie Plant meet in Melbourne on March 29, 2025. Credit: Seven\n\nBut it seems Gout is just part of what is shaping up to be a golden generation of Australian sprinting.\n\nWorld Indoor 60m silver medallist Lachlan Kennedy put his name up in lights by beating Gout last month in the men’s 200m at the Maurie Plant Meet in Melbourne.\n\nGout and 21-year-old Kennedy will again go head-to-head in the 200m, with the final to be run in Floreat on Sunday.\n\nUnfortunately for sprint fans, Kennedy won’t be head-to-head with Gout in the 100m, given Gout will compete in the U20s sprint on Thursday evening and Kennedy in the Open category on Friday and Saturday.\n\nNevertheless, both stars are aiming to crack the 10-second barrier, meaning it could be a double dose of joy for Australian sprinting at the meet.\n\nThe current Australian men’s record is 9.93 seconds, which was set by Patrick Johnson in Mito, Japan in 2003.\n\n“I’m aiming for a sub-10 time for sure,” Kennedy said.\n\n“In one of the rounds, I’ll do it and then I want to try and break the Australian record in the 100m and I really want to go for 19 seconds in the 200m.\n\n“I think that’s more than possible, it’ll just be how my body can handle the rounds.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-trump-escalates-trade-war-with-china-while-pausing-tariffs-on-other-nations-dutton-albanese-continue-campaigns-20250409-p5lqiv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: ASX lifts 5.9 per cent after Trump pauses tariffs with other nations, escalates trade war with China; Dutton, Albanese campaigns continue",
        "publish_date": "Thu, 10 Apr 2025 10:23:39 +1000",
        "category": "finance",
        "authors": [
            "Josefine Ganko"
        ],
        "text": "An increasingly confident Prime Minister is emerging on the campaign trail.\n\nWhile the opposition has executed a backflip on its work from home policy, and ditched a candidate due to controversial views, it was all plain sailing for Anthony Albanese as he visited Green Island on the Great Barrier Reef.\n\nBut despite the PM’s optimism, which today extended far enough to raise the prospect of Labor beating opposition leader Peter Dutton in his own seat of Dickson, in Brisbane, he is being careful not to get too far ahead of himself.\n\nWhen asked if a second term Labor government would set even more ambitious climate goals than it did in its first term, Albanese reiterated Australia’s current goal to cut greenhouse emissions by 43 per cent.\n\n“What you need is a certainty,” he said. “The business community asked for certainty. We’ve given it that.”\n\nIt’s a reminder that cost of living pressures remain key to the election. Labor promised in 2022 that its renewable energy policy would cut power bills by $275 by 2025. In reality, power bills have shot up $500 for the hardest hit households and Labor is under pressure to explain how more renewables will provide bill relief.\n\nDon’t expect to see any more ambitious promises from the PM this time around.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/live/airasia-responds-to-pent-up-demand-in-australia-trump-suspends-tariffs-for-now-robbie-williams-reveals-rare-diagnosis-235428052.html",
        "title": "AirAsia responds to 'pent-up demand' in Australia, Trump suspends tariffs for now, Robbie Williams reveals rare diagnosis",
        "publish_date": "2025-04-09T23:54:28Z",
        "category": "finance",
        "authors": [
            "Tom Flanagan"
        ],
        "text": "Plus more Australians are making \"heartbreaking sacrifices\" as cost-of-living pressures roll on.\n\nHello and welcome to Yahoo's live news blog this Thursday. Donald Trump has paused tariffs on the majority of countries targeted on 'Liberation Day', however he has ramped up his trade war with China with neither country showing any sign of backing down.\n\nAirAsia is bringing more Bali flights to Australian customers, with the addition of a Denpasar-Adelaide flight. The airline says there has been \"pent-up demand\" for Bali flights in South Australia and it wants to cement Bali as the nation's favourite travel destination as Japan soars in popularity.\n\nFollow along as we bring you regular updates throughout the day.\n\nLive 8 updates Featured Deputy PM shuts down China offer Well the Albanese government has swiftly responded to China's suggestion they \"hold hands\" in Donald Trump's ongoing trade war. And it's a polite no from Deputy Prime Minister Richard Marles. \"I don't think we'll be holding China's hand,\" he said, the ABC reported. \"We obviously don't want to see a trade war between China and the US … [but] it's about pursuing Australia's national interests, not about making common calls with China.\" Dollar bounces back – for now The Australian sharemarket has burst out of the gates on Thursday, as US President Donald Trump pauses the bulk of his sweeping tariffs. The ASX 200 jumped 5.8 per cent to 7,809 points in the first 15 minutes of trading on Thursday. The futures markets had predicted it would rise 6 per cent during the day for the biggest daily gain since March 2020. Overnight the Australian dollar also spiked back above 61 US cents. On Wednesday US time, Mr Trump announced he would lower his “reciprocal” tariffs on every country except China, Canada and Mexico to 10 per cent for 90 days. Tariffs on Chinese products would be raised to 125 per cent immediately, he said. Read more from NCA NewsWire here.\n\nCoffee more important to Aussies than booze Aussies are more likely to give up alcohol than coffee, new research from health insurance comparison site iSelect reveals. Surveying 1,000 Australians, they found that 54.5 per cent of people would refuse to give up coffee. That's higher than 35.2 per cent of people who wouldn't give up alcohol if asked. It seems men are more reliant on alcohol however, with 42.1 per cent of men refusing to while just 28.5 per cent of women saying they wouldn't. The survey went through a list of \"unhealthy\" habits but of course some of the habits such as smoking are far more harmful than others. Only 12.4 per cent of Aussies would refuse to give up tobacco.\n\nState capital set for hottest April day in over 20 years Aussies in the country’s southeast are facing an unusually hot April, with forecast temperatures up to 10 degrees above seasonal averages. Sky News predicts Melbourne will see its hottest April day since 2004 this weekend, with Adelaide to sweat through four straight days of temperatures above 30C from Saturday. “It’s more typical of a summer weather pattern than mid-autumn,” Sky News meteorologist Alison Osborne said. “It’s not a heatwave strictly speaking, it’s just another unseasonal warm spell across southern Australia, from (Thursday) to next week.” “It’s not what I would call untenable heat, but people would’ve already put their shorts away and now be thinking, ‘What the bloody hell’s going on?’.” Residents can expect maximums between 31C and 33C from Saturday through to Tuesday, with Melbourne likely to hit 30C on Sunday. - NCA NewsWire\n\nAussies skipping essentials amid cost-of-living pressures New research has revealed one in five Australians have recently skipped buying clothing or shoes because they simply couldn't afford them. The research from charity Good360 Australia exposes the ongoing struggles for many amid increased cost-of-living pressures which have stretched for several years now. Their figures show more than one-third of Australians say the cost-of-living crisis feels worse than it did a year ago, despite a decrease in inflation. \"Australians are making heartbreaking sacrifices just to keep their households running,\" Good360 Australia founder Alison Covington said. So have you been unable to update your wardrobe when needed? Let us know below. - With AAP\n\nRobbie Williams diagnosed with scurvy Robbie Williams has opened up about his recent weight loss, which led to mental health struggles and the surprise diagnosis of scurvy. Speaking to The Mirror, the British icon explained how he had shed two stone while taking medication, which he has likened to weight-loss drug Ozempic, and how it led to the rare diagnosis. \"I’d stopped eating and I wasn’t getting nutrients,\" he said, describing his reduced vitamin C intake. \"I was sad, I was anxious, I was depressed.\" The Angels hitmaker explained how this bout of \"ill health\" caused him concern. \"It’s been about 10 years... I thought I was at the other end of the arc. I thought this was the end of my story, and that I would just go walking into this marvellous wonderland. So for it to return was just confusing.\" Read more from our UK team here. Robbie Williams has opened up on his health battle. Source: Getty\n\nTrump suspends tariffs, ramps up China trade war Well it doesn't change much for Australia with a blanket 10 per cent tariff remaining, but Donald Trump has made the significant move of halting tariffs for a majority of countries impacted by his trade war unveiled on 'Liberation Day'. Trump said he would suspend targeted tariffs for three months to allow time for US officials to negotiate with countries that have sought to reduce them after the removal of trillions of dollars from stock markets triggered panic around the world. China, however, has not been as lucky. Trump is refusing to back down from his trade war with Beijing, which itself has hit back with retaliatory levies. Only time will tell just how far this escalates. Currently, Trump has imposed 125 per cent tariffs on China, while the US is facing 84 per cent tariffs from their counterpart. Read more here.\n\nAirAsia expands Bali flights for Aussies While there's been plenty of talk about Japan becoming Australia's number one travel destination, AirAsia says demand for Bali is still as strong as ever and the airline envisages it only growing. That's why they've moved to add further flights to Denpasar from Australia, with Adelaide handed four outbound flights to Bali to ease the \"pent-up demand\" in South Australia. \"We are thrilled to touch down in Adelaide and South Australia soon for the very first time. Australia is one of our most important growth markets with the recent addition of Cairns and Darwin to our network as well as Perth,\" CEO Indonesia AirAsia Veranita Yosephine said. Adelaide Airport's Brenton Cox said the airline was addressing \"significant pent-up demand for flights at affordable prices\".\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/warning-as-more-aussies-turn-to-dumpster-diving-for-free-groceries-serious-charges-231332062.html",
        "title": "Warning as more Aussies turn to dumpster diving for free groceries: 'Serious charges'",
        "publish_date": "2025-04-09T23:13:32Z",
        "category": "finance",
        "authors": [],
        "text": "The movement is growing nationwide as Aussies face soaring living costs, with high grocery prices and rents driving some to seek alternative ways to cope.\n\nDumpster divers across Australia have been issued a stern warning to strictly stick to what's allowed under the law or risk landing in serious hot water.\n\nThe trend has been gaining momentum nationwide as Australians grapple with soaring living costs, pushing some to search for alternative ways to get by.\n\nThe process involves sorting through garbage in bins outside of supermarkets and shopping centres to find products that have been discarded, but are still edible or usable. Whether it be fruit and vegetables, tinned goods, or even homewares, an increasing number of Australians swear by the contentious tactic. A growing online community post their pilfered produce and reclaimed goods, while sharing hotspots of where large bins remain unlocked.\n\nLast year, a Sydney dumpster diver claimed it had been years since she'd paid for groceries. Similarly, an Adelaide man said up to \"80 per cent\" of his food is found in bins around South Australia. \"All I buy is my soy milk and bananas once a week,\" he told Yahoo News, while everything else comes from the bins of major retailers and food businesses.\n\nADVERTISEMENT\n\nOne local in Lismore, NSW, conducts \"workshops\" showing others how to find the \"insane amount of perfectly good food that is thrown away\". \"You can save hundreds of dollars from one dumpster dive,\" he previously told Yahoo.\n\nIn previous years, Brendan has found major boxes of Easter chocolates. Source: BIG B ADVENTURE/YouTube\n\nDumpster diver's incredible haul as warning issued\n\nDumpster diver Brendan, who proudly shares his exploits on his YouTube channel, told 9News this week he'd found camping equipment, brand new fishing rods, homewares, pots and pans, watches and clothing that had \"never been used, with minimal damage\". He once found a giant haul of seemingly undamaged Easter chocolates as retailers discarded them after the holiday sales – something many divers will likely be on the lookout for at the end of the month.\n\nHowever, a fresh warning has been issued to 'skip scavengers', reminding them that while rummaging through bins isn’t always illegal, the law does draw a clear line — only items that have been genuinely discarded can be snatched up. \"If you've taken an item that's not been genuinely abandoned, you could face serious charges, such as stealing,\" lawyer William Kennedy told Nine.\n\nADVERTISEMENT\n\nCrucially, it is illegal to remove goods from areas like behind-store loading docks or storage zones if they haven’t been thrown away, even if they appear unwanted. Entering private property, whether it be homes or businesses, without permission can also lead to trespassing charges.\n\nHow can dumpster divers be prosecuted?\n\nAccording to Sydney-based criminal lawyer Avanish Singh, if it's in the bin, it's effectively fair game.\n\n\"If items have been placed in a bin for disposal, then the item will be taken to be 'abandoned' — this means that someone who takes an item from a bin cannot be charged with stealing as the item is no longer capable of being stolen,\" he explained to Yahoo.\n\nADVERTISEMENT\n\n\"The previous owner has effectively relinquished ownership of it. However, if a person enters onto an enclosed private land — for example, through a gate or over a fence — then they are trespassing.\"\n\nWhile some bins may be located in public spaces, many are actually on private property, such as in loading docks, behind locked gates, or in fenced-off areas. In those cases, entering to access the bin could still be considered trespassing, even if the contents of the bin are deemed abandoned and therefore not able to be stolen under the law.\n\nAnother Aussie dumpster diver previously told Yahoo he not only finds food but once found two working smart TVs thrown away. Source: Supplied\n\nA Sydney dumpster diver's previous food haul. Source: Facebook\n\nSo while taking items from a bin itself might not be theft, accessing the bin could still be unlawful if you're on private property without permission. That’s where most dumpster divers run into legal trouble — not over what's taken, but over where it's taken from.\n\nADVERTISEMENT\n\nPutting aside the legal concerns, there may also be several health implications that can arise from dumpster diving. Perishable items like meat, dairy and prepared foods can quickly spoil if not stored properly, leading to a risk of foodborne illnesses such as salmonella. Contamination from mould, pests, or cleaning chemicals is also a possibility, especially if food is mixed with non-edible waste.\n\nInjuries can occur from sharp objects, broken glass or electrical materials, and though many divers take precautions, including the use of gloves and masks, there are definite risks involved.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/sad-waterfront-photo-highlights-nations-worsening-housing-crisis-073330493.html",
        "title": "Sad waterfront photo highlights nation's worsening housing crisis",
        "publish_date": "2025-04-09T07:33:30Z",
        "category": "finance",
        "authors": [],
        "text": "In 2025 rental prices are still sky-high – and while the national vacancy rate rose slightly in January, it remains well below what is needed for a balanced market.\n\nAs the federal election looms, Australia’s housing crisis is at the forefront of voters' minds, with many calling for urgent action on the rising price of homes and the shortage of available properties.\n\nIn 2025, rental prices remain dizzyingly high. And although in February the national vacancy rate rose to 1.3 per cent, up from 1.0 per cent in January, they're still well below the three per cent threshold typically indicative of a balanced market.\n\nThis week in Queensland, a shocking video surfaced online, capturing an individual's camp in quite an unexpected location — on a body of water at the Gold Coast. The footage, filmed in Surfers Paradise, shows a tent suspended by rope and supported by two paddleboards, floating on the Nerang River.\n\nIt sparked widespread concern among responders, with some saying they were \"struggling to process\" the sad scene. \"This is what the housing crisis has come to,\" one person replied.\n\nADVERTISEMENT\n\n\"People will do anything when there is a lack of funds and care,\" another said. \"There is no affordable housing available in this country,\" a third wrote.\n\nSpeaking to Yahoo News Australia, a spokesperson for the City of Gold Coast council said its officers had referred the matter to the Department of Housing and local welfare services, which are equipped to provide proper support. \"The City does not provide any direct housing or welfare services,\" they said.\n\nAcross the country it's not uncommon for Australians to resort to sleeping in tents. Source: NCA Newswire\n\nAustralia's housing crisis particularly dire in Queensland\n\nAcross the country, it's far from uncommon for Australians to resort to sleeping in tents — though more so on a body of water — with a lack of available resources forcing people to take drastic action.\n\nPaul Slater, who runs the Northwest Community Group and manages a makeshift \"tent city\" in Musgrave Park, in Brisbane's south, said he's struggling to keep up with the enormous demand for his services.\n\nADVERTISEMENT\n\nPaul gets dozens of messages every week from those seeking help and has supplied over 500 tents to battling Australians last year alone. He said within the last couple of decades, there's been an \"absolute failure on all levels of government\" when it comes to social housing.\n\n\"It's clear we're in an emergency,\" he earlier told Yahoo. \"I've got people calling me multiple times per day, sleeping on concrete with nowhere to go.\n\n\"I've got one lady... she's been searching every day for rentals. She's been to 100 inspections and can't get anywhere within her budget for her and her two children. She's not getting any support, and she has two weeks until she's homeless.\n\n\"I got a call last night from another woman out at Redcliffe who's sleeping in her car with three children, 8, 10, and 14 — three girls. She's been sleeping in her CAR.\"\n\n'Cruel' response to 'tent cities' criticised\n\nDespite this, homeless people in Brisbane's tent cities were earlier this year given 24 hours to pack up their things and leave, amid a crackdown on temporary housing on public land.\n\nADVERTISEMENT\n\nThe move was announced by Lord Mayor Adrian Schrinner in mid-March, stating the public had raised concerns about the safety of people sleeping on public land, particularly at Musgrave Park.\n\nHomeless people in Brisbane's tent cities were earlier this year given 24 hours to pack up their things and leave. Source: NCA Newswire\n\nThe idea sparked widespread condemnation, with Gabba Ward councillor Trina Massey branding the decision \"cruel and hypocritical\".\n\n\"The Lord Mayor’s cruel and opportunistic stance, criminalising homelessness just days after vulnerable communities were exposed to severe weather, does nothing to support those facing domestic violence, substance abuse or others falling through the cracks,\" she said.\n\nADVERTISEMENT\n\nAnd tent living is not just a Queensland issue, with similar \"cities\" popping up right across Australia due to a shortage of adequate accommodation.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]