[
  {
    "url": "https://www.9news.com.au/national/soccer-act-can-cause-brain-damage-us-study-says/d08673d7-7449-4e1b-801c-ebe94a49cb54",
    "title": "Soccer move can damage brains like other contact sports, study finds",
    "publish_date": "Fri, 19 Sep 2025 01:04:04 +0000",
    "category": "sports",
    "authors": [
      "Sep"
    ],
    "text": "There's a growing body of understanding around the ﻿potential brain health risks of contact sports, but a new study suggests people should add soccer to that category.\n\nRepeated head trauma that can be a result of long-term participation in sports like boxing, and contact football has been linked to chronic traumatic encelaphopathy (CTE), a neurodegenerative disease that can only be diagnosed post-mortem.\n\nWhile the Australian Sports Commission notes more research needs to be done to establish the full context of how a person develops CTE, including genetic and other lifestyle factors, governing bodies for sports such as rugby league, rugby union, and American football have come under pressure over their duty of care to players.\n\nREAD MORE: Doctor who blew whistle on mushroom murderer sanctioned\n\nContact sports have come under scrutiny. (Getty Images/iStockphoto)\n\nBut even as some wary parents ﻿opt to nudge their children away from contact sports into soccer as a safer option, a new study out of the US has warned that a particular act could also be having a marked effect on players' brains.\n\nPerhaps unsurprisingly, it's the \"header\", the act of projecting the ball forward with a headbutt, that is the culprit.﻿\n\nThe new study, published by a research team from Columbia University, found that heading the soccer ball could damage an area at the front of the brain dubbed the \"orbitofrontal grey matter-white matter interface\" (GWI) - a site of changing brain tissue composition.\n\nSoccer headers have been found to also be damaging. (Getty)\n\nResearchers had previously established that repeated head impacts of any sort could be detrimental to the brain, but the precise site where these changes were reflected was not fully understood.\n\nThis time, they investigated 352 adult amateur soccer players, aged between 18 and 55, all of whom had played for at least five years and for at least six months a year currently.\n\nThose who had headed the ball more often had measurable changes ﻿to their GWI.\n\nREAD MORE: Tsunami warnings after huge Russian quake\n\n﻿They also performed more poorly on a memory test involving remembering a shopping list of items.\n\n\"Soccer is the most popular sport worldwide and, in part due to the practice of heading (i.e, intentionally hitting the ball with the head), may be the greatest source of RHI﻿ (repetitive head impacts),\" the authors wrote.\n\nThe full study can be found online here .﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/blender-sold-kmart-target-recalled-safety-concerns/10bf1500-f838-4841-9afa-4eb9cb892fee",
    "title": "Kmart, Target pull blender from shelves after 'injuries'",
    "publish_date": "Thu, 18 Sep 2025 21:41:40 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "at Kmart and Target after regulators identified a safety issue that has already caused injuries.\n\nProduct Safety Australia said the portable blender came in several colours including white, green, lilac, and blue.\n\nProduct Safety Australia said the portable blender came in several colours including white, green, lilac, and blue.\n\nIt is rechargeable and comes in two pieces.\n\nIt is rechargeable and comes in two pieces.\n\n\"If the base of the product is immersed in water, it may self-activate without pressing the ON/OFF button,\" the\n\n\"Risk of serious injury, including laceration from the exposed blades, if the product self-activates. Injuries have occurred.﻿\"\n\n\"Risk of serious injury, including laceration from the exposed blades, if the product self-activates. Injuries have occurred.﻿\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/jimmy-kimmel-update-late-night-talk-show-suspended-indefinitely/17a54932-180a-491a-b4db-d2defaf7ca63",
    "title": "Jimmy Kimmel spotted at lawyer's office as Trump calls for more cancellations",
    "publish_date": "Fri, 19 Sep 2025 00:17:29 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Jimmy Kimmel has been spotted at what appears to be a lawyer's office 24 hours after ABC canned his late-night show over comments made about Charlie Kirk's death.\n\nThe Jimmy Kimmel Live! host, 57, was photographed driving from his Los Angeles home to a building complex that is home to multiple legal offices.\n\nKimmel is reportedly also set to meet with Disney executives to discuss the future of his show, according to Bloomberg News.\n\nREAD MORE: Doctor who blew whistle on mushroom murderer sanctioned\n\nJimmy Kimmel emerged from his LA home and drove to a building housing multiple lawyers' offices. (PG/Bauer-Griffin/GC)\n\nKimmel is also reportedly set to meet with Disney executives to discuss the future of his show. (PG/Bauer-Griffin/GC)\n\nMeanwhile, Federal Communications Commission (FCC) Chairman Brendan Carr has made it clear that this isn't over.\n\n\"I don't think this is the last shoe to drop,\" he said in an interview with Fox News.\n\n\"This is a massive shift that's taking place in the media ecosystem the consequences will continue to flow.\"\n\nCarr added that complaints from ABC-affiliate local news stations ﻿in Utah and Pennsylvania played a key role in Kimmel's cancellation and suggested that it could happen again.\n\n\"We're going to back to that era when local TV stations, judging the public interest, get to decide what the American people think,\" he said.\n\nTop Democrats have called for Carr's resignation, but he appears to have the wholehearted support of ﻿US President Donald Trump.\n\n\"I don't think this is the last shoe to drop,\" Brendan Carr announced. (Jonathan Newton/The Washington Post via AP)\n\nYesterday, Trump called Carr \"outstanding\", \"a patriot,\" and \"a tough guy\" while speaking with reporters on Air Force One.\n\nHe also ﻿floated the idea of revoking the licenses of TV networks that air programs \"against\" him, a decision he said will be \"up to\" Carr.\n\n\"They give me only bad publicity, press. I mean, they're getting a license ... I would think maybe their license should be taken away,\" Trump said.\n\nUS TV networks do not have to be licensed by the government to operate.\n\nHe also claimed that licensed TV networks are \"not allowed\" to \"hit Trump\", calling those \"against\" him \"an arm of the Democrat party\".\n\nTrump also publicly celebrated Kimmel's axeing and called for \"losers\" Seth Meyers and Jimmy Fallon ﻿to face the same fate.\n\nREAD MORE: Tsunami warnings after huge Russian quake\n\nTrump floated the idea of revoking the licenses of TV networks that air programs \"against\" him. (Anna Moneymaker/Getty)\n\nBut a growing number of TV personalities, critics and even a former US president ﻿have thrown their support behind Kimmel in the face of his politically charged cancellation.\n\nFormer US President Barack Obama wrote on social media: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\n\n\"This is precisely the kind of government coercion that the First Amendment was designed to prevent — and media companies need to start standing up rather than capitulating to it.\"﻿\n\nFormer Vice President Kamala Harris called Kimmel's cancellation an \"outright abuse of power\".\n\n\"This administration is attacking critics and using fear as a weapon to silence anyone who would speak out. Media corporations — from television networks to newspapers — are capitulating to these threats,\" she wrote on social media.\n\n\"We cannot dare to be silent or complacent in the face of this frontal assault on free speech.\"\n\nFormer Vice President Kamala Harris called Kimmel's axeing a 'frontal assault on free speech'. (Brandon Bell/Getty Images via CNN Newsource)\n\nUSA Today's TV Critic Kelly Lawler questioned what Kimmel's axing could mean for the future of late-night TV in the US.\n\n\"How did we get to a place where the president of the United States is potentially influencing who gets to crack what jokes at 11:35 p.m. on weeknights?\" she wrote.\n\n\"And what does it mean for the ability of comedians and entertainers to exercise their right to free speech and to speak truth to power?\"\n\nKimmel's show was \"indefinitely preempted\" by ABC and its affiliates, including Sinclair Broadcast Group, over his comments about Kirk's death earlier this week.\n\nNow ﻿Sinclair has issued a list of \"demands\" Kimmel must meet if he wants the suspension on his long-running show lifted.\n\nOne of the demands is that Kimmel \"issue a direct apology to the Kirk family\".\n\nAnother would require him to make a \"meaningful personal donation to the Kirk Family and Turning Point USA,\" Kirk's nonprofit that advocates conservative politics at schools across the US.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/perth-weather-update-wa-city-sets-rainfall-streak-not-seen-for-18-years/d6dfb930-cf98-445a-9625-1e584087ad09",
    "title": "Australian city shatters weather record",
    "publish_date": "Fri, 19 Sep 2025 00:35:53 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Perth has recorded a four-month soaking, the first time this has happened in the spring-winter period for 18 years.\n\nThe WA capital ﻿reached its September average of 79.3mm during light showers on Tuesday and Wednesday, reports Weatherzone .\n\nWhen more rain fell during the 24 hours to yesterday morning, this month's total in Perth hit the 93mm mark.\n\nThe downpours over Perth this week were heaviest late on Wednesday, September 17, 2025, shown here on radar. (Weatherzone)\n\nIt came after the winter months all recorded above average falls, with August totalling 203mm, July 174mm and June 129mm.\n\nThe rainy winter weather was also accompanied by storms and lightning strikes over much of WA.﻿\n\nThe last time Perth had a run of similar wet conditions was in 2007.﻿\n\nThe soaking has been a welcome break in a long stretch of below-average falls, stretching from last November to May.\n\nWeather forecasters say the state's south-west, including Perth, has recorded ongoing rainfall shortfalls, beginning from September 2021 and ending only last month.\n\nIt explains why water storage in Perth currently sits at only 48 per cent of capacity.\n\nLooking ahead, the city is forecast to have dry weather over the next week, with maximum temperatures next Wednesday shaping to hit 30 degrees. ﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/new-zealand-man-issued-ticket-for-eight-second-car-park/5769995d-ed51-4c93-972a-0eef68d12198",
    "title": "'Obscene': Driver given ticket for 'eight seconds' in parking spot",
    "publish_date": "Thu, 18 Sep 2025 22:30:21 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "A young New Zealand man has won a case to have a parking breach notice overturned, claiming he was in the car park for just eight seconds.\n\nChristchurch man Bailey Smith, 22, returned from an extended work trip to find a number of notices from Parking Services Limited in his letterbox.\n\nHe had been issued a breach notice for NZ$95 ($84.53) for parking outside a Riccarton laundromat in March, and then charged late fees for failing to pay.\n\nBailey Smith was issued a $95 breach notice for pulling into a private car park in Riccarton, Christchurch. He fought the ticket at the Disputes Tribunal and won. (Chris Skelton/Stuff)\n\nHe appealed to the company to waive the breach notice, but that was dismissed.\n\nWith the help of ChatGPT, he fought the decision at the Disputes Tribunal, and won.\n\nSmith said he thought the charges were \"obscene\" and the company was being \"predatory\".\n\nREAD MORE: Doctor who blew whistle on mushroom murderer sanctioned by medical regulator ﻿\n\nSigns displayed outside the laundromat outline the car park terms and conditions. (Chris Skelton/Stuff)\n\n\"They tried to ping me for parking there for eight seconds,\" he said.\n\nHe said he fought the case because he had a feeling the company was in the wrong, but without the help of AI, he wouldn't have known what to do.\n\nThe tribunal ruling said Smith claimed he pulled into the Kauri St car park and then reversed out again within eight seconds.\n\nA photo Parking Services Limited supplied to the Disputes Tribunal showing Smith's car on the left, in the private car park in March. (Supplied)\n\nParking Services Limited disputed that, saying a camera technician said he was on the property for more than five minutes, dropping off a friend to pick up another car parked nearby.\n\n\"The driver was trespassing on private property to use the car park to drop off a passenger, not to visit or use the business that owns the parks,\" a spokesperson told Stuff .\n\nParking Services Limited supplied two photos to the tribunal.\n\nA photo Parking Services Limited supplied to the Disputes Tribunal, showing Smith's car being reversed out of the park. (Supplied)\n\n\"The photos appear to support Mr Smith's position, that he reversed out of the car park very soon after entering it, presumably once he realised it was a private park with clear warning signs,\" the ruling said.\n\nThe tribunal found Smith had entered the car park, but had not parked there.\n\n\"Accordingly, he is entitled to a declaration that he is not liable for the breach fee or any other cost.\"\n\nSmith shared his plight after reading Loren Phillips' similar story of pulling into the same car park for a total of 27 seconds - a case which also ended in the Disputes Tribunal ruling she did not have to pay a NZ$95 ticket or any associated late fees.\n\nSo, was the parking company in the wrong?\n\nIn both cases, the Disputes Tribunal decided that although their cars had been in the car park, they had not parked there.\n\nTherefore, neither of them were liable to pay.\n\nA Parking Services Limited spokesperson said signage in private car parks served as a clear set of terms and conditions.\n\nSecurity cameras in the laundromat car park. (Chris Skelton/Stuff)\n\n\"By choosing to enter, stop or wait on the property, a driver is agreeing to these rules. Failure to comply is considered a breach and often leads to a notice being issued,\" they said.\n\n\"This particular car park is in a high-traffic zone, and the business frequently faces issues with people using its private spaces to access neighbouring businesses. These actions directly impact our client's ability to operate, as their business relies on having vacant spaces available for paying customers.\"\n\nThe spokesperson sent Stuff four examples of Disputes Tribunal rulings it won over the past year, but none appeared to relate to cases in which the driver had been in the park for less than five minutes.\n\nParking Services Limited said signage in private car parks served as a clear set of terms and conditions. (Chris Skelton/Stuff)\n\nA NZ Parking Association spokesperson said its updated code of practice required subscribed operators to commit to giving drivers a \"consideration period\" to review terms and a reasonable grace period before taking enforcement action.\n\nIt said drivers needed time to decide whether to stay, and a reasonable chance to leave.\n\n\"These measures are designed to ensure fairness, particularly where a stay is very short, while still enabling operators to manage their sites effectively and consistently.\"\n\nParking Services Limited was not a member of the association, the spokesperson said.\n\nThe Parking Services Limited spokesperson said parking enforcement was about safeguarding the livelihood of local businesses, which relied on private car parks to serve customers.\n\n\"Many small businesses, from laundromats to mechanics to beauty salons, face a daily struggle with non-customers using their car parks for purposes other than visiting the business,\" they said.\n\n\"This includes using the lot as a shortcut, a U-turn point, or as a convenient place to drop off or pick up passengers.\n\n\"We urge drivers to take a moment to read and respect the signage on private property.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/noosa-beach-whale-rescue-distressed-mother-and-baby-whale-rescued-from-shark-nets-off-queenslands-sunshine-coast/d11bcc2d-b760-4eda-88c4-1a393ee0c750",
    "title": "Sad scene off Queensland coast reignites shark net debate",
    "publish_date": "Thu, 18 Sep 2025 09:14:26 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Videos have emerged of a humpback whale duo trapped in shark nets off Queensland 's Sunshine Coast.\n\nDrone operator Geoff Aquino rushed down to Noosa Beach yesterday and put his camera up to get a closer look at the distressed mother and baby as they moved up the coastline.\n\n\"After a few moments I saw she was trying to roll because the baby was under her,\" Aquino said.\n\nVideos have emerged of a humpback duo entangled in shark nets on Queensland's Sunshine Coast. (Geoff Aquino)\n\n\"It was gasping, begging for air.\"\n\n\"The baby looked like a little mummy really, it was severely entangled,\" Aquino said.\n\nAfter struggling for hours and dragging the knotted netting with them, a shark control program contractor was sent out to free the pair.\n\nREAD MORE: The Epstein files question the FBI Director refused to answer nine times\n\nDrone operator Geoff Aquino rushed down to Noosa Beach yesterday. (Geoff Aquino)\n\n\"They've expended a lot of energy and been under a lot of stress,\" Envoy Foundation co-founder and director Andre Borell said.\n\nThe incident has reignited debate on whether shark nets should be pulled from the state's coastline.\n\n\"There's technology out there now that allows us to co-exist, we just don't use it in Queensland,\" Borell said.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/world/ben-and-jerrys-ice-cream-partner-leaves-business/f12dfa71-4e61-4895-9e19-51b7137e6634",
    "title": "'Sad it's come to this': Why ice-cream icons split after nearly 50 years",
    "publish_date": "Thu, 18 Sep 2025 01:19:28 +0000",
    "category": "finance",
    "authors": [
      "Sep"
    ],
    "text": "Hours after Ben and Jerry's co-founder Jerry Greenfield resigned from the ice cream company he founded nearly five decades ago, his former business partner, Ben Cohen, revealed to CNN why Jerry felt he had to leave.\n\n\"Jerry has a really big heart, and this conflict with Unilever was really kind of tearing him apart. So he felt like he had no choice to resign,\" Cohen told CNN's Vanessa Yurkevich.\n\n\"Jerry's kind of sad that it's come to this, but part of him is feeling a sense of relief that he's no longer in this intense conflict.\"\n\nJerry Greenfield, left, and Ben Cohen, co-founders of Ben and Jerry's, in September 2024, in Philadelphia. (Lisa Lake/Getty Images/File via CNN Newsource)\n\nEarlier Wednesday, Greenfield shared on social media that he was quitting the ice cream company, accusing parent company Unilever of curtailing Ben and Jerry's ability to speak out on social and political causes, which is synonymous with the brand's identity.\n\nThe conflict between the co-founders and Unilever has erupted into public view over the past several years, resulting in lawsuits and publicly posted letters.\n\nBritish-based Unilever bought Ben and Jerry's ice cream for US$326 million ($490 million) in 2000 but allowed the company to operate independently and continue its social mission without interference from its new parent company.\n\nREAD MORE: Jimmy Kimmel yanked off air over Charlie Kirk comments\n\nBen Cohen, co-founder of Ben and Jerry's, poses with a sign as he protests against the Magnum Ice Cream Company earlier this month. (Shokirie Clarke/Handout/Reuters via CNN)\n\nCohen and Greenfield remained at the company, which they founded in 1978, but not in operational roles. Instead, they focused on the company's social missions.\n\nBut Cohen told CNN that as management at Unilever turned over, no one who signed the deal with Ben and Jerry's remains, and the conglomerate started to disrespect the terms of its unique arrangement with the ice cream maker. Tensions boiled over in recent years as Ben and Jerry's opted to pull its operations from Israel, a decision that was overruled by Unilever.\n\nSince then, the company and its parent have feuded, mostly over politically focused social media posts that Cohen said Unilever opposed – and threatened to fire people over.\n\nREAD MORE: Sheriff reveals why Charlie Kirk suspect turned himself in\n\nBen Cohen said he supported Greenfield's decision to leave the business. (Shokirie Clarke/Handout/Reuters via CNN)\n\nSpeaking out on political issues, ranging from President Donald Trump to Israel and the Gaza Strip, angered Unilever, which fired the company's chief executive earlier this year.\n\nUltimately, Greenfield had enough. But Cohen said he chose to stay to continue to fight for the company's independence.\n\n\"I'm glad that we're both standing up for the values of Ben and Jerry's,\" Cohen told CNN.\n\n\"I think that I can be most helpful from the inside and and Jerry's going try to be helpful from the outside.\"\n\nDespite Greenfield's exit, Cohen said he is committed to the independent board that helps control the brand and will work to convince its parent company to sell the brand to a group of investors committed to Ben and Jerry's social mission.\n\nREAD MORE: The Epstein files question the FBI Director refused to answer nine times\n\nBen and Jerry's is a brand known for its social activism. (Chris Ratcliffe / Bloomberg / Getty Images)\n\nBen and Jerry's is currently being spun off from Unilever into a new company called The Magnum Ice Cream Company, which expects to be publicly traded in November.\n\nThe Magnum Ice Cream Company in a statement said it disagrees with Greenfield's and Cohen's perspective, and said it has tried to work with the brand's co-founders.\n\n\"We remain committed to Ben and Jerry's unique three-part mission – product, economic and social – and remain focused on carrying forward the legacy of peace, love, and ice cream of this iconic, much-loved brand,\" a Magnum spokesperson said in a statement.\n\nPolitics is profit\n\nA major factor in Cohen's remaining at the company is to keep intact Ben & Jerry's three-part mission: a social mission to support justice and equality, along with a product and financial mission. He says all three are core to the brand – and claims it's good for business.\n\n\"When we came up with that three part mission, we deliberately wrote it horizontally to make the statement that they are all equally as important,\" he said.\n\n\"As the company acts on its social values and as it produces great ice cream, it ends up making a good profit.\"\n\nUnilever, which doesn't break out Ben and Jerry's sales separately, said in its 2024 annual earnings report that its ice cream division rose 3.7 per cent from the year before.\n\nCohen doesn't regret maintaining its political and social stances, saying that Ben and Jerry's products have a small portion of the market so \"we don't have to appeal to everybody.\"\n\n\"The reality is that businesses are incredibly political,\" he said.\n\n\"The average business, (are) using their money to influence elections, and they're using their money and their lobbyists to influence legislation.\"\n\nHe added: \"The only difference is that Ben and Jerry's political aspects are overt, where we let people know what we think, whereas other businesses are covert.\"\n\nEven with Greenfield leaving the company, the \"spirit of Jerry will always be at Ben and Jerry's,\" Cohen said. And their friendship, which reaches back to junior high when they were the \"two, slowest, fattest kids\" in their class, will endure.\n\n\"I was a failure as a potter. Nobody would buy my pottery. Jerry was a med school reject, and we got together when we were 26 and said, 'Let's try starting a little business. Maybe that'll work.' We ended up starting this homemade ice cream shop in an old gas station in Burlington, Vermont, on an investment of US$8000 ($12,027) and we had no plans to be anything larger than that,\" Cohen said.\n\n\"It's been an amazing ride. It's been an amazing adventure, an amazing odyssey. There's been good times, there's been bad times, there's been challenging times, and we've been through them all together, Jerry and myself, and it's just built a stronger bond between us.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/wiluna-dog-bounty-questions/105595030",
    "title": "Remote council offers stray dog bounty as residents fear attacks",
    "publish_date": "Fri, 19 Sep 2025 01:43:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "A remote community in Western Australia's northern Goldfields is considering a \"bounty\" on domestic dogs amid a spate of attacks.\n\nWiluna, 950 kilometres north-east of Perth, has recorded a string of dog attacks, including six in the past two months.\n\nShire President Peter Grundy said there had been a visible increase in the number of roaming dogs, sparking growing concern from residents about their safety.\n\nMr Grundy said most of the roaming dogs were domestic and had either been abandoned by their owners or given free rein.\n\nSome have also interbred with wild dogs in the area.\n\nIn response, the council is hoping a program of cash payments for animals handed in may reduce the number left roaming.\n\nThe council will hold the dogs until a ranger collects them for transport to Perth for rehoming, where possible.\n\nPeter Grundy says the number of roaming dogs is problematic. (ABC Goldfields-Esperance: Jarrod Lucas)\n\nMr Grundy said the financial incentive would help families surrender dogs.\n\n\"The purpose of it is for the humane control of animals,\" he said.\n\n\"The incentive is for people whose dog is sick or approaching the end of life.\n\n\"We could think of rehoming it or get someone to help us manage it.\n\n\"I think this is the best way to give owners an opportunity to get their dogs screened, professionally assessed and then hopefully the majority of them will be rehomed elsewhere.\"\n\nThe shire says it has received reports of dogs biting. (Supplied: Wiluna Shire)\n\nIt is not the first time Wiluna has introduced a bounty for dogs.\n\nFaced with a similar problem in the early 2000s, the shire offered payments of $20 for fully-grown dogs and $5 for puppies.\n\nMr Grundy said there would need to be a review of those figures.\n\nHe said he hoped the system would be established soon, but there were some hurdles to be addressed.\n\n\"We have got to build a proper dog pound with all the cages and assign officers hours to feed them and look after them,\" he said.\n\n\"All of this has to be done to a high standard.\"\n\nDogs roam in groups in the streets of Wiluna. (Supplied: Wiluna Shire)\n\nVet services a challenge\n\nShire chief executive Matt McIntyre said the shire had a ranger program that visited for one week each month.\n\nWhile the shire was attempting to rehome some dogs, Mr McIntyre said the increasing dog numbers was making it challenging.\n\nMurdoch Veterinary Hospital staff have been travelling to Wiluna annually as part of an outreach program, providing desexing and other preventative health services in a bid to help address the dog population problem.\n\nStudents from Murdoch University provide free sterilisation to dogs in Wiluna. (Supplied: Nicole Laing)\n\nVet Nicole Laing, who coordinates the Murdoch program, said the council proposal was well-intentioned, but could potentially have a negative impact.\n\nDr Laing said payments could create an incentive to breed more dogs.\n\nThe council is considering a bounty to encourage people to surrender unwanted dogs. (Supplied: Wiluna Shire)\n\n\"Community members will see it as a way of gaining financial support and will deliberately breed animals to be able to provide for another, becoming a backyard puppy farm,\" she said.\n\n\"I think it's really important that people closely look at the consequences of offering a reward for someone to give up their extra pets.\"\n\nShe said the best course of action was to ensure the animals were being properly cared for.\n\nStudents from Murdoch University's On the Road program provide free sterilisations. (Supplied: Nicole Laing)\n\n\"If dogs aren't getting appropriate food and resources, they start to move into another dog's territory and that's when you're going to get dog fighting,\" she said.\n\nDr Laing said the idea of rehoming dogs was a step in the right direction, however, new owners should understand the work required to help these dogs adapt to urban life.\n\n\"I think if people are taking these animals on in this rehoming situation, they have got to be prepared that they may have to seek extra resources to enable a happy pairing,\" she said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/rabbits-cause-devastating-damage-to-junee-cemetery-southern-nsw/105792784",
    "title": "Rabbits digging near graves, cause 'devastating' damage in cemetery",
    "publish_date": "Fri, 19 Sep 2025 01:38:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A southern New South Wales mayor says it is devastating to see the damage being done by rabbits to grave sites in the area.\n\nThe Junee Shire Council was recently forced to close the town's main cemetery for a week, which included Father's Day, to allow a baiting program to be carried out.\n\nThe operation cost the council about $30,000, but Mayor Bob Callow said the pests were still present in large numbers.\n\nHe said it was a distressing situation for all concerned.\n\nA rabbit has burrowed under this grave site. (ABC Riverina: Cara Jeffery)\n\n\"Devastating for the people who have got loved ones here,\" Cr Callow said.\n\n\"It's not like there are a million holes, but the ones that are here are deep and dangerous.\n\n\" I really hope we are getting on top of it because I could see it getting worse. \"\n\nBob Callow says he is sorry the cemetery had to be closed on Father's Day. (ABC Riverina: Cara Jeffery)\n\nCr Callow said it was \"unfortunate\" that the closure of the cemetery clashed with Father's Day.\n\n\"If it wasn't Father's Day, it would be some other day,\" he said.\n\n\"If it did cause great concern to somebody , you know, I really am sorry about that.\n\n\"But at the same time, we've got to get on top of this.\"\n\nBob Callow says the Junee cemetery was recently closed to allow rabbit baiting. (ABC Riverina: Cara Jeffery)\n\nBurrows causing costly damage\n\nJunee stonemason Dean Ryan said he often noticed the damage being done by the pests as he worked to repair headstones in cemeteries across the region.\n\n\"They're sort of everywhere you look and graves are getting undermined,\" he said.\n\n\" They dig the burrows and they fill up full of water and … the graves themselves can sink. \"\n\nStonemason Dean Ryan has seen the damage rabbits are doing to grave sites in the Riverina. (ABC Riverina: Cara Jeffery)\n\nMr Ryan said the damage done to the graves could be costly, and it was up to the families to foot the bill.\n\n\"It could be in the thousands, depending on the level of work you got to do.,\" he said.\n\nRabbit population booming\n\nJamie Gleeson, who moved to Junee with his family from Cessnock in the NSW Hunter Valley in August last year, said it was not unusual to see up to 500 rabbits a day in the town.\n\n\"I've never seen the rabbit population like this,\" he said.\n\nTanja Strive says rabbits are developing a resistance to chemical controls such as calicivirus. (Supplied: Landscape Hills and Fleurieu)\n\nMr Gleeson has been hunting the rabbits using nets and ferrets to bring them out of the warrens.\n\n\"In two days, we can get 80 rabbits,\" he said.\n\nResistance to chemical controls\n\nCSIRO research scientist Tanja Strive said chemical controls such as the calicivirus were becoming less effective.\n\n\"We know that rabbit biocontrol viruses will lose their effectiveness usually about [every] decade or so,\" she said.\n\n\" This is due to resistance development in the rabbit as it evolves together with the virus. \"\n\nMs Strive said work was being done to produce a more effective strain of the virus, but it was still in its \"early stages\".\n\n\"If successful, we're still looking at probably three years of development, followed by a registration process and rollouts,\" she said.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/anti-corruption-commission-searches-chinese-language-school/105792674",
    "title": "Victoria's anti-corruption commission searches Chinese language school",
    "publish_date": "Fri, 19 Sep 2025 01:38:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's anti-corruption commission has searched the offices of one the state's biggest Chinese language schools over an investigation into alleged misuse of public funding from the Victorian education department.\n\nThe search warrant shared with the ABC said entry to the suites at Hamilton Place in Mount Waverley including suite 1 — which is the Xin Jin Shan Chinese Language and Culture School (XJS) office — was necessary for an investigation codenamed Operation PONTUS.\n\n\"The investigation concerns alleged misappropriation and improper receipt of public funding from the Victorian Department of Education in connection with its 'Community Language Schools Funding Program', including the public funding of Community Languages Victoria Incorporated,\" the search warrant read.\n\nThe investigation relates to suspected offences of obtaining property by deception, false accounting, and falsification of documents, which each carry a maximum 10-year prison sentence, the document said.\n\nChinese school audit Photo shows Haoliang Sun, holding a microphone, is standing in front of some Chinese characters stuck on a white wall in a room. An independent audit of one of Victoria's biggest Chinese language schools finds a list of financial mismanagement issues.\n\nThe warrant was obtained under the Independent Broad-based Anti-corruption Commission Act on September 4, and the ABC confirmed the search took place on September 11 and went for about five hours.\n\nAn IBAC spokesperson said the commission \"does not comment on whether it has a complaint or investigation before it\".\n\nThe warrant authorised a search of a sweeping list of records related to language school operations, including documents, business records, financial documents, diaries, meeting notes and computers.\n\nMedia containing files or documents including encryption devices were also listed on the warrant.\n\nIn an email sent at 11:50pm on September 18, XJS chairperson Haoliang Sun told the ABC he was overseas and \"not sure what has happened\".\n\nXJS is one of the biggest community language schools in Victoria, with about 3,000 students.\n\nChinese teachers underpayment allegations Photo shows A profile photo of woman in a green jumper who is looking at the camera. A group of Chinese language teachers allege they are owed unpaid wages and entitlements for work over decades due to a \"grey area\" of Victoria's education system.\n\nCommunity language schools operate outside mainstream school hours, mostly on weekends from rented school facilities, teach languages other than English and are considered valuable cultural and community hubs.\n\nThe schools are generally not-for-profit organisations that complement and fill language teaching gaps in the mainstream education system.\n\nIn Victoria, annual funding for accredited community language schools is available through the education department's community language school funding program to support programs and cover costs such as teacher salaries and curriculum resources.\n\nThe IBAC investigation comes five years after the ABC first revealed an audit into the school that uncovered a list of financial mismanagement issues and called for further investigation.\n\nSince that time, teachers from the XJS school have also raised allegations of underpayment due to incorrect employment categorisation.\n\nThe Fair Work Ombudsman then lodged a case against XJS in the Federal Circuit and Family Court in 2022.\n\nThe case is yet to be finalised, with the judgement reserved in 2024.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/cook-colliery-coal-mine-to-close-half-of-operation/105792906",
    "title": "Third Queensland coal miner cuts workers, closes underground site",
    "publish_date": "Fri, 19 Sep 2025 01:37:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "A third Queensland coal miner has confirmed job cuts as it prepares to close one of its underground mine sites, with the company also putting the blame on rising costs and state government royalties.\n\nQCOAL announced on Friday that one of its two underground sites at the Cook Colliery mine, near Blackwater in central Queensland, would shut down in the coming weeks.\n\nThe project employs about 170 people and is operated by contractor Core Crew.\n\nQCOAL said the closure at Cook Colliery would mean redundancies for workers or changes to existing positions, with employees to be consulted over the next two weeks before closure in early October.\n\nThe number of job losses remains unclear but it is understood that about half the workforce may be affected.\n\nThe looming shutdown comes just days after BHP Mitsubishi Alliance (BMA) announced the closure of Saraji South mine at Dysart and Anglo American confirmed job losses at its Brisbane offices and across its Bowen Basin operations.\n\nIsaac Regional Council Mayor Kelly Vea Vea said the BMA and Anglo job cuts would cost about 1,020 jobs in total.\n\nThe Saraji South mine is to be shut by owners BMA this November. (ABC Rural: Kim Honan)\n\nIn a statement, QCOAL said market conditions led to the decision.\n\n\"Unfortunately Cook Colliery has been affected by high production costs, high taxes and royalties, and low coal prices, and its ongoing operation at its current levels is unsustainable,\" a company spokesperson said.\n\n\"Cook Colliery has contributed $25 million in royalties to the Queensland government since its March 2022 reopening despite never making a profit.\"\n\nMining industry says coal royalties 'wildly' underestimates revenue Photo shows A bob cat machine in front of a very large pile of coal. The Queensland Resources Council wants the state to scrap its 40 per cent royalty hike on some coal exports, saying the new rates put the industry's viability at risk.\n\nThe mine has had a troubled history.\n\nQCOAL bought the mine from Bounty Mining in 2020 after that company was forced into voluntary administration.\n\nQCOAL reopened the sites in 2022.\n\nBounty purchased the site after Cook's previous owner Caledon Coal Group was also put into liquidation in 2017.\n\nThe mine sits about 27 kilometres south of Blackwater and produces both coking coal for steelmaking and thermal coal for energy.\n\nThe company's website boasts that almost half of the mine's workforce comes from the Central Highlands area.\n\nThe state government, Mining and Energy Union and Queensland Resources Council have been contacted for comment.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/gardens-of-stone-state-conservation-area-walks-open/105788604",
    "title": "Inside the $50m park project luring walkers from the Blue Mountains",
    "publish_date": "Fri, 19 Sep 2025 01:36:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "When one of the women in charge of turning 28,000 hectares of state forest near the Blue Mountains into a nature tourism destination first visited the site, she could not believe the extent of its degradation.\n\n\"You could fit three vehicles in the access road to Lost City, it was impassible,\" senior project officer Lou Wallace said.\n\n\"Same with Lost City North, you needed a GPS to be able to actually get to the end because of the extent of damage.\n\nThe team needed to restore degraded tracks. (Supplied: NSW National Parks and Wildlife Service)\n\n\"There were roads where you could not get a truck through there … vehicles were getting bogged and stuck.\n\n\" At that point I realised it was going to be a long journey. \"\n\nIn 2022, the New South Wales government dedicated nearly $50 million to protect parts of the Newnes, Ben Bullen and Wolgan state forests, in what is now known as the Gardens of Stone State Conservation Area (SCA) near Lithgow.\n\nDegraded access roads required work. (Supplied: NSW National Parks and Wildlife Service)\n\nThe project aims to transform a landscape consisting of braided four-wheel drive tracks and eroded dirt bike trails into a rehabilitated reserve, with a multi-day hike, bushwalks, mountain-bike trails, a 4WD track and camping grounds.\n\nThe NSW National Parks and Wildlife Service (NPWS) constructed its first walk, the Lost City, from scratch and opened it in December.\n\nMs Wallace said up to 2,000 visitors per month were now walking its trails, where there was \"nothing\" before.\n\nLou Wallace says it has been a long journey to restore the land. (ABC News: Lani Oataway)\n\n\"It's certainly more than what we'd initially expected,\" she said.\n\n\"It's a success story for the Gardens of Stone area, and it's also just the start of that journey.\n\n\"We're seeing now more positive momentum and cultural change in a short period of time, which is really promising for what's coming next.\"\n\nUp to 2,000 people are visiting the Lost City walking track per month. (ABC News: Lani Oataway)\n\nNew walks open\n\nNPWS staff spent 18 months transforming eroded dirt bike trails into two walking tracks that are opening to the public today.\n\nThe Broad Swamp to Birds Rock walking track will form the first section of the planned three-day hike, which will be completed in the coming years.\n\nThe 17.5-kilometre trail winds through previously inaccessible clifftop views, which showcase the platy pagoda formations unique to the reserve.\n\nThere are views over the platy pagoda landscape on the Broad Swamp to Birds Rock track. (ABC News: Lani Oataway)\n\n\"It is really a walk of many different personalities,\" Ms Wallace said.\n\n\"It captures dense landscapes, it captures some of the unique bird and wildlife around Broad Swamp, [and] it opens up access to new views.\n\n\"It's really about creating something new that will leave a lasting impact for people who were unable to really access that landscape and those views.\"\n\nThe walks have opened up previously inaccessible viewpoints. (ABC News: Lani Oataway)\n\nMeanwhile, the family friendly 6km Broad Swamp Loop Walk circles the rehabilitated endangered ecological community, which houses threatened species such as the Blue Mountains water skink.\n\nMs Wallace said the circuit was previously a connection of \"heavily degraded and eroded\" roads.\n\n\"We're trying to promote a change in use to that area,\" she said.\n\nThe Broad Swamp is home to several threatened species. (Supplied: NSW National Parks and Wildlife Service)\n\n\"That involves repairing roads that were there and supporting drainage that actually filters in a sustainable way and promotes the health of the swamp.\"\n\nStaff planted about 3,000 species around the wetland to rehabilitate the landscape and prevent further erosion.\n\nThe seeds were collected from the conservation area by the Lithgow and District Community Nursery and grown to tube stock before being returned to their place of origin.\n\nStepping stones and duckboard ensure healthy water movement through the swamp. (ABC News: Lani Oataway)\n\nRelieving tourism pressure\n\nNPWS Blue Mountains branch director David Crust said he expected visitor numbers to the reserve to increase \"significantly\".\n\nMr Crust said aside from developing Lithgow as a tourism destination, it was also hoped the SCA would help disperse the number of people visiting the nearby Blue Mountains National Park.\n\n\"It's an incredibly popular park [with] 6.8 million visitors a year. It's the most visited national park in Australia,\" he said.\n\nDavid Crust says it is not often the agency builds walks like the Lost City from scratch. (ABC News: Keana Naughton)\n\nMr Crust said although it was early days, that dispersal seemed to be happening.\n\n\"What we're seeing anecdotally is people that are coming for a weekend in the Blue Mountains that are doing the traditional stuff, the Grand Cliff Top Track and all that sort of stuff, are then going to do a day in the Gardens of Stone,\" he said.\n\nMr Crust said he was proud of what his team had achieved so far in the reserve, considering its challenges.\n\n\"The Gardens of Stone is a pretty degraded landscape; there's a lot of eroded tracks, there's a lot of damage,\" he said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/liam-paro-beats-david-papot-despite-boxing-black-eye/105793472",
    "title": "Horrible black eye can't stop Australian Liam Paro winning boxing bout",
    "publish_date": "Fri, 19 Sep 2025 01:21:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian Liam Paro hopes his black and blue right eye can be a trap that nets a second world title after his gritty win over David Papot in Brisbane.\n\nIn his welterweight debut at Pat Rafter Arena, a dogged Paro fought one-eyed for eight rounds but still notched a unanimous points victory over the previously undefeated French showman.\n\nIt was a brutal introduction to the division against 34-year-old Papot, who has fought four divisions higher than the super lightweight class Paro won and lost IBF world titles in last year.\n\nThe 29-year-old Queenslander was unflinching though, chipping away despite Papot's mid-fight dominance as judges scored the 12-round tussle 117-111, 116-112 and 116-112.\n\nParo carried on with one eye closed. (Getty Images: Chris Hyde)\n\nDefeat in a fight billed as an IBF world-title eliminator would have been disastrous for a boxer seeking a second strap, this time in a division stacked with big-name boxers.\n\nAfter staring defeat in the face, albeit with only one eye, Paro said he hoped those rivals could smell blood as he attempts to lure a title fight to Australia.\n\n\"I hope they do, because I see vulnerability in them too,\" Paro said.\n\n\"You've got to be confident in this sport.\n\n\"Not everything's going to be rainbows and sunshine. I love it, I really do and it's not always going to be pretty.\"\n\nPapot caught Paro flush in the right eye. (Getty Images: Chris Hyde)\n\nHe was less poetic on social media later in the night, simply saying: \"F***in' hell. Had to work for that c***.\"\n\nChampions Lewis Crocker (IBF), Mario Barrios (WBC) and Rolando Romero (WBA) are prime targets, while Devin Haney, Ryan Garcia, Conor Benn and even Manny Pacquiao have all been tossed up.\n\n\"I hope they think they saw opportunities against Liam,\" promoter George Rose said.\n\n\"I know for a fact he can beat every one of those champions and I hope they think they can beat him.\n\n\"There's great opportunities there and we'd love to get Rolly, Barrios over here.\n\n\"They'd love it … but they would leave without their belts.\"\n\nParo won his first world title in Puerto Rico against the odds and is still attempting to build his brand domestically.\n\nParo became a shock world champion in June last year, before losing it six months later. (Getty Images: Ezra Shaw)\n\n\"These are character-building fights. We're under no illusion what it takes to win a world title cause we've done it,\" coach Alfie Di Carlo said.\n\n\"These are the kind of fights … where you learn a lot about yourself.\"\n\nParo admitted to some nervous moments after the fourth-round blow that split his defences and sent him staggering back towards the ropes.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"[I was thinking] holy shit. In the heat of the moment, just trying to crack him back, just keep fighting,\" he said.\n\n\"100 per cent I was fighting with one eye, trying to light it up.\n\n\"It's character building. It's not going to be pretty all the time. They're soul-searching fights.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/australian-alanna-smith-wins-wnba-defensive-player-of-the-year/105793098",
    "title": "Alanna Smith becomes first Aussie since Lauren Jackson to win WNBA award",
    "publish_date": "Fri, 19 Sep 2025 00:40:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian forward Alanna Smith has split the WNBA defensive player of the year award with league legend A'ja Wilson.\n\nBoth players received 29 votes from a national panel of 72 media members in a clear two-horse race.\n\nThis marks the third time Wilson has won the award, having also received the honour in 2022 and 2023, while Smith is the first Australian to win it since Lauren Jackson in 2007.\n\nSmith is the first Australian to win any of the major individual WNBA end-of-season awards since 2010, when Leilani Mitchell was named rookie of the year and Jackson won her third MVP, the championship and was crowned finals MVP.\n\nThis season, Smith ranked third in blocked shots (80) and tied for 10th in steals (55) while helping the Minnesota Lynx rack up the league's best record (34-10) and rank second in scoring defence (76.7).\n\nSmith was a WNBA all-defensive second team choice last season and figures to be a first-teamer this time around.\n\nSmith, 29, also averaged 9.6 points and 5.1 rebounds in 42 games (all starts).\n\nWilson, a three-time league MVP including last year, ranked second in blocks (92) and third in steals (64) while again being a stellar force at both ends of the floor for the Las Vegas Aces.\n\nWilson has made the all-defensive first team three times and also has one second-team nod.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWilson, 29, also ranked second in rebounding (10.2) in 40 games and her performances fuelled the Aces' 16-game winning streak to end the regular season.\n\nWilson also is in the running to win her fourth career MVP award. She led the league with a 23.4 scoring average.\n\nSeattle Storm guard Gabby Williams was third with nine votes. Williams racked up 99 steals, tied for second most in WNBA history with Tamika Catchings (2009) and one behind record-holder Teresa Weatherspoon (100 in 1998), while Phoenix Mercury forward Alyssa Thomas received three votes.\n\nSmith's Lynx teammate and 2024 DPOY Napheesa Collier got two votes, and is also the favourite to win her first MVP award this season.\n\nSmith and Collier's Lynx beat the Golden State Valkyries in the first round of the playoffs and will next face the winner of the series between Phoenix and the New York Liberty.\n\nIf the Liberty make it through, the second round will be a rematch of last year's WNBA Finals, where Australian coach Sandy Brondello led her team past Smith's Lynx in a five-game thriller.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/oscar-piastri-says-mclaren-has-clarified-team-orders/105792972",
    "title": "Piastri ready to push forward after controversy over McLaren team orders",
    "publish_date": "Fri, 19 Sep 2025 00:08:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "Formula 1 drivers' championship leader Oscar Piastri says McLaren has \"had a lot of discussions\" since the controversial ending to the Italian Grand Prix two weekends ago.\n\nPiastri overtook his teammate, world championship rival Lando Norris, late in the grand prix for second place after Norris had suffered a slow pit stop.\n\nThe Australian, who could have extended his lead in the championship to 37 points, obliged to his team's request to give second place back to Norris with a few laps remaining, in the name of fairness.\n\nAfter the race at Monza, Piastri said he and McLaren had done the right thing, but during the grand prix the Australian questioned his team over the radio.\n\n\"We said a slow pit stop was part of racing, so, I don't really get what's changed here,\" Piastri said.\n\nHeading into this weekend's Azerbaijan Grand Prix, where Piastri was victorious last season, the Australian said McLaren was now much clearer on their rules for the rest of this season.\n\n\"We’ve had a lot of discussions, clarified a lot of things, and we know how we're going to go racing going forward, which is the most important thing,\" Piastri said during a press conference on Thursday.\n\n\"What's happened is done, and I'm excited to get racing here.\"\n\nFor a number of seasons, McLaren has been firm in its stance that its drivers work together for the benefit of the team.\n\nIn 2024, Norris effectively handed victory in the Hungarian Grand Prix to Piastri after the Brit had taken the lead because of an advantageous pitting sequence.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPiastri's lead in the championship is still a healthy 31 points heading into this weekend's Azerbaijan Grand Prix.\n\nMcLaren can wrap up the constructors' championship this weekend if they outscore Ferrari by nine points, and Mercedes and Red Bull do not outscore them by 12 and 33 points, respectively.\n\nIt would be McLaren's second consecutive constructors' championship, and would be secured with seven rounds still to race.\n\n\"Clearly the car has been a step better, the team has been performing very well,\" Piastri said.\n\n\"So there's much more of a sense of inevitability about this year, which is an amazing position to be in. It's a testament to all the hard work from everyone at the team.\"\n\nABC Sport will have a live blog of the F1 Azerbaijan Grand Prix, from 7pm AEST on Sunday, September 21.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/queensland-pensioner-sells-home-in-cost-of-living-crisis/105515934",
    "title": "Cost of living forces pensioner to sell home and move in with family",
    "publish_date": "Thu, 18 Sep 2025 23:58:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "At 71, Annette Bleney did not expect to find herself living with her daughter.\n\nBut she made the tough decision to sell her home as she struggled to pay basic bills.\n\n\"I had to because I was living from fortnight to fortnight and when my [car] rego was coming up I thought, 'Oh gosh, I can't even afford that',\" she said.\n\nMs Bleney will move from the Capricorn Coast in central Queensland to live with her daughter in Rockhampton, 50 kilometres away.\n\n\"Hopefully, later on, we might be able to get another house with a granny flat for me,\" she said.\n\nShe said car expenses accounted for the bulk of her costs as she often travelled between the city and coast.\n\n\"The cost of petrol is dear and I try and shop around to see which is the cheapest,\" she said.\n\n\"It needed new tyres and I couldn't afford to do the service and I had to ask my brother to help me pay for that.\"\n\nAnnette Bleney says she hopes she will be able to buy herself a new pair of glasses. (ABC Capricornia: Vanessa Jarrett)\n\nMs Bleney is among 2.6 million Australians who receive the age pension.\n\nThe fortnightly rate before tax is $1,149 for a single person and $866 per person in a couple.\n\n\"I worked for nearly 45 years and you're used to having your own money and then when you go on a pension and you've got to budget all the time,\" she said.\n\n\"I thought I was doing OK but times have changed and the cost of living … the prices of food has gone up.\"\n\nThe Australia Institute's 2024 Reducing Poverty in Retirement report found one in five Australians in retirement were living in poverty.\n\nTo keep up with inflation, the pension increases twice a year, in March and September.\n\nThe upcoming increase of $29.70 for singles and $44.80 for a couple takes effect from Saturday.\n\nThe Rockhampton Senior Citizens Club holds regular events. (ABC Capricornia: Vanessa Jarrett )\n\nNot-for-profit advocacy group National Seniors Australia said the little bit extra would help lighten the purse strings.\n\n\"We're seeing a lot of older Australians challenged by trying to keep up with the cost of living,\" chief executive Chris Grice said.\n\n\"We are grateful, if you could use that term.\n\n\"The last time when the pension was indexed earlier in the year [the increase] was something like $4, so we're pleased to see this time around that that the indexation is much a much larger amount.\"\n\nCommunity groups help bridge gaps\n\nIn Rockhampton, where 16.7 per cent of the population is over 65 years old, the Seniors Citizen Club tries to fill the gaps.\n\nAside from social events, the club provides nutritious meals at a low cost.\n\nOlder Australians brace to pay more for home care Photo shows A woman wearing blue scrubs has her arm around an older woman wearing a pink cardigan as they walk across a lush green lawn. Senior Australians wanting to stay living at home independently for longer have concerns about new, national charges for services such as showering, cleaning and gardening.\n\nFor some, it is their only nutritious meal and outing of the week.\n\n\"It's very cheap and I usually take a couple of meals home with me,\" Rockhampton resident Denise Andrijasic said.\n\n\"I don't cook much at home.\"\n\nMany of the attendees, including Kath Farlow, said groceries took up the biggest chunk of their expenses.\n\n\"Even though the pension's good for us, you can't knock it because it's something that we've earnt, we've paid our taxes, so we're entitled to a pension,\" Ms Farlow said.\n\n\"I'd hate to have a family these days with groceries because you buy three bags of groceries and you're looking at $100.\n\n\"Once upon a time, you'd get about five or six bags for $100.\"\n\nMs Bleney, whose house was under offer, hoped the sale would finally bring financial security.\n\n\"I'm crossing my fingers that this one is going to work,\" she said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/port-hedland-water-supply-at-capacity/105789308",
    "title": "Future uncertain for WA town as water source reaches capacity",
    "publish_date": "Thu, 18 Sep 2025 23:04:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's Water Corporation says the water supply of a major town in the Pilbara is \"at capacity\" and cannot accommodate any further development.\n\nThe information was revealed in a letter from the state-owned utility to the chief executive of the Town of Port Hedland.\n\nPort Hedland is a hub for resources in the Pilbara. (ABC News: Kimberley Putland)\n\nIn the letter, sighted by the ABC, Water Corporation said it would not support a proposed expansion of the Beachfront Village accommodation development due to a \"water-supply constraint issue\" caused by demand on the source.\n\n\"The scheme is currently at effective capacity with its existing groundwater sources, which are impacted by climate factors,\" the letter states.\n\n\" Any new major connection requests cannot be accommodated until the scheme has additional source capacity. \"\n\nWater Minister Don Punch has been contacted for comment.\n\nPort Hedland's existing sources of water. (Supplied: Water Corporation)\n\nLocals left out to dry\n\nPilbara Tourism Association chair Barry Harrison said it was disappointing for the town, which is already facing a shortage of accommodation.\n\n\"We desperately need more tourism accommodation here in Port Hedland and any lack of perceived water supply is obviously going to impact that and other major projects,\" he said.\n\nBarry Harrison says the town can't grow without water. (ABC Pilbara: Alistair Bates)\n\n\"Water is the source of life and without that we can't do anything, let alone building new accommodation, you know, new hotels, new accommodation for local people.\n\n\"If that's what Water Corp is telling the council it's quite disappointing that there's not some plans in place or afoot. There should have been years ago to resolve this problem.\"\n\nPort Hedland's drinking water is supplied from two groundwater bore fields, with allocation of the region's scarce water resources already under public scrutiny this week.\n\nMichael Thompson is a pastoralist at Mundabullangana Station, Port Hedland. (ABC News: Michelle Stanley)\n\nMichael Thompson's Mundabullangana Station is located above the the Yule River bore field, which is controlled by the Water Corporation.\n\nThe pastoralist told ABC Radio Perth this week he was drilling deeper and deeper to access water for his cattle on the station, once renowned for its water quality.\n\nAlternative sources long away\n\nWater levels in another dam near Karratha, 240 kilometres west, have dropped by 19.5 per cent this year.\n\nWhile the Harding Dam, south of nearby Roebourne, sits at just 21.6 per cent capacity.\n\nHarding Dam is one of Karratha's water sources and has dropped by nearly 20 per cent from last year. (ABC News: Stephen Stockwell)\n\nWater Corporation said declining inflows into Harding Dam were entirely climate driven, with no significant recharge since April 2022.\n\nA spokesperson told the ABC it was investigating new drinking water sources, including the likely construction of a desalination plant.\n\nBut in the letter it said the new source was not expected until the early 2030s, with capacity constraints to remain until then.\n\nWA Nationals leader Shane Love said it was baffling the situation had been allowed to deteriorate by the Water Corporation and WA government.\n\nShane Love says it is a \"disgrace\" that Port Hedland's water supply was allowed to reach capacity. (ABC News: Keane Bourke)\n\n\"I'm absolutely dumbfounded that in the town of Port Hedland … there has not been the far-sightedness to actually provide sufficient water for the growth of the town,\" he said.\n\n\" It means that Port Hedland can't grow. This is a disgraceful situation. \"\n\nA Water Corporation spokesperson said extensive planning and investigation was underway for a new long-term water source for Port Hedland, including a desalination plant, but that it was a complex process.\n\n\"Water Corporation is reviewing its advice regarding the Beachfront Village proposal and is committed to working with the proponent and the Town of Port Hedland on a way forward,\" they said.\n\n\"While rainfall-dependent groundwater has served the town to date, declining rainfall and hotter, drier conditions driven by climate change mean it is unlikely to remain a viable standalone option into the future.\n\n\"Population growth and increasing industrial demand are adding further pressure to the system.\n\n\"Water Corporation remains committed to supporting the growth and development of Port Hedland and will continue to work closely with local government, industry and the community to ensure water supplies are managed sustainably now and into the future.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/no-live-sheep-export-ships-wa-ban-looming/105789752",
    "title": "No live export ships coming for WA sheep amid high prices, looming ban",
    "publish_date": "Thu, 18 Sep 2025 22:12:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "No live export vessels are scheduled to take sheep from Australia to the Middle East for the rest of 2025, raising speculation an unofficial end to the trade could come ahead of a legislated ban in 2028.\n\nThe three-month northern summer moratorium on live sheep exports to the Middle East ended last weekend, a milestone normally marked by a flurry of activity at Fremantle Port, with sheep ships docked and ready to take on animals.\n\nBut this year is very different.\n\nWA Livestock Exporters' Association chair John Cunnington said not one livestock vessel is confirmed to return to Australia between now and the end of the year.\n\nHe pointed to \"unprecedented circumstances\" in the market, including high sheep prices and Western Australia's shrinking sheep flock.\n\n\"It doesn't mean they won't come,\" he said.\n\n\"But the tight supply and high prices and everything else that goes on in the live export space with regulation is making it extremely difficult at the moment.\"\n\nNo sheep ships are scheduled to depart Fremantle Port between now and the end of the year. (ABC News: Gian De Poloni)\n\nMr Cunnington told the ABC the situation was unusual.\n\n\"The trade's always had a reliable history of running ships backwards and forwards between Fremantle and the Middle East, and that's been happening for decades,\" he said.\n\n\"Even in recent years, since the northern summer cessation period started [in 2019], we've always seen ships either ready here to go as soon as the period is lifted, or planning to come back.\n\n\" So to not hear of any shipments planned currently is pretty unprecedented. \"\n\nMr Cunnington said between September and December last year, 145,000 head of sheep were exported by ship, with this year's figures set to plummet by comparison.\n\n\"You're probably looking at 50,000 to 100,000 [head], so you're looking at a third to two-thirds less,\" he said.\n\n\"The demand is definitely there from the Middle East, it's just whether we can commercially make this all work.\"\n\nThe beginning of the end?\n\nLast year, the Australian government announced live sheep exports by sea would be phased out over a four-year period.\n\nMr Cunnington said he did not necessarily think the current situation indicated the end of trade before then.\n\nBut he said the ban was worrying sheep producers and prompting many to leave the industry.\n\n\"[The Department of Primary Industries and Regional Development's] flock modelling shows WA's sheep flock went from 12.4 million in mid-2022, and it's declined to 8.6 million in July 2025,\" he said.\n\nJohn Cunnington heads WA's Livestock Exporters' Association. (ABC News: Ruby Littler)\n\nWhile DPIRD mainly attributed this to dry seasonal conditions, Mr Cunnington said uncertainty around the government's looming ban on the live sheep trade had heavily contributed.\n\n\"Agriculture runs on confidence and this decision [to ban live sheep exports] … really spooked and put uncertainty into the markets,\" he said.\n\n\"And producers acted accordingly.\"\n\nPrices unsustainable\n\nFigures released by Meat and Livestock Australia last week showed sheep transactions at WA's largest sheep selling centre, Katanning Regional Saleyard, increased by 100 per cent year on year from 2023-24 to 2024-25.\n\nYork sheep farmer Peter Boyle said he was concerned the current near-record sheep prices were unsustainable.\n\n\"It's very hard to see our way clear to get a good margin because we don't know where the market's going to go,\" he said.\n\nMr Boyle farmed sheep for almost 60 years, but recently shifted his focus to crop farming to try and future-proof his livelihood.\n\nHe said he was not alone.\n\n\"There are eight of my neighbours who have gone out of sheep farming,\" he said.\n\n\"Dams have been filled and they've said they're not going back.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/jess-hull-fall-into-world-athletics-championships-800m-semifinal/105792394",
    "title": "Jess Hull trips and falls into historic world championships semifinal",
    "publish_date": "Thu, 18 Sep 2025 22:06:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia has recorded another first at the World Athletics Championships, with three women progressing to the 800m semifinals for the first time.\n\nClaudia Hollingsworth finished third in her heat to qualify automatically.\n\nAbbey Caldwell missed third in her race by 0.08 of a second, but managed to progress as the second-fastest non-automatic qualifier.\n\nBut the wait was perhaps even more agonising for Jess Hull after she took a hard tumble in the final heat of the night.\n\nClaudia Hollingsworth was the only automatic qualifier of Australia's three women's 800m semifinalists. (Getty Images: Christian Petersen)\n\nOn the cross, as the pack comes together from their starting staggers, Hull was last but pushed up to join the group.\n\nHull quickly filled the space in between Canada's Maëliss Trapeau and South African runner Prudence Sekgodiso, copping a nudge from Trapeau into Sekgodiso.\n\nThe field settled into stride after that, with Hull, riding high after her 1,500m bronze medal, ready to launch for a personal best.\n\n\"I kind of took a second to myself where I was like, 'I'm right in this', which I knew I could be,\" she said.\n\n\"The first 200m is the hardest part of the race and to put myself right in it, I was like 'OK here we go'.\"\n\nBut, after that tricky first half-lap, disaster struck.\n\nLoading Instagram content\n\nIn the inside lane, eventual winner Natoya Goule-Toppin suddenly had to hop right, seemingly to avoid clipping the back of German Majtie Kolberg's feet.\n\nThat appeared to send her bumping into Sekgodiso, with the small nudge sending the South African's legs into the left ankle of Hull at the worst possible time and the Australian belly-flopped hard onto the track.\n\nJess Hull went down just after 200m mark of the race. (Getty Images: Mustafa Yalcin/Anadolu)\n\nIt all happened so fast that even Hull was not 100 per cent sure what had happened immediately after the race.\n\n\"I was running and next second I knew I was on the ground and the whole pack was leaping over me,\" she said, adding she felt someone clip her back foot mid-stride.\n\n\"I got up on instinct, but in the 800m you're not gonna get those women back, they are so fast. The race was gone but I was like 'well I owe it to myself to finish the race'.\"\n\nThe field ran away from her, but Hull made sure she finished. (Getty Images: Pat Scaasi/MI News/NurPhoto)\n\nAnd finish she did, well behind the rest of the field except, ironically, Sekgodiso, who dropped off the back in the second lap and was left in tears after she was unable to finish the race due to a hamstring injury.\n\nHull, with a small gash on her right leg from her spikes, jogged on to come home in 2:13.42, comfortably the slowest of the 55 finishers across the seven heats.\n\nThankfully for her and Australia's tilt, an appeal was upheld by the referee and she progressed to the semis alongside Hollingsworth and Caldwell.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe 28-year-old from Wollongong said she did not blame anyone for her stack, but was entitled to another chance.\n\n\"It's racing, but there's nothing different I could've done,\" she said.\n\n\"I was taken out from behind so I think personally I haven't done anything wrong.\n\n\"It's not the fault of the pack either, that is racing, but I didn't get a chance to even run myself through.\"\n\nThe women's 800m semifinals are tonight, with Hollingsworth at 9:43pm AEST, Hull at 9:52pm, and Caldwell running from 10:01pm.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/afl-preliminary-final-preview-geelong-vs-hawthorn/105792398",
    "title": "Counterattacks and forward diversity — how the Hawks can down the Cats",
    "publish_date": "Thu, 18 Sep 2025 21:54:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "The most famous saying in football might be its most time limited — \"we'll take it one week at a time\".\n\nIt's a phrase that's uttered countless times across the course of a season, surpassing other catchcries like \"we gave it 100 per cent\" and \"it's a game of four quarters\".\n\nIt is in this week that the saying means most of all. While fans are busy registering for the grand final ballot and making BBQ plans with friends, coaches and clubs will be drilling players not to get ahead of themselves.\n\nBecause falling in the preliminary final can be even more painful than losing on the big day — so close to the final reward but with little to show for it.\n\nGeelong knows this pain more than most sides. The Cats have made preliminary finals in eight of the past ten seasons, including this year.\n\nThey've managed to win just two of those seven matches, with their season finishing painfully short on five occasions.\n\nHawthorn is less familiar with this stage in recent years.\n\nIt has been a full decade since the Hawks' last flag, and their last visit to the final four.\n\nIn that time Hawthorn has rebuilt and retooled, with Jack Gunston the last holdout from that 2015 premiership. After an abbreviated visit to the finals last year, this year's Hawks are determined to leave their mark on the competition.\n\nAt this time of year match-ups become incredibly important, alongside how you adjust to the team you are set to beat.\n\nWhile Geelong have had the upper hand in recent years against the Hawks, the gap appears to be closing fast. This year the Cats won their only match by a heart-stopping seven points.\n\nThat sets the stage for a mouth-watering battle between two well-matched opponents.\n\nBoth the Hawks and Cats will be looking to lean on their strengths to make it one more week to the grand final.\n\nThe rising Hawks\n\nHawthorn entered the year in the mix for grand final favourites before sliding through the middle of the year.\n\nAfter two impressive finals efforts the Hawks see themselves with just their closest recent rival in the way of their first grand final visit in a decade.\n\nThe Hawks have built their success slowly but surely, recruiting talent from somewhat unlikely places.\n\nStar forward Gunston left Hawthorn for a year in Brisbane before returning. His forward line foil, Mabior Chol, has firmly found his place in the league at his third club.\n\nTheir engine room is led by mid-season rookie pick up Jai Newcombe, alongside Irish recruit Conor Nash.\n\nJack Gunston has led the forward charge for the Hawks, but they boast several danegrous avenues to goal. (Getty Images: Quinn Rooney)\n\nWhile the Hawks have made the most of their high draft picks, it's how the talent has come together that has spurred them to success.\n\nThis year, the strongest parts of their game have happened not through the middle of the ground, but instead inside the arcs.\n\nHawthorn's marking inside 50 rate sits second in the league with the Hawks notable for the spread of their threats rather than a dominant figure.\n\nTalls and smalls have all found space to work in. Gunston has kicked a career high 70 goals this year, but he's far from playing a lone hand up forward.\n\nIt's the wide range of targets that the Hawks deploy up forward that have created extra space for the Hawks veteran, and what makes them such a deadly proposition.\n\nAt the other end of the ground, Hawthorn's defence has been equally stout. They've paired their forward marking prowess with stingy defence against deep marks. They concede the fewest points per entry inside 50 amongst the sides left this year.\n\nHowever, this stingy defence has come at a cost. A strong defence-first approach hasn't always been effectively paired with creating strong threats going the other way.\n\nThe balance between defence and counterattack is hard to get right.\n\nHawthorn has struggled to capitalise once they win the ball back. They are the only finalist who sits below league average in points scored per intercept.\n\nThe Hawks have particularly stalled after defensive half intercepts, sitting 12th for scoring per attempt. Without a potent defensive half counterattack, teams can get a bit more aggressive with their attack.\n\nAt face value, Geelong — the best side at exploiting short field turnovers — would be the hardest test for a side that sometimes struggles to move the ball up the ground.\n\nIn their round six match-up, the Hawks were solid at moving the ball up the ground, but gave up 14 front half scoring shots to sink their hopes.\n\nTo have a shot at beating the favourites they have to make sure they can move the ball safely down the ground.\n\nThe always present Cats\n\nAs the season has developed, expectation of something special has slowly grown down at Kardinia Park. Seemingly every year that passes is followed by speculation of whether this is the year that the Cats finally slide down the ladder for good.\n\nAt this rate that fall may never happen.\n\nJeremy Cameron's year has been special, but the veteran has been ably supported by Geelong's rising stars. (Getty Images: Morgan Hancock)\n\nWith a host of talented youngsters like Max Holmes supplementing veterans like Jeremy Cameron and Patrick Dangerfield, the Cats shape as maybe the team to beat this year. And it's not just the talent that is driving their 2025 success.\n\nGeelong has long been considered the most inventive side in the competition in terms of set up and execution.\n\nChris Scott and the Cats often leave opposition coaching staff scratching their heads with how they deploy their side.\n\nFrom defensive match-ups to ball movement, the use of rucks and how they generate spare defenders, the Cats are a tough problem to solve, especially in the finals.\n\nThese quirks can often manifest in one way in particular — opposition mistakes and Geelong goals.\n\nGeelong has been the most prolific team scoring from turnovers this season, with the Cats causing problems with turnovers forward of the centre square.\n\nGeelong's group of forwards force opposition sides to pick their second or third choices when trying to move the ball out of defence. The Cats upfield defence also works like a trap in creating repeat inside 50 entries.\n\nWhen entering the 50 the Cats manage to find their way towards the hotspot more than any other side. With a deep and talented forward line — led by All-Australian captain Jeremy Cameron — the Cats can force the ball into valuable spots close to goal.\n\nThe Cats have 50 per cent more set shots per game inside 15m of any other side this year other than Brisbane. For opposition sides it's often about triaging damage rather than stopping the onslaught.\n\nLike all other teams the Cats are beatable, even if they are more complete than most other sides.\n\nThe Cats prioritise around the ground flexibility from their ruck division, sometimes cruelling their ability to win first possession from stoppages.\n\nThey will often run one ruck at centre bounces before deploying them behind the ball or deep forward, while a second tall will take over the primary ruck work around the ground. This creates an advantageous mismatch in general transition play, but does come at a cost at the initial contest.\n\nIn addition, the Cats deploy a large number of prime movers and defensive options at contest, often leaving them at a disadvantage at winning the ball at the coalface.\n\nLoading...\n\nUsually these other elements can more than compensate from the loss of raw volume, but at times it can starve them of field position.\n\nEarlier this year against the Hawks they were able to overcome this first possession weakness, winning that battle 43 to 35. However, they struggled to get the ball to the outside, losing the clearance battle. That led them to losing the territory battle across the game.\n\nWhile Geelong held on for a narrow win, it provided a real pathway for the Hawks to build upon for this week.\n\nThere's also sometimes a sense that the Cats can be too reactive to what other sides are doing instead of forging ahead with their own identity.\n\nRather than having something tried and tested to fall back on when in trouble, they seem to try to solve problems on the fly.\n\nThat may not hold up as well in September as it does in May.\n\nABC Sport will be live blogging and calling all of the action from tonight's preliminary final, with the game set to start at 7:40pm.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-09-19/rural-fire-service-brigades-seek-new-members/105778996",
    "title": "'Old boys' club' image threatens future of RFS brigades",
    "publish_date": "Thu, 18 Sep 2025 21:50:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Kate Coddington was just 18 when she joined the Rural Fire Service (RFS) in 2021 to continue a family connection.\n\nThe Dubbo woman, whose grandfather spent more than 60 years with the Tubbul RFS brigade in southern NSW, was also looking for a way to spend time with her new partner, Aiden Adams.\n\n\"I think I ultimately wanted to join because my grandfather was in it and to spend more time with him [Aiden],\" she said.\n\n\"As a woman, first rocking up to the shed, it was really intimidating when they were just all older men.\n\n\"The new members within our brigade are working well to rip apart the old boys club and make it easier and less intimidating on new people coming in.\"\n\nThe perception of an \"old boys' club\" is backed up by RFS figures.\n\nMembers older than 70 old make up largest age cohort in the western area, which has about 14,000 volunteers.\n\nMeanwhile, those under 30 make up the smallest age group.\n\nThe RFS has been running secondary school cadet programs in more than 45 high schools across the state, including in Brewarrina, Coonamble, Dubbo, and Lightning Ridge, to encourage young generations to become volunteer firefighters.\n\nAge distribution of firefighters in the western NSW zone.\n\nBut the aging profile and shrinking numbers of many brigades has created concern, especially around bushfire season.\n\nDisappearing brigades\n\nIt was not always that way.\n\nRodney Althofer from Dripstone, a small community an hour south of Dubbo, joined the RFS in 1965.\n\nHe said were times when there were about 30 active brigade members, and many more people who turned up to a larger fire.\n\n\"You'd often get 80 to 100 people to follow because there were farm hands which you don't see a lot of nowadays,\" he said.\n\nMr Althofer said he was the only RFS member from Dripstone who turned up to smaller, \"nuisance\" fires, such as burnt-out, stolen cars.\n\nAlthough on the books, Dripstone has more members.\n\nHe said two other volunteers, also aged over 60, sometimes came from the neighbouring town of Wellington.\n\n\"You're lucky if you get three people,\" Mr Althofer said.\n\n\" If we don't use our trucks and stuff, they'll take one off us. \"\n\nRodney Althofer received a National Medal for his six decades of service in the RFS. (ABC Western Plains: Lily Plass )\n\nMr Althofer said there were roles behind the front lines that needed to be filled as well.\n\n\"Even people that don't want to go to a fire can help,\" he said.\n\n\"They can do a maintenance run.\"\n\nHe said maintenance runs ensured equipment and trucks were fully operational and ready for use in an emergency situation.\n\nLeadership skills\n\nMr Adams, who joined the RFS when he was 21, said the benefits went far beyond a feeling of contributing to his community.\n\n\"I've learned how to be a leader in the RFS, which has helped me in my full-time job onto a path into a leadership role,\" he said.\n\n\"The technology we have now is incredible.\n\n\"As a young member, it's easier for us to learn it.\"\n\nRFS volunteers sit in at the young members forum in Dubbo this year. (ABC Western Plains: Lily Plass)",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/when-you-re-the-nrl-s-ugly-ducklings-you-should-use-it-to-your-advantage-20250918-p5mw2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When you’re the NRL’s ugly ducklings, you should use it to your advantage",
    "publish_date": "Fri, 19 Sep 2025 11:53:17 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "This weekend’s NRL semi-finals - Canberra hosting Cronulla on the Saturday and Canterbury and Penrith a day later - is rugby league’s great case study of the haves and have-nots.\n\nBetween them, the Bulldogs and Panthers boast truckloads of juniors, star power, premierships, and poker machines to make all of the above happen.\n\nThose genuine NRL powerhouses have worked for and earned everything they have.\n\nHistorically, the Raiders and Sharks have done the same with far less, and with a chip on their shoulder.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/companies/murdoch-s-banquet-with-trump-hints-at-lachlan-s-precarious-crown-20250915-p5mv3r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Murdoch’s banquet with Trump hints at Lachlan’s precarious crown",
    "publish_date": "Fri, 19 Sep 2025 11:51:22 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Despite Rupert Murdoch’s apparent disdain for the establishment, his presence at US President Donald Trump’s state banquet this week was hardly his first dinner at the British monarch’s palace.\n\nBut it may not be a coincidence that his first public appearance in Trump’s orbit since a legal brawl erupted between them comes barely a week after securing control of his empire for son Lachlan.\n\nLachlan Murdoch’s grip on the family empire may not be as tight as it looks. Credit: Nytns\n\nCorporate documents released on Monday revealed for the first time the price Rupert and Lachlan paid to secure control of the business via the new web of family trusts they control. The youngest siblings, Chloe and Grace, remain passengers.\n\nIt is not just about the billions of dollars they had to pay to the rebels, Elisabeth, Prudence and James. The problem is how Lachlan was forced to fund their exit with share sales and financing that weakens his grip on both Fox and News Corp.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/corporate-cop-joe-longo-to-step-down-as-asic-chair-20250919-p5mwdq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Corporate cop Joe Longo to step down as ASIC chair",
    "publish_date": "Fri, 19 Sep 2025 11:42:12 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Australia’s corporate watchdog Joe Longo will step down after a term in which the regulator has turned up the heat on the country’s superannuation giants over their treatment of customers, while also maintaining pressure on banks over consumer protection.\n\nThe chair of the Australian Securities and Investments Commission (ASIC), who turned 66 on Thursday, announced on Friday he would leave the watchdog when his current five-year term ends in May next year.\n\nASIC chair Joe Longo appearing before a parliamentary joint committee this week. Credit: Alex Ellinghausen\n\nLongo will leave the watchdog after a period in which it has increased the number of new civil cases by a fifth, and taken on more investigations, while launching landmark cases against super fund giants including AustralianSuper and Cbus.\n\nIn those cases, ASIC took the super giants to court over their handling of death benefit claims, and the action was part of a wider push for the superannuation sector to lift its game in its customer service.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-scientists-criticise-new-2035-climate-target-trump-unveils-military-plans-to-counter-china-20250919-p5mwb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Scientists criticise new 2035 climate target; Trump unveils military plans to counter China",
    "publish_date": "Fri, 19 Sep 2025 11:41:02 +1000",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "The largest ABC affiliate in the US has asked Jimmy Kimmel to apologise and make a donation to Charlie Kirk’s family and political organisation before they will consider putting his show back on air.\n\nABC’s decision to take Kimmel off-air came after remarks the host made about the killing of conservative activist Charlie Kirk.\n\nTrump supported the decision, saying on Thursday that the comedian was “not a talented person” who “had very bad ratings”.\n\nDonald Trump on Jimmy Kimmel’s ABC show in 2015 while he was running to be the Republican candidate for president. Credit: AP\n\nSinclair Broadcast Group, which owns a number of local ABC channels, was one of two groups that said it would pull Kimmel’s show from its channels before ABC announced its suspension yesterday. A Sinclair statement said the suspension is “not enough”.\n\nTo reinstate the show, Sinclair says it needs to have discussions with ABC “regarding the network’s commitment to professionalism and accountability”.\n\nIt’s also asking Kimmel himself to “make a meaningful personal donation to the Kirk Family and Turning Point USA”.\n\nWith BBC",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/can-the-raiders-find-redemption-nrl-tips-finals-week-2-20250919-p5mwej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can the Raiders find REDEMPTION? NRL Tips - Finals Week 2",
    "publish_date": "Fri, 19 Sep 2025 11:36:08 +1000",
    "category": "sports",
    "authors": [],
    "text": "Can the Raiders find REDEMPTION? NRL Tips - Finals Week 2\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/lifestyle/nsw-farmer-pulls-off-proposal-like-no-other-20250919-p5mwei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW farmer pulls off ‘proposal like no other’",
    "publish_date": "Fri, 19 Sep 2025 11:32:58 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "NSW farmer pulls off ‘proposal like no other’\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/the-wiggles-caught-up-in-ugly-courtroom-battle-20250917-p5mvon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Wiggles caught up in ugly courtroom battle",
    "publish_date": "Fri, 19 Sep 2025 11:31:03 +1000",
    "category": "finance",
    "authors": [
      "Michaela Whitbourn"
    ],
    "text": "Children’s entertainment group The Wiggles is defending an explosive lawsuit filed against it by the company’s former chief executive, who claims he was sacked after complaining about spending and hiring decisions by one of the group’s founding members.\n\nLuke O’Neill, the first chief executive of The Wiggles, is suing the company and one of the group’s founders, “Blue Wiggle” Anthony Field, after his employment was terminated in May.\n\nLucia and Anthony Field, the Blue Wiggles, in the Big Red Car.\n\nThe Federal Court feud has exposed the breakdown in the relationship between O’Neill and Field, the sole remaining member of the Wiggles’ original lineup and a director of The Wiggles Holdings Pty Limited. O’Neill claims he complained about Field making financial decisions benefiting family members.\n\nIn a written defence filed on Thursday and released by the court on Friday, the company said vast tracts of O’Neill’s claim were liable to be struck out.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/afl/this-magpie-went-viral-before-even-playing-a-game-she-had-no-idea-20250916-p5mvjh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Magpie went viral before even playing a game. She had no idea",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ash Centra had no idea she’d gone viral. The 19-year-old Collingwood rookie woke up the day after her debut game against Carlton at Ikon Park in August and redownloaded Instagram, an app she ritualistically deletes before games to block out external noise and clear her mind. Collingwood’s Ash Centra Credit: Joe Armao Her inbox was jam-packed with an infinite number of hashtags, reels and messages from family, friends and complete strangers. Centra took a mark and booted her first major in the clash, but the most talked about moment was an innocuous move she made during a warm-up. While jogging, the rookie threaded the ball behind her back and bounced it between her legs – an impressive manoeuvre that would have impressed on a basketball court, but bamboozled with a Sherrin. “I saw that people were tagging me in all these videos of the bounce, I was just like, this is ridiculous. Like, this cannot be happening,” Centra told this masthead.\n\nAdvertisement\n\nWithin days, nearly everyone was attempting the bounce, including Hawthorn coach Sam Mitchell and Collingwood’s Nick Daicos, Jack Crisp and Darcy Cameron. So where did the move come from? “I think it’s been something I’ve aimed to master for a while,” she said. “Now, I can’t really remember the exact moment when I started, but I think it’s just a fun little thing to do during training or even during the warm-up. I think I was just lucky to be getting filmed whilst doing it, because it’s definitely helped with all the hype.” Like all No.1 draft picks, Centra entered the league with significant noise. A product of the AFLW’s first national draft class, Centra was a star midfielder for Gippsland Power and was named the Coates Talent League’s best and fairest in 2024. After her debut game, Collingwood coach Sam Wright quipped Centra had already developed a cult following, noting the gigantic cheer when she finally came off the bench to play. “Looking back and reflecting, it was definitely probably the biggest highlight of my night, hearing that roar,” she said.\n\nAdvertisement\n\nFamily and friends from Centra’s hometown Seaspray – a small coastal town in Gippsland – had made the three-hour trek to see her debut in Melbourne, including her twin brother Luca. Centra credits her brother for her love of footy. The twins grew up playing junior footy together and their competitive natures meant they pushed each other to be the best. Luca was in the stands cheering during Centra’s debut, but accidentally missed a rather pivotal moment. “Dad came up to me after the game and said my brother was in the bathroom while I was having a set shot on goal, and unfortunately, he missed it, but my mum filmed it so he got to see afterwards,” she laughed. Since that debut game, Centra has continued to impress, collecting a Rising Star nomination for her role in Collingwood’s shock 26-point victory over the formerly undefeated Swans last week. Centra picked up a Rising Star nomination for her efforts in the round five clash with Sydney. Credit: Joe Armao Centra is full of praise for the team’s new captain Ruby Schleicher, describing the dual All-Australian as the perfect leader who strikes the balance between having fun and being professional.\n\nAdvertisement\n\n“I say this in a humble way, there’s obviously a lot of attention on the first couple of picks in the draft, because you’re expected to go out there and obviously try and change the game in some aspects,” Centra said. “Ruby’s been a massive mentor for me. She’s guided me, and she’s just super inclusive and super approachable when I need help, not only on the field but off the field as well.” Last week Schleicher told this masthead rookies and top draft picks such as Centra were coming into AFLW with more pressure and noise than ever. “So within the four walls and as a leader, it’s probably just my job to try and release that pressure and let them know that we don’t need them to go out have 30 disposals and change the game,” Schleicher said. “We just want to see them grow as players and enjoy their football.” Centra models her game off Richmond best-and-fairest winner Monique Conti, adhering to a silky and versatile style of footy. However, the physical nature of AFLW has been a surprising adjustment. “I came in on the first day of pre-season, and Britt Bonnici tackled me, and I was so taken back and shocked [by] how hard they hit,” she said.\n\nAdvertisement\n\nLoading “But I think it really helps you understand where you’re at and it helps you build that level of physicality. And I also think the speed of the game is so much different to what I’m used to, but it’s been a great challenge.” Centra is also adjusting to the recent move to Melbourne and is currently living with family friends. The 19-year-old was born metres from the beach and misses swimming in the ocean, joking Melbourne’s city beaches aren’t quite the same. “It’s been a lot different to what I’m used to. I know country life and city life are polar opposites ... so it’s been an adjustment,” she said “In Seaspray there’s only like 300 residents, so everything’s slow,” she continued. “Nothing’s really happening. We’ve got one coffee shop, and then you come to Melbourne and there’s like, 50 coffee shops metres from your house.” Centra was looking forward to taking on Hawthorn at Victoria Park on Saturday in front of her family and friends, including her brother. “He’s coming this weekend, so hopefully I’ll kick him a goal that he’ll see,” she joked.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/victoria/mokbel-s-naked-ambition-how-a-drug-kingpin-sought-to-expose-an-undercover-cop-20250917-p5mvue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mokbel’s naked ambition: How a drug kingpin sought to expose an undercover cop",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "John Silvester"
    ],
    "text": "The AFP conviction was later quashed due to Nicola’s nefarious needling. While the Commonwealth prosecutors felt they had enough for a retrial, they decided to let it go because he had done his time. Mokbel pleaded guilty to Quills, Orbital and Magnum. The remaining charges were dropped. For Tony, it was the best deal since Aldi sold snow ploughs for $99. It is entirely possible justices Stephen McLeish, Maree Kennedy and Stephen Kaye will decide that the Quills and Orbital convictions should be flushed down the toilet. Which brings us back to the toilet at the Box Hill restaurant and the naked face-off (although they weren’t exactly facing off).\n\nThe chubby chap, built more like Billy Bunter than Billy the Kid, was Tony Mokbel’s right-hand man, Bart Rizzo, and the second man was “Andy Hossack”, an undercover police officer. Artist sketch of Bart Rizzo in court. Rizzo was understandably self-conscious. Much later at his criminal court plea hearing, his lawyers would say he had battled weight problems since he was a child. Sad, but hardly mitigation as I have yet to see any criminological research linking the consumption of Mars bars with the production of methamphetamine. “Andy” had infiltrated the Mokbel syndicate, introduced by a trusted insider who was secretly working for the police. The insider, a musician, became Registered Human Source 3030. The musician was a great mate of Rizzo but a million-dollar reward on Tony’s toupee-covered scalp persuaded him to work for the police.\n\n“Andy’s” cover story was that he worked at a university and could steal large glass reactors that Mokbel’s team needed to produce speed. It was late May 2007 when Andy first connected with the Mokbel syndicate, known as The Company. Rizzo was chief financial officer for The Company. He kept the books, chased the money and resolved the problems. His fellow executive was Joe Mansour, the operations manager. They had been firm friends since they were private school classmates. As Justice Betty King would later observe when sentencing Rizzo: “You and other company members ran ‘The Company’ as if it were a legitimate business.” While Mokbel was a self-taught and quite brilliant businessman, Rizzo embarked on a Swinburne University business management course, dropping out in the final year – no doubt because there wasn’t a unit on money laundering.\n\nRizzo provided a list of glassware and “Andy” produced two consignments for $7300 cash from the Mokbel coffers. Loading But “Andy” was not masquerading just as an opportunistic thief but also as a drug dealer looking for a product that Rizzo could provide. Trouble was, The Company had lost its two best speed cooks (three if you include Tony, who was pretty good on the tools). For years, Mokbel produced the best gear going about, but something had gone wrong. Customers were complaining about the smell of the latest batch, and some had been hospitalised.\n\nRizzo spoke to Mokbel (it was one of 14 calls police recorded between the two), who was hiding in Athens. The problem was that they couldn’t withdraw the drugs as they needed the money. Around the same time, phone taps showed Rizzo was about to pick up cash hidden in a Collingwood storage depot. He was pulled over in Box Hill – in his car was $499,950 in cash wrapped in gift paper. A few days after police seized the money, the musician and Rizzo met in a Box Hill hotel room to package drugs for distribution. But the cook had gone bad, and so they contacted Mokbel for instructions. Mokbel ordered them to move the product quickly at a discount. The cook said he could do a better job by using a 20-litre reaction vessel. These bugged calls gave police the chance to introduce “Andy”.\n\nOver six days, “Andy” made three buys totalling 1.1 kilos of speed for $114,000. Police testing showed what Tony feared: it was complete crap. In a usual job, the undercover – to keep his credibility – would return the drugs and demand his money back, but this was not a usual job. Time was running out. Two detectives, one from Purana and the second from the federal police, were flying to Athens to find and arrest Mokbel. Not that Tony knew that, although he was starting to smell a rat. Mokbel asked his Melbourne executives: who was this “Andy”, and why should we trust him? What if he was an undercover cop? Mokbel wanted “Andy” followed, and then had a second plan: get him naked.\n\nYou need “Andy” to get his kit off, to check he wasn’t wearing a recording device. And, as a matter of trust, Rizzo needed to strip off to show, he too, was not recording. While Rizzo was relaxed about drug matters, male nudity was something else. Unlike the mobsters in movies, he was not a steam room sort of guy. At the Box Hill restaurant, Rizzo was sweating and anxious. He then asked “Andy” to adjourn to the uncomfortably small restroom. Rizzo went in first, turned around, and without a word, unbuttoned his shirt and dropped his trousers. This would have surprised “Andy” if he had not been forewarned from the phone taps. After pausing to let Rizzo sweat a little more, “Andy” removed his shirt and dropped his trousers. He then spun around and bent over to show there was no tiny listening device where the sun doesn’t shine.\n\nHaving followed his boss’s orders, Rizzo quickly dressed and returned to the table (washing his hands first). Later in a conversation recorded in “Andy’s” car while they were doing a drug deal, Rizzo bragged about his romantic encounters with the opposite sex, as if to assure his newfound friend that a naked encounter in a toilet with another man was strictly business. Within days, the trap was set. On June 5, 2007, Mokbel was arrested in a restaurant in Athens (carrying 3030’s doctored passport). As soon as the arrest was confirmed, police raided 22 properties in Melbourne, seizing drugs, guns, $790,000 in cash, rubber gloves, chemical equipment and an orange A4 exercise book that contained drug recipes. Tony Mokbel is escorted by plain clothes police officers after appearing before a public prosecutor at Athens Appeals Court building in June 2007. Credit: AP At Rizzo’s house, police found details of $400,000 in transfers to Mokbel in Greece, plus the golden thread: a spreadsheet documenting incomings and outgoings, and a list of drug quantities from July 2006 to June 2007. Court records show: “The document establishes that this group has been responsible for the production of approximately 42 kilos of amphetamine since July 2006, which generated an income for the group of approximately $4.2 million.”\n\nIn sentencing Rizzo to a minimum of 13 years, King said: “You with other members of the company monitored the quality of those drugs; stored the drugs until sold; cut and repackaged the drugs; marketed the drugs; and, through you, kept a book of account on The Company’s customers and monies flowing in and out.” In sentencing Mokbel over Operation Magnum, Justice Simon Whelan made it clear Rizzo’s accounting records and the phone taps were unshakeable evidence. “The telephone intercepts reveal two noteworthy matters in this regard,” he said. “First, you conducted yourself as a manager. You delegated. You gave advice. You encouraged co-operation. You sought to maintain morale. “I have given very serious consideration to imposing a life sentence on the Magnum offence. Your commission of that offence revealed, in my view, arrogant contempt for the law, and an incorrigible determination to persist in serious, business-like drug trafficking regardless of the circumstances or possible consequence.” Mokbel was sentenced to 20 years for Magnum.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/nsw/tricky-situation-sydney-commuter-car-park-to-be-deep-cleaned-after-homeless-evicted-20250917-p5mvx7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Tricky situation’: Sydney commuter car park to be deep cleaned after homeless evicted",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Anthony Segaert"
    ],
    "text": "The state government has ordered a deep clean of a busy commuter car park in Sydney’s southwest after months of increasing community concern about an encampment of homeless people living in the building.\n\nThe top three floors of the Warwick Farm commuter car park, which allows drivers to park for free before catching a train at the station next door, have become a no-go zone for drivers over the past three months as an increasing number of people have lived in the stairwells and upper storeys.\n\nRubbish strewn in front of the lifts and stairwell at Warwick Farm Commuter Car Park. Credit: Wolter Peeters\n\nBut residents have raised concerns about safety after not being able to access the fire escapes and witnessing drug use. All three stairwells in the building are covered in syringes, faeces and rotting food scraps, as well as mattresses, blankets and pieces of furniture. On parking levels, microwaves have been ripped apart and strewn across the floor, as well as hoses from fire hydrants.\n\n“It is a really tricky situation,” said Charishma Kaliyanda, the state Labor MP for the area, who has been fielding concerns from residents about increasingly aggressive behaviour from about 10 to 12 people living in the stairwells.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/why-this-inner-west-neighbourhood-gem-is-among-victoria-s-finest-places-to-dine-20250917-p5mvrv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why this inner-west neighbourhood gem is among Victoria’s finest places to dine",
    "publish_date": "Fri, 19 Sep 2025 11:29:33 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Advertisement\n\nReview Eating outYarraville Why this inner-west neighbourhood gem is among Victoria’s finest places to dine When Navi launched in a discrete shopfront in 2018, the feeling was “Welcome to my home”. The warmth persists, as does a surprising and fun tasting menu from former The Age Good Food Guide Chef of the Year, Julian Hills. Dani Valent September 19, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 8 Navi’s sleek, gallery-like space includes seats that face the open kitchen (left). Bonnie Savage 2 / 8 Suckling pig with chestnut and quince. Bonnie Savage 3 / 8 Beetroot with hazelnut and truffle. Bonnie Savage 4 / 8 Murray cod with fermented potato. Bonnie Savage 5 / 8 An internal archway separates Navi’s dining room (pictured) from its lounge bar. Bonnie Savage 6 / 8 “Elements of Aylesbury duck” is a signature dish, although the preparations change. Bonnie Savage 7 / 8 Finger lime ice-cream with black sesame meringue. Bonnie Savage 8 / 8 Navi owner and chef Julian Hills. Ed Sloane Previous Slide Next Slide Good Food hat Good Food hat 17 / 20 How we score Contemporary$$$$ If every neighbourhood needs a good baker, butcher and cafe, perhaps it also needs a perfect little fine-dining restaurant. Seven years in, Navi is just that. Since 2018, chef Julian Hills has taken diners on culinary adventures in a 30-seat dining room in a quiet inner-west pocket. The room – now with adjoining lounge bar – feels like a gallery, sparse and sleek, ready to showcase beauty and provoke amazement and delight over eight or so small courses. There’s a trend in contemporary dining towards simplicity, so let’s ask a tricky question: is there a point to expensive restaurants with complex food, hefty wine lists and waiters that can tell you which side of the hill the grapes grew on?\n\nAdvertisement\n\nIt’s all very well for a chef to work out that pickled magnolia flowers and raw fish taste nice together, but is there a pay-off for diners? Well, yes, when it’s as fun and surprising as Navi. Of course, a meal like this is an investment – but so is a ticket to the grand final. Navi is a restaurant that might make a jaded diner fall back in love with tasting menus, and it’s a welcoming entryway for people who’ve never eaten like this. Murray cod with fermented potato. Bonnie Savage A tasting menu (with, potentially, matched drinks, too) makes frequent interaction with waiters inevitable, but the polished, perceptive team here dances a delicate line between informing and interrupting. If you’re geeking out about the non-alcoholic beetroot “wine” with carrot and betel leaf, they’ll hang about to discuss it. If you’re screwing up the courage to propose to your one and only, they’ll just melt away.\n\nAdvertisement\n\nA meal like this is an investment – but so is a ticket to the grand final. Last time I visited, Hills was on a rare trip overseas. That might seem like a bad thing. Actually, it was an opportunity to witness the playful spirit he’s shared with his crew. Whether Hills is here or not, this is his singular vision. A creative guy who was studying ceramics when he fell into cooking at the Myer cafeteria in the 1990s, Hills realised he had a knack for flavour matches when the blue-rinse set started lining up for his roasts. “My brain is very busy,” the self-taught chef tells me later. “I can taste everything in my head before I put it on a plate.” He’s inspired by what’s growing – either in his own patch, on the farms of trusted suppliers or in secret foraging spots – and by the house-made preserves burbling away out the back. “Elements of Aylesbury duck” is a signature medley, although the preparations change. Bonnie Savage\n\nAdvertisement\n\nThe arrival snack is a black garlic macaron filled with salmon caviar, the only dish always on the menu and a pointer to the so-crazy-it-works approach. That might be followed by a tiny sourdough tart filled with sea urchin and gleaming apple-and-yuzu jelly. There’ll be a vegetable investigation: I had golden beetroot variously dried, fermented, pickled and roasted, a chewy, crunchy, earthy assembly that’s a rollercoaster for the taste buds. There’s always adroitly cooked duck breast served with other cleverly prepared parts – perhaps koji-brined duck heart, melting pancetta or kofte with liver, a signature medley expressing both consistency and perpetual curiosity, which resolves in pure enjoyment. Finger lime ice-cream with black sesame meringue. Bonnie Savage Dessert is based around a fermented finger lime ice-cream, sour and caramelised, briskly whipping around the palate.\n\nAdvertisement\n\nWhen Navi launched in 2018, the feeling was “Welcome to my home”. The warmth persists as the restaurant has grown into itself: more structure and breadth has allowed greater ambition, assuring this neighbourhood gem is among Victoria’s finest places to dine. The low-down Atmosphere: Fun fine-dining Go-to dishes: Black garlic and salmon roe macaron; elements of duck; finger lime ice-cream with black sesame meringue Drinks: The drinks are as adventurous as the food with wines from Slovenia, Portugal and Hungary dotted among the splendid selection. There’s also one of the best and most comprehensive non-alcoholic offerings in the state, with everything from bush tea to fermented concoctions. Cost: $195 set menu per person ($115 for lunch), excluding drinks This review was originally published in Good Weekend magazine Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-finals-2025-everything-you-need-to-know-20250917-p5mvpi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NRL finals 2025: Everything you need to know",
    "publish_date": "Fri, 19 Sep 2025 11:27:38 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder",
      "Frances Howe"
    ],
    "text": "Meanwhile, the Raiders suffered a crushing defeat to the Broncos on Sunday afternoon in a 94-minute, 29-28 golden point thriller after an inspired performance from Reece Walsh helped Brisbane come back from two sin-bins and a 16-point deficit to claim victory. How does the NRL final series work Who’s playing who in week two? Brisbane and Melbourne have a week to put their feet up after winning their qualifying finals in week one.\n\nFor the remaining four teams – Sharks, Raiders, Panthers and Bulldogs – it’s time to do battle. First up, it’s the Raiders hosting the Sharks at 7.50pm on Saturday at GIO Stadium in Canberra in a must-win elimination semi-final. The winner will head to AAMI Park in Melbourne next week to play the Storm at 7.50pm, while the loser will just have to try their luck next year. Then, on Sunday at 4.05pm, it’s Penrith against the Bulldogs at Accor Stadium, in an elimination match that is expected to draw a crowd upwards of 70,000. Penrith are hunting their fifth consecutive premiership. If they manage to do it, they’ll be the first in NRL history to win a grand-final from outside the top four.\n\nThe winner of that match has the tough task of heading to Brisbane the next week to face the Broncos at Suncorp Stadium at 4.05pm in the preliminary final. NRLW captains Georgia Hale, Tiana Penitani-Gray, Yasmin Clydsdale, Kirra Dibb, Ali Brigginshaw and Isabelle Kelly. Credit: Flavio Brancaleone Meanwhile, the NRLW is in its first week of finals. The Roosters – who were undefeated this season – and the Broncos – whose only loss of the year was to the Roosters – have the week off after finishing one and two on the NRLW ladder. This week the Knights host the Titans in the first of the NRLW elimination finals, before the Cowboys face the Sharks in Townsville. This is the first year the Cowboys have played in the finals since they entered the NRLW in 2023.\n\nThe winner of the game in Newcastle will play the Broncos in the preliminary finals in Brisbane, while the winner of Townsville’s game will face the Roosters in Sydney. What date is the NRL grand final 2025? The NRL grand final will be held on Sunday, October 5, at Accor Stadium in Sydney. Public transport is free with any game ticket and additional trains and buses will be operating to get fans out to Olympic Park. A flat rate fee of $35 applies to all parking but must be pre-booked on the Sydney Olympic Park website.\n\nWhat time is the NRL grand final 2025 kick-off? Gates will open from 1pm with the state championship kicking off at 1.20pm, followed by the NRLW grand final kicking off at 3:55pm. The pre-game entertainment for the NRL grand final starts at 6.30pm and kick off is slated for 7.30pm with full-time expected to come to 9.20pm. Who are the favourites? Bookmakers have the Melbourne Storm as favourites for the 2025 premiership, with Sportsbet paying $3.10 for them to lift the trophy.\n\nUnfortunately for the Bulldogs, they’re the least likely to win the title according to the bookies who are paying $23 for the Belmore club to claim the title. Meanwhile, it’s the Storm and Broncos who are the frontrunners to make the grand final, ahead of Penrith, Canberra, Cronulla and Canterbury. Who is Teddy Swims, the grand final entertainment? While the AFL has locked in Snoop Dogg for their grand final this month, Grammy nominated singer-songwriter Teddy Swims is travelling from the US to perform at the NRL grand final. Swims was nominated for Best New Artist at this year’s Grammy Awards and his most popular song, Lose Control, has two billion streams on Spotify.\n\nLoading How to watch the NRL grand final 2025? Every NRL and NRLW finals series match will be free on Channel 9 and 9NOW, while also broadcast on Fox League, Kayo Sports, Sky NZ and Watch NRL. The grand final is exclusively live on Channel 9, with delayed coverage on Fox League and Kayo. There are still tickets available for the grand final ranging from $74 to $739 on Ticketek. NRL is Live and Free on Channel 9 & 9Now",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/national/woman-believed-missing-after-sydney-house-fire-20250919-p5mweg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman believed missing after Sydney house fire",
    "publish_date": "Fri, 19 Sep 2025 11:27:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Woman believed missing after Sydney house fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/suspicious-fire-engulfs-old-jam-factory-in-melbournes-east-20250919-p5mwef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Suspicious' fire engulfs old jam factory in Melbourne's east",
    "publish_date": "Fri, 19 Sep 2025 11:27:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Suspicious' fire engulfs old jam factory in Melbourne's east\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/first-look-karen-martini-s-new-restaurant-is-a-fresh-start-for-an-italian-fave-and-for-her-20250918-p5mw5n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First look: Karen Martini’s new restaurant is a fresh start for an Italian fave (and for her)",
    "publish_date": "Fri, 19 Sep 2025 11:17:27 +1000",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Advertisement\n\nExclusive Eating outJust open First look: Karen Martini’s new restaurant is a fresh start for an Italian fave (and for her) The household name has taken the reins of Bar Carolina, retaining the South Yarra diner’s Italian identity but making it her own with big flavours and a big menu. Tomas Telegramma September 19, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nCelebrated chef Karen Martini is back in the restaurant game. She’s the new owner and executive chef of South Yarra’s Bar Carolina, taking over the eight-year-old Italian diner from founder Joe Mammone and reopening it after just a week’s hiatus. Martini has gone independent for her latest venture alongside husband Michael Sapountsis, following the untimely closure of her two most recent restaurants. Chef Karen Martini is on the pans at Bar Carolina, which she recently took over alongside husband Michael Sapountsis. Eddie Jim St Kilda’s hatted Saint George, where Martini was culinary director, shut for last year’s Christmas break and never reopened, with problem-plagued operator Public Hospitality group unable to guarantee its future, she says. Her hatted Federation Square restaurant Hero closed suddenly in 2023 after an eviction by state government-run film museum ACMI. “We feel [Bar Carolina] is very different,” says Martini. “It’s a breath of fresh air.”\n\nAdvertisement\n\nShe hopes it marks a return to the “great stability” of her previous venues Melbourne Wine Room and Mr Wolf, both of which clocked more than 15 years in St Kilda. 1 / 9 Outside Bar Carolina on Toorak Road. Eddie Jim 2 / 9 Olives, fefferoni, hand-rolled grissini and parmigiano reggiano fonduta. Eddie Jim 3 / 9 Cotoleta Milanese (fried crumbed veal). Eddie Jim 4 / 9 Bar Carolina has reopened after just a week hiatus. Eddie Jim 5 / 9 Cappelletti erbetto pasta with stracciatella, ricotta, greens, pecorino, brown butter and hazelnuts. Eddie Jim 6 / 9 Roast Bannockburn chicken with herbs and mushroom jus. Eddie Jim 7 / 9 Pizza soffio with mozzarella di bufala, chilli and burnt honey. Eddie Jim 8 / 9 Martini’s tiramisu. Eddie Jim 9 / 9 Martini and husband Michael Sapountsis have taken over South Yarra’s Bar Carolina. Chege Mbuthi Previous Slide Next Slide As a longtime fan of Bar Carolina and friend of Mammone, Martini jumped at the opportunity when talk of menu consultancy morphed into a passing of the baton. “We want it to be a great local restaurant, but also a destination restaurant,” says Martini. “It’s a real jewel of a spot at the top end of Toorak Road.” The core of designer Chris Connell’s original fit-out remains, from two-tone charcoal-and-white walls to terrazzo floors, with new linens and florals adding softness.\n\nAdvertisement\n\nBut Martini has rejigged the kitchen so she can more seamlessly make her mark on the menu, while also carrying on the legacy of Bar Carolina (including keeping the name). “We had to cross our hearts and hope to die [that we’d do] Italian,” says Martini. Related Article Exclusive A ‘mini-pub’ with dad rock and meat raffles opens in a legendary St Kilda site Her offering traverses Italy’s north and south, a moveable feast driven by seasonality that covers all bases from aperitivo hour to long lunching. It starts with cicchetti, small Venetian-style snacks that could be fried, stuffed olives all’ascolana or hand-rolled grissini to swipe through parmigiano reggiano fonduta like a cheesy dip.\n\nAdvertisement\n\nThen comes the antipasti. Confit artichokes are filled with finely minced prawn. Eye-fillet carpaccio has a steak tartare-esque dressing inspired by Venice icon Harry’s Bar. And deep-fried pizza fritta is topped with mozzarella, burnt honey and fermented chilli. Pizza soffio with mozzarella di bufala, chilli and burnt honey. Eddie Jim Housemade pasta is a given. “Already we can’t keep up with [the blue swimmer crab tagliarini orders],” says Martini. Four-cheese cappelletti, ring-shaped pasta parcels, are served on a verdant, herb-packed paste along with sage, brown butter and hazelnuts. Bannockburn chicken is browned in its own fat, with the seasonal add-on of morel mushrooms; O’Connor rib-eye is Josper-fired and sea-salt-crusted; and veal cotaletta is served bone-in for extra flavour. Related Article ‘Extremely frustrated’: Karen Martini and Guy Grossi’s pub restaurants facing uncertainty\n\nAdvertisement\n\nThe wine list spotlights big, bold Italian reds such as barolo and barbaresco, plus verdicchio, a lively Italian white that Martini hopes will get “people to go beyond chardonnay”. Drinks will soon start flowing upstairs when Martini reopens rooftop bar Tetto di Carolina just in time for summer, with a fresh rotation of cocktails and snacks. Lunch and dinner, Tuesday to Sunday 44 Toorak Road, South Yarra, instagram.com/barcarolina_sthyarra\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/trumps-new-warning-to-us-broadcasters-amid-mounting-criticism-over-kimmel-suspension/ifnvfceto",
    "title": "Trump's new warning to TV networks as criticism over Kimmel suspension mounts",
    "publish_date": "Fri, 19 Sep 2025 01:45:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump has celebrated the suspension of talk-show host Jimmy Kimmel from the airwaves and said TV broadcasters should lose their licences over negative coverage of his administration, adding fuel to a debate over free speech.\n\n\n\n\n\nEarlier this week, US broadcaster ABC announced it was pulling the late-night comedy show Jimmy Kimmel Live \"indefinitely\" following Kimmel's comments after the killing of right-wing commentator Charlie Kirk.\n\n\n\n\n\nDuring his trip to the United Kingdom, Trump said Kimmel had been punished for saying \"a horrible thing\" about Kirk.\n\n\n\n\n\nSpeaking to reporters aboard Air Force One as he returned to the US, Trump complained about receiving bad publicity from broadcasters, saying: \"That's something that should be talked about for licensing... All they do is hit Trump.\"\n\n\n\n\n\n\"I would think maybe their license should be taken away,\" Trump said. \"It will be up to [Federal Communications Commission chief] Brendan Carr.\"\n\n\n\nUS federal law prohibits the Federal Communications Commission (FCC) from revoking a broadcaster's licence for negative coverage or other speech disliked by the government.\n\n\n\nNot 'the last shoe to drop', says US federal broadcasting chief\n\nBrendan Carr, the head of the FCC, which regulates broadcasters, said Kimmel's axing was part of a \"massive shift\" taking place in US media.\n\n\n\n\n\n\"I don't think this is the last shoe to drop. This is a massive shift that's taking place in the media ecosystem. The consequences will continue to flow,\" Carr said in an interview with Fox News.\n\n\n\n\n\nHe praised the owners of local TV stations that broadcast ABC programming for putting the network's owner, Disney, under pressure to take Kimmel off the air.\n\n\n\n\n\n\"We're going to go back to that era when local TV stations, judging the public interest, get to decide what the American people think,\" Carr said.\n\n\n\n\n\n\"The key point is these were local TV stations, licensed by the FCC, that have a public interest obligation to serve their local community; they pushed back on Disney.\"\n\n\n\nCarr said the federal regulator would be \"constraining the power\" of large media networks, singling out Disney and Comcast. But in reality, the FCC does not regulate programming on national networks such as ABC, CBS, NBC and Fox — its authority lies in issuing licences to local broadcast affiliates that use the public airwaves.\n\n\n\n\n\nComcast, which owns NBC, hosts other late-night programs, including The Tonight Show Starring Jimmy Fallon and Late Night with Seth Meyers, both of whom Trump called \"total losers\" in a Truth Social post, calling for their cancellation.\n\n\n\n\n\n\"Great News for America: The ratings challenged Jimmy Kimmel Show is CANCELLED. Congratulations to ABC for finally having the courage to do what had to be done,\" Trump wrote on Truth Social.\n\n\n\n\n\n\"That leaves Jimmy and Seth, two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!!\"\n\n\n\nTrump administration 'silencing its critics'\n\nWalt Disney-owned ABC said it was pulling the show after Kimmel's comments that conservatives were using Kirk's killing to score political points.\n\n\n\n\n\nFormer US president Barack Obama urged media companies not to capitulate to government coercion.\n\n\n\n\n\n\"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like,\" Obama said in a statement.\n\n\n\nWriters' and actors' labour unions called the targeting of Kimmel an unconstitutional attack on the right to disagree. The American Civil Liberties Union called it an unconstitutional attempt by the Trump administration to \"silence its critics and control what the American people watch and read\".\n\n\n\n\n\nThe longest-serving talk show host in the US, David Letterman, also condemned Kimmel's suspension and said ABC was \"trying to suck up to an authoritarian criminal administration\".\n\n\n\n\n\nKimmel is set to meet with Walt Disney executives to discuss the show's future, according to Bloomberg News. The parties will discuss whether there is a way to return \"Jimmy Kimmel Live\" to the air, the report said.\n\n\n\n\n\n— Additional reporting by Reuters\n\n\n\n",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sydneys-army-of-olympic-volunteers-mark-25-years/gv0veefu1",
    "title": "Sydney's army of Olympic volunteers mark 25 years",
    "publish_date": "Thu, 18 Sep 2025 22:01:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAt a reunion lunch in Sydney, pioneer volunteers of the city's 2000 Olympics are taking a trip down memory lane.\n\n\n\n\n\nIt's been more than 25 years since they took part in the games.\n\n\n\n\n\nBut for them, the friendships they forged are ever-present.\n\n\n\n\n\n\"What we had going was too good to let go of.\"\n\n\n\n\"Yes, yes. And we formed friendships. We didn't know each other before 1992, but because of the games we formed these friendships.\"\n\n\n\n\"It was amazing. You could speak to anybody.\"\n\n\n\n\"Everyone was happy.\"\n\n\n\n\"Yes, weren't they?\"\n\n\n\n\"Whether you were on the train or the bus or walking the streets. Yeah, it was fantastic.\"\n\n\n\n\"It was very special.\"\n\n\n\n\n\nNearly 47,000 people ((46,967)) volunteered throughout the games, according to the Australian Olympic Committee.\n\n\n\n\n\nThe pioneer volunteers gave their time - not only during, but also in the lead up to the Olympics - some as early as 1992 ahead of Sydney's bid for the games.\n\n\n\n\n\nThough the group tries to meet every four months, for some this could be their last milestone reunion.\n\n\n\n\n\n\"Realistically, this is the last. Because when we get to 2030, the next milestone, everybody will be looking to Brisbane 2032. Sydney will be past history.\"\n\n\n\n\n\nThat's Rosemary Mula, a so-called, 'super-volunteer' who has been involved in multiple Olympic games.\n\n\n\n\n\nNow in her 80s ((84)) she dreamed of competing in the Olympics since she was a child.\n\n\n\n\n\n\"I say to kids in schools, I wasn't an Olympian. But I've had an Olympic journey.\"\n\n\n\n\n\nIn 1956, she reluctantly moved to Australia at age 15, trading countryside England for Melbourne.\n\n\n\n\n\n\"In those days it was a ship journey, six weeks, and you were never going to go home again. So, it was a major decision. And as a young teenager for me it was traumatic, because I was leaving my family, my school, my friends.\"\n\n\n\n\n\nA chance encounter at the city's 1956 games inspired her own Olympic journey.\n\n\n\n\n\n\"And my father was a foundry worker. I don't know how he got me a ticket, but he did and I was at the Melbourne Cricket Ground, which was the Olympic Stadium, and it was the day of the triple jump final.\"\n\n\n\n\n\nWith no Brits or Australians in the final, she cheered for the defending champion, Brazilian athlete Adhemar Ferreira da Silva, who ended up winning despite being considered too old to claim another gold medal.\n\n\n\n\n\n\"It's before the days when athletes were psychologically focused and all the modern techniques that are used... And he ran around and said, 'You kids helped to win this medal.' And that was me hooked for life. I wanted to be an Olympian, I wanted to march in an Opening Ceremony.\"\n\n\n\n\n\nBut in university, Rosemary realised she wouldn't make it as an Olympic hurdler.\n\n\n\n\n\nInstead, she became a teacher and later volunteered in the Sydney games.\n\n\n\n\n\n\"I lost some of my enthusiasm and then my appendix blew up. So I got out of training, then discovered boys and got a job and so forth, so. But my passion for the Olympic games never died. It was always there.\"\n\n\n\n\n\nYears later she recognised Da Silva in Singapore, telling him she witnessed him win the gold medal.\n\n\n\n\n\n\"He was so excited because again it was pre-television, pre-recording, and he said, 'You're the only person in my life that saw me win that medal.'\"\n\n\n\n\n\nThey kept in contact, with Da Silva later staying with her family during the Sydney games.\n\n\n\n\n\n\"I said to him, 'Adhemar, I was never an Olympian but I've had seven years of the most amazing Olympic journey as a volunteer, but my journey is over.' And he took my face in his hands and he said, 'Rosemary, your Olympic journey is not over. You must find a way.'\n\n\n\n\n\nRosemary went on to march in an Olympic Opening ceremony with Kiribati as their team attaché and has since volunteered all over the world.\n\n\n\n\n\n\"Don't let any adult - teacher, parent, family, friend - tell you you can't do something. If you want to write music, or write stories or be an actor or an athlete, you can. But it won't happen if you sit on your bottom. You have to get up and do something to make it happen.\"\n\n\n\n\n\nBack at the reunion lunch, pioneer volunteers mull over whether they'll help out with the Brisbane 2032 Olympics.\n\n\n\n\n\n\"We'll see. I asked a friend of mine who is much younger and I said, 'Should we do Brisbane?' And he said, 'I'll look for accommodation.' And I said, 'Make sure it's wheelchair accessible.' (Laughs).\"\n\n\n\n\n\nAnd from Rosemary Mula, this message:\n\n\n\n\n\n\"We had such an amazing reputation for being outstanding volunteers and other countries that have hosted the games use us as a benchmark.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-aussie-dollar-is-having-a-moment-but-its-not-all-good-news/n875p5dci",
    "title": "The Aussie dollar is having a moment. Here's what it means for you",
    "publish_date": "Thu, 18 Sep 2025 19:45:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A \"Goldilocks scenario\" has the Australian dollar on somewhat of a winning streak, experts say, particularly against the United States dollar.\n\n\n\n\n\nIt has reached a 10-month high against the US dollar this week, breaking 67 US cents for the first time since November 2024.\n\n\n\n\n\nIt slipped slightly following the United States Federal Reserve's rate cut announcement and the release of the Australian Bureau of Statistics' jobs data, which suggested the labour market could be cooling.\n\n\n\n\n\nChris Weston, the head of research at foreign exchange trader Pepperstone, told the SBS News' On the Money podcast this week that the Australian dollar was \"looking quite good on a relative basis\", particularly against the US dollar and New Zealand dollar\n\n\n\n\n\n\"The Aussie dollar has been performing very well on a broad basis as well,\" he said.\n\n\n\nLISTEN TO Australian dollar hits a 10 month high against the US SBS News 14:14 English\n\n\"And I think if you look at relative interest rates, relative growth, with a fairly low deficit compared to other countries, we're looking like a beacon of stability relatively speaking,\" Weston said.\n\n\n\n\n\nPrices for iron ore — Australia's most valuable exports — have been solid, he said, and \"absolutely ripping\" share markets in China — Australia's largest trading partner — had in part helped create a \"Goldilocks scenario for Australian dollar outperformance\".\n\n\n\nGrowth doesn't tell the whole story\n\nBecause the Aussie dollar is a speculative currency, it's difficult to pinpoint where it should be valued or how it will grow in the future. But even then, experts say the perceived growth of the dollar isn't so much a success story for Australia, but more a reaction to the US.\n\n\n\n\n\nBrendan Rynne, chief economist for KPMG Australia, said the growth had more to do with the valuation of the US dollar.\n\n\n\n\n\n\"It's got more to do with the fact that the US dollar is depreciating against most of the other currencies around the world than necessarily anything that's reflecting too positively on the Australian dollar,\" Rynne said.\n\n\n\nWeston said the US dollar may be weakening due to concerns over whether the Federal Reserve could be \"behind the curve\" on interest rate cuts — having started later than others, including the Reserve Bank of Australia, weakening jobs data, and stagnant real wage growth.\n\n\n\n\n\nHe also said the impact of US President Donald Trump trying to \"influence\" the Federal Reserve carries a \"slightly higher premium for the US dollar\".\n\n\n\n\n\nThe US dollar has been falling since Trump took office for the second time, dropping by over 10 per cent in the first half of 2025 — its worst first-half performance in more than 50 years.\n\n\n\n\n\nIn contrast, the euro has rallied by more than 13 per cent against the greenback this year.\n\n\n\nHow will this affect consumers?\n\nIf you're planning on travelling overseas anytime soon, you might benefit from that value jump — or lose out — depending on where you're flying to. Because while the Australian dollar has appreciated against the US dollar, it has depreciated \"quite substantially\" against the pound and euro, Rynne said.\n\n\n\n\n\nA year ago, the Australian dollar was buying around 52 British pence and 60 euro cents. Now, it's about 49 British pence and 56 euro cents.\n\n\n\n\n\n\"If you want to travel to the United States, your Australian dollars are going to buy you more than they would 12 months ago,\" Rynne said. \"Having a nice holiday in the US will cost you a little bit less.\"\n\n\n\n\n\nHowever, on the other side of the coin, travelling in Europe will be more expensive.\n\n\n\n\n\nThe dollar shift will also affect the cost to buy things from each country.\n\n\n\n\n\n\"If you were looking to buy something from the UK at the moment, it would be much more expensive than what it was 18 months ago. It's the same with Europe,\" Rynne said.\n\n\n\n\n\nThat means it will be more expensive for US companies to buy Australian goods and services, but more affordable for companies in Europe.\n\n\n\n\n\nStill, Rynne said the Aussie dollar is in a \"relatively good spot\".\n\n\n\n\n\n\"We've got inflation under control, we've got a stable political environment, we've got an independent central bank, we have a recognition that rates are still likely to come down from where they are at the moment.\n\n\n\n\n\n\"All of those paint a strong picture in relation to the underlying value of the Australian dollar relative to other currencies.\"\n\n\n\n\n\nWeston said he didn't anticipate a \"ripping trend\" would take the Australian dollar above 70 US cents — a feat last seen in 2022 — \"anytime soon\". But it could be a possibility if the US economy worsened but share markets held up, he said.\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice; you should consult with a licensed professional to make the decisions that are right for you.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/teen-sprinting-sensation-gout-gout-falls-short-on-200m-sprint-at-world-athletics-championships/ujqsra2nb",
    "title": "Gout Gout is out of the World Athletics Championships — but time is on his side",
    "publish_date": "Thu, 18 Sep 2025 12:19:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Teenage sprint sensation Gout Gout has missed out on the 200m final at the World Athletics Championships in Tokyo.\n\n\n\n\n\nThe 17-year-old placed fourth in the second semi-final on Thursday night with a time of 20.36 seconds.\n\n\n\n\n\nBryan Levell of Jamaica won, while Letsile Tebogo of Botswana placed second, with both running under 20 seconds and automatically qualifying for the final on Friday night.\n\n\n\n\n\nComing around the bend, Gout was placed seventh but powered down the straight to finish fourth.\n\n\n\n\n\nGout is the youngest man in the 200m field in Tokyo and the youngest man ever to be selected in an Australian team at a World Athletics Championships.\n\n\n\nGout set the Australian record of 20.02 earlier this year.\n\n\n\n\n\nHe told reporters after the race that he \"couldn't be prouder\" of himself after making the semi-final and competing against the big names.\n\n\n\n\n\n\"Obviously, I was aiming for that sub-20, but today wasn't the day, God didn't allow it today,\" he said.\n\n\n\n\n\n\"But I know for sure in the future it's going to be coming.\"\n\n\n\n\n\nHe said there was one thing he had over many of his fellow athletes.\n\n\n\n\"The thing I have on them is time,\" Gout said.\n\n\n\n\n\n\"They may not have 15 years, but I've got 15 years.\n\n\n\n\n\n\"I know that if I can do this at 17, I can do this at 25 and I'll be even better at 25.\"\n\n\n\n\n\nGout has said that after Tokyo, he'll be taking a short break from competition to return to Australia for his final exams at school.\n\n\n\n\n\nDespite the demands of his athletics training, the sprinter is known as a highly accomplished student with high grades and an interest in studying psychology.\n\n\n\nLewis out, but says she got 'all she asked for'\n\nAustralian sprinter Torrie Lewis was also run out in the women's semis, finishing fourth in 22.69 — some 0.13 slower than the personal best (PB) she clocked in the opening round.\n\n\n\n\n\nLewis also beat her own national record in the 100m earlier in the meet.\n\n\n\n\n\n\"A pretty good championships I would say; two PBs and that's all I asked for coming in,\" she said.\n\n\n\nLewis was drawn in a tough semi alongside 100m gold medallist Melissa Jefferson-Wooden and British star Dina Asher-Smith.\n\n\n\n\n\n\"I had Melissa and Dina this time and I didn't really have the energy for the final 50 as I maybe usually would,\" she said.\n\n\n\n\n\nAustralia's hopes in other categories are still alive: two-time Olympic silver medallist Nicola Olyslagers and 2022 world champion Eleanor Patterson both advanced to Sunday's high jump final with ease.\n\n\n\n\n\nAustralia will have a full contingent of three in the women's 800m semi-final on Friday, with Jessica Hull, Claudia Hollingsworth and Abbey Caldwell advancing.\n\n\n\nAustralians Rose Davies and Linden Hall have qualified for the women's 5,000m final after finishing fifth and seventh, respectively, in the second of two heats.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n\n\nEvery session from the nine-day event will be broadcast live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand, which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/british-pm-starmer-hosts-trump-at-chequers-as-leaders-tackle-trade-ukraine-and-gaza/ha9alivgz",
    "title": "Foreign policy, free speech and Epstein: Takeaways from Trump and Starmer's press conference",
    "publish_date": "Thu, 18 Sep 2025 11:14:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump and United Kingdom Prime Minister Keir Starmer hailed the renewal of their nations' \"special relationship\", drawing Trump's unprecedented second state visit to a close with a show of unity after avoiding possible pitfalls.\n\n\n\n\n\nAt a warm press conference when the two leaders glossed over differences on Gaza and wind power to present a united front, Trump said Russian President Vladimir Putin had \"let him down\" and he was disappointed other countries were still buying Russian oil because only a low oil price would punish Russia.\n\n\n\n\n\nAfter two days of his state visit to Britain, which the US leader described as an \"exquisite honour\", Trump was in a relaxed mode at the final press conference while Starmer was focused on avoiding areas of disagreement.\n\n\n\n\n\nNeither leader was tripped up by potentially embarrassing subjects, with both batting away questions over the late sex offender Jeffrey Epstein and his ties to Trump and to Starmer's former ambassador to the US.\n\n\n\n'Special relationship' renewed\n\n\"We've renewed the special relationship for a new era,\" Starmer told reporters.\n\n\n\n\"This partnership today is a signal of our determination to win this race together and to ensure it brings real benefits in jobs, in growth, in lower bills, to put more hard-earned cash in people's pockets at the end of each month,\" Starmer said.\n\n\n\n\n\nTrump also paid homage to the close ties between the two countries, saying Starmer was a tough negotiator in securing the first tariff deal with the US, although Britain has still not secured the lower US tariffs on steel that it was seeking.\n\n\n\n\n\n\"We're forever joined, and we are forever friends and we will always be friends,\" Trump said.\n\n\n\n\n\nEarlier, at the start of a business reception, some of the leading names in US and UK business were welcomed by the two leaders to unveil a record £150 billion ($307 billion) package of US investment into Britain from giants such as Microsoft and Blackstone, part of a wider package officials say will benefit both sides.\n\n\n\n'Priceless ties'\n\nStarmer said the deals would \"light up the special relationship for years to come\". Trump was equally effusive.\n\n\n\n\n\n\"The ties between our countries are priceless,\" he said.\n\n\n\nThe first day of Donald Trump's state visit to the UK concluded with a banquet at Windsor Castle. Source: AAP / Phil Noble \"We've done some things that financially are great for both countries ... I think it's an unbreakable bond we have, regardless of what we're doing today. I think it's unbreakable,\" Trump said.\n\n\n\n\n\nStarmer has pitched Britain as a destination for US investment, aligning it with the country's financial services, tech, and energy sectors, so it can attract US capital and expand its infrastructure to drive economic growth.\n\n\n\nJimmy Kimmel and free speech\n\nTrump was also asked about the decision by US broadcaster ABC to take late-night host Jimmy Kimmel off air indefinitely , after comments he made during his show about reactions by Trump and other Republicans to the assassination of right-wing commentator Charlie Kirk.\n\n\n\n\n\n\"Jimmy Kimmel was fired because he had bad ratings more than anything else and he said a horrible thing about a great gentleman known as Charlie Kirk,\" Trump said during the press conference.\n\n\n\n\n\n\"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. So, you know, you can call that free speech or not. He was fired for lack of talent.\"\n\n\n\nStarmer avoided a blowup on differing UK and US interpretations of free speech, after Trump said the UK had \"laid the foundations of law, liberty, free speech and individual rights\" under its empire and \"must continue to stand for the values ... of the English-speaking world\".\n\n\n\nDisagreements on foreign policy\n\nIt was on foreign affairs where the two were most out of lockstep.\n\n\n\n\n\nStarmer and other European leaders have been pressing Trump to put more pressure on Putin to end the war in Ukraine.\n\n\n\n\n\nTrump, while criticising Putin, failed to mention any further sanctions against Russia.\n\n\n\n\n\nThe US leader again expressed frustration that European nations were still buying Russian oil, but said Starmer was not part of their number.\n\n\n\nProtesters marched through central London to oppose the presence and policies of Donald Trump during his state visit to the UK. Source: Getty / Guy Smallman Trump also repeated his position that he disagreed with countries recognising Palestinian statehood — something Starmer has said Britain will do if Israel fails to relieve suffering in Gaza and reach a ceasefire in its war with Hamas.\n\n\n\n\n\n\"I have a disagreement with the prime minister on that score, one of our few disagreements, actually,\" Trump said.\n\n\n\nLeaders sidestep questions on Epstein\n\nBut the two leaders sidestepped questions on Epstein, after both were asked about Starmer's decisions to sack Peter Mandelson as ambassador to the US last week after his close ties with the late financier were revealed.\n\n\n\n\n\nTrump's relationship with Epstein has also come under scrutiny.\n\n\n\n\n\n\"I don't know him, actually,\" Trump said in response to a question about Mandelson. \"I think the prime minister would be better speaking over that; it was a choice that he made.\"\n\n\n\n\n\nStarmer repeated his position: \"Some information came to light last week which wasn't available when he was appointed and I made a decision about it, and that's very clear.\"\n\n\n\n\n\nWhen the final question was answered, a clearly relieved Starmer ushered Trump out of the Great Hall at Chequers — the country residence of UK Prime Ministers — before Trump left to return to Washington.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/tesla-full-self-driving-technology-now-unlocked-in-australia/spbhpn09i",
    "title": "Tesla full self-driving technology now unlocked in Australia",
    "publish_date": "Thu, 18 Sep 2025 11:02:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tesla full self-driving technology now unlocked in Australia\n\nPublished 18 September 2025, 10:03 am\n\nTesla has announced its controversial supervised full self-driving feature is now available in Australia and New Zealand. The roll-out makes both countries the first right-hand drive market in the world to access the technology. However, drivers are being urged to exercise caution.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/video/kmarts-use-of-facial-recognition-technology-breached-privacy-laws/m30h6sgs0",
    "title": "Kmart's use of facial recognition technology breached privacy laws",
    "publish_date": "Thu, 18 Sep 2025 10:54:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Kmart's use of facial recognition technology breached privacy laws\n\nPublished 18 September 2025, 10:02 am\n\nRetail giant Kmart has been accused of violating customers' privacy with its use of facial recognition. The company says it trialled the technology to tackle increased theft and fraud and is considering appealing the Privacy Commissioner's ruling.",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/video/australia-to-cut-emissions-by-62-to-70-per-cent-by-2035/fsj318rtc",
    "title": "Australia to cut emissions by 62 to 70 per cent by 2035",
    "publish_date": "Thu, 18 Sep 2025 10:33:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia to cut emissions by 62 to 70 per cent by 2035\n\nPublished 18 September 2025, 10:02 am\n\nAmbitious but achievable. That is how the government has described its 2035 climate targets. Committing to reduce emissions by 62 to 70 per cent from 2005 levels. The highly anticipated announcement has received mixed reviews.",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/trumps-royal-treatment-un-declares-genocide-in-gaza-albanias-ai-minister/h31rz89h4",
    "title": "Trump's royal treatment, UN declares 'genocide' in Gaza & Albania's AI minister",
    "publish_date": "Thu, 18 Sep 2025 09:02:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-500-million-problem-caused-by-an-out-of-date-superannuation-rule/4ghyi1b2f",
    "title": "The $500 million problem caused by an 'out-of-date' super rule",
    "publish_date": "Thu, 18 Sep 2025 08:50:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "An \"out-of-date\" superannuation rule could cost Australia’s low-income workers $500 million in savings this year, according to a superannuants' advocacy group.\n\n\n\n\n\nThe Super Members Council (SMC) has called for a lift of the Low-Income Superannuation Tax Offset (LISTO), a rebate introduced to help low-income earners boost their nest egg.\n\n\n\n\n\nThe rebate has been frozen for 13 years causing millions of workers to miss out on savings, according to the analysis.\n\n\n\n\n\nDesigned to make Australia’s tax system fairer, the LISTO gives low-income earners a tax refund for their superannuation contributions.\n\n\n\n\n\nBut in 2020, tax brackets changed while the offset remained the same, leaving thousands of low-income earners out of its scope.\n\n\n\nLISTEN TO Calls for change to Low Income Super Tax Offset rule SBS News 01:04 English\n\nIt means some 1.2 million low-income workers will miss out on a collective $500 million dollars this financial year, with women and young people more likely to be affected, according to the report. It also found the problem is set to become more \"acute\" when stage three tax cuts come into effect in 2027.\n\n\n\nWhat is the Low-Income Superannuation Tax Offset?\n\nSuperannuation is taxed for most Australians at a flat rate of 15 per cent. The LISTO is a fairness measure implemented to ensure low-income earners don’t end up paying more tax on their superannuation than on their take-home pay.\n\n\n\n\n\nThe LISTO offers refunds up to $500 that are directly deposited into superannuation accounts by the Australian Taxation Office.\n\n\n\n\n\nWhen the LISTO was introduced in 2012 it applied for those earning up to $37,000, covering the two lowest-earning brackets.\n\n\n\n\n\nBut the LISTO is not indexed, and has remained the same for 13 years, in spite of inflation and changes made to Australia’s income brackets.\n\n\n\nIn July 2020 the second income bracket was raised from $37,000 to $45,000, rendering roughly 500,000 low-income earners ineligible for the LISTO. Analysis from the SMC report estimated this cohort has lost a collective $3 billion in rebates.\n\n\n\n\n\nIn its report, the SMC has said millions of Australians were no longer receiving the tax benefit they deserved, a situation anticipated to worsen amid further changes to income brackets in 2027.\n\n\n\n\n\nThe SMC's modelling suggests that, if the LISTO remains frozen, one in four people will pay a higher tax rate on their superannuation contributions than on their income.\n\n\n\nWho else is affected?\n\nPeople working in low-paid, frontline professions are most vulnerable to missing out on benefits from the LISTO, with women and young people most at risk, according to the report.\n\n\n\n\n\nThe occupations where workers were anticipated to be most-affected included carers and aides, followed by salespeople and health professionals.\n\n\n\n\n\nSuper Members Council acting CEO Georgia Brumby said it was \"time to fix\" the system.\n\n\n\n\n\n\"One part of our super system has been frozen for 13 years, and more than a million low-paid workers, the majority of which are women, are being shortchanged by up to $60,000 in retirement savings. It’s time to fix it,\" she said.\n\n\n\n\n\n\"Australians put aside a portion of their money for their future – in exchange the government gives them a tax benefit. We must keep that promise by ensuring the system is fair and continues to deliver for all Australians,\" she said.\n\n\n\nREAD MORE How much super do Australians need to retire? It could be less than you think\n\nThe SMC has called for eligibility for the LISTO to be bumped up to $45,000, ensuring earners in the lowest-two income brackets receive a benefit for their superannuation contributions.\n\n\n\n\n\nThe council also recommended the LISTO payment be increased from $500 to $810, echoing calls from the Grattan Institute and Women in Super.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/full-time-jobs-tumble-us-cuts-rates-future-of-chocolate-prices/b7upp8x6w",
    "title": "Full-time jobs tumble, US cuts rates & future of chocolate prices",
    "publish_date": "Thu, 18 Sep 2025 07:19:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/too-high-or-too-low-australias-2035-climate-target-pleases-no-one/b56y8dn44",
    "title": "Too high or too low? Australia's 2035 climate target pleases no one",
    "publish_date": "Thu, 18 Sep 2025 07:03:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia has finally announced it's long awaited 2035 emissions reduction target.\n\n\n\n\n\n\"Today I announce that we have accepted their advice (from the Climate Change Authority) that Australia's 2035 emissions reduction target be 62 to 70 per cent.\"\n\n\n\n\n\nEarlier in the month, the Climate Change Authority recommended the government set a target of between 65 and 75 per cent - compared to 2005 levels.\n\n\n\n\n\nAnnouncing just how much Australia is willing to contribute to global emissions reductions, Prime Minister Anthony Albanese says he has considered the advice of experts.\n\n\n\n\n\n\"Our plan for the next 10 years builds on the foundations that we have laid over the last three. Overwhelmingly, the three areas where we need to reduce most of our emissions come from electricity, transport and industry. On electricity, we will continue to support clean energy with renewables - backed by gas and battery storage. In 2022, we inherited a national energy grid that had been run into the ground.\"\n\n\n\n\n\nEnvironmental groups are calling the target too low.\n\n\n\n\n\nOn the other hand, some industry and business groups are saying it's too high.\n\n\n\n\n\nBut first, what exactly is the emissions reduction target?\n\n\n\n\n\nEmeritus Professor Mark Howden has worked for 36 years on climate change policy.\n\n\n\n\n\nThat has included contributions to the UN's expert panel on climate change, the I-P-C-C; and ten years as founding director at the Institute for Climate, Energy and Disaster Solutions at The Australian National University.\n\n\n\n\n\nHe explains what this new target means.\n\n\n\n\n\n\"So an emission reduction goal is a comparison of our emissions in the future with those back in 2005. And it matters because under the Paris Agreement that we've signed, we committed to keeping temperatures down below two degrees. And if possible, close to one-and-a half degrees above pre-industrial (emission levels). And the only way we can do that is by really ambitious emission reductions.\"\n\n\n\n\n\nSo far - the federal government says emissions have been reduced by 29 per cent from 2005 levels.\n\n\n\n\n\nAs it aims for a 2050 target of net zero emissions, Australia's interim targets are: a 43 per cent cut by 2030 and a 62 to 70 per cent cut by 2035.\n\n\n\n\n\nThe Paris Agreement, adopted by Australia and 195 others in 2015, aims to limit global warming to 1.5 degrees - and at the most, below 2 degrees.\n\n\n\n\n\nAs a signatory, Australia is obligated to increase reduction targets every five years; and is not allowed to weaken them.\n\n\n\n\n\nCalling the target weak, Greens leader Larissa Waters says this target is dangerously low.\n\n\n\n\n\n\"Look, a range of 62 per cent to 70 per cent means 62 per cent. The only reason they've put a range in place is so that they can hit the lowest end of the range and then claim to be heroes. Well, this target is so appallingly low, it will not keep us safe.\"\n\n\n\n\n\nThe government has also released what they've called the Net Zero Plan, outlining the steps to achieve the new target.\n\n\n\n\n\nThe commitments include: $2 billion for the Clean Energy Finance Corporation, a $5 billion net zero fund within the national reconstruction fund, and $1.1 billion for the production of clean fuels.\n\n\n\n\n\nClimate Change and Energy Minister Chris Bowen says these are just a few of the steps they'll be taking.\n\n\n\n\n\n\"So all these investments are important, as well as new investments in energy performance and energy efficiency. We'll create, for the first time, a statement of demand opportunities. We have an energy statement of opportunities, a gas statement of opportunities. We'll ask AEMO [Australian Energy Market Operator] to prepare a demand statement of opportunities. And we'll expand NatHERS and NABERS (energy rating systems). The tools which enable households and businesses to test the energy efficiency of their premises and make sure they are getting value for money and are driving energy efficiency as much as possible. All this together amounts to a serious, credible, robust plan.\"\n\n\n\n\n\nBut Larissa Waters says the allocated funding is nowhere near what's needed.\n\n\n\n\n\n\"Look the Net Zero plan, and the dollars associated with it, are less than this government gives to coal and gas companies every single year in fossil fuel subsidies.\"\n\n\n\n\n\nThe Coalition meanwhile remains deeply divided over their climate policy, with frontbencher Andrew Hastie threatening to quit if a net zero emissions policy is not dropped.\n\n\n\n\n\nOpposition leader Sussan Ley says she is evaluating the target on the metrics of cost and credibility.\n\n\n\n\n\n\"It fails on both counts. It can't be believed because the government assumes that the 2030 target is in fact met. When clearly it will not be. The credibility is in tatters. In addition to that, there is nothing in this announcement that demonstrates to Australians how much it will cost. And that's not reasonable for households, for businesses, for the hardworking manufacturers in this country who want answers and are seeing their electricity bills skyrocket.\"\n\n\n\n\n\nDays before the announcement, Australia's first climate risk assessment was released.\n\n\n\n\n\nThe National Climate Risk Assessment revealed 63 nationally significant climate risks, including rising sea levels and heatwaves, impacting 1.5 million Australians by 2050.\n\n\n\n\n\nIt lays out a catastrophic vision for the future, if serious action is not taken to address climate change in the coming years.\n\n\n\n\n\nWhile critics of stronger climate action flag cost concerns, Professor Howden says the cost of inaction is far greater.\n\n\n\n\n\n\"Well, I think what the risk assessment showed is that climate change is a real problem for Australia. The cost will be born right across sectors pretty much by every Australian, and whether it's through insurance or through direct impacts of climate change or through increased payments because of disaster risk payments that may increase by up to seven times. So climate change is going to cost Australia dearly. And when we look at the economics, reducing our emissions is far cheaper if we do it sensibly than putting up with climate change. And so economically, the best thing we can do is actually reduce our emissions and encourage other countries to take their own emission reduction activity proportionately.\"\n\n\n\n\n\nHe says claims that renewables are pushing up energy prices, are not based in reality.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/article/labors-new-emissions-target-faces-criticism/xxfp490yw",
    "title": "'Not likely to please anyone': Labor's 'ambitious' new emissions target faces criticism",
    "publish_date": "Thu, 18 Sep 2025 06:00:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Climate action advocates have criticised the federal government's updated 2035 emissions reduction target as falling \"dangerously short\" of what the science demands, while the Coalition has said its plan is \"grounded in fantasy land\".\n\n\n\n\n\nOpposition leader Sussan Ley said the government had failed to outline the cost of reducing greenhouse gas emission by 62 to 70 per cent by 2035 , on 2005 levels.\n\n\n\n\n\n\"Targets must be achievable and realistic. And these are not,\" she said at a mid-afternoon press conference, adding that the Coalition would oppose attempts to legislate the target.\n\n\n\nLISTEN TO Too high or too low? Australia's 2035 climate target pleases no one SBS News 07:21 English\n\nThe commitment builds on the government's existing 2030 target to cut emissions by 43 per cent on 2005 levels and serves as another stepping stone on the way to net zero by 2050.\n\n\n\n\n\nPrime Minister Anthony Albanese said his government \"knows climate change is real\", while Climate Change Minister Chris Bowen said the updated target would be \"achievable and ambitious\".\n\n\n\n\n\nAlbanese said emissions would need to be reduced the most in transport, industry and electricity sectors.\n\n\n\n\n\nBut experts and climate action advocates widely condemned the target as inadequate.\n\n\n\nREAD MORE No Australians immune: What 2050 and beyond will look like for your city\n\nAustralian Conservation Foundation climate and energy program manager Gavan McFadzean said the target range \"condemns Australian communities to ongoing climate harm and is embarrassing in the face of the climate leadership being shown by our Pacific neighbours and states like Victoria and New South Wales.\"\n\n\n\n\n\n\"Wealthy countries such as Australia that have grown economically on the back of coal and gas pollution have the ability — and responsibility — to make much deeper cuts than this,\" McFadzean said.\n\n\n\n\n\nHead of the World Wide Fund for Nature's (WWF) Australian branch, Dermot O'Gorman, said the target \"falls dangerously short of what the science demands\".\n\n\n\n\n\n\"It will mean more fires, floods and heatwaves and more species extinctions. This was clearly outlined by the government's Climate Risk Assessment report ,\" WWF-Australia CEO Dermot O'Gorman said.\n\n\n\nThe head of Emergency Leaders for Climate Action — a coalition of 38 former fire and emergency service chiefs — also said the government's target range \"falls dangerously short of what the science tells us is needed\"\n\n\n\n\n\n\"It's like deciding to send too few fire trucks to a massive bushfire event,\" said Greg Mullins, a former commissioner of Fire & Rescue NSW.\n\n\n\n\n\n\"We need to do more to protect Australians from the worsening of the climate crisis,\" Mullins said, adding that his group wanted a target that was \"as close to net zero by 2035 as possible\".\n\n\n\n'Grounded in fantasy land'\n\nLey promised on Thursday that the Coalition would \"interrogate and test this announcement for cost and credibility\".\n\n\n\n\n\n\"It can't be believed because the government assumes that the 2030 target is in fact met, when clearly it will not be. The credibility is in tatters,\" she said.\n\n\n\n\n\n\"In addition to that, there is nothing in this announcement that demonstrates to Australians how much it will cost.\"\n\n\n\n\n\n\"We will hold them to account because we know this is grounded in fantasy land. Targets must be achievable and realistic. And these are not,\" said Ley, whose party room has been riven by climate policy dispute since the Coalition's landslide defeat in this year's federal election.\n\n\n\nLISTEN TO Deep rifts widen further within Coalition under climate change pressure SBS News 05:42 English\n\nAsked by a journalist about the Coalition's own credibility on targets given its internal division over net zero , Ley said:\n\n\n\n\n\n\"[Deputy opposition leader] Ted [O'Brien] and I have just come out of a shadow cabinet meeting and I can assure you there was absolutely no division in opposing Labor's latest piece of train wreck energy policy\".\n\n\n\n\n\nLey wouldn't be drawn on the Coalition's alternative proposal, only saying that \"our energy policy is going through a detailed policy development process\".\n\n\n\n'Not likely to please anyone'\n\nProfessor Jacqueline Peel from the the University of Melbourne Law School said the target was \"not likely to please anyone\".\n\n\n\n\n\n\"Progressive business called for a 75 cent cut, civil society for an 85 per cent or above target, and on the right, the Coalition opposition is stuck in a diabolical debate about whether to even have Australia stick with a net zero by 2050 target,\" she said.\n\n\n\n\n\n\"Of course, a target is only part one of any nation’s climate action story, and there is a lot to be written for the part two implementation chapter that will play a big part in judging the ambition of this new pledge,\" she added.\n\n\n\nLISTEN TO Climate Change and China's Charm: Australia's pressing role to play in the Pacific SBS News 07:28 English\n\nWesley Morgan, a research associate from the Institute for Climate Risk & Response at the University of New South Wales, highlighted Australia's ongoing bid to co-host next year's top-level Conference of the Parties (COP) climate talks with Pacific neighbours, warning that \"Pacific nations are watching Australia's ambition closely\".\n\n\n\n\n\n\"Pacific island countries are fighting for survival, and want to see all countries set a target that is in line with limiting warming to 1.5C\", Morgan said.\n\n\n\n\n\n\"To meet Australia’s share of global efforts to limit warming to 1.5C, our 2035 target should have been a cut of at least 75 per cent on 2005 levels by 2035.\"\n\n\n\n'A big lift'\n\nInnes Willox, chief executive of national employer association Australian Industry Group, said achieving the government's planned emissions reductions would require \"a big lift\".\n\n\n\n\n\n\"Even reaching 62 per cent will challenge policy makers, industry and households,\" Willox said.\n\n\n\n\n\n\"Delivering 70 per cent will only be possible with favourable tailwinds from technology, global markets and the right policy settings, especially to allow for the construction and delivery of significant infrastructure.\n\n\n\n\n\n\"While it is not straightforward to achieve, it is also in the realm of the feasible — with hard work and a tight focus on making Australia a place where it is easy to invest and to build.\"\n\n\n\nHead of mining giant Fortescue Andrew 'Twiggy' Forrest, said Labor had showed \"courage of leadership\" for \"setting a 2035 target that builds upon, and reaches beyond, the ambition of 2030\".\n\n\n\n\n\nHowever, he stressed that the upper range of the target — 70 per cent — \"must be a floor, not a ceiling\".\n\n\n\n\n\n\"A cut of at least 75 per cent is what is needed for Australia to pursue emissions reductions in line with the science. This remains the only course that can avert the accelerating impacts of a world warmed beyond 1.5C,\" he said in a statement.\n\n\n\n\n\n\"A 62 per cent to 70 per cent range is a step forward, but it sends a signal that we are comfortable with the status quo. Australia is capable of much more and the world is watching,\" said Forrest.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 45
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/mixed-reactions-to-australias-2035-emissions-target-evening-news-bulletin-18-september-2025/e2n61b0lu",
    "title": "Mixed reactions to Australia's 2035 emissions target | Evening News Bulletin 18 September 2025",
    "publish_date": "Thu, 18 Sep 2025 05:53:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Climate target consider \"hopeless\" and \"ambitious\"\n\nAllan Jones before Sydney court, pleads not guilty to charges as some withdrawn\n\nUS Olympian facing two-year ban is first track athlete to commit to Enhanced Games\n\nListen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia will aim to cut greenhouse gas emissions by between 62 and 70 per cent on 2005 levels by 2035, under a climate target announced by the government today.\n\n\n\n\n\nPrime Minister Anthony Albanese says the target is in line with advice by the Climate Change Authority.\n\n\n\n\n\nHe also announced $2 billion in funding for the Clean Energy Finance Corporation to help reach the target, AND a major funding boost for the resources sector in the transition to renewable energy.\n\n\n\n\n\n\"We know that getting emissions down in the resources sector and heavy industry is the next major area and will help heavy industry to do the heavy lifting. Today, we announce a net zero $5 billion reconstruction fund to help large industry decarbonise and scale up more renewables and low emissions manufacturing.\"\n\n\n\n\n\nUnder the Paris Climate Accord, the government must submit its new climate target by the end of the month.\n\n\n\n\n\nThe agreement, which 195 parties including Australia signed in 2015, aims to limit global temperature rises to 1.5 degrees and less than 2.\n\n\n\n---\n\n\n\n\n\nThe Greens were quick to respond to the government's newly announced 2035 net zero target, with party Larissa Waters labelling the emissions target range an utter failure.\n\n\n\n\n\nMs Waters criticised the government for releasing the target shortly after approving the Woodside Northwest Shelf Gas Project.\n\n\n\n\n\n\"A range of 62 per cent to 70 per cent means 62 per cent. The only reason they've put a range in place is so that they can hit the lowest end of the range and then claim to be heroes. Well, this target is so appallingly low, it will not keep us safe.\"\n\n\n\n\n\nToday's announcement also follows the recent release of the first National Climate Risk Assessment, which laid out a catastrophic vision of Australia's future if the Paris Agreement targets are not met.\n\n\n\n---\n\n\n\n\n\nMeanwhile, the Australian Chamber of Commerce and Industry says the 2050 target announced by the government is ambitious and will be challenging to achieve.\n\n\n\n\n\nChief executive Andrew McKellar urged politicians to take a bipartisan approach to support policy certainty for businesses.\n\n\n\n\n\n\"It will be very challenging for business and for industry to get to this target. But the important thing is business needs certainty if we're able to put in place the investment that is required to continue on the pathway to net zero emissions by 2050.\"\n\n\n\n---\n\n\n\n\n\nOutspoken former radio host and former Wallabies coach Alan Jones has pleaded not guilty to dozens of sexual abuse charges in a Sydney court today.\n\n\n\n\n\nIn the same hearing, several charges against him were withdrawn.\n\n\n\n\n\nMr Jones' lawyer Bryan Wrench told the court the changes removed any allegations of aggravated conduct, or accusations that any of the alleged victims were under Jones' authority at the time of the alleged abuse.\n\n\n\n\n\nThe 84-year-old had been accused of historical sex offences against 11 people - the youngest of whom was 17 at the time - over two decades when he dominated Sydney's airwaves.\n\n\n\n\n\nMr Jones now faces 25 charges of indecent assault and two of sexual touching against nine alleged victims, and will face a local court hearing in 2026, with the date due to be set in November.\n\n\n\n\n\nProsecutors did not explain in court why the charges related to two victims are no longer being pursued.\n\n\n\n\n\nAnd if this story has caused distress for you or someone you know, 24-hour support is available at 1800 RESPECT 1800 737 732.\n\n\n\n---\n\n\n\n\n\nThe Taliban says it has cut internet connections in five provinces in the north of Afghanistan to prevent what it calls immoral activities.\n\n\n\n\n\nOfficials say the outage affects all internet connections via fibre optic cable, but internet access on mobile phone data is still available.\n\n\n\n\n\nThe move has prompted fears the regime will enforce the ban across the country, as it cites concern over pornography and online flirting.\n\n\n\n\n\nKhalid Amiri is an Afghan journalist who was evacuated after the Taliban came to power in 2021.\n\n\n\n\n\nHe told SBS Pashto, the ban further isolates Afghans.\n\n\n\n\n\n\"It particularly affects the Afghan diaspora in countries like Australia and across the West, where families remain separated since the Taliban takeover. Many fled, leaving loved ones behind and their only means of communication has been through applications like WhatsApp and Signal. And I think with this ban, even that lifeline has been cut off.\"\n\n\n\n\n\nThis outage is the first internet ban announced by the Taliban since it took over Afghanistan in 2021.\n\n\n\n---\n\n\n\n\n\nTo sport now, a track athlete has joined a controversial new event that will allow athletes from all over the world to compete using performance-enhancing drugs.\n\n\n\n\n\nCalled The Enhanced Games, the event will debut in Las Vegas in May 2026.\n\n\n\n\n\nOlympic medallist sprinter, Fred Kerley, is the first US sprinter to sign up for the competition.\n\n\n\n\n\nKerley is provisionally suspended for an alleged anti-doping whereabouts violation - and he could face a two-year ban if the charge from the Athletics Integrity Unit is upheld.\n\n\n\n\n\nThe World Anti-Doping Code states an athlete cannot miss three anti-doping tests - and/or filing failures - within a 12-month period.\n\n\n\n\n\nHe says he will contest the allegation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 45
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/palestinians-flee-gaza-city-midday-news-bulletin-18th-september-2025/4avfb7mth",
    "title": "Palestinians flee Gaza City as bombing continues | Midday News Bulletin 18th September 2025",
    "publish_date": "Thu, 18 Sep 2025 01:59:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Palestinian residents cite dangers in newly opened passage out of Gaza City\n\nUnemployment lifts slightly to 4.3 per cent\n\nSocceroo Cameron Burgess thwarts Nottingham Forest at English League Cup\n\nListen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nHuge numbers of Palestinians are fleeing Gaza City, as Israel's bombing campaign continues- but hundreds of thousands are choosing to stay, even as Israel opens an additional route for 48 hours to help them depart.\n\n\n\n\n\nThose fleeing are heading south by foot, car, and donkey cart.\n\n\n\n\n\nIsrael estimates 350,000 of around one million inhabitants of the city have fled.\n\n\n\n\n\nThose who are staying are citing danger along the route, a lack of food south of Gaza City, and a fear of permanent displacement.\n\n\n\n\n\nIsrael's offensive has been met with widespread international condemnation, and Gazan authorities say 64 people have died in Gaza City in the past 24 hours.\n\n\n\n\n\nIsmael Abu Ajwaa, who lost a son in an Israeli strike, says there is nowhere safe for him to go.\n\n\n\n\n\n“Where is the safety? Where should we go? If we went south we are dead and if we stay here we are dead, where should we go? Find us a solution. My oldest son, who cares for seven or eight people, he was martyred. What should I do?”\n\n\n\n---\n\n\n\n\n\nAustralia's unemployment rate has risen slightly to 4.3 per cent, correcting a 0.1 per cent rise in employment the month before.\n\n\n\n\n\nThe Australian Bureau of Statistics latest numbers show in August, the participation rate, which represents the proportion of Australians in the workforce, remained at 66.9 per cent.\n\n\n\n\n\nEconomists say this falls in line with the expectations of the Reserve Bank, which means the central bank is unlikely to use this data to influence its next decision on interest rates.\n\n\n\n\n\nThe jobs numbers come in the wake of high-profile institutions, including banks and universities, making significant job cuts to save costs.\n\n\n\n---\n\n\n\n\n\nFederal Opposition Leader Sussan Ley claims the government has already failed on energy policy- even before it releases its 2035 emission reduction target.\n\n\n\n\n\nPrime Minister Anthony Albanese is expected to reveal the target today , with the federal Treasury having modelled an emissions cut of between 65 and 75 per cent, as put forward by the Climate Change Authority, and environmental groups wanting a cut of no less than 80 per cent.\n\n\n\n\n\nMs Ley has told the Nine Network the government has an uphill battle in terms of credibility, no matter what target it announces.\n\n\n\n\n\n\"We are deeply sceptical about these targets. I certainly will be putting the test of cost and credibility against whatever is announced- and it may well be today, Because these are massive failings of the government. We've got a trifecta of energy failures actually staring them in the face- with costs up, with emissions flatlining, with reliability down.\"\n\n\n\n\n\nMs Ley is refusing to give any more insight as to when the coalition will come up with its own policy in this area, as internal debate continues within the opposition over whether it should support net-zero emissions.\n\n\n\n---\n\n\n\n\n\nThe British government has used a state dinner for US President Donald Trump at Windsor Castle to remind his government about the important of the AUKUS agreement.\n\n\n\n\n\nPrime Minister Anthony Albanese is expected to raise the agreement if he meets Mr Trump next week.\n\n\n\n\n\nThe agreement will see Australia spend 386 billion dollars to buy submarines from the US.\n\n\n\n\n\nMr Trump's government is reviewing the submarine partnership to ensure it is in line with his America-First agenda.\n\n\n\n\n\nIn his speech at the state dinner, King Charles has ranked AUKUS alongside efforts to support Ukraine as a top-ranking defence and international security matter.\n\n\n\n\n\n\"Our countries have the closest defence, security and intelligence relationship ever known. In two World Wars, we fought together to defeat the forces of tyranny. Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace. And our AUKUS submarine partnership, with Australia, sets the benchmark for innovative and vital collaboration.\"\n\n\n\n---\n\n\n\n\n\nIn football, a late goal from a Socceroo has handed Australian coach Ange Postecoglou his second loss in two games since taking over at English Premier League club Nottingham Forest.\n\n\n\n\n\nAustralian defender Cameron Burgess has scored two second half goals- the second of which came in the seventh minute of stoppage time- to help second-tier side Swansea City to a three goals to two win over Forest in the English League Cup.\n\n\n\n\n\nMeanwhile, in the European Champions League, Liverpool has been the beneficiary of a late goal.\n\n\n\n\n\nDefender Virgil van Dijk's goal in the second minute of second half stoppage time has given the English champions a three goals to two win over Atletico Madrid.\n\n\n\n\n\nBut Liverpool coach Arne Slot, whose side led two goals to nil after just six minutes, says it shouldn't have come to that.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 46
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/when-you-re-the-nrl-s-ugly-ducklings-you-should-use-it-to-your-advantage-20250918-p5mw2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "When you’re the NRL’s ugly ducklings, you should use it to your advantage",
    "publish_date": "Fri, 19 Sep 2025 11:53:17 +1000",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "This weekend’s NRL semi-finals - Canberra hosting Cronulla on the Saturday and Canterbury and Penrith a day later - is rugby league’s great case study of the haves and have-nots.\n\nBetween them, the Bulldogs and Panthers boast truckloads of juniors, star power, premierships, and poker machines to make all of the above happen.\n\nThose genuine NRL powerhouses have worked for and earned everything they have.\n\nHistorically, the Raiders and Sharks have done the same with far less, and with a chip on their shoulder.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/murdoch-s-banquet-with-trump-hints-at-lachlan-s-precarious-crown-20250915-p5mv3r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Murdoch’s banquet with Trump hints at Lachlan’s precarious crown",
    "publish_date": "Fri, 19 Sep 2025 11:51:22 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "Despite Rupert Murdoch’s apparent disdain for the establishment, his presence at US President Donald Trump’s state banquet this week was hardly his first dinner at the British monarch’s palace.\n\nBut it may not be a coincidence that his first public appearance in Trump’s orbit since a legal brawl erupted between them comes barely a week after securing control of his empire for son Lachlan.\n\nLachlan Murdoch’s grip on the family empire may not be as tight as it looks. Credit: Nytns\n\nCorporate documents released on Monday revealed for the first time the price Rupert and Lachlan paid to secure control of the business via the new web of family trusts they control. The youngest siblings, Chloe and Grace, remain passengers.\n\nIt is not just about the billions of dollars they had to pay to the rebels, Elisabeth, Prudence and James. The problem is how Lachlan was forced to fund their exit with share sales and financing that weakens his grip on both Fox and News Corp.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/corporate-cop-joe-longo-to-step-down-as-asic-chair-20250919-p5mwdq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Corporate cop Joe Longo to step down as ASIC chair",
    "publish_date": "Fri, 19 Sep 2025 11:42:12 +1000",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Australia’s corporate watchdog Joe Longo will step down after a term in which the regulator has turned up the heat on the country’s superannuation giants over their treatment of customers, while also maintaining pressure on banks over consumer protection.\n\nThe chair of the Australian Securities and Investments Commission (ASIC), who turned 66 on Thursday, announced on Friday he would leave the watchdog when his current five-year term ends in May next year.\n\nASIC chair Joe Longo appearing before a parliamentary joint committee this week. Credit: Alex Ellinghausen\n\nLongo will leave the watchdog after a period in which it has increased the number of new civil cases by a fifth, and taken on more investigations, while launching landmark cases against super fund giants including AustralianSuper and Cbus.\n\nIn those cases, ASIC took the super giants to court over their handling of death benefit claims, and the action was part of a wider push for the superannuation sector to lift its game in its customer service.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-scientists-criticise-new-2035-climate-target-trump-unveils-military-plans-to-counter-china-20250919-p5mwb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Scientists criticise new 2035 climate target; Trump unveils military plans to counter China",
    "publish_date": "Fri, 19 Sep 2025 11:41:02 +1000",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "The largest ABC affiliate in the US has asked Jimmy Kimmel to apologise and make a donation to Charlie Kirk’s family and political organisation before they will consider putting his show back on air.\n\nABC’s decision to take Kimmel off-air came after remarks the host made about the killing of conservative activist Charlie Kirk.\n\nTrump supported the decision, saying on Thursday that the comedian was “not a talented person” who “had very bad ratings”.\n\nDonald Trump on Jimmy Kimmel’s ABC show in 2015 while he was running to be the Republican candidate for president. Credit: AP\n\nSinclair Broadcast Group, which owns a number of local ABC channels, was one of two groups that said it would pull Kimmel’s show from its channels before ABC announced its suspension yesterday. A Sinclair statement said the suspension is “not enough”.\n\nTo reinstate the show, Sinclair says it needs to have discussions with ABC “regarding the network’s commitment to professionalism and accountability”.\n\nIt’s also asking Kimmel himself to “make a meaningful personal donation to the Kirk Family and Turning Point USA”.\n\nWith BBC",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/can-the-raiders-find-redemption-nrl-tips-finals-week-2-20250919-p5mwej.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Can the Raiders find REDEMPTION? NRL Tips - Finals Week 2",
    "publish_date": "Fri, 19 Sep 2025 11:36:08 +1000",
    "category": "sports",
    "authors": [],
    "text": "Can the Raiders find REDEMPTION? NRL Tips - Finals Week 2\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/lifestyle/nsw-farmer-pulls-off-proposal-like-no-other-20250919-p5mwei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW farmer pulls off ‘proposal like no other’",
    "publish_date": "Fri, 19 Sep 2025 11:32:58 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "NSW farmer pulls off ‘proposal like no other’\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/the-wiggles-caught-up-in-ugly-courtroom-battle-20250917-p5mvon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Wiggles caught up in ugly courtroom battle",
    "publish_date": "Fri, 19 Sep 2025 11:31:03 +1000",
    "category": "finance",
    "authors": [
      "Michaela Whitbourn"
    ],
    "text": "Children’s entertainment group The Wiggles is defending an explosive lawsuit filed against it by the company’s former chief executive, who claims he was sacked after complaining about spending and hiring decisions by one of the group’s founding members.\n\nLuke O’Neill, the first chief executive of The Wiggles, is suing the company and one of the group’s founders, “Blue Wiggle” Anthony Field, after his employment was terminated in May.\n\nLucia and Anthony Field, the Blue Wiggles, in the Big Red Car.\n\nThe Federal Court feud has exposed the breakdown in the relationship between O’Neill and Field, the sole remaining member of the Wiggles’ original lineup and a director of The Wiggles Holdings Pty Limited. O’Neill claims he complained about Field making financial decisions benefiting family members.\n\nIn a written defence filed on Thursday and released by the court on Friday, the company said vast tracts of O’Neill’s claim were liable to be struck out.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/afl/this-magpie-went-viral-before-even-playing-a-game-she-had-no-idea-20250916-p5mvjh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This Magpie went viral before even playing a game. She had no idea",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ash Centra had no idea she’d gone viral. The 19-year-old Collingwood rookie woke up the day after her debut game against Carlton at Ikon Park in August and redownloaded Instagram, an app she ritualistically deletes before games to block out external noise and clear her mind. Collingwood’s Ash Centra Credit: Joe Armao Her inbox was jam-packed with an infinite number of hashtags, reels and messages from family, friends and complete strangers. Centra took a mark and booted her first major in the clash, but the most talked about moment was an innocuous move she made during a warm-up. While jogging, the rookie threaded the ball behind her back and bounced it between her legs – an impressive manoeuvre that would have impressed on a basketball court, but bamboozled with a Sherrin. “I saw that people were tagging me in all these videos of the bounce, I was just like, this is ridiculous. Like, this cannot be happening,” Centra told this masthead.\n\nAdvertisement\n\nWithin days, nearly everyone was attempting the bounce, including Hawthorn coach Sam Mitchell and Collingwood’s Nick Daicos, Jack Crisp and Darcy Cameron. So where did the move come from? “I think it’s been something I’ve aimed to master for a while,” she said. “Now, I can’t really remember the exact moment when I started, but I think it’s just a fun little thing to do during training or even during the warm-up. I think I was just lucky to be getting filmed whilst doing it, because it’s definitely helped with all the hype.” Like all No.1 draft picks, Centra entered the league with significant noise. A product of the AFLW’s first national draft class, Centra was a star midfielder for Gippsland Power and was named the Coates Talent League’s best and fairest in 2024. After her debut game, Collingwood coach Sam Wright quipped Centra had already developed a cult following, noting the gigantic cheer when she finally came off the bench to play. “Looking back and reflecting, it was definitely probably the biggest highlight of my night, hearing that roar,” she said.\n\nAdvertisement\n\nFamily and friends from Centra’s hometown Seaspray – a small coastal town in Gippsland – had made the three-hour trek to see her debut in Melbourne, including her twin brother Luca. Centra credits her brother for her love of footy. The twins grew up playing junior footy together and their competitive natures meant they pushed each other to be the best. Luca was in the stands cheering during Centra’s debut, but accidentally missed a rather pivotal moment. “Dad came up to me after the game and said my brother was in the bathroom while I was having a set shot on goal, and unfortunately, he missed it, but my mum filmed it so he got to see afterwards,” she laughed. Since that debut game, Centra has continued to impress, collecting a Rising Star nomination for her role in Collingwood’s shock 26-point victory over the formerly undefeated Swans last week. Centra picked up a Rising Star nomination for her efforts in the round five clash with Sydney. Credit: Joe Armao Centra is full of praise for the team’s new captain Ruby Schleicher, describing the dual All-Australian as the perfect leader who strikes the balance between having fun and being professional.\n\nAdvertisement\n\n“I say this in a humble way, there’s obviously a lot of attention on the first couple of picks in the draft, because you’re expected to go out there and obviously try and change the game in some aspects,” Centra said. “Ruby’s been a massive mentor for me. She’s guided me, and she’s just super inclusive and super approachable when I need help, not only on the field but off the field as well.” Last week Schleicher told this masthead rookies and top draft picks such as Centra were coming into AFLW with more pressure and noise than ever. “So within the four walls and as a leader, it’s probably just my job to try and release that pressure and let them know that we don’t need them to go out have 30 disposals and change the game,” Schleicher said. “We just want to see them grow as players and enjoy their football.” Centra models her game off Richmond best-and-fairest winner Monique Conti, adhering to a silky and versatile style of footy. However, the physical nature of AFLW has been a surprising adjustment. “I came in on the first day of pre-season, and Britt Bonnici tackled me, and I was so taken back and shocked [by] how hard they hit,” she said.\n\nAdvertisement\n\nLoading “But I think it really helps you understand where you’re at and it helps you build that level of physicality. And I also think the speed of the game is so much different to what I’m used to, but it’s been a great challenge.” Centra is also adjusting to the recent move to Melbourne and is currently living with family friends. The 19-year-old was born metres from the beach and misses swimming in the ocean, joking Melbourne’s city beaches aren’t quite the same. “It’s been a lot different to what I’m used to. I know country life and city life are polar opposites ... so it’s been an adjustment,” she said “In Seaspray there’s only like 300 residents, so everything’s slow,” she continued. “Nothing’s really happening. We’ve got one coffee shop, and then you come to Melbourne and there’s like, 50 coffee shops metres from your house.” Centra was looking forward to taking on Hawthorn at Victoria Park on Saturday in front of her family and friends, including her brother. “He’s coming this weekend, so hopefully I’ll kick him a goal that he’ll see,” she joked.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/mokbel-s-naked-ambition-how-a-drug-kingpin-sought-to-expose-an-undercover-cop-20250917-p5mvue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mokbel’s naked ambition: How a drug kingpin sought to expose an undercover cop",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "John Silvester"
    ],
    "text": "The AFP conviction was later quashed due to Nicola’s nefarious needling. While the Commonwealth prosecutors felt they had enough for a retrial, they decided to let it go because he had done his time. Mokbel pleaded guilty to Quills, Orbital and Magnum. The remaining charges were dropped. For Tony, it was the best deal since Aldi sold snow ploughs for $99. It is entirely possible justices Stephen McLeish, Maree Kennedy and Stephen Kaye will decide that the Quills and Orbital convictions should be flushed down the toilet. Which brings us back to the toilet at the Box Hill restaurant and the naked face-off (although they weren’t exactly facing off).\n\nThe chubby chap, built more like Billy Bunter than Billy the Kid, was Tony Mokbel’s right-hand man, Bart Rizzo, and the second man was “Andy Hossack”, an undercover police officer. Artist sketch of Bart Rizzo in court. Rizzo was understandably self-conscious. Much later at his criminal court plea hearing, his lawyers would say he had battled weight problems since he was a child. Sad, but hardly mitigation as I have yet to see any criminological research linking the consumption of Mars bars with the production of methamphetamine. “Andy” had infiltrated the Mokbel syndicate, introduced by a trusted insider who was secretly working for the police. The insider, a musician, became Registered Human Source 3030. The musician was a great mate of Rizzo but a million-dollar reward on Tony’s toupee-covered scalp persuaded him to work for the police.\n\n“Andy’s” cover story was that he worked at a university and could steal large glass reactors that Mokbel’s team needed to produce speed. It was late May 2007 when Andy first connected with the Mokbel syndicate, known as The Company. Rizzo was chief financial officer for The Company. He kept the books, chased the money and resolved the problems. His fellow executive was Joe Mansour, the operations manager. They had been firm friends since they were private school classmates. As Justice Betty King would later observe when sentencing Rizzo: “You and other company members ran ‘The Company’ as if it were a legitimate business.” While Mokbel was a self-taught and quite brilliant businessman, Rizzo embarked on a Swinburne University business management course, dropping out in the final year – no doubt because there wasn’t a unit on money laundering.\n\nRizzo provided a list of glassware and “Andy” produced two consignments for $7300 cash from the Mokbel coffers. Loading But “Andy” was not masquerading just as an opportunistic thief but also as a drug dealer looking for a product that Rizzo could provide. Trouble was, The Company had lost its two best speed cooks (three if you include Tony, who was pretty good on the tools). For years, Mokbel produced the best gear going about, but something had gone wrong. Customers were complaining about the smell of the latest batch, and some had been hospitalised.\n\nRizzo spoke to Mokbel (it was one of 14 calls police recorded between the two), who was hiding in Athens. The problem was that they couldn’t withdraw the drugs as they needed the money. Around the same time, phone taps showed Rizzo was about to pick up cash hidden in a Collingwood storage depot. He was pulled over in Box Hill – in his car was $499,950 in cash wrapped in gift paper. A few days after police seized the money, the musician and Rizzo met in a Box Hill hotel room to package drugs for distribution. But the cook had gone bad, and so they contacted Mokbel for instructions. Mokbel ordered them to move the product quickly at a discount. The cook said he could do a better job by using a 20-litre reaction vessel. These bugged calls gave police the chance to introduce “Andy”.\n\nOver six days, “Andy” made three buys totalling 1.1 kilos of speed for $114,000. Police testing showed what Tony feared: it was complete crap. In a usual job, the undercover – to keep his credibility – would return the drugs and demand his money back, but this was not a usual job. Time was running out. Two detectives, one from Purana and the second from the federal police, were flying to Athens to find and arrest Mokbel. Not that Tony knew that, although he was starting to smell a rat. Mokbel asked his Melbourne executives: who was this “Andy”, and why should we trust him? What if he was an undercover cop? Mokbel wanted “Andy” followed, and then had a second plan: get him naked.\n\nYou need “Andy” to get his kit off, to check he wasn’t wearing a recording device. And, as a matter of trust, Rizzo needed to strip off to show, he too, was not recording. While Rizzo was relaxed about drug matters, male nudity was something else. Unlike the mobsters in movies, he was not a steam room sort of guy. At the Box Hill restaurant, Rizzo was sweating and anxious. He then asked “Andy” to adjourn to the uncomfortably small restroom. Rizzo went in first, turned around, and without a word, unbuttoned his shirt and dropped his trousers. This would have surprised “Andy” if he had not been forewarned from the phone taps. After pausing to let Rizzo sweat a little more, “Andy” removed his shirt and dropped his trousers. He then spun around and bent over to show there was no tiny listening device where the sun doesn’t shine.\n\nHaving followed his boss’s orders, Rizzo quickly dressed and returned to the table (washing his hands first). Later in a conversation recorded in “Andy’s” car while they were doing a drug deal, Rizzo bragged about his romantic encounters with the opposite sex, as if to assure his newfound friend that a naked encounter in a toilet with another man was strictly business. Within days, the trap was set. On June 5, 2007, Mokbel was arrested in a restaurant in Athens (carrying 3030’s doctored passport). As soon as the arrest was confirmed, police raided 22 properties in Melbourne, seizing drugs, guns, $790,000 in cash, rubber gloves, chemical equipment and an orange A4 exercise book that contained drug recipes. Tony Mokbel is escorted by plain clothes police officers after appearing before a public prosecutor at Athens Appeals Court building in June 2007. Credit: AP At Rizzo’s house, police found details of $400,000 in transfers to Mokbel in Greece, plus the golden thread: a spreadsheet documenting incomings and outgoings, and a list of drug quantities from July 2006 to June 2007. Court records show: “The document establishes that this group has been responsible for the production of approximately 42 kilos of amphetamine since July 2006, which generated an income for the group of approximately $4.2 million.”\n\nIn sentencing Rizzo to a minimum of 13 years, King said: “You with other members of the company monitored the quality of those drugs; stored the drugs until sold; cut and repackaged the drugs; marketed the drugs; and, through you, kept a book of account on The Company’s customers and monies flowing in and out.” In sentencing Mokbel over Operation Magnum, Justice Simon Whelan made it clear Rizzo’s accounting records and the phone taps were unshakeable evidence. “The telephone intercepts reveal two noteworthy matters in this regard,” he said. “First, you conducted yourself as a manager. You delegated. You gave advice. You encouraged co-operation. You sought to maintain morale. “I have given very serious consideration to imposing a life sentence on the Magnum offence. Your commission of that offence revealed, in my view, arrogant contempt for the law, and an incorrigible determination to persist in serious, business-like drug trafficking regardless of the circumstances or possible consequence.” Mokbel was sentenced to 20 years for Magnum.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/nsw/tricky-situation-sydney-commuter-car-park-to-be-deep-cleaned-after-homeless-evicted-20250917-p5mvx7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Tricky situation’: Sydney commuter car park to be deep cleaned after homeless evicted",
    "publish_date": "Fri, 19 Sep 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Anthony Segaert"
    ],
    "text": "The state government has ordered a deep clean of a busy commuter car park in Sydney’s southwest after months of increasing community concern about an encampment of homeless people living in the building.\n\nThe top three floors of the Warwick Farm commuter car park, which allows drivers to park for free before catching a train at the station next door, have become a no-go zone for drivers over the past three months as an increasing number of people have lived in the stairwells and upper storeys.\n\nRubbish strewn in front of the lifts and stairwell at Warwick Farm Commuter Car Park. Credit: Wolter Peeters\n\nBut residents have raised concerns about safety after not being able to access the fire escapes and witnessing drug use. All three stairwells in the building are covered in syringes, faeces and rotting food scraps, as well as mattresses, blankets and pieces of furniture. On parking levels, microwaves have been ripped apart and strewn across the floor, as well as hoses from fire hydrants.\n\n“It is a really tricky situation,” said Charishma Kaliyanda, the state Labor MP for the area, who has been fielding concerns from residents about increasingly aggressive behaviour from about 10 to 12 people living in the stairwells.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/why-this-inner-west-neighbourhood-gem-is-among-victoria-s-finest-places-to-dine-20250917-p5mvrv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why this inner-west neighbourhood gem is among Victoria’s finest places to dine",
    "publish_date": "Fri, 19 Sep 2025 11:29:33 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Advertisement\n\nReview Eating outYarraville Why this inner-west neighbourhood gem is among Victoria’s finest places to dine When Navi launched in a discrete shopfront in 2018, the feeling was “Welcome to my home”. The warmth persists, as does a surprising and fun tasting menu from former The Age Good Food Guide Chef of the Year, Julian Hills. Dani Valent September 19, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 8 Navi’s sleek, gallery-like space includes seats that face the open kitchen (left). Bonnie Savage 2 / 8 Suckling pig with chestnut and quince. Bonnie Savage 3 / 8 Beetroot with hazelnut and truffle. Bonnie Savage 4 / 8 Murray cod with fermented potato. Bonnie Savage 5 / 8 An internal archway separates Navi’s dining room (pictured) from its lounge bar. Bonnie Savage 6 / 8 “Elements of Aylesbury duck” is a signature dish, although the preparations change. Bonnie Savage 7 / 8 Finger lime ice-cream with black sesame meringue. Bonnie Savage 8 / 8 Navi owner and chef Julian Hills. Ed Sloane Previous Slide Next Slide Good Food hat Good Food hat 17 / 20 How we score Contemporary$$$$ If every neighbourhood needs a good baker, butcher and cafe, perhaps it also needs a perfect little fine-dining restaurant. Seven years in, Navi is just that. Since 2018, chef Julian Hills has taken diners on culinary adventures in a 30-seat dining room in a quiet inner-west pocket. The room – now with adjoining lounge bar – feels like a gallery, sparse and sleek, ready to showcase beauty and provoke amazement and delight over eight or so small courses. There’s a trend in contemporary dining towards simplicity, so let’s ask a tricky question: is there a point to expensive restaurants with complex food, hefty wine lists and waiters that can tell you which side of the hill the grapes grew on?\n\nAdvertisement\n\nIt’s all very well for a chef to work out that pickled magnolia flowers and raw fish taste nice together, but is there a pay-off for diners? Well, yes, when it’s as fun and surprising as Navi. Of course, a meal like this is an investment – but so is a ticket to the grand final. Navi is a restaurant that might make a jaded diner fall back in love with tasting menus, and it’s a welcoming entryway for people who’ve never eaten like this. Murray cod with fermented potato. Bonnie Savage A tasting menu (with, potentially, matched drinks, too) makes frequent interaction with waiters inevitable, but the polished, perceptive team here dances a delicate line between informing and interrupting. If you’re geeking out about the non-alcoholic beetroot “wine” with carrot and betel leaf, they’ll hang about to discuss it. If you’re screwing up the courage to propose to your one and only, they’ll just melt away.\n\nAdvertisement\n\nA meal like this is an investment – but so is a ticket to the grand final. Last time I visited, Hills was on a rare trip overseas. That might seem like a bad thing. Actually, it was an opportunity to witness the playful spirit he’s shared with his crew. Whether Hills is here or not, this is his singular vision. A creative guy who was studying ceramics when he fell into cooking at the Myer cafeteria in the 1990s, Hills realised he had a knack for flavour matches when the blue-rinse set started lining up for his roasts. “My brain is very busy,” the self-taught chef tells me later. “I can taste everything in my head before I put it on a plate.” He’s inspired by what’s growing – either in his own patch, on the farms of trusted suppliers or in secret foraging spots – and by the house-made preserves burbling away out the back. “Elements of Aylesbury duck” is a signature medley, although the preparations change. Bonnie Savage\n\nAdvertisement\n\nThe arrival snack is a black garlic macaron filled with salmon caviar, the only dish always on the menu and a pointer to the so-crazy-it-works approach. That might be followed by a tiny sourdough tart filled with sea urchin and gleaming apple-and-yuzu jelly. There’ll be a vegetable investigation: I had golden beetroot variously dried, fermented, pickled and roasted, a chewy, crunchy, earthy assembly that’s a rollercoaster for the taste buds. There’s always adroitly cooked duck breast served with other cleverly prepared parts – perhaps koji-brined duck heart, melting pancetta or kofte with liver, a signature medley expressing both consistency and perpetual curiosity, which resolves in pure enjoyment. Finger lime ice-cream with black sesame meringue. Bonnie Savage Dessert is based around a fermented finger lime ice-cream, sour and caramelised, briskly whipping around the palate.\n\nAdvertisement\n\nWhen Navi launched in 2018, the feeling was “Welcome to my home”. The warmth persists as the restaurant has grown into itself: more structure and breadth has allowed greater ambition, assuring this neighbourhood gem is among Victoria’s finest places to dine. The low-down Atmosphere: Fun fine-dining Go-to dishes: Black garlic and salmon roe macaron; elements of duck; finger lime ice-cream with black sesame meringue Drinks: The drinks are as adventurous as the food with wines from Slovenia, Portugal and Hungary dotted among the splendid selection. There’s also one of the best and most comprehensive non-alcoholic offerings in the state, with everything from bush tea to fermented concoctions. Cost: $195 set menu per person ($115 for lunch), excluding drinks This review was originally published in Good Weekend magazine Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-finals-2025-everything-you-need-to-know-20250917-p5mvpi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NRL finals 2025: Everything you need to know",
    "publish_date": "Fri, 19 Sep 2025 11:27:38 +1000",
    "category": "sports",
    "authors": [
      "Billie Eder",
      "Frances Howe"
    ],
    "text": "Meanwhile, the Raiders suffered a crushing defeat to the Broncos on Sunday afternoon in a 94-minute, 29-28 golden point thriller after an inspired performance from Reece Walsh helped Brisbane come back from two sin-bins and a 16-point deficit to claim victory. How does the NRL final series work Who’s playing who in week two? Brisbane and Melbourne have a week to put their feet up after winning their qualifying finals in week one.\n\nFor the remaining four teams – Sharks, Raiders, Panthers and Bulldogs – it’s time to do battle. First up, it’s the Raiders hosting the Sharks at 7.50pm on Saturday at GIO Stadium in Canberra in a must-win elimination semi-final. The winner will head to AAMI Park in Melbourne next week to play the Storm at 7.50pm, while the loser will just have to try their luck next year. Then, on Sunday at 4.05pm, it’s Penrith against the Bulldogs at Accor Stadium, in an elimination match that is expected to draw a crowd upwards of 70,000. Penrith are hunting their fifth consecutive premiership. If they manage to do it, they’ll be the first in NRL history to win a grand-final from outside the top four.\n\nThe winner of that match has the tough task of heading to Brisbane the next week to face the Broncos at Suncorp Stadium at 4.05pm in the preliminary final. NRLW captains Georgia Hale, Tiana Penitani-Gray, Yasmin Clydsdale, Kirra Dibb, Ali Brigginshaw and Isabelle Kelly. Credit: Flavio Brancaleone Meanwhile, the NRLW is in its first week of finals. The Roosters – who were undefeated this season – and the Broncos – whose only loss of the year was to the Roosters – have the week off after finishing one and two on the NRLW ladder. This week the Knights host the Titans in the first of the NRLW elimination finals, before the Cowboys face the Sharks in Townsville. This is the first year the Cowboys have played in the finals since they entered the NRLW in 2023.\n\nThe winner of the game in Newcastle will play the Broncos in the preliminary finals in Brisbane, while the winner of Townsville’s game will face the Roosters in Sydney. What date is the NRL grand final 2025? The NRL grand final will be held on Sunday, October 5, at Accor Stadium in Sydney. Public transport is free with any game ticket and additional trains and buses will be operating to get fans out to Olympic Park. A flat rate fee of $35 applies to all parking but must be pre-booked on the Sydney Olympic Park website.\n\nWhat time is the NRL grand final 2025 kick-off? Gates will open from 1pm with the state championship kicking off at 1.20pm, followed by the NRLW grand final kicking off at 3:55pm. The pre-game entertainment for the NRL grand final starts at 6.30pm and kick off is slated for 7.30pm with full-time expected to come to 9.20pm. Who are the favourites? Bookmakers have the Melbourne Storm as favourites for the 2025 premiership, with Sportsbet paying $3.10 for them to lift the trophy.\n\nUnfortunately for the Bulldogs, they’re the least likely to win the title according to the bookies who are paying $23 for the Belmore club to claim the title. Meanwhile, it’s the Storm and Broncos who are the frontrunners to make the grand final, ahead of Penrith, Canberra, Cronulla and Canterbury. Who is Teddy Swims, the grand final entertainment? While the AFL has locked in Snoop Dogg for their grand final this month, Grammy nominated singer-songwriter Teddy Swims is travelling from the US to perform at the NRL grand final. Swims was nominated for Best New Artist at this year’s Grammy Awards and his most popular song, Lose Control, has two billion streams on Spotify.\n\nLoading How to watch the NRL grand final 2025? Every NRL and NRLW finals series match will be free on Channel 9 and 9NOW, while also broadcast on Fox League, Kayo Sports, Sky NZ and Watch NRL. The grand final is exclusively live on Channel 9, with delayed coverage on Fox League and Kayo. There are still tickets available for the grand final ranging from $74 to $739 on Ticketek. NRL is Live and Free on Channel 9 & 9Now",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/national/woman-believed-missing-after-sydney-house-fire-20250919-p5mweg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman believed missing after Sydney house fire",
    "publish_date": "Fri, 19 Sep 2025 11:27:29 +1000",
    "category": "finance",
    "authors": [],
    "text": "Woman believed missing after Sydney house fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/suspicious-fire-engulfs-old-jam-factory-in-melbournes-east-20250919-p5mwef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Suspicious' fire engulfs old jam factory in Melbourne's east",
    "publish_date": "Fri, 19 Sep 2025 11:27:15 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Suspicious' fire engulfs old jam factory in Melbourne's east\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/first-look-karen-martini-s-new-restaurant-is-a-fresh-start-for-an-italian-fave-and-for-her-20250918-p5mw5n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "First look: Karen Martini’s new restaurant is a fresh start for an Italian fave (and for her)",
    "publish_date": "Fri, 19 Sep 2025 11:17:27 +1000",
    "category": "finance",
    "authors": [
      "Tomas Telegramma"
    ],
    "text": "Advertisement\n\nExclusive Eating outJust open First look: Karen Martini’s new restaurant is a fresh start for an Italian fave (and for her) The household name has taken the reins of Bar Carolina, retaining the South Yarra diner’s Italian identity but making it her own with big flavours and a big menu. Tomas Telegramma September 19, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nCelebrated chef Karen Martini is back in the restaurant game. She’s the new owner and executive chef of South Yarra’s Bar Carolina, taking over the eight-year-old Italian diner from founder Joe Mammone and reopening it after just a week’s hiatus. Martini has gone independent for her latest venture alongside husband Michael Sapountsis, following the untimely closure of her two most recent restaurants. Chef Karen Martini is on the pans at Bar Carolina, which she recently took over alongside husband Michael Sapountsis. Eddie Jim St Kilda’s hatted Saint George, where Martini was culinary director, shut for last year’s Christmas break and never reopened, with problem-plagued operator Public Hospitality group unable to guarantee its future, she says. Her hatted Federation Square restaurant Hero closed suddenly in 2023 after an eviction by state government-run film museum ACMI. “We feel [Bar Carolina] is very different,” says Martini. “It’s a breath of fresh air.”\n\nAdvertisement\n\nShe hopes it marks a return to the “great stability” of her previous venues Melbourne Wine Room and Mr Wolf, both of which clocked more than 15 years in St Kilda. 1 / 9 Outside Bar Carolina on Toorak Road. Eddie Jim 2 / 9 Olives, fefferoni, hand-rolled grissini and parmigiano reggiano fonduta. Eddie Jim 3 / 9 Cotoleta Milanese (fried crumbed veal). Eddie Jim 4 / 9 Bar Carolina has reopened after just a week hiatus. Eddie Jim 5 / 9 Cappelletti erbetto pasta with stracciatella, ricotta, greens, pecorino, brown butter and hazelnuts. Eddie Jim 6 / 9 Roast Bannockburn chicken with herbs and mushroom jus. Eddie Jim 7 / 9 Pizza soffio with mozzarella di bufala, chilli and burnt honey. Eddie Jim 8 / 9 Martini’s tiramisu. Eddie Jim 9 / 9 Martini and husband Michael Sapountsis have taken over South Yarra’s Bar Carolina. Chege Mbuthi Previous Slide Next Slide As a longtime fan of Bar Carolina and friend of Mammone, Martini jumped at the opportunity when talk of menu consultancy morphed into a passing of the baton. “We want it to be a great local restaurant, but also a destination restaurant,” says Martini. “It’s a real jewel of a spot at the top end of Toorak Road.” The core of designer Chris Connell’s original fit-out remains, from two-tone charcoal-and-white walls to terrazzo floors, with new linens and florals adding softness.\n\nAdvertisement\n\nBut Martini has rejigged the kitchen so she can more seamlessly make her mark on the menu, while also carrying on the legacy of Bar Carolina (including keeping the name). “We had to cross our hearts and hope to die [that we’d do] Italian,” says Martini. Related Article Exclusive A ‘mini-pub’ with dad rock and meat raffles opens in a legendary St Kilda site Her offering traverses Italy’s north and south, a moveable feast driven by seasonality that covers all bases from aperitivo hour to long lunching. It starts with cicchetti, small Venetian-style snacks that could be fried, stuffed olives all’ascolana or hand-rolled grissini to swipe through parmigiano reggiano fonduta like a cheesy dip.\n\nAdvertisement\n\nThen comes the antipasti. Confit artichokes are filled with finely minced prawn. Eye-fillet carpaccio has a steak tartare-esque dressing inspired by Venice icon Harry’s Bar. And deep-fried pizza fritta is topped with mozzarella, burnt honey and fermented chilli. Pizza soffio with mozzarella di bufala, chilli and burnt honey. Eddie Jim Housemade pasta is a given. “Already we can’t keep up with [the blue swimmer crab tagliarini orders],” says Martini. Four-cheese cappelletti, ring-shaped pasta parcels, are served on a verdant, herb-packed paste along with sage, brown butter and hazelnuts. Bannockburn chicken is browned in its own fat, with the seasonal add-on of morel mushrooms; O’Connor rib-eye is Josper-fired and sea-salt-crusted; and veal cotaletta is served bone-in for extra flavour. Related Article ‘Extremely frustrated’: Karen Martini and Guy Grossi’s pub restaurants facing uncertainty\n\nAdvertisement\n\nThe wine list spotlights big, bold Italian reds such as barolo and barbaresco, plus verdicchio, a lively Italian white that Martini hopes will get “people to go beyond chardonnay”. Drinks will soon start flowing upstairs when Martini reopens rooftop bar Tetto di Carolina just in time for summer, with a fresh rotation of cocktails and snacks. Lunch and dinner, Tuesday to Sunday 44 Toorak Road, South Yarra, instagram.com/barcarolina_sthyarra\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/lifestyle/psychologist-explains-how-perfectionism-impacts-us-20250919-p5mwdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Psychologist explains how ‘perfectionism’ impacts us",
    "publish_date": "Fri, 19 Sep 2025 11:00:00 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Psychologist explains how ‘perfectionism’ impacts us\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 47
  },
  {
    "url": "https://au.news.yahoo.com/does-asmr-really-help-anxiety-012618051.html",
    "title": "Does ASMR really help with anxiety? A psychology expert explains the evidence",
    "publish_date": "2025-09-19T01:26:18Z",
    "category": "lifestyle",
    "authors": [],
    "text": "Most of us have experienced tingling or “goosebumps” at some point, especially when we feel a strong positive emotion such as awe or excitement.\n\nBut some people have this response when they listen to certain sounds. Online videos which feature sounds of people whispering, crackling packets, and brushing or combing a microphone are all geared towards making you feel this positive tingle – the autonomous sensory meridian response, or ASMR.\n\nNot everyone responds to ASMR content. But many who do say it makes them less anxious and helps them sleep. What does the science say?\n\nWhat is ASMR?\n\nASMR is an involuntary emotional and physical response, typically to a sound, which causes a reflexive tingling sensation on the scalp and back of the neck.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis multi-sensory experience can make us feel euphoria and “psychological stability”, meaning we experience less inner turmoil and feel more calm.\n\nHowever, we still don’t have much evidence about what happens in the brain and the body when this occurs.\n\nSome argue that ASMR is simply an example of frisson (French for “shiver”). This is when an intense emotional stimulus – such as a tender moment in a movie – triggers tingling or gives us “the chills”.\n\nResearch suggests these so-called “skin orgasms” are due to a sudden rush of the chemical dopamine in the brain’s reward centres.\n\nHowever, the sense of awe or inspiration felt during a frisson experience is brief, (typically 4–5 seconds). In contrast, ASMR is usually described as inducing an enduring state of calm.\n\nWhat triggers ASMR?\n\nAlmost everyone will jump out of their skins if they experience a sudden and loud sound. This is because we’ve evolved to fear what is unpleasant or unexpected, to keep us safe from danger.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen it comes to sounds that can make us feel good, it’s not as easy to confirm whether there are universal triggers – that is, sounds that would make most people have the same positive reaction.\n\nResearch in ASMR has identified some common triggers, including whispering, tapping and crackling sounds. But we can’t say if these sounds would have the same effect on everyone.\n\nASMR videos often combine these sounds with video and role play known as “personal attention”. This means treating the camera like it is the viewer, speaking and interacting directly with it, and even simulating activities such as brushing hair or applying makeup to the viewer.\n\nWhy doesn’t it affect everyone?\n\nNot everyone responds to ASMR triggers, with some estimates suggesting only one in five people can experience ASMR.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhether or not you do is likely due to personality type and your predisposition to susceptibility, meaning how easily others can influence you.\n\nStudies have found those who respond are typically younger, experience more negative emotions, and are more introverted and critical. But they also tend to be more open to trying new things.\n\nSome research has suggested “expectancy effects” could play a role. This is like a placebo – people who are invested in ASMR’s potential as a therapeutic tool may be more likely to feel its effects.\n\nHowever, we still don’t know precisely how ASMR works to induce positive emotions.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMore than a dozen studies have reported on how the brain behaves during ASMR. But the findings across them are inconsistent and many have a very small number of participants or no comparison group, so we can’t draw conclusions.\n\nStudies looking at the body’s response during ASMR experiences have had similarly mixed results. Some have found people may experience both increased sweating (linked to the stress response) and decreased heart rate (linked to relaxation).\n\nTo describe this apparently contradictory state, some researchers have coined the term “arousing relaxation”.\n\nAnother theory is that the social or erotic aspects of ASMR videos are a more important trigger than sounds or other stimuli – basically, that it is a kind of sexual arousal. But we would need more evidence on this.\n\nThe bottom line\n\nWithout being able to identify universal triggers, it’s also difficult to apply ASMR as an evidence-based tool in therapy. To date, there are no clinical trials that link ASMR with short- or long-term therapeutic effects.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNevertheless, many people in the “whisper community” – those who produce and consume ASMR content online – claim ASMR helps them to relax, sleep better and reduce stress.\n\nSo, there’s no harm in ASMR if it helps you relax. But we would need more research to establish whether it’s effective as a clinical intervention for anxiety, insomnia or other conditions.\n\nThis article is republished from The Conversation. It was written by: Daniel Shepherd, Auckland University of Technology\n\nRead more:\n\n\n\nDaniel Shepherd does not work for, consult, own shares in or receive funding from any company or organisation that would benefit from this article, and has disclosed no relevant affiliations beyond their academic appointment.",
    "source": "Yahoo",
    "cluster_id": 48
  }
]