[
    {
        "url": "https://www.9news.com.au/finance/unemployment-april-jobless-rate-steady-4-1-per-cent/14ef20ab-6cdf-4ad7-b251-9e4f4f9a5fe1",
        "title": "Unemployment rate steady days before RBA interest rates meeting",
        "publish_date": "Thu, 15 May 2025 01:37:29 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "The unemployment rate has remained steady﻿ just days before the Reserve Bank's next decision on interest rates.\n\nThe unemployment rate has remained steady﻿ just days before the Reserve Bank's next decision on interest rates.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weather-news-rain-storms-forecast-for-eastern-australia-through-to-weekend/2c0b8720-f071-4ad7-88d3-e760e2994481",
        "title": "Millions set for major soaking that will last all weekend",
        "publish_date": "Thu, 15 May 2025 00:35:56 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Australia's east coast is in for a thorough soaking from today that is set to last right into next week in places.\n\nBureau of Meteorology senior meteorologist Miriam Bradbury said scattered showers had already developed over the east coast, centred around south-east Queensland and north-east New South Wales.\n\nFalls of 20mm to 25mm ﻿have been recorded, rising to up to 40mm in the above-mentioned regions.\n\nREAD MORE: Man who allegedly raided outback pub has a beer with owner ﻿\n\nThis map from Weatherzone shows the rain forecast for eastern Australia. (Weatherzone)\n\nThe heaviest falls so far have been on the Sunshine Coast and offshore Queensland islands, which received 50mm to 70mm of rain.\n\nToday, Bradbury said, the rain would become more widespread across central and southern Queensland as well as eastern and north-east NSW, driven by a low-pressure trough in the upper atmosphere and moist winds coming off the ocean.\n\n﻿Thunderstorms are expected in affected areas in Queensland as well as northern NSW, but not severe ones.\n\nREAD MORE: Search of NSW bush for woman missing for three weeks ﻿\n\nHeavy rain is expected in multiple states. (9News)\n\nThe rain will continue through the weekend along eastern Australia, beginning to clear in Queensland on Sunday.\n\nBut it is set to continue in NSW through to early next week, with rainfall totals of 50mm to 100mm expected to accumulate.﻿\n\nUnfortunately, beyond moderate scattered showers, the deluge won't affect drought-stricken areas in Victoria or South Australia.\n\nREAD MORE: New app slashing the cost of food launches in Queensland ﻿\n\nBradbury said southern Australia would be hit by a cold burst on Friday and Saturday, dropping the temperature up to 10 degrees.\n\nSnow may fall at 500m in Tasmania and 1000m in Victoria on Friday, but only in small amounts as a mass of dry air will soon follow.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/primary-school-bus-driver-describes-moment-of-crash/444ac69c-804d-4277-b8cc-6299c85e177b",
        "title": "Primary school bus driver describes moment of crash",
        "publish_date": "Wed, 14 May 2025 21:42:01 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A school bus driver has described slowing down and preparing to turn for more than 100 metres before a truck smashed into the vehicle, seriously injuring several children.\n\nGraham Stanley is giving evidence in the Victorian Supreme Court as truck driver Jamie Gleeson stands trial on seven counts of dangerous driving.\n\nIt's alleged Gleeson, 51, failed to maintain a proper distance from the bus or pay sufficient attention before the collision on the afternoon of May 16, 2023.\n\nGraham Stanley was driving 45 students from Exford Primary School in Eynesbury when Jamie Gleeson's truck crashed into the back of his bus in May 2023 in Victoria. (9News)\n\nSeven students were seriously injured in the crash that happened 900 metres from Exford Primary School, west of Melbourne.\n\nStanley yesterday told the court he began tapping on the brake pedal, activating the retarder system, about 100 metres before the crash.\n\nHe was unaware if the brake lights remained on throughout the entire slowing down period but he maintained his right-turn indicator was also on at the same time.\n\nStanley told the jury he first noticed Gleeson's truck behind him as he began the turn and he saw two large headlights in his side mirror.\n\n\"That's when I've felt and heard an impact shudder through the bus,\" he said.\n\nHe described slamming his foot on the brake pedal and grabbing the handbrake, causing the bus to spin and then roll on its side.\n\nForty-five Exford Primary School students were trapped inside the bus. (A Current Affair)\n\nStanley told the jury he heard screams and the next thing he remembered was lying on the door of the bus as the vehicle had tipped on its side.\n\nSome of the children were extracting themselves from the bus while others were still trapped with their seatbelts.\n\nStanley told the jury he helped carry one young boy out of the bus while other members of the public also assisted.\n\nThe bus driver admitted he could not recall whether he was wearing a seatbelt at the time of the crash, although he was confident all of the students were wearing one.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australian-housing-market-two-locations-emerge-as-front-runners-for-property-value-growth-according-to-real-estate-analysis-company-hotspotting/83e20c4c-91f2-46a4-85a2-7e65e7ff7c08",
        "title": "The surprising housing markets tipped for growth this year",
        "publish_date": "Wed, 14 May 2025 19:17:52 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "1 of 15 Attribution: Getty\n\nCity life, country life or somewhere in between?\n\nWhen it comes to the housing market, it pays to do your research.﻿\n\nTwo locations have emerged as the front runners for real estate capital growth prospects this year, according to Hotspotting's Price Predictor Index report for Autumn 2025.\n\nThe real estate analysis company's research indicated these markets gained a lead due to surging sales volumes and rising demand.\n\nHotspotting Director Terry Ryder said overall the report reinforced a growing theme.\n\n\"The best opportunities for growth aren't always in the largest or loudest markets,\" he said.\n\nClick through to find out which locations are on the rise for property value growth.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/too-good-to-go-australia-money-saving-app-launches-in-queensland/a883570c-794f-49e2-b058-869182e63903",
        "title": "New app slashing the cost of food launches in Queensland",
        "publish_date": "Wed, 14 May 2025 15:09:33 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "It's the world's largest marketplace of its kind and now the service is officially launching in Queensland .\n\nToo Good to Go helps keep businesses from throwing out unsold items at the end of the day by allowing customers to pick up leftover products for a fraction of the price, also helping consumers' budgets.\n\nThe app has now arrived in the Sunshine State after proving popular interstate, with 600,000 Australian users already.\n\nIt's the world's largest marketplace of its kind and now the service is officially launching in Queensland. (9News)\n\n\"We connect stores with consumers where we pick up surplus food that hasn't been sold that day,\" Joost Rietveld from Too Good To Go said.\n\n\"Typically you pay around let's say $10 for a 'surprise bag' and then what you get is usually around $30 of value.\"\n\nTessa Boehm signed up her Fortitude Valley juice bar, Pressi, two weeks ago.\n\n\"The minimal wastage of food is what's really attractive,\" she said, adding, \"everything's made with so much love\".\n\nBoehm's already blown away by the popularity of her \"surprise bags\", which go on sale when the store's closing time nears.\n\nTessa Boehm signed up her Fortitude Valley juice bar, Pressi, two weeks ago. (9News)\n\n\"[There's] around $21 value and the customers get it for about $7,\" she said.\n\nBoehm is already seeing repeat customers from the app.\n\n\"For store owners, they're not just seeing recovery of the costs, they're also seeing new faces come into their store,\" Rietveld said.\n\nWhile the main aim is to keep perfectly good food from going in the bin, there's also the potential for customers to take savings even further - for breakfast, school lunch boxes or even family dinners.\n\n\"It's actually exactly the same quality as the product that you would have bought five minutes before as a normal paying customer,\" Rietveld said.\n\n\"Pick up a 'surprise bag' with a lot of bread and put it into the freezer [and] you're really impacting your cost budget for that category.\"\n\nJoost Rietveld from Too Good To Go says families can save even more if they store the excess food correctly. (9News)\n\nMore than 100 Queensland stores have already gone live on the app, with more signing up every week. The app is free to download.\n\nBest advice is to reserve your surprise bag early in the day to ensure you don't miss out.\n\n\"In these day and ages everything is a little bit higher in price and if you can catch a bargain anywhere it's nice to do that,\" customer Crystal French told 9News.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/uber-dine-out-launches-in-sydney-as-worldfirst-feature-for-rideshare-platform/1d3b6071-0697-4040-a688-bfe34b99451b",
        "title": "Book a restaurant with Uber: A world first launches in Sydney",
        "publish_date": "Wed, 14 May 2025 15:00:00 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Global rideshare and food delivery service Uber is expanding its product offering with the launch of a new Dine Out option coming to Sydney in a world first.\n\nAnnounced in New York City yesterday (early today AEST) at the company's fifth annual Go Get product showcase, Dine Out will be a global program partnered with restaurant-booking service OpenTable to allow Uber customers to book a restaurant and the Uber ride there and back in one simple process.\n\n\"It's a thrill and privilege for Australia to be the first market anywhere in the world to test and finesse the new Dine Out product - one we know will benefit restaurants and bring additional convenience and value to Sydneysiders and visitors alike,\" Uber Eats Australia and New Zealand managing director Ed Kitchen said.\n\nREAD MORE: Warning after city hit by surge in dodgy tradies\n\nGlobal rideshare and food delivery service Uber is expanding its product offering with the launch of a new Dine Out option coming to Sydney in a world first. (Uber)\n\nREAD MORE: Shock discovery after man found slumped in car\n\n\"I am proud to be able to launch this technology for Australian small business owners in Sydney first, though as a proud Melburnian I've assured my friends and family that the plan is to launch in Victoria in the coming months.\"\n\nIt's hoped well-knownrestaurants like Catalina, Wings and Tins, Raw Bar and more will be available at launch next month, while existing Uber Eats partner restaurants who have only been doing delivery orders in the app will also join the Dine Out booking option.\n\nUber also signalled its intention to enter the world of autonomous cars through a partnership with Volkswagen to launch the VW ID.Buzz \"Kombi\" Van as a self-driving ride-sharing option in Los Angeles early next year.\n\nThis is an emerging space for the future of transport, with Google's Waymo already operating in multiple US cities (including Los Angeles) and Elon Musk's Tesla recently announcing a \"RoboTaxi\" version of its popular electric car.\n\nFor Australians, there's no sign of driverless Ubers any time soon, instead, in addition to the new Dine Out option there are a host of new features coming to existing and new users.\n\nThe new Uber feature was announced in New York City yesterday at the company's fifth annual Go Get product showcase. (Trevor Long)\n\nThese include new Ride Passes, which allow you as a subscriber to lock in a price on a specific route, ensuring you're avoiding any surges in price due to weather or traffic. A Prepaid Pass will allow you to pre-purchase between 5 and 20 rides on a regular route for additional discounts.\n\nUber is also going back to the future with a carpool-like product called Route Share, offering savings of up to 50 per cent on a trip, you'll share the journey with up to two other passengers where the Route Share operates on busy route corridors.\n\nThere are also new Member Days for Uber One monthly subscribers where partner organisations will offer discounts to members, and a new Savings Slider allowing you to compare prices on popular grocery items being ordered on the Uber Eats app.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/wage-price-index-march-quarter/10a79757-49e6-4ae9-b2a5-aa36b1c89156",
        "title": "Aussies get pay boost not seen for almost a year ahead of rate cut call",
        "publish_date": "Wed, 14 May 2025 04:34:08 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "Annual wage growth has increased for the ﻿first time since last June in a larger-than-expected rise that is unlikely to change the Reserve Bank's thinking when it meets to discuss interest rates next week.\n\nWages rose by ﻿0.9 in the March quarter, higher than what economists had predicted, and 3.4 per cent over the last 12 months, according to the Australian Bureau of Statistics' wage price index.﻿\n\nIt's the first time the annual measure has increased since the June 2024 quarter, and just the second rise ﻿since December 2023.\n\nAnnual wage growth has risen for the first in almost a year. (Louie Douvis/AFR)\n\nWith inflation rising by 2.4 per cent over the same period and core inflation up 2.9 per cent, the data signals working households are starting to see their earnings catch up with price rises.﻿\n\n﻿\"Annual wage growth ticked up for the first time since the June quarter 2024,\" ABS head of prices statistics Michelle Marquardt said.\n\n\"The 3.4 per cent increase in wages for the year to the March quarter 2025 was higher than the 3.2 per cent to the December quarter 2024, but lower than the 4.0 per cent at the same time last year.\"\n\n﻿While quarterly wage growth came in ahead of expectations, economists say the rise is unlikely to dissuade the Reserve Bank from an interest rate cut on Tuesday.\n\n\"Although wage growth is currently still above the long-run average, it has clearly moderated from last year's peaks,\" RSM Australia economist Devika Shivadekar said.\n\n\"This easing trend aligns with the RBA forecasts which anticipate wage growth to settle around 3.4 per cent in 2025 and ease further to 3.1 per cent in 2026.\n\n\"Today's data marked the first pickup in annual wage growth since mid-2024 which the RBA may view with some caution, particularly given the ongoing concerns around productivity.\n\n\"However, we still expect to see a 25-basis-point rate cut at next week's meeting.\"\n\nWage growth in the public sector outpaced rises in the private sector, and more than half of last quarter's overall rise was driven by new enterprise agreements, a factor unions have been quick to laud.\n\n\"Today's wage data is the clearest sign yet that working people are getting ahead after a decade of wage suppression and global inflation,\" ACTU president Michele O'Neil said.\n\n\"There's still a way to go, but today's data shows the importance of having more working people able to bargain over their wages and conditions.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ocd-study-genetics-obsessive-compulsive-disorder/5351091c-c785-44bc-9aca-b59fc00e3e45",
        "title": "Aussie scientists' breakthrough discovery about 'often misunderstood' condition",
        "publish_date": "Wed, 14 May 2025 12:46:21 +0000",
        "category": "lifestyle",
        "authors": [
            "May"
        ],
        "text": "Australian researchers have found the genes linked to Obsessive Compulsive Disorder (OCD) for the first time.\n\nScientists at ﻿QIMR Berghofer in Queensland did the biggest ever study into the mental health condition they say is \"often misunderstood.\"\n\nThey say it could now help treat some of the half a million Aussies who have it, and speed up diagnosis for others.﻿\n\nREAD MORE: ASIC sues broking arm of investment bank Macquarie\n\nProfessor Eske Derks said the new study is \"really exciting\". (Supplied)\n\nThe global research, published in Nature Genetics , involved more than 50,000 people with OCD and two million people who did not have it.\n\nIt pinpointed approximately 250 genes linked to OCD.\n\n\"This is the first study where we found actual genes that play a role in OCD, which is really exciting,\" says Professor Eske Derks, senior group leader of the Translational Neurogenomics Laboratory at QIMR Berghofer said.\n\n\"We've been working on this for many years, but these findings have dramatically increased our knowledge of the genetic basis of OCD.\"\n\nOCD is often categorised as an obsession with cleaning or checking.\n\nHowever, it can take many forms, including people worrying about harming others, doubts about relationships and existential worries.\n\nThe study revealed that genes linked to OCD are most active in three key brain areas: the hippocampus, striatum, and cerebral cortex.\n\nThe findings align with previous studies.\n\n\"We found a really large number of genes which are shared with anxiety disorders, depression and also with anorexia nervosa,\" Professor Derks said.\n\n\"There's a lot of overlap in the genes that cause these different mental health conditions.\"\n\nProfessor Derks called for more funding to take the research further.\n\n\"The next steps for our research team are to use these genetic discoveries to identify existing drugs, currently being used to treat other conditions, that may be effective for OCD patients, paving the way for more innovative treatment options,\" he said.\n\nOCD can start in late childhood or early teens, but can also begin for women after childbirth.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/melbourne-weather-may-unusually-warm-spell/38e17db1-dfe9-47aa-bd4e-72e4577c1f55",
        "title": "Aussie city is experiencing an unusually warm spell. How long will it last?",
        "publish_date": "Wed, 14 May 2025 06:47:32 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "M﻿elbourne is experiencing an unusually warm spell this month, but it could all be over sooner rather than later.\n\nThe city saw temperatures exceed 20 degrees for nine out of 13 days this month, according to figures from the Bureau of Meteorology.\n\nThis month's average maximum temperature so far ﻿is currently about 3.9 degrees above last year's monthly average of 17.3 degrees.\n\nM﻿elbourne is experiencing an unusually warm spell this month. (Nine)\n\nThe city saw temperatures exceed 20 degrees for nine out of 13 days this month. (Nine)\n\n﻿While temperatures have been up, rainfall has been down.\n\nWeatherzone found that there was a mere 1.2mm of rainfall recorded in Melbourne this month, following the below-average rainfall trends seen in the past three months.\n\nBut the ﻿surprisingly nice weather is about to end this weekend as a cold front over Tasmania grazes over Victoria.\n\nShowers and a maximum of 15 degrees are forecast on Saturday, and easing showers and a maximum of 14 degrees are forecast on Sunday. ﻿﻿\n\nCome next week, the weather is expected to pick back up again.\n\nCome next week, the weather is expected to pick back up again. (Nine)\n\nSunny conditions and temperatures nearing 20 degrees are forecast for Monday and Tuesday. ﻿\n\nWeatherzone said there is no indication that cold and wet weather will return in the medium to long term, despite being weeks out from winter. ﻿\n\nParts of the country have recorded their driest start to the year on record due to a lack of autumn rain.\n\nIt's worsened drought conditions in Victoria, South Australia and Tasmania. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/unemployment-rate-australia-april-2025/105295108",
        "title": "Breaking: Employment surges in April and unemployment rate holds steady",
        "publish_date": "Thu, 15 May 2025 01:34:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's unemployment rate held steady in April, as 89,000 people found employment — much stronger jobs growth than had been forecast.\n\nThe unemployment rate remained at 4.1 per cent last month, the same level as in March, in seasonally adjusted terms.\n\nThe rise in employment was larger for females, up 65,000 (0.9 per cent), while male employment was up 24,000 (0.3 per cent).\n\nFemale employment growth was mainly in full-time workers, which rose 42,000 (1.1 per cent) in April. Female part-time workers rose by 23,000 (0.8 per cent).\n\nThe ABS data show employment has grown by 390,000 people over the year (+2.7 per cent), an annual growth rate that is much higher than the population growth rate for people aged 15 years and over (+2.1 per cent).\n\nThe strong growth in employment saw the employment-to-population ratio lift by 0.3 percentage points to 64.4 per cent in April, which is just below the record high of 64.5 per cent recorded in January.\n\nWith the addition of 6,000 officially unemployed people (actively looking for work), the labour force swelled by 95,000 people in April, lifting the participation rate by 0.3 percentage points to 67.1 per cent.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/electric-vehicle-sales-hit-new-highs-on-chinese-demand/105293668",
        "title": "Chinese demand pushes global EV sales to new highs in 2024",
        "publish_date": "Thu, 15 May 2025 00:30:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The share of electric car sales climbed to 20 per cent of all vehicles sold in 2024, according to a new report by the International Energy Agency.\n\nSales growth was strongest in China, where 11 million EVs were sold, making up almost half of all Chinese vehicle sales.\n\nSouth-East Asian and Latin American markets were hot spots for sales increases over 2024, jumping by 50 per cent compared with 2023.\n\nGrowth lagged in the European Union and the United States, where sales grew by 20 per cent 10 per cent respectively.\n\n\"We know there are economic, trade and technology uncertainties in the world now, and questions about whether sales are going up or down,\" IEA executive director Faith Birol said.\n\n\"Our numbers show that despite many headlines saying EVs were not doing good in terms of sales, our numbers show another record of 17 million EVs, or an increase of 20 per cent compared with the previous year.\n\n\"Some emerging countries are seeing strong growth in EV sales, albeit from a low base, especially Vietnam, Thailand, Brazil Indonesia and elsewhere.\"\n\nChinese manufacturers are driving growth in EV market share across South-East Asian and Latin American markets. (Reuters: Chalinee Thirasupa)\n\nAustralian EV sales up by 14 per cent\n\nAustralian sales of battery electric vehicles, plug-in hybrids and fuel cell electric vehicles rose by 14 per cent from 98,000 in 2023 to 112,000 in 2024.\n\nSales of plug-in hybrid vehicles, which contain a battery and internal combustion engine, saw the strongest increase, rising from 11,000 in 2023 to 21,000 in 2024.\n\nLoading YouTube content\n\nBattery electric vehicle sales rose by nearly 6 per cent, from 87,000 in 2023, to 91,000 in 2024.\n\nAccording to the Electric Vechile Council the most popular models sold in Australia were the Tesla Model Y and Model 3, and BYD Atto and Seal.\n\nA small number of fuel cell electric vehicles, like the Toyota Miraim, have been sold in Australia since 2021 and are predominantly used as fleet vehicles.\n\nVehicle emissions policy driving sales growth\n\nWhile China is expected to maintain its dominance in EV sales and manufacturing over the coming years, vehicle emissions standards in the United Kingdom and EU are tipped to drive higher sales in those markets.\n\n\"These policy pushes are expected to drive up electric car sales in Europe in 2025 to reach a sales share of 25 per cent, despite flexibility given to automakers for meeting the 2025 EU emissions reduction target,\" the report said.\n\nBy 2030, the IEA expects EV sales to climb to 40 per cent of all vehicles sold globally, with China remaining the dominant market.\n\nIn that year, EV sales are pegged at 80 per cent of all vehicles sold in China.\n\nThe EU's current targets for CO2 emissions have the potential to drive the EV sales share to 60 per cent of sales in that market, while the US is only expected to hit a sales share of 20 per cent.\n\nTrade and industrial policy, charging technology and the concentration of critical minerals processing are expected to be significant forces shaping the future direction of EV sales are around the world.\n\nCharging your EV could be a simple as finding a car park Photo shows A graphic of a man charging an EV on a power pole with a colour treatment drawing attention A lack of charging infrastructure across the country is often cited as a barrier to the transition to electric vehicles. But soon, EV charging could be a simple as finding a car park.\n\nThe EU, Canada and the US all have steep tariffs of up to 100 per cent on Chinese-made EVs.\n\nChina's dominance in rare earth, lithium, cobalt, nickel and graphite processing was described as \"not good news\" for the future of the industry by Mr Birol.\n\n\"This concentration is not good news, China is dominating this game big time,\" he said.\n\n\"In terms of energy security, one of our golden rules is diversification, and if want to see more diversification in EVs there is a need for other countries and other companies to be significant players in the game.\"\n\nAffordability improving in comparison to non-electric vehicles\n\nIn the EU and US, battery electric vehicles are still, on average, more expensive than a conventional internal combustion engine (ICE) counterpart, the IEA report said.\n\nIn Germany, an EV was 20 per cent more expensive than an ICE alternative, while US EV prices were 30 per cent higher.\n\nChinese manufacturers offering EVs in emerging markets were a key driver of sales, with EV and ICE vehicle prices reaching parity in Thailand, and the gap shrinking to 25 per cent in Brazil, compared to 100 per cent in 2023.\n\nIn China, EV sales accounted for half of all vehicles sold in 2024. (Reuters: Nick Carey)\n\nThe IEA said the gap between ICE and EV prices in Mexico fell to 50 per cent in 2024, from 100 per cent the year prior, driving sales of Chinese imports up to 66 per cent of all sales.\n\nMr Birol said analysis of the life-time costs of running an EV were cheaper than a conventional car.\n\n\"On a kilometre-driven basis, on the data we have today with oil at $US66 a barrel, in all key markets it is cheaper to run your car with electricity,\" he said.\n\nCharging forward\n\nDemand for EV batteries is expected to drive overall battery demand from now until 2023, according to the IEA.\n\nBut demand is expected to be super-charged by the wider adoption of electric heavy vehicles, including trucks and buses, which grew by 80 per cent in 2024, mainly driven by China.\n\nThere was no change to the average range of EVs in 2024, which is estimated at 340km across all models.\n\n\"As market competition intensifies, the fact that average range has stabilised in the past year could indicate that car makers have found an optimal balance between range performance and vehicle manufacturing costs,\" the report said.\n\nThe IEA expects 20 million EVs to be sold in 2025.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/blog-erin-patterson-mushroom-trial-thursday-may-15/105294536",
        "title": "Live: Evidence continues in Erin Patterson's mushroom murder trial",
        "publish_date": "Thu, 15 May 2025 00:29:50 +0000",
        "category": "finance",
        "authors": [
            "Judd Boaz",
            "Tim Callanan"
        ],
        "text": "Ms Cripps tells the court she and Erin Patterson discussed the dried bag of mushrooms she said she had obtained from an Asian grocer.\n\nErin told Ms Cripps she was initially going to use the mushrooms in a carbonara around April, but when she opened them, they had a very strong smell.\n\nMs Cripps then says Erin explained a beef Wellington would be more suitable to use the mushrooms in.\n\n\"She felt they wouldn't be the primary flavour,\" Ms Cripps says. \"[She says] she rehydrated them and she mixed them up with the mushrooms she got from Woolworths.\"\n\nMs Cripps then asked Erin if she had picked the mushrooms, but says Erin did not answer, and was instead looking at her phone.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/the-piano-quiz-trivia-how-much-do-you-know/105109734",
        "title": "How much do you know about the piano?",
        "publish_date": "Thu, 15 May 2025 00:28:14 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Centuries after it was invented, the piano is still one of the most popular instruments in Australia and the world.\n\nBut do you know how many parts they have? Or what piano keys are made of?\n\nWhether you're a novice, an expert, or have never touched a piano before, take our quiz to find out more about this classic instrument.\n\nLoading\n\nStream The Piano free on ABC iview.\n\nVote for your favourite piano music in the Classic 100: Piano.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/birth-certificate-patsy-bedford-75-years-old-kimberley/105287188",
        "title": "Patsy finally gets a birth certificate after 75 years of 'not existing'",
        "publish_date": "Thu, 15 May 2025 00:04:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Bunuba elder Patsy Ngalu Bedford is a respected community leader in Western Australia's far north, but for the past 75 years of her life, at least according to government records, she did not exist.\n\nShe is one of many Indigenous people across the Kimberley whose birth was not registered.\n\n\"Our people right across the Kimberley who were born in the bush, who were born in their homelands, [who] weren't given a birth date, we struggled,\" she said.\n\n\"I'm an elder and this year was my year of getting my birth certificate.\n\n\" We were told without a birth certificate, 'You're not a citizen of Australia', so this just made by day. \"\n\nDepartment working to complete records\n\nLong-awaited registrations like Ms Bedford's are part of an outreach program by the WA Department of Justice's Registry of Births, Deaths and Marriages.\n\nThe department's Marnie Giles has been travelling to remote and regional communities to provide outreach services and met Ms Bedford during a visit to Fitzroy Crossing last year, assisted by the Marra Worra Worra Aboriginal Corporation.\n\n\"After a little bit more of a conversation we found out [Ms Bedford] was not registered and I was able to assist her to get that process started,\" Ms Giles said.\n\nFor 75 years of her life elder Patsy Bedford lived without a birth certificate. (ABC Kimberley: Rosanne Maloney)\n\nShe said the process worked through trust and collaboration.\n\n\"One of the first things we do is make sure people understand it's their story that they choose to share with us,\" she said.\n\n\" We ask people questions about anything they know about where they were born, anywhere they might have gone to school, where they spent time as a child and growing up. \"\n\nMs Giles said the team then conducted searches within databases and collaborated with the Aboriginal History research service with permission from the applicant.\n\nHundreds of people unregistered\n\nRecovery efforts following record floods in the Fitzroy Valley in 2023 revealed that hundreds of Aboriginal residents were not registered at birth.\n\nA 2016 study published in the Australian and New Zealand Journal of Public Health found nearly one in five Aboriginal children under the age of 16 in WA had unregistered births.\n\nMeanwhile a 2024 UNICEF report found that 12,600 children on average each year in Australia were missing out on an early childhood education because they did not have a birth certificate.\n\nMs Giles said it was common to encounter unregistered people during every visit to remote and regional communities.\n\n\"It's not just people like Patsy who is 75, we also help all ages, babies, newborns, teenagers, a whole lot,\" she said.\n\n\"Particularly in the Kimberley; there are lots of unregistered people. That's part of the reason we get out there as often as we can.\"\n\nMs Giles said the outreach team meets residents who are unregistered on most visits to the Kimberley. (ABC News: Stephanie Zillman)\n\nMs Giles said delivering Ms Bedford's birth certificate was a special moment.\n\n\"We feel so privileged to hear people's stories and get a result like that for someone like Patsy, so it was quite a highlight — it's pretty wonderful,\" she said.\n\nFor Ms Bedford, it was more than just a personal experience.\n\n\"It is on behalf of all the rest of our people that were born in the bush — that was our hospital, we were given names,\" she said.\n\n\"My first name was Ngalu and I stuck to that.\n\n\"Anthropologists changed my name but that was my given name at birth and my skin was Nyanyjili so we should be going back to those days.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/wa-maternity-hospital-builder-goes-into-voluntary-administration/105294428",
        "title": "New maternity hospital on track despite losing builder, minister says",
        "publish_date": "Wed, 14 May 2025 23:59:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of the joint venture partners chosen to build Perth's new maternity hospital has entered voluntary administration after months of uncertainty, but the Western Australian government is adamant the project remains on track.\n\nGlobal management firm FTI Consulting has been appointed to examine the financial position of builder Roberts Co and its parent entity, RCAH Group.\n\nRoberts Co was chosen alongside European construction giant Webuild as joint venture partners for the hospital in December 2024, tasked with building a replacement for the ageing King Edward Memorial Hospital (KEMH).\n\nNew $1.8b maternity hospital to be built at Fiona Stanley Photo shows A baby's hand clenched in a fist in a bed with bumble bee printed sheets The WA premier announces plans to build a maternity hospital at the Queen Elizabeth II Medical Centre will no longer go ahead, instead committing almost $2b to a site in Perth's south.\n\nThe government wants the $1.8 billion Women and Babies Hospital to be co-located with Fiona Stanley Hospital (FSH) in Murdoch.\n\nBut RCAH Group was recently wound down, with its New South Wales arm sold to a Middle East developer.\n\nThe Victorian arm of the business entered administration in March, while the WA branch followed suit last week.\n\nSearch for new builder\n\nConstruction of the hospital had been due to begin later this year, but the loss of Roberts Co is likely to force the government into searching for a new builder to partner Webuild, which has a 70 per cent stake in the project.\n\nHealth Infrastructure Minister John Carey, who confirmed the departure of Roberts Co from the project, has indicated that process is already underway.\n\nJohn Carey says there will be \"some important announcements soon\" about the hospital project. (ABC News: Keane Bourke)\n\n\"The procurement process and engagement with Webuild continues to progress well and the Government will make some important announcements soon,\" Mr Carey said in a statement.\n\n\" The project continues to progress to its schedule. \"\n\nIn a statement, FTI Consulting confirmed Roberts Co had also sold its WA business interests, and administrators would examine those transactions before reporting to creditors.\n\n\"We are aware there is interest from stakeholders of the business to propose a deed of company arrangement (DOCA) with the view of providing a better return to creditors in a timely manner, which will be considered in due course,\" the statement said.\n\nHospital site criticised\n\nThe state government announced the hospital project in April 2023, saying the facility would be built at FSH and would open its doors by 2029.\n\nThat raised concerns among clinicians about travel distances between the new campus and Perth Children's Hospital (PCH), with KEMH's former head of anaesthesia Tim Pavy claiming lives would be at risk.\n\nDoctors issue warning over maternity hospital move Photo shows A sign on a building saying Fiona Stanley Hospital Doctors fear plans to move WA's main women's and babies' hospital 20 kilometres from its current location risk increased \"mortality and morbidity\" of critically unwell infants.\n\nThe then-WA health minister Amber-Jade Sanderson downplayed those fears, saying the hospital would include improved neo-natal facilities.\n\nThe Liberals entered the state election also criticising the plan and claiming babies would die as a result, saying they would build the hospital on a car park site at the Queen Elizabeth II Medical Centre in Nedlands.\n\nThe Australian Medical Association WA said it wanted maternity, paediatric and adult medical services to be \"tri-located\" at one site.\n\nRoberts Co is also the builder behind luxury Scarborough apartment complex The Dunes Beachfront.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/tottenham-hotspurs-dejan-kulusevski-miss-europa-league-final/105294614",
        "title": "Postecoglou's Spurs suffer major injury blow ahead of Europe League final",
        "publish_date": "Wed, 14 May 2025 23:40:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou has been dealt a huge blow in his bid to steer Tottenham to the Europa League crown with star man Dejan Kulusevski ruled out of the final against Manchester United following surgery on his right knee.\n\nKulusevski suffered the injury in Sunday's 2-0 loss at home to Crystal Palace after being caught by a challenge from Marc Guehi and had to come off in the 19th minute.\n\nABC Sport will live blog of the Europa League final between Tottenham Hotspur and Manchester United on Thursday, May 22, with kick-off at 5am AEST.\n\nPostecoglou had hoped the Swedish playmaker would be fine, but after scans the club revealed on Wednesday: \"Dejan Kulusevski suffered an injury to his right patella.\n\n\"Following further specialist consultation, the midfielder has undergone surgery today, and will commence his rehabilitation with our medical staff immediately.\"\n\nDejan Kulusevski came off the field in the first half of Tottenham's loss to Crystal Palace last weekend. (Reuters: David Klein)\n\nKulusevski's unlikely prospects follow those of key midfield duo James Maddison, who suffered a knee injury in the 3-1 Europa League semifinal win over Bodo/Glimt on May 1, and Lucas Bergvall, who endured ankle ligament damage in training before that match.\n\nThe absence of that trio could be potentially calamitous, leaving Spurs without their two principal creative playmakers and their go-forward Swedish central midfielder Bergvall as they seek to end their 17-year trophy drought.\n\nKulusevski has been a stand-out player at the Tottenham Hotspur Stadium ever since signing at the start of last season, with his 10 goals and 11 assists in 50 appearances in the latest campaign one of the bright spots amid Spurs' plight.\n\nMeanwhile, United's equally beleaguered coach Ruben Amorim — his side are 16th, one place above Spurs — put on a brave face on Wednesday about his own \"must-win\" final, saying there's no chances he'll be leaving United any time soon.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I have a clear idea what to do. I understand the problems of the team, so I'm far from quitting,\" said Amorim, who's certain to oversee the worst ever points total and the lowest league finish by any United side in the Premier League era but could still get them to the Champions League, the prize for the Europa League champs.\n\n\"What I'm saying is that we need to perform and, we have this season, and in the future we need to perform or else they will change us.\n\n\"It is going to be really bad (if we don't get to the Champions League). I don't want to use that as an excuse.\n\n\"It is going to be really tough, and the patience of the fans and you guys (in the media) next year if we don't win it is going to be on the limit and we have to be perfect to continue with everything. I know that, so it's not going to be better in that way.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/tiktok-star-bridey-drake-renovates-outback-homes-with-dad/105290702",
        "title": "TikTok star's outback reno side hustle boosts father-daughter bond",
        "publish_date": "Wed, 14 May 2025 23:38:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a mostly empty residential street in far west New South Wales, the piercing drone of power tools can be heard as a father-and-daughter duo breathe new life into an old home, one floorboard at a time.\n\nWhat sets them apart, however, is their renovation project has an invisible audience in the millions through social media.\n\nBridey Drake, 24, started gaining an online following a few years ago during the COVID-19 pandemic, with audiences loving her down-to-earth personality and infectious laughter.\n\nShe now has millions of followers on TikTok, Instagram and YouTube, and was recently named the 2024 Australian TikTok Creator of the Year.\n\nBridey Drake (left), pictured with fellow content creator Jiny Maeng, is an Australian social media star. (Supplied: Born Bred Talent)\n\nBut it was a road trip to Bourke with her mother a few years ago which put her on a journey that now blends her love of content creation and time with family.\n\n\"I said I wanted to see where my family came from so I just got in the car with my mum and we drove to the outback,\" Ms Drake said.\n\n\" Before I knew it we stumbled across Broken Hill and I thought 'I love this town' and bought a house here without looking through it. \"\n\nLoading Instagram content\n\nPart-time outback living\n\nMs Drake's spontaneous purchase and decision to renovate the house herself came as a surprise to her father Casey, who also became involved in working on it and two further houses his daughter has since bought in the Silver City.\n\nUpdates on the renovations and the pair's associated adventures become a major source of content for the young creator whenever she visits.\n\nMr Drake, a recently retired schoolteacher who had always lived on the coast, said he was initially sceptical but realised it presented an opportunity to regularly connect with his daughter.\n\n\"The driving force was largely from Bridey's mum. I think she also looked up the rental returns out here which are very good,\" Mr Drake said.\n\n\"The town's really grown on me. But I can't drive home and spend two weeks there and come back out.\"\n\nMore than just content\n\nMs Drake credits her father with much of the labour-intensive tasks but has not completely shied away from the tools herself.\n\nMs Drake has picked up a few renovation skills across the past couple of years. (ABC News: Oliver Brown)\n\n\"I can use a drill, I can use a sander, I can paint anything and little tips and tricks like how to find a stud in a wall,\" she said with a laugh.\n\nShe also prided herself on finding second-hand furniture at the local tip-shop and revitalising it for use in the home once it was fully refurbished.\n\nMore than anything, however, she said her semi-regular trips to the city were perfect to help her unwind away from her busy life on the coast.\n\n\"It's a place where I don't have to be anyone or do anything or show up in any way, I just get to be myself with my dad,\" she said.\n\nMs Drake regularly includes family members, including her dad, in her videos. (ABC News: Oliver Brown)\n\n\"Having that one-on-one time with him is really beautiful and also he loves to renovate. He's really good at it so it's nice to be able to see him do what he loves.\"\n\nMr Drake said he tried to put as little pressure on his daughter as possible while on their outback trips, instead preferring to pass on life lessons.\n\n\"The best time is when we finish for the day and go and have a schnitty and a couple of drinks,\" he said.\n\n\" That's when our conversation's always the richest. \"\n\nSpending time together is Bridey and Casey's main priority when they travel to Broken Hill. (ABC News: Oliver Brown)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/australian-artist-nara-walker-on-art-after-iceland-prison/104592914",
        "title": "This Australian artist was imprisoned in Iceland. To endure it, she painted",
        "publish_date": "Wed, 14 May 2025 23:14:08 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Sitting in the Sunshine Coast heat on a back porch with artist Nara Walker feels worlds away from an Icelandic prison.\n\nIt's humid and water condenses in small dots on Walker's nose — but the story she tells is chilling.\n\n\"You have to wear your own clothes in Icelandic prisons. I kept away from stripey things, because I was like, 'I don't want to feel like I'm in prison,'\" Walker says, between bites of leftover pizza, and sips of a nettle tea she shipped over from Iceland.\n\n\"I had these white pants that I ended up painting and, once I was out of prison and I wore them out, I got so many compliments on them … I remember this American, a sweet young woman, telling me how much she loved my pants. And I was like, 'Yeah, I painted them when I was in prison,' and she just gave me this really weird look.\"\n\nIt's been eight years since Walker's name was splashed across international headlines after being convicted for assaulting her then partner and being imprisoned in a high-security jail near Reykjavik.\n\nThrough it all, she painted — a creative expression that helped her endure; that has always helped her.\n\nPainting has been integral to Walker processing her experience in Iceland. (ABC Arts: Eloise Fuss)\n\n\"I'm making very expressionistic art … in that it's moved through my emotions. It's created as a response to something,\" she says.\n\n\"My experience with facing a court system, facing a travel ban, all of that would be so different because, no matter what, I was never alone because I had my art. I always had a form of expression.\"\n\nWalker uses her whole body to create expressive paintings, a process she finds therapeutic. (ABC Arts: Eloise Fuss)\n\nIt's been four years since Walker, who was released from Hólmsheiði Prison in May 2019, returned to Australia.\n\nIn the garden shed-turned art studio in her mum's backyard in Queensland, Walker paints fast, finishing a few paintings a week.\n\nThe practice helps her to reconnect to herself, process traumatic memories and heal.\n\nThough she doesn't see her work as art therapy.\n\n\"My work is therapeutic but I am an artist, in the forefront,\" she says.\n\nShe's also, since her return to Australia, been fighting — alongside several other women, backed by Icelandic women's and equality organisations — for Iceland to change how it investigates and prosecutes violence against women.\n\nThe women are suing Iceland for what they allege is a failure to protect them from gender-based violence and inadequate investigation of their claims. A judgement from the European Court of Human Rights is forthcoming.\n\n\"Art is an amazing gift for us as humanity, to be able to witness other people's inner journeys, and then ... to understand.\" (ABC Arts: Eloise Fuss)\n\nA state of shock\n\nIn 2018, Walker was involved in an incident with her then-partner, in which she, as her mother would later tell an Iceland court, \"defended herself when he stuck his tongue right down her throat and she bit down on his tongue and took off the tip of it\". Walker was arrested soon after.\n\n\"I didn't really understand what I had done. I was kind of observing myself from outside of my body,\" Walker says.\n\n\"Suddenly, the police were there and I was just in a state of shock and kind of shaking on the stairs and not really understanding the whole thing of what had just happened.\n\n\"The police came in, they ended up handcuffing me, and I just … kept repeating that I was the victim.\"\n\n\"How could a love be so wrong,\" Walker wrote in her journal in Iceland. (ABC Arts: Eloise Fuss)\n\nIn her trial in Iceland, Walker gave evidence detailing years of abuse from her partner, including text messages where he admitted putting the drug LSD in her tea. But the Icelandic system does not always recognise a woman's experience of domestic violence as a defence for assault.\n\nHer ex-partner has denied the abuse allegations.\n\nThe work Walker created in prison is \"very raw\", she says. (ABC Arts: Eloise Fuss)\n\nPainting to survive\n\nThree difficult years navigating Iceland's legal system followed — but Walker employed art as a survival tool whenever she could.\n\nBefore she was formally convicted, her passport was confiscated. She became homeless, was eating at a soup kitchen and rapidly lost weight. Her hair began to fall out.\n\nStories about her made national and international media. It wasn't until weeks later, when the news died down, that women's shelters in Reykjavik agreed to see her.\n\nWhen she first arrived at a shelter, she didn't have art materials so she used her phone to create. She made a video featuring black and white images of her face, switching between dead stares and grainy screams.\n\n\"I called it Silent Scream because the images really capture the angst of what I was experiencing in that moment in time. It's such an internal journey of pain and suffering.\"\n\nLoading YouTube content\n\nWalker would come to learn that while Iceland is reported to be the world's most gender-equal country, statistics of gender-based and sexual violence are high.\n\nWalker was convicted of assault on March 7, 2018, and was handed a 12-month sentence. On appeal, her sentence was increased to 18 months, with 15 months suspended. Walker ultimately spent one month in high-security prison and two in a community facility.\n\nIn prison, where Walker was allowed paints and markers, she says she wanted to \"fall to the ground and scream, cry and rip my hair out, but I had to hold composure\".\n\n\"I had different tactics, which was my art, movement [and] writing.\n\n\"I was painting and drawing lots and lots of abstract faces,\" she says.\n\n\"It was really interesting. I was like, 'Maybe these faces are all these people who have been experiencing trauma like my own,' and in some way, it's almost like I'm not alone — I had these faces with me.\n\n\"Some of them are really scary … and dark.\"\n\nIn prison, painting after painting of abstracted faces poured out of Walker. (ABC Arts: Eloise Fuss)\n\nWalker made a lot of paintings in prison, about 75, and later exhibited them in Reykjavik in an exhibition called Room.\n\n\"I filled the wall with all of these pieces, and was very lucky to then connect with the arts community there.\"\n\nShe served her three-month term and was released in May 2019. The suspended portion of her sentence expired in August 2020.\n\nUnable to leave the country until her suspended sentence was over and passport returned, Walker lived in a halfway house, then began staying in artist residencies around Iceland.\n\n\"I was making so much art … I started to connect with this resilient side of myself, not just the survivor.\n\n\"It was a very pinnacle point where I was able to connect with who I was before all of this because art is who I am.\"\n\nWalker's paintings sometimes begin as charcoal drawings, such as these ones being unrolled in her studio. (ABC Arts: Eloise Fuss)\n\nPainting with her whole body\n\nWalker returned to Australia in 2019 to the sanctuary of her mum's Sunshine Coast house, which backs onto a quiet patch of tropical scrub. She nonchalantly mentions to watch out for pythons — a small-fry threat for her nowadays.\n\nWalker's begun to notice a \"massive change\" in herself. \"Suddenly, I was like, 'Oh, I'm feeling [like] me again.'\" Pictured wearing a dress she designed featuring her art. (ABC Arts: Eloise Fuss)\n\nEntering her backyard studio, Walker readies to paint. A small fan hums, pushing away the oily fumes.\n\nShe squeezes paint directly on her gloves and mixes hues using her fingertips. She's almost trance-like as she smears her hands across the canvas.\n\nHer physical approach to art-making has been integral to healing.\n\n\"Some people sit down and they paint small pictures. I'm standing up, I'm moving, I'm using my whole body to paint,\" she says.\n\n\"I'm not just talking like I do in my talk therapy — which is really helpful, but I need the physical therapy in art and movement as well.\"\n\n\"While I'm painting, I'm kind of like clearing my body and cleansing it in some way, like there's something coming out of my body.\" (ABC Arts: Eloise Fuss)\n\nSometimes the movements are fast, other times very slow, pushing and scraping the paint against the surface.\n\n\"Painting is very meditative for me. It's a very calming act and also simultaneously exciting,\" Walker says.\n\n\"My process in creating is very physical, and a part of being physical is also enabling my body to share that subconscious language, which lives within me.\"\n\nShe says her work has sometimes been described as \"grotesque\", due to the colour and the marks.\n\n\"I feel like sometimes my work has been judged by others … it doesn't look pretty, or it's not like what is supposedly feminine.\"\n\nWalker refuses to be influenced by that kind of judgement.\n\n\"I was aware of this side of me coming out … I went into this space just allowing myself to make chaotic, messy art.\"\n\n\"Our cells all regenerate every seven years ... so I'm like, 'Oh, I'm a new being.'\" (ABC Arts: Eloise Fuss)\n\nWalker feels she can express herself now in a way she couldn't in Iceland.\n\n\"Being in my studio and just being at home, it's done something with my nervous system, where I feel safe to express myself more vividly.\n\n\"A lot of the work that I'm making in my studio is processing being in my body again here, back home in Australia, which means that I'm also processing what happened to me in Iceland.\n\n\"I'm not stuffing those emotions back down inside of me. I'm able to just let them free.\n\n\"I want to be able to just speak and be seen as who I am.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/critical-mineral-gallium-mining-western-australia/105267898",
        "title": "Trade wars and AI drive demand for critical mineral unearthed in WA",
        "publish_date": "Wed, 14 May 2025 23:03:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Analysts say the still-simmering trade dispute between China and the United States could open further opportunities for Australia's critical minerals sector.\n\nGallium, a mineral critical to computer processing, is one of the resources caught in the tariff battle, with China — the world's biggest supplier — banning exports to the US last year.\n\nWhile the Australian industry is still in its early stages, global interest in artificial intelligence and the Albanese government's focus on critical minerals has sparked research and exploration in Western Australia with hopes of tapping the $3.8 billion international market.\n\nWhat is gallium?\n\nGallium is one of Australia's 31 critical minerals with a wide range of uses, but it has gained attention recently for its efficiency in computer chip technology.\n\nGallium has a low melting point and turns to liquid at just below 30 degrees. (Commons: AndrewDaGamer; Liquid gallium; licence)\n\nIt is chiefly used in semiconductor production for smartphones and high-speed computer chips.\n\nAs computers and technology become more advanced, there is an increasing need for quicker and more efficient semiconductors.\n\nDeputy director of Curtin University's Trailblazer program Andrew Bell said China's export ban had shone a spotlight on gallium.\n\n\"Mining companies have started to look at it in a lot more detail since then,\" he said.\n\nAndrew Bell says there is an opportunity for gallium production to grow. (Supplied: Curtin University)\n\n\"I definitely don't think that it's the be-all and end-all of critical mineral production in Australia.\n\n\" But I do see the growth potential for gallium, based on geopolitical activities around the world, and [there's a] really great opportunity here for WA to be a big player in gallium production. \"\n\nMost standard computer semiconductors are made using silicon, which is relatively cheap and plentiful.\n\nAI chatbots require high speed computer technology to process information instantly. (ABC News: Gian De Poloni)\n\nScientists believe gallium-based semiconductors are better for more advanced applications because they can run faster, be smaller and consume less power.\n\n'A growth market'\n\nCompared to a commodity such as iron ore, the world consumes a minuscule amount of gallium.\n\nBut it is lucrative, with the price at the time of writing about $1,000 per kilogram, up 236 per cent since 2020.\n\nAccording to a report from the Business Research Company, the worldwide gallium market is projected to grow to $US6.6 billion by 2029.\n\nData from the CSIRO shows global demand for gallium is expected to reach 1,180 tonnes by 2030. (Source: CSIRO)\n\nGrowth in the sector is not just driven by the AI revolution but also advancements in healthcare, 6G telecommunications and tech used by the defence industry.\n\nCSIRO senior scientist Chris Vernon said gallium was \"dwarfed\" compared to the value of other minerals, its high price driving its value.\n\nChris Vernon specialises in critical minerals. (Supplied: CSIRO)\n\n\"Despite it being a relatively small trade around the world, it turns into one of those things where if you don't have it — you'll pay any price for it,\" Dr Vernon said.\n\n\"Put yourself in the shoes of a chip maker who is about to make the latest AI chip that is going to run 100 times better than anyone else's, if you can't get the raw material you just don't have a business.\"\n\nRace to supply\n\nAcross the globe, gallium is usually sourced as a bi-product in bauxite mining, used to make aluminium.\n\nIn Western Australia, exploration company Nimy Resources started drilling for gallium on Wednesday after a surprise discovery of the mineral in a sample last year.\n\nExecutive director Christian Price hoped the company could potentially be an alternative source of gallium outside China.\n\nGallium is most commonly processed as a bi-product in bauxite mining. (Supplied)\n\n\"It's one of those markets where we start to see gallium, you start to see the uses, you'll start to see it everywhere,\" Mr Price said.\n\n\"[Gallium] is going to be on the lips of a lot more technology manufacturers in the future and we'll start to understand the criticality of that to our modern world.\"\n\nResearchers from Curtin University's School of Mines are working with Nimy Resources to further understand gallium's extraction process.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/queensland-study-reveals-link-vitamin-d-mental-disorders-babies/105290774",
        "title": "New study reveals vitamin D deficient babies at higher risk of mental disorders",
        "publish_date": "Wed, 14 May 2025 22:37:12 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Newborns who are deficient in vitamin D have a higher chance of developing mental disorders, such as autism, schizophrenia and attention deficit hyperactivity disorder(ADHD), researchers have found.\n\nIn the largest study of its kind, they tested the vitamin D status of more than 70,000 people as babies, using dried blood spots kept on filter paper from their heel prick tests in the first few days of life.\n\nWhy you need vitamin D and when it's safe to get it Photo shows A young woman sits in the shade behind a tree in a park Should you worry if you're not getting as much sunlight as you did over summer?\n\nUniversity of Queensland (UQ) psychiatric researcher John McGrath led the painstaking study, which analysed vitamin D levels from a sample of people born between 1981 and 2005 in Denmark, where the filter paper from the tests is kept.\n\nThey compared vitamin D data from a random selection of the Danish population without mental disorders to people with autism, schizophrenia, ADHD, major depression, bipolar disorder and anorexia nervosa.\n\n\"We found that low vitamin D was linked to an increased risk of schizophrenia, autism and ADHD,\" Professor McGrath said.\n\n\"We don't think that vitamin D during adulthood has anything to do with these disorders. We're talking about low vitamin D during early brain development.\n\n\" The baby can't make its own vitamin D. All the vitamin D that we measure from the baby as a newborn has come from the mother. \"\n\n'The sunshine vitamin'\n\nProfessor McGrath, of UQ's Queensland Brain Institute, said the new evidence suggested optimal vitamin D during early life is \"not only important to build strong bones, but also to build healthy brains\".\n\nHe described \"very low\" vitamin D as being less than 25 nanomoles per litre of blood.\n\nWhile the study adds to previous research suggesting low maternal vitamin D involvement in schizophrenia, autism and ADHD, he stressed that mental health disorders are multi-factorial, with a wide range of genetics and environmental factors also playing a key role.\n\nJohn McGrath says the findings suggest vitamin D is important for building healthy brains. (Supplied)\n\n\"We know that many other factors can impact on orderly brain development, such as prenatal infection,\" Professor McGrath said.\n\n\"Obstetric complications and childhood trauma may also be linked to later mental disorders.\"\n\nIn schizophrenia, smoking cannabis in adolescence is considered a trigger in susceptible people.\n\nProfessor McGrath has spent the past three decades trying to identify risk factors, such as low vitamin D, that can be modified in the hope that it will decrease the incidence of the disorders.\n\nThe findings from the latest study suggest that if vitamin D is a true causal factor, 15 per cent of schizophrenia cases, 9 per cent of ADHD, and 5 per cent of autism could have been prevented if all participants had vitamin D levels of more than 21 nanomoles per litre of blood as a newborn.\n\nBut Professor McGrath said those estimates were based on people living in Denmark, not in Australia, where individuals are less likely to be vitamin D deficient.\n\nVitamin D is often referred to as \"the sunshine vitamin\" because the sun is one of the best sources. It is also found in some foods and can be taken as a supplement.\n\nIn Australia, vitamin D supplementation in margarine is mandatory.\n\nChanges to pregnancy care guidelines\n\nSpeaking on behalf of the Royal Australian and New Zealand College of Obstetricians and Gynaecologists (RANZCOG), Amanda Henry said families should not be \"either unduly alarmed or overly hopeful\" about the study findings.\n\nProfessor of obstetrics Amanda Henry, program head of women’s health at The George Institute for Global Health. (Supplied)\n\n\"We're definitely not talking here that this explains everything about these conditions,\" she said.\n\nProfessor Henry, who was not involved in the research, said RANZCOG guidelines already recommended that women take vitamin D as part of pregnancy supplementation.\n\nBut she said routine vitamin D screening was not recommended.\n\nThe program head for women's health at The George Institute for Global Health said the federal government was funding a review of Australia's pregnancy care guidelines led by RANZCOG and the Australian College of Midwives.\n\nThe federal government is funding a review of Australia's pregnancy care guidelines. (ABC News: Pete Garnish)\n\n\"Vitamin D is one of the topics that's currently under development to be actively updated,\" Professor Henry said.\n\n\"We're waiting on the latest research on that to be integrated, then we will have updated guidance for mums and families around Australia in terms of what to do with vitamin D and many other things in pregnancy.\n\n\" We try not to be static in pregnancy and infant care and are doing our best to get some nationally consistent guidance that's responsive to evidence for the best care for pregnant mums and babies. \"\n\nProfessor McGrath's work is funded by the Danish National Research Foundation, the Queensland Centre for Mental Health Research and the UQ.\n\nThe vitamin D study is published in The Lancet Psychiatry.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/cost-of-blackouts-march-yorke-peninsula-million-dollars/105292962",
        "title": "Hefty cost for business after Yorke Peninsula's 24-hour blackout",
        "publish_date": "Wed, 14 May 2025 22:32:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Yorke Peninsula businesses lost $1.06 million during a widespread 24-hour blackout in March, according to fresh research.\n\nRegional Development Australia (RDA) surveyed affected traders who reported a combined lost revenue of $566,000 due to payment systems going offline, while stock losses reached up to $264,000.\n\nOf the 70 respondents, just one reported being covered for outages in their insurance policy.\n\nThirty-five were not, and nine were still awaiting decisions from their provider.\n\nThe March 14 outage saw more than 20,000 properties go dark because of dust pollution and extended dry conditions across South Australia, according to energy operator ElectraNet.\n\nRepair works on electrical infrastructure at the Hummocks substation in March. (ABC News: Brant Cumming)\n\nRDA Yorke and Mid North chief executive Daniel Willson said many businesses were \"caught out\" by the lack of insurance coverage for blackouts and encouraged owners to shift policies if necessary.\n\n\"Retail trade businesses suffered, those that have perishable stock,\" Mr Willson said.\n\n\"They've got some fairly stringent food safety requirements to observe,\" he said.\n\n\"When they can't rely on their fridges and freezers to keep running … they have to cut their losses to avoid impacting the health of consumers.\n\n\"We did have quite a few residences and households get in touch because they were frustrated that they hadn't had better coverage and service.\n\nThe caravan park at Edithburgh plunged into darkness during the 24-hour blackout. (ABC News: Alana Calvert)\n\n\"There was some pretty concerning stuff — families who had to drive around in cars to keep babies in air conditioning, quite a few people who had temperature-sensitive medication who had to drive back to Adelaide to replace their medication.\"\n\nMr Willson said a full report will be released in the coming weeks.\n\nNo compensation\n\nSo far, SA Power Networks, ElectraNet, and the state government have indicated compensation will not be offered to businesses.\n\nSouth Australians can claim $100 a year for an outage lasting more than 20 hours, but it only applies to supply issues and not transmission faults, which caused the March blackout.\n\nIndependent MP for Narungga, Fraser Ellis, said he would lobby the government to expand the Small Claims Scheme to include outages.\n\nNarungga MP Fraser Ellis says his office is investigating how the Small Claims Scheme can cover outages. (Facebook)\n\n\"I think it's unfair that a business should have to keep that level of inconvenience through no fault of their own,\" Mr Ellis said.\n\n\"I haven't got a yes or no, but I will keep trucking away at it.\n\n\"Recently the government extended [the Small Claims Scheme] to voltage variations, so they appreciate the need for it, but in this case, it's the same outcome with just a slightly different cause.\"\n\nTransport and Infrastructure Minister Tom Koutsantonis said the government would give Mr Ellis' proposal \"due consideration and consider [its] implications\".\n\nMr Koutsantonis previously said that SA Power Networks' equipment was not at fault.\n\nBusinesses had to close during the blackout. (ABC News: Alana Calvert)\n\n'Sheer expanse of problem'\n\nYorke Peninsula residents reported several rolling, localised blackouts in the days leading up to the major outage.\n\nIn the aftermath, ElectraNet said it proactively monitored power equipment for dust accumulation and blamed low rainfall across South Australia, which otherwise would have washed away excess build-up.\n\nOn Tuesday, SA Power Networks spokesperson Cecilia Schulz told ABC Radio Adelaide that helicopter and ground patrols had begun monitoring 55,000km of power lines to detect faults leading up to the next bushfire season.\n\nMs Schulz said the March outage was not caused by insufficient patrolling.\n\n\"It is the sheer expanse of the problem over the Yorke Peninsula, the number of poles and conductors that do have insulator pollution, and the ability of our crews to get to all of them and wash them,\" Ms Schulz said.\n\n\"We've had to go through this process of identifying the areas of the network that are causing the problems and manually washing them, but it hasn't been possible to do that for the whole peninsula.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/pga-championship-wanamaker-trophy-the-heavy-beast-that-surprises/105294324",
        "title": "Why this trophy continues to surprise its winners after almost being lost for good",
        "publish_date": "Wed, 14 May 2025 22:10:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Collin Morikawa had no idea how heavy the Wanamaker Trophy was when he attempted to hoist it in the air following his victory at the 2020 PGA Championship at TPC Harding Park.\n\nThe result was a near disaster.\n\nAs Morikawa grabbed the handles of the oversized silver jug and began to raise it above his head for a photo opportunity, the top of the sterling silver trophy came off and toppled to the ground, making for one of the more awkward, if not memorable, victory celebrations in golf history.\n\n\"They told me it's heavy; they didn't tell me the lid comes off,\" Morikawa recalled on Wednesday prior to the start of this year's PGA Championship at Quail Hollow.\n\n\"But it is way heavier than you expect. And then they tell you to lift it over your head.\"\n\nSix years earlier, Rory McIlroy had a similar experience after winning his second PGA Championship at Valhalla.\n\nLoading YouTube content\n\nWhen then-PGA Tour president Ted Bishop approached the Northern Irishman to present him the trophy for the award ceremony, the lid rolled off and McIlroy alertly snagged it in mid-air with one hand before it hit the ground, drawing a huge roar of applause from onlookers.\n\nThe Wanamaker Trophy, which includes the engraved names of every PGA Championship winner, measures 75 centimetres high, 68.5 centimetres from handle to handle and weighs 12.2 kilograms, making for a somewhat awkward hoist — particularly after playing 18 holes.\n\nMcIlroy called the trophy \"pretty meaty\".\n\n\"It's nice for the pictures because your biceps are usually flexed,\" McIlroy said on Wednesday with a laugh as he extended his arms while pretending to hold up an imaginary trophy.\n\nRich Beem said he had no issue lifting the trophy after his victory over Tiger Woods. (Getty Images: Judy Griesedieck)\n\n\"So it makes you look a bit stronger than you actually are. But it's very cool.\"\n\nRich Beem didn't really notice how heavy the trophy was after he held off Tiger Woods to win in 2002 at Hazeltine, saying there was too much adrenaline pumping through his veins.\n\n\"It could have weighed 100 pounds,\" Beem said.\n\n\"And I probably could have picked it up with a pinky.\"\n\nBeem said what surprised him the most was the silver trophy wasn't all that hot despite baking that afternoon in the August sun.\n\nSince Beem won nearly a quarter-century ago, an extra base has been added to the trophy after officials ran out of space to engrave the names of winners.\n\nThe champion's name is traditionally added before the trophy leaves the course, with five-time winners Jack Nicklaus and Walter Hagen appearing on it the most.\n\nChampions are allowed to keep the Wanamaker Trophy for one year after it's awarded, providing they return it for the following year's presentation.\n\nSometimes that doesn't work out.\n\nAmerican golfer Walter Hagen has a swing on the roof of the Savoy Hotel in London in 1922. (Getty Images: Topical Press Agency)\n\nIn the late 1920s, Hagen was forced to admit to tournament officials that he lost the trophy, which was initially created around the time the tournament began in 1916 by Rodman Wanamaker, the son of a sportsman and heir to a department store empire and credited with helping create the Professional Golf Association of America.\n\nDetails on how Hagen misplaced it remain sketchy and have become part of golf lore.\n\nHe reportedly told the PGA of America that he left it in taxi while out celebrating one of his four straight titles from 1924-27.\n\nIt resurfaced some years later, and now resides at the PGA of America headquarters in Frisco, Texas. What is used now is the replacement that was created shortly after Hagen misplaced the original.\n\nWhat champions do with with the trophy is up to one's own discretion.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"If you fill it up with ice and take two bottles of Jack Daniels and a two-litre bottle of Diet Coke and a dozen limes, you've got yourself one frosty cocktail,\" Beem said.\n\n\"I'm not saying that's what I did.\"\n\nOnce the trophy is returned the following year to be presented to the next champion, players are given a replica — albeit one that is 10 per cent smaller — to keep for good.\n\nTransporting it is no easy task.\n\nUnlike the much lighter 2.5kg Claret Jug — a pitcher-shaped silver trophy that comes with a travel-friendly case and is given annually to the winner of the British Open — the Wanamaker likely probably isn't something you want to lug around the country.\n\n\"It's hard to drag the Wanamaker around and say, 'Hey guys, here you go,'\" Morikawa said.\n\n\"The Claret Jug is a little easier to have some fun with it.\"\n\nABC Sport will live blog the final round of PGA Championship action on Monday morning from 3am (AEST).\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-15/community-slams-proposed-parkes-waste-incinerator/105272672",
        "title": "'Sacrificial community' pushes back against $1.5b waste incinerator",
        "publish_date": "Wed, 14 May 2025 21:51:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jeromie Fitzpatrick never thought he would leave his farm in the New South Wales central west.\n\nBut the proposed construction of a $1.5 billion waste-to-energy incinerator on the outskirts of Parkes has him, and many in the community, reconsidering.\n\n\"It is raising some serious questions as to my future, my family's future,\" Mr Fitzpatrick said.\n\n\" Questions that I didn't think I would ever have to think about. \"\n\nThe Parkes Energy Recovery facility would have the capacity to turn 600,000 tonnes of waste into energy each year with the ability to power 80,000 homes.\n\nThe vast majority of rubbish, which is non-recyclable, would be transferred from Sydney to Parkes via train.\n\nJeromie Fitzpatrick is a sheep, cattle and crop producer in Parkes. (ABC Central West: Hamish Cole)\n\nIt has prompted thousands of locals to join a campaign demanding to know why waste from the city should be transported more than 350 kilometres to the rural community.\n\nWhy here?\n\nA similar facility was proposed for Eastern Creek in Sydney in 2018, however, the Independent Planning Commission knocked back the proposal due to health concerns.\n\nIn 2022, the NSW government passed legislation banning waste-to-energy facilities in all bar four locations across the state, with Parkes, Lithgow, Goulburn and Richmond the only exemptions.\n\nParkes is home to more than 10,000 people. (ABC Central West: Hamish Cole)\n\nBen Stead has launched a community group, the Parkes Clean Future Alliance, with a petition in opposition to the project gathering thousands of signatures.\n\n\"How is it safe here but not everywhere else?\" Mr Stead said.\n\n\" What they call towns and areas like us is a sacrificial community, the smaller, lower socio-economic communities that they push these things onto. \"\n\nMr Stead said concerns over the impact of the incinerator had forced him to rethink his plans to build a house near the site of the proposed incinerator.\n\nThe facility would see 60 train loads of rubbish from Sydney per day transferred to the proposed facility at the Parkes Special Activation precinct, which is owned by the state government and located 3km out of town.\n\nJeromie Fitzpatrick says the facility will destroy the reputation of the agricultural sector in the region. (ABC Central West: Hamish Cole)\n\nMr Fitzpatrick's farm is less than 10km from the site.\n\nHe said if the technology \"is so safe\" then the facility should be built in the city.\n\nHow do waste-to-energy plants work? Photo shows An artist render of a concrete building. For decades, Victorians burned their rubbish in backyard incinerators. It's now back in vogue, with five waste-to-energy facilities under development across the state.\n\n\"If it is not good enough in Sydney and Eastern Creek because it is too dangerous for the community … then it is too dangerous here.\"\n\nThe director of the Parkes Energy Recovery project Edward Nicholas said the state government chose the location for the incinerator, but they \"would be happy\" to build it in Sydney if required.\n\n\"We could do it in Point Piper, we can do it in Parkes,\" he said.\n\n\"The same technology to keep it safe in residential Sydney is the same technology that we will be using to keep it safe for people, land, water and livestock in Parkes.\"\n\nLatest technology\n\nThe facility uses thermal technology to burn the waste, generating steam, which drives turbines to generate electricity.\n\nThe emissions from the burnt waste are filtered before being released into the air.\n\nThere are more than 2,000 large-scale waste-to-energy facilities across the world, including one operational in Western Australia and another under construction.\n\nThere are proposals for more than half a dozen of the incinerators to be built across Victoria, NSW and Queensland.\n\nThe Parkes Energy Recovery facility would have the capacity to process 600,000 tonnes of waste per year. (Supplied: Parkes Energy Recovery)\n\nMr Nicholas said the facility would use \"safe, proven, reliable technology\" and NSW had among the strictest guidelines in the world.\n\n\"The NSW Environment Protection Authority and Department of Planning have put in place a regime that is as strict as anywhere else in the world,\" he said.\n\n\"These are facilities that are in some places like downtown Copenhagen … as close as 200 metres from residents.\n\n\"The fact that it is safe in that sort of environment should give people comfort.\"\n\nThe East Rockingham Waste to Energy facility is one of two incinerators in WA. (Supplied: WMRR)\n\nThe technology proposed for the Parkes Energy Recovery plant is the same as the two sites in Western Australia.\n\nMr Nicholas said real-time \"emission monitoring\" data would be included as part of the project and publicly available for residents to view.\n\nHealth concerns\n\nPeter Tait is a member of the Public Health Association of Australia and was a clinical senior lecturer in population health at the Australian National University medical school.\n\nHe is also the author of a study that assessed reports linking older waste incinerators with a range of adverse health effects, such as cancer clusters and birth defects.\n\nDr Peter Tait says ingestion and inhalation are the main ways people are exposed to chemicals from waste to energy facilities. (ABC Central West: Hamish Cole)\n\nDr Tait said while the technology posed a low risk to human health, there was \"not no risk\".\n\n\"Old incinerators were quite toxin-producing so there is evidence of raised health outcomes including asthma, some cancers and some congenital abnormalities,\" he said.\n\n\"There are lots of toxic products produced, mostly dioxins as well as heavy metals.\"\n\nDr Tait said incinerators built in the past decade were \"assumed\" to be much safer due to technological developments and higher standards.\n\n\"These incinerators are so new it is not possible yet to say whether they are actually safer,\" he said.\n\nThe Parkes Shire Council is yet to form a position on the proposal, but Mayor Neil Westcott said avoiding any threat to human health was \"non-negotiable\".\n\nThe project will be assessed by the NSW Department of Planning.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/vale-robert-walls-afl-legend-s-best-columns-for-the-age-20250514-p5lz40.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vale Robert Walls: AFL legend’s best columns for The Age",
        "publish_date": "Thu, 15 May 2025 11:58:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Opinion\n\nAs a coach, you like your young players to pull their heads in and do a lot of looking and listening. I thought Jason Akermanis would rub a few people the wrong way. And he did.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/trump-and-the-oil-cartel-are-on-a-collision-course-20250515-p5lzce.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump and the oil cartel are on a collision course",
        "publish_date": "Thu, 15 May 2025 11:58:35 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US onshore oil sector is particularly sensitive to oil prices. While break-even prices vary significantly between the basis, the rule of thumb is that they generally need something above $US60 a barrel to break even on new wells and $US65 a barrel or more to generate profits attractive enough to provide an incentive to drill. Oil prices have demonstrated acute sensitivity to Donald Trump’s trade policies. After Trump’s “Liberation Day,” global oil prices plummeted, with Brent crude tumbling from around $US75 a barrel to less than $US60 a barrel. The US domestic price, the West Texas Intermediate (WTI), fell to as low as $US55 a barrel. After Trump paused his “reciprocal” tariffs and agreed a 90-day truce with China, with big cuts to the tariff rates, oil prices have recovered, with Brent trading around $US66 a barrel and WTI around $US62 a barrel. Not helping the position of the US producers is the impact on Trump’s tariffs on steel and steel products, cement and drilling fluids. A leading energy consultancy, Wood Mackenzie, says costs will have risen 4.5 per cent by the fourth quarter of this year as a result of those tariffs, which remain in place. The firm expects the cost of the steel pipes used in drilling, production and completion of wells to rise by 40 per cent and be the major contributor to the overall cost increases.\n\nSo, the “prices down, costs up” outlook will lead to less investment and less future production. That may be one of the objectives that the Saudi-led OPEC is pursuing. OPEC+ has embarked on a U-turn in its strategy this year. Oil prices have demonstrated acute sensitivity to Donald Trump’s trade policies. Credit: AP For three years it restrained production. It took a total of about 6 million barrels a day of oil out of the market via production cutbacks over that period, with the Saudis bearing the brunt of those cutbacks – they contributed about 1 million of the 2.2 million barrels a day of “voluntary” cutbacks announced in late 2023 for last year’s production targets.\n\nThis year the cartel has started returning some of that curtailed production to the market. The original plan was to do it incrementally through to September next year. Instead, after announcing an increase in output of 38,000 barrels a day in April OPEC suddenly ramped that up to 411,000 barrels a day for May and then, earlier this month, announced a similar increase for June. In just over three months it will have added nearly half the volume that it had planned to add over 18 months. Loading The primary motivation for that increase, which has been led by the Saudis, is to respond to over-production from members of the cartel who haven’t honoured their commitments -- Kazakhstan and Iraq in particular – and have produced at rates above their agreed caps. The Saudis, having shouldered the bulk of the burden of reduced production, have had enough and are prepared to live with the lower prices – well below the estimated $US90 a barrel or so needed to balance their budget – in exchange for the bigger volumes and the opportunity to discipline the recalcitrant members of the cartel.\n\nThe ancillary benefit is the impact it has on the US, where shale has made it the world’s largest oil producer. Driving the prices down will, as its own forecasts suggest, drive some shale producers out of the market and lower the US industry’s global market share, albeit that the shale sector is very flexible and innovative and has a greater ability to turn its production off and on than traditional producers. The 2014 oil price collapse, triggered by a big surge in OPEC supply, saw oil trade below $US30 a barrel. It ignited a wave of bankruptcies in the US shale sector. As soon as the price stabilised, however, production sprang back, with significantly lower costs. Trump’s trade war, even if its severity is scaled back after the 90-day pauses on the reciprocal tariffs and China end, is depressing both global economic activity and the growth rate of the US economy. The US economy grew 2.8 per cent last year. OPEC is forecasting growth of only 1.7 per cent this year.\n\nDespite that lower growth in prospect, OPEC, pointing to last weekend’s temporary truce between the US and China, says there is potential for more lasting agreements and a normalisation of trade flows, albeit at potentially elevated tariff levels compared to the pre-Liberation Day escalation of trade hostilities. Loading Nevertheless, it has left its forecasts for the increase in global oil demand this year unchanged at 1.3 million barrels a day and downgraded them only slightly, to 1.218 million barrels a day, for next year. By comparison, the International Energy Agency has forecast an increase of only 726,000 barrels a day. If the US and the non-OPEC producers don’t reduce their output heavily this year, OPEC+ producers continue to unwind their production cuts at the current rate and the impact of the US trade policies continue to chill global economic activity, there is a very real prospect of as glut of oil developing and another big slump in prices. Trump will get his lower prices in those circumstances, which would help modestly offset the impact of his tariffs on inflation. What he wouldn’t get is the boom in the shale oil sector that was supposed to be a key plank in his economic strategy.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2012-malthouse-a-big-risk-as-blues-err-in-axing-ratten-20250514-p5lz5a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2012: Malthouse a big risk as Blues err in axing Ratten",
        "publish_date": "Thu, 15 May 2025 11:57:13 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on August 30, 2012.\n\nIt’s 2001 and after 10 years as Carlton coach, David Parkin hands the reins to the low-profile Wayne Brittain. Brittain coaches the Blues to fifth spot. The next year they plummet to 16th, and president John Elliott can’t get rid of Brittain quick enough because he wants to announce that the Blues have landed a big fish, dual premiership coach Denis Pagan. It’s a coup that Elliott thinks will save his backside and keep the supporters happy.\n\nAfter all, how could you go wrong with a premiership coach?\n\nBut it doesn’t work. Pagan lasts almost five years and takes the Blues to 15th, 11th, 16th, 16th and 15th. Towards the end of Pagan’s tenure, they sack him and Brett Ratten takes over. There are six games to go, but the Blues don’t want to win, even if they could. The priority is to secure Matthew Kreuzer in the draft, which they do.\n\nSo Ratten, a rookie senior coach, has his first summer to prepare a very ordinary list that’s full of skill, cultural and discipline problems. It’s a list that has delivered to Carlton its first ever wooden spoons. These have been the darkest days in Carlton’s long history.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/celebrity/why-is-taylor-swift-caught-up-in-the-baldoni-lively-legal-battle-20250515-p5lzcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why is Taylor Swift caught up in the Baldoni-Lively legal battle?",
        "publish_date": "Thu, 15 May 2025 11:57:03 +1000",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Four months ago, the legal battle between Blake Lively and Justin Baldoni began. Now, after a string of countersuits, Taylor Swift has been dragged into the fray.\n\nOn May 9, the pop star was subpoenaed as a witness in Baldoni’s $US400 million defamation countersuit against his It Ends With Us co-star. The trial is set for March 2026. Here’s what Swift has to do with it.\n\nTaylor Swift and Blake Lively have been friends for years. Credit: Getty\n\nHow is Swift involved?\n\nSwift and Lively have been close friends since 2015. Her song, My Tears Ricochet, featured in It Ends With Us, the dark romance film that Baldoni directed and starred in with Lively.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2009-he-s-brash-but-boy-can-aka-play-20250514-p5lz5b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2009: He’s brash, but boy can Aka play",
        "publish_date": "Thu, 15 May 2025 11:56:39 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on May 22, 2009.\n\nIt was January 1995. The Brisbane Bears were having their pre-season training camp just north of Noosa. We drove up from Brisbane in private cars and, as coach, I took three teenage kids who were old enough to be on the senior list, but too young to have a licence.\n\nThe last lad I picked up was short, ginger-haired and freckle-faced. Jason Akermanis was his name. He lived with his mum who was on her own raising her two boys.\n\nThe year before, as a schoolboy, “Aka” had played Teal Cup for Queensland. He stood out with his exceptional pace. In those days, the Bears could take the pick of the Queensland kids, so Jason joined Michael Voss and Marcus Ashcroft, who had been taken in previous years, as local 17-year-olds.\n\nAka jumped in the car talked non-stop, but he didn’t really say anything. It was my first introduction to his world. He was different. Did the incessant talk indicate a lack of confidence? With no father in his life, was there an insecurity? Did he feel a need to prove himself?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2007-fond-memories-of-an-old-sparring-partner-20250514-p5lz5w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2007: Fond memories of an old sparring partner",
        "publish_date": "Thu, 15 May 2025 11:56:30 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on July 27, 2007.\n\nMy old adversary Kevin Sheedy’s exit from Essendon at the end of this season is both a sad and exciting scenario. Most people don’t like change, but the Bombers have made the correct call and as the veteran coach said himself, this is a decision that will energise both parties. And it will.\n\nTwenty-seven years is a long time. Sheedy will make a success of his third phase in football, just as he did as a player and coach.\n\nIn fact, he will enter, I dare suggest, into the happiest time of his life, where alongside loyal and supportive wife Geraldine, he will be able to spend more time sharing life with, and encouraging, family and friends.\n\nAnd perhaps after 40 years, the two of us might learn to get along. Our competitiveness stemmed from being in teams that didn’t like each other.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2007-the-golden-west-coast-era-of-the-mid-2000s-brought-the-game-into-disrepute-20250514-p5lz4i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2007: The golden West Coast era of the mid-2000s brought the game into disrepute",
        "publish_date": "Thu, 15 May 2025 11:56:17 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on March 31, 2007, stirring passionate debate when revelations about the Eagles first became public.\n\nTonight at Telstra Stadium in Sydney, I want to see the Swans smash West Coast. I want good to triumph over evil.\n\nPerhaps that sounds a bit dramatic, but you cannot help how you feel, so for the good of football, for right over wrong, for two teams to get what they deserve, I want Sydney to win and win well.\n\nProblem is, however, you don't always get what you deserve.\n\nSadly, the actions of too many Eagles have brought our great game into disrepute. Coach John Worsfold, who is the most solid of solid citizens, tells us up to eight of his players have told him that they have used illicit drugs.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2004-go-now-libba-if-you-did-it-20250514-p5lz5t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2004: Go now, Libba, if you did it",
        "publish_date": "Thu, 15 May 2025 11:55:48 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on April 9, 2004.\n\nIf Tony Liberatore was responsible for the felling of Matthew Knights 100 metres off the ball at the MCG on Saturday, then he should give the game away.\n\nAnd, if he was responsible and feels the need to soldier on, then his club should do him a favour and insist that he retire.\n\nIf Liberatore caused the split in Knight’s forehead, then it has to be the last straw in a list of unsavoury incidents that have sullied the Brownlow medallist’s past few seasons.\n\nThere has been much to admire about Liberatore’s career. He has had to fight the odds to survive, but in recent years it has been sad to see him desperately clinging to a career that he knows is slipping away fast.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2004-greatness-in-black-and-white-20250514-p5lz5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2004: Greatness in black and white",
        "publish_date": "Thu, 15 May 2025 11:55:34 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on March 29, 2004.\n\nJust before the match between Collingwood and St Kilda last Sunday, I was asked whether Greg Williams should retire. My immediate reaction was to say: “Call it quits.” Suspensions, age and a crook knee were all against him.\n\nThen “match-winner” flashed before my eyes. Williams is a genuine match-winner, able to turn a game with flashing hands, weighted kicks and bone-jarring hits, and there are not that many match-winners around.\n\nMinutes later, I had the pleasure of seeing another match-winner on centre stage at the MCG before a crowd of nearly 70,000. It was Nathan Buckley.\n\nI first met Buckley in Adelaide on the morning of a match between the Crows and the Bears in 1991. He was 18 years old, skinny, pale-faced, and playing for Port Adelaide reserves. He was also on Brisbane’s extended list of 60, courtesy of Northern Territory concessions. I’d been to Darwin and Alice Springs to meet the seven Aboriginal boys; Buckley, with his pale face and sandy hair, was the odd one out.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2003-disgraceful-magpies-took-footy-fans-for-a-ride-20250514-p5lz5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2003: Disgraceful Magpies took footy fans for a ride",
        "publish_date": "Thu, 15 May 2025 11:55:07 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on September 29, 2003.\n\nI feel let down. I’ve been shortchanged, fooled, duped and embarrassed. And I don’t even barrack for Collingwood. But I did tip it. And it did not give a yelp.\n\nNever, not once at any stage in the game, did the team that I put my faith in show some resolve.\n\nThis team took us for a ride. It had so much going for it. Twenty-two fit players, fine form, the all-important week off during the finals, and a travel schedule that was almost non-existent.\n\nIf ever a team was poised to perform on the big day, Collingwood was it. But grand finals are something else. You cannot pick and choose what you do on “the” day.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/jobless-rate-steady-ahead-of-rba-rates-decision-20250515-p5lzfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jobless rate steady ahead of RBA rates decision",
        "publish_date": "Thu, 15 May 2025 11:55:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jobless rate steady ahead of RBA rates decision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2003-to-rohan-barass-and-knightsy-i-m-sorry-20250514-p5lz5e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2003: To Rohan, Barass and Knightsy – I’m sorry",
        "publish_date": "Thu, 15 May 2025 11:54:47 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on May 23, 2003.\n\nI let Western Bulldogs dasher Rohan Smith down last week. I regret what I did and wish I could turn back time, but that can’t happen. With me as “special comments” man with 3AW, we covered last Sunday’s Carlton-Bulldogs game.\n\nAn apology to Bulldog Rohan Smith. Credit: Pat Scala\n\nDuring the second quarter, Carlton forward Adrian Hickmott was forced to leave the field with blood trickling from his forehead. I didn’t see what happened. Two people near me, who were not members of the commentary team, assured me that Rohan Smith had bitten Hickmott. They had watched replays of the pair rolling on the ground on a TV monitor. Irresponsibly, I said on air that “there could have been a bite involved in Hickmott’s leaving the field”. I didn’t mention Smith’s name, but I didn’t have to for the finger to be pointed at him.\n\nTwo days after the game, the AFL held an investigation into why Hickmott left the field. The investigation didn’t last long as it was obvious there was no case to answer.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/2001-gloves-off-over-a-fight-for-respect-20250514-p5lz5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2001: Gloves off over a fight for respect",
        "publish_date": "Thu, 15 May 2025 11:54:03 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on April 21, 2001.\n\nShane Strempel. Credit: Greg Wood\n\nMuch has been spoken and written of the time 10 years ago when I had Shane Strempel put the gloves on at a training session. Let me say, it’s no big secret.\n\nHundreds of people have known about it and putting the gloves on at the Bears was commonplace back in the early 1990s. Shane, who treated the club and his teammates with a lack of respect, needed to be put in a position of dealing with some controlled aggression.\n\nHe needed to know that he had to pay a price for his indiscretions, and he needed to be given an opportunity to earn some respect.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-pale-raw-boned-boy-who-became-an-afl-legend-20231204-p5eorm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The pale, raw-boned boy who became an AFL legend",
        "publish_date": "Thu, 15 May 2025 11:53:19 +1000",
        "category": "sports",
        "authors": [
            "Andrew Stafford"
        ],
        "text": "Walls was born in Dunolly, in western Victoria, and was attending Coburg High School, in Melbourne’s northern suburbs, when he was spotted by Carlton. His arrival at the club coincided with Ron Barassi’s first stint as a captain-coach. Walls’ refusal to take prisoners was a direct result of his master’s tutelage. Loading It made for a career that included its share of controversies, feuds and fallings-out. But Walls was never one to hold back. He booted a goal with his first kick, before securing his place in defence, where his long arms and aerial judgment were put to good use. In 1969, with a bit more meat on his bones, he returned to centre half-forward. The following year, Walls was critical as Carlton stormed home to steal the premiership cup from Collingwood. But it was his performance in the 1972 grand final that will stand forever. With captain-coach John Nicholls orchestrating a shootout with Richmond, Walls was supreme in the highest-scoring grand final in VFL/AFL history. Nicholls kicked six goals that day, and Alex Jesaulenko seven.\n\nAlthough the Norm Smith Medal had yet to be introduced, Walls was the unanimous choice as best afield, with six goals from 24 possessions, including a withering burst early in the second quarter that took the game away from the Tigers. Walls played 218 matches for Carlton and added another 41 for Fitzroy (1978-80) for a total of 259 games, in which he kicked 444 goals. John Elliott was president and Robert Walls was coach when Carlton won the 1987 VFL premiership. Credit: The Age In 1981, he began coaching Fitzroy while teaching at Park Orchards Primary School; the game was still only semi-professional. Walls quickly proved an astute thinker and tireless standard-bearer. “He was extraordinary, he was ahead of his time, and he changed all our lives,” said former Fitzroy tagger Scott Clayton, who later worked under Walls as director of football at the Brisbane Bears.\n\nAfter finishing bottom of the ladder in 1980, the financially ailing Fitzroy rebounded under Walls, making the finals in three of his five years at the helm with emerging and established champions including Bernie Quinlan, Garry Wilson, Gary Pert and Paul Roos. At the end of 1985, Carlton sacked coach David Parkin. Walking out of Seven’s studios after an interview, Parkin bumped into the man who had been appointed to replace him. It was Walls. The pair were swapping jobs, with Parkin taking over at Fitzroy. Carlton greats Robert Walls, Stephen Kernahan and David Rhys-Jones in 2017, marking the 30-year anniversary of their 1987 premiership win. Credit: Joe Armao Walls suggested the pair catch up for a yarn. “I must admit I wasn’t terribly concerned about spending time with him at that stage,” Parkin chuckled. But over the next few hours, Walls astonished him by taking him through Fitzroy’s entire list in detail. Parkin returned the favour. It was a collegiate gesture, unthinkable today, that benefited both men and cemented a lifelong friendship. Parkin, a four-time premiership coach, regards his first year at Fitzroy, 1986, as his finest coaching performance, when the Lions made the preliminary final.\n\nIt was Fitzroy’s last gasp as a competition contender. They were beaten in the preliminary final by Hawthorn, who would in turn beat Carlton under Walls in the grand final. But the Blues turned the tables in 1987, winning the premiership and confirming Walls’ stature as a Carlton immortal. In a famous move, Walls battled his match committee to play the feisty David Rhys-Jones, normally a winger or flanker, on Hawthorn’s equally pugnacious centre half-forward Dermott Brereton. It worked: Rhys-Jones kept Brereton goalless and won the Norm Smith Medal. Robert Walls (centre) ventured north in 1991 to coach the Brisbane Bears. Credit: Mike Lader Celebrations were brief. Only a fortnight later, Carlton played an infamous exhibition match against North Melbourne in London, the so-called “Battle of Britain”. Most of the Blues were still hungover, and the two sides brawled senselessly in the supposed friendly. Later, Walls castigated club president John Elliott, the beer baron whose Carlton and United Breweries had sponsored the event. Blues chief executive (and Walls’ former teammate) Ian Collins was furious. This time, Walls knew his willingness to speak his mind would come back to bite him.\n\nIt didn’t take long. Carlton crashed out of the 1988 finals with losses to Hawthorn and Melbourne. Walls berated his troops in the aftermath, and lost them for good. He was sacked the following season after Carlton lost eight of their first 10 games. “I was too hard on the players, in hindsight,” he told News Limited’s Sacked podcast in 2019. “I drove them relentlessly hard; I was looking for fault, more than I was to give them a pat on the back. I was too brutal, too uncompromising.” Walls celebrates the 1987 grand final win with wife Erin. Credit: Craig Abraham Walls went to the Brisbane Bears in 1991. That year, he exposed a 21-year-old recruit, Shane Strempel, to a boxing session against eight of his teammates. It stopped only when star player Brad Hardie intervened. “We’d better stop or we’ll kill him,” he told the coach. It was a stain on Walls’ career, but his time at a club that was derided as the “bad-news Bears” was arguably his most influential. In 1995, he dragged a team featuring Michael Voss, Jason Akermanis, Nigel Lappin, Justin Leppitsch and Craig McRae into the finals for the first time.\n\nRobert Walls relaxing later in life with his dog Gus. Ironically, they were knocked out by the all-conquering Carlton, again coached by Parkin. “We talk about the [Ted] Whittens and the Barassis of the world, but I think Rob was a leader, up with the great coaches that came before and after him,” Parkin said of his old friend. If his man-management style was of the old school, Walls was tactically innovative. One signature set play was the kick-in huddle, where players would cluster at centre-half-back, then burst into space. Parkin eventually introduced the zone defence to counter it. When Walls’ coaching career finished, he was quickly in demand as an analyst. As usual, his candour led to clashes. He sparred with Sydney coach Paul Roos, declaring his former pupil’s Swans couldn’t possibly win the flag in 2005. They did. Walls later sought unsuccessfully to apologise to Roos. In print and on air, Walls was straight to the point and unsparing. “We always wondered when the sledgehammer was coming out,” Lane remembers. “But it’s not something he would have done lightly, there was a sense of duty and professionalism about the way he went about it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/trump-said-kids-should-only-get-two-dolls-but-monica-is-ready-to-save-christmas-20250514-p5lz2y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump said kids should only get two dolls. But Monica is ready to save Christmas",
        "publish_date": "Thu, 15 May 2025 11:51:26 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "Guangzhou: When news broke this week of a 90-day trade truce between the US and China, Monica Xie hit the phones immediately.\n\nFor more than a month, the Chinese toy company she works for had been paralysed by the ratcheting trade war as the world’s two biggest economies whacked each other’s imports with sky-high tariffs, grinding shipments to a halt on either side of the Pacific Ocean.\n\nMonica Xie, 33, sales representative of a Guangdong-based toy company, said she began calling US suppliers this week as soon as the trade truce was announced. Credit: Sanghee Liu\n\nFor Xie’s company, Shantou Mingbo Toys, that meant tens of thousands of children’s dolls ready to ship in US-bound containers had been stranded at its warehouse in the port city of Shantou, in the southern Chinese province of Guangdong.\n\nThe company’s business model is almost entirely geared towards the export market, Xie said, with America accounting for 50 per cent of its sales. It counts massive retailer Walmart among its buyers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-great-robert-walls-dies-aged-74-using-voluntary-assisted-dying-laws-20250513-p5lyv8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL great Robert Walls dies, aged 74, using voluntary assisted dying laws",
        "publish_date": "Thu, 15 May 2025 11:49:17 +1000",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "Walls with Carlton players Jon Dorotich, Peter Bosustow and Stephen Kernahan. Credit: Getty Images That Walls would die soon, at a time of his choosing, was known to many of his friends within the football and media fraternities. A number of former Carlton teammates, and players he coached at Carlton, Fitzroy and the Brisbane Bears, visited him in his final weeks and embraced him for the last time. Paul Roos, the former Fitzroy champion for whom Walls was a seminal influence, flew from Hawaii to see Walls last week, while ex-Brisbane great Michael “Magic” McLean travelled from Darwin to see his old coach for the last time. Carlton teammates Peter “Percy” Jones and Geoff Southby visited him in recent days, as did his 1987 premiership player David Rhys-Jones and prominent football journalist Mike Sheahan. Scott Clayton, who played under Walls at Fitzroy and then was persuaded to join the coach in Brisbane as a recruiter/list manager for several years, said that outside of his family, Walls “has been the greatest influence on my life”. Clayton added: “He supported, he believed in you as person.”\n\nLoading David Barham, the television executive and current Essendon president who hired Walls as a panellist on Seven’s ground-breaking Talking Footy show and then enlisted him to Ten’s commentary team, said of his close friend: “I’ll miss him a lot. He was one of the best people I’ve met in my life.” Walls was, in Clayton’s words, “frank and fearless with the truth, honest to a fault” – a description consistent with that of anyone who dealt with him as coach or commentator. This renowned candour was reflected in the often searing columns he wrote for The Age and in the expert comments he delivered on radio and television. It was this trait that prompted Barham to enlist Walls in the Essendon coach selection process that settled on Brad Scott in 2022. “I knew he would tell me the truth,” said Barham. “I knew what I would get was factual and truthful, and he wouldn’t be swayed by anyone.”\n\nCarlton’s Stephen Kernahan and Robert Walls with the ’87 premiership cup. Barham, Clayton, David Walls (who is head of player personnel for Fremantle), McLean, and ex-Carlton and Melbourne Cricket Club chief executive Stephen Gough will speak at a celebration of Walls’ life at the MCG, as he requested. A key member of Carlton’s storied 1968, 1970 and 1972 premiership teams, and a star centre half-forward, Walls was a school teacher who turned to coaching after ending his playing days with Fitzroy. He became an innovative coach with the Lions, where he pioneered the use of “the huddle” at kick-ins and established close bonds with players. These included Clayton, the late Matthew Rendell, Mick Conlan, future coaches Roos and Ross Lyon and several others. Walls coached the impecunious yet spirited Fitzroy to finals in 1981, 1983 and 1984, and returned to Carlton, as prodigal son, in the famed coach swap with David Parkin (who went from Carlton to Fitzroy) after 1985.\n\nArriving alongside boom recruits Stephen Kernahan, Craig Bradley, Peter Motley and Jon Dorotich, the tactically adroit Walls coached the Blues to a grand final in his first season (1986) and then delivered a premiership to Princes Park in 1987. After missing the grand final in 1988 (third), the Blues slumped in 1989, prompting the mid-season sacking of Walls by the ruthless regime of (president) John Elliott and (chief executive) Ian Collins. Hired by the Brisbane Bears after 1990 when that dysfunctional club was a font of ridicule, Walls is credited with building a platform for a team that, as the Lions (post-merger with Fitzroy), became one of the greatest in competition history, winning a treble of flags in 2001-03 under Leigh Matthews. Walls (centre) at Brisbane Bears training in 1993. While he bequeathed a greatly improved and talented team at Brisbane after 1995, Walls found controversy when it emerged that he had authorised the pummelling, in the boxing ring, of player Shane Strempel as a disciplinary measure in 1991. He later wrote about it for The Age.\n\nWalls playing for Carlton in 1970. Credit: The Age He also wrote with powerful insight about some of football’s modern greats, including Nathan Buckley, Michael Voss and Jason Akermanis, all of whom he coached at the Bears. It says much about the scale of Walls’ career that his ill-fated and brief stint coaching Richmond (1996-97) is a footnote to his other achievements. In addition to his coaching and commentary, Walls mentored coaches such as Lyon and Roos and was instrumental, as a coach-search panel member, in the Saints hiring Lyon in 2006, and in the Bulldogs’ appointment of Rodney Eade (2004). Walls’ formative coach was the great Ron Barassi, who had sought permission from Walls’ mother to select the skinny 16-year-old for his first game for the Blues in 1967 because Walls’ father had just died.\n\n“He was a god to us,” Walls said of Barassi when he died in 2023, aged 87. Recruited from Coburg Amateurs locally, Walls absorbed the precepts of team-first discipline from Barassi and later cited his coach as influential in his emphasis on attacking, risk-taking football. Loading Graceful, mobile, rugged, and skilled for 193 centimetres, Walls was an exceptional player for the Blues, booting 367 goals in 218 games; judged best afield in the 1972 grand final, when he booted six goals, Walls would have likely won the Norm Smith Medal had the award existed then. Crossing to Fitzroy in 1978, he added 41 games for an aggregate of 259 matches and 444 goals. He is survived by his three children, seven grandchildren, and sister Annette.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/official-trailer-for-this-city-is-ours-on-stan-20250515-p5lzfj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Official trailer for This City Is Ours on Stan",
        "publish_date": "Thu, 15 May 2025 11:49:07 +1000",
        "category": "finance",
        "authors": [],
        "text": "Official trailer for This City Is Ours on Stan\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australians-are-reportedly-abandoning-travel-to-the-us-thats-not-the-full-story/ao8gifho5",
        "title": "Australians are reportedly abandoning travel to the US. That's not the full story",
        "publish_date": "Wed, 14 May 2025 19:34:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Safety concerns, a weak dollar, and border security are some of the issues reportedly contributing to a drop in Australians travelling to the United States.\n\n\n\n\n\nRecent media reports have suggested Australians are turning away from US travel, with data indicating fewer are visiting and planning trips compared with previous years.\n\n\n\n\n\nBut new figures from the Australian Bureau of Statistics (ABS) paint a different picture, and experts say current statistics should be taken with a grain of salt.\n\n\n\n\n\nSo, are Australians really turning away from US travel, and what are the factors playing a part?\n\n\n\nHow many Australians are travelling to the US?\n\nAccording to preliminary data from the US government's International Trade Administration, there were 59,859 Australian visitors to the US in March. That's a 7.1 per cent drop from March last year, when 64,418 Australians visited the US. The Easter holiday period also fell in March in 2024 while this year, it was in April.\n\n\n\n\n\nThis year to date, 201,867 Australians have arrived in the US, according to the data. That's about 1,500 fewer people than the corresponding period last year.\n\n\n\nREAD MORE The ID change that's expected to delay people travelling in the US\n\nBut according to the latest data from the ABS, travel to the US appears to have slightly increased. The ABS' short-term resident returns for March 2025 tracked 55,870 Australians returning from the US, up from 50,650 for the same period last year.\n\n\n\n\n\nProfessor Sarah Gardiner, director of the Griffith Institute for Tourism, said the difference in numbers is likely due to different methods of data collection.\n\n\n\n\n\n\"A lot of our ABS data is done by our arrivals card, so when people come in through our entry points, international airports and so forth, it is tracked through that methodology,\" she said.\n\n\n\n\n\n\"If they're [the US] using different types of tracking, maybe survey data or other data sources, there can be some variability in the data.\"\n\n\n\n\n\nGardiner said the March travel data is not an accurate reflection of current issues.\n\n\n\nAs well as the data already being months old, those travelling in March would likely have booked their trips much earlier, without knowing about current issues.\n\n\n\n\n\n\"Things are changing quite quickly in terms of the situation, and so you've got a bit of forward booking in that system as well,\" she said.\n\n\n\n\n\n\"So it's where it goes over the next few months that will be quite interesting to see if there is any impact.\"\n\n\n\nAre Australians less interested in travelling to the US?\n\nA national survey of 1,509 Australians aged 18 to 65 indicates fewer people were planning a trip to the US from 15 March to 15 May than the corresponding period 12 months ago.\n\n\n\n\n\nThe quarterly poll, commissioned by the Tourism and Transport Forum, had the US as the fifth most popular international destination for autumn 2024, with 8 per cent of travellers headed there.\n\n\n\n\n\nThe US slid to seventh on the list for this autumn, scooping up less than 6 per cent of Australia's overseas travel market.\n\n\n\nSara Dolnicar, professor of tourism at the University of Queensland Business School, said she expects the numbers will rebound relatively quickly.\n\n\n\n\n\nDolnicar said tourists are \"very reactive\" to world events and often base travel decisions around factors such as currency exchange rates, safety or security concerns, and environmental issues, particularly when travelling to far-away places like the US.\n\n\n\n\n\n\"Travel is about adventure, but controlled adventure, so you don't want to really expose yourself to unnecessary risk,\" she said.\n\n\n\n\n\n\"(Australians) might just be saying 'right now it doesn't seem stable enough for me to drag my family across there and not knowing what's going to happen',\".\n\n\n\nShe believes many Australians remain interested in travelling to the US, but may delay visiting until they feel more secure, particularly those who are putting trips off due to financial concerns.\n\n\n\n\n\n\"Tourism is exceptionally resilient,\" she said.\n\n\n\n\n\n\"My prediction ... is that it will bounce back because these are not dreams given up. They are deferred dreams or deferred aspirations of people.\"\n\n\n\nWhat are the factors influencing Australian travel to the US?\n\nDean Long, CEO of the Australian Travel Industry Association, said he believes interest in travel to the US has dropped in recent months.\n\n\n\n\n\n\"The priced product in the US is very high when compared to the value that you can get across Southeast Asia in particular and even parts of Europe,\" he told the Australian Associated Press in April.\n\n\n\n\n\n\"We think currency and value are the two things that are really driving that.\"\n\n\n\nThe exchange rate for the Australian dollar last week fell below 60 US cents, its lowest level since April 2020, following US President Donald Trump's 'Liberation Day' tariffs.\n\n\n\n\n\nIn a briefing, Tourism Economics, a division of the United Kingdom-based economics advisory firm Oxford Economics, said policies and pronouncements from the Trump administration were contributing to a growing wave of negative international traveller sentiment toward the US.\n\n\n\n\n\n\"Heightened border security measures and visible immigration enforcement actions are amplifying concerns,\" it said.\n\n\n\n\n\n\"These factors, combined with a strong US dollar, are creating additional barriers for those considering travel to the US.\"\n\n\n\nIs the US tourism industry in trouble?\n\nAccording to the US International Trade Administration data, visitor numbers from countries other than Australia are also declining.\n\n\n\n\n\nAccording to the dataset, the United Kingdom — the US's top tourism-generating country — had a 14.3 per cent decrease in visitors compared with the previous year.\n\n\n\n\n\nGermany recorded a 28.2 per cent decrease, while the number of visitors from Spain and Ireland dropped by 24.6 per cent and 26.9 per cent respectively.\n\n\n\nREAD MORE Australian tourists are outspending everyone else on one thing overseas\n\nDolnicar said these reductions could be concerning for the US tourism industry.\n\n\n\n\n\n\"If you think about the tourism industry ... globally it's about one in 10 jobs that's funded by the tourism industry and it's about 10 per cent of GDP (gross domestic product),\" she said.\n\n\n\n\n\n\"So if you have that kind of drop of numbers, that has immediate economic implications for a country.\"\n\n\n\n\n\nSome countries recorded modest increases, including Japan, Brazil and Italy, with rises of 3.6 per cent, 6.1 per cent and 3.4 per cent respectively.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/death-cap-mushrooms-not-found-in-meal-leftovers-patterson-trial-hears/lx139stzf",
        "title": "Death cap mushrooms not found in meal leftovers, Patterson trial hears",
        "publish_date": "Wed, 14 May 2025 10:11:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-problem-with-cultural-diversity-on-asx-boards-real-wages-rise/bbs20tm1n",
        "title": "Australia's problem with cultural diversity on ASX boards & real wages rise",
        "publish_date": "Wed, 14 May 2025 08:19:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/a-finance-expert-says-now-is-a-good-time-to-consider-refinancing-a-loan-ahead-of-tuesdays-reserve-bank-of-australia-meeting/3ju4mcfkg",
        "title": "'Double saving': Why now could be the perfect time to refinance your mortgage",
        "publish_date": "Wed, 14 May 2025 06:44:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points More Australians refinanced their homes in the March quarter compared to the December quarter.\n\nChanges to the cash rate can give borrowers more negotiating power with lenders looking to be competitive.\n\nThe average loan size for owner-occupier dwellings dropped in the first three months of the year.\n\nThe number of Australians refinancing their home loans increased in the first quarter of the year, and now could be a great opportunity to consider your options, a finance expert says.\n\n\n\n\n\nAccording to the Australian Bureau of Statistics (ABS), 65,030 home loans were refinanced between lenders in the March quarter, an increase of 5.1 per cent on the previous three months.\n\n\n\n\n\nSally Tindall, the data insights director at financial comparison website Canstar, said refinancing can become popular after an interest rate cut.\n\n\n\n\n\n\"We often see an uptick in refinancing after a cash rate cut. That's why we saw this refinancing burden during the period of the 13 rate hikes when banks were fighting for your business,\" she told SBS News.\n\n\n\n\n\n\"Some of that refinancing activity is likely as a result of that cash rate cut in February.\"\n\n\n\n\n\nThe Reserve Bank of Australia (RBA) will meet again next Tuesday, where it will announce any changes to the cash rate target, which sits at 4.1 per cent .\n\n\n\n'Pick up the phone to your bank'\n\nTindall said rate cuts bring mortgages front of mind for customers who are more likely to shop around for alternative lenders.\n\n\n\n\n\n\"In the next four days or so, right now even, is a fantastic time to pick up the phone to your bank and haggle for a personalised cut,\" she said.\n\n\n\n\n\n\"If you can renegotiate before a potential RBA cut next Tuesday ... you are then giving yourself a double cut if you're on a variable rate.\"\n\n\n\nIt would be up to the banks whether or not they pass along the savings, but historically, the vast majority do , according to Tindall.\n\n\n\n\n\nDoing research ahead of time on the offerings of different banks can be a \"bargaining chip\" in negotiations.\n\n\n\n\n\n\"Three of the big four banks are now offering an advertised lowest variable rate of 5.84 per cent. Use that as your benchmark if you are paying more,\" she said.\n\n\n\n\n\nTindall said it's important to be aware of any switching costs or caveats around home loans, and that it can take up to six weeks to process, but the savings can be worth it.\n\n\n\n\n\n\"For many people, even in the first year or two, the savings you could potentially make would outweigh the effort and the cost of refinancing,\" she said.\n\n\n\nAverage loan sizes fall\n\nThe ABS lending indicators data also showed the number of loan commitments for dwellings fell in the first three months of the year.\n\n\n\n\n\nIn the March quarter there were 127,108 loan commitments, a 3.5 per cent drop from the previous quarter. The value of the loan commitments fell by 1.6 per cent.\n\n\n\n\n\nThe number of new owner-occupier loan commitments for dwellings fell 3.4 per cent in the quarter while the value fell 2.5 per cent.\n\n\n\nThese loans were also on average $6,000 less than in the December quarter, sitting at $660,00 for March 2025.\n\n\n\n\n\nHowever, loan sizes rose in every state and territory when compared to March 2024, with a national average increase of 8.37 per cent.\n\n\n\n\n\nThe biggest change was in South Australia, which experienced a rise of 14.32 per cent, and at the opposite end of the scale loan sizes in the ACT rose by just 3.35 per cent.\n\n\n\nSource: SBS News Tindall said these figures were healthy considering the interest rate pressures borrowers have been under.\n\n\n\n\n\n\"I would expect that the new lending data is likely to pick up potentially as soon as the next quarter.\"\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licenced professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/president-trump-strengthens-ties-with-saudi-arabia/bqtv739me",
        "title": "President Trump strengthens ties with Saudi Arabia",
        "publish_date": "Wed, 14 May 2025 03:50:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAt a time when the Middle East has been rocked by conflict and the risk of further escalation remains everpresent, the region welcomes another unpredictable factor: United States President Donald Trump.\n\n\n\n\n\nPresident Trump has begun his first major trip abroad since returning to the White House, embarking on a four-day visit to the Persian Gulf.\n\n\n\n\n\nThe first stop on his tour is Saudi Arabia's capital Riyadh, where he's secured a $926 billion commitment from the Saudis to invest in the US.\n\n\n\n\n\nThis includes a $219 billion arms deal.\n\n\n\n\n\n\"We're adding over $1 trillion more in terms of investment and investment into our country and buying our products. And, you know, nobody makes military equipment like us so that the best military equipment, the best missiles, the best rockets, the best everything. Best submarines, by the way.\"\n\n\n\n\n\nSaudi Crown Prince Mohammed bin Salman says he is excited to grow the US Saudi relationship.\n\n\n\n\n\n\"Today, we are working on partnership opportunities worth $600 billion, including more than 300-billion-dollar agreements announced during this forum. In the coming months, we will work on the second phase to complete the rest of the agreements to raise them to one trillion dollars. This growing partnership is an extension of multiple cooperation in the military, security, economic and technical fields.\"\n\n\n\n\n\nIn another major announcement, President Trump says he will move to normalise relations and lift sanctions on Syria's new government to give the country what he called \"a chance at peace\".\n\n\n\n\n\nThe US President appears to suggest the significant foreign policy shift came at the request of the Saudi Crown Prince.\n\n\n\n\n\n\"I will be ordering the cessation of sanctions against Syria in order to give them a chance at greatness. Oh what I do for the Crown Prince. The sanctions were brutal and crippling and served as an important function at the time. But now it's their time to shine. It's their time to shine. We're taking them all off. So I say, good luck, Syria, show us something very special.\"\n\n\n\n\n\nMr Trump's announcement came shortly before he was set to meet with new Syrian President Ahmed al-Sharaa, the onetime insurgent who led a rebel offensive that overthrew longtime leader Bashar al-Assad last year.\n\n\n\n\n\nThe developments are a major boost for the Syrian leader who at one point was imprisoned in Iraq for his role in the insurgency following the 2003 U-S-led invasion.\n\n\n\n\n\nRosemary Kelanic is Director of the Middle East program at U-S think tank, Defense Priorities.\n\n\n\n\n\nShe says lifting the sanctions could help Syria achieve stability after decades of conflict and dictatorship.\n\n\n\n\n\n\"There's a humanitarian reason to want the sanctions to be lifted, which is that the people of Syria have suffered under the sanctions. They've suffered from natural disasters in the past few years. There was an earthquake not very long ago, and levels of poverty are extremely high. So, if you want Syria to be able to make it as a country and not fall apart into a renewed civil war, it makes sense that you would want sanctions to be lifted and to have a chance to work with Syria's leaders to try to bring that about.\"\n\n\n\n\n\nAnd in Syrian capital Damascus, local residents are celebrating the move.\n\n\n\n\n\nVOXPOP 1: \"It is a very positive step if this really happens, and we hope for the best because the people are truly tired, and the conditions have been difficult in the past period. We hope for the best.\"\n\n\n\n\n\nVOXPOP 2: \"We have been waiting for it for many years. It feels like a mountain has been lifted off our chest because now people may live more freely. I expect living conditions to improve in the future. It won't be immediate, but it will take some time. I believe this time has become a bit shorter. Congratulations to all of us.\"\n\n\n\n\n\nDonald Trump also used his visit to Saudi Arabia to urge Iran to make a new nuclear deal with the US.\n\n\n\n\n\nHe says he wants to avoid conflict with their geopolitical rival but warned that time is running out as Iran makes rapid progress with its nuclear program.\n\n\n\n\n\n\"Even if our differences may be very profound, which obviously they are in the case of Iran, I have never believed in having permanent enemies. I want to make a deal with Iran. If I can make a deal with Iran, I'll be very happy if we're going to make your region and the world's a safer place. But if Iran's leadership rejects this olive branch and continues to attack their neighbors, then we will have no choice but to inflict massive maximum pressure, drive Iranian oil exports to zero, like I did before.\"\n\n\n\n\n\nAnd while President Trump is set to visit the United Arab Emirates and Qatar to discuss oil and trade, investment deals, and regional conflicts, a notable absence from his schedule is longtime ally Israel.\n\n\n\n\n\nUnlike a near-identical visit to the Middle East in his first presidential term in 2017, Mr Trump appears to have avoided meeting with Israeli Prime Minister Benjamin Netanyahu this time around despite Israel standing on the brink of a sharp escalation of their war in Gaza.\n\n\n\n\n\nThe Israeli government have proposed a plan to seize the entirety of Gaza and expel the Palestinian population, promising it will not begin until Mr Trump's visit to the region is over.\n\n\n\n\n\nWhile the US President's relationship with the Israeli leader appears to be up in the air, he made a point to encourage Saudi Arabia to join the Abraham Accords and normalise its relationship with Israel.\n\n\n\n\n\n\"It's my fervent hope, wish, and even my dream that Saudi Arabia will soon be joining the Abraham Accords. I think it'll be a tremendous tribute to your country. It will be a special day in the Middle East with the whole world watching when Saudi Arabia joins us but you'll do it in your own time. And that's what I want, and that's what you want, that's the way it's going to be.\"\n\n\n\n\n\nHowever, there are some limits to Mr Trump's close bond with Saudi leader Mohammed bin Salman.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/un-aviation-body-rules-russia-responsible-for-downing-of-flight-mh17/a5c8aje9e",
        "title": "UN aviation body rules Russia responsible for downing of flight MH17",
        "publish_date": "Wed, 14 May 2025 02:27:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/you-will-be-stunned-a-sleep-expert-s-pre-bedtime-tips-20250403-p5loz7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You will be stunned’: A sleep expert’s pre-bedtime tips",
        "publish_date": "Thu, 15 May 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Konrad Marshall"
        ],
        "text": "You note that adolescents naturally fall asleep later, meaning school starts far too early? Teenagers have been lumbered with this incessant chronic sleep debt, and if you look at models throughout the world where school start times are delayed, attendance rates increase and truancy rates decrease, while academic grades increase and psychiatric referrals decrease. I don’t mean to trivialise things – getting children to school is not easy, and parents have to get to work – but if you look at the data, when sleep is abundant, minds flourish, and when it is not, they don’t.\n\nBarack Obama says he can survive on five hours of sleep . Nikola Tesla was said to exist on three. Is there any optimal amount? It’s seven to nine hours. Chronically sleeping less than seven hours is associated with cardiovascular disease, diabetes, immune and inflammation issues, cancer, hormonal issues and, of course, Alzheimer’s disease and dementia. There is a very small subset of the population that we now call “natural short sleepers”, but statistically you’re more likely to be struck by lightning.\n\nI love a good nap. So did Thomas Edison, right? Edison understood the creative brilliance of sleep and used it ruthlessly as a tool. He was also a habitual napper who would wake up and then write down all of the ideas he was getting. He called it “the genius gap”: [the short phase] between lucid, waking consciousness and the depths of non-conscious, deep sleep. It’s probably one of the reasons why no one’s ever said you really should stay awake on a problem.\n\nWhy do we sleep? Twenty years ago, the crass answer was, “We sleep to cure sleepiness”, which is the fatuous equivalent of saying, “I eat to cure hunger.” Now we ask, “Is there any major physiological system of your body or any operation of your mind that isn’t wonderfully enhanced by sleep when we get it, or demonstrably impaired when we don’t get enough?” And the answer seems to be no.\n\nHe calls himself a “humble servant of this thing called slumber”, but that would be selling British neuroscience professor Matthew Walker short. The author of Why We Sleep: Unlocking the Power of Sleep and Dreams, Walker is the expert of choice on one of life’s great mysteries (and necessities).\n\nWhat purpose do dreams serve? Dreaming is almost like a form of informational alchemy. During dreaming, we start to collide all the recent things that we’ve learnt with the back catalogue of information that we’ve already got, and as a consequence we wake up with a revised mind: a wide web of associations that is capable of divining solutions to previously impenetrable problems. It’s also a form of overnight therapy. With the special chemical cocktail that happens during dream sleep, it’s almost like a nocturnal soothing balm, taking the sharp edges off those painful, difficult experiences. Dreaming strips the bitter emotional rind from the informational orange.\n\nWhat’s the most common cause of insomnia? Sometimes I consider insomnia as the revenge of things we haven’t worked through during the day: the stuff causing anxiety and stress. You have to get your mind off itself. How? First, meditation. Next, with what’s called a body scan, relaxing as you focus on each part of your body from head to toe. If you don’t like the sound of that, try box breathing: inhale for five seconds, hold it for five seconds, and then exhale for eight seconds. Another thing that you can do is take yourself on a mental walk down the street in 4K hyper-vivid detail. Do not count sheep.\n\nLoading\n\nWhat are your top tips for good sleep? Try to stay away from too much caffeine in the afternoon and limit your alcohol use, because it will fragment your sleep. Your bedroom temperature should be cool: about 17 to 18 degrees. As for unconventional tips, set an alarm for one hour before you expect to go to bed, then shut down all the lights in your house. You will be stunned by how sleepy and soporific that will make you feel. In that same hour before bed, try to limit the use of devices – not because of the blue light but because they hit the mute button on your sleepiness and cause what’s called “sleep procrastination”. Also, go to bed at the same time and wake up at the same time. I know it sounds desperately pedestrian, remarkably vanilla and deeply boring, but if you want to sleep, regularity is your first best step.\n\nDo we undervalue sleep? We are still in the mentality of competitive under-sleeping, and whoever the PR agent for sleep has been, we probably should have fired them long ago because there’s a terrible stigma about getting sufficient sleep, which is strange. No one looks at an infant sleeping during the day and says, “What a lazy baby”, but we do that to adults. Don’t think of sleep as a cost to today; sleep is an investment in tomorrow.\n\nProfessor Matthew Walker will be speaking at the Sydney Town Hall on May 27, as part of Vivid and the Sydney Writers’ Festival.\n\nTo read more from Good Weekend magazine, visit our page at The Sydney Morning Herald, The Age and Brisbane Times.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/i-took-credit-for-my-team-s-golden-era-i-must-be-the-reason-it-ended-20250508-p5lxoo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I took credit for my team’s golden era. I must be the reason it ended",
        "publish_date": "Thu, 15 May 2025 12:00:00 +1000",
        "category": "sports",
        "authors": [
            "Brodie Lancaster"
        ],
        "text": "Some blame the coach. Others point fingers at the players. Maybe the off-field antics are too distracting. But I know the truth: I’m the reason my footy team is losing.\n\nWhen I show up to the ’G, flash my newly purchased membership card and head to my reserved seat with my bag of cinnamon donuts – bought only minutes ago and already turning an opaque brown bag translucent with delicious, sugary grease – I’m filled with hope. And I have reason to be!\n\nCredit: Robin Cowcher\n\nWhen I adopted Richmond as my team in 2012, the tides began turning. After not making finals for more than a decade, that September saw them have a crack. Coincidence? Absolutely not. I might not have known the rules, but I knew I was the difference.\n\nA few years later it wasn’t Dustin Martin or Jack Riewoldt or the latest in a line of Riolis to steer us into our first premiership in 37 years. It was my presence and repeated scarf-wearing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/vale-robert-walls-afl-legend-s-best-columns-for-the-age-20250514-p5lz40.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Vale Robert Walls: AFL legend’s best columns for The Age",
        "publish_date": "Thu, 15 May 2025 11:58:42 +1000",
        "category": "sports",
        "authors": [],
        "text": "Opinion\n\nAs a coach, you like your young players to pull their heads in and do a lot of looking and listening. I thought Jason Akermanis would rub a few people the wrong way. And he did.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/trump-and-the-oil-cartel-are-on-a-collision-course-20250515-p5lzce.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump and the oil cartel are on a collision course",
        "publish_date": "Thu, 15 May 2025 11:58:35 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The US onshore oil sector is particularly sensitive to oil prices. While break-even prices vary significantly between the basis, the rule of thumb is that they generally need something above $US60 a barrel to break even on new wells and $US65 a barrel or more to generate profits attractive enough to provide an incentive to drill. Oil prices have demonstrated acute sensitivity to Donald Trump’s trade policies. After Trump’s “Liberation Day,” global oil prices plummeted, with Brent crude tumbling from around $US75 a barrel to less than $US60 a barrel. The US domestic price, the West Texas Intermediate (WTI), fell to as low as $US55 a barrel. After Trump paused his “reciprocal” tariffs and agreed a 90-day truce with China, with big cuts to the tariff rates, oil prices have recovered, with Brent trading around $US66 a barrel and WTI around $US62 a barrel. Not helping the position of the US producers is the impact on Trump’s tariffs on steel and steel products, cement and drilling fluids. A leading energy consultancy, Wood Mackenzie, says costs will have risen 4.5 per cent by the fourth quarter of this year as a result of those tariffs, which remain in place. The firm expects the cost of the steel pipes used in drilling, production and completion of wells to rise by 40 per cent and be the major contributor to the overall cost increases.\n\nSo, the “prices down, costs up” outlook will lead to less investment and less future production. That may be one of the objectives that the Saudi-led OPEC is pursuing. OPEC+ has embarked on a U-turn in its strategy this year. Oil prices have demonstrated acute sensitivity to Donald Trump’s trade policies. Credit: AP For three years it restrained production. It took a total of about 6 million barrels a day of oil out of the market via production cutbacks over that period, with the Saudis bearing the brunt of those cutbacks – they contributed about 1 million of the 2.2 million barrels a day of “voluntary” cutbacks announced in late 2023 for last year’s production targets.\n\nThis year the cartel has started returning some of that curtailed production to the market. The original plan was to do it incrementally through to September next year. Instead, after announcing an increase in output of 38,000 barrels a day in April OPEC suddenly ramped that up to 411,000 barrels a day for May and then, earlier this month, announced a similar increase for June. In just over three months it will have added nearly half the volume that it had planned to add over 18 months. Loading The primary motivation for that increase, which has been led by the Saudis, is to respond to over-production from members of the cartel who haven’t honoured their commitments -- Kazakhstan and Iraq in particular – and have produced at rates above their agreed caps. The Saudis, having shouldered the bulk of the burden of reduced production, have had enough and are prepared to live with the lower prices – well below the estimated $US90 a barrel or so needed to balance their budget – in exchange for the bigger volumes and the opportunity to discipline the recalcitrant members of the cartel.\n\nThe ancillary benefit is the impact it has on the US, where shale has made it the world’s largest oil producer. Driving the prices down will, as its own forecasts suggest, drive some shale producers out of the market and lower the US industry’s global market share, albeit that the shale sector is very flexible and innovative and has a greater ability to turn its production off and on than traditional producers. The 2014 oil price collapse, triggered by a big surge in OPEC supply, saw oil trade below $US30 a barrel. It ignited a wave of bankruptcies in the US shale sector. As soon as the price stabilised, however, production sprang back, with significantly lower costs. Trump’s trade war, even if its severity is scaled back after the 90-day pauses on the reciprocal tariffs and China end, is depressing both global economic activity and the growth rate of the US economy. The US economy grew 2.8 per cent last year. OPEC is forecasting growth of only 1.7 per cent this year.\n\nDespite that lower growth in prospect, OPEC, pointing to last weekend’s temporary truce between the US and China, says there is potential for more lasting agreements and a normalisation of trade flows, albeit at potentially elevated tariff levels compared to the pre-Liberation Day escalation of trade hostilities. Loading Nevertheless, it has left its forecasts for the increase in global oil demand this year unchanged at 1.3 million barrels a day and downgraded them only slightly, to 1.218 million barrels a day, for next year. By comparison, the International Energy Agency has forecast an increase of only 726,000 barrels a day. If the US and the non-OPEC producers don’t reduce their output heavily this year, OPEC+ producers continue to unwind their production cuts at the current rate and the impact of the US trade policies continue to chill global economic activity, there is a very real prospect of as glut of oil developing and another big slump in prices. Trump will get his lower prices in those circumstances, which would help modestly offset the impact of his tariffs on inflation. What he wouldn’t get is the boom in the shale oil sector that was supposed to be a key plank in his economic strategy.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2012-malthouse-a-big-risk-as-blues-err-in-axing-ratten-20250514-p5lz5a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2012: Malthouse a big risk as Blues err in axing Ratten",
        "publish_date": "Thu, 15 May 2025 11:57:13 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on August 30, 2012.\n\nIt’s 2001 and after 10 years as Carlton coach, David Parkin hands the reins to the low-profile Wayne Brittain. Brittain coaches the Blues to fifth spot. The next year they plummet to 16th, and president John Elliott can’t get rid of Brittain quick enough because he wants to announce that the Blues have landed a big fish, dual premiership coach Denis Pagan. It’s a coup that Elliott thinks will save his backside and keep the supporters happy.\n\nAfter all, how could you go wrong with a premiership coach?\n\nBut it doesn’t work. Pagan lasts almost five years and takes the Blues to 15th, 11th, 16th, 16th and 15th. Towards the end of Pagan’s tenure, they sack him and Brett Ratten takes over. There are six games to go, but the Blues don’t want to win, even if they could. The priority is to secure Matthew Kreuzer in the draft, which they do.\n\nSo Ratten, a rookie senior coach, has his first summer to prepare a very ordinary list that’s full of skill, cultural and discipline problems. It’s a list that has delivered to Carlton its first ever wooden spoons. These have been the darkest days in Carlton’s long history.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/celebrity/why-is-taylor-swift-caught-up-in-the-baldoni-lively-legal-battle-20250515-p5lzcb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why is Taylor Swift caught up in the Baldoni-Lively legal battle?",
        "publish_date": "Thu, 15 May 2025 11:57:03 +1000",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Four months ago, the legal battle between Blake Lively and Justin Baldoni began. Now, after a string of countersuits, Taylor Swift has been dragged into the fray.\n\nOn May 9, the pop star was subpoenaed as a witness in Baldoni’s $US400 million defamation countersuit against his It Ends With Us co-star. The trial is set for March 2026. Here’s what Swift has to do with it.\n\nTaylor Swift and Blake Lively have been friends for years. Credit: Getty\n\nHow is Swift involved?\n\nSwift and Lively have been close friends since 2015. Her song, My Tears Ricochet, featured in It Ends With Us, the dark romance film that Baldoni directed and starred in with Lively.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2009-he-s-brash-but-boy-can-aka-play-20250514-p5lz5b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2009: He’s brash, but boy can Aka play",
        "publish_date": "Thu, 15 May 2025 11:56:39 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on May 22, 2009.\n\nIt was January 1995. The Brisbane Bears were having their pre-season training camp just north of Noosa. We drove up from Brisbane in private cars and, as coach, I took three teenage kids who were old enough to be on the senior list, but too young to have a licence.\n\nThe last lad I picked up was short, ginger-haired and freckle-faced. Jason Akermanis was his name. He lived with his mum who was on her own raising her two boys.\n\nThe year before, as a schoolboy, “Aka” had played Teal Cup for Queensland. He stood out with his exceptional pace. In those days, the Bears could take the pick of the Queensland kids, so Jason joined Michael Voss and Marcus Ashcroft, who had been taken in previous years, as local 17-year-olds.\n\nAka jumped in the car talked non-stop, but he didn’t really say anything. It was my first introduction to his world. He was different. Did the incessant talk indicate a lack of confidence? With no father in his life, was there an insecurity? Did he feel a need to prove himself?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2007-fond-memories-of-an-old-sparring-partner-20250514-p5lz5w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2007: Fond memories of an old sparring partner",
        "publish_date": "Thu, 15 May 2025 11:56:30 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on July 27, 2007.\n\nMy old adversary Kevin Sheedy’s exit from Essendon at the end of this season is both a sad and exciting scenario. Most people don’t like change, but the Bombers have made the correct call and as the veteran coach said himself, this is a decision that will energise both parties. And it will.\n\nTwenty-seven years is a long time. Sheedy will make a success of his third phase in football, just as he did as a player and coach.\n\nIn fact, he will enter, I dare suggest, into the happiest time of his life, where alongside loyal and supportive wife Geraldine, he will be able to spend more time sharing life with, and encouraging, family and friends.\n\nAnd perhaps after 40 years, the two of us might learn to get along. Our competitiveness stemmed from being in teams that didn’t like each other.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2007-the-golden-west-coast-era-of-the-mid-2000s-brought-the-game-into-disrepute-20250514-p5lz4i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2007: The golden West Coast era of the mid-2000s brought the game into disrepute",
        "publish_date": "Thu, 15 May 2025 11:56:17 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on March 31, 2007, stirring passionate debate when revelations about the Eagles first became public.\n\nTonight at Telstra Stadium in Sydney, I want to see the Swans smash West Coast. I want good to triumph over evil.\n\nPerhaps that sounds a bit dramatic, but you cannot help how you feel, so for the good of football, for right over wrong, for two teams to get what they deserve, I want Sydney to win and win well.\n\nProblem is, however, you don't always get what you deserve.\n\nSadly, the actions of too many Eagles have brought our great game into disrepute. Coach John Worsfold, who is the most solid of solid citizens, tells us up to eight of his players have told him that they have used illicit drugs.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2004-go-now-libba-if-you-did-it-20250514-p5lz5t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2004: Go now, Libba, if you did it",
        "publish_date": "Thu, 15 May 2025 11:55:48 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on April 9, 2004.\n\nIf Tony Liberatore was responsible for the felling of Matthew Knights 100 metres off the ball at the MCG on Saturday, then he should give the game away.\n\nAnd, if he was responsible and feels the need to soldier on, then his club should do him a favour and insist that he retire.\n\nIf Liberatore caused the split in Knight’s forehead, then it has to be the last straw in a list of unsavoury incidents that have sullied the Brownlow medallist’s past few seasons.\n\nThere has been much to admire about Liberatore’s career. He has had to fight the odds to survive, but in recent years it has been sad to see him desperately clinging to a career that he knows is slipping away fast.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2004-greatness-in-black-and-white-20250514-p5lz5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2004: Greatness in black and white",
        "publish_date": "Thu, 15 May 2025 11:55:34 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on March 29, 2004.\n\nJust before the match between Collingwood and St Kilda last Sunday, I was asked whether Greg Williams should retire. My immediate reaction was to say: “Call it quits.” Suspensions, age and a crook knee were all against him.\n\nThen “match-winner” flashed before my eyes. Williams is a genuine match-winner, able to turn a game with flashing hands, weighted kicks and bone-jarring hits, and there are not that many match-winners around.\n\nMinutes later, I had the pleasure of seeing another match-winner on centre stage at the MCG before a crowd of nearly 70,000. It was Nathan Buckley.\n\nI first met Buckley in Adelaide on the morning of a match between the Crows and the Bears in 1991. He was 18 years old, skinny, pale-faced, and playing for Port Adelaide reserves. He was also on Brisbane’s extended list of 60, courtesy of Northern Territory concessions. I’d been to Darwin and Alice Springs to meet the seven Aboriginal boys; Buckley, with his pale face and sandy hair, was the odd one out.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2003-disgraceful-magpies-took-footy-fans-for-a-ride-20250514-p5lz5i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2003: Disgraceful Magpies took footy fans for a ride",
        "publish_date": "Thu, 15 May 2025 11:55:07 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on September 29, 2003.\n\nI feel let down. I’ve been shortchanged, fooled, duped and embarrassed. And I don’t even barrack for Collingwood. But I did tip it. And it did not give a yelp.\n\nNever, not once at any stage in the game, did the team that I put my faith in show some resolve.\n\nThis team took us for a ride. It had so much going for it. Twenty-two fit players, fine form, the all-important week off during the finals, and a travel schedule that was almost non-existent.\n\nIf ever a team was poised to perform on the big day, Collingwood was it. But grand finals are something else. You cannot pick and choose what you do on “the” day.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/jobless-rate-steady-ahead-of-rba-rates-decision-20250515-p5lzfn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jobless rate steady ahead of RBA rates decision",
        "publish_date": "Thu, 15 May 2025 11:55:06 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jobless rate steady ahead of RBA rates decision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2003-to-rohan-barass-and-knightsy-i-m-sorry-20250514-p5lz5e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2003: To Rohan, Barass and Knightsy – I’m sorry",
        "publish_date": "Thu, 15 May 2025 11:54:47 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on May 23, 2003.\n\nI let Western Bulldogs dasher Rohan Smith down last week. I regret what I did and wish I could turn back time, but that can’t happen. With me as “special comments” man with 3AW, we covered last Sunday’s Carlton-Bulldogs game.\n\nAn apology to Bulldog Rohan Smith. Credit: Pat Scala\n\nDuring the second quarter, Carlton forward Adrian Hickmott was forced to leave the field with blood trickling from his forehead. I didn’t see what happened. Two people near me, who were not members of the commentary team, assured me that Rohan Smith had bitten Hickmott. They had watched replays of the pair rolling on the ground on a TV monitor. Irresponsibly, I said on air that “there could have been a bite involved in Hickmott’s leaving the field”. I didn’t mention Smith’s name, but I didn’t have to for the finger to be pointed at him.\n\nTwo days after the game, the AFL held an investigation into why Hickmott left the field. The investigation didn’t last long as it was obvious there was no case to answer.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/2001-gloves-off-over-a-fight-for-respect-20250514-p5lz5v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "2001: Gloves off over a fight for respect",
        "publish_date": "Thu, 15 May 2025 11:54:03 +1000",
        "category": "sports",
        "authors": [
            "Robert Walls"
        ],
        "text": "Vale Robert Walls, a fixture of the VFL/AFL for 50 years and longtime football columnist for The Age. Read the best of his past columns here.\n\nThis opinion piece by The Age’s late columnist Robert Walls was first published on April 21, 2001.\n\nShane Strempel. Credit: Greg Wood\n\nMuch has been spoken and written of the time 10 years ago when I had Shane Strempel put the gloves on at a training session. Let me say, it’s no big secret.\n\nHundreds of people have known about it and putting the gloves on at the Bears was commonplace back in the early 1990s. Shane, who treated the club and his teammates with a lack of respect, needed to be put in a position of dealing with some controlled aggression.\n\nHe needed to know that he had to pay a price for his indiscretions, and he needed to be given an opportunity to earn some respect.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-pale-raw-boned-boy-who-became-an-afl-legend-20231204-p5eorm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The pale, raw-boned boy who became an AFL legend",
        "publish_date": "Thu, 15 May 2025 11:53:19 +1000",
        "category": "sports",
        "authors": [
            "Andrew Stafford"
        ],
        "text": "Walls was born in Dunolly, in western Victoria, and was attending Coburg High School, in Melbourne’s northern suburbs, when he was spotted by Carlton. His arrival at the club coincided with Ron Barassi’s first stint as a captain-coach. Walls’ refusal to take prisoners was a direct result of his master’s tutelage. Loading It made for a career that included its share of controversies, feuds and fallings-out. But Walls was never one to hold back. He booted a goal with his first kick, before securing his place in defence, where his long arms and aerial judgment were put to good use. In 1969, with a bit more meat on his bones, he returned to centre half-forward. The following year, Walls was critical as Carlton stormed home to steal the premiership cup from Collingwood. But it was his performance in the 1972 grand final that will stand forever. With captain-coach John Nicholls orchestrating a shootout with Richmond, Walls was supreme in the highest-scoring grand final in VFL/AFL history. Nicholls kicked six goals that day, and Alex Jesaulenko seven.\n\nAlthough the Norm Smith Medal had yet to be introduced, Walls was the unanimous choice as best afield, with six goals from 24 possessions, including a withering burst early in the second quarter that took the game away from the Tigers. Walls played 218 matches for Carlton and added another 41 for Fitzroy (1978-80) for a total of 259 games, in which he kicked 444 goals. John Elliott was president and Robert Walls was coach when Carlton won the 1987 VFL premiership. Credit: The Age In 1981, he began coaching Fitzroy while teaching at Park Orchards Primary School; the game was still only semi-professional. Walls quickly proved an astute thinker and tireless standard-bearer. “He was extraordinary, he was ahead of his time, and he changed all our lives,” said former Fitzroy tagger Scott Clayton, who later worked under Walls as director of football at the Brisbane Bears.\n\nAfter finishing bottom of the ladder in 1980, the financially ailing Fitzroy rebounded under Walls, making the finals in three of his five years at the helm with emerging and established champions including Bernie Quinlan, Garry Wilson, Gary Pert and Paul Roos. At the end of 1985, Carlton sacked coach David Parkin. Walking out of Seven’s studios after an interview, Parkin bumped into the man who had been appointed to replace him. It was Walls. The pair were swapping jobs, with Parkin taking over at Fitzroy. Carlton greats Robert Walls, Stephen Kernahan and David Rhys-Jones in 2017, marking the 30-year anniversary of their 1987 premiership win. Credit: Joe Armao Walls suggested the pair catch up for a yarn. “I must admit I wasn’t terribly concerned about spending time with him at that stage,” Parkin chuckled. But over the next few hours, Walls astonished him by taking him through Fitzroy’s entire list in detail. Parkin returned the favour. It was a collegiate gesture, unthinkable today, that benefited both men and cemented a lifelong friendship. Parkin, a four-time premiership coach, regards his first year at Fitzroy, 1986, as his finest coaching performance, when the Lions made the preliminary final.\n\nIt was Fitzroy’s last gasp as a competition contender. They were beaten in the preliminary final by Hawthorn, who would in turn beat Carlton under Walls in the grand final. But the Blues turned the tables in 1987, winning the premiership and confirming Walls’ stature as a Carlton immortal. In a famous move, Walls battled his match committee to play the feisty David Rhys-Jones, normally a winger or flanker, on Hawthorn’s equally pugnacious centre half-forward Dermott Brereton. It worked: Rhys-Jones kept Brereton goalless and won the Norm Smith Medal. Robert Walls (centre) ventured north in 1991 to coach the Brisbane Bears. Credit: Mike Lader Celebrations were brief. Only a fortnight later, Carlton played an infamous exhibition match against North Melbourne in London, the so-called “Battle of Britain”. Most of the Blues were still hungover, and the two sides brawled senselessly in the supposed friendly. Later, Walls castigated club president John Elliott, the beer baron whose Carlton and United Breweries had sponsored the event. Blues chief executive (and Walls’ former teammate) Ian Collins was furious. This time, Walls knew his willingness to speak his mind would come back to bite him.\n\nIt didn’t take long. Carlton crashed out of the 1988 finals with losses to Hawthorn and Melbourne. Walls berated his troops in the aftermath, and lost them for good. He was sacked the following season after Carlton lost eight of their first 10 games. “I was too hard on the players, in hindsight,” he told News Limited’s Sacked podcast in 2019. “I drove them relentlessly hard; I was looking for fault, more than I was to give them a pat on the back. I was too brutal, too uncompromising.” Walls celebrates the 1987 grand final win with wife Erin. Credit: Craig Abraham Walls went to the Brisbane Bears in 1991. That year, he exposed a 21-year-old recruit, Shane Strempel, to a boxing session against eight of his teammates. It stopped only when star player Brad Hardie intervened. “We’d better stop or we’ll kill him,” he told the coach. It was a stain on Walls’ career, but his time at a club that was derided as the “bad-news Bears” was arguably his most influential. In 1995, he dragged a team featuring Michael Voss, Jason Akermanis, Nigel Lappin, Justin Leppitsch and Craig McRae into the finals for the first time.\n\nRobert Walls relaxing later in life with his dog Gus. Ironically, they were knocked out by the all-conquering Carlton, again coached by Parkin. “We talk about the [Ted] Whittens and the Barassis of the world, but I think Rob was a leader, up with the great coaches that came before and after him,” Parkin said of his old friend. If his man-management style was of the old school, Walls was tactically innovative. One signature set play was the kick-in huddle, where players would cluster at centre-half-back, then burst into space. Parkin eventually introduced the zone defence to counter it. When Walls’ coaching career finished, he was quickly in demand as an analyst. As usual, his candour led to clashes. He sparred with Sydney coach Paul Roos, declaring his former pupil’s Swans couldn’t possibly win the flag in 2005. They did. Walls later sought unsuccessfully to apologise to Roos. In print and on air, Walls was straight to the point and unsparing. “We always wondered when the sledgehammer was coming out,” Lane remembers. “But it’s not something he would have done lightly, there was a sense of duty and professionalism about the way he went about it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/trump-said-kids-should-only-get-two-dolls-but-monica-is-ready-to-save-christmas-20250514-p5lz2y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump said kids should only get two dolls. But Monica is ready to save Christmas",
        "publish_date": "Thu, 15 May 2025 11:51:26 +1000",
        "category": "finance",
        "authors": [
            "Lisa Visentin"
        ],
        "text": "Guangzhou: When news broke this week of a 90-day trade truce between the US and China, Monica Xie hit the phones immediately.\n\nFor more than a month, the Chinese toy company she works for had been paralysed by the ratcheting trade war as the world’s two biggest economies whacked each other’s imports with sky-high tariffs, grinding shipments to a halt on either side of the Pacific Ocean.\n\nMonica Xie, 33, sales representative of a Guangdong-based toy company, said she began calling US suppliers this week as soon as the trade truce was announced. Credit: Sanghee Liu\n\nFor Xie’s company, Shantou Mingbo Toys, that meant tens of thousands of children’s dolls ready to ship in US-bound containers had been stranded at its warehouse in the port city of Shantou, in the southern Chinese province of Guangdong.\n\nThe company’s business model is almost entirely geared towards the export market, Xie said, with America accounting for 50 per cent of its sales. It counts massive retailer Walmart among its buyers.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-council-issues-28000-in-fines-impounds-400-vehicles-in-growing-suburban-battle-010227218.html",
        "title": "Aussie council issues $28,000 in fines, impounds 400 vehicles in growing suburban battle",
        "publish_date": "2025-05-15T01:02:27Z",
        "category": "finance",
        "authors": [],
        "text": "The tension over boats and trailers on suburban streets is heating up again — and one Sydney council says it is being swamped with complaints.\n\nA Randwick resident complained that this trailer takes up too much space on the kerb. Source: Facebook/Geoff Surtees\n\nIt's an increasingly controversial question that attracts heated debate across Australia's suburbs — do trailers, caravans and boats belong on suburban streets?\n\nWith parking in the country's major cities often scarce, some residents argue trailers, boats and caravans take up critical space. In many reported cases, they're dumped in a location for weeks on end, adding to congestion and parking difficulties for locals.\n\nBut for boat owners, they're legally allowed to be parked outside an owner's home, or any location for that matter, for 28 days. However, those doing the wrong thing can pay the price, with one inner city local government area already dishing out $28,000 in fines for vehicles left for too long.\n\nIn Sydney, the issue is one that coastal residents are all too familiar with. This week, Randwick City Council told Yahoo News Australia rangers had been kept quite busy tending to reports of what residents claimed were unattended vehicles and trailers.\n\nOne boat owner was shocked to find an angry message painted onto its tarp in Freshwater recently. Source: Reddit.\n\nRandwick Council impounded 440 dumped trailers and vehicles\n\nOn Wednesday, a local man unleashed online over a boat parked on St Marks Road in Randwick. \"Why isn't council doing more to prevent this from happening?\" he complained online. \"This boat takes up 1.5 car spaces.\"\n\nADVERTISEMENT\n\nWhen asked by Yahoo News, the council said it is actively monitoring and removing trailers that have overstayed their welcome in its streets. \"State government rules allow owners of registered trailers to park their trailer legally on the street outside their home, and to park the trailer elsewhere for up to 28 days before moving it,\" a Randwick City spokesman told Yahoo.\n\n\"Rangers have investigated 932 suspected unattended vehicles in 2025, impounding 440 and issuing over $28,000 in fines.\"\n\nThe spokesman urged residents, if they believe a vehicle or trailer has remained unmoved in the same location for more than 28 days, to report it.\n\nIt's not the first time the council has targeted large vehicle owners. In December, it banned parking for almost five kilometres along a busy nature strip that had become \"increasingly popular for storage of boats, caravans and trailers\".\n\nBoat wars erupt across Sydney\n\nIn the city's north, a bitter neighbour war recently erupted over this exact issue, with the words \"f**k it off\" sprayed in bright red paint on a parked boat in Freshwater.\n\nADVERTISEMENT\n\nHitting back, the boat owner explained they had legally obtained a permit to park it there. \"The boat and trailer are registered, and we can thus park it legally in the street,\" they wrote in a response letter, which they taped to the boat.\n\n\"We live in the street and haven't just parked it here as it looks like a quiet spot. I have tried to be thoughtful... Hope you can understand and not graffiti or damage our family boat\".\n\nA person, who may or may not have been the original vandal, then responded to the letter with their own. \"If you do live in the street, park your boat on your drive, or out the front of your house,\" it said.\n\n\"Be a good neighbour, and not just someone who moved here recently.\" Understandably tired of the drama, the boat's owner then posted another — and presumably the last — letter to the community. It read: \"The boat will be moved in the next few days, please do not damage it or graffiti it\".\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]