[
    {
        "url": "https://www.9news.com.au/world/air-canada-flights-to-australia-cancelled-ahead-of-potential-strike/79470b36-68b0-4908-8fe3-3ce93285920d",
        "title": "Australia flights among hundreds scrapped by global airline ahead of strike threat",
        "publish_date": "Fri, 15 Aug 2025 00:09:54 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "A small number of Australian services are being impacted as Air Canada started cancelling flights overnight ahead of possible industrial action.\n\nThe airline announced a first set of cancellations involving several dozen flights impacting long-haul overseas flights due to depart Canada yesterday.\n\nThey include Air Canada's flight from Vancouver to Sydney scheduled to depart last night and the returning flight due to leave Sydney tomorrow.\n\nAir Canada has begun cancelling hundreds of flights ahead of possible strike action. (Darryl Dyck/The Canadian Press via AP) (AP)\n\nThe union representing around 10,000 Air Canada flight attendants issued a 72-hour strike notice Wednesday. In response, the airline issued a lockout notice.\n\nMark Nasr, chief operations officer for Air Canada, said the carrier has begun a gradual suspension of operations.\n\n\"All flights will be paused by Saturday early morning,\" he said.\n\nNasr said this approach will help facilitate an orderly restart \"which under the best circumstances will take a full week to complete.\"\n\nHe said a grounding will affect 25,000 Canadians a day abroad who may become stranded. They expect 500 flights to be cancelled by the end of Friday.\n\nAir Canada executives are interrupted by Air Canada flight attendants during a news conference as a possible strike looms, in Toronto, on Thursday, August 14, 2025. (Nathan Denette/The Canadian Press via AP) (AP)\n\nHe said customers whose flights are cancelled will be eligible for a full refund, and it has also made arrangements with other Canadian and foreign carriers to provide alternative travel options \"to the extent possible.\"\n\nThe union has said its main sticking points revolve around what it calls flight attendants' \"poverty wages\" and unpaid labour when planes aren't in the air.\n\nSome flight attendants at the airline's news conference on Thursday held up signs that read \"Unpaid work won't fly\" and \"Poverty wages = UnCanadian.\"\n\n- With AP﻿\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australians-are-consuming-a-lot-more-of-these-four-drugs/26afbacd-1621-47b1-8ca9-86eb5e17ff35",
        "title": "Australians are consuming a lot more of these four drugs",
        "publish_date": "Fri, 15 Aug 2025 00:07:08 +0000",
        "category": "lifestyle",
        "authors": [
            "Aug"
        ],
        "text": "Australia's consumption of four illicit drugs has increased by a significant amount, the latest wastewater testing has revealed.\n\nThe Australian Criminal Intelligence Commission's (ACIC) latest wastewater report ﻿revealed that 22.2 tonnes of methylamphetamine, cocaine, heroin and MDMA were consumed between August 2023 to August 2024.\n\nThe results indicate a 34 per cent increase from previous years, driven by a massive increase in the consumption of illicit drugs. ﻿\n\nACIC's latest wastewater report ﻿revealed that 22.2 tonnes of methylamphetamine, cocaine, heroin and MDMA were consumed between August 2023 to August 2024. (Getty)\n\nThere was a 21 per cent increase in ﻿methylamphetamine usage, a 69 per cent increase in cocaine usage, a 49 per cent increase in MDMA usage and a 14 per cent increase in heroin usage.\n\nACIC's annual survey ﻿covers 57 per cent of the country's waterways, with the goal of monitoring national drug use.\n\nThey screen for methylamphetamine, amphetamine, cocaine, 3,4-methylenedioxymethylamphetamine (MDMA), 3,4-methylenedioxyamphetamine (MDA), heroin, cannabis, oxycodone, fentanyl, nicotine, alcohol, and ketamine.\n\nAlcohol and nicotine were the most consumed legal drugs. (Getty)\n\nACIC CEO Heather Cook estimated the drugs detected had a total street value of $11.5 billion, with methylamphetamine accounting for $8.9 billion.\n\n\"The 2.2 tonne increase in national meth consumption is concerning because 12.8 tonnes is the highest annual level recorded by the program and the drug causes significant community harm,\" Cook said.\n\n\"Similarly, there has been a large increase in national cocaine consumption, also to the highest annual level recorded by our wastewater program.\"\n\nThis is the first time that cocaine, heroin and meth have been consumed at record-high levels simultaneously since the wastewater screening program began.\n\nAlcohol and nicotine were the most consumed legal drugs.\n\nAlcohol usage increased while nicotine usage decreased.\n\nThe report also found that cannabis was the most consumed illicit drug.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/working-from-home-now-includes-majority-of-full-time-employees-australia/19aa9280-40cc-439f-b18a-848205f00c3e",
        "title": "This could be the final nail in the coffin for working in the office",
        "publish_date": "Fri, 15 Aug 2025 00:55:01 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "More than half of Australia's full-time employees now spend part of their week working from home, with the proportion sharply rising in the cities.\n\nNew research from Roy Morgan has shown that more than 6.7 million Australians, or 46 per cent of the total employed population, work from home at least some of the time.\n\nThat proportion rises to 51 per cent for full-time employees, and falls to 36 per cent for part-time employees.\n\nMore Australians are working from home, especially in the cities. (Getty)\n\n\"﻿These latest Roy Morgan findings clearly show that 'work-from-home' arrangements have become a permanent and distinct feature of Australia's employment sector,\" Roy Morgan chief executive Michele Levine said.\n\nThe trend is concentrated in the capital cities, with a majority of workers in Sydney (55 per cent), Melbourne (52 per cent), and Canberra (51 per cent) working from home.\n\nThat falls to below half in Brisbane (43 per cent), Adelaide, (44 per cent), Perth, (40 per cent), and Hobart (45 per cent).﻿\n\nIn regional Australia, work-from-home rates are noticeably lower, with Queensland (40 per cent) having the highest level, followed by NSW (39 per cent), Victoria (36 per cent), the Northern Territory (34 per cent), South Australia (33 per cent) and Western Australia (31 per cent).﻿\n\nSmaller workplaces, ﻿especially solo workers or the self-employed, naturally have the highest working from home rates (55 per cent), while smaller businesses have the lowest (38 per cent for workplaces with five to 24 employees).\n\nThe industries with the most people working from home include finance and insurance (66 per cent), communications (61 per cent), property and business services (57 per cent), and public administration and defence (56 per cent).\n\nThe five qualifications in hot demand for Australia's future jobs View Gallery\n\nBy contrast, just 31 per cent of retail employees work from home, with other low-level sectors including recreation and personal services (37 per cent) and transport and storage (38 per cent).\n\nIncome also makes a difference, with work-from-home rates peaking at﻿ 64 per cent for those with a wage of $300,000 or more.\n\n\"Gaining an in-depth understanding of the nuances surrounding current 'working from home' trends across different cities, industries, workplace sizes and income bands is vital to understand as businesses, employees, and policymakers adapt to a rapidly changing workforce landscape,\" Levine said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/health/social-sleep-apnea-linked-weekend-late-nights-alcohol-smoking/ab3c869f-71ef-4a6d-8938-3a99f0948fa5",
        "title": "What you do on the weekend could be ruining your sleep, experts reveal",
        "publish_date": "Thu, 14 Aug 2025 23:42:14 +0000",
        "category": "lifestyle",
        "authors": [
            "Aug"
        ],
        "text": "Everyday Australians living with ﻿a newly-identified sleep health concern could have no idea they're suffering from it.\n\nResearch from ﻿Flinders University has revealed that the severity of Obstructive Sleep Apnea (OSA), a common condition caused by repeated airway collapse during sleep, increases significantly on weekends.\n\nThis phenomenon may be linked to ﻿late nights, sleeping in, alcohol and smoking on weekends, leading FHMRI Sleep Health experts to dub it 'social apnea'.\n\nREAD MORE: Mystery after man found dead in river in outback Queensland\n\nSleeping man disturbed by alarm clock early in the morning (Getty)\n\nSleeping for an ﻿extra 45 minutes or more on weekends can almost double the risk of worse OSA, and adults under 60 had a 24 per cent higher risk of OSA on weekends.\n\nMen were also more likely to be affected.﻿\n\n﻿Experts warned this 'social apnea' could increase the risk of serious health conditions like heart disease, depression, dementia and extreme fatigue.\n\nIt could also contribute to motor vehicle and other accidents.\n\nREAD MORE: Taylor Swift reveals the image millions of people have been waiting for ahead of new album release\n\nNew data reveals the leading causes of road crashes in Australia View Gallery\n\nBut diagnosing social apnea through current sleep study methods may prove difficult.\n\n\"Most clinical diagnostic testing is done on a single night, typically a weeknight, missing the weekend effect we're now calling social apnea,\" lead author and Research Fellow Dr Lucia Pinilla said in a statement.\n\nFlinders professor and director of FHMRI Sleep Health Danny Eckert said this highlights the need for multi-night sleep assessments.\n\n\"Relying on a single-night sleep study may miss important variations, leading to underdiagnosis or misclassification of OSA severity,\" he said.\n\nREAD MORE: Prime Minister Anthony Albanese backs bid to host Donald Trump at Quad summit in Brisbane next year\n\nLead author and Research Fellow Dr Lucia Pinilla with Flinders professor and director of FHMRI Sleep Health Danny Eckert. (Flinders University)\n\nAustralians can reduce their risk of 'social apnea'﻿ by maintaining a regular sleep routine even (or perhaps especially) on weekends.\n\nThat means going to be when you feel sleepy, getting the ﻿recommended seven to nine hours of sleep each night, and waking up at about the same time each day.\n\nOSA already affectes about one billion people globally ﻿and, if left untreated, can lead to death.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/ampol-eg-group/6450c950-318e-4654-8307-bf5d9c5c16a1",
        "title": "Popular Aussie servos set for $1.1 billion takeover",
        "publish_date": "Thu, 14 Aug 2025 08:57:35 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "One of Australia's largest service station chains has launched a billion-dollar takeover of a British-owned operator.\n\nAmpol, which had been placed in a trading halt this morning ahead of the official announcement, told the share market this evening that it has reached an agreement to acquire EG Australia and its roughly 500 petrol stations.\n\nAmpol will spend about $1.1 billion in cash and shares to complete the takeover.﻿\n\nAmpol has launched a $1.1 billion takeover of EG Australia. (Louis Trerise/AFR)\n\nEG's service stations already bear the Ampol logo, which supplies it with about 2.3 billion litres of fuel each year.\n\n\"The proposed EG Australia acquisition makes sense for Ampol,\" chief executive and managing director Matt Halliday said.\n\n\"It is a business and market we understand well, given our multi-year relationship with them including fuel supply and brand licence agreements.\n\n\"We are uniquely placed to leverage our demonstrated capability as a known and trusted brand in fuel and convenience retailing.\"\n\nThe $1.1 billion price tag is a significant loss for the UK-based EG Group, which ﻿entered the Australian market in 2019 when it paid $1.73 billion for the Woolworths Petrol business and its 540 outlets.\n\nEG petrol stations already include Ampol branding, which supplies fuel to the servos. (EG Australia)\n\nHowever, fuel consumption has dwindled since then due to more efficient vehicles hitting the road, the rise of working from home, and particularly the emergence and take-up of electric vehicles in Australia.﻿\n\nThe takeover is subject to approval by the ACCC, and Ampol has proposed it will sell 20 outlets in order to avoid falling foul of the competition watchdog.\n\nIf approved, the deal is set to be completed by mid-2026.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/bollywood-star-aamir-khan-thanks-piracy-for-film-success/105656210",
        "title": "A Bollywood legend thanks piracy and embraces $2 films",
        "publish_date": "Fri, 15 Aug 2025 01:53:26 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "One of Bollywood's biggest stars says people illegally downloading his films helped grow his audience internationally, while technology is helping fans in India find new ways to watch his movies.\n\nAamir Khan has produced, directed and acted in some of Bollywood's biggest films including 3 Idiots, Lagaan, PK and Dangal.\n\nKhan is in Australia as the guest of honour for the Indian Film Festival of Melbourne, which will feature a major retrospective of his work as well as featuring his latest film, Sitaare Zameen Par.\n\nWhile audiences have traditionally watched his work on big screens, he told ABC's The World new audiences had found his films on smaller screens.\n\nHe said his film 3 Idiots \"went viral all over the place\" thanks to people illegally downloading it.\n\n\"My audience grew a lot in the east in countries like China, Singapore, and Japan, Korea,\" Khan said.\n\n\"It happened, quite honestly, thanks to piracy.\n\n\" I'm really happy that it did because it connected me to a huge audience that was otherwise not familiar with my work. \"\n\nKhan released his latest film, Sitaare Zameen Par, on YouTube for $2 per view. (Supplied)\n\nDespite international audiences growing, he became increasingly concerned about the challenges Indian audiences faced accessing his work.\n\nHe said there were roughly 9,000 cinemas for India's population of 1.4 billion people.\n\nIn comparison, there are about 35,000 in the United States and 90,000 in China.\n\n\"Of these 9,000 [Indian cinemas] around half service the south languages, so for a Hindi film, you have roughly 4,000-5,000 screens available, too small a number,\" he said.\n\nWhile initially believing building more brick and mortar theatres was the answer, he has since turned to the internet and YouTube.\n\nHis latest film Sitaare Zameen Par (Stars on Earth) has been released on YouTube at a cost of 100 rupees ($2) per view.\n\nFilms from his back catalogue are also expected to become available.\n\nHe said increasing internet access in India and the growing number of electronic payments inspired the idea.\n\nMore than 419 million people use the platform in India, making it YouTube's biggest audience in the world.\n\nIndustry estimates suggest that some 10-12 million people in India have a Netflix subscription.\n\n\"As a creative person, I want my film to be able to reach everyone across the country in India,\" he said.\n\n\"Now is the time finally where my film can reach a large audience and I think that really helps cinema on the whole.\"\n\nPay-per-view could democratise Bollywood\n\nIndian cinema expert at London Metropolitan University, Sunny Singh, told the ABC the move could help democratise Bollywood for domestic audiences.\n\nShe said ticket costs were increasing and theatres were closing in small Indian cities and that some cinemas had become vandalised for showing films deemed to be controversial.\n\n\"This could be the silver bullet that shifts things … you're basically widening the demographic for multiple reasons — economic, social [and] safety,\" Professor Singh said.\n\n\"If you get a pay-per-view … you're watching it at home, you're watching it in ways where you can have family around, you can also work with issues around safety and security.\n\n\"Lots of parts of India are not conducive spaces for women in movie theatres, especially if it is past certain times.\n\n\"It's a rather unprecedented move, I can't say it's a smart move, but it's a very interesting move and I'm very curious to know how it pans out.\"\n\n‘You have to suck up or shut up’: Bollywood's unforgivable sin Photo shows Actors. In India, the Modi government is accused of waging a war on Bollywood and using it for party propaganda.\n\nGlobal cinemas expert at Queen Mary University of London, Ashvin Devasundaram, agreed.\n\nDr Devasundaram said given Khan's stature in the industry, it could set a \"precedent\" for Bollywood and independent filmmakers alike.\n\nHowever, he cautioned that the Indian government, which approves all films for circulation, would not hesitate to attempt to force YouTube to remove content that it viewed as being contentious.\n\n\"There are films that have been more politically interrogative that the government has actively tried to intervene and get YouTube to remove, including trailers, so YouTube is also susceptible to these dictates of censorship,\" Dr Devasundaram said.\n\nYouTube blocked viewers in India from accessing an ABC Four Corners investigation into the Indian state last year.\n\nThe investigation accused the Indian state of threatening Australia's national security.\n\nYouTube said the video was restricted following a valid legal request but the nature of the order was \"confidential\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/harry-grant-nathan-cleary-field-goal-penalty-controversy-nrl/105657682",
        "title": "Cleary 'frustrated' after Storm skipper 'played for' controversial penalty",
        "publish_date": "Fri, 15 Aug 2025 01:09:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "Melbourne is one of the few teams in the NRL this season that has had a game-winning field goal chalked off for foul play while in possession.\n\nIt happened when Trent Loiero gave away a penalty while playing the ball before Ryan Papenhuyzen slotted with a one-pointer with five minutes left in a Magic Round loss to Canberra.\n\nOn Thursday night, the rugby league gods flipped the script by rewarding the Storm with a dubious call of their own when Harry Grant milked a penalty as Nathan Cleary potted from 27 metres out.\n\nPenrith denied match-winning field goal, Storm win in golden point Photo shows Nathan Cleary of the Panthers remonstrates with referee Ashley Klein after his successful field goal was disallowed. Melbourne Storm captain Harry Grant scores a try in the second minute of golden point to defeat the Penrith Panthers.\n\nGrant shot out of marker and, rather than make a beeline for Cleary's right kicking boot, took the scenic route to the left of the halfback around and ultimately into Panthers prop Moses Leota.\n\nReferee Ashley Klein blew his whistle the moment Grant hit the deck and before the ball passed between the posts, explaining the penalty to Leota before turning to Grant and saying \"don't try and milk it either\".\n\nKlein's comment after the fact was perhaps a recognition that Grant's efforts were not entirely dairy-free and Cleary protested, challenging the penalty.\n\nBunker replays showed Grant hamming it up as he ran towards and around Leota, sticking an arm out and going to ground dramatically.\n\nFans at Western Sydney Stadium may have had some hope of the on-field call being overturned, but bunker official Chris Butler broke their hearts, announcing: \"Moses is now in a blocking position that denies Harry Grant a fair run to the ball. The challenge is unsuccessful.\"\n\nYou could hear the wry smile on the face of Cameron Smith, Grant's predecessor and one of the game's greatest exploiters of NRL rules and procedures, as he remarked on the replays.\n\n\"Harry does a really good job,\" Smith said in commentary for Channel Nine.\n\n\"When you break it down, he's running to the wrong side of Nathan Cleary because [Cleary is] right-footed. So he does a really good job there.\"\n\nTo make matters worse, Cleary had two more field goals charged down — one by Grant — before the Storm hooker and captain pulled off the ultimate dummy-half sneak in golden point to win a classic NRL clash.\n\nLast year the NRL announced rules to outlaw teams placing \"blockers\" in front of kickers to impede players pressuring field goal attempts.\n\nPanthers coach Ivan Cleary diplomatically said \"Harry's too smart at both ends\" when asked about it in the post-match press conference, before imploring his son to \"tell the truth\" when the same question was directed at the skipper.\n\n\"If you're defending and you play for the obstruction, they don't want that in the game. For some reason it's different for a field goal,\" Nathan said.\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\n\"I thought the blocking rule was brought in so people wouldn't stand next to the play-the-ball – Moses wasn't in that position.\n\n\"I don't believe everyone can get behind me on that field goal, and then essentially Harry played for it because he knew he was going to get the penalty.\n\n\"I don't think Moses moved at all, either. So, yeah, it was pretty frustrating.\"\n\nCleary also argued Leota was in position to take a run, although his claim that the Panthers would pass to a prop at first receiver for a hit-up on the last tackle with three minutes on the clock was about as believable as Grant's acting performance in the collision.\n\nMelbourne's captain admitted there was some \"inconsistency or confusion around it\", adding if the NRL wants to come out and change things this week then he is OK with that, but said he was simply playing to the rules.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Even the Penrith boys were aware of it in the game and when it happened,\" Grant said.\n\n\"Even the players on the field knew they weren't allowed to be in that position, they were saying 'get out of the road'.\n\n\"We all know the circumstances at that time of the game, everyone trains and understands you're not allowed to be in that position.\n\n\"It's a hard one, for sure, but that's just what's been policed throughout the season.\"\n\nGrant said \"hats off to the officials\" for making the tough call in the biggest moment of the game.\n\nThe rules, announced in early 2024, were reiterated throughout last season.\n\n\"If you don't want to take the risk of having a field goal disallowed, don't put these players in this position. You're inviting the referee to take action,\" NRL head of football elite competitions Graham Annesley said.\n\n\"Why do they need to be there? They're clearly not receiving the ball, they know who the ball is going to so why put them there? You open the risk of the goal not being awarded.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/wildlife-blog-15-august-2025/105651126",
        "title": "Live: Time to count down to the most underrated animal",
        "publish_date": "Fri, 15 Aug 2025 00:59:56 +0000",
        "category": "sports",
        "authors": [
            "Daniela Pizzirani",
            "Jacinta Bowler"
        ],
        "text": "It's National Science Week, and we've asked you all to weigh in on Australia's most underrated animal.\n\nAfter 15 days of voting, we've narrowed down the top 10 Australian animals you may never have heard of.\n\nCould it be the great desert skink? The short-finned eel? Or the gorgeous palm cockatoo?\n\nJoin us as we count down to the ultimate underdog.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/sinner-hardcourt-winning-streak-25-matches-ahead-of-us-open/105657560",
        "title": "Sinner takes hardcourt winning streak to 25 matches ahead of US Open",
        "publish_date": "Fri, 15 Aug 2025 00:48:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Defending champion Jannik Sinner has swept past Felix Auger-Aliassime 6-0, 6-2 to reach the Cincinnati Open semifinals, with the world number one extending his hardcourt winning streak to 25 matches.\n\nSinner delivered a dominant performance, capitalising on his opponent's 29 unforced errors to claim his first win in three meetings against the Canadian in just 71 minutes.\n\n\"Today I felt great on court. I think you saw that but every day is going to be different,\" Sinner said.\n\n\"Tomorrow is a day off, which is good for me. We will try and put some reps in, and then see what I can do in the semis.\"\n\nThe Italian became only the fifth man this century to record 25 consecutive victories on the surface alongside Roger Federer, Novak Djokovic, Rafael Nadal and Andy Murray.\n\nThe last time Sinner lost a match on hardcourt was back in October 2024, when he was beaten by Carlos Alcaraz in the China Open final in Beijing, losing 6-7(8/6), 6-4, 7-6(7/3).\n\nHe will face either Danish seventh seed Holger Rune or French qualifier Terence Atmane.\n\nIn the women's draw, second seed Coco Gauff secured her place in the quarterfinals with a 6-2, 6-4 win over Italy's Lucia Bronzetti.\n\n\"For the most part I played aggressive. Maybe got a bit passive in some of those games. But it's tough. The balls are super light and they fly,\" Gauff said.\n\n\"She wasn't giving me much pace. I was trying to play with control but also aggressive. I think I did well. I missed a couple balls. But I learned from it and was able to close it out.\"\n\nThe two-time Grand Slam champion will next face another Italian, seventh seed Jasmine Paolini, who swept past Barbora Krejčíková 6-1, 6-2 in a rematch of the 2024 Wimbledon final.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-08-15/ekka-cattle-stoush-prompts-calls-for-change/105654950",
        "title": "Controversy over Ekka cattle competition prompts call for change",
        "publish_date": "Thu, 14 Aug 2025 23:57:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "A stoush over cattle competitions at the Ekka has led to calls for change on the council that organises the event.\n\nDisappointed producers say the changes, which see many cattle events completed before the gates open to the general public, have taken the heart out of Queensland's Royal Show.\n\nAs some exhibitors question if they will return, others are calling for long-serving Royal National Agricultural and Industrial Association of Queensland (RNA) councillors to make way for new blood.\n\nBut the RNA said beef events were open to the public, and a record number of exhibitors reflected their relevance.\n\nCattle conundrum\n\nRiverina stud breeder Rob Sinnamon has been exhibiting at the Ekka for more than 50 years, this year winning Reserve Champion Santa Gertrudis Cow.\n\nRob Sinnamon has showed at the Ekka since 1973. (ABC Rural: Kim Honan)\n\nHe is also a life member of the RNA, but this year he questioned the relevance of Queensland's largest agricultural show on social media.\n\n\"It's becoming more and more challenging to justify the cost and expense of showing at Brisbane Royal,\" he said.\n\n\" For us, it's over $20,000 expense now annually to show there, and we've lost that rural component. \"\n\nIn April, the RNA announced there would be no prime beef competition in 2025, ahead of its move to Dalby next year.\n\nUnlike stud cattle which are bought by graziers to breed from, prime cattle are bought by meatworks and feedlots for beef production.\n\nBeef cattle competitions, like this one in 1925, date back to the first Ekka when there were just three breeds of beef cattle. (ABC News: Frederick William Thiel, State Library of Queensland)\n\nMr Sinnamon said connecting with the supply chain was an important benefit of exhibiting.\n\n\"Those commercial cattlemen would all come to the show to see their cattle judged and benchmark their performance,\" he said.\n\n\"The local agent would say, 'Let's have a look at the stud judging, you need to buy some bulls this year'.\n\n\"That was the key reason why seed stock producers such as myself would show in Brisbane.\"\n\nPrior to the COVID-19 pandemic, the Ekka ran for 10 days from Friday to Sunday, with school and led steer competitions starting the Monday before.\n\nProducers say they want the public to be able to watch all cattle competitions at the Ekka. (Supplied: Ekka)\n\nAfter being cancelled in 2020 and again in 2021 just days before gates were to open, when the event returned it was shortened to nine days, opening on the Saturday.\n\n\"Our beef week has always run the week before the show, so the cattle move in a week earlier ... stud beef cattle judging always happens at the end of that week,\" RNA chief executive Brendan Christou said.\n\n\"When we used to run from a Thursday, we'd be open half a day, we wouldn't do a night show and then we'd run to a Saturday — those two days of stud beef were full in show.\"\n\nMr Christou said the decision to condense the format was made in consultation with producers for safety reasons.\n\nBrendan Christou says a restricted number of patrons can attend cattle events before the Ekka opens. (ABC News: Alice Pavlovic)\n\n\"If you ask the exhibitors, half of them will say we don't care about the public — we prefer to do it when the public aren't there, so we can just do our thing,\" he said.\n\nHe said there was restricted access available to about 1,000 members of the public on the Friday before Ekka opened.\n\nPublic perception\n\nCattle producer Bryce Camm knows what it takes to put on a major beef event, having served as the chairman of Beef Australia from 2018 to 2024.\n\nBryce Camm stepped down as Beef Australia chairman in 2024. (Supplied: Beef Australia)\n\nHe said not having general public access to the entire cattle competition was a missed opportunity.\n\n\"Promoting agriculture is a core focus of why the Ekka exists,\" he said.\n\n\" To simply not be open when the largest agricultural sector, the beef industry in Queensland, is being promoted doesn't make a lot of sense to me. \"\n\nMr Camm urged long-serving RNA councillors to consider moving on to allow fresh faces to join the committee.\n\n\"I say that with the utmost respect ... a lot of good people that have served around that table and many still do,\" he said.\n\n\"I was involved in the Future Directions Committee of the Ekka 20 years ago, and sadly, some of those people that were on the council 20 odd years ago remain there today.\n\n\" I would ask them to question the value and impact that they're still having. \"\n\nMr Camm said the event was critical to connect the broader community to agriculture, a sentiment echoed by Shane McCarthy, the general president of peak farm lobby AgForce.\n\nShane McCarthy says producers will stop supporting Ekka if it becomes irrelevant. (triple j hack: Angel Parsons)\n\n\"That they're [cattle] not there when it's open to the public is not ideal,\" Mr McCarthy said.\n\n\"We need to sell our story to the general public, and that's one way we do it.\n\n\"They get to see the animals, they get to see the judge and they get to see all that, how it's all done.\"\n\nRNA beef committee chair Gary Noller said almost 1,400 head of cattle were judged this year, with increases in the stud, led steer and paddock to palate competitions.\n\n\"Not only does [Ekka] bring people together from the bush to the suburbs, it educates metropolitan audiences on the vital role agriculture plays in their everyday lives,\" he said.\n\n\"The record numbers in our beef competitions reflect the success and relevance of our competitions.\"\n\nCattle producers say Ekka should be about more than just the rides. (ABC News)\n\nBut Mr McCarthy said that did not guarantee the industry would be there next year.\n\n\"You might get record numbers, but if they're not happy that year, you won't get it in the follow-up years,\" he said.\n\n\"The agricultural shows are not just for the rides, we need the animals there.\n\n\"We need to show the agricultural side to the urban public, so they get an understanding of what quality we've got.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/stranded-nullarbor-driver-ignored-by-passing-cars-for-two-days/105652234",
        "title": "Stranded Nullarbor driver watches cars pass him by for two days",
        "publish_date": "Thu, 14 Aug 2025 23:44:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you decide to embark on driving Australia's longest stretch of straight road, you have to be prepared for anything.\n\nWhen Caleb Humphries's car broke down on the Nullarbor Plain, he spent two days watching cars drive past him, hoping someone would stop. They did not.\n\nCaleb Humphries became stranded on Eyre Highway on July 30. (Supplied)\n\nThe 23-year-old was stranded about 30 kilometres from the nearest roadhouse and tried everything to get his car up and running.\n\n\"I had every other part I could possibly have for my car, except for the two parts that broke,\" he said.\n\n\"At that time, I tried to make a dodgy fix myself, but nothing worked, and it wasn't until then that I realised nothing was working.\"\n\nChevy Hawkins was able to put Mr Humphries in contact with friends to order replacement car parts. (Supplied)\n\nEach time a car passed him on the Eyre Highway, he would get out of his car to alert the driver that he needed help.\n\n\"But no one stopped,\" he said.\n\nHe said about 40 drivers ignored him.\n\n\"I was starting to get hungry on the second day. I had no more food because all my food went bad.\"\n\nTrucker to the rescue\n\nTruck driver Chevy Hawkins was on his way home after helping to deliver hay to drought-stricken South Australia when his mum contacted him to say a man was stuck on Eyre Highway near Madura.\n\n\"Probably 32 kilometres on the west side of Madura, there was a Nissan Patrol on the side of the road,\" he said.\n\nCaleb Humphries' car broke down when a tension pulley melted during his drive. (Supplied)\n\n\"I pulled up, went and saw young Caleb [in his car] and woke him up, and started talking to him.\n\n\" You're a wanted man, mate. \"\n\nMr Hawkins was able to use his Starlink internet to get Mr Humphries in contact with friends in Margaret River.\n\n\"I stayed with him for, it'd be good 45 minutes to an hour, just so he could get in touch with people,\" he said.\n\n\"He organised some parts from Kalgoorlie that got sent out to him, and he got back on the road.\"\n\nThe Nullarbor Plain stretches across 1,200 kilometres of road between Western Australia and South Australia. (ABC Esperance: Robert Koenigluck)\n\nMr Hawkins said he was disappointed Mr Humphries had to wait so long for help.\n\n\"It's honestly shameful of the people who went past and didn't stop,\" he said.\n\n\"If you don't feel safe, you don't have to get out of the car to ask if they're OK. You can still sit in your car and check they're OK.\"\n\n'Faith restored'\n\nWhen Sarah Howell heard her son's friend, Mr Humphries, was in trouble she knew she had to help.\n\n\"I just knew if it was my son out there, I would hope that somebody would step up,\" she said.\n\nBut, as a Margaret River local, Ms Howell said she had to get creative with finding help from more than 1,200 kilometres away.\n\n\"I just thought, well, you know, the only place I can start is in my local community,\" she said.\n\nMs Howell made a post asking for help in a Margaret River community group on Facebook, which quickly made its way into trucking and caravanning groups across the south of the state.\n\nFrom there, she was able to coordinate communication with Mr Humphries and get replacement parts out to him.\n\n\"It really was a massive logistical effort between a gentleman in Albany, a gentleman in Kalgoorlie, and another woman in Margaret River,\" she said.\n\nMs Howell said the generosity of strangers was vital in getting Mr Humphries to his final destination in the south-west of WA.\n\nMr Humphries arrived in the South West on August 1 and has since fixed his car. (Supplied)\n\n\"People absolutely restored my faith in humanity. I was just so, so grateful,\" she said.\n\nMr Humphries arrived safely in the South West on August 1.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/david-stratton-death-film-critic-cinema-memories-lesson/105657418",
        "title": "David Stratton reminds us not to wait to share the magic of cinema",
        "publish_date": "Thu, 14 Aug 2025 23:29:58 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "I sent my email to David Stratton 10 days ago. I was starting to wonder why I had not received a reply.\n\nI sent my note because I was finally making the plan: the plan that David and I had spoken about for years but had never managed to achieve.\n\nI can't remember when David first suggested that I come for a weekend at his and his wife Susie's house in the Blue Mountains, and we would watch all the films of the great 1920s and '30s German émigré filmmaker, Ernst Lubitsch — the director of films like The Shop Around the Corner, To Be or Not to Be and The Merry Widow, and the creator of the famed, sophisticated sense of humour and wit that became known as \"The Lubitsch Touch\".\n\nLoading...\n\nA weekend of cinema\n\nI don't know how David and I shared that we each revered this man's films. We were not close friends; we were not even good friends. I had interviewed David from time to time and over many years had run into him at film events and always enjoyed his company.\n\nBut somehow, we had each revealed our private adoration of this clever filmmaker and had discovered the immediate ease that comes from a shared cinematic language — a shibboleth understandable only to us in the form of the name of a German director whose wit and style built the bridge between the old cinema of Europe and the post-war Hollywood auteurs who entranced us both.\n\nDavid Stratton's iconic reviews, from favourites to 'scathing' critiques Photo shows man with white hair and beard sitting alone in a theatre with red chairs For a film critic juggernaut like David Stratton, movies were not just his career — it was at his very core.\n\nWhenever we met, he would remind me: \"Now don't forget about our Lubitsch weekend. You must come soon.\" It was a wonderful idea — I would bring some good food and wine, we would start with Lubitsch's silent films, move through his elegant conquering of 1930s Hollywood and, I quietly plotted, we would finish with a couple of movies by his protege and heir, the incomparable Billy Wilder.\n\nHe was unwell when he generously gave of his time and allowed me to interview him about the singular Australian filmmaker Warwick Thornton, for my series Creative Types. His high regard for Thornton's lean, powerful filmmaking help make him globally revered and awarded.\n\nAs we wrapped our chat, he said again, \"Now, we still have to arrange our Lubitsch weekend.\"\n\nI promised I would. I so very much wanted to.\n\nI sent my email on August 4, naming the month we could finally watch the films. I heard no reply. On Thursday I heard the news of David's death.\n\nLoading...\n\nA true public intellectual\n\nI rang the celebrated filmmaker George Miller, another alumnus of Creative Types, to share the sad news together. George told me of his own regret. He visited David three months ago, just as he came home from surgery. David was sharp and on his feet, and he suggested to George that he come back soon, and David would select three films that he thought George should watch. George promised that he would.\n\n\"I would love to know what three films he picked,\" George told me.\n\nHe would probably dislike the term, but David Stratton was a true public intellectual. He unapologetically spoke up to his audience. Film is, by definition, a popular art, and to be successful must remain so: a film projected to a crowded theatre is its own reward. David's mission was to ensure that as many people as possible heard of that director, sat in that theatre, noted that cinematographer, heard that soundtrack and was transported and maybe even changed by the experience, as he was.\n\nHe was an educator at home and revered throughout the world of cinema as someone who was immune to fashion but excited by the innovation of creativity. He had the catalogued knowledge and the temperament to contextually weigh art against its intent rather than the mood of the day. He knew more than enough about the vagaries of the box office and celebrity to pay them no attention.\n\nDavid Stratton knew more than enough about the vagaries of the box office and celebrity to pay them no attention.\n\nA true creature of the cinema\n\n\"He was a true creature of the cinema,\" George said. \"I would see him at Cannes and other festivals, and he would spend every day watching film after film after film. The cinema was his natural habitat … all that time in the dark.\"\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nI have spent countless hours of my life very happily in that dark, and the regret I have about never spending that time with a film sage as wise and generous as David is keen and sharp. And I want to remember it.\n\nI write this to remember David and his incomparable contribution to Australian and world cinema, but also to implore myself and anyone else reading this: don't wait. If there is a conversation to be had, a moment to be shared, a film to be watched with someone you admire and respect, do it now. Don't wait.\n\nThere are very few experiences as strong, very friendships that are forged as powerfully as those that are made in the cinema, in the dark.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/legal-practice-board-of-wa-faces-parliamentary-inquiry/105656316",
        "title": "Tables turned on WA's legal watchdog as it faces inquiry",
        "publish_date": "Thu, 14 Aug 2025 23:18:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "The tables will be turned on WA's legal watchdog as it faces a parliamentary inquiry into longstanding concerns about its operations.\n\nThe Legal Practice Board of WA (LPBWA) is the independent regulator for the state's legal profession, deciding who is admitted to practice law, issuing annual practising certificates and resolving complaints about lawyers' conduct.\n\nBut the LPBWA itself has been the subject of complaints for years, according to the profession's peak body.\n\nThe LPBWA is the independent regulator for the state's legal profession. (ABC News: Ashleigh Davis)\n\n\"Concerns about the board's governance and processes have been building for some time,\" Law Society CEO Kate Wellington told the ABC.\n\n\"We appreciate the nature of the board's regulatory role. The board's purpose is public protection.\n\n\"The legal profession, too, serves a public purpose and it is important that its ability to fulfil that purpose is not hindered by barriers to effective practice.\"\n\nDo you know more about this story? Contact Keane Bourke.\n\nLate last month, the Law Society said it presented a report to the board \"based on feedback shared with us in a profession-wide survey, which pointed to delays, service challenges and problematic regulatory processes\".\n\nSurvey prompts surprise\n\nThe chair of state parliament's Public Administration Committee, which will probe the LPBWA, said the survey contributed to the committee's decision to open its inquiry.\n\n\"People were talking about the timeliness of responses, the manner of interactions, a lot of technical issues around applications,\" Labor MP Kate Doust said.\n\nKate Doust says the survey indicated \"a fairly high rate of dissatisfaction\" with the LPBWA's engagement. (ABC News: Hugh Sando)\n\n\"It's quite a detailed list.\n\n\"We were quite surprised at the nature of the responses in the survey and certainly the number of responses to the survey.\"\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nMs Doust said given the role the Legal Practice Board played in WA's legal system, the committee felt it necessary to investigate those complaints.\n\n\"You want to make sure that people have got appropriate access and timely responses to the matters they have to deal with, their engagement with the board,\" she said.\n\n\"There just seemed to be a fairly high rate of dissatisfaction with their engagement.\"\n\nTargets not met\n\nThe board's annual report for 2023-24 showed it failed to meet many of its time-based key performance indicators — for example, while it aimed to resolve 80 per cent of \"consumer matters\" within 90 days, it did so in just 42 per cent of cases.\n\nIt also aimed to resolve 80 per cent of the \"highest complexity significant investigations\" within a year, but only met that timeframe 40 per cent of the time.\n\nThe only time-based targets that were on track related to internal reviews of decisions.\n\nWA's legal profession should not be hindered by \"barriers to effective practice\", the Law Society says. (ABC News: Cason Ho)\n\nThe committee is now calling for submissions to inform its wide-ranging investigation into \"the operation and effectiveness\" of the board.\n\n\"This inquiry will give those impacted an opportunity to voice their concerns without fear,\" Ms Wellington said.\n\nIn a statement, the board's executive director welcomed the opportunity to engage with the committee.\n\n\"The board recognises that concerns have been raised in relation to communication, timeliness of regulatory processes and the handling of complaints and disciplinary matters,\" she said.\n\n\"These are matters we take seriously.\n\n\"Over the past 12 months the board has commenced a number of internal reforms aimed at improving service delivery, streamlining regulatory approvals and enhancing stakeholder engagement.\n\n\"The board remains committed to maintaining the trust of the public, the legal profession and government.\"\n\nIn May the LPBWA was hacked, resulting in \"limited corporate correspondence\" being taken, which it said included \"minimal contact information\" and \"bank account details for the board and a very small number of third parties who have been directly notified\".\n\nIt forced the organisation to take some of its systems offline and process lawyers' practising certificates manually.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/root-eyeing-end-to-ashes-century-win-drought-in-australia/105657102",
        "title": "'I couldn't be more ready': Root eyeing end to Ashes century, win drought in Australia",
        "publish_date": "Thu, 14 Aug 2025 22:33:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "England batter Joe Root said his experience of 158 Tests makes him better equipped than ever to end a victory drought in Australia, as he ramps up preparations for the upcoming Ashes series.\n\nFormer England skipper Root, who moved to second on the all-time Test run-scorer charts during the team's five-match series against India, which was drawn 2-2 earlier this month, has accumulated 13,543 runs in Tests, trailing only India great Sachin Tendulkar (15,921).\n\nDespite his prolific record, the 34-year-old Root has yet to win a Test or score a Test century in Australia, where he averages 35.68 from 27 innings with nine half-centuries.\n\nEngland's Joe Root Top Test scores in Australia 89 - The Gabba, 2021\n\n87 - Adelaide Oval, 2013\n\n83 - SCG, 2018\n\n67 - Adelaide Oval, 2018\n\n62 - Adelaide Oval, 2021 Source: Cricinfo\n\n\"Having played in Australia a couple of times before, now going with 150-odd Test caps under my belt, I feel I couldn't be more ready for it,\" Root told British media on Thursday.\n\n\"The thing that stands out for me is I probably wanted it (a century) way too much the last couple of times. It took me away from what was important.\"\n\nAustralia won both the 2017-18 series and the following home series in 2021-22 4-0 before drawing 2-2 in England in 2023 to retain the urn.\n\nEngland last triumphed in Australia in 2010-11, which is also the last time the tourists won a Test Down Under.\n\n'A moment in history': Ponting pays tribute to Root as records tumble Photo shows Joe Root, in England white cricket gear, raises his bat and helmet in the air. England's Joe Root overtakes Ricky Ponting as the second-greatest scorer in Test cricket history.\n\n\"There were a lot of distractions,\" Root said of the last two Ashes series in Australia.\n\n\"I was captain, COVID (in 2021-22), there was the (Ben) Stokes incident the time before that (when Stokes was ruled out of the 2017-18 tour after an incident at a Bristol nightclub), the Jonny (Bairstow) headbutt incident as well.\n\n\"This time, I want to just go and enjoy the tour for what it is. It is a beautiful country, it is a great place to go and play cricket. I know if I put my best performances in then everything else will look after itself.\"\n\nThis year's Ashes begins in Perth on November 21 before a day-night match in Brisbane, the third Test in Adelaide, and the traditional Melbourne and Sydney Tests in December and January.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/la-olympics-to-allow-sponsor-names-on-stadiums/105657164",
        "title": "LA Olympics organisers reveal they will break long-standing sponsor rule",
        "publish_date": "Thu, 14 Aug 2025 22:13:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Organisers of the Los Angeles Olympics will sell naming rights for a handful of its venues in deals expected to bring multiple millions of dollars to the 2028 Games, while breaking down the International Olympic Committee's (IOC) long-sacrosanct policy of keeping brand names off its arenas and stadiums.\n\nThe organising committee announced the landmark deal on Thursday, local time, saying contracts were already in place with two of its founding partners — Honda, which already has naming rights for the arena in Anaheim that will host volleyball, and Comcast, which will have its name on the temporary venue hosting squash.\n\nLA28 chair and CEO Casey Wasserman said revenue from the deals goes above what is in LA's current $6.9 billion budget.\n\nHe portrayed the deal as the sort of paradigm-shifting arrangement that Los Angeles needs more than other host cities because, as is typical for American-hosted Olympics, the core cost of these games aren't backed by government funding.\n\nCasey Wasserman speaks alongside Donald Trump earlier this month. (Getty Images: Win McNamee)\n\n\"We're a private enterprise responsible for delivering these Games,\" Wasserman said.\n\n\"It's my job to push. That doesn't mean we're going to win every time we push, but it's our job to always push because our context is pretty unique.\"\n\nWasserman said he also spent time explaining to IOC members how arena and stadium names are part of the lexicon in American sports.\n\n\"People know 'Crypto' as 'Crypto,' they don't know it as 'the gymnastics arena downtown,'\" Wasserman said of the home of the Lakers, Crypto.com Arena, which will host gymnastics and boxing in 2028.\n\nRights for up to 19 temporary venues in LA could be available.\n\nThe IOC's biggest sponsors — called TOP sponsors — will have first chance to get in on the deals.\n\nWasserman said no venues will be renamed — so, for instance, if organisers don't reach a deal with SoFi (opening and closing ceremonies, swimming) or Intuit (basketball), no other sponsor can put its name on the arena.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNot included in this new arrangement are the LA Coliseum, Rose Bowl and Dodger Stadium, some of the most iconic venues in a city that hosted the Olympics in 1932 and 1984. Organisers said IOC rules that forbid advertising on the field of play will still apply.\n\nThe deal adds to a growing list of accommodations pushed through for Los Angeles, which is once again poised to reshape the Olympic brand, much the way it did in 1984.\n\nIn 2017, the city was bidding for the 2024 Olympics against Paris, but agreed to instead host the 2028 Games. It was part of a then-unheard-of bid process that rescued the IOC from the reality that cities were becoming reluctant to absorb the cost and effort to bid for and host the Summer Games.\n\nOlympic watchers viewed the return of softball and baseball for 2028, along with the introduction of flag football (with help from the NFL), as changes that maybe only Los Angeles could have pulled off.\n\nLA will also make a major scheduling change for the Olympics, moving track and field to the opening week of the Games and swimming to the end.\n\nWasserman said the organising committee's position as a private entity plays a major role in its relationship with the IOC.\n\n\"We spend the time, we do the work, we make the argument, and we don't settle for a 'no,' because we don't have that luxury,\" he said.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/federal-politics-live-aug-15/105655412",
        "title": "Live: 30 childcare centres hit with compliance notices under new powers",
        "publish_date": "Thu, 14 Aug 2025 22:05:04 +0000",
        "category": "finance",
        "authors": [
            "Sean Tarek Goodwin",
            "Joshua Boscaini",
            "Stephanie Borys",
            "Elise Scott"
        ],
        "text": "Shadow Attorney-General Julian Leeser says taking a year to implement the first reforms to working with children checks \"doesn't pass the pub test\".\n\nAttorney-General Michelle Rowland told ABC Radio National Breakfast this morning that it could take 12 months to implement the \"banned in one, banned in all\" reforms to working with children checks.\n\nIn a statement, Leeser says Australian parents need assurances now that their children will be safe going to childcare.\n\nHe says it has been a national issue since June.\n\n\"For months now, Michelle Rowland and Jason Clare have been saying that this is urgent,\" Leeser says. \"To find out today that mums and dads might need to wait for a whole year before we even start fixing this problem is a slap in the face.\"\n\nShadow Education Minister Jonno Duniam says the community expects governments on all levels to act quicker.\n\n\"12 months is far too long. We need a resolution faster so that parents can regain confidence when they put their children in care,\" Duniam says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/act-why-fewer-enrolments-will-cost-these-canberra-schools/105654684",
        "title": "Canberra school dismayed after $50 million expansion walked back",
        "publish_date": "Thu, 14 Aug 2025 21:59:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "A school community has voiced dismay after the ACT government walked back its pre-election promise to deliver a $50 million school expansion.\n\nThe government told Majura Primary School in Canberra's inner north it would instead get a $20 million modernisation project owing to fewer projected enrolments.\n\nThere are now questions being raised over how the government determines the likely demand on a school.\n\nMajura Primary P&C convener Rachael Brown said the government had initially told the school, which has about 670 primary students, it would grow to about 1,000.\n\nThat number was then \"drastically\" revised down to about 700.\n\nMajura Primary School P&C convener Rachael Brown says ACT government enrolment projections lack transparency. (Supplied: Rachael Brown)\n\n\"When we asked questions about the modelling, we weren't able to get any details,\" Dr Brown said.\n\n\"We're very frustrated.\"\n\nShe said the children complained they had nowhere to play and the school felt overcrowded.\n\n\"Earlier this year, our kindergarten children had to have their health checks in our preschool's office because there's no spare room at our school,\" Dr Brown said.\n\n\"Multiple classrooms were above the safe standard for heating and cooling in summer.\n\nEducation Minister Yvette Berry said the enrolment projection for Majura Primary School had been based on COVID-era calculations. (ABC News: Louise Maher)\n\n\"And some of those students, including my own child, ended up doing their school work in the principal's office because there was nowhere else for them to do their work.\n\n\"None of the classes are above the student-to-teacher ratio but the actual space in the room is significantly less than [the ACT Education Directorate's] own standards are for a new school.\n\n\"It's just completely unacceptable.\"\n\n'Informed guess work': minister\n\nMs Berry says work is being done to consult with Majura Primary School on their modernisation project. (ABC News: Matt Roberts)\n\nEducation Minister Yvette Berry said the school's expansion plans were based on pre-COVID projections that suggested a boom in enrolments.\n\nIn making \"informed guess work\", she said the government used demographers, immigration figures and Australian Bureau of Statistics birthing data, as well as other sources.\n\n\" So, pulling all of those together, it tells us a story about what's happened in the past, and then based on these figures, what might happen in the future. \"\n\nShe said enrolment projections were revised down before the last election.\n\nDespite that, the government promised the $50 million expansion for Majura Primary School in its re-election campaign.\n\nShe said the directorate and Infrastructure Canberra were consulting with the school about what their modernisation project might look like.\n\nAnd while demand in the priority enrolment areas of some schools is projected to drop, that's not the case across the board.\n\nMs Berry said Shirley Smith High School in East Gungahlin was expected to see growth.\n\nWhat about promises to other schools?\n\nThe minister says the government is investing $30 million into heating and cooling upgrades for ACT schools. (ABC News: Adam Shirley)\n\nThe $30 million reduction in promised funding for Majura Primary raised concerns among other school communities expecting investments.\n\nMs Berry has sought to allay those fears, reiterating a previous promise to \"upgrade and modernise\" Lyneham High School's hall.\n\nShe also said Charnwood Dunlop School would still get a new playground.\n\n\"I have absolutely committed to that. It wasn't in this budget but that doesn't mean it won't be delivered within this term of government,\" Ms Berry said.\n\n\"I understand people thinking that things will all happen in the [first year's budget] but that's not possible.\"\n\nShe said her pre-election promise to invest $150 million in projects across government schools would happen, including $30 million for heating and cooling upgrades.\n\nIndependent MLA Thomas Emerson, whose electorate includes Majura Primary School, said he had written to Ms Berry seeking more information about how enrolment projections come about.\n\nIndependent MLA Thomas Emerson has expressed concern about the state of public schools in Canberra. (ABC News: Callum Flinn)\n\nHe said he wondered whether there was less demand on public schools because people were seeing more value in Canberra's independent institutions.\n\n\"I'm a bit concerned that we've not seen sufficient investment in school infrastructure in a timely way and that might be contributing to reduced enrolment numbers,\" Mr Emerson said.\n\n\"I've spoken with parents who have children at Majura Primary and other schools … who are really conflicted.\n\n\"They really believe in public education, but they have the means to make a different choice and they don't know what to do.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/asx-markets-business-live-news-aug15-2025/105657124",
        "title": "Live: ASX rises as Baby Bunting soars 26pc",
        "publish_date": "Thu, 14 Aug 2025 21:40:24 +0000",
        "category": "finance",
        "authors": [
            "Samuel Yang",
            "Stephanie Chalmers",
            "Business Correspondent David Taylor",
            "Nassim Khadem",
            "Rhiana Whitson"
        ],
        "text": "Wall Street's main indexes were mixed on Thursday, with S & P 500 edging up to a closing high, while the Dow Jones and Nasdaq were flat, after a hotter-than-expected producer prices report dampened expectations of potential interest rate cuts.\n\nA Labor Department report showed producer prices increased the most in three years in July due to a surge in the costs of goods and services, suggesting a broad pickup in inflation was imminent.\n\nTraders trimmed their Fed rate-cut expectations for the rest of the year to about 56.7 basis points, according to data compiled by LSEG, compared with around 63 bps before the report.\n\nBut they are still fully pricing in a quarter-percentage-point cut in September.\n\n\"The implication is that the Fed is going to offer a 25-(basis point) cut in September. But it will be a hawkish cut. It's way too early still for the Fed to wish to guide the market towards an extended easing cycle,\" said Thierry Wizman, global FX and rates strategist at Macquarie Group. \"The next important thing will be the Expenditures Price Index later this month. If there are signals that there's inflation broadly in services, the market will take that adversely.\"\n\nA separate report on Thursday showed the number of Americans filing new applications for jobless benefits fell last week.\n\nOn Thursday, seven of the 11 S & P 500 sectors declined.\n\nRecent data reflecting labor market weakness and a moderate rise in consumer prices had strengthened expectations that the central bank will potentially lower interest rates next month.\n\nHowever, Thursday's report fanned concerns that US tariffs on imports could start to impact prices in the coming months and dampen a rally in US stocks that had helped the benchmark S & P 500 and tech-heavy Nasdaq log record highs over the past two sessions.\n\n\"US stocks are pricey,\" said Sam Stovall, chief investment strategist at CFRA Research.\n\nThe S & P 500 index is trading at a price-to-earnings ratio of 23 based on forward estimates, or a near-40% premium to its 20-year average, he said.\n\nThe hotter-than-expected PPI report now has investors pulling petals from a daisy, saying \"They (the Fed) will cut rates, they won’t cut rates,\" he added.\n\nSt. Louis Fed President Alberto Musalem, a voting member on the Federal Open Market Committee this year, said a half-point rate cut at the Fed's September meeting is not warranted, a day after Treasury Secretary Scott Bessent said it was possible.\n\nReporting by Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/can-jim-chalmers-reap-a-healthy-crop/105639376",
        "title": "Can Jim Chalmers reap a healthy crop with the help of his big worm farm?",
        "publish_date": "Thu, 14 Aug 2025 21:34:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "One observer describes next week's economic roundtable this way: \"Chalmers has opened a can of worms — and everybody has got a worm.\"\n\nEven those close to the roundtable are feeling overwhelmed by the extent of the worm farm. There are many hundreds of submissions, five Productivity Commission reports, Treasury background papers, and stakeholders in the media spruiking their opinions ahead of the event.\n\nBusiness, unions and the welfare sector have largely settled into their predictable wish lists.\n\nABC Politics in your inbox Photo shows Brett Worthington looks at the camera wearing a blue blazer and glasses Sign up to the ABC Politics newsletter with Brett Worthington\n\nIn areas such as the housing crisis, it's actually not difficult to say what should be done — you hardly need this meeting to tell you. It just seems near impossible to get the relevant players (whether they be states, local councils, the construction industry) to do it, or be able to do it.\n\nOn issues of deregulation generally, when it comes to specifics, a lot is contested. As the ACTU's Sally McManus, who'll be at the roundtable, says, \"one person's regulations are another person's rights\".\n\nAs much as Treasurer Jim Chalmers might like to project the sunny side of Australia's situation, independent economist Chris Richardson (who will be at the summit's day three tax session) puts it more bluntly.\n\n\"We have a problem: the average Australian saw their living standards rise by just 1.5% over the past decade,\" he posted on X.\n\n\"That's embarrassingly shy of the 22% lift in living standards enjoyed across the rich world as a whole, and way below what Australians achieved in times past.\n\n\"You'd have hoped that both sides would have talked about tackling that challenge at the last election, but they didn't.\"\n\nRichardson is hoping the roundtable can achieve \"enough consensus to change some things\", which the government can use as a springboard. But he's worried the meeting could underperform, given its \"lead-up hasn't seen much consensus\",\n\nEconomist Richard Holden from UNSW says to be successful, the roundtable needs to get \"broad agreement on some version of the 'Abundance agenda' [a reference to a currently fashionable book focusing on loosening regulatory blocks] — especially as it applies to housing.\n\n\"In addition, to be successful would require that big issues like federation and tax reform are referred to Treasury for serious consideration and to present the government with options by year's end.\"\n\nThere are two approaches for a government that wants to promote economic reform.\n\nIt can, as then-treasurer Paul Keating did at the 1985 tax summit, put up a model and see how much it can make fly.\n\nOr it can, as Chalmers is doing, ask a wide range of participants for their ideas, and then decide how much of what emerges to pursue — in terms of what has wide support and what fits the government's agenda.\n\nThe closer we get to the meeting, the harder it becomes to anticipate its likely import (or lack of). Signposts are there, but they could be false signals, or ignored later.\n\nDespite all the talk about tax, the government — specifically the prime minister — has flagged it doesn't have the stomach for radical reform. Certainly not this term.\n\nAnthony Albanese said last week, \"The only tax policy that we're implementing is the one that we took to the election.\"\n\nThis doesn't rule out new initiatives this term — the phrasing is carefully in the present tense — but from what we know of the PM's approach they would likely be limited rather than sweeping.\n\nIndependent economist Saul Eslake said that a few weeks ago, he was optimistic the summit would give Chalmers the licence to spend some of the vast political capital the election yielded.\n\nLoading\n\n\"But the prime minister has made it clear he is not getting that licence. The government is not prepared to venture much beyond its limited mandate from the election.\n\n\"The best that can be hoped for is a willingness to have an adult conversation with the electorate between now and the next election with a view to seeking a bold mandate in 2028,\" Eslake says.\n\nPredictably, the roundtable is putting the spotlight on the Albanese-Chalmers relationship. This can be summed up in a couple of ways. The PM is more cautious when it comes to economic reform, the treasurer is more ambitious. In political terms, it's that \"old bull, young bull\" syndrome.\n\nThe different styles are clear. The \"old bull\" is blunt, sounding a touch impatient, for example, when he's asked about tax. The \"young bull\" is publicly deferential to his leader.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nOne of the most potentially significant discussions at the roundtable will be around AI. Unlike many well-worn issues, this is a relatively new, and quickly changing, area of policy debate. There are varying views within government about whether firm or light guardrails are needed and whether they should be in a separate new act or just via changes to existing laws.\n\nChalmers is in favour of light-touch regulation. The unions are not on the same page as Chalmers's regulatory preference, and they want a say for workers.\n\nThe unions were the winners from the 2022 jobs and skills summit — the government delivered to them in spades at the meeting, and later. It's not clear they are in as strong a position this time. Their big claim for the roundtable — a four-day working week — has already been dismissed by the government. The ACTU doesn't seem much fussed by the rejection — it is on a long march on that one.\n\nRegardless of the diversity of views among those rubbing shoulders in the cabinet room next week, one man will stand out as something of an oddity. Ted O'Brien, shadow treasurer, invited as a participant, will be as much an observer.\n\nO'Brien might say he wants to be constructive, but his role means he will want to be critical. But he has to tread carefully. Others in the room, and outside observers, will be making judgements about him. For O'Brien, the gathering should be a networking opportunity more than an occasion for performative display.\n\nMichelle Grattan is a professorial fellow at the University of Canberra and chief political correspondent at The Conversation, where this article first appeared.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-15/parliamentary-inquiry-wa-planning-laws/105654166",
        "title": "'We're not all NIMBY councils': Shires want answers from planning inquiry",
        "publish_date": "Thu, 14 Aug 2025 21:31:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A newly established parliamentary inquiry will scrutinise a controversial West Australian planning pathway used by developers vying to build multi-million-dollar projects.\n\nBacked by the Legislative Council on Tuesday, the inquiry will focus on WA's significant development pathway, which allows developers of major projects to sidestep local council approval.\n\nOpposition and crossbench MPs backed the committee over the Cook government's objections.\n\nPlanning Minister John Carey accused the opposition and crossbench of being \"anti-development\", saying the system had allowed for the approval of $5 billion worth of projects.\n\nWA councils outraged over new planning laws Photo shows An aerial photo of Perth including the Narrows Bridge taken from a plane WA's local government authority hits back at a major new property development policy that slashes councils' say over the look of the state's suburbs and towns.\n\n\"They're proposing reforms that will put a critical handbrake on the Western Australian economy,\" he told parliament on Thursday.\n\nFirst introduced as a stimulus measure during the COVID-19 pandemic, the significant development pathway was last year enshrined as a permanent feature of the planning system.\n\nThe State Development Assessment Panel, now called the Significant Development Assessment Panel (SDAU), is considering controversial plans for luxury resorts at Gnarabup and Smiths Beach in WA's South West.\n\nThe inquiry will also put a spotlight on the Cook government's plans for a street motorsport circuit in Perth's Burswood Park.\n\nThe proposed $217 million development at Burswood Park will also be scrutinised. (Supplied: WA Labor)\n\nCommittee to hold government 'accountable'\n\nThe inquiry's select committee will be chaired by Liberal MLC Neil Thomson and composed of Liberal, Labor and crossbench MPs.\n\nOpposition Legislative Council leader Nick Goiran said it would be a fair way to look at WA's planning system.\n\n\"It can look into any of these land transactions [and] planning decisions … they have the opportunity to call witnesses in, to summon them, to subpoena documents,\" he said.\n\n\"A select committee of parliament doesn't have the power to stop any of these things, but they do have the power to call them in and hold them accountable.\"\n\nWA Liberal MP Neil Thomson will chair the committee. (ABC News: Keane Bourke)\n\nTwo weeks ago, Mr Carey told a Sydney Institute forum the planning reforms had been designed to tackle \"NIMBYism\" — or \"not in my backyard\" attitudes.\n\n\"I do want to address NIMBYism, or as I call them, the BANANA people: build absolutely nothing anywhere near anything,\" he said in the address.\n\nJohn Carey talked up the \"balanced\" planning process in a speech to the Sydney Institute. (Supplied: The Syndey Institute/Youtube)\n\n\" It is because of the nay-sayers, our government has been bold, resolute and clear in the need to reform our planning system. \"\n\nHe spoke of the \"balanced\" planning decisions by the SDAU, which is made up of three planning professionals and two council members.\n\nThe developer behind a tourism plan near Smiths Beach is using the significant development pathway. (ABC South West: Anthony Pancia)\n\nSpotlight on coastal hotels\n\nDeveloper Saracen Properties opted to submit its plans for a $138 million luxury resort at Gnarabup through the significant development pathway.\n\nThe Shire of Augusta-Margaret River opposes the multi-million-dollar resort, 280 kilometres south of Perth, but will not be the final decision maker.\n\nShire President Julia Jean-Rice welcomed the inquiry.\n\nShe said she was concerned the Cook government was \"slowly but surely\" removing the powers of local government.\n\nA hotel overlooking Gnarabup, opposed by the local council, is being considered. (ABC South West: Jacqueline Lynch)\n\n\"We are not all NIMBY councils,\" Ms Jean-Rice said\n\n\"We're the closest to the people, and quite often we feel the impacts of whatever is happening in the community; we're the people on the ground.\n\n\" We are really feeling a lack of ability to influence development and general planning processes within our council. \"\n\nJulia Jean-Rice says she is concerned about the dwindling powers of local governments. (Supplied: Augusta-Margaret River Shire)\n\nFurther up the coast at Yallingup, a group of residents has been fighting for a tourism village near Smiths Beach to be scaled back.\n\nSave Smiths Beach Action Group spokesperson David Mitchell said he hoped the inquiry would uncover answers for locals.\n\n\"There's a lot of concerns that the SDAU process has really just created a vehicle for the developers to bypass proper assessment and transparency,\" he said\n\nDavid Mitchell says he hopes the inquiry highlights the controversial tourism development in Yallingup. (ABC South West WA: Pip Waller)\n\n\"We hope that our project is used as a test case because this impacts all coastal areas around the state, not just Smiths Beach.\"\n\nThe inquiry will have a year to hand down its findings.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/it-wasn-t-going-to-work-with-ned-graham-wright-opens-up-on-carlton-the-voss-call-silvagni-and-leaving-the-pies-20250813-p5mmqh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It wasn’t going to work with Ned’: Graham Wright opens up on Carlton, the Voss call, Silvagni, and leaving the Pies",
        "publish_date": "Fri, 15 Aug 2025 12:08:31 +1000",
        "category": "finance",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Leaving the Pies and friction with Craig Kelly Wright left Collingwood twice. The first time the Magpies didn’t let him. That was at the end of 2023, shortly after winning the flag. Wright quit saying he needed a break and a European trip. President Jeff Browne and his board rejected the resignation and floated a possible succession plan with Craig Kelly, who had returned to the club as CEO early in the premiership year. Wright was kept on as a consultant but barely used. Craig Kelly and Graham Wright are 1990 Collingwood premiership teammates. Credit: Artwork: Stephen Kiprillis. Photos: Penny Stepens, AAP He and Kelly spoke during the 2024 season and discussed how things would look when he returned, but tension between them grew. There was no one incident to prompt a falling out, but by the time Wright was due to return from Europe, relations had soured between the 1990 premiership teammates, who were always different personalities.\n\n“I thought I would go back, but it became clear that that wasn’t going to be tenable or workable. It just wasn’t going to work with ‘Ned’. “You’re setting yourself up and everyone else up to fail when it is like that. The biggest part for me was that it wasn’t going to work for the other people there if you’ve got your head of footy, or whatever role they were going to construct for me, not seeing eye to eye with the CEO. How’s that going to work?” “I thought I would go back, but it became clear that that wasn’t going to be tenable or workable. It just wasn’t going to work with ‘Ned’.” Graham Wright The pair has been cordial since. Others looked on expectantly when Wright and Kelly crossed paths at the CEOs’ meeting earlier this year. They shook hands and were civil. They are not friends, but there is no grudge. Behind the decision to back Voss\n\nAt Carlton, Wright ended up spending much the year almost running a football review after performances spiralled. “My background is footy, so being invited in or being available to footy, whether it be risk management, recruiting through to footy and coaching I just said how can I help? Are you happy for me to sit in on things and give my opinion or thoughts on things? I never went into anything without asking first. And don’t get me wrong, the doors were open. “I thought they do things pretty well. They do things differently to Collingwood, but Collingwood did things differently to Hawthorn [where Wright previously worked].” The biggest question was Voss. While he was contracted for 2026, his future was uncertain. This is Carlton after all, the revolving door of coaches never slows for long. Wright and the board had this unhappy history of sacking coaches in mind when they weighed up Voss’ future, but it did not directly impact the decision to keep him. “You’ve got to treat it on its merits, if Vossy is not the right person, well, then what do we do? We’ve got to make a decision. So I didn’t look at it as though ‘this is what Carlton has always done, so I can’t do it. I can’t make that recommendation to the board’. It had to be okay.\n\n“Having said that I think we might be 28-9 now [losses and wins in past 37 games] and I think we might have been 18-8 and Vossy and I had an honest conversation, which is, we haven’t been good enough, what are we gonna do about it? Then it’s more, OK I need to have some conversations with people at the club and players and coaches and staff and see where we go, and then ongoing conversations with him about what he’s thinking.” Will Hinkley join the Blues? Once Voss was confirmed for 2026 the thinking shifted. You could not have the season Carlton has had and make no changes. Lloyd, the football manager for seven seasons and three coaches, leaves the club next week, a liked and respected character but with new leadership wanted. The coaching team will change. Some assistants are under contract and will remain; others without contracts have been told they can’t be offered new deals yet but that doesn’t mean they won’t be. They are free to look around. “I think Vossy has to decide how he wants to structure up,” Wright said.\n\n“Do we bring in a coaching director or with the soft cap change around senior assistants what does he [Voss] think that looks like? What does he see for [senior assistant] Ash Hansen? So there’s all those conversations that he needs to have post-season. The Blues will speak to Ken Hinkley about a senior role. Credit: Getty Images “You look at things around the way we play and how we’re structuring up in games, and key statistics around and all of those things in making the coaching decision, rather than putting a finger in the air and saying this is what I think. “There was shared responsibility, in my view, of players taking accountability, the leaders taking some responsibility and obviously, there’s some feedback for Vossy in that around how or why he goes about things. Our list management, recruiting has been okay, but it could be better, our development, all of those sorts of things go into it, and it’s not one thing. It’s not pointing the finger at any one person.” It’s highly likely the club will speak to Voss’s former mentor at Port Adelaide, Ken Hinkley, about a coaching director or similar role. But theirs will not be the only approach to Hinkley who will coach his last game for the Power next Friday night, nor will Hinkley be the only person they speak to as there is an appetite to build support for Voss.\n\nThe game style and the players The eternal chicken and egg conundrum for clubs in Carlton’s situation is who carries most blame. Is it the coaching or the players? Is it list management? Is development the issue? Are the players not fit enough? Is it the psych, the dietician, the hairdresser or the tattooist? Carlton reached the 2023 preliminary final and last year’s finals on the back of big-bodied, hungry midfielders. The Blues were- and are - a contested ball, clearance team with good key forwards and one of the best key defenders in Jacob Weitering. Around them are role players. But footy has evolved, and trended towards leg speed and repeat, end-to-end running. Carlton could still win the ball but once it got on the outside, they couldn’t keep up. Sam Walsh’s absence hurt, while Adam Saad looked his age. Not having Smith, for whom they had plunged in the draft for this very reason, was also a blow. “The key statistic over the last 10 years is that contested ball and clearance and all those things are still important, but we were number 18 for kicking efficiency,” Wright said.\n\n“Well, what are we doing about that? Who’s responsible for that? Our inside 50 conversion rate is now 17th in the competition. Who’s responsible for that? Why is that? So a lot of the key statistics that make the last lot of premiership teams good we are pretty good at, but then there are things that we’re very average at, or worse than average at. So we need to improve in all those areas.” The future of De Koning and Silvagni Carlton are almost resigned to losing Tom De Koning. As De Koning is a restricted free agent the Blues get the chance to see St Kilda’s offer even if it’s only for curiosity value as they have little chance of matching the terms which they suspect have - or will - creep out to $1.8 million a year for seven years with an eighth year of at least another $1 million. ”To be very clear, we want to keep Tom first and foremost,” Wright said. “But if he were to go I think you’d have to bring in someone to support. You always need another one. We’ve got young Hudson O’Keeffe, who’s probably more forward-ruck than ruck-forward. He’s a little bit undersized to play ruck. So we need someone else who could come in and play genuine ruck, who that is the guys are working through that now, if TDK goes.”\n\nNed Moyle at Gold Coast is contracted but struggling for opportunities behind Jarrod Witts. Ditto Ned Reeves - who was taken as an SSP rookie when Wright was at Hawthorn - who is also contracted but behind Lloyd Meek who leapfrogged Reeves in the pecking order when the ruck rules changed. Third-generation Blue Jack Silvagni is attracting interest as a free agent. Credit: AFL Photos “There’s a few guys around and a few who are contracted but want opportunity. Reeves is one in that boat.” Carlton’s other free agent, Jack Silvagni, is unrestricted so the Blues don’t get to peek at other offers for him. Collingwood’s early pursuit prompted some in the industry to wonder if there was a personal element to the Pies’ attempts to poach him from Wright’s new club.\n\n“I’d find that hard to believe because you’re trying to do the right thing by the football club not get one over on someone. I can see why Collingwood would be interested in a player like Jack for their list needs,” Wright said. The Bulldogs have since met with Silvagni, who is now weighing the relative premiership windows of all three clubs - Carlton, Collingwood and the Dogs - given the financial offers are fairly similar. The players on Carlton’s trade and draft radar The Blues need more run in midfield but also more depth in small forwards who can scunge a goal and apply pressure. Mal Rosas at Gold Coast is out of contract and played 49 games so he fits the role, availability and age profile, and the Blues are interested. “Like a number of clubs we’ve expressed an interest. I’m not sure where that one sits,” Wright said.\n\nLiam Ryan out of West Coast? “He’s contracted. I think he’s got a year ago That … complicates it a whole lot more.” Liam Ryan flies for West Coast. Credit: Getty Images Jamie Elliot at Collingwood still unsigned and a free agent. “I presume he stays at Collingwood. I wouldn’t think he’s leaving, that’s my view, but I’d certainly be open-minded if Jamie is a free agent and wanted to move. But I haven’t heard that he’s moving.”\n\nThe Blues are almost resigned to losing Tom De Koning. Credit: Getty Images The Blues could lose Silvagni but will add at least one father-son this year and next in Peter Dean’s son Harry (a likely top 10 pick this year) and Andrew Walker’s talented son Cody next year. The compensation question Carlton stands to lose TDK on the biggest contract a player has ever signed, and will receive only a first round compensation pick tied to their first selection. Currently, that would be pick six, but will doubtless be pushed back with bidding on academy players. Under the current system if Carlton were to bring in a free agent (depending on the quality of the free agent) they would potentially dilute even that modest compensation.\n\nWest Coast is in the same boat. If they lose their captain Oscar Allen as a free agent they can’t risk diluting his compensation by potentially bringing in Lions free agent Brandon Starcevich. Wright believes the system should change. “Whether it is the clubs outside the eight that can bring in a free agent without it hurting compo, or just the bottom six or eight, there shouldn’t be a disincentive to securing mature talent for clubs trying to rebuild,” he said. The deal with McKay and Curnow Wright says Curnow has had a difficult year because of interrupted pre-season.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/banking-and-finance/how-bank-branches-can-avoid-the-fate-of-video-stores-20250812-p5mme5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How bank branches can avoid the fate of video stores",
        "publish_date": "Fri, 15 Aug 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Bank branches will not disappear from shopping strips entirely in the way that video stores have, even as more customers ditch cash for digital banking, outgoing chief executive of the Australian Banking Association Anna Bligh says.\n\nThe number of bank branches around the country has tumbled by more than 40 per cent between 2017 and 2024, latest official figures show, and the trend has sparked intense scrutiny of the major banks’ physical footprint.\n\nAnna Bligh, chief executive of the Australian Banking Association, is retiring from the peak body. Credit: Oscar Colman\n\nBligh, a former Queensland premier, is retiring from the ABA after eight years in the role, to be replaced by former Liberal MP Simon Birmingham. In an interview, Bligh said one key challenge for Birmingham would be changes caused by the “new world” of digital banking as many customers embrace digital channels and payments.\n\nCash has been in long-term decline, and Bligh said the Reserve Bank estimated only 4 per cent of transactions would be in cash by 2030, which she said was “getting pretty close to zero”. Cheques are also being phased out by 2030. Even so, Bligh said branches would not “disappear overnight” because they were still commercially valuable for many banks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/beaches-metro-negative-gearing-crackdown-the-surprising-policies-backed-by-nsw-young-libs-20250815-p5mn6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beaches metro, negative gearing crackdown: The surprising policies backed by NSW Young Libs",
        "publish_date": "Fri, 15 Aug 2025 11:58:33 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison"
        ],
        "text": "NSW Young Liberals will propose limiting negative gearing to a single investment property to discourage speculation in housing and boost supply, as part of their annual general meeting over the weekend.\n\nThe gathering will consider 13 disparate policy motions, as far ranging as the “proposed elimination of central banking” and the ability for the Reserve Bank to set interest rates, to constructing a 17-kilometre northern beaches metro link from Chatswood through Frenchs Forest to Brookvale.\n\nThe Young Liberals will consider some fresh ideas as the party is at a crossroads at both state and federal levels. Credit: Getty Images\n\nThe two-day AGM comes as the party is at a crossroads at both state and federal levels. Federal leader Sussan Ley has been tasked with rebuilding the party after May’s election hammering, while internal squabbling has erupted among NSW Liberals 18 months out from the 2027 poll.\n\nThe policy statement to be moved by James Ardouin, a Woollahra councillor and consultant with EY, is aimed at addressing stagnant housing supply. He argues an outsized investment of the nation’s wealth in residential property has sucked large amounts of capital away from industries that “create real economic value”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/movies/david-stratton-s-colourful-life-five-stars-for-a-revered-figure-in-australian-film-20250814-p5mn3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "David Stratton’s colourful life: five stars for a revered figure in Australian film",
        "publish_date": "Fri, 15 Aug 2025 11:58:22 +1000",
        "category": "entertainment",
        "authors": [
            "Garry Maddox"
        ],
        "text": "As an author, Stratton chronicled Australian film from its renaissance in the 1970s to 2020 in the books The Last New Wave, The Avocado Plantation and Australia at the Movies, wrote about his own colourful life in the memoir I Peed On Fellini and made cinematic recommendations in My Favourite Movies and 101 Marvellous Movies You Might Have Missed. Loading He programmed and presented films on SBS, lectured on film history for the University of Sydney’s continuing education program and hosted the documentary series David Stratton’s Stories Of Australian Cinema. An internationally respected critic with encyclopaedic knowledge of cinema, Stratton served on juries at leading international film festivals including Cannes, Venice and Berlin, won Australian film’s Longford and Chauvel awards, was named by France a Commander of the Order of Arts and Letters and was awarded honorary degrees by Sydney and Macquarie universities. He may have accidentally peed on Italian director Federico Fellini in a bathroom accident at the Venice Film Festival in 1966, earning the terse response “stronzo!” which he later wrote was well-deserved, but Stratton was warmly admired by Australia’s leading filmmakers.\n\nDavid Stratton with Russell Crowe in 2017. Credit: Mark Rogers Director George Miller says Stratton was not only critical to him making the first Mad Max – he programmed a short film at the 1971 festival that was picked up for cinema release – but “his engagement with world cinema allowed us all to see films we could see nowhere else”. Miller adds: “Even if he gave you a not-so-good review, you knew it was pretty accurate because he had such a love of cinema. It was so much in his blood. I remember meeting him at the Cannes Film Festival once and I was astonished and how many films he’d seen. He spent most of his time in the dark and he knew every frame of every film he ever saw.” David Stratton with filmmaker George Miller in the 2017 documentary in David Stratton: A Cinematic Life. For Peter Weir, the festival became a film school. While Stratton tactfully rejected his first short film by saying it was “not suitable”, the budding young director was encouraged by his enthusiasm to see the next one.\n\n“David brought back to Australia the very best in world cinema,” Weir says. “What a time it was! He put aspiring filmmakers in touch with what was happening in that great era of film.” Loading Gillian Armstrong describes Stratton “a cultural icon” whose encouragement of her as a young filmmaker, which included programming her early shorts, was “life-changing”. But he still reviewed her later films so honestly that she can remember the damning phrase he used about Starstruck. “He had great ethics about the films that he liked and didn’t like and I really respected that part of David,” Armstrong says. “He was someone who was so obsessed and positive about film and had incredible generosity towards helping young filmmakers but, at the same time, he would call a spade a spade.” Phillip Noyce says he owes the chance to make his first feature film to Stratton programming the short feature Backroads at the 1977 festival after it had been “trashed” by the short film competition judges.\n\n“To the first generation of the New Wave of Australian filmmakers back in the late ’60s through the ’70s, ‘80s and ’90s, David Stratton was both our mentor, our teacher and the champion of Australian cinema,” Noyce says. Loading “David introduced us to the extraordinary emerging Eastern European and Russian cinema, earning himself an ASIO file for his enthusiasm and fighting against the sometimes excessive federal and state censorship of that era.” Born in 1939, Stratton had a middle-class upbringing in a family with a grocery business in southern England. But his early love for films gave him a different career path. As a boy, he would cycle more than 20 kilometres to a cinema then handwrite and file notes about every film he watched. “My passion for the cinema had, in fact, become an obsession,” he wrote in I Peed On Fellini.\n\nIn 1963, Stratton emigrated to Australia as a so-called ten-pound Pom then, after a casual holiday job as an usher at Sydney Film Festival, was surprisingly “asked to basically run [it] in my mid-20s”. He programmed the kind of cinema that had never been seen in Sydney and, by sharing programs, Melbourne. This included provocative subtitled films made by visionary directors from Europe, including the Eastern Bloc, and Asia. He championed Australian films and argued against what he saw as the repressive censorship of foreign films in the ’60s and ’70s. David Stratton with Margaret Pomeranz in 1990. In the early days of The Movie Show – I wrote their film news segment for a time – I remember Stratton and Pomeranz had an easy chemistry on screen but the best TV was often when they disagreed. While the production values increased when they moved to the ABC, the spirited debates continued. “Five stars from me,” became a catchcry and a glowing review from “Margaret and David” guaranteed an audience for an arthouse film.\n\nEven after leaving TV in 2014 and winding back his print reviewing, Stratton remained a great enthusiast for films. He continued his habit of watching a new film every day – often from the estimated 20,000 DVDs in his home collection. He and Susie watched films featuring the likes of Sidney Poitier, Richard Widmark, Meryl Streep and Gregory Peck in the order in which they were made. Continuing another longtime habit, Stratton would write and file a page of notes about every new film, including the basic credits, run time and year of production. Asked his favourite Australian films of those watched to write his latest book, which covered just about every release from 1990 to 2020, Stratton listed no fewer than 58. Among them were such hits as Happy Feet, Mad Max: Fury Road, Lantana, Lion, The Babadook, Muriel’s Wedding, Two Hands and Samson & Delilah but also such little-seen gems as A Lion Returns, Blessed, The Jammed, Pawno and Slam. Stratton was never shy expressing his view about disappointing films, though. In 1992, he famously refused to give a rating for the Australian film Romper Stomper because he believed its portrayal of neo-Nazis was dangerous, which led to director Geoffrey Wright charging up to him at the Venice Film Festival yelling “stay away from my film, you f---er” and throwing a glass of wine over him.\n\nAt an In Conversation session with Jane Campion at Sydney Film Festival two years ago - after she requested he host the event – Stratton set her back by saying how much he disliked her series Top of the Lake. His most recent book on Australian cinema dismisses certain films – sometimes too harshly – as “a laughless lump”, “obnoxious” or “a chore”. But Stratton was also prepared to reappraise a film. In 1997, he slammed the much-loved Australian comedy The Castle for being unfunny and “patronising towards its characters” and gave it one and half stars. By last year it had become one of his 58 favourites and, in Australia At The Movies, he wrote that it had “stood the test of time” despite “the TV style direction and photography”. Stratton also stood the test of time. Sports teams often retire the jersey numbers of beloved players. The festival should reserve those two seats for as long as it runs. His family plans a private funeral, with details of a public memorial service to be announced.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/tips-and-advice/with-just-one-dish-on-the-menu-this-sydney-restaurant-is-a-cure-for-decision-fatigue-20250811-p5mlzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "With just one dish on the menu, this Sydney restaurant is a cure for decision fatigue",
        "publish_date": "Fri, 15 Aug 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [
            "Terry Durack"
        ],
        "text": "Dining out isn’t as easy as people think. First you have to decide where to go. Then you’ll be asked to choose between counter or table seating, inside or out, and what time you want to dine.\n\nDon’t think you can relax when you get there. Craft beer or Old Fashioned? Oysters or chicken-liver crostini? If oysters, which oysters and with which vinaigrettes? Already my poor, end-of-the-working-day mind is spinning and I haven’t even tackled whether to have the Black Opal wagyu MB7 rump cap or the Speckle Park 600g rib-eye.\n\nPhoto: Simon Letch\n\nOur old friend, late-stage capitalism, dictates that there be choice at every turn, which means countless tiny decisions must be made every minute of the day. At times, it’s overwhelming.\n\nSo to hear tell of a restaurant in Sydney that offers just a single main course is like an island in a choppy sea: a place of refuge. In true Henry Ford style, you can have any main course you like at 24 York, as long as it’s steak frites.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/what-the-rba-governor-s-struggle-to-get-a-room-to-focus-on-rates-says-about-the-economy-20250813-p5mmlc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What the RBA governor’s struggle to get a room to focus on rates says about the economy",
        "publish_date": "Fri, 15 Aug 2025 11:49:04 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Low inflation and official interest rates through the 2010s, then COVID, the post-pandemic inflation explosion, Russia’s invasion of Ukraine, and more recently the war in Gaza all diverted attention away from the productivity slowdown. But with inflation subsiding and Donald Trump upending the global trading order, most governments – including the freshly re-elected administration of Anthony Albanese – are revisiting ways to get their economies back to health. Treasurer Jim Chalmers, who will sit through all roundtable sessions, and whose department will be driving much of the analysis of the various proposals put up by participants, has cautioned that those looking for instant results on Thursday evening will be disappointed. “[The point of] this economic reform roundtable is not to make decisions, it’s to inform the government’s decisions,” Chalmers told ABC Radio National Breakfast on Wednesday. “And that’s the point that we have made all along.”\n\nThe roundtable has attracted almost 900 submissions, although some proposals appear dead on arrival. There seems little appetite, for instance, to support the ACTU’s ambit claim for a four-day working week without a cut in pay. Loading The Productivity Commission has, through five papers canvassing everything from tax to AI, made more than 40 separate recommendations of its own. The government has held a series of industry-specific roundtables in areas such as mining, agriculture and housing, where a host of ideas have surfaced. Chalmers sat down with business leaders and lobby groups ahead of the roundtable, as have other ministers. “I think it has been a very worthwhile thing that we are shaking the tree for ideas, and the prime minister and I are aligned in the way we go about that,” Chalmers told Ratio National.\n\nThe reason for so many ideas bubbling up is twofold. The first is that it has been a long, long time since a government has asked all and sundry to produce a shopping list of suggestions. The second is that there is no single bullet solution to a productivity problem that has afflicted every nation and almost every corner of the economy. In housing, for instance, the average time in Australia to complete a block of apartments has soared since 2008 from around 17 months to 28 months. Building a house has increased from seven months to 10. But in comparison to other countries, the Australian construction sector is almost a beacon of hope. The Productivity Commission found building productivity in Australia is outperforming the US, Britain and Sweden.\n\nExplaining its reason for lowering its productivity assumption, the Reserve Bank suggested a number of reasons. They include declining dynamism among businesses and across the labour market, slower rollout of technological breakthroughs, falling competition, regulatory red tape, a slowdown in the growth of skills among workers, and a drop in trade linkages across the world. Even measuring productivity can be difficult. Some pundits have blamed the increase in financial resources and people in the care sectors of the economy (aged care, childcare, health, disability) for the slowdown in productivity.\n\nMeasuring productivity in these sectors, where relatively low-paid people provide intense services to the frail, sick, old or young, is notoriously difficult. The Productivity Commission this week reported that by a traditional measure of productivity, it had grown at just 0.1 per cent a year across the nation’s hospitals between 2008-09 and 2018-19. By contrast, productivity across the entire economy grew by 0.7 per cent per annum. Health outcomes have sharply improved over the past 30 years, but this has not been captured in official measures of productivity. Yet that doesn’t consider the huge improvements in the quality of care or patient outcomes. Cancer treatments, the commission said, are far more effective today than they were a few years ago. When you account for quality, healthcare productivity grew at 3 per cent per year through much of the past decade, dwarfing the rest of the economy.\n\n“Simply put, Australians are getting better outcomes, but not necessarily more care services, per dollar spent,” the commission noted. Loading Another issue is that productivity in the mining sector – the nation’s most productive based on the value of its outputs – has fallen off a cliff over the past five years. It has tumbled by 20 per cent, largely because miners are now tapping lower-value deposits while facing a string of natural disasters that have flooded coal mines or shut down key production sites. No matter the varied causes, it’s clear the government and most participants want to target a productivity bugbear: red tape and bureaucracy. The battle to get bike helmets into the economy is a small-scale example.\n\nWhile the nation’s cyclists protect their heads with imported helmets, the safety standards governing the headwear differs. It costs importers about $14 million a year to comply with those different standards. Loading The Australian Competition and Consumer Commission started a process to align the European and American standards governing helmets sold domestically in 2016. It was only completed last year, but it has yet to be signed off by all states and territories. “The net result is that eight years after realising the value of harmonisation, most Australians are yet to see benefits,” the Productivity Commission reported earlier this month. Productivity is not just red tape or new machines or tax. The skills of the workforce are also a vital component.\n\nThe Smith Family says there are 3.3 million people living in poverty in Australia, including 761,000 children. Loading It’s pinning its hopes on the roundtable coming up with ways to lift school completion rates and overall education outcomes, given their strong connection to improved wages and incomes. “We know children and young people from disadvantaged backgrounds are more susceptible to falling behind in the classroom, disengaging with school, not finishing year 12 and not being able to fully participate in the workforce,” the charity’s chief executive officer, Doug Taylor, says. “To boost the pool of talent in the nation’s workforce, we must plug the holes to stop students experiencing disadvantage from falling through the cracks.”\n\nDespite the reticence of the government to deal with the multitude of issues with the nation’s tax system, many people believe the purpose of next week is to put tax reform squarely at the centre of Anthony Albanese’s second-term agenda. Independent MP Allegra Spender, who has a seat around at the roundtable, is looking for a shift to a dual income tax system. Investors would lose the ability to offset their taxable income through losses on their property holdings, with the revenue used to reduce personal income tax rates. Allegra Spender (right), Ken Henry and Grattan Institute head Aruna Sathanapally (left) will be at next week’s economic roundtable. Credit: Dominic Lorrimer “You should be rewarded for investing in yourself, not for expanding your property portfolio,” she said. Ben Phillips, from the ANU’s Centre for Social Policy Research, has proposed a major simplification of the entire system that includes axing the Medicare levy and the low-income tax offset, removing Family Tax Benefit B (while substantially lifting Family Tax Benefit A), and making changes to JobSeeker and the parenting payment.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/lisa-wilkinson-and-peter-fitzsimons-list-sydney-home-for-sale-for-23m-20250815-p5mn6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lisa Wilkinson and Peter FitzSimons list Sydney home for sale for $23m",
        "publish_date": "Fri, 15 Aug 2025 11:46:50 +1000",
        "category": "finance",
        "authors": [
            "Tawar Razaghi"
        ],
        "text": "Sydney media power couple Lisa Wilkinson and her husband Peter FitzSimons have listed their long-time family home in Cremorne with a $23 million price guide.\n\nThe pair has called the lower north shore residence home for almost 30 years after they purchased the landmark property in 1998 for $2.95 million.\n\nThe lower north shore home is for sale. Credit:\n\nBuilt circa 1903, Ingleneuk is on the market for only the third time in its 122-year history.\n\nSet on 3214 square metres, the Federation-architecture home has panoramic views of the harbour and city skyline.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nathan-cleary-has-the-first-whinge-of-his-career-it-s-part-of-a-grand-plan-20250815-p5mn6c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nathan Cleary has the first whinge of his career. It’s part of a grand plan",
        "publish_date": "Fri, 15 Aug 2025 11:41:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "More publicly, the searing spotlight on trainer Corey Bocking’s ill-fated run in front of Jayden Campbell’s conversion shot raised hackles out west. Ivan Cleary noted the NRL’s five-match ban for Bocking and the club’s $50,000 fine was longer than any suspension stemming from an on-field incident this year. “Ostracised” was how he described Bocking’s fate. Back-rower Luke Garner pointed to “tall poppy syndrome” at play in the saga, an element which has no doubt played a part in previous distaste with Penrith’s winning ways. Cleary’s call for a rule change when asked about rugby league’s latest 24-hour outrage - attacking players being tackled in the air - left Craig Bellamy unimpressed during the week.\n\nThat to and fro was all about Xavier Coates’ dominance in the air. Penrith wants it shut down, and Melbourne needs to keep it. As Grant defended his milking of the game-changing penalty by running into Moses Leota, he suggested Penrith might want to look at their previous field goal set-ups and the presence of illegal blockers in front of Cleary. Master of motivation: Panthers coach Ivan Cleary. Credit: Getty Images An ‘us against them’ undercurrent serves especially well in the combative, collision-based world of rugby league, and the Panthers have worked it as well as any throughout their dynasty. Potshots at their perceived arrogance have been worn as a badge by players in previous years, and returned in the best way possible - by being too damn good.\n\nThis year’s run up the premiership mountain is new territory, but their 2021 title bore on and off-field hallmarks to this season as well. Trainer Pete Green was banned during the finals for stopping play at a critical point against Parramatta to attend to an injured Mitch Kenny. That, and four other incidents involving trainers in the past five years, contributed significantly to Bocking’s punishment. When will Isaah Yeo return from injury? Penrith aren’t telling. Credit: Getty Images Penrith were a walking wounded bunch that year, and famously kept broken feet and digits, ruptured tendons and torn muscles all in-house - only revealing after their grand final win that Dylan Edwards, James Fisher-Harris, Moses Leota and Brian To’o had no right to be playing, let alone winning a title. As the most important forward in the game in terms of his team’s attacking blueprint, skipper Isaah Yeo’s return from a shoulder injury holds the key to Penrith’s premiership tilt.\n\nFormer players who have had their shoulders shoved the wrong way wince and tell you Yeo’s awkward fall against the Titans could be worse than the Panthers are letting on. Little is being given away by the premiers on their talismanic lock, though To’o told reporters this week that the thought of Yeo being in pain was making him emotional, so please stop asking. Against a Storm side without Jahrome Hughes, Ryan Papenhuyzen, and Nelson Asofa-Solomona, Penrith’s line speed was rapid throughout the first half and suffocated the NRL’s most dangerous attacking side. To think both sides went 13 minutes without a stoppage after halftime is unheard of in the modern game - a four or five-minute stretch is enough to gas most teams. To think Melbourne prevailed in that exchange, courtesy of a pass Blaize Talagi shouldn’t have thrown for Xavier Coates’ intercept, was a significant fillip for the southern side.\n\nAlmost 12 months ago to the day, Melbourne came away from Penrith with a critical late-season win where Cleary was injured and To’o was successfully targeted under the high ball. By grand final day, the Panthers had recalibrated, worked out how to protect To’o against the high-flying Coates and outlasted their way to yet another title. Loading As Roy Masters noted in a lengthy profile of Ivan Cleary earlier this year, young Storm players were shocked at the sprays they copped from Sunia Turuva and Liam Martin, among others, after each try Penrith scored that night. Cleary made no apologies for the sledging, telling Masters that “we learnt a lot from the 2020 grand final (against Melbourne), including a lot of stuff that happened off the ball.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/i-don-t-want-to-be-remembered-pep-guardiola-on-man-city-his-legacy-and-ange-20250813-p5mmlf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I don’t want to be remembered’: Pep Guardiola on Man City, his legacy and Ange",
        "publish_date": "Fri, 15 Aug 2025 11:39:50 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "There’s no reason why they shouldn’t be up there in the title race, snapping back into contention like a rubber band. Though it will be different without the great Kevin De Bruyne, they have retooled on the transfer market, splashing out more than $320 million on the likes of French international Rayan Cherki and Dutch midfielder Tijjani Reijnders. But their rivals have spent big, too, as Guardiola gleefully (and slightly combatively) points out. “Finally, it’s not [only] Man City spending money, right?” he says. “It’s good. It’s normal. That is what’s allowed.” This is the beginning of the end for Guardiola, at least at this club. He signed a new two-year contract in November, which keeps him tied to City through to the 2026-27 season, and says it will be his last one with them. It wouldn’t be surprising, should they win the title this season, if he walks off into the sunset a year early. There were times last season when the pressures of top-level management had him in a permanent state of what kids these days call ‘headloss’. As the defeats piled up, so too did genuine concern for Guardiola’s mental well-being. After blowing a 3-0 lead over Feyenoord in the UEFA Champions League, he presented to his post-match interviews with scratches on his face, some of which had drawn blood, and joked that it was self-harm. He struggled to sleep or digest food properly, and spoke about his struggles with stress, anxiety and loneliness – a timely reminder that beneath the brilliance, he’s still just another human.\n\nPep Guardiola’s scratched face said it all last season. Credit: Twitter But Guardiola seems to have successfully recharged his batteries. His off-season break was short because of the FIFA Club World Cup, where City were knocked out in the round of 16 by Saudi club Al Hilal – although he believes the “foundation” for future success was laid at that tournament. “After that, I went to Barcelona with my family,” he says. “And basically I eat, drink, and slept. That’s what I’ve done. And I came [back] with four or five kilos more. I try to make a diet, reduce my kilos. That is our plan.” In a long interview with GQ earlier this month, timed to promote a clinic he has opened with a therapist in Barcelona that specialises in “longevity and personalised medicine”, Guardiola confirmed his intention to take a break from football when he’s done with City, of anywhere between one to 15 years, to focus on himself for once.\n\nThe grind of modern-day coaching is proving relentless to the point where the big dogs risk total burnout unless they take a longer sabbatical at some point. Ange Postecoglou is living his best life in Greece, eating prime steak off the knives of TikTok celebrity chefs, making the most of his first substantial period of downtime in over a decade. An exhausted Jurgen Klopp acknowledged that he was “running out of energy” – so he stepped down as Liverpool boss last year and travelled the world on a cruise ship, washing up in Adelaide of all places. That’s something Guardiola would like to do, but he’s more of a Melbourne guy. “I’ve been in Melbourne years ago with my family for five days, six days. And I would love it,” he says. “Maybe Australian Open ... I would travel a lot, I’m pretty sure of that. And I would love to spend not just a few days, [but] a month. That’s what I mean I take care of myself. I would take care of my body, but my mind ... to travel to places I’ve not been. That is the way, right? Everyone in the sofa at home, watching Instagram – it doesn’t make you better.” Pep Guardiola and Ange Postecoglou share a joke. Credit: Getty Perhaps there’ll be time then, when he’s not working, for a quiet beer with Postecoglou, a sort of kindred spirit, someone Guardiola once described as a person who “makes football a better place” – high praise, from one of the highest imaginable sources.\n\nGuardiola is famously effusive in his compliments for rival managers, but he does not seem to be laying it on thick when it comes to the former Tottenham Hotspur coach, whose commitment to attacking football and deft handling of the media he admires greatly. He said the two of them had exchanged messages about catching up over dinner and a bottle of good red wine from Australia. “The way he plays, alongside the amount of titles he won ... always try to attack, always be positive,” he says. “When you find two teams that want to score goals and attack, it’s a beautiful game. I’m pretty sure that the new generation of managers, they are more courageous. Before, they said, ‘Oh, we’re going to play against [Sergio] Agüero, Man City. I’m going to defend, defend.’ Now, no, it doesn’t matter. ‘I don’t care. I go to try to win.’ And when this happens, football is nice. And I think always his teams have [had] that courage to do it.” Pep Guardiola was the mastermind of arguably the greatest team in football history at Barcelona. Credit: Getty Guardiola stopped short of weighing in on Spurs’ decision to sack Postecoglou, but suggested he wouldn’t be surprised if he ends up back in the Premier League with another club.\n\n“What happened in Spurs, the injuries they had and the situation, I don’t know, because I’ve not been there,” he says. “At the end, OK, it was not a good season, I would say. Right? But at the end, they won [their first] silverware for many, many, years. And maybe that helps to break that barrier that is not winning the title. Maybe it will help in the future for Spurs, mentally-wise, for everyone. I’m pretty sure he leaves something for the club, for the players, for the future ... a big legacy.” That word – legacy – comes up a lot when people talk about Guardiola. After more two decades of bending football to his will, his legacy will be the stuff of history books. So how does he feel about the way he has inspired a generation of coaches around the world, Postecoglou included, with the magical teams he has put together? Surprisingly blasé.\n\nHe says he doesn’t really care if people consider him a genius, or if cynics say that he’s mainly successful because of the money he’s been able to spend and the calibre of players at his disposal. He is “more than grateful” for what the game has allowed him to experience – and he still wants more, or else he wouldn’t be there – but he does not seem to think his work will live on in any meaningful way. “I don’t care. Don’t remember me,” Guardiola says. “Because when we die, when I am out of football, after one, two, three days, I will be forgotten. In our life, our familiars, [when] they pass away, we are so sad. [But after] one day, two days, three days, one week ... [we] have good memories, we smile, and we continue. We live. Football is the same. I’m here, I will remember that we managed Man City – but I leave, it’s over. It’s gone. Another [coach] is coming. And I’m over. Everyone is replaceable. Pep Guardiola with the 2023-24 Premier League trophy. Credit: Getty “So, the people saying, I want a [legacy] for the history: bullshit. I want to live my history. I want to be happy living. I don’t want to be remembered, in good and bad. So if people say nice things, it’s fine. People don’t say, it’s fine too.”\n\nGuardiola insists he is a “much, much better” manager today than he was in 2009, when he guided Barcelona to a then-unprecedented sextuple of trophies. He has collected more than 40 major titles throughout his career, but that is not how he defines himself or where he derives his happiness from. Accolades aren’t what make him feel special; the same ideas, work ethic and methods that delivered those successes were there last season, when nothing was won. Loading “My curriculum vitae is so good,” he says. “I was so happy doing that. But it [hasn’t] changed me. Still, I have fear to lose a game. I don’t pay my attention for the compliments ... there are many reasons, not just me. I’ve been at three huge clubs. Huge: Barcelona, Bayern Munich, Man City. Good resources in the academies and the money spending to buy incredible top players, incredible top facilities. I put [the credit for] that with everyone.” What matters to Guardiola is seeing his team improve - a training session that clicks, a tactical tweak that works, the gradual progress from one match to the next. The process of pursuing excellence together, and the memories made along the way.\n\n“That motivates me. That is my job. This is what I like,” he says. Loading “When I remember all the incredible players that we had for many, many years, always I remember their huge smile. The memories that belong to us, that we have with us, will stay forever. It has been so nice. Even the bad moments – the disappointments in the last minutes or the titles that we didn’t win for many reasons - always belong to us.” Trophies, he says, are fleeting, and their absence doesn’t diminish the work. “If we win, incredible. If we don’t, we try again. [If] the boss will say, ‘You don’t win? I sack you.’ OK, it’s fine. We’ll find another job, maybe. Or maybe not,” he says. “I want to live my life, and be satisfied as much as possible. And the rest, believe me, is not important.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/i-still-love-sex-menopause-desire-and-finding-fulfilment-in-midlife-20250709-p5mdql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I still love sex’: Menopause, desire and finding fulfilment in midlife",
        "publish_date": "Fri, 15 Aug 2025 11:33:47 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Loading However, Davis says the idea of changing testosterone levels during menopause, often attributed to changes in libido, is a “widespread misconception”. “Testosterone blood levels do not change at menopause, they change with age,” she says. “If there are changes in sexual function, they are either related to women feeling horrible because of all the symptoms, or because of the change in oestrogen and that having effects in the brain.” Does libido decrease with age?\n\nToday, more conversations around ageing, menopause and sex are being had, in part fuelled by popular and celebrity culture. Miranda July’s 2024 novel All Fours followed a perimenopausal woman who embarks on an extramarital affair. Gillian Anderson has opened up about a “whole new world of pleasure” after menopause, while earlier this month, 50-year-old Charlize Theron spoke about finding greater sexual freedom in her 40s and dating much younger men. From left: Writer Miranda July’s 2024 novel All Fours explored perimenopause and sex; Charlize Theron has spoken openly about dating in midlife, and Gillian Anderson says menopause has opened up a “whole new world of pleasure”. Credit: Getty Images; AP A landmark study from 2007 found that while sexual activity tends to decrease with age, libido does not. Clinical psychosexual therapist Jacqueline Hellyer believes the idea of sexual decline with age is a myth, and that it’s impossible to paint all humans with the same brush.\n\n“You can’t really say how it [menopause] is going to affect people. Like pregnancy, some women don’t have sex at all, and for others it’s the horniest time of their life. It’s really, really varied.” Hellyer thinks the reason some women may experience low libido during and after menopause has more to do with social rather than physiological conditions. “When you think about what women are experiencing in our culture once they’re getting into their late 40s and 50s, it’s normally a time of enormous pressure,” she says. “You’ve got teenagers, you’re peaking in your career, you still owe money on your mortgage. There can be an awful lot of stress there.” In her two decades of working with couples, Hellyer finds it’s often men, not women, who tend to lose interest in sex with age.\n\n‘When you think about what women are experiencing in our culture once they’re getting into their late 40s and 50s, it’s normally a time of enormous pressure.’ Clinical psychosexual therapist Jacqueline Hellyer Mok, who went through menopause at 42, is now in a happy relationship. The director of the Yeah the Girls 40 Plus community, she says sex has only got better with age. “I still love sex,” she says, attributing a healthy post-menopause sex life to the effort she and her partner put into their relationship. “A lot of women at our age, they’re just too tired, too frustrated, constantly asking for things that they don’t see returned, and they lose that fun in them. And that’s why it’s affecting their sex life and intimacy,” she says. “That is one of the biggest things in my current relationship. We constantly remind each other of the love we have and the fun we had when we met.”\n\nLoading Davis says that “sexual self-image is really important for women” and, for some, physical changes that come with menopause and ageing can be difficult. Trisha Avery, a business performance coach from Melbourne, went through clinical menopause in her 30s following a hysterectomy. While she says the procedure, a relatively rare one at the time, was traumatic, it did little to affect her libido. “I was young, and because my frame of reference wasn’t necessarily that I was needing to be sexually inactive or had lost my sensuality, it really didn’t matter at that time,” she says.\n\nNow in her 60s, Avery, who is single, continues to enjoy an active sex life. But she says her understanding of sexuality has evolved with age. “I would have talked about myself as sexual when I was younger. I never use that term any more. I like to talk about myself as a sensual being, as well as many other things,” she says. “Once past menopause, the sensuality of your body, of your ability to find ways of creating feelings of pleasure and having an orgasm, masturbating, being with somebody, is different.” For Avery, sensuality over sexuality can mean exploring different forms of intimacy. “You’re just not as athletic as you used to be. And also because of things like vaginal dryness and the differences in men in terms of their capacity to maintain erections and other things, it’s a slower build, if you like. There are more important things than penetrative sex,” she says.\n\nTrisha Avery underwent a radical hysterectomy in her 30s, triggering clinical menopause. Now in her 60s, she’s more comfortable in her body than ever before. Credit: Simon Schluter Fostering wellbeing A small but growing body of research is looking at the importance of sex not just for pleasure but wellbeing. Some studies suggest sex or masturbation can mitigate symptoms of menopause. The findings of a 2025 study of Japanese women, published in Menopause, revealed an association between regular sexual activity and a lower prevalence of genitourinary symptoms during menopause like vulvar pain, dryness and arousal.\n\nSimilarly, in a 2024 survey from The Kinsey Institute funded by sexual wellness company Lovehoney, 36.2 per cent of menopausal women reported experiencing improved symptoms through masturbation. But Davis warns such studies were not able to show a causative relationship, or the direction of the relationship. “You’d have to do a double-blind, randomised trial to prove this,” she says. Still, Davis says sexual dissatisfaction has been associated with lower wellbeing in women. For Mok, a fulfilling sex life and happy relationship has been key to alleviating many of the transition’s most uncomfortable symptoms.\n\n“Before I met Malcolm I had really bad mood swings and hot flushes … but after, these symptoms went away, because I’m happy. We have a really good relationship. We communicate, we support each other, and my symptoms really went down.” Mok thinks the dopamine release she gets from cuddling, kissing and sex play a role in this, too. Dr Suzanne Belton, a medical anthropologist at Flinders University with a research interest in sexual and reproductive health, points out the medical approach to menopause and sex tends to stop at making intimacy more comfortable. “This is basically the discourse I hear when I read the medical stuff, which is, ‘if we can make it less painful for you, maybe you’ll want to do it [have sex]’. That’s the bare minimum. Actually, what we would really like is to have orgasms at the same rate as blokes: sexual equality.” How to have better sex during and after menopause\n\nFor some people, medical treatments (such as hormone replacement therapies, including vaginal oestrogen) can help alleviate symptoms that affect sexual function, says Davis. But there is no one-size-fits-all approach. “If you’re getting hot flushes, no sleep and low mood and vaginal dryness, go and talk to a doctor and get your symptoms treated because if you’re feeling like rubbish you won’t feel like sex,” she says. Testosterone therapy can also be useful for those for whom oestrogen therapy is not effective, says Davis. Finally, Davis encourages having open conversations with your partner about the changes you’re experiencing. Loading\n\n“What can go wrong here is that the woman is feeling terrible, experiencing symptoms, and doesn’t explain that their withdrawal from sex is not related to their lack of affection for their partner … A lot of relationships fall apart because the partner feels rejected.” Hellyer recommends moving towards a “responsive type of arousal”, rather than waiting until the mood strikes, which she thinks happens less as we age Finding time to create intimacy, rather than focusing on the act of sex itself, can remove pressure from the situation. “We should be focusing on the conditions that couples need in order to feel that level of connection with each other,” she says. National Sexual Assault, Domestic Family Violence Counselling Service 1800RESPECT",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/epl-predictions-the-premier-league-is-back-you-pick-the-winners-20250813-p5mmml.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "EPL predictions: The Premier League is back – you pick the winners",
        "publish_date": "Fri, 15 Aug 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp",
            "Mark Stehle"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nAnother season, another field of unknown quantities. Not many would have predicted Liverpool as champions a year ago, nor that Manchester United and Tottenham would finish 15th and 17th. Now here we are again, with new variables thanks partly to a lot of transfer fun.\n\nThe curtain rises at Anfield, where Arne Slot’s Liverpool host Bournemouth in a bid to get their title defence off to a positive start. How quickly can the Reds’ influx of new arrivals gel, and were pre-season defensive vulnerabilities just a blip on the radar?\n\nSimilar questions follow Manchester City into their first fixture away to Wolves, after an underwhelming 2024-25 left Pep Guardiola’s four-time champions third and 13 points adrift from the top.\n\nMeanwhile, at Stamford Bridge, Club World Cup success has rebuilt ambitions for a stacked Chelsea just in time for a potential goal-fest with London neighbours Crystal Palace.\n\nBut the game of the round has to be United v Arsenal. The Red Devils are under pressure to remedy an embarrassing campaign, and have a shot at a fresh start under newish manager Ruben Amorim. Of course, the result at Old Trafford depends on whether his Arsenal counterpart Mikel Arteta has the right ingredients to return his runners-up to the glory days.\n\nMake your predictions below, and see how others are tipping, too.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/the-sad-beckhams-split-is-a-reminder-to-be-a-cheer-squad-not-a-jury-20250814-p5mmzu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sad Beckhams split is a reminder to be a cheer squad not a jury",
        "publish_date": "Fri, 15 Aug 2025 11:17:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "The first girlfriend to meet our family was like a 1980s Dolly cover girl, improbably chocolate box pretty, with a smile that stretched for days, mild anxiety and a habit of dropping used tissues.\n\nShe reminded me of girls I wasn’t friends with at school — jealousy of that eastern suburbs polish and “I am destined for a rich husband” vibe makes me judgey — but from the get-go I decided the way forward was to love everyone my kids did. I’d be a cheer squad, not a jury.\n\nBrooklyn Beckham and Nicola Peltz at the Burberry winter 2025 show at the Tate Britain. Credit: Dave Benett\n\nThat girlfriend came on holidays, to a family wedding, is with us forever in school formal photos. But not with us in actuality. She was a teenage dream who flamed out. I do still have her Country Road beach towel. I lied about it being lost on the Gold Coast trip because I liked that we could keep a tangible piece of her for summers and summers.\n\nSince then, other gorgeous people have been folded into our family via romance with my kids. It’s been easy to give open arms and heart. They’ve all brought something wonderful, from Steph’s morphing of farm girl practicality with urban interior design cool to the firecracker who ran laughing into winter seas, the smart cookie armed with dog toys and Sarah’s unnerving calm and fantastic salsa moves.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/raducanu-complains-about-crying-child-20250812-p5mmaq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Raducanu complains about crying child",
        "publish_date": "Fri, 15 Aug 2025 10:57:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Raducanu complains about crying child\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-uli-cartwright-wants-to-change-guardianship-gag-laws/103t7y1x8",
        "title": "For years, Uli could not legally share his experiences of being under state control. Now he can",
        "publish_date": "Thu, 14 Aug 2025 19:37:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Uli Cartwright set out to work on a documentary about his life, he didn't expect it would lead him to the steps of Victoria's parliament.\n\n\n\n\n\nCartwright lives with disability, and had spent time living under a state-governed administration order. He saw the documentary as a chance to share his broader life experience and \"peel back the stigmas\".\n\n\n\n\n\n\"I wanted to break stereotypes and forge my own path,\" he says.\n\n\n\n\n\n\"I accepted that if I can't do a nine-to-five job because my health won't let me, I may as well make my own job advocating and bringing awareness to disability, chronic illness and mental health.\"\n\n\n\n\n\nThe documentary, Life is a Battlefield, is available online. However, at one point, it was taken down over concerns it breached a confidentiality law affecting those involved in guardianship or administration proceedings in Victoria.\n\n\n\n\n\nThis week, Cartwright joined the Greens in seeking to change it .\n\n\n\nCartwright lives with several disabilities, and says he sees the world differently. Credit: Otis Filley \"I didn't know what the legacy, or the message, of my movie was going to be,\" he tells SBS News.\n\n\n\n\n\n\"But it turned out to be this law.\"\n\n\n\nUnder administration\n\nLiving with several disabilities, Cartwright, 30, says he sees the world differently.\n\n\n\n\n\n\"I think my experiences can be insightful, and also allow me to be more empathetic … but obviously, there's barriers to just existing because the world is very different for people with disability,\" he says.\n\n\n\n\n\nCartwright was born with multiple chronic health conditions, including a lung condition, and spent the first three years of his life in hospital. He also lives with mental health issues and ADHD.\n\n\n\n\n\nThis forced him to grow up quickly.\n\n\n\n\n\n\"[Having] a social life and friends were difficult,\" he says.\n\n\n\nWhile I didn't really have a childhood, I was forced into having to deal with life and navigate it at a young age.\n\nCartwright was in foster care until the age of 18 and later moved into a group home.\n\n\n\n\n\n\"I was a typical young person who didn't really want to be controlled or listen to anybody, and I didn't want to have responsibility. I was just exhausted from being an adult, really,\" he says.\n\n\n\n\n\n\"I don't think I had the right supports in place. So, people made assumptions of my capacity.\"\n\n\n\n\n\nWhile at the group home, a support worker applied to the Victorian Civil and Administrative Tribunal (VCAT) to put Cartwright on an administration order. This meant his finances were under the control of the State Trustees.\n\n\n\n\n\nCartwright understands this was due to \"inappropriate\" spending.\n\n\n\nREAD MORE Nicole was seeking justice. She says her disability was used to discredit her in court\n\nIn Australia, a person may be placed under guardianship or administration orders if they require help with decision-making.\n\n\n\n\n\nAs specified in an order, an appointed guardian has legal authority to make decisions or support decision-making for someone over personal and lifestyle matters, while an administrator is granted authority for financial and property matters.\n\n\n\n\n\nAdvocates have reported an increase in applications for guardianship and financial administration since the introduction of the National Disability Insurance Scheme, according to a recent report from the Disability Advocacy Network Australia.\n\n\n\n\n\nIn some states, concerns have been raised that guardianship is increasingly being used by service providers, particularly as a means to avoid engaging with families who are advocating for an individual's rights.\n\n\n\nCartwright was subject to an administration order for three years. Credit: Otis Filley In Cartwright's experience, being under an administration order \"strips you of your identity even more\".\n\n\n\n\n\nAfter three years, his order was revoked.\n\n\n\nTelling his story\n\nSBS acquired and broadcast Life is a Battlefield in December 2021 to mark the International Day of People with Disability. Afterwards, it was available online via SBS' streaming service On Demand.\n\n\n\n\n\nTwo weeks later, VCAT raised concerns regarding Cartwright's identification as a person previously under the control of State Trustees, which is subject to restrictions by law. SBS made the decision to temporarily remove the program from On Demand to allow the tribunal's concerns to be addressed.\n\n\n\n\n\nUnder clause 37 in schedule 1 of the Victorian Civil and Administrative Tribunal Act 1998, a person must not publish or broadcast information that identifies parties involved in guardianship and administration proceedings.\n\n\n\n\n\nIn Cartwright's case, this meant he could not legally identify himself.\n\n\n\nSBS News is investigating experiences of guardianship in Australia. Have you got a story to share?\n\nGet in touch at investigations@sbs.com.au or securely contact Emma Brancatisano at emmabrancatisano.journalist@protonmail.com .\n\nThe only exception to this law — which is commonly referred to as a 'gag law' — is if the tribunal makes an order stating that identification can proceed because it is considered to be in the public interest.\n\n\n\n\n\nCartwright applied to VCAT for a declaration that clause 37 did not apply in his case.\n\n\n\n\n\nA tribunal deputy president made an order allowing Uli to be identified, meaning he could tell his story.\n\n\n\n\n\nHe is one of the very few Australians currently or formerly under guardianship or administration orders able to do so.\n\n\n\n'We need to start somewhere'\n\nThe publication of information about guardianship proceedings is prohibited in most Australian states and territories, excluding the ACT. The specific conditions under which publication may go ahead vary across jurisdictions.\n\n\n\n\n\nWhile these rules are designed to protect vulnerable people, they essentially act as a 'gag', preventing those subject to them from talking publicly about their experiences. They also, by and large, stop the media from covering them.\n\n\n\n\n\nCartwright believes, in certain contexts, gag laws can lead to the public missing out on hearing important stories.\n\n\n\n\n\n\"You can't solve and protect somebody when you haven't experienced it. And if you haven't experienced it, you need to listen to the people who are,\" he says.\n\n\n\n\"I would argue that it's a form of institutionalisation. It's kind of like setting us aside. We're here, you want to protect us, but you don't want to listen to us.\"\n\n\n\n\n\nThe Disability Royal Commission acknowledged that confidentiality laws impact the rights of people with disability. It also recommended that states and territories look to \"repeal provisions prohibiting publication of material identifying a party to the proceedings as the default position\".\n\n\n\n\n\nCartwright sees reforming gag laws as a first step towards navigating — and reforming — the \"complicated\" guardianship system as a whole.\n\n\n\nIf we don't change this law, we can't talk about it openly.\n\n\"We need to start somewhere.\"\n\n\n\nA fresh push in Victoria\n\nOn Wednesday, Greens MP Anasina Gray-Barberio introduced a proposed amendment to Victoria's legislation regarding the gag law, while Cartwright watched on from the chamber.\n\n\n\n\n\n\"The bill basically states that this gag provision is not the default provision. I'm not interested in getting rid of it,\" he says.\n\n\n\n\n\n“I do believe that there needs to be some protections in place to stop abuse and weaponisation of people's stories.\"\n\n\n\n\n\nGray-Barberio told members of parliament the current restrictions set out in clause 37 are \"outdated and fail to uphold fundamental human rights\".\n\n\n\n\n\n\"It strips away their [people with disability] dignity and autonomy, and leaves them silenced and disempowered.\n\n\n\n\n\n\"By silencing individuals, this clause shields guardians, administrators, and service providers from scrutiny — a critical flaw in how this law currently stands.\"\n\n\n\nCartwright believes reforming gag laws is a first step to bring about change. Credit: Otis Filley The push for reform in Victoria is backed by the Office of the Public Advocate — the state disability rights advocacy body — along with disability advocacy organisation VALID, and service providers Yooralla and Life Without Barriers.\n\n\n\n\n\nDebate on the bill has been adjourned for two weeks.\n\n\n\n\n\nA Victorian government spokesperson said in a statement the government acknowledges the rights of people with a disability to have a say in decision-making that directly impacts their lives.\n\n\n\n\n\n\"We have accepted in principle the Royal Commission's recommendation to amend guardianship and administration laws by removing any 'default' confidentiality provisions,\" the spokesperson said.\n\n\n\n\n\n\"We will continue to work with the Office of the Public Advocate and those with lived experience of disability and guardianship to ensure Victoria’s laws remain effective.\"\n\n\n\nTasmania leading reforms\n\nElsewhere in Australia, reforms are slowly being considered.\n\n\n\n\n\nChanges to Tasmania's guardianship and administration gag law were introduced last year following a campaign by Advocacy Tasmania.\n\n\n\n\n\nThe non-profit rights advocacy organisation started a broader push to end what it termed \"abhorrent\" guardianship and administration practices in 2021, including gag laws.\n\n\n\n\n\n\"Tasmanians whose lives were being utterly destroyed by guardianship and administration were coming to us day in and day out, completely desperate for help,\" chief executive Leanne Groombridge tells SBS News.\n\n\n\n\n\n\"As an organisation that defends people's rights every day, we could do nothing to help protect them — it was a David and Goliath battle, but where Goliath won every time.\n\n\n\nWe knew the whole guardianship system had to change, and we knew people's stories were how you open the door to a possibility of change.\n\n\"But the very system that was enabling these abuses to happen was gagging people from speaking out about what was happening to them.\"\n\n\n\n\n\nA Department of Justice spokesperson confirmed in a statement that restrictions prohibiting the disclosure of information relating to a represented person under the Guardianship and Administration Act 1995 were removed last September.\n\n\n\nGroombridge wants to see guardianship gag laws reformed across the country. However, in Tasmania, she says there's \"so much further to go\".\n\n\n\n\n\n\"While people can now freely consent to telling their own story, we are still hearing far too many similar stories. People are still being denied choice and agency in their own lives, under the guise of protecting them from harm.\"\n\n\n\nGuardianship gag laws across Australia\n\nTasmania and the ACT have different approaches compared with other states.\n\n\n\n\n\nSBS contacted each jurisdiction and asked whether it supported reform to its current legislation.\n\n\n\n\n\nAn ACT Justice and Community Safety Directorate spokesperson confirmed there is no provision preventing the disclosure of identifying information about a person involved in such proceedings as a default position. The tribunal can make an order if the right to a public hearing is outweighed by competing interests, however.\n\n\n\n\n\nIn NSW, the NT and Queensland, the publication of proceedings that identify a represented person is prohibited. Different discretions are in place for tribunals to authorise publication, while there is no guidance on this in NSW.\n\n\n\n\n\nA NSW Department of Communities and Justice spokesperson told SBS News the government \"supports the overarching principle that a person to whom a guardianship or financial management order relates should be able to tell their story\", but that any amendment \"would need to appropriately balance privacy concerns with this objective\".\n\n\n\n\n\nThe spokesperson said the government \"will consider\" the issue in light of recommendations from a NSW Law Reform Commission review.\n\n\n\nOver the border in Queensland, a spokesperson for the Department of Justice told SBS News the state's attorney-general is continuing to work with ministers to implement recommendations from the Disability Royal Commission, and that reforming confidentiality legislation \"remains under consideration\".\n\n\n\n\n\nAn NT Department of Corrections spokesperson said the Public Guardian and Trustee is \"supportive of sensible reform that would strengthen the promotion of the rights and dignity of people with disability who want to tell their story publicly\". Currently, there is no active or proposed review.\n\n\n\n\n\nMeanwhile, in South Australia, a person must not publish a report of any guardianship or administration proceedings. Its tribunal can authorise publication, but only where it does not identify the protected person.\n\n\n\n\n\n\"Authorities have taken the view that this does not prevent a person from identifying themselves, or speaking publicly about their experiences within the guardianship system,\" a spokesperson for the state's attorney-general’s department said.\n\n\n\n\n\n\"Consideration is still being given to whether changes are needed to ensure that an individual’s right to speak about their experiences is protected while also ensuring sufficient safeguards are in place.\"\n\n\n\nCartwright is setting his sights beyond Victoria, as reforms are being considered across the country. Credit: Otis Filley In Western Australia, a person must not publish or broadcast any report that identifies or could lead to the identification of a protected person. There is no tribunal discretion under any circumstances.\n\n\n\n\n\nA Department of Justice spokesperson said the state's Law Reform Commission is currently conducting a review.\n\n\n\n'Let us speak'\n\nCartwright is mindful that he has won the right to speak.\n\n\n\n\n\nWhile he wants parliamentarians to take him seriously, his main hope is that others with disability \"feel heard and seen\".\n\n\n\n\n\nAnd, he's setting his sights on other states.\n\n\n\n\n\n\"If you really want to protect us, let us speak, because we want to work with you,\" he says.\n\n\n\n\n\n\"People with disability feel out of place and outcast. We want to educate you. We are not scary … We're just like you.\n\n\n\n\n\n\"We struggle, that's it. We all struggle. Just give us a chance to educate you, please.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rock-fishing-safety-reinforced-by-marine-rescue-nsw-following-multiple-incidents/0l9wsmwyb",
        "title": "Rock fishing safety reinforced by Marine Rescue NSW following multiple incidents",
        "publish_date": "Thu, 14 Aug 2025 10:29:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/treasury-advice-leaked-possible-productivity-outcomes-revealed/v9ypux7wf",
        "title": "Treasury advice leaked, possible productivity outcomes revealed",
        "publish_date": "Thu, 14 Aug 2025 10:24:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Treasury advice leaked, possible productivity outcomes revealed\n\nPublished 14 August 2025, 8:06 am\n\nThe Prime Minister says the upcoming economic roundtable is not a waste of time, after potential recommendations were leaked. Among the proposals Treasury has weighed up - changes to housing regulations similar to a former Coalition policy.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/legendary-australian-film-critic-david-stratton-dies-aged-85/1y6jqcvtj",
        "title": "Legendary Australian film critic David Stratton dies aged 85",
        "publish_date": "Thu, 14 Aug 2025 10:09:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/pm-warns-opposition-against-amplifying-hamas-propaganda/qea1vvaha",
        "title": "PM warns Opposition against amplifying Hamas propaganda",
        "publish_date": "Thu, 14 Aug 2025 10:01:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/grocery-costs-biggest-rise-five-years-inflation-eases/v8gxqf9zo",
        "title": "'Prices don’t go back': How did grocery costs see their biggest rise in five years?",
        "publish_date": "Thu, 14 Aug 2025 08:31:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you feel like your weekly grocery bill has jumped significantly over the past year, you're not imagining it.\n\n\n\n\n\nGrocery spend has recorded its biggest annual increase in five years, with comparison company Canstar Blue's supermarket survey from customers showing the average weekly bill for a family of four up 11 per cent, from $216 to $240.\n\n\n\n\n\nThis puts the annual spend on groceries at $12,480, almost $3,000 more than the bill for a same-sized household in 2021.\n\n\n\n\n\nAccording to the survey of 2,800 Australians, weekly shops included fruits, vegetables, dairy, bakery items, deli items, pantry items, drinks, frozen foods and household items.\n\n\n\n\n\nCanstar Blue spokesperson Eden Radford told SBS News that while they were expecting an increase in the numbers, they didn't expect it to be as big.\n\n\n\n\n\nRadford said customers said they were increasingly feeling like they had to spend more at the supermarket, and felt they weren't getting the same value as they were a few years earlier.\n\n\n\nAverage weekly spend for a grocery shop for a household of four has increased $25, compared to the previous year, according to Canstar Blue. Credit: SBS\n\nInflation easing, Grocery prices climbing\n\nAs customers report paying extra at supermarket checkouts, the Australian Bureau of Statistics (ABS) June quarter Consumer Price Index figures have shown headline inflation falling from 2.4 to 2.1 per cent .\n\n\n\n\n\n\"I think, unfortunately, because of the increased costs over the last few years, it's just added up,\" Radford said.\n\n\n\n\n\n\"When you are getting a slight increase one year, unfortunately, those prices don't go back down. They usually stay, or they usually increase again.\"\n\n\n\n\n\nAnnual trimmed mean inflation has also been 2.7 per cent for the year ending 30 June, down from 2.9 per cent in the March quarter, according to the ABS.\n\n\n\n\n\nTrimmed mean inflation is a measure of inflation that excludes the most extreme price changes, aiming to provide more reliable information about underlying inflation.\n\n\n\nLISTEN TO \"Grim reading: Aussie supermarkets most profitable in the world SBS News 07:30 English\n\nRadford said while there have been some decreases in inflation numbers, there are still \"elements of inflation across all of the things that we're purchasing\".\n\n\n\n\n\n\"It does come through in terms of how the supermarkets are bringing their goods to us,\" she said.\n\n\n\n\n\n\"At the end of the day, when we're shopping at that supermarket, the prices we're paying often [are] the result of increased fuel costs or increased storage costs or increased needs to get it to the country. And that I think unfortunately is what we're having to pay.\"\n\n\n\n\n\nAustralian supermarkets have faced accusations of engaging in price gouging, a practice where businesses exploit higher demand or limited supply to substantially increase prices.\n\n\n\n\n\nSupermarket giants like Coles and Woolworths have repeatedly denied these claims, while the Australian Competition and Consumer Commission's report in March found no evidence of price gouging.\n\n\n\n\n\nA report from consumer advocacy group CHOICE also showed that the location of shopping might impact grocery prices.\n\n\n\n\n\nBy comparing the prices of groceries at 104 supermarkets in 27 locations across Australia in March, CHOICE found that \"the state you live in does make a difference to how much you pay\".\n\n\n\n\n\nAccording to Canstar Blue's report, households in the Northern Territory have the lowest average weekly grocery expenses, whereas those in Tasmania spend the most at supermarkets.\n\n\n\n'Frozen' instead of 'fresh'\n\nAccording to Radford, the price increase has made people change \"how they shop\".\n\n\n\n\n\n\"We've seen people, particularly in the last 12 months, choose to buy frozen instead of fresh,\" she said.\n\n\n\n\n\n\"They are doing things like shopping at different times. So you know, either going very early or even late.\"\n\n\n\nREAD MORE Is this the solution for rising food shopping costs?\n\nShopping around different supermarkets is also a new tactic among customers to face the rising prices, with Canstar Blue reporting more than 61 per cent of shoppers visit two or more supermarkets each week.\n\n\n\n\n\nOverall, 80 per cent of Canstar Blue's survey participants reported changing their shopping habits in the past year to reduce costs.\n\n\n\n\n\n\"Any increase in prices, particularly for something like the grocery bill for a family, is never good news, and it's never something that is easy to manage,\" Radford said.\n\n\n\n\n\n\"What we are hoping and what we're seeing in this research is that more and more Australians are not just coping [with] it, they're saying, 'Gold on, maybe I can go try a different supermarket.'\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-origin-energys-frank-calabria-on-power-prices-and-energy-transition-plus-jobless-rate-falls/ddm891i5e",
        "title": "CEO Series: Origin Energy's Frank Calabria on power prices and energy transition - plus jobless rate falls",
        "publish_date": "Thu, 14 Aug 2025 07:40:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/wildfires-burn-across-europe-as-millions-deal-with-heatwave/gespubju9",
        "title": "Wildfires burn across Europe as millions deal with heatwave",
        "publish_date": "Thu, 14 Aug 2025 07:32:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n(Sounds of fire crackling)\n\n\n\n\n\nAnastasia Spiliopoulou walks beside the charred remains of a beach bar in the village of Kamina, in western Greece.\n\n\n\n\n\nIt's one of many buildings destroyed as a fast-moving wildfire swept through villages near Patras, the third largest city in Greece, west of Athens.\n\n\n\n\n\nThe 38-year-old chef says it will take a long time to recover from the damage.\n\n\n\n\n\n\"It holds memories. Because I enjoyed working in this kitchen. Cooking was my hobby, both at home and here Now there's nothing left. Most important is that the owner is in good health, and we are all safe at home. I am not the only one, there are two more women working here, one from Kaminia and one from Kato Achaia. I was not the only one.\"\n\n\n\n\n\nNearly 100 square kilometres have burned in the surrounding Achaia region in two days.\n\n\n\n\n\n57-year-old restaurant owner Dimitris Daskas was injured trying to fight a fire in nearby Vrachneika.\n\n\n\n\n\n\"The house over there, their clothes, the wall, it was all burned, it must be torn down, it is no longer inhabitable. My arm, I broke it over there, I fell on it and broke it as I was bringing the extinguishers, here we had no electricity, no water... Five hours before the fire came here we had no water.\"\n\n\n\n\n\nHe says his village was left to fend for itself, despite multiple attempts to contact authorities.\n\n\n\n\n\n\"No one’s plot was clear, there was dry grass two metres high. I told them yesterday, I have been making phone calls since 11pm, I posted on Facebook, I made announcements...no one listened. My wife was calling to say we are on fire, they didn’t even pick up. There was no trace of the fire brigade up here. They focused on the villages, it makes sense, but we are also part of the village, we are the last house of Patras.\"\n\n\n\n\n\nWildfires have also forced the evacuation of several villages and a hotel on the tourist islands of Zakynthos and Cephalonia in the Ionian sea, along with parts of the mainland.\n\n\n\n\n\nThe fires aren't contained to Greece- fanned by an intense heatwave and strong winds, wildfires have wreaked destruction across southern Europe, burning homes and forcing thousands of residents and tourists to flee in recent days.\n\n\n\n\n\nMore than 5,000 people have been evacuated in the northern Spanish regions of Castile and Leon, where high winds continue to hamper firefighting efforts.\n\n\n\n\n\n27-year old resident of Sarracin de Aliste village, Javier Baladron, has joined volunteers fighting to contain nearby fires.\n\n\n\n\n\n\"The wind isn’t helping a lot, it's against us. The fire brigades, with carts and bulldozers, it’s complicated for them to extinguish the fire because there are several active fires in different towns. It is getting more complicated for them.\"\n\n\n\n\n\nAt least six large fires continue to burn out of control in Spain, according to regional emergency services, and conditions are expected to remain challenging, with a 10-day heatwave forecast to last until early next week, according to Spain's state weather agency.\n\n\n\n\n\nAnd across the border, about 3,000 firefighters continue to battle a series of wildfires across Portugal, with the country under a state of alert until Friday - in light of the extreme risk of wildfires.\n\n\n\n\n\nIn the small village of Casal Do Monte in the country's north, a French tourist, Cindy, has joined residents trying to prevent encroaching fires from reaching the village.\n\n\n\n\n\n\"Well it’s quite impressive, we’re in between two fires, it’s been going on for several days. It’s going to surround us, there are woods all around us, so we’re thinking it’s going to burn rapidly.\"\n\n\n\n\n\nSenior Fire Management Expert at the European Forest Institute Alexander Held says firefighters across Spain and Portugal are facing extreme hot and dry conditions, and the fire danger is exacerbated by unprepared landcapes.\n\n\n\n\n\nHe says dealing with multiple fires at the same time is extremely difficult.\n\n\n\n\n\n\"Multiple fires at the same time are a huge problem for the responders because suddenly you don't have one incident, you have ten, maybe 50 fires going. So in terms of resources, do you have enough? No, you don't have enough. Coordination priorities. Then you have don't only have the fires, then you have to evacuate settlements and people. So it's firefighting plus evacuation. So it's incidents within incidents in this in multiple scales.\"\n\n\n\n\n\nFire has affected nearly 4,400 square kilometres across Europe so far in 2025, which is double the average for the same period of the year in 2006, according to the European Union Science Hub's Joint Research Centre.\n\n\n\n\n\nSpain alone has recorded more than 1300 square kilometres have been burned this year, while Portugal has seen more than 6,200 square kilometres consumed by flames, according to annual statistics from the European Forest Fire Information System.\n\n\n\n\n\nMr Held says the figures show that climate change is making fires more intense and more frequent, with hotter, drier summers increasing risk.\n\n\n\n\n\n\"We do see these conditions coming more frequently. We see more often uncontrollable, very fast, very intense fires. So it is fair to expect that in the near future we have more of this. And the climate predictions also point in that direction.\"\n\n\n\n\n\nThe Balkan region has also been hit by a series of wildfires, following weeks of high temperatures and very little rain.\n\n\n\n\n\nFirefighters continue to fight flames near the village of Kosor near Montenegro's capital, Podgorica; and several major wildfires continue to burn across Albania.\n\n\n\n\n\nIn Montenegro's mountainous area northeast of the capital Podgorica, one army soldier was killed - and another badly injured - when a water tanker they were operating rolled over.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/david-stratton-has-died-aged-85/z7c9rs3pt",
        "title": "Australian film critic and former SBS presenter David Stratton dies aged 85",
        "publish_date": "Thu, 14 Aug 2025 05:31:13 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "David Stratton has died at the age of 85.\n\n\n\n\n\nThe English-Australian film critic, writer, presenter and educator's death was announced by his family on Thursday afternoon.\n\n\n\n\n\nIn a statement shared by the ABC, Stratton's family said he died peacefully in a hospital near his home in the Blue Mountains in NSW.\n\n\n\n\n\nThey said Stratton's \"passion for film, commitment to Australian cinema, and generous spirit touched countless lives\", and that he was \"adored as a husband, father, grand and great-grandfather and admired friend\".\n\n\n\n\n\nStratton joined SBS in 1980, working as a film consultant and regularly introducing the SBS Cinema Classics and Movie of the Week broadcasts.\n\n\n\n\n\nThroughout a lengthy media career, Stratton hosted film review shows alongside close collaborator Margaret Pomeranz for 28 years.\n\n\n\nDavid Stratton hosted film review shows with Margaret Pomeranz for many years. Source: AAP / Nikki Short He and Pomeranz co-hosted The Movie Show on SBS from 1986 to 2004, and At the Movies with Margaret and David on ABC from 2004 to 2014.\n\n\n\n\n\nStratton was born in the UK in 1939, arriving in Australia in 1963 as part of the 'ten pound pom' migration scheme.\n\n\n\n\n\nFrom 1966 until 1983, he was the director of the Sydney Film Festival, and served as a jury member for many prestigious international festivals throughout his career.\n\n\n\n\n\nStratton also wrote film reviews for the Weekend Australian for more than 30 years, and lectured in film history at the University of Sydney's Centre for Continuing Education.\n\n\n\nHe retired in 2023 because of ill health, after a celebrated career that spanned 57 years.\n\n\n\nAlbanese pays tribute\n\nPrime Minister Anthony Albanese has paid tribute to Stratton.\n\n\n\n\n\n\"With dry humour and sharp insight, David Stratton shared his love of film with our country,\" he said in a post on X.\n\n\n\n\n\n\"All of us who tuned in to 'At the Movies' respected him for his deep knowledge and for the gentle and generous way he passed it on. May he rest in peace.\"\n\n\n\nREAD MORE Remembering David Stratton: His 10 favourite films\n\nStratton's family issued a special request to moviegoers, asking that they celebrate his \"remarkable life and legacy\" by watching their favourite movie, or Stratton's favourite movie, Singin' in the Rain.\n\n\n\n\n\n\"David's family would like to express their heartfelt gratitude for the overwhelming support from friends, colleagues, and the public recently and across his lifetime,\" his family said.\n\n\n\n\n\nDetails of a public memorial service are expected to be announced soon.\n\n\n\n\n\n— Additional reporting by the Australian Associated Press.\n\n\n\n\n\nFollow the latest from SBS News at www.sbs.com.au/news , or on the SBS News app available on iOS or Android .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/it-wasn-t-going-to-work-with-ned-graham-wright-opens-up-on-carlton-the-voss-call-silvagni-and-leaving-the-pies-20250813-p5mmqh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It wasn’t going to work with Ned’: Graham Wright opens up on Carlton, the Voss call, Silvagni, and leaving the Pies",
        "publish_date": "Fri, 15 Aug 2025 12:08:31 +1000",
        "category": "finance",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Leaving the Pies and friction with Craig Kelly Wright left Collingwood twice. The first time the Magpies didn’t let him. That was at the end of 2023, shortly after winning the flag. Wright quit saying he needed a break and a European trip. President Jeff Browne and his board rejected the resignation and floated a possible succession plan with Craig Kelly, who had returned to the club as CEO early in the premiership year. Wright was kept on as a consultant but barely used. Craig Kelly and Graham Wright are 1990 Collingwood premiership teammates. Credit: Artwork: Stephen Kiprillis. Photos: Penny Stepens, AAP He and Kelly spoke during the 2024 season and discussed how things would look when he returned, but tension between them grew. There was no one incident to prompt a falling out, but by the time Wright was due to return from Europe, relations had soured between the 1990 premiership teammates, who were always different personalities.\n\n“I thought I would go back, but it became clear that that wasn’t going to be tenable or workable. It just wasn’t going to work with ‘Ned’. “You’re setting yourself up and everyone else up to fail when it is like that. The biggest part for me was that it wasn’t going to work for the other people there if you’ve got your head of footy, or whatever role they were going to construct for me, not seeing eye to eye with the CEO. How’s that going to work?” “I thought I would go back, but it became clear that that wasn’t going to be tenable or workable. It just wasn’t going to work with ‘Ned’.” Graham Wright The pair has been cordial since. Others looked on expectantly when Wright and Kelly crossed paths at the CEOs’ meeting earlier this year. They shook hands and were civil. They are not friends, but there is no grudge. Behind the decision to back Voss\n\nAt Carlton, Wright ended up spending much the year almost running a football review after performances spiralled. “My background is footy, so being invited in or being available to footy, whether it be risk management, recruiting through to footy and coaching I just said how can I help? Are you happy for me to sit in on things and give my opinion or thoughts on things? I never went into anything without asking first. And don’t get me wrong, the doors were open. “I thought they do things pretty well. They do things differently to Collingwood, but Collingwood did things differently to Hawthorn [where Wright previously worked].” The biggest question was Voss. While he was contracted for 2026, his future was uncertain. This is Carlton after all, the revolving door of coaches never slows for long. Wright and the board had this unhappy history of sacking coaches in mind when they weighed up Voss’ future, but it did not directly impact the decision to keep him. “You’ve got to treat it on its merits, if Vossy is not the right person, well, then what do we do? We’ve got to make a decision. So I didn’t look at it as though ‘this is what Carlton has always done, so I can’t do it. I can’t make that recommendation to the board’. It had to be okay.\n\n“Having said that I think we might be 28-9 now [losses and wins in past 37 games] and I think we might have been 18-8 and Vossy and I had an honest conversation, which is, we haven’t been good enough, what are we gonna do about it? Then it’s more, OK I need to have some conversations with people at the club and players and coaches and staff and see where we go, and then ongoing conversations with him about what he’s thinking.” Will Hinkley join the Blues? Once Voss was confirmed for 2026 the thinking shifted. You could not have the season Carlton has had and make no changes. Lloyd, the football manager for seven seasons and three coaches, leaves the club next week, a liked and respected character but with new leadership wanted. The coaching team will change. Some assistants are under contract and will remain; others without contracts have been told they can’t be offered new deals yet but that doesn’t mean they won’t be. They are free to look around. “I think Vossy has to decide how he wants to structure up,” Wright said.\n\n“Do we bring in a coaching director or with the soft cap change around senior assistants what does he [Voss] think that looks like? What does he see for [senior assistant] Ash Hansen? So there’s all those conversations that he needs to have post-season. The Blues will speak to Ken Hinkley about a senior role. Credit: Getty Images “You look at things around the way we play and how we’re structuring up in games, and key statistics around and all of those things in making the coaching decision, rather than putting a finger in the air and saying this is what I think. “There was shared responsibility, in my view, of players taking accountability, the leaders taking some responsibility and obviously, there’s some feedback for Vossy in that around how or why he goes about things. Our list management, recruiting has been okay, but it could be better, our development, all of those sorts of things go into it, and it’s not one thing. It’s not pointing the finger at any one person.” It’s highly likely the club will speak to Voss’s former mentor at Port Adelaide, Ken Hinkley, about a coaching director or similar role. But theirs will not be the only approach to Hinkley who will coach his last game for the Power next Friday night, nor will Hinkley be the only person they speak to as there is an appetite to build support for Voss.\n\nThe game style and the players The eternal chicken and egg conundrum for clubs in Carlton’s situation is who carries most blame. Is it the coaching or the players? Is it list management? Is development the issue? Are the players not fit enough? Is it the psych, the dietician, the hairdresser or the tattooist? Carlton reached the 2023 preliminary final and last year’s finals on the back of big-bodied, hungry midfielders. The Blues were- and are - a contested ball, clearance team with good key forwards and one of the best key defenders in Jacob Weitering. Around them are role players. But footy has evolved, and trended towards leg speed and repeat, end-to-end running. Carlton could still win the ball but once it got on the outside, they couldn’t keep up. Sam Walsh’s absence hurt, while Adam Saad looked his age. Not having Smith, for whom they had plunged in the draft for this very reason, was also a blow. “The key statistic over the last 10 years is that contested ball and clearance and all those things are still important, but we were number 18 for kicking efficiency,” Wright said.\n\n“Well, what are we doing about that? Who’s responsible for that? Our inside 50 conversion rate is now 17th in the competition. Who’s responsible for that? Why is that? So a lot of the key statistics that make the last lot of premiership teams good we are pretty good at, but then there are things that we’re very average at, or worse than average at. So we need to improve in all those areas.” The future of De Koning and Silvagni Carlton are almost resigned to losing Tom De Koning. As De Koning is a restricted free agent the Blues get the chance to see St Kilda’s offer even if it’s only for curiosity value as they have little chance of matching the terms which they suspect have - or will - creep out to $1.8 million a year for seven years with an eighth year of at least another $1 million. ”To be very clear, we want to keep Tom first and foremost,” Wright said. “But if he were to go I think you’d have to bring in someone to support. You always need another one. We’ve got young Hudson O’Keeffe, who’s probably more forward-ruck than ruck-forward. He’s a little bit undersized to play ruck. So we need someone else who could come in and play genuine ruck, who that is the guys are working through that now, if TDK goes.”\n\nNed Moyle at Gold Coast is contracted but struggling for opportunities behind Jarrod Witts. Ditto Ned Reeves - who was taken as an SSP rookie when Wright was at Hawthorn - who is also contracted but behind Lloyd Meek who leapfrogged Reeves in the pecking order when the ruck rules changed. Third-generation Blue Jack Silvagni is attracting interest as a free agent. Credit: AFL Photos “There’s a few guys around and a few who are contracted but want opportunity. Reeves is one in that boat.” Carlton’s other free agent, Jack Silvagni, is unrestricted so the Blues don’t get to peek at other offers for him. Collingwood’s early pursuit prompted some in the industry to wonder if there was a personal element to the Pies’ attempts to poach him from Wright’s new club.\n\n“I’d find that hard to believe because you’re trying to do the right thing by the football club not get one over on someone. I can see why Collingwood would be interested in a player like Jack for their list needs,” Wright said. The Bulldogs have since met with Silvagni, who is now weighing the relative premiership windows of all three clubs - Carlton, Collingwood and the Dogs - given the financial offers are fairly similar. The players on Carlton’s trade and draft radar The Blues need more run in midfield but also more depth in small forwards who can scunge a goal and apply pressure. Mal Rosas at Gold Coast is out of contract and played 49 games so he fits the role, availability and age profile, and the Blues are interested. “Like a number of clubs we’ve expressed an interest. I’m not sure where that one sits,” Wright said.\n\nLiam Ryan out of West Coast? “He’s contracted. I think he’s got a year ago That … complicates it a whole lot more.” Liam Ryan flies for West Coast. Credit: Getty Images Jamie Elliot at Collingwood still unsigned and a free agent. “I presume he stays at Collingwood. I wouldn’t think he’s leaving, that’s my view, but I’d certainly be open-minded if Jamie is a free agent and wanted to move. But I haven’t heard that he’s moving.”\n\nThe Blues are almost resigned to losing Tom De Koning. Credit: Getty Images The Blues could lose Silvagni but will add at least one father-son this year and next in Peter Dean’s son Harry (a likely top 10 pick this year) and Andrew Walker’s talented son Cody next year. The compensation question Carlton stands to lose TDK on the biggest contract a player has ever signed, and will receive only a first round compensation pick tied to their first selection. Currently, that would be pick six, but will doubtless be pushed back with bidding on academy players. Under the current system if Carlton were to bring in a free agent (depending on the quality of the free agent) they would potentially dilute even that modest compensation.\n\nWest Coast is in the same boat. If they lose their captain Oscar Allen as a free agent they can’t risk diluting his compensation by potentially bringing in Lions free agent Brandon Starcevich. Wright believes the system should change. “Whether it is the clubs outside the eight that can bring in a free agent without it hurting compo, or just the bottom six or eight, there shouldn’t be a disincentive to securing mature talent for clubs trying to rebuild,” he said. The deal with McKay and Curnow Wright says Curnow has had a difficult year because of interrupted pre-season.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/banking-and-finance/how-bank-branches-can-avoid-the-fate-of-video-stores-20250812-p5mme5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How bank branches can avoid the fate of video stores",
        "publish_date": "Fri, 15 Aug 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Clancy Yeates"
        ],
        "text": "Bank branches will not disappear from shopping strips entirely in the way that video stores have, even as more customers ditch cash for digital banking, outgoing chief executive of the Australian Banking Association Anna Bligh says.\n\nThe number of bank branches around the country has tumbled by more than 40 per cent between 2017 and 2024, latest official figures show, and the trend has sparked intense scrutiny of the major banks’ physical footprint.\n\nAnna Bligh, chief executive of the Australian Banking Association, is retiring from the peak body. Credit: Oscar Colman\n\nBligh, a former Queensland premier, is retiring from the ABA after eight years in the role, to be replaced by former Liberal MP Simon Birmingham. In an interview, Bligh said one key challenge for Birmingham would be changes caused by the “new world” of digital banking as many customers embrace digital channels and payments.\n\nCash has been in long-term decline, and Bligh said the Reserve Bank estimated only 4 per cent of transactions would be in cash by 2030, which she said was “getting pretty close to zero”. Cheques are also being phased out by 2030. Even so, Bligh said branches would not “disappear overnight” because they were still commercially valuable for many banks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/beaches-metro-negative-gearing-crackdown-the-surprising-policies-backed-by-nsw-young-libs-20250815-p5mn6h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beaches metro, negative gearing crackdown: The surprising policies backed by NSW Young Libs",
        "publish_date": "Fri, 15 Aug 2025 11:58:33 +1000",
        "category": "finance",
        "authors": [
            "Max Maddison"
        ],
        "text": "NSW Young Liberals will propose limiting negative gearing to a single investment property to discourage speculation in housing and boost supply, as part of their annual general meeting over the weekend.\n\nThe gathering will consider 13 disparate policy motions, as far ranging as the “proposed elimination of central banking” and the ability for the Reserve Bank to set interest rates, to constructing a 17-kilometre northern beaches metro link from Chatswood through Frenchs Forest to Brookvale.\n\nThe Young Liberals will consider some fresh ideas as the party is at a crossroads at both state and federal levels. Credit: Getty Images\n\nThe two-day AGM comes as the party is at a crossroads at both state and federal levels. Federal leader Sussan Ley has been tasked with rebuilding the party after May’s election hammering, while internal squabbling has erupted among NSW Liberals 18 months out from the 2027 poll.\n\nThe policy statement to be moved by James Ardouin, a Woollahra councillor and consultant with EY, is aimed at addressing stagnant housing supply. He argues an outsized investment of the nation’s wealth in residential property has sucked large amounts of capital away from industries that “create real economic value”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/movies/david-stratton-s-colourful-life-five-stars-for-a-revered-figure-in-australian-film-20250814-p5mn3v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "David Stratton’s colourful life: five stars for a revered figure in Australian film",
        "publish_date": "Fri, 15 Aug 2025 11:58:22 +1000",
        "category": "entertainment",
        "authors": [
            "Garry Maddox"
        ],
        "text": "As an author, Stratton chronicled Australian film from its renaissance in the 1970s to 2020 in the books The Last New Wave, The Avocado Plantation and Australia at the Movies, wrote about his own colourful life in the memoir I Peed On Fellini and made cinematic recommendations in My Favourite Movies and 101 Marvellous Movies You Might Have Missed. Loading He programmed and presented films on SBS, lectured on film history for the University of Sydney’s continuing education program and hosted the documentary series David Stratton’s Stories Of Australian Cinema. An internationally respected critic with encyclopaedic knowledge of cinema, Stratton served on juries at leading international film festivals including Cannes, Venice and Berlin, won Australian film’s Longford and Chauvel awards, was named by France a Commander of the Order of Arts and Letters and was awarded honorary degrees by Sydney and Macquarie universities. He may have accidentally peed on Italian director Federico Fellini in a bathroom accident at the Venice Film Festival in 1966, earning the terse response “stronzo!” which he later wrote was well-deserved, but Stratton was warmly admired by Australia’s leading filmmakers.\n\nDavid Stratton with Russell Crowe in 2017. Credit: Mark Rogers Director George Miller says Stratton was not only critical to him making the first Mad Max – he programmed a short film at the 1971 festival that was picked up for cinema release – but “his engagement with world cinema allowed us all to see films we could see nowhere else”. Miller adds: “Even if he gave you a not-so-good review, you knew it was pretty accurate because he had such a love of cinema. It was so much in his blood. I remember meeting him at the Cannes Film Festival once and I was astonished and how many films he’d seen. He spent most of his time in the dark and he knew every frame of every film he ever saw.” David Stratton with filmmaker George Miller in the 2017 documentary in David Stratton: A Cinematic Life. For Peter Weir, the festival became a film school. While Stratton tactfully rejected his first short film by saying it was “not suitable”, the budding young director was encouraged by his enthusiasm to see the next one.\n\n“David brought back to Australia the very best in world cinema,” Weir says. “What a time it was! He put aspiring filmmakers in touch with what was happening in that great era of film.” Loading Gillian Armstrong describes Stratton “a cultural icon” whose encouragement of her as a young filmmaker, which included programming her early shorts, was “life-changing”. But he still reviewed her later films so honestly that she can remember the damning phrase he used about Starstruck. “He had great ethics about the films that he liked and didn’t like and I really respected that part of David,” Armstrong says. “He was someone who was so obsessed and positive about film and had incredible generosity towards helping young filmmakers but, at the same time, he would call a spade a spade.” Phillip Noyce says he owes the chance to make his first feature film to Stratton programming the short feature Backroads at the 1977 festival after it had been “trashed” by the short film competition judges.\n\n“To the first generation of the New Wave of Australian filmmakers back in the late ’60s through the ’70s, ‘80s and ’90s, David Stratton was both our mentor, our teacher and the champion of Australian cinema,” Noyce says. Loading “David introduced us to the extraordinary emerging Eastern European and Russian cinema, earning himself an ASIO file for his enthusiasm and fighting against the sometimes excessive federal and state censorship of that era.” Born in 1939, Stratton had a middle-class upbringing in a family with a grocery business in southern England. But his early love for films gave him a different career path. As a boy, he would cycle more than 20 kilometres to a cinema then handwrite and file notes about every film he watched. “My passion for the cinema had, in fact, become an obsession,” he wrote in I Peed On Fellini.\n\nIn 1963, Stratton emigrated to Australia as a so-called ten-pound Pom then, after a casual holiday job as an usher at Sydney Film Festival, was surprisingly “asked to basically run [it] in my mid-20s”. He programmed the kind of cinema that had never been seen in Sydney and, by sharing programs, Melbourne. This included provocative subtitled films made by visionary directors from Europe, including the Eastern Bloc, and Asia. He championed Australian films and argued against what he saw as the repressive censorship of foreign films in the ’60s and ’70s. David Stratton with Margaret Pomeranz in 1990. In the early days of The Movie Show – I wrote their film news segment for a time – I remember Stratton and Pomeranz had an easy chemistry on screen but the best TV was often when they disagreed. While the production values increased when they moved to the ABC, the spirited debates continued. “Five stars from me,” became a catchcry and a glowing review from “Margaret and David” guaranteed an audience for an arthouse film.\n\nEven after leaving TV in 2014 and winding back his print reviewing, Stratton remained a great enthusiast for films. He continued his habit of watching a new film every day – often from the estimated 20,000 DVDs in his home collection. He and Susie watched films featuring the likes of Sidney Poitier, Richard Widmark, Meryl Streep and Gregory Peck in the order in which they were made. Continuing another longtime habit, Stratton would write and file a page of notes about every new film, including the basic credits, run time and year of production. Asked his favourite Australian films of those watched to write his latest book, which covered just about every release from 1990 to 2020, Stratton listed no fewer than 58. Among them were such hits as Happy Feet, Mad Max: Fury Road, Lantana, Lion, The Babadook, Muriel’s Wedding, Two Hands and Samson & Delilah but also such little-seen gems as A Lion Returns, Blessed, The Jammed, Pawno and Slam. Stratton was never shy expressing his view about disappointing films, though. In 1992, he famously refused to give a rating for the Australian film Romper Stomper because he believed its portrayal of neo-Nazis was dangerous, which led to director Geoffrey Wright charging up to him at the Venice Film Festival yelling “stay away from my film, you f---er” and throwing a glass of wine over him.\n\nAt an In Conversation session with Jane Campion at Sydney Film Festival two years ago - after she requested he host the event – Stratton set her back by saying how much he disliked her series Top of the Lake. His most recent book on Australian cinema dismisses certain films – sometimes too harshly – as “a laughless lump”, “obnoxious” or “a chore”. But Stratton was also prepared to reappraise a film. In 1997, he slammed the much-loved Australian comedy The Castle for being unfunny and “patronising towards its characters” and gave it one and half stars. By last year it had become one of his 58 favourites and, in Australia At The Movies, he wrote that it had “stood the test of time” despite “the TV style direction and photography”. Stratton also stood the test of time. Sports teams often retire the jersey numbers of beloved players. The festival should reserve those two seats for as long as it runs. His family plans a private funeral, with details of a public memorial service to be announced.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/tips-and-advice/with-just-one-dish-on-the-menu-this-sydney-restaurant-is-a-cure-for-decision-fatigue-20250811-p5mlzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "With just one dish on the menu, this Sydney restaurant is a cure for decision fatigue",
        "publish_date": "Fri, 15 Aug 2025 11:51:09 +1000",
        "category": "finance",
        "authors": [
            "Terry Durack"
        ],
        "text": "Dining out isn’t as easy as people think. First you have to decide where to go. Then you’ll be asked to choose between counter or table seating, inside or out, and what time you want to dine.\n\nDon’t think you can relax when you get there. Craft beer or Old Fashioned? Oysters or chicken-liver crostini? If oysters, which oysters and with which vinaigrettes? Already my poor, end-of-the-working-day mind is spinning and I haven’t even tackled whether to have the Black Opal wagyu MB7 rump cap or the Speckle Park 600g rib-eye.\n\nPhoto: Simon Letch\n\nOur old friend, late-stage capitalism, dictates that there be choice at every turn, which means countless tiny decisions must be made every minute of the day. At times, it’s overwhelming.\n\nSo to hear tell of a restaurant in Sydney that offers just a single main course is like an island in a choppy sea: a place of refuge. In true Henry Ford style, you can have any main course you like at 24 York, as long as it’s steak frites.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/what-the-rba-governor-s-struggle-to-get-a-room-to-focus-on-rates-says-about-the-economy-20250813-p5mmlc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What the RBA governor’s struggle to get a room to focus on rates says about the economy",
        "publish_date": "Fri, 15 Aug 2025 11:49:04 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Low inflation and official interest rates through the 2010s, then COVID, the post-pandemic inflation explosion, Russia’s invasion of Ukraine, and more recently the war in Gaza all diverted attention away from the productivity slowdown. But with inflation subsiding and Donald Trump upending the global trading order, most governments – including the freshly re-elected administration of Anthony Albanese – are revisiting ways to get their economies back to health. Treasurer Jim Chalmers, who will sit through all roundtable sessions, and whose department will be driving much of the analysis of the various proposals put up by participants, has cautioned that those looking for instant results on Thursday evening will be disappointed. “[The point of] this economic reform roundtable is not to make decisions, it’s to inform the government’s decisions,” Chalmers told ABC Radio National Breakfast on Wednesday. “And that’s the point that we have made all along.”\n\nThe roundtable has attracted almost 900 submissions, although some proposals appear dead on arrival. There seems little appetite, for instance, to support the ACTU’s ambit claim for a four-day working week without a cut in pay. Loading The Productivity Commission has, through five papers canvassing everything from tax to AI, made more than 40 separate recommendations of its own. The government has held a series of industry-specific roundtables in areas such as mining, agriculture and housing, where a host of ideas have surfaced. Chalmers sat down with business leaders and lobby groups ahead of the roundtable, as have other ministers. “I think it has been a very worthwhile thing that we are shaking the tree for ideas, and the prime minister and I are aligned in the way we go about that,” Chalmers told Ratio National.\n\nThe reason for so many ideas bubbling up is twofold. The first is that it has been a long, long time since a government has asked all and sundry to produce a shopping list of suggestions. The second is that there is no single bullet solution to a productivity problem that has afflicted every nation and almost every corner of the economy. In housing, for instance, the average time in Australia to complete a block of apartments has soared since 2008 from around 17 months to 28 months. Building a house has increased from seven months to 10. But in comparison to other countries, the Australian construction sector is almost a beacon of hope. The Productivity Commission found building productivity in Australia is outperforming the US, Britain and Sweden.\n\nExplaining its reason for lowering its productivity assumption, the Reserve Bank suggested a number of reasons. They include declining dynamism among businesses and across the labour market, slower rollout of technological breakthroughs, falling competition, regulatory red tape, a slowdown in the growth of skills among workers, and a drop in trade linkages across the world. Even measuring productivity can be difficult. Some pundits have blamed the increase in financial resources and people in the care sectors of the economy (aged care, childcare, health, disability) for the slowdown in productivity.\n\nMeasuring productivity in these sectors, where relatively low-paid people provide intense services to the frail, sick, old or young, is notoriously difficult. The Productivity Commission this week reported that by a traditional measure of productivity, it had grown at just 0.1 per cent a year across the nation’s hospitals between 2008-09 and 2018-19. By contrast, productivity across the entire economy grew by 0.7 per cent per annum. Health outcomes have sharply improved over the past 30 years, but this has not been captured in official measures of productivity. Yet that doesn’t consider the huge improvements in the quality of care or patient outcomes. Cancer treatments, the commission said, are far more effective today than they were a few years ago. When you account for quality, healthcare productivity grew at 3 per cent per year through much of the past decade, dwarfing the rest of the economy.\n\n“Simply put, Australians are getting better outcomes, but not necessarily more care services, per dollar spent,” the commission noted. Loading Another issue is that productivity in the mining sector – the nation’s most productive based on the value of its outputs – has fallen off a cliff over the past five years. It has tumbled by 20 per cent, largely because miners are now tapping lower-value deposits while facing a string of natural disasters that have flooded coal mines or shut down key production sites. No matter the varied causes, it’s clear the government and most participants want to target a productivity bugbear: red tape and bureaucracy. The battle to get bike helmets into the economy is a small-scale example.\n\nWhile the nation’s cyclists protect their heads with imported helmets, the safety standards governing the headwear differs. It costs importers about $14 million a year to comply with those different standards. Loading The Australian Competition and Consumer Commission started a process to align the European and American standards governing helmets sold domestically in 2016. It was only completed last year, but it has yet to be signed off by all states and territories. “The net result is that eight years after realising the value of harmonisation, most Australians are yet to see benefits,” the Productivity Commission reported earlier this month. Productivity is not just red tape or new machines or tax. The skills of the workforce are also a vital component.\n\nThe Smith Family says there are 3.3 million people living in poverty in Australia, including 761,000 children. Loading It’s pinning its hopes on the roundtable coming up with ways to lift school completion rates and overall education outcomes, given their strong connection to improved wages and incomes. “We know children and young people from disadvantaged backgrounds are more susceptible to falling behind in the classroom, disengaging with school, not finishing year 12 and not being able to fully participate in the workforce,” the charity’s chief executive officer, Doug Taylor, says. “To boost the pool of talent in the nation’s workforce, we must plug the holes to stop students experiencing disadvantage from falling through the cracks.”\n\nDespite the reticence of the government to deal with the multitude of issues with the nation’s tax system, many people believe the purpose of next week is to put tax reform squarely at the centre of Anthony Albanese’s second-term agenda. Independent MP Allegra Spender, who has a seat around at the roundtable, is looking for a shift to a dual income tax system. Investors would lose the ability to offset their taxable income through losses on their property holdings, with the revenue used to reduce personal income tax rates. Allegra Spender (right), Ken Henry and Grattan Institute head Aruna Sathanapally (left) will be at next week’s economic roundtable. Credit: Dominic Lorrimer “You should be rewarded for investing in yourself, not for expanding your property portfolio,” she said. Ben Phillips, from the ANU’s Centre for Social Policy Research, has proposed a major simplification of the entire system that includes axing the Medicare levy and the low-income tax offset, removing Family Tax Benefit B (while substantially lifting Family Tax Benefit A), and making changes to JobSeeker and the parenting payment.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/lisa-wilkinson-and-peter-fitzsimons-list-sydney-home-for-sale-for-23m-20250815-p5mn6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lisa Wilkinson and Peter FitzSimons list Sydney home for sale for $23m",
        "publish_date": "Fri, 15 Aug 2025 11:46:50 +1000",
        "category": "finance",
        "authors": [
            "Tawar Razaghi"
        ],
        "text": "Sydney media power couple Lisa Wilkinson and her husband Peter FitzSimons have listed their long-time family home in Cremorne with a $23 million price guide.\n\nThe pair has called the lower north shore residence home for almost 30 years after they purchased the landmark property in 1998 for $2.95 million.\n\nThe lower north shore home is for sale. Credit:\n\nBuilt circa 1903, Ingleneuk is on the market for only the third time in its 122-year history.\n\nSet on 3214 square metres, the Federation-architecture home has panoramic views of the harbour and city skyline.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nathan-cleary-has-the-first-whinge-of-his-career-it-s-part-of-a-grand-plan-20250815-p5mn6c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nathan Cleary has the first whinge of his career. It’s part of a grand plan",
        "publish_date": "Fri, 15 Aug 2025 11:41:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "More publicly, the searing spotlight on trainer Corey Bocking’s ill-fated run in front of Jayden Campbell’s conversion shot raised hackles out west. Ivan Cleary noted the NRL’s five-match ban for Bocking and the club’s $50,000 fine was longer than any suspension stemming from an on-field incident this year. “Ostracised” was how he described Bocking’s fate. Back-rower Luke Garner pointed to “tall poppy syndrome” at play in the saga, an element which has no doubt played a part in previous distaste with Penrith’s winning ways. Cleary’s call for a rule change when asked about rugby league’s latest 24-hour outrage - attacking players being tackled in the air - left Craig Bellamy unimpressed during the week.\n\nThat to and fro was all about Xavier Coates’ dominance in the air. Penrith wants it shut down, and Melbourne needs to keep it. As Grant defended his milking of the game-changing penalty by running into Moses Leota, he suggested Penrith might want to look at their previous field goal set-ups and the presence of illegal blockers in front of Cleary. Master of motivation: Panthers coach Ivan Cleary. Credit: Getty Images An ‘us against them’ undercurrent serves especially well in the combative, collision-based world of rugby league, and the Panthers have worked it as well as any throughout their dynasty. Potshots at their perceived arrogance have been worn as a badge by players in previous years, and returned in the best way possible - by being too damn good.\n\nThis year’s run up the premiership mountain is new territory, but their 2021 title bore on and off-field hallmarks to this season as well. Trainer Pete Green was banned during the finals for stopping play at a critical point against Parramatta to attend to an injured Mitch Kenny. That, and four other incidents involving trainers in the past five years, contributed significantly to Bocking’s punishment. When will Isaah Yeo return from injury? Penrith aren’t telling. Credit: Getty Images Penrith were a walking wounded bunch that year, and famously kept broken feet and digits, ruptured tendons and torn muscles all in-house - only revealing after their grand final win that Dylan Edwards, James Fisher-Harris, Moses Leota and Brian To’o had no right to be playing, let alone winning a title. As the most important forward in the game in terms of his team’s attacking blueprint, skipper Isaah Yeo’s return from a shoulder injury holds the key to Penrith’s premiership tilt.\n\nFormer players who have had their shoulders shoved the wrong way wince and tell you Yeo’s awkward fall against the Titans could be worse than the Panthers are letting on. Little is being given away by the premiers on their talismanic lock, though To’o told reporters this week that the thought of Yeo being in pain was making him emotional, so please stop asking. Against a Storm side without Jahrome Hughes, Ryan Papenhuyzen, and Nelson Asofa-Solomona, Penrith’s line speed was rapid throughout the first half and suffocated the NRL’s most dangerous attacking side. To think both sides went 13 minutes without a stoppage after halftime is unheard of in the modern game - a four or five-minute stretch is enough to gas most teams. To think Melbourne prevailed in that exchange, courtesy of a pass Blaize Talagi shouldn’t have thrown for Xavier Coates’ intercept, was a significant fillip for the southern side.\n\nAlmost 12 months ago to the day, Melbourne came away from Penrith with a critical late-season win where Cleary was injured and To’o was successfully targeted under the high ball. By grand final day, the Panthers had recalibrated, worked out how to protect To’o against the high-flying Coates and outlasted their way to yet another title. Loading As Roy Masters noted in a lengthy profile of Ivan Cleary earlier this year, young Storm players were shocked at the sprays they copped from Sunia Turuva and Liam Martin, among others, after each try Penrith scored that night. Cleary made no apologies for the sledging, telling Masters that “we learnt a lot from the 2020 grand final (against Melbourne), including a lot of stuff that happened off the ball.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/i-don-t-want-to-be-remembered-pep-guardiola-on-man-city-his-legacy-and-ange-20250813-p5mmlf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I don’t want to be remembered’: Pep Guardiola on Man City, his legacy and Ange",
        "publish_date": "Fri, 15 Aug 2025 11:39:50 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "There’s no reason why they shouldn’t be up there in the title race, snapping back into contention like a rubber band. Though it will be different without the great Kevin De Bruyne, they have retooled on the transfer market, splashing out more than $320 million on the likes of French international Rayan Cherki and Dutch midfielder Tijjani Reijnders. But their rivals have spent big, too, as Guardiola gleefully (and slightly combatively) points out. “Finally, it’s not [only] Man City spending money, right?” he says. “It’s good. It’s normal. That is what’s allowed.” This is the beginning of the end for Guardiola, at least at this club. He signed a new two-year contract in November, which keeps him tied to City through to the 2026-27 season, and says it will be his last one with them. It wouldn’t be surprising, should they win the title this season, if he walks off into the sunset a year early. There were times last season when the pressures of top-level management had him in a permanent state of what kids these days call ‘headloss’. As the defeats piled up, so too did genuine concern for Guardiola’s mental well-being. After blowing a 3-0 lead over Feyenoord in the UEFA Champions League, he presented to his post-match interviews with scratches on his face, some of which had drawn blood, and joked that it was self-harm. He struggled to sleep or digest food properly, and spoke about his struggles with stress, anxiety and loneliness – a timely reminder that beneath the brilliance, he’s still just another human.\n\nPep Guardiola’s scratched face said it all last season. Credit: Twitter But Guardiola seems to have successfully recharged his batteries. His off-season break was short because of the FIFA Club World Cup, where City were knocked out in the round of 16 by Saudi club Al Hilal – although he believes the “foundation” for future success was laid at that tournament. “After that, I went to Barcelona with my family,” he says. “And basically I eat, drink, and slept. That’s what I’ve done. And I came [back] with four or five kilos more. I try to make a diet, reduce my kilos. That is our plan.” In a long interview with GQ earlier this month, timed to promote a clinic he has opened with a therapist in Barcelona that specialises in “longevity and personalised medicine”, Guardiola confirmed his intention to take a break from football when he’s done with City, of anywhere between one to 15 years, to focus on himself for once.\n\nThe grind of modern-day coaching is proving relentless to the point where the big dogs risk total burnout unless they take a longer sabbatical at some point. Ange Postecoglou is living his best life in Greece, eating prime steak off the knives of TikTok celebrity chefs, making the most of his first substantial period of downtime in over a decade. An exhausted Jurgen Klopp acknowledged that he was “running out of energy” – so he stepped down as Liverpool boss last year and travelled the world on a cruise ship, washing up in Adelaide of all places. That’s something Guardiola would like to do, but he’s more of a Melbourne guy. “I’ve been in Melbourne years ago with my family for five days, six days. And I would love it,” he says. “Maybe Australian Open ... I would travel a lot, I’m pretty sure of that. And I would love to spend not just a few days, [but] a month. That’s what I mean I take care of myself. I would take care of my body, but my mind ... to travel to places I’ve not been. That is the way, right? Everyone in the sofa at home, watching Instagram – it doesn’t make you better.” Pep Guardiola and Ange Postecoglou share a joke. Credit: Getty Perhaps there’ll be time then, when he’s not working, for a quiet beer with Postecoglou, a sort of kindred spirit, someone Guardiola once described as a person who “makes football a better place” – high praise, from one of the highest imaginable sources.\n\nGuardiola is famously effusive in his compliments for rival managers, but he does not seem to be laying it on thick when it comes to the former Tottenham Hotspur coach, whose commitment to attacking football and deft handling of the media he admires greatly. He said the two of them had exchanged messages about catching up over dinner and a bottle of good red wine from Australia. “The way he plays, alongside the amount of titles he won ... always try to attack, always be positive,” he says. “When you find two teams that want to score goals and attack, it’s a beautiful game. I’m pretty sure that the new generation of managers, they are more courageous. Before, they said, ‘Oh, we’re going to play against [Sergio] Agüero, Man City. I’m going to defend, defend.’ Now, no, it doesn’t matter. ‘I don’t care. I go to try to win.’ And when this happens, football is nice. And I think always his teams have [had] that courage to do it.” Pep Guardiola was the mastermind of arguably the greatest team in football history at Barcelona. Credit: Getty Guardiola stopped short of weighing in on Spurs’ decision to sack Postecoglou, but suggested he wouldn’t be surprised if he ends up back in the Premier League with another club.\n\n“What happened in Spurs, the injuries they had and the situation, I don’t know, because I’ve not been there,” he says. “At the end, OK, it was not a good season, I would say. Right? But at the end, they won [their first] silverware for many, many, years. And maybe that helps to break that barrier that is not winning the title. Maybe it will help in the future for Spurs, mentally-wise, for everyone. I’m pretty sure he leaves something for the club, for the players, for the future ... a big legacy.” That word – legacy – comes up a lot when people talk about Guardiola. After more two decades of bending football to his will, his legacy will be the stuff of history books. So how does he feel about the way he has inspired a generation of coaches around the world, Postecoglou included, with the magical teams he has put together? Surprisingly blasé.\n\nHe says he doesn’t really care if people consider him a genius, or if cynics say that he’s mainly successful because of the money he’s been able to spend and the calibre of players at his disposal. He is “more than grateful” for what the game has allowed him to experience – and he still wants more, or else he wouldn’t be there – but he does not seem to think his work will live on in any meaningful way. “I don’t care. Don’t remember me,” Guardiola says. “Because when we die, when I am out of football, after one, two, three days, I will be forgotten. In our life, our familiars, [when] they pass away, we are so sad. [But after] one day, two days, three days, one week ... [we] have good memories, we smile, and we continue. We live. Football is the same. I’m here, I will remember that we managed Man City – but I leave, it’s over. It’s gone. Another [coach] is coming. And I’m over. Everyone is replaceable. Pep Guardiola with the 2023-24 Premier League trophy. Credit: Getty “So, the people saying, I want a [legacy] for the history: bullshit. I want to live my history. I want to be happy living. I don’t want to be remembered, in good and bad. So if people say nice things, it’s fine. People don’t say, it’s fine too.”\n\nGuardiola insists he is a “much, much better” manager today than he was in 2009, when he guided Barcelona to a then-unprecedented sextuple of trophies. He has collected more than 40 major titles throughout his career, but that is not how he defines himself or where he derives his happiness from. Accolades aren’t what make him feel special; the same ideas, work ethic and methods that delivered those successes were there last season, when nothing was won. Loading “My curriculum vitae is so good,” he says. “I was so happy doing that. But it [hasn’t] changed me. Still, I have fear to lose a game. I don’t pay my attention for the compliments ... there are many reasons, not just me. I’ve been at three huge clubs. Huge: Barcelona, Bayern Munich, Man City. Good resources in the academies and the money spending to buy incredible top players, incredible top facilities. I put [the credit for] that with everyone.” What matters to Guardiola is seeing his team improve - a training session that clicks, a tactical tweak that works, the gradual progress from one match to the next. The process of pursuing excellence together, and the memories made along the way.\n\n“That motivates me. That is my job. This is what I like,” he says. Loading “When I remember all the incredible players that we had for many, many years, always I remember their huge smile. The memories that belong to us, that we have with us, will stay forever. It has been so nice. Even the bad moments – the disappointments in the last minutes or the titles that we didn’t win for many reasons - always belong to us.” Trophies, he says, are fleeting, and their absence doesn’t diminish the work. “If we win, incredible. If we don’t, we try again. [If] the boss will say, ‘You don’t win? I sack you.’ OK, it’s fine. We’ll find another job, maybe. Or maybe not,” he says. “I want to live my life, and be satisfied as much as possible. And the rest, believe me, is not important.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/i-still-love-sex-menopause-desire-and-finding-fulfilment-in-midlife-20250709-p5mdql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I still love sex’: Menopause, desire and finding fulfilment in midlife",
        "publish_date": "Fri, 15 Aug 2025 11:33:47 +1000",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "Loading However, Davis says the idea of changing testosterone levels during menopause, often attributed to changes in libido, is a “widespread misconception”. “Testosterone blood levels do not change at menopause, they change with age,” she says. “If there are changes in sexual function, they are either related to women feeling horrible because of all the symptoms, or because of the change in oestrogen and that having effects in the brain.” Does libido decrease with age?\n\nToday, more conversations around ageing, menopause and sex are being had, in part fuelled by popular and celebrity culture. Miranda July’s 2024 novel All Fours followed a perimenopausal woman who embarks on an extramarital affair. Gillian Anderson has opened up about a “whole new world of pleasure” after menopause, while earlier this month, 50-year-old Charlize Theron spoke about finding greater sexual freedom in her 40s and dating much younger men. From left: Writer Miranda July’s 2024 novel All Fours explored perimenopause and sex; Charlize Theron has spoken openly about dating in midlife, and Gillian Anderson says menopause has opened up a “whole new world of pleasure”. Credit: Getty Images; AP A landmark study from 2007 found that while sexual activity tends to decrease with age, libido does not. Clinical psychosexual therapist Jacqueline Hellyer believes the idea of sexual decline with age is a myth, and that it’s impossible to paint all humans with the same brush.\n\n“You can’t really say how it [menopause] is going to affect people. Like pregnancy, some women don’t have sex at all, and for others it’s the horniest time of their life. It’s really, really varied.” Hellyer thinks the reason some women may experience low libido during and after menopause has more to do with social rather than physiological conditions. “When you think about what women are experiencing in our culture once they’re getting into their late 40s and 50s, it’s normally a time of enormous pressure,” she says. “You’ve got teenagers, you’re peaking in your career, you still owe money on your mortgage. There can be an awful lot of stress there.” In her two decades of working with couples, Hellyer finds it’s often men, not women, who tend to lose interest in sex with age.\n\n‘When you think about what women are experiencing in our culture once they’re getting into their late 40s and 50s, it’s normally a time of enormous pressure.’ Clinical psychosexual therapist Jacqueline Hellyer Mok, who went through menopause at 42, is now in a happy relationship. The director of the Yeah the Girls 40 Plus community, she says sex has only got better with age. “I still love sex,” she says, attributing a healthy post-menopause sex life to the effort she and her partner put into their relationship. “A lot of women at our age, they’re just too tired, too frustrated, constantly asking for things that they don’t see returned, and they lose that fun in them. And that’s why it’s affecting their sex life and intimacy,” she says. “That is one of the biggest things in my current relationship. We constantly remind each other of the love we have and the fun we had when we met.”\n\nLoading Davis says that “sexual self-image is really important for women” and, for some, physical changes that come with menopause and ageing can be difficult. Trisha Avery, a business performance coach from Melbourne, went through clinical menopause in her 30s following a hysterectomy. While she says the procedure, a relatively rare one at the time, was traumatic, it did little to affect her libido. “I was young, and because my frame of reference wasn’t necessarily that I was needing to be sexually inactive or had lost my sensuality, it really didn’t matter at that time,” she says.\n\nNow in her 60s, Avery, who is single, continues to enjoy an active sex life. But she says her understanding of sexuality has evolved with age. “I would have talked about myself as sexual when I was younger. I never use that term any more. I like to talk about myself as a sensual being, as well as many other things,” she says. “Once past menopause, the sensuality of your body, of your ability to find ways of creating feelings of pleasure and having an orgasm, masturbating, being with somebody, is different.” For Avery, sensuality over sexuality can mean exploring different forms of intimacy. “You’re just not as athletic as you used to be. And also because of things like vaginal dryness and the differences in men in terms of their capacity to maintain erections and other things, it’s a slower build, if you like. There are more important things than penetrative sex,” she says.\n\nTrisha Avery underwent a radical hysterectomy in her 30s, triggering clinical menopause. Now in her 60s, she’s more comfortable in her body than ever before. Credit: Simon Schluter Fostering wellbeing A small but growing body of research is looking at the importance of sex not just for pleasure but wellbeing. Some studies suggest sex or masturbation can mitigate symptoms of menopause. The findings of a 2025 study of Japanese women, published in Menopause, revealed an association between regular sexual activity and a lower prevalence of genitourinary symptoms during menopause like vulvar pain, dryness and arousal.\n\nSimilarly, in a 2024 survey from The Kinsey Institute funded by sexual wellness company Lovehoney, 36.2 per cent of menopausal women reported experiencing improved symptoms through masturbation. But Davis warns such studies were not able to show a causative relationship, or the direction of the relationship. “You’d have to do a double-blind, randomised trial to prove this,” she says. Still, Davis says sexual dissatisfaction has been associated with lower wellbeing in women. For Mok, a fulfilling sex life and happy relationship has been key to alleviating many of the transition’s most uncomfortable symptoms.\n\n“Before I met Malcolm I had really bad mood swings and hot flushes … but after, these symptoms went away, because I’m happy. We have a really good relationship. We communicate, we support each other, and my symptoms really went down.” Mok thinks the dopamine release she gets from cuddling, kissing and sex play a role in this, too. Dr Suzanne Belton, a medical anthropologist at Flinders University with a research interest in sexual and reproductive health, points out the medical approach to menopause and sex tends to stop at making intimacy more comfortable. “This is basically the discourse I hear when I read the medical stuff, which is, ‘if we can make it less painful for you, maybe you’ll want to do it [have sex]’. That’s the bare minimum. Actually, what we would really like is to have orgasms at the same rate as blokes: sexual equality.” How to have better sex during and after menopause\n\nFor some people, medical treatments (such as hormone replacement therapies, including vaginal oestrogen) can help alleviate symptoms that affect sexual function, says Davis. But there is no one-size-fits-all approach. “If you’re getting hot flushes, no sleep and low mood and vaginal dryness, go and talk to a doctor and get your symptoms treated because if you’re feeling like rubbish you won’t feel like sex,” she says. Testosterone therapy can also be useful for those for whom oestrogen therapy is not effective, says Davis. Finally, Davis encourages having open conversations with your partner about the changes you’re experiencing. Loading\n\n“What can go wrong here is that the woman is feeling terrible, experiencing symptoms, and doesn’t explain that their withdrawal from sex is not related to their lack of affection for their partner … A lot of relationships fall apart because the partner feels rejected.” Hellyer recommends moving towards a “responsive type of arousal”, rather than waiting until the mood strikes, which she thinks happens less as we age Finding time to create intimacy, rather than focusing on the act of sex itself, can remove pressure from the situation. “We should be focusing on the conditions that couples need in order to feel that level of connection with each other,” she says. National Sexual Assault, Domestic Family Violence Counselling Service 1800RESPECT",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/epl-predictions-the-premier-league-is-back-you-pick-the-winners-20250813-p5mmml.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "EPL predictions: The Premier League is back – you pick the winners",
        "publish_date": "Fri, 15 Aug 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp",
            "Mark Stehle"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nAnother season, another field of unknown quantities. Not many would have predicted Liverpool as champions a year ago, nor that Manchester United and Tottenham would finish 15th and 17th. Now here we are again, with new variables thanks partly to a lot of transfer fun.\n\nThe curtain rises at Anfield, where Arne Slot’s Liverpool host Bournemouth in a bid to get their title defence off to a positive start. How quickly can the Reds’ influx of new arrivals gel, and were pre-season defensive vulnerabilities just a blip on the radar?\n\nSimilar questions follow Manchester City into their first fixture away to Wolves, after an underwhelming 2024-25 left Pep Guardiola’s four-time champions third and 13 points adrift from the top.\n\nMeanwhile, at Stamford Bridge, Club World Cup success has rebuilt ambitions for a stacked Chelsea just in time for a potential goal-fest with London neighbours Crystal Palace.\n\nBut the game of the round has to be United v Arsenal. The Red Devils are under pressure to remedy an embarrassing campaign, and have a shot at a fresh start under newish manager Ruben Amorim. Of course, the result at Old Trafford depends on whether his Arsenal counterpart Mikel Arteta has the right ingredients to return his runners-up to the glory days.\n\nMake your predictions below, and see how others are tipping, too.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/the-sad-beckhams-split-is-a-reminder-to-be-a-cheer-squad-not-a-jury-20250814-p5mmzu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sad Beckhams split is a reminder to be a cheer squad not a jury",
        "publish_date": "Fri, 15 Aug 2025 11:17:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "The first girlfriend to meet our family was like a 1980s Dolly cover girl, improbably chocolate box pretty, with a smile that stretched for days, mild anxiety and a habit of dropping used tissues.\n\nShe reminded me of girls I wasn’t friends with at school — jealousy of that eastern suburbs polish and “I am destined for a rich husband” vibe makes me judgey — but from the get-go I decided the way forward was to love everyone my kids did. I’d be a cheer squad, not a jury.\n\nBrooklyn Beckham and Nicola Peltz at the Burberry winter 2025 show at the Tate Britain. Credit: Dave Benett\n\nThat girlfriend came on holidays, to a family wedding, is with us forever in school formal photos. But not with us in actuality. She was a teenage dream who flamed out. I do still have her Country Road beach towel. I lied about it being lost on the Gold Coast trip because I liked that we could keep a tangible piece of her for summers and summers.\n\nSince then, other gorgeous people have been folded into our family via romance with my kids. It’s been easy to give open arms and heart. They’ve all brought something wonderful, from Steph’s morphing of farm girl practicality with urban interior design cool to the firecracker who ran laughing into winter seas, the smart cookie armed with dog toys and Sarah’s unnerving calm and fantastic salsa moves.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/raducanu-complains-about-crying-child-20250812-p5mmaq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Raducanu complains about crying child",
        "publish_date": "Fri, 15 Aug 2025 10:57:43 +1000",
        "category": "finance",
        "authors": [],
        "text": "Raducanu complains about crying child\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/disgusted-blow-over-rsl-shirts-013728997.html",
        "title": "‘Disgusted’: Blow-up over RSL shirt ban",
        "publish_date": "2025-08-15T01:43:34Z",
        "category": "sports",
        "authors": [
            "Duncan Evans"
        ],
        "text": "There is confusion over whether the Wagga Wagga RSL has banned shirts bearing the phrase Lest We Forget. Picture: 7News\n\nA bizarre blow-up over Lest We Forget shirts has hit RSL Australia.\n\nMembers of the Wagga Wagga RSL claim a club representative instructed them to ditch their shirts, which sport a blue military design and bear the phrase Lest We Forget, claiming the phrase was trademarked by the RSL.\n\nDavid Ashford, speaking with 2GB on Friday morning, said he and his bowling friends had been told they “couldn’t wear the shirts or we might have to leave”.\n\n“If we wear our shirts, we are not allowed to bowl,” he said.\n\nThe blue shirts bear the phrase Lest We Forget. Picture: 7News\n\nHe said he and his fellow club members were “disgusted” by the alleged ban.\n\n“We wore it last Anzac Day and nobody said anything,” he said.\n\nADVERTISEMENT\n\nBut it is not clear if there is a ban in place.\n\nIn a statement released to 2GB and read out on air by Ben Fordham, RSL Australia said it had not placed any restrictions on the shirts.\n\nLawn bowler David Ashford said he was ‘disgusted’ by the alleged ban. Picture: 7News\n\n“This is the first time RSL Australia has been made aware of this matter,” the RSL said.\n\n“And the RSL has not placed any restrictions on its use by the Wagga Wagga RSL club.”\n\nFordham suggested someone might be “telling lies” at the club.\n\n“It may well be a trademark, but they are not enforcing it,” he said.\n\n“It sounds like someone is telling lies at the Wagga RSL Bowling Club.\n\n“My advice to those involved, just keep on wearing the shirts.”",
        "source": "Yahoo"
    }
]