[
    {
        "url": "https://www.9news.com.au/national/prime-minister-anthony-albanese-in-china-updates/82c02eb0-147f-4ef2-b96b-8754cde5081d",
        "title": "'Tough' talk looming for Albanese and Xi Jinping during PM's China visit",
        "publish_date": "Sat, 12 Jul 2025 22:49:53 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Anthony Albanese has touched down in Shanghai to kick off a week-long diplomatic visit to China, where the prime minister hopes to strengthen ties with Australia's biggest trading partner.\n\nThe agenda of the PM's second official China trip will include a sit-down with President Xi Jinping and spruiking a new advertising campaign to lure Chinese visitors Down Under.\n\nAlbanese is scheduled to meet Xi later in the week in Beijing.\n\nPrime Minister Anthony Albanese and fiance Jodie Haydon arrive in Shaghai. (Dominic Lorrimer)\n\nAlongside tourism and sporting ties with China, regional security and the volatile US market is expected to be on the agenda.\n\nNationals leader David Littleproud told Today he hoped Albanese was ready to broach the \"tough\" topics with ﻿the president while in China.\n\nForeign Minister Penny Wong earlier raised issues with her Chinese counterpart about the People's Liberation Army (Navy) flotilla of warships that circumnavigated Australia earlier in the year and carried out live-fire exercises in the Tasman Sea.\n\nThis is anticipated to be a key subject of conversation between Albanese and Xi.\n\n\"It's important that he's prepared to have the tough conversations when you've got his foreign minister raising the alarm bell about the strategic threat that China poses to Australia,\" Littleproud said.\n\n\"You have to be able to be prepared to have those conversations.\"\n\nAlongside tourism and sporting ties with China, regional security and the volatile US market is expected to be on the agenda. (Dominic Lorrimer)\n\nThe federal government is hoping to bring thousands more Chinese tourists to Australia, where visitor numbers have failed﻿ to return to pre-pandemic levels.\n\nA new tourism advertisement is set to be released as part of Tourism Australia's \"Come and Say G'day\" campaign.\n\nThe PM will preside over a new agreement between Tourism Australia and Trip.com during his stay in China.\n\n\"It's a great honour to represent Australia in international forums and this is an important engagement we will have here,\" Albanese said upon arrival in Shanghai.\n\n\"The fact that I'm leading a large business delegation speaks to the importance of the economic relationship between Australia and China.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/gst-why-are-there-calls-to-change-it-australia-tax-system-explained/90b4e02e-8aec-4a15-8727-e2ba31209a98",
        "title": "Why experts want to raise one of Australia's least popular taxes",
        "publish_date": "Sat, 12 Jul 2025 20:06:23 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "T﻿o most people, $80 billion is an extraordinary amount of money. Where the GST is concerned, though, experts say it's not enough.\n\nThe decision by the Howard government to introduce the goods and services tax was an unpopular one 25 years ago, and it's little surp﻿rise politicians today are keen to avoid talking about raising it from its current 10 per cent.\n\nHowever, that's exactly what economists say needs to happen . This is why.\n\nEconomists are calling for the GST to be overhauled. (AFR Louie Douvis)\n\nWhy are there calls to change the GST?\n\nThe federal budget is in a structural deficit and desperately needs more revenue.\n\nAt the same time, government coffers are overly reliant on individual income tax, which accounts for more than half of all taxation revenue, and Treasurer Jim Chalmers has spoken about wanting to reduce tax strain on personal earnings.\n\nIf the government wants to reduce income tax, it doesn't have many options to replace that revenue, much less to do so while returning the budget to surplus.\n\nWinding back negative gearing and capital gains concessions have been ruled out, and a carbon tax – something proposed by former Treasury secretary Ken Henry – has proven political suicide in the past.\n\nAt the same time, consumption taxes like the GST cause very little economic damage compared to other options like excises and stamp duties.\n\n\"The GST and taxes like it are a much more efficient way of raising revenue,\" Professor Richard Holden from the University of NSW told 9News last week.\n\n\"They create less distortions, they do less damage to productivity and the economy.\"\n\nAgainst the backdrop of this economic picture is the government's upcoming productivity roundtable.\n\nTo be held next month, Chalmers flagged in a Press Club speech that the roundtable could pave the way for a much-needed overhaul of the tax system ﻿– a speech that was quite quickly followed by calls to reform the GST.\n\nJim Chalmers said the government's productivity roundtable could lead to tax overhaul. (Rohan Thomson)\n\nHow does Australia's GST compare to the rest of the world?\n\nWhile there's a perception among Australians that ours is a high-taxing nation, the truth is taxes here are quite low compared to the rest of the world .\n\nThe GST is no exception.\n\nWhile the United States doesn't have a federal consumption tax (it instead has state-based sales taxes) and Canada has a lower rate of 5 per cent, Australia's 10 per cent GST is on the lower end of the global scale.\n\nIt's on par with the consumption taxes levelled in Japan and South Korea, but short of the GST in New Zealand (15 per cent) and of comparative value added taxes (VATs) in the likes of Germany (19 per cent), the United Kingdom (20 per cent) and Ireland (23 per cent).\n\nIt's also below the OECD average of 19.4 per cent.\n\nLittle surprise, then, that the amount of consumption tax Australia collects as a proportion of total revenue is far less than the global average.\n\nWhat could a change look like?\n\nExactly what a﻿ reformed GST could look like differs from economist to economist, but a common suggestion has been raising it to 15 per cent.\n\nThat's what Holden's proposal is, while at the same time cutting personal income tax and giving every worker a $12,500 GST-free threshold to make sure low earners are better off.\n\nThe point about shielding low-income earners from any ill effects of a GST increase has been made by several economists.\n\n﻿\"The GST is one of the most effective ways to tax those on higher incomes, but it affects lower-income earners more,\" Dr Venkat Narayanan from RMIT University said.\n\n\"Why not talk about a 10.5 per cent GST for the next few years and increase it by 0.5 per cent until we get to 15, rather than just straight to a higher percentage?\n\n\"Any reform should consider income taxation... so that any increases to the GST do not disproportionately affect low-income earners.\"\n\nSome measures have been proposed to shield low-income earners from the negative effects of a GST overhaul. (Luis Enrique Ascui/The Age)\n\nAnother option flagged by think tank the Australia Institute, which has found the government has so far collected $231 billion less in GST than what was originally intended, is broadening the tax to remove some exemptions.\n\n\"Higher-income households don't have to pay GST on private schools and private health and can find other ways of avoiding the tax,\" executive director Richard Denniss said.\n\n\"On the other hand, lower-income households are spending more on rent and mortgages, which means they have less money to spend on the things that would generate GST revenue.\n\n\"If the Australian government wants to fill this tax blackhole without hurting low-income households, it could broaden the GST so that it applies to private school fees and private health insurance.﻿\"\n\nSo will the government actually increase the GST﻿?\n\nProbably not.\n\n\"I think often an increase in the GST is spent three or four times over by the time people are finished with all of the things that they want to do with it,\" Chalmers said when taking questions following his Press Club address.\n\nAnd while the treasurer also called ﻿to an end to what he called the \"rule-in, rule-out game\", Prime Minister Anthony Albanese couldn't help himself last week.\n\n\"Consumption taxes by definition are regressive in their nature, so that's something that doesn't fit with the agenda,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/temporary-skills-shortage-visa-changes-could-see-caitlin-deported/703e3977-d0d2-4b61-8a95-3f0653832c62",
        "title": "Caitlin is facing deportation over two weeks of missed work",
        "publish_date": "Sat, 12 Jul 2025 00:03:34 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Exclusive: Scottish expat Caitlin Fraser wanted to spend the rest of her life in Australia.\n\nNow she's facing deportation over two weeks of missed work that could make her ineligible for permanent residency.\n\n\"I'm not sleeping at the moment out of fear, I don't know what's going to happen,\" she told 9news.com.au.\n\nREAD MORE: The faces of the Texas flood tragedy\n\nCaitlin Fraser moved to Australia in 2019 and fell in love with this sunburnt country. (GoFundMe)\n\n\"I've been here for six years, all my family are here, and I have a house and a dog.﻿ I have nowhere to go.\"\n\n﻿The 31-year-old moved to Australia in 2019 on a Working Holiday Maker (WHM) visa, then applied for a ﻿﻿Temporary Skills Shortage (TSS) visa in 2023.\n\nIt ﻿would allow her to live and work in Australia for up to two years, after which time she'd apply for a Temporary Residence Transition (TRT) Visa to become a permanent resident.\n\nA migration agent told her it was ﻿a \"clear pathway\" to permanent residency\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nTSS visas are employer sponsored, so Fraser found a small business in Sydney that agreed to sponsor her as a restaurant manager.\n\nAt the time, it was an eligible occupation for that visa.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nWith the business sponsoring her and the help of a professional migration lawyer, Fraser applied for and was granted a TSS visa in September 2023.\n\nShe moved from Ballarat to Sydney and started work two weeks later.\n\n﻿To be eligible for a TRT visa and permanent residency, Fraser would have to work ﻿for the same employer for two full years.\n\nShe knew her existing TSS visa would expire two weeks shy of that milestone but there was no ﻿limit on how many times she could apply for a TSS visa while in Australia, so Fraser simply planned to apply for a second TSS visa to cover the extra time.\n\nThat plan went up in flames this year.\n\nCaitlin Fraser will miss out on meeting the full time employment requirements to apply for permanent residency by two weeks. (Supplied)\n\nIn May, Fraser received a devastating call from her migration agent.﻿\n\nThey explained that changes to Australia's visas ﻿meant Fraser was no longer allowed to renew her visa, nor would she be eligible to apply for a TRT visa by the time it expired.\n\nSuddenly, she was facing the very real possibility of deportation.﻿\n\nIn December 2024, the TSS visa was replaced by the Skills in Demand (SID) visa.\n\nPeople who had already been granted TSS visas would be allowed to stay in Australia until the visa's expiry date but they would not be allowed to renew.\n\nSome could apply for SID visas – but not Fraser, as restaurant manager is not on the list of eligible occupations.\n\n“Whilst the occupation of Café or Restaurant Manager was previously available for nomination for a Temporary Skills Shortage (TSS) visa, the occupation has not been included on the Core Skills Occupation List (CSOL) and is therefore ineligible for nomination for a SID visa,” a Department of Home Affairs spokesperson told 9news.\n\nIt means she will have to leave the country when her current visa expires, just two weeks shy of completing the two years of fulltime work required to apply for a TRT visa.\n\nOf the employment requirements for a TRT visa, the Department spokesperson said “applicants are required to demonstrate they have worked in eligible sponsored employment for at least two out of the last three years while holding a 457 [Temporary Work (Skilled) visa] or 482 [formerly TSS, now SID] visa”.\n\nFraser is frustrated that changes made to the TSS visa long after she was approved have now made her ineligible for permanent residency.\n\n\"The injustice is insane,\" she said.\n\n\"This should be for new people applying, not for someone who's at the end of the visa. This isn't what I paid for.\"\n\nScottish expat Caitlin Fraser has already spent tens of thousands of dollars on visas to live and work in Australia. (Supplied)\n\nFraser paid $14,000 to secure her existing visa﻿ with the help of an immigration lawyer.\n\nShe's now working with them in the hopes of finding a solution that will allow her to legally work ﻿in Australia for the extra two weeks she need to be eligible for a TRT visa.\n\nIf and when she is able to apply for that visa, she will be granted a bridging visa that will cover her ﻿while it is processed.\n\nBut Fraser fears she won't make it that far.\n\n﻿Even if she finds a way to legally work the extra two weeks, she may not be able to afford to apply for permanent residency.\n\nApplying for a TRT visa costs upwards of $4900 and Fraser has been quoted $9000 in additional fees from her immigration lawyer.\n\nShe's still paying off the $14,000 from her TSS visa and had hoped that renewing it would give her more time to save money for the TRT application.﻿\n\n\"I live week to week, I'm on the minimum that they can give me, and I live in Sydney which is the most expensive city in the world,\" she said.\n\nThe suburbs Australia's richest people call home View Gallery\n\nApplying without the assistance of an immigration lawyer to save money isn't an option either.\n\n\"It's impossible for me alone to do the application in eight weeks. It's a massive process, even the migration officers are going to find it hard to do it in that time,\" Fraser said.\n\nFraser's family have started an online crowdfunding campaign ﻿to help cover the costs.\n\nIf she's unable to secure or pay for a new visa before her TSS visa expires, she'll be forced to leave Australia on September 14.\n\nWith no savings and no family back in Scotland, Fraser doesn't know where she'll go if that comes to pass.\n\nShe fears she won't be the only one forced out of the country due to changes to the old TSS visa.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/west-indies-australia-third-test-quick-hits-day-one/105525946",
        "title": "Five quick hits: Lyon left out in 12-year first as Windies 'keeper wows",
        "publish_date": "Sun, 13 Jul 2025 02:22:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nathan Lyon is left out of Australia's Test XI for the first time since 2013 as West Indies wicketkeeper Shai Hope takes a stunning catch.\n\nHere are the quick hits from the day-night Test in Jamaica.\n\n1. Side-Lyoned\n\nLyon was a suprise omission from Australia's XI for the pink ball Test. (AP: Ricardo Mazalan)\n\nNathan Lyon was dropped on two tours in 2013 — in India and England — but since then the off-spinner has been one of the first names on the Australian team sheet as he has climbed to seventh among all Test wicket-takers.\n\nHe is sitting on 562, third among Australians and one behind Glenn McGrath, but will have to wait until this summer's Ashes to try to claim second place after he was left out of the team for the third Test in Jamaica.\n\nPat Cummins and selectors opted for an all-pace attack with the pink ball under lights at Sabina Park, with Scott Boland coming in for his first Test since January.\n\nA calf injury sidelined him for three games in 2023, but this marked the first time in 12 years that a fully fit Lyon missed a Test since that 2013 Ashes series in England.\n\n2. Konstas gets two lives in two balls\n\nSam Konstas and Usman Khawaja looked pretty scratchy in the opening overs in Kingston.\n\nThat almost came to a head in the fifth over when Konstas clipped to square leg and took off for a single, only for Khawaja to rightly send him back.\n\nAustralia's first taste of away day-night Test cricket — as it happened Photo shows A cricket batter looks down while a bowler runs in celebration. Boasting a formidable 12-1 record in pink-ball Tests on home soil, Australia gets its first look under lights abroad, taking on the West Indies in their final Test in Jamaica.\n\nBut Konstas was already committed and could only watch as John Campbell ran around, gathered the ball and threw at the striker's stumps, just missing.\n\nNot content with being gifted a second life, Konstas then asked for and received a third when he drove at a ball outside off and got a thick edge into the slips cordon.\n\nIt flew in between debutant Kevlon Anderson and Justin Greaves, with the rookie diving and sticking his left hand out at third slip. The ball bounced out and actually hit Greaves at second slip, but it couldn't be reined in.\n\nIt was the 10th dropped catch for the West Indies in the series.\n\n3. Green reviews in the nick of time\n\nJayden Seales's appeal was affirmed, but Cameron Green's review saved him. (AP: Ricardo Mazalan)\n\nIt was a first session of grit from the Australians, who were much more focused on preservation than run-scoring.\n\nBoth in desperate need of scores, Konstas and Khawaja poked and prodded, played and missed to score just 21 in the opening hour.\n\nNot long after drinks, Konstas was caught plumb in front to Justin Greaves's very first delivery of the match.\n\nIt always looked out, but after consultation with his opening partner, he decided to send it upstairs.\n\nSure enough, three reds meant Australia had burnt a review and that might have been playing on Cam Green's mind only a matter of overs later.\n\nGiven out to one that looked much more likely to be overturned, Green waited until the very last second to ask the third umpire to have a look at it.\n\nThankfully for Green, the technology projected the delivery to be sliding down leg and the big number three was handed a life.\n\n4. Shai gives Hope with stunner\n\nKhawaja had his fair share of luck in his painstaking innings of 23 from 92 deliveries.\n\nHe gritted his teeth and stood his ground through a colourful catalogue of plays and misses, and when he finally did get an edge on an angling Shamar Joseph special, he looked destined to survive that as well.\n\nWith the ball flying towards that uncomfortable gap between wicket-keeper and first slip, West Indies WK Shai Hope made the executive decision to fling himself forward, left and to the ball.\n\nFully outstretched, Hope managed to get his weaker glove underneath the fast-falling pink Dukes and Khawaja's uncomfortable vigil was over before sundown on day one.\n\n5. Anyone got the time?\n\nSteve Smith looked unsettled under the lights after dinner. (AP: Ricardo Mazalan)\n\nSabina Park received an upgrade in order to host a day-nighter, but there wasn't much time to test all the various bits and pieces involved before the third Test.\n\nSteve Smith, the ultimate problem solver and finder, discovered a quirk of the ground as the lights took effect straight after dinner.\n\nAs he took his guard against Shamar Joseph, Smith took issue with something behind the bowler's arm, which is nothing new for him. But this time it wasn't an inattentive fan, rather an issue with the big analog clock.\n\nOne of the floodlights was causing a reflection or some glare off the clock face and distracting the Australian star.\n\nEventually, a match official, with some help from an Australian team staff member, found a massive black towel to cover up the offending timepiece and the game could finally resume.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-07-13/rain-brings-green-tinge-to-southern-nsw-but-drought-continues/105506442",
        "title": "Farmers call for financial assistance as 'green drought' takes a toll",
        "publish_date": "Sun, 13 Jul 2025 02:14:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Recent rain in southern New South Wales has put water in dams and turned dusty paddocks green, but farmers say the drought drags on, with some calling for financial assistance.\n\nAfter more than 50 millimetres of rain since the end of May at Yvette McKenzie's farm near Bethungra, about 65 kilometres north-east of Wagga Wagga, she calls the situation the \"green drought\" — the landscape looks good from a distance but grass hasn't grown enough to sustain livestock.\n\nBefore: Yvette McKenzie's dam in May 2025. . . After: And after recent rain. . . Instructions: Use left and right arrow keys to control image transition Before and after images SLIDE Yvette McKenzie's dam in May 2025. / And after recent rain.\n\nThat means Ms McKenzie and other farmers across the state's south are handfeeding livestock.\n\n\"It doesn't rain feed,\" she said.\n\n\"We are still on full grain ration for the sheep, as well as silage and hay, to keep up with the fibre\n\n\"It is hard on you mentally, physically and emotionally.\"\n\nMs McKenzie expects to be handfeeding for another two months.\n\nYvette McKenzie says she'll be handfeeding her livestock for months. ( )\n\nAccording to the Bureau of Meteorology, 40-100 millimetres of rain has fallen in the Riverina since the start of May, but most of the region is still classified as \"in drought\" or \"drought affected\" on the NSW Department of Primary Industries drought indicator map.\n\nHay prices 'through the roof'\n\nHolbrook producer Bruce Allworth is in a similar predicament, spending six hours, three times a week, feeding his sheep and cattle.\n\nHe has used all the hay stockpiled in previous seasons and has bought 600 tonnes of grain since January.\n\n\"There has been a real shortage [of hay] and we've moved over to grain, simply because the price of hay was going through the roof,\" Dr Allworth said.\n\n\"You can't get away from the fact that it's a lot of money that you're spending, the animals aren't doing as well as you'd like them to do … and so it weighs on you.\"\n\nFeeding livestock has become a daily routine for drought-affected farmers. ( )\n\nBeef producer and contract haymaker Richard Harbison worries about the mental toll the drought is taking on producers.\n\n\"The last 12 months have been pretty stressful,\" he said.\n\n\"I just hope that people can talk to them and just make sure that they are travelling alright.\"\n\nMartin Preuss says workshops have been well-attended by farmers. ( )\n\nLocal Land Services senior drought adoption officer Martin Preuss said workshops had been providing advice and much-needed social interaction for affected farmers.\n\n\"It's looking at what options they've got to try and reduce costs, maintain productivity and have a sustainable process to get through until the drought breaks,\" he said.\n\nCalls for assistance\n\nFarmers, along with the Yass Valley, Snowy Valleys and Greater Hume councils, are calling for more drought relief for producers, similar to that provided for floods or bushfires.\n\n\"This has certainly been an exceptional drought, one that we couldn't plan our way through,\" Dr Allworth said.\n\n\"It's a little bit frustrating when we've been in the same conditions as the Victorian and South Australian producers and they've been getting support.\"\n\nBruce Allworth is spending hours each day feeding grain to his cattle and sheep. ( )\n\nThe South Australian government is providing freight subsidies for charities donating hay, plus grants to upgrade farm infrastructure, including water, grain or fodder storage.\n\nThere are similar infrastructure grants in Victoria, along with rate relief and household support payments.\n\nIn a statement, NSW Agriculture Minister Tara Moriarty said flexible, low-interest loans of up to $250,000 were available to help farmers strengthen drought preparedness.\n\n\"The government is continually monitoring the situation in southern NSW to ensure the needed assistance is being offered,\" she said.\n\nMs Moriarty said $149 million in loans had been provided through the drought infrastructure fund and \"drought-ready and resilient\" fund.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/afl-eagles-jack-graham-banned-for-homophobic-slur/105526360",
        "title": "Eagles' Graham handed four-match ban for 'highly offensive' homophobic slur",
        "publish_date": "Sun, 13 Jul 2025 01:27:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "The AFL has banned West Coast Eagles player Jack Graham for four matches after he admitted to using a \"highly offensive\" homophobic slur against a GWS opponent.\n\nThe incident occurred during the round 17 match between the Eagles and Giants in Perth this month.\n\nGraham was found guilty of breaching AFL rule 2.3(a) for conduct unbecoming.\n\nHe self-reported the incident to the Eagles, who informed the AFL integrity unit on Friday.\n\nThe AFL said Graham's sanction would have been heavier had he not self-reported.\n\n\"Graham used a highly offensive homophobic slur against a GWS Giants opponent, which demeans and denigrates persons regardless of their sexuality,\" an AFL statement read.\n\n\"Graham has received a four-match sanction, with the AFL taking into account Graham's self-reporting of the incident, along with his private apology and contrition.\n\n\"Graham also rang the AFL CEO [Andrew Dillon] directly to apologise.\n\n\"He will not be eligible to play for the West Coast Eagles or any level of football for the next four weeks.\n\n\"As a part of the sanction, Graham will also undertake Pride in Sport education.\"\n\nTalking to kids about homophobic slurs in sport Photo shows A profile shot of a smiling man with close cut brunette hair and facial stubble in a leafy urban street. If your kids witness homophobic behaviour on the sporting field, it's important to talk to them about respect and inclusivity.\n\nGraham said he took responsibility for his behaviour.\n\n\"I am very remorseful for the word I used and know such language has no place in our community or our game,\" Graham said in an Eagles statement.\n\n\"I have offered my unreserved apology to the Giants player and Greater Western Sydney and would also like to publicly apologise for my comment.\n\n\"What I said does not reflect my values or our club values. I made a mistake and need to be better and will prove that through my actions going forward.\"\n\nEagles chief executive Don Pyke said the club was \"very disappointed\" by Graham's comment.\n\n\"The word Jack used is completely unacceptable and does not align with societal and club values,\" Pyke said.\n\n\"Jack understands the harmful effects comments like these can have on others and he has been honest in addressing this matter.\"\n\nAFL head of integrity and security Tony Keane said the word used by Graham was \"hurtful\".\n\n\"The AFL is very clear that homophobia has no place in our game, nor in the community,\" Keane said.\n\n\"We have come a long way as a code, but this incident demonstrates there is so much more to be done, and we will continue to work together to improve our game as a safe and inclusive environment for all.\n\n\"The AFL will continue to consider the specific circumstances in each incident in determining appropriate responses.\"\n\nABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/us-review-of-aukus-incomplete-defence-cost/105526330",
        "title": "US review of AUKUS incomplete as cost of defence boost revealed",
        "publish_date": "Sun, 13 Jul 2025 01:19:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Trump administration's review of the AUKUS partnership is unfinished as its slated deadline arrives, according to Australia's acting defence minister.\n\nPatrick Conroy told the ABC's Insiders the Australian government was \"engaging at the most senior levels\" and was optimistic the US review would endorse the military pact.\n\n\"I'm confident it will support AUKUS just as our review of AUKUS [and] the UK review found,\" he said.\n\n\"There's been lots of speculation about what the timeframe is of the review … My last information is that the review has not been completed yet.\"\n\nThe review, led by senior Pentagon official Elbridge Colby whose public statements about AUKUS have been mixed, was slated to be finished within 30 days, a timeframe reached this weekend which coincides with Anthony Albanese's visit to China.\n\nBracing for pressure on defence spending\n\nDespite the statements of confidence, the government is bracing for the likelihood that the Trump administration will press harder on Australia to lift its defence spending, as it did with European partners.\n\nThe ABC can reveal new figures laying out the colossal budget impact of agreeing to such a request.\n\nDuring the election campaign, the Parliamentary Budget Office estimated the short-term boost to defence spending needed to achieve 3 per cent of GDP by 2035, as was Coalition policy, would cost $20.6 billion over the first five years and $156.4 billion over a decade.\n\nADF watching for Chinese spy ships Photo shows An aerial photo showing a Navy ship in the open ocean, with a military jet flying overhead. As Prime Minister Anthony Albanese heads north to China for a week-long visit, Australia's defence force says it is watching for Chinese spy vessels off the Queensland and NT coastlines.\n\nThose figures, prepared in consultation with Treasury and Defence, can be extended to suggest the even larger cost of a 3.5 per cent spend of $45.2 over five years or $287.1 billion over a decade.\n\nThe government currently intends to increase defence spending to 2.3 per cent of GDP by 2035.\n\nTo get to 3.5 per cent instead, the extra funding alone would triple Australia's entire foreign aid budget by the year 2029-30.\n\nMr Conroy told the ABC the government would seek to emphasise that its aid and diplomatic spending, especially in the Pacific region, was also contributing to security.\n\n\"We're making the point to everyone that both [defence and aid spending] are incredibly important,\" he said.\n\n\"We're investing in our relationships in the region, as well as our military capability and we are increasing our defence budget significantly, $57 billion above the previous trajectory,\" he said.\n\n\"We've made it clear that if a case is made for more capability, we'll increase more. We're not going to pluck a figure out of the air and work out how to spend it. That's what the Coalition took to the election.\"\n\nMr Conroy, who is acting for Richard Marles in the defence portfolio but whose regular portfolio is defence industry, said Australia was also trying to get more value for money from defence procurement processes.\n\n\"It's a challenging area for every country around the world [and] it was problematic under the last government … We've made significant reforms to how we do defence procurement,\" he said.\n\n\"It is important that taxpayers have confidence that every single dollar goes to improving capability of the Australian Defence Force as well as supporting the 100,000 Australians who work in that industry.\"\n\n'Sovereignty' central amid reports of Taiwan request\n\nMr Conroy said Australia would not \"engage in hypotheticals\" after a report in the Financial Times that Mr Colby was also pressing both Australia and Japan to give assurances about how they would respond in the event of a war with China over Taiwan.\n\nIn a social media post following that report, Mr Colby did not address Taiwan directly but said the Pentagon had \"made abundantly and consistently clear\" it wanted allies to \"step up their defense spending and other efforts related to our collective defense.\n\n\"This has been a hallmark of President Trump's strategy in Asia as in Europe where it has already been tremendously successful,\" he said, describing the pressure on NATO allies to spend more as a \"formula\" for other regions.\n\n\"Of course, some among our allies might not welcome frank conversations. But many... are seeing the urgent need to step up and are doing so.\"\n\nMr Conroy told the ABC Australia would make its own decisions about any conflict.\n\nMarles downplays Trump review of AUKUS Photo shows two man are standing in front of a US flag and an Australian flag Australia's defence minister insists he is not concerned about the country's prospects of acquiring nuclear-powered submarines, despite the US government announcing a review of the security pact.\n\n\"The sole power to commit Australia to war or to allow our territory to be used for a conflict is the elected government of the day,\" he said.\n\n\"Sovereignty will always be prioritised and that will continue to be our position.\"\n\nOfficials have also emphasised Australia's strategic focus on deterrence and opposition to the use of force.\n\n\"We are being very clear that we want a balanced region where no-one is dominated and no-one dominates,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/exotic-mushrooms-grown-using-sugarcane-waste-bagasse/105518670",
        "title": "Sugarcane waste offers new frontier for growing Asian mushrooms",
        "publish_date": "Sun, 13 Jul 2025 01:16:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Exotic Asian mushrooms are now being grown using a by-product from sugarcane processing.\n\nBagasse, the material left over after sugarcane has been processed, has proven to be a viable and productive growing substrate for Asian mushrooms.\n\n\"One [bagasse] bag, we can produce about 200 to 250 grams [of mushrooms],\" exotic mushroom grower Simon Tang said.\n\n\"That's quite a good result in this industry.\"\n\nMr Tang grows premium Asian mushrooms across two farms at Park Ridge in Logan in south-east Queensland.\n\n\"We probably produce from 2 to 3 tonnes every week, including king, oyster mushrooms and shiitake mushrooms,\" he said.\n\nThe pandemic compromised output for Mr Tang's company Kenon Mushrooms, with import interruptions and delays.\n\nPandemic disruption sparks rethink\n\nThe Asian mushroom spores and their growing substrate were imported from China.\n\n\"Normally the shipping container comes here [after] like 21 days, [but during the pandemic] maybe they take up to two months to come,\" Mr Tang said.\n\n\" A lot of factories [in China] they stop, so they can't supply to you. \"\n\nSimon Tang was a computer engineer before he became a mushroom grower. (ABC Landline: Courtney Wilson)\n\nWhen imports were cancelled or delayed, production for Mr Tang's company ground to a halt.\n\n\"After that I [began] thinking maybe I need to think about [the company switching to] grow everything locally in Australia [because it] can protect your business [when it's] at risk,\" Mr Tang said.\n\nPrevious attempts to use locally sourced sawdust or cottonseed husk as mushroom substrates had failed due to difficulty sourcing and maintaining a consistent supply.\n\nWhen Mr Tang discovered research to use sugarcane bagasse to grow Asian mushrooms, he was intrigued.\n\n\"I said, 'Whoa, that's quite a good idea' because in Queensland we got a lot of sugar on the farms,\" he said.\n\n\" [It's] easy for us to get these sugarcane bagasse so that's why I'm thinking we can try. \"\n\nThe company produces 2 to 3 tonnes of mushrooms each week, including king oyster and shiitake varieties. (ABC Landline: Courtney Wilson)\n\nSince then, the Millaquin mill in Bundaberg has supplied Mr Tang's company with bagasse to grow exotic mushrooms.\n\nMill manager Lincoln Williams said the collaboration came about after Mr Tang contacted him directly.\n\n\"He sent me an email saying, 'Yeah this is what I'm looking at doing, growing mushrooms from bagasse … are you interested in supplying some?'\n\n\"So we went, 'Yep — no worries.' We had some spare,\" Mr Williams said.\n\nLincoln Williams's sugar mill supplies leftover sugarcane bagasse to grower Simon Tang. (ABC Landline: Cameron Lang)\n\nWhat is bagasse and why use it?\n\nAll sugar mills run differently, but at the Millaquin mill bagasse is stockpiled on site and on a nearby farm too.\n\n\"Bagasse is the by-product after we squeeze out all the sugar juice out of it [the sugarcane],\" Mr Williams said.\n\nThe fibrous sugarcane waste bagasse is crushed and repurposed as a growing medium for exotic mushrooms. (ABC Landline: Cameron Lang)\n\n\" It's about 45 per cent moisture, and we use that in our boilers to produce the steam, which runs the whole process. \"\n\nThe mill is seasonal, coinciding with sugarcane harvesting, which generally starts during winter.\n\nBut even when it's not crushing season, the bagasse is still necessary for the year-long sugar refinery operation.\n\n\"We use every part of it that we can,\" Mr Williams said.\n\n\" In the non-crush [season] we burn it. We reuse it [bagasse] so we can supply steam to the refinery. \"\n\nThis wasn't always the case, but efforts to make sugar production more efficient over the years have prompted changes in the industry.\n\n\"It saves us using coal later on. We don't want to use coal, so we use bagasse and some woodchip as well,\" Mr Williams said.\n\n\"If we have any excess stuff that we don't use that year we do sell it to some other companies that use it in mulch and things like that.\"\n\nUsing sugarcane bagasse to grow mushrooms is definitely outside of the ordinary.\n\nExotic Asian mushrooms are grown inside tunnels at the farm at Park Ridge. (ABC Landline: Courtney Wilson)\n\nCQ University researchers have led trials at Mr Tang's manufacturing facility, cultivating mushroom spores and developing different recipes using bagasse.\n\nThey've also mixed in other waste products, including peanut shells.\n\n\"It's definitely exciting,\" CQ University professor Delwar Akbar said.\n\n\"We are trying to understand what is the development impact of such an industry where the raw materials are close by, and how the supply chain will work in this area,\" Mr Akbar said.\n\nDelwar Akbar has led trials into using sugarcane bagasse and peanut shells to grow exotic mushrooms. (ABC Landline: Cameron Lang)\n\nGrowing mushrooms by the bag\n\nOnce the substrate bags are composed, they're injected with the mushrooms' spores before being stored in incubation rooms.\n\nMr Tang's bagasse bag manufacturing facility in Bundaberg, Queensland is currently producing up to 10,000 substrate bags a week.\n\nSimon Tang and Stephen Newbould inside the incubation room at their Bundaberg facility. (ABC Landline: Cameron Lang)\n\n\"We've got the only bagging machine in Australia that produces bags without hand packing,\" factory manager Stephen Newbould said.\n\n\" We can produce 10,000 bags or we can produce 20,000 bags if needed. No-one else can do that. \"\n\nMr Tang sells his exotic mushrooms at major markets in Brisbane and Sydney as well as to other local markets, Asian grocers and specialty restaurants.\n\nKenon Mushrooms has packed thousands of bagasse substrate grow bags for growing exotic mushrooms. (ABC Landline: Cameron Lang)\n\nBut his hope is to supply bagasse grow bags to more people, to increase the number of mushroom growers.\n\n\"They can get mushroom bags from our factory, and then they can produce it in [their] local backyard to grow mushrooms. [It's] very easy,\" Mr Tang said.\n\nThe more growers he can support, Mr Tang believes, the better the Australian industry will become.\n\n\"I'm [hoping to] changing Australian people's [preferences] from the button mushroom to more varieties of mushroom,\" he said.\n\n\"You know, one thing is we give more people more choices, like a more healthy, more nutritious food choice.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/wimbledon-final-amanda-anismova-loss-iga-swiatek/105526218",
        "title": "Anisimova admits Wimbledon final nightmare is 'tough to digest'",
        "publish_date": "Sun, 13 Jul 2025 00:28:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "There were two so-called 'double bagels' — the term used to describe a match finishing with a 6-0, 6-0 scoreline — at this year's Wimbledon.\n\nAmerican Amanda Anisimova starred in both.\n\nThe first one launched the 23-year-old on the path to her first major singles final as she thrashed Yulia Putintseva in the opening round.\n\nSadly for Anisimova, she was on the receiving end of the second and it came at the worst-possible time.\n\nIn front of a packed Centre Court crowd and millions of television viewers in the final, her hopes of winning the title evaporated in 57 cruel minutes as she was put through the wringer by Poland's Iga Świątek.\n\nŚwiątek beats Anisimova in just 57 minutes to win Wimbledon title Photo shows Iga Swiatek kisses the Wimbledon trophy Iga Świątek has blitzed Amanda Anisimova 6-0, 6-0 in just 57 minutes to claim her first Wimbledon title.\n\nThe only other occasion a Wimbledon singles final was decided by a 6-0, 6-0 scoreline was in 1911 when Dorothea Lambert Chambers beat fellow British player Dora Boothby.\n\nIt had happened only once at any of the other major finals, in 1988 when Steffi Graf demolished Natasha Zvereva in 34 minutes at the French Open.\n\nAt least 13th seed Anisimova almost stretched it to an hour.\n\nIt is customary at the majors for the runner-up to say a few words before the champion following the final.\n\nAnisimova probably wished Centre Court would open up and swallow her as she answered questions from former British player Annabel Croft, managing to hold herself together enough to say a few coherent words through the tears.\n\nLater, in the relative sanctuary of the media conference room, she was reflective as she spoke of how she had been frozen by nerves in the biggest match of her career.\n\n\"It was tough to digest,\" Anisimova said.\n\n\"It's not how I would have wanted my first grand slam final to go. I think I was in shock afterwards.\n\n\"It's not an easy thing to go through, losing zero and zero.\"\n\nIga Świątek was relentless in the final against Amanda Anisimova. (AP Photo: Kirsty Wigglesworth)\n\nA sense of perspective is perhaps easier for a player who was marked out as a future major champion as a teenager but who needed to step away from the game for eight months in 2023 as she struggled with burnout and mental health issues.\n\nShe did not even feature in the Wimbledon main draw last year, losing in the third round of qualifying when she was ranked 189th in the world.\n\nSo despite how the final panned out, Anisimova preferred to take the positives from a run that included a scintillating semifinal victory against world number one Aryna Sabalenka.\n\n\"I feel like the last two weeks, if anything, what I've learned it was you're never going to be perfect, and every match is different,\" Anisimova said.\n\n\"My fighting spirit has gotten me to the final of today. It wasn't me playing perfect in a way. There were matches where I struggled and I wasn't playing to my full potential.\n\n\"I think me just staying focused and fighting my way through certain moments and lifting myself up and trying to not get negative on myself was the most important thing.\n\n\"I think that's really what got me to the final.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/city-of-nedlands-implosion-analysis-fiona-argyle/105523564",
        "title": "For one week only, Perth local government was pure box office",
        "publish_date": "Sun, 13 Jul 2025 00:11:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Four councillors resign, three commissioners to be appointed, and one explosive radio interview.\n\nIt was some kind of week in the City of Nedlands, and for its Mayor Fiona Argyle.\n\nAfter the resignation of four councillors on Monday left Nedlands without the ability to form a quorum, it left an embarrassing mess for Local Government Minister Hannah Beazley to clean up, as most observers reached for the popcorn.\n\nLocal Government Minister Hannah Beazley has taken steps to sack the City of Nedlands council. (ABC News: Courtney Withers)\n\nMs Beazley announced she would be dissolving the council and appointing three commissioners to take the reins.\n\nAnd with the ticking clock of local government elections looming in October, the spotlight is well and truly on Perth's wealthy western suburbs.\n\nOld problems brought to a head\n\nAlleged in-fighting and inefficiency has plagued the City of Nedlands for years.\n\n\"The city has not been on the right track for a very long time,\" Ms Beazley said on Tuesday.\n\nHannah Beazley says she will install three commissioners to take over the City of Nedlands. (ABC News: Courtney Withers)\n\nThe spectacle kicked off on Monday morning when councillor of 23 years Ben Hodsdon formally resigned, describing the council as \"consistently toxic and dysfunctional\" — and another three councillors followed him out the door.\n\nHe cited the recent children's hospice issue as one of his final straws — a situation that led Lands Minister John Carey to describe Nedlands as \"one of the worst councils in Western Australia\" last month.\n\nThe council opposed plans to build a parkland for terminally-ill children on an A-class reserve near the new $34 million facility in Swanbourne, forcing the government to intervene.\n\n'Leadership a lonely game'\n\nProtecting the reserve became a line in the sand for the council, despite vocal criticism, but Mr Hodsdon said there was tension bubbling below the surface.\n\nNedlands mayor makes cryptic social media post after council's implosion Photo shows A composite image of two women City of Nedlands Mayor Fiona Argyle makes a cryptic social media post as the fall-out continues from her council’s spectacular implosion this week.\n\n\"There were four councillors that were in favour and five councillors plus the mayor that weren't in favour of the proposition,\" he told the ABC.\n\n\"I think to a certain degree it was the idea that they were losing control … so I think people had their nose out of joint because of the fact it was going to be built at Swanbourne and they didn't like that idea.\"\n\nNedlands Mayor Fiona Argyle sees it a different way.\n\n\"Leadership is a really really lonely game, but I've learnt that it takes a team to win,\" she told the ABC on Friday.\n\n\"That team voted unanimously for our council to proceed and try and protect that area.\n\nFiona Argyle gave an extraordinary interview on ABC Radio Perth on Monday. (ABC News: Courtney Withers)\n\n\" I'm a big believer in democracy … everyone gets a voice, everyone gets a vote. \"\n\nBold claim in question\n\nAfter the chaos of Monday's resignations, Ms Argyle took to the airwaves in an explosive interview during which she made several bold claims.\n\n\"I am the most popularly elected mayor since the 1970s,\" she told ABC Radio Perth.\n\nLoading...\n\nMs Argyle was first elected as mayor in 2021 and was re-elected in 2023 with a total of 2,670 out of 5,340 valid votes.\n\nAccording to the Western Australian Electoral Commission's website though, Laurie Taylor was elected mayor of Nedlands in 2003 with 3,790 votes — or 71 per cent — out of 5,319.\n\n\"I was re-elected popularly … twice,\" she told the ABC.\n\n\"I did that, I haven't taken any political donations I've done that with all my own money.\"\n\nIn addition to alleging councillors \"deliberately worked against [her]\", Ms Argyle has said security was increased in the council chambers as a result of councillor behaviour.\n\nA City of Nedlands staff member confirmed to the ABC a ranger had attended several ordinary council meetings, but it \"did not involve anything to do with the councillors\".\n\nThe state government maintains the City of Nedlands has been dysfunctional for some time. (ABC News: Courtney Withers)\n\nThe staff member said the ranger was asked to attend because of concerns regarding members of the public.\n\nThe mayor also said she wasn't able to meet with Ms Beazley to discuss several complaints about her colleagues' alleged behaviour.\n\nThe ABC has seen an email sent by Ms Argyle in May this year requesting a meeting with Ms Beazley, which was denied in an email back from the minister's office citing her schedule.\n\n\"While the council is under investigation, I didn't find it entirely appropriate for me to be communicating with the mayor,\" Ms Beazley said on Tuesday.\n\nWill she run again?\n\nAs for what's next for Ms Argyle, she says that's up in the air.\n\n\"Certainly all the options are on the table, but I'm not saying anything at the moment … I'm just trying to recover from what the government has done to a good mayor,\" she said.\n\nCommissioners will run the council until at least the October local government elections, but they can not stay beyond that.\n\nFiona Argyle has not indicated whether she will renominate for the position in October. (ABC News)\n\n\"We can only intervene though under the WA Local Government Act to make sure that the state government discharges its responsibilities,\" Premier Roger Cook said on Friday.\n\n\" Regrettably, that means they can not sit beyond the October elections, but we'll be watching very closely. \"\n\nWith nothing stopping Ms Argyle and the remaining councillors from renominating, should they be elected, the council could return come October.\n\nWhich means there might be a sequel to this local government blockbuster.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/gippsland-farmers-fight-to-keep-yanakie-weather-station-open/105516902",
        "title": "Farmers fight to keep weather station saying it's 'too valuable to lose'",
        "publish_date": "Sat, 12 Jul 2025 23:29:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Farmer Matthew Marriott has spent a lifetime monitoring the weather on Victoria's picturesque Prom Coast.\n\nHis family has run cattle at Yanakie since 1975 and Mr Marriott knows the area like the back of his hand.\n\nBut he cannot predict the weather.\n\n\"We're right on the coast, so conditions here are always changing,\" Mr Marriott said.\n\n\" And because it's been unusually dry this year, we've been obsessed with rainfall recently. \"\n\nA vital service\n\nAs a farmer and horse trainer, Matthew Marriott depends on data recorded from the Yanakie weather station. (Supplied: Claire Harris)\n\nMr Marriott usually checks the forecast multiple times a day, but that has changed since the Yanakie automatic weather station shut down at the start of July.\n\nThe station began operating in 2012 with a one-off federal government grant and is one of 650 stations dotted across Australia recording temperature, wind speed and rainfall data.\n\nAbout 200 of them are owned by local councils or privately, but the Bureau of Meteorology (BOM) operates and maintains them.\n\nRobert Tracy, who also farms beef at Yanakie, said there was a big gap in weather observation data without the station.\n\n\"That became especially clear after a severe storm hit our region in 2011,\" he said.\n\n\"So the Yanakie station was set up the following year with enough funding to run for 10 years.\"\n\nRobert Tracy says everyone has the right to access local weather data. (Supplied: Robert Tracy)\n\nBut that money dried up and the station was closed.\n\n\"Initially the South Gippsland Shire Council and the bureau discussed the future of the station with no input from the community,\" Mr Tracy said.\n\n\"We didn't hear about the planned shutdown until April, so there was certainly no transparency.\"\n\nA spokesperson for the BOM said it could maintain and oversee weather stations only where a \"formal funding agreement\" was in place.\n\nThe BOM has closed three automatic weather stations in the past five years, at Hay Point in Queensland, Kanagulk in Victoria and, most recently, Yanakie.\n\nThe spokesperson said the closures were \"due to the customer advising the bureau to cease operations\".\n\nWeather station equipment records location-specific data on temperature, rainfall and wind speed. (ABC Rural: Peter Somerville)\n\nA change of heart\n\nFor another farming community at Nilma North, about 125 kilometres north-east of Yanakie, it's all too familiar.\n\nTheir weather station was also set to close at the start of July, but retired dairy farmer Colin Gray led the charge to keep it going.\n\nColin Gray says his community had to fight to keep its local weather station running. (Supplied: Colin Gray)\n\n\"We got a letter from Baw Baw Shire Council to say the station would be closing down, and I thought to myself, 'We've got to do something,'\" he said.\n\n\"Within a month, we had everyone writing letters and contacting their councillors about it.\n\n\"And it just snowballed from there.\"\n\nThe council has agreed to fund the Nilma North weather station in conjunction with the BOM for another three years.\n\n\"I think people started to realise whether you're a farmer, a tourist, or just an everyday person, we need local weather information,\" Mr Grey said.\n\nPush for funding\n\nBack in Yanakie, the South Gippsland Shire is now advocating for continued funding for the local station there.\n\n\"Council representatives, including the mayor and deputy mayor were recently in Canberra,\" the chief executive Allison Jones said.\n\n\"They met with government representatives to advocate for the continuation of the Yanakie weather station service,\" she said.\n\nMr Tracy is glad the council is listening to the community and he hopes it will make a difference.\n\n\"We need to know what the weather is doing.\"\n\nYanakie is a small town on the doorstep to Wilsons Promontory National Park, a popular tourist destination. (Supplied: Matthew Marriott)\n\nMr Marriott agrees, saying farmers, fishers and residents will continue their fight.\n\n\"It's too valuable to lose,\" he said.\n\n\"It provides critical data for us farmers, as well as local fire brigades, park rangers, professional fishermen, recreational boaters and tourists.\n\n\"Even local painting contractors rely on it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/native-american-fluency-model-indigenous-language-alice-springs/105462642",
        "title": "Native American teachers join push to save at-risk Indigenous languages",
        "publish_date": "Sat, 12 Jul 2025 23:13:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "A cross-continental partnership that could help to revive dozens of Australia's most endangered First Nations languages is taking root on Arrernte country.\n\nIn a modest classroom at the Desert Peoples Centre in Alice Springs, Native American language educators from Washington State are sharing a method they say can do what once seemed impossible: create fluent speakers of endangered languages within a single year.\n\nThe Fluency Transfer System (FTS) was developed by the Salish School of Spokane, an Indigenous immersion school that teaches preschool through to year 8 entirely in the Salish language.\n\nLast month the team behind that system landed in Mparntwe (Alice Springs) to share the blueprint with more than 45 Aboriginal language groups from across the country.\n\nVanessa Farrelly is one of 20 remaining fluent Pertame speakers. (ABC Alice Springs: Chris Fitzpatrick)\n\nAmong the group is workshop organiser Vanessa Farrelly, the coordinator of the Pertame Language Nest, a preschool-style immersion program aiming to raise a generation of fluent speakers.\n\nShe says the FTS is set apart by its track record.\n\n\"It's like a road map to take someone who knows no language – a complete beginner – to being an advanced, fluent speaker,\" Ms Farrelly said.\n\n\"And they've been able to do it reliably in just over a year.\"\n\nMs Farrelly says her infant and toddler students will be the first generation in 50 years to be fluent in the language.\n\n\"There are only about 20 speakers of Pertame left — they're all in the grandparent generation,\" she said.\n\n\" We don't have time to waste on methods that don't work. \"\n\nFirst Nations language advocates gather to learn the Salish fluency method in Alice Springs. (ABC Alice Springs: Chris Fitzpatrick)\n\nConnecting with culture\n\nThe FTS pairs confident speakers with learners and moves them through structured lessons given entirely in the target language.\n\nThere is no translation, just repetition, body language and culturally embedded storytelling.\n\nLaRae Wiley started learning her language in her mid-30s. (ABC Alice Springs: Chris Fitzpatrick)\n\nFor Salish School of Spokane executive director LaRae Wiley the approach is deeply personal.\n\n\"I'd never heard my language growing up … [when] I turned about 35, I decided that I wanted to learn my language,\" she said.\n\n\" When I started learning, it felt like my heart became whole again. \"\n\nWith only two fluent speakers of her language – Nsəlxcin – left in the United States, LaRae travelled to Canada with her husband Chris Parkin to live with a fluent elder and begin recording.\n\nThey developed the FTS together and opened a school in her sister's basement.\n\nChris Parkin is the principal of the Salish School and the co-creator of the FTS. (ABC Alice Springs: Chris Fitzpatrick)\n\n'Not just about language'\n\nFifteen years later the school has 48 students, including 23 intergenerational families and is the only three-generation Salish-speaking household in the US.\n\n\"It's not just about language,\" Mr Parkin said.\n\n\"It's about healing. It's about reclaiming identity, connecting with ancestors and rebuilding community.\n\n\" That's why we're here — because we know it works. \"\n\nGrahm Wiley teaches upper primary-age students at the Salish School. (ABC Alice Springs: Chris Fitzpatrick)\n\nGrahm Wiley, Ms Wiley's son, teaches years 3 to 5 maths, science and reading entirely in Salish.\n\nHis daughter is one of his students.\n\n\"[My children] have a much better sense of self than I did when I was their age,\" Mr Wiley said.\n\n\"When you're grounded in your culture … it allows you to go out into the world in a different way.\"\n\nTwo continents, one goal\n\nThe relationship between the Indigenous peoples of Central Australia and the Salish tribe started when a group of Pertame speakers, including Ms Farrelly, visited a Salish-led workshop in Montana.\n\nTrailblazers celebrate 50 years Photo shows Two Indigenous women, one elderly and the other middle-aged, cuddle up as they gold an award in a school quadrangle. Theresa Napurrurla Ross was taught to read and write in her own language by her mother and followed in her footsteps. Half a century on, their legacy continues to change lives.\n\nThe two groups soon found they were deeply connected by shared histories of colonisation, dispossession and survival.\n\n\"When we were presenting in Montana and they came to that workshop, we were flabbergasted,\" Mr Wiley said.\n\n\"We were like, 'You came from where?'\"\n\nMs Farrelly said the Salish team's visit to Australia could not have been more timely.\n\n\"Australian languages have one of the fastest rates of extinction in the entire world,\" she said.\n\n\"It is critical that our Australian endangered language groups come together and look to Indigenous peoples globally to learn from the most successful pathways to grow new fluent speakers.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/tasmanian-election-environment-sidelined/105515986",
        "title": "Tasmania's environment is under pressure, but issue is sidelined in election campaign",
        "publish_date": "Sat, 12 Jul 2025 22:53:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Less than a week out from the Tasmanian election, the Liberals and Labor have steered clear of announcements for stronger environmental protection, instead focusing on industries and \"brands\".\n\nThe snap election comes after the State of the Environment report was tabled in parliament last September — the first such report in Tasmania for 15 years, despite it being required every five years.\n\nIt showed that out of 29 environmental indicators, 16 were deteriorating, six were stable, two were improving and five lacked enough data to be fully known.\n\nTasmanian State of the Environment report Photo shows Kelp forest in Tasmania with fish and diver Tasmania has built a brand off it's clean, green identity. But a long-awaited state of the environment report paints a different picture.\n\nThis included a worsening situation for threatened flora and fauna, the increasing fragmentation of native vegetation, the spread of invasive weeds and animals, and a lack of reliable data for water quality.\n\nThe report made 16 recommendations, the Liberal government accepted six in full.\n\nAt last year's state election, the Liberals' environment promises — under the title \"keeping our parks and environment strong\" — listed a range of funding for visitor infrastructure in state and national parks.\n\nAn oil spill at Lake Rosebery in January. (ABC News: Bec Pridham)\n\nThe only part that referenced environmental outcomes was for captive breeding programs for the endangered Maugean skate, and for the critically endangered swift parrot and the orange-bellied parrot, each of which face ongoing pressure from industry.\n\nOn Friday, Premier Jeremy Rockliff said the environment was part of Tasmania's \"brand\".\n\n\"We would not have a global brand of strong environmental credentials if it wasn't for the way that we nurture and sustain our industries in Tasmania,\" he said.\n\n\"It's about getting the balance right.\n\n\"Half of Tasmania is in reserve. That sends a very clear message to the world of our environmental credentials.\"\n\nA significant proportion of that \"reserve\" land is the Tasmanian Wilderness World Heritage Area.\n\nMr Rockliff also listed the state's new container deposit scheme as a positive environmental outcome.\n\nSewage flows into the River Derwent without being fully treated. (Supplied: Marine Solutions)\n\nHe earlier announced a plan to make it easier for large industrial companies to negotiate and complete trade waste improvements with TasWater.\n\nIn December, excessive trade waste from the Cadbury factory in Hobart caused a sewage treatment plant to fail, resulting in mostly untreated sewage flowing into the River Derwent for several days, with beaches closed.\n\nLabor looks to native logging laws as example\n\nLabor's only environment announcement this campaign involved streamlining environmental approval for industries, including renewable energy.\n\nLabor leader Dean Winter used the regional forest agreement (RFA) as an example — a process in which native forest logging is \"exempted\" from additional assessment under federal environmental laws.\n\nCleared forest road into a native forest logging coupe at Kermandie. (Supplied: Bob Brown Foundation)\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\nMr Winter said the idea was to speed up environmental assessments for projects like the Robbins Island wind farm.\n\n\"By coordinating environmental assessments through RFA style agreements, that means that we can get to the decision more quickly, whether that's good or bad, so that we can actually see projects get some more certainty,\" he said.\n\nIn a review of federal environmental laws by Professor Graeme Samuel — released in 2021 — the RFA system was described as providing \"weaker\" environmental protection, and that oversight was \"insufficient\".\n\nA regeneration burn in a native forest coupe, which blanketed the nearby town of Maydena in dense smoke for several days in 2023. (Supplied: The Tree Projects)\n\nThis month, state-owned logging company Sustainable Timber Tasmania released its updated list of native forest coupes that can be logged, burnt and re-sown at short notice, covering 39,417 hectares.\n\nOf those, about 6,300 hectares includes breeding areas for the swift parrot.\n\n'Decades of underinvestment' causing water, sewage woes\n\nWhen asked about environmental policies this election, Mr Winter said he wanted to address water quality.\n\n\"We've seen over the course of the last 11 years, for example, the number of sewage spills into our waterways continuing,\" Mr Winter said.\n\n\" I want to work really hard with TasWater and local councils so that we can clean up our waterways. \"\n\nA report into Tasmania's water and sewerage industry, released last month, showed there were 64 sewer breaks and chokes per 100 kilometres of sewer — three times worse than similar-sized water authorities interstate.\n\nMurky water at the Cameron Bay sewage treatment plant after it was hit by excessive trade waste. (Supplied: Hydro Flow)\n\nJust under a quarter of the state's potable water remains unaccounted for — or goes missing — each year.\n\nTasWater continued to miss service standard targets, with the water authority blaming \"decades of underinvestment\".\n\nMajor parties sidelining issue, Greens say\n\nTasmania's Environment Protection Authority (EPA) was separated from the environment department in 2022, in an effort to make it more \"independent\" from government.\n\nDead salmon in an enclosed pen in the Huon Channel, near Southport, during a mass die off. (Supplied: Bob Brown Foundation)\n\nPromise tracker: What the parties are saying this election Photo shows Thumbnail image for Tasmania state election 2025 promise tracker article. As Tasmanians prepare for a July 19 vote, we keep track of each party's election promises on everything from health and housing, to the stadium.\n\nBut the Tasmanian Greens say this intent has not been achieved, because the EPA still has a \"statement of expectation\" from the environment minister.\n\nThis includes that the EPA will \"support sustainable development in Tasmania\", which the Act defines as \"the use, development and protection of natural and physical resources\".\n\nThe term, to \"protect the environment of Tasmania\", was removed from the Act in 2008 and has not returned.\n\nGreens leader Rosalie Woodruff said both major parties were sidelining environmental protection.\n\n\"The Liberals have promised to do nothing. The Labor party is silent,\" she said.\n\n\"The Liberal and Labor party both are prepared to log and burn native forests in a climate emergency, and we know they are both backing big salmon corporations.\"\n\nHuman impacts of poor environmental outcomes\n\nAn Invasive Species Council forum this month heard how Tasmania's environmental issues were continuing to have impacts on people's health, on volunteer groups and on farmers.\n\nFinn Pasanen is blind in his left eye due to toxoplasmosis, contracted by his mother while he was in utero, likely caused by stray and feral cats that frequented their backyard.\n\nFeral cats have a range of impacts on the environment, and can even pass on diseases to humans. (Supplied: Hugh McGregor/Arid Recovery)\n\nMr Pasanen said it had greatly affected his hand-eye coordination and depth perception, and he suffered motion sickness and headaches.\n\n\"The best thing to do to reduce toxoplasmosis is getting your cats to not roam freely, [it's] much less likely to develop it themselves and become a vector,\" he said.\n\nTasFarmers chief executive officer Nathan Calman said toxoplasmosis was also causing problems for lamb and wool producers.\n\nThe State of the Environment report found that invasive animals were continuing to increase as an issue in Tasmania, particularly cats and fallow deer.\n\nGorse is one of the invasive weeds that is continuing to spread in Tasmania, causing environmental harm. (ABC Rural: Luke Radford )\n\nLandcare Tasmania chief executive officer Peter Stronach told the forum that volunteer groups were under increasing pressure due to the ongoing spread of invasive weeds.\n\nHe said they remained heavily reliant on fundraising but government support was sporadic.\n\n\"We don't get the funding that we need, and when the funding does come it's quite haphazard, to say the least,\" he said.\n\n\" We can't keep doing this for nothing. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/tour-de-france-kaden-groves-third-stage-eight/105526052",
        "title": "Aussie Groves reaches Tour de France podium, Pogačar keeps yellow jersey",
        "publish_date": "Sat, 12 Jul 2025 22:49:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Kaden Groves has finished third in stage eight of the Tour de France, with Italy's Jonathan Milan claiming victory.\n\nMilan (Lidl-Trek) fought off Belgian Wout van Aert (Visma–Lease a Bike) to win the 171.4 kilometre stage from Saint-Méen-le-Grand, while defending champion Tadej Pogačar did enough to retain the yellow jersey.\n\nRiding his first Tour, Milan looked to have been caught off guard when Groves (Alpecin–Deceuninck) hit the front, but the Italian battled back to take the lead and hold off the challenge of Van Aert.\n\nSlovenia's Pogačar (UAE Team Emirates) remains 54 seconds ahead of Belgian Remco Evenepoel (Soudal–Quick-Step) in the overall standings.\n\nBen O'Connor (Team Jayco AlUla) is the best-placed Australian in the general classification in 20th position, 8:25 adrift of Pogačar.\n\nGigante solos to victory on Giro queen stage Photo shows Sarah Gigante holds up her hand Sarah Gigante has become the first Australian in 27 years to win multiple stages at the Giro d'Italia Donne, winning the queen stage to move back to third in the overall standings.\n\n\"I have to say it was a bit stressful and I was not expecting it to drag up so much in the last kilometre,\" Milan said.\n\n\"I had to wait as long as I could, but I like this kind of finale and I'm really happy for the world that we did. We really deserved it.\"\n\nStage eight was expected to be a chance for the sprinters to return to the fore on the mostly flat ride.\n\nThe peloton trundled along for the opening 90km, apart from a brief spurt at the intermediate sprint where Milan took maximum points before French duo Mattéo Vercher and Mathieu Burgaudeau (TotalEnergies) launched the first attack.\n\nWith several teams looking to set up their sprinters for the stage win, the break was never allowed to get too far ahead, though they managed to extend their lead to just over one minute with 20km remaining.\n\nBurgaudeau went solo with 13km to go but was reeled in by the chasing pack after 4 kilometres and the tactical game of cat and mouse began.\n\nVan Aert took the wheel of Groves as the Australian's team led the bunch into the final kilometre.\n\nGroves went early and did not have the legs to hold off Milan, while the Italian was able to withstand Van Aert's late burst.\n\nMilan, who is the first Italian Tour de France stage winner since Vincenzo Nibali in 2019, leads the points classification.\n\nStage nine takes the riders 174.1km from Chinon to Châteauroux, a flat route where the sprinters will again fancy their chances.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/sydneys-oldest-barbers-working-well-beyond-retirement-age/105508506",
        "title": "At 87, Sydney's oldest barber won't cut short his career",
        "publish_date": "Sat, 12 Jul 2025 22:36:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "In a corner below the ground floor of Sydney's near-century-old Cyprus Community Club in the city's inner west, one of Sydney's oldest \"artists\" is at work.\n\nArmed with scissors and a comb in a small barber shop he built in the club's dining hall in 1993, Kyriakos Vasilis is giving Arthur a trim.\n\nAt 87, Mr Vasilis might be Sydney's oldest barber, but he insists he isn't working.\n\nKyriakos Vasilis says the work is not too physically demanding. (ABC News: Declan Bowring)\n\n\"Hairdressing is not a job. Hairdressing is an art,\" Mr Vasilis says.\n\n\" Either you have it, or you haven't got it. \"\n\nDespite officially retiring 15 years ago, Mr Vasilis regularly cuts the hair of members of the Cypriot community in his little shop for no charge.\n\nHe says they might buy him a drink later as payment in kind, but he doesn't expect it.\n\nDespite suffering health scares that would spell the end of some careers — he's been battling prostate cancer and had a seizure two years ago — he says the work is nothing he can't handle.\n\nKyriakos Vasilis cuts hair for his friends at the Cyprus Community Club. (ABC News: Declan Bowring)\n\n\"If it was physically demanding, I wouldn't be doing it,\" Mr Vasilis says.\n\n\" It's a challenge with me, it doesn't send me senile. \"\n\nOccasionally, he also works at a barber shop down the road from the club, run by his friend Con Apostolopoulos.\n\nAt 84, Mr Apostolopoulos is just a few years younger than Mr Vasilis.\n\nHe was 20 when he came to Australia from Greece, and says he's worked as a barber in Sydney ever since.\n\nCon Apostolopoulos sees no point in retiring. (ABC News: Declan Bowring)\n\nMr Apostolopoulos says all his customers are regulars, and have been for \"over 50 years, close to 60 years\".\n\nHis barber shop opens six days a week, and he wants to keep working for as long as he feels he can.\n\nWhen ABC Radio Sydney visited Mr Apostolopoulos earlier this year, he was taking a break from cutting hair after having a pacemaker fitted.\n\nCon Apostolopoulos has been cutting hair in Sydney for 60 years. (ABC News: Declan Bowring)\n\nAlthough Mr Vasilis was filling in for him, Mr Apostolopoulos still turned up to man the till behind the service counter.\n\n\"I've told him numerous times to retire and stay home, but it just keeps him going,\" Mr Apostolopoulos's daughter, Virginia, said.\n\n\" He doesn't have a hobby. So this is his actual work and hobby, and he enjoys it. \"\n\nCon Apostolopoulos came in to man the till while Kyriakos Vasilis took care of the clients. (ABC News: Declan Bowring)\n\nNot in it for the money\n\nAnother veteran barber, Guido Piccirilli, first picked up the clippers as a boy of 15.\n\nMr Piccirilli, now 78, started working in his St Mary's barber shop in Western Sydney in 1962.\n\nHe says he would have stopped six years ago when his son took over the business, but they struggled to find someone who could work just three days a week, so he stayed on.\n\nGuido Piccirilli has been working as a barber in St Mary's since 1962. (Supplied: Marian Peters)\n\n\"When it gets busy, and you have a long day at work, yeah, you'll feel it in the end,\" Mr Piccirilli said.\n\nLike Mr Vasilis and Mr Apostolopoulos, it's the social aspect of the job that keeps him going.\n\n\"I'll get people coming in and they'll say, 'I haven't seen you for 30 years! My god, you're still here!',\" Mr Piccirilli said.\n\n\"I'll be honest. I don't even get a little bit of money there … just more or less for fun.\"\n\nOlder barbers part of an ageing workforce\n\nAustralians are increasingly working into their old age, according to an Australian Institute of Health and Welfare analysis of Census data.\n\nThe workforce participation rate of Australians aged 65 and over more than doubled from 6.1 per cent in 2000 to 15 per cent in 2021.\n\nPatricia Sparrow, chief executive officer of the Council on the Ageing (COTA), said this could be beneficial to the modern workplace.\n\n\"What we actually know is the best workplaces, and the most productive workplaces, are actually intergenerational and multi-generation workplaces,\" Ms Sparrow said.\n\n\" But there is ageism that means that people, once they're over a certain age, don't necessarily get a fair shot at getting a job and being able to stay in [it]. \"\n\nMs Sparrow said most older Australians who kept working were either doing it for financial reasons or because they did not want to give up the social interactions that came with the job.\n\n\"Others will talk about the fact that they have really missed having the purpose that having a job sometimes will give,\" she said.\n\nKyriakos Vasilis working at a barber shop in Balgowlah in 2015. (Supplied: Kyriakos Vasilis)\n\n'What can I do after?'\n\nThe older barbers said a sense of purpose was their main motivation to continue working.\n\n\"What can I do if I retire? You know, [I'm] only myself, my wife passed away a long time,\" Mr Apostolopoulos said.\n\n\" If I retire, what can I do after? No good. \"\n\nAs Mr Vasilis carefully trims a client's hair on the other side of the barber shop, he gives a more poetic response.\n\n\"When you come to a shop, it reminds you of your past and what you are, and you know, you like to meet people,\" Mr Vasilis said.\n\n\"I'm not a person that likes to go in a corner and waits to die.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-13/namadgi-huts-remain-in-ruins-after-black-summer-fires/105521172",
        "title": "The government promised to rebuild, but these huts remain in ruins",
        "publish_date": "Sat, 12 Jul 2025 22:13:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Deep in the heart of Namadgi National Park, the bush is coming back to life.\n\nBut two heritage huts destroyed when 80 per cent of the park burned in the Black Summer bushfires remain in ruins, despite government promises to rebuild.\n\nDemandering Hut and Max and Bert Oldfields Hut were destroyed during the 2020 Orroral Valley Fire.\n\nThe ACT government promised two new huts in remembrance of the originals in 2023, after 90 per cent of respondents during public consultation voted to rebuild them.\n\nThe new huts will sit near the old, so visitors can see the ruins alongside the replica.\n\nLittle remains of Demandering Hut. (ABC News: James Tugwell)\n\nAcross the border, the NSW government and the National Parks and Wildlife Service have rebuilt 10 huts destroyed during the same period in Kosciuszko National Park.\n\nBut there is no evidence of progress at the two huts in the ACT's jurisdiction.\n\n'Lots of character' now a complete wreck\n\nSince retiring five years ago, Greg Buckman from the Canberra Bushwalking Club has visited around 80 of the more than 200 historical huts scattered throughout the Australian high country — including the two awaiting work.\n\nMr Buckman says the huts provide an insight to a bygone era. (ABC News: James Tugwell)\n\n\"It's disappointing. In the five years since the fire, all of the huts in Kosciuszko have been rebuilt … and yet nothing's happened to Demandering Hut or Max and Bert's Hut,\" Mr Buckman said.\n\n\" It would be good if they got their skates on. \"\n\nMr Buckman is disappointed by the lack of progress. (ABC News: James Tugwell)\n\nStanding at the fenced-off ruins of Demandering Hut, observing the burnt stone chimney and charred corrugated iron, Mr Buckman feels the loss.\n\n\"It's obviously a complete wreck,\" Mr Buckman said.\n\n\"It's definitely sad seeing it like this and also sad knowing that it's been like this for five years now.\n\n\"It had lots of character, for sure.\"\n\nGrazier Bill Cotter built Demandering Hut — named after his homestead — in the 1940s. It was a corrugated iron and timber hut with a stone fireplace and a water tank.\n\nMr Buckman visited Demandering Hut in 2018. (Supplied: Greg Buckman)\n\nBuilt in 1967, Max and Bert Oldfields Hut was another simple, corrugated iron building.\n\nIt sat undisturbed for around 40 years before oral historian Matthew Higgins rediscovered it in 1990. At the time, Mr Higgins described finding a time capsule of personal items in the hut.\n\nA maintenance working party at Max and Bert Oldfields Hut in 2001. (Supplied: Kosciuszko Huts Association )\n\nMr Buckman said half of the heritage structures in the Australian Alps have been lost since WWII.\n\n\"That alone justifies the rebuilding of huts like Demandering,\" he said.\n\n\"They're like little museums in the middle of the wilderness.\n\n\"You're taken through this time tunnel back to times before the Second World War.\n\n\"They're history. They're heritage. They're reminders of a bygone era.\"\n\nThe huts can be lifesaving, too.\n\nIn January, missing hiker Hadi Nazari survived being lost in Kosciuszko National Park by eating only two muesli bars, found in Opera House Hut.\n\n'Get on with the project'\n\nWhile the ACT government agrees the huts should be recreated, the work, announced in October 2023, doesn't appear to be happening.\n\nAn ACT government concept design for a new hut near the site of the burnt out ruins at Demandering Hut. (Supplied: ACT Government)\n\nIn a statement, an ACT government spokesperson said archaeological and heritage assessments were underway at the two sites to inform the next stages of the project.\n\n\"It is important to get these assessments done before any work commences to ensure the appropriate protection and remembrance of the huts is in place,\" the spokesperson said.\n\nBut heritage consultant and Kosciuszko Huts Association (KHA) member Geoff Ashley said the building could start at the same time as the heritage assessment, and Parks ACT could be doing more.\n\n\"By all means start the archaeological work, but [push through] the documentation of the new huts,\" Mr Ashley said.\n\n\" You've got Victoria and NSW rebuilding these huts, and the ACT not getting there yet. \"\n\nMr Ashley is eager to see the ACT huts rebuilt. (ABC News: Greg Bigelow)\n\nMr Ashley wrote the rule book around heritage restorations.\n\nAfter the 2003 Canberra fires destroyed 20 huts in the high country, he was tasked with creating a conservation strategy, including a method for rebuilding huts.\n\nThe National Parks and Wildlife Service followed Mr Ashley's methodology during their recent rebuilds.\n\n\"They can get on with the project,\" Mr Ashley said.\n\n'It's the community that loses out'\n\nMr Ashley said KHA volunteers have also encountered issues while trying to carry out essential maintenance on other huts in the ACT.\n\nHe said Parks ACT had established a \"complex process of approval to do any work\" on the huts, meaning \"some of the places are going backwards a bit\".\n\nMr Ashley believes restoration could be achieved if processes were simplified. (ABC News: James Tugwell)\n\n\"There's a sense you have to get approval to do anything — including a lick of paint,\" he said.\n\n\"In NSW, the community is benefiting. The community is involved in using and maintaining the huts … which keeps the heritage values going.\"\n\nMr Ashley said ultimately, it's those who frequent Namadgi National Park that miss out.\n\n\"It's not just about rebuilding huts. It's about connecting to the community … that's what's missing in the ACT,\" he said.\n\n\"That connection isn't happening.\n\n\" If rebuilding doesn't happen, they'll eventually disappear. It's the community that loses out. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/brake-goes-over-in-first-set-20250713-p5mekg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brake goes over in first set",
        "publish_date": "Sun, 13 Jul 2025 12:24:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brake goes over in first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/pink-ball-carnage-in-kingston-as-australia-lose-7-68-in-15-overs-of-mayhem-20250713-p5meik.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pink ball carnage in Kingston as Australia lose 7-68 in 15 overs of mayhem",
        "publish_date": "Sun, 13 Jul 2025 12:17:32 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A 100-minute spell of pink-ball carnage under lights has breathed life into the third and final Test, giving West Indies fans something to cheer about after a dismal series to date.\n\nThe decision to pick Scott Boland over Nathan Lyon dominated early headlines but quickly faded when Australia, after winning the toss and batting, crumbled on a lively Sabina Park pitch.\n\nIt was a curious decision given Australia had gone for a four-pronged pace attack, plus Beau Webster as a fifth option.\n\nThe West Indies may have already relinquished the Frank Worrell Trophy following limp batting efforts in Barbados and Grenada, but fast bowler Jayden Seales (3-59) injected much-needed energy, dishing out animated send-offs as his side turned up with purpose on day one.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/gill-fumes-at-england-tactics-20250713-p5mejw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gill fumes at England tactics",
        "publish_date": "Sun, 13 Jul 2025 11:44:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gill fumes at England tactics\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/premiership-hero-announces-early-afl-retirement-20250620-p5m94n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Premiership hero announces early AFL retirement",
        "publish_date": "Sun, 13 Jul 2025 11:28:23 +1000",
        "category": "sports",
        "authors": [],
        "text": "Premiership hero announces early AFL retirement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/koby-stevens-makes-plea-for-stolen-documentary-footage-20250713-p5mejn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Koby Stevens makes plea for stolen documentary footage",
        "publish_date": "Sun, 13 Jul 2025 11:20:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Koby Stevens makes plea for stolen documentary footage\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/it-was-meant-to-be-backpacker-s-rescuer-describes-miracle-moment-on-remote-wa-road-20250713-p5mejk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It was meant to be’: Backpacker’s rescuer describes miracle moment on remote WA road",
        "publish_date": "Sun, 13 Jul 2025 11:13:14 +1000",
        "category": "finance",
        "authors": [
            "Cameron Myles"
        ],
        "text": "Tania Henley is not used to seeing anyone on the remote road she takes from her home on Bimbijy Station to Beacon, in Western Australia’s Wheatbelt region.\n\nSo returning from a quick trip to the small town on Friday – “only two hours there and back” – Henley was even more surprised to see, stumbling along the side of Mouroubra Road, the waifish figure of a girl the state’s emergency services had spent the past week scouring the region for.\n\nHenley was about 20 kilometres from home when Carolina Wilga walked out onto the road and waved her hands.\n\n“It was pretty amazing, really – well, it was incredible. Twelve days missing. She had to walk through the bush for 12 days because [her car] was nowhere near where I found her, nowhere,” Henley said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/jack-graham-banned-for-four-matches-over-homophobic-slur-20250713-p5mejd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jack Graham banned for four matches over homophobic slur",
        "publish_date": "Sun, 13 Jul 2025 10:53:53 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "West Coast’s Jack Graham has been banned for four matches after self-reporting a “highly offensive homophobic slur” against a GWS opponent in round 17.\n\nJack Graham (left) has been banned for four matches. Credit: AFL Photos via Getty Images\n\nGraham was given a discount on his suspension because he had self-reported the incident, which was highly unlikely to have come to the AFL’s attention otherwise.\n\nGold Coast’s Wil Powell was suspended for five matches for using a homophobic slur last season just weeks after Port Adelaide’s Jeremy Finlayson was suspended for three matches for the same offence.\n\nAn industry source who was not authorised to speak publicly said the former Richmond premiership player went to his club during the week, saying he felt badly about an incident in the game when he had gone too far and used offensive and inappropriate language in the sledge of an opponent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/they-want-to-blame-dead-pilots-air-india-victims-families-say-crash-report-a-cover-up-20250713-p5mej7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘They want to blame dead pilots’: Air India victims’ families say crash report a ‘cover-up’",
        "publish_date": "Sun, 13 Jul 2025 10:51:59 +1000",
        "category": "finance",
        "authors": [
            "Samaan Lateef"
        ],
        "text": "Mumbai: Relatives of some of the 260 victims of last month’s Air India disaster have hit out at the airline and the Indian government over the initial investigation report, saying they have rushed to blame pilots while hiding failings that led to the crash.\n\nThe report released by Indian authorities early on Saturday said initial findings indicated that switches controlling fuel flow to the jet’s two engines were turned off, leading to a catastrophic loss of thrust at take-off.\n\nAccording to the report, one of the pilots is heard in the recovered cockpit voice recording asking the other why he cut off the fuel supply. The other pilot responds that he didn’t.\n\nThe mother of Clive Kunder, co-pilot of the Air India flight that crashed last month, mourns during a prayer meeting for the Air India crew in Mumbai on Saturday. Credit: AP\n\n“This report is wrong. We don’t accept it,” said Ameen Siddiqui, 28, whose brother-in-law, Akeel Nanabawa, died alongside his wife and their four-year-old daughter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/athletics/gout-gout-wins-again-denied-another-record-by-headwind-in-monaco-20250712-p5meeb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He is just 17’: Gout may not have run under 20s, but the athletics world is impressed anyway",
        "publish_date": "Sun, 13 Jul 2025 10:15:32 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Noah Lyles likes what he sees. He saw it up close when Gout Gout came to train with him in America early in the year. And he liked what he saw in Monaco on Saturday when the young Australian won again.\n\nThe world’s best believes the hype.\n\nMonaco should have been where Gout broke 20 seconds. Hot, a fast track and racing the best under-23’s in a Diamond League meet side event, everything was poised for the youngster to break 20 for the first time.\n\nThen he copped a stiff headwind.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/swiatek-wins-first-wimbledon-title-with-demolition-20250713-p5mej6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swiatek wins first Wimbledon title with demolition",
        "publish_date": "Sun, 13 Jul 2025 10:14:10 +1000",
        "category": "sports",
        "authors": [],
        "text": "Swiatek wins first Wimbledon title with demolition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/trump-intensifies-trade-war-with-threat-of-30-per-cent-tariffs-on-eu-mexico-20250713-p5mej0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump intensifies trade war with threat of 30 per cent tariffs on EU, Mexico",
        "publish_date": "Sun, 13 Jul 2025 09:50:27 +1000",
        "category": "finance",
        "authors": [
            "Jarrett Renshaw",
            "Bhargav Acharya",
            "Cassandra Garrison"
        ],
        "text": "The August 1 deadline gives targeted countries time to negotiate agreements that could lower the threatened tariffs. Some investors and economists have also noted Trump’s pattern of backing off his tariff threats. The spate of letters showed Trump has returned to the aggressive trade posture that he took in April when he announced a slew of reciprocal tariffs against trading partners that sent markets tumbling before the White House delayed implementation. ‘Unfair treatment’ But with the stock market recently hitting record highs and the US economy still resilient, Trump is showing no signs of slowing down his trade war.\n\nHe promised to use the 90-day delay in April to strike dozens of new trade deals, but has secured framework agreements only with Britain, China and Vietnam. The EU has hoped to reach a comprehensive trade agreement with the US for the 27-country bloc. Trump’s letter to the EU included a demand that Europe drop its own tariffs. Loading “The European Union will allow complete, open Market Access to the United States, with no Tariff being charged to us, in an attempt to reduce the large Trade Deficit,” he wrote. Von der Leyen said the 30 per cent tariffs “would disrupt essential trans-Atlantic supply chains, to the detriment of businesses, consumers and patients on both sides of the Atlantic”.\n\nShe also said while the EU would continue to work towards a trade agreement, it “will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required”. Mexico’s economy ministry said Saturday it was informed the US would send a letter during a meeting on Friday with US officials. Mexican President Claudia Sheinbaum said she was sure an agreement could be reached. Credit: nna\\KCampbell “We mentioned at the roundtable that it was unfair treatment and that we did not agree,” the ministry’s statement said. Rate for Mexico lower than Canada\n\nMexico’s proposed tariff level is lower than Canada’s 35 per cent, with both letters citing fentanyl flows even though government data shows the amount of the drug seized at the Mexican border is significantly higher than the Canadian border. “Mexico has been helping me secure the border, BUT, what Mexico has done, is not enough. Mexico still has not stopped the Cartels who are trying to turn all of North America into a Narco-Trafficking Playground,” Trump wrote. China is the main source of the chemicals used to make the opioid fentanyl. According to US authorities, only 0.2 per cent of all fentanyl seized in the US comes from across the Canadian\n\nborder, while the vast majority originates from the US-Mexico border. Mexico sends more than 80 per cent of its total exported goods to the US and free trade with its northern neighbour drove Mexico to become the top US trading partner in 2023. The EU had initially hoped to strike a comprehensive trade agreement but more recently had scaled back its ambitions and shifted toward securing a broader framework deal similar to the one Britain brokered that leaves details to be negotiated.\n\nThe bloc is under conflicting pressures as powerhouse Germany urged a quick deal to safeguard its industry, while other EU members, such as France, have said EU negotiators should not cave into a one-sided deal on US terms. European Commission President Ursula von der Leyen said it “will take all necessary steps to safeguard EU interests”. Credit: AP Bernd Lange, head of the European Parliament’s trade committee, said Brussels should enact countermeasures as soon as Monday. “This is a slap in the face for the negotiations. This is no way to deal with a key trading partner,” Lange told Reuters. Jacob Funk Kirkegaard, a senior fellow at the Brussels-based think tank Bruegel, said Trump’s letter raised the risk of retaliatory moves by the EU similar to the flare-up between the US and China that rattled financial markets. “US and Chinese tariffs went up together and they came back down again. Not all the way down, but still down together,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/an-unusual-selection-why-selectors-dropped-lyon-for-the-first-time-since-2013-20250713-p5mei0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘An unusual selection’: Why selectors dropped Lyon for the first time since 2013",
        "publish_date": "Sun, 13 Jul 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: The first major sign that Nathan Lyon had been dropped from Australia’s side for the third Test against West Indies was the kick of a soccer ball.\n\nAbout 90 minutes before the start of play on Saturday (Sunday AEST) at Sabina Park in Jamaica, the 37-year-old was the first Australian player onto the field ahead of warm-ups. He wandered alone across the middle, without his spikes, aimlessly kicking a soccer ball and chatting quietly with support staff.\n\nOne member of staff offered a consoling pat on the back to the veteran of 139 Tests and 562 wickets.\n\nWhen Scott Boland grabbed a tape measure to mark his run-up and began splashing white paint on the ground, Lyon’s fate was effectively sealed. Official confirmation came at the toss, 30 minutes before play, at 4am back in Australia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/switkowski-swoops-as-dockers-over-run-hawks-in-perth-20250713-p5meix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Switkowski swoops as Dockers over-run Hawks in Perth",
        "publish_date": "Sun, 13 Jul 2025 09:29:22 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle goalsneak Sam Switkowski has made a stunning return from injury, kicking three goals to lead the Dockers to a gutsy 13-point win over Hawthorn at Optus Stadium.\n\nThe Dockers trailed by 13 points at the final change of Saturday night’s match, but kicked four goals to nil in the last quarter to seal the 12.5 (77) to 9.10 (64) win in front of 49,460 fans.\n\nSam Switkowski has made a stunning return from injury on Saturday night. Credit: Paul Kane/Getty Images\n\nThe result improved Fremantle’s record to 11-6, leaving them just percentage adrift of fourth spot.\n\nHawthorn are now also 11-6 after their four-match winning streak was snapped.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/can-t-run-with-the-big-dogs-park-separates-alphas-from-nervous-nellies-20250703-p5mc6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Can’t run with the big dogs? Park separates alphas from nervous nellies",
        "publish_date": "Sun, 13 Jul 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Cara Waters"
        ],
        "text": "A huge increase in pets in the City of Melbourne has led to more conflict at dog parks and in apartment buildings, and a trial to separate quiet dogs from their more assertive peers.\n\nThe number of registered animals in the CBD has jumped by 35 per cent since 2020, including a 59 per cent increase in dogs and an 18 per cent rise in cats.\n\nBrett Potts with his five-year-old beagle cross, Vera, at Eades dog park in West Melbourne. Credit: Chris Hopkins\n\nLocal Brett Potts said there used to be a handful of dog owners who would meet at the Flagstaff Gardens, but now when he goes there in the afternoons, he finds up to 40 dogs running around.\n\n“I think the volume that we’ve got at the moment is a hangover from COVID,” he says. “We saw a massive spike in dogs – that was our relief during COVID, right? We’d go to the park of an afternoon and socially distance from other owners as you’re walking your dog.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/anthony-albanese-arrives-in-china-for-six-day-visit-20250713-p5meit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese arrives in China for six-day visit",
        "publish_date": "Sun, 13 Jul 2025 08:59:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese arrives in China for six-day visit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-eight-results/rnlktbke9",
        "title": "Tour de France: Jonathan Milan wins stage eight; Australian Kaden Groves misses out",
        "publish_date": "Sat, 12 Jul 2025 21:30:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jonathan Milan has won stage eight of the Tour de France in a mass bunch sprint ahead of Wout van Aert and Kaden Groves.\n\n\n\n\n\nQueensland sprinter Groves came his closest yet to winning a stage at the Tour de France but ran out of steam as he had to settle for third place in Laval.\n\n\n\n\n\nOn a day for pure sprinters and with no change at the top of the overall rankings, Lidl-Trek's Milan was the first Italian to win a stage on the Tour since Vincenzo Nibali in the Alps in 2019.\n\n\n\n\n\nMilan, 24, took over the top of the sprint points rankings and had been wearing the green tunic in place of Tadej Pogacar, who had earned the sprint and the overall leader's yellow jersey by winning stage seven.\n\n\n\n\n\n\"It means a lot for me and also my country,\" Milan said.\n\n\n\nItalian Jonathan Milan and Belgian Wout van Aert sprint to the finish of stage eight of the 2025 Tour de France cycling. Source: SIPA USA / Jasper Jacobs \"I was placed in a perfect position to take this victory.\n\n\n\n\n\n\"And I'll try and win again tomorrow,\" he said of Sunday's flat stage also billed as one for the sprinters.\n\n\n\n\n\nPogacar retained the overall lead with Remco Evenepoel and Kevin Vauquelin rounding out the top three, with no change in the top 10 as the peloton kept its powder dry.\n\n\n\n\n\n\"It's nice to have a day like this,\" said 2020, 2021 and 2024 Tour winner Pogacar.\n\n\n\n\n\n\"It was a bit more relaxed and not necessary to push too hard in the sun all day.\n\n\n\n\"Especially as Monday is a brutal stage,\" the Slovenian added of the eight classified climbs and many more besides in a stage loaded with opportunities on France's national holiday in the Massif Central.\n\n\n\n\n\nPogacar, 26, also spoke of his teammate Joao Almeida who was hurt in a late fall Friday.\n\n\n\n\n\n\"It was good to see Joao finish the stage okay,\" he said.\n\n\n\n\n\n\"As I said, Monday is a brutal stage but nobody is expecting Joao to kill himself for a bike race,\" said Pogacar.\n\n\n\n\n\nA day after complaining of the heat and fatigue Pogacar also refused to be drawn on his participation at the Vuelta a Espana, the third and final Grand Tour of the season.\n\n\n\n\n\n\"I have to think about if I want to spend another month away from home,\" he said.\n\n\n\nFrench hopes dashed again\n\nBest young rider and Olympic champion Evenepoel hit a top speed of over 82kph (51mph).\n\n\n\n\n\n\"It was a nervy finale and I just wanted to stay up front in case of a fall,\" said Evenepoel\n\n\n\n\n\n\"It was a shame for Tim (Merlier, his team's sprinter) but he punctured in the run in,\" the 25-year-old Belgian added.\n\n\n\nThe remaining 177 riders from the original 184 rolled through the Brittany countryside with the harvest ongoing a month early and colossal crowds on the roadside.\n\n\n\n\n\nUnder clear blue skies and 31 degrees Celsius (88 degrees Fahrenheit) heat there was little inspiration in the peloton to breakaway until late in the day.\n\n\n\n\n\nFrench duo Mathieu Burgaudeau and Matteo Vercher attacked from 70km and the pair were only reeled in on the edge of finish town Laval after enthusiastic support on this Tour, which is based entirely on French soil but with no home winner yet.\n\n\n\n\n\nThe pair were awarded jointly the day's combativity award for their efforts.\n\n\n\nThe French Groupama-FDJ team is based in this region but their sprinter Paul Penhoet punctured 7km from home and failed to get back into the action in time for the finale.\n\n\n\n\n\nStage nine on Sunday heads south from Chinon to Chateauroux and is another flat affair with the focus on keeping hydrated in the heat and staying in the saddle.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-talks-to-family-creation-lawyer-sarah-jefford-on-australias-review-inrto-surrogacy-laws/wdhedoh95",
        "title": "SBS talks to family creation lawyer Sarah Jefford on Australia's review into surrogacy laws",
        "publish_date": "Sat, 12 Jul 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cultured-cuisine-when-your-chef-has-a-phd-in-cell-division/udqwlrkys",
        "title": "Cultured cuisine: when your chef has a PhD in cell division",
        "publish_date": "Sat, 12 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's the weekday lunch rush and diners at 'Kitchen by Mike' - a popular restaurant in the Sydney CBD are among the first in the country to try a curious new cuisine.\n\n\n\n\n\nAcclaimed chef Mike McEnearney's much-loved sourdough bread is now being served with what's known as 'cultured Japanese quail spread.'\n\n\n\n\n\n\"So the cultured quail is folded through the butter. I would describe it as incredibly strong and mammy flavor with a texture of butter. So if you like strong chickeny quail flavors, it's in the texture of butter on bread., it's delicious, it's almost like pâté.\"\n\n\n\n\n\nSo what makes it so unique?\n\n\n\n\n\nWell, the quail meat in the butter did not come from a farm, rather it was produced in factory in the inner Sydney suburb of Alexandria - about a 20 minute drive from the restaurant.\n\n\n\n\n\n'Cultured meat' is the process of taking a small amount of cells from an animal - in this case, a quail - and growing them in a factory-like setting to eventually produce a type of meat product.\n\n\n\n\n\n\"My first time in 35 years of cooking that I've seen a new category come to market. It's really exciting. It is brand new food.\"\n\n\n\n\n\nAnd the verdict from diners?\n\n\n\n\n\nDiner 1: \"Yeah I'd say it's pretty adventurous, Mike was mentioning it's pretty revolutionary. It's quite new in the industry so I'm glad to have tried it.\"\n\n\n\n\n\nDiner 2: \"Pâté, like a smokey pâté. Really unusual taste but quite nice, I'd definitely have it again. \"\n\n\n\n\n\nDiner 3: \"I really like the innovative nature of it and I think I'd be really happy to see it more on menus.”\n\n\n\n\n\nFrom hatted restaurants to pubs, around a dozen restaurants across Australia have this week begun serving the cultured quail. About a dozen more will have it on their menu by the end of the month.\n\n\n\n\n\nThe product is the brainchild of Australian start-up Vow, which in June became the first company in the country to be given the greenlight to sell cultured meat.\n\n\n\n\n\nIt follows a more than two year approval process by the food safety regulator, F-S-A-N-Z.\n\n\n\n\n\nEllen DInsmoor, Vow's Chief Operating Officer, insists the company is not trying to replace meat.\n\n\n\n\n\n\"So what we make is very unique in that it's not plant-based, we're not trying to recreate beef and other meats we eat today. We're taking different cells from other animals, growing those and then using them to make new food products.\"\n\n\n\n\n\nShe says the quail cells are grown in a bioreactor, which is essentially a large stainless steel tank, similar to what you might see in a brewery.\n\n\n\n\n\n\"We take actual cells from animals and we grow them in what I think of as a nutrient broth, which is essentially recreating the conditions in which cells grow in our body or in an animal's body that has amino acids, salts, sugars. At the end of the day, you can harvest those cells out. Maybe imagine that if you're making cheese and you are taking some of the whey off the top, that's kind of what it looks like when you harvest the cells out. And then we can take those cells as a really beautiful, pure ingredient, really rich form of protein, another nutrient, some craft those into finished food products.\"\n\n\n\n\n\nWhile the product only made its debut in Australia this month, for the past year, it's been available in Singapore - the first country globally to approve the sale of cultured meat.\n\n\n\n\n\nSo why produce food this way? Paul Wood, a Professor in Biotechnology at Monash University explains.\n\n\n\n\n\n\"Well, for some people it's because they don't want to see animals harmed. For others, it's an environmental thing. They believe that this is going to be a more sustainable way of producing food. Some just say it's a new food experience. So there's a range of ways that it's being sort of marketed to people.\"\n\n\n\n\n\nBut he says, until the industry scales at large it remains unclear whether it will be more sustainable than farming.\n\n\n\n\n\n\"It will use less land. It's a factory. It'll probably use less water. But we know already that on an energy basis, it's unlikely to be more sustainable because it's quite an energy intensive process. So you really need to be using totally renewable energy. And even then, if you compared it to growing an animal in a paddock, it's still a hell of a lot more intensive.\"\n\n\n\n\n\nHe says cost is another challenge, and when it comes to nutrition:\n\n\n\n\"It's unlikely, I think, to be better than a piece of meat, a three dimensional with a lot of iron in there, a lot of vitamins, B12, et cetera. So we talk about meat being an energy dense or a nutritionally dense product, you're going to have to add back minerals and vitamins to this product. There's only one single cell type.\"\n\n\n\n\n\nBut others believe the industry has a role to play in addressing future food challenges.\n\n\n\n\n\nBy some estimates, agricultural production will need to increase by around 60 percent by 2050 to meet the demands of the growing population.\n\n\n\n\n\nSam Perkins is the CEO of Cellular Agriculture Australia, a not-for-profit that seeks to advance cellular agriculture, which is the process of using cells to create products.\n\n\n\n\n\n\"We see cellular agriculture and the technologies that sit within it as a way of complimenting existing food supply chains and move towards a more future-proof food system where the technologies offer the potential to reduce greenhouse gas emissions, reduce land use and reduce water use, whilst also building resilience, particularly around things like climate shocks or supply chain disruptions and emerging threats like zoonotic diseases as we've seen recently through avian flu.\"\n\n\n\n\n\nThe technology is currently being harnessed to make everything from coffee to palm oil, leather and chocolate.\n\n\n\n\n\nBut scaling the industry remains a challenge and calls for better investment come as countries take steps to ban sale and consumption of cultured food, Italy, France and some US states among them.\n\n\n\n\n\nConcerns over quality and the threat to farmers are among the issues driving the pushback.\n\n\n\n\n\nThe Italian farm lobby has labelled it ‘Frankenstein meat.'\n\n\n\n\n\nPerkins says misconceptions around the concept of cultured meat are feeding 'unhelpful narratives.'\n\n\n\n\n\n\"One thing we hear a lot is references to things like lab-grown meat. Cell ag products aren't produced in labs, even if the original technology was developed by scientists. They're made in food manufacturing facilities that look far more like breweries than they do a science lab.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-13-july-2025/yj1es5n3r",
        "title": "Morning News Bulletin 13 July 2025",
        "publish_date": "Sat, 12 Jul 2025 20:55:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nEurope reacts to newly-announced tariffs by the United States\n\nFamilies of the Air India crash victims call for justice as a preliminary investigation is handed down\n\nIga Swiatek wins the women's final at Wimbledon, in an astounding show on centre court\n\nFrom August, European and Mexican imports to the United States will be subject to a 30 per cent tariff.\n\n\n\n\n\nThe news has come via letters from US President Donald Trump, posted to the Truth social and each addressed to Mexican and EU leaders.\n\n\n\n\n\nEuropean Union president Ursula Von der Leyen has returned her own statement - expressing concern with the move and its impact on global trade.\n\n\n\n\n\nShe writes that the EU is open to negotiate in coming weeks, while raising the threat import penalties could be laid on American goods coming into Europe.\n\n\n\n\n\n\"We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required. Meanwhile, we continue to deepen our global partnerships, firmly anchored in the principles of rules-based international trade.\"\n\n\n\n\n\n**\n\n\n\nPro-Palestine protesters have marched in the wake of a contentious plan to combat antisemitism.\n\n\n\n\n\nRallies have been held across the country in response to the report by Australia's Special Envoy to combat Antisemitism, Jillian Segal, which suggests axing support for publicly funded institutions and festivals that promote or fail to effectively deal with hate speech.\n\n\n\n\n\nCriticism of the report largely focuses on Ms Segal's recommendation Australia adopt the International Holocaust Remembrance Alliance's definition of antisemitism, some arguing that it will lead to heavy-handed silencing of free speech and a conflation of antisemitism with criticism of Israel and Zionism.\n\n\n\n\n\nBen Saul – chair of international law at the University of Sydney, and U-N special rapporteur on human rights and counter terrorism – has told SBS News the definition is inappropriate, vague and overbroad.\n\n\n\n\n\n\"The real concern lies with some of the examples given under the IHRA definition, which really conflates legitimate criticism of Israel with antisemitism. So I think this approach is counterproductive because when the definition is so divisive, it's not going to be a unifying force to build consensus in the community on what is antisemitism.\"\n\n\n\n\n\n**\n\n\n\n\n\nChinese Foreign Minister Wang Yi says his country is ready to promote a comprehensive strategic partnership with Australia through a more proactive approach.\n\n\n\n\n\nHe says that includes working with Australia to prepare for the next stage of high-level exchanges, and properly managing their differences.\n\n\n\n\n\nWang has made the remarks during a meeting with Australian Foreign Minister Penny Wong in the Malaysian capital, on the sidelines of the ASEAN Foreign Ministers' Meeting.\n\n\n\n\n\nMinister Wong says Australia is also committed to developing a positive and pragmatic relationship.\n\n\n\n\n\n**\n\n\n\n\n\nThe families of the Air India crash victims are calling for justice, as a preliminary investigation into the events reveals confusion in the cockpit shortly before impact.\n\n\n\n\n\nA 15-page report, issued by India's Aircraft Accident Investigation Bureau on Saturday, has revealed both pilots questioning a fuel switch setting that was turned off, starving the engines shortly after take-off.\n\n\n\n\n\nThe preliminary report does not say how the switch could have flipped to the cut-off position on the June 12 London-bound flight from the Indian city of Ahmedabad.\n\n\n\n\n\nBut father of plane crash victim, Naresh Maheswari, says those responsible must be held accountable.\n\n\n\n\n\n\"We want the investigation to be neutral and the perpetrators to be punished. We have lost what we were destined to lose, but we want no one else to die due to such carelessness.\"\n\n\n\n\n\n**\n\n\n\n\n\nIga Swiatek has become the first Polish player to win a Wimbledon singles title, thrashing American Amanda Anisimova in just 57 minutes.\n\n\n\n\n\nIt's the first time a Wimbledon final has been won 6-0 6-0 in 114 years, the win earning the Polish 24 year old her sixth grand slam title.\n\n\n\n\n\nSwiatek dropped only two games in her semi-final against Belinda Bencic, and was even more ruthless in the final, clinching victory with a backhand winner.\n\n\n\n\n\nHaving never gone beyond the Wimbledon quarter-finals before this year, despite winning four French Open crowns, she says the result has come as a shock.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/product-makers-taking-home-the-chocolates-in-indigenous-business-boom/okck08wip",
        "title": "Product makers taking home the chocolates in Indigenous business boom",
        "publish_date": "Sat, 12 Jul 2025 06:29:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"I'm going to have the world saying Jala Jala. But my dream is to have my own store that is inclusive of tourism, as well as manufacturing, that I can showcase on a grand scale to honour myself, chocolate, my culture, and have it as an inclusive place to come and be and experience.\"\n\n\n\n\n\nThat's entrepreneur Sharon Brindley, founder of Jala Jala Treats, Victoria's largest Indigenous female-owned food manufacturing company.\n\n\n\n\n\nThe Yamatji and Noongar woman is now beginning the process of exporting her range of native-ingredient chocolates and teas to Japan, Singapore and Malaysia.\n\n\n\n\n\n\"It's stressful, it's hard, but it;s probably the most worthwhile thing I've ever done. It's given me a sense of self pride, it's filled my cup, it's grown my community to a global point.\"\n\n\n\n\n\nHer export dreams are being assisted by Asialink, the national centre for engagement with Asia based at the University of Melbourne, whose chief executive says businesses like Ms Brindley's resonate with markets in the region like never before.\n\n\n\n\n\nMr Howard says there is a real demand for Indigenous products overseas.\n\n\n\n\n\n\"Australian businesses, exporters, need to be really thinking about what's going to differentiate them in the market. That's why I think First Nations exporters and a lot of products they offer have a real edge and they should lean into that, but also think about where they can match that with the type of consumer segment that they are targeting.\"\n\n\n\n\n\nData from Austrade shows Indigenous goods exporters generated more than $670 million in turnover in 2022/23.\n\n\n\n\n\nNow a new report from Supply Nation - a non-profit that provides Australia's biggest database of Indigenous businesses - has found that Indigenous businesses create more than 42 billion dollars of social value each year.\n\n\n\n\n\nSupply Nation CEO and Awabakal woman Kate Russell says the benefits are wide reaching - impacting business owners, their employees and communities.\n\n\n\n\n\n\"The way we are defining social value is through an Indigenous lens of wellbeing. But this can include mental health, physical health, education, housing, as well as a sense of pride and aspiration for our Indigenous business, their households, and their Indigenous employees.\"\n\n\n\n\n\nShe says every dollar of revenue equates to three dollars and sixty-six cents of social and economic value.\n\n\n\n\n\n\"Importantly those entrepreneurs are generating that value purely by operating...because there shouldn't be an expectation on Indigenous businesses to go above and beyond, and provide programs that we would not expect the average small to medium enterprise to provide.\"\n\n\n\n\n\nMs Brindley can attest to that.\n\n\n\n\n\nShe says she created her chocolate company as a way to share language through food.\n\n\n\n\n\n\"The demand is really growing for the need for our stories that are attached to the foods. I'm not just a chocolate maker, I'm more than that, I'm more than chocolate.\"\n\n\n\n\n\nIndigenous businesses are also having an economic impact at home in Australia.\n\n\n\n\n\nThe federal government's own Indigenous procurement target has been increased to 3 percent for this financial year, with the aim to reach 4 percent by the end of the decade.\n\n\n\n\n\nA recent Commonwealth audit found two-thirds of contracts had been exempt by government departments since 2016, and often without any justification.\n\n\n\n\n\nThe government has said the National Indigenous Australians Agency is working to develop stronger processes.\n\n\n\n\n\nLooking beyond the challenges, business owners like Ms Brindley have their eyes on the future.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/one-in-seven-australians-are-on-this-medication-but-some-have-strange-symptoms-coming-off-it/mrb82ctqx",
        "title": "One in seven Australians are on this medication and some have 'strange' symptoms coming off",
        "publish_date": "Sat, 12 Jul 2025 05:25:08 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Antidepressants are some of the most commonly prescribed medications globally and in Australia, but knowledge of how they work and how hard it is to come off them remains highly contested.\n\n\n\n\n\nData from the Australian Institute of Health and Welfare shows nearly four million Australians — roughly one in seven — take antidepressants.\n\n\n\n\n\nA large systematic review of research into the process of withdrawing from the drugs was published this week, but it quickly faced backlash from some psychiatrists and experts.\n\n\n\n\n\nThe authors found coming off antidepressants after short-term use was not associated with a \"clinically significant\" risk of withdrawal symptoms. However, long-term antidepressant use — that is longer than 12 months — is increasingly common and comes with a greater risk of harm.\n\n\n\n\n\nThe review found withdrawal symptoms — such as dizziness, nausea, vertigo — occur in a minority of cases, but they are on average manageable and not severe, especially with proper clinical support.\n\n\n\n\n\nThe authors suggest that depression after stopping antidepressants is probably a relapse of the original mental health condition, as the results were similar among placebo groups.\n\n\n\nThe meta-analysis examined the findings of 50 randomised controlled trials, involving 17,828 participants.\n\n\n\n\n\nThe review published in JAMA Psychiatry included 38 studies with an observation period longer than two weeks, the critical time frame during which withdrawal symptoms are expected to occur.\n\n\n\n\n\nThe average age of the participants was 44, and 70 per cent were female. In Australia, women are prescribed antidepressants at 1.5 times the rate of men — a trend that's seen in other parts of the world.\n\n\n\n\n\nSome health professionals say the review provides useful insights, despite its limitations, while others have been highly critical.\n\n\n\n\n\nUK antidepressant researchers Mark Horowitz and Julie Moncrieff said the review \"risks underestimating the potential harms to long-term antidepressant users by focusing on short-term, industry-funded studies.\"\n\n\n\n\n\nSeveral of the JAMA Psychiatry article's senior authors declared receiving payments from drug companies.\n\n\n\n\n\nHorowitz and Moncrieff argue that the article's \"main analysis\" is based on eleven trials, six of which looked at people who had taken antidepressants for eight weeks and four for 12 weeks.\n\n\n\n\n\n\"There is growing recognition that stopping antidepressants — especially after long-term use — can cause severe and sometimes debilitating withdrawal symptoms, and it is now acknowledged by the UK government as a public health issue,\" they wrote in The Conversation.\n\n\n\nNew resources have been developed to support people safely stopping the use of antidepressants over time usually months, through what's called a tapering plan.\n\n\n\n\n\nThe Maudsley Deprescribing Guidelines, published last year and co-authored by Horowitz, has been accepted by the Royal Australian College of General Practitioners as an Accepted Clinical Resource.\n\n\n\nOn again, off again antidepressant prescriptions\n\nAllied health professional Kizzy said she never wanted to be reliant on anti-depressants and has stopped taking them twice in the past.\n\n\n\n\n\n\"I was initially quite resistant to any kind of medication, but I got to a point a couple of years ago ... where I was really struggling with suicidal thoughts and just being able to function and do things because of my mood, and all of these horrible feelings and thoughts I was having, and finally got convinced to try sertraline\".\n\n\n\n\n\nShe said she noticed the drug — a commonly prescribed antidepressant sometimes sold under the name Zoloft — was making her feel \"numb\".\n\n\n\n\n\n\"My hope is that I can one day be not require antidepressants and still maintain this level of functioning and mental health,\" she said adding that her current medication \"potentially affects\" her liver.\n\n\n\n\n\nThe United States National Library of Medicine says liver abnormalities reportedly occur in around 1 per cent of people who take sertraline, \"but elevations are usually modest and infrequently require dose modification or discontinuation\".\n\n\n\nProfessor Paul Fitzgerald is the director of the School of Medicine and Psychology at Australian National University and a member of the Royal Australian and New Zealand College of Psychiatrists.\n\n\n\n\n\nHe was not involved in the review.\n\n\n\n\n\nHe said it's important to be aware of the more severe cases of side effects.\n\n\n\n\n\n\"There are some unusual symptoms that patients experience. The most dramatic one the patients find quite disturbing is the phenomena that patients often talk about as brain zaps.\"\n\n\n\n\n\n\"They get this very strange sensation of electrical zaps in their head or down their spinal cord, and if they haven't been warned about it, it can be quite distressing. It just seems strange.\"\n\n\n\n\n\nHe said it's unclear from this latest review whether the symptoms recorded by researchers are a relapse of a previous mental health condition or withdrawal effects from discontinuing antidepressants.\n\n\n\n\n\n\"What happens when somebody's stopping a medication and their underlying symptoms of their condition get worse?\n\n\n\n\n\n\"In other words, start to experience more depression or more anxiety, and it can be really difficult to know under those circumstances.\n\n\n\n\n\n\"Are those symptoms that they're experiencing some sort of discontinuation or is it really just the symptoms of the illness coming back because the treatment's been withdrawn?\"\n\n\n\nREAD MORE When builder Jamie was struggling he broke an unwritten 'code'. It saved his life\n\nSonya Morrissey is the national GP adviser at Headspace, a platform supporting the mental health and wellbeing of younger people.\n\n\n\n\n\nShe said that, in the past, patients weren't sufficiently warned about discontinuation symptoms of antidepressants.\n\n\n\n\n\n\"It is something that we are, I think, recognising more and there's lots more research being done now, which is great, although there's not a significant amount of research yet in the cohort that we see, which is the 12 to 25 year olds,\" she said.\n\n\n\n\n\nShe said antidepressants are not their first line of treatment at Headspace, but will be used occasionally if needed.\n\n\n\nLISTEN TO What are the withdrawal effects of antidepressants? A new review explores the issue SBS News 11/07/2025 08:17 English\n\nThe Royal Australian College of General Practitioners' Western Australia vice-president, Dr Ramya Raman, said the recently published meta-analysis still provides useful insight for GPs but said more research on withdrawing from long-term anti-depressant use was needed.\n\n\n\n\n\nShe also highlighted the importance of a good doctor-patient relationship when withdrawing from psychiatric medication.\n\n\n\n\n\n\"When weaning off of the medication and there is a trusted relationship with the GP, and a regular follow-up with that doctor, the risk of having the discontinuation symptoms are less of a concern compared to when patients actually abruptly stop it.\n\n\n\n\n\nKizzy also said finding a GP with an interest in mental health can make a big difference when navigating the use of antidepressants and the withdrawal process.\n\n\n\n\n\n\"I think it's important to find a GP who has a genuine interest in that area rather than just going to your generic GP, finding a regular one who you know can rely on, who can really support you and speak to you in a way that you're going to feel respected and really understood.\n\n\n\n\n\n\"And I think that's a really important kind of foundation support to have because once you have that, then you will feel safe enough to be checking in with them, sharing all your concerns, talking about coming off or going on or switching medications and still be okay through all of that.\"\n\n\n\n\n\nReaders seeking crisis support can ring Lifeline on 13 11 14 or text 0477 13 11 14, the Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged up to 25). More information and support with mental health is available at beyondblue.org.au and on 1300 22 4636.\n\n\n\n\n\nEmbrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/cultured-meat-delicious-alternative-or-frankenstein-food/j7civ5efc",
        "title": "'Delicious', ethical option or 'Frankenstein' food? Cultured meat has hit Australian menus",
        "publish_date": "Sat, 12 Jul 2025 01:17:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's the weekday lunch rush and diners at Kitchen by Mike, a popular restaurant in the Sydney CBD, are among the first in the country to try a curious new cuisine.\n\n\n\n\n\nAcclaimed chef Mike McEnearney's much-loved sourdough bread is now being served with what's known as \"cultured Japanese quail spread\".\n\n\n\n\n\n\"The cultured quail is folded through the butter. If you like strong chickeny quail flavours, it's in the texture of butter on bread. It's delicious, it's almost like pâté,\" McEnearney said.\n\n\n\n\n\nBut what makes it so unique?\n\n\n\n\n\nWell, the quail meat in the butter did not come from a farm; rather, it was produced in a factory in the inner Sydney suburb of Alexandria, about a 20-minute drive from the restaurant.\n\n\n\nChef Mike McEnearney's popular sourdough bread is now being served with cultured quail compound butter at a restaurant in Sydney. Source: SBS News Cultured meat is the process of taking a small number of cells from an animal, in this case, a quail, and growing them in a controlled environment to eventually produce a type of meat product.\n\n\n\n\n\n\"[It's] my first time in 35 years of cooking that I've seen a new category come to market. It's really exciting. It is brand new food,\" McEnearney said.\n\n\n\n\n\nAnd the verdict from diners?\n\n\n\n\n\nAngelo, a regular customer, described it as \"delicious\".\n\n\n\n\n\n\"I'd say it's pretty adventurous. It's quite new in the industry, so I'm glad to have tried it,\" he said.\n\n\n\n\n\n\"I really like the innovative nature of it, and I think I'd be really happy to see it more on menus,\" another patron, Benjamin Heenan, told SBS News.\n\n\n\nCultured meat: From cells to steak\n\nFrom hatted restaurants to pubs, around a dozen restaurants across Australia have started serving the cultured quail. About a dozen more will have it on their menu by the end of the month.\n\n\n\n\n\nThe product is the brainchild of Australian start-up Vow, which in June became the first company in the country to receive approval to sell cultured meat.\n\n\n\nIt follows a more than two-year approval process by the food safety regulator, Food Standards Australia New Zealand.\n\n\n\n\n\nEllen Dinsmoor, Vow's CEO, insists the company is not trying to replace meat.\n\n\n\n\n\n\"What we make is very unique in that it's not plant-based, we're not trying to recreate beef and other meats we eat today. We're taking different cells from other animals, growing those and then using them to make new food products,\" she told SBS News.\n\n\n\n\n\nDinsmoor said the quail cells are grown in a bioreactor, which is essentially a large stainless steel tank, similar to those found in a brewery.\n\n\n\n\n\n\"We take actual cells from animals and we grow them in what I think of as a nutrient broth. At the end of the day, you can harvest those cells out,\" she explained.\n\n\n\nVow's CEO, Ellen Dinsmoor, said the company is not trying to replace regular meat, but is using unique ways to create new products. Source: SBS News \"Maybe imagine that if you're making cheese and you are taking some of the whey off the top, that's kind of what it looks like,\" Dinsmoor said.\n\n\n\n\n\nWhile the product only made its debut in Australia this month, it has been available in Singapore for the past year — the first country globally to approve the sale of cultured meat.\n\n\n\nWhy grow food in a factory?\n\nPaul Wood, an adjunct professor in biotechnology at Monash University, said: \"Well, for some people, it's because they don't want to see animals harmed. For others, it's an environmental thing. They believe that this is going to be a more sustainable way of producing food.\"\n\n\n\n\n\n\"Some just say it's a new food experience. So there's a range of ways that it's being sort of marketed to people,\" he said.\n\n\n\n\n\nBut Wood said until the industry scales up significantly, it remains unclear whether it will be more sustainable than farming.\n\n\n\n\"It will use less land. It's a factory. It'll probably use less water. But we already know that on an energy basis, it's unlikely to be more sustainable because it's quite an energy-intensive process,\" Wood said.\n\n\n\n\n\n\"So you really need to be using totally renewable energy. And even then, if you compare it to growing an animal in a paddock, it's still a hell of a lot more intensive.\"\n\n\n\n\n\nHe said cost is another challenge, and when it comes to nutrition: \"It's unlikely, I think, to be better than a piece of meat.\"\n\n\n\n\n\nBut others believe the industry has a role to play in addressing future food challenges.\n\n\n\n\n\nAccording to the United Nations Food and Agriculture Organization, agricultural production will need to increase by approximately 60 per cent to meet global food demand by 2050.\n\n\n\nThe animal cells are grown inside a large stainless steel tank in what Vow describes as a \"nutrient-dense broth\". Credit: Supplied / Vow Sam Perkins is the CEO of Cellular Agriculture Australia, a not-for-profit that aims to advance cellular agriculture, a process that utilises cells and innovative biotechnologies to produce new ingredients, food and agricultural products.\n\n\n\n\n\n\"It's widely recognised that we're not going to be able to do that sustainably using existing methods alone,\" he said.\n\n\n\n\n\n\"We see cellular agriculture and the technologies that sit within it as a way of complementing existing food supply chains … where the technologies offer the potential to reduce greenhouse gas emissions, reduce land use and reduce water use, whilst also building resilience, particularly around things like climate shocks or supply chain disruptions.\"\n\n\n\n\n\nThe technology is being harnessed to make everything from coffee to palm oil, leather and chocolate.\n\n\n\n'Frankenstein meat'\n\nThere are calls for better investment in the industry as countries take steps to ban the sale and consumption of cultured food, including Italy, France, and some states in the United States. Concerns over quality and the threat to farmers are among the issues driving the pushback.\n\n\n\n\n\nThe Italian farm lobby has previously labelled cultured meat \"Frankenstein meat\".\n\n\n\nPerkins said misconceptions are feeding \"unhelpful narratives\" about the industry.\n\n\n\n\n\n\"One thing we hear a lot is references to things like lab-grown meat. Cell ag products aren't produced in labs, even if the original technology was developed by scientists. They're made in food manufacturing facilities that look far more like breweries than they do a science lab,\" he said.\n\n\n\n\n\nBut the industry has a long way to go.\n\n\n\n\n\nVow is one of only three companies globally approved to sell cultured meat. Getting governments, investors, and consumers on board remains a challenge.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/murujuga-rock-art-wins-world-heritage-listing-but-fears-remain/3nt19s61b",
        "title": "Gas plant critics warn 'world is now watching' after Murujuga gets World Heritage listing",
        "publish_date": "Sat, 12 Jul 2025 00:50:16 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "More than a million pieces of ancient rock art have secured World Heritage status in a bittersweet listing for environmentalists and traditional custodians fearful nearby industrial activity is damaging the engravings.\n\n\n\n\n\nThe Murujuga rock art landscape in Western Australia was listed by the United Nations Educational, Scientific and Cultural Organisation (UNESCO) as a heritage site on Friday after intense lobbying by the federal government.\n\n\n\n\n\n\"For more than 50,000 years, the Ngarda-Ngarli people have protected and managed this significant land and seascape — and today, I am proud to announce that Murujuga will receive another level of protection via the World Heritage system,\" Environment Minister Murray Watt said while visiting the organisation's headquarters in Paris.\n\n\n\n\n\n\"Achieving World Heritage status ensures stronger protections under Australian legislation and will allow the world to celebrate this unique cultural landscape,\" the minister added.\n\n\n\n\n\nWatt, who was accompanied on his trip by representatives from the Western Australian government and Murujuga Aboriginal Corporation, said the World Heritage nomination \"had the free, prior and informed consent of the five language groups who all come together to care for Murujuga today\".\n\n\n\nMurujuga Aboriginal Corporation director Peter Hicks said the nomination \"was led by Aboriginal people, for Aboriginal people and guided by Aboriginal people. And therefore, it is world-first.\"\n\n\n\n\n\nAnother director, Belinda Churnside, said the listing \"was a testament to the true dedication, commitment and resilience of Aboriginal people\".\n\n\n\n\n\nMurujuga contains the world's largest, densest and most diverse collection of rock art engravings — known as petroglyphs — and some are estimated to be more than 50,000 years old.\n\n\n\n\n\nThey depict animals, plants and human figures, and are visible due to the colour and contrast between the removed varnish layer and the underlying brighter weathered rind of the host rocks.\n\n\n\n\n\nThe site, which has been called the oldest art gallery in the world , was previously put forward to UNESCO in 2023 but Australia's application was referred back in May.\n\n\n\nWoodside's North West Shelf gas processing plan sits alongside the Murujuga Cultural Landscape in Burrup Peninsula, Western Australia. Source: Supplied / Save Our Songlines / Conservation Council of Western Australia UNESCO recommended state and federal governments address concerns that nearby acid emissions, including those from Woodside's Burrup gas hub, were degrading the art.\n\n\n\n\n\nThe peninsula in northwest WA near Karratha is home to two gas plants, a fertiliser plant and iron ore and salt export facilities.\n\n\n\n\n\nWatt recently gave provisional approval for a Woodside project on the peninsula to continue operating until 2070.\n\n\n\n\n\nSpeaking after UNESCO's announcement today, Watt said: \"In the end, what persuaded the committee was both the scientific evidence that was put forward, which disputed some of the claims that were being made, but also the genuine passion from the Traditional Owners to see this World Heritage listing be secured.\"\n\n\n\n\n\nThe 21 UNESCO member nations voted unanimously in support of the listing but requested that Australia continue to research and monitor the effects of industry on the rock art.\n\n\n\nEnvironmentalists, Traditional Custodians vow to continue fight\n\nWhile environmentalists welcomed the heritage listing, they warned that the Woodside project extension could cause further damage.\n\n\n\n\n\n\"The world is now watching,\" Australian Conservation Foundation chief executive Kelly O'Shanassy said.\n\n\n\n\n\n\"The onus is on the Australian government to make sure the values recognised by UNESCO are not jeopardised by ongoing industrial pollution. If the federal government is serious about protecting Murujuga and making sure it is not moved to an \"in danger\" list, Senator Watt should reject the gas hub's proposed expansion,\" O'Shanassy added.\n\n\n\n\n\nMardathoonera woman and Murujuga traditional custodian Raelene Cooper, who was at the UNESCO meeting, welcomed the World Heritage listing but criticised the removal of recommended protections, including halting industry expansion.\n\n\n\n\n\n\"Today, Australia rewrote the World Heritage listing in the interests of the gas industry,\" she said.\n\n\n\n\n\nHowever, she said it was \"a momentous day for our old people and our future generations, to have Murujuga's outstanding universal heritage values recognised by the world\".\n\n\n\nREAD MORE Surface tension: Murujuga World Heritage listing at risk from industrial emissions\n\n\"Meanwhile, fertiliser plants are still being built around our sacred sites and polluting gas plants will emit toxic acid on our rock art for another 50 years.\n\n\n\n\n\n\"We will continue to fight for protection for this very special place, and the world is now aware of what we are up against.\"\n\n\n\n\n\nWoodside said the listing was \"well-deserved global recognition of the petroglyphs and the unique living cultural values of Murujuga\" to Australia and the world.\n\n\n\n\n\n\"Woodside has been a proud supporter of the World Heritage nomination and assessment process. We look forward to continuing to work closely with the Murujuga Aboriginal Corporation and Traditional Custodians on the continued protection and management of this globally significant area,\" the company said in a statement sent to SBS News.\n\n\n\nMardathoonera woman Raelene Cooper, a former Chair of the Murujuga Aboriginal Corporation, has previously said she was \"sickened\" by Environment Minister Murray Watt's decision to grant Woodside a 40-year extension to its North West Shelf project. Source: Supplied / Raelene Cooper Greens Leader Larissa Waters joined the chorus of advocate voices in urging Senator Watt to cancel the approval for the North West Shelf project.\n\n\n\n\n\n\"UNESCO had warned that Woodside's gas plant threatened the longevity of the rock art prior to the listing, but Minister Watt successfully lobbied other nations when he should have simply rejected Woodside's climate bomb extension in the first place,\" she said.\n\n\n\n\n\nWoodside has estimated that keeping the North-West Shelf operating until 2070 could lead to emissions of up to 4.3 billion tons tonnes of carbon dioxide equivalent (CO 2 -e), the majority of which will come from exported fossil fuel products.\n\n\n\n\n\nThat's over nine times Australia's total annual emissions, which currently sit around 440.2 million tonnes CO 2 -e.\n\n\n\nSenator Waters added that world heritage laws should be bolstered to better protect listed sites.\n\n\n\n\n\nAustralia has 21 properties on the World Heritage list, which includes the Budj Bim Cultural Landscape, Uluru-Kata Tjuta National Park and the Great Barrier Reef.\n\n\n\n\n\nUNESCO added several other sites to its list, including the Xixia Imperial Tombs in China and the Faya Palaeolandscape in the United Arab Emirates.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-seven-results/xui631inx",
        "title": "Tour de France: Pogacar pounces to retake lead after stage seven",
        "publish_date": "Fri, 11 Jul 2025 21:07:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tadej Pogacar won stage seven of the Tour de France to regain the overall lead with a trademark burst up the short, steep slope of the Mur de Bretagne.\n\n\n\n\n\nVisma's Jonas Vingegaard was second, doggedly staying right on Pogacar's wheel to the line with Briton Oscar Onley third after a late nine-rider pile-up marred the finale.\n\n\n\n\n\nOn his 19th career Tour de France stage win the 26-year-old Pogacar gained four seconds on Vingegaard with 10 bonus seconds to the Dane's six.\n\n\n\n\n\n\"It was super hot today, and super fast but we had a plan and we stuck to it,\" said the Team UAE rider who was champion in 2020, 2021 and 2024.\n\n\n\n\n\nIn the overall standings, Remco Evenepoel is second overall at 54 seconds after coming in sixth on the day, two seconds adrift.\n\n\n\nREAD MORE Think you could race the Tour de France? Explore the 2025 map and key stats\n\n\"The Tour de France isn't over yet,\" said Evenepoel, who lost time in a crosswind on the opening day before winning the stage five individual time-trial.\n\n\n\n\n\nFrench starlet Kevin Vauquelin continues his bright run in third at 1min 11sec while two-time champion Vingegaard is fourth at 1min 17sec.\n\n\n\n\n\nFans cheered for Vauquelin along much of the route. On Thursday a hot-air balloon flew over the peloton with his face on it.\n\n\n\n\n\n\"All you could hear was 'Kevin, Kevin' all along the road, it's so good to have a new face competing with us,\" said Pogacar.\n\n\n\n\n\nThe overnight leader Mathieu van der Poel rounds out the top five at 1min 29sec after wilting on the final climb, the scene of his 2021 coming of age win and his first yellow jersey.\n\n\n\n\n\n\"I kind of knew I was going to lose the yellow jersey here, but it was a special occasion for me coming back here. It was a great day,\" said the Dutch rider who climbed top of the overall rankings Thursday.\n\n\n\n\n\nThe day's action revolved around two ascents of the Mur de Bretagne, a 2km climb at an average of six percent, that has been written into Tour de France folklore.\n\n\n\n\n\nWith the Tour returning to Brittany after a four-year gap, huge festive crowds packed the villages and pretty country lanes as the temperature hit 30 degrees Celsius (86 Fahrenheit).\n\n\n\n\n\nThe 179 remaining riders left Saint Malo on the north-west coast passing the magnificent Sillon beach with its granite sea wall and chic seafront buildings.\n\n\n\nInjured Almeida rides on\n\nKey Pogacar teammate Joao Almeida fell ahead of the second climb of the Mur de Bretagne, but despite sustaining a rib fracture he is due to make the start line for Saturday's flat run to Laval.\n\n\n\n\n\n\"I really hope he's okay, he's on his way for an x-ray. I'm proud of how he's been riding. He's done an amazing job. It would have been a perfect day,\" Pogacar said.\n\n\n\n\n\n\"I dedicate this victory to him,\" he added.\n\n\n\n\n\nLater UAE's team doctor Adrian Rotunno reported: \"It's confirmed he has an uncomplicated left-sided rib fracture, as well as some profound abrasions to his body. Fortunately no concussion.\"\n\n\n\n\n\nRotunno added: \"The next few days will be difficult for him, but at this point, he should be able to start tomorrow's stage.\"\n\n\n\n\n\nIn the best form of his career Almeida had been a candidate for a place on the podium in Paris, but has slipped to 12min 21sec off the pace in the overall standings.\n\n\n\n\n\nFor Bahrain Victorious their Tour de France appears massively compromised.\n\n\n\n\n\nNot only did the Australian rider Jack Haig leave the Tour after the fall 6km from the line, their leader Santiago Buitrago finished 13min down on the day and left the medical centre holding his right arm to his side.\n\n\n\n\n\nOne man who negotiated the crash well was Ireland's Ben Healy.\n\n\n\n\n\nThe sixth stage winner managed to fall sideways into the heap and roll over it, before remounting immediately to finish a respectable 26th.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-hermit-crabs-are-in-demand-but-some-want-the-trade-banned/7fx0yvnsq",
        "title": "Australia's hermit crabs are in demand globally but some want the trade banned",
        "publish_date": "Fri, 11 Jul 2025 20:38:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "A push to export hermit crabs from Western Australia has sparked criticism, with one political party calling to ban the trade over concerns about animal welfare and environmental impact.\n\n\n\n\n\nMerv Cooper runs Crazy Crabs in Western Australia — a business operating since 1979, specialising in the sale of Australian land hermit crabs. He sells these to Australian pet stories, and also exports them internationally to locations including Hong Kong and the United States.\n\n\n\n\n\nBut his export permit expired late last year and the federal Department of Climate Change, Energy, the Environment and Water (DCCEEW) is now assessing a three-year extension — a move the Animal Justice Party says would be \"reckless and short-sighted\".\n\n\n\n\n\nSBS News attempted to contact Cooper for comment but he was unavailable.\n\n\n\n\n\nExperts say it's difficult to know whether harvesting the crustaceans is sustainable, due to regulatory gaps in Australia's hermit crab trade.\n\n\n\nA little-known industry\n\nThe species — Coenobita variabilis — is endemic to Australia, found only along the north-western coast of Western Australia and in parts of the Northern Territory.\n\n\n\n\n\nIn its proposal to the DCCEEW, Crazy Crabs said the business collects on average 30,000 crabs each. In summer, he and a small crew head out for four to six days at a time, collecting crabs at night on foot using torches and buckets. \"Really small\" crabs are left on the beach.\n\n\n\n\n\nIt says collections happen \"only a couple of times a year\" and these don't \"appear to have any detriment on populations\".\n\n\n\n\n\nBut reliable data on hermit crab harvesting is scarce.\n\n\n\nDuring a typical year, Merv Cooper collects 30,000 crabs from Western Australian beaches — which he sends off to pet shops across Australia. Source: Getty / Jamie La Australian states and territories are responsible for domestic trade, including licensing requirements. This makes it difficult to determine the exact number of active hermit crab export operators in Australia, the quantity of crabs they collect, and the potential impact of this activity.\n\n\n\n\n\nAccording to an ABC report in 2022, WA Fisheries data indicated around 80,000 land hermit crabs were collected by two active operators that year. At the time, they estimated the commercial value of a hermit crab licence to be between $1 million and $5 million.\n\n\n\n\n\nA DCCEEW spokesperson said the federal government \"strictly regulates commercial trade in wildlife and wildlife products from Australian native species, such as hermit crabs.\n\n\n\n\n\nAnimal Justice Party MPs say the application highlights a lack of scientific rigour in how such trades are assessed — and could open the door to further exploitation.\n\n\n\n\n\n\"This proposal is a stark example of the federal government's failure to uphold rigorous scientific and environmental standards,\" said Victorian upper house MP Georgie Purcell,\n\n\n\n\n\n\"Allowing the commercial export of a native species without comprehensive ecological assessments is reckless and short-sighted.\"\n\n\n\n\n\nWA upper house MP Amanda Dorn said she is concerned that if the trade is allowed to continue with little regulation, \"fragile ecosystems\" could be \"irreversibly\" damaged.\n\n\n\n\n\nIn its proposal, Crazy Crabs said WA's Department of Primary Industries and Regional Development does not consider Coenobita variabilis to be in need of formal management plans for protection.\n\n\n\n\n\nIt said the number of crabs and the locations where they were collected are reported monthly, as required by state licensing laws.\n\n\n\n\n\n\"I have been collecting Hermit crabs for over 50 years and have never seen any need for restrictions,\" the proposal reads.\" I don’t go to all places every year, hence there is always plenty of hermit crabs.\"\n\n\n\n\n\nTim Nichols, a manager at WA Fisheries, told the ABC in 2022 the species was abundant and their population was unlikely to be affected by the current level of fishing.\n\n\n\n'Relying on self-reporting': Expert raises concerns\n\nKim Feddema, a wildlife trade expert and lecturer at Edith Cowan University, said the trade relies heavily on licence-holders to assess their own environmental impact, with no baseline population data or independent monitoring.\n\n\n\n\n\n\"We need to understand how many hermit crabs are actually in those locations and what role they play in the broader ecology,\" she told SBS News. \"Without baseline data, there's no way to judge the sustainability of this kind of trade.\"\n\n\n\n\n\nWhile the international export of native species is subject to federal regulation, hermit crabs are not formally listed as protected. Invertebrates often fall through regulatory gaps, Feddema said, because they're harder to monitor and traditionally not perceived as sentient.\n\n\n\nKim Feddema, a wildlife trade expert, said more regulation is necessary in the industry to ensure the welfare of hermit crabs and to understand the environmental implications of their removal. Credit: Stephen Heath / Edith Cowan University Globally, land hermit crabs are harvested for both the pet and shell trade. While shells are often sold as decorations, Feddema notes they once housed live animals.\n\n\n\n\n\n\"People often perceive [shells] to be empty, but there is a live animal within them before that stage,\" she said.\n\n\n\n\n\nAcross Asia, including Thailand and Japan, this dual trade has already been linked to population declines. While Australia requires permits to collect hermit crabs at a commercial level, enforcement is limited and operators are not independently monitored.\n\n\n\n\n\n\"We're relying on self-reporting here,\" Feddema said. \"There's no verification of what's being collected or the long-term impact on local populations.\"\n\n\n\nAre hermit crabs suitable pets?\n\nHermit crabs play a vital role in their native ecosystems, Feddema said, acting as \"ecosystem engineers\". They recycle shells that would otherwise be buried by sand, creating homes for algae, sponges, and other small organisms. They also help with nutrient recycling by scavenging on waste and decaying animals.\n\n\n\n\n\nBut despite this ecological importance, hermit crabs are often marketed as low-maintenance pets — sold in pet stores and online — a characterisation Feddema said is misleading.\n\n\n\n\n\nShe said in the wild, they can live for over thirty years. In captivity, however, their lifespans are often significantly shortened — sometimes surviving only a few months or years. She compared the industry to the \"cut flower trade\", where high mortality rates are treated as inevitable.\n\n\n\n\n\n\"People sometimes treat pets the same way they treat cut flowers — that they'll have them for a short period of time and then accept a certain level of mortality,\" she said.\n\n\n\n\n\nIn its proposal, Crazy Crabs said its experience in taking, holding and transporting hermit crabs \"has reduced the mortality rate during transit to practical zero for the last ten years\".\n\n\n\nDemand for rare and large individuals is also growing, raising concerns about overharvesting ecologically important crabs that produce a high number of offspring.\n\n\n\n\n\nStudies have shown hermit crabs exhibit signs of sentience, including problem solving, memory and a response to pain — which Feddema said challenges assumptions that invertebrates do not require additional welfare standards.\n\n\n\n\n\n\"There is a question about how appropriate they are to be held in captivity,\" she said. \"If the owner doesn't have the particular needs and they're not able to recognise the complexity of owning a hermit crab.\"\n\n\n\n\n\nShe said reforms are urgently needed to assess population health and establish long-term data.\n\n\n\n\n\n\"It is very possible that this is a trade that is sustainable, but we just can't make that decision without the data behind it.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/brake-goes-over-in-first-set-20250713-p5mekg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brake goes over in first set",
        "publish_date": "Sun, 13 Jul 2025 12:24:33 +1000",
        "category": "finance",
        "authors": [],
        "text": "Brake goes over in first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/pink-ball-carnage-in-kingston-as-australia-lose-7-68-in-15-overs-of-mayhem-20250713-p5meik.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pink ball carnage in Kingston as Australia lose 7-68 in 15 overs of mayhem",
        "publish_date": "Sun, 13 Jul 2025 12:17:32 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: A 100-minute spell of pink-ball carnage under lights has breathed life into the third and final Test, giving West Indies fans something to cheer about after a dismal series to date.\n\nThe decision to pick Scott Boland over Nathan Lyon dominated early headlines but quickly faded when Australia, after winning the toss and batting, crumbled on a lively Sabina Park pitch.\n\nIt was a curious decision given Australia had gone for a four-pronged pace attack, plus Beau Webster as a fifth option.\n\nThe West Indies may have already relinquished the Frank Worrell Trophy following limp batting efforts in Barbados and Grenada, but fast bowler Jayden Seales (3-59) injected much-needed energy, dishing out animated send-offs as his side turned up with purpose on day one.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/gill-fumes-at-england-tactics-20250713-p5mejw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gill fumes at England tactics",
        "publish_date": "Sun, 13 Jul 2025 11:44:20 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gill fumes at England tactics\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/premiership-hero-announces-early-afl-retirement-20250620-p5m94n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Premiership hero announces early AFL retirement",
        "publish_date": "Sun, 13 Jul 2025 11:28:23 +1000",
        "category": "sports",
        "authors": [],
        "text": "Premiership hero announces early AFL retirement\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/koby-stevens-makes-plea-for-stolen-documentary-footage-20250713-p5mejn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Koby Stevens makes plea for stolen documentary footage",
        "publish_date": "Sun, 13 Jul 2025 11:20:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Koby Stevens makes plea for stolen documentary footage\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/it-was-meant-to-be-backpacker-s-rescuer-describes-miracle-moment-on-remote-wa-road-20250713-p5mejk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It was meant to be’: Backpacker’s rescuer describes miracle moment on remote WA road",
        "publish_date": "Sun, 13 Jul 2025 11:13:14 +1000",
        "category": "finance",
        "authors": [
            "Cameron Myles"
        ],
        "text": "Tania Henley is not used to seeing anyone on the remote road she takes from her home on Bimbijy Station to Beacon, in Western Australia’s Wheatbelt region.\n\nSo returning from a quick trip to the small town on Friday – “only two hours there and back” – Henley was even more surprised to see, stumbling along the side of Mouroubra Road, the waifish figure of a girl the state’s emergency services had spent the past week scouring the region for.\n\nHenley was about 20 kilometres from home when Carolina Wilga walked out onto the road and waved her hands.\n\n“It was pretty amazing, really – well, it was incredible. Twelve days missing. She had to walk through the bush for 12 days because [her car] was nowhere near where I found her, nowhere,” Henley said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/jack-graham-banned-for-four-matches-over-homophobic-slur-20250713-p5mejd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jack Graham banned for four matches over homophobic slur",
        "publish_date": "Sun, 13 Jul 2025 10:53:53 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "West Coast’s Jack Graham has been banned for four matches after self-reporting a “highly offensive homophobic slur” against a GWS opponent in round 17.\n\nJack Graham (left) has been banned for four matches. Credit: AFL Photos via Getty Images\n\nGraham was given a discount on his suspension because he had self-reported the incident, which was highly unlikely to have come to the AFL’s attention otherwise.\n\nGold Coast’s Wil Powell was suspended for five matches for using a homophobic slur last season just weeks after Port Adelaide’s Jeremy Finlayson was suspended for three matches for the same offence.\n\nAn industry source who was not authorised to speak publicly said the former Richmond premiership player went to his club during the week, saying he felt badly about an incident in the game when he had gone too far and used offensive and inappropriate language in the sledge of an opponent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/they-want-to-blame-dead-pilots-air-india-victims-families-say-crash-report-a-cover-up-20250713-p5mej7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘They want to blame dead pilots’: Air India victims’ families say crash report a ‘cover-up’",
        "publish_date": "Sun, 13 Jul 2025 10:51:59 +1000",
        "category": "finance",
        "authors": [
            "Samaan Lateef"
        ],
        "text": "Mumbai: Relatives of some of the 260 victims of last month’s Air India disaster have hit out at the airline and the Indian government over the initial investigation report, saying they have rushed to blame pilots while hiding failings that led to the crash.\n\nThe report released by Indian authorities early on Saturday said initial findings indicated that switches controlling fuel flow to the jet’s two engines were turned off, leading to a catastrophic loss of thrust at take-off.\n\nAccording to the report, one of the pilots is heard in the recovered cockpit voice recording asking the other why he cut off the fuel supply. The other pilot responds that he didn’t.\n\nThe mother of Clive Kunder, co-pilot of the Air India flight that crashed last month, mourns during a prayer meeting for the Air India crew in Mumbai on Saturday. Credit: AP\n\n“This report is wrong. We don’t accept it,” said Ameen Siddiqui, 28, whose brother-in-law, Akeel Nanabawa, died alongside his wife and their four-year-old daughter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/athletics/gout-gout-wins-again-denied-another-record-by-headwind-in-monaco-20250712-p5meeb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘He is just 17’: Gout may not have run under 20s, but the athletics world is impressed anyway",
        "publish_date": "Sun, 13 Jul 2025 10:15:32 +1000",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Noah Lyles likes what he sees. He saw it up close when Gout Gout came to train with him in America early in the year. And he liked what he saw in Monaco on Saturday when the young Australian won again.\n\nThe world’s best believes the hype.\n\nMonaco should have been where Gout broke 20 seconds. Hot, a fast track and racing the best under-23’s in a Diamond League meet side event, everything was poised for the youngster to break 20 for the first time.\n\nThen he copped a stiff headwind.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/swiatek-wins-first-wimbledon-title-with-demolition-20250713-p5mej6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Swiatek wins first Wimbledon title with demolition",
        "publish_date": "Sun, 13 Jul 2025 10:14:10 +1000",
        "category": "sports",
        "authors": [],
        "text": "Swiatek wins first Wimbledon title with demolition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-intensifies-trade-war-with-threat-of-30-per-cent-tariffs-on-eu-mexico-20250713-p5mej0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump intensifies trade war with threat of 30 per cent tariffs on EU, Mexico",
        "publish_date": "Sun, 13 Jul 2025 09:50:27 +1000",
        "category": "finance",
        "authors": [
            "Jarrett Renshaw",
            "Bhargav Acharya",
            "Cassandra Garrison"
        ],
        "text": "The August 1 deadline gives targeted countries time to negotiate agreements that could lower the threatened tariffs. Some investors and economists have also noted Trump’s pattern of backing off his tariff threats. The spate of letters showed Trump has returned to the aggressive trade posture that he took in April when he announced a slew of reciprocal tariffs against trading partners that sent markets tumbling before the White House delayed implementation. ‘Unfair treatment’ But with the stock market recently hitting record highs and the US economy still resilient, Trump is showing no signs of slowing down his trade war.\n\nHe promised to use the 90-day delay in April to strike dozens of new trade deals, but has secured framework agreements only with Britain, China and Vietnam. The EU has hoped to reach a comprehensive trade agreement with the US for the 27-country bloc. Trump’s letter to the EU included a demand that Europe drop its own tariffs. Loading “The European Union will allow complete, open Market Access to the United States, with no Tariff being charged to us, in an attempt to reduce the large Trade Deficit,” he wrote. Von der Leyen said the 30 per cent tariffs “would disrupt essential trans-Atlantic supply chains, to the detriment of businesses, consumers and patients on both sides of the Atlantic”.\n\nShe also said while the EU would continue to work towards a trade agreement, it “will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required”. Mexico’s economy ministry said Saturday it was informed the US would send a letter during a meeting on Friday with US officials. Mexican President Claudia Sheinbaum said she was sure an agreement could be reached. Credit: nna\\KCampbell “We mentioned at the roundtable that it was unfair treatment and that we did not agree,” the ministry’s statement said. Rate for Mexico lower than Canada\n\nMexico’s proposed tariff level is lower than Canada’s 35 per cent, with both letters citing fentanyl flows even though government data shows the amount of the drug seized at the Mexican border is significantly higher than the Canadian border. “Mexico has been helping me secure the border, BUT, what Mexico has done, is not enough. Mexico still has not stopped the Cartels who are trying to turn all of North America into a Narco-Trafficking Playground,” Trump wrote. China is the main source of the chemicals used to make the opioid fentanyl. According to US authorities, only 0.2 per cent of all fentanyl seized in the US comes from across the Canadian\n\nborder, while the vast majority originates from the US-Mexico border. Mexico sends more than 80 per cent of its total exported goods to the US and free trade with its northern neighbour drove Mexico to become the top US trading partner in 2023. The EU had initially hoped to strike a comprehensive trade agreement but more recently had scaled back its ambitions and shifted toward securing a broader framework deal similar to the one Britain brokered that leaves details to be negotiated.\n\nThe bloc is under conflicting pressures as powerhouse Germany urged a quick deal to safeguard its industry, while other EU members, such as France, have said EU negotiators should not cave into a one-sided deal on US terms. European Commission President Ursula von der Leyen said it “will take all necessary steps to safeguard EU interests”. Credit: AP Bernd Lange, head of the European Parliament’s trade committee, said Brussels should enact countermeasures as soon as Monday. “This is a slap in the face for the negotiations. This is no way to deal with a key trading partner,” Lange told Reuters. Jacob Funk Kirkegaard, a senior fellow at the Brussels-based think tank Bruegel, said Trump’s letter raised the risk of retaliatory moves by the EU similar to the flare-up between the US and China that rattled financial markets. “US and Chinese tariffs went up together and they came back down again. Not all the way down, but still down together,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/an-unusual-selection-why-selectors-dropped-lyon-for-the-first-time-since-2013-20250713-p5mei0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘An unusual selection’: Why selectors dropped Lyon for the first time since 2013",
        "publish_date": "Sun, 13 Jul 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: The first major sign that Nathan Lyon had been dropped from Australia’s side for the third Test against West Indies was the kick of a soccer ball.\n\nAbout 90 minutes before the start of play on Saturday (Sunday AEST) at Sabina Park in Jamaica, the 37-year-old was the first Australian player onto the field ahead of warm-ups. He wandered alone across the middle, without his spikes, aimlessly kicking a soccer ball and chatting quietly with support staff.\n\nOne member of staff offered a consoling pat on the back to the veteran of 139 Tests and 562 wickets.\n\nWhen Scott Boland grabbed a tape measure to mark his run-up and began splashing white paint on the ground, Lyon’s fate was effectively sealed. Official confirmation came at the toss, 30 minutes before play, at 4am back in Australia.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/switkowski-swoops-as-dockers-over-run-hawks-in-perth-20250713-p5meix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Switkowski swoops as Dockers over-run Hawks in Perth",
        "publish_date": "Sun, 13 Jul 2025 09:29:22 +1000",
        "category": "sports",
        "authors": [
            "Justin Chadwick"
        ],
        "text": "Fremantle goalsneak Sam Switkowski has made a stunning return from injury, kicking three goals to lead the Dockers to a gutsy 13-point win over Hawthorn at Optus Stadium.\n\nThe Dockers trailed by 13 points at the final change of Saturday night’s match, but kicked four goals to nil in the last quarter to seal the 12.5 (77) to 9.10 (64) win in front of 49,460 fans.\n\nSam Switkowski has made a stunning return from injury on Saturday night. Credit: Paul Kane/Getty Images\n\nThe result improved Fremantle’s record to 11-6, leaving them just percentage adrift of fourth spot.\n\nHawthorn are now also 11-6 after their four-match winning streak was snapped.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/can-t-run-with-the-big-dogs-park-separates-alphas-from-nervous-nellies-20250703-p5mc6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Can’t run with the big dogs? Park separates alphas from nervous nellies",
        "publish_date": "Sun, 13 Jul 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Cara Waters"
        ],
        "text": "A huge increase in pets in the City of Melbourne has led to more conflict at dog parks and in apartment buildings, and a trial to separate quiet dogs from their more assertive peers.\n\nThe number of registered animals in the CBD has jumped by 35 per cent since 2020, including a 59 per cent increase in dogs and an 18 per cent rise in cats.\n\nBrett Potts with his five-year-old beagle cross, Vera, at Eades dog park in West Melbourne. Credit: Chris Hopkins\n\nLocal Brett Potts said there used to be a handful of dog owners who would meet at the Flagstaff Gardens, but now when he goes there in the afternoons, he finds up to 40 dogs running around.\n\n“I think the volume that we’ve got at the moment is a hangover from COVID,” he says. “We saw a massive spike in dogs – that was our relief during COVID, right? We’d go to the park of an afternoon and socially distance from other owners as you’re walking your dog.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/anthony-albanese-arrives-in-china-for-six-day-visit-20250713-p5meit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Albanese arrives in China for six-day visit",
        "publish_date": "Sun, 13 Jul 2025 08:59:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Anthony Albanese arrives in China for six-day visit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/albo-shanghai-stroll-under-watchful-021523073.html",
        "title": "Albo’s Shanghai stroll under watchful eyes",
        "publish_date": "2025-07-13T02:15:23Z",
        "category": "sports",
        "authors": [
            "Joseph Olbrycht-Palmer"
        ],
        "text": "Prime Minister Anthony Albanese has arrived in Shanghai ahead of a six day trip to China. Picture: Supplied/PMO\n\nAnthony Albanese has taken a walk down Shanghai’s world-famous waterfront under the watchful eyes of Chinese officials, with his hosts doing their utmost to give him an unobstructed view of the towering central skyline.\n\nOnlookers gazed with unabashed curiosity as the Prime Minister and his posse strolled along the picturesque Bund with an air of confidence akin to the man who broke the bank at Monte Carlo.\n\n“It isn’t racism,” one Australian official told NewsWire.\n\n“They just haven’t seen so many white people in a big group like this before.”\n\nAmong the curious crowds were people eager to extend warm welcomes and well-wishes in English.\n\nADVERTISEMENT\n\n“Hello, welcome,” a young man said.\n\nAnother onlooker said she wished “you have a warm stay”.\n\nBut asked any questions that strayed from general niceties, they simply smiled and repeated their greetings.\n\nMr Albanese was accompanied by Australian soccer legend Kevin Muscat.\n\nPrime Minister Anthony Albanese landed in Shanghai on Saturday. Picture: Supplied/PMO\n\nMr Muscat is now head coach at Shanghai Port FC.\n\n“A legendary Australian footballer, and now the manager here of Shanghai FC port and indeed, premiership winning manager here,” Mr Albanese told reporters from the promenade.\n\n“One of the things about Australia and China that’s so important is that we build people-to-people relations.\n\n“And we do that by the participation of Australians here, whether it be here in football, whether it be the leading tournament that’s going to take place in Chengdu, or the Australian Open, whether it be the business relationships that we have here as well.”\n\nADVERTISEMENT\n\nThe charm offensive comes as Canberra and Beijing strive to focus on the positives of their relationship.\n\nMr Albanese, who touched down in Shanghai on Saturday, has spruiked tourism, trade and people-to-people links.\n\nThough, the Chinese government is acutely aware that Australia’s relationship with the US is strained by the Trump administration’s tariffs and the Albanese government’s lacklustre defence spending.\n\nIn the minds of Canberra and Beijing, both are reasons to talk more, not less.\n\nAhead of Mr Albanese’s lengthy state visit, China’s ambassador invited the Albanese government to deepen the Australia’s economic relationship with China and find consensus on differences — however chiasmic they may be.\n\nThe envoy even teased co-operation on artificial intelligence.\n\nThough, Mr Albanese has so far neither embraced nor rejected the wooing and instead stuck firmly to his China mantra: “We will co-operate where we can, disagree where we must, but engage in our national interest.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/poisoning-survivor-plea-travellers-011631154.html",
        "title": "Avoid at all costs’: Expat’s warning on nation",
        "publish_date": "2025-07-13T01:47:06Z",
        "category": "lifestyle",
        "authors": [
            "Robert White"
        ],
        "text": "Bethany Clarke was one of the survivors of the Laos poisoning incident. Picture: Supplied\n\nAlmost eight months on from the Laos methanol poisoning, one of the survivors is speaking out on how they were failed by the small Southeast Asian nation and how prospective travellers are able to protect themselves from the dangers of bootleg alcohol.\n\nIn November 2024, six people died after drinking alcohol suspected to be contaminated with methanol at the Nana Backpacker Hostel in Vang Vieng Laos. Two of those were 19-year old Australians Bianca Jones and Holly Bowles.\n\nBethany Clarke, from the UK but now living in Brisbane, was one of the lucky survivors of the poisoning; however, childhood best friend Simone White – whom Ms Clarke was travelling with at the time – was not so fortunate.\n\nMs White’s mother was faced with the tragic decision to turn off her life support after she suffered irreversible brain damage resulting from the poisoning.\n\nSimone White at the hostel where the poisoning occurred. Picture: Supplied\n\nThe fatal, and seemingly harmless, shots. Picture: Supplied\n\nSpeaking to NewsWire, Ms Clarke said the shortcomings of Laotian infrastructure meant travellers should carefully consider whether a visit was worth the risk.\n\nADVERTISEMENT\n\n“We can’t be enticing people to go to Laos, far from it. I think our message would really be to avoid it at all costs because they can’t run a thorough investigation,” she said.\n\n“If you happen to die in Laos, there’s no way that you’d get a legitimate medical evaluation and those Danish girls (Anne-Sofie Orkild Coyman, 20, Freja Vennervald Sorensen, 21), they didn’t even have a post-mortem because they were told that they couldn’t do one because of the embalming procedure.”\n\nMs Coyman and Ms Sorensen were found dead in their hostel room after they had reportedly been vomiting blood for 13 hours.\n\nBethany Clarke is now based out of Brisbane and is calling for more education on the dangers of bootleg alcohol. Picture: Lachie Millard\n\n“We were diagnosed with food poisoning, which is completely incorrect,” Ms Clarke said.\n\n“We weren’t even displaying symptoms in relation (to that). I wasn’t displaying symptoms like nausea or diarrhoea or vomiting, so I don’t even know how you’d come to that conclusion.\n\nADVERTISEMENT\n\n“It’s just that doctors are not trained (properly).”\n\nMs Clarke said the severity of the incident was compounded by the victims’ own inability to think and function as the effects of methanol made its way through their bodies.\n\n“I think because my brain wasn’t working, there were little red flags during that following day, but it’s only afterwards that I’ve sort of been able to realise that I should have listened more to those. I just wasn’t thinking. I wasn’t able to think straight,” Ms Clarke said.\n\n“At the kayaking experience when we were just having to lay down, we weren’t able to sit up straight and paddle. That definitely should have been a red flag because that’s never happened to me before, an inability to sort of move my body.\n\n“Just really, really fatigued. And then later on, when Simone stopped breathing normally and wasn’t able to look at me properly, that was also when I knew that there was a huge problem.\n\nADVERTISEMENT\n\n“I just felt completely powerless because I couldn’t even think straight myself.”\n\nMs Clarke and Ms White went on a river experience the day after the poisoning but were unable to perform basic tasks like sitting up and paddling. Picture: Supplied\n\nThe pair were best friends. Picture: Supplied\n\nNow Ms Clarke is campaigning for greater awareness, education and preventive measures against similar incidents.\n\nAs part of the campaigning, Ms Clarke has started a petition proposing airports display clearly visible signs, distribute leaflets and have mandatory guidance counters with information on methanol poisoning.\n\n“I think the depth of knowledge will only really come with the formal education in schools and that’s why we’re trying to think of how we can do that in a way that’s going to act as a scare tactic for young people,” she said.\n\n“Whether it’s some kind of video, where we can re-enact what happened in Laos and how quickly things started to deteriorate, some of the other shocking things that happened, like the Danish girls who were vomiting blood and various things like that, which no one would ever really imagine could happen after drinking shots at a hostel bar.\n\n“I think people may even think, ‘Oh, well, it won’t happen to me’, but if you’re shown the facts and we’ve got pictures of those drinks and what we drank, you see it’s easy to get into these situations unless you know why you shouldn’t do something.”",
        "source": "Yahoo"
    }
]