[
  {
    "url": "https://www.9news.com.au/national/rio-tinto-looking-to-cut-annual-sick-leave-down-from-45-to-12-days-for-iron-ore-workers/607a605a-f24e-4da1-aa2c-e39db8178cd0",
    "title": "Rio Tinto moves to slash sick leave from 45 to 12 days for Pilbara workers",
    "publish_date": "Thu, 07 Aug 2025 00:52:48 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Rio Tinto says a move to slash annual sick leave by 73 per cent for tens of thousands of workers in Western Australia's Pilbara mines has been driven by a staff survey.\n\nThe mining giant, which has a market capitalisation of $158 billion, has proposed changing the number of sick days a year from 45 to 12, a little over the national minimum standard of 10 days, for its iron ore employees.\n\nTwo out of those 12 days, however, would not accrue to the following year. ﻿\n\nREAD MORE: ﻿ Tributes flow for tradie killed in workplace tragedy\n\nRio Tinto is looking to slash sick leave by 73 per cent for tens of thousands of workers in Western Australia's Pilbara mines. (Rio Tinto)\n\nEmployees with serious illness or injury, the definition of which 9News.com.au understands is still to be determined, will instead be allowed up to 12 months of paid sick and carer's leave and allowances at the company's discretion. ﻿\n\nA Rio Tinto spokesperson said changes were brought on from a staff survey that found a fairness issue with the former sick leave policy.\n\n\"Prompted by feedback from our people survey, we are conducting a review of the sick and carers' leave policy for Rio Tinto Iron Ore,\" the spokesperson said.\n\n\"The proposed changes are designed to ensure fairness for all employees.\n\n\"This includes up to 12 months of sick and carer's leave at full pay, including allowances, in the event of serious illness or injury, which we believe would be industry-leading.\n\n\"We are currently consulting with our people about these proposed changes.\"\n\nUnder the proposed changes, the annual wellness payments wil﻿l also be increased to $1000.\n\nREAD MORE: ﻿ Trump threatens key ally with huge tariff after talks stall\n\nThe Australian Manufacturing Workers' Union Western Australia Secretary Steve McCartney. (X)\n\nA ﻿Rio Tinto spokesperson said staff safety and well-being were their \"top priority\".\n\nThe changes are expected to come into effect later this year, pending the six-week consultation period.\n\nThe Australian Manufacturing Workers' Union State Secretary, Steve McCartney, said it was a shocking announcement that provided no clarity or reassurance to workers.\n\n\"This announcement from Rio Tinto highlights exactly why being on a union agreement is so important, it protects workers from having their wages and conditions changed on a whim,\" he said.\n\n\"It also raises serious concerns for workers who have already had future leave approved.\n\n\"I call on Rio Tinto to immediately provide clarity and reassurance.\"\n\nThere are about 16,000 people employed across 17 mines and four port terminals in Pilbara under the Rio Tinto Iron Ore banner.\n\nThere are about 16,000 people employed across 17 mines and four port terminals in Pilbara under the Rio Tinto Iron Ore banner. (Rio Tinto)\n\nThere are about 16,000 people employed across 17 mines and four port terminals in Pilbara under the Rio Tinto Iron Ore banner.\n\nRio Tinto made $11.7 billion ﻿($AUD18 billion) from operating activities at its Iron Ore division last year, down from $21.5 billion the previous year.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/trump-says-he-plans-to-put-a-100-tariff-on-computer-chips-likely-pushing-up-cost-of-electronics/e1e24b9d-28f2-4e46-a0ed-ad5cf1c82f85",
    "title": "Trump floats industry-busting 100 per cent tariff on computer chips",
    "publish_date": "Thu, 07 Aug 2025 01:02:17 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "US President Donald Trump says he will impose a 100 per cent tariff on computer chips, raising the spectre of higher prices for electronics, autos, household appliances and other essential products dependent on the processors powering the digital age.\n\n\"We'll be putting a tariff of approximately 100 per cent on chips and semiconductors,\" Trump said in the Oval Office while meeting with Apple CEO Tim Cook.\n\n\"But if you're building in the United States of America, there's no charge.\"\n\nPresident Donald Trump says he will impose a 100 per cent tariff on computer chips. (AP)\n\nThe announcement came more than three months after Trump temporarily exempted most electronics from his administration's most onerous tariffs.\n\nThe Republican president said companies that make computer chips in the US would be spared the import tax.\n\nDuring the COVID-19 pandemic, a shortage of computer chips increased the price of autos and contributed to higher inflation.\n\nInvestors seemed to interpret the potential tariff exemptions as a positive for Apple and other major tech companies that have been making huge financial commitments to manufacture more chips and other components in the US.\n\nBig Tech already has made collective commitments to invest about $US1.5 trillion ($2.3 trillion) in the US since Trump moved back into the White House in January.\n\nThat figure includes a $600 billion promise from Apple after the iPhone maker boosted its commitment by tacking another $100 billion on to a previous commitment made in February.\n\nApple CEO Tim Cook holds a gift from President Donald Trump in the Oval Office. (AP)\n\nNow the question is whether the deal brokered between Cook and Trump will be enough to insulate the millions of iPhones made in China and India from the tariffs that the administration has already imposed and reduce the pressure on the company to raise prices on the new models expected to be unveiled next month.\n\nWall Street certainly seems to think so.\n\nAfter Apple's stock price gained 5 per cent in Wednesday regular trading sessions, the shares rose by another 3 per cent in extended trading after Trump announced some tech companies won't be hit with the latest tariffs while Cook stood alongside him.\n\nThe shares of AI chipmaker Nvidia, which also has recently made big commitments to the US, rose slightly in extended trading to add to the $1 trillion gain in market value the Silicon Valley company has made since the start of Trump's second administration.\n\nThe stock price of computer chip pioneer Intel, which has fallen on hard times, also climbed in extended trading.\n\nInquiries sent to chip makers Nvidia and Intel were not immediately answered.\n\nThe chip industry's main trade group, the Semiconductor Industry Association, declined to comment on Trump's latest tariffs.\n\nDemand for computer chips has been climbing worldwide, with sales increasing 19.6 per cent in the year-ended in June, according to the World Semiconductor Trade Statistics organisation.\n\nTrump's tariff threats mark a significant break from existing plans to revive computer chip production in the U.S. that were drawn up during the administration of President Joe Biden.\n\nSince taking over from Biden, Trump has been deploying tariffs to incentivize more domestic production.\n\nEssentially, the president is betting that the threat of dramatically higher chip costs would force most companies to open factories domestically, despite the risk that tariffs could squeeze corporate profits and push up prices for mobile phones, TVs and refrigerators.\n\nBy contrast, the bipartisan CHIPS and Science Act that Biden signed into law in 2022 provided more than $50 billion to support new computer chip plants, fund research and train workers for the industry.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/popular-electric-cars-fall-short-on-advertised-battery-range/cd765fab-5d54-42be-bf76-8d518c557bb4",
    "title": "Top-selling electric vehicles falling short on battery range, study says",
    "publish_date": "Thu, 07 Aug 2025 01:25:57 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Some of the most widely sold electric vehicles in Australia are being promoted with misleading details about their battery range, new research shows.\n\nReal-world testing by the Australian Automobile Association (AAA) found the actual driving distance of some EVs fell short by up to 100km.\n\nThe poorest-performing vehicle was the Chinese-built BYD ATTO3. Researchers tested a 2023 model of the SUV, and it fell 23 per cent short of its advertised range, or about 100km.\n\nPopular electric cars in Australia fell short on their battery range advertised by vehicle manufacturers, new research shows. (Supplied)\n\nThe 2022 Kia EV 6 and the 2024 Telsa Model Y both had driving ranges of 8 per cent less in the real-world tests than recorded in laboratory tests.\n\nThe 2024 Tesla Model 3 had a real-world range of 441km on a full charge, 14 per cent less than the 513km achieved in the lab.\n\nThe 2024 Smart #3 EV performed closest to its laboratory test result with a real-world driving range of 432km – 5 per cent, or 23km, less than recorded in its mandatory laboratory test.\n\nData from the federal government-funded testing reinforces an AAA survey of EV drivers last month that found concerns about driving range and recharging﻿ was the biggest challenge when they came to purchase a new car.\n\nAAA managing director Michael Bradley said the results would help potential EV buyers.\n\n\"As more EVs enter our market, our testing will help consumers understand which new market entrants measure up on battery range,\" Bradley said.\n\nThe Tesla Model 3 was among the cars tested by the AAA. (Supplied)\n\nNRMA spokesperson Peter Khoury told Today this morning testing of EVs needed to continue as the technology gains popularity.\n\n\"It is now up to the manufacturers to make sure that they're putting in batteries that deliver what they promised, because there's a lot of EVs on the market,\" he said.\n\n\"It will be competitive.\"﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/australia-work-from-home-office-vacancy-rates/9de14011-76c4-486f-a178-4aafa6096cea",
    "title": "Why office vacancy rates have spiked to a 30-year high",
    "publish_date": "Thu, 07 Aug 2025 00:41:54 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Aussies opting to work from home have pushed office vacancy rates in major cities to a 30-year high, new data shows.\n\nAs the number of Australians working from home remains at around 30 per cent, it means more office buildings in major cities are remaining empty, with vacancy rates in CBDs rising to 14.3 per cent in the first six months of 2025.\n\nThe vacancy rate is at its highest rate since 1995, when the country was still recovering from the property market crash of the 1990s.\n\nMore and more office spaces in cities like Sydney are going unused. (Jessica Hromas/Fairfax Media)\n\nThis includes a rise of almost 1 per cent for office spaces in Sydney due to high levels of supply outstripping demand, according to data from The Property Council of Australia.\n\nThere were also vacancy rises in Brisbane, Canberra and Perth, but the vacancy rate in Melbourne's CBD fell slightly.\n\nHowever, Melbourne still has the highest vacancy rate of office spaces in the country, currently at 17.9 per cent.\n\nWhilst working from home remains a big factor, businesses seeking more high-end office space has also influenced the change.\n\n\"The continuous supply of new high-quality office space in our CBDs is a response to businesses searching out great places for their employees to work in,\" CEO of the Property Council Mark Zorbas said.\n\n\"Tenants are capitalising on opportunities to occupy premium buildings in prime CBD locations, with premium space continuing to see higher demand levels than lower-grade buildings.\"\n\nThe high supply has also been influenced by a large amount of office spaces being built in the early part of the decade.\n\nUp to 2.6 million square metres of office space has been developed in the last five years, and 200,000 sqm of supply has been added in the last six months alone.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/chikungunya-what-is-the-virus-now-spreading-in-southern-china-explainer/f559f574-f2b8-4bc7-8f5f-8bee35bc9dd4",
    "title": "What you need to know about chikungunya, the virus now spreading in China",
    "publish_date": "Wed, 06 Aug 2025 13:40:04 +0000",
    "category": "lifestyle",
    "authors": [
      "Aug"
    ],
    "text": "Chinese authorities have taken measures this week to try to curb the spread of chikungunya , a virus that often causes fever and joint pain.\n\nAs of Wednesday, the government reported there had been more than 7000 cases, mostly in the southern manufacturing hub of Foshan.\n\nREAD MORE: China brings in pandemic response after thousands get rare virus ﻿\n\nThe Aedes Mosquito, A Vector For West Nile, Yellow Fever, Dengue, Chikungunya, And Zika Viruses, Was Observed Coming From The Forest In The Daytime And Began Its Blood Meal From Humans In Tehatta, West Bengal, India, On june 07, 2025. (Photo by Soumyabrata Roy/NurPhoto via Getty Images) (NurPhoto via Getty Images)\n\nHere's what to know about chikungunya:\n\nWhat is chikungunya?\n\nChikungunya is a disease caused by a virus of the same name.\n\nThe chikungunya virus was first identified in people sickened during an outbreak in Tanzania in 1952. Its name is derived from a word in the Makonde language, which means \"that which bends up,\" due to the severe pain it can cause.\n\nChikungunya is transmitted by infected mosquitoes and mostly causes mild symptoms. The majority of people who get chikungunya recover without needing medical attention after one to two weeks.\n\nWhat are the symptoms of chikungunya?\n\nChikungunya typically produces symptoms including fever, muscle pain, nausea, fatigue and a rash.\n\nBut in rare cases, it can cause debilitating joint pain that persists for months or even years. Patients who get severely ill often require hospitalisation because of the risk of organ damage.\n\nA sanitation worker sprays insecticide to prevent the spread of Chikungunya on August 3, 2025 in Dongguan, Guangdong Province of China (Getty)\n\nThe World Health Organisation says severe cases and deaths are rare and mostly occur in babies or elderly people with underlying health conditions.\n\nIs there a treatment or vaccine?\n\nThere is no specific treatment for chikungunya, but health workers can treat the symptoms by giving medicines to lower fevers or ease muscle pain.\n\nTwo vaccines have been approved in several regions, including Britain, Brazil, Canada and Europe.\n\nThose are mostly targeted at travellers and are not widely available in the countries most affected by chikungunya.\n\nWhere does chikungunya normally occur?\n\nChikungunya causes regular outbreaks in Africa, Asia and the Americas, with occasional small epidemics in Europe.\n\nChikungunya virus as seen through a microscope. (The Pirbright Institute)\n\nAs of July, there have been about 240,000 cases of chikungunya, including 90 deaths in 16 countries, according to the European Centres for Disease Prevention and Control.\n\nThe countries that reported the highest number of infections were Brazil, Bolivia, Argentina and Peru.\n\nWhat's happening in China?\n\nAn outbreak of chikungunya in Foshan, near Hong Kong, has prompted Chinese authorities to take measures like distributing mosquito nets, having workers spray residential areas, streets and construction sites with insecticide.\n\nPeople who do not empty bottles, flower pots or other outdoor receptacles, where water might accumulate and allow mosquitoes to breed, can be subject to fines of up to 10,000 yuan ($2140) and have their electricity cut off.\n\nResidents wade through debris along a flood-hit street after waters from a river overwhelmed towns following days of heavy rain, in Huaiji County, south China's Guangdong Province on June 19, 2025 (Deng Hua/Xinhua via AP)\n\nThe US has issued a travel advisory telling citizens not to visit China's Guangdong province, the location of Donguan and several other business hubs, along with countries such as Bolivia and island nations in the Indian Ocean.\n\nUnusually heavy rains and high temperatures this year have worsened the crisis in China.\n\nAre we seeing more chikungunya outbreaks?\n\nYes.\n\nThe number of outbreaks has increased since 2000, just as there have been more outbreaks of other mosquito-transmitted diseases like dengue and Zika, according to Robert Jones, an assistant professor at the London School of Hygiene and Tropical Medicine.\n\nA municipal worker fumigates a residential area to check the spread of mosquito-borne diseases in New Delhi, India, in 2016. (AP)\n\nJones said in a statement that in 2013, chikungunya was first seen in the island of St. Martin and that over the next three years, cases were confirmed in almost 50 countries in the Caribbean and the Americas, with more than 1 million suspected cases.\n\nJones said the risks of chikungunya epidemics have risen due to climate change and urban expansion, warning that the disease could spread to other parts of southern China with humid climates and dense cities.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-usa-united-states-recession-jobs/26d410eb-9401-47f6-894c-23d9e7589d04",
    "title": "Why the report that infuriated Donald Trump actually served as a warning",
    "publish_date": "Thu, 07 Aug 2025 01:23:21 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The bad news in last Friday's US jobs report may have been overshadowed when President Donald Trump fired the commissioner in charge of producing it.\n\nBut economists haven't forgotten about the American job market – and they're growing concerned.\n\nSome of the jobs report data has economists using a word they haven't uttered in several months: recession.\n\nAre Donald Trump's tariff measures impacting the United States' job market? Economists say they may well be. (AP)\n\nHiring over the past three months slowed dramatically, creating problems for the economists and statisticians at the Bureau of Labor Statistics (BLS), whose job is to make sense of the payroll data they get from thousands of businesses across the country.\n\nAs new data came in about May and June's employment, the BLS was forced to sharply lower those months' job totals from their preliminary estimates.\n\nThe BLS revised May and June's jobs totals lower by a combined 258,000 jobs. That massive revision gave economists some serious agita.\n\nLarger revisions have happened before, but every time changes that large have taken place over the course of at least two months, the US economy has been in a recession – at least since records began in 1968.\n\n\"The job market is terrible,\" Douglas Holtz-Eakin, former director of the Congressional Budget Office during the George W. Bush administration, said.\n\n\"Outside of education and health, the economy has lost private sector jobs in the past three months. That's terrible.\"\n\nWarnings – but no recession yet\n\nThe US economy has added an average of just 85,000 jobs per month this year, which is well below the 177,000 jobs that the economy added on average each month before the pandemic.\n\nPoor jobs data doesn't mean the US economy is in or going into a recession.\n\nSeveral recent economic indicators are pointing in the wrong direction – weakness in second-quarter gross domestic product and slower-than-expected growth in both the manufacturing and services sectors, for example.\n\nBut, importantly, the National Bureau of Economic Research, which is responsible for declaring recessions, tracks four big indicators of economic activity – consumer spending, personal income, factory production and employment.\n\nNone have been pointing to a recession or even that the US economy is on the precipice of a recession.\n\nThat is, until Friday's jobs report.\n\nYet even the recession alarms it sounded come with some caveats.\n\nRecent moribund job growth was likely distorted by business uncertainty surrounding Trump's tariffs, and it's too early to tell whether it will rebound or continue to remain at this low level, noted Keith Lerner, co-chief investment officer at Truist.\n\nThere are some concerns the United States could be heading towards a recession. (AP)\n\n\"The US economy is in a muddle-through environment,\" Lerner, who said the Federal Reserve probably needs to take action to lower interest rates soon because the jobs report suggests it might be behind the curve.\n\nThe Fed has known about the slowing hiring for quite some time.\n\nBut the sharp pullback over the past few months – data the Fed didn't have when it made its decision last week to hold interest rates steady – probably means the economy is considerably weaker than economists had expected.\n\n\"Friday's jobs report was terrible with recessionary level numbers, but slowing hiring is not new,\" Robert Ruggirello, chief investment officer at Brave Eagle Wealth Management, said.\n\n\"While Friday's report does not mean we are entering a recession, it shows that companies are freezing hiring and firing until there is more policy certainty and business confidence.\"\n\nIronically, the leading culprit for slowing jobs growth may be the thing that has been holding the Fed back from cutting rates: Trump's tariffs.\n\nThe Fed had been in wait and see mode in case tariffs pushed prices higher.\n\nThe flip side is that the US economy appeared strong enough to handle higher interest rates.\n\nThe Federal Reserve took a cautious approach when reacting to Donald Trump's tariff measures announced in April. (AP)\n\nBut it seems businesses are no longer waiting.\n\nThey're freezing hiring and changing their investments as they grow fearful that tariffs could raise costs and hurt the economy.\n\n\"The president's unorthodox economic agenda and policies may be starting to make a dent in the labour market,\" Chris Rupkey, chief economist at FwdBonds, said.\n\n\"Businesses are not waiting as they are cutting back on the numbers of new workers they bring on board, which means we can no longer count on the employment markets to be a positive factor supporting economic growth in the weeks and months ahead.\"\n\nTrump's immigration policy appears to be taking a toll, too.\n\nSince April, 1.4 million people dropped out of the US labour force – 802,000 of whom were foreign-born.\n\nThat may have helped make the jobs report look slightly better than it actually is.\n\nBecause of the way the survey was taken, if the 503,000 who dropped out of the labour force but still wanted to work had told the BLS that they were actively searching for a job, the unemployment rate would have risen to 4.5 per cent last month, Rupkey said.\n\nInstead, it rose to 4.2 per cent.\n\nAbout those revisions…\n\nThe revisions, though surprising for their sheer size, were not fully unexpected.\n\nThey align with the other inputs that analysts have been tracking, Goldman Sachs economists said in a note to clients on Saturday, and they help paint a clearer picture of the economy.\n\nOther key jobs indicators \"have slowed significantly in recent months\", Goldman Sachs economist Jan Hatzius wrote.\n\n\"Taken together, the economic data confirm our view that the US economy is growing at a below-potential pace.\"\n\nIn other words, Goldman Sachs isn't shocked by the revisions; if anything, they fit with the broader puzzle pieces.\n\nThe revisions were \"undeniably concerning,\" Bank of America economists said in a note to investors on Monday.\n\nBut the \"silver lining\" is that a considerable amount of the revisions had to do with seasonal adjustments – basically algorithms that needed adjusting as new data came in.\n\nGoldman Sachs was not massively caught off-guard by the tariff revisions. (Associated Press)\n\nThe BLS considers its initial jobs numbers to be preliminary when they're first published, because some respondents fail to report their payroll data by the BLS' deadline.\n\nLow survey responses can make the report more challenging to estimate.\n\nBut the BLS continues to collect the payroll data as it's reported, and it revises the data accordingly.\n\nTo extrapolate the data for the entire country, BLS economists add in some educated guesswork , based on seasonal hiring trends.\n\nThe BLS also smooths out the data with calculations known as seasonal adjustments to avoid huge spikes and dips in data each month.\n\nThe data are also revised because of those seasonal adjustments.\n\nIf the more complete data comes in well above or below the preliminary data, revisions can be exacerbated by the BLS' seasonal adjustments, which sometimes need to be recalculated.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/australia-weather-rain-sydney/491d6ea7-3df6-428d-a3fc-bfac027b486b",
    "title": "Millions brace for second imminent winter deluge",
    "publish_date": "Wed, 06 Aug 2025 22:42:01 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "The east coast of Australia is being told to brace for more rain, just a week after massive rainfalls caused flooding in parts of New South Wales .\n\nSydney could see 30mm of rain over the weekend, having an impact on the City2Surf race on Sunday.\n\nThe race, which could see 100,000 people running through the streets of Sydney, may also be met by 10mm of rain according to Weatherzone .\n\nThe east coast of Australia is set to cop another drenching this weekend. (Weatherzone)\n\nThe rain is expected to be less intense than last weekend, when over 100mm of rain fell on parts of the state's Hunter Valley.\n\nOne woman is believed to have died after being swept away in floodwaters near Cessnock.\n\nParts of Queensland are also set to be hit by heavy rainfall, with the area between Hervey Bay and Rockhampton in the firing line for massive falls.\n\nThe weather conditions are being caused by a northwest cloudband, where warm and humid tropical air from the Indian Ocean passes over Australia.\n\nIt is combining with moisture from the Coral Sea, resulting in parts of the east coast being forced to brace for more wet weather.\n\nThe extended cloud coverage over large parts of the country will also cause cooler temperatures away from the coast.\n\nVictoria looks set to be spared from much of the rain, with significant rainfall not expected to reach Melbourne until next Tuesday.",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/stacey-mcewan-a-forbidden-alchemy-queensland-teacher-turned-bestselling-author/03321df7-3fc9-4399-8605-f0b5b606a24c",
    "title": "From BookTok to New York Times bestseller: How Aussie teacher defied the odds",
    "publish_date": "Thu, 07 Aug 2025 01:58:05 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Months before thousands of Queensland teachers﻿ walked off the job over pay and safety, primary school teacher Stacey McEwan was given an ultimatum.\n\nShe'd spent the last few years working part-time while pursuing a writing career that had landed her on bestseller lists around the world.\n\n﻿Passionate about education as well as authoring, she worked hard to juggle both careers. That ended in early 2025.﻿\n\nOnce a primary school teacher, now you can find Stacey McEwan's name on bestseller lists around the world. (Stacey McEwan/Facebook)\n\n﻿﻿\"Due to the critical teacher shortage , I was told 'you either need to come back to teaching full time or you need to quit,'\" McEwan told 9news.com.au.\n\n\"So I quit the department altogether, and just went full throttle on authoring.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nFortunately, her latest release A Forbidden Alchemy released to rave reviews in July and even earned a spot on the New York Times bestseller list.\n\nBut McEwan is painfully aware that her success (and income) as an author is not guaranteed, even with one of the most powerful online communities behind her.\n\nAussie teacher to bestselling novellist\n\nBorn and raised on the Gold Coast, McEwan spent 11 years ﻿in the classroom.\n\nShe wrote fantasy novels on the side and tried getting a ﻿few published but was rejected again and again.\n\n\"I didn't really know what I was doing﻿,\" she admitted.\n\nMcEwan spent years writing books and being rejected by publishers before her debut novel was picked up/ (Instagram/@staceymcewanbooks)\n\nThe Australian publishing industry is highly competitive and the odds of a debut author﻿'s unsolicited submission actually being purchased for publication are low.\n\nKnowing that, McEwan focused on teaching until the COVID-19 pandemic hit.\n\nLike millions of Aussies, she downloaded TikTok as a way to pass the time during lockdown and was immediately sucked into BookTok, the app's reading community.\n\nThere she racked up thousands of followers \"almost overnight\".\n\nIt was her husband﻿ who suggested she leverage that budding internet fame to self-publish her first novel, a fantasy book she'd already written.﻿\n\nInstead, ﻿British-based publisher Angry Robot﻿ \"swept in\" and offered to buy it.\n\nThe power of TikTok and timing\n\nMcEwan planned to self-publish her first novel, Ledge, until a publisher \"swept in\" and offered her a book deal. (Stacey McEwan/Facebook)\n\nMcEwan signed her first book deal and published her debut fantasy novel, Ledge , in 2021. Two sequels followed in 2023 and 2024.\n\nThe Aussie mum of two admits she owes a lot of her initial success to TikTok and timing.\n\n﻿\"I'm not too proud to say that if I hadn't have put my idiot face online, that this wouldn't be happening right now,\" she said.﻿\n\nThere's no doubt the Angry Robot book deal was influenced by her BookTok popularity and the fact that she was pushing a romantasy (romance and fantasy) novel right as the genre was exploding.\n\nAustralians spent more than $50 million on romance novels in 2024 and romance book sales have more than doubled in the last five years.\n\nAnd romantasy is its hottest subgenre right now.\n\n\"It was really just a case of perfect timing,\" McEwan said.\n\nHer first three novels became bestsellers, boosting her social profile even more.\n\nBut in the age of online hate mobs and celebrity 'cancellations', being a big deal on social media doesn't always have a happy ending.\n\n﻿ Social media's a double-edged sword﻿\n\nAll it takes is one move – legitimate, or perceived – for an author to get 'cancelled' these days.\n\nIt can make the career feel precarious, especially for breakout authors like McEwan who owe so much of their fame to online popularity.﻿\n\nMcEwan signed her first book deal during the pandemic and is now a bestselling author. (Instagram/@staceymcewanbooks)\n\n﻿\"Being of any kind of public figure on social media feels a lot like putting your head on a chopping block and just hoping that no one swings the blade,\" she said.\n\n\"It's the wild, wild west out there and one certainly does have to be careful.\"\n\nIt's up to most authors to run their own ﻿social media accounts, promoting their books and interacting with fans while also making sure they don't say or do the wrong thing.\n\nBecause being 'cancelled'﻿ can tank book sales and slash an author's income in an instant and most don't have huge advances or established fortunes to fall back on.\n\n\"I got an advance for [my first book], but it was a small amount and it certainly wasn't anything that was going to set me up for the future,\" McEwan said.\n\n\"I really had to rely on how well the book was going to sell.\"\n\nBack then she had her teaching career to fall back on but that's gone now.\n\nNo backup plan﻿\n\nWhile she was still teaching part-time, ﻿McEwan landed a global deal with publishing powerhouse Simon & Schuster for her next duology.\n\nThe advance alone was enough to finance her for a year, so she took ﻿unpaid leave from teaching to write A Forbidden Alchemy.\n\nThe novel follows Nina Harrow and Patrick Colson, childhood friends who find themselves on opposite sides of a war fuelled by class inequality.\n\n\"I like the idea of the lower classes questioning why it is that they must remain so,\" McEwan said.﻿\n\nMcEwan took ﻿unpaid leave from teaching to write A Forbidden Alchemy. (Simon & Schuster)\n\nMonths before it hit shelves, McEwan was told she had to go back to teaching full-time or quit altogether.﻿\n\nShe chose the latter and so far, it's been the right choice.\n\nMcEwan just returned from the ﻿very successful US leg of her A Forbidden Alchemy book tour and you can walk into bookstores all over Australia and find her name staring back at you from the 'bestseller' shelves.﻿\n\n\"I have a lot of people that I went to school with, that I used to work with, past teachers, students, [and] employers going, 'what's happening?'\" McEwan said.\n\n\"'Is this you, or is this just someone with your name?' ... those reactions only fuel me.\"",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/world/zara-adverts-banned-in-uk-for-unhealthily-thin-models/3f974a7e-ac92-414c-96a4-8c33bfceba64",
    "title": "Zara adverts banned over models who looked 'unhealthily thin'",
    "publish_date": "Thu, 07 Aug 2025 00:21:30 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "T﻿he UK advertising watchdog has banned two ads by fashion giant Zara for featuring models who looked \"unhealthily thin\".\n\nThe use of shadows and a slick back bun hairstyle in one ad for a short dress gave the model a \"gaunt\" appearance, said the Advertising Standards Authority (ASA).\n\nThe shadowing also made the model's legs appear \"noticeably thin\".﻿\n\nThe UK advertising watchdog has banned images from two Zara adverts. (Zara) (Supplied)\n\nIn the other advert﻿, a model wearing an oversized pocket shirt﻿ revealed the model's \"protruding\" collarbones, the regulator said.\n\nThe regulator described the adverts, shown on the retailer's website and app, as \"irresponsible\", and instructed Zara they must not appear again. ﻿\n\nZara has pulled the images highlighted by the ASA inquiry. It said it had not received any complaints about them.\n\nThe company also said both models in the images had medical documents proving they were in good health when the photos were taken.\n\nNone of the images had been altered except for \"very minor lighting and colouring edits\", Zara said.﻿\n\nZara says none of the images in the ads had been altered except for minor edits. (Photo by Dominic Lorrimer/Fairfax Media) (Fairfax Media)\n\nThe Spanish﻿ retail giant said it followed guidelines from a government backed inquiry into the health of models.\n\nThe ASA investigated two other Zara adverts but neither were banned.",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.9news.com.au/technology/briana-went-to-an-online-meeting-her-team-mate-sent-his-robot/f92ecdf1-df61-4e5e-ba23-374f17bfe862",
    "title": "Briana went to an online meeting. Her team mate sent an AI assistant",
    "publish_date": "Wed, 06 Aug 2025 22:29:08 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Recently, something odd happened to Briana Blackett. She was attending a meeting to give a colleague some content feedback, which isn't unusual in her volunteer work as a disability advocate.\n\nBut what unfolded after she logged onto Zoom made the journalist question professional etiquette and how artificial intelligence could change the future of work.\n\n\"You could see my face on screen, you could see the project manager's face on screen. But in place of the producer, we had an AI note taker. We started the meeting talking to the robot, saying, 'Here are some messages we'd like you to send back to your human' and 'human, if you're listening, please jump on now because these are things we need to have a nuanced discussion about',\" said Blackett, Future Women's Head of Content.\n\nBrianna Blackett's experience has left her questioning how AI tools should be used in the office. (Supplied)\n\nAfter about ten minutes instructing the notetaker like a junior staff member reporting back to its boss, they texted the producer to ask if he was coming. He appeared within seconds and they got on with the meeting - but the interaction left Blackett confused.\n\n\"I thought, 'Oh wow, is this the done thing now?' And if so, this is not good. You need to communicate in advance. It prompted me to think, in what scenario is it okay to send a robot? What's the process you should be undertaking in order to clear that with everyone? What's the AI etiquette here?\n\n\"Perhaps we need to start setting up some kind of etiquette process in how we decide when it's okay to send a robot.\"\n\nUniversity of Technology Sydney (UTS) Business School Associate Professor Robyn Johns can already see artificial intelligence changing the unwritten rules for workplaces.\n\nHowever, she believes we need to be mindful about how and when we're adopting new processes.\n\n\"Just because the tools are available doesn't mean you should automatically use them. We need to start considering whether it's appropriate in all circumstances,\" said Associate Professor Johns.\n\n\"Things like digital notetakers or recording meetings, you should be giving people a heads up. They certainly change expectations about how we engage in those meetings.\"\n\nIn July, a global survey of more than 3000 cyber security professionals found that while 81 percent believe employees in their organisation use AI, only 28 percent have a formal, comprehensive policy in place.\n\nIt is this lack of policy - which could speak to a lack of forethought - that worries Associate Professor Johns.\n\n\"AI can either reinforce or potentially erode trust within an organisation. [It's] about the transparency associated with how we utilise or implement these types of tools. Having consultations and discussions around how it's going to be used. Seek clarity around [how your staff feel] because it might be that some people perceive it as a control mechanism rather than a productivity enhancer.\"\n\nFor Blackett, a 'proud Gen Xer' who can clearly recall how email transformed professional etiquette decades ago, human communication is key to ensuring we reap the benefits of AI while not leaving others out in the cold.\n\n\"This is the latest technological advance, but there is also going to need to be some social construction around it.\n\n\"Perhaps we need to start setting up some kind of etiquette process in how we decide when it's okay to send a robot. Sending it to a client requiring a complex and nuanced discussion... probably isn't ideal.\"",
    "source": "9News",
    "cluster_id": 9
  },
  {
    "url": "https://www.9news.com.au/world/strait-of-messina-bridge-italy-to-build-worlds-longest-suspension-bridge-connecting-sicily-to-mainland/01de0753-27db-44a7-8cd3-3e3d65e855e0",
    "title": "$24b plan for world's longest suspension bridge to connect Sicily to Italy's mainland",
    "publish_date": "Wed, 06 Aug 2025 14:28:53 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Italy cleared the way on Wednesday to build the world's largest suspension bridge linking the Italian mainland with Sicily in a massive 13.5 billion euro ($24 billion) infrastructure project that has been long delayed by debates over its scale, earthquake threats, environmental impact and the spectre of mafia interference.\n\nThe Strait of Messina Bridge will be \"the biggest infrastructure project in the West,\" Transport Minister Matteo Salvini told a news conference in Rome, after an interministerial committee with oversight of strategic public investments approved the project.\n\nSalvini cited studies showing the project will create 120,000 jobs a year and accelerate growth in economically lagging southern Italy, as billions more in investments are made in roads and other infrastructure projects accompanying the bridge.\n\nItaly cleared the way on Wednesday to build the world's largest suspension bridge linking the Italian mainland with Sicily (WeBuild Group)\n\nPreliminary work could begin between late September and early October, once Italy's court of audit signs off, with construction expected to start next year.\n\nDespite bureaucratic delays, the bridge is expected to be completed between 2032-2033, Salvini said.\n\nThe Strait of Messina Bridge has been approved and cancelled multiple times since the Italian government first solicited proposals in 1969.\n\nPremier Giorgia Meloni's administration revived the project in 2023, and this marks the furthest stage the ambitious project— first envisioned by the Romans — has ever reached.\n\n\"From a technical standpoint, it's an absolutely fascinating engineering project,'' Salvini said.\n\nThe Strait of Messina Bridge would measure nearly 3.7 kilometres, with the suspended span reaching 3.3 kilometres, surpassing Turkey's Canakkale Bridge, currently the longest, by 1277 metres.\n\nThe $24 billion infrastructure project has been long delayed by debates over its scale, earthquake threats, environmental impact and the spectre of mafia interference. (WeBuild Group)\n\nWith three car lanes in each direction flanked by a double-track railway, the bridge would have the capacity to carry 6000 cars an hour and 200 trains a day — reducing the time to cross the strait by ferry from up to 100 minutes to 10 minutes by car. Trains will also save transit time, Salvini said.\n\nThe project could provide a boost to Italy's commitment to raise defense spending to 5 per cent of GDP targeted by NATO, as the government has indicated it would classify the bridge as defence-related, helping it to meet a 1.5 per cent security component.\n\nItaly argues that the bridge would form a strategic corridor for rapid troop movements and equipment deployment to NATO's southern flanks, qualifying it as a \"security-enhancing infrastructure.\"\n\nSalvini confirmed the intention to classify the project as dual use, but said that was up to Italy's defence and economic ministers.\n\nEnvironmental groups have lodged complaints with the EU, citing concerns that the project will impact migratory birds (WeBuild Group)\n\nWith three car lanes in each direction flanked by a double-track railway, the bridge would have the capacity to carry 6000 cars an hour and 200 trains a day (WeBuild Group)\n\nA group of more than 600 professors and researchers signed a letter earlier this summer opposing the military classification, noting that such a move would require additional assessments to see if it could withstand military use.\n\nOpponents also say the designation would potentially make the bridge a target.\n\nEnvironmental groups have lodged complaints with the EU, citing concerns that the project will impact migratory birds, noting that environmental studies had not demonstrated that the project is a public imperative and that any environmental damage would be offset.\n\nThe original government decree reactivating the bridge project included language giving the Interior Ministry control over anti-mafia measures.\n\nThe original government decree reactivating the bridge project included language giving the Interior Ministry control over anti-mafia measures. (WeBuild Group)\n\nBut Italy's president insisted that the project remain subject to anti-mafia legislation that applies to all large-scale infrastructure projects in Italy out of concerns that the ad-hoc arrangement would weaken controls.\n\nSalvini pledged that keeping organised crime out of the project was top priority, saying it would adhere to the same protocols used for the Expo 2015 World's Fair and the upcoming Milan-Cortina 2026 Winter Olympic Games.\n\n\"We need to pay attention so that the entire supply chain is impermeable to bad actors,'' he said.\n\nThe project has been awarded to a consortium led by WeBuild, an Italian infrastructure group that initially won the bid to build the bridge in 2006 before it was later cancelled.\n\nThe project has been awarded to a consortium led by WeBuild, an Italian infrastructure group that initially won the bid to build the bridge in 2006 before it was later cancelled. (WeBuild Group)\n\nWeBuild constructed the Canakkale Bridge using the engineering model originally devised for the Messina bridge. It includes a wing profile and a deck shape that resembles a fighter jet fuselage with openings to allow wind to pass through the structure, according to WeBuild.\n\nAddressing concerns about building the bridge over the Messina fault, which triggered a deadly quake in 1908, WeBuild has emphasised that suspension bridges are structurally less vulnerable to seismic forces.\n\nIt noted that such bridges have been built in seismically active areas, including Japan. Turkey and California.\n\nWeBuild CEO Pietro Salini said in a statement that the Strait of Messina Bridge \"will be transformative for the whole country.\"",
    "source": "9News",
    "cluster_id": 10
  },
  {
    "url": "https://www.9news.com.au/world/entitled-behaviour-family-claims-their-parking-space-with-road-cone/a0ca3a77-f160-4b3b-9dfd-d21c778c5269",
    "title": "'Entitled behaviour': Family claims 'their' parking space with road cone",
    "publish_date": "Tue, 05 Aug 2025 21:36:19 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The card left on a New Zealand man's windscreen didn't pull any punches: \"Hey! You absolutely suck at parking!\" it read.\n\nFlipping it over, the man saw a note in thick black pen. \"MOVE YOUR CAR!\"\n\nBut the man, who asked to stay anonymous, hadn't done anything wrong. His vehicle, parked opposite his home on a residential street in Milldale, north Auckland, was not in a reserved or disabled spot - it was parked perfectly legally.\n\nHe penned a response on the back - \"street parking is public\" - and placed it on the windscreen of his neighbour's car.\n\nOccupants of an Auckland house have been using a road cone to mark out \"their\" parking spot. (Reddit)\n\nWhile the card was unwelcome, it wasn't a surprise. The same neighbour who left the card had been using a road cone to mark \"their\" space, reserving one of the two street parking spaces outside their home.\n\n\"The cone situation has been going on for a while,\" the man told Stuff .\n\nHe said the neighbour, who lived in a property with a double garage and driveway, kept the cone in his boot, putting it in place whenever he left home in the afternoons.\n\nWhen Stuff visited on Tuesday, a woman, who did not want to be named but who said she was one of the owners of the house, answered the door.\n\nShe said: \"It's not really a public parking space. People keep parking their cars on our spot, we've got three vehicles and this is the parking allocated for our home and that's the only reason why.\n\n\"When we leave for five minutes and we come back, then we have to park way up in the street.\"\n\nThis note was no surprise to the resident who found it on his windscreen. (Reddit)\n\nShe said it was about \"common sense\". They had told the owner of the car the note was left on that they didn't mind them parking there during the day, but that they wanted the space from 5pm when they were all home.\n\n\"They are moaning about it, but like we said and explained to them, have a little bit of common sense.\n\n\"We said we don't mind you parking there but my husband is coming home later. Where the hell is he supposed to park?\"\n\nStuff sent photos from the scene to Auckland Transport. A member of their media team said he wasn't sure if the cone came from a contractor, or was privately owned.\n\n\"Regardless, in this case, it's being cheekily used to reserve a parking space, which is a no-go.\n\n\"Parking spaces on the road, including this parking space on this street… are for everyone to use.\"\n\nThe cone in the parking spot on a Milldale street. (Reddit)\n\nUniversity of Auckland Professor Dr Tim Welch, who studies transportation, infrastructure and urban modelling, said such territorial behaviour was surprisingly common.\n\n\"It's the perception you have ownership over everything that's in front of your property, even though it's technically open to everyone.\"\n\nHe called the behaviour \"erratic and irrational\", pointing out that we don't see the same kind of ownership over footpaths.\n\n\"You don't see people blocking off those spaces.\"\n\nWelch said driver psychology often meant they felt they had priority over other modes of transport, which resulted in rageful feelings when slowed down by traffic or cyclists.\n\n\"That comes out in dangerous driving... blocking off your car space is an extension of that.\"\n\nUniversity of Canterbury's Dr Simon Kingham, who specialises in the effect of urban environment on health and wellbeing, called the behaviour \"slightly entitled and selfish\".\n\n\"None of us own streets outside our house, but a lot of people feel the parking space outside is theirs, but it's a public space.\n\n\"It's not great in terms of community well being and cohesion.\"",
    "source": "9News",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/damage-state-schools-revealed-repair-cost/105622520",
    "title": "One-third of Qld state school assets in poor condition, report finds",
    "publish_date": "Thu, 07 Aug 2025 02:13:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Teachers and students at schools across Queensland have been subject to rotting ceilings, dilapidated sport courts and unsafe infrastructure, a new report has found.\n\nThe Department of Education's Comprehensive Review of Infrastructure Renewal report, commissioned by the former Labor government in 2022, highlights a multi-million-dollar maintenance shortfall.\n\nEducation Minister John-Paul Langbroek said it shows \"significant underinvestment by Labor\".\n\nA Central Queensland school has seen damage from water ingress. (Supplied: Department of Education)\n\n\"Our maintenance backlog is now $441-million in our state school system,\" he said.\n\n\" Up to a third of our schools infrastructure, whether it's roofs, walls, ceilings or gutters, are in very poor or poor condition. \"\n\nTo the detriment of teachers, students\n\nThe report, handed to the government in February, lists a backlog figure double the annual maintenance allocation of $226-million for state schools.\n\nIt states there are consequences of not funding the backlog gap.\n\n\"[The] backlog will further increase, for example by the end of 2028-29 the renewal backlog will be over $900-million,\" the report said.\n\nThe damage at schools across Queensland range from damaged concrete plinths to dilapidated sport courts. (Supplied: Department of Education)\n\nMr Langbroek said the same issues were significant when he last served as education minister between 2012 and 2015.\n\n\"Labor have neglected this for 10 years, [they] chose to kick the can down the road,\" he said.\n\n\"The report shows [the backlog] cannot be fixed in one year.\n\n\" It's clear that we're going to have to do more, we're up for the job. \"\n\nEducation Minister John-Paul Langbroek said the level of damage varied between schools. (ABC News: Nathan O'Brien)\n\nThe report lists the Metro North region as having the highest percentage of assets in poor or very poor condition, at 58 per cent, followed by Metro South at 53 per cent.\n\nThe Far North Queensland region recorded 40 per cent of assets at state schools to be in poor or very poor condition.\n\nOn a recent visit to Winton, the education minister said he had seen an unsafe staircase fenced off.\n\nStudents and teachers have been blocked from using stairs with wood rot at a south east Queensland school. (Supplied: Department of Education)\n\n\"It's to the detriment of teachers and students.\"\n\nMr Langbroek believes the current state of school infrastructure contributed to more than 50,000 teachers striking for 24-hours across the state this week.\n\n\"No wonder Work Cover claims were increasing and morale was decreasing,\" he said.\n\nWorkforce strategy to come, conciliation continues\n\n13 per cent of students and around 9 per cent of teachers still attended state schools during Wednesday's industrial action.\n\nThe minister said the move was an example of teachers \"airing their frustration\" at issues, including the state of infrastructure, and he looked forward to continuing conciliation in the coming days.\n\n\"We made an offer that's above inflation ... and attempting to deal with many of the issues expressed by teachers,\" he said.\n\n\"We look forward to sitting with an independent umpire — the Industrial Relations Commission — to continue our offer ... to enhance the offer we have made.\"\n\nChants could be heard across Brisbane as union members marched to Parliament House on Wednesday. (ABC News: Alex Brewster)\n\nThe Queensland Teachers' Union (QTU) said they were striking for not only better pay, but also reducing occupational violence and improving respect for the profession.\n\nMr Langbroek said the government intended to announce a workforce strategy in the coming weeks, aiming to address some of the QTU's concerns.\n\n\"We'll be turning our minds to that very soon,\" he said.\n\n\" Occupational violence will be an important part of that. I read testimonials yesterday, no one deserves to be treated like that in their workplace. \"\n\nThe opposition has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/majella-wines-producing-coonawarra-brandy-for-first-tme/105618750",
    "title": "Hopes for a brandy comeback as Coonawarra produces first branded batch",
    "publish_date": "Thu, 07 Aug 2025 02:00:30 +0000",
    "category": "finance",
    "authors": [],
    "text": "For the first time in decades, brandy is returning to the Coonawarra.\n\nThe region was once a major producer of the wine-based liquor, before it dropped out of fashion.\n\nThe idea to bring back brandy to the Coonawarra came from the director of Majella Wines, Brian \"Prof\" Lynn.\n\nAfter contemplating launching a spirit, he thought brandy would be the most natural progression from wine.\n\n\"In the old days, if you had leftover wine, you would distil that and make brandy,\" he said.\n\nMr Lynn says the process of making brandy reduces waste in the vineyard. (ABC South East SA: Elsie Adamo)\n\nIt has so far been a straightforward addition for the business, requiring only a distillation still in addition to their existing wine, rainwater and wooden ageing barrels.\n\nMr Lynn has found the distilling process to be quick, only taking about six hours.\n\nBut the ageing process is slow, with all brandy legally required to be aged for two years in a wooden cask.\n\n\"There is a lot of patience involved,\" Mr Lynn said.\n\nHistoric connections\n\nDespite the strong historic origins of brandy in the region, Majella's release is the first to include the region on the labelling.\n\nIn the early 1900s, tastes were changing and demand for dry reds dwindled. The brandy produced with the surplus grapes would eventually become generically branded brandy.\n\nArthur Hoffmann's Wynns Coonawarra Estate logbook for making wine and brandy. (ABC South East SA: Elsie Adamo)\n\n\"You couldn't sell the wine — no-one wanted to drink dry red wine back then … so it was decided to convert all that wine into brandy,\" Mr Lynn said.\n\nBut as other wine varieties grew in popularity, Coonawarra's brandy production declined and eventually stopped in the late 20th century.\n\nMuch of the knowledge about Coonawarra brandy has been lost through the decades, but there are some in the region still with connections to the liquor.\n\nDiana Clayfield's family has strong historic ties to the Coonawarra wine industry. (ABC South East SA: Elsie Adamo)\n\nCoonawarra resident Diana Clayfield's father, Arthur Hoffmann, was a viticulturalist, wine and brandy maker in the region.\n\n\"He enjoyed doing it [making brandy],\" she said.\n\n\" It's nice to see it back in the Coonawarra. \"\n\nMs Clayfield remembers the generation before her enjoying a brandy, and sometimes even using it for medicinal purposes.\n\n\"If you had a flu, they warmed brandy and wine up together and had it as a medicine,\" she said.\n\n'Cure-all' brandy\n\nIt was this connection with medicine that helped brandy to become so popular, with production peaking in the 1960s.\n\nTo be labelled brandy, the distilled spirit is required to be aged two years in wooden casks. (ABC South East SA: Elsie Adamo)\n\nLuke McCarthy has extensively researched and written about Australian spirits and brandy.\n\nHe said hospital brandy emerged around the turn of the 20th century, with major brands producing it into the 1940s.\n\n\"Many brandies were marketed as 'invalid brandy' or 'hospital brandy' because at that stage hospitals, in particular, used a lot of brandy as a cure-all,\" Mr McCarthy said.\n\nUsed wine barrels have been repurposed to age the brandy at Majella Wines in Coonawarra. (ABC South East SA: Elsie Adamo)\n\nThe term fell out of vogue around the same time brandy production declined.\n\nAnother blow was the federal excise on brandy, facing a large increase in the 1970s to be closer to other spirits.\n\n\"It's a combination of economic forces, government intervention and then shifting consumer trends, which have seen brandy really ride this sort of roller coaster ride over the last 100 years,\" Mr McCarthy said.\n\nReinvigorating brandy\n\nAustralian Distillers Association president Holly Klintworth said, although the market for other spirits like gin had become crowded, there was an opportunity ahead for brandy.\n\nThe first Coonawarra branded brandy was released earlier this year. (ABC South East SA: Elsie Adamo)\n\n\"There's definitely a place in Australia for brandy and I hope that it's only a matter of time before more and more people start to rediscover just how amazing brandy can be,\" she said.\n\nAnd it could be a money spinner for wineries — Ms Klintworth's distillery turns \"about $16,000 worth of wine into the equivalent of $1.5 million worth of brandy\".\n\n\"It makes a lot of sense. We've got so many wine regions,\" she said.\n\n\" To be able to turn leftover wine, and in years of a wine glut, into a product and value-add to wine regions is a fantastic concept. \"\n\nThe Coonawarra region is known for its cabernet sauvignon wine. (ABC South East SA: Elsie Adamo)\n\nMr Lynn agrees that conditions are right for a comeback.\n\nHe was already ageing a fresh batch of brandy to release in future years.\n\n\"In the old days, brandy was huge; everyone drank brandy,\" he said.\n\n\" It's time to bring brandy back. \"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/satellite-internet-competition-nbn-amazon-starlink/105620108",
    "title": "Starlink rival NBN Co–Amazon co-op potentially a boon for users",
    "publish_date": "Thu, 07 Aug 2025 01:17:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia is set to get another satellite internet provider in 2026, giving SpaceX's Starlink some long-awaited competition.\n\nGovernment-owned NBN Co has partnered with Amazon to roll out high-speed broadband using 3,200 low Earth orbit (LEO) satellites from Amazon's Project Kuiper.\n\nReliable connectivity in the bush is essential for emergency services. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nStarlink already has about 7,000 operational satellites providing internet to remote parts of the country.\n\nWith Amazon entering the game, there will soon be more than 10,000 LEO satellites focused on delivering high-speed internet — and that is not counting all the other satellites in orbit.\n\nThe new service is expected to launch in 2026, and NBN Co says it will offer a major upgrade in speed and reliability for people currently using its satellite network.\n\nSince Sky Muster launched in 2015, ongoing issues with its reliability and performance prompted many internet users to switch to Starlink, which quickly became a popular provider thanks to its LEO satellites.\n\nThe transition from Sky Muster to LEO satellites has sparked hopes that a bit of competition might finally benefit regional users.\n\nAmazon's KA-01 mission launch earlier this year. (Supplied: Amazon Project Kuiper)\n\nNBN Co's chief development officer for regional and remote services, Gavin Williams, said the partnership would benefit new and existing customers.\n\nHe said the new venture with Amazon would replace NBN's Sky Muster, which is currently just two satellites 36,000 kilometres into space.\n\n\"The Kuiper constellation will be 3,200 satellites, so a lot more satellites, and in round numbers will be around 600 kilometres from Earth,\" he said.\n\nAmazon has built ground stations that will connect customers' outdoor boxes with satellites. (Supplied: NBN Co)\n\nMr Williams said this would greatly increase the speed of the internet for up to 300,000 customers.\n\n\"In an online world, the imperatives and significance of fast and reliable broadband in remote parts of the country [is vital],\" he said.\n\n\"If your home-based classroom's offline, you can't just pop the kids down to school.\n\n\"If your online shop doesn't work, you can't just pop down to Woolies down the street.\n\n\"It's literally and figuratively a lifeline for customers in remote WA.\"\n\nThe new satellite service will bring connectivity to isolated places within Australia. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nTechnology critical for remote towns\n\nFor remote areas, such as the Shire of Yalgoo, CEO Ian Holland said satellite technology was important for emergency services.\n\n\"A lot of our area historically hasn't been covered by anything other than a really slow-to-connect sat [satellite] phone,\" Mr Holland said.\n\n\"We've had some investment for Starlink units for our fire trucks, and I know that other emergency services such as WA Police and St John have been rolling out LEO equipment as well.\n\n\" Even just being able to make that phone call, talking with RFDS about a medical emergency, and anything that makes response faster and allows people to be tracked down faster is a massive boom to emergency services out here. \"\n\nIan Holland says while the satellites are great for isolated locations, the night sky becomes full of streaking satellites. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nMr Holland said that while competition between companies would be a win for consumers, the night sky was already getting crowded with satellites.\n\nStaying connected wherever we are comes at a cost.\n\n\"From a night sky perspective, we can already look up and see the trails of these objects flying through,\" Mr Holland said.\n\n\"I think that's the reality of where technology is going within this space.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-08-07/fleets-docked-tiger-prawn-season-northern-fishery-queensland/105618250",
    "title": "Fishing fleets stay docked as tiger prawn season opens",
    "publish_date": "Thu, 07 Aug 2025 01:07:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "For the first time in decades, parts of the northern prawn fishing fleet have stayed docked at the start of the tiger prawn season.\n\nThe season started on August 1, but Austral Fisheries general manager Andy Prendergast said it was the first time in nearly 60 years that some boats had not sailed.\n\n\"It's cheaper to not go than it is to go,\" he said.\n\n\"Our product's [sales price] has gone down by about 30 per cent, and our costs have gone through the roof.\n\n\" For the last four years, nobody's made a cent. As a matter of fact, we've been losing money. \"\n\nTiger prawn season opened on August 1 in the Northern Prawn Fishery. (Supplied: Austral Fisheries)\n\nWith 11 boats trawling through the Gulf of Carpentaria, Austral is the second-largest operator in the Northern Prawn Fishery, which has been open since the late 1960s.\n\nBut Mr Prendergast said only 45 of the 52 boats in the fleet ventured out over the weekend, with several choosing to stay docked due to mounting economic pressure.\n\n\"Hopefully the industry can resolve these issues over time, but we're in a bit of a tough space at the moment,\" he said.\n\nThe past four years have been particularly tough for the wild-caught prawn industry, with pandemic-driven inflation pushing costs up and profits down.\n\nAndy Prendergast is the general manager for Austral Fisheries. (ABC Rural: Sophie Johnson)\n\nAdditionally, he said wild-caught prawns had to compete with cheaper products provided by a growing aquaculture industry.\n\n\"We're losing market relevance,\" he said.\n\n\"We're being displaced in all those shop windows by aquaculture products that are easier to get access to all year round.\"\n\nAustral Fisheries has an 11-boat fleet out in the Northern Prawn Fishery for tiger prawn season. (Supplied: Austral Fisheries)\n\nHe said retail prices for some prawns were as low as $15 a kilogram.\n\n\"That would match our cost of production, [but] the supermarkets have to make some money to sell this stuff, so we're selling them under our cost of production,\" he said.\n\nHe said the volatility in the wild catch could also lead to supply fluctuations, which made it challenging to provide consistency for consumers.\n\n\"We need Australian consumers to understand the amount of effort and passion we bring to bringing them fresh, wild-caught seafood that's sustainable,\" he said.\n\n\" If you want to continue to eat wild-caught seafood in Australia, we need your help. \"\n\n'Horror' banana prawn season\n\nThis tiger prawn season is coming off the back of the worst banana prawn catch in 24 years, according to Phil Robson, the Northern Fishing Fleet Manager at A Raptis & Sons.\n\n\"The banana prawn season was a horror,\" he said.\n\nThe late monsoon negatively impacted the banana prawn season. (ABC Rural: Abbey Halter)\n\n\"We end up with about a 45-tonne average, but generally I budget 100 tonnes per boat for the banana season, which is what we need to make in any given year to make money.\n\n\"Obviously, we didn't get near that this year.\"\n\nThe largest operator in the fishery, with 14 boats, Mr Robson said the late monsoon impacted the size and number of banana prawns.\n\n\"[The timing of the monsoon] is critically important,\" he said.\n\n\"Prawns are generally in close [to shore] and they need to be washed out to deeper water with the onset of the monsoon season and the rainfall [to mature].\n\nBanana prawns typically settle in rivers and are flushed into the Gulf of Carpentaria with the first downpour of the year, enabling the fishing season to open through autumn into June.\n\nDespite the disappointing year for banana prawns, Mr Robson said that because of high volumes last year, there was still an oversupply in the retail market.\n\n\"2023 was big, it was the biggest year we've had in the last five years,\" he said.\n\n\"That created pretty well double what the market could absorb.\"\n\nBut like Mr Prendergast, he was hoping for a stronger tiger prawn season to make up for some of the losses felt earlier this year.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/italy-approves-worlds-longest-suspension-bridge/105622710",
    "title": "Italy greenlights world's longest suspension bridge to Sicily",
    "publish_date": "Thu, 07 Aug 2025 00:29:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Italy has cleared the way to build the world's largest suspension bridge, which would link the mainland with Sicily.\n\nThe 13.5 billion euro ($24.2 billion) infrastructure project has been long delayed by debates over its scale, earthquake threats, environmental impact, and the spectre of mafia interference.\n\nThe Strait of Messina Bridge will be \"the biggest infrastructure project in the West,\" Transport Minister Matteo Salvini told a news conference in Rome.\n\nPremier Giorgia Meloni said the bridge \"will be an engineering symbol of global significance\".\n\nMr Salvini cited studies showing the project will create 120,000 jobs a year, and accelerate growth in economically lagging southern Italy, as billions more in investments are made in roads and other infrastructure projects accompanying the bridge.\n\nMatteo Salvini says preliminary works could begin as soon as late September. (AP: Andrew Medichini)\n\nPreliminary work could begin between late September and early October, once Italy's court of audit signs off, with construction expected to start next year.\n\nDespite bureaucratic delays, the bridge is expected to be completed between 2032 and 2033, Mr Salvini said.\n\nThe Strait of Messina Bridge has been approved and cancelled multiple times since the Italian government first solicited proposals in 1969.\n\nThe Meloni administration revived the project in 2023, and this marks the furthest stage the ambitious project — first envisioned by the Romans — has ever reached.\n\n\"From a technical standpoint, it's an absolutely fascinating engineering project,'' Mr Salvini said.\n\nThe bridge would measure nearly 3.7 kilometres, with the suspended span reaching 3.3 kilometres.\n\nThat would surpass Türkiye's Çanakkale Bridge, currently the longest, by 1,277 metres.\n\nThe Çanakkale Bridge was built in 2022, using an engineering design similar to the one devised for the Messina bridge.\n\nTürkiye's President Recep Tayyip Erdoğan poses for photos at the opening ceremony of the Çanakkale Bridge in 2022. (AP: Turkish Presidency)\n\nThe design includes a wing profile and a deck shape that resembles a fighter jet fuselage with openings to allow wind to pass through the structure, according to Webuild, the industrial group awarded the project.\n\nWith three car lanes in each direction flanked by a double-track railway, the bridge would have the capacity to carry 6,000 cars an hour and 200 trains a day — reducing the time to cross the strait by ferry from up to 100 minutes to 10 minutes by car.\n\nBridge could count toward NATO spending target\n\nThe project could provide a boost to Italy's commitment to raise defence spending to 5 per cent of GDP, as targeted by NATO.\n\nThe government has indicated it would classify the bridge as defence-related, helping it to meet a 1.5 per cent security component.\n\nItaly argues the bridge would form a strategic corridor for rapid troop movements and equipment deployment to NATO's southern flanks, qualifying it as a \"security-enhancing infrastructure\".\n\nMr Salvini confirmed the intention to classify the project as dual use but said it was up to Italy's defence and economic ministers.\n\nThe military classification has been criticised by a group of more than 600 professors and researchers.\n\nThey signed a letter noting that such a move would require additional assessments to see if it could withstand military use.\n\nOpponents also say the designation would potentially make the bridge a target.\n\nThe government has indicated it will classify the bridge as defence-related. (AP: Webuild/Eurolink Image Library)\n\nConcerns over organised crime\n\nThe decree that reactivated the bridge project included language giving Italy's Ministry of the Interior control over anti-mafia measures.\n\nBut the country's president insisted the project remain subject to anti-mafia legislation that applies to all large-scale infrastructure projects in Italy, out of concerns the ad hoc arrangement could weaken controls.\n\nMr Salvini pledged that keeping organised crime out of the project was a top priority, saying it would adhere to the same protocols used for the Expo 2015 World's Fair and the upcoming Milan-Cortina 2026 Winter Olympic Games.\n\n\"We need to pay attention so that the entire supply chain is impermeable to bad actors,'' he said.\n\nAddressing concerns about building the bridge over the Messina fault, which triggered a deadly earthquake in 1908, Webuild has emphasised that suspension bridges are structurally less vulnerable to seismic forces.\n\nIt noted that such bridges have been built in seismically active areas, including Japan, Türkiye and California.\n\nEnvironmental groups have lodged complaints with the European Union, citing concerns the project will impact migratory birds, noting environmental studies had not demonstrated the project is a public imperative, and any environmental damage would be offset.\n\nAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/german-chef-tackles-food-waste-in-regional-western-australia/105614284",
    "title": "East German upbringing sparks baker's passion for tackling food waste",
    "publish_date": "Wed, 06 Aug 2025 23:23:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Spent beer grains, ugly fruit and old coffee beans might seem, at first glance, like odd things to throw into a morning treat.\n\nBut in Western Australia's South West, a German chef has made using ingredients — that would otherwise go to waste — a cornerstone of his business.\n\n\"The name [of my shop] is German for 'fallen fruit', and that just encompasses the whole concept of the business,\" Wilhelm Grothum said.\n\n\" I guess you could call this my waste HQ. I am all about minimising food waste. \"\n\nThe chef cooks with ingredients supplied from local farmers. (ABC South West WA: Kimberley Putland)\n\nThe chef opened his store, Fallobst, at Bridgetown, 260 kilometres south of Perth, in 2023, with the idea that the food would incorporate elements of otherwise-unwanted ingredients.\n\n\"It ranges from tomatoes in summer, at the moment we are using lots of citrus like oranges and lemons,\" Mr Grothum said.\n\nAlthough he is best known for his sourdough breads, the chef said he experimented with a variety of \"ugly\" produce.\n\n\"I sometimes use spent beer grains from the local cidery, or coffee grounds — sometimes I cook chocolate and coffee-ground cookies,\" he said.\n\nThe menu is constantly changed based on seasonality. (ABC South West WA: Kate Forrester)\n\nChildhood influence\n\nHaving moved from Germany to Australia nearly two decades ago, Mr Grothum said his interest in tackling food waste started in childhood.\n\n\"I moved here in 2006, but since then I have travelled the world, working on different farms,\" he said.\n\n\"You can see [food waste] is a global problem.\n\nWilhelm Grothum experiments tirelessly before anything makes it onto his shelves. (ABC South West WA: Kate Forrester)\n\n\"I always remember when I was growing up in East Germany, spending time with my grandparents out in their fields, helping them grow potatoes, feeding the livestock. I think it was then that I became aware of food waste.\n\n\" It was a period when people thought twice about throwing things out, back then there was a value on that because people didn't have a lot. \"\n\nWilhelm Grothum says he grew up with an agricultural background in Germany. (ABC South West WA: Madigan Landry)\n\nThe chef said he hoped to see the food industry take greater action in addressing waste.\n\n\"There needs to be more skills provided to the food industry in general, there needs to be more happening when it comes to food waste,\" Mr Grothum said.\n\n\"That's why I am trying to give a bit of an insight into what is possible.\"\n\nShared solutions\n\nManjimup passionfruit grower Mitchell East supplied some of his surplus produce to the Bridgetown bakery.\n\n\"He has made passionfruit vinegar, passionfruit-infused salt — it's a good collaboration between like-minded people,\" Mr East said.\n\nMitchell East has sent some of his waste to the German baker in the past. (ABC South West: Madigan Landry)\n\nAlthough Mr East has a processing facility on his farm, the grower said there were parts of the passionfruit he could not use, so having another outlet for the excess was a valuable alternative.\n\n\"The skin can't be used by us, except for animal feed, so Will was able to take some of that from us,\" Mr East said.\n\nMitchell East makes sodas using second-grade passionfruit. (ABC South West: Madigan Landry)\n\n\"We also remove a portion of the seed when we make our cordials and sodas, and at the moment we don't have a use for [the seeds], so Will can ferment it, he can dry it.\n\n\"All these different things he can do on a small scale, but still re-harness that lost energy.\"\n\nMitchell East's passionfruit waste has been given a second life by Fallobst's owner. (ABC South West WA: Madigan Landry)\n\nMr East said he saw a great opportunity in the waste space in South West WA.\n\n\"As a farmer, you are always going to have waste; there is nothing you can do about it,\" he said.\n\n\"But if there are people who are keen to tackle food waste, there are definitely opportunities here.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/richmond-river-high-school-campus-plans-revealed-for-lismore/105574078",
    "title": "Flooded high school retains heart as it rises from mud and ash",
    "publish_date": "Wed, 06 Aug 2025 23:04:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "For Leo Logan, it is the small things that make Richmond River High's historic North Lismore campus special.\n\nThis is where his brother, sister and mother were once students, and his grandfather worked as a teacher.\n\n\"Seeing all the old stuff — desks with people's names scribbled on them from 30 years ago — it was really cool,\" he said.\n\nBut Leo spent just two weeks at the northern New South Wales school before it was destroyed by floods in 2022.\n\nRichmond River High School during the 2022 flood. (Supplied: Rod Evans)\n\nHe spent the next three years learning in cramped demountable classrooms.\n\nNow in year 10, the 15-year-old said he was disappointed he did not get the chance to make memories at the school.\n\n\"It was quite emotional,\" he said.\n\n\" I had been waiting to go to that school because my siblings had been hyping it up, but I never got to experience it. \"\n\nRichmond River High suffered significant damage in the February flood event. (Facebook: The Rivers Secondary College)\n\nSchool resurrected\n\nThe Department of Education deemed the North Lismore campus of The Rivers Secondary College \"unsalvageable\".\n\nThe 2022 flood caused widespread damage, and a fire in March this year destroyed much of the historic timber structure.\n\nFire destroyed the flood-damaged Richmond River High campus in North Lismore in March. (ABC North Coast: Cathy Adams)\n\nPlans have been released for a new school that will sit above the Probable Maximum Flood height, within five minutes' drive of the old site.\n\nIt will include more than 50 classrooms, performance spaces, and facilities for sport, agriculture, construction, and food technologies.\n\nThe NSW Reconstruction Authority will fast-track planning approvals for the new campus, which is expected to be open for term 1, 2027.\n\nTo meet the deadline, modular buildings will be manufactured offsite while civil infrastructure works are carried out onsite.\n\nFlood repairs\n\nSo far, 16 of the 21 flood-damaged schools in the region have been repaired or rebuilt, with flood resilience at the forefront of planning.\n\nRepairs to schools at Tumbulgum and Condong in the Tweed Shire are underway, while work is in the pipeline to complete public schools at Murwillumbah East, South Lismore, and Cabbage Tree Island.\n\nAn artist's impression of the proposed Richmond River High School campus in North Lismore. (Supplied: NSW Government)\n\nPrincipal Luke Woodward said while he would miss the \"beautiful\" old school building, it was not what made Richmond River High special.\n\n\"Our drawing area is vastly different from a lot of high schools that come from a particular suburb or a particular area — our kids live in communities, [they're] small village kids, farming kids,\" he said.\n\n\"We have a really eclectic, diverse range of students and staff.\n\n\" The culture that we had on that site, that was there well before my time, and will be there well after we move onto our new site. \"\n\nLeo's mum, Megan Bennett, studied at the school and is now the P&C president.\n\nMs Bennett said the new design reflected the school's identity and embodied the spirit of inclusivity.\n\nShe said elements such as the yarning and dancing circles acknowledged the Aboriginal heritage of the land where the new school would sit.\n\nA satellite view of the proposed Richmond River High School campus in North Lismore. (Supplied: NSW government) .\n\nLeo's grandfather Ed Bennett fondly remembered the time he spent teaching at the school.\n\n\"In the time that I was there, there was a feeling of belonging to a place,\" he said.\n\n\"It was like a big family, and that was really important to us.\"\n\nMr Bennett estimated that over 65 years, more than 15,000 students passed through the old school.\n\nAn artist's impression of two of the proposed Richmond River High School campus buildings in North Lismore. (Supplied: NSW Government)\n\nHis grandson Leo said students at the new school would still have a sense of being part of something historic.\n\n\"Everyone who went there will know just how important the other site was, and they will make the new site just as important and loved by everyone,\" he said.\n\n\" I hope to at least spend my HSC exams in these classrooms, and maybe … I can scribble my name on a desk and have people see it in the future. \"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/wurundjeri-elder-aunty-joy-to-attend-melbourne-storm-nrl-match/105622586",
    "title": "Wurundjeri elder Aunty Joy to attend Storm NRL match despite ongoing issues with board",
    "publish_date": "Wed, 06 Aug 2025 22:56:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "Wurundjeri Woi-wurrung elder Aunty Joy Murphy Wandin has said she will attend Thursday night's Melbourne Storm home game despite ongoing concerns with the club's board.\n\nThe Storm announced this week that an Acknowledgement of Country would be held prior to their match with the Brisbane Broncos, marking the NRL's Indigenous Round.\n\nThe club also apologised to Aunty Joy for the cancellation of a Welcome to Country before to the Storm's Anzac Day match, where the Wurundjeri elder had been at the stadium to perform.\n\nAunty Joy told Anzac Day Welcome to Country 'inappropriate' Photo shows Headshot of Aunty Joy wearing classes and a possum fur coat. Aunty Joy Murphy Wandin says she does not know if she could work with Melbourne Storm again after the NRL club cancelled her Welcome to Country ceremony on Anzac Day.\n\nAhead of Thursday's match, Aunty Joy said she would attend in support of players, staff and community, despite a resolution not being reached with the club's board after Anzac Day.\n\n\"This is about the board, not the game. This is about setting a standard not just for Melbourne Storm but across all sporting codes,\" Aunty Joy said.\n\n\"I will always stand strong beside community and as a leader take responsibility to care for those who hurt badly.\"\n\nMelbourne said at the time that the club's \"board had not approved for it to be held on Anzac Day\".\n\nThe cancellation came hours after Bunurong and Gunditjmara man Uncle Mark Brown was booed and heckled by members of the crowd at the dawn service at Melbourne's Shrine of Remembrance.\n\nThe Storm said its decision was not related to the booing earlier in the day, but Aunty Joy said she was told it was.\n\nAunty Joy said Wurundjeri people wanted to continue their association with the Melbourne Storm, but highlighted they \"cannot safely undertake formal ceremonies\" due to one board member's reported links with lobby group Advance Australia.\n\n\"I carry a deep responsibility to community and will not compromise my integrity as a proud Aboriginal woman and community elder,\" she said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"We cannot support an organisation that has associations with any group that incites racial vilification and division.\n\n\"We are willing to continue to work with Melbourne Storm to address the deep community concerns but cannot endorse any official functions or cultural work until measures are put in place to ensure cultural respect and safety for all.\"\n\nWurundjeri woman and Djirri Djirri dancer Ky-Ya Nicholson was due to perform at the Anzac Day game before the Welcome to Country was cancelled.\n\nIn a statement, she said Djirri Djirri would not associate with the club \"until there is meaningful change at board level\".\n\n\"Our decision to end our long-standing relationship with Melbourne Storm comes as a result of the disrespect shown towards Aunty Joy on Anzac Day, which was a lost opportunity to honour her veteran father and First Peoples servicemen and women who fought alongside Australian soldiers,\" Nicholson said.\n\n\"We as a community feel very disrespected by the actions of Melbourne Storm's board, as a Welcome to Country ceremony is a tradition of unity and goodwill. Which has been completely disregarded, this shows their tokenistic approach and lack of understanding to this symbol of unity.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/woodside-safety-incidents-at-offshore-gas-decommissioning-sites/105610186",
    "title": "Woodside defends safety culture after 'deluge' of dangerous incidents",
    "publish_date": "Wed, 06 Aug 2025 22:31:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "A key union says it is aware of \"significant failures\" in Woodside's safety management at one of its offshore projects, days after the national regulator ordered it to suspend its decommissioning work over similar issues.\n\nThe National Offshore Petroleum Safety and Environmental Management Authority (NOPSEMA) last Thursday revoked the oil and gas giant's decommissioning obligations at Griffin and Stybarrow gas fields until it completed \"essential planning and preparatory activities\".\n\nThe orders come after what NOPSEMA called \"preventable health and safety incidents\" at both sites.\n\nNOPSEMA asked BHP to decommission both gas fields in 2021, a year before its petroleum arm was bought by Woodside.\n\nDecommissioning refers to the process of safely closing a mine or oil and gas site, with the expectation that the impacted environment will be rehabilitated afterwards.\n\nIn May, 16,000 litres of oil spilled into the ocean during removal operations at Woodside's Griffin oil and gas field, which NOPSEMA said had the potential to expose workers to hydrogen sulphide.\n\nNOPSEMA investigated an oil spill at Griffin earlier this year, around 60km from the Ningaloo Reef. (Supplied: Nick Thake)\n\nMeanwhile, the regulator said there had been unsuccessful recovery attempts and the presence of hydrates in some infrastructure at Stybarrow.\n\nA Woodside spokesperson said the company had made substantial progress towards decommissioning the Stybarrow, Griffin and Minerva fields, concluding a multi-year decommissioning program.\n\n\"Across the campaign, more than 25,000 tonnes of infrastructure, including over 140 kilometres of pipe and 100 subsea structures, have been brought to shore to enable recycling and reuse,\" it said.\n\nA Woodside spokesperson said NOPSEMA's revised general directions provided additional time and clarity for essential planning and preparatory activities.\n\nCalls to overhaul safety\n\nThe regulator's directions were welcomed by Maritime Union of Australia organiser Doug Heath, who has sent the regulator a deluge of reports about \"near misses\" at Woodside's decommissioning projects.\n\nHe told the ABC that \"a fundamental breach\" had occurred at one of Woodside's offshore projects just this week.\n\nDoug Heath says Woodside's safety culture has worsened since the death of an employee at North Rankin. (Supplied)\n\n\"We've had a series of incidents where workers have suffered, in one case a punctured lung,\" Mr Heath said.\n\n\"In other cases, there have been a series of near misses.\"\n\nIn March, NOPSEMA confirmed it was investigating lifting and crane operations at McDermott's DLV 2000 vessel, which has been decommissioning the Stybarrow gas field.\n\n\"The consequence of those rigging failures on the Woodside projects means a potential fatality,\" Mr Heath said.\n\nTwo years ago, Woodside contractor Michael Jurman died while working at the North Rankin offshore facility, an incident that NOPSEMA is still investigating.\n\nSince then, Woodside's health and safety data showed the number of high-potential incidents and total recordable injuries had increased.\n\nMr Heath said the company had not learned its lesson.\n\n\"If they need the regulator to tell them that they're not doing a good enough job, they've got some significant failures within their HSC management,\" he said.\n\nWoodside says all Enfield, Stybarrow, Minerva and Griffin wells are permanently plugged. (ABC News: Armin Azad)\n\n\"[Woodside is] doing more decommissioning work than probably any other oil and gas company in WA, but their standards have slipped over the course of time.\n\n\" I'm not sure what it's going to take for Woodside to actually learn from the abundance of evidence that's come to light over the last couple of years about their substandard safety. \"\n\nA Woodside spokesperson said safety always had been and would continue to be its priority, and it was continuously taking action to strengthen its safety culture.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/thargomindah-residents-in-caravans-cost-of-rebuilding-flood/105538454",
    "title": "Outback residents still living in caravans months after flood disaster",
    "publish_date": "Wed, 06 Aug 2025 22:12:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Deep in the Queensland outback, families are living in caravans as they try to rebuild their homes four months after catastrophic flooding.\n\nStanding in the mud-strewn shell of her home, Megan Riley finds it difficult to talk about it.\n\nThe floodwater reached the second level of Megan Riley's home. (ABC Western Qld: Grace Nakamura)\n\n\"It's bloody hard, puts you in tears,\" she said.\n\nIn April, the entire population of Thargomindah was evacuated to an airstrip as they watched a temporary levee break and a torrent of water swallow the town.\n\nOut of more than 100 houses, only 12 were left unscathed.\n\nLoading...\n\nMs Riley was one of the last people to return to her newly renovated home.\n\nShe found it ruined.\n\n\"As soon as I opened the door, I knew it was all gone … it was heartbreaking,\" Ms Riley said.\n\nFour months on, she is living in one of 32 caravans provided by the council and state government.\n\nMegan Riley's house was destroyed by floodwater. (ABC Western Qld: Grace Nakamura)\n\nHer house, which belonged to her grandparents, will have to be knocked down.\n\nBut rather than rebuild, Ms Riley said she would truck in a relocatable house.\n\n\"The price of getting a builder out here and materials to do so is just exorbitant because of the distance,\" she said.\n\n\"The plan is to lift the new house out of the flood line and not experience anything like this again.\"\n\nRebuilding costly\n\nLocal tradesman Geoff Pike runs the only trade services company in Thargomindah and has been working non-stop to rebuild the town since the flood.\n\nGeoff Pike says building in Thargomindah costs double what it does in Brisbane. (ABC Western Qld: Grace Nakamura)\n\n\"We've been slammed … it's been full on,\" he said.\n\nMr Pike said compared to Brisbane, it generally costs about double to build in Thargomindah due to the cost of getting materials to the site.\n\n\"You're adding 1,000 kilometres, and it's generally an empty truck on the way back,\" he said.\n\nThe floodwater left behind mud-clogged equipment at Geoff Pike's trade services business. (ABC Western Qld: Grace Nakamura)\n\nBut Mr Pike said it was not a lack of supplies that was slowing down the town's recovery — it was a critical shortage of accommodation.\n\n\"We're a long way short from being able to provide the army of people we want,\" he said.\n\nTo help, Mr Pike has coordinated a transportable work camp to be trucked to Thargomindah from Brisbane.\n\nHe said it would accommodate around 18 workers and significantly speed up the town's rebuild.\n\n\"We're trying to get in front of that curve and get people into houses before summer hits,\" Mr Pike said.\n\nModular homes popular\n\nQueensland's peak building sector body Master Builders said prefabricated and modular houses were becoming more common in rural areas.\n\nGeneral manager of policy and advocacy Dyan Johnson said modular homes could help \"plug the gap\" in traditional construction in the bush.\n\nDozens of families are still living in caravans months after Thargomindah flooded. (ABC Western Qld: Grace Nakamura)\n\n\"It really does fit that need of being able to meet … labour and supply challenges because you can centralise your construction a lot more,\" she said.\n\n\"If there are not enough trades on the ground, if it is too difficult and time-constrained to get the supplies out there, modular can be a solution.\"\n\nThargomindah is situated in the south-west corner of Queensland. (ABC News: Sharon Gordon/Supplied: Daniel Roy)\n\nBulloo Shire Council purchases one transportable house a year to increase housing supply in Thargomindah, costing around $700,000.\n\nMayor John \"Tractor\" Ferguson estimated a house built from scratch would cost close to $1 million to construct, but would be worth less than $200,000 when complete.\n\n\"The biggest problem here is all the on-costs: your tradies have got to get here, then they've got to stop here, then you've got freight, and your concrete is so much dearer out here,\" he said.\n\n\"Bringing all that stuff out, it nearly doubles the price of the house.\"\n\nBuilding community\n\nIn a town without many tradespeople, residents had rolled up their sleeves and gotten to work restoring local businesses.\n\nMotel owner Paul Sparks said he did not have a clue where to start when he saw the extent of the flood damage to his business.\n\nPaul Sparks points out the height of the floodwater in April. (ABC Western Qld: Grace Nakamura)\n\n\"We needed new carpets, to rip the floors out, rip the walls out, all the furniture was wrecked, the vanities, the cupboards,\" he said.\n\n\"I thought we were just going to go bankrupt.\"\n\nIt makes Mr Sparks emotional to remember the weeks following, when friends, family, neighbours, even strangers, gathered to clean up the motel.\n\nPaul Sparks says everything in his hotel rooms has needed replacing due to the flood damage. (ABC Western Qld: Hannah Walsh)\n\n\"The police officers helped pull the beds out and load skips … a young couple helped rip the carpets out … they were such a great help,\" he said.\n\n\"The help and the community getting together was fantastic — it's been pretty overwhelming.\"",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/asx-markets-business-live-news-august07-2025/105622478",
    "title": "Live: Trump to hit semiconductors with tariff, Apple to invest billions in US",
    "publish_date": "Wed, 06 Aug 2025 21:39:55 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Adelaide Miller",
      "Michael Janda",
      "Samuel Yang"
    ],
    "text": "As you might have noticed in Sam's earlier post, the ASX is the biggest loser on the stock market's top 200 index.\n\nASX shares were down 8.7% at $64.20 around 11:00am AEST.\n\nAside from the ongoing embarrassment about yesterday's TPG confusion, the bigger factor is news out last night that the Australian Securities and Investments Commission (ASIC) is close to approving a rival exchange.\n\nThat was revealed publicly in communications from Treasurer Jim Chalmers following an investor round table he hosted yesterday, where ASIC chair Joe Longo gave an update.\n\n\"Making our markets more competitive will make our economy more prosperous and productive,\" said the Treasurer in a statement. \"If it goes ahead, this will mean more investment in Australian businesses and that means more jobs and opportunities for Australian workers.\"\n\nAnd the company seeking to open that exchange is a big name — Cboe, the Chicago Board Options Exchange.\n\nThe global markets giant already has a significant presence in Australia.\n\nCommSec says about 20% of equity trading volume goes through Cboe Australia.\n\nHowever, all those companies are currently listed on the ASX, Cboe Australia simply provides an alternative trading platform.\n\nWhat ASIC is close to green-lighting is the ability of Cboe Australia to have companies list on its own exchange, so they won't have to be on the ASX.\n\nThink of it a bit like the NASDAQ in New York, which competes against the NYSE for listings.\n\nSome companies may choose a dual listing, but for others, a rival exchange may offer the prospect of reduced listing costs.\n\nFor the ASX that could mean reduced margins from listing fees and also reduced trading volumes if some firms choose to move away or float only on Cboe Australia.\n\nOn top of all that, the ASX released an update today revealing a $25-35 million estimated cost for its response to ASIC's compliance assessment and inquiry, which the corporate and financial regulator is running after a series of major problems with stock market operations, including outages, many related to the exchange's aging CHESS technology for processing trades.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-07/tennis-elina-svitolina-reveals-online-hate-received-after-loss/105622444",
    "title": "Ukrainian tennis star hits out at 'shameful' online hate messages after loss",
    "publish_date": "Wed, 06 Aug 2025 21:39:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ukrainian tennis player Elina Svitolina has spoken out about the deluge of hateful abuse she received online from frustrated gamblers after losing a match in Canada, including messages wishing her death and celebrating Russia killing her compatriots.\n\nFollowing her straight-sets loss to Naomi Osaka in the quarterfinals of the Canadian Open, Svitolina posted screenshots of the messages on Instagram.\n\nAn example of one of the messages Elina Svitolina received on her account. (Supplied: Instagram)\n\nThe abuse was directed at her, while other racial slurs also targeted her husband, the French tennis player Gael Monfils, who is Black. One abuser hoped that Russia \"kills all you (expletive) Ukrainians\" in the war raging in Svitolina's country.\n\n\"To all the bettors: I'm a mum before I'm an athlete,\" Svitolina wrote in her Instagram story.\n\n\"The way you talk to women — to mothers — is SHAMEFUL. If your mothers saw your messages, they'd be disgusted.\"\n\nEarlier this year, British player Katie Boulter said she received death threats during the French Open targeting her and her family, while the WTA and ITF called on betting companies to do more to stem the flood of online abuse players face on social media.\n\nBoulter told the BBC in an interview that online abuse has become the norm and that she thinks many of the messages are sent by people who are placing bets on tennis matches.\n\nHer comments coincided with the WTA and ITF publishing a first season-wide report into online abuse, showing that 458 tennis players were targeted by more than 8,000 abusive comments and posts on social media in 2024.\n\nThe report said 40 per cent of the abuse came from \"angry gamblers\".\n\nLast month, AFL footballers Jase Burgoyne and Nasiah Wanganeen-Milera revealed the racist messages they received on Instagram, sparking outrage from their clubs and the league as they looked to identify the culprits.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/australian-cancer-breakthrough-could-mean-an-end-to-relapse-for-thousands-including-colette-20250804-p5mk77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian cancer breakthrough could mean an end to relapse for thousands, including Colette",
    "publish_date": "Thu, 07 Aug 2025 12:18:19 +1000",
    "category": "lifestyle",
    "authors": [
      "Wendy Tuohy"
    ],
    "text": "Collette Chase says the hardest part of finishing breast cancer treatment is the fear that the disease will return.\n\n“Even Princess Kate said it recently ... you just live in a ball of anxiety,” said Chase, who is in her 50s.\n\nColette Chase had no family history or any genetic factors that would predispose her to breast cancer. Credit: Steven Siewert\n\n“People will say to you, ‘Ah look, you could get hit by a bus tomorrow’. I’d choose that because if this comes back metastatic as stage 4, what’s [the treatment] going to do to me?”\n\nAustralian scientists are hoping to alleviate this fear and halve breast cancer recurrence by utilising new technology that allows them to find, isolate and study the rare cancer cells lying dormant in people’s bones.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-makes-confession-about-weight-loss-journey-20250807-p5ml54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "1000-Lb Sisters star Tammy Slaton makes confession about weight loss journey",
    "publish_date": "Thu, 07 Aug 2025 12:09:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "1000-Lb Sisters star Tammy Slaton makes confession about weight loss journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/nsw/this-life-saving-equipment-is-standard-across-nsw-hospitals-it-was-never-installed-at-northern-beaches-20250807-p5ml43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This life-saving equipment is standard across NSW hospitals. It was never installed at Northern Beaches",
    "publish_date": "Thu, 07 Aug 2025 12:06:34 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson"
    ],
    "text": "An independent probe into the death of two-year-old Joe Massa at Northern Beaches Hospital has revealed a concerning lack of life-saving critical care cameras over the beds of seriously ill newborns and children that are standard across the state’s public hospitals.\n\nThe absence of these over-bed cameras underscored the Frenchs Forest hospital’s broader systemic gaps in critical care, resulting from the hospital’s controversial public-private partnership model, according to a report published on the Clinical Excellence Committee (CEC) earlier this month with no public announcement.\n\nElouise and Danny Massa holding a pair of their son Joe’s shoes. Credit: Kate Geraghty\n\nThe report also found a culture of dismissing red flags when patients were deteriorating, with junior staff being hesitant to raise concerns, delays in triggering emergency protocols, and tension between the financial imperatives of clinical care.\n\nWhen a child is critically ill or injured in NSW hospitals, clinicians at their bedside contact the Newborn and Paediatric Emergency Transport Service (NETS) to connect them with specialists from the Sydney Children’s Hospital Network.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/testing-shows-some-electric-vehicles-fall-short-in-driving-range-20250807-p5ml50.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Testing shows some electric vehicles fall short in driving range",
    "publish_date": "Thu, 07 Aug 2025 12:06:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Testing shows some electric vehicles fall short in driving range\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/bennett-hasler-face-off-in-spoonbowl-20250807-p5ml4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bennett, Hasler face off in Spoonbowl",
    "publish_date": "Thu, 07 Aug 2025 12:05:58 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bennett, Hasler face off in Spoonbowl\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nicolson-demolishes-gonzales-20250807-p5ml4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nicolson demolishes Gonzales",
    "publish_date": "Thu, 07 Aug 2025 12:04:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Nicolson demolishes Gonzales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/the-door-is-open-for-trump-to-create-more-chaos-20250807-p5ml1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The door is open for Trump to create more chaos",
    "publish_date": "Thu, 07 Aug 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Trump has said he is considering four contenders for the position of the Fed’s chair, which will open up in May next year when the term of the current chair, Jerome Powell, who Trump detests and attacks relentlessly and viciously, will end. Hassett, current governor Christopher Waller and former governor Kevin Warsh are thought to be on his short list. He is weighing up whether to announce a short-term appointment – someone who would fill the position until the term expires on January 31 next year – or appointing a “chair elect” who will succeed Powell when his term as chair ends next May. It’s a pivotal decision because the Kugler position might be the only opportunity he has to inject a loyalist into the Fed boardroom during this term. Powell’s chairmanship might end in May but, should he choose to remain on the board, his term as a governor runs until 2028. There are no other scheduled retirements during the Trump presidency. Federal Reserve Board governor Adriana Kugler’s unexpected resignation opens the door for Trump to tighten his grip on the Fed. Credit: AP There are reports that Trump’s advisers (which include unusual names, like Fox’s Sean Hannity and MAGA heavyweight Steve Bannon) are urging him to appoint someone who will occupy the seat only until January, giving him more time to decide on Powell’s replacement.\n\nTrump could appoint someone designated as Powell’s successor, hoping that a “shadow” chair would undermine Powell and Powell’s messaging both within and outside the Fed’s boardroom. The US Treasury Secretary Scott Bessent (who has withdrawn himself from contention for the role), mooted exactly that strategy ahead of last year’s US election. Whether the appointment is short term or unveils Powell’s successor, however, the new governor would be one of only two Trump-appointed members on the seven-member board and the 12-member Federal Open Market Committee that actually decides US monetary policies. The other is the Fed’s deputy chair, Michelle Bowman. Loading While Trump has made it very clear what he wants from the next Fed chair, it is less obvious what qualifications, other than loyalty, Trump wants from the incoming BLS commissioner. The blueprint for this administration – “Project 2025” – recommended appointing political appointees to the Labor department, within which the BLS sits, and consolidating the BLS with other data collecting agencies into a “more manageable” mega statistical agency.\n\nThe BLS could do with a (non-political) overhaul. It has a challenge with its current data surveys because, post-COVID, the response rates from businesses have dropped significantly. That’s part of the explanation for why its revisions of June quarter data, which showed a major fall in jobs generation, were so large. The decisions could have a significant impact on America’s interest rates and economy. Credit: Bloomberg Even as it has become harder for the bureau to collect accurate data, it has experienced a reduction in its resources in recent years that is being compounded by job losses and an 8 per cent cut to next year’s budget because of Trump’s assault on the US bureaucracy. If its data is to be made more reliable and credible, it needs more, not fewer, resources and someone – like Kugler – who is non-partisan and clearly qualified as its head. If Trump appoints a loyalist, it would cast a shadow over the accuracy of data central to the markets and businesses’ understanding of economic conditions and probably lead to an increase in risk premia in US interest rates.\n\nThe ironic aspect of Trump’s response to the weak employment data is that it actually strengthens the case for a rate cut. The Fed has a dual mandate, charged with maximising employment and price stability. It has kept rates on hold while it waits to see the effects of Trump’s trade policies on an inflation rate that, at 2.7 per cent, is already above its target of 2 per cent. The two appointments to critical economic agencies have the potential to undermine the credibility of the Fed’s policy decisions and the BLS’s data if financial market participants and businesses suspect that the Fed’s decisions and the BLS’s data have been tainted by political influences. The inflation rate has been edging up even before the full effects of Trump’s tariffs have had time to reveal themselves, but the economy has slowed markedly and the BLS data shows the unemployment rate is edging up even as the job market shrinks and salaries stagnate. Where, before that data, the odds were against a rate cut at the Fed’s meeting next month, they – and an increasing number of Fed governors – now favour a rate cut.\n\nInstead of accusing (without any evidence) the BLS of manipulating its date to make his economic management look bad, Trump should have seized on it to proclaim that he was right, and the Fed wrong, on the need for a rate cut. Trump can probably cause conflicts and dysfunction within the Fed and the BLS if that is his objective with the appointments he makes. Whether that achieves his broader ambitions, however, is another matter. Even if he could stack the Fed board with loyalists, which he can’t, or intimidate the majority of the Open Market Committee, which is unlikely, the Fed can only influence US short term rates. The federal funds rate anchors the bond market’s yield curve, but longer term rates are set by the market itself.\n\nIf investors thought the Fed’s decision-making had been politicised, they would demand higher yields to compensate for the increased risk of inflation and increase the premium required for holding longer-term bonds. Loading The yield curve would steepen, and it is those yields at the longer end of the curve that determine the rates on mortgage and car loans and business’ interest costs. It is the Fed’s credibility as an independent, apolitical agency that will contain inflation that gives it a broader influence over the curve than just the federal funds rate. Similarly, if the BLS data is regarded as tainted and unreliable, it will inject uncertainty and caution into businesses’ decision-making and probably lead to less employment and investment.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/business/companies/news-corp-s-local-papers-bleed-subscribers-compounding-revenue-struggles-20250807-p5ml1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "News Corp’s local papers bleed subscribers, compounding revenue struggles",
    "publish_date": "Thu, 07 Aug 2025 11:57:25 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Three of News Corp’s top daily Australian tabloids lost subscribers across the 2025 financial year, contributing to the company’s poor local results reported on Wednesday.\n\nThe Herald Sun, The Courier Mail in Brisbane and Adelaide’s The Advertiser all suffered paid-subscriber losses, while national masthead The Australian was the only paper to grow in successive years, according to new overnight corporate filings.\n\nRupert Murdoch arrives for Donald Trump’s inauguration in January. Credit: AP\n\nThe local numbers contrast with the company’s decision to launch a new state-based print product based in Los Angeles, The California Post, which will be led by the Herald Sun’s weekend editor, Nick Papps, despite helping oversee subscriber losses across the year.\n\nThe Herald Sun remains News Corp’s largest state-based tabloid, despite losing 1 per cent of its customers, dropping to 153,983 paying subscribers across both print and digital.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-rogue-s-gallery-behind-labor-s-flagship-top-deal-for-workers-20250730-p5mj1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rogues’ gallery behind Labor’s flagship ‘top’ deal for workers",
    "publish_date": "Thu, 07 Aug 2025 11:46:01 +1000",
    "category": "finance",
    "authors": [
      "Eryk Bagshaw"
    ],
    "text": "“What we have now means the best employers don’t get punished for being the best employers,” he said. But of the dozen companies that have signed up to the deal inked by the association with the support of the AMWU and Labor, at least half are facing questions about their business practices, including one company, Fredon Air, run by a former bankrupt, and another, Emax Air, that is a defendant in criminal proceedings. Ohlback, a HVAC association director, owes creditors $613,138 according to the February liquidators’ report for his former company, Precision Air Services. His business partner, Smith, who continued as a director after Ohlback resigned in January 2023, owes $1.2 million. Liquidator Michael Jones found the company may have been trading while insolvent since June 30, 2022, due to “significant losses from government projects” and the “prolonged impact of COVID-19″. But in April that year, Precision Air Services was plastered all over Gavin Ohlback Racing’s car in the Australian Midget Championship, also known as speedcar, as it chased the national speedway championship.\n\n“Whilst the team spends plenty of time in the shed making sure the cars fast, they also ensure the car is presented in the best possible fashion,” Ohlback wrote on Facebook in February 2022. HVAC association director Gavin Ohlback’s midget (speedcar) car racing team. Credit: Facebook The Ohlbacks sold their six-bedroom home in Kenthurst, in Sydney’s north-west, in 2016 for $4 million. Then they bought the house next door for $2.05 million and a 5-bedroom home in Cattai for $2.9 million. In 2021, they submitted plans for a $96,000 extension of the Cattai home, including a new garage and a pool and spa, complete with rugby league goal posts out front. By March 2024, Precision Air Services had assets of $75 in its bank, according to Jones, after it paid hundreds of thousands of dollars in loans to Ohlback and Smith. The pair then set up another company, S&A Solutions, which signed onto the AMWU deal. Ohlback did not respond to requests for comment. “I may be forced to commence legal actions for the recovery of those amounts,” Jones said in his report to creditors in February.\n\nFellow HVAC association founder Sergio Gonzalez built a full-size enclosed futsal pitch with artificial turf in his front yard in Denham Court, while his Sublime air-conditioning companies have gone through three liquidations and accrued debts to the tax office and creditors of more than $2 million. But liquidators said recouping those debts would be a challenge because Gonzalez has no real property holdings to his name. Property records show the six-bedroom mansion in Denham Court, which has undergone extensive renovations in recent years, is registered in his wife’s name, Romina Gonzalez. Sergio Gonzalez’s home in Denham Court, complete with futsal pitch. Credit: Sitthixay Ditthavong Liquidators said they were investigating whether there had been a “potential phoenix transaction” and whether Gonzalez had breached corporate law by incurring debts while trading insolvent, failing to keep financial records and not providing the company’s books to liquidators. Gonzalez fell out with other HVAC association founders in October after accusing them of doing a deal with the AMWU “behind closed doors”. He resigned as a director of the association and transferred his workers to an agreement with the Plumbers Union.\n\nThe split sparked a series of claims and counterclaims after the HVAC association accused the Plumbers Union of intimidating builders into joining their enterprise bargaining agreement. The Plumbers Union accused the HVAC association of attempting to rope in other firms into the multi-employer deal that would have no power over the negotiations. Gonzalez told The Australian Financial Review in October that he had not seen the HVAC deal before he was asked to sign on. “They said we’re going to do it, and you’re going to be part of it.” Sergio Gonzalez and Fair Trading Minister Anoulack Chanthivong (second and third from right) at Westmead Health Precinct in May. Credit: LinkedIn Gonzalez, 45, has won major contracts to work on the redevelopment of the University of Technology Sydney and Parramatta Square while developing his links with NSW Labor. Fair Trading Minister Anoulack Chanthivong attended a ducting installation with Gonzalez at Westmead Health Precinct in May. Gonzalez, who did not respond to requests for comment, previously ran labour hire company Sublime Onsite, which also went into liquidation in 2018. Beecroft, another HVAC association director, has failed multiple payment plans with the ATO and faces a claim of trading while insolvent for at least five years. His former company, Traminer Industries, owed $158,155 to the ATO when it was liquidated in 2019. His most recent company, Traminer Industries (NSW), owed $593,000 to the tax office, according to a restructuring proposal submitted to the Australian Securities and Investment Commission in July.\n\nDarren Beecroft called for US-style immigration raids on social media. Credit: Facebook Beecroft said the debts had all been sorted through a new small business payment plan. “I’m all good,” he said. “I pay every one of my guys exactly what the agreement says.” In June, Beecroft suggested immigration officials should raid Australian construction sites after US President Donald Trump ordered immigration officials to target Mexican and South American workers on construction sites. “Maybe we need to do this in Australian work sites,” he said on Facebook alongside a video of migrant workers being arrested.\n\nBeecroft has also accused gender diverse people of having a mental illness, suggested climate change was a scam, labelled activist Greta Thunberg a “crisis actor” and re-posted a meme accusing “woke parents” of cutting their kids’ “nuts off”. Beecroft said he stood by his personal views “100 per cent”. The HVAC association’s spokesman and leader, Mimmo Scavera, said in October that the association was planning to “rope in” a further six companies in the sector into the AMWU deal despite resistance from the Plumbers Union and the Australian Industry Group. Scavera praised the deal for allowing the companies to pool resources among their 600 employees to work on multiple sites under the same conditions. HVAC Manufacturing and Installation Association spokesman Mimmo Scavera. Credit: Louie Douvis But Scavera has also faced difficulties after being accused by a former employee in the Fair Work Commission in 2016 of wage underpayment, bullying and unfair termination of his employment. Scavera denied the allegations. The commission recommended that the employee take his case to the Fair Work Ombudsman.\n\nThe deal has also been under scrutiny from critics, including the Business Council of Australia, which claimed in a submission to parliament in November that workers under the HVAC multi-employer agreement would be $1.27 worse off per hour compared to the Plumbers Union deal with single employers by 2027. The AMWU said last year the deal would increase the annual pay of air-conditioning installation workers from $102,000 to $133,000 over the life of the agreement. Innes Willox, the Australian Industry Group’s chief executive, said a group of companies could use multi-employer bargaining to push smaller competitors out of the market who could not compete for employees. “The great fear has always been that multi-party bargaining can be used for essentially anticompetitive purposes, to drive out competition within a marketplace, which then drives up rates in the end for consumers,” he said. “The flip side of the coin is that it has the potential to drive businesses to the wall. It takes away the ability of businesses to manage their individual business in the way and form that they see is the best fit for their business.”",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/world/europe/italy-will-finally-build-a-bridge-to-sicily-after-2000-years-20250807-p5ml15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Italy will finally build a bridge to Sicily after 2000 years",
    "publish_date": "Thu, 07 Aug 2025 11:41:10 +1000",
    "category": "finance",
    "authors": [
      "Nick Squires"
    ],
    "text": "It will be “the biggest infrastructure project in the West”, he said, after a government committee with oversight of strategic public investments approved the project. Loading It will also help Italy reach the increased 5 per cent defence spending targets that the Trump administration has long demanded of its NATO allies. Giorgia Meloni’s government has indicated that it will classify the Messina bridge as a strategic investment, which will help bump up its current defence spending, which stands at less than 2 per cent of its GDP. The government has argued that the bridge would strengthen Europe’s defences by facilitating easier troop movements to military bases in Sicily, part of NATO’s southern flank. Preliminary work and geological surveys are due to begin in the autumn, with construction expected to start next year. The bridge is due to be completed by 2032 or 2033.\n\nThe project would create 120,000 jobs a year and billions of euros would be invested in new roads, railway stations and other related infrastructure, Salvini said. Addressing worries that the ’Ndrangheta and Cosa Nostra would be rubbing their hands in glee at the prospect of skimming off billions of euros in government funding, he said there would be vigilance “24 hours a day” against mafia infiltration. The bridge is due to be completed by 2032 or 2033. Credit: AP The government would employ the same anti-mafia precautions that had been used for other lucrative infrastructure projects, such as the World’s Fair in Milan in 2015 and next year’s Winter Olympics, which will be held in Milan and the Alpine resort of Cortina d’Ampezzo. “We have to watch the whole supply chain so that it is impervious to bad-intentioned people,” said Salvini, who is also deputy prime minister and head of the League, one of three parties in Meloni’s coalition government.\n\nTrains and vehicles currently have to cross the strait on ferries, with railway carriages laboriously transferred to the boats. Once the bridge is built, up to 6000 cars an hour will be able to cross, as well as 200 trains a day. The journey time by car will be cut from an hour to just 10 minutes. Aside from mafia infiltration and seismic instability, critics point out that Sicily and Calabria are among Italy’s poorest regions, with pot-holed roads, understaffed hospitals, crumbling schools and woeful public transport. They say it would be far better to use the billions of euros to improve basic services. The project “represents the greatest waste of public money ever seen in Italy”, said Angelo Bonelli, an MP from the Greens and Left Alliance.\n\nIt was an arrogant vanity project by Salvini that would throw “billions of euros into concrete and propaganda”, he said. He claimed one of the pylons for the bridge would stand on an “active fault line”. Trains and vehicles currently have to cross the strait on ferries, with railway carriages laboriously transferred to the boats. Credit: AP Nicola Fratoianni, an MP from the same party, said the project would suck up billions in public funds and risks “turning into a gigantic black hole”. The centre-Left Democrats, Italy’s main opposition party, said the project “tramples environmental, safety and European norms – and common sense”.\n\nAnthony Barbagallo, one of its MPs, said the project would be “a colossal waste of public resources” and a “monument to Salvini’s propaganda”. The real priorities of the impoverished south were public transport, improved health services and better schools, he said. The prime minister said building the bridge would not be easy, but it would be a valuable investment in “Italy’s present and its future”. The scale of the project was “as impressive as it is cutting-edge from a technical and engineering point of view”, Meloni said. The mega project has been awarded to a consortium led by Webuild, an Italian infrastructure group.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/killjoys-or-fair-play-why-sydney-fc-is-threatening-to-sack-a-coach-20250807-p5ml3d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Killjoys or fair play? Why Sydney FC is threatening to sack a coach",
    "publish_date": "Thu, 07 Aug 2025 11:36:16 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The best-case scenario is that by blocking Ante Juric from coaching against them, Sydney FC are secretly engaging in a publicity stunt - conducted with the full cooperation of Sydney United 58 - to pump up interest in their Australia Cup round of 16 clash.\n\nThe worst-case scenario is that the Sky Blues are being needlessly churlish in denying Juric, who coaches Sydney’s women in the summer and Sydney United’s men in the winter, the chance to be on the sidelines for a clash between his boyhood club and his main employers.\n\nAnte Juric lifts the A-League Women’s grand final trophy last year. Credit: Getty Images\n\nThe truth, as always, is somewhere in the middle.\n\nThough there is nothing confected about the spat that has erupted between the A-League side and their NSW NPL counterparts, it should be no surprise to Sydney United that Juric won’t be allowed to take part in Sunday’s match at Edensor Park - the clear highlight of the round in the Australia Cup.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/culture/books/peter-carey-says-he-s-done-writing-novels-you-have-to-know-when-it-s-enough-20250804-p5mk8p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter Carey says he’s done writing novels: ‘You have to know when it’s enough’",
    "publish_date": "Thu, 07 Aug 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Melanie Kembrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size He folds it in quietly, mid-thought, somewhere between a lament about lost notes, a gentle defence of his landline, and reflections on readings. “See … because I haven’t … I’ve stopped writing novels,” he says, with a hint of hesitation – not quite reluctant, more aware the revelation won’t go unremarked. No fuss, no fireworks. Just the quiet confirmation that there won’t be another novel from Peter Carey – the only Australian to win the Booker Prize twice, and one of only a handful to win the Miles Franklin three times. “I didn’t think I’d stopped. I had a fear that I might have written all the novels I needed or should write,” Carey, 82, says. “But I persisted, and tried various things, and threw things away … and in the end I thought, well, that’s it.” Peter Carey in New York, where he has lived now for 35 years. Credit: Idris Solomon The boy from Bacchus Marsh became a literary giant, showing Australians a funhouse mirror version of their own history – grotesque, funny, violent, and absurd – and carrying that vision to the world. There have been 14 novels – including Illywhacker, Oscar and Lucinda, True History of the Kelly Gang, Theft: A Love Story and The Chemistry of Tears – two volumes of short stories, and two travelogues. Books full of mythmakers and tricksters, schemers and fabulists, each one animated by Carey’s unmistakable voice – sly, digressive, electric with curiosity. He emerged alongside a transformative generation of Australian writers, but carved a path all his own, refusing to conform, mixing high style with larrikinism, postmodern and postcolonial play with emotional heft. And for decades, the rhythm never faltered. Every few years, like clockwork, a new Carey novel. Then it stopped – and the silence started to feel pointed. Asking a writer how their next novel is going is like asking a magician how the trick works: awkward, disappointing, and you’re probably not going to get an invitation back. Now, the question has answered itself. Carey’s last novel, A Long Way from Home, was published nearly eight years ago, and he sees it as standing tall among his most meaningful books. It marked a turning point.\n\nAdvertisement\n\nPeter Carey in 2001 when he won the Booker Prize for the second time for True History of the Kelly Gang. Credit: AP “There’s a time when you’re new to everybody – you do something like Oscar and Lucinda or Illywhacker, and you get hugely noticed. The Kelly Gang, also,” Carey says. “But A Long Way from Home, which, I think, is as important a thing as I’ve done… it doesn’t sit like that. No one particularly thinks of it as the best thing he’s ever done or the most important thing. But I thought it was.” The novel follows a 1950s car race across Australia, but beneath the bonnet is something more volatile: an attempt to grapple with the country’s foundational violence, its settler legacy. Carey has long circled Australia’s history and national mythology, but in A Long Way from Home, he took it on directly. He wanted to write, as a white Australian, about imperialism and invasion. It felt risky, and he was nervous about how it would land, particularly when he returned to Australia to tour the book. But he felt he pulled it off – or, as he puts it, “I didn’t make a dick of myself.” Carey isn’t expecting an orchestra of tiny violins to start playing. There appears to be a straightforward, if perhaps melancholic, acceptance: the more you publish, the less of a fuss it makes. His good friend Tom Keneally once told him that when they were new, everyone thought they were brilliant – now, they’re just part of the furniture. Peter Carey’s notebooks for True History of the Kelly Gang, on display at the State Library Victoria. Credit: Eugene Hyland “I think it’s true. We all know that from our reading, and from how it feels to discover a writer,” Carey says. “We tend to be less excited about the third or fourth book, but we were absolutely stunned by the first. That’s the way it goes … You have to know when it’s enough, too.” As we talk, a bookshelf packed with Carey’s novels watches over us. This year marks 35 years since he left Australia for New York – much longer than he ever planned to stay away. He moved there with his second wife, Alison Summers, a theatre-maker and editor, and they had two sons. The marriage ended, but he stayed. Carey says Australians tend to get anxious or angry about those who leave, but he says his thinking and writing have always looked back to home.\n\nAdvertisement\n\nFor years, his old novels were scattered around the Manhattan apartment he shares with his wife, Frances Coady, a book editor and publisher turned agent. After returning from the A Long Way from Home tour, he finally corralled them onto shelves. In front of them, Carey made several attempts at a new novel – two, maybe three, different starts, each hundreds of pages long – but nothing stuck. There was no urgency behind them, no force demanding the work into being. After A Long Way from Home, the compulsion just wasn’t there. Peter Carey photographed in the 1970s. Credit: Ray Lawrence “After a while, you develop a lot of skills – you can make things work. But the last thing you want to do is bullshit yourself,” he says. “You have to ask, do you need to write this? Why are you rewriting and rewriting and rewriting? Because you’re trying to find something that isn’t there. And that’s OK. I mean, I’m 82 years old, for f---’s sake.” There was no ceremonial uncapping of the pen, no dramatic farewell to fiction. Certainly no relief, he says he didn’t feel happy about it. It’s been about five years now, he guesses, since he called it a day. “I’m one of those people – this is what I do. And when you can’t do that any more… who are you?” he says. “I mean, I can’t even play golf. I’m certainly not going sailing. In the end, you’re someone who could do one trick – and that’s write.” Peter Carey photographed at his New York home in 2009. Credit: Keke Keukelaar And that one trick hasn’t disappeared. Carey’s now working on a non-fiction project – “enough to keep me off the street,” as he puts it – and while it’s a different muscle from fiction, it still scratches an itch.\n\nAdvertisement\n\n“I’m engaged in making something and it’s a little risky, and it’s beyond what I think I know how to do, and that’s exciting, right?” The past few years have brought other big changes, too. For nearly two decades, Carey was a distinguished professor and the executive director of the creative writing MFA at public university Hunter College, a program he helped build into one of the country’s best, and most competitive courses. Former alumni include Susan Choi, Jennifer Egan, Paul Beatty and Adam Haslett. He left a few years ago. He laughs about the creeping signs of age: forgetting book titles when talking to students, stretching sentences to give himself time to remember. He won’t be drawn on the details, but it doesn’t sound as though it was the fondest farewell. “There were ... let’s call them administrative issues, shall we? That went on for a couple of years. I resolved them. But I didn’t want to deal with any of that ever again,” he says. Those professional shifts come amid a milestone year for Carey: the 25th anniversary of True History of the Kelly Gang, the swaggering Booker-winning novel written in the unpunctuated voice of Australia’s most infamous outlaw. Peter Carey pictured in 1994. Carey is one of five Australian artists commissioned by the State Library of Victoria to contribute to Creative Acts, a new exhibition showcasing 600 artefacts from the library’s collection, all exploring the theme of creativity. His piece – a reflection on the 1000 days he spent writing True History of the Kelly Gang – draws on the personal archive he’s contributed over the years, including 4000 pages of drafts, marked-up manuscripts, and the chunky 1990s Apple computer he used to write the novel. He’s been selling archival material for some time – “every time I need to pay the school fees,” he jokes. Some of it won’t be unsealed until after his death. Asked if there’s anything particularly juicy in there, he shoots back: “Oh, I mean, if I was going to pay back somebody, I’d rather do it while I was alive.”\n\nAdvertisement\n\nThe origin story of True History of the Kelly Gang is almost mythic in itself. Carey, whose parents ran a car dealership in Ballarat and scraped together the funds to send him to Geelong Grammar, flunked his first-year science exams at Monash University. He’d once imagined himself a chemist or a zoologist – until a car crash and some existential drift nudged him into advertising. There, among copywriters who harboured secret literary ambitions, he was introduced to James Joyce, Graham Greene, Jack Kerouac and William Faulkner. One day, his colleague Barry Oakley – a former schoolteacher and writer – took him to George’s Art Gallery to see Sidney Nolan’s Ned Kelly paintings. Carey was entranced. He sought out Ned Kelly: Australian Son by Max Brown, and became fixated on the Jerilderie letter, Kelly’s “manifesto”, dictated as a defence against what he saw as the relentless persecution from the colonial establishment. Carey transcribed the letter by hand and carried it around “like the relic of a martyred saint”, certain he would one day do something with it. Years passed. There were false starts and failed novels, then critical successes. The letter was lost somewhere along the way. But in 1994, at the age of 51, Carey wandered into the Met in New York and stumbled across Nolan’s full suite of 27 Kelly paintings. The vision returned – and this time, he started writing. Peter Carey has now turned his attention to writing a work of non-fiction. Credit: Ben Sklar “It feels like yesterday really. Well, not quite, but 25 years is sort of shocking. I mean, shit,” he says. The novel was a critical and commercial success, winning the Booker Prize and the Commonwealth Writers’ Prize and inspiring film adaptations. Yet Carey thinks the final product was very different from what the young man who first dreamt it expected. That writer wanted to go off the deep end of the avant-garde. “That writer would have thought I was a total sellout. That writer was ridiculous, but charming in his way. But the Kelly Gang was not what he had in mind, and that came slowly over time.”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/the-latest-weapon-against-sporting-hooligans-is-dna-tagging-spray-20250807-p5ml10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest weapon against sporting hooligans is DNA tagging spray",
    "publish_date": "Thu, 07 Aug 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Ben Rumsby"
    ],
    "text": "A DNA tagging spray is to be used by police on football fans to prevent disorder at matches.\n\nSelectaDNA marks skin and clothing with an invisible solution that remains present for months and shows up under UV light. It provides forensic evidence to link individuals to a specific crime or event.\n\nIt is being rolled out by UK police forces, including Cheshire Constabulary, which will become the first to equip officers with the spray at all League Two games in the region following an initial trial at Crewe Alexandra’s home defeat to Port Vale in March.\n\nThe rollout begins on Saturday at Crewe’s opening home game of the season against Accrington Stanley. It will come less than a month after the latest football disorder statistics showed an 18 per cent increase in the number of matches with reported incidents across England and Wales.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/nsw/email-blunder-exposes-financial-status-of-high-profile-trainers-20250807-p5ml1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Email blunder exposes financial status of high-profile trainers",
    "publish_date": "Thu, 07 Aug 2025 11:25:14 +1000",
    "category": "finance",
    "authors": [
      "Chris Barrett"
    ],
    "text": "The state’s racing regulator has mistakenly revealed the financial status of dozens of racehorse trainers, including high-profile names, in an email blunder that has highlighted concerns within the $3.3 billion industry about handing over private information.\n\nRacing NSW has, for the first time, asked trainers to provide documentation such as tax assessments and company financials to demonstrate their ability to pay their bills after the business of Anthony Cummings, son of 12-time Melbourne Cup winner Bart, collapsed with debts of more than $2 million.\n\nRacing NSW oversees an industry that employs nearly 30,000 people.\n\nThe statutory body, which oversees NSW’s vast thoroughbred racing industry, imposed the strict new re-licencing requirements to ensure trainers had the ability to pay creditors and staff and the resources to care properly for the horses they had in work.\n\nLicences are renewed on a year-by-year basis, and the new demands have been received with unease by some trainers who have privately raised misgivings about how sensitive, personal details would be handled.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/great-barrier-reef-still-under-significant-climate-stress/1r2m9zmge",
    "title": "Great Barrier Reef still under significant climate stress",
    "publish_date": "Wed, 6 Aug 2025 11:16:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/tech-council-of-australia-want-copyright-laws-overhauled-so-ai-models-can-mine-aussie-data/01ucuhb8q",
    "title": "Tech Council of Australia want copyright laws \"overhauled\" so AI models can mine Aussie data",
    "publish_date": "Wed, 6 Aug 2025 11:15:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tech Council of Australia want copyright laws \"overhauled\" so AI models can mine Aussie data\n\nPublished 6 August 2025, 10:02 am\n\nThe federal Government has been advised against \"over-regulating\" AI. A new report is talking up significant economic benefit, but also admitting human jobs will be lost. The opposition says there needs to be stronger guardrails for its use, accusing tech companies of stealing Australian content.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/this-image-is-not-generated-by-ai-heres-what-the-artist-behind-it-wants-you-to-know/wh9g2kwc9",
    "title": "This image is not generated by AI. Here's what the artist behind it wants you to know",
    "publish_date": "Wed, 6 Aug 2025 08:39:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "When artist Stephen Cornwell first started making digital art, it was exciting and new.\n\n\n\n\n\n\"I realised how messy paint was, and that I could travel with my artwork without having oil paints,\" Cornwell told SBS News.\n\n\n\n\n\nUsing the graphic design and photo editing software Photoshop, Cornwell would spend months labouring over a single image. His hard work paid off, and in 2021 he was nominated for the prestigious Blake Prize.\n\n\n\n\n\nBut today, Cornwell fears his work is becoming impossible to tell apart from generative AI. He says these days making digital art is a \"lost cause\".\n\n\n\n\n\n\"It's assumed everything I do is AI,\" he said.\n\n\n\n\"Any school-age kid can use [generative AI] and get extraordinary results. But the results are built on the backbone of those who originally created the work themselves.\n\n\n\n\n\n\"It's theft.\"\n\n\n\nArtist Stephen Cornwell's image Angel-Fish was created without the use of artificial intelligence. Source: Supplied / Stephen Cornwell\n\nWhat is the Productivity Commission proposing?\n\nCornwell has concerns about a proposal by a government body to scale back copyright laws so that content can be fed into AI models without compensation.\n\n\n\n\n\nAn interim report from the Productivity Commission has proposed that big tech companies have greater access to work such as that of Cornwell's, and other Australian creative professionals, in the form of datasets to train AI models.\n\n\n\n\n\nArtists, especially those working with digital technology, say that artificial intelligence devalues their art and that the proposed changes would make it even harder to earn a living.\n\n\n\nFederal Treasurer Jim Chalmers says harnessing artificial intelligence can provide a huge boost to the Australian economy. Source: AAP / Lukas Coch The recommendation is part of the Commission's proposed roadmap to \"harnessing data and the digital economy\". It suggests the Copyright Act could be amended so that content — such as videos, images and music — can be mined without permission or compensation under \"fair dealing\" provisions.\n\n\n\n\n\nUnder the current law, \"fair dealing\" exceptions apply to copyrighted material that is used for things such as research or study, parody or satire, or reporting the news. Exceptions for text and data mining under \"fair dealing\" are in place in countries such as the United Kingdom and also the European Union.\n\n\n\n\n\nThe interim report also recommends the government re-think plans to put mandatory guardrails on high-risk AI, and that AI-specific regulation should be used as a last resort.\n\n\n\n\n\nIt estimates that AI could provide a $116 billion boost to Australia’s economy.\n\n\n\n'Making infringement legal'\n\nLouise Buckingham, CEO of Community Legal Centre Arts Law, is concerned the proposed change is a \"get out of jail free card\" for wealthy tech companies.\n\n\n\n\n\n\"The Productivity Commission’s recommendation is all about recognising infringement is incurring and making it legal rather than enforcing it.\"\n\n\n\n\n\nBuckingham said more artists are coming to the centre with concerns that AI is making it harder to make a living in the arts.\n\n\n\n\n\n\"It’s not just about what someone can sell their work for its about what someone can be employed for, and how much they can invest,\" she said.\n\n\n\nNicola Grayson, head of public affairs at Creative Australia, said AI, and in particular generative AI, is the \"big disruptor in the cultural and creative sector\".\n\n\n\n\n\nGrayson said copyright law in Australia was robust and policymakers should be looking to enforce it rather than walk it back.\n\n\n\n\n\nCreative Australia made a submission to the report and Grayson says it will be following up with the Productivity Commission and the tech sector to make sure everyone is benefiting from AI.\n\n\n\n'Realistic' about AI risks\n\nThe interim report was released ahead of Treasurer Jim Chalmers’ economic reform round table later this month, which is seeking ways to boost the country’s productivity.\n\n\n\n\n\nOn Wednesday, Chalmers told a press conference that he is: \"optimistic that AI can be a force for good, but I’m also realistic about the risks\".\n\n\n\n\n\nSpeaking to ABC News Breakfast on Wednesday, Industry and Science Minister Tim Ayres said the government has \"no plans to make changes\" in relation to Australian copyright law.\n\n\n\nREAD MORE Anthony Albanese announces new move to tackle Australia's productivity problem\n\nMeanwhile, Opposition leader Sussan Ley said she is concerned about the report’s lack of \"guardrails to prevent big tech stealing the hard-earned products of our content creators\".\n\n\n\n\n\n\"It is not appropriate for big tech to steal the work of Australian artists, musicians, creators, news media, journalism, and use it for their own ends without paying for it,\" she said on Wednesday.\n\n\n\n\n\nThe Productivity Commission is asking for feedback before it releases its final recommendations later in the year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/on-the-money-asx-tpg-mix-up-news-corps-colourful-ai-language/o81ddij5r",
    "title": "On The Money: ASX TPG mix-up & News Corp's colourful AI language",
    "publish_date": "Wed, 6 Aug 2025 08:28:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australian-uyghurs-launch-legal-action-against-kmart-over-alleged-forced-labour-links/d90lpmbuj",
    "title": "Australian Uyghurs launch legal action against Kmart over alleged forced labour links",
    "publish_date": "Wed, 6 Aug 2025 08:24:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhile many people may think of slavery as a thing of the past, more people are living in slavery today than ever before.\n\n\n\n\n\nWhile large companies in Australia are required to report on how they're addressing modern slavery risks in supply chains, there are no real penalties for inaction.\n\n\n\n\n\nNow, an organisation of Uyghur women are taking matters into their own hands by launching legal action against major retailer Kmart.\n\n\n\n\n\nThe group says they have a reasonable belief that Kmart is sourcing some products from supply chains linked to forced Uyghur forced labour camps.\n\n\n\n\n\nKmart denies this.\n\n\n\n\n\nJen Kanis, Principal Lawyer at Maurice Blackburn Lawyers, is representing the Uyghur group.\n\n\n\n\n\n\"We filed a legal action in the federal court to determine if Kmart has engaged in misleading conduct about the use of forced labou r in their supply chain. And the reason why we've done that is because our client is concerned that Kmart is engaging in misleading and deceptive conduct in relation to what they say about their ethical sourcing claims.\"\n\n\n\n\n\nIn a statement, Kmart say they have in place an Ethical Sourcing Program, which helps to identify and mitigate modern slavery risks, including the risk of forced labour.\n\n\n\n\n\nBut with allegations of credible links made between their listed suppliers and factories linked to forced Uyghur labour, the legal action is calling on Kmart to share documents clarifying the matter.\n\n\n\n\n\nRamila Chanisheff is the President of the Australian Uyghur Tangritagh Women’s Association, the group filing the legal action.\n\n\n\n\n\nShe says that Kmart and other major retailers need to be transparent.\n\n\n\n\n\n\"The ultimate aim is to know that Kmart doesn't engage with supply chains that have Uyghur forced labour or any slave labour. And that also goes obviously for other industries as well. Now Australia, it's illegal to have modern day slavery in Australia, and yet we find that the government legislations and laws in place are not strict enough. Are not strong enough to hold industries to account, and this is where it falls short, I think. We can prove or we can say, and we can provide credible evidence that could be or to force labour and supply chains, but if the government doesn't take it to the next level, it seems that industries are getting away with it.\"\n\n\n\n\n\nThe Uyghur people are a majority Muslim, Turkic-speaking, ethnic minority living in an area of north-west China known officially as the Uyghur Autonomous Region of Xinjiang, or East Turkestan to its Uyghur population.\n\n\n\n\n\nSince 2017, it's estimated that Chinese authorities have arrested over one million Uyghur people from the region.\n\n\n\n\n\nThe Chinese Government then detains them in what officials call re-education camps... but which some experts on the matter describe as more akin to concentration camps.\n\n\n\n\n\nThe involuntary transfers and forced labour of Uyghur people are well documented, enforced by Chinese officials under the guise of vocational training and poverty alleviation.\n\n\n\n\n\nMs Chanisheff says every person in the Uyghur community has either immediate or extended family taken to camps.\n\n\n\n\n\n\"All of us have been affected in some way, whether it is like our close relatives or secondary relatives or family or friends. All of us have been affected in some way when these people, those who have been taken into the concentration camps, there wouldn't be any communication with them, whatsoever. But the communication that does happen are those who are obviously left outside and we do have people in the community and are able to contact them through WeChat, which is a Chinese government communication tool, which is heavily monitored.\"\n\n\n\n\n\nMost people in the camps are arrested without charge.\n\n\n\n\n\nSome of the reasons given for their detention include attending services at the Mosque, sending texts containing Quranic verses, and wearing religious attire.\n\n\n\n\n\nIn addition to mass arrests and surveillance, it's reported that Uyghur people are frequently subjected to forced sterilisation, sexual violence, separation of families, and torture.\n\n\n\n\n\nWhile data on the matter is scarce due to a lack of transparency from the Chinese Government, it's believed that tens of thousands of Uyghurs have been shipped throughout mainland China to work, without pay, in factories.\n\n\n\n\n\nThe Chinese Government denies these claims.\n\n\n\n\n\nFreya Dinshaw is the associate legal director at the Human Rights Law Centre, which is also representing the Uyghur group.\n\n\n\n\n\nShe says Australia has a serious problem with forced labour entering the market.\n\n\n\n\n\n\"We're obviously all connected by the clothes we wear and the things we buy. And it's estimated that $27 billion worth of goods that are at high risk of being made with forced labour are imported into Australia every year. So this problem is only increasing.\"\n\n\n\n\n\nIn Australia, the Modern Slavery Act only requires companies to report on actions to address risks of forced labour in supply chains.\n\n\n\n\n\nUnlike the U-S, which says China's treatment of the Uyghur people amounts to genocide, Australia does not ban the import of products made in Xinjiang province, instead relying on a policy of transparency.\n\n\n\n\n\nFreya Dinshaw saysthe Modern Slavery Act is not strong enough and must demand stronger corporate accountability.\n\n\n\n\n\n\"The Australian Modern Slavery Act should be about protecting the people who put the clothes on our back, who pick the food that we eat and make the goods that we all consume. Yet it is a fairly weak piece of legislation in terms of only requiring reporting and not going further to require action by companies. So there's an urgent need to ensure that Australian companies have a duty to prevent modern slavery so that they're legally required to investigate and address modern slavery in their supply chains and face hard if they don't. And Australia should also follow the lead of other countries like Canada and the US and banned goods made with forced labor from ending up on our shop shelves so that we can all be confident that the clothes we wear and the things we have aren't made at the expense of someone else's freedom.\"\n\n\n\n\n\nIf, through the legal action, it is revealed that Kmart is knowingly sourcing products from factories with links to forced labor, they could then be found to have engaged in misleading marketing by advertising ethical sourcing of all its products.\n\n\n\n\n\nIf this is the case, however, they would not face penalties for sourcing products made by slave labour, just for claiming they did not.\n\n\n\n\n\nJen Kanis says while this legal action is only preliminary, it could have wider impacts on the retail industry.\n\n\n\n\n\n\"So I guess the outcome of this case is about the documents, but what this case may lead to is a misleading and deceptive conduct claim. And I think that that has implications all retailers who make claims about ethical sourcing and being an ethical business. And it will mean that they won't be able to make those claims unless they can actually substantiate them.\"\n\n\n\n\n\nRamila Chanisheff says cheap clothing and strong economic ties with China should not come at the cost of human rights.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/global-profits-plunge-amid-trumps-latest-tariffs-whats-at-stake-for-australia/zpi2scr4s",
    "title": "Global profits plunge amid Trump's latest tariffs — what's at stake for Australia?",
    "publish_date": "Wed, 6 Aug 2025 06:41:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Some of the largest and wealthiest companies in the world have reported losses equalling US$15 billion ($23.1 billion) this quarter, as the United States' latest tariffs eat into global profits.\n\n\n\n\n\nUS President Donald Trump has placed higher fees on imports from dozens of countries , which is costing businesses dearly, according to the new figures from Reuters.\n\n\n\n\n\nMeanwhile, the Australian economy is showing \"mixed\" results, which experts say could leave the country in a vulnerable position.\n\n\n\n\n\nFelicity Deane, professor of trade law and taxation at Queensland University of Technology, said the tariffs have \"thrown out the door\" decades-old trade agreements, raising questions about what happens next.\n\n\n\n\n\nHere's what to know.\n\n\n\nREAD MORE From shopping to superannuation: How a US trade war could impact Australians\n\nWhich sectors have been affected?\n\nA majority of the losses caused by the US tariffs have come from the industrial, manufacturing and automotive sectors, while financial and technology sectors have been less affected.\n\n\n\n\n\nCompanies like Caterpillar, Yum Brands, Molson Coors and Marriott are among those experiencing tariff-related losses.\n\n\n\n\n\nDeane said complex supply chains and legalities mean tariffs can be inconsistent in their impact on pricing.\n\n\n\n\n\n\"While some sectors that rely on importing raw resources, like manufacturing, will obviously be impacted, it can be harder to tell how other sectors may be affected,\" she told SBS News.\n\n\n\n\n\n\"Different countries may have differing definitions of their products, which can also change how customs classify imports, and therefore tariffs themselves.\n\n\n\n\n\n\"For instance, a taxable product in one country, by definition, might not be in another.\"\n\n\n\nDeane said while it is hard to discern, Trump's rationale behind the tariffs is that he wants to bring back investment and manufacturing to the US.\n\n\n\n\n\n\"He's saying the way to do this is through tariffs. And that he feels the United States is treated unfairly by its trading partners,\" she said.\n\n\n\nWhat impact is Trump having on the US economy?\n\nLuke Hartigan, a lecturer in economics at the University of Sydney, told SBS News the US economy is dealing with a lot of uncertainty.\n\n\n\n\n\n\"I think there's always a risk of a recession, and Trump's approach to people could also harm the economy,\" he said.\n\n\n\n\n\nEarlier this week, Trump fired the commissioner of the US Bureau of Labor Statistics (BLS) after the department revised down recent job numbers by more than 250,000.\n\n\n\n\n\nDespite a lack of evidence, Trump said the figures were \"rigged\" to make his administration \"look bad\".\n\n\n\nHartigan said this was \"deeply concerning\".\n\n\n\n\n\n\"What this says is that Trump is not happy with the figures being provided, and that he would rather accuse the BLS of cooking the books rather than acknowledging the data that didn't suit him,\" he said.\n\n\n\n\n\n\"What's deeply concerning about that is that if he puts in someone who's just looking to please Trump, they may want to mess with the data.\n\n\n\n\n\n\"Then we're in a world of very bad outcomes because you don't know what's happening in the economy.\"\n\n\n\n\n\nWhile the threat of recession and surprise dismissals might make investors uneasy, the impacts on Australia appear limited.\n\n\n\nWhat does this mean for Australia?\n\nAustralia managed to avoid an increase in the tariffs imposed by the US, with the rate remaining at the lowest level of 10 per cent .\n\n\n\n\n\nFlavio Menezes, a professor of economics at The University of Queensland, said any impact from these tariffs would be \"indirect\" for Australia.\n\n\n\n\n\n\"The broader and more significant impact is likely to be indirect — stemming from how these tariffs affect China, Australia's main trading partner, and subsequently other key partners such as the European Union, the United Kingdom, Japan, and South Korea,\" he told SBS News.\n\n\n\n\n\n\"The full extent of these ripple effects remains largely unresolved.\"\n\n\n\nREAD MORE Rate cut outlook firms as RBA gets the 'outstanding' inflation data it was waiting for\n\nWhile the cost of groceries and household goods will largely remain the same, you could experience changes to your superannuation which is tied to foreign stock markets.\n\n\n\n\n\nBut for now, Australia's economic picture is \"mixed\", Menezes said.\n\n\n\n\n\n\"Unemployment has edged up slightly but remains at historically low levels. Inflation has returned to within the RBA's target band, and while economic growth continues, it is modest.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/call-for-connection-concerns-about-a-loneliness-crisis-in-australia/iacjozdip",
    "title": "\"Call for Connection\": Concerns about a loneliness crisis in Australia",
    "publish_date": "Wed, 6 Aug 2025 04:08:24 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nYounger generations are often considered the most socially connected - especially when it comes to digital communication.\n\n\n\n\n\nBut a new report reveals more and more young Australians are feeling lonely often and persistently.\n\n\n\n\n\nAssociate Professor Michelle Lim is the Chief Executive and Scientific Chair of Ending Loneliness Together, the organisation behind the report.\n\n\n\n\n\nShe says the research uncovers a youth loneliness crisis, with on in seven young people in Australia now experiencing persistent loneliness.\n\n\n\n\n\nFuthermore, overall, 43 percent of people aged 15 to 25 are experiencing loneliness.\n\n\n\n\n\nShe's told SBS Kurdish while feeling lonely is a natural part of our innate human drive to connect with others, it's the high levels of persistent loneliness that are particularly troubling.\n\n\n\n\n\n\"What worries me, though, is the one in seven who experienced more persistent loneliness and when I say persistent, I mean we asked them about levels of loneliness in one year and then came back to them the next year, yes, we're reporting loneliness, which actually says to me that once they become lonely they stay lonely.\"\n\n\n\n\n\nThe release of the report, titled 'A Call for Connection,' coincides with Loneliness Awareness Week- which runs from the 4th to the 10th of August.\n\n\n\n\n\nThe research, which draws on data from recent surveys of Household Income and Labor Dynamics in Australia (HILDA) and interviews with young people, shows young people who report persistent loneliness are more than seven times more likely to experience high or very high psychological distress, compared to those who aren’t lonely.\n\n\n\n\n\nMs Lim says the study finds certain environmental and social factors exacerbate a persons experience of loneliness.\n\n\n\n\n\n\"We looked at who was experiencing and staying lonely, we found that certain things made things worse. Like if you had a poor physical health status, a poor mental health status, if you're unemployed, if you have financial strain, all those things are making people not just lonely, but staying lonely.\"\n\n\n\n\n\nCathy Kezelman is President of the Blue Knot Foundation.\n\n\n\n\n\nIt's an organisation that helps adult survivors of childhood trauma.\n\n\n\n\n\nShe says it's important to recognise that some groups are especially vulnerable to persistent loneliness- including those who have experienced complex trauma, which can be connected to the experience of violence, abuse, neglect or exploitation.\n\n\n\n\n\nShe says these experiences can intensify a person's withdrawal and isolation from community.\n\n\n\n\n\n\"I think what happens when loneliness is profound is that it can obviously really impact our mental health. Obviously we can go into a spiral just with our own thoughts and ruminate and that can be very, very unhealthy. And obviously the more you withdraw, the less other input you're getting. And of course, mental health can impact physical health.\"\n\n\n\n\n\nThe theme of this year's Loneliness Awareness Week is 'Moments Matter', highlighting the importance of building connections at home, work, school, online and in the community.\n\n\n\n\n\nMs Lim says this theme underscores Ending Loneliness Together's calls for more accessible inclusive community spaces, and free or low-cost opportunities to help young people nurture relationships.\n\n\n\n\n\n\"We're living in an environment that's actually keeping us lonely. So what we really need to do is not just always put the onus on the individual themselves, but really those broader community, economic, and social forces that are really at play. What we're doing is advocating for systemic change. So that we are living in an environment where it helps us develop healthy social relationships easily, and maintaining those relationships.\"\n\n\n\n\n\nThe call for more investment in spaces that foster connection and belonging is one echoed in a Loneliness Inquiry report tabled in the New South Wales parliament earlier this week.\n\n\n\n\n\nAfter a year-long investigation into the prevalence, causes and impacts of loneliness in New South Wales, the Standing Committee on Social Issues has made 20 recommendations to tackle the growing loneliness epidemic.\n\n\n\n\n\nLauren Stracey, Chief Executive of Youth Action New South Wales, says the report's recommendation for more dedicated youth hubs stands out as critical.\n\n\n\n\n\n\"What we're hearing from young people is that they actually need to have their own safe spaces to be able to feel like they're connected and belonging in our community more broadly. And one of the recommendations was to invest in youth hubs. It can be your traditional sort of space, but it can also be made up from spaces that are just in your local environment. So it could be an unused community centre, a room somewhere. But the key thing is that it's about creating places for young people where they can spend time with their peers.\"\n\n\n\n\n\nShe says investing in safe and inclusive youth spaces, designed with the input and guidance of young people, is especially important given the national ban on social media for users under the age of 16 set to come into effect in December.\n\n\n\n\n\n\"The idea of having youth hubs and new spaces, it's really about making sure that if we're taking away one way of being connected, that we are replacing it with an alternative. We can't just take away and remove the digital spaces without building real world ones. And so I think that one of the things that we are seeing is that youth hubs are really an antidote to this and that they can be the bridge from loneliness to belonging for our young people.\"\n\n\n\n\n\n\n\nShe says tackling the youth loneliness crisis needs to start with building opportunities for young people to find belonging.\n\n\n\n\n\n\"The thing with belonging is this is such a fundamental human need and young people need that just as much as anyone else. And so having a place where young people are able to go and be with their peers and also have role models around them, youth workers are incredible role models. Those are the kinds of things that really kind of ground us and help us develop into thriving adults.\"\n\n\n\n\n\nAnd loneliness isn't just an issue limited to Australia.\n\n\n\n\n\nBoth Britain and Japan have, in recent years, even dedicated a federal ministry to dealing with the problem.\n\n\n\n\n\nIf you or someone you know needs support, call Beyond Blue on 1300 224 636 or call Lifeline on 13 11 14.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-6-august-2025/gzrb4wnih",
    "title": "SBS News in Easy English 6 August 2025",
    "publish_date": "Wed, 6 Aug 2025 03:58:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe leaders of Australia and France have made plans to meet at a United Nations gathering in September.\n\n\n\n\n\nIt's expected that Palestinian statehood and the crisis in Gaza will be the focus of their meeting.\n\n\n\n\n\nIt's been confirmed in a phone call between Prime Minister Anthony Albanese and French President Emmanuel Macron.\n\n\n\n\n\n.\n\n\n\n\n\nAn interfaith coalition has called on the federal government to sanction Israel.\n\n\n\n\n\nThe open letter in The Age and Sydney Morning Herald is from a range of Jewish, Muslim and Christian groups.\n\n\n\n\n\nThey say Israel is committing genocide and Australia must take stronger action.\n\n\n\n\n\nDr Raten Jneid signed on behalf of the Australian Federation of Islamic Councils.\n\n\n\n\n\n\"Sanctions and the recognition of Palestinian state are not radical acts. They are necessary steps to uphold international law and human dignity. They would send a message that Australia is prepared to act on principle, not just words, and that the rights of Palestinians are not negligible.\"\n\n\n\n\n\nDr Julie Macken signed for the Sydney Archdiocese's Peace and Justice Office.\n\n\n\n\n\n\"We all know what it will take to stop it. It will take stop providing Israel with armaments and impose sanctions that send a clear message to the key players here that this is not going to be approved of by the international community. Anything less than that is just performative of peace, and I think the world has had a gutful of performative of peace.\"\n\n\n\n\n\n.\n\n\n\n\n\nAn Indigenous group has launched an appeal to prevent the construction of a stadium that would be used for the 2032 Olympics in Brisbane.\n\n\n\n\n\nThe Yagara Magandjin Aboriginal Corporation has lodged a protection application with the federal government.\n\n\n\n\n\nIt follows the Queensland government fast-tracking legislation to override 15 environmental and heritage acts in order to build the stadium.\n\n\n\n\n\nBut Yagara Elder Uncle Steven Coghill has told N-I-T-V the site contains stories, possible ancestral remains and ancient trees.\n\n\n\n\n\n\"The remnants of our cultural and social and political being in South East Queensland is still there. It's remnant now there. We still know stories about it. We still understand what was going on there in the end of the day, and we want to preserve that – it's as simple as that – for all Australians, not only for First Nations people but for all Australians.\"\n\n\n\n\n\n.\n\n\n\n\n\nA group of Chinese students have signed a petition urging the Australian government to speed up the visa process for international postgraduates.\n\n\n\n\n\nThere are now around 280 signatures on the petition.\n\n\n\n\n\nArabella Wang helped organise the document.\n\n\n\n\n\nShe has told SBS Mandarin that there are long waiting times - which some students feel is intentional.\n\n\n\n\n\n\"We suspect that Australia doesn't welcome students to pursue PhD. Masters degrees and undergraduate degrees create financial benefits to Australia, but not PhD. So (the Australian government) may not want us to come to Australia, it delays (our visa process) to wait for your scholarship to expire.\"\n\n\n\n\n\n.\n\n\n\n\n\nA zoo in Denmark is asking people to donate small, healthy but unwanted pets to feed their predators.\n\n\n\n\n\nThe Aalborg Zoo has issued the callout on its social media, assuring the pets will be euthanised by trained staff.\n\n\n\n\n\nThe Zoo says live guinea pigs, rabbits and chickens are possible donations.\n\n\n\n\n\nThe zoo says it's attempting to mimic the natural food chain of the animals such as the Eurasian lynx.\n\n\n\n\n\n.\n\n\n\n\n\nJapan is marking 80 years since the United States dropped the world’s first atomic bomb on Hiroshima.\n\n\n\n\n\nThe attack killed an estimated 140,000 people by the end of 1945.\n\n\n\n\n\nThe bombing was followed three days later by another in Nagasaki, prompting Japan’s surrender and ending World War Two.\n\n\n\n\n\nRebun Kayo is a Hiroshima University researcher who regularly searches for the remains of those who have never been found in the years since.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/oven-baked-pork-and-veal-ragu-with-rag-pasta-and-burrata-20250804-p5mka6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Oven-baked pork and veal ragu with rag pasta and burrata",
    "publish_date": "Thu, 07 Aug 2025 12:27:58 +1000",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Preheat the oven to 220C fan-forced (240C conventional).\n\nStep 2 In a large ovenproof casserole dish, combine the sausage meat, mince, tomatoes, tomato paste, wine, sugar, garlic, bay leaves and 1¼ cups water. Season with salt and pepper, cover with foil and bake for 20 minutes.\n\nStep 3 Remove the foil, drizzle with milk and stir in the pasta sheets. Bake for a further 10 minutes, or until the pasta is just tender.",
    "source": "TheAge",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/national/australian-cancer-breakthrough-could-mean-an-end-to-relapse-for-thousands-including-colette-20250804-p5mk77.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian cancer breakthrough could mean an end to relapse for thousands, including Colette",
    "publish_date": "Thu, 07 Aug 2025 12:18:19 +1000",
    "category": "lifestyle",
    "authors": [
      "Wendy Tuohy"
    ],
    "text": "Collette Chase says the hardest part of finishing breast cancer treatment is the fear that the disease will return.\n\n“Even Princess Kate said it recently ... you just live in a ball of anxiety,” said Chase, who is in her 50s.\n\nColette Chase had no family history or any genetic factors that would predispose her to breast cancer. Credit: Steven Siewert\n\n“People will say to you, ‘Ah look, you could get hit by a bus tomorrow’. I’d choose that because if this comes back metastatic as stage 4, what’s [the treatment] going to do to me?”\n\nAustralian scientists are hoping to alleviate this fear and halve breast cancer recurrence by utilising new technology that allows them to find, isolate and study the rare cancer cells lying dormant in people’s bones.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/1000-lb-sisters-star-tammy-slaton-makes-confession-about-weight-loss-journey-20250807-p5ml54.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "1000-Lb Sisters star Tammy Slaton makes confession about weight loss journey",
    "publish_date": "Thu, 07 Aug 2025 12:09:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "1000-Lb Sisters star Tammy Slaton makes confession about weight loss journey\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/nsw/this-life-saving-equipment-is-standard-across-nsw-hospitals-it-was-never-installed-at-northern-beaches-20250807-p5ml43.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This life-saving equipment is standard across NSW hospitals. It was never installed at Northern Beaches",
    "publish_date": "Thu, 07 Aug 2025 12:06:34 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson"
    ],
    "text": "An independent probe into the death of two-year-old Joe Massa at Northern Beaches Hospital has revealed a concerning lack of life-saving critical care cameras over the beds of seriously ill newborns and children that are standard across the state’s public hospitals.\n\nThe absence of these over-bed cameras underscored the Frenchs Forest hospital’s broader systemic gaps in critical care, resulting from the hospital’s controversial public-private partnership model, according to a report published on the Clinical Excellence Committee (CEC) earlier this month with no public announcement.\n\nElouise and Danny Massa holding a pair of their son Joe’s shoes. Credit: Kate Geraghty\n\nThe report also found a culture of dismissing red flags when patients were deteriorating, with junior staff being hesitant to raise concerns, delays in triggering emergency protocols, and tension between the financial imperatives of clinical care.\n\nWhen a child is critically ill or injured in NSW hospitals, clinicians at their bedside contact the Newborn and Paediatric Emergency Transport Service (NETS) to connect them with specialists from the Sydney Children’s Hospital Network.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/testing-shows-some-electric-vehicles-fall-short-in-driving-range-20250807-p5ml50.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Testing shows some electric vehicles fall short in driving range",
    "publish_date": "Thu, 07 Aug 2025 12:06:02 +1000",
    "category": "finance",
    "authors": [],
    "text": "Testing shows some electric vehicles fall short in driving range\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/bennett-hasler-face-off-in-spoonbowl-20250807-p5ml4z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bennett, Hasler face off in Spoonbowl",
    "publish_date": "Thu, 07 Aug 2025 12:05:58 +1000",
    "category": "finance",
    "authors": [],
    "text": "Bennett, Hasler face off in Spoonbowl\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nicolson-demolishes-gonzales-20250807-p5ml4d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Nicolson demolishes Gonzales",
    "publish_date": "Thu, 07 Aug 2025 12:04:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Nicolson demolishes Gonzales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/the-door-is-open-for-trump-to-create-more-chaos-20250807-p5ml1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The door is open for Trump to create more chaos",
    "publish_date": "Thu, 07 Aug 2025 12:00:00 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Trump has said he is considering four contenders for the position of the Fed’s chair, which will open up in May next year when the term of the current chair, Jerome Powell, who Trump detests and attacks relentlessly and viciously, will end. Hassett, current governor Christopher Waller and former governor Kevin Warsh are thought to be on his short list. He is weighing up whether to announce a short-term appointment – someone who would fill the position until the term expires on January 31 next year – or appointing a “chair elect” who will succeed Powell when his term as chair ends next May. It’s a pivotal decision because the Kugler position might be the only opportunity he has to inject a loyalist into the Fed boardroom during this term. Powell’s chairmanship might end in May but, should he choose to remain on the board, his term as a governor runs until 2028. There are no other scheduled retirements during the Trump presidency. Federal Reserve Board governor Adriana Kugler’s unexpected resignation opens the door for Trump to tighten his grip on the Fed. Credit: AP There are reports that Trump’s advisers (which include unusual names, like Fox’s Sean Hannity and MAGA heavyweight Steve Bannon) are urging him to appoint someone who will occupy the seat only until January, giving him more time to decide on Powell’s replacement.\n\nTrump could appoint someone designated as Powell’s successor, hoping that a “shadow” chair would undermine Powell and Powell’s messaging both within and outside the Fed’s boardroom. The US Treasury Secretary Scott Bessent (who has withdrawn himself from contention for the role), mooted exactly that strategy ahead of last year’s US election. Whether the appointment is short term or unveils Powell’s successor, however, the new governor would be one of only two Trump-appointed members on the seven-member board and the 12-member Federal Open Market Committee that actually decides US monetary policies. The other is the Fed’s deputy chair, Michelle Bowman. Loading While Trump has made it very clear what he wants from the next Fed chair, it is less obvious what qualifications, other than loyalty, Trump wants from the incoming BLS commissioner. The blueprint for this administration – “Project 2025” – recommended appointing political appointees to the Labor department, within which the BLS sits, and consolidating the BLS with other data collecting agencies into a “more manageable” mega statistical agency.\n\nThe BLS could do with a (non-political) overhaul. It has a challenge with its current data surveys because, post-COVID, the response rates from businesses have dropped significantly. That’s part of the explanation for why its revisions of June quarter data, which showed a major fall in jobs generation, were so large. The decisions could have a significant impact on America’s interest rates and economy. Credit: Bloomberg Even as it has become harder for the bureau to collect accurate data, it has experienced a reduction in its resources in recent years that is being compounded by job losses and an 8 per cent cut to next year’s budget because of Trump’s assault on the US bureaucracy. If its data is to be made more reliable and credible, it needs more, not fewer, resources and someone – like Kugler – who is non-partisan and clearly qualified as its head. If Trump appoints a loyalist, it would cast a shadow over the accuracy of data central to the markets and businesses’ understanding of economic conditions and probably lead to an increase in risk premia in US interest rates.\n\nThe ironic aspect of Trump’s response to the weak employment data is that it actually strengthens the case for a rate cut. The Fed has a dual mandate, charged with maximising employment and price stability. It has kept rates on hold while it waits to see the effects of Trump’s trade policies on an inflation rate that, at 2.7 per cent, is already above its target of 2 per cent. The two appointments to critical economic agencies have the potential to undermine the credibility of the Fed’s policy decisions and the BLS’s data if financial market participants and businesses suspect that the Fed’s decisions and the BLS’s data have been tainted by political influences. The inflation rate has been edging up even before the full effects of Trump’s tariffs have had time to reveal themselves, but the economy has slowed markedly and the BLS data shows the unemployment rate is edging up even as the job market shrinks and salaries stagnate. Where, before that data, the odds were against a rate cut at the Fed’s meeting next month, they – and an increasing number of Fed governors – now favour a rate cut.\n\nInstead of accusing (without any evidence) the BLS of manipulating its date to make his economic management look bad, Trump should have seized on it to proclaim that he was right, and the Fed wrong, on the need for a rate cut. Trump can probably cause conflicts and dysfunction within the Fed and the BLS if that is his objective with the appointments he makes. Whether that achieves his broader ambitions, however, is another matter. Even if he could stack the Fed board with loyalists, which he can’t, or intimidate the majority of the Open Market Committee, which is unlikely, the Fed can only influence US short term rates. The federal funds rate anchors the bond market’s yield curve, but longer term rates are set by the market itself.\n\nIf investors thought the Fed’s decision-making had been politicised, they would demand higher yields to compensate for the increased risk of inflation and increase the premium required for holding longer-term bonds. Loading The yield curve would steepen, and it is those yields at the longer end of the curve that determine the rates on mortgage and car loans and business’ interest costs. It is the Fed’s credibility as an independent, apolitical agency that will contain inflation that gives it a broader influence over the curve than just the federal funds rate. Similarly, if the BLS data is regarded as tainted and unreliable, it will inject uncertainty and caution into businesses’ decision-making and probably lead to less employment and investment.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/business/companies/news-corp-s-local-papers-bleed-subscribers-compounding-revenue-struggles-20250807-p5ml1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "News Corp’s local papers bleed subscribers, compounding revenue struggles",
    "publish_date": "Thu, 07 Aug 2025 11:57:25 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "Three of News Corp’s top daily Australian tabloids lost subscribers across the 2025 financial year, contributing to the company’s poor local results reported on Wednesday.\n\nThe Herald Sun, The Courier Mail in Brisbane and Adelaide’s The Advertiser all suffered paid-subscriber losses, while national masthead The Australian was the only paper to grow in successive years, according to new overnight corporate filings.\n\nRupert Murdoch arrives for Donald Trump’s inauguration in January. Credit: AP\n\nThe local numbers contrast with the company’s decision to launch a new state-based print product based in Los Angeles, The California Post, which will be led by the Herald Sun’s weekend editor, Nick Papps, despite helping oversee subscriber losses across the year.\n\nThe Herald Sun remains News Corp’s largest state-based tabloid, despite losing 1 per cent of its customers, dropping to 153,983 paying subscribers across both print and digital.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-rogue-s-gallery-behind-labor-s-flagship-top-deal-for-workers-20250730-p5mj1y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The rogues’ gallery behind Labor’s flagship ‘top’ deal for workers",
    "publish_date": "Thu, 07 Aug 2025 11:46:01 +1000",
    "category": "finance",
    "authors": [
      "Eryk Bagshaw"
    ],
    "text": "“What we have now means the best employers don’t get punished for being the best employers,” he said. But of the dozen companies that have signed up to the deal inked by the association with the support of the AMWU and Labor, at least half are facing questions about their business practices, including one company, Fredon Air, run by a former bankrupt, and another, Emax Air, that is a defendant in criminal proceedings. Ohlback, a HVAC association director, owes creditors $613,138 according to the February liquidators’ report for his former company, Precision Air Services. His business partner, Smith, who continued as a director after Ohlback resigned in January 2023, owes $1.2 million. Liquidator Michael Jones found the company may have been trading while insolvent since June 30, 2022, due to “significant losses from government projects” and the “prolonged impact of COVID-19″. But in April that year, Precision Air Services was plastered all over Gavin Ohlback Racing’s car in the Australian Midget Championship, also known as speedcar, as it chased the national speedway championship.\n\n“Whilst the team spends plenty of time in the shed making sure the cars fast, they also ensure the car is presented in the best possible fashion,” Ohlback wrote on Facebook in February 2022. HVAC association director Gavin Ohlback’s midget (speedcar) car racing team. Credit: Facebook The Ohlbacks sold their six-bedroom home in Kenthurst, in Sydney’s north-west, in 2016 for $4 million. Then they bought the house next door for $2.05 million and a 5-bedroom home in Cattai for $2.9 million. In 2021, they submitted plans for a $96,000 extension of the Cattai home, including a new garage and a pool and spa, complete with rugby league goal posts out front. By March 2024, Precision Air Services had assets of $75 in its bank, according to Jones, after it paid hundreds of thousands of dollars in loans to Ohlback and Smith. The pair then set up another company, S&A Solutions, which signed onto the AMWU deal. Ohlback did not respond to requests for comment. “I may be forced to commence legal actions for the recovery of those amounts,” Jones said in his report to creditors in February.\n\nFellow HVAC association founder Sergio Gonzalez built a full-size enclosed futsal pitch with artificial turf in his front yard in Denham Court, while his Sublime air-conditioning companies have gone through three liquidations and accrued debts to the tax office and creditors of more than $2 million. But liquidators said recouping those debts would be a challenge because Gonzalez has no real property holdings to his name. Property records show the six-bedroom mansion in Denham Court, which has undergone extensive renovations in recent years, is registered in his wife’s name, Romina Gonzalez. Sergio Gonzalez’s home in Denham Court, complete with futsal pitch. Credit: Sitthixay Ditthavong Liquidators said they were investigating whether there had been a “potential phoenix transaction” and whether Gonzalez had breached corporate law by incurring debts while trading insolvent, failing to keep financial records and not providing the company’s books to liquidators. Gonzalez fell out with other HVAC association founders in October after accusing them of doing a deal with the AMWU “behind closed doors”. He resigned as a director of the association and transferred his workers to an agreement with the Plumbers Union.\n\nThe split sparked a series of claims and counterclaims after the HVAC association accused the Plumbers Union of intimidating builders into joining their enterprise bargaining agreement. The Plumbers Union accused the HVAC association of attempting to rope in other firms into the multi-employer deal that would have no power over the negotiations. Gonzalez told The Australian Financial Review in October that he had not seen the HVAC deal before he was asked to sign on. “They said we’re going to do it, and you’re going to be part of it.” Sergio Gonzalez and Fair Trading Minister Anoulack Chanthivong (second and third from right) at Westmead Health Precinct in May. Credit: LinkedIn Gonzalez, 45, has won major contracts to work on the redevelopment of the University of Technology Sydney and Parramatta Square while developing his links with NSW Labor. Fair Trading Minister Anoulack Chanthivong attended a ducting installation with Gonzalez at Westmead Health Precinct in May. Gonzalez, who did not respond to requests for comment, previously ran labour hire company Sublime Onsite, which also went into liquidation in 2018. Beecroft, another HVAC association director, has failed multiple payment plans with the ATO and faces a claim of trading while insolvent for at least five years. His former company, Traminer Industries, owed $158,155 to the ATO when it was liquidated in 2019. His most recent company, Traminer Industries (NSW), owed $593,000 to the tax office, according to a restructuring proposal submitted to the Australian Securities and Investment Commission in July.\n\nDarren Beecroft called for US-style immigration raids on social media. Credit: Facebook Beecroft said the debts had all been sorted through a new small business payment plan. “I’m all good,” he said. “I pay every one of my guys exactly what the agreement says.” In June, Beecroft suggested immigration officials should raid Australian construction sites after US President Donald Trump ordered immigration officials to target Mexican and South American workers on construction sites. “Maybe we need to do this in Australian work sites,” he said on Facebook alongside a video of migrant workers being arrested.\n\nBeecroft has also accused gender diverse people of having a mental illness, suggested climate change was a scam, labelled activist Greta Thunberg a “crisis actor” and re-posted a meme accusing “woke parents” of cutting their kids’ “nuts off”. Beecroft said he stood by his personal views “100 per cent”. The HVAC association’s spokesman and leader, Mimmo Scavera, said in October that the association was planning to “rope in” a further six companies in the sector into the AMWU deal despite resistance from the Plumbers Union and the Australian Industry Group. Scavera praised the deal for allowing the companies to pool resources among their 600 employees to work on multiple sites under the same conditions. HVAC Manufacturing and Installation Association spokesman Mimmo Scavera. Credit: Louie Douvis But Scavera has also faced difficulties after being accused by a former employee in the Fair Work Commission in 2016 of wage underpayment, bullying and unfair termination of his employment. Scavera denied the allegations. The commission recommended that the employee take his case to the Fair Work Ombudsman.\n\nThe deal has also been under scrutiny from critics, including the Business Council of Australia, which claimed in a submission to parliament in November that workers under the HVAC multi-employer agreement would be $1.27 worse off per hour compared to the Plumbers Union deal with single employers by 2027. The AMWU said last year the deal would increase the annual pay of air-conditioning installation workers from $102,000 to $133,000 over the life of the agreement. Innes Willox, the Australian Industry Group’s chief executive, said a group of companies could use multi-employer bargaining to push smaller competitors out of the market who could not compete for employees. “The great fear has always been that multi-party bargaining can be used for essentially anticompetitive purposes, to drive out competition within a marketplace, which then drives up rates in the end for consumers,” he said. “The flip side of the coin is that it has the potential to drive businesses to the wall. It takes away the ability of businesses to manage their individual business in the way and form that they see is the best fit for their business.”",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/world/europe/italy-will-finally-build-a-bridge-to-sicily-after-2000-years-20250807-p5ml15.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Italy will finally build a bridge to Sicily after 2000 years",
    "publish_date": "Thu, 07 Aug 2025 11:41:10 +1000",
    "category": "finance",
    "authors": [
      "Nick Squires"
    ],
    "text": "It will be “the biggest infrastructure project in the West”, he said, after a government committee with oversight of strategic public investments approved the project. Loading It will also help Italy reach the increased 5 per cent defence spending targets that the Trump administration has long demanded of its NATO allies. Giorgia Meloni’s government has indicated that it will classify the Messina bridge as a strategic investment, which will help bump up its current defence spending, which stands at less than 2 per cent of its GDP. The government has argued that the bridge would strengthen Europe’s defences by facilitating easier troop movements to military bases in Sicily, part of NATO’s southern flank. Preliminary work and geological surveys are due to begin in the autumn, with construction expected to start next year. The bridge is due to be completed by 2032 or 2033.\n\nThe project would create 120,000 jobs a year and billions of euros would be invested in new roads, railway stations and other related infrastructure, Salvini said. Addressing worries that the ’Ndrangheta and Cosa Nostra would be rubbing their hands in glee at the prospect of skimming off billions of euros in government funding, he said there would be vigilance “24 hours a day” against mafia infiltration. The bridge is due to be completed by 2032 or 2033. Credit: AP The government would employ the same anti-mafia precautions that had been used for other lucrative infrastructure projects, such as the World’s Fair in Milan in 2015 and next year’s Winter Olympics, which will be held in Milan and the Alpine resort of Cortina d’Ampezzo. “We have to watch the whole supply chain so that it is impervious to bad-intentioned people,” said Salvini, who is also deputy prime minister and head of the League, one of three parties in Meloni’s coalition government.\n\nTrains and vehicles currently have to cross the strait on ferries, with railway carriages laboriously transferred to the boats. Once the bridge is built, up to 6000 cars an hour will be able to cross, as well as 200 trains a day. The journey time by car will be cut from an hour to just 10 minutes. Aside from mafia infiltration and seismic instability, critics point out that Sicily and Calabria are among Italy’s poorest regions, with pot-holed roads, understaffed hospitals, crumbling schools and woeful public transport. They say it would be far better to use the billions of euros to improve basic services. The project “represents the greatest waste of public money ever seen in Italy”, said Angelo Bonelli, an MP from the Greens and Left Alliance.\n\nIt was an arrogant vanity project by Salvini that would throw “billions of euros into concrete and propaganda”, he said. He claimed one of the pylons for the bridge would stand on an “active fault line”. Trains and vehicles currently have to cross the strait on ferries, with railway carriages laboriously transferred to the boats. Credit: AP Nicola Fratoianni, an MP from the same party, said the project would suck up billions in public funds and risks “turning into a gigantic black hole”. The centre-Left Democrats, Italy’s main opposition party, said the project “tramples environmental, safety and European norms – and common sense”.\n\nAnthony Barbagallo, one of its MPs, said the project would be “a colossal waste of public resources” and a “monument to Salvini’s propaganda”. The real priorities of the impoverished south were public transport, improved health services and better schools, he said. The prime minister said building the bridge would not be easy, but it would be a valuable investment in “Italy’s present and its future”. The scale of the project was “as impressive as it is cutting-edge from a technical and engineering point of view”, Meloni said. The mega project has been awarded to a consortium led by Webuild, an Italian infrastructure group.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/killjoys-or-fair-play-why-sydney-fc-is-threatening-to-sack-a-coach-20250807-p5ml3d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Killjoys or fair play? Why Sydney FC is threatening to sack a coach",
    "publish_date": "Thu, 07 Aug 2025 11:36:16 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The best-case scenario is that by blocking Ante Juric from coaching against them, Sydney FC are secretly engaging in a publicity stunt - conducted with the full cooperation of Sydney United 58 - to pump up interest in their Australia Cup round of 16 clash.\n\nThe worst-case scenario is that the Sky Blues are being needlessly churlish in denying Juric, who coaches Sydney’s women in the summer and Sydney United’s men in the winter, the chance to be on the sidelines for a clash between his boyhood club and his main employers.\n\nAnte Juric lifts the A-League Women’s grand final trophy last year. Credit: Getty Images\n\nThe truth, as always, is somewhere in the middle.\n\nThough there is nothing confected about the spat that has erupted between the A-League side and their NSW NPL counterparts, it should be no surprise to Sydney United that Juric won’t be allowed to take part in Sunday’s match at Edensor Park - the clear highlight of the round in the Australia Cup.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/culture/books/peter-carey-says-he-s-done-writing-novels-you-have-to-know-when-it-s-enough-20250804-p5mk8p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter Carey says he’s done writing novels: ‘You have to know when it’s enough’",
    "publish_date": "Thu, 07 Aug 2025 11:30:00 +1000",
    "category": "entertainment",
    "authors": [
      "Melanie Kembrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size He folds it in quietly, mid-thought, somewhere between a lament about lost notes, a gentle defence of his landline, and reflections on readings. “See … because I haven’t … I’ve stopped writing novels,” he says, with a hint of hesitation – not quite reluctant, more aware the revelation won’t go unremarked. No fuss, no fireworks. Just the quiet confirmation that there won’t be another novel from Peter Carey – the only Australian to win the Booker Prize twice, and one of only a handful to win the Miles Franklin three times. “I didn’t think I’d stopped. I had a fear that I might have written all the novels I needed or should write,” Carey, 82, says. “But I persisted, and tried various things, and threw things away … and in the end I thought, well, that’s it.” Peter Carey in New York, where he has lived now for 35 years. Credit: Idris Solomon The boy from Bacchus Marsh became a literary giant, showing Australians a funhouse mirror version of their own history – grotesque, funny, violent, and absurd – and carrying that vision to the world. There have been 14 novels – including Illywhacker, Oscar and Lucinda, True History of the Kelly Gang, Theft: A Love Story and The Chemistry of Tears – two volumes of short stories, and two travelogues. Books full of mythmakers and tricksters, schemers and fabulists, each one animated by Carey’s unmistakable voice – sly, digressive, electric with curiosity. He emerged alongside a transformative generation of Australian writers, but carved a path all his own, refusing to conform, mixing high style with larrikinism, postmodern and postcolonial play with emotional heft. And for decades, the rhythm never faltered. Every few years, like clockwork, a new Carey novel. Then it stopped – and the silence started to feel pointed. Asking a writer how their next novel is going is like asking a magician how the trick works: awkward, disappointing, and you’re probably not going to get an invitation back. Now, the question has answered itself. Carey’s last novel, A Long Way from Home, was published nearly eight years ago, and he sees it as standing tall among his most meaningful books. It marked a turning point.\n\nAdvertisement\n\nPeter Carey in 2001 when he won the Booker Prize for the second time for True History of the Kelly Gang. Credit: AP “There’s a time when you’re new to everybody – you do something like Oscar and Lucinda or Illywhacker, and you get hugely noticed. The Kelly Gang, also,” Carey says. “But A Long Way from Home, which, I think, is as important a thing as I’ve done… it doesn’t sit like that. No one particularly thinks of it as the best thing he’s ever done or the most important thing. But I thought it was.” The novel follows a 1950s car race across Australia, but beneath the bonnet is something more volatile: an attempt to grapple with the country’s foundational violence, its settler legacy. Carey has long circled Australia’s history and national mythology, but in A Long Way from Home, he took it on directly. He wanted to write, as a white Australian, about imperialism and invasion. It felt risky, and he was nervous about how it would land, particularly when he returned to Australia to tour the book. But he felt he pulled it off – or, as he puts it, “I didn’t make a dick of myself.” Carey isn’t expecting an orchestra of tiny violins to start playing. There appears to be a straightforward, if perhaps melancholic, acceptance: the more you publish, the less of a fuss it makes. His good friend Tom Keneally once told him that when they were new, everyone thought they were brilliant – now, they’re just part of the furniture. Peter Carey’s notebooks for True History of the Kelly Gang, on display at the State Library Victoria. Credit: Eugene Hyland “I think it’s true. We all know that from our reading, and from how it feels to discover a writer,” Carey says. “We tend to be less excited about the third or fourth book, but we were absolutely stunned by the first. That’s the way it goes … You have to know when it’s enough, too.” As we talk, a bookshelf packed with Carey’s novels watches over us. This year marks 35 years since he left Australia for New York – much longer than he ever planned to stay away. He moved there with his second wife, Alison Summers, a theatre-maker and editor, and they had two sons. The marriage ended, but he stayed. Carey says Australians tend to get anxious or angry about those who leave, but he says his thinking and writing have always looked back to home.\n\nAdvertisement\n\nFor years, his old novels were scattered around the Manhattan apartment he shares with his wife, Frances Coady, a book editor and publisher turned agent. After returning from the A Long Way from Home tour, he finally corralled them onto shelves. In front of them, Carey made several attempts at a new novel – two, maybe three, different starts, each hundreds of pages long – but nothing stuck. There was no urgency behind them, no force demanding the work into being. After A Long Way from Home, the compulsion just wasn’t there. Peter Carey photographed in the 1970s. Credit: Ray Lawrence “After a while, you develop a lot of skills – you can make things work. But the last thing you want to do is bullshit yourself,” he says. “You have to ask, do you need to write this? Why are you rewriting and rewriting and rewriting? Because you’re trying to find something that isn’t there. And that’s OK. I mean, I’m 82 years old, for f---’s sake.” There was no ceremonial uncapping of the pen, no dramatic farewell to fiction. Certainly no relief, he says he didn’t feel happy about it. It’s been about five years now, he guesses, since he called it a day. “I’m one of those people – this is what I do. And when you can’t do that any more… who are you?” he says. “I mean, I can’t even play golf. I’m certainly not going sailing. In the end, you’re someone who could do one trick – and that’s write.” Peter Carey photographed at his New York home in 2009. Credit: Keke Keukelaar And that one trick hasn’t disappeared. Carey’s now working on a non-fiction project – “enough to keep me off the street,” as he puts it – and while it’s a different muscle from fiction, it still scratches an itch.\n\nAdvertisement\n\n“I’m engaged in making something and it’s a little risky, and it’s beyond what I think I know how to do, and that’s exciting, right?” The past few years have brought other big changes, too. For nearly two decades, Carey was a distinguished professor and the executive director of the creative writing MFA at public university Hunter College, a program he helped build into one of the country’s best, and most competitive courses. Former alumni include Susan Choi, Jennifer Egan, Paul Beatty and Adam Haslett. He left a few years ago. He laughs about the creeping signs of age: forgetting book titles when talking to students, stretching sentences to give himself time to remember. He won’t be drawn on the details, but it doesn’t sound as though it was the fondest farewell. “There were ... let’s call them administrative issues, shall we? That went on for a couple of years. I resolved them. But I didn’t want to deal with any of that ever again,” he says. Those professional shifts come amid a milestone year for Carey: the 25th anniversary of True History of the Kelly Gang, the swaggering Booker-winning novel written in the unpunctuated voice of Australia’s most infamous outlaw. Peter Carey pictured in 1994. Carey is one of five Australian artists commissioned by the State Library of Victoria to contribute to Creative Acts, a new exhibition showcasing 600 artefacts from the library’s collection, all exploring the theme of creativity. His piece – a reflection on the 1000 days he spent writing True History of the Kelly Gang – draws on the personal archive he’s contributed over the years, including 4000 pages of drafts, marked-up manuscripts, and the chunky 1990s Apple computer he used to write the novel. He’s been selling archival material for some time – “every time I need to pay the school fees,” he jokes. Some of it won’t be unsealed until after his death. Asked if there’s anything particularly juicy in there, he shoots back: “Oh, I mean, if I was going to pay back somebody, I’d rather do it while I was alive.”\n\nAdvertisement\n\nThe origin story of True History of the Kelly Gang is almost mythic in itself. Carey, whose parents ran a car dealership in Ballarat and scraped together the funds to send him to Geelong Grammar, flunked his first-year science exams at Monash University. He’d once imagined himself a chemist or a zoologist – until a car crash and some existential drift nudged him into advertising. There, among copywriters who harboured secret literary ambitions, he was introduced to James Joyce, Graham Greene, Jack Kerouac and William Faulkner. One day, his colleague Barry Oakley – a former schoolteacher and writer – took him to George’s Art Gallery to see Sidney Nolan’s Ned Kelly paintings. Carey was entranced. He sought out Ned Kelly: Australian Son by Max Brown, and became fixated on the Jerilderie letter, Kelly’s “manifesto”, dictated as a defence against what he saw as the relentless persecution from the colonial establishment. Carey transcribed the letter by hand and carried it around “like the relic of a martyred saint”, certain he would one day do something with it. Years passed. There were false starts and failed novels, then critical successes. The letter was lost somewhere along the way. But in 1994, at the age of 51, Carey wandered into the Met in New York and stumbled across Nolan’s full suite of 27 Kelly paintings. The vision returned – and this time, he started writing. Peter Carey has now turned his attention to writing a work of non-fiction. Credit: Ben Sklar “It feels like yesterday really. Well, not quite, but 25 years is sort of shocking. I mean, shit,” he says. The novel was a critical and commercial success, winning the Booker Prize and the Commonwealth Writers’ Prize and inspiring film adaptations. Yet Carey thinks the final product was very different from what the young man who first dreamt it expected. That writer wanted to go off the deep end of the avant-garde. “That writer would have thought I was a total sellout. That writer was ridiculous, but charming in his way. But the Kelly Gang was not what he had in mind, and that came slowly over time.”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/the-latest-weapon-against-sporting-hooligans-is-dna-tagging-spray-20250807-p5ml10.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The latest weapon against sporting hooligans is DNA tagging spray",
    "publish_date": "Thu, 07 Aug 2025 11:30:00 +1000",
    "category": "sports",
    "authors": [
      "Ben Rumsby"
    ],
    "text": "A DNA tagging spray is to be used by police on football fans to prevent disorder at matches.\n\nSelectaDNA marks skin and clothing with an invisible solution that remains present for months and shows up under UV light. It provides forensic evidence to link individuals to a specific crime or event.\n\nIt is being rolled out by UK police forces, including Cheshire Constabulary, which will become the first to equip officers with the spray at all League Two games in the region following an initial trial at Crewe Alexandra’s home defeat to Port Vale in March.\n\nThe rollout begins on Saturday at Crewe’s opening home game of the season against Accrington Stanley. It will come less than a month after the latest football disorder statistics showed an 18 per cent increase in the number of matches with reported incidents across England and Wales.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/nsw/email-blunder-exposes-financial-status-of-high-profile-trainers-20250807-p5ml1d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Email blunder exposes financial status of high-profile trainers",
    "publish_date": "Thu, 07 Aug 2025 11:25:14 +1000",
    "category": "finance",
    "authors": [
      "Chris Barrett"
    ],
    "text": "The state’s racing regulator has mistakenly revealed the financial status of dozens of racehorse trainers, including high-profile names, in an email blunder that has highlighted concerns within the $3.3 billion industry about handing over private information.\n\nRacing NSW has, for the first time, asked trainers to provide documentation such as tax assessments and company financials to demonstrate their ability to pay their bills after the business of Anthony Cummings, son of 12-time Melbourne Cup winner Bart, collapsed with debts of more than $2 million.\n\nRacing NSW oversees an industry that employs nearly 30,000 people.\n\nThe statutory body, which oversees NSW’s vast thoroughbred racing industry, imposed the strict new re-licencing requirements to ensure trainers had the ability to pay creditors and staff and the resources to care properly for the horses they had in work.\n\nLicences are renewed on a year-by-year basis, and the new demands have been received with unease by some trainers who have privately raised misgivings about how sensitive, personal details would be handled.",
    "source": "TheAge",
    "cluster_id": 34
  }
]