[
  {
    "url": "https://www.9news.com.au/world/donald-trump-doubles-steel-aluminium-tariffs/ff4231e1-5d94-43ca-a46a-6900b9294caa",
    "title": "Trump deals serious blow to major Australian industries",
    "publish_date": "Sat, 31 May 2025 01:56:32 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "President Donald Trump has dealt a blow to the Australian steel industry, with a pledge to double the existing tariff on steep imports .\n\nThe import tax will deal a heavy blow to the Australian steel industry, which exports close to a billion dollars worth of steel to the USA each year.\n\nThe president told Pennsylvania steelworkers he's doubling the tariff on steel imports to 50 per cent to protect their industry, a dramatic increase that could further push up prices for a metal used to make housing, autos and other goods.\n\nAustralian steel being made at the Port Kembla Steelworks. (AAP) (AAP)\n\nIn a post later on his Truth Social platform, he added that aluminium tariffs would also be doubled to 50 per cent. He said both tariff hikes would go into effect on Wednesday.\n\nAustralia exports more than $400 million in aluminium to the US each year.\n\nThe tariffs have been decried by Australia's Trade Minister Don Farrell.\n\n\"﻿These tariffs are unjustified and not the act of a friend,\" Farrell said.\n\n\"They are an act of economic self harm that will only hurt consumers and businesses who rely on free and fair trade.\n\n\"We will continue to engage and advocate strongly for the removal of the tariffs.\"\n\nTrump spoke at US Steel's Mon Valley Works–Irvin Plant in suburban Pittsburgh, where he also discussed a details-to-come deal under which Japan's Nippon Steel will invest in the iconic American steelmaker.\n\nThough Trump initially vowed to block the Japanese steelmaker's bid to buy Pittsburgh-based US Steel, he reversed course and announced an agreement last week for \"partial ownership\" by Nippon.\n\nIt's unclear, though, if the deal his administration helped broker has been finalised or how ownership would be structured. Nippon Steel has never said it is backing off its bid to outright buy and control US Steel as a wholly owned subsidiary, even as it increased the amount of money it promised to invest in US Steel plants and gave guarantees that it wouldn't lay off workers or close plants as it sought federal approval of the acquisition.\n\n\"We're here today to celebrate a blockbuster agreement that will ensure this storied American company stays an American company,\" Trump said as he opened an event at one of US Steel's warehouses. \"You're going to stay an American company, you know that, right?\"\n\nAs for the tariffs, Trump said doubling the levies on imported steel \"will even further secure the steel industry in the US.\" But such a dramatic increase could push prices even higher.\n\nAluminium is a major export industry for Australia. (Glenn Hunt)\n\nSteel prices have climbed 16 per cent since Trump became president in mid-January, according to the government's Producer Price Index.\n\nAs of March 2025, steel cost A$1481 a metric tonne in the United States, significantly more than the price in Europe (A$1039) or China (A$590), according to the US Commerce Department. The United States produced about three times more steel than it imported last year, with Canada, Brazil, Mexico and South Korea being the largest sources of steel imports.\n\nAnalysts have credited tariffs going back to Trump's first term with helping strengthen the domestic steel industry, something that Nippon Steel wanted to capitalise on in its offer to buy US Steel.\n\nThe United Steelworkers union remained sceptical.\n\nIts president, David McCall, said in a statement that the union is most concerned \"with the impact that this merger of US Steel into a foreign competitor will have on national security, our members and the communities where we live and work.\"\n\nTrump stressed the deal would maintain American control of the storied company, which is seen as both a political symbol and an important matter for the country's supply chain, industries like auto manufacturing and national security.\n\nTrump, who has been eager to strike deals and announce new investments in the US since retaking the White House, is also trying to satisfy voters, including blue-collar workers, who elected him as he called to protect US manufacturing.\n\nUS Steel has not publicly communicated any details of a revamped deal to investors. Nippon Steel issued a statement approving of the proposed \"partnership\" but also has not disclosed terms.\n\nDonald Trump has doubled tariffs on steel and aluminium. (AP)\n\nState and federal politicians who have been briefed on the matter describe a deal in which Nippon will buy US Steel and spend billions on US Steel facilities in Pennsylvania, Indiana, Alabama, Arkansas and Minnesota. The company would be overseen by an executive suite and board made up mostly of Americans and protected by the US government's veto power in the form of a \"golden share.\"\n\nUnionised steelworkers said there is some split opinion in the ranks over Nippon Steel's acquisition, but that sentiment has shifted over time as they became more convinced that US Steel would eventually shut down their Pittsburgh-area plants.\n\nClifford Hammonds, a line feeder at the plant where Trump spoke, said at the very least the deal will help upgrade the ageing plant and help increase production.\n\n\"It's putting money back into the plant to help rebuild it, because this plant is old, it's falling apart. We ain't really producing as much as we should be because, like I said, this place is old. It's falling apart. We need some type of investment to fix the machines that we've got working,\" Hammonds said.\n\nNo matter the terms, the issue has outsized importance for Trump, who last year repeatedly said he would block the deal and foreign ownership of US Steel, as did former President Joe Biden.\n\nTrump promised during the campaign to make the revitalisation of American manufacturing a priority of his second term in office. And the fate of US Steel, once the world's largest corporation, could become a political liability in the midterm elections for his Republican Party in the swing state of Pennsylvania and other battleground states dependent on industrial manufacturing.\n\nTrump said Sunday he wouldn't approve the deal if US Steel did not remain under US control. He said it will keep its headquarters in Pittsburgh.\n\nThe president closed his remarks Friday by thanking steelworkers.\n\n\"With the help of patriots like you, we're going to produce our own metal, unleash our own energy, secure our own future, build our country, control our destiny,\" he said. \"We are once again going to put Pennsylvania steel into the backbone of America like never before.\"\n\nIn recent days, Trump and other US officials began promoting Nippon Steel's new commitment to invest A$21 billion on top of its A$22.3 billion bid, including building a new electric arc furnace steel mill somewhere in the US.\n\nHe was joined onstage Friday by several US Steel workers, including Jason Zugai, vice president of the United Steelworkers local union at the Irvin finishing plant that defied the international union in supporting Nippon Steel's bid to buy US Steel.\n\nZugai, whose father had lost his job in a steel mill years earlier, lobbied local officials and members of Congress to support the deal, believing that US Steel would otherwise shut down its Pittsburgh-area plants eventually.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/deflated-renter-says-cost-of-rent-for-tiny-studio-apartment-is-insane/6ff0f2d1-f45f-4006-99aa-278053caccb7",
    "title": "Deflated renter says cost of rent for tiny studio apartment 'is insane'",
    "publish_date": "Fri, 30 May 2025 20:38:09 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Bartender and student William Connell lives in university student accommodation in Newtown, in Sydney's inner west.\n\nRent for his 13 square metre studio apartment sets him back $1267 a fortnight.\n\nREAD MORE: Third man charged with looting in NSW flood aftermath ﻿\n\nRent for his 13 square metre studio apartment sets him back $1267 a fortnight. (Campus Living Villages)\n\nHe says rent is so expensive he's been left with no other option - his parents, who currently live and work in Singapore, have had to help supplement his rent.\n\n\"I could not afford this place, I'd have to live with my grandparents in Cronulla if my parents didn't [help me] pay,\" he said.\n\n\"It's just insane, I would never be able to afford it with my part-time job﻿... I probably get paid $600 a week, which doesn't make my rent.\"\n\nConnell was born in Sydney, but his family moved to Singapore and Hong Kong when he was a child.\n\nHe moved back to Sydney alone last February to attend university.\n\nConnell studies computer science. It is likely he will be well paid when he moves into his career but he still fears he won't be able to live independently for a number of years﻿.\n\nBartender and student William Connell lives in university student accommodation in Newtown, in Sydney's inner west. (Supplied)\n\n\"All my mates who also live in student accommodation say they are going to move back to their parents after graduation, but I don't really get much of a choice,\" he said.\n\n\"﻿I just don't know when I'll be independent. I always thought I'll go to uni and be independent but, I'm still on my dad's dime...I don't know when that will end.\"\n\nHe says when he does graduate from university and starts working, the majority of his income will \"immediately go straight to rent\".\n\n\"I can move in with my grandparents but that's not really the best option as a young adult,\" he said.\n\n﻿Connell acknowledged that he is lucky to have the support of his parents to make rent, telling 9News.com.au that many of his friends have no idea when they'd be able to move out of home.\n\nTh﻿e issue isn't anything new.\n\nConnell's rent for his studio student accomodation is so expensive, his parents have to help him pay it. (Campus Living Villages)\n\nHomelessness Australia revealed in 2023 that Youth Allowance payments weren't enough for a young person to afford both rent and basic necessities.\n\nAdvocates say little has changed since then.\n\n\"What we know most definitely is that young people are disproportionately affected by the housing crisis and by the cost of living crisis,' CEO of NSW's peak body for youth homelessness, YFoundations, John Macmillan said.\n\n\"The broader national statistics are clear that housing increasingly takes up a larger and larger proportion of people's available incomes.\" ﻿\n\nWhile Connell tries to avoid moving in with his grandparents, Macmillan says some young people have no other choice.\n\n\"Particularly a form of homelessness called couch surfing... is the most predominant form of homelessness for young people,\" Macmillan said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/hecs-help-indexation-change-what-new-rate-means-for-your-loan/a833fb79-c9eb-4b75-939d-5b0f7eb42768",
    "title": "Three million Aussies about to be hit by $2.5 billion debt increase",
    "publish_date": "Fri, 30 May 2025 21:08:32 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Three million A﻿ustralians with outstanding student loans will receive a more than $2.5 billion debt increase when the annual indexation is applied on June 1.\n\nThe Albanese government had promised to reduce student loans by 20 per cent before indexation is applied this year, but the legislation required has not reached parliament as sitting does not recommence until July.\n\n﻿Until that happens, those with student loans will receive a 3.2 per cent indexation.\n\nHere's what that means for you.\n\nStudent debt will rise by 3.2 per cent on June 1. (Louie Douvis/AFR)\n\nHow much ﻿indexation is being applied to student debt?\n\nStudent debt will rise by 3.2 per cent on June 1 as part of the Australian Tax Office's annual adjustment to match unpaid loans with either inflation or wages.\n\n﻿ This year's indexation is a little lower than last year's 4 per cent, as inflation remained steady at 2.4 per cent for the third month in a row in April.﻿\n\nThe national student loan debt of more than $79.3 billion will rise by $2.5 billion after the indexation is applied. ﻿\n\nThose with an average debt of almost $26,500﻿ will see an increase of $848.\n\nIs the government taking 20 per cent off student debt?\n\nYes, it will just be reduced later than promised.\n\nThe federal government late last year committed to reducing student debt by 20 per cent before June 1.\n\nBut parliament does not resume until July 22, meaning that it will have to wait until then to introduce the legislation.\n\nEducation Minister Jason Clare has guaranteed that it will be the very first piece of legislation that is introduced when parliament sits.\n\n\"This is a game-changer for the more than three million Australians with a student loan,\" he said.\n\nREAD MORE: ﻿ Commonwealth Bank to slash fixed rates\n\nEducation Minister Jason Clare has guaranteed that it will be the very first piece of legislation that is introduced when parliament sits. (Alex Ellinghausen)\n\n\"For someone with the average debt of $50,000, this will cut that debt by $10,000.\"\n\nIt is expected to slash $16 billion in total from all student loans.\n\nThe legislation is looking to breeze through the House of Representatives, where Labor has a majority, and the Senate, where Labor and the Greens hold power.\n\nLabor will likely receive the support it needs from the Greens to pass the legislation in the Senate, as the minor party has been vocal about wiping all student debt.\n\nOnce passed, the 20 per cent reduction will be automatically applied and backdated to June 1.\n\nThe indexation rate will also be recalculated ﻿after the measure is in place.\n\nHow does indexation work?﻿\n\nThe Australian Tax Office applies the indexation to all student debt on June 1 each year based on its calculation of the Consumer Price Index, which is an indicator of inflation.\n\n﻿After a whopping 7.1 per cent indexation rate was applied in 2023 due to out-of-control inflation, the government moved to cap the indexation of all student loans to whichever is lower — the Wage Price Index or the Consumer Price Index. ﻿\n\nThis essentially means that the indexation will never be higher than wages.\n\nThis year, the ﻿Consumer Price Index was lower at 3.2 per cent compared to the Wage Price Index at 3.7 per cent.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/most-trusted-distrusted-brands-australia-bunnings-woolworths-coles-aldi-optus-telstra-qantas-ranked-roy-morgan/a5fe40df-61dd-4670-bf31-3696894f5f44",
    "title": "Surprise entrant to top 10 most trusted brands in Australia",
    "publish_date": "Fri, 30 May 2025 05:01:00 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 21 Attribution: Polly Hanning/Getty\n\nFrom supermarkets to hardware stores and consumer electronics, these brands are household names in Australia.\n\nBut when it comes to trust, not all companies are equal in the eyes of shoppers.\n\nPollster Roy Morgan has released ﻿its list of Australia's most trusted and distrusted brands in the 12 months to March 2025.\n\nThe latest list reveals some brands have worked hard to win back the Australian public, while others have significantly fallen in the rankings.\n\nClick through to find out the brands Australians rely on the most.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/nsw-wild-weather-heavy-rain-storms-lash-state-coast/479a95d4-8143-4e66-8faa-b85b901a578b",
    "title": "Tourists come across extraordinary sight at Uluru",
    "publish_date": "Fri, 30 May 2025 04:01:35 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "5 of 102 Attribution: Nine\n\nStricken residents of the the NSW Mid North Coast are grappling with the clean-up after the record breaking floods.\n\nStreets of towns including Taree are strewn with debris from businesses and homes engulfed by the deluge.﻿\n\nMore than 12,000 people remain cut off, the SES said last night.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/finance/spending-data-april-warm-weather-hits-clothes-retailers/8df667ec-5132-4e69-a4cc-e78d6a63eaff",
    "title": "Clothes retailers are paying the price for our unseasonably warm autumn",
    "publish_date": "Fri, 30 May 2025 03:46:31 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "A﻿ustralians might have basked through an unseasonably warm autumn, but not everyone is enjoying the unusually summery weather.\n\nNew retail data released today by the Australian Bureau of Statistics ﻿showed that Australians spent less in April than the month before.\n\nThat was due in part to the warm weather, ﻿which stopped shoppers from reaching for new winter purchases.\n\nREAD MORE: Serious fears as new COVID variant spreads rapidly ﻿\n\nAustralians have pulled back on clothes shopping during a warmer-than-usual autumn. (Dion Georgopoulos)\n\n\"Clothing retailers told us that the warmer-than-usual weather for an April month saw people holding off on buying clothing items, especially new winter season stock,\" ABS head of business statistics Robert Ewing said.\n\nAustralia sweated through its hottest March on record, and April temperatures were a degree above the long-term average.\n\nWhile overall spending ﻿dropped 0.1 per cent in April – despite the Easter and Anzac Day long weekends that would have been expected to boost consumption – clothing and footwear was down a far more substantial 2.5 per cent for the month.\n\nThere was a notable bounce back in Queensland, though, as households spent more following the destruction caused by Cyclone Al﻿fred.\n\n\"Queensland retailers recovered from last month's temporary business closures and fewer customers,\" Ewing said.\n\nREAD MORE: Huge victory for Pauline Hanson after surprise Senate results ﻿\n\nSpending in Queensland picked up following the disruption and damage caused by Cyclone Alfred the month before. (Getty)\n\n\"In April, we saw higher spending in the industries most impacted by ex-Tropical Cyclone Alfred.\n\n\"More people dined out and made recovery purchases on household items like furniture and electrical goods.\"\n\nThe ABS also released new data on the number of housing approvals, which have fallen to their lowest level since last August, and remain nowhere near the level required to meet the federal government's 2029 targets.\n\n\"Even on a three-month annualised basis, approvals are running at around 187,000 per annum (which is an 18 per cent increase from the 2023 trough, but 26 per cent below the peak in 2021),\" AMP economist My Bui said.\n\n\"The key to getting housing approvals (as well as housing completions) up is to have more units in the mix, rather than detached houses.\n\n\"At the peak, units accounted for about half of all approvals, but in April only 35 per cent of building approvals were units.\n\n\"With Australia's chronic undersupply issue, we should be building roughly 240,000 dwelling units per year – similar to the number targeted in the national housing accord... it is now much harder to see the target being met.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/outrage-after-mcdonalds-staple-chicken-and-cheese-doubles-in-price-on-delivery-app/eb809f5d-0139-41fa-9e1b-9ec6726aa4e6",
    "title": "The mystery of fast food price rises on food delivery apps",
    "publish_date": "Fri, 30 May 2025 02:27:47 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Have you ever wondered why the price of fast food items﻿ can be significantly more expensive on food delivery apps?\n\nA viral TikTok video this week highlighted the fact Chicken & Cheese on the McDonald's loose change menu costs $7 on Uber Eats, while the same item costs $3.50 in-store.\n\nEvery item on the McDonald's menu is ﻿significantly more expensive on Uber Eats.\n\nA Chicken 'n' Cheese is listed for $7.70 on Uber Eats, while it costs $3.50 when ordering in store. (Nine)\n\nThe loose change menu includes a Hamburger for $2, a Chicken & Cheese for $3.50, a﻿ Sausage McMuffin for $4 and a Ham and Cheese pocket for $2.50.\n\nHowever, a tab that reads \"Loose Change Menu\" on the Uber Eats app offers ﻿a Sausage McMuffin for $7.\n\nThe Chicken 'n' Cheese is listed for $7.70 while the Ham & Cheese pocket is listed for $4.85. ﻿\n\nA hamburger does not appear at all on Uber Eats, but a cheesburger on the regular menu costs $6.70.\n\nIt's not just the Loose Change menu being sold for a drastically different price.\n\nThe Chicken 'n' Cheese was once a part of the loose change menu. (McDonalds)\n\nA Sausage McMuffin on the Uber Eats app for $7 under the Loose Change Menu. (Nine)\n\nA McChicken on the MyMacca's app is listed ﻿for $7.75, but it's $9.55 on Uber Eats.\n\nA three-pack of nuggets will set customers back $5.45 on the MyMacca's app and $6.70 on Uber Eats.\n\nA small frozen Coke, which usually costs $2, is listed for $5.70﻿.\n\nMcDonald's told 9news.com.au the Loose Change menu is not available through third-party delivery apps.\n\n\"﻿Macca's has always been the home of value and affordability, and we're more focused than ever on delivering great value, every day,\" the statement reads.\n\n\"﻿Our Loose Change Menu is available at all of our restaurants across the country in dine-in, drive thru or through the MyMacca's app.\"\n\nUber Eats declined to provide an official comment, but 9news.com.au understands restaurants independently control the pricing of items on the app.\n\nREAD MORE: Huge waves to pound thousands of kilometres of coastline\n\n'Why the f--- is it $7?\", Mikaela Testa asks in the video (TikTok)\n\nTikTok creator Mikaela Testa addressed the massive price hike of the Chicken 'n' Cheese in a video posted to her 2.8 million followers, saying McDonald's had \"lost their mind.\"\n\n\"I just went to order myself some McDonald's ﻿on Uber Eats, I went to get a Chicken 'n' Cheese, I thought it was gonna be $2 on the loose change menu,\" Testa said in the video posted to TikTok.\n\n\"The ﻿Chicken 'n' Cheese was never more than $3, sometimes it was $1.50, sometimes it was $2... why the f--- is it $7?\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/chinese-paraglider-survives-8500-metre-high-flight-without-oxygen/1b646e1f-c499-41c5-a88d-253ad43d7f9f",
    "title": "Paraglider survives accidental 8500-metre-high flight without oxygen",
    "publish_date": "Thu, 29 May 2025 23:45:00 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Chinese paraglider Peng Yujiang is lucky to be back on the ground after surviving a powerful updraft that suddenly lifted him into the upper atmosphere.\n\nPeng reportedly went soaring 8598 metres above the Qilian Mountains in China's Gansu Province without oxygen on Saturday.\n\nAmateur video shared by Chinese state media showed Peng with ice covering his face and clothes while drifting in the clouds.\n\nREAD MORE: Dramatic turn as Trump tariffs allowed to continue\n\nA sudden uplift dragged the paraglider 8500 metres above a Chinese mountain region. (CNN)\n\n\"I had just bought a second-hand paragliding harness and wanted to test it, so I was conducting ground parachute shaking. After a while, the wind suddenly picked up and lifted me into the air. I tried to land as soon as possible, but I failed,\" Peng told Chinese state broadcaster China Central Television (CCTV).\n\n\"I found myself surrounded by cumulonimbus clouds and trapped inside. It was terrifying, everything around me was white.\n\n\"Without the compass, I wouldn't have known which direction I was heading. I thought I was flying straight, but in reality, I was spinning. Eventually, I managed to fly out toward the northeast.\"\n\nPeng says he was shocked to learn he reached such a high altitude and believe he might have briefly lost consciousness, state media reports.\n\nThe paraglider was covered in snow and ice as he soared 8500 metres above China. (YouTube)\n\nHe has been paragliding for more than four years and is a certified B-level paraglider which requires at least 20 days of flight experience.\n\nPeng was able to control his paraglider using his compass and radio communication with teammates despite having nearly frozen and numb hands.\n\n\"As soon as I came out of the clouds, I was very excited because I had survived,\" Peng told CCTV.\n\n\"The scariest moment was when I tried to pull out of the spiral and failed and when the canopy nosedived. It's still frightening to think about.\n\n\"I'm not sure about the future, but for now I definitely won't fly for a while,\" he added.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/world-boxing-mandatory-sex-testing-for-all-boxers/105361542",
    "title": "Gold medalist Khelif must undergo genetic sex test to continue boxing",
    "publish_date": "Sat, 31 May 2025 01:54:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "World Boxing has confirmed it will introduce mandatory sex testing for all boxers in its competitions.\n\nThe governing body added that Paris Olympics gold medallist Imane Khelif will not be allowed to compete until she undergoes such a test.\n\n\"Imane Khelif may not participate in the female category at … any World Boxing event until Imane Khelif undergoes genetic sex screening in accordance with World Boxing's rules and testing procedures,\" World Boxing said in a statement.\n\n\"The introduction of mandatory testing will be part of a new policy on 'Sex, Age and Weight' to ensure the safety of all participants and deliver a competitive level playing field for men and women.\"\n\nThe new policy comes less than a year after Khelif and Taiwan's Lin Yu-ting both won gold in Paris amid a gender-eligibility row.\n\nKhelif and Taiwan's Lin Yu-ting were both involved in a gender-eligibility row. (Reuters: Peter Cziborra/AP: John Locher)\n\nWorld Boxing said they had written to the Algerian Boxing Federation stating that Khelif would not be allowed to compete at the upcoming Eindhoven Box Cup from June 5–10 until she underwent the test.\n\nWomen's welterweight Olympic champion Khelif has not yet commented on the announcement, nor has the Algerian Boxing Federation.\n\nThe country's federation joined World Boxing in September, one of more than 100 national federations that have joined the body since it was established in 2023.\n\nWhile amendments to competition rules are typically done by the World Boxing Congress, the new policy was adopted by the body's executive board, which holds the authority to make immediate amendments under \"special or emergency circumstances\".\n\nNew rules to safeguard athletes, says World Boxing\n\n\"These new eligibility rules were developed with the express purpose of safeguarding athletes in combat sports, particularly given the physical risks associated with Olympic-style boxing,\" World Boxing's statement said.\n\nAll athletes over the age of 18 will have to undertake a PCR (polymerase chain reaction) genetic test, which can be conducted by a nasal or mouth swab, saliva or blood, World Boxing said.\n\nKhelif hits out at IBA Photo shows Boxer Imane Khelif at the Doha Forum. She is sitting in a chair, wearing headphones and holding a microphone. Imane Khelif accuses the International Boxing Assocation of spreading \"baseless lies and misinformation\" after it cited Donald Trump's executive order around transgender athletes in legal action against the IOC.\n\n\"The PCR test is a laboratory technique used to detect specific genetic material, in this case the SRY gene, that reveals the presence of the Y chromosome, which is an indicator of biological sex,\" World Boxing said.\n\n\"Athletes that are deemed to be male at birth, as evidenced by the presence of Y chromosome … or with a difference of sexual development (DSD) where male androgenisation occurs, will be eligible to compete in the male category.\n\n\"Athletes that are deemed to be female at birth … or with a DSD where male androgenisation does not occur, will be eligible to compete in the female category.\"\n\nIn February, US President Donald Trump signed an executive order banning transgender athletes from competing in women's sports.\n\nIn March, Khelif said she was determined to defend her title at the 2028 Los Angeles Games, adding that she would not be intimidated by Trump as she is not transgender.\n\nAt the 2023 world championships, Khelif was disqualified by the International Boxing Association (IBA) after a test that the body said rendered her ineligible to fight as a woman on the grounds of gender.\n\nThe IBA lost its Olympic recognition over governance issues, however, and the International Olympic Committee cleared Khelif to compete in Paris.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/north-west-shelf-extension-analysis/105359404",
    "title": "More headaches ahead for WA government after North West Shelf call",
    "publish_date": "Sat, 31 May 2025 00:56:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "WA Premier Roger Cook got his wish this week.\n\nWoodside's North West Shelf gas project can continue operating off the Pilbara coast until 2070, and he can finally get industry off his back.\n\nBut don't ask him about the impact on climate.\n\nMr Cook was waiting with bated breath for the outcome of the decision from Federal Environment Minister Murray Watt, who approved the project's extension.\n\nBut green groups are not buying the reasoning for his support of the project — a bold claim about WA's gas.\n\nAbout 200 people protested out the front of State Parliament against an extension of Woodside's North West Shelf gas project this week. (ABC News: Briana Shepherd)\n\n\"Our gas is about providing the opportunity for the globe to decarbonise,\" Mr Cook said on Thursday.\n\nAnd it's something they're going to take him to task on.\n\nEconomy over emissions\n\nMr Watt said he considered the potential impacts extending the life of the plant would have on the national heritage values of nearby rock art and the economic matters, but the act which governs environmental approvals does not include provisions to consider the climate change impact of a project.\n\nWhich might explain why conversations regarding the climate have largely been pushed under the rug.\n\nThe premier chose to focus more on jobs and the economy, dodging questions about the impact of emissions.\n\nRoger Cook had been keen to see the extension to the North West Shelf approved. (ABC News: Courtney Withers)\n\n\"This saves literally thousands of jobs in Western Australia … and secures the future for Karratha,\" Mr Cook told reporters.\n\n\" It's not just important for our overall economy, it's important for regional WA. \"\n\nFederal and state Labor agree gas is important and will play a large role in the energy transition.\n\nWoodside approval paves the way for the mother of all climate battles Photo shows Woodside future - North Rankin When all the hype and the fury are stripped away, the decision to extend the life of the gigantic North West Shelf LNG plant boils down to one thing — enabling the Browse gas project off the Kimberley coast.\n\n\"In order to get that investment in renewables, you do need firming capacity, whether it be batteries, hydro or gas. And that is what will encourage that investment and the transition to occur,\" Prime Minister Anthony Albanese said on Thursday.\n\nDeputy Premier Rita Saffioti echoed a very similar sentiment on Friday.\n\n\"This is all about making sure we get the balance right and making sure ... we also have the resources to continue to deliver affordable and reliable energy as we go through the transition,\" she said.\n\nBut green groups reject those lines entirely.\n\nGreenpeace Australia Pacific's Geoff Bice thinks Mr Watt's decision could have provided a \"step in earnest\" away from fossil fuels — not towards.\n\n\"At the end of the day, there's a competition on for the role of energy being between renewable energy and polluting fossil fuels,\" he said.\n\nThere are fears thousands of ancient petroglyphs are being degraded by emissions from the plant. (ABC News: Charlie McLean)\n\n\"The decision to extend the life of the North West Shelf only makes that transition harder and pushes it out further both for our domestic economy and the regional economy.\"\n\nGovernment 'in bed' with gas giants?\n\nProtest after protest has posed the same question about Australia's role in bringing down global emissions — is the government beholden to gas giants?\n\nA group of protesters gathered outside Perth's District Court on Friday to protest the North West Shelf extension. (ABC News: Courtney Withers)\n\nOr, as more informally put by federal Tasmanian Greens Senator Peter Whish-Wilson — do we have \"a government that is in bed with big fossil fuel companies\"?\n\nWA Mines Minister David Michael was asked on Thursday if both state and federal Labor are prioritising gas over traditional owners' cultural sites — namely nearby ancient Aboriginal rock art on the Burrup Peninsula (Murujuga) near Karratha, which traditional owners say will be \"stripped\" from them with this extension.\n\n\"We're prioritising making sure we have gas in our system in WA to keep the lights on and to support industry,\" he said.\n\nWoodside's Karratha Gas Plant operations are close to some of the Pilbara's natural wonders. (ABC News: Charlie McLean)\n\nThe WA government might be supporting industry but it won't be able to dodge questions about climate — and the impact on traditional owners — much longer.\n\nEspecially now with not one, but four upper house Greens MPs champing at the bit to hold it to account.\n\nRock art report questioned\n\nNew Greens MLC Jess Beckerling used Question Time this week to point out discrepancies in the executive summary of the Rock Art Monitoring Report released last Friday by the government — which studied the impacts of industrial air emissions on those ancient rock carvings at Murujuga.\n\nReferring to a line missing in a graph contained in the report, University of Western Australia professor of archaeology Benjamin Smith claimed the government \"doctored\" it.\n\nBenjamin Smith was scathing in his assessment of the government's handling of the report on rock art. (ABC News: Keane Bourke.)\n\nWA Environment Minister Matthew Swinbourn said the \"graph in the summary document was simplified\", but the pressure from the Greens is likely not done yet.\n\nAnd the headaches didn't stop there for the government.\n\nTraditional owners to keep fighting North West Shelf extension Photo shows A rock carving of an lizard on red rocks Traditional owners have pledged to continue fighting the decision to extend the North West Shelf gas plant, as environmentalists shift their focus to Woodside's next major project.\n\nIn some awkward timing, an interim UNESCO report released on Tuesday knocked back the Murujuga Cultural Landscape to the World Heritage list, citing concerns about emissions degrading the Aboriginal carvings.\n\nThe draft decision called on the government to \"ensure the total removal of degrading acidic emissions\" — which might be a little hard to do now, until after 2070.\n\n\"It is disappointing that the draft decision is heavily influenced by claims made in the media and correspondence from non-government organisations, rather than scientific and other expert evidence,\" Mr Watt said in a statement.\n\nGas might be a balancing act for the federal and state governments, but one thing is certain — concerns about the climate are mounting and the pressure won't be letting up any time soon.\n\nSo it best be prepared to answer tough questions.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/best-new-albums-pinkpantheress-thom-yorke-stereolab-men-i-trust/105341816",
    "title": "10 albums we couldn't stop listening to in May",
    "publish_date": "Sat, 31 May 2025 00:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Finding time to seek out new music is a luxury that's becoming harder to satisfy.\n\nNot only does it feel like life just gets busier, there's more music than ever and it's never been easier to access it. This makes it tough to know where to start.\n\nOur music experts hoover up most new releases, and they're dedicated to making sure the cream of what's been released finds a way to your ears. They might not cure your choice paralysis, but they'll help you through it.\n\nHere are 10 albums worth your time this month, whether you're a pop stan, rock dog or someone who just likes a bit of everything.\n\nPinkPantheress packs nine great songs into 20 minutes on her new mixtape Fancy That. (Supplied: Warner Music)\n\nPinkPantheress — Fancy That\n\nFeel like time travelling for 20 minutes? Let British pop star PinkPantheress take you back to the dancefloors of the 2000s, where cinematic strings clashed with garage beats and sleek pop melodies to help bring the sound of London's underground to the mainstream.\n\nWhile she borrows liberally for her second mixtape — you'll literally hear classics from Underworld, William Orbit, Panic At The Disco and Basement Jaxx in the mix — PinkPantheress imbues more than enough of her own talent and perspective to take it beyond pastiche and make it something unique.\n\nFor fans of: Sugababes, The Streets, William Orbit\n\nDan Condon\n\nLoading YouTube content\n\nThom Yorke & Mark Pritchard enlisted Australia’s own Jonathan Zawada for the album’s artwork and accompanying visuals. (Jonathan Zawada: Warp Records)\n\nThom Yorke & Mark Pritchard — Tall Tales\n\n\"Back to my old tricks again\" Thom Yorke sings on 'Back In The Game', from electronic album with British producer Mark Pritchard.\n\nIndeed, Tall Tales contains all the Radiohead frontman's signatures; dystopian in both eerie sound and doomsaying subject matter, reflecting a world warped by greed, twisted politics and climate emergency.\n\nNot exactly ground-breaking, predictable even, continuing Yorke's busy streak from The Smile, film soundtracks and a solo Australian tour (that wasn't without controversy).\n\nThat said, Pritchard's subterranean instrumentals – tinkered on through the pandemic and possessing the air of lockdown lunacy — prompt Yorke to muck around with his voice and toward territory that's darker and weirder, even by his standards.\n\n'The Men Who Dance In Stag's Heads' is Lou Reed going gothic folk, the title track's sinister panoply of inhuman voices makes 'Fitter, Happier' seem like a pop ditty, while 'The Spirit' is a rare moment of beauty — a shimmering dream amid many nightmares.\n\nFor fans of: The Smile, Clark, Aphex Twin\n\nAl Newstead\n\nLoading YouTube content\n\nInstant Holograms On Metal Film is Stereolab's first album since reforming in 2019 (Supplied: Inertia Music)\n\nStereolab — Instant Holograms On Metal Film\n\nRetro futuristic icons Stereolab haven't delivered an album in 15 years, so the familiar feel of Instant Holograms On Metal Film will provide comfort and joy to their fans.\n\nThere's a sophistication to the band's gentle, thoughtful, propulsive indie pop that extends beyond frontwoman Laetitia Sadier's French coo. It's in Andy Ramsay's gentle but decisive snare taps, the texture of Tim Gane's guitar, and the webs of vintage synths that scaffold each song.\n\nSometimes, like on 'Aerial Troubles', you get so engrossed in their groove it's jarring when it ends. Thankfully, there's always another uber-cool synthy jam to swallow you up.\n\nFor Fans Of: Françoise Hardy, Broadcast, Arthur Russell\n\nDan Condon\n\nLoading YouTube content\n\nChasing Ghosts tour Therapy around Australia from June. (Supplied: Chasing Ghosts)\n\nChasing Ghosts — Therapy\n\nBeginning as the solo project of Thungutti man Jimmy Kyle, Chasing Ghosts have evolved on their Double J-featured fourth album into an arena-ready punk rock act. Think Smith Street Band on a Green Day budget.\n\nFor all the polished production and instrumentation (Strings! Synths! Piano!) none of it sacrifices authenticity or intensity. Instead they amplify the emotional heart of tunes as likely to make you tear up as have you bellowing along.\n\nKyle's passion and honesty shine on cathartic anthems addressing mental health, domestic violence, suicide, and the inequity and intergenerational trauma still faced by First Nations people.\n\nTherapy tackles tough topics but feels more life-affirming than harrowing, striking a tricky balance of being hooky, tender yet heavy-hitting.\n\nFor fans of: Luca Brasi, The Amity Affliction, Stand Atlantic\n\nAl Newstead\n\nLoading YouTube content\n\nI'm With Her is an Americana trio made up of singer-songwriters Sara Watkins, Sarah Jarosz and Aoife O'Donovan. (Supplied: Rounder Records)\n\nI'm With Her — Wild and Clear and Blue\n\nAmericana trio I'm With Her stuck with their name post-Hillary (they had it first) and, more importantly, have kept making flawless, breathtaking folk music.\n\nThey aren't in a rush, this second album arrived seven years on from their debut (though just months after this perfect Sabrina Carpenter cover), and there's something beautifully unhurried about the music too. These pastoral songs sound as though they could come from any time and will maintain their relevance for years to come.\n\nThe elements are basic — mainly guitar and voices — and whether it's quiet intensity of 'Sister Of The Night Watch', the urgent, engrossing bridge of 'Standing On The Fault Line', or the lovesick jig of 'Find My Way To You', they deliver a procession of captivating moments that make them feel like more than the sum of their parts.\n\nFor fans of: First Aid Kit, Gillian Welch, boygenius\n\nDan Condon\n\nLoading YouTube content\n\nThis is Men I Trust’s seventh album and second for 2025 – arriving just seven weeks after Equus Asinus. (Supplied: Men I Trust)\n\nMen I Trust — Equus Caballus\n\nCanadian indie troupe Men I Trust are the definition of easy listening. Sticky melodies and woozy atmospheres are everywhere in their soft-focus, groove-driven bedroom pop, fronted by Emma Proulx's effortless, feather-soft vocals.\n\nThey've achieved word-of-mouth popularity, with titanic streaming figures to match, despite lacking label backing or anything resembling mainstream presence. That's largely because they're the perfect 'switching off' soundtrack.\n\nEquus Caballus is no exception. But close listening is handsomely rewarded with sumptuous details lurking beneath the impossibly smooth surface — glossy synths, gargled bass tones, canny key changes and vivid, warm beauty.\n\nThey're unfairly lumped in with groups that prioritise 'vibe' over song craft, but Men I Trust's latest proves they're head and shoulders above the zoned-out catnip littering Spotify playlists that encourage passive listening.\n\nFor fans of: The Marías, Mac DeMarco, Air\n\nAl Newstead\n\nLoading YouTube content\n\nThe World Is Still Here and So Are We is Welsh trio Mclusky's first album in 21 years. (Supplied: Mushroom Music)\n\nMclusky — The World Is Still Here and So Are We\n\nFans didn't need much from Mclusky's return to recording after 21 years. If the songs were noisy, immediate, aggressive, and funny without veering into novelty territory, they'd be happy.\n\nWhile we've no doubt Andrew Falkous is a multifaceted human being, he knows his strengths. Any fear of this album sullying the Welsh trio's legacy are destroyed within minutes, as its pacey, intense songs with titles like 'kafka-esque novelist franz kafka' and 'way of the exploding dickhead' remind us why we fell so hard for this trio in the 2000s.\n\nRecent hearing issues haven't dulled their approach, as grinding bass, squawking guitar and pummelling drums remain the perfect platform for Falkous's cutting witticisms.\n\nFor fans of: IDLES, Big Black, The Drones\n\nDan Condon\n\nLoading YouTube content\n\nSuperb is Surprise Chef's fourth album in five years. (Supplied: Big Crown Records)\n\nSurprise Chef — Superb\n\nHailing from the inner-north Melbourne suburb of Coburg, Surprise Chef's instrumental cinematic jazz-funk and hip-hop-tinged soul has made them darlings of crate-diggers, community radio and international taste makers alike.\n\nThey're known for carefully orchestrated atmospheres and grooves tight enough to set your watch to. Superb, however, sees them loosening up, trading precision for spontaneity on music that's freer to tinker and explore.\n\nFrom the bait-and-switch of 'Body Slam' to the knob-twiddling on 'Consulate Case' and hazy highlights 'Websites' and 'Tag Dag', this is a group who fully grasp their signature, luxurious sound but are now confident enough to add extra spice to their established menu. Allow Surprise Chef time and space to cook, and they're guaranteed to dish up something tasty with a satisfying twist.\n\nFor fans of: Khruangbin, Karate Boogaloo, Sven Wunder\n\nAl Newstead\n\nLoading YouTube content\n\nThe latest album from Melbourne rock band Civic is moodier than past releases, but retains their compelling intensity. (Supplied: ATO Records)\n\nCivic — Chrome Dipped\n\nMelbourne garage punks Civic look a little different than on their last album, with a new drummer and one fewer guitarist.\n\nThey sound a little different too. While the snarl of earlier records remains, Chrome Dipped's pace is comparatively subdued, relying on moodier sounds and textures to demonstrate their ferocity. The result is an engrossing display of rumbling rock'n'roll that calls to mind great Australian punk of the past while retaining its own identity.\n\nThey haven't abandoned the aggression of previous records entirely — limbs will continue to flail when they play thrashier songs like 'Poison' and 'Fragrant Rice' live — but the evolved sound points to a new-found versatility that makes an already great band all the more compelling.\n\nFor fans of: Fontaines D.C., Violent Soho, Radio Birdman\n\nDan Condon\n\nLoading YouTube content\n\nFrontman and band \"talisman\" Jack McEwan says there are many \"flavours, cream crackers and fairground amusements packed into Carpe Diem, Moonman\". (Supplied: What Really? Records)\n\nPsychedelic Porn Crumpets — Carpe Diem, Moonman\n\nFrom their ridiculous name on down to their stoner-friendly sound and gnarly live show, Psychedelic Porn Crumpets are essentially Perth's own King Gizzard & The Lizard Wizard.\n\nSimilarly, their penchant for the absurd can seem easy to dismiss. But to do so is to miss out on a fun, fierce, satisfying listening experience. Instantly ranking among the group's best work, Carpe Diem, Moonman refines the band's extremes.\n\nThe heavier moments crunch even harder — 'Another Reincarnation' and 'Weird World Awoke' are all fuzzy, face-melting riffs and hammering grooves — while the mellower passages excel at spacey atmospheres anchored by melody, such as 'Scapegoat' and 'Qwik Maff'. Meanwhile, headbanging spectacle and psychedelic ambience fuse on 'Out the Universe Pours'.\n\nFor fans of: King Gizzard & The Lizard Wizard, Ty Segall, Frankie & The Witch Fingers\n\nAl Newstead\n\nLoading YouTube content\n\nTune in to Double J for more great new music.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/first-nations-cultural-camp-murray-river-robinvale-thelma-chilly/105290106",
    "title": "River of tears now brims with hope as traditions pass to new generation",
    "publish_date": "Fri, 30 May 2025 23:37:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "There's a bend along the Murray River at Robinvale in north-west Victoria that arouses conflicting emotions in multi-clan nation elder Aunty Thelma Chilly.\n\nIt's where, as a girl, she ran and played on the riverbank and learnt the traditions of ancestors, passed down through generations.\n\nBut it's also where the harsh realities of the White Australia Policy played out.\n\nAunty Thelma's family was forced to move from their home on the banks of the Murray River, at a site known locally as Punt Bend, to the old Manatunga mission close by.\n\nDecades after her family was relocated, Aunty Thelma is working to reclaim the site through an annual cultural gathering of Aboriginal families from across Australia's east coast.\n\nTraditional owners used to call Punt Bend at Robinvale home. (ABC News: Tyrone Dalton)\n\nFamilies find belonging in Robinvale\n\nDuring the 1956 flood, Aboriginal families relocated from Punt Bend to an industrial area in Robinvale.\n\n\"Non-Aboriginal people in town perceived us as a problem, a black problem, and they wanted to do something about that,\" Aunty Thelma said.\n\nA story about Aboriginal families in Robinvale was on the front page of the Sunraysia Daily newspaper in October 1968. (ABC News: Tyrone Dalton)\n\n\"They formed a welfare board, which was connected to the assimilation policies of those days, and they built Manatunga mission.\"\n\nFamilies were forced onto the mission, to live in concrete buildings with a door and a pot-belly stove.\n\nStill, Aunty Thelma's family and others kept returning to the banks of the Murray every year, sometimes for months at a time.\n\n\"This land here is where a lot of our people lived before mission days. So, their generations have come back here, every year, since then,\" she said.\n\n\"They actually return here to … commemorate the fact that this was where their people come from.\n\n\"We have turned this into a place of learning and passing on knowledge of our culture.\"\n\nLoading...\n\nEvery year, families come from across Australia's east coast to Robinvale on Tati Tati Country to take part in a four-day camp.\n\n\"Every year, we try to do something different here at the Easter camp to pass along the culture and knowledge to other people in the community, but particularly our children,\" Aunty Thelma said.\n\nRobinvale is close to the lands of Latje Latje, Wadi Wadi and Mutti Mutti clans, and their traditional owners can be found among the families who set up a campsite every year.\n\nMatthew Chilly creates ceremonial and cultural pieces. (ABC News: Tyrone Dalton)\n\nWeaving together culture and stories\n\nHow to get involved in Reconciliation Week Photo shows Karen Mundine smiles for a photo, she is wearing a black shirt with pink flowers. This year's theme Bridging Now to Next prompts Australians to push forward towards a more united and respectful nation, with past lessons as guidance.\n\nOver the four days, older generations teach their children, grandchildren and others how to fish, weave, and make cultural art and costumes, and to hold ceremonies such as Welcome Baby to Country.\n\nIt's a way for those who didn't grow up with a connection to family and culture to find that connection and sense of belonging.\n\n\"Matt [Chilly] does his emu feathers and he's weaving, and he's telling his story with the importance of technique, and art and creativity,\" Aunty Thelma said.\n\nThis year, the camp's visitors took part in an afternoon of weaving and emu feather craft. (ABC News: Tyrone Dalton)\n\n\"He's a creative young man, and it's so important to be able to provide that art.\n\n\" Matthew was taught by elders who have come to this camp when he was younger, and that's how he knows how to do it. \"\n\nChildren learn how to fish during the riverbank camp. (ABC News: Tyrone Dalton)\n\nReclaiming connection through next generation\n\nThe stories of assimilation and the threat of the welfare board would never be forgotten by those who lived through that period, Aunty Thelma said.\n\nBut by holding the camp, elders hoped to reinforce their pride in their culture and share their customs and skills with their most important asset — their children.\n\nAunty Thelma says the annual camp is a way for First Nations people to reclaim their land. (ABC News: Tyrone Dalton)\n\n\"I'm just so grateful to be able to continue this tradition of being in this place, and it does mean a lot to me,\" Aunty Thelma said.\n\n\" And passing that knowledge and culture on to our kids means even more. \"\n\nNational Reconciliation Week runs from May 27 to June 3.\n\nThis year's theme is Bridging Now to Next, which reflects the ongoing connection between past, present and future, and how Australia can move forward by learning from past lessons.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/calls-to-remove-feral-goats-from-great-keppel-island/105254704",
    "title": "Feral goats chew though native vegetation on Great Barrier Reef island",
    "publish_date": "Fri, 30 May 2025 23:26:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "White sandy beaches, lush green bushland and turquoise water greet visitors stepping off the ferry onto Queensland's Great Keppel (Woppa) Island.\n\nMost daytrippers to the southern Great Barrier Reef paradise wouldn't notice the environmental threat lurking quietly among the vegetation.\n\nAbout 1,000 feral goats are estimated to roam the island off the Capricorn Coast, destroying native flora.\n\nGoats were introduced to the island 100 years ago as a food source. (ABC News: Ellie Willcox)\n\nThe Queensland government has been responsible for managing the feral pests since 2023, when the former leaseholder of the island, Tower Holdings, had its leases cancelled due to non-payment of fees.\n\nCarl Svendsen, 67, has lived on the island his entire life and is advocating for the goats to be completely removed.\n\nCarl Svendsen wants the goats removed from the island. (ABC News: Ellie Willcox)\n\n\"In more modern times there's been no management plan for the goats,\" he said.\n\n\"It's a pretty major problem because it's impacting on a lot of our delicate sand dunes.\n\n\" There's only one or two pieces of spinifex grass left that would normally be along Butterfish Bay so that's a pretty big impact. \"\n\nSpinifex grass that helps to prevent erosion of sand dunes is being destroyed by goats. (ABC News: Ellie Willcox)\n\nThe goats were introduced about a century ago as a food source.\n\nAnother island resident, Stuart Thomson, said damage from the feral animals could be seen everywhere.\n\nStuart Thomson is also calling for the removal of feral goats from the island. (ABC News: Ellie Willcox)\n\nHe is also calling for their removal.\n\n\"When I first got here, there may have been about 500 to 600 goats, but I'd have to guess there would be 800 to 1,000 now,\" Mr Thomson said.\n\n\"They eat the native grasses, they eat the spinifex off the beaches, they eat all the young trees.\n\n\"They need to be removed completely, not culled down or anything like that because we will have the same problem in another 10 years.\"\n\nFeral goats are eating native vegetation and saplings. (ABC News: Ellie Willcox)\n\nThe Department of Natural Resources said since the former resort leases were forfeited two years ago, its priority had been to address public safety issues on the site.\n\n\"This has included installing a perimeter fence, signage, a remote CCTV system, and clearing overgrown vegetation,\" it said.\n\n\"The department takes its obligations under the Biosecurity Act 2014 seriously and is now consulting stakeholders with a view to developing a goat management plan.\"\n\nThe Queensland government took back the leases to the island's dilapidated resort in 2023. (ABC News: Ellie Willcox)\n\nCapricorn Conservation Council coordinator Sophie George said the state government had been too slow to respond to the issue.\n\n\"The help is just not coming fast enough,\" she said.\n\n\"It's great they are working on security on the island, there is a lot of work happening at the actual resort to dismantle it and make sure it's a safer area, but the goats are just as much as a problem as those safety issues.\n\nA goat management plan is expected to be finalised this year. (ABC News: Ellie Willcox)\n\n\" What we would like to see is some delegation of funding and delegation of power over to Livingstone Shire Council and/or to the Woppaburra people and rangers to get the goats gone once and for all. \"\n\nWoppaburra rangers work alongside government agencies to protect their traditional sea country, managing pests and fire.\n\nThe department says a goat management plan is expected to be finalised later this year.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/stateline-why-so-many-filipinos-choose-to-call-the-nt-home/105343080",
    "title": "Why so many Filipinos choose to call the NT home",
    "publish_date": "Fri, 30 May 2025 23:12:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a Sunday evening in May, laughter can be heard from a group of Filipino locals embracing the Top End dry season at their local park.\n\nThere's fried chicken, ukoy (Filipino deep-fried fritters) and plenty of sweet treats.\n\n\"Every weekend there's an event,\" says Maria Lourdes Delin, who moved to Darwin from the Philippines in 2010.\n\nMaria Lourdes Delin says she enjoys getting together with the local Filipino community in Darwin and Palmerston. (ABC News: Pete Garnish)\n\nHere in the Northern Territory, Filipinos are the number one migrant community according to Australian Bureau of Statistics country of birth data.\n\nIn every other Australian jurisdiction, that spot is held by English, Indian, Chinese or New Zealander migrants.\n\nSo why do so many Filipinos choose to call the territory home?\n\nProximity to the Philippines, climate and the tight-knit community are just some of the reasons why so many Filipinos choose to move to the territory. (ABC News: Pete Garnish)\n\n'Loyal' to the territory\n\nGerald Danao, who grew up in the northern Philippines's Ilocos region, moved to Darwin in 2022 in one of the first cohorts of international students to migrate after COVID.\n\nThe 41-year-old entomologist was looking for a place to complete his master's degree, when a friend convinced him of Darwin.\n\n\"[They] knew that I wanted to grow old in a very relaxed life, a laid-back community, and be in a more tropical place,\" Mr Danao says.\n\nFilipino entomologist Gerald Danao completed his masters degree in Darwin. (ABC News: Michael Franchi)\n\nBeyond advancing his career, Mr Danao's move to Australia was also about finding acceptance as a gay man.\n\n\" It's always hard trying to be somebody who you're not. \"\n\nHe said being gay could be a \"taboo\" among many Filipino families.\n\n\"I knew my family could be one of [those who disapprove] and it's going to be shocking,\" Mr Danao said.\n\n\"When I arrived here I had the courage to actually be myself.\"\n\nGerald Danao's family, like many Filipino families, are Catholic. His mother gifted him the family Bible, written in their native language of Ilocano, to take with him wherever he travelled. (ABC News: Michael Franchi)\n\nNow on a graduate visa with a permanent job in environmental management, Mr Danao and his partner, who's also a skilled Filipino migrant, are committed to making the territory their forever home.\n\n\"We need to be loyal now to NT because they are loyal to us, it should be a give and take relationship,\" he says.\n\n\"We've decided to apply [for permanent residency] as soon as possible.\"\n\nA long-standing history\n\nFor more than a century, Filipino migrants have come to the territory to fill gaps in local industries.\n\nThe first wave began in 1895 when a small group of Filipinos became divers for the territory's now-iconic pearl industry.\n\nThe White Australia policy Photo shows Poster outlines White Australia Game and its rules The Immigration Restriction Act of 1901 led to the restriction of non-European migration, which became known as the White Australia policy.\n\nThen the White Australia policy's introduction in 1901 put a 70-plus-year limitation on non-European migration.\n\nAfter the policy's end in the 1970s, there was a second wave of Filipino migration with many school teachers moving to the NT.\n\nAnother wave in the 80s coincided with the Family Reunion and Marriage Visa Scheme, which allowed people to bring family members or prospective spouses to Australia.\n\nJohn Rivas says there are lots of Filipinos in Darwin currently working in aged care and childcare. (ABC News: Dane Hirst)\n\nFilipino Honorary Consul General for the NT, John Rivas says the territory is now seeing a fourth wave of migration with an influx of skilled workers and international students.\n\n\"A lot [of the skilled workers] are in the building industry … but lately there has been an increase in the number of Filipinos working in the aged care and childcare industries,\" he says.\n\nA Filipino-Larrakia love story\n\nFor Nadine Lee, the history of Filipino migration to the NT is a story about her family lineage.\n\nMs Lee's great grandfather, Antonio Cubillo, was one of the first Filipino pearl divers to come to Darwin in 1895.\n\nAntonio Cubillo came to Darwin to work as a pearl diver for the local industry. (Supplied: An excerpt from Certificate of Exemption from Dictation Test — Antonio Cubillo, 1929. National Archives of Australia. E752, 1928/2A)\n\nBut it's Mr Cubillo's love story with a local Aboriginal Larrakia woman, Lily McKeddie, and the 10 children they had together that's created a legacy.\n\n\"There's lots of Larrakia people with Filipino history and connections, and I think it does surprise people,\" Ms Cubillo says.\n\nAs a fifth-generation descendent of the couple, Ms Lee says the Cubillo family has become one of biggest Larrakia-Filipino families in the NT.\n\nNadine Lee says the Cubillo family is the biggest Filipino-Larrakia family she knows of. (ABC News: Michael Franchi)\n\nDuring the 90s Ms Lee's brother Gary wrote a play on the great-grandparents' love story titled 'Keep Him My Heart'.\n\nWhile the play was only performed six times, a book with the same title has recently been published.\n\n\"Now we have a physical documentation on our ancestry. With all the children, it helps us figure out where we are in our family tree,\" Ms Lee says.\n\nBeyond the work, there's community\n\nPresident of the local NT Filipino Association, Emcille Wills, says Filipinos have lots to love about life in the Top End.\n\n\"First of all geographically … the Philippines is so close to Darwin, the second is the climate and the third one I think is the camaraderie [of the local Filipino community],\" she says.\n\nEmcille Wills (centre) says Darwin's proximity to the Phillipines, climate and close-knit community are all drawcards for Filipino migrants. (ABC News: Pete Garnish)\n\n\"Because Darwin is smaller compared to other states, there's only one organisation and we know most of the Filipinos, so we're quite connected.\"\n\nMr Danao says the tight-knit nature of the local Filipino community has been a huge blessing.\n\n\"I felt really relieved. I got a job in my first week, because of my Facebook post on the Filipino community [page],\" Mr Danao says.\n\n\"I owe them actually, I might not be here without them.\"\n\nGerald (right) says when he first arrived, being able to connect with fellow FIlipino locals was a huge relief. (ABC News: Pete Garnish)\n\nMs Wills says the association's goal is not just to connect with other Filipinos, but with the broader community.\n\nThat includes having Filipino dances and music brought to a territory stage.\n\n\"We managed to actually perform in the Darwin Festival, the Territory Day and it's never happened before. And it's not just the Filipino community, it's other cultures as well,\" she says.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-05-31/disaster-relief-changes-apply-to-qld-wet-season/105356522",
    "title": "Queensland redefines farmers to expand access to disaster relief",
    "publish_date": "Fri, 30 May 2025 22:59:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Farmers denied disaster relief due to their off-farm income could now be eligible for recovery grants due to changes to Queensland's definition of primary production.\n\nIn the past, disaster recovery grants, loans and freight subsidies were only available to producers who earned most of their income from the farm, or would in future.\n\nIt meant farmers who also earned income off-farm, including from agriculture services like contract harvesting, mustering and milking, were not eligible.\n\nBanana growers were unable to access their farms for days during flooding in February. (Supplied: Gavin Eilers)\n\nThe criteria had been criticised for excluding farmers with small-scale or diversified operations, regardless of how much damage they experienced.\n\nFarm groups have welcomed the change, which would apply retrospectively to include the devastating 2024/25 wet season.\n\nBut some producers said the criteria still unfairly disadvantaged off-farm jobs.\n\nRisky business\n\nHarvesting contractor Luke Roveda bought land two years ago to start a farm near Ingham, north of Townsville.\n\n\"That's always a big thing, spending money,\" he said.\n\n\"Hopefully the future is there for me and then the next generation,\" he said.\n\n\"My son hopefully can take it on.\n\n\"The cane harvester [business] complements the farm as well.\"\n\nRelentless rain and flooding in February battered the region, damaging homes and tearing up cane farms.\n\nRecovery grants can be used to help repair flood damage. (ABC News: Brooke Tindall)\n\nMr Roveda lost roads, culverts and the crop, but he was not eligible for disaster recovery assistance.\n\n\"I haven't really worked it out [the cost] because honestly we weren't eligible for anything,\" he said.\n\n\" We just sort of pushed stuff to the side and carried on. \"\n\nChanges to the joint Commonwealth-State Disaster Recovery Funding Arrangements (DRFA) now mean Mr Roveda can apply.\n\nQueensland will consider income from agricultural support services such as harvesting and mustering as primary production income.\n\nMinister for Primary Industries, Tony Perrett, said it would also help those working off-farm who had a plan to grow their operation.\n\n\"We know disaster events don't discriminate ... and that announcement will capture the three flood events that we've had this year,\" he said.\n\nIt means Mr Roveda can get started on his repairs.\n\n\"It's not easy buying a farm and off-farm income is needed for a young feller, for anyone really,\" he said.\n\n\"Having this assistance we can fix stuff up and put it back to where it needs to be.\"\n\nDefining a farmer\n\nCanegrowers chief executive Dan Galligan said the narrow definition was out of date.\n\n\"Earlier this year, I stood in front of a group of around 120 farmers in Ingham talking about disaster recovery assistance, and probably half of those farmers were ineligible 10 minutes into the meeting,\" he said.\n\n\"And that's because they had modern businesses, growing business, and they had off-farm income.\"\n\nDan Galligan is welcoming the changes to disaster relief eligibility. (Supplied: Canegrowers)\n\nThe definition of a primary producer used by the DRFA comes from a classification developed by the Australian Bureau of Statistics.\n\nEach state and territory government then sets its own rules within that classification.\n\nQueensland opted to exclude agriculture, forestry and fishing support services.\n\nFarm lobby group AgForce chief executive Michael Guerin said the policy adjustment was significant.\n\n\"Policy settings traditionally have just assumed that primary producers are primary producers full-stop,\" he said.\n\n\"But we know the industry is changing fundamentally, we know that young people need off-farm income to build deposits to buy land.\n\n\"We know existing farming families need off-farm income to support their enterprise through droughts and floods.\"\n\nFlooding destroyed the Hollidays' farm road twice. (Supplied: Nick Holliday)\n\nQueensland Rural and Industry Development Authority (QRIDA), which administers the funding, said regulatory amendments were required to formalise the change, but once that was done, those who had been denied a grant in 2025 could reapply.\n\nMissed opportunity\n\nThe changes have disappointed Nick Holliday, who produces pasture-raised eggs, pork and beef in the South Burnett.\n\nIn 2022, he successfully appealed a ruling that his operation was not eligible for disaster recovery assistance to repair roads, fences and landslips caused by flooding.\n\n\"I was really excited to hear that there were changes to these provisions because they were in desperate need of review, but almost immediately I was disappointed,\" Mr Holliday said.\n\n\"This is a real missed opportunity that gives different statuses to different jobs in rural communities.\"\n\nNick Holliday says disaster funding should be assessed on need, not off-farm professions. (ABC Rural: Jennifer Nichols)\n\nHe said other government agencies used broader definitions that considered more than where off-farm income came from.\n\n\"It's an oddity that a person could satisfy government that they're a primary producer for tax or vehicle registration purposes, but not to qualify for essential assistance in a natural disaster,\" he said.\n\nPremier David Crisafulli said the state government was open to further discussion.\n\n\"Those changes do enable farmers to be able to show that that they have a plan in place,\" he said.\n\n\"But if more needs to be done, we'll continue to take that case forward.\"\n\nQueensland Farmers' Federation chief executive Jo Sheppard said the industry had been advocating for the change for more than a decade.\n\nJo Sheppard is welcoming changes to the definition of a primary producer. (Supplied: Jo Sheppard)\n\n\"We're seeing farmers across the state diversify to maintain their future viability and profitability whilst maintaining agriculture as their core enterprise function,\" she said.\n\n\"It's really important that these farmers aren't disadvantaged and are supported during times of disaster.\n\n\"We all need farmers to keep farming … it's really important not just for the sector but the regional communities and for consumers.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/trump-steel-tariffs-double-to-50-per-cent/105361374",
    "title": "Trump says he plans to double steel tariffs to 50pc",
    "publish_date": "Fri, 30 May 2025 22:35:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "US President Donald Trump says he plans to increase tariffs on foreign steel imports from 25 per cent to 50 per cent amid a deepening trade war.\n\n\"We are going to be imposing a 25 per cent increase,\" he said at a rally in Pennsylvania on Friday local time.\n\n\"We're going to bring it from 25 per cent to 50 per cent the tariffs on steel into the United States of America, which will even further secure the steel industry in the United States.\"\n\nThe doubling of steel levies — to take effect on June 4 — could further push up prices for a metal used in housing, vehicles, and other goods.\n\nThe price of steel products has increased around 16 per cent since Trump became president, according to the US government’s producer price index.\n\nUS President Donald Trump plans to double steel tariffs. (AP: David Dermer)\n\n'Economic self-harm'\n\nIn February, Trump raised steel and aluminium tariffs to a flat 25 per cent \"without exceptions or exemptions\" in one of his first moves to aid the struggling industries.\n\nThe tariffs would apply to millions of tonnes of steel and aluminium imports from Australia, Canada, Brazil, Mexico and other countries that had been entering the US duty-free.\n\nMinister for Trade and Tourism Don Farrell said Australia's position has been consistent and clear.\n\n\"These tariffs are unjustified and not the act of a friend,\" Mr Farrell said.\n\n\"They are an act of economic self-harm that will only hurt consumers and businesses who rely on free and fair trade.\n\nPresident Donald Trump at US Steel Corporation. (Reuters: Leah Millis)\n\nUS 'not a major market', says economist\n\nJustin Wolfers, Professor of Public Policy and Economics at the University of Michigan, said the increase would affect Australia \"remarkably little\".\n\n\"Australians are still going to be able to sell their steel,\" Dr Wolfers said.\n\n\"Basically, on both the production side and the consumption side, the US is a relatively small player.\n\n\"We will sell a little bit less steel to the United States but, as it stands, it's not a major market.\"\n\nThe professor said Australians will still be able to sell their steel. (ABC Riverina: Andrew Mangelsdorf)\n\nMr Trump said US Steel would stay an American company under a deal for Japan-based Nippon to invest in the iconic American steelmaker.\n\nThough Trump initially vowed to block the Japanese steelmaker's bid to buy Pittsburgh-based Steel, he changed course and announced an agreement last week for what he described as \"partial ownership\" by Nippon.\n\nIt is unclear if the deal his administration helped broker has been finalised or how ownership will be structured.\n\nFew details about the deal have been made public.\n\nTrump stressed the deal would maintain American control of the storied company, which is seen as both a political symbol and an important matter for the country's supply chain, industries like auto manufacturing, and national security.\n\nGiant American flags hung from the ceiling, and a sign read: \"The Golden Age\".\n\nTrump's lost control of his tariffs see-saw Photo shows Donald Trump points. Since Trump's \"Liberation Day\" tariffs were announced, they have been changing constantly. But does the escalating court battle to implement them give the president an off-ramp to soften his second-term trade agenda without facing political fallout?\n\nTrump farewells black-eyed Musk\n\nThe announcement on steel tariffs comes on the same day Mr Trump bid farewell to Elon Musk in the Oval Office, providing a cordial conclusion to a tumultuous tenure for the billionaire entrepreneur.\n\nMr Musk is leaving his position spearheading the Department of Government Efficiency and will be rededicating himself to running his businesses, including Tesla, rocket company SpaceX, and social media platform X.\n\nMr Trump credited Mr Musk with \"a colossal change in the old ways of doing business in Washington\" and said some of his staff would remain in the administration.\n\nMr Musk says he received the black eye at the hands of his son, X Æ A-12. (Reuters: Nathan Howard)\n\nMusk, who wore all black, including a T-shirt that said \"The Dogefather\", and had a black eye, which he said came from \"horsing around\" with his young son.\n\n\"I said, go ahead, punch me in the face,\" he said. \"And he did.\"\n\nThe president said Mr Musk had led the \"most sweeping and consequential government reform effort in generations\".\n\nHe also suggested that Mr Musk is \"really not leaving\" and \"he's going to be back and forth\" to keep tabs on what's happening in the administration.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/taylor-swift-buys-back-rights-to-music/105361300",
    "title": "Taylor Swift buys back rights to her music",
    "publish_date": "Fri, 30 May 2025 21:53:19 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Taylor Swift has bought back the master recordings of her first six albums, regaining control of all her music after a dispute with her former record label.\n\nIn a post on her website on Friday, Swift announced: \"All of the music I've ever made now belongs to me.\"\n\nThe pop star said she purchased her catalogue of recordings — originally released through Big Machine Records — from their most recent owner, the private equity firm Shamrock Capital.\n\nShe did not disclose the amount.\n\nThe singer's master recordings had been sold in 2019 by Hybe America CEO Scooter Braun, and the pop star said she was not given the opportunity to buy them at the time.\n\nTaylor Swift says she now owns her life's body of work. (Getty Images: Andreas Rentz for TAS Rights Management)\n\nShe rerecorded four of the albums with the subtitle \"Taylor's Version\".\n\nSwift's rerecordings represent her effort to control her own songs and how they are used, a trend many musicians have been emboldened to follow.\n\nIn April, Australian musician Pete Murray announced on social media that he was releasing a new version of Better Days (Pete's Version), and that he was now an independent artist, rather than signed to a label.\n\nWhy artists are 'pulling a Swiftie' Photo shows A white man with brown hair in his 40s holding a guitar to the audience When Taylor Swift announced in 2019 that she was re-recording her previous works, musician Pete Murray was shown a way to reclaim his legacy.\n\n\"Taylor did it and I was thinking, 'Wow, that's how you do it,'\" Murray said.\n\nSwift's purchase includes videos, concert films, art, photography and unreleased materials, which are now under her control.\n\n\"I can't thank you enough for helping to reunite me with this art that I have dedicated my life to, but have never owned until now,\" Swift addressed fans in the post.\n\n\" The best things that have ever been mine … finally actually are. \"\n\nTaylor Swift rerecorded four albums in 2021. (Reuters: Christine Olsson/TT News Agency)\n\nFans have theorised that Reputation (Taylor's Version) would be the next album the singer will rerecord.\n\nBut according to the note shared on Friday, Swift said she had not \"even rerecorded a quarter of it\".\n\nThe singer announced that she had completely rerecorded her self-titled debut album, \"and I really love how it sounds now\".\n\nSwift wrote that both her self-titled debut and Reputation (Taylor's Version), \"can still have their moments to re-emerge when the time is right\".\n\nRepresentatives for Swift and HYBE did not immediately respond to a request for comment.\n\nAP/Reuters",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/alexei-popyrin-makes-fourth-round-of-french-open/105361320",
    "title": "Alexei Popyrin makes fourth round of French Open with straight-sets win",
    "publish_date": "Fri, 30 May 2025 21:50:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "Alexei Popyrin says he couldn't have imagined he'd end up as the last Aussie man standing at the French Open — but he's determined to keep the flag flying high after ensuring there would be no depressing hangover following Alex de Minaur's shock exit.\n\nOn a roasting Friday in Paris, the country's No.2 player got hot on the Court 14 furnace in which de Minaur's hopes had crashed and burned the previous day, downing doughty Portuguese Nuno Borges 6-4 7-6 (13-11) 7-6 (7-5) to reach the last 16 without having yet dropped a set.\n\n\"We all expected Demon to be in the fourth round,\" admitted Popyrin, when asked if he'd have thought at the start of the week he'd be the final men's survivor.\n\n\"I don't think I could have thought that — Alex is probably the most consistent player on tour — but that's the case now. I'm only focusing on myself. I want to keep going as far as I can, that's all I'm thinking.\"\n\nAnd there's no reason that couldn't be very far.\n\nLast year Popyrin reached the last 16 in the US Open, but now he has the chance to go even further in a slam as he faces American iron man, 12th seed Tommy Paul, who outlasted Karen Khachanov 6-3 3-6 7-6 (9-7) 3-6 6-3.\n\nAnd though Popyrin may have made harder work of his win than he would have liked, the 25th seed still felt it was a major boon to have got the job done in three straight in three hours, while Paul was slogging for 4 hours 7 minutes after another five-set slog in the first round, which had lasted 3:38.\n\n\"It was a really good match from my point. Happy I wrapped it up in three sets. It's really hot out there, really difficult conditions,\" Popyrin said.\n\n\"I played the first set-and-a-half really, really solid, how I've been playing all week, had a bit of a mental slip-up at the end of the second, but managed to dig deep in the tiebreak.\n\n\"The third set was more a mental battle than a physical battle on my side trying to hold serve, and then trying to get opportunities on his return, which I had towards the end. But still managed to kind of keep my head and still play well in the tiebreak.\"\n\nPopyrin now joins an elite group of his compatriots to have made it this far on the Paris clay since the turn of the millennium alongside Mark Philippoussis (2000), Wayne Arthurs (2001), Lleyton Hewitt (2000-02, 2004, 2006-07) and Alex de Minaur (2024).\n\nThe court's hardening and speeding up in the sunshine certainly suited his big serving as Popyrin dropped just three points on his delivery in the opening set, but he had a bit of an aberration near the end of the second.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe squandered a set point at 3-5 and twice served for the set only to deliver a couple of error-prone games — the only times he was broken in the match.\n\nEventually, he needed plenty of resolve in a dog-fight of a tiebreak, saving a couple of set points and having four more of his own repelled before the Portuguese finally crashed a backhand long.\n\nPopyrin's relief was palpable.\n\n\"It was very important. One set all is a completely different ball game,\" he said.\n\nHis serve was in formidable nick, generally. His 13 aces and 80 per cent success rate on his first delivery suggest he's going to be hard work for Paul to subdue.\n\n\"He played unbelievable tennis there (in the Canadian Open last year). That's what he's capable of. He can take the racquet out of your hand sometimes,\" the American said.\n\n\"Hopefully, I can use the clay to my advantage and kind of slow things down a little bit.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/greater-bendigo-reacts-to-fosterville-gold-mine-expansion/105353264",
    "title": "Is Victoria's largest gold mine a good corporate citizen or bad neighbour?",
    "publish_date": "Fri, 30 May 2025 21:45:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Depending on who you speak to, Victoria's largest gold mine is either a good corporate citizen or a bad neighbour.\n\nFosterville Gold Mine, 20 kilometres east of Bendigo, is one step closer to expanding its operations after the state government gave the green light to a proposed expansion last week.\n\nParent company Agnico Eagle said the expansion would future-proof the mine for the next decade and support 1,000 jobs.\n\nFosterville plans to extend underground operations and infrastructure it needs to keep mining for at least another 10 years. (Facebook)\n\nThe Bendigo region has come to rely on the mine, not just for employment but for the $2 million it has returned to the community through sponsorships, donations and grants.\n\nBut the expansion has split opinion in the town.\n\nSome nearby residents and environmental advocates say they feel shocked and let down, while others are thrilled the mine will remain a fixture in the region.\n\nAnd now all eyes are on the Commonwealth to find out whether it will give the final tick of approval required for the mine's expansion to proceed.\n\nPlea to the premier\n\nResidents and environmental advocates oppose the mine's expansion with fears for the health of the Campaspe River. (ABC News: Anna McGuinness)\n\nHydrologist Phillip Macumber said he felt hopeful after meeting with Victorian Premier Jacinta Allan, but was left shocked when her government approved Fosterville's expansion days later.\n\nDr Macumber reviewed the mine's plans for the Save the Campaspe lobby group and was less than impressed.\n\n\"It runs counter to everything I've done and known in my hydrogeological experience over the last 50 years,\" he said.\n\n\"The present way they're operating [the mine] is contaminating the river, I've got no question in my own mind, with arsenic and antimony.\n\n\"What makes it so frustrating is it's so blatantly obvious, but where are the people stepping up? Standing up?\n\n\"Not in government. They don't appear to be.\"\n\nThe mine says the expansion will boost the local economy by $1.3 billion over 10 years. (Supplied)\n\nVictoria's Environment Protection Authority (EPA) has raised concerns about the mine's groundwater modelling and monitoring, concerns backed by Planning Minister Sonya Kilkenny.\n\nThe minister ultimately deemed the mine's groundwater impacts acceptable if mitigation measures were properly carried out.\n\nA Fosterville Gold Mine spokesperson said the environmental effects statement (EES) was a rigorous, transparent process that gave all stakeholders, including Dr Macumber, a chance to be heard.\n\nPutting profits first\n\nCommunity group Save the Campaspe said the Victorian government had dismissed the concerns by approving the expansion.\n\n\"There's no doubt this mine expansion will negatively impact our families, homes and the Campaspe River,\" the group said.\n\n\" This decision is shocking and deeply unjust, sending a troubling message to our children about what we value. \"\n\nThe mine's EES revealed the expansion would result in habitat loss for several threatened species including the critically endangered swift parrot, and vulnerable ecosystems such as box ironbark forest.\n\nVictorian planning minister Sonya Kilkenny has given the mine's expansion the green light. (ABC News)\n\nThe planning minister's assessment found that potential impacts could be acceptably managed, provided that strengthened environmental management practices and amended mitigation measures were adopted.\n\n\"We're making sure safeguards are in place to protect the environment while also creating more jobs and boosting Bendigo's economy,\" she said.\n\nVictorian National Parks Association conservation campaigner Ben Gill said the approval ignored expert environmental advice.\n\n\"It feels like profits are being put ahead of science, environment, and community wellbeing,\" Mr Gill said.\n\nA Victorian government spokesperson said the EES was a \"robust and transparent\" process.\n\n\"[It gives the] community confidence that projects balance the needs of communities, environmental protection and economic growth,\" the spokesperson said.\n\nSupport 'paramount' for community\n\nOn the other side of the fence are a number of workers, their families, and community groups that support and rely on the mine.\n\nFosterville is one of the highest-grade gold mining operations in the world and the largest gold producer in the state, according to the Victorian government.\n\nBendigo real estate agent Brad Hinton is on the committee for Bendigo's Biggest Ever Blokes Lunch, a prostate cancer fundraising event.\n\nHe said the committee was \"ecstatic\" the mine, a major sponsor, was a step closer to another 10 years of operation.\n\n\"It's paramount I think as a community to have such large contributors and we are very, very pleased that they've been given the green light,\" Mr Hinton said.\n\nThe mine is a major sponsor of Bendigo's Biggest Ever Blokes Lunch. (Supplied: AJ Taylor)\n\nMr Hinton said it was rare for the mine not to be on board supporting events, sporting clubs or charitable efforts in the community.\n\nFosterville Gold Mine said it had invested more than $2 million across sponsorships, donations, scholarships and community grants in Greater Bendigo.\n\nAgnico Eagle Australian operations vice-president Ion Hann said the state government's endorsement would allow that support to continue.\n\nFosterville Gold Mine supports sport and community groups in the Bendigo region. (ABC News: Anna McGuinness)\n\n\"We're grateful for the engagement throughout the EES process and remain committed to responsible mining and transparent communication,\" Mr Hann said.\n\nThe state government said the expansion would deliver a $1.3 billion boost to the Bendigo region over the next decade.\n\nAfter receiving state government approval the mine's plans will need to receive mining and EPA approvals, as well as approval from the Commonwealth government.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/libraries-offer-safe-space-and-inclusion-in-regional-communities/105312932",
    "title": "How libraries are 'the glitter glue' binding communities together",
    "publish_date": "Fri, 30 May 2025 21:28:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "From tiny sheds in outback towns to state-of-the-art facilities on the urban fringe, libraries are evolving to become the ultimate third space, offering a \"community living room\" to people who need it most.\n\nAcross the country, there are more than 1,400 public library branches, on top of those run by schools, universities, and private community groups, mobile book vans and a burgeoning network of street libraries.\n\nOffering up all manner of literature, internet access and everything from craft clubs and citizen science corners to \"seed libraries\" and storytelling dogs — for free — they're an essential public space, perhaps especially in regional and remote Australia.\n\nIn the rural locality of Julatten in Far North Queensland, it's the community that owns and runs the library, a single room stacked full of books, board games and local history.\n\nIt's been operating this way since around 1952, when its eponymous founder, Edna Head, rustled up enough support to build a dedicated space for readers.\n\nThe original Julatten library was built by Bill and Edna Head in 1952, after they moved to the area and raised funds to establish a library service for the community. (Supplied: Julatten Edna Head Library)\n\n\"Julatten is quite an unusual place,\" explains Lindsay Fisher, the library's vice-president and local historian.\n\n\"From one end to the other is over 20km … and basically all of [the properties] are on five-acre blocks, so it's very spread out.\n\n\"Back in those days, it was very isolated. And in the early 50s, people didn't go travelling much … so having these books made a big difference, especially for the women.\"\n\nMore than 70 years later, Julatten remains somewhat remote — about half an hour's drive from the nearest supermarket — and the library is at the heart of the community.\n\n\"We have a keypad on the door so once you join, you get a number and you can go whenever you want — it's not a matter of when it's open or anything,\" Ms Fisher says.\n\nThe Julatten Edna Head Library allows members to enter the library whenever they please. (Supplied: Julatten Edna Head Library)\n\nThe library charges $7 for an annual membership, and receives about $1,500 a year from the Mareeba Shire Council, which they use to update their collection. But for many members, it's about more than just books.\n\nCommittee president Bianca Velder, who moved to the area in 2024, sees the library as \"a bit of a glue — or glitter, depending on the craft activity of the day\".\n\n\"Books really do bind, in more ways than one. They open doors, start conversations, and make us feel part of something bigger,\" she says.\n\n\"There's definitely a safe-haven component … if I remember back to my childhood, books were my solace — you know, you travel through books and it's a really safe place to be.\"\n\nThe library as a third space 'for everyone'\n\nThis idea of the library as a place of safety and community is a common thread in research around the value of public libraries across rural Australia.\n\nIn towns with little more than a pub and a post office on the main street, libraries are often \"the mainstay\", according to Griffith University researcher Amber Marshall.\n\nDr Marshall, alongside Charles Sturt University's Philip Hider and Simon Wakeling, will head out to regional libraries across Australia from the end of this year to conduct a long-term qualitative study. (Supplied: Griffith University)\n\nDr Marshall, whose work focuses on digital inclusion and rural development, recently co-authored a report on a survey of more than 100 Australian librarians in outer regional and remote communities.\n\nIt found rural libraries are \"especially valued by their communities\", and seen as \"a key facilitator of social inclusion and interaction\".\n\n\"The role of the library can be quite dramatically different depending on where you go and what the characteristics of the community are,\" Dr Marshall says.\n\n\"I guess the smaller the community, the fewer places there are for people to meet. In the more extreme cases, it really is only the pub … there are sporting facilities as well, but that's not for everyone either.\n\n\" The library is for everyone. No matter what your interests are, no matter how old you are, no matter where you come from, you're welcome there. \"\n\nAt the Shellharbour City Libraries on the NSW south coast, engaging the young and old is a key focus for children's and youth librarian Kellie John.\n\nShe says with the cost of child care and daily living expenses rising, parents are increasingly looking to free services in the library — bookings for toddler story time are through the roof.\n\nThe Shellharbour City Libraries run weekly story time sessions for babies, toddlers and young children. (Supplied: Shellharbour City Libraries)\n\n\"We're booking study rooms out for prams to have space in the library to fit everyone in,\" Ms John says.\n\nIt's not just Shellharbour — the most recent statistical report from the Australian Library and Information Association shows that borrowing and visitor figures have risen across the board since the lifting of COVID restrictions.\n\nOne of the regular sessions Ms John helps run is called Be Connected, an intergenerational program that pairs up older people with young readers, loosely based around the TV show Old People's Home For 4 Year Olds.\n\nThe idea is to ease loneliness among older folks and develop social skills in toddlers and younger children.\n\nBe Connected is based on a model similar to Old People's Home For 4 Year Olds, pairing up older library visitors with children. (Supplied: Shellharbour City Libraries)\n\nMs John, who has a background in social work, was drawn to libraries for their unique position to engage with people who may not have their own support networks.\n\n\"We might be the only person someone talks to all day,\" she says.\n\n\"We're here to meet the community need … We provide that third space, that technology, the access to information, social connection.\n\n\"Libraries, especially in the past few years, have moved into becoming [what we call] community living rooms. We want to especially target the demographics that need that assistance.\n\n\"When someone comes in, on the off chance that we can't help them with whatever they need, we're connecting them with the people that can.\"\n\nThe library also works with other community services to run Life Skills sessions, teaching foster kids and at-risk youth how to cook, how to access mental health support and other resources in the area.\n\nAnd of course, there's Ollie, the six-year-old therapy dog who dutifully reports for story time sessions and library events along with her handler, Judy Sandilands-Cincotta.\n\nTherapy dog Ollie recently celebrated her sixth birthday with library visitors and staff, including Kellie John (left). (Supplied: Shellharbour City Libraries)\n\nUpskilling communities for the future and archiving the past\n\nAs the community's needs have changed, so too has the role of a librarian. It's a trend that Dr Marshall says is demonstrated across the country.\n\n\"There's this kind of real onus on libraries to, in a sense, be all things to all people. If you're in a very small town where there's been a withdrawal of services, there's really nowhere else to go,\" she says.\n\nIn some cases, it's seen libraries employing dedicated specialists like social workers on a full-time basis.\n\nHow libraries are incognito safe spaces for those in need Photo shows A tall, blonde white woman standing outside a building that says library and a sign that says come in Libraries are serving as a first port of call for people experiencing domestic violence or finding a safe place during an emergency.\n\nFor the most part, it means librarians are constantly upskilling to meet those needs. Digital literacy is a prime example — the 2024 survey noted IT support was the most common service on offer at libraries across the board.\n\nIn remote areas, where people often travel hundreds of kilometres to visit the library, outreach services are crucial.\n\n\"Any time there's new technology that comes out, new phones or new software, whatever, we really are that first port of call for our communities,\" says Jacinta Ward, a library services coordinator in south-west Queensland.\n\nMs Ward helps manage nine branches across the Western Downs Regional Council — an area almost the size of Switzerland. Digital inclusion is a big focus.\n\n\"[In some communities], if people don't have access to internet at the library, then they don't get access to it at all. That's it, that's their only connection to the internet,\" Ms Ward says.\n\nThe libraries also play a key role in preserving and celebrating local history through the Picture Western Downs collection. The growing archive is maintained by library staff, with help from community members who are encouraged to fill in the gaps about \"mystery images\".\n\nEngaging with the community is key, whether it's through the weekly crochet club or the annual Words Out West festival, Ms Ward's pride and joy.\n\nEach year, the festival invites authors and readers to come together for a week of writers' workshops and bookish events, hosted in the Western Downs.\n\n\"We've got Schooners and Stories, which we call our Trojan Horse to get the big burly men that typically wouldn't go to a writers' festival,\" she says.\n\nBut the highlight, Ms Ward says, are the school days in Dalby and Chinchilla, which this year brought more than 2,500 students together to learn about storytelling.\n\n\"We have buses from these teeny tiny schools that just put their five students on the bus … those kids would never be able to access anything like that out here if it wasn't for Words Out West,\" she says.\n\nOne of the events part of the Words Out West school day in Chinchilla, 2024, hosted by Western Downs libraries. (Supplied: Western Downs Libraries)\n\nThe challenge of funding rural libraries\n\nThis kind of value is tricky to measure, according to Dr Marshall.\n\n\"One of the challenges in collecting information about the role of libraries and their importance is that it's often measured in terms of bums on seats — a number of people interacted with,\" she says.\n\nHow libraries thrive in the digital age Photo shows A middle aged man wearing glasses and a patterned shirt stands among shelves of books in a library. Chris Jones has spent 35 years working in libraries and remembers being warned in the 1980s — just as the internet was emerging — that libraries would be \"dead in five years\".\n\n\"But that doesn't really capture the transformative impact that libraries can have for individuals. So even if a librarian has to travel a couple of hundred kilometres to an outreach area, and there are only five people there, that can be so important to the lives of those five people.\n\n\"It really makes it difficult for decision making … around resourcing. Because if you're just looking at the numbers, you're not really seeing the impact, especially in relation to urban libraries.\"\n\nThe ALIA statistical report shows that despite an increase in usage, per-capita funding for public library services has actually decreased when adjusted for inflation.\n\n\"That public libraries have still managed to expand physical and digital collections, program offerings, wi-fi access, local history collections, bookable meeting rooms… despite [funding] decreases shows the innovation of public libraries,\" it states.\n\n\"However with increasing usage and community reliance on public library services, further real decreases in funding may result in decreased services for the community.\"\n\nA 2024 paper commissioned by non-profit group Friends of Libraries Australia also found rural and remote communities were particularly disadvantaged by funding models based around spending per capita.\n\nMs Ward says distance does present a challenge when planning workshops and events with authors and other keynote speakers or presenters.\n\n\"There's definitely a cost. You’re not only paying for travel time and fuel, you've [also] got accommodation costs on top because they’re staying in the region for so long. It certainly adds up,\" she says.\n\n\"[But] we've got a very talented pool of staff who always step up to the plate … And I think that's what I love about libraries. We just make it work.\"\n\nOne of the events for Words Out West, 2025, hosted by Western Downs Libraries. (Supplied: Western Downs Libraries)\n\nIt's an attitude shared by the volunteers in Julatten, too.\n\nMs Velder has big dreams to turn the library into an adaptive learning hub that provides internet connectivity, digital services and perhaps even co-working space — they just need a few more members.\n\n\"A lot of people think that libraries are a thing of the past … I don't necessarily believe that that's true. There's nothing like holding a book in your hand and sitting down with a cup of tea and a biscuit,\" she says.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-31/lung-foundation-calls-for-supermarket-tobacco-ban/105348498",
    "title": "Ex-smoker backs push to ban tobacco sales at supermarkets",
    "publish_date": "Fri, 30 May 2025 21:12:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sarah Waters tried her first cigarette at 11-years-old, pinched from her dad's packet.\n\nBy 13, she was smoking regularly, and within a few months, she was addicted.\n\n\"When I started smoking, there was no information about the dangers,\" she said.\n\n\"It was actually advertised in teenage magazines … all the movie stars, models had them. It was cool, it was prestigious.\"\n\nSarah Waters had her first cigarette at 11. (Supplied: Sarah Waters)\n\nMs Waters said she tried everything, but when cigarettes were so easy to get a hold of — in supermarkets, corner stores, service stations and at tobacconists — the temptation was hard to deny.\n\nIt's this reason why the Lung Foundation is calling for a crackdown.\n\nBid for supermarket ban\n\nThe foundation wants the sale of cigarettes and tobacco products banned from major supermarkets.\n\nLung Foundation Australia chief executive Mark Brooke said accessibility is one of the major reasons people continue to smoke.\n\n\"By removing as many of those points of sale or limiting those points of sale, is a really important part of the solution. It's not the solution, but it's an important part of the solution,\" Mr Brooke said.\n\n\" Putting profit ahead of the community's health is something that the foundation is asking all good corporate citizens to reconsider. \"\n\nIt took Sarah Waters 27 years to give up smoking. (Supplied: Sarah Waters)\n\nMs Waters said she backed any measure that could deter people from continuing to smoke or take it up.\n\n\"If you are at the shops and they are there you can just say, 'It will be my last packet,'\" she said. \"If it is not there then I think it would be the extra barrier to help someone quit.\"\n\nMark Brooke says it's time to clamp down on access of cigarettes and tobacco products. (ABC News: Michael Lloyd)\n\nMr Brooke said smoking rates nationwide have decreased dramatically — only about 10 per cent of the population now smokes.\n\nBut he said the time to clamp down was now, with an explosion in the number of venues selling cigarettes and tobacco products.\n\n\"Some of those are operating illegally, but some of those also have licenses,\" he said.\n\n$20m of illegal cigarettes and vapes seized\n\nResearchers said the fear that restricting access to cigarettes could feed the booming illegal tobacco trade in Australia was \"real\" but would likely only affect those who were already suffering from addiction.\n\n\"As a prevention tactic, I think it's a fantastic idea,\" Griffith University marketing research fellow James Durl said.\n\n\" The idea of a tactic like this is to keep it out of sight and out of hands of people who haven't started smoking. \"\n\nHealth authorities seized an estimated $20.8 million worth of illegal cigarettes and vapes in Queensland. (Supplied: Queensland Health)\n\nIn Queensland this month, health authorities seized illegal cigarettes and vapes with an estimated street value of about $20.8 million, in what it's calling its biggest raids in history.\n\n\"It's only going to affect those people who were smoking for starters,\" Dr Durl said.\n\n\"For those people who are smoking, and are desperately looking for a cigarette, and they have to go to a different place, I think as long as it's still legal and you're able to get it from say, a tobacconist specifically, [people won't necessarily turn to illegal operators].\"\n\nJames Durl says restricting access is a small step in the decades-long fight to stamp out tobacco use. (ABC News: Michael Lloyd)\n\nDr Durl said restricting access is just a small step in the decades-long fight to stamp out tobacco use.\n\n\"This isn't talking about a ban — they're not becoming illegal,\" he said.\n\n\"[This idea is] just trying to put a delay, a buffer, between the urge to have a smoke and the actual purchasing of a smoke.\"\n\nIllegal cigarettes confiscated by Queensland Police during a $20 million vape and tobacco bust. (Supplied: Queensland Health)\n\nFederal Health Minister Mark Butler said the government passed laws in 2023 to \"reignite the fight\" against tobacco.\n\n\"Under the Tobacco Act, a range of new graphic health warnings, health promotion inserts, and on-product health messages have been developed.\n\n\"They have been informed by research and improved during rounds of market testing with smokers, to ensure they are effective, have impact and maximise engagement.\"\n\nMark Butler says the federal government has taken action to \"re-ignite the fight\" against tobacco. (ABC News: Kate Nickels)\n\nMr Butler did not comment on whether his government would support banning major supermarkets from selling cigarettes\n\nIn a statement, Coles said it complied with all legislation around minimising the health impacts of tobacco use, \"however we recognise the need to provide choice to those customers who wish to purchase these products legally\".\n\nWoolworths was contacted for comment but did not reply by deadline.\n\n'Don't give up' on calling quits\n\nAfter 27 years of attempts, Sarah Waters finally found her reason to quit. Like many, it was her health that was the final straw.\n\n\"I couldn't enjoy life, like every time I laughed, I'd go into a coughing fit. It became anti-social, and it got really expensive as well,\" she said.\n\nLoading...\n\nIt's been 11 years since her last cigarette. Now she spends the money she saves on them on overseas holidays.\n\nHer advice to those wanting to quit is not to give up.\n\n\"I tried patches, I tried gum, I tried hypnosis, I tried several different types of medication, I tried cold turkey, I tried fad exercise diets, and I finally found the thing that worked for me which was a medication prescribed from the doctor,\" Ms Waters said.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/knights-prop-reported-for-crusher-tackle-20250531-p5m3rj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Knights prop reported for crusher tackle",
    "publish_date": "Sat, 31 May 2025 10:35:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Knights prop reported for crusher tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/wait-for-the-siuuu-what-melbourne-city-s-captain-learnt-from-cristiano-ronaldo-20250528-p5m30l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wait for the ‘Siuuu’: What Melbourne City’s captain learnt from Cristiano Ronaldo",
    "publish_date": "Sat, 31 May 2025 10:01:41 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "“You obviously have to wait for him to do his celebration before you start celebrating with him but it was great, it was surreal,” Behich said with a smile. “I watched him when he was at Manchester United and I was a young guy - I followed him then. It’s something I will look back on. Lionel Messi tussles with Aziz Behich at the 2022 FIFA World Cup. Credit: Getty Images “In Turkey was where I played with a lot of players who had accomplished a lot,” Behich said. “The year we won the league [İstanbul Başakşehir, 2019-2020] we had players like Martin Skyrtel, Gael Clichy, Robinho and Demba Ba - I’ve been fortunate to share the changerooms with guys like that and then played against the likes of Lionel Messi and those sort of players for the Socceroos - you learn a lot about yourself as a footballer.\n\n“It gives you experience at a higher level. I’ve always been one to embrace challenges and test myself against the best in the world.” The charismatic veteran is now 34 and all his experiences help him set a stellar example for his relatively young team as they face the furnace of a sold out, pro-Victory crowd. But Behich’s whole football career reached its sliding doors moment when he was thrown onto the field for Victory in the 2009-2010 grand final against Sydney FC at a bursting Marvel Stadium. Victory’s Aziz Behich misses a golden opportunity to score as Clint Bolton in the 2010 A-League grand final. Credit: Vince Caligiuri Behich was a skinny teenager on a youth team contract who played as a speedy winger. In the final minutes of normal time with scores tied 1-1, he had a header close to goal which was saved by the keeper.\n\nSydney went on win on penalties 4-1 and Behich was let go with the newly formed Melbourne Heart, City’s old name, signing him for its inaugural season, a move that launched his career. “One thing my parents always told me is when one door closes, another door opens, and after that night, that door closed but I got an opportunity for Melbourne Heart,” Behich said. “The rest is history.” Does he ever think about what might have happened if he scored and became a Victory legend? “It could have gone in and my career could have been on a different path but I couldn’t be more grateful for the journey I’ve had so far,” Behich said.\n\nIt was in that first Heart season that then coach John van’t Schip moved Behich to left-back where he has ascended to 75 Socceroos caps, an Asia Cup win in 2015, two World Cups and a decade of club football in Europe - he’s still a regular with the Socceroos as well. That move was made without warning when Heart lost veteran left-back Dean Heffernan to suspension before the first Melbourne Derby, so Behich was thrown into the role and never looked back. Aziz Behich playing for Melbourne Heart in 2011. Credit: Vince Caligiuri “I had never played there but John said he saw the type of player I was and knew I would do well there, so go enjoy it,” Behich recalled. “We ended up winning that first derby and I got stuck there so I got to give credit to John who I like dearly - he played a big part in my career and development.”\n\nBehich has become a respected figure at City and within the Socceroos and his captaincy has been praised by City coach Aurelio Vidmar this season. “I certainly felt that while we’ve got some strong leaders at the club, the only one who could do the job we’d expect would be Aziz,” Vidmar said. “We certainly missed him the last six months of last season and he’s been instrumental, he’s been so important for us this season. Aziz Behich of Melbourne City, Melbourne City coach, Aurelio Vidmar, Head coach of the Victory, Arthur Diles and Roderick Miranda of the Victory pose with the trophy. Credit: Getty Images “Sometimes as a coach, it’s not easy to control the changeroom and he’s made my life easier because anything that happens or even prior to things happening, he’s already onto it, it’s like he can sense it.”",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/matildas-vs-argentina-live-young-tillies-face-test-against-argentina-at-marvel-stadium-20250530-p5m3i9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’ve got a taste for trophies now’: Matildas hunting Asian Cup glory",
    "publish_date": "Sat, 31 May 2025 10:00:29 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Brittany Busch"
    ],
    "text": "The magnitude of winning the UEFA Women’s Champions League is still sinking in for Arsenal and Matildas star Steph Catley, but two things have dawned on her.\n\nThe first is that she is living in the best times of her life, so far, and the second is that she can have this feeling again if she and the Matildas can find a way to win next year’s Women’s Asian Cup in Australia in March.\n\nMatildas star Steph Catley mixes with fans at Marvel Stadium on Friday night. Credit: Getty Images\n\nCatley and fellow Australian Gunners Caitlin Foord and Kyra Cooney-Cross only arrived in Melbourne on Wednesday night, and they were kept out of the Matildas 2-0 win over Argentina in front of 43,020 fans at Marvel Stadium on Friday night.\n\n“It’s something that I don’t think I will come down from for a very long time,” Catley said after the match.\n\n“It’s been a big few days. The biggest of my life and my career I would say. It’s something I’ve dreamed of and the pinnacle of football and being able to do it alongside my two Aussies and being part of Arsenal – it’s been very, very special and to celebrate it with the Tillies and all the girls has been lovely.”\n\nThe feeling of winning the title and the victory parade are experiences she will never forget. But when asked to look forward to next March, Catley wants to match the Matildas’s success in the 2010 edition in China.\n\n“It gives you a taste of what’s possible,” Catley said. “Being at a club like Arsenal, I always believed we were capable of doing it but actually doing it is a whole other thing and especially when you are up against a team like Barcelona – sometimes it feels quite far away.\n\n“To actually do it, it makes me think about my career and the things I really want to achieve and winning silverware with the Matildas has always been top of my list.\n\nCaitlin Foord, Steph Catley and Kyra Cooney-Cross arrived back in Melbourne on Wednesday night. Credit: Getty Images\n\n“I’ve got a taste for trophies now and the tournament is coming up very close so it’s good for the three of us to have a taste of that and be able to lead the hunt for success for our team.”\n\nMatildas defender Charli Grant said on Friday she was inspired by seeing her fellow Matildas win on such a huge stage, and Catley hopes that Arsenal’s win will inspire people around the world.\n\n“We still believe we can do something special,” Catley said. “You look at Charli tonight and she looks like she’s been in our team for a few years. We’re still finding gems like that and coming into a major tournament, you want to have depth and competition.\n\n“It’s nice to hear she feels that way and if we can inspire girls at any level in this country to go out and be a Matilda, that is what it’s all about.”\n\nShe and her European-based teammates hadn’t partied too hard after the win as the Australians had to hop on the plane while those playing in the Euro 2025 tournament in July went into camp with their national teams.\n\n“Getting on a plane to Australia is not the easiest way to go about it, but we celebrated how we felt and it was definitely fun, but we stopped soon enough,” Catley said.\n\n“We were smart. We were heading into camp and the European girls have got serious matches. We were not all silly about it.”\n\nMatildas coach Tom Sermanni joked that they had had their week off and would start against Argentina in Canberra on Monday night.\n\n“He hasn’t told me that yet,” Catley said. “I’ll be ready, and the girls will be ready.”",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/boxing/imane-khelif-banned-from-competing-in-womens-world-boxing-events-20250531-p5m3rb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Imane Khelif banned from competing in women’s World Boxing events",
    "publish_date": "Sat, 31 May 2025 09:39:44 +1000",
    "category": "sports",
    "authors": [
      "Oliver Brown"
    ],
    "text": "Imane Khelif, whose gold medal at last year’s Paris Olympics caused a global scandal, has been banned from competing in all future World Boxing events in the women’s category unless the Algerian can provide proof of being biologically female.\n\nIn a major development, World Boxing has bowed to intense pressure from campaigners for safety and fairness in women’s sport, many of whom had expressed outrage that Khelif was being allowed to compete again in the female division at next week’s Eindhoven World Cup in The Netherlands.\n\nThe international governing body announced that Khelif, who was disqualified from the 2023 World Championships after tests indicated the presence of male chromosomes, would need to pass mandatory sex screening to be deemed eligible.\n\nSo far, Khelif has not submitted to any such test in the nine months since a hugely controversial Olympic campaign, in which beaten Italian opponent Angela Carini said she had feared for her life.",
    "source": "SMH",
    "cluster_id": 8
  },
  {
    "url": "https://www.smh.com.au/national/nsw-severe-swell-20250531-p5m3re.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW severe swell",
    "publish_date": "Sat, 31 May 2025 09:35:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "NSW severe swell\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/belated-spotlight-on-popyrin-as-he-charges-into-last-16-at-roland-garros-20250530-p5m3qc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We all expected Demon to be in the fourth round’: Popyrin charges into last 16 at Roland-Garros",
    "publish_date": "Sat, 31 May 2025 09:25:07 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "“We all expected Demon to be in the fourth round,” admitted Popyrin, when asked if he’d have thought at the start of the week he’d be the final men’s survivor. “I don’t think I could have thought that – Alex is probably the most consistent player on tour – but that’s the case now. I’m only focusing on myself. I want to keep going as far as I can, that’s all I’m thinking. “It was a really good match from my point. Happy I wrapped it up in three sets. It’s really hot out there, really difficult conditions. “I played the first set-and-a-half really, really solid, how I’ve been playing all week, but had a bit of a mental slip-up at the end of the second but managed to dig deep in the tiebreak.\n\n“The third set was more a mental battle than a physical battle on my side trying to hold serve, and then trying to get opportunities on his return, which I had towards the end. But still managed to kind of keep my head and still play well in the tie-break.” Dressed in fluorescent pink hat, shorts and shoes, and with a racquet to match, Borges eliminated wounded dual finalist Casper Ruud in four sets in the previous round. He also advanced to the fourth round at the Australian Open and US Open last year, so is a serious player. Borges already made tennis history this fortnight with countryman and qualifier Henrique Rocha when they became the first two Portuguese players to reach the round of 32 at the same grand slam. But this day belonged to Popyrin, even as Borges launched rearguard action late in the second set to twice break back when the Australian tried to serve for a two-set lead. Popyrin had played an almost spotless match until he dropped serve on the first of those occasions, but then had to dig deep as Borges took fresh aim at his weaker backhand wing, which has been under construction from his new co-coach Wayne Ferreira.\n\nPopyrin’s other coach, Neville Godwin, who shared the job with Xavier Malisse until March when Malisse chose to part ways with Popyrin, was front and centre on Friday for one of the Australian’s most significant wins. It took 77 minutes and until Popyrin’s sixth set point – after saving two that Borges held – on the 24th point of an engrossing and rollercoaster tiebreak for him to finally earn that two-set advantage. Nuno Borges had chances against Popyrin, but was unable to win a set. Credit: Getty Images The tie-breaker result loomed large in the bigger picture of the match, but de Minaur’s slip-up from the same lead a day earlier, and Borges’ increasing ability to create opportunities in Popyrin’s service games, meant there was still work to do. With de Minaur’s mother Esther among those urging him on from courtside, Popyrin fended off a break point in each of his second and third service games in the third set as Borges tried to make his move.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/popyrin-focused-on-next-round-20250531-p5m3ra.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin focused on next round",
    "publish_date": "Sat, 31 May 2025 09:16:36 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin focused on next round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/world/north-america/trump-to-double-steel-tariffs-to-50-per-cent-20250531-p5m3r5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump says he will double steel, aluminium tariffs to 50 per cent",
    "publish_date": "Sat, 31 May 2025 09:10:25 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "“They are an act of economic self harm that will only hurt consumers and businesses who rely on free and fair trade. We will continue to engage and advocate strongly for the removal of the tariffs,” Farrell said. Australia exported $640 million worth of steel and $440 million of aluminium last year to the US. The cumulative $1 billion trade is a small amount compared to the nation’s total exports of $660 billion in the past financial year. Trade Minister Don Farrell says the US tariffs are “not the act of a friend”. Credit: Alex Ellinghausen The steel and aluminium tariffs were enacted under trade laws rather than emergency powers, and were not among those struck down by the decision of the Court of International Trade this week. However, those levies will remain in place while the government pursues an appeal that will almost certainly be decided by the Supreme Court. A federal appeals court agreed to temporarily preserve the tariffs – which include a 10 per cent levy on Australian goods – while the appeal is urgently held.\n\nIn February, Trump told Prime Minister Anthony Albanese he would consider giving Australia an exemption to the tariffs on steel and aluminium. Australia received a carve out during the first Trump administration. But the US president decided against giving any exemptions this time. Workers listen to Trump as he announced a plan to double tariffs on steel imports. Credit: AP Earlier on Friday, Trump also registered his frustration with China – which he accused of reneging on a tariff truce negotiated earlier this month – raising the prospect of additional import taxes. “China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US. So much for being Mr. NICE GUY!,” Trump said in a post on his Truth Social platform.\n\nSteel prices in the US have climbed 16 per cent since Trump became president in mid-January, according to the government’s Producer Price Index, and such a dramatic increase in steel tariffs could push prices even higher. In March 2025, steel cost $US984 ($1535) a metric tonne in the US, significantly more than the price in Europe ($1076) or China ($611), according to the US Commerce Department. The US produced about three times more steel than it imported last year, with Canada, Brazil, Mexico and South Korea being the largest sources of steel imports. Australia exported $640 million worth of steel to the United States last year. Credit: Louie Douvis While Trump initially vowed to block the Japanese steelmaker’s bid to buy US Steel, he reversed course and announced an agreement last week for what he described as “partial ownership” by Nippon. It’s unclear, though, if the deal his administration helped broker has been finalised or how ownership would be structured. Analysts have credited tariffs going back to Trump’s first term with helping strengthen the domestic steel industry, something that Nippon Steel wanted to capitalise on in its offer to buy US Steel.\n\nThe United Steelworkers union remained sceptical of Nippon’s planned investment. Loading Its president, David McCall, said in a statement that the union was most concerned “with the impact that this merger of US Steel into a foreign competitor will have on national security, our members and the communities where we live and work”. Trump stressed the deal would maintain American control of the storied company, which is seen as both a political symbol and an important matter for the country’s supply chain, industries such as car manufacturing and national security. Trump, who has been eager to strike deals and announce new investments in the US since retaking the White House, is also trying to satisfy voters, including blue-collar workers, who elected him as he called to protect American manufacturing.\n\nUS Steel has not publicly communicated any details of a revamped deal to investors. Nippon Steel issued a statement approving of the proposed “partnership” but also has not disclosed terms of the arrangement. No matter the terms, the issue has outsized importance for Trump, who last year repeatedly said he would block the deal and foreign ownership of US Steel, as did former president Joe Biden. Trump promised during the election campaign to make the revitalisation of American manufacturing a priority of his second term in office. The fate of US Steel, once the world’s largest corporation, could become a political liability in the midterm elections for his Republican Party in the swing state of Pennsylvania and other battleground states dependent on industrial manufacturing. Trump has said he wouldn’t approve the deal if US Steel did not remain under American control and keep its headquarters in Pittsburgh.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/popyrin-advances-at-roland-garros-20250531-p5m3r9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin advances at Roland-Garros",
    "publish_date": "Sat, 31 May 2025 09:04:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin advances at Roland-Garros\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/loretta-swit-who-played-hot-lips-houlihan-in-m-a-s-h-dead-at-87-20250531-p5m3r4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Loretta Swit, who played ‘Hot Lips’ Houlihan in M.A.S.H., dead at 87",
    "publish_date": "Sat, 31 May 2025 08:46:28 +1000",
    "category": "entertainment",
    "authors": [
      "Mark Kennedy"
    ],
    "text": "The growing awareness of feminism in the ’70s spurred Houlihan’s transformation from caricature to real person, but a lot of the change was due to Swit’s influence on the scriptwriters. “Around the second or third year I decided to try to play her as a real person, in an intelligent fashion, even if it meant hurting the jokes,” Swit told Suzy Kalter, author of The Complete Book of ‘M.A.S.H.’ Loretta Swit in Los Angeles in 1983. Credit: AP “To oversimplify it, I took each traumatic change that happened in her life and kept it. I didn’t go into the next episode as if it were a different character in a different play. She was a character in constant flux; she never stopped developing.” M.A.S.H. wasn’t an instant hit. It finished its first season in 46th place, out of 75 network TV series, but it nabbed nine Emmy nominations. It was rewarded with a better time slot for its sophomore season, paired on Saturday nights with All in the Family, then TV’s highest-rated show. At the 1974 Emmys, it was crowned best comedy, with Alda winning as best comedy actor.\n\nThe series also survived despite cast churn. In addition to Swit and Alda, the first season featured Wayne Rogers, McLean Stevenson, Larry Linville and Gary Burghoff. Harry Morgan, Mike Farrell and David Ogden Stiers would later be added, while Jamie Farr and William Christopher had expanded roles. Loading “Loretta Swit’s portrayal of Margaret ‘Hot Lips’ Houlihan was groundbreaking – bringing heart, humour, and strength to one of television comedy’s most enduring roles. Her talent extended well beyond that iconic character, with acclaimed work on both stage and screen that showcased her intelligence, versatility, and passion,” National Comedy Centre executive director Journey Gunderson said in a statement. ‘More of a real person’ Swit appeared in all but 11 episodes of the series, nearly four times longer than the Korean War itself, exploring issues like PTSD, sexism and racism. Swit pushed for a better representation for women.\n\n“One of the things I liked, with Loretta’s prodding, was every time I had a chance to write for her character, we’d get away from the Hot Lips angle and find out more about who Margaret was. She became more of a real person,” Alda told The Hollywood Reporter in 2018. The series ended on a happy note for Houlihan, who spends much of the finale debating whether she wants to head to Tokyo or Belgium for her next overseas post. Ultimately, she opts to return to America and work at a hospital, citing her father – a career Army man. Loading Swit didn’t personally agree that was the correct decision for a military-minded official: “I didn’t think that was correct for my Margaret,” she told Yahoo Entertainment in 2023. “I think her next move was Vietnam. So I didn’t agree with that, but that’s what they wanted her to do.” But the actor did get to write the speech that Houlihan delivers to her fellow nurses on their final night together, in which she says: “It’s been an honour and privilege to have worked with you. And I’m very, very proud to have known you.”\n\n“I was consumed with writing that. And I still get letters from women all over the world who became nurses because of Margaret Houlihan. To have contributed to someone’s life like that is remarkable,” she told Yahoo Entertainment. During her run, Houlihan had an affair with Hawkeye’s foil, the bumbling Frank Burns, played by Linville in the TV version, and in season five, Houlihan returns from a stay in Tokyo engaged to a handsome lieutenant colonel, a storyline that Swit says she advocated for with the writers. “I told them: ‘Can you imagine what fun you’re going to have with Larry when I come back to town and I tell him I’m engaged? He’ll rip the doors off of the mess tent!’ And that’s exactly what they had him do. So we were all of the same mind.” Towards the end, Swit was tempted to leave the show. She played the role of Chris Cagney in a 1981 television movie, Cagney & Lacey, and was offered the part when it was picked up as a mid-season series for the spring of 1982. But producers insisted she stay with M.A.S.H. for its last two seasons. Swit told The Florida Times-Union in 2010 she might have stayed with M.A.S.H. anyway. “You can’t help but get better as an actor working with scripts like that,” she said.\n\n“If you’re in something that literate, well, we got spoiled.” Loading In 2022, James Poniewozik, The New York Times′ chief television critic, looked back on the show and said it held up well: “Its blend of madcap comedy and pitch-dark drama – the laughs amplifying the serious stakes, and vice versa – is recognisable in today’s dramedies, from Better Things to Barry, that work in the DMZ between laughter and sadness.” After the TV series, Swit became a vocal animal welfare activist, selling SwitHeart perfume and her memoir through her official website, with proceeds benefiting various animal-related non-profit groups. In 1983, she married actor Dennis Holahan, whom she’d met when he was a guest star on M.A.S.H. They divorced in 1995.\n\nA migrants’ daughter Born in Passaic, New Jersey, the daughter of Polish immigrants, Swit enrolled in the American Academy of Dramatic Arts, then paid her dues for years in touring productions. In 1969, she arrived in Hollywood and was soon seen in series such as Gunsmoke, Hawaii Five-O, Mission Impossible and Bonanza. Then in 1972, she got her big break when she was asked to audition for the role of “Hot Lips”. She would regularly return to theatre, starring on Broadway in 1975 in Same Time, Next Year and The Mystery of Edwin Drood in 1986. She was in Amorous Crossing, a romantic comedy, at Alhambra Theatre & Dining in 2010 and in North Carolina Theatre’s production of Mame in 2003. AP",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/lifestyle/steph-claire-smith-says-she-is-in-awe-of-her-body-after-giving-birth-to-second-child-20250531-p5m3qx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Steph Claire Smith says she is ‘in awe’ of her body after giving birth to second child",
    "publish_date": "Sat, 31 May 2025 07:55:31 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Steph Claire Smith says she is ‘in awe’ of her body after giving birth to second child\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/world/north-america/a-black-eye-and-a-gold-key-musk-s-subdued-farewell-from-trump-s-white-house-20250531-p5m3ql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A black eye and a gold key: Musk’s subdued farewell from Trump’s White House",
    "publish_date": "Sat, 31 May 2025 07:43:33 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: If Elon Musk’s headline-grabbing stint in the Trump administration straddled ecstatic highs and horrific lows, his farewell was more like a Buddhist on Valium.\n\nCameras were invited into the Oval Office to watch US President Donald Trump deliver lengthy remarks praising Musk and the Department of Government Efficiency, the cost-cutting razor gang he led during his 130-day tenure as a special government employee.\n\nUS President Donald Trump presents billionaire Tesla chief Elon Musk with a “golden key to the White House” as he leaves the administration. Credit: AP\n\n“He does love our country, I know that very much,” Trump said of the world’s richest man, and presented him with a golden key to the White House. “He’s all about the USA. Americans owe him a great debt of gratitude.”\n\nMusk cut a dark figure in a black suit, black T-shirt bearing the words “The Dogefather” and a signature black cap, this one marked with “DOGE”. He also sported a slight bruise on his right eye, apparently the result of a play-fight with his young son, X.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/disgraceful-missed-call-completely-changes-competition-20250531-p5m3qr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disgraceful' missed call 'completely changes' competition",
    "publish_date": "Sat, 31 May 2025 06:56:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disgraceful' missed call 'completely changes' competition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/global-outcry-over-gaza-china-woos-pacific-beatboxing-nuns/1h351glfi",
    "title": "Global outcry over Gaza, China woos Pacific & Beatboxing nuns",
    "publish_date": "Sat, 31 May 2025 01:25:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/trump-plans-to-double-tariffs-on-steel-to-50-per-cent/widknvox7",
    "title": "Trump plans to double tariffs on steel to 50 per cent",
    "publish_date": "Sat, 31 May 2025 00:16:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "President Donald Trump says he will increase tariffs on United States steel imports from 25 per cent to 50 per cent starting Wednesday, to boost local production and reduce the country's dependence on China.\n\n\n\n\n\nThe move could hinder Australia's exports of the metal by making it more expensive for US companies to buy foreign steel.\n\n\n\n\n\nIt could also push up the domestic costs of steel, a key material used in housing, vehicles, and other goods.\n\n\n\nWhat is Trump saying?\n\nIn one of the first big policy moves of his second term back in February, Trump raised steel and aluminium tariffs to a flat 25 per cent rate.\n\n\n\nLISTEN TO Trump stands firm on tariffs, as markets crash SBS News 07/04/2025 09:12 Play\n\nAustralia has continued its push for an exemption to the penalties, with its goods currently subject to a 10 per cent baseline tariff.\n\n\n\n\n\n\"We're going to bring it from 25 per cent to 50 per cent the tariffs on steel into the United States of America, which will further secure the steel industry in the United States,\" Trump said at a rally on Friday, announcing the change.\n\n\n\n\n\n\"Our steel and aluminium industries are coming back like never before,\" he added later in a post on Truth Social.\n\n\n\nAustralian cabinet minister responds\n\nMinister for Trade and Tourism Don Farrell responded that Australia's position on the tariffs has been \"consistent and clear\".\n\n\n\n\n\n\"These tariffs are unjustified and not the act of a friend,\" he said.\n\n\n\n\n\n\"They are an act of economic self-harm that will only hurt consumers and businesses who rely on free and fair trade.\n\n\n\n\n\n\"We will continue to engage and advocate strongly for the removal of the tariffs.\"\n\n\n\n\n\nIn 2024, Australia exported around US$333 million ($519 million) worth of steel and iron to the US, according to an analysis of financial data by Trading Economics.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 0
  },
  {
    "url": "https://www.sbs.com.au/news/article/trump-accuses-china-of-violating-trade-truce/awaoewygm",
    "title": "Trump accuses China of violating temporary trade truce",
    "publish_date": "Fri, 30 May 2025 21:51:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "President Donald Trump has accused China of violating an agreement with the United States to mutually roll back tariffs and trade restrictions for critical minerals while issuing a new threat to get tougher with Beijing.\n\n\n\n\n\n\"China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US. So much for being Mr. NICE GUY!,\" Trump said in a post on Truth Social on Friday.\n\n\n\n\n\nTrump said that he made a \"fast deal\" with Chinese officials in mid-May for both countries to halt triple-digit tariffs for 90 days. He said he did this to save China from a \"devastating\" situation, factory closings, and civil unrest caused by his tariffs of up to 145% on Chinese imports.\n\n\n\nREAD MORE US appeals court allows Donald Trump's tariffs to temporarily remain in effect\n\nTrump did not specify how China had violated the agreement made in Geneva, Switzerland, or what action he would take against Beijing.\n\n\n\n\n\nAsked later on Friday in the Oval Office about the China deal, Trump said: \"I'm sure that I'll speak to President Xi, and hopefully we'll work that out.\"\n\n\n\n\n\nBut a US official told Reuters that it appears China is moving slowly on promises to issue export licenses for rare earth minerals. The deal called for China to lift trade countermeasures that restrict its imports of the critical metals needed for US semiconductor, electronics, and defence production.\n\n\n\n\n\n\"The Chinese are slow-rolling their compliance, which is completely unacceptable, and it has to be addressed,\" US Trade Representative Jamieson Greer told CNBC, without specifying how that would happen.\n\n\n\nOn Friday, global auto executives began sounding the alarm on an impending shortage of rare-earth magnets from China, used in everything from windshield-wiper motors to anti-lock braking sensors, that could force the closure of car factories within weeks.\n\n\n\n\n\nLiu Pengyu, a spokesperson for China's embassy in Washington, said China has maintained communications on trade matters with US counterparts since the Geneva talks, but raised concerns about US export controls.\n\n\n\n\n\n\"Recently, China has repeatedly raised concerns with the US regarding its abuse of export control measures in the semiconductor sector and other related practices,\" Liu said in a statement.\n\n\n\n\n\n\"China once again urges the US to immediately correct its erroneous actions, cease discriminatory restrictions against China, and jointly uphold the consensus reached at the high-level talks in Geneva.\"\n\n\n\n\n\nThe US has also ordered a growing list of companies to stop shipping goods to China without a license and revoked some existing export licenses, three people familiar with the matter told the Reuters news agency.\n\n\n\nTrade talks 'stalled'\n\nOn Thursday, Treasury Secretary Scott Bessent told Fox News that trade talks with China were \"a bit stalled\" and that getting a deal over the finish line will likely require the direct involvement of Trump and Chinese President Xi Jinping.\n\n\n\nREAD MORE From shopping to superannuation: How a US trade war could impact Australians\n\nThe US-China temporary truce to dial back triple-digit tariffs for 90 days prompted a massive relief rally in global stocks, and along with other pauses on Trump's import taxes, has lowered the effective US tariff rate to the mid-teens from around 25% in early April.\n\n\n\n\n\nIt was less than 3% when Trump took office in January.\n\n\n\n\n\nThe temporary truce between Washington and Beijing, however, had done nothing to address the underlying reasons for Trump's tariffs on Chinese goods, mainly longstanding US complaints about China's state-dominated, export-driven economic model.\n\n\n\n\n\nMajor US stock indexes ended little changed on Friday after Trump complained about China's compliance.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/video/recognition-for-australias-first-nations-veterans/3fmo13vke",
    "title": "Recognition for Australia’s First Nations veterans",
    "publish_date": "Fri, 30 May 2025 10:52:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "Recognition for Australia’s First Nations veterans\n\nPublished 30 May 2025, 9:11 am\n\nThe service of Aboriginal and Torres Strait Islander veterans has been honoured at a ceremony in Sydney. This year’s commemorations focusing on the meaning of ‘lest we forget’ and how it was previously neglected.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-never-too-late-to-do-the-right-thing-doctor-urges-australia-to-help-gazansood/adxuzmd9j",
    "title": "Doctor urges Australia to help Gazans as government moves towards recognising Palestinian state",
    "publish_date": "Fri, 30 May 2025 06:49:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nDr Mohammed Mustafa is a British-Australian emergency physician trainee.\n\n\n\n\n\nBorn a Palestinian refugee, his first time visiting Gaza was as a volunteer doctor in June last year.\n\n\n\n\n\n\"It was a very bittersweet moment. It was a sweet moment that I was finally home, but it was also just filled with a lot of despair. You know, within the first hour of me arriving, we just had body bags coming in, and we went to the morgue to help the identification and numbering of the bodies.\"\n\n\n\n\n\nReturning to Gaza in March this year, Dr Mo says the health system is in a catastrophic state.\n\n\n\n\n\n\"36 of the 38 hospitals have been either completely destroyed or partially destroyed in Gaza. There are no ventilators in the emergency department that I worked in. There is hardly any medical equipment. Antibiotics are limited. Painkillers are limited. Analgesia is limited. And since this blockade, the already little supply that's there has begun to dwindle, especially with these mass casualty events after mass casualty events. And we don't even have surgical equipment. And a lot of the time when surgeons were operating, while I was there in Gaza, we would be coming in to provide our mobile phones to use as a light for them to operate on.\"\n\n\n\n\n\nFive weeks ago, Dr Mohammed Mustafa arrived back in Australia.\n\n\n\n\n\nWhilst overseas, he built up an online following after choosing to break the rules imposed by aid organisations, and posting videos capturing the reality on the ground in Gaza.\n\n\n\n\n\nIn Canberra, he's met members of parliament, hoping to gain support for an Australian-backed children's hospital to be built in the territory.\n\n\n\n\n\n\"The amount of children that I saw die in Gaza, the amount of children that were in tents with maggots eating their wounds, with children slipping in and out of consciousness, and we didn't even have the equipment to monitor them. We couldn't even allow children to die in dignity. A lot of them were dying on the floor, bleeding out to death. This is why I just felt like we needed to do something practical to help these children. These children are innocent, and it shouldn't be controversial or political to want to help these children.\"\n\n\n\n\n\nHe's also hoping for a change in the way Australia officially views a Palestinian state.\n\n\n\n\n\n\"I think now is the right moment that not only do we get this hospital into Gaza, but we also recognise Palestine as a state. You know, we already have an embassy here. We have representatives here. It's time that we recognise them, and it's time that we recognise Palestine and give people and Palestinians hope.\"\n\n\n\n\n\nAustralia is sending representatives to a key United Nations summit next month that some hope could pave the way for recognition of Palestinian statehood.\n\n\n\n\n\nAustralia's Ambassador to the UN, James Larsen, detailed Australia's position earlier this week.\n\n\n\n\n\n\"Like other partners, Australia no longer sees recognition of a Palestinian state as only occurring at the end of negotiations, but rather as a way of building momentum towards a two-state solution. To that end, Australia welcomes the conference's ambition of a time-bound, irreversible pathway towards a two-state solution.\"\n\n\n\n\n\n147 of the 193 U-N member states already recognise a Palestinian state.\n\n\n\n\n\nAustralia, the United States, the United Kingdom, Canada, and France are not among them.\n\n\n\n\n\nFrance has indicated it will recognise Palestinian statehood soon - and it wants other countries to do the same.\n\n\n\n\n\nFrance and Saudi Arabia are lobbying countries including Australia to form an international coalition that will move to recognise Palestinian statehood at the conference they are co-hosting in New York.\n\n\n\n\n\nThe French Government says the conference is focused on the recognition of a Palestinian state, normalisation of relationships in the region with Israel, reform of the Palestinian Authority and the disarmament of Hamas.\n\n\n\n\n\nA high-level government source has confirmed to SBS News that Australia is intending to send a representative to the meeting, but the delegation won't be announced until the level of leadership from the co-hosts is clear.\n\n\n\n\n\nMr Larsen says Australia remains committed to a two-state solution.\n\n\n\n\n\n\"Australia shares the frustration of the great majority of countries more than 77 years since the world adopted resolution 181, a Palestinian state still does not exist. A two-state solution, a Palestinian state alongside the State of Israel, is the only hope of breaking the endless cycle of violence, and the only hope of a just and enduring peace for Israelis and Palestinians alike.\"\n\n\n\n\n\nHistorically, Western countries have only looked to recognise a Palestinian state at the end of the peace process with Israel, known as the two-state solution.\n\n\n\n\n\nBut Israel rejects the two-state solution, and last year Australian Foreign Minister Penny Wong joined a group of liberal democracies in floating the prospect of recognising a Palestinian state before peace is secured.\n\n\n\n\n\nChris Sidoti is an international law expert and long-time advocate for a Palestinian state to be recgonised.\n\n\n\n\n\nHe is also a Commissioner on the United Nations' Independent International Commission of Inquiry on the Occupied Palestinian Territory, including East Jerusalem and Israel.\n\n\n\n\n\n\"Recognition of statehood goes right back to 1947 when the United Nations General Assembly adopted a resolution dealing with the ending of the Palestine mandate that the United Kingdom had held and replacing it with two states living in peace side by side, one Israeli and the other Palestinian. We have seen since soon after that the establishment of the State of Israel and recognition of the State of Israel; we still don't have recognition of the State of Palestine.\"\n\n\n\n\n\nHe says recognising a Palestinian state is important to reach that two-state solution.\n\n\n\n\n\n\"Recognition is about advancing the two-state approach that was originally adopted way back then, recognising that there are two peoples in two states, because that's their aspiration, hopefully in time living side by side in peace with security and prosperity.\"\n\n\n\n\n\nPalestinian statehood is part of the Labor Party's national platform.\n\n\n\n\n\n\"The government's policy is to recognise the state of Palestine, to do so as a priority, but at a time of its choosing. I think what Ambassador Larsen's statement this week indicates is that that time is coming closer.\"\n\n\n\n\n\nThe United States has consistently used its veto powers in the UN Security Council to block full Palestinian membership and voting rights in the international forum.\n\n\n\n\n\nAt the moment, Palestine has observer status.\n\n\n\n\n\nProfessor Bob Bowker, from the Australian National University, is a former Australian ambassador to Egypt, Jordan, and Syria.\n\n\n\n\n\nHe says the change in position reflects domestic sentiment.\n\n\n\n\n\n\"I think it's primarily a political question, which reflects the fact that within Australia, the political balance has now shifted toward there being a direct recognition of the unacceptability of Israel's behaviour, and the recognition, or the foreshadowed recognition of a Palestinian state, is a symptom of that discontent at both the popular level and also increasingly at the political level.\"\n\n\n\n\n\nHamas and Israel have been in a long-running conflict that escalated into war on October 7 2023 after Hamas-led militants launched a surprise assault on southern Israel, killing 1,200 people and abducting 251 others according to the Israeli government.\n\n\n\n\n\nMore than half the hostages have been returned in ceasefire agreements or other deals; eight have been rescued, and Israeli forces have recovered the remains of dozens more.\n\n\n\n\n\nGaza authorities say Israel's retaliatory military offensive has killed around 54,000 Palestinians and destroyed vast areas of the Palestinian enclave, rendering entire neighbourhoods uninhabitable.\n\n\n\n\n\nHundreds of thousands of people have been forced to shelter in schools and tent camps for well over a year.\n\n\n\n\n\nIsraeli Prime Minister Benjamin Netanyahu has described the French government's plan to recognise Palestinian statehood as a 'huge prize for terror'.\n\n\n\n\n\nAlex Ryvchin, from the Executive Council of Australian Jewry, mirrors those concerns.\n\n\n\n\n\n\"It's always been a failed approach, and the ambassador hasn't said anything new. The Foreign Minister articulated a similar vision some months ago, but it's utterly misguided. The only way that there can be peace between the two peoples is through a genuine political process. But the first thing that has to happen is the biggest impediment to peace, which is Hamas and armed terrorism, has to be defeated, and then the two peoples can negotiate a future, determine their own borders and live together in peace. It's what everybody wants, but recognising a Palestinian state, which does not exist in fact, doesn't advance the peace process. It will only force the Israelis to dig in, and it will reward Hamas and the most extreme elements of Palestinian society.\"\n\n\n\n\n\nDr Mohammed Mustafa disagrees.\n\n\n\n\n\n\"Recognising a Palestinian state - that's for the Palestinian people, it's not for Hamas. Hamas are not representative of the Palestinian people. This has been a cause a lot longer than Hamas have existed.\"\n\n\n\n\n\nAmbassador Larsen says the Australian government will ensure that Hamas has no part to play.\n\n\n\n\n\n\"Australia has made clear it sees no role for Hamas in a future Palestinian state. Hamas is a terrorist organisation. A Palestinian state cannot be in a position to threaten Israel's security. A durable peace will require a reformed Palestinian Authority, and Australia has committed to support public administration capacity-building.\"\n\n\n\n\n\nAlthough Professor Bowker says that's a challenging thing to achieve.\n\n\n\n\n\n\"I think on the ground, there will be efforts made to present Hamas as having stepped back from a political role in Gaza. Hamas itself has said how it will be willing to avoid having a role in the governance of the territory, although everyone knows that, of course, Hamas will still be the effective power on the ground, so there'll be opportunities to present an outcome in terms that are more palatable to the international community. And we'll go along with that, as I say, because first of all, we need to bring an end to this horrendous onslaught, and we need to get the food aid and other humanitarian relief flowing in, so we'll be prepared to accept at face value assurances that things have changed for the better, even though, in reality, that may not always be the case.\"\n\n\n\n\n\nFrom March 2nd, Israel blocked the entry of medical, fuel, and food supplies into Gaza.\n\n\n\n\n\nPrime Minister Anthony Albanese voiced his concerns to the President of Israel on the sidelines of the Pope's inauguration.\n\n\n\n\n\n\"Israel's actions are completely unacceptable. It is outrageous that there be a blockade of food and supplies to people who are in need in Gaza. We've made that very clear by signing up to international statements. I made it clear in a discussion that I had with the President of Israel, President Herzog, in Rome just days ago. I made it very clear that Australia finds these actions as completely unacceptable, and we find Israel's excuses and explanations completely untenable and without credibility. People are starving, and the idea that a democratic state withholds supply is an outrage.\"\n\n\n\n\n\nAfter an 11-week blockade, Israel allowed some aid deliveries to resume last Friday after warnings from the United Nations that a quarter of Gaza's population was at risk of famine, and increased international pressure including the threat of sanctions from France, Canada, and the United Kingdom.\n\n\n\n\n\nBut Australia has not threatened sanctions - something Labor backbencher Ed Husic thinks should happen.\n\n\n\n\n\n\"The type of sanctions themselves? That will be up to the Foreign Minister to work with across government. But I think if you see the way in which things are moving, in particular, what the UK, Canada and France signalled last week. I think they are well advanced in their preparations, and we should be prepared to move rapidly should they take those steps.\"\n\n\n\n\n\nMr Ryvchin doesn't think so.\n\n\n\n\n\n\"It would be entirely futile, and again, it plays completely to the agenda of Hamas. It keeps them in power. It keeps them digging in and refusing to surrender. Why are they fighting this war? Why did they declare war on October 7? What is the aim? What are they seeking to achieve? Every day that they fight, they're subjecting both the Israelis and their own people, foremost, to suffering, to hardship, to needless death. If the international community wanted to actually do something for the people of Gaza to end this war and end their suffering, they would unite to tell Hamas to lay down their arms and to surrender immediately and unconditionally.\"\n\n\n\n\n\nFor Gazans though, Dr Mohammed Mustafa says it isn't too late to help.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-one-of-the-worlds-oldest-rock-art-sites-is-at-risk/v5v7dcm4e",
    "title": "The 50,000-year-old rock art at the centre of a 'big, dirty' gas project controversy",
    "publish_date": "Fri, 30 May 2025 06:13:28 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "One of the world's most significant collections of ancient Aboriginal rock art is under threat after the federal government approved a 40-year extension of one of Australia's largest gas projects.\n\n\n\n\n\nWoodside Energy's Karratha Gas Plant, part of the massive North West Shelf project, has been given the green light to operate until 2070 — well beyond its previously approved end date of 2030.\n\n\n\n\n\nThe plant is located in Murujuga in Western Australia, also known as the Burrup Peninsula, home to more than a million ancient petroglyphs — a type of rock art.\n\n\n\n\n\nThe decision has sparked outrage among environmentalists, archaeologists, and Traditional Owners, who warn it puts irreplaceable cultural heritage at risk.\n\n\n\nWhat is Murujuga — and why is it so important?\n\nMurujuga is home to one of the oldest and most densely packed collections of rock engravings on the planet.\n\n\n\nJust kilometres from the ancient rock art site is Woodside's North West Shelf project. Source: Supplied / Save Our Songlines Some engravings are estimated to be 50,000 years old — eight times older than the Pyramids of Giza.\n\n\n\n\n\nBenjamin Smith, professor of archaeology at The University of Western Australia, said: \"There's nowhere with as much rock art in a small place like this.\" \"It's the most beautiful environment you could ever imagine,\" he told SBS News.\n\n\n\n\n\nWith over a million petroglyphs, some depict extinct animals, such as the Tasmanian tiger. Others depict the world's earliest known representations of the human face.\n\n\n\n\n\n\"It goes back older than art. Art didn't even exist in Europe 50,000 years ago,\" Smith said.\n\n\n\n\n\n\"It records the life and lore of Aboriginal people in that landscape for 50,000 years. They see it as one of their most special places — and they have worked for 50,000 years to protect it and nurture it.\"\n\n\n\nWhat's happening with the gas project?\n\nThe Karratha Gas Plant, which has been operating since the 1980s, is situated just a few kilometres from the ancient rock art.\n\n\n\n\n\nDespite long-standing concerns about industrial emissions, the Albanese government approved an extension last week, allowing operations to continue for another 40 years.\n\n\n\nLISTEN TO Controversy over government decision to approve major extension of WA gas project SBS News 28/05/2025 04:17 Play\n\nEnvironment Minister Murray Watt said the decision followed scientific and community consultation, and included \"strict conditions\" on air emissions.\n\n\n\n\n\n\"Following the consideration of rigorous scientific and other advice including submissions from a wide cross-section of the community, I have today made a proposed decision to approve this development, subject to strict conditions, particularly relating to the impact of air emissions levels from the operation of an expanded on-shore Karratha gas plant,\" he said in a statement.\n\n\n\n\n\nWatt said the environmental approval was subject to strict conditions, particularly relating to the impact of air emissions levels from the operation of an expanded on-shore Karratha Gas Plant.\n\n\n\n\n\n\"In this case, the impact of air emissions on the Murujuga rock art that forms part of the Dampier Archipelago was considered as part of the assessment process,\" he said.\n\n\n\n\n\n\"I have ensured that adequate protection for the rock art is central to my proposed decision.\"\n\n\n\n\n\nThe Australian energy giant still has to accept conditions around heritage and air quality before the approval is made official.\n\n\n\n\n\nThe decision has been met with anger by environmental and Indigenous groups, who argue it will undermine efforts to curb greenhouse gas emissions and have a ruinous effect on the ancient petroglyphs.\n\n\n\nIs the gas plant damaging the rock art?\n\nYes, according to a major scientific report released last week. The 800-page 'Murujaga Rock Art Monitoring Program' found air pollution from heavy industry is actively degrading the rocks across all tested sites.\n\n\n\nREAD MORE Extension of North West Shelf Gas Project approved\n\nSmith said the findings were clear — but the WA government's official summary downplayed risks by attributing the damage to industrial emissions from the 1970s.\n\n\n\n\n\n\"If that little power plant back in the 1970s and 80s was damaging the rock art — and it may have been — what we can say for sure now is the current industry is damaging it five times as fast because the emissions are five times the level,\" he said.\n\n\n\n\n\nSmith labelled the summary as \"propaganda\", accusing the WA government of ignoring the science.\n\n\n\n\n\n\"This is one of the most weakly regulated industrial plants in the world,\" he said.\n\n\n\nThe decision to extend the shelf life of Woodside's Karratha Gas Plant has been met with protests from environmentalists and those concerned about the degradation of Murujuga's rock art. Source: SBS News / Christopher Tan\n\nProtests, three face court\n\nOn Friday, campaign group Disrupt Burrup Hub gathered outside the WA District Court, arguing the decision to extend the project's life showed the government \"cannot be trusted with protecting First Nations culture or our climate\".\n\n\n\n\n\nThe protest also served as a support rally for three of the group's activists, who targeted Woodside's 2023 annual general meeting with stench gas and flares, in what the group had previously described as an attempt to evacuate the building.\n\n\n\n\n\nAlso among the critics of the project is Greens leader Larissa Waters, who on Thursday said it would be \"the biggest and dirtiest gas project\" Australia had seen.\n\n\n\n\n\n\"I think people will be horrified that the government, who said that they were going to take the climate crisis seriously, have ticked off on yet another mega fossil-fuel project,\" she said.\n\n\n\nLISTEN TO Greens criticise timing of report into industrial impact on ancient WA rock art SBS News 27/05/2025 01:15 Play\n\nFormer Labor senator and Indigenous rights activist Pat Dodson said Watt needed to sit down with Traditional Owners who oppose the extension.\n\n\n\n\n\n\"He needs to go and talk to those Traditional Owners from that area and hear their side of the story ... so they understand and he understands the depth of their concern and why they are so upset,\" he told ABC Radio on Friday.\n\n\n\n\n\nThe WA government said on Friday it would undertake a four-month review of native title and cultural heritage processes in the state's mining sector with a focus on improving outcomes for both Traditional Owners and industry.\n\n\n\nWhat happens now?\n\nExperts are calling for international attention and for Murujuga to be granted World Heritage status to help protect it from further damage.\n\n\n\n\n\nThe Murujuga Aboriginal Corporation, which partners with the WA government in monitoring the preservation of the rock art, said a recent evaluation report found the site to be in a good state of conservation and supported its World Heritage listing.\n\n\n\nMardathoonera woman Raelene Cooper plans to head to the Federal Court to challenge the decision. Source: Supplied / Raelene Cooper Smith warned the damage already done is irreversible — but it's not too late to prevent further harm.\n\n\n\n\n\n\"If we get the pollution down, we're okay. If we lack the backbone and fail to do that, we will lose a lot of this priceless rock art that has been there for 50,000 years and survived for 50,000 years, carefully curated by Aboriginal people.\"\n\n\n\n\n\n\"One generation of reckless modern-day industry is willing to jeopardise all of that.\"\n\n\n\n\n\nMardathoonera woman Raelene Cooper, a custodian of Murujuga and a former chair of the Murujuga Aboriginal Corporation, is planning to head to the Federal Court to challenge the decision.\n\n\n\n\n\n\"See you in court,\" Cooper said in a statement.\n\n\n\n\n\n\"I'm not on my own, I'm bringing warriors from this ngurra (Country) with me.\"\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/senate-makeup-finalised-evening-news-bulletin-30-may-2025/iebkrluer",
    "title": "Senate makeup finalised | Evening News Bulletin 30 May 2025",
    "publish_date": "Fri, 30 May 2025 06:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe makeup of the Senate for the next federal parliament has been finalised.\n\n\n\n\n\nThe Labor Party will have 28 senators in the 76-seat upper house.\n\n\n\n\n\nThe Liberal Party-National Party coalition will have 27.\n\n\n\n\n\nThe Greens will have 11.\n\n\n\n\n\nOne Nation will have four.\n\n\n\n\n\nAnd independents and other minor parties will have the remaining six.\n\n\n\n\n\nThe makeup has been finalised with the count finally having been finished in New South Wales, where One Nation's Warwick Stanley has picked up the last of the six seats up for grabs.\n\n\n\n\n\nHis win giving One Nation its fourth Senate seat- their equal-best-ever result in the Senate at a federal election.\n\n\n\n\n\nSpeaking to Sky News, leader Pauline Hanson says the good showing can be chalked up to what she calls common-sense policies.\n\n\n\n\n\n\"It's about the best result that we've had since both probably 1998 in votes. The thing is we put out good, common sense policies in February, we actually advocated to look after pensioners, to be able to work, income splitting. Also, we supported the fuel excise tax and getting rid of the alcohol tax. That was a big winner for a lot of the pubs and hospitality venues that need to do that, it was about supporting the Australian people. \"\n\n\n\n\n\n+++\n\n\n\n\n\nU-S President Donald Trump's tariffs are being blamed for a drop in Australian retail spending.\n\n\n\n\n\nThe Australian Bureau of Statistics has released the retail trade figures for April, showing a 0.1 per cent fall in turnover.\n\n\n\n\n\nThere was a 0.3 per cent rise the previous month.\n\n\n\n\n\nOnly Queensland and Western Australia had increases in retail turnover in April.\n\n\n\n\n\nOn an annual basis, sales have risen 3.8 per cent in the twelve months to the end of April, as opposed to 4.3 per cent in the twelve months to the end of March.\n\n\n\n\n\nMr Trump's announcement of U-S tariffs on the 2nd of April shook consumer confidence, and took billions of dollars off superannuation balances after financial markets were rattled.\n\n\n\n\n\nSurveys from Westpac and A-N-Z Bank showed a marked decrease in consumer metrics after Mr Trump's announcement.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Yuendumu community is reeling after the death of a second young man in police custody in Alice Springs.\n\n\n\n\n\nThe community is expressing outrage following the death of a 24-year-old man who died after two plain clothes officers pinned him to the floor following an alleged shoplifting incident.\n\n\n\n\n\nNorthern Territory police said in a statement that a short time later, the man stopped breathing and CPR was commenced, adding that the incident is being investigated as a death in custody.\n\n\n\n\n\nYuendumu elder Ned Jampijinpa Hargraves, the grandfather of the man who died on Tuesday, says police are not doing their jobs.\n\n\n\n\n\n\"We respect you, how about us? Respect us. You know, we were meant to be working together. But we're not. Police are supposed to be doing their job. In a way that is according to them, but it's all all a mess. You were supposed to serve the community. Protect people.\"\n\n\n\n\n\n+++\n\n\n\n\n\nA 24-year-old woman has been charged after four people were injured in a stabbing in the Gippsland region of Victoria.\n\n\n\n\n\nPolice in Bairnsdale, a town 279 kilometres east of Melbourne, allege the woman first stabbed a staff member at a supermarket, then a man in a car park, a man at a nearby hotel and a man at a train station.\n\n\n\n\n\nShe has been charged with intentionally and recklessly causing injury.\n\n\n\n\n\nAll four victims were taken to hospital; the first in a serious condition, and the others treated for minor injuries and released.\n\n\n\n\n\nInvestigator Mark Rossiter of Victoria Police says the motivation for the attack is still unclear.\n\n\n\n\n\n\"An unprovoked attack is very rare. An unprovoked attack with multiple victims is even rarer and something I haven't seen locally in Gippsland before. Whilst we're still investigating the matter and the motives - unknown - it doesn't appear to be a targeted attack and it doesn't appear to be any specific motivation.\"\n\n\n\n\n\n+++\n\n\n\n\n\nU-S President Donald Trump is still praising Elon Musk, despite the businessman walking away from his role amidst criticism of Mr Trump's major tax legislation.\n\n\n\n\n\nAfter calling Donald Trump's signature tax bill too expensive, Mr Musk announced his departure from the role as a special government employee.\n\n\n\n\n\nThe world's richest man was tasked by the administration with cutting federal spending through his Department of Government Efficiency, or DOGE.\n\n\n\n\n\nA former DOGE staffer has told reporters he expects the project to fizzle out without Elon Musk.\n\n\n\n\n\nBut White House Press Secretary Karoline Leavitt denies that will be the case.\n\n\n\n\n\n\"Well, the entire cabinet is involved and I spoke to the president about it this morning and the entire cabinet understands the need to cut government waste, fraud and abuse. And each cabinet secretary at their respective agencies is committed to that. That's why they were working hand in hand with Elon Musk and will continue to work with the respective DOGE employees who have onboarded as political appointees at all of these agencies.\"\n\n\n\n\n\n+++\n\n\n\n\n\nNamibia has honoured the victims of the German genocide in their country, as politicians and affected communities voice fresh calls for reparations.\n\n\n\n\n\nIn what is considered the first genocide of the 20th Century, German soldiers killed some 65,000 OvaHerero people and 10,000 Nama people between 1904 and 1908.\n\n\n\n\n\nGermany acknowledged genocide for the first time in 2021, agreeing to fund development projects worth close to A$2 billion in Namibia, but stopping short of paying reparations.\n\n\n\n\n\nDr Eyal Mayroz , senior lecturer of peace and conflict studies at the University of Sydney, tells S-B-S, colonial powers worry about the precedent reparations may set.\n\n\n\n\n\n\"They're also afraid of other colonies suing them. There is a great fear by many ex-colonial powers including the Germans that if they agree to the word reparations then they will be subjected to a new raft of demands and in the legal proceedings against them.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn rugby league, Canberra Raiders halfback Jamal Fogarty is nominating team mate Corey Horsburgh as a solution for Queensland's State of origin woes.\n\n\n\n\n\nQueensland's 18 points to 6 loss in game one of the series on Wednesday night has sparked discussion about what, if any changes, team changes the Maroons need to make to win game two in Perth on June the 18th, and keep the series alive.\n\n\n\n\n\nHorsburgh played for Queensland once, two years ago.\n\n\n\n\n\nFogarty says the red-headed forward's form this season for Canberra ought to earn him a second opportunity.\n\n\n\n\n\n\"As a Queenslander, I reckon we probably need someone like Corey. He's got a bit of mongrel and aggression about him, and we need that to go after the New South Wales pack. I love playing with Red every week. I know what he can as a footballer, and what he gives the team. So, I'd like to see the big fellow there. He's been very consistent for us all season as well, so I think it would be a good reward for him.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-30-may-2025/a91bx5i9w",
    "title": "SBS News in Easy English 30 May 2025",
    "publish_date": "Fri, 30 May 2025 04:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe makeup of the Senate for the next federal parliament has been finalised.\n\n\n\n\n\nThe Labor Party will have 28 senators in the 76-seat upper house.\n\n\n\n\n\nThe Liberal Party-National Party coalition will have 27.\n\n\n\n\n\nThe Greens will have 11.\n\n\n\n\n\nOne Nation will have four.\n\n\n\n\n\nAnd independents and other minor parties will have the remaining six.\n\n\n\n\n\nThe makeup has been finalised with the count finally having been finished in New South Wales, where One Nation's Warwick Stanley has picked up the last of the six seats up for grabs.\n\n\n\n\n\nHis win giving One Nation its fourth Senate seat- their equal-best-ever result in the Senate at a federal election.\n\n\n\n\n\n+++\n\n\n\n\n\nThe federal opposition's newly-installed Foreign Affairs spokeswoman, Michaelia Cash, is urging Prime Minister Anthony Albanese to take up any invitation to visit Israel.\n\n\n\n\n\nIsraeli President Isaac Herzog has requested a visit after Mr Albanese sharpened his criticism of Israel this week for its obstruction of humanitarian aid access in Gaza.\n\n\n\n\n\nMs Cash has urged the Prime Minister to visit as soon as reasonably possible, in order to try and reset the relationship between the countries.\n\n\n\n\n\nShe is due to meet Israel's Ambassador to Australia, Amir Maimon, within the next week.\n\n\n\n\n\nIt comes ahead of a major summit on Palestinian statehood in New York next month, for which Australia has not yet confirmed a representative.\n\n\n\n\n\n+++\n\n\n\n\n\nU-S President Donald Trump's tariffs are being blamed for a drop in Australian retail spending.\n\n\n\n\n\nThe Australian Bureau of Statistics has released the retail trade figures for April, showing a 0.1 per cent fall in turnover.\n\n\n\n\n\nThere was a 0.3 per cent rise the previous month.\n\n\n\n\n\nOnly Queensland and Western Australia had increases in retail turnover in April.\n\n\n\n\n\nOn an annual basis, sales have risen 3.8 per cent in the twelve months to the end of April, as opposed to 4.3 per cent in the twelve months to the end of March.\n\n\n\n\n\nMr Trump's announcement of U-S tariffs on the 2nd of April shook consumer confidence, and took billions of dollars off superannuation balances after financial markets were rattled.\n\n\n\n\n\nSurveys from Westpac and A-N-Z Bank showed a marked decrease in consumer metrics after Mr Trump's announcement.\n\n\n\n\n\n+++\n\n\n\n\n\nA 24-year-old woman has been charged after four people were injured in a stabbing in the Gippsland region of Victoria.\n\n\n\n\n\nPolice in Bairnsdale, a town 279 kilometres east of Melbourne, allege the woman first stabbed a staff member at a supermarket, then a man in a car park, a man at a nearby hotel and a man at a train station.\n\n\n\n\n\nShe has been charged with intentionally and recklessly causing injury.\n\n\n\n\n\nAll four victims were taken to hospital; the first in a serious condition, and the others treated for minor injuries and released.\n\n\n\n\n\nInvestigator Mark Rossiter of Victoria Police says the motivation for the attack is still unclear.\n\n\n\n\n\n+++\n\n\n\n\n\nAustralian Alex de Minaur has joined calls for the men's tennis tour to be shortened after his elimination in the second round of the French Open.\n\n\n\n\n\nDe Minaur has fallen from a 2-0 ((two sets to love)) lead to to lose 2-6, 2-6, 6-4, 6-3, 6-2 to Alexander Bublik of Kazakhstan.\n\n\n\n\n\nThe number nine seed says while it is not an excuse for his defeat here, many players are exhausted from the frenetic pace of the tour, and careers will be shortened as a result if something is not done.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/australia-records-first-case-of-clade-1b-mpox/xea9cdq3e",
    "title": "Australia's first case of clade 1b mpox found in man who was holidaying in Thailand",
    "publish_date": "Fri, 30 May 2025 01:59:58 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Australia has recorded its first case of the mpox variant that typically causes more serious illness.\n\n\n\n\n\nThe Australian Centre for Disease Control (CDC) confirmed a case of mpox clade 1b in NSW earlier this month — the first, and so far only, case of this variant in Australia.\n\n\n\n\n\nThe case was a returned traveller, and the risk of further transmission was low, a spokesperson for the federal Department of Health said.\n\n\n\n\n\nA spokesperson for NSW Health said the case was a man who contracted the virus while holidaying in Thailand.\n\n\n\n\n\nThe spokesperson said the man had developed symptoms after arriving back in Australia and has since recovered.\n\n\n\nWhat is mpox?\n\nMpox is a viral zoonotic disease, and comes from the same family as the one responsible for smallpox.\n\n\n\n\n\nIt is divided into two clades, clade 1 and clade 2, and further into two subclades: 1a and 1b, and 2a and 2b.\n\n\n\n\n\nHistorically, clade 1 is more likely to cause severe illness and death than clade 2.\n\n\n\nMpox is endemic to parts of central and West Africa, according to the United States Centers for Disease Control and Prevention. But in 2022, a global outbreak of clade 2 occurred, which is ongoing.\n\n\n\n\n\nThere have been 1,726 confirmed cases of mpx across Australia since 2022, according to the Department of Health's National Notifiable Disease Surveillance System. The majority of these (1,409) were recorded in 2024, and there have been 147 cases so far this year.\n\n\n\n\n\nUntil the recent clade 1b case, reported infections in Australia have been caused by mpox clade 2b, the CDC states. It says most of these infections were locally acquired.\n\n\n\n\n\nIt says mpox clade 1b infections were previously isolated to Central Africa but have since been recorded elsewhere. The World Health Organization (WHO) lists a small number of countries outside Africa where clade 1b cases have been recorded, including, along with Australia, the United Kingdom, Germany, Thailand, France, the United Arab Emirates, and Switzerland. It says reported cases in these countries are linked to travel and not local transmission.\n\n\n\n\n\nMore than half of the 32,953 reported clade 1b cases recorded in parts of Africa since January 2024 have been recorded in Democratic Republic of the Congo, according to the WHO.\n\n\n\n\n\nThe CDC acknowledges clade 1 has generally been considered to cause more severe disease, but recent data suggested clade 1b — first discovered in 2023 — has a fatality rate similar to clade 2b. The US Centers for Disease Control and Prevention also notes recent outbreaks have seen \"much lower death rates\".\n\n\n\nWhat are the symptoms of mpox?\n\nSigns and symptoms can include a distinctive rash or lesions, swollen lymph nodes, headache or fever, muscle aches, joint pain, back pain, chills and exhaustion.\n\n\n\n\n\nThe virus can be transmitted through intimate or prolonged physical contact, close contact with rashes on the skin, body fluids (including droplets from coughing or sneezing) and contaminated objects such as linen and towels.\n\n\n\n\n\nSymptoms typically clear after two to four weeks for most people, but some can become seriously ill.\n\n\n\n\n\nThe Department of Health says most cases in Australia have been identified in gay, bisexual and other men who have sex with men, but anyone can be affected.\n\n\n\n\n\nIt says that most infections are mild.\n\n\n\nEligible groups can receive free vaccinations against mpox, with no Medicare card required.\n\n\n\n\n\nVaccination is recommended for men who have sex with men, sex workers, and healthcare and laboratory staff at risk of exposure.\n\n\n\n\n\nThose who have close physical contact with an infected person or are immunocompromised are also considered high risk.\n\n\n\n\n\nAnyone at risk who plans to travel to a country experiencing a significant outbreak should be vaccinated four to six weeks before travelling.\n\n\n\n\n\nThe best time for people to receive the vaccine is before they are exposed to mpox.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/pinball-machine-policies-analysts-react-to-developments-in-trump-tariffs/my9345b7p",
    "title": "'Pinball machine' policies: analysts react to developments in Trump tariffs",
    "publish_date": "Fri, 30 May 2025 01:41:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAfter 48 hours of uncertainty over Trump's tariffs, little is resolved, but one thing is clear: the global trade war is far from over.\n\n\n\n\n\nThe White House is announcing multiple new trade deals are on the way, this news breaking in a whirlwind of conflicting headlines as the Trump Administration fights the Federal Court over an attempt to block tariffs on international imports.\n\n\n\n\n\nWhite House economic adviser, Kevin Hassett, has described the court order to Fox News as an attack.\n\n\n\n\n\n\"This trade negotiation season has been really, really effective for the American people. And it's unfortunate that people would attack it, as the journalists did or the way the judges just did. You know, these activist judges are trying to slow down something right in the middle of really important negotiations.\"\n\n\n\n\n\nOvernight, the White House made a successful appeal against the Federal Court order blocking the President's international tariff order.\n\n\n\n\n\nIt's used the International Emergency Economic Powers Act to press pause on the U-S Court of International Trade's decision to block tariffs.\n\n\n\n\n\nThat means the trade penalties are still in play - for now.\n\n\n\n\n\nThe block on tariffs could be reinstated, but White House Trade Advisor Pete Navarro says whatever roadblocks are thrown in their way - he and his colleagues will overcome them.\n\n\n\n\n\n\"So look, the tariff, the tariffs remain in place. The court told us, they didn't all but tell us, they told us go do it another way. So you can assume that even if we lose, we will do it another way. And I can assure the American people that the Trump tariff agenda is alive, well, healthy, and will be implemented to protect you, to save your jobs and your factories, and to stop shipping foreign wealth, our wealth into foreign hands.\"\n\n\n\n\n\nMarket analysts, including Ballast Rock Private Wealth's [[Portfolio Manager]] Jim Carroll, are reporting to investors with this assurance: if you're confused, so are we.\n\n\n\n\n\n\"It's just impossible to decipher all of these shenanigans. You really either need to be a long-term investor and just turn off the television, or you have to be a very active trader. Anything in between, you're really setting yourself up for problems. We have tried to communicate to clients that this is an environment in which discipline is going to be tested.\"\n\n\n\n\n\nMark Spindel is chief investment officer of Potomac River Capital.\n\n\n\n\n\n\"I think markets are just going to continue to be caught in this pinball machine of court decisions, executive orders and judicial reviews.\"\n\n\n\n\n\n50 Park Investments' Adam Sarhan has urged investors to keep calm and carry on.\n\n\n\n\n\n\"It's a secondary thing even, though it's capturing the headlines right now. Investors are looking forward. Trump has already rolled back most of these tariffs anyway, so these court rulings are just headlines. Trump probably prepared an appeal before the ruling even came out.\"\n\n\n\n\n\nU-S tariffs remain a bargaining chip as trade talks continue on the world stage.\n\n\n\n\n\nAustralia has continued its push for an exemption to the penalties, with Australian goods currently subject to a 10 per cent baseline tariff and all steel and aluminium imports to the U-S hit with 25 per cent tariffs.\n\n\n\n\n\nAustralia brings more American products on-shore than it exports to the U-S - a factor Prime Minister Anthony Albanese has previously said should mean it is exempt.\n\n\n\n\n\nBut President Trump's so-called' best friend' Britain is in a similar position - and did not manage to shake off 10 per cent penalties on most of its imports to the U-S.\n\n\n\n\n\nBill Reinsch is a senior advisor to the Centre for Strategic and International Studies, and says countries hoping for reprieve may be disappointed.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/knights-prop-reported-for-crusher-tackle-20250531-p5m3rj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Knights prop reported for crusher tackle",
    "publish_date": "Sat, 31 May 2025 10:35:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "Knights prop reported for crusher tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/wait-for-the-siuuu-what-melbourne-city-s-captain-learnt-from-cristiano-ronaldo-20250528-p5m30l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wait for the ‘Siuuu’: What Melbourne City’s captain learnt from Cristiano Ronaldo",
    "publish_date": "Sat, 31 May 2025 10:01:41 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward"
    ],
    "text": "“You obviously have to wait for him to do his celebration before you start celebrating with him but it was great, it was surreal,” Behich said with a smile. “I watched him when he was at Manchester United and I was a young guy - I followed him then. It’s something I will look back on. Lionel Messi tussles with Aziz Behich at the 2022 FIFA World Cup. Credit: Getty Images “In Turkey was where I played with a lot of players who had accomplished a lot,” Behich said. “The year we won the league [İstanbul Başakşehir, 2019-2020] we had players like Martin Skyrtel, Gael Clichy, Robinho and Demba Ba - I’ve been fortunate to share the changerooms with guys like that and then played against the likes of Lionel Messi and those sort of players for the Socceroos - you learn a lot about yourself as a footballer.\n\n“It gives you experience at a higher level. I’ve always been one to embrace challenges and test myself against the best in the world.” The charismatic veteran is now 34 and all his experiences help him set a stellar example for his relatively young team as they face the furnace of a sold out, pro-Victory crowd. But Behich’s whole football career reached its sliding doors moment when he was thrown onto the field for Victory in the 2009-2010 grand final against Sydney FC at a bursting Marvel Stadium. Victory’s Aziz Behich misses a golden opportunity to score as Clint Bolton in the 2010 A-League grand final. Credit: Vince Caligiuri Behich was a skinny teenager on a youth team contract who played as a speedy winger. In the final minutes of normal time with scores tied 1-1, he had a header close to goal which was saved by the keeper.\n\nSydney went on win on penalties 4-1 and Behich was let go with the newly formed Melbourne Heart, City’s old name, signing him for its inaugural season, a move that launched his career. “One thing my parents always told me is when one door closes, another door opens, and after that night, that door closed but I got an opportunity for Melbourne Heart,” Behich said. “The rest is history.” Does he ever think about what might have happened if he scored and became a Victory legend? “It could have gone in and my career could have been on a different path but I couldn’t be more grateful for the journey I’ve had so far,” Behich said.\n\nIt was in that first Heart season that then coach John van’t Schip moved Behich to left-back where he has ascended to 75 Socceroos caps, an Asia Cup win in 2015, two World Cups and a decade of club football in Europe - he’s still a regular with the Socceroos as well. That move was made without warning when Heart lost veteran left-back Dean Heffernan to suspension before the first Melbourne Derby, so Behich was thrown into the role and never looked back. Aziz Behich playing for Melbourne Heart in 2011. Credit: Vince Caligiuri “I had never played there but John said he saw the type of player I was and knew I would do well there, so go enjoy it,” Behich recalled. “We ended up winning that first derby and I got stuck there so I got to give credit to John who I like dearly - he played a big part in my career and development.”\n\nBehich has become a respected figure at City and within the Socceroos and his captaincy has been praised by City coach Aurelio Vidmar this season. “I certainly felt that while we’ve got some strong leaders at the club, the only one who could do the job we’d expect would be Aziz,” Vidmar said. “We certainly missed him the last six months of last season and he’s been instrumental, he’s been so important for us this season. Aziz Behich of Melbourne City, Melbourne City coach, Aurelio Vidmar, Head coach of the Victory, Arthur Diles and Roderick Miranda of the Victory pose with the trophy. Credit: Getty Images “Sometimes as a coach, it’s not easy to control the changeroom and he’s made my life easier because anything that happens or even prior to things happening, he’s already onto it, it’s like he can sense it.”",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/matildas-vs-argentina-live-young-tillies-face-test-against-argentina-at-marvel-stadium-20250530-p5m3i9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’ve got a taste for trophies now’: Matildas hunting Asian Cup glory",
    "publish_date": "Sat, 31 May 2025 10:00:29 +1000",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Brittany Busch"
    ],
    "text": "The magnitude of winning the UEFA Women’s Champions League is still sinking in for Arsenal and Matildas star Steph Catley, but two things have dawned on her.\n\nThe first is that she is living in the best times of her life, so far, and the second is that she can have this feeling again if she and the Matildas can find a way to win next year’s Women’s Asian Cup in Australia in March.\n\nMatildas star Steph Catley mixes with fans at Marvel Stadium on Friday night. Credit: Getty Images\n\nCatley and fellow Australian Gunners Caitlin Foord and Kyra Cooney-Cross only arrived in Melbourne on Wednesday night, and they were kept out of the Matildas 2-0 win over Argentina in front of 43,020 fans at Marvel Stadium on Friday night.\n\n“It’s something that I don’t think I will come down from for a very long time,” Catley said after the match.\n\n“It’s been a big few days. The biggest of my life and my career I would say. It’s something I’ve dreamed of and the pinnacle of football and being able to do it alongside my two Aussies and being part of Arsenal – it’s been very, very special and to celebrate it with the Tillies and all the girls has been lovely.”\n\nThe feeling of winning the title and the victory parade are experiences she will never forget. But when asked to look forward to next March, Catley wants to match the Matildas’s success in the 2010 edition in China.\n\n“It gives you a taste of what’s possible,” Catley said. “Being at a club like Arsenal, I always believed we were capable of doing it but actually doing it is a whole other thing and especially when you are up against a team like Barcelona – sometimes it feels quite far away.\n\n“To actually do it, it makes me think about my career and the things I really want to achieve and winning silverware with the Matildas has always been top of my list.\n\nCaitlin Foord, Steph Catley and Kyra Cooney-Cross arrived back in Melbourne on Wednesday night. Credit: Getty Images\n\n“I’ve got a taste for trophies now and the tournament is coming up very close so it’s good for the three of us to have a taste of that and be able to lead the hunt for success for our team.”\n\nMatildas defender Charli Grant said on Friday she was inspired by seeing her fellow Matildas win on such a huge stage, and Catley hopes that Arsenal’s win will inspire people around the world.\n\n“We still believe we can do something special,” Catley said. “You look at Charli tonight and she looks like she’s been in our team for a few years. We’re still finding gems like that and coming into a major tournament, you want to have depth and competition.\n\n“It’s nice to hear she feels that way and if we can inspire girls at any level in this country to go out and be a Matilda, that is what it’s all about.”\n\nShe and her European-based teammates hadn’t partied too hard after the win as the Australians had to hop on the plane while those playing in the Euro 2025 tournament in July went into camp with their national teams.\n\n“Getting on a plane to Australia is not the easiest way to go about it, but we celebrated how we felt and it was definitely fun, but we stopped soon enough,” Catley said.\n\n“We were smart. We were heading into camp and the European girls have got serious matches. We were not all silly about it.”\n\nMatildas coach Tom Sermanni joked that they had had their week off and would start against Argentina in Canberra on Monday night.\n\n“He hasn’t told me that yet,” Catley said. “I’ll be ready, and the girls will be ready.”",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/boxing/imane-khelif-banned-from-competing-in-womens-world-boxing-events-20250531-p5m3rb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Imane Khelif banned from competing in women’s World Boxing events",
    "publish_date": "Sat, 31 May 2025 09:39:44 +1000",
    "category": "sports",
    "authors": [
      "Oliver Brown"
    ],
    "text": "Imane Khelif, whose gold medal at last year’s Paris Olympics caused a global scandal, has been banned from competing in all future World Boxing events in the women’s category unless the Algerian can provide proof of being biologically female.\n\nIn a major development, World Boxing has bowed to intense pressure from campaigners for safety and fairness in women’s sport, many of whom had expressed outrage that Khelif was being allowed to compete again in the female division at next week’s Eindhoven World Cup in The Netherlands.\n\nThe international governing body announced that Khelif, who was disqualified from the 2023 World Championships after tests indicated the presence of male chromosomes, would need to pass mandatory sex screening to be deemed eligible.\n\nSo far, Khelif has not submitted to any such test in the nine months since a hugely controversial Olympic campaign, in which beaten Italian opponent Angela Carini said she had feared for her life.",
    "source": "TheAge",
    "cluster_id": 8
  },
  {
    "url": "https://www.theage.com.au/national/nsw-severe-swell-20250531-p5m3re.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW severe swell",
    "publish_date": "Sat, 31 May 2025 09:35:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "NSW severe swell\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/belated-spotlight-on-popyrin-as-he-charges-into-last-16-at-roland-garros-20250530-p5m3qc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘We all expected Demon to be in the fourth round’: Popyrin charges into last 16 at Roland-Garros",
    "publish_date": "Sat, 31 May 2025 09:25:07 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "“We all expected Demon to be in the fourth round,” admitted Popyrin, when asked if he’d have thought at the start of the week he’d be the final men’s survivor. “I don’t think I could have thought that – Alex is probably the most consistent player on tour – but that’s the case now. I’m only focusing on myself. I want to keep going as far as I can, that’s all I’m thinking. “It was a really good match from my point. Happy I wrapped it up in three sets. It’s really hot out there, really difficult conditions. “I played the first set-and-a-half really, really solid, how I’ve been playing all week, but had a bit of a mental slip-up at the end of the second but managed to dig deep in the tiebreak.\n\n“The third set was more a mental battle than a physical battle on my side trying to hold serve, and then trying to get opportunities on his return, which I had towards the end. But still managed to kind of keep my head and still play well in the tie-break.” Dressed in fluorescent pink hat, shorts and shoes, and with a racquet to match, Borges eliminated wounded dual finalist Casper Ruud in four sets in the previous round. He also advanced to the fourth round at the Australian Open and US Open last year, so is a serious player. Borges already made tennis history this fortnight with countryman and qualifier Henrique Rocha when they became the first two Portuguese players to reach the round of 32 at the same grand slam. But this day belonged to Popyrin, even as Borges launched rearguard action late in the second set to twice break back when the Australian tried to serve for a two-set lead. Popyrin had played an almost spotless match until he dropped serve on the first of those occasions, but then had to dig deep as Borges took fresh aim at his weaker backhand wing, which has been under construction from his new co-coach Wayne Ferreira.\n\nPopyrin’s other coach, Neville Godwin, who shared the job with Xavier Malisse until March when Malisse chose to part ways with Popyrin, was front and centre on Friday for one of the Australian’s most significant wins. It took 77 minutes and until Popyrin’s sixth set point – after saving two that Borges held – on the 24th point of an engrossing and rollercoaster tiebreak for him to finally earn that two-set advantage. Nuno Borges had chances against Popyrin, but was unable to win a set. Credit: Getty Images The tie-breaker result loomed large in the bigger picture of the match, but de Minaur’s slip-up from the same lead a day earlier, and Borges’ increasing ability to create opportunities in Popyrin’s service games, meant there was still work to do. With de Minaur’s mother Esther among those urging him on from courtside, Popyrin fended off a break point in each of his second and third service games in the third set as Borges tried to make his move.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/popyrin-focused-on-next-round-20250531-p5m3ra.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin focused on next round",
    "publish_date": "Sat, 31 May 2025 09:16:36 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin focused on next round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/world/north-america/trump-to-double-steel-tariffs-to-50-per-cent-20250531-p5m3r5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump says he will double steel, aluminium tariffs to 50 per cent",
    "publish_date": "Sat, 31 May 2025 09:10:25 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "“They are an act of economic self harm that will only hurt consumers and businesses who rely on free and fair trade. We will continue to engage and advocate strongly for the removal of the tariffs,” Farrell said. Australia exported $640 million worth of steel and $440 million of aluminium last year to the US. The cumulative $1 billion trade is a small amount compared to the nation’s total exports of $660 billion in the past financial year. Trade Minister Don Farrell says the US tariffs are “not the act of a friend”. Credit: Alex Ellinghausen The steel and aluminium tariffs were enacted under trade laws rather than emergency powers, and were not among those struck down by the decision of the Court of International Trade this week. However, those levies will remain in place while the government pursues an appeal that will almost certainly be decided by the Supreme Court. A federal appeals court agreed to temporarily preserve the tariffs – which include a 10 per cent levy on Australian goods – while the appeal is urgently held.\n\nIn February, Trump told Prime Minister Anthony Albanese he would consider giving Australia an exemption to the tariffs on steel and aluminium. Australia received a carve out during the first Trump administration. But the US president decided against giving any exemptions this time. Workers listen to Trump as he announced a plan to double tariffs on steel imports. Credit: AP Earlier on Friday, Trump also registered his frustration with China – which he accused of reneging on a tariff truce negotiated earlier this month – raising the prospect of additional import taxes. “China, perhaps not surprisingly to some, HAS TOTALLY VIOLATED ITS AGREEMENT WITH US. So much for being Mr. NICE GUY!,” Trump said in a post on his Truth Social platform.\n\nSteel prices in the US have climbed 16 per cent since Trump became president in mid-January, according to the government’s Producer Price Index, and such a dramatic increase in steel tariffs could push prices even higher. In March 2025, steel cost $US984 ($1535) a metric tonne in the US, significantly more than the price in Europe ($1076) or China ($611), according to the US Commerce Department. The US produced about three times more steel than it imported last year, with Canada, Brazil, Mexico and South Korea being the largest sources of steel imports. Australia exported $640 million worth of steel to the United States last year. Credit: Louie Douvis While Trump initially vowed to block the Japanese steelmaker’s bid to buy US Steel, he reversed course and announced an agreement last week for what he described as “partial ownership” by Nippon. It’s unclear, though, if the deal his administration helped broker has been finalised or how ownership would be structured. Analysts have credited tariffs going back to Trump’s first term with helping strengthen the domestic steel industry, something that Nippon Steel wanted to capitalise on in its offer to buy US Steel.\n\nThe United Steelworkers union remained sceptical of Nippon’s planned investment. Loading Its president, David McCall, said in a statement that the union was most concerned “with the impact that this merger of US Steel into a foreign competitor will have on national security, our members and the communities where we live and work”. Trump stressed the deal would maintain American control of the storied company, which is seen as both a political symbol and an important matter for the country’s supply chain, industries such as car manufacturing and national security. Trump, who has been eager to strike deals and announce new investments in the US since retaking the White House, is also trying to satisfy voters, including blue-collar workers, who elected him as he called to protect American manufacturing.\n\nUS Steel has not publicly communicated any details of a revamped deal to investors. Nippon Steel issued a statement approving of the proposed “partnership” but also has not disclosed terms of the arrangement. No matter the terms, the issue has outsized importance for Trump, who last year repeatedly said he would block the deal and foreign ownership of US Steel, as did former president Joe Biden. Trump promised during the election campaign to make the revitalisation of American manufacturing a priority of his second term in office. The fate of US Steel, once the world’s largest corporation, could become a political liability in the midterm elections for his Republican Party in the swing state of Pennsylvania and other battleground states dependent on industrial manufacturing. Trump has said he wouldn’t approve the deal if US Steel did not remain under American control and keep its headquarters in Pittsburgh.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/popyrin-advances-at-roland-garros-20250531-p5m3r9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Popyrin advances at Roland-Garros",
    "publish_date": "Sat, 31 May 2025 09:04:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Popyrin advances at Roland-Garros\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/loretta-swit-who-played-hot-lips-houlihan-in-m-a-s-h-dead-at-87-20250531-p5m3r4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Loretta Swit, who played ‘Hot Lips’ Houlihan in M.A.S.H., dead at 87",
    "publish_date": "Sat, 31 May 2025 08:46:28 +1000",
    "category": "entertainment",
    "authors": [
      "Mark Kennedy"
    ],
    "text": "The growing awareness of feminism in the ’70s spurred Houlihan’s transformation from caricature to real person, but a lot of the change was due to Swit’s influence on the scriptwriters. “Around the second or third year I decided to try to play her as a real person, in an intelligent fashion, even if it meant hurting the jokes,” Swit told Suzy Kalter, author of The Complete Book of ‘M.A.S.H.’ Loretta Swit in Los Angeles in 1983. Credit: AP “To oversimplify it, I took each traumatic change that happened in her life and kept it. I didn’t go into the next episode as if it were a different character in a different play. She was a character in constant flux; she never stopped developing.” M.A.S.H. wasn’t an instant hit. It finished its first season in 46th place, out of 75 network TV series, but it nabbed nine Emmy nominations. It was rewarded with a better time slot for its sophomore season, paired on Saturday nights with All in the Family, then TV’s highest-rated show. At the 1974 Emmys, it was crowned best comedy, with Alda winning as best comedy actor.\n\nThe series also survived despite cast churn. In addition to Swit and Alda, the first season featured Wayne Rogers, McLean Stevenson, Larry Linville and Gary Burghoff. Harry Morgan, Mike Farrell and David Ogden Stiers would later be added, while Jamie Farr and William Christopher had expanded roles. Loading “Loretta Swit’s portrayal of Margaret ‘Hot Lips’ Houlihan was groundbreaking – bringing heart, humour, and strength to one of television comedy’s most enduring roles. Her talent extended well beyond that iconic character, with acclaimed work on both stage and screen that showcased her intelligence, versatility, and passion,” National Comedy Centre executive director Journey Gunderson said in a statement. ‘More of a real person’ Swit appeared in all but 11 episodes of the series, nearly four times longer than the Korean War itself, exploring issues like PTSD, sexism and racism. Swit pushed for a better representation for women.\n\n“One of the things I liked, with Loretta’s prodding, was every time I had a chance to write for her character, we’d get away from the Hot Lips angle and find out more about who Margaret was. She became more of a real person,” Alda told The Hollywood Reporter in 2018. The series ended on a happy note for Houlihan, who spends much of the finale debating whether she wants to head to Tokyo or Belgium for her next overseas post. Ultimately, she opts to return to America and work at a hospital, citing her father – a career Army man. Loading Swit didn’t personally agree that was the correct decision for a military-minded official: “I didn’t think that was correct for my Margaret,” she told Yahoo Entertainment in 2023. “I think her next move was Vietnam. So I didn’t agree with that, but that’s what they wanted her to do.” But the actor did get to write the speech that Houlihan delivers to her fellow nurses on their final night together, in which she says: “It’s been an honour and privilege to have worked with you. And I’m very, very proud to have known you.”\n\n“I was consumed with writing that. And I still get letters from women all over the world who became nurses because of Margaret Houlihan. To have contributed to someone’s life like that is remarkable,” she told Yahoo Entertainment. During her run, Houlihan had an affair with Hawkeye’s foil, the bumbling Frank Burns, played by Linville in the TV version, and in season five, Houlihan returns from a stay in Tokyo engaged to a handsome lieutenant colonel, a storyline that Swit says she advocated for with the writers. “I told them: ‘Can you imagine what fun you’re going to have with Larry when I come back to town and I tell him I’m engaged? He’ll rip the doors off of the mess tent!’ And that’s exactly what they had him do. So we were all of the same mind.” Towards the end, Swit was tempted to leave the show. She played the role of Chris Cagney in a 1981 television movie, Cagney & Lacey, and was offered the part when it was picked up as a mid-season series for the spring of 1982. But producers insisted she stay with M.A.S.H. for its last two seasons. Swit told The Florida Times-Union in 2010 she might have stayed with M.A.S.H. anyway. “You can’t help but get better as an actor working with scripts like that,” she said.\n\n“If you’re in something that literate, well, we got spoiled.” Loading In 2022, James Poniewozik, The New York Times′ chief television critic, looked back on the show and said it held up well: “Its blend of madcap comedy and pitch-dark drama – the laughs amplifying the serious stakes, and vice versa – is recognisable in today’s dramedies, from Better Things to Barry, that work in the DMZ between laughter and sadness.” After the TV series, Swit became a vocal animal welfare activist, selling SwitHeart perfume and her memoir through her official website, with proceeds benefiting various animal-related non-profit groups. In 1983, she married actor Dennis Holahan, whom she’d met when he was a guest star on M.A.S.H. They divorced in 1995.\n\nA migrants’ daughter Born in Passaic, New Jersey, the daughter of Polish immigrants, Swit enrolled in the American Academy of Dramatic Arts, then paid her dues for years in touring productions. In 1969, she arrived in Hollywood and was soon seen in series such as Gunsmoke, Hawaii Five-O, Mission Impossible and Bonanza. Then in 1972, she got her big break when she was asked to audition for the role of “Hot Lips”. She would regularly return to theatre, starring on Broadway in 1975 in Same Time, Next Year and The Mystery of Edwin Drood in 1986. She was in Amorous Crossing, a romantic comedy, at Alhambra Theatre & Dining in 2010 and in North Carolina Theatre’s production of Mame in 2003. AP",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/lifestyle/steph-claire-smith-says-she-is-in-awe-of-her-body-after-giving-birth-to-second-child-20250531-p5m3qx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Steph Claire Smith says she is ‘in awe’ of her body after giving birth to second child",
    "publish_date": "Sat, 31 May 2025 07:55:31 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Steph Claire Smith says she is ‘in awe’ of her body after giving birth to second child\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/world/north-america/a-black-eye-and-a-gold-key-musk-s-subdued-farewell-from-trump-s-white-house-20250531-p5m3ql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A black eye and a gold key: Musk’s subdued farewell from Trump’s White House",
    "publish_date": "Sat, 31 May 2025 07:43:33 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "Washington: If Elon Musk’s headline-grabbing stint in the Trump administration straddled ecstatic highs and horrific lows, his farewell was more like a Buddhist on Valium.\n\nCameras were invited into the Oval Office to watch US President Donald Trump deliver lengthy remarks praising Musk and the Department of Government Efficiency, the cost-cutting razor gang he led during his 130-day tenure as a special government employee.\n\nUS President Donald Trump presents billionaire Tesla chief Elon Musk with a “golden key to the White House” as he leaves the administration. Credit: AP\n\n“He does love our country, I know that very much,” Trump said of the world’s richest man, and presented him with a golden key to the White House. “He’s all about the USA. Americans owe him a great debt of gratitude.”\n\nMusk cut a dark figure in a black suit, black T-shirt bearing the words “The Dogefather” and a signature black cap, this one marked with “DOGE”. He also sported a slight bruise on his right eye, apparently the result of a play-fight with his young son, X.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/disgraceful-missed-call-completely-changes-competition-20250531-p5m3qr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disgraceful' missed call 'completely changes' competition",
    "publish_date": "Sat, 31 May 2025 06:56:23 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disgraceful' missed call 'completely changes' competition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/doctors-warning-to-aussies-amid-staggering-rise-in-flu-cases-never-been-so-sick-074807802.html",
    "title": "Doctor's warning to Aussies amid staggering rise in flu cases: 'Never been so sick'",
    "publish_date": "2025-05-30T07:48:07Z",
    "category": "finance",
    "authors": [],
    "text": "Just weeks after getting her vaccination, Mikaela, from Sydney, was struck down by the worse flu she's ever experienced. Source: Supplied\n\nAs temperatures began to drop last month, a young Sydney woman rolled up a sleeve for her annual flu vaccination. Hoping to dodge the contagious illness as cases spike around the country, Mikaela could never have predicted the battle she was soon going to endure.\n\nJust weeks later, she was struck down by influenza, and despite having had the flu several times before, this would prove to be by far the worst. “It was actually quite shocking how bad it was,” the 23-year-old told Yahoo News. “I’ve never been sick like that before.”\n\nAfter falling ill, Mikaela developed a “painful dry cough” that triggered an acute asthma flare-up.\n\n“I don’t usually suffer from asthma — it’s more of an underlying condition for me — so that was quite scary. I also had congestion, really bad sinus pain, and terrible fatigue. One day I slept for 14 hours straight,” she said.\n\nADVERTISEMENT\n\nThe junior graphic designer was “so unwell” she was forced to take a week of sick leave from her first full-time job.\n\nSick Aussie forced to wait days for doctor's appointment\n\nDesperate to relieve her symptoms, Mikaela booked an appointment with her GP, but the only spot available was days away.\n\n“I was just trying to hold out at home until then, but it feels pretty awful when you’re unwell and you just want to be seen so you can get the prescriptions you need, and you have to wait three additional days,” she told Yahoo, noting her GP doesn’t offer Telehealth services.\n\n“I feel like that is really indicative of how busy they are at the moment.”\n\nAfter being forced to trek from her home in Newtown to Sydney’s CDB via two busses, the 23-year-old was given some “pretty heavy duty” medications , including codeine cough syrup and a steroid inhaler.\n\nADVERTISEMENT\n\n“I’ve been sick for three weeks now. I’m at the tail end of it but even three weeks out, I’m still battling symptoms,” she said.\n\nAussies are being urged to get a flu jab and Covid vaccine. Source: NewsWire/Adam Yip\n\nAussies urged to get vaccinated amid surge in flu cases\n\nAustralia is in the midst of an intense and early flu season. While Sunday marks the official start of winter, the National Notifiable Diseases Surveillance System (NNDSS) has already tracked over 92,000 lab-confirmed influenza cases nationally.\n\nTelehealth platform Updoc has seen a 134 per cent increase in flu-like consultation requests in May, 2025 compared to May, 2024. Concerningly, the surge appears to be plaguing the country’s most vulnerable age group — those over the age of 65. Geographically, every state and territory has recorded at least a 100 per cent increase in appointments.\n\nADVERTISEMENT\n\n“Post-Covid, seasonal flu is resurging aggressively due to low community immunity and delayed vaccine uptake,” Dr Jamie Phillips, Updoc’s Chief Medical Officer, told Yahoo. “As a doctor who works in an emergency department in Queensland, over the last few weeks I’ve seen an increasing number of patients presenting to our ED with flu-like symptoms.\n\n“Often my patients tell me they have come to ED as they are struggling to access their usual GP, they don’t have a regular GP or have been advised that they can’t be seen due to having respiratory symptoms.” Influenza is not a benign illness — early intervention reduces time off work and saves lives, he added.\n\nA new Covid-19 subvariant is spreading in Australia. Source: NewsWire/Nicholas Eagar\n\nEarlier this month Professor Patrick Reading, Director of the WHO Collaborating Centre for Reference and Research on Influenza, said that while the increased cases this time of year is considered unusual, it highlights just how unpredictable the flu can be.\n\n“Despite the increased influenza activity, we can’t currently predict the severity of the upcoming season in Australia,” Reading said. “This will be dependent on a range of factors, which virus subtype becomes dominant or which strain becomes dominant.”\n\nADVERTISEMENT\n\nEarly infections may not be as a result of changes to the influenza virus, he argued, but may be influenced by behavioural changes such increased travel and declining vaccination rates.\n\nInfluenza A and B viruses are responsible for most seasonal flu outbreaks, but each year sees a different mix of subtypes, making the virus difficult to predict and control. Aussies have been urged to get the flu jab to protect themselves, especially those considered at high risk including young children, the elderly, pregnant women and Aboriginal and Torres Strait Islanders.\n\nNew Covid strain on the rise\n\nMeanwhile, a new Covid-19 subvariant, NB. 1.8.1, is beginning to take hold in Victoria, NSW and Western Australia, sparking concern among health authorities as Australia heads into the winter months.\n\nAccording to the latest NSW Respiratory Surveillance Report, Covid-19 and influenza activity remain low overall, but early signs point to a gradual increase in Covid-19 infections, with test positivity rising to 5.7 per cent in the week ending May 17.\n\nWhile the subvariant does not appear to cause more severe illness than earlier strains, its rapid growth is raising flags both locally and internationally.\n\nWith NCA NewsWire\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 39
  },
  {
    "url": "https://au.news.yahoo.com/new-rule-change-legalises-common-pet-act-in-graveyards-happens-all-the-time-070625801.html",
    "title": "New rule change legalises common pet act in graveyards: ‘Happens all the time’",
    "publish_date": "2025-05-30T07:06:25Z",
    "category": "finance",
    "authors": [],
    "text": "Funeral directors will no longer need to break the law to fulfil a pet owner's wishes.\n\nA change to the law in NSW will allow pets to be buried with their owners. Source: Getty\n\nAn Australian state has passed a new law this week that will allow pets to be buried with their owners. NSW will become the first state to permit companion animals to be interred in cemeteries, but campaigners are hoping others will now follow.\n\nWhen companion animals die, they are routinely buried with their owners, it has to be done in secrecy. Debra Tranter, who founded dog advocacy charity Oscar’s Law and also runs a small cemetery in Victoria, said the problem is increasingly common.\n\n“There’s a strong bond between us and our pets. And laws need to reflect community expectations,” she told Yahoo News.\n\n“Funeral directors are breaking the law every day in Australia by sneaking in ashes, or quietly contacting cemeteries about digging a hole to bury a dog. It happens all the time, because it’s what people want.”\n\nCelebration as 'important' rule change approved\n\nThe change to the law was introduced by NSW Animal Justice Party MP Emma Hurst, and passed in NSW Parliament on Thursday night unopposed. She celebrated the win on Friday by saying, “Families come in all shapes, sizes and species”.\n\nADVERTISEMENT\n\nSpeaking later with Yahoo News, she said the change was “extremely important”. “To many people it may not necessarily feel like a major change, but for those who are in that situation, it is life-changing,” she said.\n\nShe said it had been wrong to criminalise the act of burying pets in family plots. And noted her colleague Georgie Purcell has been working to introduce similar laws in Victoria.\n\n“People who run cemeteries were risking breaking the law… and they shouldn't be in a position where they have to do that when they’re trying to respect a family’s wishes,” she said.\n\nEmma Hurst celebrated the change on social media on Friday. Source: Getty/Emma Hurst\n\nHeartbreaking incident sparks rule change\n\nIt was Debra’s personal experience working with bereaved families that led to the introduction of the law. One particular incident sticks in her mind, the day an old man in his 80s asked for his dog to be buried alongside his wife who had died 15 years ago.\n\nADVERTISEMENT\n\n“They were never able to have children, but they had this old dog called Molly. When Molly died, this dear old man turned up at the cemetery gates with her wrapped in a shroud, asking me to open the grave of his wife so he could put Molly in,” she said.\n\n“I'm not going to say no to that. He was incredibly distraught, nearly in tears, and so we decided to meet his wishes. We opened up that grave, buried his dog, and had a little ceremony. But it struck me that it was such a beautiful, poignant moment, but we had to all keep it a secret, because we were actually breaking the law.”\n\nLegally, burials have to be recorded on a register with information including where the body is located, how deep it is, and whether there’s enough room for another internment.\n\nThe rules are in place to ensure when graves are opened up for new family members to be interred, the bodies aren’t dug into. But because burying pets has been illegal, the location of their bodies couldn’t be recorded.\n\nADVERTISEMENT\n\n“We can now legally record it in NSW, and when we reopen graves, we won’t be accidentally digging through people’s pets,” Debra said.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 40
  }
]